{"fingerprint": "We0THucUaqGC1/SsyixM4yPshp8=", "sitename": "Clarkesworld Magazine", "title": "The Power is Out by A Que, translated by Elizabeth Hanlon", "author": "A Que; Elizabeth Hanlon", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/a_02_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Power is Out by A Que, translated by Elizabeth Hanlon", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "12210 words, novelette\n The Power is Out\n 1\n “Let’s go south,” Zhang Handsome suddenly said to us one day.\n We were out walking in the twilight, ambling about, idle and listless. Several stray birds careened blindly between the high-rises. Zhao Fortune watched them and licked his lips: “I haven’t tasted meat in a long time. Let’s shoot those birds down and eat them.”\n Beside him, Chen Beauty furrowed her decidedly unbeautiful brow and said, “Brother Fortune, no. How could you eat those little birdies?” The rest of us also voiced our disapproval of his suggestion.\n Fortune gazed absently up at the birds. “I remember when I was a boy—that was before the Trip—I used to eat this kind of bird cooked over a fire. Small as they are, the meat is plentiful and tender. When roasted, grease drips from the meat onto the ground, and sizzles in the mud. Catch it in your mouth, and it sizzles in your heart.”\n He looked back at us over his shoulder. “Are you going to help or not?”\n We picked up stones off the ground and threw them at the birds. Of the five of us, Fortune and I were the strongest. Handsome was lean and gaunt, but he could throw stones as high as seven or eight stories. Beauty and Wang Innocence only caused a commotion. Their stones did not ruffle a single feather on any of the birds, and their incessant shouting made the people upstairs open their windows. They poked their heads out, like mushrooms, and regarded us curiously.\n As our stones grazed the birds, they flapped their wings furiously. Already disoriented by the geomagnetic storm, and now hounded by us, their panic grew, and they crashed into each other as they flew away. We tore through the rundown streets in hot pursuit.\n I guessed that the perpetual geomagnetic agitation had played havoc with these birds: as they flew, they kept colliding with walls and glass windows. By chance, several of the birds got away; only one bird, flying straight ahead, could not shake us. After a while we began to flag. The bird, whose wings had been struck several times, was also tired. It landed on a fourth-floor balcony, huddled on its side, and gently preened its injured wings. Its posture as it licked its wounds was extremely graceful, like a gilded sculpture in the setting sun. We stared at it, mesmerized.\n “Maybe we shouldn’t eat it,” suggested Innocence. We all nodded. Even Fortune did not lick his lips, just gazed absently at it, as though remembering the days before the power went out.\n “All right,” he said. “Let it fly away. Its home is the sky. It should spread its wings and return—”\n Before he could finish, an old man rushed out onto the balcony, grabbed the stunned bird, and stuffed it into his mouth. He chewed vigorously, his filthy beard stained with bright red blood.\n Outraged, we shouted and swore at the old man, especially Handsome, who hopped from one foot to the other as he cursed. The old man, picking feathers from his teeth, returned our compliments in a hoarse, raw voice. Old age had imbued his profanity with a marvelous artistic quality. Even Handsome, who had read loads of books, could not surpass him. Fortune snatched up a stone and threw it at the balcony, but the old man hurriedly ducked inside. The five of us stomped up the stairs and did our best to kick the old devil’s door down. However, the alloyed steel security door was far stronger than our feet and our busted shoes, and after ten minutes or so, Fortune let out a yelp, having wrenched his calf.\n The entire time, the old man stood behind the door and inquired after our distant relatives with elegant and polished obscenities, utterly calm and composed.\n As the sky outside began to darken, the hallway grew as still and gloomy as a tomb. We grudgingly abandoned our assault on the security door and helped Fortune down the stairs. The street was filled with figures loitering in groups of three and four. Like us, they ambled about, idle and listless. Fortune limped along, cursing nonstop. The wind rose, carrying a sharp chill, and we tightened our collars against it.\n Tucking her chin against her chest, Innocence said, “Autumn will be over soon.”\n Handsome suddenly jerked his head up. “Yes, autumn will be over, and winter will come. Let’s go south.”\n I grew excited. South, a word at once so strange, and yet so familiar. Since the power went out, I had lived in this northern city for so many years that I’d forgotten what my hometown looked like. I thought of the birds’ sudden appearance and realized that they were likely headed south for the winter, too. Even though the geomagnetic storm had muddled their sense of direction, the desire in their genes for warmth still guided them.\n Fortune hesitated for a moment. “Go south and do what?” he asked. “Who knows what the situation there is like? It could be even more chaotic than here.”\n “Not necessarily,” said Beauty. “Southerners have mild tempers, unlike you northerners. After the power went out, I bet everyone came together like one big family to tide over the difficulties.”\n “Beauty, ah, Beauty,” Fortune sneered. “Do you believe your own words?”\n Beauty turned to look at me. “Mediocre, why aren’t you saying anything? Tell us, are southerners kinder than northerners? I recall your family’s from the south. Is it true if someone strikes you, you won’t hit back? If someone slaps you on the left cheek, you offer up your right cheek?”\n “Screw you,” I said. “If someone tries that with me, I’ll sit my ass cheeks on their face.”\n As we argued, Innocence kept her head lowered. Her wispy bangs hung over her face.\n Handsome broke in: “Listen to me—Mediocre, let go of Beauty’s hair—winter is coming, and I’ve been watching the weather. The Siberian High is descending toward us, and cold winds are sweeping in from the Pacific. I’m afraid temperatures may reach thirty below zero this winter. The heat’s gone, and we’ve run out of things to burn. We can’t endure that kind of weather. Let’s go south.”\n “Handsome, quit lying to us,” said Fortune. “Don’t think I won’t hit you because you’re good-looking.”\n “You can believe it or not, I don’t care—ouch, don’t hit me! Mediocre, stop him!”\n I hastily turned to Fortune. “Handsome has read a lot of books, and he is bursting with knowledge. He knows Hooke’s Law and the Newton-Leibniz formula. What he said is probably true.”\n Handsome and Fortune have never gotten along. Even before the Trip, the rich scorned young fair faces, and handsome young men despised unscrupulous businessmen. In the years since the power went out and the five of us took up together, they would have killed each other if I hadn’t smoothed things over between them.\n Fortune leaned against the wall and looked into the distance, where darkness was seeping in. “Truly that cold?” he asked. “But, these last few years, haven’t we always made it through?”\n “A few degrees below zero is tolerable, but thirty below is not,” I said. “Even if we ate our fill of bread every day, we couldn’t withstand the cold.”\n Beauty and Innocence wore worried expressions.\n Suddenly, a gleam appeared in Fortune’s eyes. “Very well,” he said, “we’ll go south!”\n I knew Zhao Fortune long before the Trip. Back then, he was not yet called Fortune, and instead went by a name frequently published in business journals. Oh, that’s right—he was my boss at a promising startup located in the city’s central business district. Every morning, he sipped a cup of coffee and peered through the window blinds at the ant-like crowds below. Sometimes he called me over, lit a cigarette, and pointed to the bustling suits.\n “People,” he told me, shrouded in a cloud of smoke, “have to have money.”\n Before Fortune had money, I was already firmly in his camp. I watched him grow from a diffident youth who cheated investors in coffee shops, into a paunchy middle-aged man with great clout in business circles. The intervening years were filled with twists and turns. Several times, the company teetered on the edge of bankruptcy, and in its darkest hour, only he and I remained. In fact, I was just lazy, and planned to wait until I was well and truly unemployed to find another job. But Fortune was extremely grateful, and said he would never forget me. If he had anything to eat, I would not go hungry. He brought me along everywhere—where he went, I went. Later, when things turned around, he did not break his promise. He gave me a stake in the company and paid me annual dividends, and the figures in my bank account grew larger than I dared believe.\n Then, without warning, a strong pulse of electromagnetic radiation from outer space swept across the globe and did not disperse. All electronic equipment was damaged beyond repair.\n The world had tripped a switch.\n Our money, alongside a vast sea of data, vanished. Our savings were gone. Our high-performing stocks were gone. The connections we had cultivated over many years were gone. I was devastated by the loss, but Fortune stayed true to his name. While everyone else passed through the stages of waiting, restlessness, rioting, despair, and numbness, he began to quietly stockpile food and water. He cleaned out several supermarkets, hauled the goods off to who knows where, and then waited. He often described to me how he had managed it:\n “Fuck,” he said, “the noise outside was awful. Smashing, and killing. I hid in the sewers. Blood dripped down, and I could taste the salt on my hands. For just a small bag of stale bread, they were ready to stab each other. But I wasn’t scared. I knew the things I’d hidden would save my life later. Lying in the middle of all that food, my heart was at ease, and I even fell asleep. When I woke up, I climbed up to the street, and there were bodies fucking everywhere.”\n I didn’t admire Fortune’s daring—after all, I too survived the riots. What I admired was his foresight. In civilized times, this man was able to predict the movement of wealth; after the world lapsed back into barbarism, he was able to quickly swap hats and divine changes in the fabric of society. By comparison, I was just one face among the masses on the street. When others waited, I waited. When others rioted, I rioted. When others grew numb, I grew numb. Therefore, I was called Li Mediocre.\n Later, while Innocence and I were wandering idly through the streets, we ran into Fortune, who was similarly occupied. He recognized me, and the three of us began to walk together to look for food. When our hunger truly became unbearable, he would tell us to wait, disappear for a short while, and return with bottles of water and bread in hand. Watching us wolf down the bread, he’d sigh and say, “People have to have money.” When we finished eating, he would take back the plastic bread bags. After Beauty and Handsome joined us, Fortune continued to provide this timely relief—somewhere he had built a great treasury filled with water and food. Because of this, he was conferred the highest status within our little group.\n Having agreed to go south, we split up to pack our things, but Fortune called me back.\n “Come with me,” he said.\n Together, Fortune and I walked through the city streets, surrounded by darkness. Once this kind of behavior was very dangerous, as someone crazed with hunger was liable to come rushing out onto the street at any time. But now, many small gangs had formed and held each other in check, and a short peace had been established. At night people rested, and saved fighting for the daytime. As we walked, the stars gradually came into view.\n Fortune led me to every nook and corner on the block. He had hidden tightly tied black plastic bags beneath floorboards, behind ruined walls, even in trees. He pulled the bags from their hiding places and tossed them to me. As I caught them, I could feel the food inside through the plastic.\n Finally, carrying a dozen plastic bags each on our backs, we came to a subway station. The station’s entrance was overgrown with weeds and branches, like arms sticking out of a grave, waving gleefully. Yes, since the Trip, no one had suffered more than humanity, and no one was happier than the plants. Humans had once driven them out, but after the electricity was gone, they swept back in, encircling the city from the countryside.\n We pushed aside the brush and made our way down the corroded escalator, the starlight fading away behind us. It grew so dark that I could not see my hand in front of my face. Suddenly, a circle of light appeared in front of me, which, though dim, allowed me to see the path ahead.\n “Keep up,” said Fortune, without halting his steps.\n I saw then that the light came from a match in his hand. “When did you squirrel that away?” I asked excitedly. I hadn’t seen artificial light in many years. “Fortune, you’re really very handy.”\n “Bah,” Fortune said as he walked. “The day the power goes out, light, food, and water are the things people want most for. While all of you were foolishly waiting for everything to go back to normal, I was getting ready.”\n The flame flickered and danced on the tiny matchstick. Bathed in its faint halo, I felt as though we were being towed along by a dying, luminescent jellyfish, drifting slowly into the depths of the sea. A train was stopped at the tunnel entrance. Its doors had been prized open, and the interior was in shambles. Clearly, the train had pulled into the station at the exact moment of the Trip, and the passengers inside had forced open the doors to escape.\n When the match went out, Fortune lit another.\n “Don’t go in,” he instructed. He led me past the train, jumped down onto the track, and followed the rails into the tunnel. As the light moved across the huge metal car beside us, it illuminated its dull, mottled surface, like the rotted carcass of a whale. Trembling with fright, I followed the tracks deeper and deeper. I’m not sure how long we walked before Fortune stopped. He pointed to a small metal door in the subway tunnel and said, “Stick those in there.”\n Originally, the room behind the door had been used to store subway inspection equipment, but now it was crammed with bulging plastic bread bags. After we wedged the plastic bags inside, Fortune shut the door and breathed a sigh of relief. “Let’s go,” he said. “We’ve got another trip to make.”\n Fortune had hidden parcels of food all around the city, to be used as lifelines in case of emergency. That night I helped him make five or six runs in total. Around midnight, I told him I was tired and wanted to go home to rest.\n “That’s fine.” Fortune nodded at me. Then he added, “Don’t tell the others about this place.”\n “Why did you come to me for help?” I asked.\n “You’re my employee,” he said. “Don’t worry, I’m going to take you south with me.”\n Before I left, he tossed me a plastic bag for my breakfast the next day. In fact, I had not eaten breakfast in a long time. Every morning I was woken by hunger. My body had grown used to it, but my stomach began to protest. At the thought of waking up tomorrow morning to bread and fresh water, my heart was filled with indescribable contentment. I tucked the bag into my clothing, pulled my collar tight, and hurried out of the subway in the direction of home.\n The dilapidated high-rises were hidden in darkness, their vague outlines just visible in the starlight. Back when there was electricity, their interiors used to blaze with light. Every window was a tiny cell, and the elevators, like blood vessels, carried people up and down in a ceaseless flow. Many people had worked their entire lives for a single cramped room in one of these buildings. But now, in the wake of the Trip, these glittering giants were dying. Rooms that had once cost an arm and a leg now reeked of feces and dead bodies.\n Suddenly, I heard the patter of footsteps behind me.\n “Who’s there?” I asked, turning. Thinking it was Fortune checking up on me, I added, “I won’t say a word to the others about—” In the faint starlight, a face appeared on the other side of the street. I squinted at it. “Eh, Innocence?”\n The face was delicate and beautiful. Bathed in starlight, its features seemed to melt together. This was Wang Innocence—sometimes you could not even discern her appearance, but the sight of her left you with the impression of purity. You would remember her, and be able to recognize her from across the street.\n We walked slowly through the streets together. We often used to stroll together like this, searching for something to eat. Afterward, we would idle away the remainder of the day. Walking became our most frequent pastime. She’d tell me things about her career as an actress, and I’d complain about my workplace and Zhao Fortune. Occasionally, she and I made love. But after Fortune joined us, she showed a clear preference for him. Later, when Handsome arrived, she became close with him for a time. In short, of the five of us, I was the loneliest.\n But now, we walked back at an unhurried pace, as though time had been rewound. With her head lowered, she told me that she was nervous about going south. She was a northern girl, and had never seen the southern sun. Unable to sleep, she had gone for a walk and seen me.\n “It’s late,” I said. “Let’s go to my place.”\n 2\n I know you must be anxious to hear what happened after Innocence and I went home. To tell the truth, I was even more anxious than you. I hadn’t had sex in ages, and I felt as though a rat were squeaking and scurrying in my gut. But as a responsible narrator, before I get to that part, I think I need to tell you about my history with Innocence.\n Wang Innocence studied acting. After graduation, she auditioned everywhere for film and television roles.\n Let me tell you, every last person in the movie business was a rotten scoundrel. They gathered together and eyed Innocence like a pack of wolves. Back then she didn’t understand the meaning in their stares, and she was cut from audition after audition. For three years, she bounced back and forth between the major studios and fly-by-night production companies. The girls who had graduated alongside her had all either made successful debuts, or had changed professions. Only she kept at it. Finally, she won a bit part in a low-budget film.\n Unexpectedly, the film turned out to be pretty good, and earned several awards before its release. Sensing an opportunity to net big rewards at little cost, the producers shelled out to hire a marketing firm. Posters with Innocence’s face on them plastered bus stops in every major city. The firm also arranged a promotional tour. The first stop was a coastal city in the south. As it was her first trip to the south, Innocence was so excited that she arrived at the airport hours before her flight, and had to wait for her fellow cast and crew members.\n Suddenly, all the lights in the terminal went out with a loud bang. Before she could react, a plane that had been just about to land slammed straight into the tarmac, sending flames high into the air. Her face remained blank.\n As if someone had flipped a switch, all around the world the power went out.\n At first, everyone waited, in a daze, for the lights to turn back on, for their cars to start up again, for their cell phones to ring. But the waiting dragged on without end. Then people began to realize that the blackout might last forever.\n My coworker Guo Melancholy—melancholy no longer—said cheerfully, “It’s just as well. Our civilization was advancing too quickly. This power outage is a rare opportunity. We can stop and reflect on where we want to go.”\n I think, in the end, he might have thought differently. Two days later, as he sat sunning himself on a curb, a child smashed his head in with a rock. His prognosis for the world was nowhere near as accurate as Fortune’s. He had no idea that once the power went out, civilization would not stop to rest, but rapidly regress.\n First, people went mad. Their stocks, savings, and networks had been thoroughly purged. While vagrants could still lounge in the sun beneath overpasses, the city’s white-collar workers had lost their entire world. Then people died. Citizens formed small gangs to rob houses, snatching up everything they could eat, drink, or use as a weapon. During the worst of the madness, whenever someone showed his face on the street, a mob would immediately swarm him from all sides, stone him to death with bricks, and loot the body. Then, they would hide by the side of the road and wait for the next unlucky wretch to pass.\n To protect myself, I joined forces with seven or eight other men with view to waylaying strangers in a copycat fashion. We were an utterly vicious bunch: each one of us claimed to have taken several lives with our own hands. Chen Bashful said he had killed three people, Yang Affable said he’d killed at least seven, so I hurriedly said I’d killed twenty-one.\n We stationed ourselves at an entrance to the subway, with the intention of dragging every solitary person who passed by into the station and beating them to death. But the first to approach was a fierce, hulking man with blood still on his clothes. We surged forward, saw the man’s bulging muscles, and scrambled back again. The man laughed contemptuously and strode away.\n “Shit, that won’t do!” I told Bashful. “We can’t chicken out again. We have strength in numbers. We have to be merciless!”\n Bashful nodded hastily and said, “Right, just now we weren’t ready. Whoever comes next, see if I don’t bash him to bits!”\n After we steeled our nerves, we positioned ourselves in a tight arc at the mouth of the station. Even if that huge man came back, I felt confident that we could encircle and overwhelm him.\n Soon, we heard the sound of footsteps again. We grew feverish with excitement. When the footsteps reached the station entrance, we rushed out all at once. Then, we stopped short.\n It was Wang Innocence.\n I remember it was early evening. The slanting rays of the setting sun tinged the decaying city with red. Our shadows stretched long across the ground. Innocence stood surrounded, panic on her face.\n We, however, were even more panicked. I had not seen such a pure face in a long time. Even the hard metallic light of sunset could not lend sharpness to her features. She cringed away from us, her hair in her eyes, shoulders hunched like a hamster. And her hair!—after so long without power, most people had tangled hair and dirty faces, but her hair was jet-black and lustrous, like a swath of ink-dyed silk. Looking at the birds’ nests that crowned our own heads, we couldn’t help but feel ashamed.\n The first to turn traitor was Bashful. His gaze swept right past Innocence, and he called out to Affable behind her: “Goodness, Affable. What a coincidence to see you here!”\n Affable tossed the brick in his hand to the side. “Bashful, we’re fated to meet. I see you wherever I go. Let’s go eat barbecue.”\n The others, returning to their senses, hailed each other over Innocence’s head. In groups of twos and threes, they set off companionably in every direction. I later found out that these self-proclaimed vicious brutes had previously worked in programming. Little wonder that a group of coders lost their will to fight as soon as they laid eyes on Innocence!\n As they rushed in from all directions, froze, and then scattered, Innocence looked on as though she were invisible. Finally, only she and I were left standing in the half-light of the street. Still recovering from my panic, I glanced left and right in the evening breeze, half of a brick in my hand. She walked over to me and said, “I’m hungry. Do you have anything to eat?”\n I dropped the brick and clapped my hands. “It’s late,” I said. “Let’s go to my place.”\n Just like that, Innocence and I took up together. We shared what little food we had, dodged crazed strangers, and watched the city rust bit by bit.\n As time wore on, the deaths mounted, and everyone grew tired of fighting. With several large gangs threatening retaliation against each other, there was no more indiscriminate violence. But because everyone wanted to restore order, order was never restored. People began to take to the streets, ambling about, idle and listless.\n In telling you how I met Innocence, I have no esoteric objective. I just wanted to explain that she’s good-looking, lest you think I’m tricking you. Think about it. Why would I trick you? I’m going south. Someone who intends to go south wouldn’t lie. Now that you know Innocence is beautiful, I’ll continue where I left off. This will make my story more romantic. You see, my objective has always been that simple.\n Early the next morning, after we got out of bed, Innocence and I ate the breakfast Fortune had given me. After we’d eaten, we discussed going south. Innocence asked me what it was like.\n “Even if you’ve never been to the south, you never saw it on TV?” I asked her.\n She hesitated for a moment. “Yes, but the power’s been out for so many years that I’ve forgotten. Do you still remember it?”\n Her question stunned me. I had no memory of the south either.\n “Southerners eat from bowls, not plates,” I said, wracking my brain. “It’s warm there, and in the winter flowers blossom by the roadside.”\n Delighted, Innocence paced back and forth. “That’s wonderful,” she said. “I can’t wait to go.”\n “But we have to wait for Fortune to get everything ready. After all, without his food, we’ll have a difficult time on the long journey south.”\n We waited around until evening. As the sun sank toward the horizon, filling the sky with a mournful glow, I caught the golden gleam of a lake in the distance.\n “Shall we play ducks and drakes?” I asked.\n Innocence and I went to a nearby store, pushed open the door, and carried stacks of cell phones, still in their boxes, from the storeroom down to the shore. We sat down, stripped off the packaging, and took out Apple’s thinnest iPhones to date. With a flick of the wrist, the iPhones went skipping across the surface of the lake.\n She and I discovered this way of passing the time by accident. While we were searching for food, we discovered a mobile phone retail store in our neighborhood. Though it was abandoned, the storeroom was still neatly stacked with phones. These costly electronics weren’t worth a cent in an age without electricity, but we developed a new use for them—ducks and drakes. Truly, cell phones make for extremely smooth skipping. No matter how you throw them, they’re guaranteed to skip ten, fifteen times. If you don’t believe me, you can take a phone down to the lake and try it for yourself.\n We skipped phones and made conversation in a desultory kind of way. The setting sun was fading fast, and dusk was closing in around us.\n “Mediocre,” Innocence said suddenly, “let’s go south.”\n “Well, yes, we will,” I replied with a nod.\n “I mean, just the two of us.”\n Stunned, I lifted my head and looked at Innocence’s face in the twilight. The last rays of sunset cut across her face from her brow to the corner of her lips, then died. Her face, even shrouded in gloom, was still beautiful beyond comparison. Snapping out of my daze, I asked, “What did you say?”\n She did not answer, just looked at me.\n “But, didn’t we agree to go south with Fortune and the others?”\n “Fortune won’t take us,” said Innocence, “and I don’t like that Chen Beauty.”\n I did not like Beauty either.\n “And Handsome runs his mouth all day long. I’d rather be with you, Mediocre.”\n This was the first time I had heard Innocence say such a thing to me, and the tenderness in her voice suffused the night air. Warmth rose in my stomach. “Okay,” I said. “We’ll go south, just the two of us. That’s my home. We can put down roots there.”\n “Tell me where Fortune hid his food. I’ll get what we need for the road. Then, while it’s still dark, we’ll leave the city and head south,” she said.\n I said I would go ask Fortune for food, but Innocence prevented me. She said her chance of success was much greater, and that I should wait here for her. Therefore, I told her the address. I stayed by the shore and watched her figure dissolve into the night, fading away until it vanished altogether. I threw a cell phone at the dark surface of the lake. I heard the plip plip plip as it skipped across the water, but I could not see the slightest ripple.\n I waited until daybreak, but Innocence did not return.\n 3\n The next day, Fortune packed his things and prepared to leave. Just then, it began to rain heavily. As he watched water sluice down the sides of the buildings, he said worriedly, “I’m afraid this rain may keep up for some time. We can’t go anywhere in this weather.”\n “It’s nothing serious,” said Handsome, his voice anxious. “Brother Fortune, you’ve stockpiled so many things. Surely you kept some rain gear. Get it out and we’ll brave the rain.”\n “Do you think I’m Doraemon?” said Fortune. “Saving everything I get my paws on?”\n “It’s raining too hard,” Beauty chimed in. “If we should catch cold, we have no medicine. We won’t make it. Handsome, you’ll just have to wait a few days.”\n Handsome looked at me, and so did Fortune and Beauty. I glanced around and asked, “Have any of you seen Innocence?”\n They shook their heads.\n “Then let’s wait a few days for her,” I said.\n Thus, we decided to delay our departure until the rain stopped. I went back to my place. These days, the concept of “home” no longer existed—my place of residence was a hidden cellar. Beauty had chosen the lobby of a forty-story office building, and Fortune frequently changed locations, sometimes residing beneath bridges, sometimes in cars. All five of us knew where each other lived. Most of the city’s towering housing complexes had been abandoned, notwithstanding occasional holdouts—homeowners who had paid through the nose for their apartments and could not bear to leave. Despite the lack of water and power and the unbearable stench, they were prepared to defend their apartments to the last.\n I lay in bed, not wanting to do anything, and waited for Innocence to return. Her warmth still lingered in my blanket. I curled inside it, as though surrounded on all sides by her body.\n Suddenly, there was a knock at my door.\n Handsome sidled into the room and sat down on the edge of my bed. I gave him a sidelong glance, but did not get up. After a moment, I heard him say, “Mediocre, are you waiting for Innocence? I’m telling you, she isn’t coming back. Do you think she’s really so pure? That’s only window dressing. With the world in the shape it’s in, no one is pure anymore. Many times I saw her go alone to look for Fortune. Maybe he and Innocence are planning to slip away together and leave us behind.”\n I sat up, remembering the sight of her receding figure, like a pale glow in thick fog. Indeed, I had promised her we would go south together. But compared to Fortune’s actual power, my words meant nothing.\n “And you?” I asked, eyeing Handsome. “Why have you come to find me?”\n “Let’s go together! Mediocre, I’m telling you, we can’t count on Fortune. He is ruthless, an unscrupulous businessman, unreliable. Haven’t you been helping him move food these past few days? Come on, we’ll help ourselves to some of it, and then hop on a couple of bicycles and sneak out of the city at night. With me leading the way, it won’t take long to get to the south.”\n Seeing the eager expression in Handsome’s eyes, I sighed inwardly. I knew the reason he was in such a hurry to go back south.\n Handsome was my university classmate. He had once been pursued by many girls, but the attention only inflated his ego. It was not until the eve of graduation that he met Wu Lovely, a pretty young woman who had just matriculated. Wu Lovely’s loveliness captured Handsome’s heart right away. He gave up his job, returned to school for graduate studies, and waited three years to be with her. He also gifted her with a pair of precious jade bracelets. They bought a house together in a coastal city in the south. They were preparing to get married when Handsome was sent north on business.\n When the world tripped its switch, Handsome and Lovely were in the middle of a long phone call. The geomagnetic storm, like a fierce gale, knocked out the signals connecting the north and the south. At first, Handsome waited patiently for the power to come back on. After all hope of this occurring had been lost, he prepared to go south. But something always got in the way of his plans. During the initial chaos, he’d had to evade roving gangs, which left him badly shaken. After everyone lapsed into idleness, he was kept occupied with the work of gathering food every day.\n In the blackout era, good looks were no longer an advantage. Everyone looked dirty and disheveled anyway. When eye candy gathered dust, no one came to lick it clean. The frail scholar nearly starved to death several times. Handsome was skin and bones when he ran into us. In the end, he managed to scrape by with help from Fortune. But when he begged Fortune for the food supplies that would let him return south to look for Lovely, his appeal was rejected. This was one of the reasons he and Fortune never got along.\n Surely, his current impatience to return south stemmed from his desire to be reunited with Wu Lovely.\n “Ah, Handsome, Handsome, you’re so good-looking. Why can’t you forget one pretty girl?” I said, and sighed.\n Handsome said, “You’ve never seen Lovely. If you had, you’d be just as crazy about her as I am. She is too adorable. She gives everyone she meets the shyest smile.”\n His words made me curious. Before I left school, I never saw Lovely, only heard about her from Handsome. Occasionally he would dig out a faded photograph of a sweet, pure face, but the photograph was blurry, and I never got a good look at it. All his talk of Lovely’s loveliness made me momentarily forget about Innocence.\n “Still,” I added hesitantly, “why are you so impatient? Once the rain stops, Fortune will take his food and go south with us. You’ll see your Lovely soon enough. Actually, has it occurred to you—”\n I paused, leaving the rest of my question unspoken.\n When Handsome grasped my meaning, the color drained from his face. “No, no way. Lovely is so cute that no one would hurt her.”\n After a moment of silence, he resumed his attempt to persuade me. “Fortune won’t take me with him. Things have always been rocky between us. Mediocre, listen to me, even if you want to stick with Fortune, at least help me steal a little food, okay? As long as I have food, I can go alone. I can walk all the way to the south by myself.”\n “If we get caught stealing Fortune’s food, the consequences will be severe. He has killed before.”\n “Has he hidden a lot away?”\n I recalled the sight of the storeroom in the subway, overflowing with food, and nodded. “A lot. Enough to fill several rooms.”\n “Then if we take ten pounds or so, what do you think is the likelihood that we’ll be found out?”\n “Fine. Find a time when Fortune is gone. We’ll steal a little of his food, for your travels.”\n Suddenly, Handsome wavered. “This, ah, this—you see, there’s no way an academic like me can pull off a theft. It’s a violation of the law and society’s cardinal virtues, a pollution of ethics and morality. How about you do it, and I’ll keep watch?”\n Handsome’s lack of courage did not surprise me at all. But once I thought it over, I realized someone so faint of heart would only get in the way, so I nodded in agreement. After that, we had only to wait for Fortune to exit the abandoned subway station. Then, we could act.\n The next day, the rain was still falling. Handsome and I were hungry, so as per usual we went to beg food from Fortune. We braved the elements and walked to his current lodgings. When we reached the opposite side of the street, Handsome said, “You go ahead. If Fortune sees us together, he’ll be suspicious. I’ll wait here for you.”\n Tucking my neck into my collar, I dashed across the rainy street and knocked on Fortune’s door. From inside, I heard movement, and then Fortune’s voice: “Come in!” I pushed open the door and saw that he was lying on top of a woman, both of them echoing moan for moan. A few moments later, they finished, and the woman glanced at me and asked, “Get it while it’s hot?”\n I hastily waved my hand. “Thank you for the kind offer, but my stomach has been troubling me lately.”\n The woman dressed, accepted a bag of bread offered by Fortune, and left at a leisurely pace. Fortune, half-collapsed on the bed, watched her retreating back and sighed. “Wild as hell. Mediocre, take a look. That one’s a prize. Before the Trip, I could only land a woman like that with a designer bag. After the Trip, all it takes is a bag of bread. Right, why’ve you come to see me?”\n “I want some bread.”\n “Perfect timing.” Fortune patted the edge of the bed. “Hop up. You’ve saved me the trouble of putting on clothes again.”\n I closed both eyes. “I’d rather starve to death.”\n He laughed. “I was only pulling your leg!” He opened a drawer, took out a loaf of bread, and tossed it to me. “Make sure you rest up over the next few days,” he urged. “When the rain stops, we’ll go south together.”\n I took the bread and walked outside into the curtain of rain. When I crossed to the other side of the street, I saw that Handsome had a strange look on his face. His head was bowed, and his hand was tightly clenched. I couldn’t tell what he was thinking.\n “What’s wrong?” I asked.\n “I found Lovely’s bracelet,” he said, opening his palm to reveal a simple jade bracelet.\n I gave him a blank look. “How is that possible?” I asked. “Isn’t Lovely in the south?”\n “Yes, but this definitely belongs to her. It was originally one of a pair. This one goes on the right hand. The marbling on the surface, the scratches where it’s been dropped—it’s all exactly the same. Mediocre, I’m not going south anymore. Lovely has come north, and I have to find her.” As Handsome spoke, his face twitched madly.\n I knew what a blow this was to him. He had assumed that Lovely was still in the south. But perhaps she had come north and had been in this city all along. Suddenly, in every street, every alley, every courtyard, every corner, it was possible that he had missed her.\n This wasn’t just alarmist talk. In the past, two people separated by vast distances could ride out on horseback in search of each other; later on, they could contact each other anywhere in the world with just a string of numbers; but now, the distance needed to keep people apart had shrunk from the entire world to a narrow field of vision. Because we lacked permanent residences and wandered aimlessly every day, even if you were just one street apart, you might miss someone forever. Without electricity, the sense of security in relationships provided by the Information Age crumbled instantly.\n But, just maybe . . .\n Handsome took two steps backward, the muscles in his face convulsing. “She must have come to find me,” he muttered. “She walked all the way from the south to the north to find me! She’s here in the city. I have to find her!”\n He staggered back in the direction we had come. In no time at all, he was drenched. He shouted as he ran: “Lovely, Lovely, I’m Handsome!” His voice sounded hoarse and muffled in the rain.\n We searched in the rain for days. Handsome ducked beneath every eave and shouted, “Lovely, Lovely, I’m Handsome!” Before long, his voice grew cracked and ragged. When it rained, people sat on the side of the road, their listlessness unabated. As Handsome moved through their midst, shouting at the top of his voice, they slowly turned their heads to watch him, with bored expressions on their faces.\n Things went on like this for days, but we found no trace of Lovely. One day, we ran into Fortune on the street. “What’s the matter with him?” he asked.\n “He’s searching for his girlfriend Wu Lovely,” I said.\n “I thought his girlfriend was in the south?”\n “Now she’s here in the north, so Handsome needs to find her.”\n “Oh.” Fortune nodded. “No matter, let him search. Let’s talk about the plan to go south. This rain will let up soon.”\n “Let’s talk when the rain stops,” I said, unable to put the thought of Handsome out of my mind. “By the way, do you know where Innocence has gone?”\n Fortune shook his head.\n I caught a flash of something evasive in his eyes: he was definitely keeping something from me. However, given his proclivity for secrecy, I knew I would never drag it out of him, so I turned and left, following the sound of Handsome’s shouting.\n One evening the rain stopped. After days of heavy downpour, the sun could hold back no longer. As soon as the rain let up, it burst forth. A rainbow spanned from one end of the city to the other. Everyone came out into the streets and gazed up at it. Their faces, tinted rose-red, looked a little disoriented.\n I couldn’t recall seeing such a spectacle for many years, and I could not help but be spellbound by it. Just then, Handsome suddenly grabbed me and pointed to a group of people in the street: “Look, it’s Lovely!”\n I looked where he pointed. Sure enough, on the other side of the street stood a large group of people looking up at the rainbow, a woman among them. Her back felt familiar to me.\n She stood between several big, burly men. Her figure was slim and shapely, perky in the front and the back, and she wore very little clothing. To her left was the heavily-tattooed Liu Fierce; to her right, the muscle-bound Zhou Strong. Qian Vulgar stood behind her. Each of the three men had a hand on her. Their hands roved over her as they gazed dreamily at the sunset and the rainbow.\n I finally realized that she was the same woman I had seen in Fortune’s room when I had gone to find him. But she was not at all lovely. The moans she had made in bed were extraordinarily shameless, like a symphony.\n On her right hand was the bracelet Handsome had given her. Her face looked the same as it did in his faded photograph, except that any sweetness it had once possessed had been replaced by pure licentiousness.\n “You found her,” I said. “Go on up to her. Get over there and tell her, ‘Lovely, Lovely, I’m Handsome.’”\n But he just stared into the distance, his fingers trembling, not daring to approach her.\n After that, Handsome went mad.\n 4\n “Do you think Fortune is up to something?” Beauty asked me.\n As she spoke, she moved her face close to mine, so that the fleshy folds that threatened to swallow up her features were visible in perfect detail. The sight was striking. I could see one ripple of fat that spilled from her brow to the corner of her lips. I took a step backward. “What?”\n “Fortune,” she repeated, her tone mysterious. “Just think, why would Fortune want to go south?”\n “Didn’t Handsome already say? When temperatures drop to thirty below zero this winter, none of us will be able to endure it.”\n Beauty snorted. “Do you really buy that? That fool Handsome just wants to go back south to look for his little girlfriend. I don’t believe a word he said!”\n I was stunned. “So you never planned to come south with us?”\n Beauty gave a smug nod. “Fortune has stashed loads of food in the subway. As soon as he leaves, I’ll root it out. I’ll never want for food again.”\n So this was Beauty’s plan all along. I sighed inwardly. Ever since I’d helped Fortune move his food, Innocence, Handsome, and Beauty had come looking for me, one after another. They all sought the trove of food in the subway. It was like a flame glowing black in the darkness, attracting helpless, fluttering moths.\n “You want me to tell you where Fortune hid his food, right?” I shook my head. “I can’t do that. Innocence and Handsome came to me too, but now she’s missing and he’s crazy. What will happen to you?”\n “I’m not like them.”\n Indeed, Beauty was not like Innocence and Handsome. In fact, she wasn’t like any of us. I tried to remember the day I first met Beauty, but a thick fog clouded my memory. I could not recall when she had joined our little group. It was as if one day, we had turned a corner, Beauty had strolled up, and our four person group became five.\n One time, I asked Fortune, “When on earth did Beauty join us?”\n Fortune narrowed his eyes, a rare look of confusion on his face. “I don’t remember either.” After a pause, he added, “However, she’s certainly no ordinary woman.”\n Yes, no one who had survived this long was ordinary. Innocence relied on her face, Fortune on his ingenuity, and I on Fortune. Handsome had narrowly escaped starvation several times. But as for Beauty, a decidedly unbeautiful woman, how did she survive in these predatory end times? While everyone else grew sallow and emaciated due to malnutrition, only she grew fatter by the day. When she walked, her rolls jiggled—a truly loathsome sight, and yet the fact that she had not been beaten to death was a testament to her might.\n “Hell’s bells, why are you just standing there?” said Beauty, giving me a shove. “Take me to where Fortune hid his food. You’ll be gone tomorrow, so leave the food to me.”\n “Why don’t you go ask Fortune?”\n Beauty snorted. “He certainly won’t tell me.”\n “What makes you so sure I’ll tell you?” I asked, my patience wearing thin. “Just because your name is Beauty?”\n Beauty ignored the contempt in my voice. She pressed closer to me. “I know you look down on me. You like Innocence, you know Handsome, you rely on Fortune, and you’ve always hated me. But I have information I can trade you for the location of Fortune’s food.”\n I leaned away from her and laughed. “Tomorrow I’m going south with Fortune, and I’ll depend on him for everything. I can’t think of any information that is worth betraying my boss, the hand that feeds me.”\n “I know where Innocence is,” said Beauty.\n Under cover of darkness, Beauty and I went to the subway station and made our way down the escalator step-by-step.\n Without matches, we were completely immersed in the gloom, like ants toiling along the bottom of an ink bottle. Relying only on the feel of the rough tunnel wall and my memory, I inched toward Fortune’s hidden storeroom. Beauty followed closely behind me.\n My mind flashed back to the first time Fortune led me here: the light from the match pinched between his fingers had illuminated one half of his face, the other half hidden in the darkness. He trusted me so much that he’d even told me the location of his food, and yet here I was, leading the unbeautiful Chen Beauty to rob him of it. But tomorrow I would go south with him, and he’d be none the wiser that the food he’d hidden in the north had been lost. Perhaps we would stay in the south and never come back. At least, that was how I consoled myself.\n As we moved deeper into the subway tunnel, the rough surface of the wall suddenly became smooth. I stopped and tested the wall with my knuckles. A hollow clang answered.\n “Right here,” I said. “Fortune’s food is hidden inside this room.”\n In the darkness, I couldn’t make out Beauty’s expression, but I could hear the pleased surprise in her voice. “Right here? He sure hid it deep enough,” she said. “How do we get the door open?”\n I held the door shut. “Before I open it, tell me where Innocence has gone.”\n Beauty made to pull on the door, but I grabbed her hand. After a long while, she broke the silence. “Innocence left with Fortune. You should ask him about her whereabouts.”\n “Fortune?” I was stunned. “What business did she have with him?”\n “That night, I saw her go into Fortune’s room. I waited a long time, but I never saw her come out. After that, she was gone. Fortune must know where she went.”\n I thought back to the evening Innocence left me waiting by the lake. Her receding figure had vanished with the setting sun. I didn’t realize she had gone to find Fortune, and would not return. Lost in my thoughts, my grip went slack. Beauty withdrew her hand from mine and grabbed the door handle.\n But evidently Fortune had locked the door securely. She gave the handle several sharp tugs, but the door did not budge.\n “Hey, lend me a hand,” she said.\n Still thinking of Innocence, I ignored her. She caught my arm and guided it to the handle. I tried it and felt the door give a little, but it would not open no matter how hard I pulled.\n “Need some help?” said a voice behind me.\n “That would be terrific.” As soon as the words left my mouth, I sensed that something was wrong. I turned around, but could see only darkness behind me.\n Chk.\n A bright flicker grew into a flame, and light pierced the darkness. Fortune’s face appeared, deeply lined, his eyes like a hawk. As he held a match between his fingers, the flame crept along the thin stem. The flickering light made his expression seem especially somber. After several seconds, the match burned down to his fingertips, but he didn’t seem to feel the slightest pain. The flame died, and his face sank back into the gloom.\n He simply stood there, just as he had before our arrival. He had heard every word Beauty and I had said, but stayed silent. My face burned, but luckily no one could see it.\n The light blazed up again. Fortune stared at us. “Well, it’s rare to see you two together. Mediocre, haven’t you always hated Beauty’s presence in our midst? And Beauty, haven’t you always said that my food is wasted on Mediocre?”\n Beauty and I looked at each other, and then we both took a step back.\n The match burned out. Fortune tossed it away and lit another.\n “Fortune, where has Innocence gone?” I asked.\n Fortune glanced at me, but did not answer. Instead, he addressed Beauty: “You’re trying to steal this food? Beauty, I know you’re no ordinary woman. You’ve survived the fighting and confusion thus far. But have you considered that, without me, you won’t be able guard this food on your own?”\n Beauty raised her face to the light and stared straight at Fortune. “Sometimes you think too highly of yourself, too.”\n “So you have another way?”\n “I always have a way.”\n Fortune nodded. “Yes, you’re sharper than us all. You’ll go to any lengths to survive. Never mind a power outage—even if an asteroid hit the Earth, even if zombies choked the streets, you’d survive.” As he spoke, he turned and looked all around him. “In that case, there are others on the way?”\n In the deep, silent subway tunnel, the match gave off only a narrow ring of light. Beyond it, the darkness circled restlessly. Footsteps, numerous and confused, sounded nearby, signaling the approach of more than one person.\n I gave Beauty an astonished look, but her face remained impassive, as though everything was falling into place exactly as she had planned. Four people came toward us out of the darkness, and the flame gradually threw their faces into relief. I recognized all four of them: Liu Fierce, Zhou Strong, Qian Vulgar, and their licentious female companion. They had steel rods in their hands and malicious smiles on their faces.\n “It looks like you’ve been planning this for a long time,” said Fortune, striking another match. “If this crew is at your beck and call, this wasn’t a decision of one or two days.”\n “I reached out to them a month ago,” said Beauty.\n “We hadn’t decided to go south yet.”\n “But even back then, you’d already started to give me less food than before.”\n Fortune nodded. “I guess there’s truth to the story of the farmer and the viper. You’re sharp. You’re better suited to survive in this world than all of us.”\n As Beauty and Fortune spoke, Fierce, Strong, and Vulgar gathered around us. The light threw long shadows behind them that stretched into the darkness. The lone woman leaned against the wall and grinned at us.\n “Fortune, don’t be stubborn. Go south with Mediocre tomorrow, and leave this food to us,” said Beauty. “And don’t resist. You’re old. You can’t win against those three. They’ve all killed before.”\n Fortune snorted. “I can believe that Liu Fierce and Zhou Strong have killed before. Heh, but the only life Qian Vulgar has taken with his hands, is from masturbating too much.”\n Vulgar flew into a rage. “Fuck, you asked for it!”\n They started forward, but just then, the match went out. Darkness enveloped everything.\n “He’s trying to get away!” shouted Fierce. “After him!”\n But they stopped dead in their tracks. A flame had flared up in Fortune’s hand again, and in his other hand was a gun.\n The barrel of the gun was pure black, even darker than the surrounding gloom, like a mass of ink in his hand. The muzzle of the gun was pointed at Fierce, whose bulging facial muscles twitched as he backed away slowly.\n Fortune smiled coldly. “Now you know how I guard all this food.”\n Vulgar also backed away. “D-does the p-pistol still work?” he stammered, his eyes darting from side to side. “D-didn’t the geomagnetic storm take out all electronics?”\n “Idiot!” said Strong, who had been silent until now. “It’s not a missile launcher. Pistols don’t require electricity, they use gunpowder!” He turned to look at Fortune. “Hey, Boss Zhao, we really fumbled the ball this time. We’ll take our leave.”\n Fortune kept the gun raised. His face gave no indication of his feelings on the matter. The flame died again, but he did not light another match. The darkness and the silence were suffocating.\n “Beat it,” he said.\n The four uninvited guests withdrew slowly, with shuffling steps. I stood frozen, my mind racing: in an age without electricity, the gun in Fortune’s hand meant that his advantage was absolute. And I had led Beauty here, who had led the four others here, with every intention of plundering his trove of food. It was not in Fortune’s character to forgive this kind of betrayal. What was his next move? Would he dispose of Beauty and then come for me? It was a pity I wouldn’t see Innocence before I died—right, where had she gone—\n As my mind reeled with a thousand different thoughts, Beauty had already begun to beg for mercy: “Fortune, I was wrong. I only came to help you check on the food. I’m going south with you. I wouldn’t trick you. Why would I trick you if I want to go south? It was all Mediocre. He brought me here. He wanted to be with me, to steal me away from you . . . ”\n Fortune remained silent. The light did not reappear, and I did not know what he was thinking in the shadows. In a standoff, time passes at a leaden pace. Beads of sweat broke out on my forehead, and my legs quaked as I debated making a run for it in the darkness.\n Just then, a hoarse, desperate scream came from the other end of the tunnel:\n “Lovely, Lovely, I’m Handsome. Don’t you recognize me?”\n Fortune struck another match. In its flickering glow, I saw Handsome staggering toward us. He screamed as he ran, teeth bared and fingers curled into claws. He stumbled and fell, but then scrambled back up and continued his mad rush for the woman beside Fierce.\n He looked terrible. His face was savage and grotesque, and blood dripped down his forehead.\n Fierce’s face darkened, and he whirled around to face Beauty. “Fuck! I knew this was too good to be true. You were laying an ambush for us all along!” Strong and Vulgar scowled at her.\n Fortune was stunned, and he let the match in his hand burn out again. In the very instant we were plunged into darkness, Beauty lunged at Fortune and grabbed hold of his hand. Fortune struggled, and they fell to the floor and began to roll about.\n “Ah! Who are you?” Nearby, a female voice cried out in alarm. “Let go of me!”\n The reply came from Handsome: “Lovely, ah, Lovely, don’t you recognize me? I’m Hand—ow, who hit me!”\n Fierce grabbed Handsome’s head and began slamming it against the ground. “Even if you were strong, it would still be a mistake to jump me. Look at you, you’re chicken shit! Well, what are you two standing around for? Go deal with Zhao Fortune!”\n Strong and Vulgar finally reacted: following the sounds of struggle, they ran toward Beauty and Fortune, who were entangled on the ground. They sprinted by on either side of me, moving so quickly that I felt wind whistle past my face in their wake.\n Total chaos broke out. The dark tunnel echoed with muffled groans and piteous cries, painful howls and angry curses. But strangely, everyone seemed to have forgotten about me. It was more than a little humiliating. Just as annoyance washed over me, I felt something hit my foot. I bent down and felt around until my fingers found a small, lightweight box. When I shook it, I heard something rattle inside.\n It was a box of matches.\n Wild with joy, I lay down on the ground and opened the box. There were only a few matches inside, maybe three or four. As I struck one, the surrounding darkness was driven back several yards by the light.\n I saw Beauty had Fortune pinned to the ground, both scrabbling for the gun. Strong and Vulgar had run right past them to the other end of the tunnel. The light brought them up short, and they hastily doubled back. Fierce had Handsome by the collar and was kicking him, but Handsome held tight to the licentious woman’s thigh, still screaming.\n The flame died, and I scrambled to strike another match.\n Fortune, Beauty, Strong, and Vulgar were a tangle of limbs and savage faces. Seven hands were locked on the gun in deathlike grips. The only free hand, which belonged to Vulgar, was feeling up Beauty, who let fly a stream of abuse. Handsome’s legs were wrapped around Fierce’s waist, and he had sunk his teeth into the other man’s ear, blood dribbling from his mouth. Fierce screamed but did not fall, only stumbled backward. The licentious woman pounded her fists against Handsome’s back.\n My hand shook, and the light went out again. I reached for another match, but my hands trembled so badly that I dropped the box on the floor. I groped around for a while on my hands and knees. But when I finally found the matchbox again, it was empty. I swore quietly and felt around again until I came upon a matchstick. Several seconds later, light reappeared.\n Fortune, Beauty, Strong, and Vulgar sat in a circle, hands fumbling in the clothes of the people on either side of them, muttering, “The gun? Where’s the gun?”\n Beauty had gotten the worst of it. Her clothes were in total disarray. But she grit her teeth and applied herself to fishing the gun from the clothing of the two men next to her. Handsome had embraced the licentious woman, and the two of them were embroiled in a passionate kiss. Fierce was still bleeding from his ear, bewilderment on his face.\n The last match guttered out. The muffled groans and the sounds of blows started up again. Handsome’s cries were especially pathetic. I could only guess that Fierce was picking on him mercilessly.\n “Everybody listen up!” I shouted.\n All of the noise ceased at once, and fourteen eyes looked in my direction. The surrounding darkness was so thick, however, that they could not see anything. I cleared my throat and said, “Fighting is so inelegant. Why don’t we sit down and talk—”\n The screaming and groaning resumed, and every so often I heard the dull thud of a brick hitting something.\n Suddenly, Vulgar shouted excitedly, “Found it!” Before the words were out of his mouth, there was a sharp scream, followed by the scrape of metal skittering against concrete. It sounded as though, in the mad scramble for the gun, it was being kicked back and forth across the floor. On the other side of the tunnel, Handsome shrieked like a pig being slaughtered. I couldn’t tell whether his leg had been broken or his lip had been split.\n Just then, someone gave the gun a forceful kick. The sound of the gun against the concrete grew sharp, and then it streaked past me. I dove for it, but my hand closed on empty air. The gun slid all the way to Fierce. Several seconds later, Handsome’s screaming ceased abruptly, and a gunshot rang out.\n As the flash lit up the entire tunnel, I saw the blood and madness on Handsome’s face.\n “Don’t!” I yelled.\n “Put down the gun and we’ll talk it over,” said Fortune.\n “Handsome, don’t be rash,” said Beauty. “From now on, I’m yours.”\n “Shit! What are you doing pulling a gun like that? You’ve ruined the peace. We’re leaving, we’re leaving,” said Fierce, Strong, and Vulgar at the same time.\n Handsome, holding the gun with both hands, made no response to any of us. Instead, he looked at the licentious woman, who stood petrified, and said, “Lovely, Lovely, I’m Handsome. Don’t you recognize me?”\n The licentious woman, with bewilderment in her voice, asked, “Lovely? Who is Lovely?”\n “You aren’t Wu Lovely?” asked Handsome.\n “I think you’ve mistaken me for someone else,” said the woman. “My name is Zhen Promiscuous.”\n I registered the imminent danger and threw myself to the ground.\n Bang—bang—bang—bang—bang—bang—bang—bang—bangbangbang. Handsome’s crazed screams filled the space between the gunshots, shattering the darkness and stillness of the tunnel.\n When the gunfire stopped, a full five minutes after it had started, the entire tunnel fell deathly silent.\n I felt myself all over. After I’d made sure there were no new holes in my body, I sighed with relief. The tunnel was like a tomb. Though I couldn’t hear any stirring at all, I still unconsciously called out, “Is anyone there?”\n There was no answer. I felt a pang of grief. There had been so many gunshots. The others must not have been so lucky—\n Before I could finish the thought, Beauty’s voice piped up to my left. “Eh? I’m all right!”\n To my right, Promiscuous said, “I’m unhurt, too.”\n Fierce, Strong, and Vulgar’s voices came from different directions, but were filled with the same surprise: “Not a single hit!”\n From somewhere nearby, Fortune gave a bitter laugh tinged with pain. “Every damn one of them hit me . . . ”\n Beauty, Fierce, Strong, and Vulgar felt their way to the metal door of the storeroom. They heaved on the handle, and the door opened with a clang. The plastic bags inside poured out like a tide.\n “Haha! I finally found you!” crowed Beauty. Even though it was too dark to see anything, I could imagine the fleshy folds of her face rippling with wild joy. Her joy was contagious: the three men fell upon the plastic bags, consumed with laughter. They would suffer from hunger no longer. The food Fortune had hidden away would sustain them for many years. And after that—well, who knew?\n Fortune, lying in a pool of his own blood, gave a cold chuckle.\n Suddenly, Beauty stopped laughing, followed by the three men. They uttered shrill cries of surprise and began to rummage through the plastic bags, but all I could hear was the crisp sounds of plastic crinkling.\n “They’re empty?” said Beauty in a puzzled voice. Then she turned on Fortune and shouted, “What have you done with the bread? Why are all of these bags empty?”\n Fortune laughed.\n “Quit laughing and spit it out. If you don’t, I’ll beat you to—” Beauty, abruptly realizing that Fortune had been shot a dozen times and the situation was beyond retrieval, changed tack and softened her tone. “Go on, speak up now. You’ll be dead soon. Won’t you tell us where you hid the bread?”\n “Heh, it . . . ran out . . . a while ago.”\n “That’s not possible,” said Beauty. “You have a whole room filled with food.”\n “How could I find that much bread by myself?” said Fortune, his voice weak. “I hid quite a bit, but . . . but I used up my last loaf of bread providing for you lot these last few years.” He laughed again. “Did you really think I wanted to go south because I believed Handsome’s bullshit? It was because I was already out of food. If we stayed here any longer, you would have caught on . . . I brought Mediocre here to make him think that I still had a lot of food hidden away. That way, when we went south, he’d continue to listen to me . . . ”\n “Fuck! You led me on!” Beauty aimed a kick at Fortune, but in the darkness, her foot hit a stone instead, and she gasped in pain. She gave up on Fortune and caught Fierce’s arm. “Brother Fierce, look, I knew Zhao Fortune was unreliable. Today, with your help, I finally unmasked him. From now on, I’m with you. I’ll do whatever you want me to.”\n Muttering curses, Fierce turned and stalked off with Strong and Vulgar. Promiscuous left with them as well. Beauty hastily followed, keeping up a constant stream of flattery. I had faith that Beauty would quickly fall into step beside them. She would transition seamlessly from our little five-person group to their little five-person group. She was always sharp. She would outlive all of us.\n Before their footsteps faded completely, Handsome suddenly came to his senses. As he sprayed bullets in his violent rage, he had slipped into a stupor. But Promiscuous’ departure caused him to recover his intellect. He screamed, “Promiscuous, Promiscuous, I’m Handsome!” and then took off after them.\n Thus, only Fortune and I were left in the tunnel. As I crawled toward him, my hand touched a sticky, tepid liquid. Further ahead, I found his face with my hand, and patted his cheek. “Are you dead?”\n “Not yet.”\n “Oh.”\n After a pause, I asked, “Do you know where Innocence has gone?”\n Fortune’s wheezing breath sounded especially pronounced in the darkness, in the same way that a candle’s flame dances violently just before it burns out. I was worried that he might stop breathing at any moment, so I asked again.\n “She . . . she went south.”\n His answer stunned me for a moment. I thought of Innocence’s receding figure in the twilight, and shook my head. “No way. She told me to wait for her, so we could go together.”\n “Yes, she wanted to go with you, too. But when she came to ask me for bread, I . . . Heh, you don’t want to know . . . I told her I’d already run out of food, and that she could not go south with you.”\n “Why?”\n “Because, Mediocre, because you’re my . . . You listen to me, in the north or the south, before the Trip or after, I have always been and will always be your boss. You cannot escape my grasp. The food I have left is only enough for two people. At first, I planned to bring only you. Handsome, Beauty, and Innocence were to be left behind. So Innocence went south first. She knows my methods. Everything I set out to do always . . . ” Fortune, suddenly lively, said all of this in one breath. Then, he sagged again. “If you had gone south with me, perhaps you would have found her.”\n I clutched his collar and said urgently, “But Innocence is just a girl. How can she go south without food or weapons? How long ago did she leave? What road did she take? Is she safe?”\n But I did not hear Fortune’s voice again. I placed my hand on his face. His flesh had already grown stiff and felt icy to the touch, like the coming winter.\n Epilogue\n Winter was almost upon us, and the weather was extraordinarily cold. By the end of November, all the leaves had fallen from the trees. The wind soughed through the bare branches, accompanied by stinging, bitter cold. No one wanted to go out walking in this weather. Everyone cocooned themselves in their homes.\n I saw Beauty on the streets only once. She was with Liu Fierce and his gang, who whispered among themselves as they walked. I said hello to her, but in her eyes, I might as well have been made of air. Handsome followed them at a distance, completely out of his wits. He had eyes only for Zhen Promiscuous, who had grown even more licentious. I said hello to him too, but he looked right through me.\n I holed up at home for a few days. Then, with sudden jolt of determination, I snatched up a suitcase and began to walk south. I imagined what the south looked like, and how my reunion with Innocence would unfold. The farther I walked, the happier I felt, and before long I had left the city behind. Suddenly, in the distance, I spied a body lying beneath a withered tree. The white clothing on the body looked extremely familiar.\n Several birds roosted in the tree, shivering in the cold. Unable to determine which way to go in the geomagnetic storm, they had missed their last chance to fly south to warmer climes.\n I stood rooted to the spot, trembling, though whether it was because of the cold or some other reason I could not tell. I wanted to step forward and confirm the identity of the body, but I was too afraid. The birds huddled together in the branches.\n After a long while, I turned and walked back to the city.\n When I returned home, I wrapped myself in three layers of blankets, but I couldn’t stop shivering. I lay in bed for many days. Outside, torrential rain alternated with swirling snow. The cold pierced the walls, penetrated my blankets, and seeped into my bones. Handsome was right. Temperatures would reach a terrifying thirty degrees below zero this winter. No one could endure it, but not one of us could go south.\n Translated and published in partnership with Storycom.\n Elizabeth Hanlon is a Boston-based translator of Chinese fiction. She is a graduate of Tulane University and studied Chinese at the Inter-University Program for Chinese Language Studies at Tsinghua University. Her published translations include Of Ants and Dinosaurs, a novella by Hugo-Award-winning sci-fi author Cixin Liu; Beijing Graffiti, a non-fiction work on Beijing’s graffiti culture, and several short stories."}