{"fingerprint": "3zNHyjUOKbQ9K53e8ICRso3jAsI=", "sitename": "Clarkesworld Magazine", "title": "An Account of the Sky Whales by A Que, translated by Andy Dudak", "author": "A Que; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/a_06_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Account of the Sky Whales by A Que, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11540 words, novelette\n An Account of the Sky Whales\n An in-flight announcement woke me as the ship entered Goliath’s atmosphere in the dead of night. I opened the window shade and was bathed in cool moonglow, which caused the middle-aged woman dozing next to me to stir briefly. I got closer to the window and looked down. A sprawling expanse of cloud layers, like massive fish scales, extended to the limits of my vision. A white whale cruised through a distant cloud bank. The massive, graceful creature breached, turning over ponderously, describing a steep arc, then plunged back into the bank and vanished.\n It was freezing out there. At an altitude of thirty-thousand feet, the temperature was fifty below zero. I wondered if these creatures, having grown up in the warmth of the Golden Sea, felt cold.\n I pressed my forehead against the window. A few seconds was enough to give me vertigo, and the shakes. I had drummed up my courage for Frond’s sake, crossed a sea of stars to reach this world at the far end of the Golden Shipping Belt—but that didn’t mean I’d overcome my fear of flying. Throughout the long journey, this phobia had never ceased tormenting me.\n Fortunately, this was the final stage of the journey. Soon I’d be holding Frond in my arms.\n The ship passed through thick cloud layers, descending toward Goliath’s Port Seven. This steel colossus stabbed into the sky, its thousand docks incessantly receiving and disgorging ships. Over ninety percent of the vessels were freighters. The port was like a giant leech, its docks high-speed suckers drawing in this world’s natural resources: from ores to wood, quadrupeds to fish. Even water from the Golden Sea was constantly being sucked into orbit for export.\n Humanity’s expansion across the myriad stars depended on this sort of restless, unending plunder and extraction.\n There was a disease control checkpoint near the port exit. A dark-skinned, emaciated procurator asked about my plans on Goliath. He lowered his head to study my data. His hair was cropped short, peppered with premature white.\n “I’ve come to bring back my girlfriend.”\n “And why did she come to Goliath?”\n “Planetary biology. Her research focus was cloud whale physiology.”\n The procurator looked up, pleasantly surprised. “Outstanding! Most people come here to get rich. Your girlfriend is really distinguishing herself. So why are you taking her away from us?”\n “Because she’s dead.” I let that sink in, let the silence grow. “I want to take her ashes back to Earth. Back to her hometown, to the place we met.”\n The procurator eyed me from head to foot. “Unfortunately, sir, you must know that according to the Interstellar Disease Control Act, a citizen must be buried on the planet where she died, whether or not the death was abnormal. You would never get her ashes through port inspection. And regardless, you’d never find a ship willing to take her off-world.”\n “I know.”\n The procurator continued to appraise me, then sighed. He customs-cleared me with an electronic seal. I thanked him, lifted my bag, and headed down the corridor.\n “Good luck sir,” he said behind me. “You’re going to need it.”\n I spotted Michael in the crowded receiving hall.\n Even though we’d never met face to face, I recognized him from only a brief glance—thanks to Frond’s social media page. Frond had been the type to embrace the world, without reservation. Every day her page had updated: the latest images of their lab work, their pub conversations, their exuberant travels on the backs of cloud whales. How many nights had I opened those images, sketches of her in light and shadow, vivid but untouchable?\n Now here was Michael in a threadbare jacket, holding a placard with my Chinese name scrawled on it. He was a tall, haggard man, complexion pallid. He hadn’t shaved in several days.\n He saw me as I walked toward him, then he pointed outside and turned, pushing people out of the way. I followed in his wake. We didn’t talk. How could we? I didn’t know what to think of this man, didn’t know if I should hate him, blame him for winning Frond yet failing to look after her—or accord him sympathy, and help him commemorate the woman we’d both loved. He surely held the same conflicting feelings. Silence was our best option for now.\n I followed him through the brightly-lit port toward the darkness outside.\n He started his dilapidated research vehicle. The anti-grav drive fired up, belching several times before emitting its bright blue ion flow. The vehicle lifted off the ground and hung there uncertainly. I climbed in and, feeling a bit cramped, lowered the front passenger seat. Michael looked at me. He seemed about to say something, then turned his attention to piloting.\n I realized that Frond had probably sat in this seat, during field work. She’d been rather petite. The seat had been set high for her. This thought left me feeling gloomy. All I could do was turn and look out the passenger window.\n We quickly left the port district behind, entered a wild region. The terrain went from flat to precipitous, giving way to craggy mountain stone, and a range of peaks loomed before us. The vehicle kept close to the ground, following the terrain high and low. The headlights flashed on the winding road ahead, weakly illuminating it. We were like a firefly lost in the thick night.\n The aptly named Research Retreat Valley had a large complex built into one alpine slope, a fortress of reinforced concrete that had seen better days. I reckoned it had been built just after Goliath’s discovery. Years of sandstorm abrasion and moisture had taken their toll. The steel reinforcement was rusted, and the access roads were fissured.\n It was very late. The mountain winds were fierce. We put on protective suits and got out of the vehicle. The night wind slammed into us. We breathed canned oxygen in our helmets, but I still tasted the salt tang of the atmosphere. Dumbfounded, I looked westward.\n Although dense clouds were gathering, moonlight still penetrated the stacked layers, dimly illuminating the night. But to the west was a thick, impenetrable darkness that seemed to swallow all light.\n The Golden Sea.\n Research Retreat Valley was near the Gold Coast. No wonder the damp wreaked such havoc here.\n I gazed into the distance for a long time. Michael finally coughed politely, and I followed him into his monkish living quarters. He tidied up his bed and said, “Tonight you can sleep here.”\n “Frond’s . . . ” I paused. “What about Frond?”\n Michael turned and went out. He soon returned and placed a metal urn wrapped in black cloth on the table. I knew Frond’s ashes were inside. I stared, waiting for my legs to buckle.\n “It won’t get past customs, but I can put you in touch with a ship that might help. When will you go?”\n “Tomorrow morning,” I said, sounding like a sleepwalker.\n “Okay. They can be here by then.” Michael withdrew from the room, shutting the door.\n I picked up the metal urn and sat on the bed. Although I’d anticipated this moment countless times, seeing beautiful, vibrant Frond turned to ash and gathered in a cold metal container was surreal.\n “Rest easy Frond,” I said, leaning the urn against my face. “I’m taking you home.”\n I tossed and turned for a few hours, then figured I might as well get up. It was early morning. The complex was dark, except for one illuminated lab. I glimpsed Michael through a window. He sat alone in a corner of the room, expressionless, draining a bottle of beer. At his feet were quite a few empties.\n I left the building, donned a breather mask, and headed toward the shore. As I sat on the sandy beach, a strong wind scattered the clouds, and I grew cold. The tide rose and fell, periodically lapping at my feet. The Golden Sea’s water was warm, even at night.\n Goliath had six moons that could illuminate the night, but few people saw all six high-soaring wonders at once. Tonight, three moons hung visible in the western sky. The other three were shrouded by clouds. A pod of white whales cruised beneath one moon. Several calves dove and climbed among the adults, filling the night with melodious whale-song. Their pace was leisurely, like kites floating across the sky, but when they passed overhead and doused me in vast shadows, I remembered that they were this planet’s biggest species. I looked up and watched them drift eastward, sweep past Research Retreat Valley, and vanish into the darkness.\n Wondrous, their impossible power of flight.\n Too bad human whaling ships were faster, and ubiquitous. How much longer would cloud whales soar in these skies?\n Eventually I went back. Michael was still in the lab, now passed out against a wall.\n I helped him up and supported him back to his living quarters, deposited him on his bed. Dead tired myself, I laid down on the table. The time lag from my journey caught up with me, and I quickly fell asleep.\n I woke early to find the sky still dark. I picked up Frond’s urn and went to the top floor of the building, and stood waiting in the morning wind. When I’d left the room, Michael had still been asleep. I guessed I would never see him again.\n A Ghost-Three class ship floated over the top of the building. A bald, burly fellow jumped out, followed by a thin person dressed in rags. Through my breather plate I saw that the scrawny one’s right eye socket was empty. This fearsome-looking man used his remaining eye to size me up. He asked my name, then said, “You want to return to Earth?”\n I nodded promptly, shivering in the morning wind.\n “Where’s Michael?”\n “Inside sleeping.”\n The thin guy nodded and said, “Go on up. Find an empty place to sit. We’ve got a long journey ahead of us. Many days.” Seeing my uncertainty, he said, “We’re bound for Port Two. We have a friend there, who’s attitude toward his inspection duties is . . . relaxed.”\n I cradled the urn, preparing to board.\n “Hold it.” The hulking fellow suddenly barred my way. He jutted his chin at the urn. “What’s in there?”\n The arm blocking me was thicker than my thigh, bare in the cold morning and knotted with muscles like a young dragon’s, and marked by a garish scar. I raised my head to meet his gaze. He stared coldly. “What? You wanna make trouble?”\n The one-eyed scarecrow laughed hollowly. He came over and pulled his colleague away. “Michael paid. As long as it’s not a bomb in there, we’ll get it back to Earth.”\n Baldy snorted, but turned toward the ship. One-Eye got close to my ear and said, “Don’t tell anyone you’ve got human ashes in there. We poachers are a superstitious lot. Anything associated with bad luck . . . we fear it.”\n “And why aren’t you afraid?”\n One-Eye chuckled. “I fear going broke more than bad luck.”\n The hold of the Ghost-Three was packed with hundreds of metal barrels. Stooping, I walked to a corner and hunkered down. There were seven other people in here. Like me they looked stupefied, sitting and hugging their knees. I guessed they all meant to circumvent customs inspection for one reason or another.\n Baldy sat in the pilot seat. One-Eye cheerfully counted the barrels, his grin broadening as the number climbed: “Three-hundred and twenty-two. Bright Pate, this time we’ll make an insane profit.”\n “How many times are you gonna count them?” Bright Pate fired up the engines.\n “Just let me enjoy myself. The current market price is sweet. Whale blood has gone up ten Union scrip per jin. That’s a hundred and fifty per barrel for this trip.” He tapped one of the barrels, listening. “We could get more than forty-thousand. That’s what we get to split, when the time comes.”\n “What about Bling’s share? You plan on taking that?”\n “He’s dead. Very dead. I helped him get hired, helped him earn.”\n “It won’t do. If it weren’t for him we would’ve been swallowed by that beast. He’s got kin. How about giving two-fifths to his blind mother?”\n “Too much. One-tenth is enough.”\n “Very well.”\n One-Eye nodded, once again smiling and counting.\n It was finally dawning on me. These homeostatic heat barrels contained cloud whale blood.\n I’d heard about the trade in cloud whale blood, far as it was from the concerns of Earth. The vast Golden Sea contained a miraculous chemical element called F937 that, in its pure and concentrated form, counteracted gravity. The anti-grav engines now in widespread use exploited this element. There were two ways to harvest F937. The first method was to extract directly from seawater, but this required strict environmental conditions that were unachievable on Goliath. Orbiting space stations—and their zero-G, perfect vacuum laboratories—were therefore necessary for such extraction. A thousand cubic meters of seawater yielded approximately ten micrograms of elemental F937.\n The other method was to extract from cloud whale blood.\n Cloud whales were a miraculous species, confounding and fascinating humans since their discovery. Nearly a century later, they still enticed biologists—Frond among them—to visit Goliath in droves.\n Cloud whales were born in the seas of the distant planet Xorchin. Once a year, during a large moon’s closest approach, Xorchin’s gravitational pull was counteracted, and cloud whales rose from the sea en masse, and entered interplanetary space. They migrated along the Golden Shipping Belt, by way of seven different stars, relying on vast, solar wind-catching membranes for acceleration. They had to elude vacuum dragons, which could appear as suddenly as gods, and vanish like ghosts. The lucky few that reached Goliath’s Golden Sea lost their solar sail membranes. They became true cloud whales, able to absorb F937 into their blood. This allowed them to break free of gravitational fetters, to cruise horizons, dwell among winds, and sleep among clouds.\n It also meant that F937 was a million times more concentrated in their blood than in seawater. This fact was bringing about cloud whale extinction. Whalers, armed to the teeth, were hunting and killing the creatures, using high-power pumps to exsanguinate them. In less than a century, Goliath’s cloud whales had been brought to the verge of non-existence. Fortunately, the Union had entered them on a list of protected species, and issued a hunting ban. The only sanctioned contact was for research.\n The whales’ situation improved, but a lot of poaching still happened.\n Obviously, I was on an illegal poaching vessel, a whaling ship. And now it was transporting cloud whale blood to the black market. Passengers like myself were taken on in passing, as a supplementary source of income.\n Judging by the volume of blood in this ship, at least ten more cloud whales were now mummified corpses.\n I brooded on this. The whale-song from the previous night seemed to echo in my ear, mournful and ghostly. I hugged Frond tightly, shrinking further into my corner of the hold.\n This movement saved my life.\n A devastating impact rocked the ship, and my side of it caved inward, braining the man who’d been sleeping next to me. A flower of blood blossomed from his head.\n If I hadn’t withdrawn the moment before, that might’ve been me.\n The collision sent our whaling ship rolling violently through the sky. Blood barrels crashed about the hold, spilling their gore, immediately crushing two passengers to death. A barrel smashed my left leg. The crack of the bone was sickeningly audible amid the general clamor. I clung fiercely to a railing as we continued to roll and fall. Luckily, Bright Pate had reacted quickly. He was already bent over his console, initiating an equilibrium-restoring maneuver.\n The numerous braking engines on both sides of the ship fired up, counteracting the roll. Blasting at full power and working together, they managed to cancel out the motion imparted by the collision.\n Three seconds later, the ship stabilized.\n “Dammit!” Bright Pate roared, face blood-spattered. “It’s been following us all along!”\n No one answered him.\n He trembled, reclining in his seat. A broken control lever was buried in his abdomen, and he’d suffered another wound, this one probably mortal: a hideous crater in his right temple that resembled a new eye.\n The second attack followed hard upon the first. This time Bright Pate was ready. The ship dove, and a vast shadow rushed past.\n Through a shattered porthole, I spotted a wrathful-looking cloud whale.\n I had never associated rage with these animals. According to research, cloud whales were docile, fleeing in the face of massacre, moaning sad laments as they were exsanguinated. They’d been friendly toward humans at first, but after sufficient bloodshed, they had learned wariness. This was the first I knew of a cloud whale attacking humans.\n I found it difficult to breathe, felt confined and trapped. I focused on recovering the urn. Luckily it had not been damaged. Next I put on my breather mask. The cloud whale had already gotten well past us, its massive tail flukes pumping. It climbed in a steep arc and came about for a calamitous attack dive.\n Bright Pate yelled again for One-Eye, but still there was no reply. He turned around to survey the disorder of the hold, the broken metal barrels, the floor awash in cloud whale blood. I was the only surviving passenger, but Bright Pate’s gaze didn’t linger on me. I was just another corpse to him.\n I saw in his eyes the glint of some wild, dangerous resolve. Blood pouring from his head, he roared, “You want to kill us all? Bring it on!” He leaned on the accelerator. The ship trembled, groaned, lurched upward ferociously.\n Ghost class ships aren’t big. Their strengths are maneuverability and acceleration. In three seconds we were a bullet screaming through the air. By then I’d thrown myself at the life-preserver module. I pressed a button. Foam cushioning enveloped me.\n The fearless cloud whale, its massive body charged with golden blood, seemed ready to burst with the pressure of some inner sun. Its cavernous mouth gaped. The air around us shivered. Its massive flukes stirred whirlwinds as it dove. The ship was no larger than its head.\n Frond had once told me that in the rare event a cloud whale grew violent, its eyes might shift from the usual white to a rarely-seen grey. But now, face to face with this furious behemoth, I saw that its eyes were a nightmarish black.\n The ship and the whale clashed.\n My life-preserver module hadn’t ejected yet. In my foam cocoon I felt earth and sky inverting, and then I was falling fast. Before I lost consciousness, my only thought was to hold Frond’s ashes tight to my chest.\n I hugged her as tightly the day she left me. As if keeping her in my arms might link our souls, mingle our blood. Make her unable to leave.\n But she maintained her composure, gently disengaged from my embrace, retreated a step. “Take care of yourself,” she said. “Remember to dress for the cold. If you’re hungry and tempted to order take-out, better to cook for yourself. Don’t stay at home all the time. Get out and meet new girls. Talk to them about the weather if you have to, or food, or art. Find one to take care of you.”\n “I only want you.”\n Perhaps my wretchedness moved her. “So . . . come with me.”\n Before I could reply, a ship bound for KP90 in the Cygnus constellation rose into the sky, its massive engine rumbling. I recoiled from the spectacle of it.\n Frond said, “Can you overcome your fear of flying? I’m bound for Goliath, and it’s very far away. And when I get there, I’ll spend more time in the sky than on the ground. You couldn’t adapt to that, could you?”\n “Give me a little time,” I implored. “Half a year? If I can’t do it by then, you go alone. I’ll accept losing you.”\n “I’ve already given you five years. You still shake every time you hear a ship engine. And that’s okay. There’s nothing wrong with staying on Earth. Before the space age, people lived full lives here.”\n “Then why can’t you . . . ”\n “I’ve told you,” she said, raising her head to stare through the famous transparent dome of London Port. Ships rose and descended like so many fireflies, some hurtling into the depths of the night sky. “My life is up there.”\n Her eyes were full of the familiar yearning. To me, the night sky was unfathomable, but to her it was like precious, alluring jade. I knew I couldn’t keep her from going, but still felt compelled to make a final effort. Gripping her hand, I said, “The cosmos is dangerous. What if you run into trouble?”\n “If that’s my fate, then so be it.” She gently pulled her hand from my grasp. She picked up her luggage and walked a few steps, then turned and met my dispirited gaze. Smiling, she said, “How about I give you a mission? If I die out there, bring my remains back to Earth.”\n I didn’t reply, and she raised her eyebrows. “Don’t forget, okay?” She turned and headed for the departure gate, was swallowed in a tide of people.\n I extended my hand. Starlight fell through the dome onto my fingers. I stood there, rigid and unmoving, for a long time. As if my outstretched hand could summon Frond back from the crowded gate for one more hug. But the crowd dispersed, and the starlight was bright enough to show me she was gone.\n I opened my eyes. Tears were flowing down my cheeks and blurring my vision. My body ached all over. I arched my back and convulsively inhaled, and soon began to understand my situation.\n The life-preserver module had landed in a barren wilderness. It was in pieces, but my foam cocoon had protected me from the impact’s force. Struggling to discern my surroundings, I made out a large hill not so far away. Night had fallen. I’d slept at least ten Goliath hours. My breather mask was still useable, but my GPS/beacon wasn’t working, and I was injured in at least a dozen places. The biggest problem was my broken left tibia. I spent a long time probing my body with a solicitous hand, but I found no mortal wounds.\n And then I was panicking. I couldn’t find the urn. Frond was missing.\n I crawled along, groping the hard, dark ground. Frond, how could I have lost you? How could I have failed to carry out your last request?\n I felt earth and withered grass. Sharp rocks lacerated my hands, but I no longer felt pain. I searched, and my eyes gradually adjusted to the dark. Three blue eyes opened within a shadow before me, like three pilot lights suddenly ignited. I flinched back, flattened myself on the ground. The eyes illuminated a hairy, profoundly alien face. Inside the triangle formed by the eyes were two rings of sharp teeth. A rotten stench emanated from these blue-lit, fearsome mouthparts.\n This beast’s scientific name was Pseudohallucigenia tresoculis, but it was commonly called triadacine. Difficult to pronounce, either way. If Frond had been with me, she could have helped with that, among other things. This irritable carnivore gripped its prey with that outer ring of teeth, then used the inner ring to chew for swallowing.\n I couldn’t die here. I had to take Frond home.\n I pushed myself up on both hands and began an awkward retreat. The triadacine followed me patiently. Those three eyes continued to glow blue, an otherworldly triangle floating through the dark. The beast was taking my measure, deciding whether I was worth its trouble. Its six legs, short but sturdy, generated a susurrating sound that made my skin crawl.\n Soon my back was against the hillside I’d spotted earlier. I was trapped.\n The triadacine’s six legs coiled. In their midst the large mouth opened wide and hissed. The beast was about to pounce. My trembling hand fell on a rock, but a powerful howl erupted behind me, like the mad roar of a hurricane in some deep abyss. The world shivered. My courage wavered, and I dropped the rock.\n I turned. The hill wasn’t a hill after all, but a cloud whale—the very titan that had followed and destroyed the whaling ship.\n Its cavernous maw opened, and a roar like carpet-bombing surged out of its black hole of an esophagus, shattering the night. The triadacine nimbly reversed without turning its head. It beat a hasty retreat, the sound of its whooshing locomotion soon vanishing into the night.\n The whale’s roar had blasted me onto my back. I glimpsed something familiar in its mouth: the urn.\n To the right of the beast’s corpulent tongue, Frond was lodged in a convolution of the cavernous mouth’s inner wall. Insensible to danger, I got up and lunged, but the mouth crashed shut. As if the world-shaking roar had spent the last of its energy, the giant ceased to move, resuming the attitude of a lifeless hill.\n “Open up!” I said. Standing tiptoe, I could barely touch its lower jaw, which was covered with tumor-like growths, each as big as my head. I softly patted one, feeling its hollowness. The whale remained aloof, unmoving.\n “Open up and give back Frond.” I threw rocks at the beast, to no avail. Then I was panting for breath, sitting in front of the massive creature, contemplating how ridiculous my actions had been. From the whale’s perspective, I’d probably seemed like an ant hurling dust motes. The beast couldn’t even be bothered to open its mouth and blow me away.\n The sky was brightening when I woke. The first sun was already overhead, scorching, while in the east hung a smaller sun. Burning air flowed across my skin.\n But hunger had awakened me, not heat.\n I discovered the animal’s body was covered in frightful wounds. Blood had congealed in these, and some was still that peculiar, fierce gold color. According to Bright Pate, this animal had encountered the whaling ship before, tracked it for a thousand li, seeking a final apocalyptic clash. It might once have been powerful, but now it was barely hanging on. I put my ear to its body, listened carefully, heard a faint vibration from within: something like a pulse, or a tide.\n It breathed weakly. No telling how much longer it might hold on. Last night it had used its last roar to save my life. Or had it? This beast hated humans, after all. Most likely it had been a coincidence. Just as the three-eyed brute attacked me, the whale happened to issue its final bellow, in defiance of looming death, and the pitch-black night, and the bitter world.\n My hunger pangs were getting sharper. I climbed onto the whale’s back for a better view of my surroundings. I happened to be in a low-lying region, a basin gradually rising in all directions. Pieces of the whaling ship were scattered beyond.\n I crawled out there and searched through the wreckage, by sheer luck found some condensed ration packs. After wolfing these down, I discovered a still-useable protective suit, and promptly put it on. Although Goliath’s atmosphere obstructed most cosmic rays, direct exposure to the four suns was still dangerous.\n Now I felt somewhat restored. I found a shard of steel plating among the wreckage. The edge seemed usably sharp.\n I limped back down into the basin. The sunlight was fierce, the rocky ground baking. The cloud whale’s white body scattered the suns’ rays.\n “Big brother,” I said, “please don’t hate me for this.” I patted the beast’s lower jaw, hefted the steel shard. “Since you won’t give Frond back to me, you leave me no choice but to use a method neither of us will like.”\n The cloud whale was silent, breathing intermittently. Judging by where I’d seen the urn lodged, the most direct route was just below the right eye.\n I crawled onto the whale’s back. Its head looked like it had been clawed open by great iron claws, the pink subdermal tissue exposed, already festering with maggot-like larvae. Ramming a whaling ship had its price.\n I sighed, carefully crawled to the right side of its head, and sat atop its right eyelid.\n “My apologies. I know humanity has been cruel to your species. Bright Pate and One-Eye alone took three hundred barrels of blood, meaning a dozen or so cloud whales dead. Maybe you had kin among them. But I’ve never profited from your bodies, never bought or sold you, and never killed you. I am not your enemy.” Trembling, I lifted my steel weapon, the sharp edge gleaming in the sun. “I have to bring Frond home. Maybe you can’t understand love, but she made a final request of me. I must succeed. You can understand that, right?”\n Even if it could, would it want to? It had witnessed a slaughter. It could only have hate for my species. Hadn’t I seen its eyes turn black?\n No matter what it did or didn’t understand, this weapon of mine must descend and penetrate. Frond, I’m bringing you home.\n The cloud whale opened its eyes. It didn’t have the strength to open them all the way, just a slit. But I saw their ash-grey color. They were no longer black. It seemed its rancor, along with its life, was draining away.\n The trace of emotion in those eyes: I knew it well. After Frond had left me, it was the expression I saw every time I looked in a mirror.\n Anguish, and bereavement.\n The first day after she left, I didn’t feel anything had really changed—apart from the house being a bit emptier, the bed a bit larger. I worked at home, as before, using data projections and light-sensing gloves to design the electrical wiring and cockpits for ‘Gale Force’ ships. When it was time to go to sleep, I automatically moved to hug the right side of the bed. My hands fell on the empty sheet, and withdrew as if stung.\n On the second day I got up late, and started gaming. I was a medieval assassin, endlessly killing, eating whatever was in the fridge when I got hungry. I threw out the stuff Frond had made, eating only frozen meals. I played through early morning the next day. Healthcare monitoring showed my body was fatigued, and I was forced offline.\n On the third day I slept and dreamt a lot. The dreams were grotesque, gaudy, bizarre. Frond did not appear.\n On the fourth day I opened a window. Sunlight assaulted my face. I had planned to go out for a walk, so I dressed, put on my shoes, and took the lift to the ground floor. But once I got down there I was shaking all over. I didn’t dare step out into the sunlight.\n On the fifth day my friend decided enough was enough, and organized an outing, pulling me into the light of day. He’d arranged a date with a beautiful girl, one who was quite satisfied with my income level, and who shared my corny sense of humor. We had a cheerful conversation. Toward evening I walked her home, but before we reached her door, a shiver ran through me. My feet refused to carry me further. “What’s wrong?” she said, turning to face me, twirling a finger through her jet-black hair. I fled.\n On the sixth day, I got on social media and removed Frond from my blacklist. I discovered she’d already changed her status from “in a relationship” to “single.” Her latest photos included one with her atop a peak, a cloud whale floating in the background. She was smiling in every picture.\n On the seventh day I huddled in a corner of my balcony, among violets and magnolias, sobbing. When I looked in the mirror that night, I saw a shadow. The shadow’s eyes expressed the same loss and pain that the cloud whale’s would later.\n All of this was standard post-breakup procedure, I know. No matter how far we humans have evolved, creeping in our starships throughout the cosmos, civilization branching, disseminating, flowering—some things never change.\n Losing love, for instance. And misery loving company.\n “Fuck it!” I cried, tossing my steel shard on the ground. I patted the whale’s eyelid. “You’ll be dead soon anyway. I’ll get to work then.”\n The cloud whale remained motionless, except for its barely discernible breathing. Under these circumstances—dehydration and blood loss—I doubted it would live through tomorrow morning. At which time I could excavate the urn.\n But what about afterward? This wilderness seemed uninhabited, and I had no communications. How would I get back to civilization? I shook my head, dismissing these worries, and reclined on the cloud whale’s back.\n Toward evening the four suns sank toward the horizon. The wilderness was bathed in a strange and marvelous red light, like an emerging fog. The air was hot and dry, distant clouds thin and rarefied. It seemed a wisp of red ink had been gently brushed across the sky. Several moons and satellites became vaguely discernible, part of a ring of asteroids gently orbiting Goliath.\n I admired the view. No wonder Frond had been able to discard the comforts of Earth for this wild place.\n The suns set one after another, their light draining from the world. I put my hands behind my head for a pillow, my right leg lying flat, the left raised and bent. I watched the four suns vanish, the elegant scene gradually lost to darkness.\n “We really are two of a kind,” I said, patting the cloud whale’s back. “Brothers in hardship. Both trapped here.” The beast remained taciturn as ever. I thought it had stopped breathing, but then it exhaled, disturbing the dust near its nasal cavity.\n A dying person, and a dying whale. An alien dusk, descending night.\n Along with night fell torrential rains.\n The rain poured from the darkness, at first a mild drizzle, but quickly turning violent. The large drops pelting my skin were painful. I sat up. The rain showed no sign of abating. I climbed down from the cloud whale’s back and took shelter under its lower jaw.\n Black clouds rolled in and piled up, thunder boomed and lightning flashed. The rain grew heavier still. Water accumulated in the basin, washing down from all directions. Within a Goliath hour I would be inundated.\n I had determined to leave this place when lightning flashed across the sky, illuminating a dark figure: the triadacine.\n It stood at the edge of the slope, beaten and lashed by the rain, its three eyes a brighter blue than before, glaring with the arrogance of occupying the high ground.\n After the cloud whale scared it off, this three-eyed predator had not given up. It had taken advantage of the dark to return. It was biding its time, watching and waiting, not daring to descend, probably due to a lingering fear of the cloud whale.\n I crouched beneath the jaw, but the water was getting deeper, now up to my waist. I had no choice but to stand up, and prepare to crawl onto the cloud whale’s back.\n The triadacine’s penetrating howl split the night: I heard it, and felt it throughout my whole body. It made my teeth ache.\n As I’d feared, this cry summoned more of the beasts. They emerged from the night to surround the basin, faint blue eyes watching me from every direction, double-rings of sharp teeth blue-lit to nightmarish effect. Shaking, I began to count the beasts, but when I reached twenty I stopped.\n During a brief spell of lucidity, I reached into the water nearby and retrieved my steel weapon.\n The triadacines’ goal was perhaps not just me, but the cloud whale. It was a kiloton of meat, after all. I supported myself by holding on to one of the tumor-like growths. I was so scared I could barely stand.\n The first triadacine cautiously descended into the basin, waded through the water, and circled the cloud whale. Its blue eye-light oscillated, perhaps with excitement, and suddenly it charged, and bit into the cloud whale’s side, then leaped away. The whale’s golden blood flowed.\n The triadacine raised its head, devouring the whale meat with its two rings of teeth. When it had finished, the whale was still motionless. The triadacine let fly another howl. Its companions advanced into the basin.\n It seemed I was done for. If I’d known I was bound for a predator’s stomach, I might have chosen to die in the ship.\n I felt something strange in my hand: the tumor-like growth on the cloud whale’s lower jaw began to inflate. I watched in surprise. Sure enough, these tumors that had been the size of my head were now quickly getting four to five times bigger. At the same time, the water level in the basin began to drop. It was soon back down to my knees.\n The cloud whale was absorbing water.\n The triadacines halted their advance. The dark night’s cloud ceiling roiled, and a series of thunderclaps rocked the world. The cloud whale opened its mouth and issued a defiant roar that drowned out the thunder. The basin dried up as the last water was absorbed.\n I dove into the cloud whale’s mouth, wormed my way toward its lower right jaw. I withstood the whale’s quaking roar and the wind of its breath. Despite the pain in my fractured leg, I used it to brace myself against the inner wall of the whale’s oral cavern, exerted myself, and at last pulled the urn out.\n The cloud whale shut its mouth. Pitch blackness swallowed me. I was sliding toward the esophagus, ice-cold water swirling around me. I couldn’t think clearly. I just had instinct, and the tightly-clutched urn. The water spun and tossed me. Suddenly I was ascending, rushing out of the cloud whale’s mouth. Like a fish in fountain, I shot into the night sky.\n I landed on the cloud whale’s back. I felt a rocking, swaying motion. This time the movement came from the whale’s body, not the thunderstruck ground. After expelling sufficient water tonnage, the massive creature lifted off the ground. It hadn’t risen more than a meter before it crashed back down, causing the ground to quake.\n Weeping, I crawled down between its eyes and slapped its head with all my strength. “Fly! Fly! Rise!”\n The cloud whale opened its eyes, gasped for gale-force breaths.\n “You’re a cloud whale! You die in the sea or in the sky! You’re not meant to be eaten by these foul beasts! Fly!”\n It exhaled a long, windy lungful, mingled with a ringing whale-song note, and once more its whole body shook. Under the torrents of rain, the cloud whale floated upward, higher this time, and then it was accelerating, angled upward, climbing. The triadacines were rooted where they stood, huddled together in the pooling water, whimpering timidly.\n “That’s right!” I wept. I lay face down on the whale’s back, tightly gripping a fold of skin next to its eye. I burst into laughter. “Higher! Higher!”\n It charged into a low cloud bank. We flew through the thick vapor, among branching lightning. The cloud whale pumped its massive tail, accelerating, climbing, and then, as though breaching from the surface of an ocean, we broke free of the clouds.\n The scene took my breath away. The weather—torrential rain, thunder, lightning—was beneath us. The surface of the cloud sea was tranquil. The six moons were lined up, as though strung together and hung over the horizon. We rushed toward their bright light.\n “Frond,” I said, raising the urn. “Can you see this? Are we flying to heaven? I’m not afraid anymore. I’m flying. Can you see?”\n Frond had always been infatuated with flying.\n Although she had a lovely pair of legs, she considered them the most useless part of her body. She detested walking.\n “I admit that legs were an important part of human evolution, back when we crawled out of the sea. Fins became legs. This was indeed a marvel of nature. But why did evolution stop at that point?” She slapped her legs as she expressed her indignance. “We’ve already left the ground for the sky, but we still rely on our legs!”\n What could I say in response? I loved every part of her, including her legs: long, slender, smooth, and fair, seemingly carved of ancient jade.\n “Azuki Bean,” she said, using her pet name for me, “we should be like the cloud whales and just fly away. No more plodding on muddy earth. Azuki Bean, you can’t know how much pain my legs give me.”\n Hearing this, I felt especially glum. I’d just spent a month’s salary on a pair of high-heel shoes for her. These luxury items were now stored deep in her wardrobe: top-notch designer craftsmanship, inlaid with diamonds, lavish and high-profile. Her face had lit up when she pulled them from the box. But I didn’t know if this was due to excitement, or merely light reflecting off the diamonds.\n “My lovely fool,” Frond had said, putting the shoes down. “When will I wear such things?”\n But in very short order, the shoes did indeed come in handy.\n Frond was working at the Exobiology Research Institute, her focus cloud whale physiology. Most of the funds came from Frontier Development Company sponsors. That autumn, FDC held a celebratory banquet. As one of the few pure researchers in a world of engineers, Frond would naturally attend.\n Donning a splendid dress, and the heels, she went out, having repeatedly instructed me to come fetch her at eleven o’clock.\n But she called me at nine. It was raining hard that night, and it wasn’t easy getting to the FDC tower. I saw Frond standing under a public transport sign, looking dispirited, water soaking her dress. Barefoot, she stepped through puddles of muddy water, surrounded by rushing vehicles and pedestrians under black umbrellas.\n Later I learned of the faintly golden beverage served at the banquet. Frond had sipped one. The taste had been refreshing. A smiling FDC mid-level exec approached her.\n “Such a beautiful girl,” he said, swirling the golden liquid in his glass, until it seemed to float and glow. “Hard to imagine you in a research institute all day.”\n Frond casually replied, “Lab work is fascinating.”\n “Quite right. We should all be grateful for your work. Research on alien species often bears fruit. Fruit with immediate commercial value.” The man, impeccably attired western style, grinned and raised his wine glass. “This liquor for instance. Know what it’s mixed with?”\n Frond saw the cruelty in his smile, and did not reply.\n “Cloud whale blood. Your team’s research revealed the trace amounts of F937 in the blood. Turned out to be perfect for mixing with alcohol. Not only does it taste amazing, but it’s an extraordinary tonic and restorative. Of course, it can’t be put to widespread use, but at an upscale reception like this, we can prepare this sort of special drink, to entertain respected . . . ”\n Frond had stopped listening. She felt nauseous. She resisted vomiting with great difficulty, and hurried to the restroom. But when she retched, nothing came up. That was when she called me, and in a daze made her way to the ground floor, breaking one of her heels on the way and spraining an ankle.\n I didn’t know what had happened, there in the rain. I just went to her and hugged her. She shivered in my embrace, crying softly.\n A meter away from us, beside the street, sewage flowed. The discarded shoes were being covered in filth.\n The cloud whale flew on, at times lording it over the clouds, at others diving into vaporous depths.\n I extended my hand into passing vapor, opening a wound in the cloud’s surface that instantly healed, leaving only a ripple. The six moons hung low in the sky, big and round, seemingly close enough to reach on whale-back. Clouds scattered moonlight, like ocean waves in the sun.\n Perhaps clouds were another kind of sea for these whales.\n Immersed in the shock of this beautiful scenery, it took me some time to recover my wits. “Where are you going?” I said to the whale. “How about finding a place to drop me off?”\n Of course, the creature didn’t answer. It hated humans, and certainly wouldn’t land near human settlements. I had always lived in cities. I couldn’t survive in the countryside, let alone the danger-packed Goliath wilderness.\n But I realized there was no reason to worry. My fate was out of my hands, for the moment. I had to take what came, and be ready to adapt.\n The cloud whale closed its eyes and slept, floating steadily above the clouds. I too couldn’t resist the pull. After a big yawn, I reclined on the whale’s back and slept.\n I awoke the next day to find the rain clouds dispersing. We floated through a bright, clear sky. The wilderness below us had transitioned into forests. Goliath’s plant-life was more luxurious than Earth’s—even the colors were more splendid. The cloud whale had been flying all night, and seemingly weary, began to descend. Its massive body swept over forest groves, breaking off branches and startling animals. At last we landed beside a river.\n This river was too narrow for the whale’s body. The massive creature couldn’t submerge itself, but used its tumor-like sacks to absorb water, meanwhile issuing a mournful wail.\n Its voice was brimming with pain. I stood and patrolled the creature’s back, examining the festering wounds. The maggot-like larvae had multiplied. If it weren’t for my breather mask, I would certainly have smelled the vomit-inducing rot.\n I used my steel weapon to dig the maggots out of the wounds, and to cut away rotten flesh. This was nauseating work. The worms were flesh-colored and fat, eyeless but many-legged—like a fat mix of tapeworm and centipede. Normally I would have avoided such vile creatures, but now, on this strange world, in this hopeless situation, the cloud whale was my only chance.\n After I’d cleaned its wounds, the animal stopped moaning, but continued to whimper and puff and blow. I was exhausted and covered in sweat, and starving. I had no ration packs left, and I couldn’t drink the river water. Utterly spent, I laid down and tried to catch my breath.\n The cloud whale took flight again, this time with far less spirit. Fly on, I thought dazedly. Fly me back to Earth. Bring Frond home.\n As we flew through the day and into the night, I lay unmoving, lost in a stupor. At times my eyes were open. I watched the bright sky darken, then brighten again. Dehydration and hunger were taking their toll on me. I was used up, resigned to fate.\n If it hadn’t been for a peal of whale-song, I fear I might never have come to my senses.\n I reluctantly opened my eyes, pushed myself up, saw a dozen or more small cloud whales flying alongside mine. I had no idea when they’d arrived. They flocked around and beneath my whale, chirping and hooting, not at all mournful-sounding, but vigorous and resounding, their calls spreading far between heaven and earth.\n Judging by their size, they seemed to be juveniles. They’d probably followed their mother along the Golden Shipping Belt, traveling amid the brilliance of stars and moons. But after reaching the Golden Sea, they had not yet matured, and their mother was harvested. All they could do was cry out as they cruised the sea of clouds. This was dangerous. If they had encountered a whaling ship, the only possible outcome would have been death.\n Luckily, they’d come across us instead.\n My cloud whale’s spirits seemed to lift: it gave a sort of whinny in response to the calves. During my two days with this massive creature, this was the first vocalization I’d heard that seemed to express a warm feeling.\n The calves erupted with whale-song, one after another, darting about excitedly. I noticed that no matter how they flew and gamboled, they never went higher than my position on the adult whale’s back.\n “Hey, Big Grey, I can’t tell.” I tapped on my whale’s head, and fancied I saw a smile in its eyes. “Were you once as spirited as these little ones?”\n After that came out of my mouth I sat there, stupefied. Had I just given this creature a name?\n The first time we met, I named her Frond in my heart. I don’t know why. Perhaps it was the lakeside willow leaves swaying around us. Perhaps I foresaw that someday, far away, she would fall like an autumn leaf toward her doom.\n But it turned out she didn’t appreciate being so casually named. Naming was an important task to entrust to someone, she explained. It meant identifying the unique attribute that defined someone. It was a big responsibility.\n Later, when she lived with me, she gave names to all my plants, appliances, and furniture. My computer became Square Squared, the bookcase Professor Verbose, the washing machine Roll On, the bedroom door Little Shady, the toilet Mr. Imperfect, the sofa Longfoot. After naming everything, she turned to me and said, “Your name is Azuki Bean, because you can’t get enough of them. Now that I’ve named everything here, it’s all mine. Relax, I take responsibility for all of you. I’ll always take care of you.”\n But later, when the cloud whale research program on Goliath was recruiting, she signed up without a second thought. She left hastily, not even saying goodbye to her Square Squared, Professor Verbose, Roll On, Mr. Imperfect, and Longfoot.\n I put the urn to my ear, heard a faint echo of blowing wind. I returned to observing the whale calves.\n Cloud whales were white, like the clouds they were named for, but upon careful examination one might discover variations. With nothing else to do, I began to name the whales around me. One had long pectoral fins, so I named it Wild Goose. A particularly fast one became Flicker. The one with the short flukes became Little Nubs.\n A wretched hoot interrupted my reveries.\n Little Nubs had been struck by an artillery shell, but the shell hadn’t detonated. Instead, it had disgorged dozens of electrodes, which fastened all over the calf’s back. A wire trailed from the back of the shell into a cloud bank.\n The clouds parted to reveal a Castle airship, Gale Force Three grade.\n An immense drumming sound came from the vessel, the voice of a high voltage transfusion. Little Nubs shivered from head to flukes, ceased its miserable keening. Rendered unconscious by the current, it floated aimlessly through the sky. Two Ghost-Four ships sallied forth from the Castle, bristling with hypodermic harpoons. Two of these launched, and stabbed into Little Nubs’ limp body. High-pressure pumps issued a gurgling sound. Cloud whale blood began to flow, through the tubing attached to the harpoons and into the ships.\n The pumps would only need half an hour to drain Little Nubs dry. In the scheme of things, a single cloud whale didn’t have much F938-rich blood. And draining a whale also meant removing it from the sky. While draining the life from these creatures, humanity was also taking away their spirit, that which made them essentially what they were: their ability to fly.\n Extreme pain forced Little Nubs to regain consciousness, but the voltage still rendered most of its body paralyzed. It couldn’t struggle free. It pumped its little flukes, whined pitifully, seeming to sing its own elegy.\n “Stop it!” I screamed, but my voice was lost in the wind. All I could do was stomp on Big Grey’s back and shout hoarsely, “Why aren’t you moving? Fly!”\n The juveniles cried out as they scattered to the four winds. But the Gale Force Three vessel seemed to lay eggs, issuing dozens of smaller ships, an orderly division of labor, and more than enough to hunt down each whale. Judging by the familiar make of the ships, all were specialized poachers. I was afraid that none of the whales would escape.\n Big Grey’s eyes began to change, their shade darkening. It issued a deafening cry. The calves seemed to hear, were guided by the adult’s voice. They rallied to Big Grey, who suddenly and precipitously dove. The calves followed.\n This caught me off guard. I failed to get a firm hold, and I tumbled off Big Grey’s back. The wind howled in my ears. This time I knew I was done for. I held onto the urn and shut my eyes, but the bone-crushing death I expected didn’t come.\n I plunged into warm seawater. I was in the Golden Sea. Big Grey had flown out of the wilderness and come very far, the sea its unwavering goal. Just like mine was to return with Frond to Earth.\n Big Grey and the calves plunged into the ocean, quickly vanishing into the depths, leaving behind nothing but whirlpools. Big Grey’s whirlpool nearly sucked me down. Kicking my legs, I barely stayed on the surface. The watery waste extended to the horizon, barren except for surreal tubing hung between sea and sky. These were extracting seawater for high-orbiting space stations.\n The surface already showed no trace of the whales, to my relief.\n The Ghost-Four ships descended in steep arcs, sweeping low over the ocean. I cried out as one passed near me, and it came about and braked. After I promised the pilot a thousand Union scrip, he extended the ship’s exploration claw and lifted me out of the water.\n He was alone in the cabin. He gave me a new protective suit, a few bottles of water, and a chunk of hardtack. While I wolfed down the bread, this tall, scar-faced man looked me up and down. “Brother, how did you end up alone on the sea? Did your ship crash?”\n I gulped down water and nodded.\n “You’re damn lucky we were around. Just now we were hunting a pod of cloud whales. We nearly had the bastards too.” He shook his head. “But the leader of this pod was Ghost Eyes. And not catching that one is normal.”\n “Ghost Eyes?” I asked, putting down my water.\n “Its eyes turn black, just like they’re filling with black ink. This beast is well known among us poachers. We kill cloud whales, and it kills us. Ferocious bastard. Blade-class ships it just chomps and swallows up. As for Ghost-class ships, it has smashed a dozen or more to pieces. People say it even knocked a Gale Force out of the sky. The black-market bounty on it has reached a million Union scrip.”\n “What’s its grudge against you guys?”\n “They say it used to be the leader of a pod, brought them along the Golden Belt, entering the Golden Sea, the whole thing. The first time they came out to fly, they were discovered by some of us.” He smiled enviously. “Think of the profit! Fifty or more cloud whales! They were drawing blood day and night. At last they didn’t have enough homeostatic barrels. They were pouring blood directly into ship holds, up to men’s thighs. Later, when they sold, they took off their trousers, because even the blood congealed on them was worth a few scrip.” His malevolent grin twisted the knife scar on his face. “At that time only Ghost Eyes escaped. Its progeny and companions were killed, so it began to retaliate. Between you and me, I was scared shitless just now. And I saw something strange on its back, at one point, when I got close. Did you happen to catch a glimpse?”\n I shook my head, continued to gnaw on the hardtack. A voice issued from the communications module: “Knife Smile, what the hell are you doing down there? Get moving.”\n He winked at me and put a silencing finger to his lips. “How are things up there?”\n “We can’t get a fix on that pod. Luckily we snagged one of them. Once we’ve drained it we’ll head back to the Citadel for a rest. Been runnin’ all night. We’re tired to death.”\n “Stay frosty and get every last drop,” Knife Smile said, then turned to a control panel and initiated pre-flight.\n My stomach somewhat appeased, mouth no longer dry and rough, I hugged the urn tightly. Its hard ridges and corners pressed into my stomach. I took a deep breath, walked up behind Knife Smile, and brought the urn down on the back of his head.\n He toppled without so much as a whimper.\n I placed the urn on the console and said, “Frond, forgive me.”\n I found clues and inklings on her social media page.\n At one point she hadn’t updated for three days. I incessantly refreshed the page, starting to feel uneasy. I fretted, couldn’t let it go, finally had to leave a message.\n But it was Michael who replied. I checked out his page and saw many photos of he and Frond together. Her new boyfriend, then. He invited me to a video chat. I accepted after some hesitation.\n “Hello,” he said. “You must be Azuki Bean. Frond talked about you often.”\n He had called her Frond. I burned with illogical rage, but on second thought, surely Frond had been using the name of her own volition. Lightyears away, she was still using the name I’d given her. She hadn’t forgotten me. Welling with joy, I asked, “So what about Frond? Where is she?”\n “Frond,” he said. “She’s dead.”\n I struggled for words and finally managed a “What?”\n “She died three days ago.”\n “What do you mean? That’s impossible!”\n Michael stood inside the chat frame, silently watching me. His expression was both cold and sad. I felt a dark tide rolling over me. He wasn’t joking, but I refused to believe. After a long silence, I opened my mouth, but couldn’t find my voice. I beat my chest until words came out: “Frond is dead?”\n “Yes.”\n That affirmation twisted in my brain like a knife. Frond was dead. A volcanic eruption, thick smoke blotting out the sun. Frond was dead. An earthquake sneak-attacking a city, mansions and towers toppling like a child’s building blocks. Frond was dead. An asteroid from some remote part of the cosmos striking Earth, a shockwave engulfing the globe, toppling mountains and overturning seas.\n I sat down on the floor.\n Michael said she’d died while rescuing a cloud whale. After some routine observation work in a rural area, she was returning to Research Retreat Valley when she discovered a pod of ground-stranded cloud whales. Seven or eight calves surrounded a titanic cow, presumably the mother. The cow had been severely injured. Her underbelly was savaged, torn open and bleeding profusely, dying the mountain rocks gold. She was trying to take off, but she’d lost too much blood. Every time she managed to rise a few meters, she immediately crashed back down. The calves surrounding her whined plaintively.\n Frond immediately contacted the Valley and demanded assistance, but the cow was already on the verge of death. She wouldn’t last the two hours it would take for the team to arrive. Frond burned with anxiety. She finally resolved to haul the cow to a river a kilometer away.\n Securing the cow wasn’t complicated. Frond took advantage of the creature’s futile attempts to lift off, casting three load-bearing belts beneath her. She was belted about the head, middle, and tail by the time she’d spent the last of her strength. She lay there quietly, unable to struggle as the belts tightened. But there was still a problem: Frond’s research vehicle was lightweight. It was probably too small to tow the massive two-hundred-ton cloud whale.\n The lamenting cries of the calves spurred Frond on. Despite Michael’s cautioning voice in the communicator, she opened up her anti-grav engine to maximum power. Rocking and swaying, she hoisted the cow into the air and flew toward the river. The calves ceased their keening and timidly followed.\n Frond piloted carefully, giving that short kilometer a half hour. When they were above the river, Frond released the load-bearing belts, and the cloud whale dropped into the river. This artery fed into the Golden Sea. Its waters contained F937.\n That’s when things went wrong.\n The overloaded anti-grav engine rapidly heated up, fusing already-decrepit circuits. The ship reverberated with cough-like death pangs, and suddenly plunged into the river. The vehicle filled with sparks and flaring electrical plasma. Frond didn’t have time to free herself as river water flooded the cabin.\n By the time she was dragged out of the water, she was already white, ice-cold, and not breathing.\n “It was my fault,” Michael said. “If I had spoken more forcefully, perhaps she would’ve listened to me, and let the whale be. But I thought maybe she could pull it off. Although it was well beyond the design specs of her vehicle, none of us foresaw what happened with the engine.”\n I wasn’t really hearing him anymore. I’d gone numb. Suddenly I remembered what Frond had said to me when she left. I struggled to stand up. “What have you done with her?”\n “What do you mean?” Michael said, choking. “She’s dead.”\n “Her remains.”\n “We’ve had her cremated. We’ll bury her ashes on the side of the valley opposite the institute.”\n “No,” I said. “I want to bring her home.”\n Michael was nonplussed. “According to Union law, on Goliath—”\n “To hell with the Union. It’s what she wanted, if she died out there among the stars. I’m bringing her ashes back to Earth, and burying her beside our willow tree.”\n My fanaticism scared Michael. He thought about it for a bit, but finally agreed. After all, I’d been with her the longest. Michael had been her last love, but I had to carry out her final wish.\n “I don’t have time to bring her to Earth,” Michael said apologetically. “Besides, it’s illegal.”\n “I’ll come get her myself.”\n It would be my first time traveling into the depths of the cosmos. My fear of flying caused me physical torment, but thinking of Frond resting in a cold urn, I knew I would have to confront my fear. I had to bring her back, even if it meant crossing a sea of stars.\n “What happened to those whales?” I asked.\n “We found them about a hundred miles from the Golden Sea. They’d been bled dry by poachers.”\n I had never understood why Frond loved cloud whales so much. But now, after flying on Big Grey’s back for so long, I began to see. These animals embodied her spirit:\n From their breeding grounds in the seawater of Xorchin, migrating the vast length of the Golden Shipping Belt, finally plunging into the Golden Sea—this was the life of cloud whales. They began in a sea and ended in the clouds. They threw off the shackles of gravity, their only companions wind and starlight. They were unlikely to ever touch dry land. This life had captivated Frond. She had to leave me, and having endured the hardships of her long journey, arrive here on Goliath, following the cloud whales.\n Perhaps she had never really loved me, or Michael. But she’d truly loved the unbridled, soaring cloud whales.\n I realized that Frond’s wish to be brought home had been for my comfort, not hers. As far as she was concerned, boarding that ship bound for Goliath hadn’t been a departure.\n She’d been homeward bound.\n “Knife Smile, why the fuck are you dawdling?” The voice from the communication module was impatient. I stared at the console.\n I had helped design the Frontier Development Company’s ship operating systems. I knew that voice-activated control required voice verification—but gestural control didn’t. I thrust my hand into the console’s panoramic projection, shifting it, and the ship obediently turned, and began to ascend.\n Little Nubs was still being drained up there. Its mournful calls were weakening. It had at most ten minutes before it was completely drained, at which point it would plummet into the sea and become a floating corpse.\n “Hang on,” I whispered, powering up the engine. I stuck my right palm into the image, moved it in a U-shaped trajectory, and returned it to my chest.\n The ship kept rigorous pace with this movement. I cut through Little Nubs’ right-hand exsanguination tube like a sword, passed by the calf’s head, and came back around to cut off the left tube. The blood flow to the ships stopped, and now blood sprayed into the sky, was scattered and diluted by the wind until it resembled autumn leaves.\n Little Nubs whistled sharply, pumped its flukes, and dove for the sea. The two ships that had been draining the calf immediately gave chase. I moved to intercept, but they evaded me. This delay gave Little Nubs the time it needed. It was bound for the vast Golden Sea, the warm waters of which could rejuvenate the calf’s blood, and heal its wounds.\n Eventually it would be able to fly again.\n “Knife Smile, are you fucking crazy?”\n “Motherfucker, you almost killed me just now!”\n “What the fuck? Respond!”\n The communication module reverberated with clamoring voices, some full of doubt and distrust, others damning and cursing Knife Smile. I looked through a porthole. The dark of night still predominated, but dawn was brewing, the first weak rays of day lighting the horizon.\n The Gale Force ship slowly descended, halting some thirty meters from me. It seemed like an ancient fortress hanging there, impregnable. In the pre-dawn gloom it cast an even darker shadow that enveloped me. Ghost-class ships were scattered about it in chaotic profusion.\n The bastards. I gently caressed the urn, watching the poachers array themselves like a battle group.\n Somebody with a low voice cleared his throat, and all chatter vanished. There were a few moments of silence. “Knife Smile, you have ten seconds. If you don’t respond, we’ll recover your ship by force.”\n The hand against the urn felt like it was burning. Frond, you’re with me, aren’t you?\n “Ten,” the poacher warlord began to count.\n It was still dark outside. I squinted at the still-weak vanguard rays of dawn, and they seemed ground down and broken by the darkness. When would the day finally burst forth?\n “ . . . seven, six, five . . . ” the voice counted.\n The horizon was aglow, the dark not so concentrated as before, the heavens turning a dark umber blue.\n “ . . . three, two—” The voice suddenly paused. Sounding flustered, he went on: “Dammit! What is that?”\n “Cloud whales?” somebody stammered.\n “Impossible!” said another bewildered poacher. “How could there be so many?”\n “It really is cloud whales! God!”\n I brought my ship about. When I beheld the scene, my tears began to flow. “Frond, you really should be here to see this.” I pressed the urn close to the porthole.\n Countless whales hovered before us, several hundred at least, perhaps more than a thousand, big and small, high and low. Big Grey was in front, but there were quite a few larger than it. They floated silently in the sky, facing off against the thieving humans and their ships. The dawn finally broke, escaping the horizon, skewering the darkness like a sword. The golden radiance spread across the bodies of the cloud whales, from flukes to heads, seeming to deck them in golden armor.\n Big Grey opened its mouth and roared. The other cloud whales followed suit. The deafening chorus made the surface of the Golden Sea tremble, conjuring waves and whitecaps. The night was broken, repelled. I covered my ears, weeping with joy.\n Even the fortress-like Gale Force warship, faced with such an enemy, had no sure chance of success. The poachers slowly retreated. After they’d gone a safe distance, they turned, and spouting ion beam thrust, quickly vanished into the distance.\n Only I remained, hanging there above the sea.\n Big Grey flew under my ship, buzzing with a low-frequency hum. I put on a spacesuit and jumped out, and Big Grey caught me on its back. It gave a long cry, suddenly accelerating. The other cloud whales followed. We charged east toward the two risen suns.\n The long night had passed, and day was waxing. The magnificent dawn gleamed on the sea, delineating waves as they came together and parted. When the suns got a bit higher, they seemed to melt into one. The light was fierce. I opened the urn.\n “Frond,” I said, “I think I can go on alone. Thanks for accompanying me this far.”\n I upended the urn, and bone ash blew across the sky like a white mist.\n Frond, fly! Fly away and never land!\n Seeming to hear this silent call, a morning wind whipped up, intense, screaming. The ash, which had been descending, was raised up and scattered. It seemed to vanish. At that moment, my Frond was the morning wind, the suns, the Golden Sea’s limitless waves. She had at last become one with this world.\n Originally published in Chinese in Science Fiction World, April 2017.\n Translated and published in partnership with Storycom.\n Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}