{"fingerprint": "jqZq87q4y3sfjaMqQyltQa2lAyg=", "sitename": "Clarkesworld Magazine", "title": "Against the Stream by A Que, translated by Nick Stember", "author": "A Que; Nick Stember", "date": "2015-01-31", "source": "https://clarkesworldmagazine.com/a_07_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Against the Stream by A Que, translated by Nick Stember", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3020 words, short story\n Against the Stream\n 1\n The illness came so suddenly nothing could be done. When he woke it was yesterday.\n At first he thought the problem was with his phone’s display, but then everything that happened had happened the day before.\n His boss yelled at him because he hadn’t finished his reports. Sentence for sentence, word for word the same. That night he went home to an empty house, confused. Feeling tired, he got into bed and fell asleep. When he woke, time had moved back another day.\n He didn’t finish the reports this time, either.\n It was then that he finally understood. While the world continued to move along with the flow of time, he had turned and gone against the stream. Day-by-day, he was entering the backflow of time.\n It was hard to get used to at first. His life had been painful, so the thought of a second time through was unpleasant. Over and over again he tried to stay up all night, tried to change course. Despite his best efforts, he found himself powerless to resist the undertow of exhaustion.\n Walking into the office one day, he beat his boss bloody, trying to alter the timeline. After being sent to jail he woke up at home. When he got to work his boss was still sitting in the office waiting for him, uncaring—his beating wasn’t until tomorrow.\n 2\n Eventually he got used to days like this, and life and work went back to normal. It was around then that Xiao Wei left him to live with the other man. Although he had thought it would hurt, it wasn’t all that bad. Having been through it before, he just felt numb. No matter how deeply his memories might hurt, it was always all better when he woke.\n Six months later—or, six mother earlier—a new person appeared in his house. “I think we should get divorced,” he heard himself say to his wife. Only thirty-two, her face was marked with wrinkles and she was beginning to slouch. She stared at him blankly, and then nodded like she had the first time.\n While his wife packed her things he stood by her side, watching. Six months had passed and she looked more like a stranger or an old friend than his wife. He didn’t think he would ever see her again, but thanks to the back flow of time they’d been reunited for their separation.\n In the end, his wife left with her things. He stood on the stairs, watching the shrinking shape of her back in the slanting light of late afternoon, moving ever further away until it disappeared completely into the crowd. He’d watched her leave then too, thinking that was the end. But now he knew they’d be seeing each other again.\n As expected, he woke to the smell of breakfast the next day.\n “I’m going to market,” she said, standing in the doorway with her back to him. “Go ahead without me. You should be getting to work.”\n He nodded before realizing something was out of place. His wife often came home empty handed, without telling him where she’d gone. After she left he snuck over to the peephole. Instead of going out, she walked toward the staircase down the hall.\n Tiptoeing after, he followed her all the way up to the roof.\n He heard a soft sobbing—a familiar sound after so many years together.\n So, he thought to himself, she knew about Xiao Wei all along.\n 3\n He spent the day in a daze, wondering how she had found out. Just before getting off work, Xiao Wei sent him a text message: “Stay, don’t go.”\n Staring at the screen, he wondered how many secrets were hidden in this tiny rectangle. Scalding hot in his hand, he felt the echo of the bomb that he’d set off the day before.\n He started to delete their texts, their videos, their photos—until he realized it was pointless. He was going back to yesterday. In time his wife would forget the secret she had uncovered.\n He shrugged his shoulders and put the phone back into his pocket.\n One by one his co-workers left until he and Xiao Wei were the only ones still in the office.\n Soon, the lights went dark row by row. She walked over in the dim light, leaning over to whisper things that made him blush.\n That was Xiao Wei—charming and fearless, bringing light into even the darkest corners. He’d fallen for her so easily, surrendering himself so completely to desire he thought it was love—the second time he’d fallen in love.\n But now, looking into her pretty face, his mind was filled not with lust or pleasure, but the memory of her abandonment into the arms of another man six months from now. He stood and looked down at her. Outside, cars drove past, sending flashes of light through the windows to catch across his glasses.\n “What’s with you?” Xiao Wei said, frowning. “You were into it yesterday.”\n “No, I won’t be.”\n Xiao Wei didn’t understand, but by then he’d already left.\n 4\n The city at night was busy with a quiet constraint. As he walked alone, the cars filed past, their headlights drawing across and over, like in a scene from an old movie—one where something important is about to happen.\n Just then, he heard shouts from an alley to the right. A group of young men were beating a drunk and he was surprised to find himself telling them to knock it off. Glaring, and cursing, they ran away.\n He walked over. In the light of the streetlamp he could see that the drunk’s face was covered with blood. Underneath the blood an old knife wound ran from his right eye to the corner of his mouth. The terrifying scar had left two ridges of skin peeled back on either side, and it writhed worm-like deep within his cheek.\n He fumbled for a moment, before helping the drunk up.\n “You’re hurt, let me call you a cab.”\n Wheezing, the drunk laughed crazily.\n “It’s okay. No matter how bad they hurt me I’ll be fine tomorrow.”\n His blood froze. Finally he said, “By tomorrow, you mean yesterday?”\n The drunk stared, his expression under the streetlamp fierce and strange. The harsh light filled his lifeless eyes, like two deep pools. Suddenly laughing again he said, “You’re a backwards man, too, aren’t you?”\n He felt like crying.\n “It’s really rare, you know, our illness,” the drunk said as he struggled to sit up. “Harder to figure out that way. Time is like space—usually they go together. Walk ten minutes down the street, time and space are moving along with you. But then maybe they break apart and you move forwards, but time moves backwards—like with us. We’ve fallen into a time trap. That’s what it means to be a backwards man.”\n He fell silent.\n After a while the drunk continued: “It’s hard for some of us, this illness. It’s like being in a crowd at night and then suddenly turning to go the other way. They all keep going and you just get further and further away. Until you’re the only one left, walking all by yourself back to the start.”\n 5\n Have you ever had someone in your life—the kind of person you’d thought was going to stay by your side until the very end? There they were, the day before yesterday, but then the second after next they’re gone, evaporated into time.\n You don’t know it’s happened yet, but he’s already turned. He’s behind you, in a time you can’t reach, walking towards the gray twilight of the other side.\n He sat in the gathering darkness, his mind filled with an absence of hope.\n 6\n “There’s no scientific basis for anything I’ve said, of course. The theory of relativity, quantum mechanics, neither one can explain our illness,” the man said, seeming to sober up. “My research has dragged on for years now, but I’ve got nothing to show for it.”\n “How long will it last?”\n The drunk shook his head. “I don’t know, but I first became sick when I was seventy-five. I thought I was dying, but instead I’ve spent the last fifty years coming all the way back to today.”\n 7\n His wife was asleep when he got home. Standing in their bedroom, he watched her sleep. For the first time ever, he noticed the way that she curled up to one side, like an infant, leaving the rest of the bed for him. Only the wrinkled corners of her eyes reminded him that she was not a child. Her health was poor because she didn’t take care of herself—three meals a day in a smoky kitchen had made her old before her time.\n Over the ten years of their marriage he’d watched her age. He’d told her to take better care of herself more times than he could count, but every time she’d just nodded and said, “uh-huh.” She was so clumsy that she’d never figured out how to use skin products correctly.\n And now he was going to watch her return to her youth.\n The process was hard to describe. After more than ten years together, he thought he already knew everything there was to know about his wife. He was surprised to discover so many new things in the rewind of his life.\n Things like the fact that his wife used to like to eat sweet and sour fish, or watch Korean movies—movies, not soap operas. He watched his wife crying while she watched the TV.\n He wondered when he started to fall out of love with his wife. Had their love gotten lost in in the detritus of the everyday? Or was it the years that had accumulated across her brow, day by day, as she grew older?\n As time passed, his wife became beautiful again. Without years of sleeping curled at the far side of the bed, she stopped slouching. Watching these changes, he was overcome with guilt. When their anniversary came, he made her favorite dish—sweet and sour fish.\n That was the first time he’d ever seen his wife cry from happiness. Clapping her hands over her mouth, her eyes flushed red with pleasure until she finally managed to say, “How did you know?”\n “I’m your husband, aren’t I?” he said.\n His answer left her speechless.\n Taking hold of her shoulder he said, “It’s been my fault all along, but the past is the past. I’ll be a better man in the future.”\n His wife nodded. Inside, he felt himself sigh. What future? With everything moving forwards and me moving backwards, what good is it to repent now? It’s all pointless.\n Around the time his wife began to get her looks back, her zest for life returned as well, and he found that she had more and more to say. It was something that had always bothered him, and he remembered asking her if she could be quieter.\n Now he wondered if he had been the one who had turned the air at home into a stagnant pool of water, his wife’s words becoming fewer by the day, her body curling more by the night.\n Whenever his wife had something to say, he tried instead to put down what he was doing and listen to her talk. As a backwards man, he didn’t have to worry about the work he’d set aside. The whole mess would be wiped away soon enough.\n He got so used his new way of living that he soon came to enjoy it. How could it be possible, he thought to himself, that I ever disliked this woman? A million Xiao Wei’s couldn’t compare to her.\n Ten years passed.\n It was the evening of his proposal. In the backwards flow of time his memories had been unable to keep up, leaving things confusing and unfamiliar. But he still remembered one thing from that evening:\n He had rented thirty remote control helicopters and hung colored lights from them. They formed a heart in mid-air, leading her to him. Holding roses and a ring, he knelt down on one knee and asked her to marry him. The air was rich with color, as if all the stars in the sky had fallen down around her.\n When she cried, the light tore her tears into tiny stars.\n 8\n Later that same evening, they walked hand-in-hand back to their apartment. They didn’t have a house yet—in a city full of the rich and successful, they were still struggling to make ends meet. And yet he already knew that they were happier now than they would be when they had a house and car of their own.\n As they passed an alleyway, he was surprised to hear a strange voice suddenly call out his name. Peering into the darkness he saw only a dim figure, his face unclear.\n Nervous, his wife squeezed his hand.\n “Don’t be afraid. It’s just me,” the man in the alleyway said. “You meet me later.”\n His wife didn’t understand, but he did, right away.\n “An old friend,” he explained to his wife. “Give us a moment, okay? We need to talk.” With that, he walked into the dark alley, finding a boy of fourteen or fifteen waiting for him.\n “I’ve discovered a way to cure our illness,” he said.\n Shock rolled over him. After so many years of living as a backwards man he’d become accustomed to it. But now the boy was reminding him that he’d been sick all along.\n “We aren’t the only ones who’ve come down with this condition, you know. For the past decade, I’ve been traveling around the world. One day, I found a scientist at MIT who had it,” he explained. “We did so many experiments that I lost count. But eventually we found the answer!\n “As long as you live your life exactly as it happened the first time around, making the same decisions at the critical junctures in your life, then eventually you’ll fall asleep and wake up back on day one. Time and space will rejoin and you’ll go back to before the split. It will be as if none of this ever happened, and you’ll forget you ever were a backwards man,” the boy said.\n “Does it really work?” he asked.\n “It works. I know, because I’ve just tried it,” the boy said, looking right at him. “The most important decision in my life just happened—running away from home after my dad cut my face.”\n It was only then that he noticed he was hurt, the blood spreading thickly and profusely like a rank weed across his face. No wonder he was hiding in the alleyway.\n “What I’m seeing now is different from anything I’ve ever seen before. The world is thawing—it’s hard to explain. I’m so tired, I keep falling asleep. You’re a nice person. You helped me before so I did my best to stay awake so that I could tell you. I just hope you haven’t missed your life-juncture already. Once it’s gone you won’t be able to stop yourself from going all the way back to the end of time. No one will remember you because you’ll never have existed in the first place.” The teen’s voice became weaker as he spoke, and now he closed his eyes and stumbled backwards. “I’m going back now . . . I’ve been going against the stream of time for sixty years, and now I’m finally going . . . ”\n When he fell to the ground there was no sound of a body hitting the pavement—a split second before impact he disappeared into thin air. He knew that the young man had gone back his starting point, back to his dying, gray-haired self.\n He staggered out of the alley where his wife was waiting for him. “What happened to your friend?” she asked.\n Saying nothing, he took his wife home where he quickly fell asleep, his mind filled with new concerns.\n He already knew what the the most important moment in his entire life was. It was the day he met his wife in school, when he’d walked up to her in the quad to ask the way. Finding himself completely overtaken by her beauty and enthusiasm for life, he’d given everything to be with her. She’d been the reason he had come to the city in the first place.\n Their lives had been bound up together from the moment he asked her that first question.\n 9\n On the day he would meet his wife, he got up early and left the dorm, waiting for her on the path through the quad. The cherry blossoms had just begun to bloom, filling either side of the path with pink. She soon emerged from the haze of blossoms.\n He steadied himself, willing his mind into submission as he began to walk towards her. He’d already practiced the words a thousand times. Anytime now, he would say them. Every single detail was exactly the same as before, down to the expression he wore on his face.\n The closer she came the more clearly he could see her. She was nineteen, wearing a flower-print dress. Her jet-black hair hung loosely about her shoulders, and her face was prettier than even the cherry blossoms. Suddenly he saw her, ten years from now, looking old and curled at the edge of the bed.\n Any minute now, he would go back to the day he got sick. He wouldn’t remember the things that had happened over the past ten backwards years. He’d still cheat on her. He’d still force her to leave. He’d still watch her back disappear into the crowd . . . time would pass as before, and the bright young face before him would become old and withered before its time.\n He faltered.\n It was a spring morning. He walked past the pretty young woman who would have become his wife and didn’t ask the way, sharing only the few cherry blossom petals that fell across their heads.\n Originally published in Chinese in ONE·YIGE VOL.846, January 31, 2015.\n Translated and published in partnership with Storycom."}