{"fingerprint": "B3b4rCWXs0jjuhTgj67ke1ykF1E=", "sitename": "Clarkesworld Magazine", "title": "Song Xiuyun by A Que, translated by Emily Jin", "author": "A Que; Emily Jin", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/a_10_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Song Xiuyun by A Que, translated by Emily Jin", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10150 words, novelette\n Song Xiuyun\n After dinner, Wu Huang makes a dash for her brain-control helmet, barely having the patience to bring her dirty dishes to the sink. Through the closed doors of her room, she can hear her mother complaining again, but thankfully the helmet has blocked out most of the noise, leaving only a faint trail of incomprehensible sounds.\n She activates the helmet. Soft, spongy probes extend from the inwall of the helmet and attach themselves to her crown and temple. Transmitters installed within magnify her brain signals and connect them to her car parked in a garage a few hundred meters away.\n Wedged in between a barren, rocky wasteland and a rapidly evolving metropolis, Wu Huang’s hometown is like a tiny ant caught in the crack between the most backward and the most progressive. Brain-controlled cars are no longer a novelty in the big cities, but in this tiny town, it’s still rare enough to be awe-inspiring. Every time Wu Huang picks up a passenger, they always gape at the empty driver’s seat.\n Of course, no matter whether in a big city or a tiny town, brain-controlled cars are still a luxury. In order to buy her car, she not only poured all her savings into it, but also resorted to bank loans.\n Tomorrow is Chinese New Year’s Eve. Everyone will be out partying and meeting friends—good opportunity for some quick money.\n The black car glides smoothly out of the garage. Sprawled out on her bed, Wu Huang shifts into a more comfortable position. The holographic interface projected by the helmet captures the car’s surroundings as well. She sees that it has started to snow. Fluttering snowflakes, soft and pale like feathers, have already covered the ground in a thin silver veil.\n The town had been snowless for as long as Wu Huang could remember. Assuming that this year will end up just as gloomy and bleak as every other year, the unexpected snowfall on the night before New Year’s Eve is a pleasant surprise. However, the snow also means bad news for business—there are very few people out on the streets and even fewer ride requests. She only managed to pick up a pitiful two passengers in total after hours of roaming around. The snow on the ground, gradually growing thicker as the night progresses, crunches beneath the wheels as she drives listlessly through the town. Not wanting to give up just yet, she speeds toward the Levitation Train Station.\n She waits. A few passengers finally exit from the arrival gate, but the cheaper, old-fashioned taxis are evidently the more attractive option to them. She cranes her neck and gazes at the night sky from the low angle lens installed on the car roof. Snow seems to be emerging endlessly from the dark abyss of the sky. Speck by speck, they drift through the night, painted into a shade of pale orange by the streetlight. The roof lens, soon buried under the snow, can no longer reflect anything but a white blur.\n Seems like business isn’t going anywhere tonight. Yet, as Wu Huang is about to head home, she hears a soft knock on her window.\n Through the window lens, she sees a mother and her son.\n The mother looks about sixty years old. Despite her small frame, she is carrying a huge backpack, her back hunching from the weight. The dim light of the streetlamp gives away the lines and creases on her weather-battered face. There’s a weary look in her eyes. Her son standing right next to her, however, is very different. Eyeing his tall, lean figure wrapped in a chic trench coat, Wu Huang decides that he’s fine-looking—just the perfect degree of elegance, not too over the top to be pretentious. Obviously another product of the city’s assembly line of elites.\n But the indifference on his face and his relaxed body posture, in stark contrast with how the old woman’s back is bent from carrying the huge backpack, makes Wu Huang resent him instinctively.\n “Cabbie, can you give us a ride?” The mother knocks on the car window again. Her heavy accent reminds Wu Huang of the mountain villages west of the town.\n The mother’s vulgar address feels like a prick. The little bit of respect she harbors toward the mother disappears almost immediately.\n “I’m not a cabbie,” she responds coldly, her voice echoing from the car speakers.\n She glances at her phone again. 0 new requests.\n “Then, um . . . ” hesitantly, the mother asks again, “Miss?”\n “No. I’m done for the day.”\n The mother mutters a disappointed “oh,” and turns to face her son. The son lowers his head to look at her, his face veiled in the shadow of the streetlamp, his expression indiscernible.\n “Don’t worry, Mom,” he says.\n Wu Huang is now curious. “Where are you going?”\n “To the West Bus Station.”\n The West Bus Station is the same direction as Wu Huang’s home. If she drops them off on her way back, the money might be able to cover, at the very least, her electricity bills for all the driving tonight. As far as Wu Huang is concerned, however, the West Bus Station is so old and shabby that it might as well shut down for good. After the establishment of the Levitation Train Station, most of the town people have abandoned buses entirely.\n “Are there still buses running if you go?” asks Wu Huang.\n The mother’s eyes light up at once. She nods eagerly. “Yes, there’s one at ten-thirty.”\n Wu Huang remembers now. There is one manually-operated bus leaving from the station every day at night. Its route, weaving through the creases of the mountain and following the rugged national highway, makes several stops at the little villages along the way. This single running bus is the last struggling breath of the moribund station.\n “Hop on then, I’ll take you there,” says Wu Huang.\n The mother won’t budge. “For how much?” she asks.\n “A hundred . . . a hundred and fifty.”\n Immediately, the mother backs off from the car. “This is too much. It only costs ten yuan per person to take the shuttle. Twenty yuan for two!”\n “Well, do you see any shuttles out here?”\n In the falling snow, the shuttle stop seems utterly abandoned.\n “But a hundred and fifty is way too expensive! How about sixty?”\n The seemingly endless bargaining is beginning to annoy Wu Huang. Several times, the old woman’s stinginess gives Wu Huang the urge to just leave her alone and drive away. Finally, they reach a satisfactory conclusion: since Wu Huang is going home anyways, she will drop the passengers off at where she lives, and they will travel the last two kilometers on foot.\n The mother and the son climb into the back seat. The mother keeps on breathing into her palms to warm her frozen fingers. When she lowers her head, Wu Huang can see that her crown is dotted with specks of white. Wu Huang can’t tell if it is from gray hair or from the snow. Maybe both.\n Wu Huang suddenly realizes that during their entire bargain just now, the mother and the son had been standing out there in the blizzard while she was physically sitting at home, wrapped in a warm blanket. They must’ve been freezing. Struck by a pang of guilt, she turns up the heat. “Is the temperature okay?”\n “Mmhm,” answers the mother. “Let’s go. We want to get there early.”\n It’s Wu Huang’s turn this time to gape at her. The mother has been unusually calm since she hopped aboard, not showing even the least bit of surprise at the lack of a driver. Wu Huang starts the engine. “Where did you come back from?” She asks as she projects her face onto the car monitor—this is as close as it will get to a real life conversation.\n “From Beijing.” There’s an edge of pride in the mother’s voice.\n Beijing? No wonder. “To visit family?” asks Wu Huang.\n “To take my son home,” the mother throws a quick glance at the man next to her. “For New Year.”\n The son, sitting with his back completely straight, nods in agreement.\n Wu Huang carefully studies the young man through the high precision lens in her car as she drives. He appears just a little over thirty. His sunken cheeks make him look slightly worn out, but his face is clean-shaven, showing that he regularly takes care of his appearance. For most of the time he remains completely silent, his expression a mixture of politeness and apathy—again, typical of a white collar from Beijing.\n “What do you do for a living?” asks Wu Huang.\n The son only gives her a tight little smile in response.\n The mother quickly interjects. “He’s a designer who works from home for Domain Co.—have you heard of the name before?”\n Of course Wu Huang has. Domain Co. is the developer of the mind operation system, the foundation of brain-controlled automobile technology.\n Now she finds herself looking at the mother and her son differently. “That’s really impressive!” she exclaims.\n “Yeah! My son has always been the pride of our entire village.” The mother’s expression livens up almost immediately. “He’s been away for seven years. At last, he can celebrate New Year at home this year!”\n “Seven years? That’s a lot,” responds Wu Huang. “But since he’s the one working in Beijing, aren’t you supposed to visit him there instead? Why are you bringing him back?”\n The mother pauses. A look of sorrow emerges on her face.\n “My son . . . he’s sick.”\n Song Xiuyun’s heart ached upon hearing that her son has fallen ill. Tie Zhu, who brought this piece of news back to the village, was not very helpful either. He scratched his head and explained, “How am I supposed to know? I ran into Ah Chuan in the supermarket and we chatted for a bit. He seemed very ill—I mean, he couldn’t even make it through a sentence without coughing. I don’t know what happened to him, though. He doesn’t usually get in touch with us. Maybe because he’s been making such a fortune . . . oh, also, don’t ever call me Tie Zhu again. I go by James in the city.”\n So Song Xiuyun had to call her son again. After a hasty “I’m fine,” Li Chuan said he needed to go.\n “Come back home for New Year, will you? You’ve been away for so many years . . . ” Song Xiuyun quickly added before he could hang up.\n “I don’t think so,” responded Li Chuan.\n “I’ll come visit you, then.”\n “Nonsense! You’ve never even left the village before, how on earth are you going to make it to the city?”\n Song Xiuyun thought long and hard after the phone call. Finally, she made a decision. She came to Tie Zhu holding one of the express mail receipts that Li Chuan once sent home and pointed to the unfamiliar address. “Tie—I mean, James—would you please help me buy a ticket? I’ll pay you back. I need to take my son home.”\n She walked the long, winding mountain road, squeezed herself into the back of a loaded motor tricycle to reach the national highway, pleaded until a passing truck agreed to take her to the provincial bus station and took the bus to get to the Levitation Train Station downtown. Finally, she boarded the train to Beijing. The only problem was that all the stewed meat and pickled vegetables she packed for her son were confiscated at the security check. All they let her bring was a small bag of salted sunflower seeds. Seeing how her carefully prepared gifts had all gone to waste, she erupted in anger and went into a heated argument with the security guards. Only did she stop when the guards threatened to throw her out. Wiping away tears, she gazed at the food mournfully as the guards swept them to the side like bags of trash.\n She arrived in Beijing at last. Everything about the capital city was beyond her imagination. It was even different from what she had seen on TV. All the people here relied on brain-controlling technology: wearing the helmet, they could drive cars and do work while lying in their beds. She supposed that was why the streets were a lot less crowded than expected.\n The day was dawning when she walked out of the Beijing Central Station. Exhausted after an entire night spent on the train, her body was trembling from the fatigue. She felt like a thin thread, hanging dangerously, that could snap in half any second. She found an open breakfast stall and ordered some rice congee. Twenty yuan for one bowl? When we make breakfast back home, we always put out an entire pot and all the villagers helped themselves to congee for free, she wondered with awe. Well, guess this is Beijing. She counted the bills in her pocket, then pulled out two ten yuan notes carefully and handed them over to the beefy shop owner. The shop owner threw her a contemptuous glance as he snatched the money from her hand.\n Song Xiuyun was not a stranger to that look. It’s fine, she thought. I’m about to see my son—\n The thought of seeing Li Chuan soon sent warmth and strength spreading through her body. Rejuvenated at once, she finished the congee in one gulp and stood up. She hailed a cab. When she was about to bargain a price—in the same way that it was done back in her village—the driver interrupted and told her that she would need to pay exactly however much the meter indicated. Her eyes were stuck to the meter throughout the car ride; her heart pounded as the number steadily grew.\n After what seemed like the longest journey, finally, Song Xiuyun and her two massive travel bags were dropped off at the gate of a fancy-looking residential compound. The guard, somehow very unwilling to believe that she had family who lived here, wouldn’t even bother to check the residents’ list for “Li Chuan” until a kind neighbor stepped in to help.\n The guard called Li Chuan’s apartment through the access control system. “Who is this?” After a long time, a voice answered lazily.\n Song Xiuyun squeezed forth and pressed her lips to the speaker. “Li Chuan, it’s mom. I’m here to visit you.”\n The person on the other end of the line went silent. The guard threw Song Xiuyun a suspicious glare. Thankfully, before the guard could speak again, Li Chuan’s voice rang through the speaker, “Give me a minute. I’ll come get you.”\n “A minute” turned out to be half an hour. When Li Chuan showed up at the guardhouse at last, tears rushed into Song Xiuyun’s eyes. Quickly, she lowered her head to hide the tears, afraid that someone would make fun of Li Chuan for it.\n But a hasty “let’s go” was all Li Chuan said to her. He turned around and began to walk toward the apartment building.\n Song Xiuyun hurried to catch up with his steps, dragging her luggage behind.\n “It sounds like your son isn’t exactly . . . the agreeable kind.” says Wu Huang. Forgetting that she’s wearing a brain-control helmet, she instinctively lowers her voice, as if to whisper into the mother’s ears.\n She regrets it at once. Thanks to technology, the surround speakers in the car project everything she says with clarity, so if the mother can hear her, the son can, too. She quickly throws the son a glance, wanting to see whether he’s mad; yet he only sits there, with the same tight smile on his face, not seeming to mind a bit.\n “No, he’s a good boy!” hurriedly, the mother defends her son. “It’s probably just because we haven’t seen each other for too long.”\n “Didn’t you say he was sick? He doesn’t seem sick to me.”\n The mother nods. “Yeah. When I first moved into my son’s apartment, I was so worried for him. But he looked healthy, and he was fit for sure—he could carry huge water buckets up the stairs without breaking a sweat! Except that . . . well, he spent most of the time alone in the study, and he rarely left the room. After spending a few days with him, I stopped worrying. It’s all Tie Zhu’s fault! He always exaggerates everything.”\n The car merges into the main lane. The blinding snow has turned the streetlamps into blurred orbs of light, lining the street like trees. Wu Huang speeds into the light forest. The turbulence caused by the car’s sudden acceleration sends more snowflakes into the air, swirling as they descend.\n Thanks to the empty roads, Wu Huang can still hold up the conversation without having to pay too much attention to traffic. “How was living in Beijing for you?”\n “It was hard to adjust,” says the mother as she shifts into a more comfortable position in the back seat. The heater in the car seems to have warmed her up. “You city folks are so different. For example, take this thing—this brain-controlled car—everyone in the city owns one of these. And robots, too! Brain-controlled robots that can act just like humans. They can do everything for you. Socializing, talking . . . even playing sports!”\n Wu Huang nods. Domain Co.’s latest product, the brain-controlled robot, is a must-buy for couch potatoes. There was a time when she went to a party of five where three of the attendees had robots come in their stead. The two humans and three robots had a wonderful meal-and-conversation together. Of course, the robots did not need to eat. After the party, they packed some food to go for their respective owners. Wu Huang also heard that you could put the robot on auto-follow mode: wherever the owner goes, the robot tails behind. Quite fascinated by the technology, Wu Huang has planned on buying one herself after she pays off her car debt.\n The mother vents on. “The cooking machine makes your dinner; the cleaning robot cleans your home. Why, apart from eating and emptying your intestines, this thing—” she points an index finger at her own head, “—can do everything for you. What’s the use of having arms and legs, then?”\n “It’s just more convenient this way,” Wu Huang sheepishly explains.\n “Convenient, yes, but it’s still a bit . . . ” The mother tries to find a word, but then she gives up. “I can’t describe. It looks as if everything is better, but it still makes me feel weird.”\n She’s probably trying to say that a life too “convenient” can make people lazy, thinks Wu Huang. True, many people have brought up this point before, but this is how things work in the modern era—people need to adjust to the advancements in technology, not the other way around.\n “It’s probably hard for you to adjust, isn’t it?” asks Wu Huang.\n The mother nods. “I asked my son to come home with me, but he wouldn’t agree. So I stayed with him for a few days. It was extremely boring, though—I was rather scared going into the city alone and I didn’t know anyone else in Beijing, so all I could do was stay at home.” She pauses for a second. “Oh, right, my son also owned a cat, Bean. But whenever I tried to play with Bean, like I do with all the countryside cats, it ignored me. It lay lazily on the balcony all day and did nothing. I guess even cats are different in the city. Living in Beijing is no better than living in prison!”\n “Doesn’t your son spend time with you?”\n “Well, he was busy. He spent every day locked up in the study. I wanted to take care of him, so I cooked all his favorite childhood dishes: stir-fried spicy chicken, fish stew with radish . . . robots couldn’t possibly do that for him! I bet he missed my cooking—he always finished everything I made. He only ate in the study, though . . . ”\n The son sits in silence as the two women converse, his face expressionless, as if he is entirely unaware that he is the protagonist of their story.\n There is a tinge of melancholy in the mother’s voice. “Apart from cooking, there wasn’t much that I could do for him. I couldn’t even understand what his work entailed—let alone help him! When he worked, I would go on walks in the living compound. Our apartment was on the first floor. My son also rented a spare basement room in the corner of the parking garage.”\n The car comes to a pause at the red light. “For extra storage space?” asks Wu Huang halfheartedly.\n “I didn’t know,” the mother responds. “He wouldn’t let me in.”\n Song Xiuyun stopped before the door to the basement. The parking lot’s light shone on her face diagonally, illuminating every wrinkle and spot on the left side of her face, yet leaving the right side of her face in the dark shadow. The sharp contrast accentuated the doubt and uneasiness in her expression as she mulled over whether she should enter.\n She has been here for almost ten days. Familiar with almost all the rooms of Li Chuan’s apartment, she has yet to explore the basement. Whenever she asked Li Chuan about it, he would tell her that he stored all his discarded works there—it’s my privacy, in his words, and she was not allowed to enter that room.\n Privacy . . . Song Xiuyun couldn’t quite grasp what that word meant. Back in the village, every family built their house along the feet of the mountain. All the houses, clumped together, were as close to each other as one could imagine. No one locked their door; when someone wanted to pay their neighbor a visit, they didn’t even need to knock. But now I’m in Beijing, she reminded herself once again. The city folks were a different kind. They built skyscrapers that blocked the sun and hid in cocoons of iron and glass. When you could do everything by wearing a helmet and commanding robots, why bother even speaking to other people? Her son, now, has also become one of them; he was an art person—oh, artist. Even though she didn’t understand, she would stay away from the basement room as long as it made her son happy.\n Instead of reaching for the doorknob, Song Xiuyun knocked on the door quickly. The sound of the knock gently echoed through the corridor. She waited. No one came to answer.\n When she returned to the apartment, Bean was just waking up from a nap. Basked in the last glow of the setting sun, the black cat arched its back and then reached forward to stretch out its muscles. It turned its head and shot her a look, leaped off the windowsill and lazily strolled into the bedroom.\n Look at it! thought Song Xiuyun in astonishment, not only do these city cats not catch mice—like what cats are supposed to do—but they don’t even want to come near humans. She understood that Bean didn’t trust her because she was a stranger, but she was surprised to find out that Bean didn’t like Li Chuan either, after living together for six years. Once, after Li Chuan refilled the cat food, he reached out to pat Bean’s head, but it evaded his hand. Only after Li Chuan stepped away did it approach the food bowl cautiously to eat.\n “All this city nonsense!” she muttered to herself.\n As usual, Li Chuan was in his study again. He didn’t even bother turning on the living room lights. Song Xiuyun emptied the bag of sunflower seeds onto a plate and brought it to the study. The instant she pushed the door open, she remembered privacy all of a sudden, and quickly turned the push into a light knock.\n Li Chuan closed his book. “What’s the point of knocking if you’ve entered already?”\n “Sorry, I forgot . . . it won’t happen next time,” explained Song Xiuyun, embarrassed. She set the plate next to Li Chuan’s books and looked at her son eagerly, “Here, have some sunflower seeds while you work. I salted them myself. You used to love it when you were a child.”\n Li Chuan threw a glance at the plate, and then looked up at Song Xiuyun. “Also, didn’t I tell you to never go near the basement? I beg you to respect my privacy!”\n “How did you—” Song Xiuyun’s eyes widened. Hasn’t Li Chuan been up here this entire time? But she stopped herself before she could blurt out the question. “—I’m sorry. I won’t go there again, I promise.”\n Upon seeing shock and nervousness on her face, Li Chuan sighed, and his voice was gentle again. “What’s the matter?”\n “Well, Chinese New Year is coming soon, and you haven’t prepared anything yet. Your fridge and kitchen cabinets are all empty. I checked the weather for tomorrow and it’s supposed to be sunny. Do you want to go grocery shopping with me?”\n Li Chuan frowned. “Aren’t you leaving soon? You’re not even here for New Year, what’s the point in buying groceries?”\n “You still need to eat, though. Or, maybe . . . ” Song Xiuyun paused. Her gaze was fixed on the man in front of her—her son. She could hear her own voice, trembling as she pleaded with him, “Come home with me for New Year. It’s been seven years since you last came home. Remember your nephew? He’s all grown up now! And—”\n Li Chuan cut her short. “I’m never going back there again! I already told you this when I left home. Just forget about it, will you?”\n Song Xiuyun did not respond. After a few seconds of silence, she switched on the lamp. Warm brightness lit up the room at once. “Good for your eyes.” she explained, then turned around to leave.\n Li Chuan picked up his book, but hesitated as he was about to flip the page. “Wait,” he muttered. “I guess tomorrow we should go shopping after all.”\n Song Xiuyun nodded, almost ecstatically. The sun was already down. Carefully closing the study’s door behind her, she realized that she had shut out the only source of light in the apartment. The attempt to find the light switch on the living room wall was unsuccessful—her eyesight has been deteriorating since many years ago, making seeing in the dark even more difficult. She whispered, “Open the light.”\n The system did not respond.\n “Turn on the light, please.”\n The gentle glow of the overhead lamp filled the entire living room at once. What appeared to be an ordinary wall facing the entryway was, in fact, an enormous monitor screen. The cartoon figure of a small robot emerged on the screen. Li Chuan had explained the concept of the smart home to Song Xiuyun, but she could never get used to how these things would pop up out of nowhere.\n “How do you feel trapped in that wall? It certainly looks uncomfortable.” said Song Xiuyun to the robot.\n The robot lowered its head, as if contemplating her question, and then looked up and grinned at her. “My home is this monitor wall, just like how your home is this apartment.”\n “This isn’t my home. My home is somewhere far away. Have you ever heard of a village called Hongan?”\n A map appeared on the screen, marked by over twenty red dots. “Here are all the Hongan villages in the world. Which one is your home?”\n Almost pressing her face onto the screen, Song Xiuyun examined the dots one by one, “I can’t tell. My home is west of Beijing. There’s a river that passes through, we call it the Guanyin Temple River, because there’s a temple in our village dedicated to the Guanyin Bodhisattva. Other villages alongside the river, though, have named it something else . . . ”\n As she murmured to herself, the red dots gradually disappeared one by one, leaving none but one. The map zoomed in, displaying a detailed satellite map of a small mountain village. Bungalows after bungalows with weather-battered walls spread out along the mountain range; wheat fields, high and low, surrounded the buildings. Only parched stalks were left in the fields, as the wheat had been harvested already back in the fall.\n “Look, this is my home,” Song Xiuyun pointed to one of the small bungalows with its back against the mountain.\n “Beautiful place,” the robot nodded in agreement.\n Song Xiuyun could not tear her gaze away from the map. “It’s almost time to plant the cole crops . . . ” she exclaimed, after a long silence. Then, she sighed softly and headed down the hallway toward her bedroom. The robot trailed behind her. As she walked into the room, it stopped at the edge of the wall. The screen and the living room lights dimmed.\n The next morning, Song Xiuyun and her son headed to the mall together. However, as they arrived at the subway station’s security check, Li Chuan suddenly halted. “The subway is too crowded. Let’s take a taxi instead.”\n “But we’re here already,” said Song Xiuyun. “You work so hard all the time. Why waste the money on a taxi? Besides, many people must’ve left the city for vacation already. ”\n Yet Li Chuan had already begun walking in the direction of the exit. Song Xiuyun, confused, could only trot along behind him.\n It was lunchtime already after they’ve done the shopping. “We probably won’t be able to eat until hours later if we go home now and cook. How about we eat out?” suggested Song Xiuyun, carefully. “You’ve been eating my cooking for a while anyways, I figured that it wouldn’t hurt to try something else once in a while.”\n Li Chuan shook his head. “We should go back.”\n “Saving money is important, but there are times when you need to spend, too! I have cash. It’s my treat today.”\n Li Chuan was quiet for a while.\n “But I really want to have the stir-fried spicy chicken that you always make for lunch.” he said.\n “Well, I obviously can’t compare to restaurant chefs . . . ” Song Xiuyun was stunned by Li Chuan’s compliment, but nonetheless she cheered up immediately. “Let’s go home, then!”\n At the mall’s exit, they bumped into a couple holding hands. As Li Chuan’s gaze fell on one of the two men, his body suddenly went rigid. Grabbing Song Xiuyun’s hand, he pulled her toward another door, avoiding the man’s sight.\n The man, however, had spotted him already. “Ah Chuan?” he blurted out.\n With nowhere else to run or hide, Li Chuan turned around awkwardly to face him. “What a coincidence,” Li Chuan squeezed out a smile. “Seeing you two here.”\n With an almost embarrassed look on his face, the man let go of his boyfriend’s hand. “I heard that you were . . . ”\n “I’m doing fine!” Li Chuan cut him short.\n The man looked at Song Xiuyun. “Ayi1? It’s been so long since I last saw you. Did you move to Beijing?”\n Song Xiuyun searched in her memory. She gradually recalled a boyish face, from years ago, that looked identical to the chic-looking man in front of her. “Oh, it’s you!” she exclaimed. “I’m only here to visit Li Chuan. And you . . . ”\n The man has a look of melancholy on his face. Before he could respond, though, Li Chuan spoke up first. “We need to go now,” said Li Chuan, without looking at the man. “It was . . . nice running into you.”\n He grasped Song Xiuyun’s arm and walked away. Song Xiuyun could hear the man shouting Li Chuan’s name, but he did not pause nor look back.\n Li Chuan had been sitting in his armchair, unmoving, after they got home. Not even bothering to turn on the lights, he brooded silently in the shadow of the large bookshelf.\n “Ah Chuan,” Song Xiuyun started. “Mom is here for you if you want to—”\n Her voice trailed off as she realized that there were so many things about her son that she did not understand.\n Perhaps she never will.\n She turned her head to look out the window. Behind the glass was an entirely foreign world: skyscrapers like trees in a forest, the earth cut to tiny, irregularly shaped pieces by crisscrossing roads that were packed with cars, even the air was occupied by a maze of maglev train tracks. She tilted her head until her gaze could finally soar past the skyscrapers and reach the sky, yet the sky was gray, too, like the iron and concrete that had plagued every inch of this city.\n “Son, maybe we should go back—”\n Once again, she couldn’t finish her sentence, because Li Chuan, unexpectedly, collapsed into her arms.\n For a second he seemed just like the boy from almost a decade ago. The only difference was, this time he was unconscious.\n The mother’s story comes to a pause. Silence fills the car. The heavy snow, painted into a faint orange by the glow of the car’s headlight, is blown onto the windshield by the howling wind.\n “You mentioned that you’ve met him before,” says Wu Huang. “The man in the shopping mall, I mean.”\n “Yes. Seven years ago, when my son came home for New Year, he brought him back as well.”\n Wu Huang nods. The mother’s answer is almost exactly what she had guessed.\n “We all thought that he was just my son’s friend from Beijing, you know, those city people always want to come and see how New Year is celebrated in the countryside,” explains the mother. “I was thrilled that he brought a friend home. I did all I could to serve our guest—you should’ve seen the food! The living conditions in the countryside did not suit our guest well, but in general everyone was still happy, until . . . ”\n Wiping the corners of her eyes with the back of her hand, the mother continues. “My son told me everything the day before New Year. Having lived in the isolated, conservative village my whole life, I did not know that . . . there were other possibilities. I argued with my son and demanded that he ask his . . . his ‘friend’ to leave. But my son refused. They left together overnight. I was alone for New Year that year, as well as all the seven years to follow.”\n The mother pauses to look at the son. The son, still smiling, pats her hand. “Don’t worry, mom. Don’t worry.” he says.\n Wu Huang doesn’t know how to comfort her. “It’s all in the past. See, your son is finally home for this New Year!” she says carefully.\n “Yeah, it’s all in the past . . . ”\n “Right, what happened after he fainted?” Wu Huang remembers the mother’s story. “Was he sent to the hospital?”\n “No.”\n The unconscious man felt as heavy as a rock in Song Xiuyun’s arms. She tried to splash his face with cold water, but he wouldn’t open his eyes. Helpless, she remembered the robot who lived in the wall. Li Chuan had said that it took care of everything.\n “Turn on the lights, please!” she yelled.\n The study brightened up at once. The robot appeared on the wall. “Can I help you?”\n “My son fainted. Call the hospital now.”\n “There’s no need to worry. If anything happens to Master, the system will contact Doctor Freeman immediately,” said the Robot. “Doctor Freeman is on his way here. He is Master’s primary care doctor and good friend.”\n “Then what am I supposed to do?”\n “Just wait.”\n “You mean that I should stand here and do nothing while my son is lying on the ground?”\n “If you’re bored, I can put something on TV.” The robot grinned.\n “Are you nuts?”\n “I was simply trying to be humorous, like you humans.”\n Doctor Freeman was a middle-aged American man, short and stocky, with a receding hairline. He wore a jean jacket on top of a pair of sweatpants. It turned out that he had the highest level of security clearance to Li Chuan’s home—meaning that he could enter the apartment on his own whenever he came around.\n “Ms. Song? Li Chuan has talked about you quite a lot.” He nodded at Song Xiuyun and greeted her in broken Chinese. “Don’t worry. Your son will be fine.”\n To Song Xiuyun’s bewilderment, Doctor Freeman left right away without double-checking. He even had the audacity to grab a handful of sunflower seeds on his way out. Thankfully, the doctor, however irresponsible he may seem, was not wrong—a few minutes later, Li Chuan opened his eyes.\n “What’s the matter? Are you okay? Do you want to go to the hospital?”\n “I’m fine,” Li Chuan stood up and pressed his thumb hard into his temple. “I guess I was just too tired from work.”\n The same thing never happened again, but Song Xiuyun noticed that Li Chuan had been spending more and more time in his study. Whenever she knocked on the shut door, though, he would always shout through the door, “Mom, I’m fine.”\n Gradually, Song Xiuyun stopped worrying. Perhaps he had fainted that day because of the couple they ran into at the mall, she thought. Young people, they are so dramatic!\n “But . . . son,” she hesitantly spoke up one day as she stood at the door of the study. “You’re going to turn thirty-three when New Year rolls around. Isn’t it time for you to consider making a family?”\n Li Chuan lapsed into silence. After a while, he responded by throwing a question back at her. “Why do people have to make families?”\n “Well, everyone needs a family.” Song Xiuyun was taken aback. “You know, you marry and have children . . . ”\n “And then end up like you?”\n Song Xiuyun’s hand stiffened. She knew what her son was referring to—her husband had left home almost twenty years ago. Apart from some money that he sent back each year, there was almost nothing to remind her that he even existed. Her marriage was not built from love. For all these years, it left nothing but a bitter taste in her mouth.\n “I’m sorry,” Li Chuan muttered.\n Song Xiuyun pondered over her words, and spoke again. “I know, I’ve never been to school, and I’m nowhere near a perfect role model. But I still think that people shouldn’t end up alone. Especially when you spend all your time at home. When you are older—when you are my age, you will be . . . lonely.”\n “True, that was the case decades ago, before there was Internet. It’s different now. You can make friends online, live with robots and still have fun when you’re old. A lot of married couples don’t want kids; many more people are living alone. We have the freedom to do whatever we want! Mom, I’m not asking you to understand, but please don’t impose your values on me!”\n “Perhaps you’re right,” said Song Xiuyun gently. “But I only hoped that there would be someone around to support you, to take care of you when you are sick and give you a hug when you are feeling down.”\n The study fell silent again.\n “Mom, I still have you.” Li Chuan’s voice was muffled when he finally spoke. “You can give me a hug.”\n Wu Huang sits up from her bed and glimpses at the shut door of her bedroom through the cracks on the brain-control helmet. Maybe her mother is knitting sweaters again. She has told her mother that she would never wear one of those old-fashioned, dorky sweaters, but her mother, despite agreeing to never knit for her again several times, has always attempted to pick up the tradition every year when winter comes around.\n She looks at her closet. For some reason, for the first time in her life, she is starting to find those hideous sweaters rather cute.\n Distracted by the sweaters, however, she does not see another car coming around the corner. Almost scrambling to avoid the collision, she makes a sharp turn, throwing the passengers into the side door. The mother grasps onto the front seat tightly with one hand and attempts to protect her son with the other.\n “Don’t worry, Mom,” whispers the son.\n “I’m so sorry . . . ” stutters Wu Huang.\n “It’s fine.”\n Wu Huang’s neighborhood is right ahead, but instead of pulling over, she speeds down the road toward the West Bus Station.\n The relationship between mother and son has finally changed for the better after that day. Relieved upon seeing that Li Chuan was in good health, Song Xiuyun decided to go home at last after New Year.\n Despite the boredom, she was cautious not to interfere with her son’s work. She has taken on the habit of going on strolls alone near the residential compound. An amateur dance group—mostly comprised of women her own age, occasionally a robot or two would join—gathered at the gate every evening and danced together to upbeat music. However, too shy to strike up a conversation, she usually lingered by the side and watched the dancers twirl and twist, until dinnertime arrived.\n The evening was windy, leading the dance group to disperse earlier than usual. When Song Xiuyun hurried through the hallway and pushed open the apartment door, however, she was stunned to find Li Chuan sitting on the sofa with Bean in his arms. It was even more unusual that Bean did not only purr, but was also rubbing its head on Li Chuan’s chin. And this was the cat that seemed to despise everyone in the family!\n Just when she was about to make a comment on Bean, she saw Li Chuan’s face.\n The man in front of her looked different as well. Wan and weary, with sunken cheeks and pale lips, he reminded her of what Tie Zhu had said to her back at home: your son seemed very ill. But she remembered checking up on him before she left for dance, and he appeared just fine.\n “You’re back early,” exclaimed Li Chuan, as he struggled to stand up. Gently dropping Bean onto the floor, he headed down the hallway.\n Song Xiuyun caught up with him, as he was yanking open the closed door of the study. “Are you alright? Do you want me to call that Doctor . . . Doctor F.?”\n “I’m fine,” said Li Chuan, after a short pause. “I think I just have a stomach flu. I’ll sleep it off.” He hurried into the study.\n In that brief second, Song Xiuyun thought that she had seen something unusual: the silhouette of a person, standing in the corner of the study. But the door was shut in her face just when she was about to take a closer look.\n Wu Huang carefully examines the man’s face through the lens overlooking the back seat. As if he has sensed her gaze, he lifts his head, looks into the camera, and smiles back at her.\n Something doesn’t feel right, thinks Wu Huang.\n “Well—” She clears her throat awkwardly and turns her eyes away. “Didn’t you plan to come home after New Year? What brought you back so early?”\n “I figured that it’s better to spend New Year at home.”\n “Then when is your son returning to Beijing? Given how busy work is, I suppose that he doesn’t get to stay home for long.”\n The mother chuckles. “Actually, my son agreed to move back home. He already sold his apartment in Beijing, and he’s not returning there ever again. Besides, Internet is going to be available at our village soon. He can just work from home, and it will all be the same!”\n Wu Huang glances at the son. Her heart suddenly sinks.\n A week from New Year, as Song Xiuyun busily cleaned the house and prepared for the festival, Li Chuan came up to her. “Mom, I’m going on a business trip. I’ll be back in a few days. Just wait for me at home.”\n “Don’t you always work from home?” asked Song Xiuyun, surprised. “New Year is right around the corner, why are you going on a business trip now?”\n “It’s the company’s order. Our international clients don’t celebrate Chinese New Year anyways.”\n “Too bad for them . . . ” muttered Song Xiuyun. “Well, I guess work is more important.” She slumped into a chair.\n Li Chuan stood next to her, his lips pressed tightly together, as if he was trying to find something to say.\n “When are you coming back, then? Can you make it home on New Year’s Eve?”\n “Probably,” said Li Chuan. He glanced around the room, as if he was reluctant to go.\n “It’s only going to be few days, right?” Song Xiuyun tried to comfort him, “Don’t worry, I’ll look after the home for you. When you come back, we can celebrate together.”\n Li Chuan’s gaze landed on Song Xiuyun’s face. For an instant, she saw sadness in his eyes. Just when she was about to speak, Li Chuan took a step forward and wrapped his arms around her shoulders.\n Song Xiuyun stiffened, part out of shock and part out of the delight that her son was, perhaps, finally willing to open up to her. “What’s the matter, Ah Chuan?” she asked, a little awkwardly.\n Li Chuan did not respond. After another minute, he let go of her and turned to grab his suitcase. “I’m going to head out. See you soon.”\n “I’ll walk you down.”\n “No, it’s fine. Just wait for me at home. I’ll be back before New Year’s Eve.”\n Bean, perched on the windowsill, stretched its neck to look at Li Chuan as he closed the door behind him. The room fell silent. An unsettledness gloomed Song Xiuyun’s heart. She walked over to the window and gazed out, but all she could see were tall buildings. Her son, as tiny as an ant compared to those giants of concrete and iron, has disappeared into the world outside.\n The next day, in a desperate attempt to find something to do—so that she could forget about that unsettledness—Song Xiuyun went down to the basement with a broom. She knew that Li Chuan didn’t want her to go into the room, but at least she could clean the hallway.\n Almost immediately, she spotted litter: sunflower seed peels, scattered on the floor near the door.\n Li Chuan never ate the plate of sunflower seeds that she brought to his study. The only person who seemed to like them was Doctor Freeman, who grabbed a handful on his way out when he came over the other day.\n Does that mean Doctor Freeman had come to the basement after he left the apartment? But why? Song Xiuyun wondered as she took the trash down to the trash room.\n A custodian was in the trash room, skimming through bags of trash and looking for misplaced recyclable items. Song Xiuyun recognized the trash bag in the custodian’s hands: it was from her household.\n “Thank you for working so hard over the holiday,” she greeted the custodian.\n “No, it’s not hard work, I just don’t like seeing things go to waste.” The custodian smiled at her. “Nowadays people throw away everything. Especially this family!” She showed Song Xiuyun the trash bag that she had just opened up, “I can tell it’s from the same household because they are the only ones who use this kind of trash bag. They throw away unfinished food every day. See? This is from yesterday. Why bother cooking something that they can’t finish?”\n Song Xiuyun’s heart sank. She peered into the trash bag, half-hoping that she would see something different, but no—stir-fried spicy chicken, fish stew with radish . . . those were exactly the dishes that she cooked for Li Chuan before he left. He told her to bring them into his study, as usual, and promised that he would eat on his own. Judging from the amount of food in the trash bag, it seemed that Li Chuan did not even take a single bite.\n The rotten odor permeated the air. It made her head dizzy. “You mean, all this is thrown into trash every day?” she murmured.\n “I mean every meal,” said the custodian as she fumbled through the trash can. “Breakfast, lunch, and dinner, all wasted! You see? Back in the time when I was a kid, wasting food like this could put you in jail . . . ”\n The custodian’s voice seemed to fade away. Song Xiuyun could not hear her anymore. She turned on her heels and headed toward the stairs, trembling as she took each step. She went straight to the phone and dialed Li Chuan’s number. Nobody answered.\n She heard a soft meow. It was Bean, the cat, curled up on the sofa. Bean threw her a glance, looking as nonchalant and distant as always. She remembered the day when she stumbled upon Li Chuan and Bean: it was the only time that she has ever seen the cat let its defense down; Li Chuan, on the other hand, was somehow much more sickly and pale than usual.\n A sense of foreboding rushed into her heart, sending chills down her spine.\n She called Li Chuan a few more times, but he never picked up. Finally, she grabbed a hammer from the toolbox and headed down to the basement again. Standing before the locked door to the room that Li Chuan has forbidden her to enter, she paused, and then swung the hammer at the lock with full force. A loud creak, followed by a bang, and the lock broke open and dropped to the ground.\n She cracked open the door and squeezed in. The room was dark. From the dim light that shone in through the door crack, she could roughly make out the contours of massive machines next to the walls and the entangled wires that covered the ground. There was a helmet on an empty desk.\n “Ah!” She almost jumped out of her skin when she saw the silhouette of a person in the corner of the room. Stumbling through the wires and almost throwing herself onto the opposite wall, she reached for the light switch. Light ripped through the darkness. When she saw the person’s face, her heart missed a beat.\n It was her son. Limply, he laid there, his eyes closed. When she put her hand next to his nose, she realized that his face was cold, and he wasn’t breathing.\n At once, Wu Huang realizes where the mother’s story is going. She falls silent.\n The car has left downtown already. In the glow of the headlights, she can make out the silhouette of the West Bus Station. It perches quietly in the darkness like a dying beast, its ragged breath blowing snowflakes onto the windshield.\n Almost there, thinks Wu Huang. This night has been long. She should head home immediately after dropping them off.\n “And then?” she finally asks.\n “Ah-ha! You found out at last. I can only admire your intelligence!”\n Doctor Freeman appeared at the door. Apparently, the apartment’s security system had sent him an alert as soon as she broke into the basement.\n “Tell me right now what happened to my son!” she demanded.\n Doctor Freeman’s face fell solemn. “Mr. Li Chuan is severely ill. He has collapsed under the stress of work.” He took a long drag on his cigarette, “Although, the person here is not him—” he turned the body over and tugged on the back of the shirt collar, revealing a two-prong electric socket and a barcode.\n “What is this?”\n “A brain-controlled robot.”\n Song Xiuyun’s eyes widened. She examined the robot carefully. The side of its face, the back of its neck—everything was identical to her son. However, when she tried to turn it over again to observe its face, she realized that its body was much heavier than a human would weigh. Relief washed through her. Doctor Freeman wasn’t lying. This was indeed a robot.\n “This robot, a beta version of Domain Co.’s latest technology, was specially customized for Mr. Li Chuan. It is the model with the closest resemblance to real humans so far. See, it can regulate body temperature and its pupils can constrict and dilate just like human eyes! Domain Co. is still resolving some ethical and legal issues regarding its mass production, so it has not hit the market yet,” explained Doctor Freeman. “Li Chuan knew that you were coming to visit, and he didn’t want you to worry about him. He stayed in the basement and interacted with you via the brain-controlled robot instead. Afraid that you might become suspicious, he hid in his study most of the time. The other day, however, when you two ran into his ex-boyfriend at the shopping mall, the anxiety was too much for his recovering body to handle, causing him to pass out in the basement, and his robot consequently shutting off.”\n Stupefied, Song Xiuyun could only give a little nod.\n Now she understood everything. Li Chuan threw away the food because robots don’t need to eat; he was reluctant to ride the subway because the full-body scanner at the security check would have revealed his secret.\n “I know he’s not the most expressive person in the world, but you must understand that he cares a lot about you.”\n “Where is he now? I need to see him!”\n “At the hospital. He’s going through a dangerous operation. If all goes well, he will come back home in no time, and he’ll never need to use this brain-controlled robot again. Bless!”\n “What would happen to my son—I mean, this robot—then?”\n “Recycled.”\n “And what exactly does that mean?”\n “Sent back to the company. The technicians will take out the memory chip and sort out the data.”\n Song Xiuyun sighed. “Then please, be gentle to him.”\n She clenched her fists as Doctor Freeman led her out of the apartment. For all this time, she had been spending time with a simulacrum, while her son hid in the dark, cramped basement. Even when he wanted to give her a hug, he could only do it through the arms of this lifeless thing. Her son had seen her through the security camera the day when she went down to the basement. Back then, if only she had taken another step and opened that door, she would have found her son and realized what was wrong with him. And the day when she had come back home early from dance and found Li Chuan—sickly and pale—in the living room. He must’ve come home because he thought that she would be out longer. That was why Bean would warm up to him—it had also realized that its owner was back, instead of a robot that it couldn’t scent.\n Tears welled up in her eyes. Embarrassed, she turned her head away so that Doctor Freeman wouldn’t see.\n She had to wait outside of the intensive care unit once they arrived at the hospital. “He will be okay, won’t he?” she tugged at the surgeon’s sleeve and whispered, her voice choking.\n “Honestly, I’m not sure. Mr. Li’s case is a rare one . . . ” The surgeon hesitated. He threw a glance at Doctor Freeman, and then comforted her. “Don’t worry. You should go home. We will try our best here. We’re optimistic that the surgery will go well!”\n Song Xiuyun wouldn’t leave. She sat on the bench in the hallway and stared intently at the door of surgery room, afraid that she would lose her son forever if she even blinked. It grew colder. She shivered and wrapped her arms around her body. A nurse handed her a blanket. Huddled in the blanket, she waited. The clock hit midnight. The surgery went on. Occasionally, a nurse would exit the room to fetch more tools, their face drenched in sweat. She wanted to ask the nurses how her son was doing, but she cut herself short before she could make a sound. She didn’t want to bother them.\n At some point, she fell asleep and had a very long dream. In her dream she was no longer an old woman at the age of sixty, but younger, bright and energetic. Her son was a little boy who wandered around barefooted and played in the fields while she worked. Mama, mama, she heard the boy’s crisp, cheery voice calling out. She looked up and saw him running toward her. Behind him, magnificent mountains that expanded across the horizon gazed down at them solemnly. She knew that massive cities and vast seas lie behind those mountains. One day, her son would leave her, cross the mountains and the seas, and become the brave explorer he was meant to be. She was overwhelmed by pride and disappointment all at once. She dropped to her knees and hugged her son tightly. It felt like she was holding the entire world in her arms.\n “Ms. Song? Ms. Song!” Someone gently tapped her shoulder.\n Song Xiuyun slowly opened her eyes. Through a blurred vision, she saw Doctor Freeman standing before her alongside surgeons and nurses. With a start she woke up and blurted out, “Is the surgery over? How is he doing?”\n Doctor Freeman grasped her hands and beamed at her. “Congratulations! The surgery went well.”\n “You mean my son is going to be okay?” She couldn’t believe her ears. She turned her eyes to the surgeons and nurses for confirmation, but they all looked away, carefully avoiding her gaze.\n “Yes! He’s completely recovered. The first thing he told us when he woke up was that he decided to quit his job, leave Beijing, and go home with you!” Doctor Freeman babbled on, his words barely comprehensible in her ears, “Don’t worry! The money he’s made in the past few years is more than enough. He’s also going to sell the apartment. I’ll come visit you both in your hometown every year! Also, I can adopt Bean . . . the cat is so adorable . . . ”\n Song Xiuyun, stunned, could not even begin to process all that Doctor Freeman had said. Just when she was about to speak, the surgery room door swung open and Li Chuan walked out.\n She rushed over to greet her son. When she placed her hand on Li Chuan’s shoulder, she felt the warmth of a healthy human body. Letting out a sigh of relief, she burst into tears.\n Carefully, Li Chuan brushed away the tears from his mother’s face. He smiled, his voice slow and soft. “Don’t worry, Mom. Don’t worry.”\n “Okay, I won’t worry,” Song Xiuyun took her son’s hand. “New Year is coming. Let’s go home.”\n “So that’s why we came back.” The mother finishes her story with a sigh. “New Year’s Eve is tomorrow. If we go home now, we can still make it.”\n “Yeah,” Wu Huang, however, is a little perturbed. “Always better to spend New Year’s Eve at home.”\n With the mother finally done with her story, the car is again filled with an awkward silence. Fortunately, their final destination is right around the corner. Wu Huang pulls up to the gate of the West Bus Station. “It’s only past ten. You can buy tickets at the counter.”\n The mother nods, thanks her, and climbs out of the car with her son. Snowflakes blown into the car melt into little droplets of water as soon as they land on the back seat. From Wu Huang’s point of view, it looks as if the snowflakes are melting on her eye lens. It’s only a projection, thinks Wu Huang, yet when she reaches for her eye corner out of instinct, she feels real wetness on her fingertips.\n She turns her gaze to the mother and the son. They are almost at the gate, and she could only make out their distant silhouettes accompanied by four lines of footprints in the snow. The mother’s shoulders are hunched from the weight of the travel bags on her back. Her son, keeping his head down, follows her.\n A thought flashes across Wu Huang’s mind. She focuses the lens on the son’s back neck and zooms in. Beneath the collar, she sees a pair of blurry, dark shadows. However, when she is about to zoom in again, she halts.\n Perhaps it’s better not to know.\n The mother and the son have already entered the bus station. More snow soon covers the lines of footprints, wiping away the last trace they left behind. To Wu Huang, it feels rather like a dream; otherworldly, almost. As if nothing has happened.\n Wu Huang puts the car on autopilot and sets the destination “home.” She removes her helmet and takes a deep breath.\n She opens the door and sees her mother on the sofa. Her mother, wearing a pair of glasses and fumbling through loose balls of yarn spread out everywhere, has been knitting sweaters again.\n “Mom?”\n Mother looks up at her, her hands still entangled in the yarn. “What’s the matter?”\n “I’m hungry,” says Wu Huang.\n Footnote:\n Originally published in Chinese in Science Fiction World, May 2018.\n Translated and published in partnership with Storycom.\n Emily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature."}