{"fingerprint": "try9VBPSrJMxHiXgqKpGOaYPSfI=", "sitename": "Clarkesworld Magazine", "title": "Distributed Cities by Carl Abbott", "author": "Carl Abbott", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/abbott_01_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Distributed Cities by Carl Abbott", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nDistributed Cities\nThe Swarm is a fleet of at least one hundred fifty dirigibles that ceaselessly crisscross their planet in the recent action-packed novel Terminal World by Alastair Reynolds. Once they were the defense force for the vast city of Spearpoint, but they along ago declared independence and have become a complete society. In effect, they constitute the physically disconnected pieces of a single city.\nReynolds does not supply full details, but it is clear that different airships serve different functions, much like the neighborhoods or districts of a city. An oversized super-aerostat serves as the city’s “downtown” and government center. There are military airships, and presumably industrial and agricultural airships to serve the different needs of the Swarmers, who live their lives in the air.\nLike a real city, the Swarm governs itself (through an airship oligarchy), trades with communities outside itself, accepts immigrants who meet its standards, and has persisted over generations. Reynolds is explicit: This is an “aerial city” where the protagonist Quillon, on arrival, hears “four thousand subtly different engine notes, not one tuned to exactly the same tone as any other, but combining, merging, threading, echoing off the crater walls to form one endless, throbbing, harmonically rich chorus that was utterly, shockingly familiar. The hum of the city.”\nThe Swarm is a “distributed city,” a concept that is emerging simultaneously in urban planning theory and science fiction. The term can be derived by analogy from distributed computing where a single task is spread out among multiple networked but physically separate machines. A distributed city is one whose neighborhoods and districts are widely parceled out over space and form a unit by interacting over distance. It retains the spatial specialization of a normal city, but the pieces are scattered rather than adjacent.\nA distributed city is not simply suburban sprawl, which is a phenomenon that we can map as a single contiguous geographic entity. Geographers and planners can debate where exactly to draw boundaries around metropolitan Toronto or Phoenix, but they agree that it can be done. A distributed city is something different. It can be mapped only as a discontinuous scattering of nodes or pieces that each play distinct roles as part of a larger whole.\nThere’s really no distributed city yet to be found on our planetary surface. Megaregions like the BosWash megalopolis of the northeastern United States or Japan’s Taiheiyo Belt (Pacific Belt) from Tokyo to Osaka and beyond might look at first glance like they fit the model—they consist of several nodes located along a corridor like beads on a string—but each component is fundamentally independent of the others.\nBaltimore could exist without Philadelphia, Nagoya without Kobe, Portland without Seattle. The closest we have come in North America is the relationship Los Angeles and Las Vegas, which boomed in the later twentieth century as, in essence, a specialized recreational annex of LA separated by a hefty chunk of desert.\nAnother comparison are the “global cities” described by sociologist Saskia Sassen. She argues that the global economy has produced an interchangeable elite of corporate managers and financiers who inhabit the most expensive apartments and prestigious office buildings in New York, London, Tokyo, Paris, Hong Kong, Singapore, and Dubai and move with complete ease from one place to the next. Their “upper city” (think Metropolis here) is effectively a single place that happens to be distributed among several continents, given that the highest level .001 percent are at home anyplace their expensive wants and tastes can be satisfied. An example in contemporary fiction is the twenty-eight-year-old protagonist in Don Delillo’s aptly titled Cosmopolis, an asset manager who spends the novel in a limousine between his Manhattan apartment and a haircutting salon while running a bet against the yen.\nIn urban theory circles, interest in distributed cities comes in part from concerns about urban survivability in the face of disasters like Hurricane Katrina and anticipation of the long term crisis of climate change. In response, a few planners have begun to explore the creation of resilient cities through massive decentralization that goes many steps beyond classic suburbanization. This is not nostalgic, anti-urban back-to-the-land thinking of the sort that permeates much of American culture and some of its science fiction (like Clifford Simak’s City). It is about using the power of long-distance communication to create new urban forms.\nThe government of Scotland offers an example. A report by Design Innovation Scotland recently offered up the idea of distributed city as a new way to think about regional economic development. The report calls it an “imagined city” in which enterprises and communities across a large region (it suggests the Highlands and Islands) are linked laterally into a functioning whole that is greater than the sum of its parts. Thinking in these terms, the Scottish planners see a distributed city as a way in which “apparently disparate resources—intellectual, physical, social and material—can be usefully related to one another to create motivational, distributed enterprises within a regional ecology of cultural and economic activities.” The economic development jargon from Edinburgh bureaucrats is a bit painful to read, but the idea is there.\nBecause the term is still in the process of settling firmly into urban planning, there are some alternative applications for “distributed city” that emphasize devolution from large-scale metropolitan systems to small-scale and localized planning. Australian environmentalist and “green urbanist” Peter Newman argues for a model of distributed cities in which energy systems, utilities, and transportation have been decentralized to avoid disastrous system-wide crashes—an idea that Stan Robinson embodied in Pacific Edge nearly a quarter century ago. Michael Blowfield and Leo Johnson in the brand new book Turnaround Challenge: Business and the City of the Future use “distributed city” to emphasize the importance of scattered, small-scale innovation nodes that can network from places as different as Nairobi and Austin. It is an appealing idea in its own right, but Cory Doctorow stole their thunder with his depiction of the New Work in Makers (2009).\nWe can understand the more radical sort of distributed city by revisiting Terminal World, where Reynolds contrasts the Swarm with Spearpoint, a vast towering city in the shape of a tapering cone that is home to 30 million people. Fifteen leagues across at its base, it narrows to one-third league across at fifty leagues above the ground and keeps rising into the vacuum.\nSpearpoint represents the much more common science fiction type of the city as megastructure—the Urban Monads in Robert Silverberg’s The World Inside, the self-contained moving cities in Greg Bear, Strength of Stones, or the huge block of Todos Santos in Larry Niven and Jerry Pournelle, Oath of Fealty (1981), which is a single arcology a thousand feet high and two miles on a side with enough floor area to overlay the entire five boroughs of New York.\nWhere these writers were imagining the ultimate coalescence of high-rise Manhattan or Chicago into a single accreted super-structure, the distributed city offers a sharp contrast with some new and innovative ways to think about urban futures in science fiction as well as urban planning.\nDistributed cities do the science fiction work of upsetting the image and reality of cities as vast, fixed agglomerations that grow higher and wider as time passes. They embody the ability of science fiction to challenge basic economic and social assumptions.\nThe antecedent of the radically distributed city is a brief theoretical speculation by the early Soviet sociologist and planner Mikhail Okhitovich, who wrote in opposition to high modernist theorists of the high-rise city like Le Corbusier.\nAssociated with the radical Soviet architects of the Constructivism movement, Okhitovich in 1929 published a short article on “The Problem of the City” that proclaimed the idea of “disurbanism.” With modern technology, he said, the new socialist society would not have to crowd together in the centralized capitalism city. His alternative was the Red City of the Planet of Communism—perhaps envisioned for Earth or perhaps as a socialist utopia for Mars in the tradition of Alexander Bogdanov’s Red Star (1908).\nThe new city would be structured by social relations rather than territory, he argued, and the different functions of a city no longer needed to exist in one physical place. Instead, he wrote, “the whole world is at our service.” He envisioned overlapping activity waves of greater and lesser intensity that would span the planet, sometimes overlapping and reinforcing to create a network of urban nodes that together constituted urban society.\nOkhitovich himself ran afoul of Joseph Stalin and was executed in a gulag in 1937, plunging his ideas into official disrepute. Architectural historians in the 1980s resurfaced his work along with other advocates of the radical Soviet architectural theories of Constructivism. His ideas now make it into blogs on architecture and utopias.\nThe distributed cities that are now appearing in science fiction, with their indirect debt to Okhitovich, have yet to settle into a standard pattern. In a simple example, Iain M. Banks in Surface Detail uses the term “distributed city” for a set of supersized high-rise structures scattered over a planetary surface. It is as if the suburban “edge city” nodes described by journalist Joel Garreau were uprooted from their locations outside Washington and Houston and plopped randomly across a much wider landscape.\nJay Lake takes an opposite tack in imagining a distributed “Cascadiopolis” in the near-future Pacific Northwest. His story “Forests of the Night” appears in the original anthology Metatropolis. The stories from other contributors such as Tobias Bucknell and editor John Scalzi take place in recognizable extrapolations of regular cities like Detroit and St. Louis, and their plots revolve around the classic tension between privilege and powerlessness in urban centers and peripheries.\nLake, in contrast, imagines an alternative city that weaves its way through the forests and mountains of the Cascade Range in the Pacific Northwest. His city consists of a networked set of isolated enclaves that look individually like forest compounds but together amount so something much more. As he said in a recent email, “it's not like I had a map or anything. Just visualizing a distributed, zero-footprint city environment spread out through lava tubes, tree platforms and low-impact temporary surface structures.”\nThe refugee fleet that comes together in the re-imagined television series Battlestar Galactica is also a distributed city. It consists of several dozen physically distinct and sometimes quite distant units. Because series continuity was not always great, the number of ships at different times and in different episodes ranged variously around several dozen. There are big “neighborhoods” like Galactica with more than 2500 people and smaller ships with populations in the mid-hundreds. The total population of this discontinuous settlement totals just about 50,000, the size of a small city like Binghamton, New York or Grand Junction, Colorado.\nLike cities with neighborhoods and districts, the fleet’s individual ships specialize in particular activities that together make up a functioning city. There are cargo ships, mining ships (Monarch), industrial ships like the tylium refinery ship Daru Mozu, a hospital ship (Rising Star), a prison ship (Astral Queen), residential ships like Cloud Nine, a government center on Colonial One, and, of course, military ships like Galactica.\nThey function together, exchanging personnel and residents, sometimes shifting functions, and battling over politics. The fleet lacks the permanence of a real city, but for a few brief years it amounts to a city parceled out among vast reaches of space.\nThese are innovative ways to think about cities, which have always been grounded in very specific locales, but there is a precedent from 2450 years ago, as recounted from the Greek-Persian wars. William Adama had an ancestor in Themistocles, also the captain of a distributed city-fleet standing against the overwhelming might of an implacable enemy.\nHere is what Herodotus reported about debates among the Greek leaders after Athens had fallen to the invaders:\nWhen Themistocles thus spoke, the Corinthian Adeimantos inveighed against him for the second time, bidding him to be silent because he had no native land, and urging Eurybiades not to put to the vote the proposal of one who was a citizen of no city; for he said that Themistocles might bring opinions before the council if he could show a city belonging to him, but otherwise not. This objection he made against him because Athens had been taken and was held by the enemy. Then Themistocles said many evil things of him and of the Corinthians both, and declared also that he himself and his countrymen had in truth a city and a land larger than that of the Corinthians, so long as they had two hundred ships fully manned.\nA distributed city highlights interrelations among the different parts of a great city—their simultaneous specialization and interaction. It also requires flexibility that is the opposite of a vast, stable arcology. A distributed city can grow by accretion and shrink by secession, like the Galactica fleet. Half a century ago, urban planner Melvin Webber proposed that the increasing power of communication technologies would allow “communities without propinquity.” Webber was thinking of the loosened constraints of geography within metropolitan areas, but his idea of a “non-place urban realm” is excellent shorthand for distributed cities envisioned on much vaster scales. Planners and theorists are still coming to grips with the possibilities, and imaginative writers have an open invitation to step in and help.\nCarl Abbott has taught urban studies and planning at Portland State University in five decades (not fifty years!). His interest in science fiction began with reading Rocket Ship Galileo in fourth grade and the much scarier Star Man's Son: 2050 A.D. in fifth grade. He has since written Frontiers Past and Future: Science Fiction and the American West (2006) and published several articles about science fiction in history and urban planning journals as well as in Science Fiction Studies, on topics as diverse Jack London, Kim Stanley Robinson, and cyberpunk cities. His current project is tentatively titled Science Fiction Cities: Seven Ways We Image the Urban Future."}