{"fingerprint": "scHmn40XUZb5op0Ji85f1zdv4eM=", "sitename": "Clarkesworld Magazine", "title": "Tough Times All Over by Joe Abercrombie", "author": "Joe Abercrombie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/abercrombie_05_16_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tough Times All Over by Joe Abercrombie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "12560 words, novelette, REPRINT\nTough Times All Over\nDamn, but she hated Sipani.\nThe bloody blinding fogs and the bloody slapping water and the bloody universal sickening stink of rot. The bloody parties and masques and revels. Fun, everyone having bloody fun, or at least pretending to. The bloody people were worst of all. Rogues every man, woman, and child. Liars and fools, the lot of them.\nCarcolf hated Sipani. Yet here she was again. Who, then, she was forced to wonder, was the fool?\nBraying laughter echoed from the mist ahead and she slipped into the shadows of a doorway, one hand tickling the grip of her sword. A good courier trusts no one, and Carcolf was the very best, but in Sipani, she trusted . . . less than no one.\nAnother gang of pleasure-seekers blundered from the murk, a man with a mask like a moon pointing at a woman who was so drunk she kept falling over on her high shoes. All of them laughing, one of them flapping his lace cuffs as though there never was a thing so funny as drinking so much you couldn’t stand up. Carcolf rolled her eyes skyward, and consoled herself with the thought that behind the masks they were hating it as much as she always did when she tried to have fun.\nIn the solitude of her doorway, Carcolf winced. Damn, but she needed a holiday. She was becoming a sour arse. Or, indeed, had become one and was getting worse. One of those people who held the entire world in contempt. Was she turning into her bloody father?\n“Anything but that,” she muttered.\nThe moment the revelers tottered off into the night, she ducked from her doorway and pressed on, neither too fast nor too slow, soft boot heels silent on the dewy cobbles, her unexceptional hood drawn down to an inconspicuous degree, the very image of a person with just the average amount to hide. Which, in Sipani, was quite a bit.\nOver to the west somewhere, her armored carriage would be speeding down the wide lanes, wheels striking sparks as they clattered over the bridges, stunned bystanders leaping aside, driver’s whip lashing at the foaming flanks of the horses, the dozen hired guards thundering after, streetlamps gleaming upon their dewy armor. Unless the Quarryman’s people had already made their move, of course: the flutter of arrows, the scream of beasts and men, the crash of the wagon leaving the road, the clash of steel, and finally the great padlock blown from the strongbox with blasting powder, the choking smoke wafted aside by eager hands and the lid flung back to reveal . . . nothing.\nCarcolf allowed herself the smallest smile, and patted the lump against her ribs. The item, stitched up safe in the lining of her coat.\nShe gathered herself, took a couple of steps, and sprang from the canal-side, clearing three strides of oily water to the deck of a decaying barge, timbers creaking under her as she rolled and came smoothly up. To go around by the Fintine bridge was a quite the detour, not to mention a well-traveled and well-watched way, but this boat was always tied here in the shadows, offering a shortcut. She had made sure of it. Carcolf left as little to chance as possible. In her experience, chance could be a real bastard.\nA wizened face peered out from the gloom of the cabin, steam issuing from a battered kettle. “Who the hell are you?”\n“Nobody.” Carcolf gave a cheery salute. “Just passing through!” and she hopped from the rocking wood to the stones on the far side of the canal and was away into the mold-smelling mist. Just passing through. Straight to the docks to catch the tide and off on her merry way. Or her sour arsed one, at least. Wherever Carcolf went, she was nobody. Everywhere, always passing through.\nOver to the east, that idiot Pombrine would be riding hard in the company of four paid retainers. He hardly looked much like her, what with the moustache and all, but swaddled in that ever-so conspicuous embroidered cloak of hers, he did well enough for a double. He was a penniless pimp who smugly believed himself to be impersonating her so she could visit a lover, a lady of means who did not want their tryst made public. Carcolf sighed. If only. She consoled herself with the thought of Pombrine’s shock when those bastards Deep and Shallow shot him from his saddle, expressed considerable surprise at the moustache, then rooted through his clothes with increasing frustration, and finally, no doubt, gutted his corpse only to find . . . nothing.\nCarcolf patted that lump once again, and pressed on with a spring in her step. Here went she, down the middle course, alone and on foot, along a carefully prepared route of back streets, of narrow ways, of unregarded shortcuts and forgotten stairs, through crumbling palaces and rotting tenements, gates left open by surreptitious arrangement and, later on, a short stretch of sewer which would bring her out right by the docks with an hour or two to spare.\nAfter this job, she really had to take a holiday. She tongued at the inside of her lip, where a small but unreasonably painful ulcer had lately developed. All she did was work. A trip to Adua, maybe? Visit her brother, see her nieces? How old would they be now? Ugh. no. She remembered what a judgmental bitch her sister-in-law was. One of those people who met everything with a sneer. She reminded Carcolf of her father. Probably why her brother had married the bloody woman . . .\nMusic was drifting from somewhere as she ducked beneath a flaking archway. A violinist, either tuning up or of execrable quality. Neither would have surprised her. Papers flapped and rustled upon a wall sprouting with moss, ill-printed bills exhorting the faithful citizenry to rise up against the tyranny of the Snake of Talins. Carcolf snorted. Most of Sipani’s citizens were more interested in falling over than rising up, and the rest were anything but faithful.\nShe twisted about to tug at the seat of her trousers, but it was hopeless. How much do you have to pay for a new suit of clothes before you avoid a chafing seam just in the worst place? She hopped along a narrow way beside a stagnant section of canal, long out of use, gloopy with algae and bobbing rubbish, plucking the offending fabric this way and that to no effect. Damn this fashion for tight trousers! Perhaps it was some kind of cosmic punishment for her paying the tailor with forged coins. But then Carcolf was considerably more moved by the concept of local profit than that of cosmic punishment, and therefore strove to avoid paying for anything wherever possible. It was practically a principle with her, and her father always said that a person should stick to their principles—\nBloody hell, she really was turning into her father.\n“Ha!”\nA ragged figure sprang from an archway, the faintest glimmer of steel showing. With an instinctive whimper, Carcolf stumbled back, fumbling her coat aside and drawing her own blade, sure that death had found her at last. The Quarryman one step ahead? Or was it Deep and Shallow, or Kurrikan’s hirelings. . . but no one else showed themselves. Only this one man, swathed in a stained cloak, unkempt hair stuck to pale skin by the damp, a mildewed scarf masking the bottom part of his face, bloodshot eyes round and scared above.\n“Stand and deliver!” he boomed, somewhat muffled by the scarf.\nCarcolf raised her brows. “Who even says that?”\nA slight pause, while the rotten waters slapped the stones beside them. “You’re a woman?” There was an almost apologetic turn to the would-be robber’s voice.\n“If I am, will you not rob me?”\n“Well . . . er . . . ” The thief seemed to deflate somewhat, then drew himself up again. “Stand and deliver anyway!”\n“Why?” asked Carcolf.\nThe point of the robber’s sword drifted uncertainly. “Because I have a considerable debt to . . . that’s none of your business!”\n“No, I mean, why not just stab me and strip my corpse of valuables, rather than giving me the warning?”\nAnother pause. “I suppose . . . I hope to avoid violence? But I warn you I am entirely prepared for it!”\nHe was a bloody civilian. A mugger who had blundered upon her. A random encounter. Talk about chance being a bastard! For him, at least. “You, sir,” she said, “are a shitty thief.”\n“I, madam, am a gentleman.”\n“You, sir, are a dead gentleman.” Carcolf stepped forward, weighing her blade, a stride length of razor steel leant a ruthless gleam from a lamp in a window somewhere above. She could never be bothered to practice, but nonetheless she was far more than passable with a sword. It would take a great deal more than this stick of gutter trash to get the better of her. “I will carve you like—”\nThe man darted forward with astonishing speed, there was a scrape of steel, and before Carcolf even thought of moving, the sword was twitched from her fingers and skittered across the greasy cobbles to plop into the canal.\n“Ah,” she said. That changed things. Plainly her attacker was not the bumpkin he appeared to be, at least when it came to swordplay. She should have known. Nothing in Sipani is ever quite as it appears.\n“Hand over the money,” he said.\n“Delighted.” Carcolf plucked out her purse and tossed it against the wall, hoping to slip past while he was distracted. Alas, he pricked it from the air with impressive dexterity and whisked his sword-point back to prevent her escape. It tapped gently at the lump in her coat.\n“What have you got . . . just there?”\nFrom bad to much, much worse. “Nothing, nothing at all.” Carcolf attempted to pass it off with a false chuckle, but that ship had sailed and she, sadly, was not aboard, any more than she was aboard the damn ship still rocking at the wharf for the voyage to Thond. She steered the glinting point away with one finger. “Now I have an extremely pressing engagement, so if—” There was a faint hiss as the sword slit her coat open.\nCarcolf blinked. “Ow.” There was a burning pain down her ribs. The sword had slit her open too. “Ow!” She subsided to her knees, deeply aggrieved, blood oozing between her fingers as she clutched them to her side.\n“Oh . . . oh no. Sorry. I really . . . really didn’t mean to cut you. Just wanted, you know . . . ”\n“Ow.” The item, now slightly smeared with Carcolf’s blood, dropped from the gashed pocket and tumbled across the cobbles. A slender package perhaps a foot long, wrapped in stained leather.\n“I need a surgeon,” gasped Carcolf, in her best I-am-a-helpless-woman voice. The Grand Duchess had always accused her of being over-dramatic, but if you can’t be dramatic at a time like that, when can you? It was likely she really did need a surgeon, after all, and there was a chance that the robber would lean down to help her and she could stab the bastard in the face with her knife. “Please, I beg you!”\nHe loitered, eyes wide, the whole thing plainly gone further than he had intended. But he edged closer only to reach for the package, the glinting point of his sword still leveled at her.\nA different and even more desperate tack, then. She strove to keep the panic out of her voice. “Look, take the money, I wish you joy of it.” Carcolf did not, in fact, wish him joy, she wished him rotten in his grave. “But we will both be far better off if you leave that package!”\nHis hand hovered. “Why, what’s in it?”\n“I don’t know. I’m under orders not to open it!”\n“Orders from who?”\nCarcolf winced. “I don’t know that either, but—”\nKurtis took the packet. Of course he did. He was an idiot, but not so much of an idiot as that. He snatched up the packet and ran. Of course he ran. When didn’t he?\nHe tore down the alleyway, heart in mouth, jumped a burst barrel, caught his foot and went sprawling, almost impaled himself on his own drawn sword, slithered on his face through a slick of rubbish, scooping a mouthful of something faintly sweet and staggering up, spitting and cursing, snatching a scared glance over his shoulder—\nThere was no sign of pursuit. Only the mist, the endless mist, whipping and curling like a thing alive.\nHe slipped the packet, now somewhat slimy, into his ragged cloak and limped on, clutching at his bruised buttock and still struggling to spit that rotten-sweet taste from his mouth. Not that it was any worse than his breakfast had been. Better, if anything. You know a man by his breakfast, his fencing master always used to tell him.\nHe pulled up his damp hood with its faint smell of onions and despair, plucked the purse from his sword and slid blade back into sheath as he slipped from the alley and insinuated himself among the crowds, that faint snap of hilt meeting clasp bringing back so many memories. Of training and tournaments, of bright futures and the adulation of the crowds. Fencing, my boy, that’s the way to advance! Such knowledgeable audiences in Styria, they love their swordsmen there, you’ll make a fortune! Better times, when he had not dressed in rags, or been thankful for the butcher’s leftovers, or robbed people for a living. He grimaced. Robbed women. If you could call it a living. He stole another furtive glance over his shoulder. Could he have killed her? His skin prickled with horror. Just a scratch. Just a scratch, surely? But he had seen blood. Please, let it have been a scratch! He rubbed his face as though he could rub the memory away, but it was stuck fast. One by one, things he had never imagined, then told himself he would never do, then that he would never do again, had become his daily routine.\nHe checked once more that he wasn’t followed, then slipped from the street and across the rotting courtyard, the faded faces of yesterday’s heroes peering down at him from the newsbills. Up the piss-smelling stairway and around the dead plant. Out with his key, and he wrestled with the sticky lock.\n“Damn it, fuck it, shit it—Gah!” The door came suddenly open and he blundered into the room, nearly fell again, turned and pushed it shut, and stood a moment in the smelly darkness, breathing hard.\nWho would now believe he’d once fenced with the king? He’d lost. Of course he had. Lost everything, hadn’t he? He’d lost two touches to nothing and been personally insulted while he lay in the dust but, still, he’d measured steels with his August Majesty. This very steel, he realized, as he set it against the wall beside the door. Notched, and tarnished, and even slightly bent towards the tip. The last twenty years had been almost as unkind to his sword as they had been to him. But perhaps today marked the turn in his fortunes.\nHe whipped his cloak off and tossed it into a corner, took out the packet to unwrap it and see what he had come by. He fumbled with the lamp in the darkness and finally produced some light, almost wincing as his miserable rooms came into view. The cracked glazing, the blistering plaster speckled with damp, the burst mattress spilling foul straw where he slept, the few sticks of warped furniture—\nThere was a man sitting in the only chair, at the only table. A big man in a big coat, skull shaved to graying stubble. He took a slow breath through his blunt nose, and let a pair of dice tumble from his fist and across the stained table top.\n“Six and two,” he said. “Eight.”\n“Who the hell are you?” Kurtis’ voice was squeaky with shock.\n“The Quarryman sent me.” He let the dice roll again. “Six and five.”\n“Does that mean I lose?” Kurtis glanced over towards his sword, trying and failing to seem nonchalant, wondering how fast he could get to it, draw it, strike—\n“You lost already,” said the big man, gently collecting the dice with the side of his hand. He finally looked up. His eyes were flat as those of a dead fish. Like the fishes on the stalls at the market. Dead and dark and sadly glistening. “Do you want to know what happens if you go for that sword?”\nKurtis wasn’t a brave man. He never had been. It had taken all his courage to work up to surprising someone else, being surprised himself had knocked the fight right out of him. “No,” he muttered, his shoulders sagging.\n“Toss me that package,” said the big man, and Kurtis did so. “And the purse.”\nIt was as if all resistance had drained away. Kurtis had not the strength to attempt a ruse. He scarcely had the strength to stand. He tossed the stolen purse onto the table, and the big man worked it open with his fingertips and peered inside.\nKurtis gave a helpless, floppy motion of his hands. “I have nothing else worth taking.”\n“I know,” the man said, as he stood. “I have checked.” He stepped around the table and Kurtis cringed away, steadying himself against his cupboard. A cupboard containing nothing but cobwebs, as it went.\n“Is the debt paid?” he asked in a very small voice.\n“Do you think the debt is paid?”\nThey stood looking at one another. Kurtis swallowed. “When will the debt be paid?”\nThe big man shrugged his shoulders, which were almost one with his head. “When do you think the debt will be paid?”\nKurtis swallowed again, and he found his lip was trembling. “When the Quarryman says so?”\nThe big man raised one heavy brow a fraction, the hairless sliver of a scar through it. “Have you any questions . . . to which you do not know the answers?”\nKurtis dropped to his knees, his hands clasped, the big man’s face faintly swimming through the tears in his aching eyes. He did not care about the shame of it. The Quarryman had taken the last of his pride many visits before. “Just leave me something,” he whispered. “Just . . . something.”\nThe man stared back at him with his dead fish eyes. “Why?”\nFriendly took the sword too, but there was nothing else of value. “I will come back next week,” he said.\nIt had not been meant as a threat, merely a statement of fact, and an obvious one at that, since it had always been the arrangement, but Kurtis dan Broya’s head slowly dropped, and he began to shudder with sobs.\nFriendly considered whether to try and comfort him, but decided not to. He was often misinterpreted.\n“You should, perhaps, not have borrowed the money.” Then he left.\nIt always surprised him that people did not do the sums when they took a loan. Proportions, and time, and the action of interest, it was not so very difficult to fathom. But perhaps they were prone always to overestimate their income, to poison themselves by looking on the bright side. Happy chances would occur, and things would improve, and everything would turn out well, because they were special. Friendly had no illusions. He knew he was but one unexceptional cog in the elaborate workings of life. To him, facts were facts.\nHe walked, counting off the paces to the Quarryman’s place. One hundred and five, one hundred and four, one hundred and three . . .\nStrange how small the city was when you measured it out. All those people, and all their desires, and scores, and debts, packed into this narrow stretch of reclaimed swamp. By Friendly’s reckoning, the swamp was well on the way to taking large sections of it back. He wondered if the world would be better when it did.\n. . . seventy-six, seventy-five, seventy-four . . .\nFriendly had picked up a shadow. Pickpocket, maybe. He took a careless look at a stall by the way and caught her out of the corner of his eye. A girl with dark hair gathered into a cap and a jacket too big for her. Hardly more than a child. Friendly took a few steps down a narrow snicket and turned, blocking the way, pushing back his coat to show the grips of four of his six weapons. His shadow rounded the corner, and he looked at her. Just looked. She first froze, then swallowed, then turned one way, then the other, then backed off and lost herself in the crowds. So that was the end of that episode.\n. . . thirty-one, thirty, twenty-nine . . .\nSipani, and most especially its moist and fragrant Old Quarter, was full of thieves. They were a constant annoyance, like midges in summer. Also muggers, robbers, burglars, cut-purses, cut-throats, thugs, murderers, strong-arm men, spivs, swindlers, gamblers, bookies, moneylenders, rakes, beggars, tricksters, pimps, pawnshop owners, crooked merchants, not to mention accountants and lawyers. Lawyers were the worst of the crowd, as far as Friendly was concerned. Sometimes it seemed that no one in Sipani made anything, exactly. They all seemed to be working their hardest to rip it from someone else.\nBut then, Friendly supposed he was no better.\n. . . four, three, two, one, and down the twelve steps, past the three guards, and through the double doors into the Quarryman’s place.\nIt was hazy with smoke inside, confusing with the light of colored lamps, hot with breath and chafing skin, thick with the babble of hushed conversation, of secrets traded, reputations ruined, confidences betrayed. It was as all such places always are.\nTwo Northmen were wedged behind a table in the corner. One, with sharp teeth and long, lank hair, had tipped his chair all the way back and was slumped in it, smoking. The other had a bottle in one hand and a tiny book in the other, staring at it with brow well-furrowed.\nMost of the patrons Friendly knew by sight. Regulars. Some come to drink. Some to eat. Most of them fixed on the games of chance. The clatter of dice, the twitch and flap of the playing cards, the eyes of the hopeless glittering as the lucky wheel span.\nThe games were not really the Quarryman’s business, but the games made debts, and debts were the Quarryman’s business. Up the twenty-three steps to the raised area, the guard with the tattoo on his face waving Friendly past.\nThree of the other collectors were seated there, sharing a bottle. The smallest grinned at him, and nodded, perhaps trying to plant the seeds of an alliance. The biggest puffed himself up and bristled, sensing competition. Friendly ignored them equally. He had long ago given up trying even to understand the unsolvable mathematics of human relationships, let alone to participate. Should that man do more than bristle, Friendly’s cleaver would speak for him. That was a voice that cut short even the most tedious of arguments.\nMistress Borfero was a fleshy woman with dark curls spilling from beneath a purple cap, small eyeglasses that made her eyes seem large, and a smell about her of lamp oil. She haunted the anteroom before the Quarryman’s office at a low desk stacked with ledgers. On Friendly’s first day, she had gestured towards the ornate door behind her and said, “I am the Quarryman’s right hand. He is never to be disturbed. Never. You speak to me.”\nFriendly, of course, knew as soon as he saw her mastery of the numbers in those books that there was no one in the office, and that Borfero was the Quarryman, but she seemed so pleased with the deception that he was happy to play along. Friendly had never liked to rock boats unnecessarily. That’s how people end up drowned. Besides, it somehow helped to imagine that the orders came from somewhere else, somewhere unknowable and irresistible. It was nice to have an attic in which to stack the blame. Friendly looked at the door of the Quarryman’s office, wondering if there was an office, or if it opened on blank stones.\n“What was today’s take?” she asked, flipping open a ledger and dipping her pen. Straight to business without so much as a how do you do. He greatly liked and admired that about her, though he would never have said so. His compliments had a way of causing offence.\nFriendly slipped the coins out in stacks, then let them drop, one by one, in rattling rows by debtor and denomination. Mostly base metals, leavened with a sprinkling of silver.\nBorfero sat forward, wrinkling her nose and pushing her eyeglasses up onto her forehead, eyes seeming now extra small without them.\n“A sword, as well,” said Friendly, leaning it up against the side of the desk.\n“A disappointing harvest,” she murmured.\n“The soil is stony hereabouts.”\n“Too true.” She dropped the eyeglasses back and started to scratch orderly figures in her ledger. “Tough times all over.” She often said that. As though it stood as explanation and excuse for anything and everything.\n“Kurtis dan Broya asked me when the debt would be paid.”\nShe peered up, surprised by the question. “When the Quarryman says it’s paid.”\n“That’s what I told him.”\n“Good.”\n“You asked me to be on the lookout for . . . a package.” Friendly placed it on the desk before her. “Broya had it.”\nIt did not seem so very important. It was less than a foot long, wrapped in very ancient stained and balding animal skin, and with a letter, or perhaps a number, burned into it with a brand. But not a number that Friendly recognized.\nMistress Borfero snatched up the package, then immediately cursed herself for seeming too eager. She knew no one could be trusted in this business. That brought a rush of questions to her mind. Suspicions. How could that worthless Broya possibly have come by it? Was this some ruse? Was Friendly a plant of the Gurkish? Or perhaps of Carcolf’s? A double bluff? There was no end to the webs that smug bitch span. A triple bluff? But where was the angle? Where the advantage?\nA quadruple bluff?\nFriendly’s face betrayed no trace of greed, no trace of ambition, no trace of anything. He was without doubt a strange fellow, but came highly recommended. He seemed all business, and she liked that in a man, though she would never have said so. A manager must maintain a certain detachment.\nSometimes things are just what they seem. Borfero had seen strange chances enough in her life.\n“This could be it,” she mused, though, in fact, she was immediately sure. She was not a woman to waste time on possibilities.\nFriendly nodded.\n“You have done well,” she said.\nHe nodded again.\n“The Quarryman will want you to have a bonus.” Be generous with your own people, she had always said, or others will be.\nBut generosity brought no response from Friendly.\n“A woman, perhaps?”\nHe looked a little pained by that suggestion. “No.”\n“A man?”\nAnd that one. “No.”\n“Husk? A bottle of—”\n“No.”\n“There must be something.”\nHe shrugged.\nMistress Borfero puffed out her cheeks. Everything she had she’d made by tickling out people’s desires. She was not sure what to do with a person who had none. “Well, why don’t you think about it?”\nFriendly slowly nodded. “I will think.”\n“Did you see two Northmen drinking on your way in?”\n“I saw two Northmen. One was reading a book.”\n“Really? A book?”\nFriendly shrugged. “There are readers everywhere.”\nShe swept through the place, noting the disappointing lack of wealthy custom and estimating just how dismal this evening’s profits were like to be. If one of the Northmen had been reading, he had given up. Deep was drinking some of her best wine straight from the bottle. Three others lay scattered, empty, beneath the table. Shallow was smoking a chagga pipe, the air thick with the stink of it. Borfero did not allow it normally, but she was obliged to make an exception for these two. Why the bank chose to employ such repugnant specimens she had not the slightest notion. But she supposed rich people need not explain themselves.\n“Gentlemen,” she said, insinuating herself into a chair.\n“Where?” Shallow gave a croaky laugh. Deep slowly tipped his bottle up and eyed his brother over the neck with sour disdain.\nBorfero continued in her business voice, soft and reasonable. “You said your . . . employers would be most grateful if I came upon . . . that certain item you mentioned.”\nThe two Northmen perked up, both leaning forward as though drawn by the same string, Shallow’s boot catching an empty bottle and sending it rolling in an arc across the floor.\n“Greatly grateful,” said Deep.\n“And how much of my debt would their gratitude stretch around?”\n“All of it.”\nBorfero felt her skin tingling. Freedom. Could it really be? In her pocket, even now? But she could not let the size of the stakes make her careless. The greater the payoff, the greater the caution. “My debt would be finished?”\nShallow leaned close, drawing the stem of his pipe across his stubbled throat. “Killed,” he said.\n“Murdered,” growled his brother, suddenly no further off on the other side.\nShe in no way enjoyed having those scarred and lumpen killers’ physiognomies so near. Another few moments of their breath alone might have done for her. “Excellent,” she squeaked, and slipped the package onto the table. “Then I shall cancel the interest payments forthwith. Do please convey my regards to . . . your employers.”\n“Course.” Shallow did not so much smile as show his sharp teeth. “Don’t reckon your regards’ll mean much to them, though.”\n“Don’t take it personally, eh?” Deep did not smile. “Our employers just don’t care much for regards.”\nBorfero took a sharp breath. “Tough times all over.”\n“Ain’t they, though?” and Deep stood, and swept the package up in one big paw.\nThe cool air caught Deep like a slap as they stepped out into the evening. Sipani, none too pleasant when it was still, had a decided spin to it all of a sudden.\n“I have to confess,” he said, clearing his throat and spitting, “to being somewhat on the drunk side of drunk.”\n“Aye,” said Shallow, burping as he squinted into the mist. At least that was clearing somewhat. As clear as it got in this murky hell of a place. “Probably not the bestest notion while at work, mind you.”\n“You’re right.” Deep held the baggage up to such light as there was. “But who expected this to just drop in our laps?”\n“Not I, for one.” Shallow frowned. “Or for . . . not one?”\n“It was meant to be just a tipple,” said Deep.\n“One tipple does have a habit of making itself into several.” Shallow wedged on that stupid bloody hat. “A little stroll over to the bank, then?”\n“That hat makes you look a fucking dunce.”\n“You, brother, are obsessed with appearances.”\nDeep passed that off with a long hiss.\n“They really going to score out that woman’s debts, d’you think?”\n“For now, maybe. But you know how they are. Once you owe, you always owe.” Deep spat again, and, now the alley was a tad steadier, tottered off with the baggage clutched tight in his hand. No chance he was putting it in a pocket where some little scab could lift it. Sipani was full of thieving bastards. He’d had his good socks stolen last time he was here, and worked up an unpleasant pair of blisters on the trip home. Who steals socks? Styrian bastards. He’d keep a good firm grip on it. Let the little fuckers try to take it then.\n“Now who’s the dunce?” Shallow called after him. “The bank’s this way.”\n“Only we ain’t going to the bank, dunce,” snapped Deep over his shoulder. “We’re to toss it down a well in an old court just about the corner here.”\nShallow hurried to catch up. “We are?”\n“No, I just said it for the laugh, y’idiot.”\n“Why down a well?”\n“Because that’s how he wanted it done.”\n“Who wanted it done?”\n“The boss.”\n“The little boss, or the big boss?”\nEven drunk as Deep was, he felt the need to lower his voice. “The bald boss.”\n“Shit,” breathed Shallow. “In person?”\n“In person.”\nA short pause. “How was that?”\n“It was even more than usually terrifying, thanks for reminding me.”\nA long pause, with just the sound of their boots on the wet cobbles. Then Shallow said, “we better hadn’t do no fucking up of this.”\n“My heartfelt thanks,” said Deep, “for that piercing insight. Fucking up is always to be avoided when and wherever possible, wouldn’t you say?”\n“Y’always aim to avoid it, of course you do, but sometimes you run into it anyway. What I’m saying here is, we’d best not run into it.” Shallow dropped his voice to a whisper. “You know what the bald boss said last time.”\n“You don’t have to whisper. He ain’t here, is he?”\nShallow looked wildly around. “I don’t know. Is he?”\n“No he ain’t.” Deep rubbed at his temples. One day he’d kill his brother, that was a foregone conclusion. “That’s what I’m saying.”\n“What if he was, though? Best to always act like he might be.”\n“Can you shut your mouth just for a fucking instant?” Deep caught Shallow by the arm and stabbed the baggage in his face. “It’s like talking to a bloody—” He was greatly surprised when a dark shape whisked between them and he found his hand was suddenly empty.\nKiam ran like her life depended on it. Which it did, o’ course.\n“Get after him, damn it!” And she heard the two Northmen flapping and crashing and blundering down the alley behind, and nowhere near far enough behind for her taste.\n“It’s a girl, y’idiot!” Big and clumsy but fast they were coming, boots hammering and hands clutching, and if they once caught a hold of her . . .\n“Who fucking cares? Get the thing back!” And her breath hissing and her heart pounding and her muscles burning as she ran.\nShe skittered around a corner, rag-wrapped feet sticking to the damp cobbles, the way wider, lamps and torches making muddy smears in the mist and people busy everywhere. She ducked and wove, around them, between them, faces looming up and gone. The Blackside night-market, stalls and shoppers and the cries of the traders, full of noise and smells and tight with bustle. Kiam slithered between the wheels of a wagon, limber as a ferret, plunged between buyer and seller in a shower of fruit, then slithered across a stall laden with slimy fish while the trader shouted and snatched at her, caught nothing but air, and she stuck one foot in a basket and was off, kicking cockles across the street. Still she heard the yells and growls as the Northmen knocked folk flying in her wake, crashes as they flung the carts aside, as though a mindless storm was ripping apart the market behind her. She dived between the legs of a big man, rounded another corner, and took the greasy steps two at a time, along the narrow path by the slopping water, rats squeaking in the rubbish and the sounds of the Northmen now loud, louder, cursing her and each other. Her breath whooping and cutting in her chest and running desperate, water spattering and spraying around her with every echoing footfall.\n“We’ve got her!” the voice so close at her heels. “Come here!”\nShe darted through that little hole in the rusted grate, a sharp tooth of metal leaving a burning cut down her arm, and for once she was plenty glad that Old Green never gave her enough to eat. She kicked her way back into the darkness, keeping low, lay there clutching the package and struggling to get her breath. Then they were there, one of the Northmen dragging at the grating, knuckles white with force, flecks of rust showering down as it shifted, and Kiam stared and wondered what those hands would do to her if they got their dirty nails into her skin.\nThe other one shoved his bearded face in the gap, a wicked-looking knife in his hand, not that someone you just robbed ever has a nice-looking knife. His eyes popped out at her and his scabbed lips curled back and he snarled, “chuck us that baggage and we’ll forget all about it. Chuck us it now!”\nKiam kicked away, the grate squealing as it bent. “You’re fucking dead, you little piss! We’ll find you, don’t worry about that!” She slithered off, through the dust and rot, wriggled through a crack between crumbling walls. “We’ll be coming for you!” echoed from behind her. Maybe they would be as well, but a thief can’t spend too much time worrying about tomorrow. Today’s shitty enough. She whipped her coat off and pulled it inside out to show the faded green lining, stuffed her cap in her pocket and shook her hair out long, then slipped onto the walkway beside the Fifth Canal, walking fast, head down.\nA pleasure boat drifted past, all chatter and laughter and clinking of glass, people moving tall and lazy on board, strange as ghosts seen through that mist, and Kiam wondered what they’d done to deserve that life and what she’d done to deserve this, but there never were no easy answers to that question. As it took its pink lights away into the fog she heard the music of Hove’s violin. Stood a moment in the shadows, listening, thinking how beautiful it sounded. She looked down at the package. Didn’t look much for all this trouble. Didn’t weigh much, even. But it weren’t up to her what Old Green put a price on. She wiped her nose and walked along close to the wall, music getting louder, then she saw Hove’s back and his bow moving, and she slipped behind him and let the package fall into his gaping pocket.\nHove didn’t feel the drop, but he felt the three little taps on his back, and he felt the weight in his coat as he moved. He didn’t see who made the drop and he didn’t look. He just carried on fiddling, that Union march with which he’d opened every show during his time on the stage in Adua, or under the stage, at any rate, warming up the crowd for Lestek’s big entrance. Before his wife died and everything went to shit. Those jaunty notes reminded him of times past, and he felt tears prickling in his sore eyes, so he switched to a melancholy minuet more suited to his mood, not that most folk around here could’ve told the difference. Sipani liked to present itself as a place of culture, but the majority were drunks and cheats and boorish thugs, or varying combinations thereof.\nHow had it come to this, eh? The usual refrain. He drifted across the street like he’d nothing in mind but a coin for his music, letting the notes spill out into the murk. Across past the pie stall, the fragrance of cheap meat making his stomach grumble, and he stopped playing to offer out his cap to the queue. There were no takers, no surprise, so he headed on down the road to Verscetti’s, dancing in and out of the tables on the street and sawing out an Osprian waltz, grinning at the patrons who lounged there with a pipe or a bottle, twiddling thin glass-stems between gloved fingertips, eyes leaking contempt through the slots in their mirror-crusted masks. Jervi was sat near the wall, as always, a woman in the chair opposite, hair piled high.\n“A little music, darling?” Hove croaked out, leaning over her and letting his coat dangle near Jervi’s lap.\nJervi slid something out of Hove’s pocket, wrinkling his nose at the smell of the old soak, and said, “Fuck off, why don’t you?” Hove moved on, and took his horrible music with him, thank the Fates.\n“What’s going on down there?” Riseld lifted her mask for a moment to show that soft, round face, well-powdered and fashionably bored.\nThere did indeed appear to be some manner of commotion up the street. Crashing, banging, shouting in Northern.\n“Damn Northmen,” he murmured. “Always causing trouble, they really should be kept on leads like dogs.” Jervi removed his hat and tossed it on the table, the usual signal, then leant back in his chair to hold the package inconspicuously low to the ground beside him. A distasteful business, but a man has to work. “Nothing you need concern yourself about, my dear.”\nShe smiled at him in that unamused, uninterested way which, for some reason, he found irresistible.\n“Shall we go to bed?” he asked, tossing a couple of coins down for the wine.\nShe sighed. “If we must.”\nAnd Jervi felt the package spirited away.\nSifkiss wriggled out from under the tables and strutted along, letting his stick rattle against the bars of the fence beside him, package swinging loose in the other. Maybe Old Green had said stay stealthy but that weren’t Sifkiss’ way any more. A man has to work out his own style of doing things, and he was a full thirteen, weren’t he? Soon enough now he’d be passing on to higher things. Working for Kurrikan maybe. Anyone could tell he was marked out special—he’d stole himself a tall hat that made him look quite the gent about town—and if they were dull enough to be entertaining any doubts, which some folk sadly were, he’d perched it at quite the jaunty angle besides. Jaunty as all hell.\nYes, everyone had their eyes on Sifkiss.\nHe checked he weren’t the slightest bit observed, then slipped through the dewy bushes and the crack in the wall behind, which honestly was getting to be a bit of a squeeze, into the basement of the old temple, a little light filtering down from upstairs.\nMost of the children were out working. Just a couple of the younger lads playing with dice and a girl gnawing on a bone and Pens having a smoke and not even looking over, and that new one curled up in the corner and coughing. Sifkiss didn’t like the sound o’ those coughs. More’n likely he’d be dumping her off in the sewers a day or two hence but, hey, that meant a few more bits corpse money for him, didn’t it? Most folk didn’t like handling a corpse, but it didn’t bother Sifkiss none. It’s a hard rain don’t wash someone a favor, as Old Green was always saying. She was way up there at the back, hunched over her old desk with one lamp burning, her long gray hair all greasy-slicked and her tongue pressed into her empty gums as she watched Sifkiss come up. Some smart-looking fellow was with her, had a waistcoat all silver leaves stitched on fancy, and Sifkiss put a jaunt on, thinking to impress.\n“Get it, did yer?” asked Old Green.\n“Course,” said Sifkiss, with a toss of his head, caught his hat on a low beam and cursed as he had to fumble it back on. He tossed the package sourly down on the tabletop.\n“Get you gone, then,” snapped Green.\nSifkiss looked surly, like he’d a mind to answer back. He was getting altogether too much mind, that boy, and Green had to show him the knobby-knuckled back of her hand ’fore he sloped off.\n“So here you have it, as promised.” She pointed to that leather bundle in the pool of lamplight on her old table, its top cracked and stained and its gilt all peeling, but still a fine old piece of furniture with plenty of years left. Like to Old Green in that respect, if she did think so herself.\n“Seems a little luggage for such a lot of fuss,” said Fallow, wrinkling his nose, and he tossed a purse onto the table with that lovely clink of money. Old Green clawed it up and clawed it open and straight off set to counting it.\n“Where’s your girl Kiam?” asked Fallow. “Where’s little Kiam, eh?”\nOld Green’s shoulders stiffened but she kept counting. She could’ve counted through a storm at sea. “Out working.”\n“When’s she getting back? I like her.” Fallow came a bit closer, voice going hushed. “I could get a damn fine price for her.”\n“But she’s my best earner!” said Green. “There’s others you could take off my hands. How’s about that lad Sifkiss?”\n“What, the sour-face brought the luggage?”\n“He’s a good worker. Strong lad. Lots of grit. He’d pull a good oar on a galley, I’d say. Maybe a fighter, even.”\nFallow snorted. “In a pit? That little shit? I don’t think so. He’d need some whipping to pull an oar, I reckon.”\n“Well? They got whips don’t they?”\n“Suppose they do. I’ll take him if I must. Him and three others. I’m off to the market in Westport tomorrow week. You pick, but don’t give me none o’ your dross.”\n“I don’t keep no dross,” said Old Green.\n“You got nothing but dross, you bloody old swindler. And what’ll you tell the rest o’ your brood, eh?” Fallow put on a silly la-de-da voice. “That they’ve gone off to be servants to gentry, or to live with the horses on a farm, or adopted by the fucking Emperor of Gurkhul or some such, eh?” Fallow chuckled, and Old Green had a sudden urge to make that knife of hers available, but she’d better sense these days, all learned the hard way.\n“I tell ’em what I need to,” she grunted, still working her fingers around the coins. Bloody fingers weren’t half as quick as they once were.\n“You do that, and I’ll come back for Kiam another day, eh?” And Fallow winked at her.\n“Whatever you want,” said Green, “whatever you say.” She was bloody well keeping Kiam, though. She couldn’t save many, she wasn’t fool enough to think that, but maybe she could save one, and on her dying day she could say she done that much. Probably no one would be listening, but she’d know. “It’s all there. Package is yours.”\nFallow picked up the luggage and was out of that stinking fucking place. Reminded him too much of prison. The smell of it. And the eyes of the children, all big and damp. He didn’t mind buying and selling ’em, but he didn’t want to see their eyes. Does the slaughterman want to look at the sheep’s eyes? Maybe the slaughterman don’t care. Maybe he gets used to it. Fallow cared too much, that’s what it was. Too much heart.\nHis guards were lounging by the front door and he waved them over and set off, walking in the middle of the square they made.\n“Successful meeting?” Grenti tossed over his shoulder.\n“Not bad,” grunted Fallow, in such a way as to discourage further conversation. Do you want friends or money? he’d once heard Kurrikan say, and the phrase had stuck with him.\nSadly, Grenti was by no means discouraged. “Going straight over to Kurrikan’s?”\n“Yes,” said Fallow, sharply as he could.\nBut Grenti loved to flap his mouth. Most thugs do, in the end. All that time spent doing nothing, maybe. “Lovely house, though, ain’t it, Kurrikan’s? What do you call those columns on the front of it?”\n“Pilasters,” grunted one of the other thugs.\n“No, no, I know pilasters, no. I mean to say the name given to that particular style of architecture, with the vine-leaves about the head there?”\n“Rusticated?”\n“No, no, that’s the masonry work, all dimpled with the chisel, it’s the overall design I’m discussing—hold up.”\nFor a moment, Fallow was mightily relieved at the interruption. Then he was concerned. A figure was occupying the fog just ahead. Occupying the hell out of it. The beggars and revelers and scum scattered round these parts had all slipped out of their way like soil around the plough ’til now. This one didn’t move. He was a tall bastard, tall as Fallow’s tallest guard, with a white coat on, hood up. Well, it weren’t white no more. Nothing stayed white long in Sipani. It was gray with damp and black-spattered about the hem.\n“Get him out of the way,” he snapped.\n“Get out of the fucking way!” roared Grenti.\n“You are Fallow?” The man pulled his hood back.\n“It’s a woman,” said Grenti. And indeed it was, for all her neck was thickly muscled, her jaw angular, and her red hair clipped close to her skull.\n“I am Javre,” she said, raising her chin and smiling at them. “Lioness of Hoskopp.”\n“Maybe she’s a mental,” said Grenti.\n“Escaped from that madhouse up the way.”\n“I did once escape from a madhouse,” said the woman. She had a weird accent, Fallow couldn’t place it. “Well . . . it was a prison for wizards. But some of them had gone mad. A fine distinction, most wizards are at least eccentric. That is beside the point, though. You have something I need.”\n“That so?” said Fallow, starting to grin. He was less worried now. One, she was a woman, two, she obviously was a mental.\n“I know not how to convince you, for I lack the sweet words, it is a long-standing deficiency. But it would be best for us all if you gave it to me willingly.”\n“I’ll give you something willingly,” said Fallow, to sniggers from the others.\nThe woman didn’t snigger. “It is a parcel, wrapped in leather, about . . . ” she held up one big hand, thumb and forefinger stretched out. “Five times the length of your cock.”\nIf she knew about the luggage, she was trouble. And Fallow had no sense of humor about his cock, to which none of the ointments had made the slightest difference. He stopped grinning. “Kill her.”\nShe struck Grenti somewhere around the chest, or maybe she did, it was all a blur. His eyes popped wide and he made a strange whooping sound and stood there frozen, quivering on his tiptoes, sword half-way drawn.\nThe second guard—a Union man, big as a house—swung his mace at her, but it just caught her flapping coat. An instant later there was a surprised yelp and he was flying across the street upside down and crashing into the wall, tumbling down in a shower of dust, sheets of broken plaster dropping from the shattered brickwork on top of his limp body.\nThe third guard—a nimble-fingered Osprian—whipped out a throwing knife, but before he could loose it, the mace twittered through the air and bounced from his head. He dropped soundlessly, arms outstretched.\n“They are called Anthiric columns.” The woman put her forefinger against Grenti’s forehead and gently pushed him over. He toppled and lay there on his side in the muck, still stiff, still trembling, still with eyes bulgingly focused on nothing.\n“That was with one hand.” She held up the other big fist, and had produced from somewhere a sheathed sword, gold glittering on the hilt. “Next I draw this sword, forged in the Old Time from the metal of a fallen star. Only six living people have seen the blade. You would find it extremely beautiful. Then I would kill you with it.”\nThe last of the guards exchanged a brief glance with Fallow, then tossed his axe away and sprinted off.\n“Huh,” said the woman, with a slight wrinkling of disappointment about her red brows. “Just so you know, if you run I will catch you in . . . ” She narrowed her eyes and pushed out her lips, looking Fallow appraisingly up and down. The way he might have appraised the children. He found he didn’t like being looked at that way. “About four strides.”\nHe ran.\nShe caught him in three, and he was suddenly on his face with a mouthful of dirty cobblestone and his arm twisted sharply behind his back.\n“You’ve no idea who you’re dealing with, you stupid bitch!” He struggled but her grip was iron, and he squealed with pain as his arm was twisted even more sharply.\n“It is true, I am no high thinker.” Her voice showed not the slightest strain. “I like simple things well done and have no time to philosophize. Would you like to tell me where the parcel is, or shall I beat you until it falls out?”\n“I work for Kurrikan!” he gasped out.\n“I’m new in town. Names work no magic on me.”\n“We’ll find you!”\nShe laughed. “Of course. I am no hider. I am Javre, First of the Fifteen. Javre, Knight Templar of the Golden Order. Javre, Breaker of Chains, Breaker of Oaths, Breaker of Faces.” And here she gave him a blinding blow on the back of the head which, he was pretty sure, broke his nose against the cobbles and filled the back of his mouth with the salt taste of blood. “To find me, you need only ask for Javre.” She leaned over him, breath tickling at his ear. “It is once you find me that your difficulties begin. Now, where is that parcel?”\nA pinching sensation began in Fallow’s hand. Mildly painful to begin with, then more, and more, a white hot burning up his arm that made him whimper like a dog. “Ah, ah, ah, inside pocket, inside pocket!”\n“Very good.” He felt hands rifling through his clothes, but could only lie limp, moaning as the jangling of his nerves gradually subsided. He craned his neck around to look up at her and curled back his lips. “I swear on my fucking front teeth—”\n“Do you?” As her fingers found the hidden pocket and slid the package free. “That’s rash.”\nJavre pressed finger against thumb and flicked Fallow’s two front teeth out. A trick she had learned from an old man in Suljuk, and, as with so many things in life, all in the wrist. She left him hunched in the road, struggling to cough them up.\n“The next time we meet, I will have to show you the sword!” she called out as she strode away, wedging the package down behind her belt. Goddess, these Sipanese were weaklings. Was there no one to test her anymore?\nShe shook her sore hand out. Probably her fingernail would turn black and drop off, but it would grow back. Unlike Fallow’s teeth. And it was scarcely the first fingernail she had lost. Including that memorable time she had lost the lot and toenails too in the tender care of the Prophet Khalul. Now there had been a test. For a moment, she almost felt nostalgic for her interrogators. Certainly she felt nostalgic for the feeling of shoving their chief’s face into his own brazier when she escaped. What a sizzle he had made!\nBut perhaps this Kurrikan would be outraged enough to send a decent class of killer after her. Then she could go after him. Hardly the great battles of yesteryear, but something to while away the evenings.\nUntil then, Javre walked, swift and steady with her shoulders back. She loved to walk. With every stride, she felt her own strength. Every muscle utterly relaxed, yet ready to turn the next step in a split instant into mighty spring, sprightly roll, deadly strike. Without needing to look, she felt each person about her, judged their threat, predicted their attack, imagined her response, the air around her alive with calculated possibilities, the surroundings mapped, the distances known, all things of use noted. The sternest tests are those you do not see coming, so Javre was the weapon always sharpened, the weapon never sheathed, the answer to every question.\nBut no blade came darting from the dark. No arrow, no flash of fire, no squirt of poison. No pack of assassins burst from the shadows.\nSadly.\nOnly a pair of drunk Northmen wrestling outside Pombrine’s place, one of them snarling something about the bald boss. She paid them no mind as she trotted up the steps, ignoring the several frowning guards, who were of a quality inferior even to Fallow’s men, down the hallway and into the central salon, complete with fake marble, cheap chandelier, and profoundly unarousing mosaic of a lumpy couple fucking horse-style. Evidently the evening rush had yet to begin. Whores of both sexes and one Javre was still not entirely sure about lounged bored upon the overwrought furniture.\nPombrine was busy admonishing one of his flock for overdressing, but looked up startled when she entered. “You’re back already? What went wrong?”\nJavre laughed full loud. “Everything.” His eyes widened, and she laughed louder yet. “For them.” And she took his wrist and pressed the parcel into his hand.\nPombrine gazed down at that unassuming lump of animal skin. “You did it?”\nThe woman thumped one heavy arm about his shoulders and gave them a squeeze. He gasped as his bones creaked. Without doubt she was of exceptional size, but even so the casual strength of it was hardly to be believed. “You do not know me. Yet. I am Javre, Lioness of Hoskopp.” She looked down at him and he had an unpleasant and unfamiliar sensation of being a naughty child helpless in his mother’s grasp. “When I agree to a challenge, I do not shirk it. But you will learn.”\n“I keenly anticipate my education.” Pombrine wriggled free of the crushing weight of her arm. “You did not . . . open it?”\n“You told me not to.”\n“Good. Good.” He stared down, the smile half-formed on his face, hardly able to believe it could have been this easy.\n“My payment, then.”\n“Of course.” He reached for the purse.\nShe held up one calloused hand. “I will take half in flesh.”\n“In flesh?”\n“Isn’t that what you pedal here?”\nHe raised his brows. “Half would be a great quantity of flesh.”\n“I get through it. And I mean to stay a while.”\n“Lucky us,” he muttered.\n“I’ll take him.”\n“An excellent choice, I—”\n“And him. And him. And her.” Javre rubbed her rough palms together. “She can get the lads warmed up, I am not paying to wank anyone off myself.”\n“Naturally not.”\n“I am a woman of Thond, and have grand appetites.”\n“So I begin to see.”\n“And for the sun’s sake, someone draw me a bath. I smell like a heated bitch already, I dread to imagine the stink afterward. I will have every tom cat in the city after me!” And she burst out laughing again.\nOne of the men swallowed. The other looked at Pombrine with an expression faintly desperate as Javre herded them into the nearest room.\n“. . . you, remove your trousers. You, get the bandages off my tits. You would scarcely credit how tightly I have to strap this lot down to get anything done . . . ”\nThe door snapped mercifully shut.\nPombrine seized Scalacay, his most trusted servant, by the shoulder and drew him close.\n“Go to the Gurkish temple off the third canal with all haste, the one with the green marble pillars. Do you know it?”\n“I do, master.”\n“Tell the priest that chants in the doorway that you have a message for Ishri. That Master Pombrine has the item she was asking after. For Ishri, do you understand?”\n“For Ishri. Master Pombrine has the item.”\n“Then run to it!”\nScalacay dashed away, leaving Pombrine to hurry to his office with hardly less haste, the package clutched in one sweaty hand. He fumbled the door shut and turned the key, the five locks closing with a reassuring metallic clatter.\nOnly then did he allow himself to breathe. He placed the package reverently upon his desk. Now he had it, he felt the need to stretch out the moment of triumph. To weigh it down with the proper gravitas. He went to his drinks cabinet and unlocked it, took his grandfather’s bottle of Shiznadze from the place of honor. That man had lived his whole life waiting for a moment worthy of opening that bottle. Pombrine smiled as he reached for the corkscrew, trimming away the lead from the neck.\nHow long had he worked to secure that cursed package? Circulating rumors of his business failings when in fact he had never been so successful. Placing himself in Carcolf’s way again and again until finally they seemed to happen upon each other by chance. Wriggling himself into a position of trust while the idiot courier thought him a brainless stooge, clambering by miniscule degrees to a perch from which he could get his eager hands around the package, and then . . . unhappy fate! Carcolf had slipped free, the cursed bitch, leaving Pombrine with nothing but ruined hopes. But now . . . happy fate! The thuggery of that loathsome woman Javre had, by some fumbling miracle, succeeded where his genius had been so unfairly thwarted.\nWhat did it matter how he had come by it, though? His smile grew wider as he eased the cork free. He had the package. He turned to gaze upon his prize again.\nPop! An arc of fizzy wine missed his glass and spurted across his Kadiri carpet. He stared open mouthed. The package was hanging in the air by a hook. Attached to the hook was a gossamer thread. The thread disappeared through a hole in the glass roof high above where he now saw a black shape spread-eagled.\nPombrine made a despairing lunge, bottle and glass tumbling to the floor and spraying wine, but the package slipped through his clutching fingers and was whisked smoothly upwards out of his reach.\n“Guards!” he roared, shaking his fist. “Thief!”\nA moment later he realized, and his rage turned in a flash to withering horror.\nIshri would soon be on her way.\nWith a practiced jerk of her wrist, Shev twitched the parcel up and into her waiting glove.\n“What an angler,” she whispered as she thrust it into her pocket, and was away across the steeply-pitched roof, knee pads sticky with tar doing most of the work. Astride the ridge and she scuttled to the chimney, flicked the rope into the street below, was over the edge in a twinkling and swarming down. Don’t think about the ground, never think about the ground. It’s a nice place to be, but you wouldn’t want to get there too quickly . . .\n“What a climber,” she whispered as she passed a large window, a garishly decorated and gloomily lit salon coming into view, and—\nShe gripped tight to the rope and stopped dead, gently swinging.\nShe really did have a pressing engagement with not being caught by Pombrine’s guards, but within the room was one of those sights that one could not simply slide past. Four, possibly five, or even six naked bodies had formed, with most impressive athleticism, a kind of human sculpture—a grunting tangle of gently shifting limbs. While she was turning her head sideways on to make sense of it, the lynch-pin of the arrangement, who Shev took at first glance for a red-haired strongman, looked straight at her.\n“Shevedieh?”\nDecidedly not a man, but very definitely strong. Even with hair clipped close, there was no mistaking her.\n“Javre? What the hell are you doing here?”\nShe raised a brow at the naked bodies entwined about her. “Is that not obvious?”\nShev was brought to her senses by the rattle of guards in the street below. “You never saw me!” And she slid down the rope, hemp hissing through her gloves, hit the ground hard and sprinted off just as a group of men with weapons drawn came barrelling around the corner.\n“Stop thief!”\n“Get him!”\nAnd, particularly shrill, Pombrine desperately wailing, “My package!”\nShev jerked the cord in the small of her back and felt the pouch split, the caltrops scattering in her wake, heard the shrieks as a couple of the guards went tumbling. Sore feet they’d have in the morning. But there were still more following.\n“Cut him off!”\n“Shoot him!”\nShe took a sharp left, heard the flatbow string an instant later, the twitter as the bolt glanced from the wall beside her and away into the night. She peeled off her gloves as she ran, one smoking from the friction, and flung them over her shoulder. A quick right, the route well-planned in advance, of course, and she sprang up onto the tables outside Verscetti’s, bounding from one to the next with great strides, sending cutlery and glassware flying, the patrons floundering up, tumbling in their shock, a ragged violinist flinging himself for cover.\n“What a runner,” she whispered, and leaped from the last table, over the clutching hands of a guard diving from her left and a reveler from her right, catching the little cord behind the sign that said Verscetti’s as she fell and giving it a good tug.\nThere was a flash like lightning as she rolled, an almighty bang as she came up, the murky night at once illuminated, the frontages of the buildings ahead picked out white. There were screams and squeals and a volley of detonations. Behind her, she knew, blossoms of purple fire would be shooting across the street, showers of golden sparks, a display suitable for a baron’s wedding.\n“That Qohdam certainly can make fireworks,” she whispered, resisting the temptation to stop and watch the show and instead slipping down a shadowy snicket, shooing away a mangy cat, scurrying on low for three dozen strides and ducking into the narrow garden, struggling to keep her quick breath quiet. She ripped open the packet she had secured among the roots of the dead willow, unfurling the white robe and wriggling into it, pulling up the cowl and waiting in the shadows, the big votive candle in one hand, ears sifting at the night.\n“Shit,” she muttered. As the last echoes of her fiery diversion faded she could hear, faintly, but coming closer, the calls of Pombrine’s searching guards, doors rattling as they tried them one by one.\n“Where did he go?”\n“I think this way!”\n“Bloody firework burned my hand! I’m really burned, you know!”\n“My package!”\n“Come on, come on,” she muttered. To be caught by these idiots would be among the most embarrassing moments of her career. That time she’d been stuck in a marriage gown half way up the side of the Mercers guildhall in Adua, with flowers in her hair but no underwear and a steadily growing crowd of onlookers below, would take some beating, but still. “Come on, come on, come—”\nNow, from the other direction, she heard the chanting, and grinned. The Sisters were always on time. She heard their feet now, the regular tramping blotting out the shouting of Pombrine’s guards and the wailing of a woman temporarily deafened by the fireworks. Louder the feet, louder the heavenly song, and the procession passed the garden, the women all in white, all hooded, lit candles held stiffly before them, ghostly in the gloom as they marched by in unison.\n“What a priestess,” Shev whispered to herself, and threaded from the garden, jostling her way into the midst of the procession. She tipped her candle to the left, so its wick touched that of her neighbor. The woman frowned across and Shev winked back.\n“Give a girl a light, would you?”\nWith a fizzle it caught, and she fell into step, adding her own joyous note to the chant as they processed down Caldiche street and over the Fintine bridge, the masked revelers parting respectfully to let them through. Pombrine’s place, and the increasingly frantic searching of his guards, and the furious growling of a pair of savagely arguing Northmen dwindled sedately into the mists behind.\nIt was dark by the time she slipped silently through her own open window, past the stirring drapes, and crept around her comfortable chair. Carcolf was asleep in it, one strand of yellow hair fluttering around her mouth as she breathed. She looked young with eyes closed and face relaxed, shorn of that habitual sneer she had for everything. Young, and very beautiful. Bless this fashion for tight trousers! The candle cast a faint glow in the downy hairs on her cheek, and Shev felt a need to reach up and lay her palm upon that face, and stroke her lips with her thumb—\nBut, lover of risks though she was, that would have been too great a gamble. So instead she shouted, “Boo!”\nCarcolf leaped up like a frog from boiling water, crashed into a table and nearly fell, lurched around, eyes wide. “Bloody hell,” she muttered, taking a shuddering breath. “Do you have to do that?”\n“Have to? No.”\nCarcolf pressed one hand to her chest. “I think you might have opened the stitches.”\n“You unbelievable baby.” Shev pulled the robe over her head and tossed it away. “It barely broke the skin.”\n“The loss of your good opinion wounds me more deeply than any blade.”\nShev unhooked the belts that held her thief’s tools, unbuckled her climbing pads, and started to peel off her black clothes, acting as if it was nothing to her whether Carcolf watched or not. But she noted with some satisfaction that it was not until she was slipping on a clean gown that Carcolf finally spoke, and in a voice slightly hoarse besides.\n“Well?”\n“Well what?”\n“It has always been a dream of mine to see a Sister of the White disrobe before my eyes, but I was rather wondering whether you found the—”\nShev tossed over the package and Carcolf snatched it smartly from the air.\n“I knew I could rely on you.” Carcolf felt a little dizzy with relief, not to mention more than a little tingly with desire. She had always had a weakness for dangerous women.\nBloody hell, she really was turning into her father . . .\n“You were right,” said Shev, dropping into the chair she had so recently frightened Carcolf out of. “Pombrine had it.”\n“I bloody knew it! That slime! So hard to find a good expendable decoy these days.”\n“It’s as if you can’t trust anyone.”\n“Still. No harm done, eh?” And Carcolf lifted up her shirt and ever so carefully slid the package into the uppermost of her two cash belts.\nIt was Shev’s turn to watch, pretending not to as she poured herself a glass of wine. “What’s in the parcel?” she asked.\n“It’s safer if I don’t tell you.”\n“You’ve no idea, have you?”\n“I’m under orders not to look,” Carcolf was forced to admit.\n“Don’t you ever wonder, though? I mean, the more I’m ordered not to look, the more I want to.” Shev sat forward, dark eyes glimmering in a profoundly bewitching way, and for an instant Carcolf’s head was filled with an image of the pair of them rolling across the carpet together, laughing as they ripped the package apart between them.\nShe dismissed it with an effort. “A thief can wonder. A courier cannot.”\n“Could you be any more pompous?”\n“It would require an effort.”\nShevslurped at her wine. “Well, it’s your package. I suppose.”\n“No it isn’t. That’s the whole point.”\n“I think I preferred you when you were a criminal.”\n“Lies. You relish the opportunity to corrupt me.”\n“True enough.” Shev wriggled down the chair so her long, brown legs slid out from the hem of her gown. “Why don’t you stay a while?” One searching foot found Carcolf’s ankle, and slid gently up the inside of her leg, and down, and up. “And be corrupted?”\nCarcolf took an almost painful breath. “Damn, but I’d love to.” The strength of the feeling surprised her, and caught in her throat, and for the briefest moment she almost choked on it. For the briefest moment, she almost tossed the package out of the window, and sank down before the chair, and took Shev’s hand and shared tales she had never told from when she was a girl. For the briefest moment. Then she was Carcolf again, and she stepped smartly away and let Shev’s foot clomp down on the boards. “But you know how it is, in my business. Have to catch the tide.” And she snatched up her new coat and turned as she pulled it on, giving herself time to blink back any hint of tears.\n“You should take a holiday.”\n“With every job I say so, and when every job ends, I find I get . . . twitchy.” Carcolf sighed as she fastened the buttons. “I’m just not made for sitting still.”\n“Huh.”\n“Let’s not pretend you’re any different.”\n“Let’s not pretend. I’ve been considering a move myself. Adua, perhaps, or back to the South—”\n“I’d much rather you stayed,” Carcolf found she had said, then tried to pass it off with a carefree wave. “Who else would get me out of messes when I come here? You’re the one person in this whole damn city I trust.” That was a complete lie, of course, she didn’t trust Shev in the least. A good courier trusts no one, and Carcolf was the very best. But she was a great deal more comfortable with lies than with truth.\nShe could see in Shev’s smile that she understood the whole situation perfectly. “So sweet.” She caught Carcolf’s wrist as she turned to leave with a grip that was not to be ignored. “My money?”\n“How silly of me.” Carcolf handed her the purse.\nWithout even looking inside, Shev said, “and the rest.”\nCarcolf sighed once more, and tossed the other purse on the bed, gold flashing in the lamplight as coins spilled across the white sheet. “You’d be upset if I didn’t try.”\n“Your care for my delicate feelings is touching. I daresay I’ll see you next time you’re here?” she asked as Carcolf put her hand on the lock.\n“I shall count the moments.”\nJust then she wanted a kiss more than anything, but she was not sure her resolve was strong enough for only one, so though it was a wrench, she blew a kiss instead and pulled the door to behind her. She slipped swiftly across the shadowed court and out the heavy gate onto the street, hoping it was a while before Shevedieh took a closer look at the coins inside the first purse. Perhaps a cosmic punishment was thus incurred, but it was worth it just for the thought of the look on her face.\nThe day had been a bloody fiasco, but she supposed it could have been a great deal worse. She still had ample time to make it to the ship before they lost the tide. Carcolf pulled up her hood, wincing at the pain from that freshly stitched scratch, and from that entirely unreasonable ulcer, and from that cursed chafing seam, then strode off through the misty night, neither too fast nor too slow, entirely inconspicuous.\nDamn, but she hated Sipani!\nOriginally published in Rogues, edited by George R. R. Martin and Gardner Dozois, 2014.\nJoe Abercrombie is one of the fastest-rising stars in fantasy today, acclaimed by readers and critics alike for his tough, spare, no-nonsense approach to the genre. He's probably best-known for his First Law trilogy, the first novel of which, The Blade Itself, was published in 2006; it was followed in subsequent years by Before They Are Hanged and Last Argument of Kings. He's also written the related First Law World trilogy, Best Served Cold, The Heroes, and Red Country. His most recent novels are a new trilogy, Half a King, Half the World, and Half a War. Coming up is a collection, Sharp Ends. In addition to writing, Abercrombie is also a freelance film editor, and lives and works in London."}