{"fingerprint": "epCzm+Ov2kyPuRkjhI4RL7ejeQE=", "sitename": "Clarkesworld Magazine", "title": "Pony by Erik Amundsen", "author": "Erik Amundsen", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/amundsen_10_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pony by Erik Amundsen", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3750 words, short story\nPony\nSkull Pony is eying me again. He drifts in the paddock, shifting every now and then, always facing me. I don’t like him and I don’t trust him and I’ve more than half a mind that thinks the feeling is mutual. The other ponies, they cluster around the rock at the center of the paddock, young near the middle, all of them grazing in their unhurried way, cropping up what they can find, but Skull Pony, he wants to tell me he’s wise to me. I believe him.\nIt’s not a good idea to assign the ponies gender. It’s a step on the road to anthropomorphizing them and that’s the hell-highway to getting yourself killed by them, a kick or a bite or a weapon array from a design passed through hundreds of generations of hereditary memory. We’ve done brilliant things in our time as a species—the ponies, for example—but we’ve never been that good at walking around outside, making that any safer than it is. Too fast, too big, too much. We were never up to it at our best, and our last best was a while ago.\nIt’s an even worse idea to give the ponies names, shit, that will get you pulled if you ever say it out loud. Normally, anyway, but DeJesus said the name and we’d all been thinking it real loud, and that’s got everyone in a shitty mood. We would have pulled up stake at the sight of him in better times. Better times not being these times, and Skull Pony not being aggressive, yet, and so clearly important to the herd, we’ve been hoping to just work around him. Tag the ponies we want, get them in the barn and off to market.\nSkull Pony dates to somewhere in the Dark Third. He’s got a weapons array on him that flicks in and out of the sheath on his belly and has an uncommon resemblance to a pecker bone. Thus he: kind of a reddish brown and angular, he’s got a white mark all across his face that, when you look at the overall shape of the beast dead on—and he’s always looking at you dead on, sliding his silver pecker slowly in and out its sheath—calls to mind a skull peering in three-quarters, canted just a little to the left. He’s a good nine times as old as the next oldest we’ve dated in the herd. And that’s weird. Usually there’s so little in common between generations spread out so far that they’re not much inclined to herd together. More often, they’ll spook and run from one another. Sometimes they fight, and the next generation gets born armed and skittish.\nThat’s always a miserable shame. Most of the first generation after a herd’s dander gets up is nothing but a menace, and you have to put them down. Skull Pony’s got just that kind of a look. Only we won’t risk it. Killing him would spook the herd, and better times aren’t these times, and well, we’re an enlightened species. Enlightened species, far as I can tell, we all learn that you must be very, very superstitious when you’re in space.\nSkull Pony is an omen like a dry and wracking cough that leaves you dizzy, a sign you need to lay off the smoking. So of course we do the thousands-years-old human thing and ignore it and hope it’s not what you think and it’ll go away on its own. But there I am, floating on the end of the magnetic tether, sidling up to a promising-looking colt, and there he is, right with me. I can’t hear him, but I imagine I can—the raspy pulse of breath, the jets and shifts and the drawing sword sound of the pecker-bone maser. The others are all glad it’s me; everyone who isn’t me ought to be.\nThe colt is grazing, hugging close to the rock and near to a parent. Resemblance is close and clear, but, with the exception of Skull Pony, the herd is pretty homogeneous; variations on a set of themes. Ponies don’t have genders, but they do have parents. Usually it’s two or three. Design by committee works about equally well with all species, as far as I can tell, and it makes for some damned funny-looking children. Occasionally, a single parent will get an idea and reproduce on its own; Law of Heaven alone knows where they get those ideas. At this point, our lives are so full of things that we did so long ago that we can only look at them and wonder what we were thinking; so full that if wondering was all we ever did from here on out, we’d never get through all of them.\nI catch Skull Pony’s reflection off the colt’s saddle. I watch that reflection, seeing it see me.\nI want you not to be here.\nI breathe, because that’s important to remember, and so I can keep my posture as relaxed as I can. Ponies don’t know from tension, exactly, but they aren’t stupid, and when I change my ways, the colt will notice and then we are going to have to go through this all afresh and anew. And time is not factoring on our side on this project.\nThere are some wranglers who will just scoop up all they can of a wild herd, tranquilize them and take them back to their ring, and sure, it’s the quick, and, as long as you’re careful to kill off all the ponies packing weapons, relatively easy way. Assuming any you catch live. Assuming any you catch can be broken in the ring. Assuming any who live and can be broken have traits that you want to use. In case you missed my opinion, or the opinions of my associates on the matter, we’re not in favor; but sometimes, it does give us those come-hither glances. Also, I would love it if Feng cooked Skull Pony right now. He could make that a birthday present for me.\nThe colt’s parent isn’t much bothered by me. Sturdy thing, it’s clearly not interested in anything but what it’s gleaning, molecule at a time, from the surface of the rock. Steady, not terribly fast in the running, and not too bright. The colt, on the other hand, got all the good from the parent present and clearly some other things besides. It’s a little skittish with me, but not very. I can put my hand on it. It doesn’t shy at the touch of the diagnostic cloud. It grazes on some of it, but that’s only natural. Ponies glean up any matter they can find: rocks, ice, methane, the corpses of other ponies, the corpses of spacemen who don’t pay attention to omens, the usual things you find.\n“Transatmospheric?” DeJesus is being casual for my sake, but Skull Pony is very close to my tether and blocking her clear line of sight. And I think he’s doing it on purpose.\n“You can only wish.” Very few you find in the wild ever are. We breed it in artificially, but new bloodlines are in all kinds of demand. Take-care-of-all-our-financial-worries kind of demand. The colt is not, but that doesn’t mean it’s not valuable. I just need to know a thing or two more.\n“However . . . ” Something promising coming in on efficiency levels, stability, maneuvering . . .\nAnd then Skull Pony noses into me. DeJesus starts screaming at Feng in Portuguese, and Feng starts screaming back in Hokkien and my stupid suit diagnostics start running through their protocols in firmware English; three languages feeding into the same head. The colt, the herd, Skull Pony, the rock, the barn and lots of nothing, spinning, and Diver Wei is trying to shut all but one of those things out and focus on the integrity of, in order, his tether, his suit, and his tired flesh. We should worry and feel sorry for poor Diver Wei; he’ll get back to it when he does not fear for his life.\nWithout the tether, the suit is drifting and the flesh is over. Without the suit, the tether is irrelevant and the flesh is over. The flesh can kind of go fuck itself in all of this, except that it’s mine, and I am not quite through with it. I can see a jet of material spreading out from Skull Pony, while DeJesus is talking about the tether, and that English-speaking girl voice—Sylvia—is talking about the suit, and Feng is bemoaning our inattention to blatant omens, the line of information the least relevant to my next few corporeal moments, but in the language I know best of the three. This is why a lot of crews fly monolingual, except for the fact that all the firmware in the suits is in a language otherwise dead since the Dark Third. This is why my life must always be a hardship.\nAnd why my life continues on in hardship is because Skull Pony gave me only the lightest of love-taps. The tether, which he ever-so-slightly disrupted, rights me the moment he gets out of its way. Sylvia comes back with all systems nominal. All is right in the world, except my colt is about five hundred meters away from me, huddled against its parent, clinging to the rock.\nAnd we start anew. We start afresh. Now Skull Pony has had his fun and wanders off, his weapon now retracted, his nose pointed at the rock, browsing for fuel to replace what he lost fucking with me.\nPatience and persistence. If you want anything in this world, you know how this goes; it takes me a while to get near the colt again. A long time, slow movements, long stillness. I get hungry, but the day is long and the food in the galley is not anything a man wants to hurry and eat. It gets better the longer I am out here. The colt needs to reassess. It needs time to reassess. I need to take time. I should have gone back up to the barn, then, fool of a man, because putting out the cloud is going to be fresh in the colt’s mind as being associated with fear. Or maybe it won’t, but that’s the gamble, and if it doesn’t pay out, then there’s no point in coming back tomorrow.\nColt doesn’t shy when I put my hand on its flank. It turns a little away from me, which puts me in jeopardy of a kick, but I don’t think it will. I deploy the cloud.\n“You’re kind of far out, Diver,” DeJesus says. And I am, but Skull Pony is not here, and that makes all the difference I need to stay. Calm, still; patience and persistence.\n“Fuck.” This is a bit embarrassing, really. Not a rookie mistake, exactly, but one I thought was below me. The cloud tells me that the saddle is all wrong, and my eyes flick up toward it, and it is. A jumble of conduits and cables fills the saddle, the tiniest bit of condensation covers its shell.\n“Couldn’t even fit ox brain in this thing.” And why would you want to? Ox brains work fine for oxen, but even dim ponies are smarter, and kind of useless for anything but single-occupant transportation.\nThe others have been calling in similar things and half of them are back up at the barn already. Problem with a lot of high reproductive rate herds is that they start thinking that the vestigial parts of them, the parts we need, are, in fact, vestigial; like they somehow own their bodies.\n“Come in, Wei. The day is officially bullshit.” And since it was official, I started climbing the tether back to the barn.\nBut the day wasn’t officially bullshit, yet. Official bullshit got started around the time that Feng picked up a contact.\n“Bitter Flower is paying us a visit. Let’s not be here when she arrives.” Tethers start reeling us, the three of us left outside, up toward the barn. There are questions to ask, but they make it policy not to answer them when they are asked from the tethers. Chief among them is “Are you going to have to run before I get back?” Because the Bitter Flower is full of the kind of people who will fry you in your ship and push your remains out the airlock before flying it home. The kind of pirate who won’t give so much as the honor of an old-fashioned boarding and face-to-face shooting. But then, why go outside when you don’t have to, right? Shit is cold out here, and even with a suit that constantly presses in on you and helps massage blood through your veins and little friends busily working night and day to repair tissues, bodies don’t like to work right in space. Really, everything we’ve learned tells us that space is not the place we ought to be.\nSkull Pony is following me back to the barn. Now the day is officially bullshit. He gets good and close, too, taunting me, the fucker. He gets along ahead of me, a little ways closer to the barn than I am and I see him, I know what he’s going to do, because, in space, you can’t not telegraph the evil you’re about to commit. And there is not a thing I can do about it. He crosses the tether.\nFirst thing I do after that is turn off the alarm, because there is no point in that alarm. If you don’t realize, you’re so much better off not knowing. The second thing I do is crash into Skull Pony, face-on, because I am still moving.\nDeJesus doesn’t tell me anything. It’s not like there is anything to say. The barn lumbers away from the paddock and then jumps, flickering out of view. I see this in the shell of Skull Pony’s saddle. The Bitter Flower does whatever it does when its crew realizes their quarry recognized them and ran. I never see that ship. It’s much too far to see. What I do see, encased in some clear carbon lattice just below the shell of Skull Pony’s saddle, is the skull. It’s leering out at three quarters, tilted slightly to the left. No jaw bone. Nine thousand years old. Sylvia tells me the suit is fine for all the good that’s going to do me. My ribs tell me today is officially bullshit. Skull Pony floats in front of me. Tilting and changing position so that it’s always dead on, looking at me with its skull within a skull.\nOkay. So. Now there is a little time for me to decide a few things. There is the easy way, which the suit unlocked for me the moment my connection to the tether severed. Two injections, the first a powerful narcotic, followed thirty seconds later by the kind of neurotoxin that doesn’t give you time to feel the needle that delivered it. And I expect the ponies to graze on me and we’ll see what happens; whenever we get any clear evidence that a pony’s incorporated human materials in any meaningful way, we tend to kill them. They’re not exactly street legal and Skull Pony here is a really good illustration of how wrong it can go. There are others. We ran into one who incorporated the suit neurotoxin into a sort of barb weapon. We weren’t sure what its parents were going for with it, but we didn’t let it stick around long enough for us to find out.\nSkull Pony and I are starting to drift away from the rock. Running into him slowed me down, but not a lot, and not that it matters. The barn won’t be back unless they have some way of being sure that the Bitter Flower is gone, and even I don’t have that. I watch Skull Pony watching me. I wonder what he thinks.\nThere are stories. They’re the kind of thing you tell green wranglers on their first ride out. Some ponies get the taste for people, because, you know, if you start listening to stories, you’ll realize that in all the galaxy, we really are the tastiest thing going. They’ll start grazing on you while you’re still alive, even, some of them. Oh yeah, dissolve your body right out of the suit as the atmosphere vents and your blood vessels go slack and your heart beats against the empty and the cold. You’ll see yourself unravel into the mouth of that pony as the tears freeze over your eyes.\nAbout now, I am thinking easy way. What man wouldn’t? But then, what man wouldn’t try to live while there’s a chance at living, right? I am a wrangler, after all. I break ponies. I break them in the ring. I break them over the course of weeks. On the other hand, I am gambling with a life that I’ve already sort of lost, and the day is officially bullshit, so why not?\nBut a glance tells me why not. While I am still in the paddock, I am much too far from the rock. I could try to flip around and push off of Skull Pony, if he let me, and if I got a trajectory that would actually get me to the rock. It might take a little while more than I have, anyway, and even if I hit the rock, I’m not guaranteed to be close enough to a pony. The pony I get to might not be any better suited to me than the colt from before.\nSkull Pony has insignia. They catch my eye for the first time, because, for the first time I am looking at him, rather than trying not to. It’s nothing I can read, some centuries-old variation on Korean, maybe. Fuck, who knows? There he is, still, looking at me, close enough, maybe, to touch.\n“Let’s reevaluate our relationship.” I reach into my pouch. Skull Pony’s pecker bone weapon slides half out of its sheath. The crop is in there, but that’s not what I’m thinking about. Maybe it’s the skull, or maybe it’s because I need the comfort, but what comes out of my pouch is not the crop at all. It’s a pack of smokes.\nThis is how I get myself to quit, when I try to quit. I feel better knowing they are with me. I’m not going to light up out here. Also, when I fail to quit—and yes, there are ways to quit that are absolutely effective, but they are irreversible and I have my pride. Fine, truth, I like trying to quit, I don’t actually want to succeed. Can we go back to me trying not to die in the more immediate sense?—there’s no better place to keep them from getting stale. I flick a cigarette out of the pack and hold it up to Skull Pony, a form of greeting I learned from my father, that he learned from his, and granddad learned from his and all the way back down the line, through the Dark Third, probably back through fourteen thousand years to when tobacco first made its way to my homeland. It’s been like this for a little more than half my nation’s history and all of its space-faring days, which kind of makes it the sort of venerable tradition people like to try and hold onto when they spread themselves between stars.\nIt’s not a good idea to go anthropomorphizing them. Even if—especially if—they might have incorporated human DNA in their own protocols. I let the cigarette float in front of Skull Pony. He looks at it for a moment. How I know his attention is on it and not me, well, I suppose I’m projecting. I’m a smoker; it’s where my attention would be.\nSkull Pony catches it in his grazing array and then it’s gone. The weapon slides away, back into its sheath. I put my hand out, over the skull, touch him.\n“So, I’m not very good at this, but I figure I have nothing to lose. I don’t know if you’re bothering to listen to this, or if you understand me talking at all. I’d try Korean, but if that’s what you speak, I’m not going to insult you or myself with my shit command of the language you haven’t heard since who-knows-when. So here it is. I think you did this for a reason, or maybe you were just curious? Anyway, I don’t think you’re doing this just to kill me. Well, maybe.”\nSkull Pony doesn’t make his purpose clear.\n“I’m going to try to get into your saddle. If you kill me, I won’t hold a grudge, but I have to try. If you let me, I’m going to ask you to take me someplace that’s more interesting than here, and I promise I’ll let you go, if that’s what you want, and I promise we won’t come back for any of this herd and you can believe me on that, because none of them are good for humans to fly.”\nSkull Pony does nothing. I make my way over to the saddle shell. The access mechanism is a basic, old one, nothing unusual. Under it, there are the outlines of eight enemy ships, a make I don’t recognize, not ponies, certainly. Under those eight, three neat rows of ponies in outline. Vertical red lines through each. I wonder at the doctrine that includes single-occupant vessels in space-borne combat. Really, I wonder at all that shit, but right now I am more wondering if the shell is going to open.\nI try a couple of codes. Skull Pony holds still, well, still relative to me. He’s thinking.\nHe lets me in. The saddle is fully appointed, cushions, safety straps. There is a plastic good luck charm, green and orange, hanging from the reins. Internal displays light up, language configures to something I can mostly read. I strap in. The shell closes around me.\n“Atmospheric pressure detected.” Sylvia sounds almost surprised. “Pressure equalized, composition is breathable.”\nSkull Pony pushes the reins toward me. Behind them, a pretty young woman and a little boy smile out from a glass chip and nine thousand years.\nGiddyup."}