{"fingerprint": "WjVQNt9ALAhW+PsWcomHZX9XQT4=", "sitename": "Clarkesworld Magazine", "title": "Explicit Queerness: A Conversation with Charlie Jane Anders by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/anders_interview_2021/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Explicit Queerness: A Conversation with Charlie Jane Anders by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Explicit Queerness: A Conversation with Charlie Jane Anders\n If you ever get to see Charlie Jane Anders host an event where she introduces people, you will be amazed by the way she sparkles; but you’ll also be astonished by her creative prowess. She comes up with highly entertaining, whimsical, and in-some-world probable introductions, individualized for each person she introduces. It’s kind of breathtaking and suggests unfathomable creativity.\n Anders was born in Connecticut and grew up in Mansfield. She studied English and Asian literature at Cambridge University and studied abroad in China. To date she has well over one hundred stories published: her nonfiction and fiction appears in a range of publications, from literary notables such as McSweeney’s and Mother Jones to technologically inclined venues such as WIRED and MIT Technology Review to well-established genre magazines like Asimov’s, Lightspeed, and Tor.com.\n Anders’ 2005 debut novel, Choir Boy (Soft Skull Press) won a Lambda Literary Award and was short listed for the Edmund White Award for Debut Fiction, but this was just the beginning. The 2011 novelette “Six Months, Three Days” (Tor.com) was a Sturgeon and Nebula award finalist and won a Hugo Award. All the Birds in the Sky (Tor), a novel published in 2016, received an Otherwise Award honorable mention, placed sixth in the Goodreads Choice Awards for the Fantasy category (garnering nearly fourteen thousand votes!), was a Hugo finalist, won both a Nebula Award and a Locus Award, and took the fifth spot on the Time Magazine list of the year’s ten best novels. Short story “Don’t Press Charges and I Won’t Sue” (2017; Boston Review’s anthology Global Dystopias) was a finalist for both Otherwise and Locus awards and won a Sturgeon Award. The 2017 collection Six Months, Three Days, Five Others (Tordotcom publishing) was a Locus Award finalist, and the 2019 short story “The Bookstore at the End of America” (A People’s Future of the United States) won a Locus Award. Not only was 2019 novel The City in the Middle of the Night (Tor Books) a Clarke Award finalist, a Hugo Award finalist, and a Locus Award winner, but it was also named one of the year’s best books by The Guardian, Den of Geek, and Polygon. Even more recently, 2020 novelette “If You Take My Meaning” (Tor.com) was a Sturgeon and Locus award finalist.\n Besides being a celebrated fictioneer, Anders was honored with the Emperor Norton Award for “extraordinary invention and creativity unhindered by the constraints of paltry reason” in 2009 for her work with reading series Writers with Drinks—a spoken word “variety show” she founded in 2001 that features science fiction alongside literary fiction, poetry, comedy, and other genres—and science fiction blog io9. Among her many, many feats, she created the award-winning satirical website GodHatesFigs.com, “which is sadly now down, but it’s still up at Archive.org,” once helped to organize a trans spoken word tour called the Cross Gender Caravan, which went all over the country, and during the COVID-19 crisis, she helped to organize a series of online fundraisers for local bookstores at welovebookstores.org. She also helps to organize and cohost the monthly Trans Nerd Meet Up.\n With Annalee Newitz, Charlie Jane Anders cohosts the two-time Hugo Award-winning podcast, Our Opinions Are Correct, “about the meaning of science fiction.” Her most recent titles are YA sci-fi adventure Victories Greater Than Death, published in April with Tor Teen; Never Say You Can’t Survive, “a book about how to use creative writing to get through hard times,” published in August with Tordotcom Publishing; and collection Even Greater Mistakes, due from Tor Books this month. Victories sequel, Dreams Bigger Than Heartbreak, is scheduled for April 2022 publication.\n What were the books that were important to you when you first started getting into genre, and do you feel like people should read them, do they still hold up?\n There were two books that made me want to write SF, when I was starting out. I read Consider Phlebas by Iain M. Banks and Geek Love by Katherine Dunn at almost the same time, and they both blew my mind in very different ways. They felt like they were both science fiction, and they were both huge and ambitious—like, they were pushing the limits of what I thought you could accomplish in a science fiction story. Neither of them felt like anything I’d encountered before. I reread parts of Geek Love a few years ago and still really loved it, though I don’t know for sure how it would be read today. And I still love Banks’ writing inordinately. I have a handful of Banks books that I haven’t read yet, and I’m saving them because I know there are no more coming.\n Did these books or stories have any measurable effect on your writing?\n Yes, definitely. Reading both of those books, I kept thinking, “I could never write something like this, but I really want to try.” Or maybe, more like, “I could never write something like this, but I really want to try to write something else that creates this same feeling of hugeness and strangeness.” Those two books really pushed me to get weirder and to throw myself at the walls of the genre. They felt “slipstream,” which was a term people were using back in the day.\n At this point in your career, you’ve received considerable acclaim. Does the recognition drive you?\n It’s incredibly gratifying and also very intimidating. I try not to obsess about it too much, because I know it can just drag you down. When I won the Hugo back in 2012, I remember saying to a few people that it felt like something I had to live up to. I interviewed John Kessel around that time, and he said that winning the Nebula Award as a young writer made him feel a lot of pressure to write something especially good afterward, which caused him to be frozen for a year and a half. So, I decided not to obsess too much about it. I often don’t mention the awards in my author bio, since I would rather use that real estate for the titles of stuff I’ve written. My Hugo rockets are in my sweater drawer (partly because I didn’t want my cat to destroy them) and my mom has my Nebula. The Locus awards are behind a pile of books somewhere. I think the Lambda Literary award is out on a shelf because I got that one first.\n You had Victories Greater Than Death come out in April, which is a YA book. In your 2016 Locus interview for All the Birds in the Sky, you talked about consciously thinking on “this narrative about finding where you belong in the world, and coming of age . . . ” Are there important similarities between these books?\n Yes! I remember thinking to myself that Victories has a lot of resonance with All the Birds. They both have characters who grow up and leave the ordinary behind. And that theme of finding where you belong—but also realizing that belonging is more complicated than just being around people who share something basic or intrinsic with you—is huge in both books. I’ve been revisiting All the Birds a bit lately and it feels like there’s a lot of territory in common.\n What is the key to writing a coming-of-age story that really speaks to readers?\n What I love in a coming-of-age story is a character who is discovering their identity at the same time that they’re learning how the world works. There’s something super powerful and also heartbreaking about realizing that the world wasn’t what you thought, while also claiming your own selfhood and your own power. I sort of think of Empire Strikes Back as the great coming-of-age story, alongside the Earthsea books. And more recently, Binti by Nnedi Okorafor.\n Victories centers on Tina and her friend Rachael, pitted against The Compassion and Marrant. What are your favorite things about Tina and Rachael, and what excites you most about the world/universe you’ve built?\n I love the friendship between Tina and Rachael—the book honestly didn’t start to click the way it does now until I figured out those two and their relationship. In earlier drafts, it was a bit thornier and more antagonistic, because of Tina always wanting to protect Rachael, and they weren’t exactly friends until toward the end of the book. But having Rachael be in on Tina’s secret from the beginning, cheering Tina on but also wishing that she could go into space as well, opened things up in a way that made the rest of the story way more fun to write. I love how Rachael brings another perspective to the story, because she’s an introverted artist who isn’t usually part of these kinds of stories, and how Rachael ends up bringing this whole group of teenagers from Earth together. My favorite thing about this universe is probably that the universal translator, the EverySpeak, will not let you misgender anyone. It will make sure everyone hears your correct pronoun, even if someone intentionally tries to get it wrong.\n Book 2 in the series, Dreams Bigger Than Heartbreak, is scheduled for April 2022. Can you tell us anything about where the story goes in Dreams?\n Sure! Dreams Bigger Than Heartbreak basically reveals all the stuff I hinted at in the first book, and we get answers to all of the mysteries/questions that were posed the first time out. We visit the Palace of Scented Tears and meet the Queen, and we discover the secrets of the ancient gods whose atrocities made the galaxy the humanoid-centric place it is today. The second book has a strong theme around being able to witness horrors and confront evil, and still be able to be creative and build community. Like, how do you see the worst the universe has to offer and still keep going? Also, there is a definite “rise of fascism” story line that may have been partly influenced by, ahem, certain events. It turns out that when adults confront scary stuff, they lose their heads and make really terrible choices.\n Your collection, Even Greater Mistakes, is about to come out. In your recent nonfiction book, Never Say You Can’t Survive, you talk about writing fiction as a way to help deal with the terrible things that can happen in real life. Are there stories in the collection that were difficult to revisit, some that carried sharper moments than others?\n There’s one story in Even Greater Mistakes that’s really hard for me to reread: “Don’t Press Charges and I Won’t Sue.” That is the dystopian nightmare I cooked up right before Trump’s inauguration in 2017, when I was terrified about what this new era could mean for trans people. As I discuss in Never Say You Can’t Survive, imagining a distorted, surreal version of the absolute worst-case scenario helped me to process my fears and feel okay. But that story is really gut-wrenching, on purpose, even though it has a somewhat hopeful ending. I’m still really proud of it, and I hear all the time from trans people that it has meant something to them—I also hear from cis people that it helped them to understand a bit more. The other stories in the book are ones I never get tired of revisiting.\n Collections can often bring stories back into focus, giving them new life. Are there one or two stories here that you thought would make more of a splash, that really excited you or meant a great deal to you, but that just didn’t get noticed the way other pieces did?\n I would say about half the stories in the book are ones which slid under the radar, and I am very excited for more people to discover them. Most of the time, short fiction is kind of overlooked unless people really make a point of celebrating it. This is one reason I’m so glad Locus is still going strong: all of the thoughtful short fiction reviews. Like, “Vampire Zombie vs. Fairy Werewolf” might be the most fun thing I’ve written, and it kind of slid under the radar. And there are a handful of stories which appeared in literary magazines that not many SF readers probably checked out. Like “My Breath is a Rudder,” “Captain Roger in Heaven,” “This Is Why We Can’t Have Nasty Things,” and a few others. I feel like there are a handful of stories in the book that a lot of people might have read, but most of them will probably be new to most people.\n Publishers Weekly says, “Each tale immerses readers completely and effortlessly into the tense scenarios Anders imagines. The result is both rewarding and impressive.” Even Greater Mistakes offers nineteen stories. If readers looked at three stories in this book, what would you want them to be, and why?\n It’s weird—because like I said, I think there are a few stories in there that have gotten a lot of eyeballs already. “Six Months, Three Days” is an obvious choice, and so is “As Good As New,” which was featured on LeVar Burton Reads. “Don’t Press Charges” is also a story that got a ton of love. I guess I’d like for people to know that this collection goes in a lot of weirder, sillier, more outlandish directions than they might expect from those stories. Like a few of them are a bit raunchier, or more obnoxious in other ways. My roots in queer lit are showing here, and so is my time in the trenches of literary fiction generally. Part of why I’m excited is that people are going to get to see more of the range of what I write.\n Which stories do you think may challenge readers more in some ways, and how so?\n I do think some people will find the sex and explicit queerness in stories like “Rudder” and “Captain Roger” and be a little startled. “Nasty Things” kind of talks about queer spaces and what it means to lose them to gentrification and displacement, and along the way the characters talk about the ways that we build community when we’re trying to get laid. There is definitely a thread running through some of these stories of not just acknowledging, but celebrating, horniness and healthy, consensual hookups. It doesn’t get super explicit for the most part, in terms of long descriptions of body parts, but the sex-positivity is right there.\n When you write short fiction, what are the biggest challenges for you, and has this changed since the days of your first fiction publications?\n I think the main challenges are the same at any length—figuring out how the story makes sense, and finding a good ending that doesn’t feel like a cop-out. I haven’t written as much short fiction in the past few years precisely because the challenges are the same—if I write a novel, I only have to agonize over the ending once, whereas five short stories have five endings to stress out over. I really miss writing short stories, and I hope I can get back to them when the YA trilogy is put to bed. If I had my way, I’d be writing short stories all the time.\n What else are you working on, what do you have coming up that you’d like folks to know about?\n Feverishly working on the third book in the Unstoppable trilogy. Plus, there’s an adult novel that hasn’t been announced yet, but I’ve already written about half of it, and I’m having a total blast. I cannot wait to be able to talk about it!\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}