{"fingerprint": "GxHnXm4PH14iKGX5kieTpY6DyB4=", "sitename": "Clarkesworld Magazine", "title": "All the Words in the Sky: A Conversation with Charlie Jane Anders by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/anders_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: All the Words in the Sky: A Conversation with Charlie Jane Anders by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAll the Words in the Sky: A Conversation with Charlie Jane Anders\nThere’s a dividing line, however fuzzy, between magic and science. The mysteries and miracles are pitted against the hard numbers and plausible explanations. Fantasy versus Science Fiction. Charlie Jane Anders’ new novel explores this boundary and finds it to be thinner and more porous than we originally thought.\nTo shove All The Birds In The Sky into a neatly defined genre box would be like caging a songbird so that it refuses to sing. In one sense, it is an intimate, magical coming of age tale. In another, it’s a rollicking sci-fi adventure where the fate of the world hangs in the balance. As children, Patricia discovers she may be a witch who can talk to animals, and Laurence creates a wrist-watch-sized time travel gadget that only moves the wearer ahead two seconds at a time. Their paths in life intersect and weave together into one as global catastrophe sits on the horizon.\nCharlie Jane Anders is the editor-in-chief of i09, has won a Hugo, Lambda Literary Award, and was short-listed for the Edmund White Award. Her fiction has appeared in McSweeney’s, Lightspeed, and ZYZZYVA. Her latest novel, All The Birds In The Sky, was released from Tor Books in January.\nDo you think technology has become more like magic?\nThat’s a really interesting question. It really depends on what you think “like magic” means. In one sense, technology has definitely become more like magic, in that most people could not take apart an iPad and put it back together again, or understand exactly how the operating system works. If you think of “magic” as meaning “something whose operation is mysterious or opaque to the user,” then technology has gotten much more magical since the days of vacuum tubes and valves and things.\nOn the other hand, if you think of “like magic” as meaning, “fickle, unpredictable, and connected to a worldview that is fundamentally outside our experience,” then not so much. I often like fantasy novels where there’s an element of the dreamlike, the uncontrollable, the ineluctable, about magic. According to this view of magic, technology has become, if anything, less magic-like in recent years. You pretty much always know that your computer will start up when you push the “start” button, and I haven’t even had a dropped phone call in ages. Magic that works as reliably as the push of a button every single time always feels a little bit too sterile and easy to me. So I would actually argue that in some of the ways that matter most, technology is moving away from being like magic.\nBut of course, these are huge generalizations, and the future is unevenly distributed, etc. etc.\nThe settings throughout your novel, particularly the heart of the forest, are wonderfully evocative. Are they based on any particular places you’ve visited?\nThank you! I grew up in New England and actually did get lost in the woods on a few occasions, and it had a huge impact on me. Something about the forest looking kind of the same in every direction and not even really being able to see the sky clearly is kind of awe-inspiring. Sometimes you wander through the woods, sort of going in circles and sort of spiraling outwards, and stumble on something you never would have known was there, like a patch of wildflowers or a weird hut that someone built out in the middle of nowhere. It always feels like a domain of nearly endless possibility to me.\nDid any mythology play a part in the magic you created for All The Birds In The Sky?\nNot really. I sweated bullets trying to come up with a world of magic that didn’t feel too derivative of stuff I’d read or seen before. I started out with something much more place-holdery, and then a time came when I was getting so deep into writing the world of magic that I needed to come up with a history, and organization, of magic that felt somewhat real. And so my primary concern was not relying on the things I’d seen done before. Actually, the main thing that comes out in my use of magic is a love of magical realism. Some of my favorite things involving magic are when people use Trickster magic that involves storytelling or some kind of poetic license—Dorothea, in particular, is a witch who makes amazing things happen by telling these surreal stories. (But at a cost: She can never tell the truth, ever. Except maybe in the Confessional, because she’s Catholic.)\nThe magic in your novel seems to come at a cost. Does technology have a similar cost attached to it as well?\nThe notion of magic having a cost is a major idea in a lot of fantasy books and stories, and I hope I found my own spin on it. The aforementioned thing about Dorothea is an example of the way that magic winds up costing you in the long run. As for technology, though . . . the question of whether technology “has a cost” is really dependent on whether you believe in social cost, and whether the user of a particular technology should have to pay for (or be concerned with) externalities such as pollution, labor abuses, and other problems. I’m a pretty big believer in reducing our carbon footprint and trying to create a more humane economic system, in general, so I would say that technology does have a cost beyond what you pay at Best Buy.\nWhen researching the science for this book, what was the most interesting tidbit of knowledge you picked up?\nI talked to tons of experts on everything from superstorms to wormholes to biology to make sure that various aspects of the science in the book were accurate. The more I worked on it and revised it, the more important it seemed to me that the science be connected to real-world knowledge (even if it was “mad” science, and thus more extreme)—because having real science was the best way to draw a contrast with the novel’s fantasy content. But the most surprising thing for me was learning about how to make the artificial intelligence in the novel seem realistic and plausible—by talking to a few people, chiefly Lydia Chilton, a postdoc in computer science at Stanford. She told me some stuff that blew my mind, including the idea that you could recognize an A.I. in the making, because code would grow exponentially more complex until it suddenly became radically simplified (as the A.I. started to reshape its own code using rules that are more elegant than ones humans could come up with). I’m paraphrasing, but this was an insane thing to learn about.\nYour book plays with some of the tropes of both science fiction and fantasy. Was it difficult to strike the right balance while keeping the emotional core of your story?\nThis was SO hard. In fact, this was a big reason why I tried to stop thinking of it in terms of “playing with tropes” and started thinking of it, instead, in terms of a story about two characters who came from two different worlds. The less I consciously tried to comment on the expectations of a fantasy story or a science fiction story, the easier it got to stay focused on the characters. But finding the emotional core of any story is often a nightmare, and once you find it, staying connected to it is even harder. It took a lot of ruthless slashing and burning of clever setpieces and neat story ideas, to make sure I was keeping just the stuff that made the characters come into focus. But there’s never any guarantee that you’re doing it right. You have to go with your gut, and hope for the best!\nWhat was the most difficult scene to write?\nGod, there were so many that I wrote and rewrote and tore up and then wrote again a totally different way. Actually, the very last scene I wrote in the book is the one where Laurence and Patricia are watching parrots eat cherry blossoms. Nothing much “happens” in that scene, but it felt pivotally important for a bunch of reasons. And I tried it a hundred different ways: that scene took place at a rock concert, at an environmentalist rally, at a tech party that Milton Dirth was throwing, and a bunch of other things. Part of the problem was figuring out exactly what conversation they needed to have there. I could have cut that scene entirely and it would have been fine, but it felt like there was something missing.\nIf you could hang out with one character from All The Birds in the Sky, who would it be?\nI would be terrified to meet any of them! That would be really weird. I guess I would like to hang out with Dorothea, because I think she’d be fun to go dancing with.\nWhat are you working on now? I heard something about space and an exoplanet?\nI’m under contract for another novel with Tor. At the moment, it’s a science fiction novel set in the future, on another planet. We’ll see how it goes!\nFinally, I must ask, can you talk to birds?\nSure, of course I can! So can you! Whether they will talk back is another matter . . .\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}