{"fingerprint": "vu8tXpUtUPi6hKFLTZRcTzhQG7M=", "sitename": "Clarkesworld Magazine", "title": "Another Word: The Techs Can Do It by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_06_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Techs Can Do It by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: The Techs Can Do It\n “Consider greatness as a business strategy.” —Michael Swanwick\n I worked front-line tech support for a little mom-and-pop Internet service provider for almost ten years. I started off as the guy who asks you to check if your caps lock key is on. Slowly, I advanced to being Director of Technical Support, which in the context of a company that size meant I was still picking up the phone and asking about your caps lock key, only I was doing employee evaluations and management meetings too. Much of my view of the world was solidified at that desk.\n The advantage of small businesses is that they can be agile. Working with only a few dozen folks at the same office, it’s not as hard to coordinate change and make experiments, as it would be with a couple dozen divisions full of people scattered around the world. In the age of the Internet, change was a constant. I started off that job tracking down init strings for 28.8 modems. I ended my time there programming DSL routers for VPN. There was a lot of territory in between.\n And so along the way, we tried out a lot of new projects. Every few months, it felt like we’d be looking at how to roll out a new service or collect data to get a better picture of how the office was running. And, of course, all of these things required someone’s time and attention to make them go. The natural choice—and the one I pushed back on and fought against for years—was the floor techs. We weren’t a massive call center that tracked a new call to you as soon as the last one dropped. People had downtime between one email and the next. If we needed someone to test out the new backup system or see if the NT webserver was working or check the incoming routers into inventory, the techs could do it.\n And so the job got bigger and bigger, the responsibilities not just larger, but more varied. We had to be familiar with the new systems and how to fill out the proper paperwork. It became almost impossible to do a good job as the body of knowledge we had to master expanded with each new project. The choice came down to removing some of that work load from the techs so we could spend our time being technicians (and not inventory control and billing and installation schedulers and programmers) or else have techs spread so thin, that we were crap at everything.\n Which—you saw this coming, right?—brings me to self-publishing.\n Before we go on, let me make it clear that while I’m pretty much entrenched in the traditional publishing model right now, I’ve got nothing but respect for my friends and colleagues who are investing in self-pub. Everyone from the CEOs of the parent companies that own the publishers to the new writer just starting out is clear that we’re in the middle of a sea change. The publishing world now isn’t what it was ten years ago, or what it’s going to be ten years from now. No one knows for sure how this is going to come down, and I have no ground to criticize any other writer’s decisions about profit sharing and production models.\n But some things aren’t going to change. Publishing has always (and I’m going out on my limb here) will always be made up two games: writing beautiful things, and selling them. The first game is like chess, because when we’re playing it, we have control. We can choose every word and sentence. We can sit with something that’s not quite working and think. We can ask our friends for help or keep it to ourselves.\n The second game, selling, is gambling. It’s not just that we can’t control all the variables; we can’t even know what all the variables are. Maybe the book will find its audience. Maybe it will sink like a stone thrown in the ocean. There are a lot of strategies for bending the odds—book trailers, blogs, conventions, books tours, interviews—but no one is every really sure how well they work, or why one works one time and not another.\n That second game is hard and punishing, and it isn’t fair.\n Add to that, it has a lot of parts. Making the cover art. Laying out the cover. Getting blurbs, if you’re going that way. Writing the cover copy. Editing. Copy-editing. Proofing. Formatting. Printing. Distributing. Maintaining inventory. Auditing. Arranging publicity. Even after a book’s draft is done to that absolute best of our ability, there are at least half a dozen more things that need to happen. All of them require their own skill sets. All of them can be done well or poorly. And all of them affect our odds when the time comes to roll the bones and let the book out into the world.\n The self-publishing models that intimidate me assume that the techs can do all that. Writing good books is a huge, complicated, profoundly difficult job to start with. It can take years of getting it wrong—sometimes badly wrong—before we even start getting it right. I am assured by my professional artist friends that painting and graphic design are much the same. Editing is a different set of knowledge, and damned hard. Self-editing is harder. Marketing and publicity require familiarity with a whole host of techniques and rules of etiquette and professional conduct. Sales needs not only a skill set, but a personality type, and I’m not convinced that it can be taught.\n When I’ve been with my friends and colleagues who are taking the self-pub route, the conversation almost always seems to turn to the second game: sales, marketing, publicity. (e.g. how to get the books out there and how to get them noticed.) Rarely if ever, do we turn to talking about how to craft a great book: what dialog does and doesn’t do, what makes descriptive passages pop, what models of plot structure are useful and why. There’s a good reason for that. It’s the same reason that back at work we talked about the new forms the accounting department wanted us to fill out more than how to troubleshoot DNS problems more effectively. We worry most about the parts we feel most behind on, even at the expense of the actual core of our jobs. And that’s especially true when we’re feeling overwhelmed.\n Speaking for myself, the reason I’ve kept with the traditional publishing model for all its faults and my complaints is that I’m not a good salesman. I’m a crap graphic designer. All I need to do it look at my copyedited manuscript to see how badly I need a copyeditor. I don’t have the contacts among the book buyers and distributors to get my stuff into stores. Each one of those, someone else does as their full-time job. They’re better at them than I will ever be, I am putting myself in competition with the projects they’re working on, and I don’t have the money to hire all those services out piecemeal.\n So for me, for now, this is how I’m keeping it from turning into a situation where the techs have to do everything. As publishing shifts, group co-ops are going become a viable option. Publishers will compete more on the services they provide to authors. Everything will go on changing with distribution, marketing, sales and profit sharing.\n Storytelling won’t, and that’s the part I want to be good at. More than that, it’s the part I want other writers to be good at. I believe that someone who has spent ten thousand hours honing her craft and struggling with all the difficulties and ambiguities of making a good novel is going to do a better job that someone who has spread that same time over half a dozen different jobs. I want to read the work of great writers, and so I want there to be great writers.\n I don’t think that can happen [as often] when we look at all the different things that putting a book into the world requires, shrug, and say we can have the techs do it.\n Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}