{"fingerprint": "H5OQlLVfUyP1vHBnJSR20Uz3Egw=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Luke Versus Han: An Approach to Characterization by Kelly Robson", "author": "Kelly Robson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_01_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Luke Versus Han: An Approach to Characterization by Kelly Robson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Luke Versus Han: An Approach to Characterization\n I’ll always be grateful to Steven Barnes. At Orycon 2012, he passed on advice that made a huge difference to my writing. Steven said, when we get a story idea, we usually know either the character or the problem. To develop the story, we can ask ourselves the following questions:\n \n If we know the character, ask, “What is the worst thing that can happen to this character—and better yet, how can they do it to themselves?”\n If we know the problem, ask, “Who is the worst person to give this problem to?”\n \n This was the exact piece of information I needed in that moment. I’d been struggling through early drafts of my novella “Waters of Versailles.” The story wasn’t working. I knew where the plot was going, but I couldn’t seem to get it moving. Suddenly, I knew why.\n When I asked myself—“Who is the worst person to give this problem to?”—the trouble became clear. I’d given the problem to the wrong person. My original protagonist could easily have solved the problem by page six. If the story was going to work, I had to give the problem to the wrong person.\n I started from scratch with a new protagonist. After a lot of work and with lot of luck, the story was a finalist for both the Nebula and World Fantasy awards, and won the Aurora Award. A story stuck in the mud became an award-winner. Thank you, Steven Barnes, you dear, generous person. And thanks, Orycon.\n (To be clear, Steven didn’t claim ownership of the advice. I don’t know if it’s original to him or whether he was passing it on. He did mention that “how can they do it to themselves?” was Lois McMaster Bujold’s innovation. And it’s a darned brilliant one. Thank you, Lois.)\n Fast-forward five years. I apply Steven’s advice regularly and have passed it on to many other writers. I also posted it on my blog, hoping it would help other writers as dramatically as it helped me, but I haven’t heard anyone report back. Not surprising. Not all advice works for all people. That’s why we need so much of it.\n Good writing advice isn’t hard to find. It’s everywhere. You can read books by luminaries, like Ursula K.Le Guin’s Steering the Craft and Jeff VanderMeer’s Wonderbook which provide detailed guidance from admired pros. Blogs, articles, and YouTube videos about the craft of writing are so numerous you couldn’t possibly consume them all. The stream of writing advice never goes dry, and we need every drop because no two humans think the same. We all struggle with different problems at different times, and use unique frameworks to organize our thoughts.\n As for me, I really like simple questions that lead to complex answers.\n Steven Barnes’ two simple questions help explore dramatic tension, develop conflict, and put characters and plots in context. But they’re not a magic wand that fixes every broken story. Though incredibly effective with “Waters of Versailles,” they’re not quite as useful for my current story-in-progress, where the problem is much more subtle and personal. But they still provide a terrific framework for thinking about the mechanics of the story as a whole.\n Recently, I’ve been struggling with characterization. The advice I’ve found doesn’t resonate; it’s too ephemeral. So, I came up with my own simple concept that—for me, at least—lays bare the bones of a story and clears the way for effective surgery. (This is where Luke and Han come into it. Sorry for making you wait.)\n Here it is: A character should either know who they are or what they’re doing.\n Like the two questions above, this concept examines the relationship between character and plot, with a focus on character behavior. It’s about what a character does in the story. It’s about agency, how a character expresses their will in the world, and makes their presence felt.\n A character who knows what they’re doing, but not who they are, has goals and is actively looking for a route to a clear outcome. A character who knows who they are, but not what they’re doing, still makes their presence felt because every interaction is informed by their strong sense of self.\n For example, take Luke Skywalker. At the beginning of A New Hope, Luke has no idea who he is, but he knows what he’s doing—he’ll save that princess or die trying. In contrast, Han Solo has no idea what’s he’s doing but he knows exactly who he is—badass captain of the Millennium Falcon and don’t you forget it.\n Two classic characters with polar opposite psychological outlooks on life. At the end of A New Hope, Luke is beginning to find out who he is, and Han is finding his purpose.\n The problem with simple questions that lead to complex answers is, if you look at them for too long, you start to get vertigo. Deep breath. Okay.\n Let’s try that again: A character should know one of two things: Who they are, or what they’re doing.\n You can pick one, but not both. A character who knows what they’re doing will find out who they are by the end of the story, for good or ill. A character who knows who they are will find their purpose.\n But is that true? What if a character knows neither who they are, nor what they’re doing?\n This character is going nowhere. That can be a problem. They’re passive, reacting to outside forces, getting kicked though the story by the plot. This can work if the conflict is intensely internal, but takes a steady hand to pull off. A lot of domestic realism takes this stance, and an example in our genre might be Maureen McHugh’s deft China Mountain Zhang. In this case, the prose has to be exceptionally beautiful and incisive.\n What about a character who knows both who they are and what they’re doing?\n This character has nowhere to go; they’re already there. But we see it done successfully when the conflict is intensely external. Many series adventures and mysteries fall into this category. Think, for example, of James Bond. He absolutely knows who he is and what he’s doing. In this kind of story, plot is everything; character development doesn’t really come into it. We might be able to put Lois McMaster Bujold’s much-beloved Vorkosigan books into this category, though the wonderful Miles does develop as a character, brilliantly, over many books. In this case, the plotting has to be exceptionally strong.\n Once again: A character should know one of two things: Who they are, or what they’re doing.\n Sometimes a character thinks they know who they are, but they find out the truth in the end. Sometimes they reject that truth.\n Frodo Baggins is the perfect example. He thinks he knows who he is (a simple Hobbit) and he knows what he’s doing (destroying the One Ring). In the end, we know that he’s a great hero. But Frodo rejects that view of himself. He will never consider himself a hero, and has been broken by his ordeal.\n An opposite example is Jane Eyre. Young, orphaned, rootless, she doesn’t particularly know who she is, nor what she’s doing; she’s simply taking the only route available. But when pushed to extremes, Jane’s strong personality surfaces, with her radical spiritual outlook. She has always known who she is. Jane learns to impose her will on the world and is rewarded with happiness.\n This isn’t a recipe or formula to solve every story problem. It’s just a way of thinking about character and story. In my current story-in-progress, my main character Jules is over a hundred years old. At that age, it’d be sad if she didn’t know who she is or what she’s doing. But when I examine Jules in this way, the key to her character becomes clear: She’s been avoiding something her whole life. For her story to have meaning, she’ll have to face up to that reality.\n Again, not all advice works for all writers. But the next time you’re at sea with a story, especially if the problem seems to be character, try asking yourself: Does my character know who they are, or do they know what they’re doing? If they know neither, then it’s time to pump up the incisive beauty of your prose. If they know both, then your plotting game has to be spectacular. But if they know one and not the other, then you’ve got a character with places to go and a story to tell about them.\n Kelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica."}