{"fingerprint": "6cfTxQt4FW8qvK4IZBuC5r3C7q0=", "sitename": "Clarkesworld Magazine", "title": "Another Word: The Trouble with Utopia by Kelly Robson", "author": "Kelly Robson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_01_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Trouble with Utopia by Kelly Robson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: The Trouble with Utopia\n In a previous Another Word column, I got grumpy about dystopias. They’re fun, but often also a bit of a cop-out from a worldbuilding point of view. A dystopia instantly feels momentous, serious, tense. The more dystopian the setting, the weightier the story, increasing the chances that the story will be taken seriously. A dystopia creates its own external conflict. It also means the writer can stack the story with violence, because in a world gone wrong, violence is often the only option.\n But damn, I’m sick of them. Let’s talk about utopias instead. Chirpy, bright Utopia, land of health and happiness, where the good are great and the great are heroes. All our many beloved, utopian classics—\n Cue the turntable needle scratching across the record.\n Actually, SFF doesn’t create utopias very often. Ursula K. Le Guin’s The Dispossessed is probably the main utopian classic in the modern canon. Of course, there are others (Alastair Reynolds in Blue Remembered Earth, and Samuel R. Delany in Trouble on Triton come to mind—feel free to school me in the comments). Utopias were comparatively popular in the 1970s but their popularity faded fast. Utopias are rare now. In fact, they’re statistically irrelevant compared to dystopias.\n Why? Utopias are great. They show us just how good humanity could have it if we could only set aside our differences and work together. That’s valuable. You can’t aim at something if you can’t see the target. I think we need more utopias, so here comes the hard sell for creating your own. We’ll hit a few problems along the way, but it’ll be fun.\n Define Your Utopian Conditions\n First, think hard about what you value, what you think is true and beautiful about humanity, and make it the core of your Utopia. But right away we hit the first big problem with making a Utopia. People don’t all value the same things.\n Here’s a specific example. I have a series of loosely-connected stories with a common socioeconomic system I created to be utopian. It reflects my vision of a positive future for humanity, but almost nobody recognizes it as a Utopia. In fact, most reviews identify it as a dystopia.\n It’s not though. It’s a border-free, post-scarcity universe. Nobody suffers from lack of food, shelter, or material goods, and there’s a wide variety of options for quality of life. No matter how weird someone’s idea of a good life, they can probably find it. People who want to work, work. Those who want to play, play. Violence is extremely rare. Disease, eradicated. War, nonexistent. Everyone should recognize this as a Utopia, so why do people call it a dystopia?\n It’s because the economics in this universe only work by making some difficult trade-offs, and these trade-offs look more than a little dystopian.\n The first trade-off is overpopulation. The economy is based on the idea that the only thing of value is people’s time. The basic unit of value is the billable hour, and the only way for a city to get more billable hours in its balance sheet is to attract a growing population. This is my sneaky way to instill the value of human life in a capitalist system.\n It means a popular, successful city is crowded. People who value personal space more than, say, a vibrant social scene might have to leave. Depending on what they want out of life, they might decide to move to a less successful city, which offers a quality of life that attracts fewer people and therefore offers more private living space.\n The second trade-off is lack of privacy. Timely and efficient delivery of municipal services in a highly populated urban setting requires situational awareness—which is essentially widespread surveillance. Not coincidentally, surveillance is also an effective tool for conflict mediation and crime prevention.\n Widespread surveillance is a classic dystopian element, direct from Orwell’s 1984. But does it have to be? Freedom from the threat of violence is certainly essential for a Utopia, and without changing human nature, or instilling behavior modification tech (another dystopian element), I’m stumped over ways to achieve it.\n I’d argue that surveillance itself isn’t dystopian. It’s a tool like any other, and it’s dystopian only in a corrupt system with draconian laws. That’s arguable, I agree. But, like I said, not all of us value the same things.\n So, here’s my Utopia: A post-scarcity, borderless world where everyone freely pursues their bliss and nobody dies in war or lives in fear. It’s crowded and there’s very little privacy, but those trade-offs suit me just fine. How about you?\n You likely aren’t willing to make these same trade-offs to get a post-scarcity, borderless world. You might not even want a post-scarcity, borderless world. Your Utopia is probably completely different, and the trade-offs you’re willing to make for it might make it a dystopia for me.\n So, if we can’t agree on what makes a Utopia, can we even make one?\n The Trouble with Trouble\n There’s another problem, too. Probably everyone would agree that utopias are conflict-free. If people fight all the time, it’s no Utopia, right? But what’s a story without conflict? No wonder utopias are so rare. There’s a piece missing, and it’s the central tentpole of storytelling.\n Now, I started trying to talk you into making a Utopia, and have already given two reasons why it’s impossible.\n But don’t worry, this second problem is easier. People are conflict engines. We can make drama out of two sticks and a bit of dried moss.\n You already know this. But for writers, it’s always worth contemplating how well and truly people can screw things up. If humans as a whole are expert at one thing, it’s creating problems, and the path of human history shows us getting better and better at making bigger and bigger messes.\n Have you ever tried to get a group of people to work together, even to achieve a simple goal? Unless they’re trained professionals drilled in workflow processes and led by talented leaders, forget it. Total disaster. And even when it’s just two people, anyone who’s ever been in a serious relationship knows how difficult it is to harness up and pull together year after year, over all life’s potholes. Even when people love each other, lasting cooperation is hard.\n The options for human drama are endless. We make decisions with partial information, failing to consider implications in detail. Even when we do analyze a problem to the best of our ability, unexpected knock-on effects can turn the best of decisions into disasters.\n We can’t help but screw things up. Humans are nosy and impulsive. We make emotional decisions while claiming to use considered logic. Or we get so caught up in doing our jobs, we forget to interrogate our actions. Even when we do the right thing, we work so hard we neglect to take care of ourselves and the people we love.\n Systems break down. Communication conduits get clogged. The perfect team cracks under pressure. A stranger comes to town and throws everyone into a tizzy. In a Utopia, as in any story, the possibilities for conflict are limitless.\n The one thing you probably can’t do in a Utopia, though, is unleash the violence. Maybe that’s one reason dystopias have become so popular: we can’t really accept violence unless it’s in a world with no choice. Which is no bad thing, at all.\n Put It All Together and Stick It In the Oven\n Have I convinced you yet? Take your most cherished human values, layer them with key trade-offs to make the system work, then slather it all over with sweet human drama, and you’ve made a Utopia cake.\n But if nobody’s going to recognize it as a Utopia, is it worth all that effort? Darn right. Because one thing’s for sure: your Utopia will be interesting. So, build it, write it—your own private Utopia. I can’t wait to visit.\n Kelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica."}