{"fingerprint": "wRrBHkq4FK7zziPGySSXETXZoz0=", "sitename": "Clarkesworld Magazine", "title": "Another Word: The Elizabeth Effect by A.M. Dellamonica", "author": "A M Dellamonica", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_05_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Elizabeth Effect by A.M. Dellamonica", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: The Elizabeth Effect\n Story creates alternate realities.\n The laws of our universe, as we imperfectly understand them, are where these realities begin, yet the results are not always bound by those rules. This is especially true in the literature of the fantastic, of course, and it’s something I don’t really need to tell Clarkesworld readers.\n So, why am I? Because I want to talk about feedback loops, about how story comes back on us. Allegedly fictional realities change our timeline, if you will, on a regular basis, in ways both expected and unexpected.\n Once upon a time, remember, humans figured out what stars are, and then how the planets moved. Thanks in no small part to dreamers like H.G. Wells and Jules Verne, we then envisioned a future where our species was no longer solely bound to Earth. Engineers and scientists came up with useful ideas like orbital velocity and useful constructions like rocket fuel. They measured the speed of light and fired American men at the moon.\n Even as this tale, an artifact of the historical record, gained currency, storytellers had already zoomed ahead, leaving NASA in the dust. Some envisioned and named the warp drive, building a ship around it, and broadcasted stories about a glorious future where, instead of setting on each other like hyenas, our descendants agreed to set aside international differences—those pesky real-world fictions about how we differ, even if we don’t. They packed up an interstellar wagon train, and decide to boldly go.\n Put this way, it perhaps seems like a fairly linear and logical process. Reality inspires fiction: fiction inspires innovation. Voila, space race. But other things spun off, too, remember? Fannish passion, that energy more volatile and powerful than dilithium, exploded everywhere. It powered, among other things, a Klingon translation of Hamlet.\n I think one can safely argue that that is pretty bleepin’ random. Wonder at it for a second! The Tragedy of Khamlet is a concrete script, one you can purchase, read, and assign to your students, and even perform. It’s a story written by some Elizabethan guy, rendered into the tongue of a star-faring warrior race whose entire empire lives and breathes within the gray matter of Star Trek aficionados.\n Alternately, consider the bifurcating timeline of Queen Elizabeth II.\n Start with the Elizabeth we think of as the original, patient zero. A flesh and blood human woman, as far as anyone knows, with a sky-high media profile and a thoroughly bizarre job. What you think of that job, and how she does it, is your business. Maybe you feel strongly about it; maybe she’s just part of the background noise. Is what she does vital? Does it make a difference? Or is it a fiction, too? You decide.\n Then there’s an Elizabeth newly on offer from Netflix, in the form of a show called The Crown. This Liz is married to Doctor Who XI, television royalty in other words, and that feels pretty damned significant within the context of this particular essay. In the real world, she’s descended from Mary Boleyn; in this particular strip of the fiction-verse, she’s played by an actress who made a terrific showing as Anne Boleyn in Wolf Hall . . . another fictionalized version of another historical narrative.\n But wait! There’s more! Soooo much more. Stay tuned and you could win a set of steak knives. An interested consumer of story who wasn’t keen on The Crown, for example, could also get the Helen Mirren film, The Queen. They could read, perform, or otherwise absorb a Peter Morgan play called The Audience, scope out the BBC’s, The Queen at Ninety documentary, cast about for just the right drag show, or—my personal favorite—read Alan Bennett’s utterly fantastic alternate history novella, The Uncommon Reader.\n If you want a little speculation about her future, the Guardian’s, “London Bridge is Down” has had people talking about her funeral ever since it came out in March.\n Like any woman, the Queen contains multitudes: she is not only head of ye crumbling empire but a mother, grandmother, and wife. Simultaneously and not at all separately, she has become a fictional construct. Her timeline has literally diverged.\n This is bread and butter stuff for science fiction writers, and yet even we assume we’re making up intangibles.\n Elizabeth’s transformation may seem a frippery or an insignificance. However, consider that the tidal effect of story has so much power that billions of people watched the real deal, Elizabeth Prime if you will, as she traveled to the opening ceremonies of her country’s 2012 Summer Olympiad, with another great British figment, James Bond.\n How can we not boggle at fiction’s power to warp reality when someone so high up the economic and political food chain deems it worthwhile—even necessary—to cosplay publicly with and as a fiction? To publicly bridge the meta-boundary between our universe and one created by Ian Fleming? Is the Queen thereby assuming or reassuming rights over that extradimensional real estate? Is she colonizing our imaginations? You tell me.\n Meanwhile, here in North America, a competition show known as the 2016 U.S. Presidential Race recently awarded its grand prize and some really posh digs to a so-called reality TV star, at a time when journalism, allegedly a transmitter of truth, has become notoriously, horrifically, laughably unreliable. Writers and fans alike talk and tweet about living in the worst possible timeline. People routinely use analogies from The Hunger Games to describe the present-day predation of the world’s wealthy 1% upon . . . well, upon everyone else. When you hear someone invoke Lord Voldemort these days, you have to parse out whether they’re talking about Tom Riddle or some other dude who shall not be named.\n When the going gets tough in my particular house, the tough turn to costume drama. While avoiding the news cycle, lately, I’ve been getting a lot of vitamin Queen in my media diet. I’ve seen and read all those stories I’ve already mentioned, and am about to start watching Victoria. There was a time when I was nigh-indifferent to the various Elizabeths, their progenitors, and their spawn, but somewhere along the line that changed. She’s been in so many shows I like, after all. She’s at least as real to me as Buffy.\n So, when that Guardian article came along, I was primed for it. The real-world mechanics of the Queen’s future funeral are fascinating. That article, non-fiction to the core, describes multiple possible futures without batting an eye: if she dies this way, this’ll happen. If it happens another way, here’s the plan. If something goes wrong, the contingencies are . . . and so on.\n This is fascinating stuff, particularly to a science fiction writer. It’s a portrait of a world every bit as alien, to most of us, as Arrakis.\n Anyway. There I am, reading, fireworks going off in my writer-brain. Without a moment’s pause I hit FORWARD, so my wife, Kelly Robson, can lose a comparable amount of work on her current writing project. Later, when we are back together, we will squee, and OMG, and come up with Elizabeth ideas of our own. There’s a timeline in which one of us makes Elizabeth immortal, throwing all that solemn British funeral preparation to the winds. There’s a timeline where we both write a story like that. The possibilities branch from there.\n In chaos theory, the butterfly effect suggests that a small perturbation of air, caused by an insect, can affect the later path of a tornado. The Elizabeth effect suggests to me that we storytellers fire narratives at our most powerful figures and institutions, and thereby alter their very nature, and perhaps—now and then—the course of the present timeline.\n This is a process which transcends the laws of physics, a mystery buried deep within the murk and swirl of human nature. Perhaps it’s every bit as worthy of investigation as the nature of quantum particles. What might we learn, if we poured a particle accelerator’s worth of resources into understanding the process?\n At a time when we desperately need to quintuple down on our efforts to terraform the Earth so it will remain a suitable habitat for humankind, this is a question we would do well to unlock. How we create alternate realities and invite the real world to participate in—even embrace—them could matter terribly.\n Whatever you read, whatever you watch, and especially whatever you write, it changes you. Story has altered how you feel about Elizabeth Prime. Story has altered who she is. Now imagine that effect, multiplied, feeding back elsewhere, and possibly changing our outcomes now, just when we may need it most.\n A.M. Dellamonica's first novel, Indigo Springs, won the Sunburst Award for Canadian Literature of the Fantastic. Her fourth, A Daughter of No Nation, has won the 2016 Prix Aurora for Best Novel. She has published over forty short stories in Tor.com, Strange Horizons, Lightspeed, and numerous print magazines and anthologies. She was the co-editor of Heiresses of Russ 2016. She teaches writing at two universities and is pursuing an MFA in creative writing at a third.\n Alyx is married to Nebula Award winning author Kelly Robson; the two made their outlaw wedding of 1989 legal, in 2003, when the Canadian Supreme Court conferred equality on same sex couples."}