{"fingerprint": "7em45X0de3AxOFdZZdjwY0abdKo=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Free Advice from a Full-Time Author. Worth Every Penny Paid by Wesley Chu", "author": "Wesley Chu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_11_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Free Advice from a Full-Time Author. Worth Every Penny Paid by Wesley Chu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Free Advice from a Full-Time Author. Worth Every Penny Paid\n I’m going to start by admitting that I don’t know what I’m talking about. Nevertheless, I am a full-time writer and my path to achieving my lifelong dream isn’t some quest where the rickety bridge collapsed behind me right after I crossed it. I didn’t grab the only McGuffin along the way as I laid waste to the publishing gatekeepers. In other words, you can probably follow in my footsteps if you desire. Do you actually want to? You may not by the time this article is through, but, if you do, that’s your prerogative. Don’t say you weren't warned.\n Full-time writing is a lot like parenthood, without having to change diapers as often. Mind you, I have no children. Since we’ve already established that I don’t really know I’m talking about, let’s assume you trust me when I say you have to deal with a lot of shit. In the early days, writing will keep spitting up on your shirt and everyone will think what you’re doing is “cute.”\n It’s easy to get discouraged. It’s easy to feel like you’re wasting your damn time doing this stringing-words-together thing hoping to achieve some unattainable goal that seemingly requires pulling blackjack every hand for an hour. Well, you’re not.\n You, my writing padawan, are acquiring necessary skills. You’re assembling a writing toolbox. You’re learning to fail. And fail you will, a crap ton of times as you learn that this metaphorical Phillips screwdriver doesn’t work for squat trying to metaphorically caulk this metaphorical hole in the wall. I know, I know. It’s all fun and metaphors until someone gets cut.\n Let’s go back to the parenthood analogy. You’re nurturing this writing baby and your desperate hope is that this baby grows up to be a productive member of society and not a serial killer.\n Regardless, honing these necessary skills will take time before you “go pro” (and by that I mean someone out there decides that something you’ve written is worth real tangible money). It could be ten years from the first time you sat down to write. It could be the next day (I hate you). Whatever amount of time it takes is the time it takes. I won’t judge you and you shouldn’t judge yourself.\n Let’s say you’re there already. You’ve assembled that writing toolbox. You’ve nurtured your writing career like the mewling babe it is and you “think” you’re ready to write full time. The path to full-time writing is usually slow unless you’re incredibly lucky (I hate you) or a supremely talented individual (I hate you more) that somehow made it big on your first time up to bat (more confusing metaphors!). Thusly, I’m willing to bet you probably work a day job or live with your parents. This is the time in your writing career where you do what you have to survive: serving coffee, programming, veterinarian-ing. This could last for a few years or the rest of your life. I’ll write an article someday about holding down a full-time job and writing part time. I’ll call it Time Management and Self-Immolation.\n How will you know when it’s time to make the leap and become a full-time writer? Well, you won’t know when until you know you have to. How’s that for advice? The common wisdom I’ve received from almost every career writer is that you work that day job until you can’t. You work that day job until you’re just juggling too much and something has to give. In my case, I got laid off and said screw it, I’m going for it. Technically, I kept to the exact wording of “work that day job until I can’t” though I’m pretty sure I violated the spirit of that statement. Goes to show how much my wisdom is worth, eh?\n Let’s assume you have a day job, and you have a semblance of a writing career that’s starting to take off. Suddenly, you’re at Robert Frost’s two roads diverging in the yellow wood. You need to figure out which path to take. Do you keep your soul-sucking functional tolerable wonderful job and write part time? Or do you say screw it (metaphorical screwdriver and all), I’m going for it? There’s no wrong answer to this. You do what you feel is right. However, here are a few questions to keep in mind:\n \n Do you like your day job more than writing? If the answer is yes, don’t quit. Wow. This is easy.\n Are you a huge fan of financial security and retirement? If the answer is yes, don’t quit. I personally plan to write until I die. Really, this advice thing isn’t so hard. Eat your heart out, Wendig.\n Do you like stability? If the answer is yes, don’t quit. This might be getting repetitive.\n Do you like only working forty hours a week? If yes, and assuming your current day job is a straight nine to fiver, then don’t quit. Full-time writing is an all-encompassing seven-days/sixty-hours-a-week job with awful job security—and when I say awful, I mean none—and even worse medical. We sit on our asses a lot which is terrible for our health. That’s another future article: Sitting on Our Asses Is Terrible for Our Health.\n Lastly, is money more important to you than a writing career? If the answer is yes, then don’t quit.*\n \n Wait: let me put an asterisk on that last question. There. You probably read the asterisk before you read this sentence. It’s kind of like a time travel thing just now, isn’t it? Oh yeah, my time travel book, Time Salvager, is coming out in July 2015. How’s that for name dropping? That will be another future article: Marketing Yourself: The Funny, the Subtle, and You.\n Anyway, the asterisk is because there are many variables to consider when comparing writing income to day-job income.\n For example, what’s your dang day job?\n If you’re a doctor, you’ll probably make more with your day job.\n If you’re a garbage man, you’ll probably make more with your day job.\n If you’re flipping burgers at McDonalds, you’ll probably make more with your day job.\n This is why at conventions people call me Wesley the Optimist.\n Admittedly, there are many successful writers who make a pretty respectable living, and a couple who make it huge. Major props to those folks, but writing, as a career, is a feast or famine field. Ninety-five percent of us eke out a living, while the select few sit on their pile of treasure like Smaug. Do I have exact metrics? No, but I’m willing to wager my last dollar bill that it’s probably true. (Please don’t take that dollar from me.)\n There is something to be said about the currency of doing what you love. If you love writing, and I don’t know any career writers who don’t, then that currency has a value to you that, added with the actual currency you earn as a writer, minus your financial obligations to adulthood, can help you decide whether making that full-time writing decision is the right one for you.\n So there you have it.\n I just want to remind you that I stated at the very beginning of this article that I have no idea what I’m talking about. Take everything I wrote with a grain of salt. It’s not an easy path to take, and definitely one less traveled. It’s extraordinarily rewarding with massive highs and some kick-you-in-the-gut lows. As someone who’s worked in the corporate black hole for almost twenty years, I can safely say that this is the most difficult thing I’ve ever done and it is the hardest I’ve ever worked for the least amount of money but I would make this choice all over again.\n My final piece of advice? There will be many things you’ll have to do when you cross that full-time bridge other than telling stories.\n For example, I am getting paid by the word for this article.\n Editor’s note: No he isn’t. We clearly communicated through a barrage of flaming arrows and carrier pigeons that the Another Word pieces are paid a flat rate (no matter how many words are crammed onto the page). We invite you to come back at an undetermined time to view Wesley’s upcoming piece on reading the fine print titled, “How to Avoid Flaming Bird Shit—a.k.a, Dealing with Editors.”\n Author’s Note: Last piece of advice. Read your contracts and rates before writing articles!\n Wesley Chu's best friend is Michael Jordan, assuming that best friend status is earned by a shared television commercial. If not, then his best friend is his dog Eva who he can often be seen riding like a trusty steed through the windy streets of Chicago.\n In 2014, Wesley Chu was shortlisted for the John W. Campbell Best New Writer Award. Chu's debut novel, The Lives of Tao, earned him a Young Adult Library Services Association Alex Award and a Science Fiction Goodreads Choice Award Finalist slot. The sequel, The Deaths of Tao, continues the story of secret agent Roen Tan and his sarcastic telepathically bonded alien, Tao.\n Chu has two books scheduled for 2015. The last book in the Tao trilogy, The Rebirths of Tao, is coming out April 7th. Time Salvager, published by Tor Books, featuring an energy stealing time traveler with addiction issues, is slated for July 7th, 2015."}