{"fingerprint": "1bo9WAv4aaUlAxfOfjnzg91wf/M=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Chasing the High by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_06_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Chasing the High by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nAnother Word: Chasing the High\nWhen you start out wanting to be a writer, you’re screwed. You haven’t read enough to really understand what writing is. There are all sorts of different genres, and you may not know if you’re better at detective novels or literary vignettes or personal essays. You’re pretty impressed by some of the stuff you’ve done when you’re noodling around, but most of it’s not very good. (And you’re probably not actually sure which parts are impressive and which ones aren’t very good.) There’s a whole obscure mechanism between you and getting publishing that you’ve got no idea about, and you don’t want to look stupid. Plus, it seems like everyone you know wants to be a writer, and almost all of them fail, which is, let’s say, discouraging. The sheer volume of things you need to figure out is unmanageable and huge. You’re screwed.\nWhen you start sending out stories, you’re screwed. There are only a few markets that publish the kind of stories you write, and the slush piles there are like broken faucets that won’t turn off. You want to stand out, but short of printing your story on bright blue paper or including a chocolate bar with the submission, you don’t know how to do that. No one knows your name.\nEvery rejection slip—and holy cow are there a lot of rejection slips—makes it a little easier to just not send out the next story. The idea of paying someone to publish your stuff just so it’s out there—just so you can see your words in print—starts to seem like maybe a pretty good idea even though part of you knows that’s the despair talking. The Holy Grail is a personal rejection letter, because at least that would mean someone cared enough to respond to you. You’re screwed.\nWhen you start selling a few stories, you’re kind of screwed. You have a few things in print, and you’ve gotten checks for a couple hundred dollars to prove it! The people in your writer’s group threw you a little party after the first one, but when the third sale came through, the congratulations started getting kind of perfunctory.\nNow that you don’t need the emotional support, you’re not getting as much of it. Except that you’re still basically unknown, and you’re still getting an awful lot of rejections that sting just as much as they did before. You’ve sent your novel out to a few agents and gotten polite “Not for me” answers. You’ve gone to a few conventions and actually been on panels, which on one hand was really cool, and on the other left you feeling kind of like an impostor. The world’s full of people who published a few short stories and then vanished without a literary trace, and you’re starting to think that you may be one of those.\nWhen you sell your first novel, you’re screwed, but only a little. Yeah, there are still a lot of dangers and hurdles coming. The book may or may not get good reviews. You don’t know how it’s going to sell. You’re really jazzed by the cover art, even if there are maybe a couple little things you’d have done differently. Your friends and family are congratulating you. There’s the anxiety that maybe it will fail, but when you walk into the bookstore and see your book on the shelf for the first time, it’s like being in a dream. Yes, if the numbers aren’t good, the publisher may not pick up the next book. Yes, the advance you got for it was less than you’d have made working a minimum wage job for the same hours you spent writing. Yes, some of your unpublished friends seem a little resentful. But at least now you can say you’re really a writer. This is kind of the high-water mark. You should enjoy it.\nWhen you’ve sold a few books, you’re screwed. Your first novel didn’t set the world on fire, but it did okay. It sold through maybe eighty percent of the copies that went out. Only then the bookstores ordered twenty percent fewer of the next title, and that one sold through about eighty percent. So when the third book hit, and they ordered eighty percent of eighty percent of your first book’s numbers, you started looking at a consistent pattern of lower sales, and the eBook sales haven’t been high enough to buck the trend.\nNow your editor is talking about how the subgenre you write in is kind of oversaturated. And there was that one asshole reviewer on Goodreads who totally savaged you for no good reason. When you very politely pointed out that they’d misread the book, the Internet fell on your head for a week. You’re in the death spiral. The good reviews you get are easy to forget and the bad ones linger at the back of your head for days. You’re watching your career die, and the war stories from other writers about the times their careers were shot out from under them only help a little. You’re screwed.\nWhen you hit the bestsellers list, you’re screwed, and no one believes it. You’re a success fercrissakes! This is what the brass ring looks like. Your series actually built, you’ve quit your day job. You’re supporting yourself on the writing alone. You don’t get to complain anymore. Ever. Because nobody has any sympathy.\nSomeone wrote a savage blog post that got passed around dissecting how exactly your books show you’re a vacuous, stupid, venal person who wants to degrade all that’s good in the world because you’re stupid. And then a hundred comments after it praised the blogger for being brave enough to speak the truth.\nA reviewer at a major magazine uses your name as a synonym for bad writing? Suck it up. Or stay off the Internet. If you defend yourself, you’re only going to make it worse. And the sneaking suspicion that you’re only selling your story to the anthology so they can put your name on the cover (and not because the story is good) isn’t something anyone wants to hear. The way that your new book coming out has gone from a massive rush to “Yay, now get back to work” isn’t interesting. Your problems don’t count anymore. You won!\nIf that’s a little lonely, a little isolating, less fun than you thought it was going to be, if you still feel like an impostor, literally nobody wants to hear you whine about it. So shut up and live the dream. No one wants to hear how you’re screwed.\nWhen you’re one of the handful that make it all the way to the top—recognition, awards, more money than you’ll ever be able to spend—weirdly, you’re screwed. You’re a celebrity now. When you go out in public, strangers come up to you constantly and it’s your job to be nice and polite no matter how awkward it is or how bad you feel.\nIf you make a bad joke on Twitter, it’s a headline on Slate and Gawker. The praise for your work seems almost unrelated to the actual words you put on the page, and the story about who you are feels like people are talking about someone else.\nWhenever you meet new people, it feels like they can’t see past your persona. There are maybe three or four people in your life who aren’t asking for things from you. The money is great, and it solves a lot of problems, but not all of them. They won’t let you walk the floor at Comicon anymore because of the security risk. You don’t go out to the movies. You know that your writing is a commodity now just because it’s got your name on it.\nThe jokes about how you could blow your nose on a piece of paper and get a six-figure advance are funny because they speak to a real fear. Maybe you’re not good anymore, because you don’t have to be. The passion that started you down this path is still there, and so is the fear. You want to be good, but maybe you’re only successful. And with the story about you so much bigger than the story you’re writing, there may not be a way to judge anymore.\nA writing career is a constantly shifting environment where there is no promised land. There’s only a changing, and hopefully improving, set of problems.\nThe constants—the pleasure of reading a really good story or paragraph or sentence or phrase (or, even better, writing it), the well-considered praise of a respected voice, the sense of having learned something new or relearned something old in a deeper way—have to be enough, because they’re what we have.\nSufficient unto the day is the evil thereof. And the good. And the work.\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}