{"fingerprint": "jwe71bK4Hml2zEwf32ugXpIXxgY=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Burning Bridges by Peter Watts", "author": "Peter Watts", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_07_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Burning Bridges by Peter Watts", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Burning Bridges\n I’m told they only want one thing for this column. No critique, no crunchy science, none of the stuff I push on my blog or Nowa Fantastyka. ”Another Word” serves exclusively as a showcase for essays “tied closely to your professional involvement in the community.”\n Ew.\n I’m not big on “the community.” I’m not even sure such a thing exists. I know a lot of terrific people working in the shadow of this genre, in any number of capacities—but when you stir them in with everyone else who ever dogged a con, all those varied ingredients always seem to separate out into immiscible globules that can’t stand the sight of each other. You know the tribes. You know the names. You’d have to be blind not to see the fracture lines webbing across the landscape. Calling such disparate factions a community is a little like saying “United States of America” without putting ironic air quotes around the first word. Sometimes I think the best way to deal with them all is to just keep a safe distance while they tear each other to shreds.\n And yet I can’t. No author can. We feed on each other, after all. We write, you read, enough money changes hands to keep the cycle rolling (although most of us are so addicted to writing we’d do it anyway, a design flaw that unscrupulous publishers have used against us for generations). An author could spend their whole life steering clear of cons and book signings and they’d still be bound to the community like a vein to an artery. So Daniel Abraham talks about receding horizons of success in the writing biz; Margot Atwell points us to new markets opened up by online and e-book publishing; Ken Liu waxes about the benefits of laziness and the dawning age of computer-assisted storytelling.\n How to do stuff, in other words. How to maximize your odds of success: what fresh markets to explore, what tech to embrace, what habits to cultivate. And these insights, in turn, comprise the merest fraction of a vast and ever-growing archive of Received Wisdom from the Elders: the Clarion calls, the self-help books, the beta readers and writing groups and university courses taught by bitter Humanities profs who never made it out of the small presses.\n There’s a lot of it out there, whole libraries of the stuff. And yet when I sift through it in search of something useful to say I come up empty—because I never did most of those things, and when I did I usually sucked at them. I did pretty much everything wrong.\n I think I still do.\n You know the list. Write every day. Blog every two or three, lest your fans grow bored and wander back to Buzzfeed. Join SFWA. Schmooze every editor. Infest every social media platform you can find, promote yourself relentlessly every time you so much as publish a laundry list. (I know of one agent who refused to represent an absolutely brilliant author solely because said author wasn’t on Twitter. The agent didn’t even bother to read the work in question; I mean, how great can you be if you don’t talk nonstop about how great you are?) Never badmouth your publisher, certainly not in public; you’ll be painted as a diva and a troublemaker and you’ll never eat in this town again.\n Me? I’m lucky if I have time to blog once a week. I don’t twit, never have; I’m not on any social platform except Facebook, and the only reason I’m there is because I got sick of people saying hey did you read what that guy said about you on Facebook without being able to check it out. (That’s one habit I do share with every author on the planet; we ego-surf almost as much as we masturbate.) I managed to stick it out in the SFWA sandbox for maybe a year before fleeing in horror. I couldn’t schmooze if my life depended on it; back in ’04 I nearly got into a fistfight escaping from a friend who, in the misguided belief that I needed to “network,” was physically dragging me across the room to meet Gardner Dozois. I’m not even above badmouthing publishers, if they deserve it and if backstage efforts get me nowhere (just last January I apparently badmouthed a publisher without even meaning to). According to Received Wisdom, I starved to death in 2005.\n Hell, the most basic rule of the game is get paid for your work, and I don’t even do that very well; I started giving Blindsight away for free online (along with most of my backlist) just a couple of months after its hardcover release. That incredibly stupid, bridge-burning act turned out to be the smartest move I ever made. If not for the publicity it generated (by people with far bigger names than mine—Scalzi, Doctorow, Cramer, others to whom I will always be in debt) Blindsight would have sunk without a trace, and me with it.\n Just to be clear: you’re not witnessing any kind of principled nobility here. Rather, you’re dealing with an ego so fragile it’s more afraid of looking needy than it is of commercial failure. I crave fame and riches as much as anyone else on the midlist—I just don’t want to be that person who trumpets their own eligibility at the top of every awards season, who puts out a goddamn press release every time they get a story published in Prairie Fire. You can’t blame anyone for doing that, of course. We’re told to do that, we’re blamed if we don’t do it: by agents, by self-help books, by publishers who take more and more for less and less in the desperate hope that—if they squeeze their authors just a little harder—they might get out from under Amazon’s boot. But even if it’s necessary, it’s never pretty. Every time I see a panelist introducing themselves by spreading their backlist across the table, I die a little inside.\n Fortunately, I haven’t had to do much of that stuff myself—because while I may not have much stomach for self-pimpery, I was once lucky enough to get shit-kicked and jailed by a cadre of unhinged border guards down in Michigan. I was even luckier to nearly die of flesh-eating disease the very next year (on Darwin Day, believe it or not). The year after that first incident, I won a Hugo. A few months after the second, I won the Shirley Jackson (for a story that debuted right here in Clarkesworld, in fact). Over in Poland, one night in 2011, I set my thumb on fire (it’s actually a thing they do there at parties), and I’ve lost count of the accolades I’ve received from those guys over the years.\n I don’t know whether I deserved any of these wins. I like to think so—but then again, I’ve seen the visitor spikes on my website. The timing is suggestive—I just happen to win the Jackson right after uploaded pictures of the Australia-sized hole in my leg inspires half the internet to toss their cookies?—and it’s not as though anyone seriously believes that there’s no correlation between publicity and awards. (Noting that correlation, I started stepping blindly into traffic after Echopraxia came out. Sadly, the only award that book won was some obscure bauble called the “Bookie,” from the CBC. Maybe because I never actually got run over.)\n My point is there are a lot of ways to get noticed. The best, in my experience, are those where you don’t even realize you’ve committed an act of self-promotion until after the fact. (I’m flashing back to an elevator ride in the Port Huron courthouse, just after my sentencing, when the scary-looking dude behind me sized me up and said “I don’t know if you just set this whole thing up to get new readers, but I went online the other day and found this story you wrote. I think it was called The Things...?”) You don’t have to embarrass yourself at parties or pimp yourself on Twitter or hack your own finished novel into pieces, only to stitch it back together into something your publisher can sell as Young Adult. (Yes, I know people who have done this.) You don’t even have to be especially good at prose; the bestseller lists are infested with people who can barely write their way out of a fortune cookie.\n And I haven’t even mentioned self-publishing.\n This would be the point where I bring it all home with my own set of rules, my own path to success. But I can’t. You’d be crazy to follow my example: it was more accident than design, there were too many flukes and butterflies flapping their wings along the way. Only an idiot would list “nearly succumb to weird space disease” on their twelve-step plan for literary success.\n But the thing is, it wasn’t just a fluke (or a bacterium, or a beat-down) here and there. I did everything wrong, things that should have sunk my career half a dozen times. I’m nowhere near bestseller status and I doubt I ever will be, but I’m still standing, published in nineteen languages. I don’t know if you’d describe it as success. There’s no security in this job; for all I know everything’s going to come crashing down tomorrow. Maybe I’m Wile E. Coyote two seconds before he looks down and realizes there’s no ground beneath his feet, but I’m making a living at this, for now at least. I’ve been making a living at it for most of this century. If this is success, then I achieved it by failing at pretty much every benchmark that’s supposed to matter.\n The only thing I can conclude from that—the closest thing to advice I can offer—is that Rules matter a lot less than anyone told us. They’re statistical descriptors at best, curves, and confidence limits designed to reduce a million data points down to a few manageable parameters. They’re next to useless when it comes to predicting the trajectory of a single point.\n There are a million points in this cloud. There have to be a million trajectories.\n Surely that’s cause for hope.\n Length-of-rejection (used as an index of editorial interest) from Analog, over time. Empirical support for the claim that my writing gets worse with practice.\n Peter Watts—author of Blindsight, Echopraxia, and the Rifters Trilogy, among other things—seems especially popular among people who don't know him. At least, he wins most of his awards overseas except for a Hugo (won thanks to fan outrage over an altercation with Homeland Security) a Jackson (won thanks to fan sympathy over nearly dying from flesh-eating disease), and a couple of dick-ass Canadian awards you've probably never heard of. Blindsight is a core text for university courses ranging from Philosophy to Neuropsychology, despite an unhealthy focus on space vampires. Watts's work is available in nineteen languages."}