{"fingerprint": "qwcpP94lNXGiDKwwhjzyObWymHU=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Killing Rage by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_04_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Killing Rage by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Killing Rage\n I’m not telling anybody what they should do.\n I’m guessing that since you’re here reading essays on Clarkesworld, you’re most likely a fan of genre fiction and maybe spend a little time on the Internet. Seems pretty safe as assumptions go. And because of that, you’re probably aware of the conflicts that have been troubling the online community of fans and professionals recently: Toni Weisskopf’s essay on fandom and John Scalzi’s response, Jonathan Ross hosting the Hugo Awards, Sean Fodera’s comments on Mary Robinette Kowal, Truesdale’s petition about the SFWA Bulletin, Wiscon’s disinvitation Elizabeth Moon, Racefail ‘09.\n The list goes on, I am reliably informed, back through Silverberg’s famous insistence that James Tiptree Jr. couldn’t possibly be a woman, Ballard and Moorcock’s advancement of the New Wave, and pretty much everything Harlan Ellison’s ever done until it disappears in the mists of history sometime before 1930.\n This, for better or worse, is the water we swim in now, and probably always was before. As with everything else in our culture, the Internet has made it weirder and faster and more immediate and more anonymous. We’ve had lots of calls for civility, and lots of responses that those calls for civility usually mean you’d like the other person to shut up and stop bothering you. We’ve had a lot of reasoned, careful commentary by thoughtful people, and a lot of public venting of spleen. We’ve had people who genuinely wanted to come to some deeper understanding and accord, and some who seem to like lighting conversations on fire just to watch them burn.\n Science fiction and fantasy—more than any other genre—has a deep tradition of direct engagement of fans and writers. The narrative of fandom as community—almost as family—was around long before I came on the scene. Truth of the matter is, fandom can be a bruising place to be a professional and a fan. Maybe it’s worse now than it was before, maybe it’s only different. But it’s left me thinking about conflict, rage, rhetorical violence, my experience with them, and the decisions I’ve made about who I want to be publically and professionally.\n I’m going to say this again: I’m not telling anybody what they should do. I’m not interested in dictating how folks act or speak, what they should believe or how they should believe it. Not that I don’t have opinions about that, but I’m not writing a sermon.\n Right now, I’m just laying out part of what I think and how I got here, and what Marshall Rosenberg, bell hooks, and Marcus Aurelius have to do with it. If it’s useful to you, that’s great. If it’s not, you’ll maybe have another perspective on it. Or on me. That’s fine too.\n So there’s this guy, JB. He’s been a friend of mine since middle school, and has always been more spiritual and more religious—though that’s not quite the right word for him—and more engaged with justice than I am. Turns out that’s not actually a very high bar, but he clears it. His track record on recommending interesting, thought-provoking books is really good, and maybe a decade ago, maybe a little more than that, he pointed me toward an author named Marshall Rosenberg, and a book called Nonviolent Communication.\n I can’t express clearly enough how much I dislike this book. Not the content—which I’ll get to in a minute—but the style. This is the most touchy-feely, Pollyanna, syrupy-sweet, Kumbaya-singing book I have ever pulled my self through by the eyelashes. It’s got amateur rhyming poetry in it about people and their hearts. I’m not this guy. My skin crawled when I read this, as it has every time I’ve reread it since. (This, turns out, is a lot.) Because wrapped in this chalky candy heart of a book is a manual for how to invite—even insist on—conflict, and see it through until it’s resolved.\n It talks about withholding judgment, cultivating compassion, listening deeply (and how to include some error correction in that) all with the aim of having actual, meaningful communication happen. And the thing that was most revelatory to me in reading it was the analysis of how useful conflict happens in a range. We can avoid it by minimizing it—turning away, pretending there’s not a problem—or by escalating out of it, derailing it into name calling and judgments.\n If you had to pick a single book that has had the most effect on my public persona, this one’s it. I grew up with insults and wit where other kids just hit each other. I have a very good toolbox when it comes to verbal violence—I’m kind of good at it. And we have a long and vibrant history of gadflies and bullies in our community. Engaging in that is tempting for me, not in the least because I’m pretty sure I could hold my own even in some pretty high weight classes. This is to say, I know I can escalate out of a conflict. I know I can tease people into a kind of semi-coherent rage. I’ve done it; we called it high school. And, from what I hear from my cohorts, part of college. It could have been my professional persona. But instead I got interested in this other set of tools, and this other way to have conflicts. Instead of being showy and witty and clever and outrageous, I got to dissect what the issues really are. It turns out that I like that better.\n Rosenberg—like pretty much everyone who’s been engaged with fandom in the last few years—had to talk about anger. Anger is the emotion most closely associated with violence. That’s true for me, and I’m guessing it’s true for you. And this is true to the point that the two often get confused. Expressions of anger often read like rhetorical violence, and criticisms of someone’s rhetorical style are easy to confuse with (or conflate with or use as) telling the writer that their emotions are wrong. Rosenberg is utterly against violence in how we talk to each other. But he’s strongly in favor of the complete, accurate, and uncompromising expression of anger.\n I had to sit with that for a long time before I had any idea what he was talking about. It wasn’t an easy thing for me to parse, and I still struggle with it sometimes. The good news is, I have an example I can go back to.\n When I picked up the book Killing Rage by Dr. bell hooks, I thought that the title would be an essay about how to, y’know, kill rage. Get rid of it. Boy-howdy, did I have that wrong. The essay Killing Rage is about living in a state of justified anger, and as a piece of writing, it’s a thing of beauty.\n Full disclosure: I think bell hooks is one of the best thinkers we have about race, gender, violence, and punishment that we’ve got. That particular essay is a difficult, upsetting read. It’s more than a description of anger; it’s an expression of it. It gives the context for it, examples that explain and justify it, and a description of a bone-deep, powerful anger. She talks about the temptation to violence. She describes having violent, even murderous, fantasies.\n And—here’s why I will never stop admiring her—she never escalates out of the conflict. She never becomes easy to discount or put down. She expresses, even evokes, pain in a way that demands the reader stand witness to it. And she envisions moving it “beyond fruitless scapegoating of any group, linking it instead to a passion for freedom and justice that illuminates, heals, and makes redemptive struggle possible.”\n She gave me an example of the difference between anger and violence.\n This also seems like the right moment to mention it again: I’m not telling anybody what they should do.\n I’ve also adopted Marcus Aurelius as one of my intellectual bodyguards. Here’s this guy with the power of a god among men. He was the Emperor of the only superpower of his time. He was able to order anyone who offended him to die, able to order any woman he desired to his bed; a man in a position of almost no social restraint. Yet, when you read his meditations, it’s like you’re talking to someone who’s been working in tech support too long.\n Begin each day by telling yourself, “Today I shall be meeting with interference, ingratitude, disloyalty, ill-will, and selfishness; all of them due to the offender’s ignorance of what is good and what is evil.” Or, another of my favorites, “The art of living is more like wrestling than dancing.”\n I’ll go back to Marcus on the days where I need someone to remind me that people are just people—venal, selfish, immoral, mean-spirited, small—and that it isn’t my problem. I have control over who I am, and over what I do, and if I can get that shit under control, I’m actually doing pretty well. When it comes to being in this community of professionals and amateurs and fans, where we are hip deep in grievances both legitimate and bizarre, these three folks are my touchstones. They’re who I’ve chosen to cultivate.\n I would like the field to be more civil, so I’m going to be civil, even when I think I’d be justified not to. I would like the conversations we have to be more compassionate, so I’m going to try to exercise compassion when I’m talking to folks, even when I think they’re full of shit. When I’m angry about something, I’ll try to express that completely and fully and while keeping my temper. When someone’s angry with me, I'll try to listen past my defensiveness to what they’re saying, whether I agree with them or not. When I think someone is arguing with me in bad faith, I’m going to walk away.\n I’d like our conflicts about ideology, politics, and religion to be less violent, so I’m trying to be less violent when I talk about them. On the days I can’t bring myself to that, I stay off the Internet.\n I would like my field to respect the quality of work more than the skin tone or sexual preferences of the author who wrote it, so I try to celebrate good work by folks who I think deserve more attention than they’ve gotten. I try to tack against the parts of mainstream culture that I think are crap, and hopefully I get it right more than I screw it up.\n I’m trying to become the change I want to see in the field; more professional, thoughtful, compassionate, non-violent, and open to conflict and change.\n And part of that? I’m not telling anybody what they should do.\n Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}