{"fingerprint": "Ct7GiM5cEQMhYNZCIINhY/H/dMs=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Hipsters of Zombieland by Emily Devenport", "author": "Emily Devenport", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_08_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Hipsters of Zombieland by Emily Devenport", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-FictionAnother Word: Hipsters of ZombielandEven before Night of the Living Dead was released, zombies had their fans—and I was not one of them. Not even when I was nine years old. At that age I wouldn’t have told you that the nihilistic tone of that movie (and many of the ones that followed) really turned me off; I would have said they were boring. I suppose that’s the same thing, but my earlier assessment was devastating in its clarity. It summed up a fatal flaw of the zombie genre: if your characters have nothing to hope for, the whole thing is just an exercise in self-pity. (“A boring exercise!” my nine-year-old self would say.)My interest was piqued when I learned something about voodoo and the original zombies. The idea that you could enslave the dead and set them to do your bidding was interesting (while also being both sad and scary). So you would think that emancipating zombies and setting them free to shamble around on their own would be an improvement. But those early zombies weren’t up to the challenge. All they could do was wander listlessly and conduct a slow chase of the living. Back in those days, you didn’t have to run away from a zombie, you could walk.Granted, they had a tendency to overwhelm people through sheer persistence. Eventually you’d have to sleep. If you got surrounded by them, they could overcome you with numbers. Once they started biting, you were done for, even if you managed to get away. They’d infect you with the zombie flu, the not-so-secret subtext of any zombie story. Eventually everyone gets it, and the world comes to an end. Everything we ever built, hoped, loved, or dreamed comes to naught. Who could resist an inspiring message like that?I could. And I was pretty sure most other people could too, because the winning formula in adventure fiction is that the heroes are facing overwhelming odds, but their perseverance and cleverness is going to help them solve at least some of their problems (once they overcome a bunch of scary and interesting obstacles). Defeat looms large, but—HUZZAH! Victory from the jaws.In the old zombie stories, there’s no huzzah, just plenty of doom. I was surprised to learn that young readers were happy to wallow in that, until I realized a couple of essential things about the Zombie Apocalypse: 1. Zombies aren’t human, they don’t even think—so you don’t have to feel guilty about killing them. This is a perfect way for disaffected people to vent their frustration, and 2. If the world comes to an end, you don’t have to go to work (or school) anymore. What’s not to like about that? End of the World fiction has always carried that appeal with its audience, even without the zombies.But, my god, did it have to be so tedious? It wasn’t until Shaun of the Dead showed up that anyone began to think of more interesting possibilities for zombies. Back then, one of my young coworkers at my day job had a dream that we all had an employee meeting right after the Zombie Apocalypse so we could learn techniques for selling books to zombies. “Just because they want to eat your brains,” he said, “doesn’t mean you shouldn’t give them good customer service.” (As it turned out, soon after he had the dream, our customer service philosophy did take a turn in that direction.)So humor helped the genre a lot. And people began to look at the mechanism for zombification as a plot point. Was it a virus? How would it spread? Would it kill you and drive your dead body around, or would it keep you alive and hijack your brain? If it kept you alive, could you be cured of it? Would it eventually burn itself out and leave you to face the consequences of your actions?Could something rescue you from your zombie state? That idea was examined in Warm Bodies, the first zombie movie I actually wanted to see. The main character can dimly remember his old life; he’s driven to collect things that remind him of it. But what sparks life in him is a girl. He falls in love with her. The theme of this movie is that people can be dead, but something may make them to want to live again. I like that theme better than “Yeah, everyone is going to get the zombie flu and die.”Another idea I liked in Warm Bodies is that if zombies eat the brains of living people, they can share the memories of those people. This is explored in one of my favorite new TV shows, iZombie. Its main character uses her memory-eating talent to help solve murders. And she doesn’t “live” in a vacuum; her actions and decisions have consequences that spin off in unpredictable directions. Best of all, a peculiarity of the strain of zombie flu that infected her is that it doesn’t take her intelligence away. She’s no dumb shambler. Her kind could eventually win the right to vote and to get legally married.Does that mean all future zombies are going to have to be intelligent memory-eaters to be interesting? The movie World War Z took them in another direction. Its zombies are the mindless, hungry, attracted-to-sound variety that we’ve all come to expect from shows like The Walking Dead, but they have a horrifying behavior that brings the term zombie swarm to a whole new level. They behave like army ants, building bridges and towers out of their bodies so others of their kind can scramble up and over walls, up buildings, even onto hovering helicopters. They’re as fast as cheetahs, and because they’re dead they have no sense of self-preservation. The virus that’s driving them only wants to spread itself around.The best thing about the movie version is that they try to think through the concept of the virus. If nature has orchestrated an extinction-level event for human kind, is there a way to outsmart nature? And they come up with an answer, a reason to hope.I’m not interested in pitiless depictions of mass death. If I’m going to watch people fight for survival, survival damn well better be possible. There’s no hope doesn’t cut it for me. And if recent developments in the zombie genre are any indication, the zombies of the future are only going to get more interesting.[NOTE: The fiction department at Clarkesworld recoils at the suggestion that zombies are in the least bit interesting. This article should in no way encourage people to write or submit more zombie stories. They are a plague upon the genre and must be put down, just like the zombies they feature.]Nine of Emily's novels were published in the U.S. By NAL/Roc, under three pen names. She has also been published in the U.K., Italy, Israel, and China. Her novels are Shade, Larissa, Scorpianne, EggHeads, The Kronos Condition, GodHeads, Broken Time (which was nominated for the Philip K. Dick Award), Belarus, and Enemies. Her new novels, The Night Shifters and Spirits of Glory are in ebook form on Amazon, Smashwords, etc.Her short stories were published in Asimov's SF Magazine, the Full Spectrum anthology, The Mammoth Book of Kaiju, Uncanny, Cicada, Science Fiction World, Clarkesworld, and Aboriginal SF, whose readers voted her a Boomerang Award."}