{"fingerprint": "U725iegrN0ymt6nEuGwdunsXvTc=", "sitename": "Clarkesworld Magazine", "title": "Another Word: A Brief Parable about Exchanges Between Time, Independence, Technology, and Privacy by Fran Wilde", "author": "Fran Wilde", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_02_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: A Brief Parable about Exchanges Between Time, Independence, Technology, and Privacy by Fran Wilde", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nAnother Word: A Brief Parable about Exchanges Between Time, Independence, Technology, and Privacy\nEconomies of time, independence, technology, and privacy intersect in many places, especially in this mostly shiny now-future we programmed for ourselves. For me, one intersection is primarily in my refrigerator. Another’s in how I get where I want to go.\nAs a person with mobility and weight-bearing concerns, what I’m somewhat reluctantly giving up in privacy is increasingly leveraged by what I’m gaining in (ironically), independence.\nGroceries first. Right now, I’m restricted from carrying grocery bags and baskets because of a recurring injury. But I own a phone with a program on it (Instacart) that allows me to order milk and eggs and bread, then have them brought to my house. This app gives me independence that would otherwise mean I had to wait until someone could accompany me to the store, or go themselves, to help carry things.\nThe functionality isn’t new (and the apps are a couple years old too). There’s a website in Baltimore that’s been operating for years (called Baltimarket) that allows Baltimore residents in locations without grocery stores, as well as the elderly, to order groceries and pick them up closer to home, without delivery fees. For a long time, my local co-op would deliver food orders to residents who couldn’t come and pick up their food, which is a similar option, minus the app.\nWhat the addition of a phone-based program does is allow faster reordering, which saves a lot of time. It means also that I can track what’s unavailable or exchanged, and keep some substitutions from being made (a huge improvement over delivery services from previous decades).\nThe app doesn’t necessarily save money, and that’s a different, larger, problem. And my purchases go into a database. More on that in a moment.\nTransportation next. We’re not in a future with flying cars, yet, but I use airline and travel apps to book flights, store my tickets, and see when the next local bus is coming. These save me time waiting in the cold, or trying to hold onto multiple pieces of paper while I’m traveling. The Lyft app too—as well as a new program called Curb—offers even more independence. (I’ve been waiting for the taxi cab version of ride hailing and Curb seems to be it.) For a lot of people with mobility limitations, Lyft and other ride-hailing apps become a means of getting around with less stress, without worrying whether a metro stop will have a broken escalator or elevator, or whether a taxi won’t appear in time to make an appointment. Additionally, apps allow for payment on a stored card, so time is saved and a record of the transaction is sent, without more paper to sign and carry. (Sound of more data going into a database.) Meantime, while the cost of this independence is high, it’s also more predictable—cabs used to be mysterious about costs until the end of the ride.\nIn 1983, when Steve Jobs gave a talk at the International Design Conference in Aspen, Colorado (in a speech nicknamed the “lost” speech), he spoke of a time when computer software wouldn’t be bought at brick-and-mortar stores but would be downloaded over phone lines, onto computers we would carry around. It sounds like Jobs was anticipating app culture decades before the App Store first launched in 2008.\nYet, even Jobs couldn’t fully predict how apps would permeate culture, or how they’d be used. Thirty five years after the Aspen speech, I love these apps that save me time. That let me be in the world on my own terms.\nBut.\nModern app culture also drives data mining to a new high. And it sinks to a new low for reducing access to those who might need it most. There are food deserts, as I mentioned above. There are absolutely technology deserts as well.\nAnd more than that, there’s a long accumulation of data—what is bought, where, and when—that apps feed on. Many apps talk to each other, some, when you log on to them through another app, want to help you even more, by “creating a better experience” i.e.: pointing the advertising that’s most likely to sway you right at your eyeballs. Each time I order products or book a trip, I’m adding to that data about me. The same is true of any shopping experience these days, but apps make linking up the data extremely easy.\nThat’s because apps are designed to be helpful and their designers want those apps to be even more helpful than they are. They can try to predict your needs, but all they’ve really got to go on are your prior actions. They’re trying to get smarter, to give you the best experience so that you keep using them. All they desire is more data.\nThat act of creating a better experience can fold into more than just advertising. Predictive apps can give you information based on time of day. Or remind you to stand up or drink water if you haven’t in a while. There’s a recent Wired article about China’s experiments with social credit that details how renting a car or using a product can hinge on your numbers. It’s easy from there for, say, an SF author with a fertile imagination and a vast need to procrastinate from the short story they’re writing about time (hypothetically), to think about the groceries they ordered that morning, or the number of times they’ve taken a Lyft or a cab to a particular restaurant lately. Could the purchase of some products over others become ways to commodify or enhance social ranking, just like early toothpaste and deodorant commercials once promised?\nOr could it lead to other things, including expanded barriers to who can and can’t access app-driven society—something we’ve seen already in the restriction of free WiFi and computer access in impoverished urban neighborhoods—this time expanded to access based on social connections, even political actions.\nApp culture—a version of it—plays out in various dystopias, including M. T. Anderson’s 2002 dystopian YA novel, Feed. And the ability to use the system, or not, impacts characters’ ability to perceive the system . . . even as it becomes a self-perpetuating ecosystem.\nApps inform us, distract us, and for some of us, including members of the disabled community, provide a greater level of independence (hypothetically) than previous desktop-bound Internet services, and especially more than brick-and-mortar culture.\nMoving away from them gets very hard. When you disable your Facebook account, a wall of friends’ images appears, with [theirname] will be sorry not to see your updates, [yourname]. (Dear Facebook programmers, this had an uncanny valley run-screaming effect on me, FYI). And writing letters one-to-one takes more time than broadcasting your status one-to-many, but the interaction can sometimes be so much more valuable.\nBut grocery shopping? Calling a cab? Those actions don’t yet feel like social transactions as much as time-saving and energy-saving tools. So far. What I’m willing to give up is outweighed by what I feel that I’m gaining from this type of technology.\nI still think about the ramifications a lot, in this now-future where I use a handheld robot to restock my kitchen. Sure, we don’t have flying cars yet, but when I put the milk away, without having to wait for family to help me carry the bag from the store, I’m warily grateful for the independence and the access. Plus, science fiction writer me now has more things to chew on.\nFran Wilde's novels and short stories have been finalists for three Nebula awards, two Hugo Awards, and a World Fantasy Award. They include her Andre Norton- and Compton Crook-winning debut novel, Updraft (Tor, 2015); its sequels, Cloudbound and Horizon; the middle-grade novel Riverland (forthcoming from Abrams in April 2019); and the novelette \"The Jewel and Her Lapidary.\" Her short stories appear in Asimov's, Tor.com, Beneath Ceaseless Skies, Shimmer, Nature, and the 2017 Year's Best Dark Fantasy and Horror. She writes for publications including The Washington Post, Tor.com, Clarkesworld, iO9.com, and GeekMom.com. You can find her on Twitter, Facebook, and her website."}