{"fingerprint": "1DrmEe9KGEZL8OXLXef81O9FWY4=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Circles Rise Again by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_08_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Circles Rise Again by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Circles Rise Again\n I was in Seattle a few weeks ago for the Locus Awards, and I had the very real pleasure of meeting a few of the students who were attending the Clarion West workshop this summer. I attended the workshop back in 1998, and it was a watershed both in my artistic and commercial careers. The opportunity to talk with some of the people who were basically where I’d been fifteen years before was cool and weird and a little dizzying.\n We were at the bar even though I don’t drink, and a few of them asked me if I had any advice about how to approach the workshop. I rattled some things off the top of my head. Most were of the very mundane, very basic sort. Don’t be afraid to try new things. Don’t assume that your career is going to take off immediately after the workshop. Genre fiction is a small industry; try not to sleep with anyone you wouldn’t want to hang out with at a convention in twenty years. The usual. But I’ve been thinking about it more since, and there was, I think, one genuinely useful thing I said that night. I hope it didn’t get lost amid the clutter.\n I have never been invited to teach at any of the big workshops, and it’s perfectly possible I never will be. It’s a prestigious position, a position of real trust, and requires skills well beyond being able to put together a good sentence, a good story, or even a useful critique. But I fantasize for a living, and sometimes I fantasize about what I would say to those imaginary students. That’s pretty much the same as imagining what I would say to myself, if I could reach that earlier version of me.\n I imagine it’s the Sunday night before the first week. That the students are all there, just meeting each other in person for the first time, taking stock of each other, getting ready for a six-week bootcamp. It’s a class, and like all classes, people have roles they’re comfortable with—teacher’s pet, class clown, bad kid in the back row—all complicated by having the fragile narcissism that comes with doing something with no objective standard of success. I remember that night from the last time I was there, and apart from shifting valence, my daydream’s pretty much the same.\n I imagine having everyone sit down at a single, long table. I stand at the head, of course, because I’m the teacher and all fantasies of teaching are power fantasies. I smile, and I look at each of them, make eye contact, get their attention, and I say:\n “All right. Before we start, take a minute. Look around. Look at all the other faces in this room. This is your team. You should write that down, because it’s probably the smartest thing I’m going to say in the whole time I’m here, and you’re going to forget it.\n “It’s not that your dumb or that you’re not paying attention. It’s just that we all forget sometimes. Someone says something that sits wrong about something we did, and we start thinking they’re our enemy. Or someone does something really freaking great and we get jealous and start thinking of them as the one we should try to beat. We want to be the star of the class, and we look at everyone and start seeing them as competition. No one here is your competition. This is your team. These are the people who are going to push you to be better, and who you’re going to push. These are the people you’re going to be talking with when you have the conversations that help you define your ambitions. These are the people you’re going to know when you break in, and when you’re on top, and when your career tanks and you have to reinvent yourself.\n “The truth of the matter is that nothing you do at a workshop like this matters. Workshops aren’t about making great stories, they’re about making great writers. If you turn out a perfect polished work here and sell it the minute it comes off the printer, that’ll be cool, but it won’t matter. If you can do that three times a year for the next decade, you’ll have a small but respectable career. If you don’t, you can always be the one who people say Oh yeah, you remember X? She had that one really good story. What ever happened to her?\n “You’re going to spend your time here, and it’s going to kick your ass. You’ll get better, you’ll burn out for a while. You’ll get out, and you’ll start doing the work that matters, and you’re going to forget. You’re going to tell yourselves stories about how there are only so many slots in the magazines, so many book contracts, so many slots on the Hugo short list. Hell, only so many Hugo Awards or Nebulas or whatever floats your boat. And you’ll start thinking that you’re in competition. You aren’t. These people aren’t your competition, and they never will be. Not in any way that matters.\n “Between 1965 and 2007, Frank Herbert’s Dune sold about 12 million copies—more than any other science fiction book—and that was across 14 languages and I don’t know how many countries. There are 300 million people in the United States alone. Right now, with A Dance With Dragons glued to the top of the bestseller’s list for months and the HBO program getting awards and accolades and spoofs on Saturday Night Live, I still meet people on a regular basis who don’t know who George RR Martin is. None of us—even the best—come close to saturating the market. Commercially, our competition isn’t each other, it’s Netflix and beer. Artistically, it’s always and only ourselves.\n “Paula Vogel is a playwright and teacher. She said circles rise together. Look around the table. This is your circle, or at least the start of it. If we do this right, these are the people who are going to rise along with you. This is spring training, and this is your team, and what we do here is prepare for the real work, which is what we do out there, together, once this is over. Everyone cool with that? All right, then. Let’s get to work.”\n And then I congratulate myself about how wise I am and how everyone who hears me will be ennobled and enlightened and generally speaking have a better time of it. It’s a daydream. If it doesn’t gratify the ego, what’s the point, right?\n But what I’m coming to realize is that circle isn’t something that stops. I’ve had a writing career long enough that I’ve accrued a few petty enmities. I’ve had fellow writers who have said deeply cruel things about me, and I’m sure there are some about whom I have been less that charitable. I’ve been up for a few awards, and I’ve hoped defeat for my fellow short-listers, and they have sometimes spoken ill of me.\n But I have also, at one time and another, through accident or intention or some combination of the two, forged friendships with people who I admire, who have helped me—commercially and artistically—and who I hope I’ve been able to lift up too, if only a little bit.\n I want to say that my generation of writers is a team too, that we’re all part of a great big circle that can inspire and encourage and push and challenge itself to new and glorious heights, but the fact is we’re humans. We’re a small industry, but we can’t all fit around a table. We’re fractious and mean and often very impressed with ourselves for exactly the reasons we should be a little embarrassed. I don’t think we’re unlike the rest of the world that way, at least.\n I do believe that the opportunity is there, though. Even if it’s only in making a small circle, or keeping it for a short time, there is a virtue in finding and maintaining a team. A circle. The rest of the Paula Vogel quote goes like this: Find the people you want to work with, and work with them. It’s something I forget, especially in the apparent isolation of writing, but it’s the advice I would have given myself fifteen years ago. And I’d still be wise to take it now.\n And that’s not just writing. That’s the world.\n Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}