{"fingerprint": "bV+Xzfg7Uccbqh+QcXvx4VUxA0k=", "sitename": "Clarkesworld Magazine", "title": "Another Word: The Echo Chamber by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_12_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Echo Chamber by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nAnother Word: The Echo Chamber\nThere was a time, not in my daughter’s life but in mine, when information was hard to get. I can still remember a friend of mine struggling to describe a new programming trick that he was working with. He called it a hyperlink. At the time, it sounded like it might be an interesting way to do footnotes some day. But the world changed and moved on. It’s very good at doing that, and its not much good at going backward. There are people who voted in the last election who never knew a world where tracking down information meant going to a library, a world without hyperlinks.\nI began working in technical support for a small Internet service provider in the mid-’90s, when the advertisements on the television from companies like IBM and AOL could be summed up as “Internet: You don’t know what it is, but you need it. Go! Buy!” They worked just as well as ads for the company I worked for. They weren’t boasts about whose service was best so much as announcements of a paradigm shift. Even with promotion into management, I was on the phones for nine years while the world changed. I went from figuring out init strings for 28.8 modems to programming routers to allow connections to virtual private networks. I saw that things were changing, but not always how. Ebooks still do things that surprise me sometimes. And I have now bought software that will block my Internet access for hours at a time so that I can get my work done without the temptation to check my email or Facebook or Twitter just one more time in case something interesting happened.\nThe dynamics of my own thought process have changed. I used to read almost exclusively from books and spend a relatively long time thinking about what I’d read, only because while I was walking home from school or waiting at a bus stop, I didn’t have anything more with me at the moment. Now I read mostly from a computer screen, and often in tiny, fleeting sips that I forget almost as soon as I’ve seen them.\nBut I didn’t come here to decry the Internet or celebrate the past. This endless sampler plate of Cracked.com articles and snarky comments at 140 characters or fewer isn’t by necessity better or worse than reading a book without being able to jump out to a Wikipedia article. It is different, though. Some of the changes I feel like I saw coming. More distractions, for example. Or the pressure to keep things introductory, since any post might be the first thing the reader bumps into. Other aspects, I didn’t: for instance, the increase in literacy that comes from having an entire generation communicate through text. Or the long awaited and justly celebrated death of the mass market returns system.\nWhat I see shaping genre fiction most in this age, though, is the democratization of authority.\nAs with many things, the change in the availability of information hasn’t created a whole new way of thinking so much as shifted the emphasis. Echo chambers or groupthink or being-inside-the-bubble has been part of human behavior forever. What has changed is the ability to find opinions similar to your own. When I was growing up, the media I had to work with—telephones, television, letters, newspapers, books, radio—had one thing in common: no search function. No way to take a huge body of information and pluck out only the thing I was looking for. Today my daughter is in first grade, and she’s just starting to bring home assignments like “find five facts about penguins” and “research who Captain Cook was.” With a kind of nostalgia, I steer her toward books. When we’re looking for facts, though, nothing’s easier than a search engine.\nThat’s also true when I’m looking for opinions. It’s never been easier to reach out to find people with whom I already agree and then repeat and reinforce our opinions to each other until they ossify into facts. There have been a few times that I’ve found myself following links down rabbit holes into communities with which I profoundly disagree, and seeing the self-confident, self-congratulatory, and mind-bendingly wrong opinions being shared there was deeply unnerving. I imagine folks who wander by mistake into my bubbles feel the same.\nWhich brings me, in my roundabout way, to Arthur Krystal’s recent article in The New Yorker, “It’s Genre. Not That There’s Anything Wrong With It!” In it, Krystal makes a series of arguments that strike me as weirdly old-fashioned, condescending, and unfamiliar. He makes reference to a poem by Dryden. He describes genre fiction as books that “stick to the trite-and-true, relying on stock characters whose thoughts spool out in Lifetime platitudes.” He uses the adjective “jejune” with, so far as I can tell, a straight face. He celebrates literary fiction’s ability to “break the frozen sea inside us” under a headline that’s a TV sitcom reference.\nThere is, apparently, an echo chamber in which this article reads as something other than self-parody. And I think that, once upon a time, there was a world in which simply by having been published in The New Yorker, Krystal’s opinion would have had some weight. I live on the Internet, though, and I am no longer trained to recognize that authority. When I see this, my first reaction is the disbelieving laughter of someone who’s just fallen into Wonderland. Krystal’s presentation of himself is a caricature of a literary critic. Insecure intellectual defensiveness rises off his article like fumes. And yet, there is a place in my culture where his opinion would be taken seriously.\nWell, not in my part of it, clearly.\nIt is very tempting for me spend a few more paragraphs making fun of Krystal. His article is mean, pompous, and trite, and I want to attack it and him. Only I know that he would be as dismissive of me as I am of him. When I pause in my gleeful disdain of his disdain, the thing that’s interesting is that I see this dynamic everywhere. It’s not just the usual dichotomies either: the Republicans against the Democrats, the Palestinians against the Israelis, the brains against the jocks.\nThere was an anecdote I heard once about a man in the Washington press corps bringing a date—a professional model—he particularly wanted to impress to a party made up of some of the most powerful, important, and (critical for my argument here) elite journalists in the world. The model’s comment was something along the lines of how sad it was watching all the geeks trying to have fun. For her, it seems to me, being a member of the elite meant something different and incompatible with what her date meant. She came from a different subculture, and so the status of the people around her wasn’t just invisible to her. It was literally insignificant.\nThere was a time in my life when the culture had, if not a single voice, then a profoundly dominant one. Someone on TV or the radio or in the newspaper had authority simply by being there, and their opinions mattered. There was a time before that when an avid reader could read every science fiction and fantasy book published in the US in a given year. There was a time when there were only four channels on the TV, and if you missed a program, it was gone. People shared a context by default, and because that context included definitions of authority, they shared an implicit idea of who and what was important.\nIt’s always been possible to create a subculture with its own definitions of what matters, its own idioms and conventions, and its own standards by which to judge who is to be taken seriously. What’s changed is the activation energy. Because of how we communicate, it has become easy to insulate ourselves with people who have our same interests, definitions, opinions, and interpretations. Things outside that context fade and lose their power, or else just stop having any bearing on each other. Krystal’s opinion that genre fiction is inferior and my opinion that Krystal is kind of a yo-yo are both subjective, and so they can both be true in their contexts. In practice, they are so unrelated, they aren’t even in conflict.\nI once heard Lev Grossman say in an interview that he was worried that fiction might lose its place at the center of the cultural conversation. My first response was to look back over my four-plus decades of life and try to remember a time when it was at the center. I misunderstood. When Grossman said “the” cultural conversation, he didn’t mean the one about Kim Kardashian’s marriage or how guardian angels disprove evolution or which team is most likely to win the big game. His definition of culture wasn’t concerned with what issues were being discussed by the largest demographic slice of the country. He meant, I think, the conversation among people who matter. People with authority. The real culture.\nThere was a time, in my life but not in my daughter’s, when I’d have known who he meant.\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}