{"fingerprint": "94AyDVa+YSmkiIPgwOeqx0Nn2+g=", "sitename": "Clarkesworld Magazine", "title": "Another Word: An Anxious Introvert's Guide to the Con Experience by Genevieve Valentine", "author": "Genevieve Valentine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_07_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: An Anxious Introvert's Guide to the Con Experience by Genevieve Valentine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: An Anxious Introvert's Guide to the Con Experience\n 1. Why are you here? You should not have come here, what were you even thinking, this is all you packed to wear and now you’re wearing it and it’s not like you can get any other clothes on such short notice so this is just what you’re stuck with and everyone is assuming this is the best you’ve got. Oh Jesus, oh Jesus, you’re here, it’s happening.\n 2. Did you come here on a plane? Dang, you really committed, nice job! Try not to spend too much of the weekend anxiously wondering if that TSA employee thought you were rude when you took your boarding pass back when really you just wanted to make sure you got in a line that still had plastic tubs because waiting for plastic tubs while getting stinkeye from fellow passengers probably would have been worse than just giving possible accidental stinkeye to one TSA employee, but you’re not sure. You’ll never be sure. (If you drove, tell no one; you’ll be hauling groups around like the first kid in your class with a driver’s license.)\n 3. You don’t know anybody here yet, but that’s fine, it’s cool. In movies people constantly go to bars alone and people come up and talk to them and they sip from drinks that never spill, so you have been doing your research on this for easily a decade. Make it thirty seconds before you pick up your phone; if you’re feeling bold, find some other person who looks alone and vaguely panicked about it and say, “Does this taste poisoned to you?” as a hilarious opening joke. Never, ever live it down. That TSA employee will seem like child’s play after this.\n 4. You find people you know! You’ll chat happily until people you don’t know join the conversation, at which point you’ll get so distracted trying to determine the existing relationships among everyone in the circle and whether or not you personally like the newcomers that you utterly lose track of the conversation and by the time you zone in again they’ll have stopped talking about the book you love and are now talking about Firefly and you’re left trying to decide if it’s worth it to wait for things to cycle over to a new topic or just abandon them to Joss Whedon and start over from scratch.\n 5. You see three panels. The audience members are comment-not-question types, because of course they are, but you get some nice notes out of the main conversation because the panelists are all great.\n 6. Except on your panel, where the moderator opens with a question about why there’s so much political correctness in the genre and two of the panelists nod firmly and this panel technically hasn’t even started yet but here it is and this is how it’s going to go and you are worried that if you reach for the water you’ll knock it over so your voice just gets more and more smoked-out every time you lean into the mic and desperately try to counter the foolishness with something awesome that nobody listens to.\n 7. After the panel, someone might come up and thank you for your efforts. If you think this person seems cool, buy them a drink, because you’ll both need one. Enjoy what you hope is this calm, respectful lull with a compatriot who won’t say anything racist or sexist.\n 8. You’re sharing a room? Awesome! Built-in breakfast buddy! Unless they have other plans. (It’s probably nothing to do with you. Probably.) You know the rules of sharing a space—don’t use more than half the storage space, be quiet when you come home late, you’ve got this. Try not to sit awake, listening to the pattern of their breathing, wondering if they’re really asleep even though they have no reason to lie to you, or when they’ll start snoring or—oh my God, oh my God—when they’ll stop breathing and then someone you only vaguely know is dead in your hotel room and wow, will you ever look guilty. What are you going to do? WHAT ARE YOU GOING TO DO ABOUT YOUR DEAD BREAKFAST BUDDY?\n (Day one, it might worry you if they have different plans for breakfast. Day two you’ll be so wiped from the parties that you won’t even wake up until noon. By day three, you’ll have barely fallen asleep after the parties and you still won’t be sure how to move your facial muscles in socially-acceptable ways, so just plan to resort to the arm-sized menu they hang on your doorknob and get room service breakfast. It’s more expensive than you can possibly afford, but at this point, being alone in the room is worth an eight dollar glass of juice.)\n 9. It’s definitely creepy to try to find out where people you know are by using Twitter, and if you aren’t sure whether or not real-time selfies are a map to their present location, better just to pretend you don’t see them. Feel free to scan public areas, but there are places you can invite yourself and places you have to wait to be invited. Pool? Sure. Bar? Great. The Applebee’s down the road? Godspeed their poor souls and let them be; Applebee’s is its own punishment.\n 10. You’ll end up eating at Applebee’s at least twice.\n 11. Try to get six hours of sleep a night! (Who are we kidding, you’ll get three. For every lost hour, add the cost of a cup of coffee. The last thing you need at this point is to be so tired you make another joke about poison, and it’s not like you were going to come home from this thing with any money left anyway.)\n 12. Speaking of which: Is it already Saturday? Have you done any business? Welp, too late.\n 13. Find a weird place near the hotel—the upper parking tier, the odd set of lawn chairs randomly on a patio next to the dumpsters—and plan to hang out there alone at least once. When you inevitably need it, you will feel like you’re heading for, instead of running from, and it will make a big difference in how you feel once you get there. Then let the symphony of industrial air conditioners wash over you.\n 14. The book room is amazing, and you won’t regret a second of the time spent browsing there, if you can avoid being roped into awkward conversation by strangers. Can you? Well, you CAN, you’ve seen spy movies. Will you blend in and become invisible? You’ll find out.\n 15. If you and someone else really want to catch up, leave the premises. It’s the only way to be sure you can be alone. Even then, consider splitting up and meeting at a prearranged location (you can do it, you’ve been practicing spy stuff). If anyone sees you, you’re doomed to a dinner for ten and two hours of small talk that erupts into an argument over the tip. Bet prearranging that location sounds less silly than it did a sentence ago.\n 16. Don’t forget to make it to the airport at least three hours before your plane so you have plenty of time to worry about whether you left the kettle on at home/whether you’ve ruined your reputation without having to do it in front of all the people in the security line.\n 17. You should go to more cons, though. They’re crucial for your career.\n Genevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times."}