{"fingerprint": "2MnraRt093MNk1Ca2fVExInH6p4=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Keeping Time by Fran Wilde", "author": "Fran Wilde", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_08_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Keeping Time by Fran Wilde", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Keeping Time\n Motion was once the enemy of time. Dust still is.\n Depending on when and where it is, a clock in motion may lose increments of time in the form of water drops, humidity, sun angles or clouds, gear ticks, pendulum swings, grit, gravitational pull, and more. One of humanity’s great challenges is to reduce those losses, most importantly, by creating harmonic oscillators and synchronizations.\n Because keeping time is at once about marking where we are in relation to time and stopping the loss of it to the vagaries of external forces, these considerations are important, both in real time and in fiction.\n When I was writing “The Synchronist” for Jonathan Strahan’s last Infinity anthology (Infinity’s End, July 2018), the keeping and losing of time was part of my research. In my notebook, I marked small details that have gone into holding onto the tiniest of moments since we first began to divide time into more than light and darkness. I marked points at which these moments themselves became design choices that were each then locked in time, at least for a while: the clock’s “face”—humanizing the display and making it ours—the concept of “ticks,” and how that’s been maintained, while what’s ticking—from gears to quarks—changes.\n But what the disparate timepieces I encountered had most in common, from the first water clocks, to crystal and optical lattice clocks that use strontium and ytterbium atoms, to a giant clock in the desert that ticks once each year—is a struggle against loss.\n Today, we’re at a point in horological stability (a high-tech word for “timekeeping”) where losses are judged by increments that must be measured on a quantum level. That wasn’t always the case, and it may not always be so in the future. That’s part of timekeeping, and clock research too—knowing what’s past, what’s happening now, and what should happen next.\n A principle of stability in timekeeping is how precisely each clock tick matches the one that came before it and the one that will come after. It’s a tiny increment of future prediction, but if we can manage to keep those tiny increments together, our grasp on the future may be better. Or at least we might think so enough to engage in better long-term planning.\n This is a consideration because we’re now proposing to try to map time on a scale much bigger than the circuit of a clockface. For instance, the strontium clock developed as a joint project by the National Institute of Standards and Technology and the University of Colorado and led by a physicist named Jun Ye, ticks 430 billion times per second (as determined by atomic oscillation) as opposed to Long Now Foundation’s 10,000-year clock that only ticks once per year.\n The planners for Long Now state that their goal is to keep time accurately for millennia. To do so, they need to create a mechanism that withstands (among other things): friction, grit, dampness, earthquakes/disaster, sabotage, and thieves. The solution was to synchronize it with the sun, power it with thermal energy, design it to tick once a year, and bury it under a mountain. The resulting clock will chime every hundred years and quixotically have a cuckoo emerge every thousand years. In this, it seems more of a symbol than a timekeeper—a message to the future from the past, rather than a means of keeping time during the present.\n Large-scale timekeeping can also assist massively long-distance guidance systems where static point-based guidance (radio towers, satellites) is not yet available; it can help us more accurately map the Earth; and it can assist with planning on the scale of millennia (at least that’s the guiding theory behind the the Long Now clock).\n As writers, we see evidence of losses of data and time constantly while doing our research. We try to gather up some of the more interesting points.\n At sea, losses of time are less common now, but once, famously, inventors raced to pioneer a way to measure time efficiently. The winner was the timepiece that lost the least amount of time in transit and was achieved by self-educated carpenter and clockmaker John Harrison after iterations of failed attempts. His H4 clock’s innovative escapement reduced losses aboard ship to a matter of seconds during a transit of several months with a more efficient mechanism.\n For clocks that go into space—atomic clocks—researchers including Professor Jun Ye at University of Colorado, use supercooled atoms and laser lattices to assess the passage of time. More recently, NIST physicist Andrew Ludlow’s team paired two atomic clocks to eliminate even tinier losses (known as dead time), for greater precision. The new clock’s nickname is the ZDT (zero dead time) clock.\n What do all these clocks have to do with science fiction? In part, it is a research problem. How can we understand the scope of horological history? It is also a writing problem. How can we fit that vast history into a story about time in the far-flung future, without losing either story or tempo or the humanity of time?\n Take scope, first. Even the present state of timekeeping is an enormous topic—we’re at a point where one clock ticks 430 billion times, and another ticks once a year. How do you cram it all—past, present, and future possibilities, into the same timeline? (Honestly, I’m trying to do a little of that in this piece and it’s ridiculous.)\n Then, once you’ve achieved a sense of scope, with regards to history, how does that become part of the fabric of a story?\n In my case, with “The Synchronist,” I included historical clocks as artifacts in the story, alongside imagined clocks from other planets, and other times. I tried to acknowledge the mechanical craftsmanship of a pendulum clock along the same terms as I did a crystal lattice timepiece and a Venusian cloud clock. Doing so set a framework for the immense scope of the story and the sweep of history that ran from before the Longitude Challenge, all the way through a far-flung future.\n That framework let me tell the science fictional story of a timekeeping cabal and the race to free humanity from its grasp.\n Meantime, the horological artifacts that I included in the story allowed me to mark points where timekeeping has changed over time. They became the ticks of progress, representative of how we experience time, and how we manage it, as factual anchors of the story.\n And in doing so, I kept coming back to one point: clocks, and stories, aren’t—and cannot be—time, nor can they contain it permanently. They can represent it, they can take it up, they can quantify time, but they are only metaphors for time.\n Clocks and stories are what we use to represent moments, to keep them still enough to look at, in reflections and ticks. We make them in order to limit our losses, to increase understanding, even as dust gets in the gears and our travels take us to new places.\n It’s very human to worry about knowing what’s past, what’s happening now, and what should happen next. It’s human to use clocks to quantify these things. What we do with that data, and the objects that try to hold the data, is part of the story of keeping time.\n Fran Wilde's novels and short stories have been finalists for three Nebula awards, two Hugo Awards, and a World Fantasy Award. They include her Andre Norton- and Compton Crook-winning debut novel, Updraft (Tor, 2015); its sequels, Cloudbound and Horizon; the middle-grade novel Riverland (forthcoming from Abrams in April 2019); and the novelette \"The Jewel and Her Lapidary.\" Her short stories appear in Asimov's, Tor.com, Beneath Ceaseless Skies, Shimmer, Nature, and the 2017 Year's Best Dark Fantasy and Horror. She writes for publications including The Washington Post, Tor.com, Clarkesworld, iO9.com, and GeekMom.com. You can find her on Twitter, Facebook, and her website."}