{"fingerprint": "F3jnflLdq+bSLcsJImlsgR9t27U=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Two and a Half Writers by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_12_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Two and a Half Writers by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Two and a Half Writers\n My attitude toward pseudonyms has always been a little idiosyncratic. I started off using them as a way to tell readers what kind of book to expect. Daniel Abraham? He writes third-person epic fantasy. MLN Hanover? First-person urban fantasy, complete with the tramp stamp tattoo and complicated love life. James SA Corey (of whom I am the James half, Ty Franck being the Corey)? Third-person space opera.\n The idea was—and is—that someone who really loved Daniel Abraham’s Long Price Quartet books would probably be put off and disappointed picking up a book and discovering it’s urban fantasy. My various names aren’t a secret. There’s tabs for each of them there at the top of the website. I talk about them in public (just like this). I adopted pseudonyms not as a way to disguise myself, but as a courtesy for the readers.\n And it turns out that taking on new names does some other very interesting things. In the six years since I broke out MLN Hanover as my first fake identity, the publishing strategy has turned into a kind of unintentional experiment about the publishing business, celebrity, identity, and reputation. By being MLN Hanover and James SA Corey, I’ve found out some things about what it is to be Daniel Abraham too.\n The first real surprise I had with the pseudonyms came with MLN. Even though I didn’t keep the fact of my identity secret, it came as a surprise to a lot of people that Daniel Abraham and MLN Hanover were the same person. My career as a writer didn’t really take off before the Internet became the central fact of American (and increasingly world) culture.\n With blogs and social media, there’s a sense that everything is known, or at least is available to be known with pretty minimal effort. I had the sense—wrongly—that by simply not keeping something secret, it would become common knowledge. In practice, it was weirder than that, and I still have people who are shocked and surprised to discover what I cop to often and in public. The feeling of intimacy and connection that the Internet gives me is exaggerated, and this was my first unintentional proof of that. What I say in public isn’t a secret, but it also isn’t known. We are all of us so inundated and overwhelmed with information that what seems like it should be common knowledge about me among those who bother to care still isn’t. Everything about my public personas is always at least partly introduction, and I think, always will be.\n The other thing about MLN was that I started writing urban fantasy at a time when the common wisdom was that UF was written and read mostly by women. In choosing the name, I took the classical route of obscuring my gender with initials. Given the context—a “women’s” genre, a first-person female protagonist, an ungendered name—a lot of folks assumed the author of The Black Sun’s Daughter books was a woman, and that’s an impression I was comfortable with people having. In fact, I got lot of letters from readers who said that they wouldn’t have picked the books up if they’d known I was a man. Generally, they were letters from folks who liked the books, but not always.\n It’s also served as a springboard for conversations about persona, gender and race. I’m certainly not the only male urban fantasy writer who obscured his gender with an ambiguous name. T. A. (Tim) Pratt, comes to mind. The practice is, I understand, even more common in the more “women’s”-identified genre of romance. And there is a long tradition of women hiding their gender with pseudonyms for equally market driven reasons. I don’t feel uncomfortable writing under MLN Hanover and being mistaken for a woman. I find the fact that there are spaces within publishing (and also within our wider shared culture) in which being female is a kind of locally privileged position at the same time that the larger context remains powerfully misogynistic fascinating. On the other hand, I wouldn’t in a million years write as Raj Avasarala or Gustavo Martinez even if the market became very rewarding of Indian or Latino identities. It isn’t a question I considered deeply before I became MLN Hanover. It is one I think about now.\n Another thing that having three names showed me—and continues to show me—is how important it is to not have all my professional eggs in one basket. I know a lot of professional writers, and of the people I know making a living at this trade, everyone who’s been at it more than four or five years has had their careers shot out from under them at least once. For me, the first time came when my first publisher, Tor, decided to drop the Long Price Quartet books. The fourth one had just come out in hardback, I had the proposal in to my editor for a new series called The Dagger and the Coin, and the news came in that not only were they passing on the new series, but they’d decided not to release the fourth Long Price book in paperback. It was devastating, but it would have been more devastating if MLN Hanover’s first book hadn’t been on the Barnes & Noble trade paperback bestsellers list. For months, it looked like Daniel Abraham’s career was done, until Orbit—previously my UK publisher—decided to let me take another swing with their US house. The reason I wasn’t a total mess for those long, terrible weeks was that even as I watched my career founder and die, it wasn’t my only career. I had a backup, which because it carried a different name on the cover, wasn’t related in the computers to my epic fantasies. I didn’t set out to build a firewall between my books, but I’d done it anyway. Daniel Abraham’s sales numbers didn’t hurt MLN Hanover, and so I, as both of them, got to keep right on paying my bills through the storm.\n James SA Corey came later, and what I learned from having that name in the mix is to my mind, the most interesting—and important—insight that my unintentional experiment in names has given me. Thanks to the team at Orbit and an agent who is nothing short of amazing, Daniel Abraham has been having a resurgence in the last few years. The Dagger and the Coin books have sold fairly well, and in a lot of foreign markets to boot. MLN Hanover has struggled. Though the reviews of each successive book have been better and better, the sales numbers haven’t grown. James SA Corey, though? Those books caught lightning in a jar. The first of them, Leviathan Wakes, is in its ninth US printing. It’s been picked up in 20 countries around the world. The guys who wrote the first Iron Man movie have teamed up with the woman who developed Breaking Bad, and they’re looking to turn it into a television series (more strength to their arms). My first appearance on The New York Times bestsellers list was as James SA Corey.\n But here’s the thing: I’m not suddenly a better writer when I’m working with Ty on the Expanse books. I’m not suddenly a worse writer when I’m doing urban fantasy. Daniel Abraham’s books didn’t stop being good at the end of the Long Price Quartet and get better with The Dagger and the Coin series. I have three careers going right now, and each of them is performing differently in the stores. There are reasons for all of that, but the one reason that doesn’t apply is me. That’s the real gift James SA Corey and MLN Hanover have given me. Every time I look at my Bookscan numbers, I can see that the books sell or don’t, the series build or don’t, based on factors that aren’t the author. I cannot imagine how hard it would have been for me to watch Daniel Abraham’s career run aground without MLN there to hold me up. Or what it would be like to watch MLN’s numbers falter without Daniel Abraham and James SA Corey to remind me that commercial success isn’t just about my name. Careers fall down all the time, and it’s rarely about the skill of the writer.\n My imaginary selves have taught me that my sense of being in the center of things, and being well connected to people is an illusion. That my alternate identities have boundaries that I haven’t wholly understood. They have protected me from the worst professional downturns, and given me enough emotional distance from my sales numbers that the success of failure of any particular project can stay with that project instead of defining who I am.\n Not bad for folks who don’t even exist.\n Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}