{"fingerprint": "mbgjK62U92R6UWvazLHWLLz+Kpg=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Very Close Now by Fran Wilde", "author": "Fran Wilde", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_02_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Very Close Now by Fran Wilde", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Very Close Now\n Virtual (adj.): (1) very close to being something without actually being it; (2) existing or occurring on the internet. source: Merriam-Webster\n \n /Advertising voice: The virtual is coming! It’s already here! You missed it! Here it comes again! This time, yours for $500./\n \n In the latter days of the previous millennium, Janet Murray’s Hamlet on the Holodeck (MIT, 1998) was required reading in certain technical circles. A very young me was writing and working with other writers who were engaged in creating narratives and story spaces using any tools imaginable to escape the linear, and Hamlet on the Holodeck promised the cyberspace-narrative future of our dreams, as did Neal Stephenson’s Snow Crash and—more effectively for me when it came to evolving multiplayer narratives—The Diamond Age. In this novel, the “ractor” Miranda can interact with other players in virtual narratives like Last Train to Geneva and The Taming of the Shrew a little like today’s actors can interact in live performances of Then She Fell and Sleep No More (although Miranda takes it a bit further with one annoying player, a weapon, and a refrigerator. [Go, Miranda!]).\n Simply put, I fell in love with the dream. And I did more than wait for it to become reality. I learned to program, and picked up the animation and modeling software Maya and several more besides. I helped try to make the virtual, reality.\n A decade before, Stuart Moulthrop’s Victory Garden (1992) and Michael Joyce’s Afternoon (1987) had emerged as early hypertext fiction. (Nota Bene: Stephenson’s Snow Crash was originally published in 1992.) Wrote Robert Coover in a 1993 New York Times Book Review piece, “The routes through Stuart Moulthrop’s new hyperfiction Victory Garden are almost literally countless. Altogether there are nearly a thousand text spaces and over 2,800 electronic links between them.” Moulthrop and Joyce were dreaming too, of interconnectivity and changeable stories . . . ones that changed for the reader, and could even, someday, be changed by the reader.\n But the technology lagged. We saw many many companies rise and fall in the attempt to make virtual tech go. We saw visionaries make promises and never deliver. Some couldn’t make the money work. Some (like CAVE) were there, but hard to get to. For others, it was the code. From Second Life to Google Glass, the dream hasn’t always looked as sleek and seamless in reality.\n Creativity finds its way around technical hobbles using the tools available to it. In the intervening time, we’ve seen Pulitzer Prize winner Jennifer Egan write Black Box (2012), a novel on Twitter, interactive poetry like the lovely CSS-augmented “You Are Here” from Bogi Takács in Strange Horizons, numerous works built in Twine—Chris Klimas’ text-driven non-linear story engine, and Storium—Stephen Hood’s multiplayer narrative game. All these and more are attempts to merge the literary with the virtual.\n Meanwhile, interactive gaming has forged on ahead. Forking narratives and interactive play found in games like Dragon Age and Bioshock and the online communities built in Eve, World of Warcraft, and numerous Cryo Engine-enhanced massively multiplayer online role playing games offer players places to blend provided narratives with their own storylines, or to become as dedicated to the storylines available to them as any literary reader of the past.\n And in the speculative fiction and movies of our generation—from Tony Stark’s desktops (SO SHINY), to the holodeck, to Gibson, Cadigan, and Stephenson—we’re working out how to live real and virtual at the same time. In the speculative slush piles as well, where new work often waits hopefully, it’s not rare to see virtual stories that reveal themselves at the end to be dreams, or reality that reveals itself to be virtual.\n So there was a great deal of expectation heaped onto the boxy profile of the Oculus Rift viewer, which launched its first offering a few weeks ago, as well as curiosity given to Google’s Cardboard initiative. Our hopes and narrative dreams for more and different storytelling spaces rested in the balance, and were revealed by prototype games such as Case and Molly (Greg Borenstein’s Neuromancer tribute from 2013), and Apelab’s Sequenced—a 360-degree VR animated game.\n Oculus Rift’s rather raspberry-sound debut last month—higher price point than expected, fewer games available, a hint of ‘coming soon’—shouldn’t surprise. The virtual dreams have been so big, and the tiny details required to make it real so numerous, the development corridor to reaching the dream is so very long.\n Yet at CES—the International Computer Electronics Show—you couldn’t swing a swag bag without hitting a VR headset, or someone giving an interview about Augmented Reality and Virtual Reality. (I didn’t go, I watched it virtually.) Facebook’s in, YouTube’s in. Everyone wants 2016 to be a virtual year and we’re very close in some respects, and very far in others. There are some important issues to overcome, from lag (isn’t it always?) to the base user technology required to make a version of this reality widely available.\n There are more accessibility issues too—virtual is a very visual medium. Does the emerging tech exclude those who cannot process the visual input, or who cannot use the current technology because of vertigo? Better question: if entire economic classes are excluded from today’s Internet due to access (Wi-Fi affordability, hardware costs), what about this medium? An alternate point-in-favor: might virtual spaces eventually make more work easier and more accessible to the mobility-disabled and geographically distant, just as the Internet has?\n Meantime, while CES and CNET are obsessed with the overgrown eye mask of virtual reality hardware, networks of cheap mobile phones are revolutionizing third-world everything: from banking/microloans to medicine, to narrative—thumb-typed and tumbled or shared-among-friends phone-fic being just one proof-of-concept.\n We’re in parallel development now, those of us who watch and play and read and write in non-linear spaces—the very real Oculus Rift (hey, at least there’s a *tangible product*) and the utterly dreamy Magic Leap, whose website features a humpback whale cresting out of a gymnasium floor. Neal Stephenson himself has announced that he’s become the chief futurist for the company and endorses the technology by stating that Magic Leap is “going to be a great tool for readers, learners, scientists, and artists.”\n Meantime, we writers keep pushing the envelope in games and online, dreaming of the day when ‘readers’ (we’ll need a new word, won’t we?) can walk into one of our stories and experience it, maybe even change it themselves. Or when a narrative can weave within everyday experience and not be called daydreaming. Or maybe it will be called that, but as an app.\n We’re playing and waiting. We’re writing narratives set far past that future, into the next one. Don’t believe me? Check out/play a recent gorgeous work by Jedediah Berry called Fabricationist DeWit, online here: http://thirdarchive.net/fabricationist-dewit-remakes-the-world/\n Because we’re very close now. In some senses the stories are already here, in some realities, they’ve always been here.\n “As one moves through a hypertext, making one's choices, one has the sensation that just below the surface of the text there is an almost inexhaustible reservoir of half-hidden story material waiting to be explored. That is not unlike the feeling one has in dreams that there are vast peripheral seas of imagery into which the dream sometimes slips, sometimes returning to the center, sometimes moving through parallel stories at the same time.”—Coover (1993)\n Fran Wilde's novels and short stories have been finalists for three Nebula awards, two Hugo Awards, and a World Fantasy Award. They include her Andre Norton- and Compton Crook-winning debut novel, Updraft (Tor, 2015); its sequels, Cloudbound and Horizon; the middle-grade novel Riverland (forthcoming from Abrams in April 2019); and the novelette \"The Jewel and Her Lapidary.\" Her short stories appear in Asimov's, Tor.com, Beneath Ceaseless Skies, Shimmer, Nature, and the 2017 Year's Best Dark Fantasy and Horror. She writes for publications including The Washington Post, Tor.com, Clarkesworld, iO9.com, and GeekMom.com. You can find her on Twitter, Facebook, and her website."}