{"fingerprint": "7xc84+xX9nJwQ9LIJDjW/XHRDFk=", "sitename": "Clarkesworld Magazine", "title": "Another Word: The Future, Ordinary by Cat Rambo", "author": "Cat Rambo", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_06_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Future, Ordinary by Cat Rambo", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: The Future, Ordinary\n I love me a space epic full of improbability drives and warp mechanics as much as any science fiction reader, and I’ve written more than a few stories in that milieu, gleefully flinging about concepts like living spaceships, FTL, and galaxy-spanning brains. But I will admit that my affection is most firmly claimed by quieter, closer tales, stories that offer glimpses of the near future and the small things that change our lives in (sometimes) subtle but undeniable ways.\n Look at how far we’ve come in the handful of decades I’ve lived, which has included the invention of the microprocessor, the Internet, and social media. Sometimes the SF writers of the past glimpsed these things or even helped create them (Star Trek and cell phones), but often they didn’t, to the point where some nightmarish narratives seem cartoonish, like Colossus: The Forbin Project, where the computer was not just monstrous in terms of brainpower but the space it occupied.\n In Charlie’s Angels (not the series, but the movie made in 2000, less than two decades ago) the plot revolves around technology called “Red Star,” which Lucy Liu’s character Alex Munday observes, “Red Star could turn any phone into a homing device.” “No one could hide,” Cameron Diaz/Natalie Cook says. “Imagine how dangerous this would be in the wrong hands,” a wide-eyed Drew Barrymore/Dylan Saunders concludes. (Thank you to Saladin Ahmed for tweeting about the plot.)\n Unfortunately for us all, I fear, it did fall into the wrong hands, which are merrily profiting, controlling, and sometimes Doing Bad Things with it. In those days, science fiction was looking forward at the impact of technology on our lives, the ordinary future. It remains a concern for science fiction.\n More recently, I was at a workshop at the University of Arizona’s Center for Science and the Imagination where they teamed up writers, scientists, and artists to explore possible futures involving solar energy. Our group was assigned two components: a large, centralized energy project located in a rural area. We opted for Arizona, and it was awesome to see the scientists figuring exactly how many gigawatts the state consumed each year.\n Part of the theme that emerged for our story was that although we talk about locating such projects “out in the middle of nowhere,” they will in fact be located in places that do have some existing infrastructure: roads, energy, telephones, etc. and will be part of whatever small-town communities host those resources. For our story, we chose the fictional town of Tierra Del Rey, living in the shadow of an immense solar power plant about to expand tenfold.\n Other narratives involved other manifestations of solar power: a massive structure hovering above Phoenix, or a system where each house had its own solar panels and helped supply the grid. Ideas abounded: genetically engineered birds or butterflies with solar panel wings that let them survive without food, solar-powered tattoos, storage batteries filled with kinetic energy via bent reeds.\n The fulfillment of human needs like energy is territory that is particularly rich for stories. How will we handle energy—and who will have it? Who will make money from it? Could we make enough that everyone could have it? (Hint: we could right now, along with ending poverty, if the world’s billionaires were willing to fund it.)\n Along the same lines, how will we handle knowledge—and who will have access to it? Will that access be restricted or filtered in some way, will those restrictions be visible or invisible? This is particularly important with the technology that has more world-changing power than any other, the Internet.\n The throttling and pollution of the Internet, along with threats like partitioning off its access, has gone so far as to skew election results at the national level, to the point where #fakenews on Twitter is self-referential, a tag whose validity seems often predicated entirely on bits and bytes of nothingness.\n How will we handle privacy—and who will have it? is another of the questions that will shape our lives. Walking down the street, what if I could pin a virtual frownie on that person not scooping up after their Peke, a tag visible to other passersby? What if a company knows exactly what I want—and chooses to sell me more than I actually want, to a point where it’s detrimental?\n Overall, the largest question (and one that threads its way through all of the above) is not just how will we handle money but who will have it? The answer to the latter question matters a lot to various visions of the future, and I’d argue it’s essential to the majority of the most pessimistic as well as the most optimistic.\n Last year I wrote a story for Chasing Shadows, an anthology edited by David Brin, where each writer offered a piece inspired by Brin’s nonfiction work, The Transparent Society. In “Preferences,” I talked about the human desire for meaning and what happens when that’s supplied as part of the consumer experience. It’s a question I’m still thinking about.\n Many of the places where these ordinary but story-worthy things will manifest are small, like cosmetics designed to get around facial recognition software by creating an unusual contrast with the skin, using a tonal gradient, or imposing an asymmetrical look.\n Body alteration could be minor—we have plenty of existing manifestations like tattoos and piercings. Who wouldn’t like the ability to shift hair color or length at will? What small alterations might yield substantial advantage for individuals working in space or in the atmosphere of other planets?\n Similarly, 3-D printing is not just about making it possible to “on-demand” so many things (a game piece, a specialized cookie cutter, a piece of jewelry) but also raises plenty of questions of copyright and ownership. In Brin’s Kiln People, even identity becomes a question when multiple versions are printed.\n Last year, I laughed a little when a local Seattle law passed requiring bots to identify themselves, to the point where I wrote a story about a woman who falsely identifies herself as a bot. She suffers the consequences when a secret robot uprising suspects that she’s trying to infiltrate their group. But Google’s recent announcement, introducing a bot that you can tell “I want a 9AM hair appointment this Friday” in order to have it call the salon and book the appointment, makes that law clearly prescient in a way that makes me respect the technologists in local government here even more.\n This is, in fact, the nasty fact that continually nips at the heels of anyone working in the near future—it is always in the process of catching up with you and may have already done so if you’re not careful about it—or may even have done so during the lag between acceptance and publication, as happened with the Amazon drones that Sean Wallace ended up making me pull from “Tortoiseshell Cats are Not Refundable.”\n Whenever that happens, we usually have gotten it wrong. In which case one consolatory thought is that science fiction (and fantasy, or anything else, for that matter) is about the time and place in which it is written, even when it takes place in a galaxy long ago and far away. Someone told me very seriously that the feral appliances in “Red in Tooth and Cog” wouldn’t work in the way I’d posited, and that was quite all right. The more important questions in that story (to my mind at least) have to do with how we interact with intelligences other than our own and what sorts of misunderstandings happen there.\n We write about our own understandings of the world and sometimes we change them in the process. Stories, I heard Pat Rothfuss say at a recent event, are the only things that build empathy and show us that we are like each other. No matter what future we write in, we are building bridges there and sometimes the simpler, humbler ones will be more useful than grander, higher-reaching structures, no matter how pretty they are.\n Go into another room now and look at the material things there: the things people have put there, that they have assembled throughout their lives. Look at the ordinary details: the hem, the bureaucratic form, the simplest tool. Examine them. Use them. And then unfold them in your head, and you’ll find your story there.\n Cat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America."}