{"fingerprint": "rxClX2zeqjtgogqMOC5YdkbfSYQ=", "sitename": "Clarkesworld Magazine", "title": "Another Word: A Doom of One's Own by Genevieve Valentine", "author": "Genevieve Valentine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_02_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: A Doom of One's Own by Genevieve Valentine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: A Doom of One's Own\n In 1965, Bantam reprinted Dave Wallis’ one-generation apocalypse, Only Lovers Left Alive. The cover was a flat, empty ground with painted figures in monochrome. A motorcycle-jacketed girl stands Bullitt-cool in the foreground, toting a rifle; a young man looms behind her in helmet and goggles. Far behind him is the rest of the gang, one of them wearing a cowboy-ish hat and looking at us over his shoulder, hip cocked coquettishly. The logline blares: Smashing, Looting, Killing, Loving—the Teenagers Take Over the World!\n I bought my copy at a used bookstore the day of the election—I was concerned about the outcome, and I’m a nervous shopper. I left with a stack of pulp novels, which I like reading when I’m concerned about outcomes. They’re books full of people who have seen awful things, in stories that assume everything’s a little dire and there’s not much to be done about it except to muddle through. Optimism in dark times is hard for me. I can be practical and make noise and keep moving, but when things are tough, an uplifting speech never cuts it. Even if it has a happy ending, I want something that agrees that the going will be rough. You could tell I was steeling myself for the worst from the titles I bought in a stack ten deep: Deadly Nightshade, You’ve Got Him Cold, Murder Somewhere in This City. (I didn’t think about it at the time; only later did I realize the theme. When you’re a nail, everything looks like a hammer.)\n We’ve been mapping a lot of dystopias across real life in the months since. History, despite ready examples, has been getting us nowhere. Star Wars and Harry Potter feel too simple; 1984 and Animal Farm have been happening in increments for too long for us to clutch our pearls about them now. Mad Max, maybe. Dr. Strangelove. The Handmaid’s Tale. Brazil. And in the last few years, we’ve been overrun with stories about what happens when an autocrat takes control of a flawed system. Totalitarians, broken bureaucracies, and dystopias are easy to find. (All of them are warnings and at some point it’s embarrassing to look over the list.)\n Batman has more merit. The movie franchise has been spread over more than twenty years under three directors, and the citizens of the most flamboyantly crime-riddled town in the world are only as good as the times. In 1989, the people of Reagan’s Gotham danced alongside Joker’s victory parade, fighting over the pittance he threw. By 1992’s Batman Returns, America was on the verge of electing a Democrat after twelve years, and the people of Gotham City were agitating for a happy ending. They voted Penguin the Mayor (Gotham City, like any democracy, often acts against its interests), but when his callousness was revealed—“I played this stinkin’ city like a harp from hell!”—he was booed off the stage and shamed out of office.\n Nolan’s Gotham is thornier—his movies span almost a decade of culture shift, and bend toward Batman as benevolent autocrat. But the pivotal moment of The Dark Knight involves a handful of regular people who, at the last, choose not to act in violent selfishness (and ruin the Joker’s big moment so completely that Batman’s able to win). Even in The Dark Knight Rises, when Gotham falls to fascism, there are a handful of holdouts. The city doesn’t know—a board member offering himself as hostage and Gordon insulting a sham court both happen privately—but the city doesn’t have to. The movie sees them; we see them. There are enough of them, eventually, for it to matter. It makes sense right now to draw parallels to the darkest beats of a Batman movie (any of them; it’s not a subtle city, and these aren’t subtle days). We’re Gotham City, for a version of Gotham where Batman isn’t coming and we have to save ourselves.\n Then there’s Only Lovers Left Alive, a book very sure that the center cannot hold. The concept is simple: Every adult in Britain commits suicide—not because of science-fictional spores or great disaster, but because, as one farewell note says, they’re “just so sick and tired of it all”—and teens must learn to fend for themselves in a hurry. It’s a book full of swipes at everything going on, alongside a shrugging acknowledgment that in the end, maybe having is better than not having: parents, schools, steady partners, someone to keep the lights on.\n Among the parable of collapse, there are passages so specific and relevant as to be chilling. After a press conference about municipal plans for the rising tide of suicides, the press moves in: “Was the Minister aware that the Association of Undertakers’ Men had protested that Civil Defense Corps workers were paid at a much lower rate than themselves and were a threat to their standards? How much was the housing and entertaining of the World Health delegation costing the government? Was there not a strong case for some measure of price control on coffins? As so many people gassed themselves in the small hours could the Minister arrange for gas supplies to be cut off at night?” It’s a swarm of minutiae that doesn’t get within a mile of the real problem: the despair that it’s too late to do anything about.\n Only Lovers Left Alive is a short read for long nights. It unfolds with nightmare logic and doesn’t care much about specifics—the adults disappear and the kids stagger through the world in a telescoping timeline that doesn’t matter much. At first, the book centers around the adults who are at a loss as to how to handle the world they made their way in, narrators who disappear one at a time; the second third is the abandoned teenagers trying to scrape together a pretense of society, operating under a fog of resentful grief that the older generation has left them to clean up this mess. It’s a cycle that plays out repeatedly; those in power resent the responsibility, those without power resent being told what to do, and experience turns everyone, inevitably, into a grownup. (At one point, one of the teenagers runs across a group of feral children who have this metaphor down to a science: They viciously beat and insult that night’s chosen child, who then gets to turn the tables and become Mother and Father, forcing them all into bed.)\n The bleakness fades as the book goes on. If you go far enough north, you become an adult; you learn to catch sheep, and value other people’s safety, and make naan on a trash can lid, and compromise on your petty grievances, and settle for a partner you don’t love because it’s the mature thing to do, and plan to raise your children to resent you in their turn. It’s an inevitable cycle, the friction it creates between the generations cycling fast enough that it almost counts as stability.\n I read a lot of articles in between chapters of this book. (I’m restless, lately.) Announcements were flooding in from everywhere, and together they were forming the sort of apocalypse scenario that makes the end of Only Lovers Left Alive read like a BBC Christmas special—everyone having liberated the slaves from the fascist warlords, having abandoned the despair of the past, and now hanging out in the Scottish highlands being kind and starting over. It’s nice; it’s useful, to have things to hope for. But we’re still in the deep hours, Gotham City before everyone realizes they’ve installed a villain. Hope is necessary, but hope comes after the action, sometimes. Sometimes you just want to acknowledge that the going will be rough.\n Tonight, after another long day in the new republic, I went back to my stack of hard-boileds and started Murder Somewhere in This City. It’s going to be a long night; it’s good to have something to read.\n Genevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times."}