{"fingerprint": "hvpnJqhxKGfHUrfnVo4vaMVBiGs=", "sitename": "Clarkesworld Magazine", "title": "Another Word: It's All Fun and Games by Alethea Kontis", "author": "Alethea Kontis", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_05_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: It's All Fun and Games by Alethea Kontis", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAnother Word: It's All Fun and Games\nBig news! Story sale! I’m going to be in an anthology releasing later this year. It’s a YA GamerLit anthology called Game On!\nHooray!\nBut wait! This is the same anthology that I was supposed to be a part of last summer, before it even had a name. It really will be coming out this month, and I’ll be in it.\nBut not in the way I was supposed to be.\nWhich is kind of okay. I mean . . . I’m a gamer. And the publishing industry, at its heart, is just a game. We choose a character and arm ourselves with whatever’s handy—the pen is mightier than the sword, right?—and head out into the world at Level 1, like blind little greenlings with a Charisma of infinity!\nWe know we’re going to face monsters and pitfalls. We know we will accrue damage points. But if we are lucky, we find our tribe—and heal ourselves. We get Experience Points (xp) and we Level Up. Our tools become better. Our stats get higher. And we learn how to work smarter, not harder.\nSometimes, of course, it’s hard. You try and you try and you try and can’t seem to finish a quest or have battled the same monster over and over.\nBut then sometimes, it ends up all working out anyway.\nGame On! is a perfect Case in Point.\nHere’s what happened:\nLevel 1\nThe Game On! anthology was originally slated for Summer of 2018. The ringleader was Anthea Sharp, owner of Fiddlehead Press, and when she asked me if I’d be on board for a YA GamerLit anthology, I didn’t hesitate.\nThe deadline was July 10th of last year and because of my own excitement about the project, I finished my story early. It was called “The Chaos Crushers’ Day Off,” about a dark guild of orc hunters who decide to tackle a role-playing game on their day off.\nI was so in love with this story and these characters. Even my local SCBWI (Society of Children’s Book Writers and Illustrators) group gave excellent feedback. Beta readers also offered praise and I couldn’t wait for the anthology to be finished.\nLevel 2\nNow, when we turn in our stories for some of the other anthologies that Anthea publishes in January, the finished product releases the next month in February. I assumed that since the stories were due in July, that the book would be out by August (before Dragon Con! Yay!).\nSilly, Level 2 me. This proves true that old adage about assuming things and said practice creating a self-made ass out of u and me.\nI wanted to announce the anthology at Gen Con, but we didn’t even have a title yet. Or a cover. I suspected the worst.\nThe anthology continued to not happen for Reasons. I sat on my story like a good little author, waiting.\nLevel 3\nNow, it wasn’t like I wasn’t doing anything during this time. I had all sorts of side quests to keep me busy—most importantly, Dragon Con. Since I had a full hour to read at Dragon Con, I performed “The Chaos Crushers’ Day Off.” The response was tremendous. A seven-year-old boy giggled through the whole thing. My excitement continued to build about the project.\nAnd after that hot and muggy week in Atlanta, I had to drive up north to see family. Then, I had a Picture Book Boot Camp with Jane Yolen. Continuing on, I had four more projects to write in December—an invite-only anthology, a Kickstarter anthology, a short comic anthology, and still yet another story.\nLevel 4\nIn early December, I was approached by IGMS Magazine for a short story reprint. Now, at this level, short story reprints are something of a very little gold mine that some authors don’t even know to pursue (I really should make more of an effort).\nOf course, I said YES. But also, I had this original story still sitting in my trunk collecting dust.\nI had promised the story to Anthea. But Game On! (we had a title, but still no cover) had been postponed indefinitely at this point, and I needed the money. It felt horrible and underhanded to sell this story to someone else. So, I did what any sane gamer would do in this instance: I phoned a friend.\nMaurice Broaddus and I have been friends since we were both filling out our character stats. As a good friend should, Maurice will tell you that I’ve never been Level 0 in this industry, but you get the gist. I confessed my horrible thoughts and was met with silence on the line.\nAnd then Maurice said, “What would Pic do?”\nFor those who don’t know, Tom Piccirilli was our Obi-Wan Kenobi back when we were just starting out. Heck, he still is my Ben. Because mentors like Pic are never really gone.\nPic would have pointed out that it’s business. Writing is our business. Letting perfectly good writing molder in the trunk is not good for business. Pic would have said all of that, in his thick New York accent, and then added a “Don’t be stoopid!” for good measure.\nAs soon as I got off the phone with Maurice, I told Anthea that I was pulling my story out of Game On! and promptly sold “The Chaos Crushers’ Day Off” to IGMS at pro rates.\nLevel 5\nOf my slated aforementioned December projects, two were canceled before I even started the invite-only anthology and the comic anthology. I wrote another story for a different anthology called “True.love,” about how a bunch of hacktivists try to take down the world’s most perfect matchmaking site. It was like a fairy-tale “Ready Player One.”\nYes—my main character was a gamer.\nIronic, isn’t it? This story also would have been perfect for Game On! Oh, well. By now, Anthea had a cover and was planning a release.\nIn March, Anthea asked me about “Chaos Crushers’ Day Off.” She’d take a reprint, but it hadn’t even released yet. I wouldn’t have reprint rights back for a while. Boo.\nSometimes, when you’re a writer, timing just doesn’t work in your favor. It just stunk, because I really wanted to be in that anthology.\nAnd then . . .\nLevel 6\nAnthea sent me another email. “Would you consider including ‘True.love’ in the Game On! anthology?”\nOf course, I didn’t hesitate!\nI don’t even have to ask permission from the editor of the new project, Once Upon a Star, because Anthea is the editor. She’s the king of her own small press—she makes the rules, and she can break them if she wants to! She can also give out secret side quests.\nI love that I was able to make it work by just being me and I effectively got to sell the story twice! Bonus! Reach the castle and claim my prize! But the game isn’t over. The game is never over.\nThis writing Princess will always be in another castle.\nAlethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie."}