{"fingerprint": "UhX4VOjQabiXFE7dbEc/B0r0Bt4=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Your Life is Epic! by A.M. Dellamonica", "author": "A M Dellamonica", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_07_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Your Life is Epic! by A.M. Dellamonica", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Your Life is Epic!\n I once caught a burglar and made twenty bucks.\n I can winnow Twenty Dollar Burglar down to a pretty boring story. Here’s the tl;dr: I once had a minimum wage job at an all-night answering service. Some of the gig was answering 24-hour hotlines, mostly for engineering firms that serviced the Alberta oil patch. The rest was monitoring burglar alarms. All of those alarms went off periodically. Most of the time it was because of random teens banging on windows, or freezing weather—yes, it got that cold!—or sometimes a squirrel had . . .\n Wait! I’m making this interesting. It’s ingrained, you see. All those years of practice.\n Operators got a princely, twenty-dollar bonus if it ever worked out that we called 911 and the cops responded in time to catch someone in a criminal act.\n This never happened. Except, one day it did. The end.\n Except . . .\n Guys! I caught an effin’ burglar in the act!\n No. Let’s not be melodramatic. I made a phone call.\n Writers exist between these extremes: the operatic and the mundane. Between the Apocalypse and Yawnsville.\n Tuning one’s fictional sensibility into the disastrous end of this spectrum is easy. Many a writer has spoken of the weird disconnect that comes when we’re sitting at the bedside of a dying loved one—to take one common example. We’ll be grieving with our whole hearts while simultaneously taking mental notes for later use in fiction. Writers file away the harrowing experiences, even when doing so feels weird or guilt-inducing.\n But only attending to the dramatic, be it loud or exhilarating or flat-out horrifying, can deafen you to nuance. Human interaction is often more intriguing when it’s not coming in at a roar.\n Now and then the actual events of your life are too raw. Delivered straight, they don’t make good story.\n But the mundane events of your day to day, the apparently uninteresting—well, you might think, why bother with the chaff?\n Art, in all of its forms, is an act of communication. Whether you’re a writer, an actor, a dancer, a painter, a whatever, you’re reaching out to people beyond your comfort zone. Writing is a conversation with strangers, an invite to any and everyone. You’re there for the folks who will eagerly snap up your work the day it’s released, and for people who might stumble over you five, ten, even sixty years later.\n To write is to shout across both space and time. To cast a piece of your consciousness into the future. This is a big, scary, almost a terrible thing. And reaching for big things—even admitting your hand’s outstretched—can feel like begging some toothy god to bite it off.\n Oops, I’m dialing back up, again, aren’t I? We’re at least halfway to the pitch of a good melodrama.\n Maybe you don’t like to think about big art, about reaching for dizzying heights, about the hubris of grasping after immortality. It’s safer to downplay what we do. Come on, we say. I’m writing about nonbinary, three-headed dragon babies from Planet Zerk. It’s not exactly Titus Andronicus. I’m a wordsmith. It’s just a thriller. I tell stories. I’m faking while I’m making. Jeez, lay off!\n Except, except, except.\n What you’re communicating is your truth.\n This sounds pompous as all get out, I know, but if the baby Zerk dragons didn’t mean anything to you, would you bother? Really? When there’s so much great stuff on Netflix?\n Storytelling comes down to sharing the things that you know, in your bones, to be real and important and worthy of expression. Every artist has themes they return to. These are, on some level, the things they need other people to know. This is no lark. We do it because it’s dire necessity.\n And, as such, it doesn’t matter if you’re communicating your truth via a story about aliens who speak to goldfish, a novel about vegan werewolves, or a film about serial killers. Truth comes wrapped in romance and coming of age novels and domestic realism and cozy mysteries.\n And truth—Truth, rather—comes from lived experience.\n I know, you already got that. But it takes us back to Twenty Dollar Burglar, incidentally, and also to Mary Shelly’s Frankenstein.\n (You all saw Frankenstein coming from miles away, right?)\n Think of Victor Frankenstein, Mary Shelly’s genius creation, borne of invention and imagination, yes, and of all her losses too. The famous mom she never met, the weird boundaries with her sister, the clandestine meetings with Percy Shelly in the St. Pancras Church cemetery. The great romance with the married dude, the childhood home she fled—it’s almost too much, isn’t it? And that’s before you factor in her three lost children.\n Mary Shelly knew loss intimately. Her truth is Victor’s harrowing grief, his need to fight death, and the lengths he was willing to go to defy the apparent order of the universe. When Victor gathers those pieces of corpses together, when he stitches them into a new whole and infuses them with lightning, he is howling Mary Shelly’s truth to anyone who would listen.\n It’s a howl that’s gone on for two centuries. And Mary’s life was indisputably epic. Nobody’s saying “Well, she met some bum in a cemetery and ran off with him, and I guess she maybe also wrote some stuff.”\n Yet I bet—I know—there were hours and days and weeks on end of that life that didn’t feel particularly epic to her at the time. And Frankenstein’s drama is underpinned by with those moments: the grind of Victor’s scientific process, his unhappiness and his distance from his family, the periods of loneliness, and the stretch where he’s miserably ill.\n Twenty Dollar Burglar is a single piece of my autobiography. Out of context and downplayed, it’s just a day at the answering service. Definitely not operatic.\n But it’s part of my collection of scavenged body parts, and I can stitch it into any creature I choose.\n Develop your instinct for all the flavors of drama. Learn to tell when you can brighten experiences that seemed dull at the time, transforming them into something fine-edged and interesting, and then stitching them to something truly wondrous. Art is about noticing connections and possibilities, so broaden your sense of the scraps with potential. Figure out which parts should come out of the bin and go onto the table, ready for catgut and lightning and transformation.\n I can play you a range of stories about that dumb, dull, criminally underpaid answering service gig. I can describe the steampunky corkboards we used to process the calls. I can talk about clients like an undertaker’s body-fetching service. Perverts and stalkers rang the all-night engineering lines, all the time, by the dozens because they knew it was always a woman who’d pick up. I can describe paint-thick nicotine stains on the walls, dating back to the nineteen twenties, when the corkboards were cutting edge tech and nobody’d heard of not smoking at work.\n And did I mention the eavesdropping? Of course, we all listened in shamelessly on the lines. To the stripper’s agency and distress line and the corpse pickups. We even listened in on the criminal lawyer’s uber-confidential midnight calls from people who’d been arrested in the night, usually—but not always—for drunk driving.\n I can tell stories about the way working graveyard shift mutated my sleep cycle, about reading burglar alarm codes off ticker tape, about trying to get home at dawn on Christmas morning after an ice storm encased all of Edmonton in a two-inch layer of wet glass.\n I can stitch Twenty Dollar Burglar to a thousand bits and pieces. Depending on the anecdotes in question and the intensity of the energy coursing through them, I could spin you a lesbian romcom, some social satire, or an urban fantasy. You prefer QueerFic? I have hilarious anecdotes about workplace homophobia. Or I could pull down lightning and forge a steaming cold cup of CanLit—because what’s more Canadian than oil rigs and runaway forest fires and being up all night taking calls on the summer solstice?\n Think about the anecdotes you’ve told people about yourself, over and over through the years, and ask yourself: why are these my greatest hits?\n Then give yourself permission to shine your experience through a range of dramatic prisms. Listen for your truth but refine it. Change the facts to protect the innocent, and always keep the core. Know when it’s too much, when you need to dial the volume down to a whisper. If you do, it’ll be that much more shocking when you crank it up, competing with Victor Frankenstein’s two-hundred-year scream.\n There’s plenty of epic in your story, even the bits you may have previously dismissed as mundane. This stuff isn’t for the timid, and guess what? You don’t have to be timid. Chances are you’ve got truths that, told at the right volume, would make your next-door neighbor green.\n Your life is epic. Observe it ferociously and tell it well. Catch that burglar, brag it up, and take home that sweet, sweet twenty dollars’ worth of cheddar. Trust me—you’ve already earned it.\n A.M. Dellamonica's first novel, Indigo Springs, won the Sunburst Award for Canadian Literature of the Fantastic. Her fourth, A Daughter of No Nation, has won the 2016 Prix Aurora for Best Novel. She has published over forty short stories in Tor.com, Strange Horizons, Lightspeed, and numerous print magazines and anthologies. She was the co-editor of Heiresses of Russ 2016. She teaches writing at two universities and is pursuing an MFA in creative writing at a third.\n Alyx is married to Nebula Award winning author Kelly Robson; the two made their outlaw wedding of 1989 legal, in 2003, when the Canadian Supreme Court conferred equality on same sex couples."}