{"fingerprint": "zZJl1ek1xpJelr4xQrGlhDHfBNY=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Klingon Time Management by A.M. Dellamonica", "author": "A M Dellamonica", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_11_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Klingon Time Management by A.M. Dellamonica", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nAnother Word: Klingon Time Management\nToday is a good day to write!\nWith Halloween in the rearview and the other momentous end of year holidays not quite gnawing at our ankles, some of you are naturally going to turn your thoughts to NaNoWriMo. For anyone who hasn’t heard of this ancient challenge, the basics are: you write a 50K novel in November, at a rate of 1,667 words per day. Succeed and you get a badge, bragging rights, and—if you participated in the forums—new friends and peers. Most importantly, you get 50K of writing done.\nIt can be a big deal, Nano. A learning experience, a way to take your art seriously, a chance to finish a draft of a first book, a means of shutting off too-harsh internal saboteurs and critics . . . lots of great things can come of it.\nBut all too soon you slam into December 1st, and you’re picking up the bits of your life you’ve been neglecting for thirty days. One short month from today, some of you may be asking yourselves: I did it! Now what?\nThe answer lies in our distant fannish past.\nI am from a particular age group of SF fans who saw the original Star Trek not in its first run, in the late Sixties, but over the stretch that came later, when it aired in syndication. Badly cut to maximize the time available for commercials, it aired five days a week, once or twice a day.\nBy the time teenaged me came along to watch those 79 episodes, over and over and over again, there was a fair amount of Star Trek tie-in product to be had, almost all in the form of print media. David Gerrold, who at 23 years of age wrote that infamous episode “The Trouble with Tribbles,” possibly salvaging the fortunes of the fun-fur industry forever, wrote one book just about that experience and a second book, The World of Star Trek, about the massive appeal of the show.\nSo as I was watching those episodes in rerun, I also had access to criticism, behind the scenes commentary about what it was like to be a TV writer, the actual “Trouble with Tribbles” teleplay, the history of a failed write-in campaign to save the show, photo novels (anyone remember photo novels?) and a billion other random research sources. My high school classmates and I chipped in to buy these things because, basically, science fiction was in short supply and some of us thought William Shatner and/or Leonard Nimoy and/or Nichelle Nichols was hot.\nWhat I didn’t have access to was fanfic. I don’t think I even heard about it until I was in university, getting to know the works of Joanna Russ.\nAs new shows got created and people continued to explore, discuss, and embroider, we realized Star Trek had pioneered a lot of the things we now think of as classic TV tropes. Some good, some bad: in one episode—Plato’s Stepchildren—Kirk and Uhura were forced by mind-controlling aliens to kiss, in a scene that is quite cringingly awful. I didn’t know about fanfiction and its tropes and memes, so I didn’t recognize this textbook example of something that would eventually come to be called “Aliens made them do it.”\nThis is exactly what it sounds like. You’re writing something porny about two characters who, in canon, would never get it on. So aliens appear and make it happen. They use mind control, they use threats, they use deception. Lack of consent means it’s one of those memes that has aged very badly. Why can’t aliens force them to garden?\nOr . . . write?\nFor those who are about to Nano, you have thirty golden days in which you’re sworn to produce pages. It’s a rule. You have to do it or Klingons will ferociously mock you!\n(Pay up your health insurance. Klingons don’t mock with just words.)\nCommitting to NaNoWriMo is like choosing aliens to make you to Do It.\nFor some, this will be wildly successful. For others it will work a bit, and for others not at all. No writing rule, technique, or challenge is one size fits all.\nGetting a book written is a big accomplishment. It’s a tiring one, too. Some of the writers who do reach this goal—who get their 50K and celebrate sweet, sweet victory!—will find themselves stopping again. Just for a week. Well, a month. Oh, now it’s Solstice. Well, maybe in 2019 . . . Soon they’ll be beating themselves up about this.\nOn December 1st, your mission is to find another species of Do It Alien. Are they Vulcans? Andorians? Whoever they are, they’re there to make writing a sustainable and organic part of your life. To happily produce new words and revise old ones on some kind of regular basis.\nIf you can escape the fires of NaNoWriMo and forge the beginning of a regular artistic practice, you will be vastly more likely to succeed in publishing . . . and that’s true whether the fruits of this November are unadulterated genius or a hastily-written shambles. (I say this, by the way, as someone with two such Nano-shambles to my name.)\nGoing from hare to tortoise is easier said than done. I know that, and I know it sucks. This is why there are nine million writer essays on the web addressing the question “How do I find time to write?”\nAnother of the reasons there are nine million essays, besides the fact that everyone wants to brag about how they get it done, is each creator’s answer—the fine-tuned mechanics of how they get down to it—is unique.\nThere are barriers in everyone’s life. They fall, roughly, into the following categories:\nOther commitments: family, job, inadequate housing, chronic health problems, social commitments, court dates, a wicked gaming habit, fighting the patriarchy.\nLogistical commitments: bad equipment, inappropriate workspace, distracting soundscape, lack of privacy, not realizing you need new glasses.\nSabotage: sometimes there are people who just don’t want you to do it.\nPsychological barriers: You can’t work without a deadline. You can’t focus properly because every time you see a Twitter notification, you derail. You don’t really feel entitled to carve out this much time for yourself. Sure, it’s OK when it’s just November, but . . .\nThere is no one-size-fits-all to answer to this. There is, however, networking, researching, seeking the support of your peers, sympathetic brainstorming and—most importantly—experimentation. There are a lot of things writers have tried. As you sit there basking in the glow of your 50K manuscript, take up your search engine and scan a bunch of those “How to find time to write” articles on the web. Keep browsing until you find five possibilities that might work for you.\nHunt for the answer. Morning writing? Evening writing? White noise apps? Working on pen and paper? Pomodoro? Experiment for as long as you need. Don’t be afraid to fail for a week because you tried something that seemed stupid.\nPerhaps most importantly, ignore the “shoulds.” It’s wrong to say that everyone should write every day. Not everyone can or should generate steady word counts. There are people who research and outline a book for nine months and then hole up in a motel and write the draft in 3 weeks. I read about someone like that in Writer’s Digest when I was 16. That writer, to me, was as improbable as the Organians. The thing is, that guy did the same thing again the next year. And again, the next.\nMe? I go to a coffee shop every morning with my writing kit, and the fact that I then feel I have to earn back the cost of my pricey espresso is what it takes to buckle me down to fiction. It’s no weirder than anyone else’s strategy, and I have hundreds of thousands of words under my belt. Coffee shop writing is, somehow, the Alien who makes me do it.\nMake a little time to figure out your long game, if you can, while your draft is still hot. Do the experiments and learn what your brain requires. Be kind to yourself, be forgiving . . . but you want to write, and you’re allowed to want to write . . . so don’t let yourself wriggle off the hook.\nImagine, as you try things, that those pesky interfering aliens are coming for you. They want your next book (and your next, and your next!) and they are going to make you write. They’ve taken Ensign Chekov hostage. They’ve got one of those creepy Khan worms.\nIf you had to write a book every year, for improbable alien threat reasons, if you had to establish a regular artistic practice, what would be in your way? How could you get it out of your way?\nGo boldly now and find the answer.\nA.M. Dellamonica's first novel, Indigo Springs, won the Sunburst Award for Canadian Literature of the Fantastic. Her fourth, A Daughter of No Nation, has won the 2016 Prix Aurora for Best Novel. She has published over forty short stories in Tor.com, Strange Horizons, Lightspeed, and numerous print magazines and anthologies. She was the co-editor of Heiresses of Russ 2016. She teaches writing at two universities and is pursuing an MFA in creative writing at a third.\nAlyx is married to Nebula Award winning author Kelly Robson; the two made their outlaw wedding of 1989 legal, in 2003, when the Canadian Supreme Court conferred equality on same sex couples."}