{"fingerprint": "J1Ot777qD+PpnH8Vof/UAk9Gmpk=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Obstacles and Style by Daniel Abraham", "author": "Daniel Abraham", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_08_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Obstacles and Style by Daniel Abraham", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nAnother Word: Obstacles and Style\nMy father is a songwriter and has been since before I was born. Many of the songs he writes take the form of stories with narrative arcs, characters, and resolutions at the end. One of the things he told me was that personal style—as a musician or a songwriter or a novelist—is made from all the ways you find to cover up your shortcomings.\nI’ve come to like that idea a lot.\nImagine you pick up a book, open it at random and read:\n“Building a human was easy: the Auditors knew exactly how to move matter around. The trouble was that the result didn’t do anything but lie there and, eventually, decompose. This was annoying, since clearly human beings, without any special training or education, seemed to be able to make working replicas quite easily.”\nIf you’re familiar with Terry Pratchett, it seems likely you’ll recognize him, even if you haven’t read Thief of Time. And that holds true for any writing by an author with a strong, distinctive voice. And part—I think most—of what creates that familiarity is the toolbox of shortcuts, habits, and challenges the author brings to the project.\nThere’s a movie I watch every year or two by a director I hate. The director is Lars von Trier, and the movie is The Five Obstructions. It’s a kind of documentary, which is part of why I like it better than anything else von Trier has done. In it, he finds a man who was a friend and mentor: Jørgen Leth. Leth had made once influential short film called The Perfect Human. Von Trier challenges him to remake the film five times, each time with a different set of constraints. So, for the first remake, von Trier insists that 1) the film be shot in Cuba, 2) no sets be employed, 3) all the rhetorical questions asked in the original film be answered, and 4) that no piece of film be longer than 12 frames long (about half a second). Leth’s response was to make a version of his work that was, to my tastes, more interesting and engaging than the original.\nFour more times—or maybe only three, depending on how you count the last one—the original film is recreated with new constraints and limitations. Each one is fascinating in its own way, and watching a brilliant, creative man pushed to his limits is—for me, at least—better than sports. Each time the rules get harder in new ways. Sometimes Leth despairs. But then there is a moment where he smiles and starts to get excited. He’s found his way around the problem, and his solution becomes the thing that makes that particular version interesting.\nIn the last few years, I’ve been lucky enough to be involved with several examples of a story being remade in a new medium. I adapted George R.R. Martin’s, A Game of Thrones as a series of graphic novels, and I helped to adapt my own co-written novel Leviathan Wakes into a television show that will be airing next year. In both cases, the strengths of the novel matched poorly to the needs of the new form. Like Leth remaking The Perfect Human under different constraints, we had to retell the old story in a new way. Where the books had exposition, the graphic novels had visual imagery. Where the books had internal monologue and unreliable narrators, the TV show has the impartial eye of the camera. By changing the conditions under which we could tell the story, we changed the experience of it. It became something that was clearly related, but different.\nYou can see something like it when the world changes things around a genre too. Police procedural and suspense novels in the 1990s struggled to revamp the standard plots to fit a world of ubiquitous cell phones and Internet access. Sometimes they were successful, other times . . . well, less so. One novel I particularly remember made a point of using an ampersand in a domain name. But over time and with experience, writers learned ways to include new technologies into the plots, and even exploit new opportunities for suspense that hadn’t been possible before. The style of plotting changed because the world played the role of von Trier to our communal Leth. Tell the same story again, but the characters can always update each other instantly no matter how far apart they are.\nThese examples of adaptation and remaking are important because they throw a light on the relationship between obstacles and creativity. They let us see the same project done under different conditions. But sometimes limitations don’t change. Sometimes—maybe often, maybe always—there are constraints that never go away.\nThe best poetry reading I ever went to was by a friend and former professor of mine who stuttered. I knew that was the case because I knew him, but the ways he’d found to incorporate the idiosyncrasies of his body into the delivery of his poems worked beautifully. And, because the other poets at that same reading weren’t dealing with that issue, they didn’t sound like him. He stood out.\nI remember seeing a dance recital by a man on crutches and recognizing the way he’d incorporated his particular body into the movements. But the truth is, if it hadn’t been for the cue of the crutches, I wouldn’t have attributed his style to anything in particular other than his own identity as a dancer. I’ve seen other performers whose works were probably shaped by other things—a tricky knee or a particularly long waist or an old injury that healed poorly—that I couldn’t recognize the origins of. I’ve heard poets read without knowing that they tended to avoid certain words or rhythms that they had a hard time pronouncing. I’ve seen paintings discussed as satire or social commentary or explorations of material that might have suddenly become much more explicable in a context of mental illness or the paints and dyes available to people in abject poverty.\nIf there were a single, objective standard for excellence—and I don’t believe there is, but if—then those who excelled would also converge. The best writers would be the ones who adhered to the rules most closely: who never used passive voice, who always showed and never told, who didn’t include any unnecessary words. They would be the same voice, and so they’d be voiceless. Thankfully, the world doesn’t work like that.\nWe are our bodies, and we are our minds, and we are even (to some degree) our circumstances. None of us work quite according to spec. We’re all flawed, and the best artists among us find ways to pause the way Jørgen Leth did, smile, and incorporate the work-arounds into what we do. So do the best non-artists. And everyone, really.\nWhether our styles are pleasing or challenging or annoying, whether we’re writing or dancing or working in an office, our strengths and talents make us competent. Our flaws and failings—and the ways we’ve invented to work despite them—make us interesting.\nGod save us from one without the other.\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest."}