{"fingerprint": "agFCMf35cirN7YuZSqd3dJPFWII=", "sitename": "Clarkesworld Magazine", "title": "Another Word: Love Song for a Saturday Morning by Alethea Kontis", "author": "Alethea Kontis", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/another_word_10_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Love Song for a Saturday Morning by Alethea Kontis", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Another Word: Love Song for a Saturday Morning\n Saturday morning cartoons began sometime in the 1960s and ran until the fall of 2014. For over fifty years, from roughly 8 AMuntil noon, children in the United States sat in observance of this weekly ritual with an anticipation second only to Christmas morning.\n Being one of these children myself, I speak from experience.\n Every week, by appointment, we frolicked in commercially sponsored Elysian Fields. We witnessed at least six impossible things before the sugar-filled breakfast we had prepared with little or no help from our parents. Saturday morning was Our World, Our Time, and we each stood proudly as noble defenders of this magical domain.\n Even now, the League of Saturday Morning will defend their favorite shows with equal vigor. Just ask them. We are incredibly passionate when it comes to this little Technicolor corner of our history.\n Saturday morning cartoons originated with both strip and rack comics, movies, and toys. Some introduced us to role-playing games (hello, Dungeons and Dragons). Some were unique to the small screen (thank you, Warner Bros. and Hanna-Barbera). Some were even based on candy (who would have thought the adventures of The Gummi Bears would be so much fun?).\n Unfortunately, the passing of those halcyon days was inevitable. The FCC began requiring a minimum amount of educational programs on broadcast networks. They forced limits on commercial content, killing advertising revenue. DVRs, subscription services, and the internet provided children with whatever they needed whenever they wanted.\n And we—those of us who are “adults” now—accepted it. We grew up and moved on. We sold that house to developers who bulldozed it and made a strip mall. We knew we could not bring it back because—in today’s technological climate—it would not have the same effect. We gave birth to a gaggle of humans striving for convenience and instant gratification. The modern world is their candy store.\n But I believe our children, and future generations, will be the worse off for its loss. Yes, it might be argued that those hours spent in front of the boob tube were already washing our brains clean of inspiration and original thought, but I choose to argue the opposite side. Not only did Saturday morning cartoons open our minds to possibilities of the impossible, but their scarcity also forced us to appreciate them more.\n Studies have shown that the scarcity of certain items increases their desirability. It’s a fairly basic psychological tenet that has become the basis for hundreds of love songs: we want what we can’t have. Flooding the market with webcomics and animation your child can create on your home computer are some of the main reasons those of us with spending money are reluctant to pay $4.50 for rack comics anymore. Every other blockbuster movie or high-budget television show is about superheroes. Impossibility has become commonplace.\n Back when impossibility was the realm of Saturday morning, children were forced to use the rest of the week to dream up their own adventures, to challenge themselves beyond the limits of their paltry human existence.\n There is a certain Zen inherent in a scheduled lifestyle—part of the freedom of childhood. There is considerably less stress when one knows what to expect in one’s life. (Those of us who choose a freelance lifestyle are just Hatters at the Tea Party.) In those early days, children had no choice but to get up and move on when programming ended. With the advent of VHS, children taught themselves scheduling and electronics in order to keep from missing the shows they loved that ran simultaneously on different networks, extending that morning ritual for a few more precious hours.\n These days, the programming never stops. The difficult task of prying children away from small screens in the 1980s has become an almost Herculean undertaking. And the quality of said programming choices leaves much to be desired.\n “Saturday morning cartoons had a heart and charm to them I feel modern cartoons lack,” says Patrick Kramer, a stage actor in the local Nashville theater scene. “Creators now strive so hard to be snarky and weird for weird's sake and I think it's a detriment to the art form.”\n Being subjected to these cartoons on a regular basis certainly opened our young minds to realms of endless possibilities. If Duck Tales featured a backwards world full of rubber streets and stone tires and dinosaurs, we happily suspended our disbelief and let the story play out. So many great things have already been inspired by comics: Donald Duck himself has been given credit for raising sunken ships, and the opening sequence to Raiders of the Lost Ark. Inventors all over the world have attempted emulating ACME rocket skates, helicopter hats, and slingshots into space.\n Coincidentally, it was an episode of Duck Tales that inspired author Eugene Myers to consider creating his own custom Saturday morning for his son. “The nephews were trying to trick Scrooge into thinking it was Saturday instead of Friday so they could get their allowance early, and part of their ruse included playing a VHS tape of Saturday morning cartoons. I figure I have so many DVDs of cartoons I grew up with...that I could compile shows into several hours of programming.”\n The children of today may have much healthier eating habits, but will they be able to think outside the cereal box? How comfortable will they be imagining the impossible? Will the lack of Saturday morning cartoons stifle their dreams? All that clever, colorful nonsense is still out there. Only time will tell us if the weekly ritual was part of the revelation.\n I sometimes imagine a post-apocalyptic dystopia in which the death of civilization can be traced back to the demise of Saturday morning cartoons. It is a dark and scary place. But if I wasn’t a member of the League of Saturday Morning, perhaps I wouldn’t have imagined it in the first place.\n Alethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie."}