{"fingerprint": "iScelNeJUaapfc/vrk+Eo/geMKI=", "sitename": "Clarkesworld Magazine", "title": "Anthologists Discuss Their Craft by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/anthologists_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Anthologists Discuss Their Craft by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAnthologists Discuss Their Craft\nEditing anthologies is an unsung art. An anthologist balances story selection, story editing, story arrangement, and central concept (not to mention a variety of clerical and financial concerns).\nThere are many individual pieces involved in the process, requiring practicality as well as intuition. The anthologist, as Jeff VanderMeer says below, must be “ambitious and grounded.”\nIn the end, a gathering of stories can be simply a gathering of stories or it can be something much more than the sum of its parts.\nThis “something more” is accomplished through the choices the anthologist makes in terms of, among other things, pacing, variety, and, as Jonathan Strahan points out below, honesty.\nBelow, six of the most accomplished and innovative editors working in the fantasy, science fiction and horror fields discuss the art of editing anthologies.\nThe Anthologists\nJohn Joseph Adams is currently making his final story selections for his fourth themed anthology, Federations, which is due out this spring. Adams followed his definitive post-apocalyptic reprint anthology, Wastelands: Stories of the Apocalypse, with the expansive (and no less definitive) zombie reprint The Living Dead. In between these, he continued to work as the assistant editor at The Magazine of Fantasy & Science Fiction and he edited the original anthology Seeds of Change.\nEllen Datlow is perhaps best known as the co-editor (originally with Terri Windling and then with Kelly Link & Gavin J. Grant) of twenty-one annual The Year’s Best Fantasy and Horror anthologies. She is the former fiction editor of Omni magazine and former editor of SCIFICTION. Alone and with co-editors, Datlow has won or shared numerous awards for her anthologies and for her editing, and was named recipient of the 2007 Karl Edward Wagner Award, given at the British Fantasy Convention for “outstanding contribution to the genre.” Her most recent anthologies are The Del Rey Book of Science Fiction and Fantasy and Poe: 19 New Tales Inspired by Edgar Allan Poe. Forthcoming in mid-2009 are The Nebula Awards Showcase: 2009 and Troll’s Eye View (the latter with Windling).\nJames Lowder won two Origins Awards in 2008, one for Hobby Games: The 100 Best (non-fiction) and one for Astounding Hero Tales (fiction). A few months later, Paizo Publishing released Worlds of Their Own, an anthology of stories told in creator-owned settings written by authors known for their shared world fiction. Lowder has edited anthologies of superhero, Arthurian, and Forgotten Realms fiction. His zombie anthologies for Eden Studios (The Book of All Flesh, The Book of More Flesh, and The Book of Final Flesh) are deserving of every bit of their cult status.\nJonathan Strahan has edited more than a dozen anthologies. His past titles include annual volumes of The Year’s Best Australian Science Fiction and Fantasy, Best Short Novels, The Best Science Fiction and Fantasy of the Year, The Starry Rift, and perhaps most gloriously, the recent The New Space Opera (co-edited with Gardner Dozois). His forthcoming and in-progress lists feature titles such as Godlike Machines, Conquering Swords: New Sword and Sorcery, Dreamtime: Legends of Australian Fantasy, and Life on Mars: Tales from the New Frontier.\nAs the fiction editor of the legendary Weird Tales magazine, Ann VanderMeer selects and edits some of the strangest and most brilliant fiction being published today. Under her leadership, the fiction content of the magazine is both very much in the tradition of the old weird and perpetually re-defining the new weird. Her anthologies Steampunk and The New Weird (both co-edited with Jeff VanderMeer) help define two sub-genres without narrowing their scope; her Best American Fantasy, though a “year’s best” retrospective, features stories that are innovative and forward-looking. Like Datlow before her, VanderMeer has shaped a new generation of fiction writers. She is currently working on The Kosher Guide to Imaginary Animals.\nMultiple World Fantasy Award winner, Jeff VanderMeer is best known for his fiction set in imaginary world of Ambergris. Works such as City of Saints and Madmen and Shriek: An Afterword will be followed soon by Finch, a noir take on Ambergris. In addition to the anthologies mentioned above, VanderMeer has edited a long list of others, including Fast Ships, Black Sails (co-edited with Ann VanderMeer), Mapping the Beast: the Best of Leviathan, and The Thackery T. Lambshead Pocket Guide to Eccentric and Discredited Diseases (co-edited with Mark Roberts).\nWhat is at the heart of a great anthology?\nAnn VanderMeer: Great stories. If you don’t have that, nothing else matters.\nJeff VanderMeer: That, and the passion of the editors. If you don’t leave anything out on the field, so to speak, it tends to show in the anthology.\nJonathan Strahan: Any great anthology has two things at its heart: a great idea and a bunch of great stories. The hardest thing to do is come up with an idea that is robust enough to support an interesting, varied anthology. If you have a great idea then you either should be able to find a bunch of great reprints, or [the idea] should spark some great new stories.\nAnd for an anthology to be “great,” you need at least three really good stories. Doesn’t matter if they’re by first timers or big names or whomever: you need three top-notch stories. Without that the book won’t stand up.\nEllen Datlow : The writers primarily, but also the editing that goes into making the stories as great as they should/can be.\nJohn Joseph Adams: [In general], I think, a table of contents that demonstrates the range of what a sub-genre or theme is capable of. In the case of a reprint anthology, I think it’s also important to include a large number of stories from disparate sources so that any one reader is unlikely to have read them all and will find many new discoveries, even if they voraciously read short fiction.\nI hadn’t thought of it before, but as I formulated my answer to your question, I realized that what I’m saying, really, is that diversity is at the heart of a great anthology.\nJames Lowder: Terrific stories showcased in the service of a unifying idea—a theme or concept or mood that the anthologist illuminates through the story selection, as well as the book’s structure and pacing.\nWhere does an anthology start for you, and how does it develop?\nAnn VanderMeer: An anthology can start one of two ways for us. First, when a publisher asks us to edit a particular anthology. And second, when we have an idea for an anthology. As soon as those seeds are planted the ideas flow. Jeff and I will then start brainstorming back and forth about the main goals of the project, which writers would be a good match for the project, etc. We make lots and lots of lists.\nJeff VanderMeer: We go through a long discovery process first, though. To see if it’s a project we really want to do. For example, originally we planned to turn down Tachyon’s offer to edit a New Weird anthology. Then when we did research and debated all of the pros and cons, we found there was a compelling case for doing the anthology. And we’ve been rewarded in that conclusion both from the general critical response and by the fact that it has sold well.\nJonathan Strahan: Usually an anthology starts with an idea, a spark of some kind. I could be reading a story and think “this would make a great starting point for a book,” or have a conversation about some aspect of the field and think what was being discussed could make a good book. It may just simply be me wanting to work in an area that I particularly love or am interested in at that moment.\nOnce I have the idea, I write a scoping document. It’s usually an 800 to 1,000 word description of the book, perhaps listing stories that I know of that would fit into it, or listing people I think would make interesting contributors. It’s really a personal working tool that lets me work out if the book is viable, if it would be interesting and so on. If I can’t see the finished book in my mind’s eye at this stage, I scrap it. A lot of ideas die at this stage, which is probably a good thing.\nIf the scoping document looks good, and if I have a title in mind, I’ll use it as the basis for a written proposal. There are a lot of variations from here, but if we’re talking about an invitation-only anthology it’s at this point that I send out invitations, see if people would be interested being involved in the book should it happen. I then complete the proposal and send it to my agent. We knock it around a bit and then send it out to publishers.\nIf the book sells, I then confirm with all the likely contributors that the book is happening and that they want to be involved. I like to give writers as close to a year as I can to get stories done. This often isn’t enough, but seems a pretty reasonable amount of time, and gives me some flexibility. I then wait. Stories come in, are accepted or not, changed or not and generally go back and forth as the deadline approaches.\nI’d say about three months before the deadline I look at what I have for the book and review who still has stories to do. I’ll often write to people and see what sort of story they’re doing, to make sure the book is as varied as possible.\nOnce the stories are in, I line edit them, write the introduction, and then do the story notes. I then spend a week or so playing with running orders and so on, complete the manuscript and email it in. There are things that come after that, but that’s basically the process.\nEllen Datlow: First of all, there is a big difference between all-reprint anthologies and original anthologies for which the stories are requested. And there’s also a difference in theme anthologies vs. non-theme anthologies.\nFor a theme anthology of original stories I always begin with the theme. Next it’s the writers. I think of the writers I’d like to have in the anthology (leaving some room for serendipity, i.e. the unexpected submission received through word of mouth).\nFor a non-theme anthology it starts and ends with the writers. I try to acquire a good variety of writers and stories from the get-go by telling the writers that they can write whatever they want—but, as I say in the next paragraph, the closer the anthology comes to being done, the tighter the parameters.\nThen I wait for the submissions, encouraging the writers periodically and asking how their stories are coming along. I generally get in most of the stories way before deadline, which is good. I pay as much as I can from the advance on signature of the contract, so the early birds don’t have to wait until I hand in the book to get paid. Also, there’s more flexibility in the type of story I’ll buy in the beginning. As the anthology begins shaping up I’m much more careful of repetition in point of view and sub-themes.\nA couple of months before my deadline I start nagging, and I also may alert the writers who haven’t yet submitted their stories that I don’t want any more of a particular type of story.\nAlso, as I buy stories I ask for an afterword (if that’s the type of anthology I’m editing) and a bio.\nA month or so before I hand in the finished manuscripts I do the final line edit of each story—although for most of the stories I’ve already worked with the author on any substantive editing before I’ve committed to buying the story. But every story gets a final and thorough line edit towards the end of the process.\nJohn Joseph Adams: Since every anthology I’ve done so far has been a theme anthology, it’s started with the theme.\nMy first anthology, Wastelands, is post-apocalyptic, and I chose that topic simply because it’s a favorite sub-genre of mine, and also having done some research on the subject for an article, I discovered a distinct lack of anthologies on the subject, and sensed a resurgence of interest in the sub-genre from both writers and readers.\nEach of my projects after that grew out of discussions with the publishers of the books. After being thrilled with the way Wastelands turned out, Night Shade approached me with the idea of doing a zombie anthology. For Seeds of Change, Prime approached me first with just the idea of doing an original anthology, and then we batted around some ideas until we settled on a theme.\nJames Lowder: I start with the anthology’s controlling concept. From there, I’ll usually sound out a couple of potential authors on their interest and then talk with a publisher. Sometimes a publisher will love the idea as first pitched, sometimes I’ll have to tweak the project a little so that it fits the publisher’s line or budget or schedule. If too much tweaking is required, then it’s not a good fit and I take the pitch elsewhere. Once the anthology is underway, it’s a matter of being flexible enough to incorporate the unexpected great ideas or stories that come along, but disciplined enough to keep the overall project true to the original concept.\nHow do you select stories?\nAnn VanderMeer: Our brainstorming sessions point us in the direction and then we read, and we read a lot! We’ll both read different things, then weed them out and come up with a finalist list. From that list we re-read all the fiction and make a spreadsheet of the possibles. Then we typically re-read again and see how the stories work with each other. From this process we select the stories.\nJeff VanderMeer: I am more of an initial skimmer. I usually figure out I’m going to like something or not by a very quick read. Ann is more systematic and thus her initial readings are more accurate. At the same time, I sometimes bring in something that we wouldn’t otherwise have thought about considering.\nEllen Datlow: For original anthologies I request stories from at least a third over the number I need because not everyone I approach will submit her story in the time required and at least a few of the stories won’t be right for the anthology and will be rejected. I pick the stories that I love and that fit within the broad boundaries of the theme. Towards the end of the process, I try to make sure that I’ve got a variety of types of stories.\nFor a reprint anthology, I make lists of stories that I’ve published and love and those that have made an impression on me during my long and wide ranging reading experience. Then I reread everything (sometimes multiple times) and decide what goes in, balancing all the way.\nJonathan Strahan: I guess the core process is the same, regardless of whether you’re talking original or reprint stories. I sit down with the story and I read it. I try to be as fresh as possible and have as few preconceptions as I can. My intent is to give it as fair a reading as I can. I’ll scribble any thoughts I have about it on the last page of the manuscript (or make a note if it’s in a book). I’ll then set it aside for at least a day, before re-reading it. If it knocked me out both times, and it fits the project I’m doing, I’ll buy it. If I’m lukewarm on second reading, I’ll set it aside for a week or two and then try again. If I don’t love it at that point I’ll either let it go or discuss it with the author.\nThings are a little different for the year’s best. I read throughout the year, usually stopping in mid-to-late October. During the year I look at every story I can, making notes on any that I think are possible contenders for the book. I’ll note what genre it is, something about theme, and how long it is. As the deadline approaches I start re-reading the stories I thought were terrific. If they stand up on re-reading, I then enter them into a spreadsheet I have. Then I juggle word counts, genre and so on to come up with a balanced book.\nJohn Joseph Adams: You have to [solicit stories from well known authors], if you want anyone to buy your anthology. You don’t have to only solicit stories from known authors, of course—you can have an open reading period during which anyone may submit a story. But in general, it really behooves the anthologist to have as many stories to consider as possible, so it seems to me that keeping a book invite-only is a dangerous proposition.\nThere can be trouble if you have a very, very specific theme; for instance, if you’re editing an anthology of stories about monkeys discovering rocketry and leaving the Earth to settle other worlds, well, you almost have to keep the pool of writers writing for you somewhat limited, because any story that doesn’t make it into the book would really have nowhere else it would fit.\nBut anyway—for my first original anthology, Seeds of Change, I kept it invite-only by necessity; because I also work at Fantasy and Science Fiction, Gordon [Van Gelder] felt like the theme of the anthology was so broad that having an open reading period would kind of be a conflict of interest with my duties at the magazine. For Federations, however, [I did] an open reading period.\nAs for how I select stories, I first think about which stories first come to mind when I think about a particular theme and I jot those down. Then I think about authors that I like and/or big names that seem likely to have written something on the theme, then I browse through my anthologies and collections and do research online to see if I can find anything that might fit.\nAs I find likely candidates I put them all into a spreadsheet to keep track of them, and as I read them, I give them a rating on a scale of 1-10 to help me remember what my initial reaction to a story was (which might change when I go back to read it again, so it’s important to know what that first reaction was). Actually, the scale is more like a 6-10 scale, because anything that I consider less than a 6, I’m not going to include it in the book.\nI’ll also keep a separate column to numerically note the story’s relevance to the theme; stories that are iffy on the relevance scale are often among those easiest to cut, no matter how good they are. Then, once I’m ready to start finalizing the table of contents, I just think about balance and diversity and theme, and try to conceptualize what group of stories would work best together in between two covers.\nJames Lowder: I try to find the best possible stories that display a variety of approaches to the anthology’s theme or concept, working from the story pool available. How large that pool is, and who it might include, will depend upon the project and its budget. For the anthology Worlds of Their Own, which reprinted creator-owned works by writers known for their shared world novels, I had a relatively limited pool of stories compared to, say, the All Flesh zombie anthologies I put together for Eden Studios. The zombie anthologies were “open call,” meaning I received literally hundreds of original submissions. In all cases, I read through many more stories than I eventually use and search for the ones that are the best written and most evocative when placed in a sequence.\nI particularly enjoy working on open call anthologies because of the surprise factor. I always get a few really startling, inspired tales, things I never would have expected. These often come from writers I don’t know or know only a little. Open call projects, or those with a significant number of open slots, are also great places to give fledgling authors a break. About a third of the stories in each of the All Flesh books were first professional sales. It’s a lot of work reading through all the submissions you get from an open call, but the hard work usually pays off.\nHow do you determine the order of stories?\nAnn VanderMeer: This is a very important part of the process. We are very careful about how the stories are ordered because we know that the typical reader will read the anthology from beginning to end. We make sure that stories flow naturally from one to the next. We ensure that stories back-to-back are not too similar to each other. Since some of our anthologies have a particular, narrow bent, this is especially important. We don’t want a “sameness” to infect the book. Each story and its placement must have a meaning and purpose for the project.\nJeff VanderMeer: In the New Weird anthology, we went one step further. We had the challenge of creating an anthology useful to both general readers and academics. So we sectioned it off, with two sections more of interest to academics, two sections more of interest to general readers. The progression went: introduction, then the stories that influenced New Weird, then the actual New Weird stories, then the discussion that created the term, and then an experimental section with writers trying their hand at a “New Weird” type of writing.\nEllen Datlow: I try to pick a strong story to go first and the strongest story to go either last or next to last. Then I try to make sure that there’s a good mix of lengths, tone, voice, character, point of view, etc.\nJohn Joseph Adams: The first thing I do is write all of the story titles and bylines on a series of index cards, then lay them out on my desk. By the time I’ve finalized the TOC, I usually have a good idea of what I might want to lead with and end with, but other than that I probably don’t have much idea what will go where.\nI like to lead with one of the strongest stories in the anthology, and if possible, a very strong story which is also by one of the bigger names in the book. I also close with one of the strongest, and then try to put another of the strongest somewhere in the middle, kind of like the support poles of a tent. In between the poles, I try to focus on story flow: sometimes you want to avoid two similar stories, but other times they might complement each other, or you might want to place a lighter piece immediately following a story with a downbeat ending.\nSo, once I get the index cards laid out, I look for my tent-pole stories, then start shuffling things around until I get something that feels right. It’s hard to explain what makes something feel right, but it’s something I think you get a feel for after having read so many hundreds of anthologies over the years. Ultimately, I’m not sure how much it matters to the casual reader, but I think a well-structured book will be more satisfying to the reader. Of course, that’s assuming the stories are read in the order the anthologist chooses, of which there is no guarantee.\nJames Lowder: I pace the stories with an eye toward tone, topic, and theme, so that readers starting the book on page one and reading the tales in sequence find the experience rewarding. The first story sets the overall mood and the last story somehow closes the book. I also try to structure an anthology so that the story juxtapositions suggest additional meanings, along the lines of the Soviet montage theory of film editing. But the ordering process is dynamic, since adding one new tale to the mix might require the entire table of contents to be rearranged. Sometimes the order needs to be changed to resolve formal or mechanical concerns—two stories close together that are too similar in setting or narrative voice, for example. Other times editorial intuition kicks in. A story just doesn’t read as strongly when placed before or after another tale, so you move it. I tend to shift around the story order several times during the editing process, even after I have all the works selected.\nJonathan Strahan: A lot of this is intuitive, to be honest. I used to follow an old approach: open with your strongest story, second strongest goes last, third strongest in the middle, then shuffle from there. I’ve stopped doing that, though, because I’m not sure it makes for a great reading experience. Now what I try to do is find the story that is the best story in the book which is also the most accessible and the most typical of the theme of the book. I think it’s really important to open with a story that is really accessible and entertaining, and which sets the readers expectations (i.e. if you’re editing an anthology of dragon stories make sure you open with a story that has a big dragon in it!). I will usually then put the longest story in the book towards the end, either last or second last. I’ll put the second best story in the middle, and then try to balance length and theme from there. I want the book to have a rhythm: vary long and short stories, make sure you don’t get three vampire goblin stories in a row, that kind of thing.\nHow has your understanding of the process changed since your first anthology?\nAnn VanderMeer: Not really a change so much as a refinement of our process. I believe that our process works very well. Because our talents compliment each other, we work very well as a team.\nJeff VanderMeer: I agree. I’d just say that as we’ve worked closely, we’ve kind of been able to channel each other’s strengths. I’ve become more patient and thoughtful, for example.\nJames Lowder: By studying successful anthologies such as Ellen Datlow ’s Blood is Not Enough or Skipp and Spector’s Book of the Dead, even single author collections such as Ellison’s brilliant Deathbird Stories, I’ve become more conscious of the art of pacing and the editor’s ability to make an anthology more than just a simple collation of tales. And each new anthology I edit or simply read teaches me something new.\nDatlow: It hasn’t much.\nJonathan Strahan: Enormously. I know I have a much better understanding of what I’m doing. I now know what it takes to edit a story, sequence a book and so on. That said, I’ve only edited five original anthologies at this point. I’m still learning all the time about stories, about writers, about assembling books. I’ve learned an enormous amount from editing The Starry Rift and from editing the Eclipse series. I don’t think I’ll ever stop learning, truthfully, because the next book can always be better than this one.\nAny funny anecdotes from any of the anthologies you’ve done?\nAnn VanderMeer: I’ll let Jeff tell you about the time Clive Barker called the house. I had just had surgery that day for my shoulder and was pretty much out of it, on pain medication. The phone rings and Jeff answers . . .\nJeff VanderMeer: . . . and this raspy voice comes on and says, “Clive Barker here. It’s opinions not onions.” And I’m like, “What?” “Opinions, not onions.”\nAnd it turned out there’s a recurring typo in the story of his in our New Weird anthology, where “last breath and opinions” is reproduced as “last breath and onions.” He’s been chasing it down for 18 years. The thing is, in the context of “breath,” “onions” makes a weird kind of alternate sense. Anyway, he was very complimentary of the anthology, and we told him we’d correct the error in foreign editions and any reprint of the US one.\nJames Lowder: When I was working on the first of the zombie anthologies for Eden Studios, I received a flood of submissions. As the deadline approached, I was getting hefty stacks of envelopes with full, completed manuscripts every day. One afternoon, I was mowing my lawn when the postal carrier came through. He knows that I work from home on fantasy and horror books, and that I get a lot of work-related material in the mail.\nWell, on this particular afternoon he got out of his truck to hand me the stack of submissions, which was too large for my mailbox, and asked, after a rather uncomfortable pause, “Have you changed the sorts of publishing projects you’re working on?” I was baffled by the question—until I looked at the top envelope, addressed to The Book of All Flesh. No, I explained, the title didn’t mean I was now editing porn. It was a collection of zombie stories (which, I suppose, is just as bad in some people’s minds).\nDo you have an anthologist’s credo?\nAnn VanderMeer: I don’t know if this is an anthologist’s credo, but we approach each project with the philosophy to make it the best book we can produce. We also are strongly committed to searching far and wide to make this happen. And we believe in mixing it up, having a lot of diversity in each project we do. Each book is unique unto itself.\nJeff VanderMeer: I want my reach to exceed my grasp, so to speak. There’s no point in doing something by half-measures. This is why in something like the fake disease guide I co-edited awhile back you’ll find a reproduction of a fake page from a supposed related book by Borges, translated into the “original” Spanish. When Ann and I edit together, we work well because the credo is to be both ambitious and grounded. I can go off into left field, and Ann pulls me back, because Ann is the best reader I know, and thus the best general editor.\nEllen Datlow: To be strong and reject stories that don’t work, even if I really want that author in my book.\nIf I’m not blown over by a submission the first time I read it, but am not sure I want to reject it, I’ll wait a week or two and reread it. Usually within the first two pages of the second read I’ll know if I want to buy it.\nJohn Joseph Adams: Well, I’ve never written one down before, but perhaps it would be: Publish the story, not the author. When selecting stories the anthologist should chose to include a story based on the strength of the story itself, and not who the author is. It’s an easy trap to fall into, to cram in stories by your favorite authors into an anthology, or to cram in stories by bestsellers or award-winners, because, after all, the anthologist does have some obligation to the publisher to include a sufficient number of brand name authors in order to help market the anthology.\nLuckily, bestsellers and award-winners are often damn good writers (thus explaining that whole success thing they’ve got going on), so it doesn’t often present a huge issue in terms of quality—it’s more of a problem when it comes to fitting the theme. I often see readers and reviewers complaining when they read an anthology that doesn’t hew closely enough to the theme, so I try to always keep that in the forefront of my mind when making final selections. I may not always succeed in that for every reader, but that’s what I strive to do.\nJames Lowder: I have some general beliefs about editing that impact how I select original stories for anthologies. I feel very strongly that the editor’s primary role is to help the writer clarify and strengthen his or her creative vision and the execution of that vision. Sometimes editors either stand too far back, letting the writer flounder, or get too close, leaving obvious fingerprints on the work by imposing themselves and their own writing style. Editing should be a rigorous process, even contentious. Writers should always know the editor respects them and their work, but I expect to be pretty interactive with my writers. Really, that’s no more than I hope editors will do for me, and my writing, when I’m on the other side of the blotter.\nEditing anthologies is much more complicated than novels or individual stories, since there are several writers involved. The goals and integrity of each story need to be taken into account, but the book as a whole should reflect the anthologist’s vision, too. The more creative people participating in a project, the greater the potential for chaos. If I have an anthology-specific credo, it’s that chaos is inevitable when working on an anthology, but chaos can be a source of vitality for the book.\nJonathan Strahan: I think three or four years ago I would have struggled to answer this and probably would have said something like “look for great stories.” In the last year or so, though, I have developed a credo. It’s pretty simple: be honest.\nUltimately you’re acting as an agent for the reader so you need to be as straightforward and as honest with your reader as you can. Title a book clearly. Write an introduction that actually describes the book you’ve edited. Buy stories that fit the title and the idea. Encourage the publisher, as much as you can, to put a cover on it that fits (something I’ve actually been very lucky with – most of my publishers have been terrific and very supportive). If you do that, then a reader can pick up a book and feel they’re going to get what they expect.\nFor example, when editing The New Space Opera Gardner [Dozois] and I chose a title that was pretty unambiguous, filled the book as best we could with space opera stories, and then our publisher put a big rocket ship on the cover. Readers could be fairly confident that, if they bought the book, they’d get a bunch of new space opera stories, probably with spaceships in them. I’m currently co-editing an anthology of swords and sorcery stories with Lou Anders. It’s tentatively titled Conquering Swords. The stories we’ve bought so far are all definitively “swords and sorcery.” The title will reflect that, and I’m sure the cover will, too.\nSo, yeah, if I have a credo right now it’s: be honest. You can still get it wrong, but at least you and everyone else knows what you’re trying to do.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}