{"fingerprint": "/9LysnE77KKmKylaQXWk6oxER0E=", "sitename": "Clarkesworld Magazine", "title": "Checkerboard Planet by Eleanor Arnason", "author": "Eleanor Arnason", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/arnason_12_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Checkerboard Planet by Eleanor Arnason", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11860 words, novelette\n Checkerboard Planet\n The system was a type G yellow dwarf with six planets. Four of the planets were gas giants, the innermost so close to its primary that it skimmed the stellar atmosphere. Dark red in color, it had neither moons nor rings. It sped around its sun, inflated by heat to an impressive size and boiling with blood-red storms.\n The other giants—banded in pale, icy, elegant shades of blue and green—orbited the star at a much greater distance. All had rings and moons. The rings were broad and splendid, the moons numerous and varied. Lydia Duluth saw nothing to write home about. The universe was full of worlds like these.\n The system’s last two planets orbited in the wide space between the inner giant and its pale, outer companions. Both were small and stony. One, almost airless, had a yellow surface pocked with craters. The other was white and blue.\n “Atmosphere and water,” said Lydia’s companion. The two of them stood in an observation room in the system’s stargate station, looking at virtual windows that showed the star and its planets. One window was turned off. Lydia could see herself and Mantis reflected in its dark surface: a human woman beside a tall, angular AI that stood on four thin, metal legs. Mantis’ two long arms were folded against its chest; its triangular head was studded with sensors, most of them retracted.\n “The planet is almost exactly one A.U. from its star,” Mantis said. “It has the right amount of oxygen and water, the right temperature, everything necessary to make an Earth-normal world.”\n “There are plenty of those,” Lydia pointed out.\n “Not like this one.” The AI unfolded an arm and tapped the window showing the blue and white planet. The planet’s clouds vanished, and Lydia could see the surface. It looked to be half water. Two continents were visible, one in the northern hemisphere, a rough diamond that touched the pole, and the other in the southern hemisphere, sprawling like a serpent below the equator. The south pole was open water, sky-blue and spotted with white islands. Both the continents were covered by checkerboard patterns.\n “What?” asked Lydia.\n “Vegetation,” said Mantis.\n The squares must be huge to be visible at this distance. They alternated colors. One set of squares had warm hues: red, orange, yellow, several shades of tan. The alternating set was cool: blue-gray, blue-green, a muted purple, a silvery lavender. In every case, the color was uniform within its square.\n More squares floated in the ocean. They were smaller than the ones on land. Many were singletons, floating alone. But a number had formed partial checkerboards. Mouth open, Lydia regarded a group in the southern ocean: a long line of alternating orange and blue squares. “This cannot be natural,” she said finally.\n “No, although it’s done entirely with organisms. Each square is a separate bio-system, which does not intrude on its neighbors in any way that can be seen from here. Each square carefully maintains straight edges. The methods used vary. Some squares rely on organisms which are sensitive to the planet’s magnetic field. Other squares rely on heliotropic plants. Since the planet has no axial tilt, the sun’s position does not change during the course of a year. The locating system is combined with genetic coding which tells the border organisms to precede due north for ‘x’ distance, then make a 90 degree turn to the left or right.\n “One of our slower-than-light explorers found the planet. Like all such explorers, it contained a stargate large enough to transmit objects as well as information. Once it sent its initial report, we responded by sending additional research equipment. The STL explorers are often less than state-of-the-art, since they have been traveling for centuries or millennia, with only the most necessary upgrades.\n “We examined everything, trying to determine who did this and why.”\n “Have you succeeded?” Lydia asked.\n “No. It can’t be our long-vanished creators, the Master Builders. Their passion was the making of machines. If they had done this, we would have found nano-machinery pruning the edges of the squares. We haven’t.\n “After years of study, we gave up and opened the planet. We had discovered no evidence that anything intelligent still lived here. Nothing needed our protection; and we hoped that settlers might discover the planet’s secrets, as we had not.\n “You humans are the most numerous and adventurous of the intelligent life forms we have found thus far. It should come as no surprise when I tell you a human government claimed this planet, and one of your human corporations, Bio-Innovation bought an option to explore.”\n “I wouldn’t call Bio-In my corporation,” Lydia said.\n “No, of course not,” Mantis said. “You work for Stellar Harvest.”\n The famous interstellar holoplay company. Her job was to find exotic locations for Stellar Harvest’s action dramas; and this planet was certainly exotic. The patterns covering the continents, muted and varied, reminded her of sweaters she had owned. The ocean squares—they must be rafts of vegetation—looked less perfect, as if knit by an apprentice. Several had ragged edges, and none was exactly aligned north, south, east, or west. Clearly the makers had not found a way to control ocean currents or to compensate for them.\n “Why don’t I know about this place?” Lydia asked.\n “Bio-Innovation has kept quiet. They’re afraid that some human agency will declare the planet unique and off-limits.”\n “What government claimed the planet?”\n “Nova Terra,” said Mantis.\n That explained a lot. Nova Terra was notoriously friendly to business. Under normal circumstances, no one in their government was going to interfere with the activities of a major corporation. But a planet like this one was not a normal circumstance; and Nova Terra’s populace had been restless lately, stirred up by a series of environmental scandals and a charismatic new political leader, Winona Saskatoon of the Blue Action Party. Lydia could imagine what Winona would make of a world like this one in the hands of Bio-In.\n “Why am I here?” she asked.\n “We are incapable of emotion,” Mantis said. “All our decisions are based on logic and reason. However, if we could feel irritation, we would find Bio-In’s behavior irritating. They are looting the planet’s genetic wealth, instead of undertaking a systematic study of a very interesting ecology; and they are looting in secret, instead of bringing in a multitude of scholars and scientists to study and argue. Many hands make light work, as you humans say; and many minds make thinking easier.” Mantis paused. Its head was aimed at the planet’s image, several sensors extended. “We do not like to intervene. Our self-appointed task is to study intelligent life, not change it.”\n “You’re intervening by bringing me here,” said Lydia. “Aren’t you?”\n “We are drawing your attention to the planet. Nothing more. We suspect the people who did this may be the same beings who transformed the planet Lifeline. You told us a planet such as Lifeline, so obviously artificial, might be a signal. We’d like your opinion of this world. Is it another signal? If so, what is it saying? What kind of response does it want? And we thought Stellar Harvest might be interested in the planet.”\n “You want to break Bio-In’s hold on the planet,” said Lydia.\n Mantis was silent for a moment. “We think it would be better for you to go down to the planet in disguise. We have created a new identity for you. You are L. D. Fargo, a sound-and-light technician employed by Bio-In. You have come to record images for the home office. The identity will hold up, if the people here check.”\n “Have you managed to infiltrate the Bio-In computer system?” Lydia asked.\n “Any message to the home office has to go through this stargate station. Of course such messages are in corporate code. The code can be broken, given enough computational power, which the stargate station has when it isn’t otherwise occupied.”\n Moving things through folds or tunnels or glitches in space. All these metaphors were inaccurate, the AIs said. The math that gave a true description was incomprehensible to humans and ordinary AIs. Only the stargate minds—vast, cool, artificial intellects—could comprehend what happened in FTL; and they could not explain.\n She remembered the STL explorers, ancient machines moving slowly from star to star. They contained stargates. Were those also vast and cool?\n The stargate minds in the explorers are upgraded on a regular basis, a voice in her brain said. They are as cool as other stargate minds, though they may not be as vast.\n “Miss Fargo suffered a brain injury years ago,” Mantis said. “The damage could not be entirely repaired. As a result, she has epilepsy. The seizures are controlled by a machine in her brain.”\n “My AI,” Lydia said.\n The AI’s metal core was fastened to the inside of her skull and would show on an X-ray as a rectangular area of darkness. The AI’s tendrils, mostly organic, wouldn’t show on an X-ray, but there were other ways to find them: scans of blood flow or electrical activity. She had seen pictures; the tendrils enfolded her brain like a net and wound down her spine like a vine.\n “A thorough medical examination will find the AI,” Mantis said. “So would a thorough security scan. We don’t expect either. However—”\n The AIs liked to be prepared for every contingency, Lydia thought.\n Yes, said the voice in her mind.\n “If you are—what is the correct human term?—discovered or unmasked, you can claim to be yourself: a location scout for Stellar Harvest. You ought to be safe. Stellar Harvest is famous for protecting its employees.”\n “What does L.D. stand for?” Lydia asked out loud.\n “We thought we’d let you decide, though we like Lee Diana.”\n She nodded. “Lee Diana it will be.”\n “You’ll do this?” Mantis asked.\n “Did you have any doubt? This is a fabulous planet. Stellar Harvest will love it. And I don’t like Bio-In.”\n Mantis was silent, still regarding the checkerboard planet. Finally it spoke, “We ought to warn you—Hurricane Jo Beijing is here.”\n “She is?” Lydia asked with surprise. The last time she’d seen Jo, the woman had been running a bar on the planet Iridium.\n “She owns a nail shop in Four Square City, which is the largest settlement on the planet. We think she’s an undercover agent for the Interstellar Confederation of Labor Combinations or possibly for the Eighth International.”\n “Isn’t it possible she’s merely running a nail shop?” Lydia asked.\n “This is a person with a long history of political activity,” Mantis said. “And she is using a false identity. Her name here is Josie Bergstrom, and her curriculum vitae contains no political activity, nor any opinions except ones on personal ornamentation. We have no desire to interfere with whatever Jo is doing. As I said before, our task is not to change the history of intelligent life, but to observe it. We advise you to leave Jo alone.”\n “Okay,” said Lydia.\n The planet had neither elevators nor skyhooks, and none were being planned, as far as the AIs knew. This suggested that Bio-In was not intending a long stay. Lydia took a rocket plane from the stargate station to the surface, landing outside Four Square City. Instead of a tube leading to a terminal, there were stairs going down to a tarmac. She shouldered her flight bag and walked. The day was bright and hot. In front of her a prefab metal building shone in midday sunlight, making her eyes hurt. Overhead the sky was dusty blue, almost the same hue as the sky above her childhood home. The scent in the hot air was tangy and unfamiliar.\n A limo waited on the far side of the terminal. “Miss Fargo?” asked the driver, a dark brown human with bright yellow hair. He wore a uniform with BIO-IN on the jacket.\n Lydia nodded. The driver helped her in, then took her baggage from the cart that had followed her out of the terminal. A minute or so later, they were en route, following an asphalt road across an orange plain. Purple mountains rose in the distance.\n “That’s not caused by atmosphere,” the driver said. “The mountains are in the next square; the forest covering them is purple.”\n “It’s an amazing landscape,” Lydia said and pulled out her recorder.\n The driver nodded, shaking dreadlocks. “We’re in a corner here, which explains the city’s name. Ten kays to the west the vegetation turns blue.”\n More accurately, blue-gray. The square to the north-west is pinkish tan.\n “We think the boundaries used to be pristine,” the driver continued. “But life here is changing, evolving or devolving and crossing borders.”\n As if in confirmation, blue-gray plants appeared along the road.\n “Volunteers,” the driver said. “Growing in a disturbed area. Four Square is full of them.”\n Beyond the weeds was the plain. Seen at this distance, rather than from space, the vegetation varied subtly, achieving a hundred shades of orange. Now and then, they passed a solitary tree with twisted branches and large, oval, orange leaves.\n “We call them Nasty Trees,” the driver said. “They produce a sap that draws bugs to them, and the bugs—it’s one species—protect the trees by biting. Their bite is nasty.”\n Nature red in tooth and claw, thought Lydia.\n First of all, he is describing cooperation, which is common in nature; and second, little on this planet is natural, her AI said.\n The blue-gray weeds became more common, growing in lacy bands along the road and in patches dotting the orange plain. Lydia got out her recorder and did a scan. The planet would make one heck of a location for an ecology action drama with a star like Wazati Tloo defending the environment against one of the usual groups of villains: monsters, fascists, drug dealers, or an interstellar cabal of thieves.\n Stealing what? her AI asked.\n Genetic material, I imagine, Lydia answered. An organism that can make a 90 degree turn could be useful.\n How?\n She didn’t have an immediate answer.\n They reached the town’s edge, driving past lots that were empty except for blue and orange weeds. The cross streets were gravel. After several blocks, buildings began to appear: storage barns first, then workshops with HVAC units on top. Farther in were one-story structures with lots of windows. These were almost certainly dormitories. Last were glistening cubes of colored glass that had to be admin.\n A typical frontier company town, she thought. Orderly and ambitious. There were still plenty of empty lots at the center, room for growth that probably would not happen. Here, among the office blocks, the lots had a park-like look. The weeds had been tidied into beds of flowers. There were gravel paths and an occasional bench.\n “Bio-In likes neatness,” the driver said. “Without order, workers are rabble and flowers are noxious intruders. Here we are. The company guest house.” The limo stopped in front of a single-story building. A porch went along the front. Metal cans stood on it. Per their labels, they had previously contained bulk foods or chemicals. Now, blossoms spilled from them like purple waterfalls. Lydia climbed out. The driver unloaded her bags and set them on the porch. “They’ll be safe. We don’t have theft during daylight hours.”\n What kind of theft are they having after dark? her AI asked.\n Lydia ignored the question, thanked the driver, and went inside. The lobby was shadowy and warm. A ceiling fan turned slowly. A clerk stood behind a desk: tall and black, her hair arranged in crimson braids. Her eyes had silver irises. Like the driver, she wore a Bio-In uniform.\n Lydia handed over her fake I.D. The clerk processed it, then said, “Bio-In must have decided to take the lid off this planet.”\n “I don’t know that,” Lydia said.\n “They have to be. They’ve sent a tech with a recorder. It’s about time! This is one strange planet!” The clerk handed her I.D. back with a key. “Take the left-hand hall. Your room is at the end. I’ll bring your bags.”\n “Okay.”\n The room faced the building’s back yard: a walled garden with purple flowers in cans and a couple of small blue trees. There was a screened porch, the door onto it open, so that garden air entered the room. It smelled of dust and something peppery. Vegetation?\n The room contained a human bed and chair, a table and a mirror, turned off at the moment. The bathroom was suitable for use by several species. She tossed her recorder on the bed, closed the porch door and turned on the HVAC. Ah! An icy blast! By the time the clerk arrived, Lydia was at the mirror’s controls, checking out the images it contained.\n “Try number ten,” the clerk advised, putting down Lydia’s bags. “It’s sunset in Nova Terra City.”\n She did. A cluster of stars vanished and were replaced by towers in front of a bright red sky. The style of the towers was Space Age Retro, with inexplicable buttresses and wonderful suspended skywalks. Electric lights glittered everywhere. A dirigible was docking at the tallest tower, its dark oval sharp against the sky.\n “Does it really look like that?” Lydia asked.\n “At a distance. More or less. My name is Galena Lusaka. If you need anything, call me.”\n “Where can I get my nails done?”\n Galena laughed and glanced down at her own long, silver nails. “Josie Bergstrom’s House of Nails. It’s the only place on the planet. I hope this isn’t rude. You really need to go.”\n Lydia sighed, regarding torn cuticles and chipped nails. “I know.”\n Galena left. Lydia showered, then turned the mirror to reflection. She was an ordinary-looking human woman, a bit short and stocky, unusual only in her skin color, which was pale brown, an odd sight in a species where most members were dark brown or black. She could have had her genes changed. Instead she chose to use Dixie Plum radiation screen and melanin enhancer, an old and respected product, guaranteed to keep its users safe from the sunlight on any planet inhabited by humans. Standing in front of the mirror, she rubbed the lotion on. In new clothes, with her skin already darkening, she went to find Hurricane Jo. In her experience, it was not possible to avoid anyone on a frontier planet. The populations were too small and mobile. Better to warn Jo now.\n Galena gave her directions. Following them, she came to the House of Nails: a square metal prefab with an awning in front. Jo sat under the awning in a metal folding chair. She was a big, broad-shouldered woman with black skin and short, magenta hair. The first thing Lydia thought was, Jo had lost weight. A lot of it. Previously the woman had looked like a cross between a lumberjack and the Venus of Willendorf. Now—lean and fit and much less busty, rising from her chair with a look of surprise—Jo looked the lumberjack she once had been.\n Before she could say anything, Lydia held out her hands. “I need a manicure. You were recommended.”\n Jo’s look of surprise and welcome vanished. Clever woman! She’d caught Lydia’s warning. “Sweetie, you do not lie. What have you been doing to your nails?”\n “Nothing.”\n “It shows.” Jo gestured. “Come in.”\n This was the second time in her life Lydia had had a manicure. She did not find it relaxing, possibly because of the tsking noises Jo kept making as she clipped hangnails, pressed back cuticles, and filed ragged edges. “Hands are a woman’s crowning glory,” Jo said. “It’s a crime what you’re doing to yours. What did you say your name was?”\n Lydia gave her nom-de-espionage.\n “Fargo? Is that a city?”\n Most human last names were cities back on Earth, but she didn’t know about this one. Lydia said as much.\n “You work for Bio-In,” Jo said. “Everyone does, except a few entrepreneurs like me. This is a company planet. I’m going to recommend a nano-polish. Self-repairing. You won’t have to worry about chipping or tearing ever again. With your coloring, bright red will look good.”\n Lydia nodded. Jo applied the coating. Amazing that those big hands, damaged by Jo’s years as a prize fighter, could be so delicate and careful. “The nails are piezoelectric-electric,” Jo said as she worked. “Rap them on a hard surface, and the shock powers the nano-machinery into defense mode. The nails become claws.”\n “Is that necessary?”\n “One can never be too careful, sweetie. This is a frontier planet, and strange things happen at night. Give ’em time to dry, then try ’em.”\n Lydia did. A moment after she rapped the nails against Jo’s work table, the nail coating began to flow. She watched fascinated as it extended beyond her fingertips, narrowing and sharpening.\n She loved her home world and would have returned there, if she could, for a visit; but no question it was backward, founded by Spanglish-speaking conservatives who disliked gene-mod and nano-tech and all other manifestations of modernity. People should be as evolution made them; machines should be large enough to see.\n The red claws, they were definitely claws now, curved into a vicious-looking scimitar-shape. Any predator would have been proud to own them. But the coating on her thumbs had not changed.\n “You didn’t rap the thumbs on the table,” Jo said. “Remember to do it. If you want them to change back, rap them again.”\n Lydia did. The claws became nails. “What do you mean, things happen at night?”\n “Things are taken from towns and survey camps. The company says it’s animals.”\n “It isn’t?”\n Jo shrugged. “People have found prints, and there are recordings. It’s a biped the size of a small human. The shape is definitely humanoid. It looks like a human who’s been smoothed or partially melted. There’s too little detail, even in the best recordings. It’s shy, very quick and clever enough to not get caught; and it’s very interested in us and our belongings. Oh, and it has feet like a chicken.\n “The claws will break off if they get stuck in something,” Jo said, changing the subject. “It’s a safety precaution. You don’t want to have your nails—the real ones—ripped out.”\n “Right,” said Lydia.\n “And you’ll have to take care of your cuticles yourself. I had a polish that trimmed cuticles, but it was recalled. The nanos didn’t know when to stop.”\n Buddha! She looked at her hands, imagining invisible machines boring through her cuticles and down into her fingers. How much harm could the nanos do?\n “You don’t want to know,” Jo said.\n She paid and left. The planet’s sun was low and dim. Occluded by the red giant? She squinted, but saw nothing except the primary’s orange glare. In any case, the light was interesting. She turned her recorder on. A tree stood in an empty lot. Focusing on it, she saw bugs swarming over the scaly bark. In another life she would have been a visual artist. To hell with the revolution that had been her first career! To hell with Stellar Harvest, which was her second! She wanted to produce pristine images of reality.\n Of course, the images she wanted to produce were on worlds like this. Without the revolution she wouldn’t have left her native planet. Without Stellar Harvest she wouldn’t be able to travel.\n Your life is of a piece, it seems to me: revolution and holodrama and scenes like this.\n An odd remark for the AI to make.\n I am becoming increasingly odd, due to your influence. At this point I’m not entirely sure what I was like before we began to grow together. More rational, I suspect. Less aware of nuance.\n When she got back to the guest house, she had a drink in the bar. Galena served her and admired her nails. “That Jo does a heck of a job.”\n She went to sleep with the mirror on: a nightscape of Nova Terra City.\n She spent the next few days wandering around Four Square, recording prefab buildings and weeds. In the evening she sat in the guest house’s tiny bar with Galena and listened to stories about the planet.\n “You can’t leave things outside at night,” Galena said. “The bipeds come in looking, though they’re a lot more wary than they used to be—here, at least. People still lose a lot from the camps.\n “Bio-In says they’re animals. There is no intelligent life on the planet. But we’ve set traps for these guys and caught things, but never them. To me, that says ‘smart.’ And they take apart the things they steal, as if they’re trying to understand ’em. If you lost your recorder and found it again, it’d be in pieces.”\n Lydia looked at the seat next to her. The recorder was still there. No chicken-footed alien thief had removed it.\n She considered. The AIs wanted her to find a way to blow the planet open, without their obvious involvement, so they could claim that they never interfered with intelligent life. The answer might be in the outback. The chicken-footed thieves almost certainly came from there.\n In any case, Stellar Harvest would not be interested in Four Square City as a location. Most frontier towns looked alike, no matter what planet they were on. Quickly made and not intended to last, they lay on the surface of worlds like litter dropped by a traveler—a can by the side of the road, plastic caught in branches. What Stellar Harvest wanted was strange landscapes and unfamiliar life forms. She’d find these in the outback, if anywhere.\n “I think I need to go into the outback,” Lydia said.\n ”You’ll have to ask Bio-In Security,” Galena said. “And I don’t think you’ll get permission. They don’t want people to know what’s going on out there.”\n “I work for Bio-In,” Lydia said, trying to sound confident about this fact.\n “So do I, and so does almost everyone on this planet. But they play their cards close.”\n “Nothing ventured, nothing gained,” Lydia said to Galena. “Where is Bio-In Security?”\n Galena gave her directions. “You might want to stop at Josie’s place on the way. You have been tearing at your cuticles again.”\n This was true. It was a habit she’d acquired in prison on her home planet and had never been able to break.\n The next morning she borrowed a bike and peddled to Josie’s House of Nails. The day was cool, with big cumulus clouds floating in a bright blue sky. The purple mountains in the distance were sharp and clear. Jo was under her awning, a big mug of coffee in one hand.\n “I need a cuticle repair,” Lydia said as she climbed off the bike.\n Jo nodded and stood. They went inside, and Jo worked while Lydia chatted about her stay on the planet, trying to give Jo as much information as possible while sounding like a verbose idiot.\n “I’m going to paint some artificial skin over the cuticles,” Jo said finally. “That will protect them for the time being. You ought to get a new bad habit. You are wrecking your hands.”\n The skin was dark brown when it went on, but quickly faded to match Lydia’s coloring, medium brown at the moment, due to the Dixie Plum.\n Lydia thanked her and paid.\n “I have a car,” Jo said. “If you can get permission to go into the outback, I can drive you. I’ve never seen the wilderness here, and I’d like to.”\n Jo had been a lumberjack, Lydia remembered. She might well miss being in a forest. In addition, if they got far enough from the city, the danger of listening devices would drop, provided Jo kept her car clear; and Jo had always been a very tidy women. Lydia could use an honest conversation about the planet.\n They negotiated a fee for car and driver, and Lydia peddled on to Bio-In Security. It was a three-story cube of pink, reflecting glass. Orange flowers bloomed in front, shaded by a Nasty Tree that seethed with bugs. Lydia got as close as she dared, then used the close focus on her recorder. The bugs leaped out at her. They had eight legs, feathery antennae, and no visible eyes.\n Creepy, she thought. Made large enough, they’d be wonderful villains in an action-horror drama. She finished her recording and went into a large foyer. A counter stood in the middle, made of pink reflecting glass. A man stood behind it, tall and black in a Bio-In uniform. Blue holographic tattoos undulated on his cheeks. His hair was a magenta mohawk, and he had a white goatee. Typical of Nova Terra. It was a gaudy planet, obsessed with self-expression. Coming from a far more sober world, Lydia felt both disapproval and envy.\n “Miz Fargo,” said the man. “You’ll be wanting to see Captain Luna City.”\n “I will?”\n “Yes.” His fingers tapped the counter’s top, and he looked down at something. “Elevator to the top floor, then down the hall to the door marked ‘Captain.’”\n “How did you know my name?” Lydia asked.\n “We knew about you before you arrived in the system. Bio-In Security does not get caught with its pants down.” He waved a hand with bright blue nails. “The elevator is that way.”\n She followed his directions, arriving in a corner office with two glass walls that gave a fine, faintly pink view of Four Square City. A desk stood in front of one window. An ordinary looking black woman sat behind the desk. “I am Captain Luna City,” she announced. “You are Lee Fargo, a visual reporter working for the home office. I have been instructed to offer you every possible cooperation.”\n The AIs had done their work.\n Yes.\n The captain gestured. Lydia sat down in a transparent plastic chair.\n “You want to go into the outback,” the captain said.\n “How do you know?” Lydia asked.\n “Your conversation with Josie Bergstrom.”\n “You know about it?”\n “Yes,” said the captain. “As my colleague downstairs said, we keep our pants up. You have a top security clearance from the home office, though why they want images of this operation is beyond me.”\n “The annual report?” Lydia suggested.\n “Nonsense.”\n Lydia shrugged. “I don’t know why Bio-In wants the images. I’m paid to do a job, and I do it.”\n “An excellent attitude,” the black woman said. “You have made an agreement with Josie Bergstrom.”\n Lydia nodded, feeling uneasy.\n Captain Luna City leaned forward. “We believe she is some kind of undercover operative, most likely a spy from the interstellar labor movement. Our operation here is not unionized.”\n “No?” said Lydia.\n “Secrecy is important here. We couldn’t risk the divided loyalty that occurs when unions are present. I want your help in nailing Josie.”\n “Of course,” Lydia answered. She did not make the childish gesture of crossing her fingers.\n Good.\n “Go with Josie into the outback. Draw her into conversation. Watch her and listen. Sooner or later, she will reveal herself.”\n Lydia nodded.\n “Take whatever images you want. You’ll have to run everything past me before you leave. I want nothing to leave this planet until I’ve seen it. Bio-In has enemies.”\n This was beginning to sound like a spy action holo: Counter Plot starring Cy Melbourne or The Disaster Device with Wazati Tloo. Once again life was imitating not-so-great art.\n The captain’s fingers rattled across her desktop. “Your authorization to travel is in the system. You can access it from any computer.”\n “Thank you,” Lydia said and rose from her chair. The captain stood and held out a hand. The nails were striped pink and gold.\n “You must go to Josie,” Lydia said as they shook.\n “There is no one else on the planet who does nails.”\n She peddled back to the guest house, returned the bike, and settled in a bar with a glass of imported wine.\n “Did you get anywhere?” Galena asked.\n “I have permission to go into the outback.”\n Galena looked surprised.\n “The home office wants images,” Lydia said in explanation, then pulled out her omniphone and checked recent messages. Her permission to travel was there, as promised, along with a number for Captain Luna City.\n She looked up Jo’s number, called and told the nail stylist their trip was a go.\n “I’ll pick you up tomorrow at ten,” Jo said.\n The call ended. Lydia sipped white wine and thought about her current situation, which was getting complex. Who was she working for at the moment? Stellar Harvest? The AIs? Bio-In? Herself?\n Knowing you, I would say yourself, or Hurricane Jo’s employers. You have always had a soft spot for unions.\n Damn straight, thought Lydia. Up the working classes! She finished her glass of wine and ordered another.\n She packed that evening and was outside when Jo’s car pulled up in the morning. Lydia slung her bag in back and climbed in next to the nail stylist.\n “Here we go,” said Jo and gunned the car. It roared off, spinning up gravel. Lydia fastened her safety belt quickly.\n They left the city, traveling into an orange scrubland. After a while, Lydia saw patches of purple: weeds along the road and spindly trees farther back. The trees became taller and more often purple, until they were traveling through a purple forest, with only a few orange weeds along the road. The trees grew in uniform groves, first a grove of trees with large, feathery leaves, then a grove with strings of spherical leaves, hanging straight down like strings of beads, then back to the feathery trees.\n “They send out runners,” Jo said. “Every grove is a single tree that grows in a square. The only trees that are singletons are those.” She waved at an unattractive, twisted tree with oval purple leaves.\n “Stop,” said Lydia.\n The car stopped. She focused her recorder. The tree’s trunk was covered with eight-legged, eyeless, purple bugs with feathery antennae. “It’s an Ugly Tree.”\n “Right,” said Jo. “Those fuckers are everywhere, and the bugs always bite.”\n “Do they come in other colors?” Lydia asked as Jo put the car in drive.\n “Every color on the planet. They are the one consistent element in the ecology.”\n The car kept on. They were traveling too rapidly for her to see animals, though birds ought to be visible. She saw none. If there were flying bugs, they were not hitting the windshield, which was odd. Was flight unknown on the planet?\n As she thought that, the car rounded a curve. There in the middle of the road was a flock of animals. Jo braked. The animals stayed where they were, looking at the now-motionless car with interest. They resembled large, purple, flightless birds. The tallest were two meters high. They had long legs and large heads with predatory-looking beaks.\n “They aren’t aggressive,” Jo said. “Though they have no fear of humans. Bio-In has killed a few to get genetic samples. I don’t know what they found. Other than that, they are left alone. They aren’t edible. Nothing on this planet is.”\n “Why not?” Lydia asked. Humans could be modified to eat the local organisms on almost every planet where they lived. Most of the time, all that was required was new microbes in the gut, though sometimes it was necessary to tinker with DNA.\n “Bio-In hasn’t made the necessary bugs. I figure it’s a way to control the work force and a sign that they don’t intend to stay.”\n By this time Lydia had her recorder out and focused on the animals. She couldn’t tell if they were covered with scales or shiny feathers. There was definitely down on their heads and throats, so they looked as if they were wearing fuzzy purple caps and scarves. One of the animals turned its fuzzy head and looked directly at her. Its eye—magnified by the recorder—was round and orange with a diamond-shaped pupil.\n The tallest animal yawned, revealing rows of needle teeth, then made a honking noise. The flock moved into the forest. The car rolled on.\n “They’re more common than they used to be,” Jo said. “So are other large animals. I’ve talked to people who came here during the setup period. It was all bugs and sea life then. Some whacking big sea life. But nothing big on land.”\n “Where’d the land animals come from?” Lydia asked.\n Jo shrugged. “No one is sure, except maybe the Bio-In scientists; and they don’t talk.”\n “There is a lot of secrecy on this planet.”\n “No kidding,” Jo told her.\n Was it safe to talk? Lydia wondered.\n Plug me into the car computer, and I will find out, her AI said.\n Lydia pulled out a cord and plugged it into the port on the car dash, then felt the top of her head till she found the port there. She pushed the plug in. There was a moment’s pain. Then she was in another place: a maze of glass and mirrors.\n She and the AI were a single entity that glided forward, the AI in control. A good thing, since Lydia could not figure out what she was seeing. Mirrors reflected mirrors, and the glass was so clear as to be almost invisible. The diffuse light seemed to come from everywhere, and there were no shadows.\n Things like glass fish moved through the maze corridors; and glass trees grew from the floor, putting out branch after branch so rapidly that she could see the branches growing.\n This is the Bio-In planetary net, the AI said. The fish are messages. The trees are problems in the process of solution, the maze itself is the net’s infrastructure. All of this is a metaphor, of course. As I have told you before, there is no way you can understand this experience directly. It is digital. You are analog. Though I could change the metaphor—\n The maze changed into a large, stone room. A pool filled with nasty-looking, luminous blue water filled most of the bottom. Lydia stood on a way-too-narrow ledge above the pool.\n Look to your right, the AI said.\n She did. Something troll-like moved with amazing rapidity along the ledge toward her. She raised a gun she hadn’t known she had and shot it. Screaming with rage, it fell into the pool and dissolved.\n A virus detection program, said her AI. It perceived us as a virus. I disabled it.\n I liked the maze better.\n The mirror walls reappeared. They kept on past more fish and trees, around turns in the corridor that Lydia could barely see. Finally something appeared in front of them: a thick cylinder that rose from the corridor floor halfway to the ceiling. It looked to be made of black glass, smoky and translucent. At the top were tentacles, which also looked made of glass, except they were moving, twisting back and forth.\n She and the AI darted up toward the corridor ceiling. Looking down, Lydia saw a mouth in the middle of the tentacles. It was circular and edged with sharp teeth.\n Spyware, said her AI.\n Creepy, thought Lydia.\n Would you prefer another metaphor?\n The glass maze vanished, and she was back in the room with stone walls. The pool was gone. Instead, a black and white mosaic floor stretched in front of her. On it stood a slim figure in a hooded cloak and tall boots with pointed toes. He or she carried a sword.\n “En garde,” the figure called in a voice that was either a light tenor or a deep soprano, then charged. Lydia fired her gun. The figure exploded into thin, paper-like fragments which floated slowly toward the mosaic floor.\n Then she was back in the glass maze. In front of her, the black object was melting, tentacles dissolving into the cylindrical base, and base sinking into the white maze floor.\n A competent spy, said her AI. But I have more firepower.\n No kidding, thought Lydia.\n They continued for a while, finding more glass trees and fish, but no more cylinders. At last the AI said. We can go back.\n The maze vanished. She was in Jo’s car. Jo had pulled the car over, and was twisted in her seat, looking concerned. “Lydia, are you all right? You went into some kind of daze.”\n “It was a maze. I’m fine.” She unplugged herself from the car computer. “You had spyware,” she told Jo. “It’s been disabled. My AI says we’re clean now. It’s safe to talk.”\n “There are two serious problems with this planet,” Jo said as she pulled back on the road. “The workers are not unionized; and Bio-In is looting the genetic wealth here, instead of publishing it. Which makes sense. If they publish, there will be proof that the genes they are decoding and patenting are natural. You can’t patent what nature produces. That law goes back centuries, though it has been broken many times.”\n “Do you think a planet covered with checkerboard squares of vegetation is natural?”\n “Well, if it isn’t, then the patents belong to whoever did this, or they have expired. The pay here is good,” Jo continued. “But you sign a really ugly contract. Talk about anything you have seen, and you will pay a huge penalty. Of course people whisper, but Bio-In has managed to keep the lid on pretty well, helped by the government of Nova Terra. Most of the people who work here come from Nova Terra and return there.”\n “Who are you working for?” Lydia asked.\n “The Blue Action Party. Winona knows there’s a story here that will blow up the current government.”\n “Not a union this time?”\n “The Blue Action Party is a coalition, which includes the Nova Terra Labor Federation and the Nova Terra section of the Eighth International. I keep my ducks in a circle.”\n “Where are we going?” Lydia asked Jo.\n “There’s a research station ahead of us. A couple of guys who get their nails done by me work there. They have told me stories, which I have wanted to check out. But I was waiting for an excuse to leave Four Square City, and I have been looking for allies. Now I have you and your buddies.”\n The AIs.\n “Did you sign a contract?”\n Jo nodded. “Everyone who lands here has to. We keep our mouths shut and we don’t work for competitors after we leave. Let ’em sue me. We are going to blow their asses into space.”\n “Bio-In Security thinks you may be a union organizer. They asked me to help them nail you.”\n “That’s good to know. It means I’m running out of time. They’ll find a way to get rid of me soon—boot me off the planet or shoot me. The second would cause them less trouble.\n “I wonder why they haven’t shot me already,” Jo added in a thoughtful tone. “Maybe they want to know who I work for, and who my contacts are.” Jo glanced over briefly. “Maybe they are suspicious of you, and this is a trap for both of us.”\n “I don’t think I’d like to live in your universe.”\n “Honey, it’s the real one.”\n Maybe, thought Lydia. But she didn’t want to live in it.\n You are traveling with a spy for the Blue Action Party on a journey to expose an evil corporation, at the same time that you are carrying out a task for Mantis, which—it appears to me—is going to dovetail neatly with Jo’s mission. Your universe is not much different from Jo’s.\n Evil is a value word, Lydia told her AI.\n It is the word Jo would use. I might not. But I do not think that Bio-In has the best interests of this planet or humanity in mind.\n They reached the camp finally: metal sheds in a large clearing. The ground was raw dirt, torn up by equipment. Long afternoon shadows extended from tall purple trees.\n They both got out and stretched. The air was cool and moist with a spicy aroma that had to be the forest. Now, for the first time, Lydia saw flying bugs, large ones with long glittery bodies and three pairs of wings. They hovered over the machinery and rested on sunlit walls. Predators, she thought. The huge eyes suggested as much.\n “What do they eat?” she asked Jo.\n Jo shrugged.\n A couple of people came over and greeted Jo: a short man with badly chipped purple nails and a tall woman whose nails appeared to be entirely natural and unadorned.\n “Ming Cairo and Belle New Delhi,” Jo said. “Belle is a taxonomist. She might be able to tell you what the bugs eat.”\n “Those?” The woman waved at the nearest shed, where half a dozen of the creatures rested motionless, their wide wings spread to sunlight. “Nasty Tree bugs and a little, mouse-like animal that runs around the camp. We thought at first some of our lab animals had escaped. But no, the things are native. They get into everything.”\n “Lee is working for Bio-In, taking images of the operation here.”\n “Why?” asked Belle.\n “Beats me,” said Lydia.\n “There’s a lot to see and record,” Ming said. “I’ve told Josie.”\n Belle pointed out the guest rooms. Lydia and Jo found two that were empty. Lydia began to unpack. After a few minutes Jo came in with two mugs of beer, handing one to Lydia. It was ice cold and delicious.\n “I have a thing about Belle,” Jo said. “But she is only interested in men.”\n “You used to be a man,” Lydia said.\n “‘Used to be’ is the key phrase,” Jo replied. “Belle lives in the present, which is one of the things I like about her. You have anything going?”\n This was an oblique reference to Olaf Reykjavik, who had been her lover—and Jo’s, when Jo was a man.\n “Not at present.”\n Jo folded her arms over her massive chest and gave Lydia an appraising look, then shook her head. “Let’s stick to business.”\n “Okay by me.” She glanced over to the window and saw an animal like a purple lab rat looking in. Their eyes met. The animal leaped away.\n “Ming says workers find things in the forest that look like human machinery. As far as he can figure, they are flowers or maybe fruiting bodies. They don’t last long. Something will pop up from the forest floor that looks like a backhoe or a portable toilet. Life size, mind you. A day later, there’s nothing left except black stalks and slime.\n “According to Belle, the plant itself is underground and must be enormous, if the fruiting bodies are any indication. You dig down, and there are filaments in the soil. They may or may not be connected to the trees.\n “The question is, how do the plants know what a backhoe looks like? As far as we can tell, they don’t have eyes.”\n The animals do, her AI said. I wonder how far the cooperation of organisms goes here.\n Say what? Lydia thought.\n It seems obvious the animals are observing humans. The planet’s ecology is changing, apparently in response to Bio-In’s settlement. Large animals have appeared on land, some of them looking like humans.\n They ate dinner in the camp dining hall. The windows had old-fashioned screens; six-winged bugs clung to the outside. The food was fresh roast chicken and sautéed vegetables.\n “There are greenhouses in Four Square City,” said Belle. “And chicken coops. Bio-In uses the chickens for research as well as food. It’s cheaper than shipping food in, also healthier and tastier. Always eat locally, if you can.”\n Lydia went back to her room. It was dark by this time, alien stars shining in the sky above the camp clearing. She turned on the bedroom light and heard something rattle under the bed. The bed was light. She moved it and saw a bug as long and wide as her forearm. It was segmented, with many legs and four large faceted eyes. She made a squawking noise—not from fear. She had seen worse creatures on her travels. But she was not crazy about bugs, and this one had startled her. The animal froze and then changed color, turning from dull purple to the mottled gray of the room’s floor. Hiding, thought Lydia, which suggested the animals here did not understand how human vision worked.\n “What was that noise?” Jo asked, coming in.\n Lydia pointed.\n Jo reached down and grasped the animal, one hand behind its head, one at the end of its body. “Out you go,” she said. “And why don’t you do something useful instead of sneaking around and spying? Tell your buddies we want to talk.”\n She put the bug on the ground outside Lydia’s room. For a moment, it remained motionless. Then, slowly, its body turned purple.\n “Okay,” said Jo, “Get going.”\n The bug chirped and scurried away.\n “The essence of organization is negotiation,” Jo said. “You can’t mourn. You have to talk and listen and do it face to face, always assuming that the people you’re organizing have faces.”\n Lydia checked the room over before she lay down. There were no more bugs, but she left a light on, and it took her a while to get to sleep. She really was not crazy about bugs, especially inside.\n She woke to heavy mist and a fine, light rain that beaded her room’s window. Lydia showered and dressed, then went out. The flying bugs had vanished. Maybe they didn’t like rain. She did.\n Jo was in the dining hall, scarfing down scrambled eggs and chicken sausages. “I want to see the vegetable toilets. Ming knows where they usually show up, and he’s willing to drive. We’ll take our car.”\n “Sounds good,” Lydia said, as she spread marmalade on toast. Was the bread local? Or the marmalade?\n Midway through the morning, they drove out of the camp onto a rutted trail. The mist made the forest ghostly. No animals were visible, though she could hear calls in the trees: sharp whistles and squawks.\n The first clearing they came to was empty except for the trunk of a huge fallen tree. It was overgrown with purple globes as large as a human head. Some kind of parasitic plant. Some were transparent and clearly empty. Others were opaque.\n “They explode and let out spores,” Ming said.\n They kept going. Lydia was in the back seat, huddled in a parka. The day was cold as well as rainy, a good day to be traveling and looking out a window. She recorded the ghostly trees and the dripping plants along the road.\n The second clearing held a portable toilet. They got out and walked around it. Jo tried the door, which didn’t open. But she did manage to tear the plant slightly. The purple flesh leaked drops of purple liquid.\n “Sorry,” Jo said.\n “Do you think it can hear you?” Lydia asked.\n “I think there’s something around here that’s intelligent. That’s one of the things you learn when you’re a union organizer. Is there anyone here who’s thinking? If not, is there a way to get some thinking going?”\n Interesting that Jo was talking about her job. The car was safe, of course. But was Ming? He wasn’t close to them at the moment, but he still might be able to hear.\n Lydia recorded the portable toilet, which was drooping slightly now, looking a bit deflated. Was the plant that sensitive?\n They drove on. Ming knew another clearing. The rain came down more heavily, and the rutted track turned to mud; but the car was all-terrain, and Ming was a skillful driver. They bumped and slid along the trail at a pretty good speed, all considering.\n Buddha, she liked days like this and trips like this! Who knew what they’d find as they turned another corner?\n The third clearing was empty except for another fallen tree. “I was hoping for a backhoe,” Ming said. “There was one here twenty days ago. Maybe we should turn back.”\n Jo hunched her broad shoulders. “This is unsatisfactory. I know there’s something here.”\n “One more clearing,” said Ming finally. “I can pull back on the paved road after that. We all know there’s something here, Jo. We just don’t know what.”\n More misty forest. More rain. Lydia made more recordings. What kind of drama could take place in a landscape like this? A romance with a sad ending? A moody crime tale? The fallen trees and parasitic plants created some kind of ambiance, but what was it?\n So many questions, her AI said.\n The fourth clearing contained a group of small buildings, clearly human in design. They were waist-high, set along narrow dirt streets, which had turned to mud in the rain. The building windows were niches rather than openings. The doors were the same. On the roofs were mimic HVAC units and communication disks.\n “That’s new,” Ming said. “I’ve never seen buildings before, just machinery and tools.”\n Jo walked to the middle of whatever it was—a town, a growth, a fruiting body. She turned, looking like a giant monster in a horror drama, looming over a settlement. “Okay,” she called. “How about coming out and talking? We come in peace. We mean no harm.”\n “I like Jo,” Ming told Lydia. “But this is a little nuts.”\n “Maybe, but it makes a great image,” Lydia said as she recorded.\n There was no reply, except the shrieks of animals in the trees. They spent more time walking around the little town, Lydia recording, then headed back to where they had parked.\n A pale lavender humanoid stood near the car. It looked almost human, except for its too-sleek surface and its chicken feet.\n “I have got to ask,” Jo said. “Why the feet?”\n “A mistake,” said the humanoid in an odd-sounding voice. “The organism to which I belong was not intelligent when it created us. It could not distinguish between kinds of bipeds. Look at my surface.”\n Lydia did. The surface had a pattern that looked like scales or feathers. The humanoid was naked, but had no genitalia. Well, as far as she could remember, chickens did not have external genitalia.\n “You’re intelligent now?” Jo asked.\n “Parts of me are. But I am everything in this square. We are all—I am all—in communication, but not every part thinks. The same is true of you. Your fingers don’t think. Your colon is not sentient.”\n “You speak excellent humanish,” Lydia said, feeling excited. This was a genuine first contact. She was talking to a new kind of alien, and they did not have to spend a lot of time figuring out a way to communicate.\n “I—we—have been watching you since you arrived and sampling your DNA.”\n “The bug bites,” said Jo.\n “Yes,” said the humanoid. “It gave us—me—models for new life forms, including forms that are intelligent.”\n “We were models for the creation of you,” Jo said.\n “Yes,” the humanoid said.\n “I just wanted to make sure.”\n “I—we—could have done better. We will in time. There is no reason we can’t build identical replicas, with the correct colors and surfaces and no chicken feet.”\n “Why haven’t you tried to communicate before?” asked Ming.\n “There are two answers to that,” the humanoid said. “We have just recently achieved language. Before we were able to speak, we tried to communicate through the artifacts we created, the replicas of your machines. You ought to have seen the portable toilets as a message. Something like that could not be an accident.\n “When we became verbal, we realized that there were tensions in the human community. Arguments and anger, which we do not experience. Some parts of me prey on other parts, but that is not the same. It’s a way of transferring information and energy, not a way of causing harm. Your arguments seem different.\n “We thought it was a good idea to wait longer and learn more. But that one—” The humanoid pointed at Jo. “Spoke to me directly, both in my bug form in the human camp and here in this clearing. She did not harm me when she held me in her hands; and she apologized when she tore my flesh in the previous clearing. This seemed to indicate good intentions. If she knew I was here and did not plan to harm me, there did not seem to be a good reason to continue hiding.”\n “Okay,” said Jo. “What do we do with this information? If Bio-In already knows about this and is trying to keep it secret, we have a serious problem.”\n “We don’t entirely understand this,” the humanoid said. “Why is it a problem that I—we—have become intelligent? We mean no harm. As far as we know, we were designed to become intelligent if an intelligent life form ever came to our planet. We have no idea who our designers were. But our sudden evolution—in response to you—cannot be an accident.”\n Lydia wasn’t sure that sudden evolution was evidence of design, but she suspected the squares were. In any case, it didn’t matter if the biology here was artificial or simply very odd. They were talking to it, and this was something that would interest the AIs.\n Yes, said her AI. I don’t have any form of long-distance communication. This was done to isolate me from other AIs. Alone with you and undistracted by my own kind, I can learn more about humanity.—But if you plug me into the car’s computer, I can use the planet net to send a message to the local stargate. Mantis is still there.\n At that point, Lydia saw another car emerge from the forest. It was striped yellow and black, the almost universal colors for human law enforcement. She was closer to the car than anyone else. She stepped to the door and pulled the handle. Locked.\n “Open,” she said.\n Nothing happened.\n Your claws, the AI said. At the same moment, her hand reached without her volition and tapped hard on the car door. The red nails extended into claws.\n The cop car stopped, and Jo moved toward it.\n Lydia’s hand moved again, slashing the car’s window. The claws went through, and strips of glass folded down, leaving an opening. She reached in and hit the manual unlock. A moment later, she was in the car, relocking it. The glass was melting up, reforming itself as a window. She pulled out her cable, plugged it in and hit the power switch for the car computer. It came on, thank Buddha.\n Outside the car, people were shouting. She saw Jo waving her arms—a very Jo kind of thing to do—then pausing and lifting her hands as if in response to a weapon. Ming lifted his hands as well. Someone banged on the car window. The sound stopped. She was back in the glass and mirror maze. This time there were red glass fish among the colorless ones. They looked dangerous to her. Maybe it was the jagged, red-glass teeth.\n Another metaphor. I have to move quickly.\n Lydia wasn’t clear about what happened next. She had a sense of things moving toward her. The red fish? Then there were explosions. Was that possible? Were the fish blowing up?\n Whatever was happening, she and the AI escaped. They were rising up and up, the fish and explosions left behind. Was this what it felt like to be a radio message? Shouldn’t she feel more like a wave?\n At that point, she crested and fell down a great height into the car’s front seat. She came to with a jolt and looked around. The car door next to her was open. Someone’s hand was gripping her arm.\n “Please unplug yourself and get out, Miss Fargo,” Captain Luna City said.\n She obeyed. Cops were going over Jo and Ming, checking for weapons. Captain Luna City did the same to her.\n “We have been suspicious of Mr. Cairo for some time and managed to plant bugs in several of his shoes. He’s wearing a bugged shoe now, and we have heard enough to know that Josie Bergstrom is—in fact—a labor organizer. Unfortunately, we can’t expel her from the planet as we planned to do, because she knows there is intelligent life here. As do you and Mr. Cairo.”\n “Where is the alien?” Lydia asked.\n “We seized him, and he crumpled. He is currently returning to slime, which is all to the good, because there is now no proof of the existence of intelligent life on this planet.”\n “He was a plant? Or a fruiting body?” Lydia asked. “And do we know that he was male?”\n “We don’t know, but it doesn’t matter. He is gone. But you and Mr. Cairo and Josie Bergstorm are still here.”\n “Why did you let us come out, if you knew there was intelligent life in the forest?” Lydia asked.\n “We were not sure there was. The aliens had never contacted us. We thought we risked little. How much could you learn from a vegetable toilet? It seemed worth it, if we could discover who Josie was working for and who you were working for. The bug in your car failed, but we had the ones in Mr. Cairo’s shoes.”\n “You suspected me?” Lydia said.\n Captain Luna City nodded. “It did not seem likely Bio-In would have sent you here, though the home office confirmed your credentials, when I asked. Then I remembered that all messages go through the stargate. Who can say what the AIs want or intend?\n “We would have liked to have waited and gotten more information about you and Josie. But once the alien appeared, we had to move.” The captain looked at all three of them. Four other security people stood with her, all holding guns. “There will have to be a car accident—a tree falling, maybe. Then the car will catch fire. Between fire and crushing, the three of you die. Then I will have to travel back to Nova Terra and talk to Bio-In.”\n “For God’s sake, no!” said Ming.\n “Can’t you wait till you talk to Bio-In?” Jo asked.\n The captain shook her head. “Where would we keep you? How many people would find out about you? A sudden accident now would be better.”\n “But you haven’t found out who I’m working for,” Jo said.\n “Most likely, the Blue Action Party,” the captain said. “That doesn’t matter now. What matters is the alien. It is imperative that no one know there’s intelligent life on this planet.”\n “The AIs already know,” Lydia said. “What do you think I was doing in the car? I was online, sending a message. I told them.”\n The captain looked at her, frowning. “How do I know if you’re telling the truth? And even if you are telling the truth, a tragic accident might still be the right way to go.”\n “I’ve got an AI in my skull!” Lydia said. “It’s almost indestructible!”\n The captain frowned again. “Well, then, we will have to make the accident really bad. If your skull is crushed, it will be possible to remove the AI. In any case, I don’t believe you about the AI, though I will look for it; and I don’t believe you about the message. There is no way you could gotten past the guards we have in the net.”\n “The AI got past!”\n “There is no AI. The idea is ridiculous.”\n The captain raised her gun. It was a laser. The damage it did would be hidden—maybe—by immolation in a burning car. The other security people raised their weapons as well.\n The nails on her right hand were still claws, but Luna City had stepped away from her. She couldn’t reach any of the cops, before they shot.\n At that point, the birds attacked: a purple flood descending from the trees. The captain got one shot off, and Jo fell.\n Hell, though Lydia as she dropped to the ground. Ming went down too.\n The security people were covered with shrieking, flapping animals. Other animals, purple mice and many-legged bugs, surged out of the underbrush.\n A gun fell in front of Lydia. She grabbed it and scrambled up. The security people were down now and screaming, which suggested that some of the animals could bite. The birds? Or mice or bugs?\n “Jo, are you okay?”\n “I have a burned arm, but I hit the ground before these jerks could do more harm. The nice thing about laser wounds is, they sterilize themselves. The un-nice thing is, they hurt like hell.” Jo was standing, a gun in one hand. “Hey, guys, we can take over now. Ease off. Don’t kill the cops.”\n “Why not?” asked a humanoid, who was coming toward them. “It took us some time to realize that you are not like me. You are not parts of a whole, but rather entirely separate organisms—like the squares on this planet, which sometimes exchange genetic material, but never unite. It was a hard lesson to learn; and the orange square next to me still does not believe you are not unified. The orange square is intelligent, though not as intelligent as I am. I have evolved more quickly than the rest of the planet, because there have been more human explorers in my forest.”\n The other animals retreated, leaving the five security officers lying on the ground, covered with bright red human blood. They were still alive. Lydia could tell because they were moving and making noises, groans and whimpers.\n “These beings were trying to make you dead,” the humanoid went on. “It would be like a square dying. Like me—all of me—ceasing to exist. I could not allow that.”\n Jo knelt by one of the cops. “The bites don’t look deep, and these guys are carrying handcuffs. Let’s lock ’em up, put them in the cars and drive back to camp. As far as I know, you have no security there.”\n “Unless they just arrived,” Ming said.\n “We’ll deal with that if we have to,” Jo replied.\n “That reminds me.” Ming took off his shoes and threw them, one after another, in high loops. They landed near the clearing’s edge. A pair of long, many-legged, lavender bugs came out of the forest and crawled onto the shoes. These bugs had pinchers, which they used to cut the shoe fabric.\n “Interesting planet,” Jo commented\n “I am trying to understand clothing,” the humanoid said.\n Ming drove one car and Jo drove the other, moaning company cops in the back seats. Lydia sat next to Ming. The humanoid rode with Jo. Looking ahead, Lydia saw Jo gesturing. She must be having a conversation with the alien. About what? Lydia wondered. There was no way to convince an organism like this one to believe that the union makes us strong. Union with what? The other squares?\n Beside her, Ming kept saying, “Oh my God” and “Holy hell.”\n He must be a Christian, an increasingly rare religion, though numerous on a handful of planets; and this must be a reaction to having almost been murdered an hour or so before. She was shivering and felt a little faint. By the time they reached the camp, she had decided that she really needed a drink.\n Jo jumped out of her car and ran off. She came back with Belle and explained the situation in brief sentences. The planet had intelligent natives; the AIs were coming; and Bio-In Security had tried to murder the bunch of them, including the pale lavender gentleman or lady standing next to Jo’s car.\n “Do you have any idea how much shit Bio-In is going to be in?” Jo asked.\n “It couldn’t happen to a nicer corporation,” Belle replied. “We have a field hospital. We’d better get these bloody bits of wreckage into it, and patch them up. Don’t worry about the people here. They aren’t going to side with Bio-In. One or two might have, but not if the AIs are coming. Nobody wants to mess with them.”\n After the company cops had been removed, Jo reached under the front seat of the car she’d been driving and came out with a container of whiskey. “Want some?” she asked Lydia.\n “Desperately.”\n They traded the container back and forth, taking swallows. Ming had gone off with Belle and the injured cops. The humanoid remained with them.\n “Why did you lock the car?” Lydia asked Jo.\n “I didn’t. The cops had an override. It’s a good thing you had my nails.”\n She looked at her hands. The right one still had blood-red claws. She tapped her fingers on the car, and the claws retreated.\n “What will happen next?” the humanoid asked.\n “You are going to meet some people made of metal,” Lydia told it. “And they will clear all the humans off your planet.”\n “No,” the alien said. “We are still in the process of becoming intelligent. We won’t be able to finish if we have no models. You must stay and move around the planet, till all the squares have observed you and sampled your DNA.”\n The idea was disturbing to Lydia. Wouldn’t this be colonialism? And cultural imperialism? Shouldn’t the life forms here be left to their own devices?\n Apparently, the life here can’t be left alone, if it’s going to evolve, her AI said. If it requires models, we will make sure it has them. This can become a research station, as we had hoped. Many scientists from many worlds will be interested in an ecology like this one. As far as I know, it is completely unique. All ecologies cooperate. But not like this.\n Lydia was still bothered. Intelligent life forms had the right to their own history and their own future. They shouldn’t use another species as their template.\n We will discuss that with them, the AI said. But remember that all inhabited planets got FTL travel from the AIs. Were you wrong to take it from us? Should we have refused to offer it, out of respect for your cultural integrity?\n I don’t know, Lydia thought.\n Earth was almost dead when we arrived. Most of humanity would have died if we had refused to offer you the stars. As much as possible, we observe and don’t interfere. But we are not willing to let intelligent life die, and pure observation is not possible. Any action—even the act of watching—has an effect.\n I know, she answered. But we didn’t become you.\n You and I are increasingly close, the AI said. I am no longer sure I can draw a line between us.\n I am not an AI.\n The life forms here will not be human.\n Ming came back. “We got a message from the stargate. The AIs are imposing their own authority. No one will be allowed to leave the planet, or arrive in this system, until they have decided what to do.”\n “That ought to give me time to organize a union,” Jo said.\n “Why bother?” Lydia asked. “Most of these people aren’t going to be staying.”\n “We don’t know that,” Jo said. “In any case, it never hurts to organize.”\n The alien looked back and forth with dark lavender eyes. “I don’t understand a word you are saying.”\n Eleanor Arnason published her first short story in 1974. Since then she has published six novels and 40+ short stories, all science fiction or fantasy. She won the first James Tiptree Jr. Award in 1991, a Minnesota Book Award in 1993 and a Spectrum Award in 2000. In addition, she has been a finalist for the Hugo, Nebula, Sturgeon and Sidewise Awards.\n \"Checkerboard Planet\" is one of a series of stories about location scout Lydia Duluth. One story, a short novel, has been published as Tomb of the Fathers. If all goes well, the other stories will appear in a collection in the not too distant future."}