{"fingerprint": "/6eHxEPR+q2YoP1tDcWkWESJjHk=", "sitename": "Clarkesworld Magazine", "title": "A Stopped Clock", "author": "Madeline Ashby", "date": "2015-11-09", "source": "https://clarkesworldmagazine.com/ashby_08_16_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Stopped Clock by Madeline Ashby", "categories": "Short fiction", "tags": "Cyberwarfare", "id": 2027533, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6470 words, short story, REPRINT\nA Stopped Clock\n“They don’t go out to drink anymore,” Jun-seo said. “They get everything delivered these days. That’s the problem.”\n“They’re all dieting,” Ha-eun said. “They won’t eat rice. Rice!”\n“I could check the flows,” Jun-seo offered.\nHa-eun shook her head. “It’s a trap. Remember when I tried to unsubscribe? They still owe me money. Besides, the prediction was never that good anyway.”\n“But we’d know where the kids are going,” Jun-seo said. “We’d see them on the maps. Their pings. From their watches.”\nAgain, she shook her head. The flows were valuable, in theory, but, in practice, they never tended to have the information a food vendor really needed. Sure, they were great for seeing things like traffic density, like how many people were taking what train at what time, and what train might be best for getting home at what time of night, but to get granular data with actual demographic information, that cost too much.\n“They’re not going anywhere,” she said. “They’re just going online.”\nThe two of them sipped from thready cups of coffee. Jun-seo had a 2-for-1 print credit back when the machine first un-shuttered itself. It would be better, he said, than taking the monthly penalty on getting coffee in cans or pouches from the other machines. They all saw you, these days. Saw you and judged you, rolling their machine eyes like mountain aunties, then reaching into your pocket to punish you for buying things that eventually became trash. Ha-eun ran her tongue over the cup’s rough lip. It felt like kissing a cat. Soon, she would be able to bite through the cup itself. Had it really been that long? Had they really worked this same corner for all that time?\n“Maybe if we sold waffles,” Jun-seo said. “Waffles are still going strong.”\n“You can’t sell ice cream in winter.”\nJun-seo flinched, but said nothing. Ha-eun felt sorry immediately, but had no idea how to apologize. She opened her mouth to say something nice about the coffee instead, but as she did, the building across the street blinked out.\n“Eh?” She reached out and tapped Jun-seo. “Oi. Look.”\n“I see it.” He scowled. “They’re not supposed to do that.”\nHa-eun checked her watch. No alerts. No warnings about bad weather or a brownout. Across the street, the solar louvers fluttered back to factory default. Their creaks and snaps carried clearly through the crisp winter air. The building, all sixty or so stories, stood out black against the city lights like a massive door into darkness itself. For a moment Ha-eun had the terrible thought that something might actually come out of that door. Some awful titan from legend curling its fingers around the biocrete, or a dragon swimming out of the sudden shadow. She blinked hard and rubbed her eyes. Goodness, she really was getting old.\nThe building flickered back on. The louvers snapped back to their nighttime positions. In the awakening light, she saw a few chilly residents standing on their balconies, peering at each other. They looked around, looked up and down, and then hurried inside.\n“There weren’t even emergency lights,” Jun-seo said. “In the stairwells. I didn’t see any. Did you?”\n“I wouldn’t even know how to look,” Ha-eun told him. “Which ones are the stairs?”\n“The narrow ones. Like arrow slits.”\n“Arrow slits?”\n“Like on a castle.”\nShe frowned. “What do you know about castles?”\nHe huffed and shifted weight on his feet. He jammed his hands in his pockets. “I used to like them,” he said, quietly. “As a boy.”\n“All kinds of castles? Or just the kind with arrow slits?”\n“Most castles have arrow slits. They’re very useful.” He sketched the shape of one in the air with his hands. His breath fogged as he spoke. “They’re narrow, see, so you can fire an arrow out, but no arrows can come in.”\n“Like a gun turret?”\n“Sort of. It’s the same idea, I guess. Weaponized architecture.”\nThey had both done the same basic training, once upon a time. During these long winter nights, it was hard to remember the interminable summer afternoons full of flies and roaches and yellow orb spiders, the absurdity of endless rifle drills. As though rifles would do any good, these days. She had been impertinent with a drill sergeant, once, about that. The sergeant made her clean the mess hall on her hands and knees. She ran the width of the hall, back and forth, pushing a vinegar-soaked rag with her fingers until her cuticles bled. She couldn’t make a fist for three days afterward.\n“Jun-seo is very smart,” she said, because it was a nice thing to say after all the mean things she’d said with the added benefit of actually being true.\nJun-seo smiled to himself. “I’ll help you pack up,” he said. “It’s too cold for skinny ladies like you.”\nThe next night, the traffic lights started acting up.\nFrom their place on the corner, through the clouds of steam rising up from Jun-seo’s bubbling pans of ddukbokki, the change seemed almost organic. Green to red and back again, like the fluttering of a moth’s wings. At first, Ha-eun wasn’t even sure she’d seen it. But beside her, on his fold-out stool, she felt Jun-seo’s posture change. He leaned forward. Scrubbed his glasses. Leaned even further forward.\n“We should tell someone,” Ha-eun said.\n“Who would we tell?”\nHe had a point. She had no idea which of the city’s many departments to report it to. They all had a separate terminal online—there was no single place to report something like this, whatever it was. And the proper authorities probably knew about it, already. The traffic lights were wired into everything else, weren’t they? The traffic people—was there such a department?—probably knew about it before it even happened. She checked her watch. No alerts. No warnings. They were close to a big municipal data center. All the employees there had the same city badge on their wrists. She saw it when they handed her cash. Sometimes they ran experiments, at night.\n“Maybe it’s a test,” she said.\n“Maybe.”\n“This late, they could do one, and nobody would know. It’s all rides by this time of night. And the rides know what’s happening before the riders do.”\nJun-seo made a sound of deep dissatisfaction. It started down in his belly and moved up to resonate in the back of his throat. Hrrrrrrrrm. He usually made it for indecisive customers. Ha-eun supposed the quickly-changing traffic lights were being indecisive in their own way.\n“I’m walking to the end of the block.” He rose carefully to stand and pointed north. “I want to see if the lights up at the next intersection are doing the same thing.”\nHa-eun did not like this plan, but couldn’t quite say so. Not without sounding like a worried old woman, or worse, like someone who had no confidence in him. “Well, be back soon,” she said, finally. “I can’t stir my rice and your ddukbokki at the same time.”\n“No one’s buying anyway.” He re-wrapped his scarf until it covered his mouth. Somehow, she could still detect his smile through it. “And anyhow, I like mine a little burnt.”\nShe watched him set off into the night, shoulders still loose and not hunched like an old man’s, his figure shrinking against the tall edifices. She should have warned him about ice. Given him her umbrella. Not that there was an ice warning tonight, but it was always a danger. It accumulated high up on the buildings during the winter, getting heavier and heavier, until it could no longer cling to the balconies and cladding. Then it fell, nature’s perfect weapon, impaling those unfortunate enough to still be walking the streets.\nThe streets were so empty, these days. The sidewalks seemed comically broad without any people on them. They’d even started moving the schools inside the buildings, so some students never had to leave their buildings if they didn’t want to. Even those who lived in other buildings could come and go by train, never breathing the outside air.\nHa-eun stood and stirred her rice. There was still so much of it. She’d done everything she could to make it better—more bacon, more kimchi, shreds of cheese, lacy trimmings of garlic chives—but it didn’t matter. No one was coming. She shoved it roughly around the pan anyway. Then she uncovered Jun-seo’s pans and began stirring the rice cakes. She was more delicate with his food than her own. He worked so hard to make something good—he even made his own anchovy stock for the sauce. Picked all the guts and heads from the dried fish with his own fingers before boiling them. Not that she’d seen it; he said he did it at home so no one would know what was going into the food. And now there was no one to see the food itself.\nShe replaced the lids and stared up the street. Why wasn’t he back yet? Surely he’d been gone long enough to look at the traffic lights. She squinted. A chain of rides was approaching. Maybe Jun-seo had waited to watch them pass; they would have gone through the intersection he was so curious about. She heard honking and turned. Another ride was speeding up toward their intersection. Without any conscious awareness, she looked at the traffic lights.\nBoth sets were green.\nThe rides honked at each other. The riders could do that, within the rides. It made them feel like they were in control of something, or so she heard. For a long few seconds, Ha-eun saw their faces. They looked angry, frustrated, confused. Terrified.\nThe cars smashed into each other.\nHa-eun covered her mouth to stop her scream before it started. She had never witnessed a car crash before. They used to happen more often, of course, but even then it was rare to see one as it happened. People saw the aftermath. She remembered that much. But it was like watching lightning strike. Or so she’d thought, until this moment.\nHer feet carried her to the crash. Four cars had piled up. They looked like fighting rhino beetles frozen mid-attack. The cars hissed and sighed as though exhausted. They had been going so fast. They always looked fast when you were standing still on the corner, of course, but she could have sworn they were going faster than usual. Faster than the limit. Faster than auto-pilot rides were supposed to go.\nShe listened for sirens. There were none.\n“Help,” she whispered. She wasn’t sure if she was calling or commanding. She stared up at the soaring towers of glass and steel that loomed over the intersection. Was anyone on their balconies? Had anyone seen? “HELP!”\n“HELP IS ON THE WAY,” one of the cars said, in a soothing voice. “DO NOT WORRY.”\nInside the cars, she heard moans of pain.\n“Hello?” Which car should she attend to, first? Where were the police? Or the ambulances? The wind whistled down through the empty concrete canyons. Lights everywhere—none of them the right color, none of them spinning. She had a first aid kit in her tent. Jun-seo had a better one. But you weren’t supposed to move the victims of a car crash. She’d heard that somewhere. Hadn’t she? “Hello?”\nSomething brushed her shoulder, and she screamed. She twisted, fists up, and Jun-seo held up his hands, palms open. “Easy,” he said. “It’s just me.”\nThe air rushed out of her. Her shoulders sagged. She wanted to hug him. She jabbed him in the belly instead. “Where were you?”\n“I’m here now,” he said. “I called the police.”\nAnd just like that, she heard the sirens. The little police cars trundled up. Medical bots popped out of their trunks and spidered across the street, bright eyes scanning, claws clicking in the air, projecting stats into the icy fog. Slowly, the police officers exited their vehicles.\n“Oh, hey, kimchi fried rice,” one said. He glanced over at Ha-eun. “Oi. You got any eggs to go with that?”\nHa-eun almost thought of not coming in, the next day. In a sick twist of luck, the accident had brought in more than enough cash to cover her for the next two days—maybe even the rest of the week. Nobody ate like cops and EMTs.\nBut that money would not last forever. So she carefully picked her way over the sleeping bodies of the other women in the residence, and got ready to leave. Even so, one of them snuffled awake, gave her a nasty look, and rolled over with an arm over her eyes. Ha-eun was the only cart owner in the room. The others all worked the night shift at a doshirak factory, working from 6 PM to 6 AM making the lunches that appeared in convenience stores all over the city. But Ha-eun’s hours were from 2 PM to 2 AM Worse, she was an independent—she paid only for the cart and the license to her space, with no hourly wage. They envied her cash flow, and she envied their security. It made living together uncomfortable.\n“I’d be in the same boat as you, if my back worked like yours,” she muttered. But it didn’t. She couldn’t stand up as long as the others could. It was that simple. She had tried, once. She had worked in a lunch factory, a supermarket, and a coffee place. It was the standing that got her pushed out, every single time. The pain was too much. And her doctor had been very clear with her—if she took painkillers every day, like she needed to, her stomach lining would open up and fill with blood. It was delicate, he said, in their video call. The robot hosting him had tilted its videoscreen head right in time with him, like a dog hearing messages on an especially high frequency.\n“You used them too much, when you were younger,” the doctor had said, through the robot. “Now you can’t do that, anymore. Not at your age.”\nSo she shrugged on her coat and wrapped up her scarf, patted the asp in her pocket and the wad of cash between her thighs, and hastened down to the bus stop. She had a long ride. Longer than most. This was suburbia, where all the hourly workers lived. And it wasn’t so bad to spend at least a little time outside. Even when it sleeted, like today, the air was cleaner.\nThe bus to her first subway stop took twenty minutes. Then the first subway ride was a half hour—forty minutes on a bad day. After that it was hard to tell: it depended on how crowded the hub was, if she had to top up her transit pass, and whether she had to deposit anything in her locker. This time she did—half the cash she’d made. It was safer here at the train station than in any bank. The locker, being a part of the train station, had anti-terror measures on it that made downtown banks look like roadside vegetable stands. They’d done a deeper background check on her when she applied for the locker than any she’d endured to obtain her cart and her food vendor’s license.\nAt first, her watch didn’t work. She had to wave it over the scanner three separate times. She had four tries available; after that, the station called a human attendant to deal with potential scammers. Instead, she opted for the “lost device” option and answered a series of passphrases. Only then did it let her in.\nHa-eun finished tucking her cash into the locker, grabbed a tin of sesame oil, a gallon jug of soy sauce, and a five-pound sack of rice. She stuffed them in a fold-out roller bag. The train station had rules about perishables in lockers, but sealed items were still okay, and so it was easier to keep her supplies there rather than lugging them clear across town on a regular basis. She pushed the locker door shut, watched it bolt shut behind her, and made her way to her train.\nLike most hubs, this train station felt almost more like its own small town than a station. There was a whole floor just for retail: clothing and electronics and walk-in clinics and robot diagnosticians and real estate booths where you could sit and tour some other place far away. And another for gyms and grocery stores. The food vendor licenses here were beyond expensive; most of the vendors here were grandfathered in from when the station was new. Ha-eun pushed past the ranks of other carts, noting the sneers of the people sitting inside. They had no need for space heaters here. Here everything was centrally heated. It was so warm they could even sell cold things: cold noodles and cold soups and even cold squid, dressed simply in vinegar and chili flakes.\nThe crowds seemed thicker than usual. Ha-eun checked the shimmering panes of glass hanging above the throng. No warnings. No alerts. And yet the escalator leading to the platform was entirely too crowded. Even if a train came now (and it was nowhere to be seen), Ha-eun would never make it to the first sitting. She looked at the other platforms. They were equally packed with people. Ha-eun peered at her watch. Nothing. She looked for a news story. The watch refused to connect to the train’s network. She had no news. No messages. No connection to the outside world.\n“Fucking idiots,” a woman in pearls muttered. “Trapping us out here in the cold.”\nFear licked up Ha-eun’s spine. It was minor, for now. Just some general unease. But she thought of the condo tower looming over her and Jun-seo’s carts, and how it had suddenly disappeared into the night, an empty column of darkness, the people inside it suddenly blind. And she thought of the rides throwing themselves at each other, as though a particularly destructive child had crashed his toys together deliberately.\n“PLEASE BE PATIENT,” the station said, in a woman’s soothing voice. “THIS TRAIN WILL BE ARRIVING SOON.”\nAn audible groan arose from the people on the platform. A man with a huge backpack jostled Ha-eun as he wriggled past. His backpack hit her in the face as he turned around. She stumbled back against her rolling bag, but the man didn’t stop to apologize. A young woman in office wear caught her elbow.\n“Are you all right, Grandma?” she asked.\n“Just fine, thank you,” Ha-eun managed to say, and moved off. Grandma. Honestly. Did she really look that old?\nShe pushed along the platform. Her roller bag snagged against someone’s briefcase, and she got a “watch it!” for her trouble. Finally she found a bench. It was one of those studded, angled ones, the kind you needed to be a yoga teacher to sit in comfortably. A child balancing precariously on it blinked at her, and tugged on his mother’s sleeve. It was made of beautiful clone sable, gleaming and gray. Ha-eun could only imagine how light and warm it felt.\n“Yes?”\n“Please excuse me,” Ha-eun prefaced, “but how long has it been like this?”\n“Almost half an hour, I think,” the woman said. “The station keeps saying that the train is coming, but . . . ” She shrugged elaborately. She gestured vaguely into the rafters above the platform. “Do you think the cameras are still working? I’m dying for a smoke.”\n“That’s a good question,” Ha-eun said. “For your sake, I hope they’re not.”\n“It’s not the fine itself, of course,” the woman said while tugging at the collar of her fur, “but it shows up on your profiles, you know. The fine for smoking. The station would tell my son’s school. And the school would tell the other mothers.”\nHa-eun couldn’t really see how it was anyone’s business if someone smoked or not, but the rich lived in a different layer of reality than she did, one where they were always connected and never truly alone. She said none of this, of course, merely smiled, excused herself, and moved on. She had an overwhelming urge to find Jun-seo. Not just to ping him, but to actually see him.\nAs though the crowd had read her mind, the people on the platform seemed to knit together even more tightly. She squinted. A fresh outpouring of people had stepped onto the platform from the escalators. Why wasn’t the station doing anything? It was supposed to know where all the passengers were, at all times. It scraped the data from all the watches and glasses and lockets and other devices. Surely the station knew how many people were waiting on the platform and how frustrated everyone they were, by now. It knew things like pulses, heartbeats, and temperatures. She had seen people taken aside when their fevers were too high, because they might be spreading one of the flus. Why wasn’t the station sending attendants? She lifted her watch to lodge a complaint.\nHer watch.\nWhen had her watch last worked?\nGranted, some functions still behaved. Time, email. The water usage in the apartment. The location of all her food in the communal fridge. But all the locative data pertaining to her location . . . when had that last worked? She hadn’t been able to access her locker or call for help when the cars crashed. It had not alerted her to any tests when the power went out in the building across from her stall.\nDid it even know she was alive? Did it know she was her?\nBlood spattered across her shoes.\nShe looked up, and two young men in front of her were hitting each other. Decades had passed since she’d last heard the sound of fists on flesh. She had forgotten how soft and small a sound it was. “I told you not to touch me!” one of the men—boys, really—shouted. His knuckles were bloody. The other boy’s face was worse; blood streamed from his mouth. They drove at each other again. The crowd widened around them.\nNow she knew for certain that the watches were broken. Not just hers. All the watches. Because they should have picked up what was happening on the platform: the raised pulses, the shouting, the arc of fists in the air. The station should have learned about the fight from the watches, and sent attendants to break it up. She looked at her fellow bystanders. They were all checking their watches. They looked at each other, not the fight. They looked around at the platform. They waited for sirens. For attention. None came.\n“No one knows we’re here,” she whispered. “No one’s coming to help.”\nWas it really that easy to bring a station of this size to a screeching halt? She had always thought it would take something like a bomb, or a toxin, like the sarin gas attack in Tokyo. But maybe not. Maybe all it took was a sudden deafening silence from everyone’s devices.\nThe young men were grappling each other, now. They twisted on the frosty platform, and the crowd shoved back and forth as their bodies rolled across the concrete and advertisements. Ha-eun gripped her rolling bag tightly and positioned it in front of her, like the cattle-catcher on an old locomotive train. As the crowd ebbed away from her, she made a break for it. She ducked into the crowd on the other side of the fight, muttering apologies and keeping her head down. People squawked and screeched as she pushed through. Why had she never thought to use her rolling bag this way? It was just the thing for parting the crowd.\nShe leaned hard on the rolling bag and steered its stubborn, whining bulk to the escalators. More people poured out. A look of horror crossed their faces as they comprehended the sheer size of the crowd waiting on the platform. They lifted their watches. Shook them. Cursed. Tried to go back up the escalators in the wrong direction. Began trampling each other. She heard a child crying. Then another.\nA thin scream rose. She turned. Someone from the edge of the crowd had fallen onto the tracks. An old man. Not much older than Jun-seo, anyway. Her heart met her throat.\n“What do we do?” she heard someone shout. “Why isn’t anyone coming?”\nA teenaged boy in a school uniform jumped down. Then another.\nAnd right on cue, she heard a distant whistle and saw a cold glow pierce the winter fog. A train. Its shriek joined with the collective scream rising on the platform. She turned away. There was nothing else to do. She could only stare at the labels and logos on her groceries. They had seemed so important just a minute ago. The shouting and the noise built and built and built, echoing on the old spray-foam ceiling, making a structure within the structure. The train howled as it tried to slow itself. It moaned over the bodies in its path. She had heard that sound only once before, just after a suicide attempt on one of the other platforms at this very station. Now it was three times worse.\nBeside her someone was abruptly sick into her rolling bag, and she didn’t even care. She stood, wiped a spatter of bile off her sleeve, and began pushing herself the length of the platform.\n“Wait, Jun-seo,” she murmured. “Please wait.”\nSnow fell softly on the chaos.\nHa-eun had never crossed the city entirely on foot before. She had always used the trains to travel under the exclusive, members-only zones: the plazas and parks meant only for elite families. They lived in pockets of airy space shrouded in trees. Here there were no towers, only houses. And not the kitbashed container houses like in Ha-eun’s neighborhood, but real ones, the old-fashioned kind, with gables and tile roofs and high stone fences crawling with ivy. Ha-eun made the mistake of staring, pausing long enough to be noticed by someone in a uniform.\n“You can’t be here,” he said.\nHe was young. His face was completely unlined, without pores, perfect. For just a moment, she wondered just how good the corporate robot technology had gotten. Then she dismissed the thought. All the prettiest robots were supposed to look like women.\n“I’m going to have to ask you to leave,” he added. “You aren’t authorized to be here.”\nHa-eun thought quickly. “What is your name?”\nHe blinked rapidly. “Excuse me?”\n“Your name. What is it?” Ha-eun put on the voice she used to talk to kids who shortchanged her. “How dare you stop me in the middle of an emergency like this? It’s snowing! I have arthritis!”\nThe young man looked suitably chastened. “It’s just we have a bunch of diplomats and security experts who live in this area,” he said in a low voice. “And, well, they’re all being called in because of what’s happening. Their rides will be going very fast. Pedestrians have to be especially careful.”\n“I’ll stay on the sidewalk,” Ha-eun said, and pushed past him.\nBlack SUVs rumbled past her as she shuffled through the snow. She had never seen trucks so big. Government types, surely. She found herself not caring. What did it matter who they were, so long as the power came back on eventually? She peered at the homes surrounding her. Most of them had power: she heard the hum of external generators. But the towers that overshadowed them had gone dark. As she crossed under a beautiful wrought iron pergola that announced the neighborhood’s exit, she saw people roving about in the streets. Thicker and thicker crowds of them, all of them waving compacts and watches and wads of cash, trying to find purchase of one kind or another. They must have poured out of the buildings once the power and the networks died. Ha-eun couldn’t remember the last time the streets had been this lively.\nPoor Jun-seo would have such a lineup to deal with, she realized. The thought quickened her steps. Under her feet, she heard the definitive crunch of snow. For the first time in months, the pain in her back had vanished.\nAfter another half hour, Ha-eun rounded the corner where Jun-seo would be waiting. The stalls were dark. Curtains drawn. No lineup. Her feet carried her across the street as the pit in her stomach deepened. She was a fool for coming this far on foot. He wasn’t worried about her. He wasn’t waiting. He’d probably never made it in—his own route must have been equally compromised. Why hadn’t she just turned around and gone home? She could be warm, at least. Warm and dry. Warm and dry and dignity intact.\n“Ha-eun?”\nShe turned. Jun-seo stood carrying a recycling bin full of paper packaging. Poster tubes, old boxes, pulp cartons. “I was going to burn all this,” he said. “It’s a good thing you got here first!”\nHa-eun could barely find her voice. “You were waiting?”\n“Of course I was waiting! All the customers told me what happened at your station. I had to wait.”\n“ . . . The customers?”\n“Oh, well.” He gestured at the stalls. “I sort of sold out early. This sort of thing is good for business, I guess. They’re saying it was some sort of hack, like a cyberattack on the infra—”\n“But you were still waiting?”\n“Yeah. Sort of stupid, huh?” He smiled sheepishly. “I guess you’ll tell me I should have gone home to get warm.”\nHa-eun scrubbed furiously at one eye. “Put that bin down!”\nHe dropped it. Ha-eun launched herself at him. Her arms came around him, tight. He was too thin, she thought. Strong, but too small. She wanted to fatten him up. Spoil him. And never stop.\n“Hey, Ha-eun . . . ” he said, “it’s okay. Everything will be fine. There are smart people working on this. I talked to one of the city people about the trains—”\n“I don’t care about the trains!” She hugged him harder.\n“Okay.” He patted her shoulders awkwardly. Then his arms settled over her shoulders. “Hey, if you’re all right walking, I don’t live very far from here. We could go there. I don’t think there will be power, but I do have a little propane stove, and some soju—”\n“Yes,” Ha-eun said. “Yes. I want to go with you.”\nHe chuckled. She felt it through her whole body. “You’ll have to let me go, first, if you want to walk anywhere,” Jun-seo said.\n“One more minute,” she said. “Just one more minute.”\nFour days later, Ha-eun knew what it felt like to stand in line at her own food stall. At least, what it would be like if she herself, Ha-eun, were terrible at her job. “They should have hired us to do this,” she said, for the third time that day. “Or people like us. The city’s full of people who can do this same job faster than some dumb trainees.”\n“We have to eat,” Jun-seo said. “And that means we have to wait.”\nIt wasn’t the food that was the problem, though. It was the fuel. Jun-seo had plenty of food in his apartment: sacks of seven-grain rice, a nice little bundle of sweet potatoes, anchovy stock, dry seaweed (they’d gotten into that early), kimchi, eggs, black bean sauce for noodles. And of course, the rice cakes and fish cakes he made every day. It should have sustained them. And it could have.\nIf they’d only had enough fuel to cook with.\n“I thought you said you had more propane,” Ha-eun had said.\n“I thought I did,” Jun-seo had said. And that was that.\nNaturally all the convenience stores and other shops were out of the stuff by the time they ran out. Bizarrely, the shops were still open. They’d gone back to cash. Some places used barter—hot coffee was the new money. Wait times were murderously slow; no one knew how to total up a bill, anymore, not to mention do percentages. Sales tax quickly became a distant memory.\n“It’s like when the currency was failing,” Jun-seo said. “Remember that? When everyone turned in their gold?”\nHa-eun did remember. And Jun-seo was right: this was much the same. At least, the same in spirit. She had turned over her wedding band back then. The damn thing had never done her much good, anyway, even when she still wore it. This time she had turned over all her food—what rice and eggs and kimchi she still had in the stall became the army’s property, turned over the morning after she found Jun-seo in the snow. At least, she had turned them over in theory. What really happened was that she found a notice from the army on her stall, with an itemized list of what they’d “requisitioned,” and a site she could access when the networks came back in order to obtain her reimbursement. She was to give them an estimate of monetary value. She wondered how much she could fudge it. Maybe if she claimed it was fancy organic stuff they’d taken. The list they left behind didn’t include brand names.\n“Come on,” Jun-seo said, and they shuffled forward to close the gap ahead of them in line.\nShe had expected chaos, but it was all very . . . orderly. The army kept on talking about the pluck and industriousness of the Korean national spirit. They pasted broadsheets reminding people how to use weather radios, and the radio stations talked about how the worst was behind them and there was nothing to worry about, how systems would come back online as soon as possible, how people were at work round the clock. Trucks with loudspeakers trundled down the newly quiet roads, blaring messages about pulling together in the struggle, sharing hand sanitizers, wearing flu masks, and where the city warming stations were.\n“We’re lucky we’re old,” Ha-eun said. “They wouldn’t let us in here, otherwise.”\nThe warming stations were only for the very young or the very old. Ha-eun didn’t like to think of herself as very old, but for the moment she was willing to let the army think of her that way. And it was still better than being one of the exhausted parents in line, trying to corral kids in snow pants who wouldn’t quit demanding their old devices. No, you can’t play with those right now, they kept saying. No, I don’t know when the network is coming back.\nInside the warming station, they had ninety minutes. There was hot tea and instant noodles and tinned fish and whatever the army had managed to put together. The first day, all the restaurants gave up their supply. The second day, there was less to work with. The army had extra propane, and they could make do, but getting the supplies in without trains was a challenge. The Japanese had promised to send supplies. And the Americans, of course. The Red Cross. The Red Cross was supposed to be good at handling things without any computers or data streams. They’d done the same in worse places, where no one had handhelds or chips. With all the smart stickers and wearables dead, nobody had any sense of inventory or location any longer, of who needed what and where. The warming station did regular headcounts. Ha-eun had heard they were doing the same things at hospitals.\n“It’s like going back in time,” Ha-eun said.\nJun-seo sipped at a cup of instant noodles. “I like it,” he admitted. “It makes me feel younger.”\n“What were you like, back then?”\nHe shrugged. “Not so different.”\n“You liked castles?”\n“I wanted to be an architect.”\nThis fact fell under the “Things I Do Not Know About Jun-seo” category in Ha-eun’s mind. It was odd, to work alongside someone for so long, and not know the simplest things about them. “What happened?” she asked.\n“I got someone pregnant.”\nHa-eun hissed in sympathy. Jun-seo snorted. They stared out at the children—babies, really—in the warming station. There were yoga mats and cots set up, and someone had thought to bring in old-fashioned toys and books, the kind that didn’t need charging.\n“Did you have kids?” Jun-seo asked.\nHa-eun shook her head. “I wouldn’t be any good at it. It was the one thing my husband and I agreed on.”\n“You were married?”\n“For about five minutes, once.”\n“We should get married,” Jun-seo said.\nHa-eun coughed on her tea. It almost went out her nose. “What?”\n“It would be easier,” he said. “Legally. What if we get separated, in this situation? The government would have no idea who to contact. Or what if one of us is injured, or becomes ill? The other could be an advocate, in the hospital. Also I think that, when the business starts up again, we would get a better deal on cart space as a family. They prioritize family business licenses. We could move to a different corner, where there’s more foot traffic. Maybe even one of the stations.”\nHa-eun stared at him. “How long have you been thinking about this?”\nHe shrugged. “Oh, the last ten years. Give or take.”\n“And now you tell me?!”\nThe others in the warming station gave her a sharp look. In the absence of trains, train etiquette had taken over the shared spaces: one had to maintain an equal volume with one’s neighbors, or risk deep disapproval. “Now?” she repeated.\n“Why not now? I waited for you, in the snow. My head was telling me to leave, but my feet wouldn’t let me move. And you came to me. You came right to me.” He peered at her over the rising steam from his noodles. “So, Ha-eun, why not now?”\n“Because . . . ” She blinked. She stared out at all the families crowding around the space heaters, rubbing their arms. What if this didn’t end? What if the systems never came back? Until this moment, she had not allowed herself to consider the possibility. But here in this room bathed in orange emergency light, she had to face it. They were all running scared, like pheasants flushed from the undergrowth. What attack might come next? Was this just the first phase of something much worse?\n“Nothing,” she said. “Forget I said anything. I can’t think of a reason, aside from maybe the fact that there isn’t an office to grant us a license. At least, not in the city.”\n“Then we’ll have to go to the country,” Jun-seo said. He slurped the last of his broth. “Some of the other families are leaving. I’ll ask who has room for a couple of cooks.”\nOriginally published in The Atlantic Council Art of Future Warfare Project: War Stories from the Future, edited by August Cole, 2015.\nMadeline Ashby is a science fiction writer and futurist living in Toronto. She has worked with Intel Labs, the Institute for the Future, SciFutures, Nesta, Data & Society, The Atlantic Council, the ASU Center for Science and the Imagination, Changeist, and others. She has spoken at SXSW, FutureEverything, MozFest, and other events. Her essays have appeared at BoingBoing, io9, WorldChanging, Creators Project, Arcfinity, MISC Magazine, and FutureNow. Her fiction has appeared in Slate, MIT Tech Review, and elsewhere. She is the author of the Machine Dynasty novels. Her novel Company Town was a Canada Reads finalist."}