{"fingerprint": "5KCLnloqe8DklAC8df5PRjlezqQ=", "sitename": "Clarkesworld Magazine", "title": "Softly Spoke the Gabbleduck by Neal Asher", "author": "Neal Asher", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/asher_08_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Softly Spoke the Gabbleduck by Neal Asher", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9110 words, novelette, REPRINT\nSoftly Spoke the Gabbleduck\nLost in some perverse fantasy, Tameera lovingly inspected the displays of her Optek rifle. For me, what happened next proceeded with the unstoppable nightmare slowness of an accident. She brought the butt of the rifle up to her shoulder, took careful aim, and squeezed off a single shot. One of the sheq slammed back against a rock face then tumbled down through vegetation to land in the white water of a stream.\nSome creatures seem to attain the status of myth even though proven to be little different from other apparently prosaic species. On Earth the lion contends with the unicorn, the wise old elephant never forgets, and gentle whales sing haunting ballads in the deeps. It stems from anthropomorphism, is fed by both truth and lies, and over time firmly embeds itself in human culture. On Myral, where I had spent the last ten years, only a little of such status attached to the largest autochthon—not surprising for a creature whose name is a contraction of “shit-eating quadruped.” But rumors of something else in the wilderness, something that had no right to be there, had really set the myth-engines of the human mind into motion, and brought hunters to this world.\nThere was no sign of any sheq on the way out over the narrow vegetation-cloaked mounts. They only put in an appearance after I finally moored my blimp to a peak, above a horizontal slab on which blister tents could be pitched. My passengers noticed straight away that the slab had been used many times before, and that my mooring was an iron ring long set into the rock, but then, campsites were a rarity amid the steep slopes, cliffs, and streams of this area. It wasn’t a place humans were built for. Sheq country.\nSoon after he disembarked, Tholan went over to the edge to try out one of his disposable vidcams. The cam itself was about the size of his forefinger, and he was pointing it out over the terrain while inspecting a palm com he held in his other hand. He had unloaded a whole case of these cams, which he intended to position in likely locations, or dangle into mist pockets on a line—a hunter’s additional eyes. He called me over. Tameera and Anders followed.\n“There.” He nodded downwards.\nA seven of sheq was making its way across the impossible terrain—finding handholds amid the lush vertical vegetation and traveling with the assurance of spiders on a wall. They were disconcertingly simian, about the size of a man, and quadruped—each limb jointed like a human arm but ending in hands bearing eight long prehensile fingers. Their heads, though, were anything but simian, being small, insectile, like the head of a mosquito but with two wide trumpet-like probosces.\n“They won’t be a problem will they?” Tholan’s sister, Tameera, asked.\nShe was the most xenophobic, I’d decided, but then such phobia made little difference to their sport: the aliens they sought out usually being the “I’m gonna chew off the top of your head and suck out your brains” variety.\n“No—so long as we leave them alone,” said Tholan. Using his thumb on the side controls of his palm com, he increased the camera’s magnification, switching it to infrared then ultrasound imaging.\n“I didn’t load anything,” said Anders, Tholan’s PA. “Are they herbivores?”\n“Omnivores,” I told her. “They eat some of that vegetation you see and supplement their diet with rock conch and octupal.”\n“Rock conch and octupal indeed,” said Anders.\nI pointed to the conch-like mollusks clinging to the wide leaves below the slab.\nAnders nodded then said, “Octupal?”\n“Like it sounds: something like an octopus, lives in pools, but can drag itself overland when required.” I glanced at Tameera and added, “None of them bigger than your hand.”\nI hadn’t fathomed this trio yet. Brother and sister hunted together, relied on each other, yet seemed to hate each other. Anders, who I at first thought Tholan was screwing, really did just organize things for him. Perhaps I should have figured them out before agreeing to being hired, then Tameera would never have taken the shot she then took.\nThe hot chemical smell from the rifle filled the unbreathable air. I guessed they used primitive projectile weapons of this kind to make their hunts more sporting. I didn’t know how to react. Tholan stepped forwards and pushed down the barrel of her weapon before she could kill another of the creatures.\n“That was stupid,” he said.\n“Do they frighten you?” she asked coquettishly.\nI reached up and checked that my throat plug was still in place, for I felt breathless, but it was still bleeding oxygen into my bronchus. To say that I now had a bad feeling about all this would be an understatement.\n“You know that as well as putting us all in danger, she just committed a crime,” I said conversationally, as Tholan stepped away from his sister.\n“Crime?” he asked.\n“She just killed a C-grade sentient. If the Warden AI finds out and can prove she knew before she pulled the trigger, then she’s dead. But that’s not the main problem now.” I eyed the sheq seven, now six. They seemed to be confused about the cause of their loss. “Hopefully they won’t attack, but it’ll be an idea to keep watch.”\nHe stared at me, shoved his cam into his pocket. I turned away and headed back. Why had I agreed to bring these bored aristos out here to hunt for Myral’s mythic gabbleduck? Money. Those who have enough to live comfortably greatly underestimate it as a source of motivation. Tholan was paying enough for me to pay off all I owed on my blimp, and prevent a particular shark from paying me a visit to collect interest by way of involuntarily donated organs. It would also be enough for me to upgrade my apartment in the citadel, so I could rent it while I went out to look at this world. I’d had many of the available cerebral loads and knew much about Myral’s environment, but that wasn’t the same as experiencing it. Still there was much for me to learn, to know. Though I was certain that the chances of my finding a gabbleduck—a creature from a planet light-centuries away—anywhere on Myral, were lower than the sole of my boot.\n“She only did that to get attention,” said Anders at my shoulder.\n“Well, let’s hope she didn’t succeed too well,” I replied. I looked up at my blimp, and considered the prospect of escaping this trio and bedding down for the night. Certainly we would be getting nothing more done today, what with the blue giant sun gnawing the edge of the world as it went down.\n“You have to excuse her. She’s over-compensating for a father who ignored her for the first twenty years of her life.”\nAnders had been coming on to me right from the start and I wondered just what sort of rich bitch game she was playing, though to find out I would have to let my guard down, and that I had no intention of doing. She was too much: too attractive, too intelligent, and just being in her presence set things jumping around in my stomach. She would destroy me.\n“I don’t have to excuse her,” I said. “I just have to tolerate her.”\nWith that, I headed to the alloy ladder extending down from the blimp cabin.\n“Why are they called shit-eaters?” she asked falling into step beside me. Obviously she’d heard where the name sheq came from.\n“As well as the rock conch and octupal, they eat each others shit—running it through a second intestinal tract.”\nShe winced.\nI added, “But it’s not something they should die for.”\n“You’re not going to report this are you?” she asked.\n“How can I—he didn’t want me carrying traceable com.”\nI tried not to let my anxiety show. Tholan didn’t want any of Myral’s AIs finding out what he was up to, so, as a result, he provided all our com equipment, and it was encoded. I was beginning to wonder if that might be unhealthy for me.\n“You’re telling me you have no communicator up there?” She pointed up at the blimp.\n“I won’t report it,” I said, then climbed, wishing I could get away with pulling the ladder up behind me, wishing I had not stuck so rigidly to the wording of the contract.\nMidark is that time when it’s utterly black on Myral, when the sun is precisely on the opposite side of the world from you. It comes after five hours of blue, lasts about three hours prior to the next five hours of blue—the twilight that is neither day nor night and is caused by reflection of sunlight from the sub-orbital dust cloud. Anyway, it was at midark when the screaming and firing woke me. By the time I had reattached my oxygen bottle and was clambering down the ladder, some floods were lighting the area and it was all over.\n“Yes, you warned me,” Tholan spat.\nI walked over to Tameera’s tent, which was ripped open and empty. There was no blood, but then the sheq would not want to damage the replacement. I glanced at Anders, who was inspecting a palm com.\n“She’s alive.” She looked up. “She must have been using her own oxygen supply rather than the tent’s. We have to go after her now.”\n“Claw frames in midark?” I asked.\n“We’ve got night specs.” She looked at me as if she hadn’t realized until then how stupid I was.\n“I don’t care if you’ve got owl and cat genes—it’s suicide.”\n“Do explain,” said Tholan nastily.\n“You got me out here as your guide. The plan was to set up a base and from it survey the area for any signs of the gabbleduck—by claw frame.”\n“Yes . . . ”\n“Well, claw frames are only safe here during the day.”\n“I thought you were going to explain.”\n“I am.” I reached out, detached one of the floods from its narrow post, and walked with it to the edge of the slab. I shone it down revealing occasional squirming movement across the cliff of vegetation below.\n“Octupals,” said Anders. “What’s the problem?”\nI turned to her and Tholan. “At night they move to new pools and, being slow-moving, they’ve developed a defense. Anything big gets too close, and they eject stinging barbs. They won’t kill you, but you’ll damned well know if you’re hit, so unless you’ve brought armored clothing . . . ”\n“But what about Tameera?” Anders asked.\n“Oh the sheq will protect her for a while.”\n“While?” Tholan queried.\n“At first they’ll treat her like an infant replacement for the one she killed,” I told him. “So they’ll guide her hands and catch her if she starts to fall. After time they’ll start to get bored, because sheq babies learn very quickly. If we don’t get to her before tomorrow night’s first blue, she’ll probably have broken her neck.”\n“When does this stop?” He nodded towards the octupal activity.\n“Mid-blue.”\n“We go then.”\nThe claw frame is sporting development from military exoskeletons. The frame itself braces your body. A spine column rests against your back like a metal flatworm. Metal bones from this extend down your legs and along your arms. The claws are four times the size of human hands, and splayed out like big spiders from behind them, and from behind the ankles. Each finger is a piton, and programmed to seek out crevices on the rock face you are climbing. The whole thing is stronger, faster, and more sensitive than a human being. If you want, it can do all the work for you. Alternatively, it can just be set in neutral, the claws folded back, while you do all the climbing yourself—the frame only activating to save your life. Both Anders and Tholan, I noted, set theirs to about a third-assist, which is where I set mine. Blister tents and equipment in their backpacks, and oxygen bottles and catalyzers at their waists, they went over the edge ahead of me. Tameera’s claw frame scrambled after them—a glittery skeleton—slaved to them. I glanced back at my blimp and wondered if I should just turn round and go back to it. I went over the edge.\nWith the light intensity increasing and the octupals bubbling down in their pools we made good time. Later, though, when we had to go lower to keep on course after the sheq, things got a bit more difficult. Despite the three of us being on third-assist we were panting within a few hours, as lower down there was less climbing and more pushing through tangled vegetation. I noted that my catalyzer pack was having trouble keeping up—cracking the C02 atmosphere and topping up the two flat bodyform bottles at my waist.\n“She’s eight kilometers away,” Anders suddenly said. “We’ll not reach her at this rate.”\n“Go two-thirds assist,” said Tholan.\nWe all did that, and soon our claw frames were moving faster through the vegetation and across the rock-faces than was humanly possible. It made me feel lazy—like I was just a sack of flesh hanging on the hard-working claw frame. But we covered those eight kilometers quickly and as the sun breached the horizon, glimpsed the sheq far ahead of us, scrambling up from the sudden shadows in the valleys. They were a seven again now, I saw: Tameera being assisted along by creatures that had snatched the killer of one of their own, mistaking her for sheq herself.\n“Why do they do it?” Anders asked as we scrambled along a vertical face.\n“Do what?”\n“Snatch people to make up their sevens.”\n“Three reason’s I’ve heard: optimum number for survival, or seven sheq required for successful mating, or the start of a primitive religion.”\n“Which do you believe it is?”\n“Probably a bit of them all.”\nAs we drew closer, I could hear Tameera sobbing in terror, pure fatigue, and self-pity. The six sheq were close around her, nudging her along, catching her feet when they slipped, grabbing her hands and placing them in firmer holds. I could also see that her dark green slicksuit was spattered with a glutinous yellow substance, and felt my gorge rising at what else she had suffered. They had tried to feed her.\nWe halted about twenty meters behind on a seventy-degree slope and watched as Tameera was badgered towards where it tilted upright then past the vertical.\n“How do we play this?” Tholan asked.\n“We have to get to her before they start negotiating that.” I pointed at the lethal terrain beyond the sheq. “One mistake there and . . . ” I gestured below to tilted slabs jutting from undergrowth, half hidden under fog generated by a nearby waterfall. I didn’t add that we probably wouldn’t even be able to find the body; despite the tracker Tameera evidently wore. “We’ll have to run a line to her. Anders can act as the anchor. She’ll have to make her way above, and probably best if she takes Tameera’s claw frame with her. You’ll go down slope to grab Tameera if anything goes wrong and she falls. I’ll go in with the line and the harness.”\n“You’ve done this before?” Anders asked.\n“Have you?” I countered.\n“Seems you know how to go about it,” Tholan added.\n“Just uploads from the planetary almanac.”\n“Okay, we’ll do it like you said,” Tholan agreed.\nI’d noticed all three of them carried fancy monofilament climbing winders on their belts. Anders set hers unwinding its line, which looked thick as rope with cladding applied to the monofilament on its way out. I took up the ring end of the line and attached the webbing harness Tholan took from one of his pack’s many pockets.\n“Set?” I asked.\nThey both nodded, Tholan heading downslope and Anders up above. Now, all I had to do was get to Tameera through the sheq and get her into the harness.\nAs I drew closer, the creatures began to notice me and those insectile heads swung towards me, probosces pulsating as if they were sniffing.\n“Tameera . . . Tameera!”\nShe jerked her head up, yellow gunk all around her mouth and spattered across her face. “Help me!”\n“I’ve got a line here and a harness,” I told her, but I wasn’t sure if she understood.\nI was about three meters away when the sheq that had been placing her foot on a thick root growing across the face of stone, abruptly spun and scrambled towards me. Tholan’s Optek crashed and I saw the explosive exit wound open in the creature’s jade green torso—a flower of yellow and pink. It sighed, sagged, but did not fall—its eight-fingered hands tangled in verdancy. The other sheq dived for safer holds and pulled close to the rock face.\n“What the fuck!”\n“Just get the harness on her!” Tholan bellowed.\nI moved in quickly, not so much because he ordered it, but because I didn’t want him blowing away more of the creatures. Tameera was at first lethargic, but then she began to get the idea. Harness on, I moved aside.\n“Anders!”\nAnders had obviously seen, because she drew the line taut through greenery and began hauling Tameera upwards, away from sheq now beginning to nose in confusion towards their second dead member. Stripped-off line cladding fell like orange snow. I reached out, shoved the dead sheq, once, twice, and it tumbled down the slope, the rest quickly scrambling after it. Tholan was moving aside, looking up at me. I gestured to a nearby mount with a flat top on which we could all gather.\n“Got her!” Anders called.\nGlancing up I saw Anders installing Tameera in the other claw frame. “Over there!” I gestured to the mount. Within a few minutes we were all on the small area of level stone, gazing down towards where the five remaining sheq had caught their companion, realized it was dead and released it again, and were now zipping about like wasps disturbed from a nest.\n“We should head back to the blimp, fast as you like.”\nNo one replied because Tameera chose that moment to vomit noisily. The stench was worse even than that from the glutinous yellow stuff all over her.\n“What?” said Anders.\n“They fed her,” I explained.\nThat made Anders look just as sick.\nFinally sitting up, then detaching her arms from her claw frame, Tameera stared at her brother and held out her hand. He unhitched his pack, drew out her Optek rifle and handed it over. She fired from that sitting position, bowling one of the sheq down the distant slope and the subsequent vertical drop.\n“Look you can’t—”\nThe barrel of Tholan’s Optek was pointing straight at my forehead.\n“We can,” he said.\nI kept my mouth shut as, one by one, Tameera picked off the remaining sheq and sent them tumbling down into the mist-shrouded river canyon. It was only then that we returned to the slab campsite.\nBlue again, but I was certainly ready for sleep and felt a surge of resentment when the blimp cabin began shaking. Someone was coming up the ladder, then walking round the catwalk. Shortly, Anders opened the airtight door and hauled herself inside. I saw her noting with some surprise how the passenger cabin converted into living quarters. I was ensconced in the cockpit chair, sipping a glass of whisky, feet up on the console. She turned off her oxygen supply, tried the air in the cabin, then sat down on the corner of the fold-down bed, facing me.\n“Does it disgust you?” she asked.\nI shrugged. Tried to stay nonchalant. What was happening below didn’t bother me, her presence in my cabin did.\nShe continued, “There’s no reason to be disgusted. Incest no longer has the consequences it once had. All genetic faults can be corrected in the womb . . . ”\n“Did I say I was disgusted? Perhaps it’s you, why else are you up here?”\nShe grimaced. “Well they do get noisy.”\n“I’m sure it won’t last much longer,” I said. “Then you can return to your tent.”\n“You’re not very warm are you?”\n“Just wary—I know the kind of games you people play.”\n“You people?”\n“The bored and the wealthy.”\n“I’m Tholan’s PA. I’m an employee.”\nI sat there feeling all resentful, my resentment increased because of course she was right. I should not have lumped her in the same category as Tholan and his sister. She was in fact in my category. She had also casually just knocked away one of my defenses.\n“Would you like a drink?” I eventually asked, my mouth dry.\nNow I expected her righteous indignation and rejection. But Anders was more mature than that, more dangerous.\n“Yes, I would.” As she said it, she undid the stick seams of her boots and kicked them off. Then she detached the air hose from her throat plug, coiled it back to the bottle, then unhooked that from her belt and put it on the floor. I hauled myself from my chair and poured her a whisky, adding ice from my recently installed little fridge.\n“Very neat,” she said, accepting the drink. As I made to step past her and return to the cockpit chair, she caught hold of my forearm and pulled me down beside her.\n“You know,” I said, “that if we don’t report what happened today that would make us accessories. That could mean readjustment, even mind-wipe.”\n“Are you hetero?” she asked.\nI nodded. She put her hand against my chest and pushed me back onto the bed. I let her do it—laid back. She stood up, looking down at me as she drained her whisky. Then she undid her trousers, dropped them, and kicked them away, then climbed astride me still wearing her shirt and very small briefs. Still staring at me she undid my trousers, freed my erection, then pulling aside the crutch of her briefs, slowly slid down onto me. Then she began to grind back and forth.\n“Just come,” she said, when she saw my expression. “You’ve got all night to return the favor.” I managed to hold on for about another thirty seconds. It had been a while. Afterwards, we stripped naked, and I did return the favor. And then we spent most of the blue doing things to each other normally reserved for those for whom straight sex had become a source of ennui.\n“You know, Tholan will pay a great deal for your silence, one way or another.”\nI understood that Tholan might not pay me for my silence. I thought her telling me this worthy of the punishment I then administered, and which she noisily enjoyed, muffling her face in the pillow.\nWe slept a sleep of exhaustion through midark.\nTameera wanted trophies. She wanted a pair of sheq heads to cunningly preserve and mount on the gateposts on either side of the drive to her and Tholan’s property on Earth. Towards the end of morning blue, we ate recon rations and prepared to set out. I thought it pointless to tell them of the penalties for possessing trophies from class C sentients. They’d already stepped so far over the line it was a comparatively minor crime.\n“What we need to discuss, is my fee,” I said.\n“Seems to me he’s already had some payment,” said Tameera, eyeing Anders.\nTholan shot her a look of annoyance and turned back to me. “Ten times what I first offered. No one needs to know.”\n“Any items you bring back you’ll carry in your stuff,” I said.\nI wondered at their arrogance. Maybe they’d get away with it—we’d know soon enough upon our return to the citadel—but most likely, a drone had tagged one of the sheq, and as the creature died, a satellite eye had recorded the event. The way I saw it, I could claim to have been scared they would kill me, and only keeping up the criminal facade until we reached safety. Of course, if they did get away with what they’d done, there was no reason why I shouldn’t benefit.\nWhile we prepared, I checked the map in my palm com, input our position and worked out an easier course than the one we had taken the day before. The device would keep us on course despite the fact that Tholan had allowed no satellite link-up. By the sun, by its own elevation, the time, and by reading the field strength of Myral’s magnetosphere the device kept itself accurately located on the map I’d loaded from the planetary almanac.\nWe went over the edge as the octupals slurped and splashed in their pools and the sun flung arc-welder light across the land. This time we took it easy on third assist, also stopping for meals and rest. During one of these breaks, I demonstrated how to use a portable stove to broil a rock conch in its shell, but Tholan was the only one prepared to sample the meat. I guess it was a man thing. As we traveled I pointed out flowering spider vines, their electric red male flowers taking to the air in search of the blowsy yellow female flowers: these plants and their pollinating insects having moved beyond the symbiosis seen on Earth to become one. Then, the domed heads of octupals rising out of small rock pools to blink bulbous gelatinous eyes at the evening blue, we moored our blister tents on a forty-degree slope.\nAnders connected my tent to hers, whilst a few meters away Tholan and Tameera connected their tents. No doubt they joined their sleeping bags in the same way we did. Sex, in a tent fixed to such a slope, with a sleeping bag also moored to the rock through the ground sheet, was a bit cramped. But it was enjoyable and helped to pass most of the long night. Sometime during midark I came half awake to the sound of a voice. “Slabber gebble-crab,” and “speg bruglor nomp,” were its nonsensical utterances. The yelling and groaning from Tholan, in morning blue, I thought due to he and his sister's lovemaking. But in full morning I had to pick octupal stings from the fabric of my tent, and I saw that Tholan wore a dressing on his cheek.\n“What happened?” I asked.\n“I just stuck my damned head out,” he replied.\n“What treatment have you used?”\n“Unibiotic and antallergens.”\n“That should do it.”\nShame I didn’t think to ask why he wanted to leave his tent and go creeping about in the night. That I attributed the strange voice in midark to dream, influenced things neither one way nor the other.\nIt was only a few hours into the new day that we reached the flat-topped mount from which Tameera had slaughtered the remaining sheq. I studied the terrain through my monocular and realized how the excitement of our previous visit here had blinded me to just how dangerous this area was. There wasn’t a slope below seventy degrees and many of the river valleys and canyons running between the jagged rocks below were full of rolling mist. Claw frames or not, this was about as bad as it could get.\n“Well, that’s where they should be,” said Tholan, lowering his own monocular and pointing to a wider canyon floored with mist out of which arose the grumble of a river.\n“If they haven’t been swept away,” I noted.\nIgnoring me he continued, “We’ll work down from where they fell. Maybe some of them got caught in the foliage.”\nFrom the mount, we traveled down, across a low ridge, then up onto the long slope from which we had rescued Tameera. I began to cut down diagonally, and Anders followed me while Tameera and Tholan kept moving along high to where the sheq had been, though why they were going there I had no idea, for we had seen every one fall. Anders was above me when I began to negotiate a whorled hump of stone at the shoulder of a cliff. I thought I could see a sheq caught in some foliage down there. As I was peering through the mist, Anders screamed above me. I had time only to glance up, and drive my frame’s fingers into stone when she barreled into me. We both went over. Half detached from her frame she clung around my neck. I looked up to where two fingers of my frame held us suspended. I noted that her frame—the property of Tholan and Tameera—was dead weight. Then I looked higher and guessed why.\nBrother and sister were scrambling down towards us, saying nothing, not urging us to hang on. I guessed that was precisely what they did not want us to do. It must have been frustrating for Tholan: the both of us in one tent that could have been cut from its moorings—two witnesses lost in the unfortunate accident—but sting-shooting mollusks preventing him from committing the dirty deed. I reached round with my free claw and tightly gripped Anders’ belt, swung my foot claws in and gripped the rock face with them.\n“Get the frame off.”\nShe stared at me in confusion, then looked up the slope and I think all the facts clicked into the place. Quickly, while I supported her, she undid her frame’s straps, leaving the chest straps until last. It dropped into the mist: a large chrome harvestman spider . . . a dead one.\n“Okay, round onto my back and cling on tightly.”\nShe swung round quickly. Keeping to third-assist—for any higher assistance and the frame might move too fast for her to hang on—I began climbing down the cliff to the mist. The first Optek bullet ricocheted off the stone by my face. The second ricochet, by my hand, was immediately followed by an animal grunt from Anders. Something warm began trickling down my neck and her grip loosened.\nUnder the mist, a river thrashed its way between tilted slabs. I managed to reach one such half-seen slab just before Anders released her hold completely as she fainted. I laid her down and inspected her wound. The ricochet had hit her cheekbone and left a groove running up to her temple. It being a head wound, there was a lot of blood, but it didn’t look fatal if I could get her medical attention. But doing anything now with the medical kits we both carried seemed suicidal. I could hear the mutter of Tameera and Tholan’s voices from above—distorted by the mist. Then, closer, and lower down by the river, another voice:\n“Shabra tabul. Nud lockock ocker,” something said.\nIt was like hiding in the closet from an intruder, only to have something growl right next to you. Stirred by the constant motion of the river, the mist slid through the air in banners, revealing and concealing. On the slab, we were five meters above the graveled riverbank upon which the creature squatted. Its head was level with me. Anders chose that moment to groan and I quickly slapped my hand over her mouth. The creature was pyramidal, all but one of its three pairs of arms folded complacently over the jut of its lower torso. In one huge black claw it held the remains of a sheq. With the fore-talon of another claw, it was levering a trapped bone from the white holly-thorn lining of its duckbill. The tiara of green eyes below its domed skull glittered.\n“Brong da bulla,” it stated, having freed the bone and flung it away.\nIt was no consolation to realize that the sheq corpses had attracted the gabbleduck here. Almost without volition, I crouched lower, hoping it did not see me, hoping that if it did, I could make myself appear less appetizing. My hands shaking, I reached down and began taking line off the winder at Anders’ belt. The damned machine seemed so noisy and the line far too bright an orange. I got enough to tie around my waist as a precaution. I then undid the straps to her pack, and eased her free of that encumbrance. Now, I could slide her down towards the back of the slab, taking us out of the creature’s line of sight, but that would put me in the foliage down there and it would be sure to hear me. I decided to heave her up, throw her over my shoulder, and just get out of there as fast as I could. But just then, a bullet smacked into the column of my claw frame and knocked me down flat, the breath driven out of me.\nI rolled over, looking towards the gabbleduck as I did so. I felt my flesh creep. It was gone. Something that huge had no right to be able to move so quickly and stealthily. Once on my back I gazed up at Tholan and his sister as they came down the cliff. My claw frame was heavy and dead, and so too would I be, but whether by bullet or chewed up in that nightmare bill was debatable.\nThe two halted a few meters above and, with their claw frames gripping backwards against the rock, freed their arms so they could leisurely take aim with their Opteks. Then something sailed out of the mist and slammed into the cliff just above Tameera, and dropped down. She started screaming, intestines and bleeding flesh caught between her and the cliff—the half-chewed corpse of a sheq. The gabbleduck loomed out of the mist on the opposite side of the slab from where it had disappeared, stretched up and up and extended an arm that had to be three meters long. One scything claw knocked Tameera’s Optek spinning away and made a sound like a knife across porcelain as it scraped stone. On full automatic Tholan fired his weapon into the body of the gabbleduck, the bullets thwacking away with seemingly no effect. I grabbed Anders and rolled with her to the side of the slab, not caring where we dropped. We fell through foliage and tangled growth, down into a crevice where we jammed until I undid my frame straps and shed my pack ahead of us.\n“Shabber grubber shabber!” the gabbleduck bellowed accusingly.\n“Oh god oh god oh god!” Tameera.\nMore firing from Tholan.\n“Gurble,” tauntingly.\n“I’ll be back for you, fucker!”\nI don’t know if he was shouting at the gabbleduck or me.\nThere was water in the lower part of the crevice—more than enough to fill my purifying bottle and to clean the blood from Anders’ wound before dressing it. I used a small medkit diagnosticer on her and injected the drugs it manufactured in response to her injuries. Immediately her breathing eased and her color returned. But we were not in a good position. The gabbleduck was moving about above us, occasionally making introspective and nonsensical comments on the situation. A little later, when I was trying to find some way to set up the blister tent, a dark shape occluded the sky above.\n“Urbock shabber goh?” the gabbleduck enquired, then not being satisfied with my lack of response, groped down into the crevice. It could reach only as far as the ridge where my claw frame was jammed. With a kind of thoughtful impatience, it tapped a fore-talon against the stone, then withdrew its arm.\n“Gurble,” it decided, and moved away.\nApparently, linguists who have loaded a thousand languages into their minds, despair trying to understand gabbleducks. What they say is nonsensical, but frustratingly close to meaning. There’s no reason for them to have such complex voice boxes, especially to communicate with each other, as on the whole they are solitary creatures and speak to themselves. When they meet it is usually only to mate or fight, or both. There’s also no reason for them to carry structures in their skulls capable of handling vastly complex languages. Two thirds of their large brains they seem to use hardly at all. Science, in their case, often supports myth.\nDriving screw pitons into either side of the crevice, I was eventually able to moor the tent across. Like a hammock, the tough material of the groundsheet easily supported our weight, even with all the contortions I had to go through to get Anders into the sleeping bag. Once she was safely ensconced, I found that evening blue had arrived. Using a torch, I explored the crevice, finding how it rose to the surface at either end. Then the danger from octupals, stirring in the sump at the crevice bottom, forced me back to the tent. The following night was not good. A veritable swarm of octupal swamping the tent had me worrying that their extra weight would bring it down. It was also very very dark, down there under the mist. Morning took forever to arrive, but when it eventually did, Anders regained consciousness.\n“They tried to kill us,” she said, after lubricating her mouth with purified water.\n“They certainly did.”\n“Where are we now?”\n“In a hole.” She stared at me and I went on to explain the situation.\n“So how do we get out of this?” she eventually asked.\n“We’ve both lost our claw frames, but at least we’ve retained our oxygen bottles and catalyzers I wish I’d told Tholan to screw his untraceable com bullshit.” I thought for a moment. “What about your palm-com? Could we use it to signal?”\n“It’s his, just like the claw frame I was using. He’ll have shut it down by now. Should we be able to get to it.” She looked up. Her backpack was up there on the slab, up there with the gabbleduck.\n“Ah.”\nShe peered at me. “You’re saying you really have no way of communicating with the citadel?”\n“Not even on my blimp. You saw my contract with Tholan. I didn’t risk carrying anything, as he seems the type to refuse payment for any infringements.”\n“So what now?” she asked.\n“That rather depends on Tholan and Tameera . . . and on you.”\n“Me?”\n“I’m supposing that, as a valued employee, you too have one of these implants?” Abruptly she got a sick expression. I went on, “My guess is that those two shits have gone for my blimp to bring it back here. If we stay in one place, they’ll zero in on your implant. If we move they’ll still be able to track us. We’ll have to stay down low under the mist and hope they don’t get any lucky shots in. The trouble is that to our friend down here we would be little more than an entree.”\n“You could leave me—make your own way back. Once out of this area they’d have trouble finding you.”\n“It had to be said,” I agreed. “Now let’s get back to how we’re going to get out of here.”\nAfter we had repacked the blister tent and sleeping bag, we moved to the end of the crevice, which, though narrow, gave easier access to the surface. Slanting down one way, to the graveled banks of the river, was another slab, bare and slippery. Above us was the edge of the slab we had rolled from, and behind that, disappearing into mist, rose the wall of stone I had earlier descended. Seeing this brought home to me just how deep was the shit trap we occupied. The citadel was just over two hundred kilometers away. I estimated our travel rate at being not much more than a few kilometers a day. The journey was survivable. The Almanac loadings I’d had told me what we could eat, and there would never be any shortage of water. Just so long as our catalyzers held out and neither of us fell . . .\n“We’ll run that line of yours between us, about four meters to give us room to maneuver. I’ll take point.”\n“You think it’s safe to come out?” Anders asked.\n“Not really, but it’s not safe to stay here either.”\nAnders ran the line out from her winder and locked it, and I attached its end ring to a loop on the back of my belt before working my way up to the edge of the slab. Once I hauled myself up I was glad to see her pack still where I had abandoned it. I was also glad that Anders did not require my help to climb up—if I had to help her all the way the prospective journey time would double. Anders shrugged on her pack, cinched the stomach strap. We then made our way to where vegetation grew like a vertical forest up the face of the cliff. Before we attempted to enter this I took out my palm com and worked out the best route—one taking us back towards the citadel but keeping us under the mist, but for the occasional ridge. Then, climbing through the tangled vegetation, I couldn’t shake the feeling that something was watching us, something huge and dangerous, and that now it was following us.\nThe first day was bad. It wasn’t just the sheer physical exertion, it was the constant dim light underneath the mist sapping will and blackening mood. I knew Tameera and Tholan would not reach us that day, but I also knew that they could be back overhead in the blimp by the following morning blue if they traveled all night. But they would stop to rest. Certainly they knew they had all the time they wanted to take, to find and kill us.\nAs the sun went down, Anders erected one blister tent on a forty-degree slab—there was no room for the other tent. I set about gathering some of the many rock conches surrounding us. We still had rations, but I thought we should use such abundance as the opportunity might not present later on. I also collected female spider vine flowers, and the sticky buds in the crotch branches of walker trees. I half expected Anders to object when I began broiling the mollusks, but she did not. The conches were like chewy fish, the flowers were limp and slightly sweet lettuce, the buds have no comparison in Earthly food because none is so awful. Apparently it was a balanced diet. I packed away the stove and followed Anders into the blister tent just as it seemed the branches surrounding us were beginning to move. Numerous large warty octupals were dragging themselves through the foliage. They were a kind unknown to me, therefore a kind not commonly encountered, else I would have received something on them in the Almanac’s general load.\nIn the morning, I was chafed from the straps in our conjoined sleeping bags (they stopped us ending up in the bottom of the bag on that slope) and irritable. Anders was not exactly a bright light either. Maybe certain sugars were lacking in the food we had eaten because, after munching down ration bars while we packed away our equipment, we quickly started to feel a lot better. Or maybe it was some mist-born equivalent of SAD.\nAn hour after we set out, travel became a lot easier and a lot more dangerous. Before, the masses of vegetation on the steep slopes, though greatly slowing our progress, offered a safety net if either of us fell. Now we were quickly negotiating slopes not much steeper than the slab on which Anders had moored the tent the previous night, and sparse of vegetation. If we fell here, we would just accelerate down to a steeper slope or sheer drop, and a final impact in some dank rocky sump. We were higher, I think, than the day before—the mist thinner. The voice of the gabbleduck was mournful and distant there.\n“Urecoblank . . . scudder,” it called, perhaps trying to lure its next meal.\n“Shit, shit,” I said as I instinctively tried to increase my pace and slipped over, luckily catching hold before I slid down.\n“Easy,” said Anders.\nI just hoped the terrain would put the damned thing off, but somehow I doubted that. There seemed to me something almost supernatural about the creature. Until actually seeing the damned thing, I had never believed there was one out here. I’d thought Myral’s gabbleduck as mythical as mermaids and centaurs on Earth.\n“What the hell is that thing doing here anyway?” I asked.\n“Probably escaped from a private collection,” Anders replied. “Perhaps someone bought it as a pet and got rid of it when it stopped being cute.”\n“Like that thing was ever cute?” I asked.\nMidday, and the first Optek shots began wanging off the stone around us, and the shadow of my blimp drew above. A kind of lightness infected me then. I knew, one way or another, we were going to die, and that knowledge just freed me of all responsibility to myself and to the future.\n“You fucking missed!” I bellowed.\n“That’ll soon change!” came Tholan’s distant shout.\n“There’s no need to aggravate him,” Anders hissed.\n“Why? Might he try to kill us?” I spat back.\nEven so, I now led us a course taking us lower down into the mist. The firing tracked us, but I reckoned the chances of us being hit were remote. Tholan must have thought the same because the firing soon ceased. When we stopped to rest under cover of thicker vegetation, I checked my palm com and nearly sobbed on seeing that in one and a half days we had covered less than three kilometers It was about right, but still disheartening. Then, even worse, I saw that ahead, between two mounts, there was a ridge we must climb over to stay on course. To take another route involved a detour of tens of kilometers. Undoubtedly the ridge rose out of the mist. Undoubtedly Tholan had detected it on his palm com too.\n“What do we do?” Anders asked.\n“We have to look. Maybe there’ll be some sort of cover.”\n“Seeble grubber,” muttered the gabbleduck in the deeper mist below us.\n“It’s fucking following us,” I whispered.\nAnders just nodded.\nThen even more bad news came out of the mist.\nI couldn’t figure quite what I was seeing out there in the canyon beside us, momentarily visible through the mist. Then all of a sudden the shape, on the end of its thin but hugely tough line, became recognizable. I was looking at a four-pronged blimp anchor, with disposable cams taped to each of the prongs. We got moving again, heading for that ridge. I equated getting to the other side with safety. Ridiculous, really.\n“He’s got . . . infrared . . . on them,” I said, between gasps.\nA fusillade sounding like the full fifty-round clip of an Optek, slammed into the slope just ahead of us.\n“Of course . . . he’s no way . . . of knowing which camera . . . is pointing . . . where,” I added.\nThen a flare dropped, bouncing from limb to limb down through the vertical jungle, and the firing came again, strangely in the same area. I glimpsed the anchor again, further out and higher. Tholan and his sister had no real experience of piloting a blimp—it wasn’t some gravcar they could set on autopilot. Soon we saw the remains of what they had been targeting: an old sheq too decrepit to keep up with its seven, probably replaced by a new hatching. It was hanging over the curved fibrous bough of a walker tree, great holes ripped through its body by Optek bullets.\nWe climbed higher as the slope became steeper, came to the abrupt top edge of this forest of walker trees, made quick progress stepping from horizontal trunk to trunk with the wall of stone beside us. After a hundred meters of this, we had to do some real climbing up through a crack to a slope we could more easily negotiate. My feet were sore and my legs ached horribly. Constantly walking along slopes like this put pressure on feet and ankles they were certainly not accustomed to. I wondered just how long my boots and gloves would last in this terrain. They were tough—made with monofiber materials used by the military—but nothing is proof against constant abrasion on stone. Maybe a hundred days of this? Who was I kidding.\nBy midday, we were on the slope that curved round below one of the mounts then blended in to the slope leading up to the ridge. Checking the map on my palm com, I saw that there was likely a gutter between the ridge and the mount. I showed this to Anders.\n“There may be cover there,” I said.\nShe stared at me, dark rings under her eyes—too exhausted to care. We both turned then, and peered down into the mist and canted forests. There came the sound of huge movement, the cracking of walker trunks, broken vegetation showering down through the trees below us.\n“Come on.” I had no devil-may-care left in me. I was just as weary as Anders. We reached the gutter, which was abundant with hand and footholds, but slippery with rock-slime. We climbed slowly and carefully up through thinning mist. Then the blimp anchor rappelled down behind and above us like an iron chandelier.\n“Surprise!” Tameera called down to us.\nThe mist was now breaking, and I glimpsed the lumpy peak of the mount looming to our left. Higher up, its propellers turning lazily to hold it against a breeze up from the ridge, floated my blimp. Tholan and Tameera stood out on the catwalk. Both of them armed, and I was sure I could see them grinning even from that distance. I swore and rested my forehead against slimy stone. We had about ten meters of clear air to the top of the ridge, then probably the same over the other side. No way could we move fast enough—not faster than a speeding bullet. I looked up again. Fuck them. I wasn’t going to beg, I wasn’t going to try to make any last minute deals. I turned to Anders.\n“We’ll just keep climbing,” I said.\nShe nodded woodenly, and I led the way. A shot slammed into the rock just above me, then went whining down the gutter. They were playing for the moment. I glanced up, saw that the blimp was drifting sideways towards the mount. Then I saw it.\nThe arm folded out and out. The wrongness I felt about it, I guess, stemmed from the fact that it possessed too many joints. A three-fingered hand, with claws like black scythes, closed on the blimp anchor and pulled. Seated on the peak, the gabbleduck looked like some monstrous child holding the string of a toy balloon.\n“Brong da lockock,” it said.\nLeaning over the catwalk rail, Tholan tried pumping shots into the monster. Tameera shrank back against the cabin’s outer wall, making a high keening sound. The gabbleduck gave the blimp anchor a sharp tug and Tholan went over the edge. One long scream as he fell turned to an oomph as the monster caught him in one of its many hands. It took his rifle and tossed it away like the stick from a cocktail sausage, then it stuffed him into its bill.\n“Keep going!” Anders shoved me in the back.\n“It used us as bait to get them,” I said.\n“And now it doesn’t need us.”\nI continued to climb, mindful of my handholds, aware that the gabbleduck was now coming down off its mount. We reached the ridge. I glanced down the other side into more mist, more slopes. I looked aside as the gabbleduck slid down into mist, towing the blimp behind it, Tameera still keening. It had its head tilted back and with one hand was shoving Tholan deeper into its bill. After a moment, it seemed to get irritated, and tore his kicking legs away while it swallowed the rest of him. Then the mist engulfed the monster, the blimp shortly afterwards. Tameera’s keening abruptly turned to a long agonized scream, then came a crunching sound.\n“It’ll come for us next,” said Anders, eyeing the stirring mist then shoving me again.\nWe didn’t stand a chance out here—I knew that.\n“What the hell are you doing?”\nI passed back the ring of the line that joined us together. “Wind it in.”\nShe set the little motor running, orange line-cladding falling around her feet. I glanced at her and saw dull acceptance that I was abandoning her at last. The large shape came up out of the mist, shuddering. I began to run along the ridge. It was a guess, a hope, a chance—on such things might your life depend.\nThe anchor was snagging in the outer foliage of walker trees as the blimp, now free of two man weights and released by the gabbleduck, was rising again. I was going for the line first, though I’m damned if I know how I would have climbed the four millimeter-thick cable. At the last moment I accelerated, and leapt: three meters out and dropping about the same distance down. My right leg snapped underneath me on the roof of the cabin, but I gave it no time to hurt. I dragged myself to the edge, swung down on the blimp cables, and was quickly in through the airtight door. First, I hit the controls to fold the anchor and reel in the cable, then I was in the pilot’s seat making the blimp vent gas and turning it towards where Anders waited. Within minutes, she was on the catwalk and inside and I was pumping gas back into the blimp again. But we weren’t going anywhere.\n“Oh no . . . no!” Anders’ feeling of the unfairness of it all was in that protest. I stared out at the array of green eyes, and at the long single claw it had hooked over the catwalk rail. I guessed it would winkle us out of the cabin like the meat of a rock conch from its shell. I didn’t suppose the bubble metal alloys would be much hindrance to it.\n“Gurble,” said the gabbleduck, then suddenly its claw was away from the rail and we were rising again. Was it playing with us? We moved closer to the windows and looked down, said nothing until we were certainly out of its reach, said nothing for some time after that. At the last, and I don’t care how certain the scientists are that they are just animals, I’m damned sure the gabbleduck waved to us, before returning to its misty realm.\nOriginally published in Asimov’s Science Fiction, August, 2005.\nNeal Asher was born in 1961 in Essex, Great Britain, and divides his time between there and the island of Crete. He's been an SF and fantasy junky ever since having his mind distorted at an early age by JRRT, Edgar Rice Burroughs, and E C Tubb. Sometime after leaving school he decided to focus on only one of his many interests because it was inclusive of the others: writing. Finally taken on by a large publisher, Pan Macmillan, his first full-length SF novel, Gridlinked, came out in 2001, and now in total he has over twenty-five books to his name, also available in translation across the world."}