{"fingerprint": "Nk7wDbhbQvOSCKBGumHazvSng4A=", "sitename": "Clarkesworld Magazine", "title": "The Future Sounds of Yesterday: A Sequence of Synthesizers in Science Fiction by Christopher Bahn", "author": "Christopher Bahn", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bahn_01_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Future Sounds of Yesterday: A Sequence of Synthesizers in Science Fiction by Christopher Bahn", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n The Future Sounds of Yesterday: A Sequence of Synthesizers in Science Fiction\n Music and technology have always gone hand in hand—and the explosive flowering of music as an art form in the last century is also the story of the explosive growth of technology. Indeed, people have recognized the potential of computers to revolutionize music since before there even were computers. In 1842, writing about the theoretical uses of Charles Babbage’s Difference Engine, computer-science progenitor Ada Lovelace enthused that once the fundamentals of harmony and musical composition were properly understood, “the engine might compose elaborate and scientific pieces of music of any degree of complexity or extent.” (And there’s something wondrous about a woman at the dawn of the Victorian Age dreaming of something now commonplace with electronic groups such as Daft Punk.) Like computing itself, electronic music began as the arcane province of technology specialists and slowly became a truly democratic force that put the power to change the world—or at least soundtrack it—in the hands of everyone. And because cutting-edge technology is particularly good at sounding alien and futuristic, it’s meshed perfectly with science fiction as a subject matter. Below is a brief history of the ways those three elements—the music, the tech, and the SF themes—have intersected and influenced each other, in various media, over time.\n The Day The Earth Stood Still (1951)\n In 1919, a Russian scientist named Lev Termen invented one of the earliest electronic instruments, which came to be called after the anglicized version of his last name: the theremin. (Termen himself has a history at least as fascinating as his instrument: After emigrating to the U.S. where he scandalously married an African-American ballet dancer, he was kidnapped by Soviet secret police and repatriated to the USSR, where he worked on espionage tech including one of the first bugging devices.) Although its ethereal sound is now practically synonymous with ’50s SF movies, the theremin made its way into cinema 20 years earlier, first via Russian composers like Dmitri Shostakovich, then as a background element in 1933’s King Kong and 1935’s Bride of Frankenstein. In 1945, the theremin’s weird warble was used in a pair of thrillers, Alfred Hitchcock’s Spellbound and Billy Wilder’s The Lost Weekend, to illustrate the emotional chaos of their amnesiac and alcoholic protagonists. But the theremin was first used as a major foreground soundtrack element in the alien-contact classic The Day The Earth Stood Still. Composer Bernard Hermann put two theremins at the center of his score to highlight both the wise and gentle alien ambassador Klaatu and his deadly robot Gort. For a decade after, the theremin was de rigueur for any movie about alien creatures, showing up in It Came from Outer Space, Operation Moon—and much later in Tim Burton’s retro-futuristic Mars Attacks.\n Forbidden Planet (1956)\n Perhaps ironically, the theremin is absent from the first major movie to feature a totally electronic soundtrack, the SF-meets-Shakespeare space drama Forbidden Planet. Husband-and-wife composing team Louis and Bebe Barron got their start as avant-garde musicians in the orbit of the radical composer John Cage, but they made a stab at the more lucrative land of studio soundtrack work with Planet. They hand-built their own circuitry to create the phenomenally eerie music accompanying Leslie Nielsen and company’s journey through space. The main device in the Barrons’ toolkit was a tone-generating circuit called a ring modulator (famously used later by the BBC for the distorted squawks of Doctor Who’s Daleks), which they manipulated with reverb, delay, and other effects. Crucially, they didn’t see their music merely as mechanical sound, instead treating their instruments as actors whose job was to produce an emotional response. Though their soundtrack was hugely innovative and influential, the experience was a mixed success for the Barrons: Because they weren’t members of the musicians’ union, their score was classified not as music but as “electronic tonalities,” denying them a well-deserved shot at an Oscar and effectively ending their Hollywood career.\n The Tornados, “Telstar” (1962)\n The first British group to score a number-one hit in America wasn’t The Beatles, but an instrumental surf-rock band called The Tornados—thanks to a song written by their producer, the decidedly eccentric electronics wizard Joe Meek. Named after the first successful communications satellite to achieve orbit around Earth, “Telstar” captured the early-’60s fascination for the space age with a jaunty, buzzy keyboard-driven melody that incorporated bleeps and whooshes alongside a soaring background vocal. The main instrument here was a clavioline, an electronic keyboard that was a precursor to modern synths, but much of the magic came in post-production via Meek’s jerry-rigged assembly of tape machines, compressors and other devices in his home-built London studio. Meek’s own career was less stratospheric: Though the song sold five million copies and was covered by dozens of other bands, a plagiarism lawsuit (almost certainly groundless) ensured that Meek never saw a dime from it during his lifetime, and mounting pressure from his business problems, his drug use, and his (then-illegal) homosexuality led him to the murder-suicide of himself and his landlady in 1967.\n Doctor Who (1963)\n Set up in the late ’50s to bring the new worlds of electronic music to British TV and radio productions, the BBC Radiophonic Workshop pushed the boundaries of what was possible to do with sound. And with their longest-lasting popular success, the theme song to the venerable science-fiction TV series Doctor Who, they went all the way to the edge of time and space. Although the tune itself was written by Australian composer Ron Grainer, the song didn’t truly come to life until a then-uncredited engineer named Delia Derbyshire got her hands on it. Lacking advanced synthesizers or multi-track recording, she created each note of the song individually, combining them via a series of tape loops of white noise and a simple bass line painstakingly adjusted for speed and pitch. The result was, in a word, fantastic, evoking in a few moments everything important about Doctor Who’s enigmatic title hero—his questing wonder, but also loneliness, outsiderhood, and otherworldly danger that have stayed with him in all incarnations, for nearly 50 years. Side note: One Doctor Who sound you might think would be electronic isn’t: The TARDIS takeoff and landing effect was created by scraping a door key up and down the strings of a piano.\n David Bowie, “Space Oddity” (1969)\n Most of the music talked about so far was made using highly specialized equipment—often massive, complicated and expensive pieces built by musicians who were also formidable technicians. But in 1967, a British gadgeteer named Brian Jarvis fixed his niece’s broken toy piano by giving it an electronic upgrade, later refining the idea into a simple handheld keyboard operated with a metal pen: the Stylophone. His invention sold millions of copies, but might still be seen merely as a battery-operated toy if not for David Bowie, who used a Stylophone as a key instrument on “Space Oddity.” The first in a string of legendary singles, “Space Oddity” not only made Bowie a star but was a calculated stab at capturing the late-’60s’ fascination and optimism with the idea of space travel—ironically enough, in a bleak but captivating story about a lonely astronaut floating in a doomed spaceship. Still, it was exactly the right song at exactly the right time, and the BBC’s adoption of it as the theme tune for their coverage of the Apollo moon landing helped ensure Bowie’s status as something like an alien ambassador to humanity. Bowie’s love of the Stylophone wasn’t just a flash-in-the-pan, either: He used it on a number of subsequent songs, and said in 2002 that he still carries it with him when he travels to help write new material.\n A Clockwork Orange (1971)\n The Stylophone may have been just a toy, but the 1960s also saw more complex synthesizers start to make their way into mainstream music, as the technology was refined and made easier to use. After getting his start with a mail-order built-your-own-theremin business in the ’50s, Robert Moog invented the game-changing synthesizer that bears his name, which used transistors that made it small enough to be cheap and portable. It first gained wide public attention in 1968 when musician Walter (now Wendy) Carlos applied the futuristic instrument to centuries-old classical music on Switched-On Bach, going on to sell more than a million copies and bringing electronica to audiences who never would have been open to it otherwise. Three years later, Carlos’ electro-classical creations got an even wider audience when filmmaker Stanley Kubrick turned his lens on Anthony Burgess’ dystopian novel A Clockwork Orange—the tale of a street thug in a nightmarish near-future Britain who loves Beethoven even more than he loves beating and raping. Kubrick naturally turned to Carlos for the soundtrack, which helped give the movie just the sense of baroque surreality it needed.\n King Crimson, “The Court of the Crimson King” (1969)\n Pre-’70s Moog synthesizers were hampered by what now seems like a bizarre limitation—they could only play a single note at a time. Even simple chords were only possible by repeated overdubs in the studio, meaning that it was impossible to play any of these compositions live. The Mellotron, on the other hand, worked via strips of audio tape connected to a keyboard, meaning that it could be played live. Sure, it was as heavy as an elephant on Saturn, but what had been impossible was now merely very difficult. Mellotrons show up in pop music as far back as 1965 on songs like The Beatles’ “Strawberry Fields Forever.” But they really came to the fore when English group King Crimson made pioneering use of the Mellotron to help found progressive rock with their 1969 debut single “The Court of the Crimson King,” which helped lead to the massive, spectacle-driven arena rock of the ’70s. As prog evolved, it embraced the tropes of science fiction and fantasy for its expansive concept albums, and “Crimson King” was no exception, spinning a Dylanesque allegorical tale about the devil that begins with “prison moons” being destroyed in a solar explosion. In 2006, director Alfonso Cuaron highlighted the song’s SF roots again with prominent placement in his post-apocalyptic film Children of Men.\n Sun Ra, Space is the Place (1974)\n Jazzman Sun Ra claimed to be an emissary from the planet Saturn—and maybe that’s true, considering just how far ahead of everyone else he was in using electronic instruments, debuting a Wurlitzer organ on his album Super-Sonic Jazz in 1956. A pioneer of ambient music, Ra continued to supplement his recordings with tape effects and other electronic devices throughout his career, and never lost his sense of the cosmic. In fact, his blend of Egyptian, psychedelic and science-fiction imagery, seen in its full flower in his surreal 1974 movie Space Is the Place, helped create the Afrofuturist movement soon to be embraced by the space-funk outfit Parliament.\n Kraftwerk, “The Robots” (1978)\n As advances like the Moog and Mellotron made electronic instruments increasingly available to any talented musician and not just the technocracy, they infiltrated a wide range of popular music, causing revolutionary new changes in some genres and also allowing the invention of totally new ones. German group Kraftwerk were massively influential in the latter regard, exploring new ways of making pop music entirely with electronic instruments that led directly to synth-pop, electronica, house, and club music, and cast long shadows over hip-hop and other genres. They deliberately courted a technophile style, playing up the machine-like qualities of their music not only by writing songs like “The Robots” and “Metropolis” (the latter a tribute to the pioneering Fritz Lang SF film of the same name), but actually building robotlike mannequin versions of themselves that played their music in concert.\n Space Invaders (1978)\n The late ’70s also saw the rise of a completely new phenomenon, video games, that would rival and even supplant the movie theater and the concert stage as a natural home for electronic music. Space Invaders, which debuted in 1978, not only sparked a craze for coin-operated arcades, it was the first to feature music playing continuously throughout the game. It was incredibly primitive sounding compared with Switched-On Bach, but it was a start, expanded on later by games like Defender and Donkey Kong on the long road to today’s far more complex game music. And it’s been embraced again more recently by the chiptunes movement, about which more in a moment.\n Thomas Dolby, “She Blinded Me With Science” (1982)\n Kraftwerk was just the vanguard of the popularization of the synthesizer. ’70s arena-rock synths were still bulky and expensive, but the ’80s brought new instruments, like the Roland TB-303 bass synthesizer and Yamaha DX7 keyboard, that didn’t require an army of roadies to move and could be bought for a few hundred bucks. And that was the tipping point: Electronic music invaded everywhere, from the pop-rock of Duran Duran and Depeche Mode to the industrial noise of Einstürzende Neubauten and Ministry to the groundbreaking sampled beats and turntablism of hip-hop’s Grandmaster Flash. English musician Thomas Dolby, a confirmed gearhead who was well ahead of the curve technologically, used a combination of Moogs and less expensive synths like the Roland JP-4 to create his biggest hit, “She Blinded Me With Science”—a classic and charmingly goofy example of early synth-pop that tells the story of a brilliant but emotionally clueless mad scientist who falls in love with his assistant.\n Scientist, Scientist Meets The Space Invaders (1982)\n Created in the late ’60s by a Jamaican collective including eccentric-genius producers Lee “Scratch” Perry and King Tubby, dub reggae’s experiments with the electronic manipulation of sound was undeniably trippy and organic, especially in comparison to what musicians in Europe and the U.S. were doing at the time. Dub’s heavy reverb and overdubbing was simultaneously an embrace of cutting-edge technology and an aural recreation of a psychedelic state of mind, and it came to embrace SF ideas as a way to express that duality. It helped that “scientist” has a double meaning in Jamaican slang, indicating not just circuitry and tech but occult symbolism. King Tubby’s protégé Overton Brown, who took the pseudonym Scientist, raised dub’s SF flag high on records like Scientist Meets the Space Invaders and Scientist Encounters Pac-Man. Dub would go on to be a guiding influence on hip hop and electronic music into the ’90s and ’00s.\n Metal Heads, “Terminator” (1992)\n The rise of hardcore dance music in the ’90s took dub’s innovations firmly into the computer age, creating a whole new world of beats, samples, and rhythm-heavy effects. Under the project name Metal Heads, Scottish-Jamaican DJ Goldie pioneered a technique called “timestretching,” which slows down a piece of audio without affecting its pitch, giving his beats a distinctly metallic tone. The track “Terminator” picked up on that vibe by taking its name—and sampling Michael Biehn’s and Linda Hamilton’s dialogue from—James Cameron’s SF thriller about an unstoppable time-traveling killer robot.\n Daft Punk, Tron Legacy (2010)\n Kraftwerk may have sent android versions of themselves out to play their songs on tour, but Frenchmen Thomas Bangalter and Guy-Manuel de Homem-Christo took that idea to its logical conclusion: becoming androids themselves. As Daft Punk, the duo stays almost entirely hidden, Residents-like, behind the masks and personae of steel-headed robots—characters they took beyond the music in the clever yet patience-testing art house film Electroma. Their greatest mainstream success came in 2010 when Disney brought them on board to enliven the soundtrack of its retro-gamer SF blockbuster Tron Legacy, a perfect marriage of the story’s inherently nostalgic appeal as a sequel to a 28-year-old movie, and Daft Punk’s unflagging futurist approach.\n Christopher Bahn lives in Minneapolis, where he avoids the cold as much as possible and writes about pop culture, music, film, science fiction, travel, history, and the arts for venues including The A.V. Club, MSNBC, St. Paul Pioneer Press, Mpls.St.Paul Magazine, Momentum, Spaces, The Rake, Request, and Memory Lane. He is also the writer/co-creator of the radiodrama series Where Threads Come Loose."}