{"fingerprint": "cqVjFm2jvYXsFJfrLJV5il50U48=", "sitename": "Clarkesworld Magazine", "title": "Are You Afflicted with Dragons? by Kage Baker", "author": "Kage Baker", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/baker_03_18_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Are You Afflicted with Dragons? by Kage Baker", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5250 words, short story, REPRINT\nAre You Afflicted with Dragons?\nThere must have been a dozen of the damned things up there.\nSmith walked backwards across the hotel’s garden, glaring up at the roofline. The little community on the roof went right on with its busy social life, preening, squabbling over fish heads, defecating, spreading stubby wings in the morning sunlight, entirely unaware of Smith’s hostile scrutiny.\nAs he continued backward, Smith walked into the low fence around the vegetable patch. He staggered, tottered, and lurched backward, landing with a crash among the demon-melon frames. Instantly, a dozen tiny reptilian heads turned; a dozen tiny reptilian necks craned over the roof’s edge. The dragons regarded Smith with bright fascinated eyes. Smith growled at them helplessly as he flailed there, and they went into tiny reptilian gales of piping laughter.\nDisgusted, Smith got to his feet and dusted himself off. Mrs. Smith, who had been having a quiet smoke by the back door, peered at him.\n“Did you hurt yourself, Smith?”\n“We have to do something about those,” said Smith, jerking a thumb at the dragons. “They’re getting to be a nuisance.”\n“And possibly a liability,” said Mrs. Smith. “Lady What’s-her-name, the one with that pink palace above Cable Steps, had dinner on the terrace last night with a party of friends. I’d just sent Mr. Crucible out with the Pike Terrine when one of these little devils on the roof flies down, bold as you please, and lights on the lady’s plate. She screamed and then for a moment everyone was amused, you know, and one or two of them even said the horrible little creature was cute. Then it jumped up on her shoulder and started worrying at her earring.\n“Fortunately Crucible had the presence of mind to come after it with the gravel rake, and it flew away before it could do Milady any harm, but she wasn’t pleased at all. I had to give them free pudding all around and two complimentary bottles of Black Gabekrian.”\nSmith winced. “That’s expensive.”\n“Not as expensive as Milady’s bullies coming down here and burning the hotel over our heads. What if the little beast had managed to pull out her earring and then flown off with it, Smith?”\n“That’d finish us, all right.” Smith rubbed his chin. “I’d better go see if I can buy some poison at Leadbeater’s.”\n“Why don’t we simply call in an exterminator?” Mrs. Smith puffed smoke.\n“No! They charge a duke’s ransom. Leadbeater’s got something, he swears it does the job or your money back.”\nMrs. Smith looked doubtful. “But there was this fellow in the marketplace only the other day, had a splendid pitch. ‘Are you afflicted with DRAGONS?’ he shouted. Stood up on the steps of Rakut’s monument, you know, and gave this speech about his secret guaranteed methods. Produced a list of testimonials as long as your arm, all from grateful customers whose premises he’d ridded of wyrmin.”\nSmith grunted. “And he’d charge a duke’s ransom and turn out to be a charlatan.”\nMrs. Smith shrugged. “Have it your way, then. Just don’t put it off any longer, or we’ll be facing a lawsuit at the very least.”\nLeadbeater’s & Son’s was an old and respected firm, three dusty floors’ worth of ironmongery with a bar in the cellar. Great numbers of the city’s population of males of a certain age disappeared through its doors for long hours at a time; some of them practically lived there. Smith was by no means immune to its enchantment.\nRegardless of what he needed, Smith generally began with climbing up to the third floor to stare at Bluesteel’s Patented Improved Spring-driven Harvester, a gleaming mystery of wheels, gears, blades, leather straps, and upholstery, wherein a man might ride at his leisure while simultaneously cutting down five acres of wheat. Mr. Bluesteel had assembled it there for the first Mr. Leadbeater, long years since, and there it sat still, because it was so big no one had been able to get it down the stairs and the only other option was taking off the roof and hoisting it out with a crane.\nSmith had a long satisfying gawk at it, and then continued on his usual progress: down to the second floor to browse among the Small Iron Goods, to see whether there were any hinges, bolts, screws, or nails he needed, or whether there might be anything new and stylish in the way of drawer pulls or doorknobs. Down, then, to the ground floor, where he idled wistfully among the tools in luxuriant profusion, from the bins full of cheap hammers to the really expensive patent wonders locked behind glass. At last, sadly (for he could not admit to himself that he really needed a clockwork reciprocating saw that could cut through iron bars with its special diamond-dust attachment), Smith wandered back through the barrels of paint and varnish to the Compounds area, where young Mr. Leadbeater sat behind the counter doing sums on a wax tablet.\n“Leadbeater’s son,” said Smith by way of greeting.\n“Smith-from-the-hotel,” replied young Leadbeater, for there were a lot of Smiths in Salesh-by-the-Sea. He stuck his stylus behind his ear and stood. “How may I serve? Roofing pitch? Pipe sealant? Drain cleaner?”\n“What have you got for dragons?”\n“Ah! We have an excellent remedy.” Young Leadbeater gestured for Smith to follow him and went sidling back between the rows of bins. “Tinplate’s Celebrated Gettemol! Very cleverly conceived. Here we are.” He raised the lid on a bin. It was full of tiny pellets in a riot of brilliant colors.\n“It looks delicious,” said Smith.\n“That’s what your wyrmin will think,” said young Leadbeater. “They’ll see this and they’ll leave off hunting fish, see? They’ll fill their craws with it and, tchac! It’ll kill them dead. How bad is your infestation?”\n“There’s a whole damned colony of them on the roof,” said Smith.\n“Well. You’ll want a week’s worth—I can sell you a couple of buckets to carry it in—and for that kind of volume we throw in a statue of Cliba and the Cliba Prayer, put a shrine where the dragons can see it and keeps ’em from coming back, very efficacious—and then of course you’ll need new roofing and gutters once you’ve cleaned your dragon colony out—”\n“What for?”\n“Because if you’ve got that many of them on your roof, ten to one they’ve been prying up the leading to hide things under it, and once their droppings get underneath on your roof beams, they eat right through, and you don’t want that, trust me. Highly corrosive droppings, dragons. Just about impossible to get the stink out of plaster, too. Had them long?”\n“There’d always been a couple,” said Smith. “We’re at the damned seaside, right? You expect them. But in the last month or two we’ve got some kind of wyrmin rookery up there.”\n“Yes. I daresay it’s the weather. Lot of people coming in with the same trouble. Well, let me fetch you a pair of good big buckets . . . ”\n“Yes, but no roofing stuff just yet, all right?” Smith followed him over to the Containers section. “I’ll wait until I get up there and see how bad it is. And what do I do with it? Just scatter it around? We’ve got a baby at our place, and I wouldn’t want him picking it up and eating it.”\n“Not at all. You’ve got a big tree on your grounds, haven’t you? Just hang the buckets in the tree branches. Neat and tidy. They’re naturally curious, see? They’ll fly down to eat it, and then all you’ll need to do is call the umbrella-makers,” said young Leadbeater, with a grin.\n“What for?” Smith was mystified until he remembered the commercial uses for dragon wings. “Oh! Right. Will they come and collect the dead ones for us?”\n“Usually. You can get a good price for them, too.” Young Leadbeater winked.\nSmith trudged home with two gallon buckets of Tinplate’s Celebrated Gettemol, and the little statue of Cliba—a minor god of banishments—with its prayer on a slip of paper, in his pocket. He set a ladder against the trunk of the big canopy-pine and, climbing the ladder, went up himself to hang the buckets where they would be clearly visible. While up there, he peered across at his roof, but saw no gaping holes evident. Whistling, he climbed back down and spent the rest of the afternoon in the work shed making a shrine for Cliba out of an old winejar.\nNext morning, Smith was carrying a case of pickles up from the hotel’s cellar when he heard Mrs. Smith calling him, with thunder in her voice. He emerged to find her clutching her grandchild.\n“What?”\n“Perhaps you’d better go and see what Baby found when I took him outdoors for his sunbath,” she said grimly. Smith, expecting a dead dragon, sighed and trudged off to the garden, followed closely by Mrs. Smith. When he stepped through the back door, he beheld the garden and back terrace scattered with thousands of rainbow-colored pellets.\n“And guess what Baby went straight for, when I set him down? ‘Yum yum, look at all this candy!’” said Mrs. Smith.\n“Gods below!” Smith looked up into the tree and saw the two empty pails swinging on one end of gnawed-through cord. Five or six dragons perched along the branch above it, watching Smith with what looked like malicious glee in their little slit-pupiled eyes. As Smith stared, they defecated in unison and flew back to the hotel’s roof.\n“I trust you’ll have Mr. Crucible sweep it up immediately,” said Mrs. Smith with icy hauteur.\n“Damned right I will,” said Smith. “And then I’m taking it back to Leadbeater’s and demanding a refund.”\n“And what’ll you do then?”\nSmith rubbed the back of his neck, scowling. “Go ask a priest for intercession?”\n“A fat lot of good that’ll do! What self-respecting god gets rid of household pests, Smith? No, go and do what we ought to have done in the first place and hire a professional. There’s that fellow in the marketplace. ‘Are you afflicted with DRAGONS?’ and all that. A big fellow in oilskins. One-eyed.”\nAfter a brief unpleasant interview with the Leadbeaters father and son, Smith walked out of their emporium counting his money. He put his wallet away, and, sighing, looked around. He spotted the column of Duke Rakut’s monument, two streets away.\n“May as well,” Smith muttered to himself. Picking his way between fishnets spread out for mending, he made his way over to the marketplace in Rakut Square.\nApproaching the monument, Smith saw only a skinny youth seated on its steps, next to a handcart loaded with empty cages. The youth, who had a rather bruised and melancholy look to him, was feeding shrimp to a fat little dragon perched on his shoulder. The dragon ate greedily. The youth watched it with a mother’s tender regard.\n“Is there a man hereabouts says he can get rid of those?” Smith inquired, staring at the dragon. He had never seen a tame one before.\n“That’d b-be my m-m-master,” said the youth, not meeting Smith’s eyes.\n“Well, where is he?”\nBy way of answer, the youth pointed at the wine shop across the way.\n“Back soon?”\nThe youth nodded. Smith sat down on the steps to wait. The dragon climbed bat-like down to the youth’s knee and squeaked at Smith. It ducked its head and shook its wings, which resembled fine red leather, at him.\n“What’s it doing?”\n“Sh-she’s begging you for t-t-treats,” said the youth.\n“Huh.” Smith scratched his head. “Smart dragon.” The youth nodded. The dragon waited expectantly for treats, and, when none were forthcoming from Smith, it squealed angrily at him and clambered back up the front of the youth’s tunic, where it settled down to groom itself, now and then casting an indignant glance at Smith.\nA man emerged from the wine shop. Smith, watching him as he walked across the square, saw that he was big, wore a curious long coat made of oilskin, and had one eye. A leather patch hid where the other had been. The man was red-faced and genial-looking, even more so than might be accounted for by having just emerged from a wine shop.\n“C-c-customer, Master,” said the youth. The man rubbed his hands together, grinning at Smith.\n“Are you, sir? Are you afflicted with—”\n“Dragons, yes, I am. What’re your rates like?”\n“I will completely eradicate your dragons for absolutely free!” the man told him. His voice was a hoarse bawl. He grabbed Smith’s hand in his gauntleted own and shook it heartily.\n“Free! What’s the catch?”\n“No catch, my friend. Etterin Crankhandle, at your service. And let me tell you what those services include! No appointment necessary. I will personally come to your premises and arrange for on-site removal of any and all dragons infesting your property. All wyrmin are humanely trapped—no dangerous poisons or other chemical preparations used. I will then conduct a complete and thorough examination of your roof, shed, or outbuildings, and remove any nests or caches and repair any damage I find such as loose leading, tiles, or slates. I, of course, reserve the right to any contents of said nests or caches. Your roof, shed, or outbuildings will then be sprayed with my Miracle Wyrm Repellent, guaranteed to prevent any reinfestation for a full year. All absolutely free. Interested?”\n“I wish I’d run into you before I spent a fortune on that Gettemol crap,” said Smith, panting as he helped Crankhandle and his assistant push their cart up the street. Crankhandle laughed and shook his head.\n“Ah, sir, if I had a gold crown for every time I’d heard someone say that, I’d be a wealthy man!”\n“You ought to charge something, then,” said Smith, leaning away from the dragon on the youth’s shoulder, as it stuck its neck out and nipped at him.\n“Oh, no,” said Crankhandle. “The dragons themselves are payment enough. And in any case, you wouldn’t have found me there before last month. I’m new here.”\n“A traveler, then?”\n“I am, sir. Have to be. When I clear wyrmin out of a town, they don’t come back. Pretty soon business dries up, doesn’t it?”\n“I suppose it would. Here we are,” said Smith, opening the garden gate. They wheeled the cart in over the lawn and parked it under the canopy-pine. As Crankhandle’s assistant scrambled to slide chocks under the wheels, Crankhandle turned and peered up at the roof. The dragons looked down at him. Crankhandle grinned wide. Smith saw that his teeth had been capped with gold.\n“There you are! Uncle’s come with treats, my little darlings. Oh, yes he has.”\nSmith went indoors, got a beer, and came back out to watch as the youth unloaded all the cages from the cart. He set them up in a row and opened each one. His master, meanwhile, opened a panel in the floor of the cart, and, from a recess, brought out an iron strongbox. When he opened it, Smith glimpsed a dense greenish stuff, looking like damp compressed sawdust. Crankhandle broke off a cake of it and went to each of the cages, baiting each cage with bits of the cake. The dragon on his assistant’s shoulder turned its head and watched jealously. It began to squeak, doing the same head-bobbing and wing-fluttering routine it had gone through at Smith.\n“Here you are, little sweeting,” said Crankhandle, holding out a morsel of the stuff. The little dragon snapped at it avidly and gobbled it down. “That’s the way. Now! Arvin, send her up there.”\nThe youth Arvin took the dragon in both his hands. He kissed the top of her head—she tried to bite him—and tossed her up in the air toward the roof. She unfolded her wings and flew to the roofline, landing among the other dragons there. They hissed at her, but only for a moment; presumably, they had caught the scent of the cake on her jaws, for they suddenly mobbed her, biting her in their excitement, snapping at crumbs. She squawked and fled, jumping off the edge and flapping back down to Arvin’s waiting hands. He clutched her to himself and dodged behind the open cages, holding her against his chest protectively as the other dragons came winging after her.\nBut the whole flock—and Smith saw now there were a lot more than a dozen, more like twenty—pulled up and wheeled in midair as they noticed the bait. For a moment there was a confusion of beating wings, loud as spattering rain on rock, and then each dragon had zipped into one of the cages and was ravenously eating the green cake. Crankhandle stepped forward and slammed the cages shut, one after another. Arvin stepped around to help him, as his dragon scrambled back on his shoulder.\n“And it’s done,” said Crankhandle, beating his gauntlets together. Arvin’s dragon peeped and begged. “And here’s your reward, good girl!” Crankhandle added, going to the strongbox and taking out a last bit of cake. He handed it to Arvin to feed to her and then put the strongbox back in its compartment, shutting the panel.\n“Damn,” said Smith. Crankhandle swung round to him, grinning, and held up an index finger.\n“But wait! I have not completed my comprehensive removal! Arvin, get the ladder.”\n“Yes, Master,” said Arvin, as the dragon screamed in temper and bit him because the last of the cake was gone. He dabbed absentmindedly at the blood streaming from his ear and went to pull an extendable ladder from the side of the cart.\nCrankhandle loaded a basket with tools, and, slinging it on his back, climbed the ladder one-handed, while Smith steadied the ladder for him and Arvin loaded the cages back on the cart. Arvin sustained a number of other bites doing this, amid tremendous racket, because the dragon flock was in a group rage and hurling themselves against the bars; but Arvin kept working and only paused to tie a couple of bandages on his wounds before throwing netting over the cart’s top to fasten everything down.\n“I’ve got it figured out,” said Smith, who had wandered over to watch the dragons once Crankhandle was safely on the roof. “He sells the little bastards to the umbrella-makers, doesn’t he?”\nArvin shot him a pained look. “N-n-n-n-n-no!” he said reproachfully. “He l-lets them g-go. G-goes inland a l-long way and r-releases them. G-gone for w-weeks sometimes.”\n“Aha,” said Smith. “Yes, of course.”\nCrankhandle was up on the roof a long while, scraping and clunking and hammering. Mrs. Smith came out to see what was going on, and, on learning, was very pleased indeed with Smith, so much so that she went back indoors to prepare his favorite fried eel for dinner.\nHaving repaired the leads, removed the nests, and dug dragon shit out of all the raingutters, Crankhandle came back down the ladder at last, looking smug.\n“Very nice haul,” he said, slinging the basket down and pulling a tank with a spraying-rig from under the cart. Smith got up and looked in the basket. He glimpsed something bright glinting among the ruin of nests and flat sun-dried dragon corpses.\n“There’s something gold in here—” Smith reached for it, but Crankhandle whirled around with the tank in his hands.\n“Ah-ah-ah! That’s my perquisite, sir. ‘Contents of said nests or caches’, I said, didn’t I? Anything I found up there’s mine, see? Or I can just let the little dears loose again, and I shouldn’t think you’d want that, not with the spiteful mood they’re in.”\n“All right, all right,” said Smith, but he brushed aside the rubbish for a better look anyway. His jaw dropped. In the bottom of the basket was a clutch of gold crown-pieces, a gold anklet, a silver bracelet set with moonstones, a length of gold chain, three gold signet rings, the brass mouthpiece from a trumpet, assorted earrings . . .\n“Wait a minute.” Smith grabbed out a gold stickpin, a skull with ruby eyes. “This is mine! Went missing from my washstand!”\n“Mine now, mate,” said Crankhandle, shaking his head. “Those were my terms. Wyrmin steal bright metal; everybody knows that. Anyplace they nest, there’s going to be a hoard. Now you know how I can afford to do this free of charge.”\n“Well yes, but . . . ” Smith turned the stickpin in his fingers. “Come on. This was a gift. A gift from a demon-lord, if you want to know, and I wouldn’t want to offend him by losing it. Can’t I keep just this pin? Trade you for it.”\n“Such as what?” Crankhandle was busy fastening the tank’s harness on his back.\n“Lady of the house is a gourmet cook. Seriously, the Grandview’s restaurant rated five cups in the city guide. Exclusive, understand? All the lords and ladies are regulars here, so you can imagine the wine cellar’s stocked with nothing but the best. We’ll give you the finest table and serve you the finest meal you’ll ever eat in your life, eh? And whatever you like to drink, as much as you can hold!”\n“Really?” Crankhandle’s eye gleamed. “Right, then; you get the table ready. I’m just going up to finish the job. I warn you, I’ve got a good appetite.”\nHe wasn’t joking. Crankhandle set his elbows on the table and worked his way through a whole moorfowl stuffed with rice and ground peas, a crown roast of venison with a blackberry-red wine reduction sauce, golden fried saffron crab cakes, two glasses of apricot liqueur, and a quart and a half of porter. Smith played the companionable host and took his dinner of fried eel at the table with his guest, watching in awe as the man ate and drank. He took it on himself to have some fried eel sent out to Arvin as well, marooned in the garden keeping watch over the cages.\nRefilling Crankhandle’s glass, Smith inquired: “How did you get into this line of business, if you don’t mind my asking?”\n“Ha-ha!” Crankhandle belched, grinned, and placed a slightly unsteady finger beside his nose. “That’s the story, isn’t it? What’s for pudding? Got any fruitcake?”\nSmith waved down one of the waiters and told him to bring out a fruitcake.\n“How’d I get into my line of business. Well. Always interested in dragons, from the time I was a kid. I grew up back in the grainlands, see, way inland. Way upriver. And the dragons, you know, they’re bigger there—twice the size of these little buggers. I remember standing on the tail of my father’s cart and watching ’em cruise across the sky, just gliding, you know, on these scarlet wings. Most beautiful thing I’d ever seen in my life. Ah!”\nThe waiter brought the fruitcake to the table. It was dark, solid, drenched in liquor, heavy as a couple of bricks, and covered in molten sugar, and the mere sight of it was enough to give Smith indigestion. The waiter deftly set out a plate and took up his cake knife, poised to serve. “How big a slice would Sir like?”\n“Leave the whole thing,” said Crankhandle, a bit testily. The waiter looked sidelong at Smith, who nodded. The waiter set the fruitcake on the table and left. Crankhandle seized the knife and, a little unsteadily, sawed out a slice. Gloating, he held it up to the candle, so the light shone through the red and amber and green fruit. “Look at that! Looks like jewels. Looks like a dragon’s trove. Nothing about them isn’t beautiful, dragons.” He stuffed the slice of cake in his mouth and cut himself another.\n“So anyway—I wanted to know everything about ’em, growing up. Asked everybody in my village what they knew about dragons. Nobody knew much. Used to watch the dragons dive in the river for fish. Found out the sorts of things they like to eat when they can’t get fish, found out what they physic themselves with when they’re ill, that sort of thing.\n“And then, one time, I followed one back to the cliffs where it nested and climbed up there to have a look, and that was when I found its hoard. All this gold! Nobody in my village had any, you can be sure. I reached in and grabbed this goblet with rubies on it—got my arm bitten pretty badly too—and carried it home.\n“The schoolmaster had a look at it and said it was old. Come out of some old king’s tomb somewhere, he said. The mayor said it likely had a curse on it and he confiscated it, to keep the curse off me, he said, but he was a greedy bastard and I knew he wanted it for himself. Pour me some more of that apricot stuff, eh?”\nSmith obliged him. Crankhandle grinned craftily, took a mouthful of liqueur, and leaned quickly toward the candle. He swallowed, belched. The candle flame shot out sideways for a second, a jet of fire.\n“Is that how dragons do it?” said Smith.\n“No. See, that’s a popular misconception about dragons, that they breathe fire. I’m here to tell you they don’t, and I’d know. Been studying ’em my whole life. I know more about dragons than anybody else in the world, now.” Crankhandle cut himself a huge slab of cake, took half of it in one bite, and chewed thoughtfully.\n“Such as?”\n“Such as, they’re smart. They can learn things. I learned to train ’em. Mind you, it isn’t easy—” Crankhandle pointed at the patch covering his eye socket—“because they’re willful, and temperamental, and quick. You have to want them more than an eye, or a fingertip, or an earlobe. The boy’s learning that. The other thing is, you can only really train wyrmin to do better what they already want to do anyway.” He reached for the knife to cut the last quarter of fruitcake into eighths, changed his mind, and simply picked up the whole wedge and bit into it.\n“Well. So I learned all there was to know about dragons, see? Discovered a secret, and I didn’t learn it from any priests or mages either, I worked it out for myself. There’s something dragons need in their diets—and I’m not telling you what it is, but it’s either animal, vegetable, or mineral, ha ha—and if they don’t get it, they don’t grow. That’s why they’re so puny, here by the sea. Lots of fish, but no Mystery Ingredient. So I worked out a special food formula for dragons, right? A little of this, a little of that, a lot of the Mystery Ingredient, and that’s my bait.\n“Not even the boy knows the recipe. I make it up myself, in a locked room. And the little bastards love it! Can’t get enough of it. Have to be careful doling it out to them, because they do get bigger when they eat it, and you can spend a fortune on cages. But oh, how they come to the bait!”\n“So . . . you travel around with this stuff, cleaning out wyrmin colonies, and collecting all the gold they’ve stolen and hoarded,” said Smith. “You must have earned a fortune by now! But if it’s that dangerous, why don’t you retire?”\n“Haven’t made enough yet,” said Crankhandle, pouring himself some more liqueur. “I’m saving it up. You might say I’ve got a hoard of my own. Besides, this isn’t where the real money is!”\n“Oh no?”\n“No indeed. Rings and pins and bracelets . . . ha. That’s the petty stuff the little ones bring in. They’re not strong enough to lift anything bigger. You don’t get a real payoff until you’ve got the big ones troving for you.”\n“Troving?”\n“Going out looking for gold. It’s instinctive. The big dragons where I grew up, they could tell where there was old gold. Tombs, mounds, other dragons’ hoards. You should see their nests! I told you how I got this, didn’t I?” He rolled up his oilskin sleeve to reveal a brawny arm, tattooed with swirling patterns, and a distinct U-shape of white scarred toothmarks.\n“You did. Stealing a cup.”\n“Right, well, I learned that what you do is, you get ’em when they’re little enough to be easily managed, and you train ’em, see? You get ’em used to you. You get ’em so they believe they’d better do what you want ’em to do, to get those lovely wyrmin treats. And then you feed ’em so they get of a bigness to raid tombs and such, and you take ’em back into the inlands where the old places are and you let ’em go.\n“Then it’s just a matter of making a chart of where they build their nests and going around every now and then to see what they’ve collected for you. They remember me, old Uncle Treats, and I dump out a great sack of special formula for ’em, and while they’re busy gobbling it down, I can take what I like out of the hoard. Works every time!”\n“You ought to be stinking rich pretty soon, all the same,” said Smith in awe. “Going to retire and pass your secret on to the boy?”\nCrankhandle made a face. He drained his glass and shook his head. “No. He’s a bit of a fool, really. Good enough for pulling the cart, but he’s too soft for the work. He loves dragons, like they were people. And, you know, you really can’t love, in this business.” He reached for the emptied bottle and tilted it, sticking his tongue up the neck to get the last drops.\n“You’re a lot like a dragon, yourself,” said Smith.\nCrankhandle belched and grinned, and his gold teeth glinted in the candlelight. “Why, thank you,” he said.\nThat night, Smith put his stickpin away in a drawer. It had occurred to him that there was another thing Crankhandle might have trained his wyrmin to do, and that was to fly through open windows and rob houses. The more he thought about it, the more he wondered whether the sudden infestation at the Grandview had happened entirely by chance.\nBut the dragons did not return, at least. When next Milady from the pink palace stopped in as one of a party ordering lunch on the terrace, she asked, with an unpleasant smile, whether she was likely to be attacked by an animal again. Smith assured her that all the dragons had been exterminated, which seemed to please her.\nSix months later, Smith had business down in Rakut Square. He glanced at the base of the monument as he walked by, and saw no cart. He thought to himself that Crankhandle must have moved on to another city.\nHe was a little surprised, therefore, as he walked back toward the Grandview, to find the boy Arvin mending a fishing net. The little dragon was still perched on his shoulder, sleepily basking in the sunlight. She opened one slit-pupiled eye to regard Smith and then closed it, dismissing him as not worth her attention.\n“Hello!” said Smith. “Where’s your master these days?”\nArvin looked up at him. He shook his head sadly. “Dead,” he replied.\n“Dead! How?”\n“He t-told you about the b-bait we used, how it m-makes dragons bigger?”\n“Right, he did.”\n“It makes them s-smarter, too.”\nOriginally published in The Dragon Book, edited by Jack Dann and Gardner Dozois.\nOne of the most prolific new writers to appear in the late '90s, the late Kage Baker made her first sale in 1997, with \"Noble Mold,\" the first of her long sequence of sly and compelling stories of the adventures and misadventures of the time-traveling agents of the Company. Her Company novels include, In the Garden of Iden, Sky Coyote, Mendoza in Hollywood, The Graveyard Game, The Life of the World to Come, The Machine's Child, Sons of Heaven, and Not Less Than Gods. Her other books include fantasy novels The Anvil of the World, The House of the Stag, and The Bird on the River, science fiction novel The Empress of Mars, YA novel The Hotel Under the Sand, and Or Else My Lady Keeps the Key, about some of the real pirates of the Caribbean. Her many stories were collected in Black Projects, White Knights, Mother Aegypt and Other Stories, The Children of the Company, Dark Mondays, and Gods and Pawns. Her posthumously published books include Neil Gwynne's Scarlet Spy, Neil Gwynne's On Land and Sea (with Kathleen Barholomew), and a collection, In the Company of Thieves. Baker died, tragically young, in 2010."}