{"fingerprint": "ldvtRfqMuwNvnpIypIXIaFHJbBc=", "sitename": "Clarkesworld Magazine", "title": "An Interview with Kage Baker by Jeff Vandermeer", "author": "Jeff Vandermeer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/baker_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Interview with Kage Baker by Jeff Vandermeer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n An Interview with Kage Baker\n Kage Baker is one of my favorite writers—wise, clever, funny, shrewd, deep, and sometimes horrifying, her stories and novels display a range and sensibility uniquely her own. She has been a finalist for the Hugo and Nebula Award, in addition to having won the Sturgeon Award. Her novels have been translated into Spanish, French, Italian, Hebrew, and German. Still, to my mind she’s not received nearly the critical attention she deserves. Having made her reputation with her Company novels, about a far future organization dedicated to making sure no one changes the past, Baker is now in the process of moving on to other milieus. We talked about that transition, about her talent for humor, about her relationship with the internet, and several other topics via email in February of this year.\n My understanding is that you’ve phased out the Company novels and are focusing more on fantasy. If this is correct, has there been any trauma in this? Has it been tough to wean yourself off of that milieu, or are you just sick of it all by now and ready for new things?\n There won’t be any more Company novels; that whole 8-book story arc is finished once and for all. There will undoubtedly be other Company short stories, as I find historical incidents that intrigue me, and I’m blocking out a steampunk novel featuring the Company’s 19th-century predecessor, the Gentleman’s Speculative Society; but the Company story is told. Finito. I wasn’t at all traumatized, considering I’d devoted my life to the damn thing since approximately 1985. There are other stories to tell, for now. Some fantasy, some straightforward historical adventure. The science in my science fiction was never that strong, in any case.\n The Company’s often morally ambiguous, to say the least. Do your readers recognize that for the most part? Have you gotten fan mail from readers saying “Man, the Company rocks! I’d totally love to be an operative for them.”?\n Nobody ever says the Company rocks—and I’d be incredulous if anyone did, since working for a corporate entity with that kind of power would be nightmarish. But a lot of people love the operatives themselves (primarily Joseph and Lewis) and others would love to be immortal operatives. And every so often I’ll get these distressing little emails saying things like, “You know, you’re almost right about the way time travel works, but you have some details wrong” or “If you reveal any more about the Lizard People, you will regret it.”\n What’s your own favorite Company novel, and why?\n Probably The Life of the World to Come. It’s the point where the whole saga sort of reboots and moves forward into the future, since Garden of Iden and Mendoza in Hollywood are flashbacks, Mendoza’s story told from her prison, and Sky Coyote and Graveyard Game catch up Joseph’s past history so the reader understands how and why he finally rebels. With all that past grief shed, writing LWTC felt like flying at times. It was a lot of fun to write.\n What I’ve always been struck by in the Company novels and stories is how varied they are. For example, in your short story collection Black Projects, White Knights, you’ve got serious, horrific, and very funny stories. I’m curious as to what comes most naturally to you. Did you start out writing funny stuff or more serious? Which is most difficult for you?\n I never start out to be funny, it just happens . . . sometimes the most horrific things are also ludicrously funny. My inclination is generally to write serious stuff, but life is absurd, and the more honestly I try to write about the world, the less its essential ridiculousness can be gotten around. Take—at random—the death of Rasputin. Read about his murderers nervously feeding him poisoned petits-fours, and poisoned vodka, and watching in disbelief as he just keeps shoveling it in and demanding their guitarist play his favorite songs. And when they finally can’t stand it any more and unleash this horrifying catalogue of assaults on him—shooting him, beating him with chains, throwing him into the damn frozen river—and he’s still trying to climb out, right up to the moment he freezes to death—you’re wondering, what must they have been thinking? “Christ, can’t we get anything right?”\n You’re one of the only writers I know who can pull off slapstick in fiction. Do you have a background in theater or film? Is there any influence that informs this element in some of your fiction? This kind of approach requires a consummate sense of timing.\n I do have a background in theater, yes. I’ve been a character actress, stage manager and director with a number of little troupes orbiting mostly around the historical fairs—the Great Dickens show in San Francisco, the old original Renaissance Faire, the Old California Celebration. A lot of what you’d call Vaudeville Nouveau was generated out of those events. Both the Flying Karamazov Brothers and the Reduced Shakespeare Company, for example, got their start there. If my comedic timing is any good, it’s because I learned from some frickin’ geniuses like Marque Siebenthal, David Springhorn, Judy Cory and Billy Scudder—whose names you will not recognize but who are hallowed in comedy heaven.\n Let’s talk about your pirate novel. It’s coming up later this year, titled Or Else My Lady Keeps the Key, and I’m very much looking forward to it. There’s a lot of pirate material out there. Is there a particular model you’re riffing off of?\n I did a historical novella for the Night Shade collection Dark Mondays which was about Sir Henry Morgan’s sack of Panama in 1670. “The Maid on the Shore,” it was titled. I told it primarily from the point of view of this spear-carrier, a fairly dense but good-hearted young man named John. He grew as a character—as they will—and the end of the story left some interesting possibilities for him. So I wrote Or Else My Lady Keeps the Key which picks up with John returning from Panama, swearing to give up piracy because it doesn’t pay. First, though, he has to fulfill a promise made to a dying friend and deliver a letter to the friend’s mistress. Things get complicated. The title comes from a popular song of that era, The World Turn’d Upside Down.\n At some point in the writing of the first story, I had one of those revelatory moments when I could see John’s entire life stretched out—sort of a Pirate’s Progress. So there will be other pirate stories about him, I guess. I did one for the forthcoming antho Fast Ships, Black Sails (forthcoming in the next year) called “I Begyn as I Meane to Go On” which would be the opening illustration, as it were, in the series. My own particular pirate continuum is set about a generation and a half before all the Good Pirate Stuff—could have kicked myself when I realized I’d have no chance to incorporate Blackbeard or the hilarious Stede Bonnet into the stories, because they hadn’t even been born yet. So I can’t really riff off any of the modern takes on pirate adventure, which are all set around 1720. It crimps one’s style a little—no cocked hats yet, and ships have tillers, not wheels—but one has the consolation of being original.\n What are some of your favorite pirate novels or stories?\n Robert Louis Stevenson’s Treasure Island of course. And I still have my dog-eared copy of Tim Powers’ On Stranger Tides.\n You rarely enter into online discussions, as far as I know, and even had your message board deleted at one point. What is your relationship to the internet, and do you think this online element to our lives has helped the genre community as a whole or hurt it?\n The internet . . . nice place to visit, but I wouldn’t want to live there. My relationship to it these days is primarily as a reference source—Google Earth is great, Wikipedia OK if used with a big grain of salt and other sources used to fact-check. I did use to take part in online discussions, in the days when Asimov’s scheduled them, but . . . message boards and online discussions are a lot like study hall or detention, where mostly people are shoving each other and giggling and passing notes with dirty limericks. And one kid in the room is a psycho, and one is a bully, and one is a pompous twit, and you’re at the back of the room dodging spitballs and thinking “Jesus fucking Christ, I’m fifty-five! I could be somewhere else. Why aren’t I?”\n I think it has harmed the genre community, personally. People are talking about writing, instead of writing. That’s a bad sign . . .\n What do you read for pleasure? And what recently have you really enjoyed?\n When I get the time to read, I’ll read anything Terry Pratchett writes. Ditto Peter S. Beagle and Ian McEwan. I like all the Dead White Males like Somerset Maugham, O. Henry, Kipling, Hammett, Chandler. The late George MacDonald Fraser and Patrick O’Brien. And I absolutely adored “The New Moon’s Arms” by Nalo Hopkinson.\n What else do you have coming out in 2008 and what are you working on?\n I have a fantasy novel called The House of the Stag coming from Tor. I have the aforementioned Or Else My Lady Keeps the Key coming from Subterranean. I just finished a steampunk story for an anthology Nick Gevers is editing. And I’m working on a novelization of the novella “The Empress of Mars,” because there was a lot more story there than got told.\n Jeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\n Jeff's novel Finch and writing book, Booklife, are forthcoming this fall."}