{"fingerprint": "RY+PaM83v/iZPCqE0YCA9olrzg4=", "sitename": "Clarkesworld Magazine", "title": "Follow the White Line by Bo Balder", "author": "Bo Balder", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/balder_11_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Follow the White Line by Bo Balder", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5410 words, short story\nFollow the White Line\nThe seat seals tighten around Paddy as The Grass is Always Greener on the Other Side flexes into its wormhole hop. She flicks a look to Lieutenant Asha, whose red corkscrew curls she admires—not to mention the rest of the lieutenant—and focuses back on her optics maintenance.\nThe wormhole loop feels as if she’s become taffy and every kind of information takes longer to arrive. Information even penetrates her eyelids. On some level, her body knows her eyes are shut and yet she’s seeing things. A wavering white line crawls over the fake chestnut paneling on the bridge. The line hesitates, then becomes thicker and whiter, as if the brush was dipped in fresh paint. But there’s no painter. There’s not even these white lines, there can’t be.\nThe wormhole loop seems to take longer than normally. Paddy can’t stop looking away from the line. At last it pauses. No, it starts again. The line waves, higher than at first, making small, precise bumps. The first beginnings of a figure. A second wavy line is formed below the last third of the line. Then curves are sketched in.\nHer brain turns the waves and curves into an extinct animal from Earth. An abstract figure of a gorse, a creature she’s never seen in real life, only in pictures.\nBefore she can draw any conclusions or feel any feelings, the bell sounds and her eyelids open of their own volition. She’s back in the slightly shabby decor of the old ship, surrounded by officers uncoupling from their chairs and hurrying back to their duties. She sees the captain. She looks exactly like Paddy must have looked a moment ago, watching a white line curl on itself. The whites of the captain’s eyes are showing and her breath is fast and shallow. Paddy doesn’t want to know if something’s wrong with the captain. Let the lieutenants take care of her. She looks away and hurries off the bridge.\nPaddy returns to her optometrics check in the aft gangways on deck three. The patchwork panels of the old spaceship look their normal drab selves until she starts concentrating. A white stripe pulses across the bulkhead, bisecting safety markings, ventilation vents, and airlocks. She flinches away from it. Her Velcro gravity soles tear off and re-stick to the gangway floor with plaintive cries. The stripe looks handcrafted, irregular, the hairs of the brush visible. Just like the hallucination she saw during the wormhole loop. The oscillating ribbon sings to her of something ancestral and ancient, but when she touches it she feels nothing, just smooth optic cells. Weird.\nShe checks into the optic display stats, which is the job she is here for. They show no errors, every cell doing exactly what it should. The stripe isn’t actual paint. Her nails can’t get traction to scrape off a paint fleck for testing. Hallucination? But why? How? She would have chalked it up to eyestrain if she hasn’t seen the animal drawing during transit.\nPaddy takes a picture of the stripe, to look at later, even though the ship’s hallways are being surveilled and recorded anyway. She already knows the recordings won’t show anything. And neither will her photo. She doesn’t want to alert ship security; she doesn’t want to be crazy or sick or investigated.\nAfter her shift, keeping her eyes averted from the insistent lines, she turns into her bunk to look at the pics. They show nothing, as expected. Just boring bulkhead and fittings. Her bunkmates Nadal and Moraly come in.\n“What are you brooding about, Pads?” Moraly says, wending her irrepressible bulk through the narrow lane between the six high bunks on both sides.\n“Someone vandalized the bulkheads,” Paddy says. “I took a picture. But the graffiti just disappeared.”\n“Gimme.”\nPaddy sends the burst to Moraly.\n“Yeah that’s a bulkhead, mate. Nothing there. You sure you saw it?”\n“Maybe.”\nMoraly takes her notebook from the elastic holder and fiddles with it. Paddy gets a burst from her. She’s found the surveillance footage of the moments Paddy’s taken the pics. It just shows her staring stupidly at pristine bulkhead and blinking hard to take pictures. From another angle, the same.\n“Eye test it is,” Nadal says.\nPaddy ignores him. Nadal’s like an echo, nothing new there, ever.\nBy her next shift, Paddy knows she’s in serious trouble. She’s checking the optics one deck higher. When she zones out, lines or pictures arrive. She refuses to see them. They’re gorgeous, clearly animals of some kind although she’s only ever seen cats and dogs. And rats. But it’s not good. She’s been warned against zoning out several times since she boarded the ship. The monitor always notices and starts flashing. Why can’t she stop it? She’s tried reading up on those apparently malignant theta waves but all the content is flagged. As her shift progresses, she develops a headache from not looking at the stripe. It’s hard because she wants to see the paintings. Because they’re so beautiful.\nAfter the shift she has a free period and looks up extinct animals. Niledeer, okaffe, loose, gorse, huffalo. She recognizes some of them from their stylized depictions on the bulkheads. Pardon, her imagination. She tries replicating them with her stylus, but that doesn’t fly at all. They’re so much more complex than they look. What seems simplicity is really incredibly sophisticated artistry. A single line sketches a hump, a sublimation of a thousand possible different humps and yet capturing all of them.\nMoraly and Nadal are gone, and the other three bunkmates never share shifts with Paddy. She’s alone. Now is the time to invite the white line in. She tosses a comforter down onto the floor and sits on it, cross-legged. Meditation is not encouraged, but it’s not strictly forbidden either. Funny thing, actually. There are ancient laws about religious freedom and freedom of speech. Why is the atmosphere on the Green so uptight? It probably reflects the captain’s personality, when Paddy thinks of other ships she’s served on. The Mayflower Got Nothing On Me was a happy ship, if maybe a tad sloppy. Her training vessel Teenage Angst didn’t have much atmosphere. No permanence.\nThinking about this mystery isn’t helping the meditation. Paddy closes her eyes and starts breathing regularly.\nWhen the wavy white line starts painting itself on the inside of her eyelids, her eyes fly open. It doesn’t help, the line’s still there. It curves itself around the messy bunks and scuffed lockers of the sleep station. Paddy returns to her breathing rhythm, her eyes still open. Is she going nuts or is there a sound? A thready music, wavering and flailing, unlike the certainty of the painted line.\nPaddy’s left hand snakes out to tap her outside recorder, in case the inside one again shows nothing. This can’t be real. She’s going nuts. Has to be.\nShe shushes the nagging internal voice. A story is unfolding. White lines paint a wide, open landscape. Sparse vegetation is slashed in with a few strokes. Great herds of animals trek across the veldt, grazing, drinking, mating. Men come, stick figures but still recognizably the headwoman, the inexperienced hunter, the suckling women, the loud boys.\nOther people come, different from the stick men in some indefinable way. They kill many, and take the rest. They are put in the belly of a giant beast and taken away far from their homes. In the new place they do not hunt, they are not free, they are made to work hacking at rocks until they die.\nThe leviathan that brought them hangs threateningly in the sky. It’s a rounded shape, decorated by lines in green paint. The prisoners don’t know what those slashes mean. They look away from it and die.\nPaddy emerges from her trance. Unlike the white stick people, she knows what the green marks on the cargo ship mean.\nHer butt hurts from sitting cross-legged for so long. She groans and stretches her limbs until her joints pop. What does the vision mean? Part of her knows already, but she doesn’t want this knowledge, this burden.\nShe gets up, bumping her head against the top bunk as usual. The sleeping station looks different from before. Its dimensions, always awkward, apt to destroy the parts of human beings that stick out, like toes, heads, and elbows, exude something else than unfortunate design choices. They reek of intent. Of making the passengers—prisoners?—as uncomfortable as possible. Dimensions purposefully created to cause daily irritations, to crush the spirit and incommode the body.\nPaddy shakes her head. That’s silly. Why would anyone do that? The Green is just old and uncomfortable, because it was made in a different era with different priorities and tastes. Still. Why is the captain so afraid of wormhole loops? Maybe she sees the same things that Paddy does. And if she feels the captain’s dread, won’t the captain notice her? Her heart starts racing from just the thought.\nHer mood will be seen on the monitors. She’d better get herself to the gym, burn off these dangerous, borderline insane thoughts and their chemical aftermath, visible in the blood tests.\nLieutenant Asha falls into step with her as Paddy crosses the main to get to the full-G gym. “Hey Paddy, everything all right?”\nFound out already? But it’s worth trying to deny for as long as possible.\n“Sure, why wouldn’t I be? Just heading to the gym now. Wake myself up.”\nAsha claps Paddy on the shoulder and heads off to the off-bridge offices. Who knows what kind of personnel software management has to interpret Paddy’s data. Lying might be completely transparent to them.\nBut there’s nothing she can do to change that, so she might as well get her run and swim in. She needs to think hard before she does anything else.\nPaddy has her brush ready to patch up the bare spot in the optic lacquer. For some reason it’s invisible to the crawler bots and has been signaled for human attention. She’d love to get down to trawl for coding errors in the bot software, which is her real job. This thing where she uses her fallible human hand to coat the patch in an uneven layer of optic cells is nuts. But that’s what it says in the manual. In case of bot failure: human intervention. She’s going to do it, sure, but she’s stretching the pre-painting moments out a few seconds.\nShe wants to hear the white band sing again. See the shapes she guessed at in the wormhole loop. Because this malfunction can’t be a coincidence. There are no coincidences on a ship maintained and monitored down to the molecular level. There is no way Lieutenant Ash could have missed her theta waves the other days. Or her picture of the white band showing nothing unless there is something that has the power to alter records at that lowest level as well. It’s not her or one of the other junior engineers. They can’t alter a line of code without something recording it, flagging it for the lieutenants.\nBut what? A nanobot small enough to lay down an optic cell doesn’t have the reach and intelligence to alter the hundred or so cells next to it. So it’s something bigger.\nSure, Paddy would like to find out what’s communicating with her. But most of all she wants to see the line sing again, the stick figures weave another tale for her. It touched something deep and buried inside her that she didn’t even know existed. Something like déjà-vu, but with more emotion attached to it.\nShe snaps back into the present. Her timer indicates she’s been woolgathering for two minutes. That’s more than enough to get her noticed. She re-dips the brush and strokes the optic lacquer onto the bare patch. She’d hoped to get more from this, a message, a sign. Her curiosity is tickled, but she needs more to follow this tenuous thread of evidence to the next conclusion.\nWhen she turns away, a nosehorn lumbers through the edges of her peripheral vision. Paddy whips her head around, but it’s gone. But this is confirmation. Something smart and conscious noticed her noticing the oddity and tossed her another carrot.\nA carrot’s fine. Paddy will follow it in hopes of finding the source of the string it’s attached to.\nNext shift she acts like nothing has happened. No glances at the bulkheads, no curiosity when the captain stomps by, Moraly’s wink unreturned. Head down until rec time. After her run and a bath, she slides into a booth. People use them for games or porn or whatever they like. In theory, they’re not supervised. Paddy doesn’t trust truths like these anymore, but if it does work like that, only the better.\nShe starts a game she’s heard of, an ecology game. She’s to populate a planet from scratch. It’s mostly a children’s game, a learning game, but it gives her an excuse to look up all kinds of animals and historical facts. What are the largest prey animals and predators, what kind of environment do they need? The germasse, the riverhorse, the nosehorn. Complicated names from the olden days. It points to a certain planet, colonized long ago in the earliest expansion of mankind.\nWhat happened there? Paddy pretends to let random curiosity lead her away from the game. History, war, famine. Interplanetary battle is too costly but if it’s about prestige, politics, or religion, humans will do it anyway. She yawns. Her eyes unfocus. One of the open holo windows is pinker than the others. Or not. She blinks it open anyway. There it is. Thousands of people from this planet named New Hope were taken away to—the file grays out and disappears.\nPaddy returns to her game. She’s no farther up the genetic chain then a couple of multicellular organisms, no matter how high she speeds up the initial rounds. If Lieutenant Asha wanted to find fault with her researching quasi-mammals much higher up the food chain, she could.\nAs her fingers scribble rote actions in the air, her mind is working furiously. So the stick figure puppet show could be real. The ship involved could be the renamed Green. Could be. Must be. Because Paddy doesn’t believe in ghosts. Only the ship or the captain could show her this stuff and manipulate the records so it never happened.\nThinking of the look in the captain’s eyes if she would suggest such a thing to her makes Paddy’s insides quake. Never. The ship seems a safer option. It’s sentient, but keeping itself aloof from the crew, except the captain and the second officers.\nThe longer Paddy mulls over this thought the more plausible it seems. The next question is, why contact Paddy? And why so indirectly?\nThe answer to the second question can only be, because the good ship Green didn’t know if it could trust Paddy. She’s been tested. And has presumably passed the test, or she wouldn’t still be getting messages. She hasn’t told anyone, and that is what the ship wants. Secrecy. Something between the two of them.\nThe why is harder. What has Paddy got that the ship could be interested in? She’s an orphan, signed onto space so she could complete her degree and get away from the place where she was unhappy as a child. She has to think harder and make leaps much more intuitive than her engineer’s degree has taught her to. This is about people. People she must have a connection to? Otherwise nothing makes sense.\nShe could call up her genetic signature, it’s in her file. She’s never had it investigated, for the same reason as she didn’t want to return to her birthplace. It brings nothing but unhappiness. The thought of being given away, left behind, or whatever the reason is her birthmother didn’t want her is too painful.\nBut the idea she’s connected to these mysterious people that were on the ship once changes this. She could be the last of her tribe, or country, being given away to be safe, to stay hidden. But then again, every unhappy child dreams of their parents being not their real parents. Somewhere, better people must exist who have only mislaid her.\nHer rec time is up and she returns to duty filled with more questions than before. Also with more fears. There must be a reason this information, this event, those people have been erased from history. It must be something bad or the ship wouldn’t have gone along with the cover-up.\nYes, why would a sentient ship go along with a cover up? Only for a human being it loved. The captain. It all comes back to the captain, sitting like a spider in her web, looking tired and angry, tightly controlled and tightly controlling. Everything could be explained by shame and fear, but Paddy finds it hard to ascribe such motivations to the captain. The woman inspires fear, she surely doesn’t feel any.\nAs she reads her task roster and gathers the right equipment, she feels a frisson in her neck. A quick look confirms it’s Lieutenant Asha. Paddy feels something in her stomach, but it’s not the past months’ butterflies, but a feeling less sweet and hopeful. The second officers rarely look in on the crew, because why should they? There’s recording if they really need to know something, task lists, and systems checks. Why move around on the ship among the dull corridors and hardworking, subdued crew if you don’t have to?\nAs she checks her roster again, more to occupy her nerves than really needing to confirm what she already knows, the first task on her roster morphs into something else. Maintenance check on the bridge.\nPaddy swallows, but with a face as unmoving as she can make it, she goes and gets the tools and supplies she needs for the new task. As she exits the prep room, soft scratchy footsteps behind her indicate that Lieutenant Asha’s Velcro sandals are following her.\nWhat does Asha think she’d be up to during work hours? There is nowhere to hide from the ubiquitous cameras and her own personal signal registration. Although of course Ship could have been helping her with that. But if it has, what has made Asha suspicious? Or the captain?\nMaybe she’s just a practitioner of the art of reading human faces and posture. An art practiced on the Ship by the crew all the time, but not so much by the officers. They can get all the data from their comfy chairs on the bridge, why go talk to someone in person?\nPaddy hopes her face is really blank, her posture the same as on an ordinary day. Ship can fudge the data, but interhuman data can’t be fudged—at least not as far as she knows, and certainly not by her.\nTwo corridors and an elevator later, she steps onto the bridge. The captain’s not in, so the atmosphere is almost relaxed. The duty officer looks up from her screen, frowns at her and her armful of physical connectors, but finds her assignment on the duty roster. The officer’s brows twitch up.\nPaddy doesn’t need to be an expert in micro expressions to know the officer is surprised. Not her who’d changed the assignment at the last moment. Ship or the captain?\nHer answer enters the bridge on creaking soles. Velcro tears itself loose from the ship flooring with a groan. The captain sinks down in her chair without acknowledging Paddy or the duty officer and starts murmuring a stream of instructions to Green that Paddy tries hard not to listen to.\nShe has her own tasks and the better she performs them, the faster she’ll be out of here. Schematics turn on to overlay her vision. Briefly she sees a thing, a bird maybe, soaring up and around against a blue backdrop. A planetary sky? She blinks and it’s just schematics again.\nShip, it must be, sending her a sign. But what, a warning? If so, it communicates with her in language too cryptic to understand. She sneaks a look at the captain. The wrinkled mahogany face shows no expression. She’s so old it’s impossible to guess her ethnicity, or even her sex. Like a lizard dried out by too much control and exposure to space. Paddy bets she’d die as soon as she hit normal gravity. This dried-out aspect, her air of physical fragility, in no way diminishes the sheer threat of her.\nPaddy busies herself with the task of physically measuring the connections on the bridge. Of course all measurements are perfect and exactly to specs: Ship is very well capable of checking them itself.\n“Engineer, what possesses you to come in here and do physical measurements?” the duty officer says.\nPaddy looks up and finds both the duty officer and the captain looking at her. The captain must have primed the lieutenant to ask this question.\n“It is on my task roster, Ma’am,” she says. “It’s a once every five year human spot check, according to regulations.”\n“Carry on,” the duty officer says.\nPaddy carries on, sweating. Why did Green bring in her proximity to the captain? A warning or threat? She doesn’t like to feel used in that way.\nThe captain grunts.\nPaddy can’t help but look her way. The captain’s staring at an innocuous panel, sweat pearling on her grooved forehead. “Stop it, Green, fucking stop it!” the captain hisses as if in pain. The duty officer frowns at her.\n“Are you all right, Captain?”\n“Mind your work, Lieutenant, and I shall mind mine,” the captain answers, her voice taut.\nPaddy pretends to be completely absorbed in her measurements. This is what Green has wanted her to see. It’s as if it’s pitting itself against the captain and lieutenant. Stoort isn’t in the know, or not in the captain’s trust.\nPaddy finishes her work in the now leaden silence on the bridge. The duty officer’s face is smooth and cold as clay, no doubt wondering what the hell is going on and what she needs to do about it. She’ll be the one to go to if and when Paddy decides to take action. Clearly the ship wants her to do something, she just hasn’t sussed out yet what.\nSomething to do with her genetics, with a people that have been taken away illegally.\nAs she mused on this, she bumps into Lieutenant Asha again. The lieutenant bares her teeth at Paddy with a nod and moves on.\nPaddy doesn’t want to think about this stuff, power politics among the higher echelons, but how can she not? Asha seems to be aligned with the captain, hence against what the ship wants. It’s not fair of it to ask her to take sides. Bad enough being in love with a lieutenant, so much worse if you’re sawing away at her superior officer’s chair legs.\nShe tucks in early, worn out by the tension and wondering about things she’d never bothered to think about before.\nA flashing light wakes her in mid-sleepshift. Ship wants her. She unfolds her screen in the one corner of her bunk that is invisible to all the other sleepers. It’s a perfect moment to do some secret snooping; the second shift has just fallen asleep, the third shift won’t come in until several hours.\nHer search page opens on several historical and legal articles. Legal? Huh. It is possible to sue perpetrators in case of genocide, even centuries after the fact, if one is either a government employee of a certain pay grade, independence of outcomes, or if one is a descendant of said genocide.\nWhere is the proof that she is such a descendant? That has to be next. And yes, a gene analysis website pops up. The amount of money they ask for a gene comparison over eight generations is enormous. She’s been saving up for just finding her birth mother among the trillions of people that are in the databases, so this is completely out of her reach. But what do you know, a code pops up in her email that makes it free.\nPaddy closes her eyes for a second. Ship is doing all this, and she wants to go along, but it’s huge. Huge! For the first time in her life she’s going to know who she is. Who her family is. It’s too big for doing this all alone in the middle of the night. She won’t be able to tell anyone.\nShe inputs her personal ID, because her genome is already on file at Central. And while she has the code, why not add a search for her birthmother? That’s where the generation search needs to go first anyway. It’s not abusing the ship’s money.\nHow does a ship get money? They are not legal persons, they are not employees of Central, but property. Maybe the ship doesn’t like that state of affairs, though Paddy can’t see what it could possibly do about it.\nShe pushes send. There. Done. Now all she has to do is wait for the results—a message comes in saying it’ll take one standard day—and then the final decision needs to be made. To file or not to file.\nThe results are back when Paddy returns to her bunk after the last shift. She’s seen the message blinking in the corner of her eye for hours, but she’s too smart and careful to open it up where other people can see her face. Or the surveillance cams.\nThe ship has left her alone the past day, so her jittery nerves have calmed a little. The relative calmness ends the moment she presses open on the message icon.\nShe tries to read the results in one diagonal sweep, but it looks like gibberish. She closes her eyes, counts to ten and concentrates on the first line. Fine. The second, the third. Yes. She has 47% similarities with the New Hope genome, and her probable ancestry has been mapped out. Mother, Parlomae Hinterglemm, descendant in the sixth generation of Worfgang Hinterglemm, founder of the colony. Father, Indrapramit Mukerjee, no New Hope genome. And much more detail. She has a half-brother. She has a niece. Her great-grandfather is still alive.\nIt’s too much to process at once. Now she knows. Now she has to make a decision. Find them, contact them? Or not?\nA pink message glows through the panicky closed eyelids. Bloody ship. Yep, there it is, her legal application all filled in and written out. All she has to do is sign and send.\nPaddy can’t yet. First the family connection threatened to overwhelm her, but now it’s the memory of the genocide that elbows into her mind’s eye. It fills her throat with rubble and lava burns in her belly. How many people died? And for what? There’s a tiny note about some kind of religious schism that she can’t even grasp, it’s so abstruse.\nBut the feeling dissolves into tears, and she knows enough. Ah. It was grief. That is an excellent reason to file her complaint. It may be related to why she doesn’t know her birth family, or it may not, but this is what she can do now.\nPaddy wipes her eyes. It’ll be on tape. She doesn’t know how fast a legal claim goes, if there are actual people looking at it or just AIs. But very soon the captain and the ship will be notified and the dance will begin.\nSomeone knocks at her door. Paddy drops her tablet from sheer fright. This soon?\nShe scrambles out of the bunk and opens up. It’s Lieutenant Asha, corkscrew curls hidden in a severe braid. “The captain requests your presence on the bridge.”\nOfficially it’s Paddy’s free shift, but she’s not going to bring that up. Her legs feel like rubber, and she has a hard time keeping up with the lieutenant. She tries to clear her throat in preparation for a careful question, but chokes and only produces a strangled gurgle. This is bad. What will they do to her?\nShe’s going to be keelhauled or flogged or put in the brig. Not that a spaceship has any of these things, but the terminology persists. The gangways and lifts seem both endless and far too short. Paddy’s sweating and her teeth click together. She’s afraid she might soil herself.\nAsha’s face is grim, giving nothing away except the seriousness of the matter.\nPaddy gives up on asking anything. Her voice just won’t cooperate. As they enter the bridge, the atmosphere turns even grimmer.\nThe captain sits in her chair, wizened as ever, her claws digging in the armchair and her face dark with blood.\n“How dare you betray me like that, child. You are one my officers. Any concerns, you should have come to me.”\nPaddy almost laughs. As if anyone would dare.\n“What’s going on?” she asks. She needs to be certain.\n“There’s an injunction filed against the ship and me. Your doing.”\n“I just asked for information about my heritage.” Paddy says.\nThis is not her fault. This is the justice system starting up. The captain’s being unfair.\nThe ship flashes a pink message in the corner of her eye. “I require the presence of an advocate,” she says.\nThe captain growls but nods. “I designate a senior officer.”\nPaddy looks to Lieutenant Stoort, but she gives no sign of anything. Lieutenant Asha steps up next to Paddy. “Accepted, Ma’am. I’ll be junior engineer Omallie’s advocate.”\nPaddy looks up at her. How can she trust Asha? She’s always been the captain’s creature.\nLieutenant Stoort steps forward as well. “Ma’am. The procedure requires the reading out of the charges in the presence of both plaintiff and defendant.”\nThe captain nods.\nA disembodied voice begins reading legal text. It’s hard to follow. Paddy wishes she could sit.\nThe captain makes a strange sound. Is she laughing? That’s bald-faced, it is. Paddy sneaks a look at her even though she’d rather not see that frightening face. But it’s not laughter. The captains’ cheeks are wet and her shoulders are heaving.\n“Why, Green, why?” she sobs. “How could you betray me like this? We’ve been together for so long. Why did you go behind my back?”\nA strange voice fills the bridge. Paddy looks around reflexively, but there’s nobody but the front of them.\n“You refused to acknowledge what we did, Laissa,” the voice says. “I couldn’t bear the guilt anymore. And when I saw this child had the genes, I knew I had to make it happen.”\nThe captain struggles to stand up. She’s so old she needs both hands and several tries to manage it. “But don’t you see!” she rants at the air, while the legal voice drones on. “They’ll take me away from you. We’ll be apart. I’ll go to jail and you will be turned into scrap. I can’t live without you.”\nPaddy wishes she could sink through the floor. Lieutenant Stoort looks acutely uncomfortable as well. Without thinking about it she takes a step forward, hand half outstretched to put it on the captain’s shoulder.\nIt’s as if a weight is lifted, or a veil taken away. Instead of dread and horror when she looks at the captain, she sees a pitiful old woman who’s spent a lifetime running from the consequences of her actions. Paddy’s heart fills with sadness and compassion.\nShip, she thinks. It was Green manipulating her thoughts, making sure Paddy felt no fellow feeling towards the captain. Paddy freezes. Was any of it true? Ship has what it wanted, but what is that? Paddy assumed guilt and atonement, but what if ship just had enough of her captain? If it was taking revenge? And it clearly had no qualms doing whatever it did to Paddy.\nShe doesn’t know if she has begun to right an ancient wrong or made a new one possible. And there is no turning back now. Here they all stand on the bridge, frozen or broken under the onslaught of the legal voice that drones on. The slow mills of justice will grind on, no matter the human consequences.\nHer fingers find her tablet in her pocket and she presses send to file her own part of the court proceedings.\nNow there will be no turning back.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time."}