{"fingerprint": "iBS2OlrLDEkg/RFYJIenWrTb4fw=", "sitename": "Clarkesworld Magazine", "title": "The Face of God by Bo Balder", "author": "Bo Balder", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/balder_02_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Face of God by Bo Balder", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4400 words, short story\nThe Face of God\nI was the first. Not the first to touch the God, but to notice the effects of the Godflesh. Mother and I had walked up to where the God’s hand had landed, crushing houses and flattening trees. The left hand had buried itself partially in the ground, palm down, so even though the pinky finger was five times as thick as a normal house, the pad of the fingertip was just within reach.\nI was ten years old or so, but I was so thin and wasted my mother could still hold me up. I reached for the edge of the God’s nail where it stuck out over the dirty hill of its pinky finger. The God had landed butt down in the valley, his neck on the mountain pass, his head tipped back. His legs flung willy-nilly, one in the river, one on the lower pastures. One arm over the mountain range, one reaching down. The river had flooded when he landed and was now carving out a new streambed right in the middle of town. The God’s arrival hadn’t seemed fortuitous at first.\nThe top of the finger was bigger than the temple, the nail edge itself wider than my two hands. It was like a rock, rough and grooved and striated with reds and pinks. I held out my shaking, burning arm and managed to slide my fingertip over serrated edge. It stung, and I bled a little.\nMother staggered and set me down, not so gently. She stroked my hair. “At least you’ll have the blessing of the God,” she said. I’d always been sickly, and she didn’t expect me to make it through the rainy season. I had a cough and could hardly keep my food down. But as I drowsed on her back on the way home, my breaths seemed easier and the banana leaves hanging over the path looked greener.\nAnd when I ate all the gruel in my bowl and even asked for a second one, my mother, an observant woman, became suspicious. It was natural to link two unusual occurrences in one day. I slept like I never had before, I woke up hungry and eager to get outside. I could only crawl like a crab, because my legs had never grown and my right arm didn’t work so well.\nIt took mere weeks for me to grow longer, stronger legs and to start walking. My mother must have spent all that time thinking and planning, because as soon as my legs were a handspan longer than they’d ever been, so that even people who didn’t see me often could spot the difference, she took me to the priest.\nBecause I felt so much better, I noticed more about the world. The priest looked thin and shabby, and his temple had seen better days. The God had fallen down from the sky only months ago, and already he must be feeling it in his pockets. Why visit a temple built by human hands, why put a coin in the bowl of a fat-bellied god only human in size?\nMother showed Brother Karman my legs. We knew him well, from many donations and prayer sessions about my health. Mom was ruthless. She demanded her money back. Karman’s god had given bad service, and now we were owed recompense.\nPoor Karman was too stunned to protest when she marched in and took from his stash whatever she liked. Not as much meat and rice and fruit as he might once have had, but still bolts of good cloth, gold coin, and jade jewelry.\nI didn’t know what she was planning, honest. Next, Mom marched up to the biggest house in the village, which happened to have a childless wife. “Look at my son,” mother said without preamble when Saiha opened the screen door. “He’s growing real legs. I know what made him better. Give me your house and I will tell you.”\nI saw she was right to act so fast. It wouldn’t be long before the secret was out.\nThe wife crept forward and bent to touch my new leg stumps. I knew they would be hot to the touch. She looked into my eyes and she must have seen something there, because she nodded.\nAnd so we moved into the rich house, and our prosperous days began. I would later think back on them as a lull, a brief perfect time of peace and plenty.\nBecause when I had caught up to a normal twelve year old’s height and strength, my mother put me to work on the God.\nI checked my ropes again. The God had become slippery and treacherous the past years. Almost all of his original surface had been harvested, leaving the glistening, purplish membranes that lay beneath the skin for us to hack loose. It was harder to sell those, because they weren’t as dry and easily cut up as the outer skin bits had been. That was why I was leading an expedition up to the God’s face, which was hard to reach because of the positioning over the mountaintop. We had tried the Hair route first, like many explorers before us, but had had to give up because of the large six-legged predators living inside the Hair Forest. We had had ladders made, to climb up straight from the collarbone promontory down and back up to the chin, but the terrain of the chin and lips had proven too treacherous. A man could fall inside a pore and never be found.\nI hammered in the next anchor. We were scaling the head via the earlobe. I couldn’t be sure the earlobe was still solid, since the mayor had tried to shoot it off with cannon fire last year. Some God stuff had slid down the shoulder, and we’d found some rotting bits of it on our way up the slippery, oozing slope of the biceps and deltoids. The trapezium muscle was likewise scored with cuts and shallow lakes of clear fluid and blood.\nThe God’s movements had started about ten years ago. It had always been clear that he must still be living, since he didn’t rot and kept bleeding and oozing, but we assumed him to be insensate. But ever since that time, he had occasionally twitched or produced a deep sound. The twitches were lethal for any workers happening to be digging on that part of the God, since they got shaken loose and fell to their deaths or got swallowed up inside crevasses or tubes inside the God’s flesh. Sometimes their skeletons would pop out of an infected tube when the pus broke out. The skeletons wouldn’t be dead, because of the unnatural vigor the Godflesh imparted, but also not alive. We burned them, thinking it a kindness to end their half-life.\nThe sound—I thought of it as the moaning, but there was no way to know if this was the case—was even more deadly. It could kill a person at several miles distant if they happened to be standing on rock. Since then, all of us had wax earplugs with us and thick scarves around our heads to muffle the sound and protect our bones. People had started to build towers right next to the God’s lowest flesh, so they just had to take the stairs to the roof, reach out, and pluck off a bit of dangling tissue, but that new town had had to be abandoned.\nThe earlobe rope held, and I proceeded to scale the neck. The thick shelf of trapezoid muscle and the neck tendons gave firm footing, in spite of the surface erosion. It was still expensive and time-consuming to climb up here, so I witnessed whole slabs of fat beneath the skin that were still almost intact. Rich pickings for someone else.\nNobody had ever seen the nose up close. I assumed it to be relatively soft, like a person’s nose. It would be easy harvesting. Likit had devised a trolley system whereby a team could camp up on the nose for weeks and ferry the harvest down in baskets traveling up and down the rope. Very ingenious. I was looking forward to astounding my mother with my profits.\nIt was hard work, but finally I dragged myself over the jawbone and hung there to rest for a moment. We couldn’t stop here, there wasn’t enough horizontal surface. I had to climb on. I took some time to decide my course while gnawing on my rations. From up here, I couldn’t spot the nose, so I would have to guess the course. We knew the nose was there only because people had climbed the peaks across the valley with telescopes and gazed upon the God’s face. It could not be seen from below or even a few miles away due to the complex geography of neck, shoulder, and face tipped back over the mountain ridge.\nI decided to go North-northeast. I conveyed the decision to the rest of the team taking their moment on various locations of the neck. We wanted to make camp near the nostril before nightfall, so we had to press on. I reached a less steep incline. That was worrying, because the route to the nostril should have been straight up all the way. We needed to discuss what to do next. It seemed I might have plotted a wrong course.\nWhen we had all convened, we had a brief meeting lying prone on the slope with our pickaxes buried in the pristine skin. All of my men had the discipline, and a surfeit of Godflesh around them to keep from hacking off a bit of such prime merchandise. The cheek was not our goal.\nStrike more westward or eastward? Were we too close to the chin or too close to the eye? Consensus was the eye, that we had to be on the cheekbone ridge. Could we even hope to redirect to the nose, or should we focus on getting to the eye, if we were indeed close to it?\nA flock of sparrows flew overhead, wheeling and grouping and regrouping, and I wished to see what they saw, so I could be sure of my position. But I couldn’t, and I was the one who had to make the decision, right or wrong. My mistakes had cost dear Likit’s life. I wouldn’t care as much if Banuson and the others died, but I would lose all credibility as an expedition leader. Mother would never let me hear the end of it.\nI chose the nose. My guess was we were close to it anyway. Since it was getting late in the day, it would be easier to camp in the folds beneath nostril, and also the ascent into to the nostril itself would be easier. We could use a break since we’d be traversing one and a half times the originally estimated distance. Health and vigor wouldn’t help us against tired muscles and lack of food.\nWe struck east. The terrain stayed hard and inexplicable. But how could I still be wrong? If we went eastward enough, surely we should encounter the nose. Banuson called up to me, wanting another deliberation. I wedged my clawhammer deeper into the cheek side and opened my mouth to call back a refusal, when suddenly all was wet around me. I couldn’t breathe, I tasted salt, and something tried to sweep me away off the cheek side, taking my feet and lower legs away from the slope. A deluge. An avalanche of salt water.\nIt passed. I clung to the cheek side, drenched and shivering, shaken to the core. What was this? We had never seen water run off the God. I coughed the water out of my lungs, feeling the anchor shift as I did so. The water had softened the God’s skin, and we would have to proceed more carefully.\n“Banuson!” I called down. “Arto! Meka! Are you all right?”\nA faint voice called up. It was Meka. “Banuson got washed away. Arto is wounded, I think he broke his shoulder. We need to make camp!”\nI looked up. The slope looked as it had all day, tall and forbidding. Arto would fall if he couldn’t get rest soon.\nI knew I had to concede failure. I had chosen wrong and killed Banuson. We should have been at the nostril hours ago. Why was it taking so long?\n“We strike west!” I called down. “Take care, the skin is softened.”\nBut I discovered that it also meant we could move quickly. I could almost claw the skin with my nails, so soft was it. We moved fast before the skin could tear and loosen our grip. The terrain leveled out and we could walk, digging our steel toes into the cheekbone.\nI set out anchor points for a tent and made fire from skin flakes and hair. It smelled rank but we needed it for Arto. When the two others were settled, I scrambled up the slow incline for a bit. It seemed I saw moving against the horizon, but no matter how I squinted and shaded my eyes, I couldn’t tell if it was clouds or a shadow.\nArto was seriously hurt, his shoulder hideously dislocated and painful. Meka had lost all faith in me and didn’t even believe we could descend safely and make it back home.\n“You have to try,” I told him. “For Arto’s sake. All the anchor points are still there, you just have to retrace our route. You put Arto in a harness, give him all the water, and just hope for the best.”\n“What do you mean, you?” he growled. “I’m sure you meant to say ‘we.’”\nI stared at him. “Of course not. I’m going on.”\nAs soon as I said that I realized why Meka was looking at me like that. I was going on. I was leaving my teammates behind. I was a little shocked at my own callousness. And at the same time I knew I wasn’t going to change my mind, no matter how much danger I was putting myself and the others in. I couldn’t come back to my mother with nothing.\n“I have to. If I don’t go and bring back a piece of nose or eye or wherever we’ve ended up, the whole expedition would be a failure. At least let’s bring something back. So go now, or you could wait here for me and we go back down together.”\nMeka gestured at the shivering, ash-gray Arto, who wasn’t really taking part in the discussion. His whole body shook from the effort it took not to scream with pain.\nI averted my eyes. I could feel pity for Arto welling up and didn’t want to feel that. I didn’t want anything to stop me from climbing on.\n“You have to make up your own mind,” I said to Meka. “But I’m going, or I won’t be back before dark.”\nI got up and shrugged on my pack. I checked all my gear. Just as a routine, not because I distrusted Meka. It was complete, every ring and leather and rope present and intact. I took off without a backward glance, not trusting myself enough for that. I couldn’t weaken now, I had to do what I’d set out to. I didn’t ask myself why exactly.\nAt first the slope was steep enough that every step was an effort. My calves burned, my thighs ached. But sooner than I expected it leveled out somewhat and I could make good speed. I saw the dark clouds on the horizon again, but now they seemed more like a dark forest with waving fronds.\nI was getting close. I upped my speed, barely even slowing down to chew on some rations. So close. A sudden shiver in the skin below my feet gave warning. But of what? Where should I go? I realized I was walking upwards in some kind of funnel, and if another of these floods was coming on, I would be utterly vulnerable. With my adze and left hand I clawed up the soft side of the funnel. The flood poured down soundlessly, one minute there was nothing, the next I was up to my knees in water. The water tore at my flimsy hold in the bad slope, but I jammed my knees and elbows into the soft sides and managed to hold on.\nI stared down after the glimmer, like a snail’s trail, which the flood had left behind. I hoped it wouldn’t tear through the bivouac. Or maybe Meka had started the descent already. I know I would have if I was him. I wouldn’t wait on the likes of me, the most dangerous kind of lunatic you could have on a climb. A maniac, someone obsessed with reaching his goal no matter what the cost.\nThis was the second time I had a feeling like that, and like before, I wasn’t going to let it change my mind. My goal was up there. I wasn’t going to turn around before I had gotten a good look, and preferably a nice slab of whatever was up there.\nI set off again, careful to stay off the lowest point in the runnel, even though it slowed me down. I couldn’t count on another shiver warning like the last one.\nThe runnel was leveling out. Staying away from the bottom meant getting closer and closer to the top of the ridge that flanked it on both sides. A giant wind buffeted me, and I fell over. I had my ice axe out and secured myself within seconds, but it was still a scary moment. Flash floods, wind, what other surprises did the face of God have for me?\nI clambered on, very tired now. Looking up at the sky, it was already past midday. I’d have to camp out there without cover. Not the first time I’d tied myself to a few anchors and axes and dozed away the night, though. But I’d never been completely alone.\nThe next step changed everything. Instead of a featureless brown-gray plain, I suddenly beheld a vista of odd ridges and outcroppings, a beautiful little lake surrounded by waving forest. I blinked. The lake wasn’t flat but bulged. The next moment the lake disappeared, and I fell over. When I scrambled up it was back.\nIt was the eye. Now I understood the wind and the waving fronds. It was blinking. I squatted down, secured myself with two axes and my knees and elbows in a crevice, and waited for the next gust. Blink. I counted out the seconds until the next one. Twelve. That was enough for me to scramble ten steps forward and then secure myself again.\nBlink. Scramble. Blink.\nOne more scramble and I would have reached the waving forest. The eyelashes. Two, four, eight, ten. I dove forward at the end of my count and slammed my axes into the root of the lash. The gust of wind passed over my head. I was safe.\nI crawled from lash to lash over the quivering rise until I could look down. I saw the lake of the eye across a slippery pinkish brown slope. Close to shore it glistened, yellowy-white, just like my own eyes. Further up the convex expanse light refracted and broke, so it was hard to see the edge of the iris.\nI had to get me some of that eye water. That would bring in a lot of money, making this whole expedition of mishaps and suffering worth its while. I walked across the edge of the lash forest, trying to find a less slippery slope to get down to the eye lake. I had to trudge all the way to the corner of the eye to find it. There the dryer skin around the eye met the eye lake without the border of glistening inner eyelid. I touched my own eye. The lake looked exactly like a person’s eye, only so much bigger.\nI secured a triangle of anchors, roped myself to them and set out with my sharp-edged scoop and leather bucket. I knelt down at the edge and touched the eye.\nIt wasn’t watery and soft like I expected. It was sticky and rough and bouncy. A good thing my scoop was sharpened. I bent down to dig in, but my eye was caught by the glimmer of light in the upper slope. There, over the black, the eye must be clearest and most valuable. I wanted to look down into the pupil.\nI scrambled up, leaving my anchors back on the corner of the eye. Any fall would bounce me harmlessly down into the cleft between eyelid and eye. Or maybe I didn’t think about such things at all, I just wanted to be up there and gaze down into the blackness.\nIt was hard getting traction on the iris, in spite of the stickiness. And I’d forgotten about the blink in my eagerness. I saw the eyelids moving towards me and I just threw myself down, ramming my fingers into the iris because I’d left my axes behind. I wasn’t myself. This was dangerous. I’d momentarily forgotten that in the wonder of being on the actual eye of God.\nI pressed my head down on the strangely textured eyeball stuff and felt the storm bear down on me. A moment of semidarkness and the eyelids passed over me again, with a slap like wet sheets in the wind.\nI scrambled up. I had to get to the pupil in the next pause between blinks. I clawed upwards until I found a flatter bit of the eye globe. The edge of the pupil was like a pond, scummy with weeds and algae blooming just under the surface. I looked down in it and saw nothing but my own reflection. How disappointing. Maybe if I went to the middle of it?\nI stood upright and walked over the strange bouncy surface, like black ice, but without the cold and the booming. My cramponed boots had some traction on the surface, but without my axes I couldn’t take anything back. I stomped my feet as hard as I could, hoping to tear loose some surface bits at least, or maybe once the membrane was pierced I could scoop out what I imagined was the soft gooey interior of the eye. Although I had never done that do a human eye, so maybe I was imagining it all wrong.\nThe blink came so fast I didn’t have time to hunker down and anchor myself. After the blink, I was still tumbling around, flailing for a handhold when a hot rush of water swept me away further. It wasn’t as strong or as much as the flash flood, so I managed to still myself by anchoring my hands in the weedy stuff at the edge of the pupil.\nEverything went dark, then light again, and air rushed past me so fast I could hardly breathe. I couldn’t see anything but light, sky, the sun, while I was slipping down brown God stuff again. Where had the eye gone? I saw the God lying below me, the face, a nose, two eyes, darkly circled, and fixed right upon me!\nThat was impossible. The God wasn’t awake. Where was I? Had birds swept me up in the sky? Or had I died and was this my ascent to a higher plane?\nI was moved closer to the face and then I saw the arm below me and guessed what was happening. I was on a finger of the God, where he had rubbed me out of his eye. I clung to the fingertip ridges, as deep as a plowed field.\nI moved further away from the face again. The God eyes squinted, as if trying to get a fix on me. And then it happened.\nI realized I was looking into the eyes of a person. God or not, this was a living being that I had just annoyed by clawing at its eye. I didn’t want to do it, but I craned my neck left and right to take in the God’s body from above. So much red, so much damage. We’d used him like cattle, no, worse, like a quarry. Never thinking of him as a living, sentient being, just as a resource.\nAs I hung there, about to be quashed like the bug I was, something even worse happened. The God saw me. He had to squint something fierce and turn his head from side to side—I didn’t want to think what would be happening to Meka and Arto at that moment.\nHe saw me. His face contorted. Not in anger, as I would have done, but in pain and confusion. This is what his face asked. Why, why did you do this to me?\nI felt myself grow hot with shame from top to toe. I vowed in that moment that if he let me live I would use the rest of my life to make it up to him, free him, heal his wounds, let him walk away from his imprisonment.\nThe world whooshed around me again. When I opened my eyes, that I have to admit I closed in fear, I was almost on the ground, just a couple of man-heights away.\nI didn’t hesitate for a single moment. I slid down, not caring I might come down hard. Anything to get away from that hand. Those feelings. I tumbled down in the grass and rolled away to break the fall. I was alive.\nThe God had seen me. He had treated me with compassion and care, although we had not. I felt so small. I covered my eyes in shame.\nI scrambled up. With bowed head and dragging feet I started to make my way back to the village, where I would have to face the Elders, and worst of all, my mother.\nNow it was up to me to show the God that we could measure up to him in kindness and compassion. I didn’t want the task, with all my heart I wanted to cast it away from me. But I suppose it was only fitting that it fell to me, as the first recipient of his beneficence.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time."}