{"fingerprint": "n5IkCwSE4UCrgNwA9wRAY1B2ak0=", "sitename": "Clarkesworld Magazine", "title": "A Cigarette Burn In Your Memory by Bo Balder", "author": "Bo Balder", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/balder_01_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Cigarette Burn In Your Memory by Bo Balder", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4210 words, short story\nA Cigarette Burn In Your Memory\nGouda’s clients have always lost someone, even if it takes them a while to work up to it. This man has lost a daughter. His kind, round face is grooved with sadness. She likes him at once, which isn’t her usual MO. “She was taken two years ago,” he says. “Me and the wife had gone shopping, and when we came back, she was gone.”\nGouda glances down at the information he brought, as requested. Photos, birth certificate, council registration. The latter form is curiously blank. She checks anyway.\n“Where was home?”\nThe man stutters and it takes him several tries to answer. “Dordrecht.”\n“It’s not on the registration.”\nHe paws his briefcase and provides his home address. He’s only lived there eighteen months. Gouda licks her lips. This is one of those strange cases she’s been getting the past two years. Missing children, missing parents, missing grandparents.\n“Tell me about the day she went missing,” Gouda says. The man, Jansen is his name, starts talking in his monotonous, broken voice. Gouda has no children, but she now knows everything about what the loss does to parents. The past two years have been one unending stream of the bereaved.\nSomething must have happened two years ago. On her map, she has circled the names of cities that come up the most. Dordrecht, The Hague, Delft, Zoetermeer, Ridderkerk. If you circle them, the center of that circle is in the middle of the sea. So far, she hasn’t been able to find anyone of this kind of missing person. Still the clients keep coming, maybe because she located a few ordinary runaways. It’s a lot harder now that the Internet has stopped working.\n“ . . . And then we called her, as we always do when we’re away, and the phone number didn’t exist anymore. We got one of those prerecorded messages, you know?”\nGouda nods. She knows.\n“How could the phone number to our own . . . ” Jansen stutters, regroups. “To our house? That’s just silly.”\n“So it was a landline?”\n“What else could it be?”\nGouda wants to ask a follow-up question, but she too finds that her tongue flaps in her mouth, not knowing what to say. Her eyes drift to the baby tablet on the table, a great little device to play solitaire and Sudoku on, but nothing like a phone. No hook, no numbers.\n“How old was your daughter at the time of her disappearance?”\n“Sixteen.”\n“Old enough to leave her on her own for a night, then.”\nJansen tries to say something, but nothing comes out. It’s hard to talk about the missing. Everybody knows that. Evening TV is full of reality shows about the missing. And not just Dutch TV, it’s happening all over the world. So if your heart aches for a child you can’t quite remember, you can wallow in other people’s grief all night long.\nJansen pays Gouda’s retainer and leaves with a follow-up appointment in two weeks. Gouda writes up his case and adds it to her take home pile. She likes to sit in front of the TV. Her building has a working TV antenna, which makes her very popular with friends and colleagues. Before the cable stopped working she watched shows from America, mostly. They still get broadcast, but the delay has grown long. Shows have to be printed on reels, shipped across the Atlantic, recaptured on digital and broadcast via the old antenna network.\nGouda knows she has visited America once, but the weird thing is she can’t remember which city she went to. But if she closes her eyes, she can hear the sirens on the streets, the honking cabs, the friendly greetings of faceless sales assistants, and the scent of hot dogs with sauerkraut. The pillows in her hotel room. Pointless stuff like that. There’s just no visual to go with these sensations.\nShe walks home. She could take the tram but it clears her mind if she has her face in the wind for a bit. The sunset over the Amsterdam canals makes her feel that life has meaning. They are lined with houses that have stood for centuries, which have been lived in by people who gave the stairs their hollowed out look, the railings their patina. History does exist. Some people do know their parents, their childhood homes. It gives her the courage to plow on, even though she has this big gap in her memory and doesn’t even know her real name, or who her parents were. She shares that with thousands of people, and that makes her believe that someday she will find out what happened that day, two years ago.\nIt’s like there’s a crater in her brain, with curling, cauterized edges, which has obliterated her memories. She probably can’t get them back, burned things don’t get unburned, but she would like to know what caused the impact.\nNo, that’s not true. She wants to know about her childhood.\nWhen she comes home she files Jansen’s information while she heats yesterday’s Chinese. There’s many entries in the J folder. She browses through them while the microwave buzzes. They’re all the same, except the date.\nThat’s so strange. Mr. Jansen has been by many times with the same story. Gouda never finds his daughter. He pays the bill, she closes the file. And then the same things happens again and again. Is that why Jansen’s unremarkable round face looks so familiar? She wonders why he keeps finding the same private detective, her, every time. The microwave pings and she puts the old files back and the new one on the table.\nGouda stands still, hands spread in a forgotten gesture. Thoughts slide away from her. The smell of food and the growling of her stomach bring her back to the present. Dinner time.\nShe sits down with the plate on her lap and picks up the stack of old picture books she got on the Sunday market. She opens them where she left off last evening and looks at photographs of Dutch towns. She has one memory of her childhood. An old man and an old woman walk with her at the edge of a small canal, not in Amsterdam or she would know it, and they smile at the camera.\nIf she looks at picture books long enough, someday she will find the town. As she turns page after brittle, yellowed page, she combats the nagging feeling that at one point she could have found out about this faster, but she can’t remember how.\nShe almost turns the page, mechanically, before she registers the picture properly. A canal, gabled houses, but tiny, like a miniature Amsterdam. Balk, Friesland, the picture heading reads. This is it. This is her childhood memory. She strokes the shiny, heavy page. It’s real. She exists. Holding the book against her face, she inhales deeply. But of course the old paper doesn’t smell like the canal did in her memory. Like stagnant water, hot brick, sticky remnants of ice cream on her little chubby hand.\nGouda puts the book back on the stack, then realizes what she’s doing, and puts it in a place of honor on the chimney mantle. She eyes the teetering towers of old books on the floor. Now she won’t have to go through them anymore. Her Sundays are now free. But this can’t be it. She needs to do more. She’ll go to that place, Balk. Maybe she can find her family. Although the probability of that happening is still small, as she doesn’t know their names. Maybe her grandparents were just visiting Balk on holiday. And they’re probably dead by now as well.\nThe momentary elation evaporates. She makes a pot of tea and opens the Jansen file. She’s going to sketch out a plan for tomorrow before her bedtime reading schedule. One day she’ll read a book she knows already. That too, could be a clue.\nGouda retraces the route the Jansen family remembers taking to arrive in Amsterdam. She travels to Pynacker. Mr. Jansen doesn’t quite remember getting on the train there, but where else could he have come from? As she gets off in Pynacker Station, she can see where the rails end in a double stop. Pynacker is a terminal station, trains cannot go through.\nIn front of the train station, a fan of directions greet her. Library, City Hall, shopping center. There is one little pointer that has been scratched out and stickered over so many times she can’t read what it says. That must be the one that leads her to the Edge.\nShe buys a cup of coffee, her one indulgence today. Coffee has gotten a lot more expensive because the airplanes don’t work anymore. On the other hand, the world has become warmer and in some places wetter, so coffee plantations in Spain and France are slated to reproduce the good stuff in a couple of years. It’s as weird as the thought of Dutch vineyards. Polar bears must be turning in their graves, poor things.\nAs she digs in her purse for change, a sheaf of ticket stubs falls out. She checks them idly before tossing them in the trash. They are all tickets to Pynacker. She’s been here before, many times. But why? And worse, why doesn’t she remember?\nShe notes the mystery down in her little notebook and re-pockets the ticket stubs. There’s a reason she kept them. Maybe this little nugget of information will help her forward in her search.\nShe follows the tourists to the edge of the water. It’s busier than she expected; cranes and boats are laying the foundations for levees. There’s a reason that nobody built any dikes before, but it escapes her for now. She moves away a little from the work crews and the staring tourists. Since the last time she was here, a path has been beaten out besides the water, and small groups of hikers are coming and going.\nShe walks up to one of them, his high-end hiking gear mud-spattered and sun-bleached. Clothes aren’t getting made as much as before, and cash to pay for them is hard to come by.\n“Hey, I’m Gouda Smid, private detective. Have you walked the whole Circle?”\nThe hiker turns to her, smiling, crow-footed blue eyes in a tan face. “I do a half-circle every season. Why?”\n“I look for missing persons, mostly. I’m sure you’ve seen on TV that they’re mostly from towns along the Edge. Have you ever spotted anything odd or different?”\nHe gazes away over the choppy water of the Hollands Diep. “Yes and no. I never see anything funny. It’s more the things I don’t see that make me wonder.”\nThis is more interesting than Gouda was expecting from a routine chat. “How’s that?”\n“The Netherlands have very few terminal stations, yet all around Circle Bay we have track railway lines ending at the edge of the water. Same with highways. Why build an eight-lane highway to a tiny little town at the edge of the water?”\nGouda thinks she’s maybe been watching the wrong shows. This sounds like National Geographic or History Channel material. “What do you do for a living?”\nHis mouth quirks into something less pleasant. “I used to be a city planner.”\n“You used to be? For what city?”\n“Good question. I can’t remember. Or I never had a job, in spite of my training and advanced age.”\nHe nods at her and walks on. He looks a lean and smart late thirties, not the kind of guy who’s been out of a job since college.\nGouda runs after him and gives him her phone number. “Call me sometime? I’m wondering what this has to do with my missing persons cases. Things just don’t add up.”\nThe man doesn’t commit but tucks her card away in one of his many zippered pockets.\nGouda sits down on a stray bollard, overlooking a paved square with faint markings indicating this was once a parking spot. She does have memories of cars, traffic jams, parking lots. But they are hard to match with this empty lot, which could have housed like sixty cars or more. There are still old cars running, of course, the ones without—her thoughts stutter. She takes out her notebook and writes the stutter moment down. It’s nearly full. She leafs through it. On the pages are words like “Netflix”—she found that one in an old calendar. “Chips”—those taste great, but can also cause prolonged stuttering, seizures, and even comas.\nParking lots, she writes down. Why do old cars still run? They still run because—and maybe because writing down the words make the stutter worse, she watches her hands flutter and clench over the notebook. The pencil breaks. The sun shines down on her face.\nShe closes her eyes and across the redness she sees icebergs floating past, tugged by boats. Icebergs are something polar. The polar ice is melting. Was melting. Is it still?\nShe opens her eyes and finds herself supine on pitted asphalt. The paving is warm because it’s a sunny day, so she’s not that uncomfortable. But her knuckles are grazed and her tailbone aches. She clambers back up, groaning from more aches and stings. A notebook is lying on the ground. She picks it up, and her name is on it. That’s weird.\nShe browses the notebook, and it’s full of incomprehensible notes. Bring it or toss it? No, it’s hers; she must bring it, even though there’s something repulsive about it.\nWhen Gouda gets home and wants to put the notebook away for later perusal, she discovers she has several more of those she’d completely forgotten about. On her computer there’s even a mind map of all the words, complete with date. Just to be sure, she finds the last entry in the found notebook, which has no date, and puts today’s in.\nBut it’s disturbing, all the same. What other work has she done she has forgotten about? Her eye finds a full noticeboard on the wall. It looks like a serial killer’s wish list, complete with red cord and pins. But it’s not about serial killing; it’s full of clippings from magazines and newspapers, photos and yellow Post-its.\nShe reads one. “Where did the ice asteroids go? Recent astronomical data compared with centuries-old maps indicate that the asteroid belt and the moons of Jupiter have gaps in them that can’t be explained. It’s mostly ice planets, although heavy metals are also showing peculiar missings. On par with the vanished satellites.”\nMissing ice planets. Missing people. Floating icebergs in her dream. No such thing as a coincidence someone once said, although Gouda is no longer surprised that she can’t remember who.\nShe needs a dictionary. What’s a satellite? But while she has many letters of the alphabet in both Dutch and English encyclopedias, yellow, moldering volumes, she doesn’t have the Oxford English Dictionary’s Rob-Sequyle. To the library it is. The last time she was there the library had become dusty and abandoned, with only a few rejected books on the sagging shelves. But encyclopedias are heavy and she’s almost sure she saw a few.\nShe unlocks her bicycle and starts cycling the short distance to the library. The building still retains some licks of its once colorful paint, but the lower floor has had to be abandoned due to the rising water. But it’s lit up, the door opens, and she hears the buzz of many people present and talking. It’s a wonderful sound, bringing back memories that never really surface, but create ripples of their impending arrival in her mind. Better than nothing.\nShe walks into the big central space. It’s indeed full of people sitting at desks, writing and doing work-like things. She steps close to one of the workers, an elderly lady, and sees she’s writing a lined index card.\nThe activity suddenly makes sense. They’re re-cataloging the library! By hand, because the computer systems were all lost. There’s someone bent over an enormous machine she doesn’t know the function of, a bit like a microscope but not quite. And so many books have returned! Hundreds line the shelves; more are stacked on carts sitting beside the cataloguers.\nThe sight fills Gouda with joy. Humanity is fighting back against missing persons, misfortune, and climate ravagery, one book at a time. She even sees a new-looking book. She picks it up. A strong odor emanates from it, chemical and strong, but satisfying. The scent of a newly printed book. The pages are crisp, the type a bit smudged but strongly black. A new book. Someone has found an old mechanical printing press.\nShe asks for directions to the encyclopedias and is given stern warning not to take any volumes home. She offers to bring the ones she has at home. It wouldn’t be right to hoard that knowledge for herself alone.\nShe lugs the heavy dictionary volume, dated 1998, and leafs through the heavy pages. There it is. Satellite: natural object (moon) or spacecraft (artificial satellite) orbiting a larger astronomical body. Most known natural satellites orbit planets; the Earth’s Moon is the most obvious example. Artificial satellites can be either unmanned (robotic) or manned . . .\nThe words “communication” and “space shuttle” hurt her brain. She looks away quickly, leery of the buzzing sensation in her head, like a sinus headache. She wants to transcribe this important information, but she’s afraid that if she reads them again, the sentences will start up that painful buzz or worse.\nShe tricks her brain by copying the article out starting at the bottom, with the last word in the last sentence. This way no meaning forms in her head and it’s even possible to write whole words. As a last resort she would have written the words out letter by letter, starting with the last letter of a word and ending with the first, but that doesn’t seem necessary.\nShould she share this trick with the librarians? She decides not to. They are happy, having found a way to rebuild some of the knowledge lost in the computer crash. They don’t need to find out, like her, that some knowledge is painful, and some of it can’t be retained.\nAs Gouda exits the library she walks past a blocky machine that triggers a faint memory. It’s a copier. She’s used them in high school. Maybe it still works. Yes, the electricity is on and it hums. She puts her notebook facedown on the lit plate—funny how she remembered how to do that—and presses the copy button. The copy slides out. Wow, they even had some blank paper left.\nShe lifts the paper to her face and smells. She closes her eyes. Memories rise, but they seem a bit stale and flat. There is no clue there. Why? The machine looks old and scuffed, its beige plastic brittle and discolored. Maybe this technology is too old to have meaning for her quest.\nShe pockets the page and heads home. She’s no closer to solving her mystery, but her heart is lighter. Life will get better again, it just needs cooperation and dedication. She could be part of the library renewal if she wanted. Maybe it would be more rewarding than looking for people that have never been found yet.\nWhen she opens her door and climbs the four sets of stairs to her small apartment, a ringing sound shreds the air. Only when she sees the squat gray object emitting the sounds, she remembers it’s a phone. Which can be answered. She picks up the horn-shaped object, hesitant about what to do. It’s been so long.\n“Hi, is this Gouda?” A male voice says. “It’s Joe from Pynacker? I’m in town. I’ve got something for you.”\nGouda doesn’t remember any Joe from Pynacker. Has she even ever been there? Her left hand fishes up train ticket stubs that, strangely enough, all appear to be to and from Pynacker. One of them is from yesterday.\nThe idea she went somewhere yesterday and doesn’t remember it gives her such a weird feeling. She looks around the living room. Everything seems to be the same as before, no gray spots. If she went to Pynacker, it was for a reason, probably a case. She tells him where she lives.\nShe buzzes him in only ten minutes later. He’s a tall guy in his early forties with a weather-beaten face and sun-bleached hair.\n“Hi Gouda,” he says. “Nice to meet you again.”\n“Nice to meet you,” she says. “Joe, right?”\nHis gaze sharpens. “You forgot?”\nShe holds up the ticket stubs. “I guess I went to Pynacker yesterday, but I don’t remember. There’s a page in my notebook as well. This has never happened to me before.”\nJoe spots the kitchen and zooms in on the teapot. “Mint? Can I have a cup? I miss coffee, don’t you?”\n“I’ve read about it,” Gouda answers.\nSlurping his tea, Joe peruses her wall of clippings and pictures and pins. “I see you’ve found many of things I have. Satellites, huh? I’ve been zooming in on things we used to eat and drink but no longer do, because we flew them in on planes.” He taps a picture of a plane for emphasis. Or maybe he just wants to make sure Gouda knows what a plane is. “Coffee, bananas, spices. I wonder if someone in a faraway country is trying to reorganize shipping those things. They must be in as bad an economic slump as we are.”\nHe sits down at her table and gestures her over to him. Gouda’s almost irked by his casual possession of her space, but decides to let it go. She gets another mug of tea and sits down next to him.\nHe rolls up his sleeves. His forearms are surprisingly smooth and creamy pale, years younger than his weatherworn face. Gouda blushes and finds it hard to lift her eyes from those strong, muscled arms. There’s nobody in her life right now. Has there ever been?\nHe’s speaking and she’s missed the start. She takes a quick look at his face, which hasn’t changed, so he hasn’t noticed her moment of confusion. A sip of tea helps her get back to normal.\nInstead she sneezes. It takes her by surprise.\nJoe frowns. “Exactly. Humanity has a virus. We’re all infected. We can’t even . . . ” His eyes glaze, he starts to stutter.\nGouda watches with inexplicable dread. Something awful is going to happen. The light outside seems to darken, the room shrinks inward as the moment hangs in the air, pregnant with horror. But Joe draws his hands over his eyes, looks aside, shakes his head.\nThe moment is gone. The sun is still shining. But Gouda’s heart still races, evidence that something almost happened.\n“What happened? What did you just . . . ?” Gouda doesn’t dare be more specific, for fear of calling back the awful dread.\nJoe’s eyes roll up and aside, searching for an innocuous answer. “You have to approach the square through a side street, not full on. And if you accidentally luck onto a big thoroughfare, distract yourself by thinking of trees or scoot into an alley. Right?”\nGouda nods and jots down a quick note. She needs to remember this moment. It will help her with her case. She can’t quite remember what it was about, only that’s it’s important.\nJoe clears his throat. “It seems to me that there are strangers in town. And that at night, they demolish houses and break up streets, so that we can’t find our way home the next day. They are raiding our larder.”\nGouda leans forward. “They like ice cream.” Icebergs. “And the people living in those broken-up streets forget their names and where they lived—”\nShe chokes up. Too close. Across the table, Joe’s face turns purple and he makes hacking, desperate sounds. Their hands meet and she clutches his for one long moment, callused palm, warm fingers, blood rushing to meet hers.\nGouda blinks and starts at the stranger sitting at her coffee table. Her left hand has pale stripes over the back, as if someone just gripped her hand hard. As she watches, they fill with blood and disappear. As if it never happened.\nThe stranger stands up. “I’m sorry, Miss, um, I have to go.” He looks around wildly, as if he doesn’t remember what he’s doing here either.\nGouda gets up to escort him to the door. There’s a strange backpack in the hallway. She gestures at it. “This must be yours.”\nHe hesitates. “Are you sure? I don’t know . . . ”\nShe hands it to him, firmly. “I’m sure. It’s not mine.”\n“Okay. Thank you. Goodbye.”\nHe hesitates in the door opening as if there’s more to say, but there isn’t. Gouda shuts the door behind him and waits until she hears him clomping down the stairs.\nShe returns to the table and her mug of peppermint tea. There’s an open notebook on the table. “Don’t look into the sun,” someone has written down in her handwriting.\nAs if anyone would.\nShe looks out of the window and watches a stranger with the flapping coat and the sun-bleached hair walk away. It fills her with inexplicable sadness.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time."}