{"fingerprint": "/dU2fzMeAPqEHb763gl6jwPMfJg=", "sitename": "Clarkesworld Magazine", "title": "Dying Young by Peter M. Ball", "author": "Peter M Ball", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ball_08_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dying Young by Peter M. Ball", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7670 words, novelette, REPRINT\n Dying Young\n I smelled him coming long before he arrived, the musty odor of sulfur and dust cutting through the sweat-stink in Cassidy’s Saloon. Smelling things is part of it, that thing I inherited from my Da, but it weren’t just me who noticed it by the time he got close. The dragon stank bad enough that everyone breathed him in; the entire room hushin’ up, listening to the tick-tick of claws on hardwood, lookin’ at the door as he shouldered his way through.\n He was a tall critter, but stooped over to fit his tail, and he’d been banged up good and proper by something a little more ruthless than the road. The wreckage that’d once been wings were folded over his shoulders, draped like a tattered coat. There weren’t nothing but a jagged nub of bone where his horns had been, and that weren’t good: Da once told me a dragon without horns got ornery, and they were usually trouble for more than just the feller what cut ‘em off.\n The dragon stared us down; no one said nothin’ for a long stretch, but you can’t stare at a thing like him forever. Someone up the back of the bar coughed, probably Sam Coody or one of his cloned deputies, and that was all it took for everyone to stop gawking and talk amongst themselves. The dragon sneered at us, showing off a ridge of serrated teeth, and walked over to the bar. We pretended we were okay with it, the dragon being there in the saloon, like it weren’t no big deal, but our eyes drifted back. We watched him prop an elbow, easy as anything, and we waited for somethin’ to happen.\n The doc leaned over and nudged me with that big bone hook he calls a hand. “Trouble?”\n I flinched ‘fore I nodded, shying away from that hook. I didn’t even need a vision to figure this one out; there was a gun belt hanging on the dragon’s waist, visible every time he took a step, and Da never trusted strangers with guns. They were trouble, he said, and experience proved him right in the end. Doc Cameron knew that better than anyone.\n The doc weren’t satisfied with that, though. There were something pinching at the edge of his eyes, a little scent of fear underneath his oily perfume. “Look harder,” he said. “Tell me what’s coming,” and he gave me a hard look, stared until I closed my eyes and peered forward, using Da’s gift. I saw nothing but gray smoke, smelled nothing but fire. I could hear the sharp spit of an automatic through the haze.\n “Something’s burnin’, I can promise you that,” I said, “and I can hear a gun, Doc. Automatic. Someone’s headin’ for your slab, I think, before it’s all over.”\n Doc Cameron half-lowered his eyelids and scratched the sharp edge of his cheekbone. Something flickered across his pupils, a cluster of lights spiraling towards the tear ducts as he scanned the dragon. Military tech, a hold over from the war, the doc’s little gift to Dunsborough. The little box on his belt hummed, fixing the data from the doc’s cortical patch onto a slice of silicon.\n “Should we tell Coody, do you think?” I said, and the doc shook his head.\n “The sheriff will want details,” Doc said. “Damn fool won’t run off a dragon based on a hunch, even one of yours.”\n The doc sniffed. Coody was Da’s friend, last of the men Da trained before the doc took over. Doc closed his eyes and a light on the box flickered, the data loaded up and ready for study. “I’m going to go download this. Keep an eye on the lizard, Paul. The real eyes and the other. Maybe we’ll get lucky.”\n The doc slipped out the back way, eager to get back to his lab. I sat and drank my sarsaparilla and watched the dragon like I was told. I kept one hand under the table, close to that sharp knife Da gave me when I turned fourteen. The dragon didn’t do much beyond ordering whisky. I closed two eyes and opened the third wide, peering forward for all I was worth; it got me nothing but smoke and gunshots and the beginning of a headache that would last for days.\n It weren’t more than a half-hour after the doc scarpered before things got ugly.\n I can see trouble coming ‘fore most folks, even without the third eye. It was Da that taught me the trick of it, the ways of reading a room and seeing who’ll make the first move. The dragon weren’t lookin’ for trouble when he first walked in, but he were waiting for some to roll on by and get itself started of its own accord. In the old days Da would’ve talked him around, but Da’s long gone and Coody ain’t quite got the knack of keepin’ things peaceful. People in the bar worried, stayed quiet and whispered when they spoke.\n It were Kenny Sloan who stepped up, stompin’ across the floorboards to get in the dragon’s face. Sloan’s one of the doc’s razorfreaks, a ‘borg with a handful of scalpels and jacked reflexes, fast enough to slice the wings off’a fly. He put his weight against the bar and looked over at the dragon, propping his arm on the counter so the light gleamed off the metal. Kenny Sloan was a bully, like most of the doc’s boys. He flipped a quick grin back at his cronies, making sure they were watching. “Hey, lizard,” Sloan said. “I thought your kind knew better than to drink at human bars.”\n The dragon turned then, mouth full of whisky, twin trails of smoke seeping out of its nose. The molten eyes squinted at Sloan, studying him. Sloan was a big guy, even before Doc jacked him up; no one missed him posturing. The noise died down and I saw Coody and his posse of badges straightening up in their corner, gettin’ ready for real trouble. The dragon turned back to its whisky, ignoring us all. Sloan laid his fingers on the dragon’s shoulder.\n “Hey, lizard,” Sloan said. He flicked the mechanical arm out, blades sliding free of the finger sheaths. “We already beat your kind once, yeah?”\n Things happened fast after that, probably too fast to get the details without the third eye’s hindsight. Sloan went to strike the dragon, Coody and his tin-star heroes got up on their feet, and the dragon moved faster than all of them. A quick twist away from Sloan’s swipe, wings flaring out behind him, the dragon’s stance was low with clawed hands splayed wide. Sloan got himself gutted before his finger-blades crunched into the top of the bar, and he stood there, bleeding slow from a stomach wound and struggling to get his hand free.\n “You need a doctor,” the dragon hissed. He swallowed the last mouthful of whisky, and Coody’s men had him surrounded by the time he laid the glass down. The dragon eyed them carefully, all the sheriff’s skinny mutant-clones with their clunky pre-war revolvers. Coody pulled Sloan’s hand free of the hardwood; Kenny Sloan kept himself busy trying to hold in the mess of blood and gore that used to be his stomach. “Sorry for the mess,” the dragon said, and he touched his blood-slicked claw to his forehead. His wings settled around him again, rearranging themselves to cover his gun belt and the sleek lines of his body. “I’ll see myself out, yes?”\n The clones looked at Coody and the old man nodded; no one said squeak as the dragon walked away. Sloan moaned a little, making gurgling sounds when he tried to speak, and as soon as the dragon was gone the sheriff looked around and pointed in my direction.\n “Where’s the doc?” Coody said. “Blood and thunder, son, go tell Cameron to hustle if he wants his pet ‘borg to keep breathing.”\n I nodded and started moving, but Sloan was a goner. The doc didn’t care about his ‘borgs the way Coody looked after his clones, ‘specially not when they were as dumb as Kenny and there was prey on the horizon. I went ‘cross the square and buzzed the doc’s doorbell, but there was no answer coming. I had nothing to do but wait, go back to Coody, or go trailin’ after the dragon like I was supposed to. None of them appealed. Kenny Sloan was screaming inside the bar, dying slow and messy, so I went with the best option of the three; I ambled down the main street, following the soft buzz in my head that’d tell me where to find the dragon’s camp.\n The dragon was hiding out by Prickly Pear Hill, his bedroll stretched out in the middle of the twisted cacti that soaked up moisture from the stream curving ‘round the base of the slope. He looked like he was traveling light; a small pack looked empty, like he’d been killing food on the march, but when I strolled in I got the familiar itch and saw dirt piled up where he’d buried supplies. I opened the third eye, peered on down, and got a sense of crates, canned food, and cordite.\n I had myself a few good minutes before the dragon rolled in, largely thanks to the fact that I weren’t forced to backtrack in case the town sent out a posse. I sat on a rock and kicked the dust, listening hard, trying to hear him coming. It didn’t work; I didn’t hear him, see him, didn’t even smell him this time around. I ain’t easy to sneak up on, but he managed it. I just blinked my eyes and there he was, crouched low with claws out and hot spit dribbling down his chin.\n “Boy,” he said, nostrils flaring, and at that the smell of sulfur rose up around me. “You were at the bar, yes? Town sent you?”\n I nodded, keeping my hands out in the open. I weren’t armed with much, just my Da’s knife, and it seemed to calm the dragon. He knelt down, sniffed me, then sighed a stream of smoke into the air. “Ah,” he said. “You have gifts.”\n “A bit,” I said. “Not much, not really.”\n He sniffed again, breathing deep. I recognized the trick from when Da used to do it, knew about the clues you could pick up with the right kind of training. The third eye does big things, its own special kind of magic, but Da always said there were other senses to fill in what the third eye can’t see. The dragon smiled at me. “Trained, then? Your father?”\n I shrugged the question away. “I work for the doc,” I said. “He runs things; wanted you followed.”\n The dragon cocked its head, smiling. “Dangerous work, yes?”\n I said nothing, just crouched there on my rock and waiting for what would come. I had enough of my Da in me to know I weren’t going to die there, but that didn’t mean I weren’t going to pay hard for daring to follow him out there. I waited for the dragon to lash out, making use of his claws.\n It ain’t often I’m surprised, but he surprised me then. “I make tea, yes?”\n “Oh.” I blinked, and he watched me carefully. I forced myself to nod. “Yes. Please, yes.”\n I squirmed. The dragon turned his attention to the fire, hocked a sharp gob of spit into a pile of kindling to get things going. He unearthed an iron pot and loose tea from his pack, crouched down by the flames to set it boiling. There was something fascinating about the muscles moving under his scales, about the way sunlight gleamed on the dark ridges across his hands. He sat, dignified, and waited.\n “You’re after someone,” I said. “I saw that much, back in the saloon. Can’t see who, or why, but it’s going to end messy.”\n The dragon kept its eyes on the tea. “Yes.”\n “I’m thinking it’s the doc,” I said. “He got plenty nervous when you showed up, hurried off to his lab right fast. That ain’t like him, really. Doc Cameron likes his body parts, having new bits to play with.”\n That earned me a reaction, a snort of smoke and a twitch in the folded wings. “Yes.”\n “So what’s going to happen, when you front up again?”\n The dragon settled back on its haunches, stirring the pot. He lifted the pan and poured spiced tea into a pair of metal mugs, both of them bearing scorch marks on the rim. He handed one to me and I saw flecks of Sloan’s blood drying on the dragon’s claws. “You have the Sight,” he said. “You tell me.”\n My forehead tingled, all prescience and instinct, but turned up nothing new. “I haven’t seen yet; the future’s nothing but smoke and gunfire.” I took a long sip of the tea, felt the chili powder burning the back of my throat as it went down. The dragon watched me drink, red eyes narrowed to slits. I figured I knew what he was waiting for. “Ask,” I said. “I ain’t going lie.”\n “You have the sight, yet you work for your doctor?”\n I guessed what he was asking and short-cut to the answer. “He did some bad stuff when he arrived,” I said. “But good stuff, too. Helped people, gave ‘em back stuff they’d lost. Relics of the war, sure, but they had arms and legs again. They could work, and we needed workers.”\n The dragon’s laughter sent hot spit across the campfire. He put his cup down, tilting forward, and when he straightened up one of those ancient Lugers sat neat and easy in his hand. He pointed the narrow barrel in my direction, eyes narrowed down to stare at me. “You know, then,” he said. “You’ve seen what your doctor has done?”\n “Bits and pieces. Glimpses, really, but I got plenty of after what he’s done since coming to town.” I watched the cold fire in the dragon’s eyes.\n The dragon breathed deep. “He killed your father?”\n I nodded again.\n “And you work for him, still?”\n “Sure enough.”\n “Why?”\n “Needs to be done.” I sipped my tea, staying calm; he wasn’t going to shoot me, I could see that much. I don’t have all my Da’s gifts, not even half, but I was sure enough of that. “Not much good tellin’ folk ‘round these parts he’s the devil; they need the doc too much to care and it ain’t like anyone’s goin’ to be surprised by revelations of shady dealin’s. And my Da didn’t hold with revenge, really; he cared about keepin’ folks safe. He would-a done the same as me, most likely, if he ain’t ended up dead. These are nasty times; it takes a nasty man or a brave man to keep a town safe.”\n “Your father was brave.”\n “And look where it got him.” I tried to keep the anger out of my voice, to avoid the flashes of history that rolled in if I let myself dwell on feeling. Hindsight can be a curse, Da said, and he weren’t half wrong about that. “We’re out of brave men, now he’s dead. All we’ve got left is the nasty folk and the followers. Way I see it, I can have the doc dead or everyone else can live.”\n The dragon’s expression didn’t change and the Luger didn’t waver, but the tattered wings rippled as he adjusted his stance. The crooked line of its broken horn caught the firelight. “What you have seen,” he said. “You cannot save him.”\n I shook my head. “I wasn’t lying,” I said. “Haze, smoke, and gunfire, that’s all I got; one of you will die, but I don’t know who.” I paused, drinking the last of the tea. “I got a fair guess about what happens next, though, after he’s dead. It ain’t pretty, not by a long stretch. Out here with nothing but Coody to keep things safe, it’ll go downhill fast.”\n The dragon nodded, holstering the Luger and picking up its tea. “You should go.”\n I lingered for a moment, wondering what to do with my cup. The dragon rose, staring down at me. “Go! Tell your doctor I am coming.”\n I went, slinking back towards town with the tin cup still in my hand.\n Coody’s clones were manning the walls, so there was no real chance to sneak into town without anyone noticing. Two of them came down to the front gate to greet me, clamped down on my shoulder with heavy hands and started guiding me down Main Street. Four others stood on the palisade, dull eyes scanning the horizon while another one swept the landscape with the town spotlights. All of them tall, slack-jawed, armed; they looked the part, despite their daft expressions, hands on the holsters and eyes following the point of light that raked the landscape. The two walking me in said nothing, just held my shoulder and marched. I coulda given them the slip—Coody’s clones aren’t as bright as him, and he ain’t exactly sharp as knives to begin with—but a trip to the sheriff’s office gave me a good excuse to stay clear of the doc’s lab and delay my report by a few minutes.\n The original Coody was sitting on the porch of his office, whispering orders into a radio and making a big show of checking the action on the shotgun across his lap. He didn’t even look when his clones threw me against the step, just pumped his gun with a satisfied grin and cradled it ‘cross his lap.\n “Sent you to go fetch the doc, Paul,” he said. His good eye squinted as he drew a pistol and checked its load, the other glowing big and red beneath the doc’s metalwork. “Cost us bad, you not doin’ what I told ya. Sloan was dead ‘fore the doc could get to him, nothin’ left but parts.”\n Da tried training Coody, just like he trained me, but the sheriff ain’t got none of the natural talent Da had for prescience or reading people. It made lying to him dangerous; he had to grind the answer out of you if he wanted to be sure of something.\n “Called the doc and got no answer,” I said. “He left me orders, ‘fore he left for his lab, and I followed ‘em when he didn’t come to the door. You sayin’ I done the wrong thing? That I shoulda’ leant on his doorbell instead of doin’ what he asked?”\n “That’s exactly what I’m saying.” Coody’s eyes scanned the town in a long, slow arc. “Doc Cameron’s the brains behind this town, but I’m the law, kid. I’m the one who has to keep people safe now . . . ” He cut himself off before he mentioned Da, took a deep breath to clear the thought out of his head.\n I shook my head. “You really believe that, Sam?”\n “Yeah, I do.” One hand patted the shotgun and he looked at me for the first time, the mechanical right eye clicking as it focused on me. That eye was Doc Cameron’s idea, a replacement for one Coody had lost during the last war. I was willing to bet that Cameron could see what Coody saw, if the doc had half-a-mind to check in. “What did the doc have you doing?”\n I shrugged, and Sam Coody cuffed me across the back of the head. I went down in a heap, spitting red dust. “You wanna try that again, Paul?”\n “He had me trailing the dragon.” I sat up. “Wanted to know if it was after him.”\n “And is it?”\n I nodded. “Close enough to.”\n Coody sighed and rubbed his good eye with his right hand. “So, you peered into the future on this one? It going to end bad, Paul?”\n He held out his hand, helping me onto my feet. “It’s going to end, Coody,” I said. “I haven’t seen spit worth talking about, but there’s gunfire ahead and plenty-a screamin’. Dragon’s got the sight, I think, an’ he figures someone’s goin’ to die, but damned if I can see who.”\n Coody squinted. The long mustache twitched as he chewed on his bottom lip. He didn’t say nothing for a real long time.\n “I gotta report to the doc,” I told him. “He’ll be expecting me, Sam.”\n “Go,” the sheriff said, and he went back to his guns.\n No one likes going into Doc Cameron’s bunker, least of all a guy like me, someone with the sight. Places like the bunker are always screaming, the echoes of the past ringing out again and again. But there isn’t a damn fool in town that ain’t carrying the doc’s handiwork somewhere, not even me and I’m a damn sight cleaner than most, and Doc Cameron liked to keep tabs on folks. There were places I could hide, if I set my mind to it, but I’d come out eventually and pay my dues for disobeying him. I set across the square, and putting an eyeball to the scanner by the door, let myself into the bunker to tell the doc all the things he didn’t want to hear.\n My gut and my prescience both said it was a bad call; a braver man would’a skived off and spent the next day or three in his bunk, waiting out the storm until the shootin’ was over. I wasn’t a brave man, so I stood there until the steel doors swung open and a pair of Doc’s razorfreaks fell into step behind me and escorted me through the winding tunnels Doc’s boys hollowed out back when they first arrived.\n The doc was down in his workshop, working on Sloan’s corpse. He had the bone hook in the corpse’s stomach, pulling down and opening the skin like a zipper. The smell of it made me gag, but he didn’t even look up. “He’s here for me, isn’t he? The dragon?”\n I looked over my shoulder at the razorfreaks, big lunks who stood there, uncaring and mute. Doc looked up from the slick gore of Kenny Sloan’s innards, glared at me with cold eyes until I gave in and nodded.\n “Who shoots who, Paul? Tell me how much it’ll cost me to win?”\n I closed my eyes and looked, hoping to get lucky: mist; gunshots; the screams of the dying. “I wish I knew, Doc.”\n Doc Cameron nodded and buried his long nose back in Sloan’s vitals, poking about with the claw and good hand alike. His white coat was blood-splattered as he pulled the tech outta the dead. The days of the war were a long time past and supplies weren’t comin’ in; as the doc was fond of reminding us, it was a waste-not, want-not world now. He spooled cabling onto the slab, a thin line of plastic and fibers that had been in-and-out of ‘borgs since the early days of the war. “You talked to the dragon, at least?”\n I nodded.\n “What did he have to say?”\n “Not much.” I fidgeted best I could between Cameron’s guards. “He’s coming for you, knew I had the sight. He wanted me to look into the past, get a good look at what you did during the war.”\n “And you did?”\n “No.”\n Doc Cameron smiled. “You disappoint me, Paul. I thought you were built of sterner stuff.” He stood up, abandoning his work. Sloan’s guts dripped off the bone hook. He shook his head, full of mock sorrow. “What would your father think? A brave man like that, ending up with a boy like you?”\n “I don’t care what my Da thought, Doc. My Da is long dead.”\n “Why don’t I believe you, Paul?” The doc’s grin was terse, lips folded tight against his teeth. He held his bone hook like an offering, the oily smear of blood covering the tip. “Touch it, boy. Let us find out what kind of man you are.”\n Da used to say there were people who didn’t come out of the war quite right, and there were pretty good odds the doc was one of them. I forced myself to look him in the eye. “Don’t matter what you done, Doc. Not during the war, not last week, not when you first met the dragon and did whatever ya done to him. If you’re the one who goes down . . . ”\n “Yes, if I go down.” He let the thought hang, thin lips twitching, but neither of us finished it. He nodded to the razorfreaks and they hustled me out. I didn’t bother struggling as they clamped their steel hands on my arms and lifted me, carrying me out.\n The other freaks buried Sloan right on sunrise, interring the small bag of meat parts the doc couldn’t use into the red dirt just outside of town. Coody and his clones watched things from the wall, stiff-backed guardians with shotguns and rifles, not wanting spit to do with the doc’s bullyboys. They were allies, sure, when the town needed defending, but it was uneasy at the best of times and tense at the worst.\n Coody doubled the guard that night. Buried meat had a way of attracting scavengers and things went downhill real easy after that happened.\n My gut said we were safe for a day or two at least, and there were no tingling on the third eye to say it were wrong, so I drifted past Coody’s office and let him know we had some time up our sleeves.\n “Best keep an eye out,” Coody told me. “Just in case, like.” His logic was bravado, mostly, for all the truth of it. You didn’t have to have the sight to feel the tension; the whole damn town was on edge, waiting, and Doc Cameron had been locked up inside his vault for nineteen straight hours trying to figure a way to save his skin. Da told me plenty of stories about his time in the army. Said we fought a whole damn war against the dragons and it’d cost us big every time the shooting started; one o’ them might not seem much of a threat, but it was going to hurt everyone when he drifted through town again.\n I spent the day in my bunk, trying to open the third eye or dream up a vision. Going forward got me nothing new, and going back taught me nothin’ that I hadn’t already suspected: Doc Cameron was never a nice man, and the war gave him ample chances to prove it over and over. He was cruel, yes, but I knew that, and there were lots more that seemed understandable given the cruelty goin’ on back then. And it’s not like any of his habits changed much between the war and now, he just had fewer folk to experiment on and more opportunity for vivisection.\n Coody came to see me, late in the afternoon. I didn’t bother getting out of my bunk as he shouldered his way through the front door. He hooked one of my stools with the toe of his boot and slung it by the bed, settling down with shotgun still resting on his right shoulder. “You been lookin’?”\n I nodded.\n “You see anythin’ yet?”\n I shook my head and Coody grimaced, adjusting his weight on the stool. I saw one of his clones waiting by the door, smooth face filled with a slack-jawed grin as it kept watch on Main Street. It was Coody’s face, but younger and dumber. The man sitting next to me was weathered and creased, carrying the weight of too many years. My Da’s friend, a good man, doing his best in tough times.\n “I was in the war with your father,” Coody said. “Saw a damn sight more than I wanted to. Tangled with the dragons a couple of times before things went completely south. Whole damn race was human once, before they took to mutation. Damn things only exist because of folks like Cameron messing about with genes. Guessin’ you’re young enough not to remember that?”\n I shook my head.\n “Tough critters to face down,” he said. “Fast. Strong. They smell you comin’ before you even know you’re goin’ to draw. Saw a camp after the bastards attacked it one night. Lots of folks dead in their bunks—never heard ‘em coming, motion detectors picked up nothing. You understand what I’m saying, Paul?”\n I shrugged. Coody paused and took a long breath. “You’ve looked back, ain’t you?”\n I nodded, watching the gleam of Coody’s mechanical eye, the way it whirred when he focused on me. I tried not to think of the doc watching me through it, listening in on the conversation.\n “And the doc, he probably deserves what’s coming, one way or another?”\n I hesitated, just for a moment, then I nodded again. Coody sagged. “Damn.”\n There was a breeze outside, cold and gentle. I could hear the soft squeak as the wind-pumps in the town square dredged water out of the basin underneath the town. Coody leaned back in his chair, heel of his thumb working along the steel ridge of his bad eye. I twisted in the bunk, trying to get away from the dull red gleam as he stared at me.\n “I ain’t carrying a gun,” I said.\n Coody nodded. “I never asked you to.”\n “My Da . . . ”\n “Your father was your father, not you,” Coody said. “You ain’t him, Paul. I know that. He’d know it too, if he were still around. Things change, right enough, and you change along with ‘em or pay the price.” Coody pushed back on the stool, scraping it along the floorboards. I watched the red light of his eye bob as he pushed himself upright, shotgun sliding down into his hands. “D’ya know when the bastard’s coming, then?”\n I shrugged into the darkness. The night-vision optics installed in the eye would let Coody see the gesture. “Tomorrow, maybe the day after. He’s got the eye, and he’s better than me, I think. Good, as good as Da were. Makes it hard to predict him.”\n Coody grunted and thumped across the hut, settling in at the doorway to take a long look down the street. “Folks are goin’ to die, Paul. Nothin’ you can do about that. But if this thing’s goin’ to win, I want to know. Something’s gotta protect this town, if the doc takes a bullet to the gut, and I ain’t bettin’ on the lizard to hang around to do the job.”\n I said nothing. There weren’t much to say to that.\n “I’m thinking of letting him through,” Coody sighed, shifting his weight. “If we’re lucky he’ll come in quiet. Try and gut the doc and get out before anyone knows he’s here. It ain’t a nice idea, since it means losing the doc and all, but it’ll keep some folk alive I reckon.”\n I thought about the dragon’s camp: the cases he buried in the dirt, the dwindling supplies, his anger burning like kindling under a blowtorch. I shook my head. “He won’t come quiet,” I said. “He ain’t planning on leaving anything behind after this is over.”\n “Even then,” Coody said. “God help me, even then, it might not be a bad idea.” He stepped outside then, saying nothing else, and I watched him go with a bad feeling in my stomach.\n I made myself scarce after Coody left, grabbed my blanket and my Da’s knife and left my shack behind. Sam Coody might not be askin’ me to carry a gun, but the doc wouldn’t hesitate if he got scared enough. People get confident when you put the sight and a gun together, like there ain’t nothing to worry about if you can see what’s gonna happen. Da’s fault, mostly, ‘cause he proved folks right around these parts, leastwise until the doc showed up. He did it here and he did it in the war, skated through everyone on sight and bravery. If Coody pulled the clones from the wall, left the dragon to the razorfreaks and ‘borgs to deal with, you could bet Doc Cameron would call in every favor he had to save his skin.\n Getting around town without being seen is easy enough if you’ve got the practice, ‘specially once you know that the cameras you gotta avoid are stuck inside o’ folk’s heads instead of grafted to the side of buildings. I made for the water-tower on top of the saloon, wormed my way deep into the shadows underneath and hid there amid the splinters and the dust. It had a good view of the main street and I had a headache building up, a heavy weight that built up in the center of my forehead.\n I slept there, fitful and quiet, away from where Doc and Coody could find me. I dreamt of Da on that last day, back when the doc first pulled into town. I dreamt of the future, of the dragon arriving, and heard a new sound among the gunfire: a sharp, wet bang, like someone ‘sploding one of the paddymelons that grow down by the river, and Coody’s headless corpse fell out of the smoke and lay smoking at my feet.\n I woke up with the dragon crouched over me, his snout close enough for me to smell the sulfur. Gun in hand, eyes scanning the street. I stifled a scream and the dragon smiled. “You are hiding, yes?”\n I coughed, soft and spluttering, before I said yes. The dragon peered across the street, watching the doc’s muscle gathered ‘round the bunker. Razorfreaks, the lot of them. Twenty men, maybe; all of them ‘borged. “A lot of claws in those arms,” I said. “Suicide to dive down and attack ‘em.”\n The dragon just shrugged. “Yes.”\n “I had a dream.” I pushed myself up on my elbows, whisper turning into a growl. “I don’t know who dies between you and the doc, but I know who it costs us while the fighting goes down. The sheriff’s going to let you in, assume you’ll go quiet and leave everyone else alone. He figures there’ll still be a town standing after you’re done; that he’ll protect the rubble from the predators and rebuild with the survivors.”\n “He is wrong,” the dragon said. “It will cost him, yes? Boom, yes?”\n “Yes.”\n He smiled at me, showing off the ridge of serrated teeth. “And so, you will stop me?”\n I shivered despite the heat. “I don’t think I can.”\n “You think,” the dragon said. He shook his head. “You think.”\n I could swear the wheezing noise it made after that was something like a laugh. “You’ve got the sight,” I said. “You know how this will end.”\n “I know,” the dragon said. “I’ve seen my death.”\n “Don’t do it,” I said. “Please.”\n The dragon shrugged and checked the safety on his pistols. He squinted at the sun a moment, as though checking the time. “Is done,” he said. “All done. There is nothing to stop it now.”\n I sniffed then, smelling him: brimstone and cordite.\n There weren’t anything quiet about the way the dragon was going down.\n The first thing to go was the southern palisade. The rumble of the explosion rolled down the main street shaking red dust off buildings and rattling the windows. I was climbing down when it happened, got rattled off the side of the saloon and fell awkward in the dusty alley behind it. Pain rolled down my right shoulder as the screaming started out on the main street, people running for cover as the razorfreaks charged. I could hear the fight starting through the haze of smoke and dust: staccato bursts of gunfire; the cries of the dying, the dragon returning fire from his vantage on the rooftop. The doc’s boys were fast and strong, but they weren’t trained as much more ‘n muscle. It’d take ‘em a couple-a minutes to realize the shooter was somewhere up and outside the billowing cloud of smoke.\n I scrambled to my feet and went for the wall, stumbling as the second bomb went off somewhere down the street. Dragons were quiet, Coody said, and hard as hell to detect; there’d be bombs all across town to create the distraction he was looking for, enough to flood the streets in smoke and fire, to ruin the infrared eyes the doc gave his razorfreaks to let ‘em see in the dark. Coody and his clones gave minimal assistance, filling the street with spotlights while they took cover from the gunfire. They didn’t move to help the razorfreaks, just dug-in and waited, a dozen of them with rifles not even looking for a shot. Coody stood behind the steel barrels of water we carted in from the reservoir, shotgun on his shoulder as he scanned the streets. The steel plate over his right eye shone in the light; he didn’t notice me coming, not ‘til I slid into place beside him. I yelled the word bomb, trying to get louder than the din. Coody nodded, looking irritated, and pointed at the carnage.\n “Bomb,” I said, screaming it, and pointed at his eye-plate. This time it sunk in, and he turned a little pale. I closed my eyes as another dynamite charge went off, caught a glimpse of the future. Clearer now, full of shapes, the sounds getting louder and louder as prescience became past. Coody ordered his clones into the street, ordered another two onto the walls to start searching the rooftops for the dragon and take him down with a rifle-shot.\n I peered forward, snatching another glimpse. The gunfire and screaming in the smoke-haze started to die down. It was random now, scattered, the dragon picking the last of the razorfreaks off. My gut said we were out of bombs and out of mobs, so the killing would get real personal from here on in. I heard Coody calling orders, telling his clones to sweep the street, get survivors under cover and start putting out the fires.\n I knew when I was going to die, if I didn’t do anything stupid with my life. First trick Da taught me, when he figured out I had the sight. You look forward and you see your death, and you know that’s how it’ll end if you don’t mess up destiny too bad in the meantime. The dragon knew it too, and so did my Da. It ain’t writ in stone, but it’s good enough. It takes some real stupidity to mess those visions up.\n Da was supposed to die an old man, but he pushed things too hard. I was supposed to die an older man, and I hadn’t pushed a damn thing, not since the doc came to town. I closed my eyes and looked, forcing my way through the smoke. Somewhere in the future the dragon was going to die and the doc would punish Coody for it. Or the doc was going to die and take Sam Coody with him. There weren’t many ways it come out good for the sheriff, and there were a damn sight fewer where it came out good for the town.\n I got out my Da’s knife and stepped forward, walking into the smoke.\n I found the doors to the doc’s bunker open wide, the locks burned through with dragon-spit and smeared with oil and blood. I stood there a moment, breathing against a handkerchief to avoid choking on the dust. Coody stepped up beside me, shotgun in hand. “He in there?” he asked, and I nodded and tapped my nose. “Sulfur,” I said, and went in, holding my knife out before me like it’d do a damn thing against anything we’d find running loose in the dark of the bunker. Coody followed on behind me, his mechanical eye clicking as it adapted to the darkness.\n “You seen anything?” he asked me, “like, maybe, who’s going to win?”\n I shook my head, stepped over the body of a dying ‘borg. “Get outta here, Sheriff. You don’t want to be close to the doc today.”\n We heard a gunshot, deeper in, the sound of someone scrambling and running. Coody moved a little ahead of me, raised the shotgun. “It ain’t exactly a choice, Paul. Dyin’ comes with the badge.”\n He started moving in, gun at the ready, letting me follow behind. I tried to peek at the future, but there was nothing to see. Not anymore. Too many muddled pieces on the board, too many people trying to bluff and get a better result out of the hand fate dealt them. Occasionally we’d pass a body, see drips of blood on the concrete or smears of it on the wall. It’s a twisty path, heading down to the doc’s lab, and plenty of corridors leading off to the side. We found him hiding in one about halfway down, crouched in the darkness with a bone-saw in his fist. He was bleeding, the doc, but he moved okay when he saw us. “A grazing shot,” he said, “lucky, at best.”\n “The dragon,” Coody said. He pumped his shotgun for emphasis, chambering a live shell.\n “Deeper in,” Doc Cameron said, “there’s a few boys towards the lab, trying to contain it.” He paused a moment, stared at Coody. “They’re doing your job, sheriff, unless I miss my guess. Perhaps you should go join them.” There was steel in his voice as he said it, and his good hand at his belt hovering over the little box patched into his computer.\n “The dragon’s your mess,” Coody said. “What if I say no?”\n The doc’s gaze slid over to me, then back up to Coody. “I gather you’ve been informed of that,” he said. The laugh that followed was high-pitched, a trill of amusement.\n Down the corridors, in the doc’s lab, we heard someone screaming. “Probably best if you hurry,” Doc said. He laughed again, winced, put his hook against the wall to steady himself. Blood loss, I figured. The scratch in his side weren’t as minor as he made out. Prescience said the doc was already dead, just running out the final moments before the injury put him down. The only question now was whether the dragon and Coody went with him.\n He wheezed for breath, leaning forward, and the hand over his computer box strayed a little too far. His eyes were stuck on Coody, waiting for the decision. I thought about Da for a moment, about dying old and safe, then I trusted my gut and Da’s knife and went at the doc with a bloody yell and the knife twisting straight for stomach.\n It cost me a hook across the face, stabbing the doc in the gut. He slashed me hard, but it didn’t kill me; didn’t even hurt when he followed up, jamming the hook in my stomach and ripping a shallow trench through the skin and the gizzards. The pain was bad, even looking back with hindsight, but I figure it was worth it. I got the knife in the doc two or three times in return, kept him busy while Coody lined up the shot and let the shotgun go boom ‘til he ran out of ammo. I weren’t conscious to see it happen, but the doc went down. Went down hard, a bloody mess, and Coody standing over him with the gun just-in-case, calling down the clones to stitch me up and get me walking.\n I spent a week or two in bed, healing up from my injuries, and would have myself some nice scars to show off by the time I was healed. The dragon was gone by the time I came to, walked out of town by Coody with supplies and a warning. There weren’t much left for him in town, with the doc laid out for burial, and there were plenty of folks out for his blood after the business with the explosions. He went quiet, which surprised me, and he was missing an eye to go with his broken horn.\n We were due some hardness, everyone knew that, and there were a couple-a folks held grudges against Coody for doing in the doc. But we held off against the scavenger beasts and the retaliatory raids by the last of doc’s ‘borgs, found ways to make do when his tech ran down and people started limping ‘round town on malfunctioning limbs. I started wearing my Da’s gun, when Coody asked me for help. He was running short of clones, now. There were men in doc’s labs trying to fix the machines, but they weren’t none as smart as him and it would take a while to get things running, if they ever did.\n Things are good, though, since the dragon came. Tougher, yes, but not so bad as they were. My Da used to tell me that people cope, that the war proved that more than anything. But they’ll do more than cope, if you ask them too, if you show them there’s another option. That they’ll do the right thing, eventually, ‘cause doing otherwise there ain’t much to life. I’m not saying he were right, mind, but he saw a lot of what might happen. He was a smart man, Da, and he were better at lookin’ forward than me.\n But that was him, and he did his part. Now there’s me and Coody and a bunch of broken parts, a town that needs savin’ and a future stretchin’ forward. And maybe I get to make it to the end I’m meant to have, and maybe I get sidetracked a little along the way. It doesn’t seem so bad, not knowing, not like it used too.\n And Da always used to tell me there were worse things than dying young.\n Originally published in Eclipse Four, edited by Jonathan Strahan, 2011."}