{"fingerprint": "XV7AiOnOgwS0TCj2grjZKASZKxo=", "sitename": "Clarkesworld Magazine", "title": "Dandelion by Elly Bangs", "author": "Elly Bangs", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bangs_09_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dandelion by Elly Bangs", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5930 words, short story\nDandelion\nIt was a century ago today that you found the spark of life in this freeze-dried valley of death. The ghost of you in that moment is here with me now, Geiger counter in hand, sifting in holy awe through the wind-polished stones—to which your daughter would make her own heartbroken pilgrimage thirty years later—to which I’ve finally come in my turn. When I breathe in, I feel how this same frigid wind scalded your lungs as you climbed, shielding your eyes against the midnight sun. On the other side of the world, your family huddled in the glow of a cathode ray tube and wondered if that sun would ever rise on them again.\nMy mother would have been five years old then, in October 1961. That became her earliest memory: her father cursing you for being off in some God-forsaken Antarctic valley on the eve of doomsday; she only wishing you’d taken her with you, out of range of Cuban missiles—but in the fullness of time you redeemed yourself, because that was the day you brought back what would become an heirloom, passed across the whole breadth of the sky by way of three generations of this family, shaping all of our lives along the way.\nThe Agency called it “Sputnik-X,” but you knew better—already intuiting, years before you dared to speak it, the truth of what you found half-buried in this desiccated scree. You called it Dandelion.\nTo you it was the key to a universe of ambition. To my mother it was a warning and a reality check. To me it’s the point at which the forces of hope and despair meet and become something greater, and that’s why yours is the memory I’ve come here to commune with: because you died, grandmother, believing that your life’s work had been for nothing.\nSince then it’s changed everything.\nThe object weighs approximately six tons. It is radioactive. Its metal is mottled with corrosion, filed down by gritty wind and slow tides of heating and cooling through year-long polar days, but it remains at first glance a machine made to fall from space: One end is capped with a blasted heat shield, the other with fasteners for a long-lost parachute; between them two cylinders sit stacked in a nest of tubes and fins. One contains a pile of black fissile slag. The other is empty.\nI’ve only seen Dandelion once in person. After your daughter gave them Plateau Theory, the Agency bitterly entombed it in a New Mexico salt mine with no intention of ever raising it again—but despite the Agency’s basic hatred of me after what I did, my connections at NASA were enough to grant me one visit.\nI’d spent years imagining that moment. I thought when I touched that metal I’d be able to feel the vastness of space it crossed to reach us, the centuries of vacuum and cosmic rays, but for a moment I could feel much more: It was as if I could sense its makers touching back from the other side, their hands (by any other name) to mine, and I knew they were as much a part of my heritage as you are.\nIt took me years after your death to feel as if I knew you. Not just the version of you I spent Sundays with—who lashed out at her caretakers, disowned her daughter, and died hating the world for its inertia—but your original form. I read all of your journals and talked to anyone left to testify. Some called you cold and aloof, not getting that you built your life around a fierce and unwavering love. That it wasn’t for the people around you doesn’t lessen its reality. You cared about them, but it was the possible you were in love with—and if ever that abstract concept loved any person back, you were her.\nYou married because you hadn’t yet found a language with which to question the necessity; because when you told him you needed to put your career first, he was naïve enough about himself to promise he would respect that. By the time my mother was born he was living in the perceived shadow of men whose wives fed and cleaned up after them, and you’d begun to suspect there was something other women got out of having families, a sense of belonging that you’d never felt and probably never would.\nYour house was just a house. It was in the concrete-slab laboratories of the Advanced Projects Research Agency that you found your home. Mathematics was your love language and the arc of orbital space was the set of arms you embraced with every satellite you helped launch from Vandenburg.\nYou were one of the Agency’s brightest minds—and the higher you rose, the harder it worked to throw you out.\nYou wouldn’t have been their first choice for the job if they’d had any idea what the job was. You recognized the taunt when you saw it: Somewhere along the line you’d intimidated your male colleagues, so they were sending you to the bottom of the world to chase a vague report of radioactive space debris. One of those upstairs men with a haircut sharp as a helipad was putting his wingtips up and reasoning that a wife and a mother would never agree to weeks of hard travel away from family—that her family wouldn’t let her. He didn’t expect you to call his bluff, and in doing so break the game.\n“You said it was just sitting out there,” their voices rang through the cargo bay. “Left sitting out for a month before you got there. Not even a tarp over it.”\n“Two months,” you corrected, drowsily, as twenty men in suits (some in hazmat, others in single-breasted black linen) rushed into the C-130 that had delivered you and Dandelion to them over forty hours of flight. “But it was so remote that—”\n“This is a disaster.”\n“Why the hell didn’t anyone get to it sooner?”\nYou could’ve explained the challenges of airlifting a six-ton object out of the Dry Valleys during Antarctic Winter, but you knew they were really asking for someone to blame. For you being the one to find it.\n“The question is how did the Soviets get this thing into space without us knowing.”\n“How did they get it into space at all? What rocket can throw a six-ton payload?”\n“But what if it’s not—?” you started, but the flattop men were already forgetting you were there.\n“No,” one interrupted. “The real question is what the hell is it.”\n“Spy satellite.”\n“Anti-satellite weapon.”\n“Gentlemen. Given its mass, its radioactivity, and where it was found, there can be no doubt that we are looking at a nearly successful prototype of a Fractional Orbital Bombardment System.”\nA funereal silence fell as your colleagues concluded that their Russian counterparts were twenty years ahead of them in missile technology. The irony would haunt you for the rest of your life: that Dandelion had chosen one of the unluckiest moments in history to be discovered, right when it risked setting in motion the death of the planet it would have brought to life.\nYou wanted to grab those men by the lapels and shake them. Wait, you shouted, inwardly. Just wait.\nFrom 1961 to 1964, the top-secret project to analyze and reverse-engineer “Sputnik X” waded through a quicksand of bad assumptions. By the design standards of the time it was a monstrosity, sheathed in two-inch-thick plates of beryllium alloy, bolted to a heat shield twice as thick as Earth’s atmosphere required. There were clues that Dandelion had come from much farther away than Kazakhstan, but no one dared to follow a line of inquiry that veered so sharply away from the Project’s rigidly-defined goals. The radioactive slag in the upper cylinder was assumed to be the remains of an experimental bomb core that had fizzled or self-destructed upon loss of contact with its Russian operators. It was the enigma of the empty lower cylinder that haunted everyone’s nightmares.\nYou weren’t alone in wondering if that black slag might be the remains not of a weapon but a power source: a long-expired radioisotope thermoelectric generator. You weren’t the only one to count the elements and trace their half-lives, following the decay chains backward through time to reconstruct their pure original form. A dozen of your colleagues did the same math, rubbed their eyes, and moved on to avenues of research less likely to get them fired.\nYou weren’t the only one to see the data. You were just the only one willing to believe Dandelion when it told you it was 1.7 million years old.\nIt wasn’t easy to convince the McMurdo Station people, and moreover my wife, to drop a 71-year-old woman off in Victoria Valley and leave her alone for a while, but it had to be done. I knew I could only make this pilgrimage by myself.\nOn the flight in, we passed a glacier that looks like it’s spewing blood. It’s more spectacular today than when you saw it, now that all the glaciers are rapidly melting. The red stuff percolates up through a thousand feet of ice, from a lake of iron-rich brine. A whole ecosystem of extremophile bacteria lives down there in the pitch-black, sealed airtight for a very long time.\nAround 1.7 million years, in fact.\nIt’s probably a coincidence: We can’t prove these are the same germs that rode Dandelion across space. Still, they’re perfect for the job—simple, hardy, cold-loving—and in long hours spent watching them grow in vats, I’ve whispered under my breath the same two-word prayer you taught me as a child:\nWhat if?\nIt’s the question I hear the whole world asking these days. The poles are still melting. The oceans are still gaining plastic and losing oxygen. We’re all wading through the rising tide of our worst fears—but I believe they temper a hope that’s more than worthy even of your Golden Age optimism. The nations of Earth are putting away their weapons and joining the work in orbit, and what we’re building up there is a symbol of all we hope to fix below. Through Dandelion we’re becoming supplicants of the possible. We’ve found a purpose to work toward—and by God, we’re finally working together.\nOne day you were the Agency’s black sheep, the next you were its champion. Every new data point bolstered your theory of Dandelion’s ancient extraterrestrial origin. Under your leadership the miasma of paranoid despair that had dogged the Project since its inception gave way to a renaissance of hope and imagination, its subject transformed from an inscrutable Soviet superweapon into the tantalizing promise of a million-year technological leap.\nBy 1965 you hadn’t just figured out Dandelion’s age: you’d intuited its purpose. Outside your concrete slab walls, Sagan and Shklovskii were speaking publicly to a theory you’d been incubating for years: that the first life on Earth had been delivered here deliberately.\nYou’d found the delivery system. You knew the answers to questions human beings had lived and died to ask since the dawn of recorded time: You knew where we’d come from. You knew we weren’t alone. Above all you, were sure you knew what we’d become.\nWe will live on the moon, you wrote, your handwriting skewed by exuberance. We will live on Mars and the moons of Jupiter, and on distant planets orbiting distant stars in distant galaxies. We’ll build cities in space and a glittering network of wormhole highways, stretching from one end of the sky to the other, lined with ring worlds and Dyson spheres and wonders we cannot yet fathom. We have our proof that all this and infinitely more is possible. I’ve held it in my own hands.\n“So the second cylinder, the empty one, carried . . . primordial ooze?” a younger scientist once asked you.\n“Single-celled organisms,” you said, pacing and gesticulating wildly. “Ones suited to extreme environments. Capable of spreading and evolving over eons into an entire planetary biosphere.”\n“But life on Earth is much older than Dandelion,” she said.\n“Dandelion itself isn’t the origin of life here, but it’s evidence of that origin, proof that directed panspermia is happening. Another seed from the same tree, billions of years later. Just think of it! Countless probes must have reached Earth from one end of geologic history to the other. All the rest are weathered to dust, subducted, lost to the ocean floor—”\n“But Dandelion just happened to land in the coldest, driest place on Earth,” she said, and your heart melted at the epiphany in her voice, her face, her whole body as she put it together.\n“If you were trying to seed planets with life you’d want thousands of probes, wouldn’t you?” she said. “You’d plant as many seeds as possible, knowing some won’t germinate.”\nYou started to tell her your theories about the whole seed-head of which Dandelion had been a part, the methods of hyperlight propulsion that might have carried it between galaxies, but your voice caught. Your pulse quickened. The beach stretched away in either direction, smoke plumes looming peacefully from the oil rigs just off shore. There were no spooks in sight, but you couldn’t be sure.\n“You can’t tell anyone about this,” you whispered. “Remember that. Not anyone.”\n“I know, mom!” my mother protested.\nI believe the love you had for her in those years was the purest you ever shared with another person. To be united in the elemental joy of discovery was the only kind of kinship you’d ever really wanted. You could open up to her in ways that you couldn’t to the detail-obsessed, goal-oriented scientists under your direction. What Margaret initially lacked in formal education she made up for with unbridled awe, and the threat of being fired if not imprisoned for leaking highly classified information to your own daughter only strengthened the bond.\nYou had a seemingly magical way of encouraging her in her studies without making her feel bad when she struggled. You believed her success was inevitable, and convinced her of the same. She was driven to see Dandelion for herself, and you told her exactly how she’d need to steer the course of her young life to make it happen—until finally the day came in 1988 when you welcomed her through the gates. It might have been the proudest moment of your life.\nThirty years on, she would tell me it was the one she most wished she could take back.\nRadioactive decay elevated you to leadership of the Project, but the Project had its own decay process. For three decades your team had searched every micron of Dandelion’s shell for nanoscale circuitry, magnetic signatures, golden-record-style grooves that might encode data: Something you could make into free energy or antigravity or faster-than-light propulsion. By 1988 you’d compiled tens of thousands of pages of theory and speculation, but you had nothing tangible to show for it. Some of your staff quit; others stayed on and let the years of stagnation sand their minds smooth.\nYou were sure Margaret was the new blood the Project needed. You loomed over her, waiting to witness a spark of epiphany. When she asked to make her own expedition to the crash site to search for more debris, you rushed to authorize it, never guessing the depth of her restlessness.\nShe was here on the same dry ground I’m hiking now. When every lidar and spectroscopic and visual survey came back empty, she sifted through these rocks by hand. Her apparition is just as present in this place as yours, staggering along under the weight of all her prayers that she would find something here to prove herself wrong.\nAnything but to explain to you why there were no more breakthroughs left to have.\nIn February 1990, Voyager 1 took one last look back on its way to interstellar space, transmitting a mosaic of the Solar System in which the Earth appears as a lonely pale blue dot. Over the next thirty years the probe’s RTGs (not unlike Dandelion’s) would decay until they could no longer generate enough power to communicate with Earth—and while it was beaming back its final pixels, Margaret was making her last attempt to communicate with you, and feeling just as distant and as cold.\n“You’ve been trapped in your precepts,” she told you. “You taught me that a good scientist has to see past her assumptions when they don’t align with the facts, no matter what. She has to—”\n“What assumptions?” you protested. “The idea of progress? The idea of a better future? The idea of a future at all?”\n“You’re being hyperbolic.”\n“Am I?” You paced the floor, scraping your shoes against the Cold War tiled floor.\n“You’re director,” she said, evenly. “You have the authority to block me from submitting this report. Are you going to do that?”\nTo her it was a practical question, but you heard it as a dare: to prove you were any better than your own flattopped predecessors. Suppressing her report would be tantamount to surrender: She had to take it back of her own free will.\nYou settled on: “Not until I know you understand what’s at stake.”\nShe took a deep breath and said “I’m not saying we’ve seen the end of all technological advance. Every technology will have its own plateau. Some lie farther ahead than others. I’m talking about space travel specifically.”\n“But without that—” You trailed off, afraid to finish saying: What’s the point of anything? What’s the point of humanity?\nShe continued: “You’ve only ever studied Dandelion from the assumption that technological progress accelerates forever. Like Moore’s Law. And it makes sense that would feel plausible—”\nYou snorted derisively at the word feel.\n“—earlier in this century. Cars, airplanes, rockets, nuclear power, digital computers—they all emerged within a single lifetime. Manned interstellar flight and galactic empire-building seem like logical next steps, but everything we know about Dandelion contradicts that.”\n“What contradicts that?” you said. Still pacing. “What exactly do you think contradicts it?”\n“You’ve read my report. Come on, mom.”\n“Ma’am,” you corrected—and you looked at each other, both knowing you’d passed the point of no return and were headed out into the real dark.\nNow you were the one daring her. She stiffened up and said “We know all of Dandelion’s metals had been recycled, probably dozens of times, over hundreds if not thousands of years. That strongly suggests a stagnant tech level.”\n“So what. So what!”\n“And it didn’t teleport its way to Antarctica, or use flying saucer antigravity. It fell with a parachute and a heat shield. And the isotope patterns in the casing tell us it was sent here using nuclear pulse propulsion, like the old Project Orion concept from the forties: Space travel by dropping nuclear bombs out the back hatch and setting them off. That means no warp drive. No wormholes. It’s a 1.7-million-year-old machine and it’s barely more advanced than the damned Space Shuttle. That leaves only two possibilities: either its creators bent over backwards to use desperately obsolete technology—”\n“It’s envy, isn’t it?” you said. “You can’t stand knowing you’ll never accomplish close to what I have, and this is how—”\nShe spoke over you: “—or else Dandelion is as far as space flight technology can advance! If the speed of light is an unbreakable law—”\nYour voice died in your throat, because there it was in her face now, behind the anger: the burst of epiphany you’d been waiting for all along. The ecstasy of a flawed paradigm giving way.\n“—if there’s no shortcut, then manned interstellar travel is a practical impossibility, no matter the technology. There are no viable energy sources between star systems and thus no way to sustain life at sub-light speeds, beyond keeping some germs warm with an RTG. And if that’s true—”\nExcept it was corrupted: a perverse anti-epiphany that didn’t kindle possibility but snuffed it out.\n“—then there are no interstellar empires in the universe. No colonies. No Kardashev Scale. No ET will ever visit Earth. They all reach the same technological plateau and level off, indefinitely. They’re all just . . . ”\nStranded, you thought. Each confined to their own pitiful islands, never to set foot on another. The future that spread out before you was a fever-dream eternity of human beings—even as they continued to physically evolve over eons—driving the same cars to work and back again, wiling away evenings and weekends watching television and drinking beer until the last crushed can overflowed the trash; walking it out to the curb and glancing up at the glittering stars, and wondering only in passing what secrets they held, but never finding out, until the sun burned down and died alone in the cosmic night.\nNo snowflake or raindrop has touched Victoria Valley in a thousand millennia. There’s no flora or fauna in sight, not even lichen on the rocks: just an endless blank canvas of bone-dry sand and alien-shaped boulders. It’s so cold and dry that even microbes struggle here; now and then a seal wanders in from the coast and its mummified corpse joins an open-air crypt spanning thousands of years.\nIt’s hard not to see this desert as a metaphor for the land between star systems. There’s nothing to eat or drink or burn for warmth. The sun sets and doesn’t rise again for six months, and even in the daylight the only thing keeping my fingers from freezing off are the chemical hand warmers I packed in—like the RTG that kept Dandelion’s canister of primordial ooze alive for however many centuries it took to reach us.\nAt a mere ten percent the speed of light, that’s all you can do: Try to keep warm. Pray you reach the next glimmer of light before your last cell turns to stone.\nStill, there’s a beauty in this place I can’t describe: not despite its lifelessness, but because of it. There’s nowhere on Earth quite as dead as here—yet it’s no harder to see this place as the end of the world, as a world yet to begin.\nThe summer before you died, I took you down to the same beach where you and Margaret had once walked. We got ice cream from a stall on the waterfront, and when I looked back you were leaning out of your wheelchair. I had to run for the handles before you tipped over.\n“What is it? You okay?”\nYou groaned and kept groping for the weed growing up between the sidewalk tiles, so I knelt and picked it for you. You turned the seed head carefully before your eyes, lost in thought.\n“Making a wish?” I asked.\nYou crushed the dandelion, mashing it between your palms until it was only a pea-sized lump of pale fuzz.\n“Without the stars we are doomed,” you said, and your words haunted me—because even though I couldn’t yet make any sense of them, I knew then that you and my mother weren’t opposites but two sides of a coin.\nEven when your mind was still sharp, you told yourself that Plateau Theory was merely her plot to betray you—but there were things you never knew. For all the scientific delight you once shared, she never trusted you enough to tell you about her breakdown. She never told you she’d watched the world end.\nA decade before she joined the Project, the Agency had had her teaching computers to recognize the gamma ray signatures of nuclear blasts. A handful of times the job took her into the subterranean compartments of NORAD facilities—and on the last of those times, in the middle of a line of code, the sound of alarms turned her head to the sight of vault doors pivoting shut. She stumbled into the control room and her unspoken questions were answered by panicked shouts and missile trajectory maps whose eye-searing light reflected in spilled coffee, sweat-greased faces, hands that clenched telephones or prayed over radar images.\nThe screens said the first bombs would fall in 18 minutes. They said every American city would be ash within an hour.\nThere were many things that flashed before my mother’s eyes, besides her life, as she sank back against the wall. She saw in every arc of neon the wicked transfiguration of a rocket meant to carry us to the stars. She saw in those lines of burning light an unholy vision of all humanity’s genius bent back on itself, its space age dreams raining down to sterilize the whole world in nuclear fire.\nThen somebody was helping her up, telling her it had all been a false alarm. A simulation tape loaded into a live computer. These things happen, they said. As if that helped.\nWeeks passed before she could sleep again—and when she finally did, and when she woke, it was not into the world she’d known before. Suddenly the real was no longer merely a stepping stone to the possible.\nThe real was all there was.\nI was born a little over nine months after Margaret submitted her report. By then the Project had been canceled. She’d moved to Livermore to spend her days with the bombs that filled her nightmares, and you and anyone else who’d stuck it out since the sixties had retired. You watched helplessly when they laid Dandelion in a lead casket and sent it down the salt mine shaft—no longer to safeguard its technology, so much as to spare the American public from wrestling with its philosophical implications.\nYou and my mother kept up an uneasy peace for most of my childhood. You developed elaborate ways of dismissing Plateau Theory (confining them to the safety of your journal). You found reasons to blame the Agency instead of her. I like to think I brought you some solace too.\nYou were as old as I am now, and I was five, the day you set me on my own path. I was poking at my plastic solar system placemat, tracing the concentric rings of orbits until I reached the outermost. That one was conspicuously wide and tilted away from the others.\n“That’s the planet Pluto,” you said.\nAll the other planets hung over my bed on wires and string, but this one wasn’t in the set. I’d never seen a photograph. I asked “What’s it like?”\n“Nobody knows! It’s too far away to see. Even with the most powerful telescope there is.”\n“Cold,” my mother said from another room. “Airless. Just craters and darkness.”\nYou leaned in close, so she couldn’t hear. You smiled knowingly and said “Maybe. Probably. But . . . what if?”\nTwenty years later, we saw it through New Horizon’s eyes: A world of plains and mountains and glaciers, circled by five moons, wrapped in an atmosphere that sublimates and condenses over centuries. It was a system unto itself, stranger and more beautiful than I could have imagined. By then I was well on my way.\nThe peace you’d made with Margaret was the first thing dementia took. It started with a few uncharacteristically vicious remarks. Out of nowhere you would stare at her with a look colder than the wind I’m tasting now. You picked fights over nothing. The more you forgot, the hotter your increasingly distorted memory of the Project’s cancellation seemed to burn—and the rest of us were left to remember Thanksgiving 2004, when you hurled a saucer and shouted “Faster than light!” as it exploded against the dining room wall.\nWe couldn’t reason with the personality changes. We never found a medication that helped. Whatever progress we made by talking about it was quickly erased. All we knew was that whatever rage had taken hold in you only seemed to apply to my mother, so from then on I was the one who went in alone to visit you and see to the practical concerns of your last years on Earth. I tried to be the proxy for the love she continued to hold for you. Sometimes I felt like a robotic probe sent somewhere too distant and hazardous for its maker.\nFor years we did this. I’d bring you out to the waterfront and enunciate the headlines until you heard them right, and you’d tell me my hair was too short for a girl, or the wrong color. I knew nothing of Dandelion.\nOne day I told you I was leaving for college. You asked what I was going to study, and I told you my plan to build probes for NASA. I’d said it a dozen times before, but that was the time you heard me. It seemed to freeze you solid.\nYou held my wrist and wept.\nYou couldn’t tell me why. You couldn’t remember all you needed to say. It took all your strength just to hold the thought, but you insisted there was something under your mattress that you needed to give me, and you didn’t relent until all your old journals were in my hands. Then I put the sheets back on and helped you lie down, for what turned out to be the last time.\nIt was through your journals that I learned my mother had been a different person before I met her, though I didn’t think I’d ever know that person. Every time I came home to visit, she’d only withdrawn further into herself. Her grief changed in shape and texture over the years, but it haunted every room of the house like the tingle of radiation.\nThe cancer diagnosis came in 2019, a few months before she was set to retire. It turned out to be operable—she would go into remission and live well for another twenty-two years—but it wrecked us both for a while. I took a leave from work to help her recover from the surgery, and we ended up sitting on that same haunted beach, watching the sun sink between the now-abandoned oil rigs. We barely shared a word until well into twilight.\n“When I started, when I had you,” she said, “my job was decommissioning warheads. I figured that was a good way to make myself useful.”\nSince we’ll only ever have this one planet, she left unsaid. She closed her eyes and sighed sharply. I put my hand on her knee and she held it.\n“The fuckers put me to work building new ones,” she continued. “They’re growing the stockpile for the first time since the Berlin Wall fell, and I went along with it. I had my pension to think about. But if one of those bombs ever gets used on people, I . . . . ”\nShe choked on her words. The black waves lapped half-heartedly at the shore.\n“Everything is falling apart,” she said. “The world goes more to hell each day and it’s hard to imagine anything stopping it. Nobody knows how to imagine that anymore.”\n“Ever heard of Nuclear Pulse propulsion?” I asked. “Accelerate a spacecraft by throwing nukes out the back door and setting them off, basically. It sounds absurd, but it works. In theory, I mean. We could use it to build an interstellar probe using present-day technology. Coincidentally, it’s a good way to get rid of a lot of nukes.”\nShe stared out to sea and nodded. “Too bad it would be extremely expensive. No political will for something like that.”\n“Not yet,” I conceded. “But suppose something came along to change the dialogue. Maybe if some secrets were leaked. Something that could change everyone’s perspective on humankind’s place in the universe.”\nShe didn’t seem surprised that I knew about Dandelion. She didn’t visibly respond at all. Finally she snorted and said “It’s too dangerous to even talk about.”\nI sighed and stared out into the last light.\nShe added: “It’s much too dangerous . . . to keep digital copies of all the Project’s files and records on backup drives hidden throughout the house. And yet.”\nI started to laugh, but her grip on my hand tightened, a warning.\n“Are we really going to do this?” she whispered.\nI couldn’t answer lightly. Beyond the threat that it would end my career and land both of us in prison, there was no way to know all the consequences of exposing Dandelion to the world. I knew people would wrestle with it in ways I couldn’t hope to foresee, some of which I might regret. But I felt a very particular kind of optimism when I answered.\nFor years I had fallen into the trap of thinking of the relationship between your theories and hers as a battle between hope and despair. I wanted to believe that she was wrong and you were right: that the speed of light is a law meant to be broken, and the stars would be within our grasp any day. I clung to that desire even as microprocessors stopped getting smaller; even when our one attempt to inhabit Mars was vanquished by chronic illness and billowing dust; even as fusion power stubbornly refused to become viable.\nMaybe the Plateau is real. Maybe we’re already approaching the end of technological history. I gave years of my life to denial and bargaining and anger, and I’ve searched for counter-evidence in every way I know how. If it’s there to find, I doubt I’ll live to see it.\nBut along the way I found something else—something I would give anything to share with you, grandmother. Because I like to think that if only you’d been able to push through all your fear and disappointment and betrayal, you might have gotten around to realizing that if all the technology to build Dandelion already existed, it meant we could build our own.\nThe radio on my belt crackles and I know my time here is almost up. Soon I’ll hear the helicopter blades coming to lift me out of this place: back to McMurdo Station, back into my wife’s arms, and on to the first of several planes that will return us to California.\nAs we move North we’ll exit the Antarctic Summer. The endless day will turn back to night—but the darkness that falls will reveal a light, brighter now than any star, in the final stages of its decades-long assembly.\nYou had only one child, and she had only me, and I won’t be having any of my own. One of these days our part of this story will be finished—but if it ever gets me down, all I have to do is look up to see the next chapter being written. Its words are the DNA in 400 canisters of primordial ooze, each one swaddled in the warmth of isotopic decay: a 5,000-ton spiky ball of potential biospheres, soon to ride half the Earth’s decommissioned nuclear arsenal across hundreds of lightyears of interstellar space, bound for proto-planetary disks.\nSometimes I like to imagine that the people (by any other name) who built Dandelion were copying a design given to them by their own forerunners, and so on, back to the beginning, whenever and wherever that was. I imagine that someone or something will one day feel the ghost of my palm from the other side of a sheet of American-made beryllium alloy.\nI’ll be a billion years dead by then. But before that, some Spring evening, I’ll be watching the light of my life’s work, and yours, and hers, fading into the black—and I’ll be sitting on the beach where the sidewalk used to be with a fuzzy seed head in my hand, breathing deep to cast my wish.\nElly Bangs was raised in a new-age cult, had six wisdom teeth, and once rode her bicycle alone from Seattle to the Panama Canal. Her short fiction has appeared in Clarkesworld Magazine, Beneath Ceaseless Skies, Escape Pod, Fireside Quarterly, and elsewhere--and her debut post-apocalyptic novel, Unity, is coming in April 2021 from Tachyon Publications. She's a 2017 graduate of Clarion West."}