{"fingerprint": "4lM9+5vL22oegue2C5HV4hHOfbc=", "sitename": "Clarkesworld Magazine", "title": "Everybody Loves Charles by Baoshu, translated by Ken Liu", "author": "Baoshu; Ken Liu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bao_01_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Everybody Loves Charles by Baoshu, translated by Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "20630 words, novella\nEverybody Loves Charles\n1.\nHe shot into space, free as a fish that had leapt away from the sea’s embrace.\nGazing down through Pegasus’s porthole, he saw the receding grey metropolis, then the amber suburbs, and finally the green fields and yellow deserts, all quickly submerged beneath a sea of clouds. By the time he emerged from the clouds, the world had become an azure convex surface, a hint of the enormous sphere it belonged to. Behind, North America was but a smear against the horizon, and Asia was still hidden below the curvature of the Earth in front. The whole globe was wrapped in a hazy glow: the atmosphere. Above him, pinpricks of starlight peeked out of the onyx firmament.\nAs gravity’s pull diminished, he felt the effects of weightlessness. Though his body was firmly strapped into the pilot’s seat, he still experienced the sensation of floating. The spacecraft seemed to be cruising upside down, the infinite waters of the Pacific Ocean hanging over his head and the bottomless abyss of space suspended below. It was as though he weren’t in space, but sleeping under the sea, everything at peace and very far away. For a few seconds, Charles Mann felt he was the man farthest from the hubbub of society, a permanent free-floating consciousness destined to merge with Nature’s pure essence.\nBut soon he remembered—no, it would be more accurate to say that he always knew—that this was an impossible fantasy. Even though he was freed from the gravity of this planet, the whole world was watching him. At least a hundred million people were tuned into his livecast.\nPegasus was in the most prestigious aerospace competition of them all: the Trans-Pacific Championship Race. Freed from the atmosphere, his ship was hurtling at Mach 9.7 toward the western edge of the Pacific. Destination: Tokyo.\nLike ballistic missiles, racing ships entered space for part of their flight so as to minimize air drag, conserve fuel, and coast on inertia, only re-igniting their engines upon reentry. For a few minutes, Charles languidly admired the blue planet slowly spinning outside the porthole, listened to some jazz, and broadcast a mental microblog entry:\nI have never been so far from Earth. At this moment, The World and I are antipodes: I am Self, no longer a member of life’s multitudes on Earth, but a lone wanderer in the universe . . .\nThe cockpit display of Pegasus revealed his position: above the Aleutians. A flock of blue dots drifted westward over the isles, and a bright red dot flashed near the leading edge—his ship. Behind him were more than a hundred spacecraft, and only three in front. This was a decent spot, but not enough to place in the race.\nThe frontrunner was more than sixty miles away, and even the third-place ship led him by more than six miles. As though to remind him of his poor showing, a silver saucer-shaped spacecraft caught up, sweeping past like a meteor less than three hundred meters to this left. That was Andromeda, piloted by George Steele.\n“What’s wrong, Charles? Did you party too hard last night with some groupie?” Steele’s voice burst from the radio.\n“George, I’m just taking a break to enjoy the scenery before I start the race.”\n“I’m afraid the race is already over for you, buddy.”\n“You’d like to think so, wouldn’t you?” Charles pushed a button.\nAbruptly, Pegasus cast off its entire tail section like a butterfly emerging from a chrysalis. A bright blue glow flared from the newly-revealed tailpipes, indicating that the fusion engines had been activated. The sudden acceleration pressed Charles against the seat, making it difficult to breathe, but the familiar sensation made him feel more alive than ever. Having discarded almost half of its mass, Pegasus’s velocity shot up by 2.2 Mach, and easily overtook Andromeda.\n“Surprise!” Charles whistled.\n“Impossible! How did you manage to get up to Mach 12?”\n“I’ll see you in Tokyo, my friend,” said Charles, “that is, assuming your little flying saucer can get there. Whatever you do, try not to fall into the ocean. I don’t want to break a tooth on your ring when I savor the sashimi at my celebration dinner.” He smiled as he imagined millions hanging on his every word.\nAs if to prove his point, behind him, Andromeda began to shake, clearly being pushed to its limits. Struggling, it managed to accelerate for a brief stretch, a last desperate attempt that had to be abandoned.\n“Just you wait, Charles Mann! One day . . . ”\nCharles laughed as his ship pulled farther ahead. The fusion engines were operating at their maximum, pushing his velocity to unprecedented heights.\n“Krinsky, Hamill, Tanaka, let the game begin!”\nLike a figment of a dream, Pegasus passed one craft after another, and soon reentered the atmosphere. The ship’s heat shields activated as the air around it grew incandescent. Like a fiery meteor, Charles’s ship swept across the sky over the western Pacific and descended toward the Japanese islands.\nSomewhere above the ocean not far from Tokyo, Pegasus finally overtook Tanaka Takayuki’s1 Amaterasu, which was decelerating in anticipation of landing. Pegasus, on the other hand, didn’t slow down at all as it brazenly swept over Amaterasu and then Tokyo itself.\n“Where do you think you’re going, Mann?” The voice of Charles’s coach warned in his earpiece. “You’re going to be in Siberia if you don’t stop.”\nCharles began to decelerate only when he had gone beyond Tokyo, sketching a graceful arc as he circled back and landed on the lawn of the Tokyo Olympic Stadium just before Amaterasu touched down. The crowd in the sold-out stadium cheered wildly as Charles glanced around, satisfied.\n“Congratulations on successfully defending your title!” said his coach through the earpiece. “The medal ceremony is in an hour, so you have some time to prepare a speech.”\n“Why don’t you accept the medal for me? I’ve got a date with the cherry blossoms.”\n“Would you stop kidding around? Empress Aiko is going to hand out the medals personally! You’ve also got a meet-and-greet with Japanese readers this evening. If you really want to see the cherry blossoms, we’ll arrange something for you tomorrow.”\n“I’m not interested in the empress.” Charles laughed. “Why should I waste my life on such boring conventions? I’m far more excited by Aoi Masa.” He knew that the empress would be utterly enraged by his mentioning her in the same sentence as the famous AV idol, while Masa would grin, and the millions tuned into the livecast would be laughing along with him. His quote would become the front page headline in all the world’s major newspapers—well, at least the entertainment sections.\n“Charles, you’ve got to—”\nBut Pegasus had already taken off, and as millions watched, it rose into the air and disappeared among the jungle of towering skyscrapers that was Tokyo.\n2.\nSudden pinpricks of pain made Takumi Naoto open his eyes. For a long while he wasn’t sure where he was.\nHe was in his room, of course, about seven or eight meters square. A tatami mat took up half of it, with the other half occupied by a computer desk. There was no other furniture in the room, but then again, these two things were all he needed.\nNaoto sat up, the painful pressure in his bladder making him keenly aware that he had been lying immobile for almost eight hours. Not having eaten for the duration, his blood sugar level was dangerously low, which set off the health monitor on his wrist. If he didn’t eat soon, the monitor was going to conclude that he was in a coma and send out a distress call to the hospital nearby.\nNaoto went to the washroom to relieve himself, filled a cup with mineral water, and returned to the computer desk where he opened a bottle of concentrated nutrition pills. The pills contained almost all nutrients needed by the body and suppressed the secretion of stomach acid—taking five pills was equivalent to eating a full meal. Of course the pills lacked something in the taste department, being closer to plastic foam than actual food, but given that Naoto experienced the joys of foie gras, shoro mushrooms, and caviar every day, he paid it little mind.\nNaoto stuffed ten pills into his mouth and washed them down with gulps of cold water. He turned on his computer and brought up a window into which he tapped a series of apparently meaningless numbers and symbols, his fingers flying over the keyboard. He was, in fact, writing code for a financial management application, an utterly boring job whose only redeeming feature was paying relatively well. However, he limited himself to working no more than two hours each day, an amount of time sufficient to earn the funds to cover his rent and nutrition pills. He wasn’t interested in wasting even a minute of his life on such lowly concerns beyond the absolute minimum.\nI’ve got to work faster, Naoto thought as he typed away. I can’t afford so much separation. This is going to ruin the hard-earned psycho-coordination link . . . I’ve got to get back to it . . . Just five more minutes . . .\nBut someone was calling him. Frowning, Naoto switched over to the chat window, where a chubby girl with short hair appeared: his neighbor, Asakura Minami. She showed him an expression intended to be kawaii. “Naoto! Are you there?”\nSuch useless chatter! “Yes.”\n“I have something cool to tell you: Charles is here!”\nMore wasted words. “Yes, I’m aware of that. And?”\n“It’s Cha-ru-zu!” Minami emphasized every syllable deliberately. “Charles Mann, your idol! Just now, he turned down the medal ceremony to go on a date with Aoi Masa. It’s all over the web. Still, I heard that he was going to be signing books in Ginza and meeting fans tonight. What an opportunity! Why don’t we go see him together? I have a copy of his The Other Shore of the Pacific and I’m going to get it signed—”\n“Sorry, no can do.” Naoto didn’t even wait for her to finish. “I’m busy. Work.”\n“You’re holed up in your room all day working. Can’t you take a two-hour break and go out? And it’s Charles—”\n“I’m on deadline.”\n“But—”\n“Sorry. Bye!” He closed the window.\nWhat a silly woman. She just wasted a whole minute of my precious time. Naoto knew that Minami liked him, but after he’d been with famous actresses and models like Elizabeth White, Mariana Kingston, Paula Claudia, and Yang Ziwei, it was impossible for him to be excited by Minami’s round, plain face.\nMoreover, the presence of Minami always reminded him of who he really was, and the last thing he needed was himself.\nNo, it was impossible to stay in this room any longer; even a second more would drive him crazy. Naoto finished his job in a rush, pushed the computer away, and lay down on his tatami mat, closing his eyes. His body was starting to digest the nutrition pills. Even though his stomach protested at the artificial nutriment, he no longer felt so hungry. He could go another eight hours.\nHe initiated the connection and sensory data began to flow over the link. Neural pulses were converted into electromagnetic waves, which were converted into neutrino beams, and then back to electromagnetic waves and neural pulses again.\nVestibular systems synchronized: I am standing where he stands; tactile sensations synchronized: a breeze caresses my skin, full of the warmth of spring and the moisture of the Pacific; hearing synchronized: the susurration of the wind and the sensual twitter of birds; sight synchronized: patches of lively pink and translucent white, coalescing into thousands of blooming cherry trees.\nThe lovely kimonoed female figure kneeling under that cherry tree turns and smiles, her perfect features even more beautiful than the blossoms: Masa Aoi!\nAnd I am Charles, the one and only Charles.\n3.\nPegasus landed next to a small lake near Hakone.\nMasa was waiting for him in a shore-side cherry grove where the flowers were as magnificent as the clouds at sunset. A pure white picnic blanket was spread on the ground, on which were laid plates of refined sashimi and flasks of sake. Dressed in a loose green satin kimono, the kneeling Masa greeted him in perfect English, her voice as sensual and soft as the fabric draped around her.\n“Hello, Charles.”\n“Hello, Masa-chan.” Charles sat down next to her, his arm wrapping around her slender waist possessively.\n“I saw the livecast,” Masa said. “Shall we drink to another championship?” She raised an elegant small sake cup.\n“Oh, it’s nothing.” Charles accepted the cup and drained it in one gulp. Then he kissed her perfect cheek. “The only reason I flew so fast, of course, was to see you—”\n“Oh, please!” Masa laughed.\n“I swear. It’s been how many months since we last saw each other? I’ve really missed you.”\n“Is that so?” Masa’s expression was halfway between a smile and a frown. “How do you explain Claudia then?”\nCharles grinned awkwardly. “Um . . . she’s a lovely girl, of course. Both of you are! You’re both so close to my heart . . . ”\nHaving had her fun, Masa switched topics. “Have you seen my new film? I sent you tickets to the premier, but you didn’t show up.” She waited a beat. “It’s called Hokkaido Love Story, remember?”\n“Of course! You were magnificent, baby.” Charles caressed her hair, which gave off the fragrance of cherry blossoms. “I absolutely loved it.” He struggled to remember the name of Masa’s character, but came up empty. “Oh my God, you displayed such emotional range and authenticity in the portrayal.”\nThe corners of Masa’s mouth curved up. She knew that at least ten million people had heard the endorsement, and soon, hundreds of millions would be looking up her film on the web. She could already envision Hollywood beckoning at her. “So, tell me Charles, which scene was your favorite?”\n“ . . . The ending, definitely the ending. I thought it was so . . . moving.” Charles hurried to change the subject. “I thought this was a famous tourist spot. How come there’s no one else here?”\n“This lake is private. The owner is the head of the Asao Group. He’s providing the spot for our date free of charge.”\n“Please thank him for me. It’s so beautiful here.” Charles looked around him. The snowy peak of Mount Fuji glistened in the distance, and all around branches laden with cherry blossoms swayed in the breeze, soft, pink petals falling to the placid jade lake surface like rain. Every scent in the air was pure, refreshing.\n“I bet Thoreau would be jealous of us.” Charles took a deep breath. “I think if I were to live here, I’d write something even better than Walden.”\n“Walden? What’s that?”\n“It’s . . . never mind.” Charles’s grin turned feral as he leaned in toward his companion. “Masa-san, have you ever tried to . . . ” His voice was now an inaudible whisper, but of course innumerable audience members around the world shared the revelation in livecast with Masa.\nMasa giggled. “Oh, such an adventurer!”\nThe two of them were now entwined on the ground. How the hell am I supposed to get this thing off her? Oh, the knot is back here . . .\nThe noise of an approaching engine broke the tranquility of the lake. Charles twisted his head around and saw a tiny blue dot above the horizon. “Oh, I hope it’s not those crazy fans again,” he muttered.\nThe dot rapidly grew in size, and a pair of wings appeared around it. Charles soon saw the Japanese flag painted on the fuselage as well as the English text beneath it: a patrol vehicle from the Tokyo Metropolitan Police.\nThe tiny aircraft landed next to Pegasus, and a police officer emerged and strode over to them.\n“Sir, are you Charles Mann?” Her English was heavily accented.\n“Yes, are you looking for an autograph, sweetheart?” Charles examined the officer. She was young and not classically beautiful, but her fit figure and serious mien gave her an air that commanded attention.\n“Mr. Charles Mann,” the officer spoke without expression. “You’re suspected of engaging in terrorist activities. Pursuant to Japanese law, I ask that you return with us and cooperate with our investigation. You have the right to remain silent . . . ”\nMe? Terrorism? What kind of stupid joke is this? Charles turned to look at Masa, but she looked equally puzzled.\n“Wait just a minute! What are you talking about?”\n“Exceeding the speed limit at low altitudes,” the officer explained. “Speeding beyond Mach 2 is illegal, and beyond Mach 5 is considered a serious threat against the city and a potential terrorist attack. Your speed just now exceeded Mach 10. According to Chapter Seven, Article Eighty-Two of the Japanese Special Anti-Terrorism Provisions, you must be detained and interrogated.”\n“Are you nuts? Don’t you know there was a championship race today?”\n“Yes, the race was subject to certain exemptions. However, after the race was over, you took off again, still exceeding the speed limit and outside the race area. I have no choice but to arrest you.”\n“Arrest me for speeding? That’s utter bull—” Charles forced himself to calm down. Remember, millions are behind me.\n“This is ridiculous!” Masa quickly pulled the kimono around herself, got up, and began to speak to the officer in rapid-fire Japanese, gesticulating wildly.\nBut Charles could tell that this officer wasn’t going to budge; he also noticed several other muscular officers in the patrol vehicle by Pegasus. “All right.” He gestured for Masa to stop and shrugged. “I’ve never had an opportunity to visit a Japanese detention center. But sweetheart, I’m going to write you into my next novel. I hope you don’t mind.”\n“You may do as you like.” The officer seemed relieved that he wasn’t making a fuss. “If you wish to retain an attorney—”\n“Already taken care of,” Charles said, pointing at his head to indicate that his lawyer was monitoring his livecast. “Oh, may I have the pleasure of your name?” He saw the name tag on her chest, but he couldn’t read kanji.\nThe officer hesitated for a second. “Hosokawa Homi.”\n“Hosokawa . . . Homi,” Charles repeated the name. “Can you promise me something?”\nShe looked at him questioningly.\nCharles grinned. “You ruined my date. When this is all over, you will have to give me another one as compensation.”\n“Mr. Charles,” Homi said, blushing furiously. She was so flummoxed that she had temporarily forgotten that Westerners put their given names first. “Let me remind you that it is a crime to harass a police officer in Japan!”\nBut Charles was sure he had seen a hint of delight in her eyes as well.\nThe pleasure of the hunt!\n4.\nIn accordance with standard procedures, Charles was handcuffed and brought into the patrol vehicle under the watchful eyes of multiple officers, who refused to let Masa Aoi accompany him on the ride back to Tokyo.\nThe whole flight back, Charles tried to chat up Homi, who pretended to ignore him, though from time to time she couldn’t help but smile. The expressions on the other officers’ faces grew uglier by the minute.\nBy the time they approached the landing pad at the top of the Metropolitan Police Headquarters building, multiple aerial vans from local news agencies had already surrounded the place. A group of fans chanting “Free Charles!” were attempting to land forcefully, and the police had to divert half a dozen additional patrol vehicles with dozens of officers to maintain order. Everything was chaotic.\nSurrounded by a group of police officers, Charles strode toward the entrance. Homi walked right next to him, and couldn’t avoid being pressed against his muscular body.\n“At my last signing in Manila,” Charles said to her, “the crowd was just as crazy as this one. Being pressed against so many bodies was no fun, of course, but something interesting did happen.”\n“What?” asked Homi, unable to resist.\n“The crowd was mad, shoving and pushing. I was fine, of course, but they managed to squeeze a baby out of a pregnant woman.”\n“That’s terrible!”\n“Ah, but then they managed to squeeze the baby into another woman next to me.”\n“What?” It took a moment for Homi to get it. “You need better jokes.”\n“I’m telling you the truth!” Charles insisted earnestly. “Worst of all, she said the baby was mine.”\nHomi snorted and said something to him, but Charles didn’t hear it. A complete, eerie silence suddenly enveloped him, and he watched the crowd squirm around him in the flickering light helplessly. Then, the perception of weight vanished, and Charles felt himself suspended in his own body, as though he was about to float off. All sensation of touch ceased.\nFade to white.\nSlowly, he opened his eyes, his head numb and heavy. Above him was the stained ceiling of his efficiency apartment, and the fan in the computer next to him hummed.\nIt took him a while to remember that he wasn’t Charles. He was only Takumi Naoto.\nNaoto had no idea what had happened. He got up and stumbled to his computer. The web was filled with confused chatter, and countless fans were cursing the police for creating trouble. Not only did they interrupt a hot session with Aoi Masa, but they even managed to somehow break off the livecast altogether.\nSoon, the answer emerged. Out of confidentiality considerations, the Metropolitan Police had blocked the neutrino beam transmission. The world was temporarily cut off from Charles’s livecast.\n“Baka! Baka! Don’t the cops have anything better to do than mess with our lives?” Naoto let out a string of curses and paced around the room. Who knew how long the livecast would be interrupted? Two hours? Eight? More than a day? What was he supposed to do? If he was supposed to spend a whole day not as Charles, then they might as well have poked out his eyes and eardrums.\nFinally, he managed to calm himself down enough to open the programming interface and try to get some work done, but he couldn’t focus, and made multiple errors in a single line of code. In despair, he slammed his keyboard down and returned to the tatami mat to sleep. Tossing and turning, he couldn’t get comfortable; he was like a junkie needing his fix. Every sensation was alien. The feeling of being Charles was leaving him, and his soul, which ought to be soaring through the empyrean, was imprisoned in the disgusting body of Takumi Naoto.\nThe doorbell rang, finally giving Naoto something else to focus his attention on. He jumped up and rushed to the door. The display screen showed his visitor: short, pear-shaped, female. Asakura Minami.\nNaoto opened the door. “What are you doing here?” His tone was impatient.\n“I . . . ” Awkwardly, Minami lifted a bento box. “I made lunch, and I wanted to see if you want some.”\n“I don’t—” Seeing Minami’s flushed face, Naoto swallowed his ready refusal. “All right. Thanks.”\nHe reached out to take the bento, but he was so clumsy that he managed to drop it. The box fell on the ground, spilling hot unadon and tempura all over the floor.\n“I’m so sorry!” Minami squatted to clean up the mess. “I don’t know what happened. I just didn’t hold on—”\nA pang of guilt struck Naoto. “No. It’s my fault.” He squatted down to help her.\nIt took a while for the two of them to clean up the floor. Minami was distraught. “I made all this for you.”\n“No worries. Actually, I’ve already eaten, and I’m not hungry at all.” After hesitating for a moment, Naoto added, “Why don’t you come in?”\nMinami walked in and looked around. Naoto felt his cheeks heat up. “I apologize. My place is a mess.”\nBut Minami giggled. “All men are like this—well, at least that’s what I hear. Takumi-kun, do you spend all day working at home?”\n“Yes.” Naoto handed her a glass of mineral water. “Lots of people work from home now, and my job just requires a computer.”\n“Don’t you ever go out? Or talk to anyone? Don’t you get lonely?”\n“No. I can . . . go on the web. Everything is on the web.”\n“It’s not the same.” Minami gazed at him, her eyes full of concern. “You should be more active. I think you look a bit too pale. You need fresh air.”\n“I’m fine.”\nMinami noticed the massive hexagonal black box at the head of Naoto’s bed. “What’s that?”\n“It’s nothing. Just a computing peripheral.” Naoto didn’t want to explain.\nBut Minami had already recognized it. “This is . . . a neutrino receiver and converter! Are you into livecasts?”\n“How . . . did you know?”\n“My friend Rimi has one in her home, and it looks just like this. She told me it’s for livecasts, but I don’t know how it works exactly.”\n“It receives neutrino beams and converts them into electromagnetic waves,” Naoto explained. “Because neutrino beams can go right through the Earth, it’s the fastest way to transmit information and minimize delay. But the equipment for neutrino transmission can’t be miniaturized, and it’s impossible to add one to a cranial implant. The only solution is to relay the electromagnetic signal to one of these, convert it to a neutrino beam, and then reverse the conversion at the other end. Have you ever tuned into a livecast?”\n“No.” Minami sighed. “I’ve always been terrified of them.”\n“Terrified? Why?”\n“To have another person’s senses take over your brain! I think that must be like being possessed by a demon.”\n“Oh, it’s nothing like that.” Naoto chuckled. “You’ve got it backwards. It’s more like you’re possessing someone else. You get to see what they see, hear what they hear, experience every detail of their life. What fun!”\n“I guess so. I love Yan Zhenxu and Kim Dong-jun. It would be fun to know what they’re doing at this moment.”\n“I’m pretty sure Yan hasn’t opened a livecast channel. As for Kim . . . let me look up his info.” Naoto tapped away at his keyboard for a while. “Aha! He started his livecast last year. He casts for about two hours every day.”\nMinami squeezed in next to Naoto and read the large font text scrolling in the window. “‘Do you want to share a body with Dong-jun? Do you want to touch his soul in the vast deep of his mind? Do you want to live with him and work with him, get to know all the secrets of Korean stars?’ Wow! This sounds amazing!”\nBut a fearful expression soon crept back on her face. “I heard that you have to get a surgery where they cut open your brain if you want to receive livecasts. That’s got to hurt!”\n“It’s no big deal. The surgery is to implant a chip with a small transmitter, and to hook it up to all your sensory nerves in the pons. Without it, you can’t receive the sensory information in the livecast and can’t build the psycho-coordination link. Over a billion people have had the surgery, almost nine million right here in Japan.”\n“Is it expensive?”\n“Not at all. I’m sure you can afford it. But to subscribe to Kim Dong-jun’s livecast will cost you. Look, the price is listed—ignore the so-called deals they tout here, they’re all scams—998 yen per hour. If you want to tune in for two hours a day, you need more than sixty-thousand yen every month.”\n“That’s a lot!”\n“Why do you think Kim Dong-jun decided to start a livecast?” Naoto gave a contemptuous snort. “So many fans are dying to know what the life of an idol is like, to see the world through his eyes and ears, to experience his sensations. Even if he charged a hundred thousand yen an hour there would still be plenty of fans signing up—he’s basically printing money. And Kim Dong-jun is just a K-Pop star. The prices charged by Hollywood stars are straight out of this world. And you can’t even get anything real during their designated livecast sessions anyway. All those parties, trips to exotic locales, charity events, and so on are scripted and sanitized. It’s just another performance for them.”\n“If that’s true, what’s the point of a livecast then?”\n“Livecasts by professional entertainers are boring”—Naoto’s eyes now flashed with a rare fervor—“but there are livecasts worth the money. There’s one superstar in particular who basically livecasts twenty-four hours every day, and it’s all free! You can experience every detail of his life, and everything is reality, not reality TV. He’s not one of those empty-headed celebrities famous for being famous. He comes up with brilliant ideas, has impeccable taste, and is a talented writer. He’s also a leading aviator who’s deeply involved in philanthropy—”\n“Hey, wait a minute. You’re talking about Charles, aren’t you?”\n“That’s right, I’m talking about”—with an effort Naoto managed to swallow the me—“the one and only Charles Mann. Charles, the Man.” He sighed, and his face dimmed.\nCharles, my true self, what is happening to you?\n5.\n“You are free to go now.” The slender figure of Homi appeared at the door to the detention cell, her tone chilly.\nCharles got up from his chair, his expression indifferent, as though this development was entirely expected. He glanced at his watch. “It’s not even seven yet. Why don’t we have dinner together?”\n“I have work to do.” Homi’s voice was still emotionless. “Come this way, please.”\n“I thought you told me that bail is impossible. Why are you letting me go?”\n“It’s because of your devoted fans.” Annoyance flashed across Homi’s face. “At least a hundred thousand of them are protesting in front of the headquarters building, threatening to tear this place down. They’re demanding that you immediately resume your livecast. Half of Tokyo is now paralyzed. I don’t get it: how can so many people worship someone like you?”\n“You’re letting me go because of my supporters?”\n“You’re apparently not a terrorist, and the brass isn’t interested in pursuing this matter further. We won’t charge you. Now, will you please get out of here?”\n“No.” Charles shook his head. “If you’re not planning to charge me, why did you arrest me in the first place? I demand an explanation, otherwise I’m not leaving.”\n“You—” Homi glared at him.\nJust then, a tall blonde appeared behind her. “This entire incident was caused by the incompetence of the Japanese police. You must apologize to Mr. Mann.”\n“Lisa!” Charles called to his manager. “I’ve been waiting for you. What took you so long?”\n“MacDonald is taking care of it.” Lisa nodded at him. “Charles, since you never left Pegasus at the stadium, you were still officially in the race. The proper interpretation for what happened was that you deviated from the race course and were forced to land in Hakone . . . Anyway, the point is you didn’t violate Japanese law, and they had no right to detain you. Since the Japanese police wasted your valuable time, they must offer you a formal apology. We will publish the demand in every major media outlet and reserve the right to pursue compensation through the legal system.”\n“Oh, we don’t need to make such a fuss,” Charles said generously. “As long as this beautiful woman is willing to have dinner with me, I’m willing to forgive the police and let bygones be bygones.”\nHomi was about to offer some sarcastic retort when her phone buzzed. She picked up and listened, the expression on her face shifting subtly. It was a call from the chief of police.\nLisa pulled Charles to the side and whispered, “You’ve got to get out of here right away and resume the livecast. There are millions complaining on the web already.”\n“What’s the hurry? It’s rare for me to get a few moments to myself.”\n“No, you’ve got to resume as soon as possible.” Lisa’s tone brook no objections.\nCharles looked at Lisa, whose expression remained superficially calm. That only made Charles uneasy. When he first started his career, everything had gone wrong. At that crucial juncture, Lisa Goldstone had come to his aid and pulled him through. Everything he did—racing, writing, charity work, publicity—she arranged. Her contribution to Charles’s meteoric rise could not be overstated. But even so, Charles never felt very close to Lisa; indeed, he was a bit intimidated by her, though he also acknowledged that he depended on her. In recent years, as Charles’s stock had risen higher and higher, Lisa had come to manage his affairs with more input from him. Still, whenever Lisa insisted that something had to be done a certain way, Charles felt powerless to resist.\n“All right,” he said with no enthusiasm.\nLisa shifted to a more mollifying tone. “You know that at least ten million people are tuned into your livecast at any moment, and more than 1.2 million choose to spend more than five hours a day in your stream. About three hundred thousand are practically living in your body and mind twenty-four hours a day. This is mainly because your livecast is almost never off. Your fans have come to trust you and rely on you. Now that you’ve been off air for an unprecedented two hours, many are finding your absence intolerable.”\n“But they can tune into other livecasts! There must be at least a hundred thousand to pick from.”\nLisa laughed. “How can they compare to you? You are the one and only Charles. But don’t let that go to your head. More celebrities are getting into the livecasting business every day, and many want to take over your place. If you don’t get back on air soon, I imagine more than a few will turn for their fix elsewhere. Your career depends on that not happening.”\n“I . . . understand.” Homi hung up her phone, and, scowling, turned back to Charles. “Mr. Charles, on behalf of the Tokyo Metropolitan Police, I hereby offer you our sincerest apologies.” She bowed deeply.\nCharles grinned. “I’ve already forgotten it. But I do have a craving for Japanese food. Would you take me somewhere good?”\nHomi gritted her teeth. “Please, come this way.”\nLisa smiled knowingly as she leaned over to whisper in Charles’s ear, “The whole world is watching. If you can capture her heart, I’m certain you’ll double your subscribers.”\n6.\n“Takumi-kun, are you all right?”\n“Hmm?” Naoto’s mind had been wandering. He saw that Minami was gazing at him with a look of concern. “Sorry. What did you say?”\n“I asked you how it felt to tune into a livecast.”\n“An interesting question.” Naoto pondered his answer. “At first, you go through a period of adjustment—that happens no matter whose livecast you tune into. The beginning is a bit frustrating: the colors and sounds all feel wrong somehow, as though you’re watching some 2-d film from the twentieth century. It’s just odd. Although all human beings share similar biological sensory organs, there are subtle differences in the neural wiring, and so you have to put in an effort to interpret the signals being projected into your brain, and all subtleties are at first lost. For several days you’ll feel as though you’re perceiving everything through a film, and nothing feels immediate or real. But then, one day, you’ll have a breakthrough and everything will feel just like your own senses.”\n“Can you feel everything the livecaster feels?’\n“Almost everything: sight, sound, touch, smell, taste, heat and cold, the sensation of weight . . . and pain. For example, if the livecaster is pricked by a needle, you’ll feel the same sharp pang of pain. However, since the signal is filtered for safety reasons, the magnitude of the pain is diminished. Do you remember the British singer Philip Bolt? Three years ago during a livecast a deranged fan stabbed him more than ten times in the stomach, and he died almost instantaneously. Twenty thousand subscribers who were tuned into the cast suffered along with him, and close to five hundred fainted, with more than thirty dying from shock. Everybody was talking about it back then. After that, they put in safeguards for subscribers to prevent such traumatic experiences.”\n“Oh . . . Then, what about joy? Can livecasts transmit the feeling of joy?”\n“That’s . . . complicated.” Naoto tried to find the right words. “Usually, it’s not possible to directly transmit joy because the emotional experience involves the whole body and isn’t a distinct sensation. However, biological sensations of pleasure can be transmitted: such as the pleasure of eating a gourmet meal.”\n“Then you don’t really know what the livecaster is thinking either.”\n“That’s right, you don’t. Each sense is limited to a specific region of the brain, but not thought. Cognition, as we’ve learned, emerges from the coordinated actions of all regions of the brain and cannot be isolated to specific areas. Also, since our thoughts require access to uniquely encoded memories, it’s very difficult to translate each thought for transmission. Indeed, it’s precisely because thoughts cannot be tapped into that livecasters are willing to open up their senses to others. This way, they can still maintain their inner privacy.”\nMinami grew even more curious. “I still don’t quite understand what it’s like to tune into a livecast. So you can see everything they see, hear everything they hear, just like if you were living in their body, and yet you don’t know what they’re thinking and can’t control what they do? It seems as though you’d feel like a puppet whose string is being pulled by someone else. That must feel really awkward.”\n“You’re not wrong.” Naoto was enjoying this conversation, and he was suddenly seized by a desire to share with her everything he had learned about livecasts. “But remember, feeling like you’re really in the livecaster’s body is only the second stage. The next stage requires you to build the psycho-coordination link. That is, you have to synchronize your thoughts to theirs, and match your actions to theirs, so that it feels as though you’re moving the livecaster’s body yourself.”\n“How is that possible?”\n“It’s not easy, but it’s a learnable skill. You have to experiment a bit. First, you need to purge yourself of all distracting thoughts, and habituate yourself to the livecaster’s lifestyle and their way of doing things. Of course you also have to really understand the way they use language. After you’ve accomplished these steps, it’s possible for you to think and act just like the livecaster in most situations. This isn’t as hard as you might imagine. Most of our thoughts and actions are triggered by sensory inputs. Once you’ve accepted the sensory input as your own, you hold the key to the thoughts and actions as well. For examples, if you see and smell a hot mug of delicious coffee in front of you, isn’t it natural to pick up the mug and take a sip?”\n“But . . . but there must be some things that cannot be anticipated by the subscriber, right? For examples, any sort of high-level thinking or decision-making?”\n“Well, yes . . . that’s why you have to stay focused. But there are tricks. For example, try to empty your mind and think of nothing at all; let your senses guide you. After a while, you’ll feel yourself building a kind of psychic resonance with the livecaster, as though you really are the livecaster.”\n“So you can build such a deep link with only one livecaster?”\n“Theoretically, there’s no such limit. But ideally, you want to build such a link with only one subject. If you switch between multiple livecasters, it’s very hard to maintain multiple psycho-coordination links.”\n“But why?” asked Minami.\n“Why what?”\n“Why do you want to be the livecaster? Isn’t that . . . a bit much? You want to understand the livecaster, but that doesn’t mean you want to give up your life to live theirs. And that’s an impossible dream anyway.”\n“Why is it impossible?” Naoto felt a surge of anger. “You’ve never even tried it, so of course you know nothing about the fantastic experience of the link, that sensation of the soul melding with the flesh. You would really be living a different life, really be someone else. If you knew what that felt like you wouldn’t be asking such questions.”\n“All right, I guess I don’t understand.” Minami wasn’t interested in arguing. “But Naoto-kun, I think you should get out of your apartment more. A gym just opened near us, and I go there every day to swim or play ball. Why don’t we go together?”\nNaoto found the suggestion ridiculous. Earlier today he had flown thousands of miles, traversing half the globe in the process. And now this silly girl wanted him to go exercise with her? What does she know?\nBut it appeared as if Charles’s livecast wouldn’t be resuming any time soon. He needed some way to pass the time. Maybe going to the gym wasn’t a bad idea. It certainly was better than being cooped up at home, bored.\n“All right.” Naoto nodded. “Let’s—”\nPing! The alert ring in his ear was accompanied by a flood of signals into his implant. OMG, Charles has just resumed his livecast!\n“—try to figure out something in another couple of days. Thanks!” Naoto yawned exaggeratedly. “I’m sorry. I’m feeling really tired, and I’d like to take a nap.”\n“But—” Minami protested, but Naoto made it clear that he wanted to be alone.\nAfter shutting the door behind her, Naoto lay down on the tatami mat, his whole body tingling with excitement. The bare, cramped apartment now seemed lovely and comfortable.\nWhat’s going to happen next? Will I be with Aoi Masa, Hosokawa Homi, or some other beauty? What will we be doing? How will I spend this lovely night?\nNo matter what, my real life is about to resume.\n7.\nWearing a pair of shades and nibbling on takoyaki in a roadside stall in Akihabara, Charles was thoroughly enjoying himself. Homi sat across from him, the steaming bowl of tonkotsu ramen before her untouched. Even though he was making an effort at a disguise, many of the establishment’s patrons soon recognized Charles. He waved at them in acknowledgement, and from time to time, fans approached for a wefie or an autograph—at least everyone was polite.\nHomi looked around and finally relaxed a bit. “Aren’t you afraid of being mobbed by your fans, just sitting here in the open?”\n“Afraid? My fans would much rather be tuning into my livecast. Even if they could come here and see me in the flesh, I doubt many of them would choose to. Oh, don’t you like your noodles?”\n“I . . . I’m just uncomfortable.” Homi’s cheeks reddened. “The idea that millions are watching us is so strange.”\n“They’re not watching me.” Charles grinned at her. “They’re enjoying the sight of you through my eyes.”\n“I don’t like it!”\n“You weren’t so nervous when we first met.”\n“That was because I didn’t really understand what livecasting involved. You had to explain it to me. This technology only became popular in the last few years, right?”\n“No. It’s been around for ten years. I was one of the first to start a cast.”\n“That’s true. But it only spread to East Asia recently. We Japanese prize our privacy. I can’t imagine having strangers watch everything I do.”\n“Not everything.” Charles chuckled. “I always pause the cast when I’m sitting on the toilet. Nobody wants to deal with the smell. Trust me.”\n“But everything about your life . . . even . . . even . . . ”\n“You’re talking about sex? That’s a biological need and part of our social repertoire. I don’t need to hide that.”\n“But it’s private!”\n“Ha! Having the whole world watch you enjoy yourself is a pretty fantastic feeling.” Charles winked at her. “Masa told me she adores it.”\n“Of course she would! That’s how she makes her living.”\n“Well, it wouldn’t kill you to try something new. I’ve heard that nudism is gaining popularity in Japan, and I—”\n“Listen, Mr. Charles.” Homi’s gaze was now infused with a mixture of annoyance and embarrassment. “Not everyone subscribes to your life philosophy. I’m here because my superiors asked me to be polite and play the hostess, but after this meal, we will never have anything to do with each other again. Do you understand?”\nI understand that you’re playing hard to get. Charles spread his hands in a conciliatory manner. “Of course. You’ve got to do what feels right to you.”\nYou’re certainly not the first woman to say something like that to me, Charles thought. Many seemed to have an instinctive fear of being exposed before strangers, but soon, his lovers learned to crave the delightful sensation of being the center of the world’s attention. They fell in love with this way of life and abandoned their old prejudices. Maybe Homi will be like that . . . but if she isn’t, maybe that will make things even more exciting . . .\nThree boys about eight years old approached the pair excitedly and broke the awkward silence between them. They said to Charles, “Konbanwa, Charuzu-sama!”\n“Konbanwa!” Charles replied to their greeting happily. This was about the extent of his Japanese, however.\nThe children continued in rapid-fire Japanese. Charles looked at Homi helplessly, and she was forced to play interpreter. “They said that they saw you win the race this afternoon, and they really like you. When they grow up, they hope to become just like you, a great aviator and author.”\nCharles gently patted one of the boys on the head. “Kid, it’s not that important to fly very fast or publish a book. What really matters is being yourself and doing what you desire in your heart.”\nThe boy replied, and Homi continued to translate. “But I want to be an aviator. So cool!”\n“Then start as a junior aviator. You can first try a full-body simulator and race in VR.”\n“Virtual reality is pointless. I want to fly the real thing, just like Pegasus.”\n“Slow down, kid.” Charles explained patiently. “If you really love the sport, you’ll enjoy learning what the simulator can teach you. You can also subscribe to livecasts from me and other aviators, and you’ll learn a lot—well, except the parts that require parental approval to view.”\nAfter answering a few more questions, the children left happily with autographed pictures of Charles.\n“You’re certainly good at dazzling children,” said Homi.\nCharles laughed. “I’m just saying what I really think. This has always been my belief: everyone should be themselves, and realize their own worth. I’m not some idol on a high pedestal demanding to be worshipped. I started a livecast for a reason perhaps different from most: I just want everyone to know the real Charles.”\n“That’s a bit rich,” said Homi. “Don’t you depend on your subscribers for your income?”\nCharles frowned. He hated this kind of cynicism. “You’re wrong. Whether it’s from my racing or my writing, I make more than enough to live comfortably. My livecast is completely free, and I’ve never earned a single cent from it.”\n“I’m sorry. I didn’t mean that.”\n“It’s all right.” Charles shrugged. “Many people think like that, and I can’t change their minds. I just don’t want my friends to misunderstand me. If you know me, you’ll know that before I started the livecast, I had already been published and won third place in the Trans-Pacific Championship Race. I didn’t need a livecast to increase my fame at all.\n“It’s true that these days there are millions tuned into my stream at all times, but I’ve always believed that I’m not very important as an individual; rather, I represent the concept of livecasting. The practice isn’t about destroying personal privacy, but about sharing—sharing of information, sharing each other’s sufferings and joys, until the entire human race becomes one Man. As subscribers enrich their own lives with livecasts, they gain a deeper understanding of themselves and discover their own worth.”\n“That does sound . . . reasonable.” Homi was thoughtful. “But having so many people watch every move you make must make you feel . . . not free.”\n“That kind of thinking is evidence of lack of self-confidence. I’m Charles, the one and only. Even if billions are watching me, my freedom isn’t diminished by one iota.”\n“Maybe it’s because you’re an American,” said Homi. “Americans are always brimming with self-confidence. This is not the Japanese way. From childhood we’re taught by our parents to live within rules and expectations, to learn to regulate our behavior in anticipation of what everyone watching us may think. The desire for privacy is thus even stronger.\n“I remember playing with my friends every day in a tiny garden when we were in kindergarten. I say ‘play,’ but in reality we still had to follow all kinds of rules. At the end of the garden was a row of trees, and behind the trees was a wall. But there was a gap between the trees and the wall, though most people did not notice it. I discovered this hidden space one day, populated only by a few clusters of wildflowers. Even though it was a patch of grass no different from the rest of the garden, my joy was indescribable. Every day, I made my way there in secret to play by myself. It wasn’t that I didn’t want to share my discovery with my friends, but it was only when I was there, alone, that I could relax and feel at peace. I could laugh or cry without anyone bothering me.\n“Unfortunately, not long after that my refuge was discovered by others. Many came and trampled over the grass and picked the wildflowers. That tiny world I had to myself was ruined.”\nHomi felt depressed. She had no idea why she chose to say these things to Charles. She had never told anyone else about this memory from childhood, and now the whole world knew her secret.\nCharles was moved. After a moment, he said, “The others did destroy your secret garden. But they weren’t motivated by the desire to watch you.”\n“No, you don’t understand. It didn’t really matter whether they wrecked my garden. The moment they were in that space, my peace was gone, and I was no longer myself. Have you never felt that way?”\n“I . . . I suppose I did when I was very young.” For the first time, Charles had trouble coming up with what to say. “But I haven’t felt like that in a long time.”\nHomi gazed at him, a complicated set of emotions flitting through her eyes. “Then I have a suggestion: turn off your livecast. Try to experience your individual world, where every sensation belongs to you and you alone. I believe you’ll feel a distinction.”\n“Turn off the livecast?”\n“Maybe you just need a minute to feel the difference.”\n“No. That would be a breach of my promise to my subscribers—”\n“Charles, I thought you advocated for the belief that you should do only what you want to do.” Homi’s tone was now mocking. “It wouldn’t kill you to try something new.”\n“Maybe if I—”\nCharles, ignore her! A translucent text window popped into his view. This was Lisa communicating with him directly over the cranial implant. The text was only visible to him as the livecast software filtered it out from subscriber feeds.\nI was thinking of trying it for just a couple minutes. Charles sent his thoughts back to Lisa over the cranial implant.\nNot even one second. You’re being watched by the planet! This could severely tarnish your image. Charles could practically see Lisa’s no-nonsense scowl.\nHomi noticed Charles’s subtle shifts in gaze and guessed that he was communicating with someone over his neural implant. She challenged him, “I’m guessing your boss is telling you no, right? Oh well—”\n“Boss?” Charles instantly felt his cheeks heat up. “I’m my own man. No one tells me what to do!”\nHe commanded his implant to cease livecasting, and mentally recited the passcode to confirm the order. Instantly, it seemed as if a background buzz had stopped, and everything seemed extra quiet. This wasn’t the first time he had ever halted the livecast, of course, but it was the first time he had stopped livecasting for the sake of experiencing what it was like to be by himself. The sensation was distinct. Now, no matter what he said or did, only the woman across from him would be his audience. There seemed to be a marvelous, intimate bond that drew them closer.\n“How do you feel?” Homi asked.\n“It’s no big deal,” Charles said, deliberately trying to underplay it. “I’m okay with it.”\nBut it wasn’t that simple at all. The world seemed to have vanished, leaving only him and her, but it also felt as if a new dimension had been opened up to him, leading into a new space that extended into infinity.\n8.\nTakumi Naoto panted as he scampered through a dense fern jungle, a rampaging T-rex in hot pursuit. The very ground quaked with the massive beast’s every step. The dinosaur wasn’t running very fast, however, just keeping pace with him like a cat playing with a mouse. Naoto could almost feel the hot breath of the saurian on the back of his neck.\nNaoto struggled to put one leg in front of the other, desperate to escape from the monster’s jaws. He was winded, sweat-drenched, and his legs were filled with lead. Soon, the T-rex took a giant stride and overtook him; it turned its gigantic body around and opened its colossal jaws, aiming to crush Naoto’s skull with its dagger-like teeth. Naoto screamed and collapsed into a heap on the ground.\nThe jungle and the T-rex vanished; floating lines of data took their place. Total distance: 546 meters. Time: 116 seconds. Average speed: 4.7 meters / second. Measured lung capacity: 1250cc. Health rating: B— . . .\nMinami’s round face loomed before him. Naoto was draped over the guardrails of the three-dimensional immersion treadmill, so exhausted that he couldn’t speak a word.\n“You couldn’t even manage 600 meters?” Minami giggled. “Even I can run a kilometer with no problems. Naoto, you really need some exercise.”\nFinally, Naoto managed to climb up. Gasping, he said, “It takes . . . time . . . for anything . . . ”\n“Then let’s keep going. I’ll make the dinosaur even slower this time. Ready?”\n“No! . . . I’ve got to . . . take a break . . . ”\nThey went over to the lounge chairs. As soon as they sat down, a cool breeze caressed their faces, and the immersion displays around them showed a turquoise ocean whose gentle waves caressed the cerulean sky. Next to the chairs were two chilled glasses of lemonade—the real deal, not simulation.\nThe lemonade and the breeze relaxed Naoto so much that he felt as if all his pores yawned. “I haven’t felt this good in ages. It feels amazing to drink something cold after physical exertion.”\n“Didn’t you also exercise when you were tuned into Charles’s livecast—no, let me rephrase: didn’t you also experience the sensations of exercise?”\n“Yes . . . But Charles has so much energy and such a toned body—nothing like mine. Also, because of the safety filtering that tamps down extreme sensations, I never felt very tired.”\n“You should definitely come with me more often.” Minami laughed guilelessly. “Let’s go swimming!”\nBut before Naoto could reply, a loud cry arose to the side: “Hey! It’s that bastard Charles! He’s finally shown himself!”\nNaoto looked over to the source of the commotion. The projection screen on the wall was showing the news. “After disappearing in Akihabara yesterday and being incommunicado for over seventeen hours, the renowned American aviator Charles Mann has reappeared today at noon, accompanied by his rumored new flame, Miss Hosokawa Homi . . . ”\nCharles is back!\nLast night, Charles never resumed his livecast after turning it off at Homi’s urging. Completely at a loss, Naoto finally decided to go to Akihabara. But as soon as he emerged from the subway, he saw countless other fans had had the same idea and all the streets leading to that roadside stall were jammed. Eventually, he saw Pegasus taking off and disappearing into the night sky. Rumor had it that Charles had taken Homi away on a pleasure cruise in space, just the two of them. All night, there was no more news. Naoto waited and waited without any result, and finally, utterly bored, came to the gym with Minami. He certainly wasn’t expecting to receive news of Charles now.\n“ . . . Charles is declining all interview requests. His only statement is that Pegasus lost power. But according to media sources, his ship had been in low-Earth orbit overnight, and Miss Hosokawa was aboard as well . . . ”\n“Do you think they did it?” Naoto overheard someone ask.\n“Are you an idiot? Of course they did it.”\n“What difference does it make if they did it? The bastard isn’t casting, and so we can’t enjoy it anyway.”\n“Maybe the girl is just shy . . . ”\n“Let me tell you, this has finally shown me the truth. Charles may talk all the time about sharing and freedom and all that bullshit, but in the end, he gets to turn off his livecast anytime he wants to. He doesn’t think of us at all. In the end, he’s no different from the rest of the celebrities.”\n“I don’t agree with you at all.” Naoto had finally had enough. He jumped up to defend Charles.\nThe man who criticized Charles was also in his twenties. He gave Naoto a contemptuous look. “Mind your own business if you know what’s good for you.”\n“If you are really a fan of Charles, how can you talk about him like that? Don’t you know him at all? This was most likely the result of an implant malfunction.”\n“Oh, you’re one of those fans. A malfunction? Please. Weren’t you tuned in yesterday? He said he stopped the livecast on purpose.”\n“Yes, but . . . it’s only temporary. There had been pauses in the cast before, when he was visiting Prague and Yangon, for instance. Don’t you understand that everyone needs some privacy from time to time?”\n“I don’t worship that poseur like you do.” The young man harrumphed. “The only reason I subscribe to his cast is to see him in bed with those supermodels. But not only did he not sleep with Masa, he went and found himself a chick cop and didn’t even have the decency to cast the bedroom scene. What’s the point of watching then?”\n“You are not fit to appreciate Charles’s livecast. How can you understand his ideals and beliefs?”\n“Oh, I see, you understand him, do you? Well, looks like he kicked you to the curb when it suited him just the same. I’m through with wasting my breath on dumbasses like you.” The young man turned around and left.\nNaoto sat down, full of rage that he didn’t know where to direct.\nThe news broadcast continued. “ . . . Charles’s manager, Lisa Goldstone, released a statement that the interruption in the livecast was due to a technical glitch. Full livecasting has been resumed, and on behalf of Charles, she apologizes to all the fans for the inconvenience . . . ”\n“Naoto, are you going to rush home for the livecast?” Minami asked, careful to keep her tone neutral.\n“Leave me alone!” Naoto shouted at her. “I don’t know!”\n“I was just asking,” Minami muttered. “Why are you screaming at me?”\n“I’m sorry.” Naoto forced himself to calm down. “I’m just . . . ” He didn’t know what to say and collapsed back onto the lounge chair.\nSilently, Naoto fumed at Charles. Why did you stop the livecast? Why did you cut off the psychic link between us? Recently, he could almost feel himself completely melding with Charles soul to soul, and when Charles said that he wanted to stop the livecast, Naoto had almost wanted to cheer, not realizing that it meant that he would also be shut out. And a second later, he had been tossed back into his bare efficiency apartment, all alone.\nOnly then did the painful realization come that he was never going to be Charles, just a ghostly parasite attached to Charles.\nFor the last three years, Naoto was tuned into Charles’s cast almost continuously. Every day, he lived Charles’s life, facing everything he faced, participating in his races, planning and drafting and revising his books, until he could speak American English better than Japanese, until he had almost forgotten who he was. As long as he thought of himself as Charles, it was possible to scale one life’s peak after another, be a guest at the world’s most exclusive parties, travel the world, live in seven-star hotels, bathe in the fervor of fans, hop from the bed of one hot woman to another . . .\nBut these were not the most important. The real joys were the sense of personal worth, the spirit of freedom, and a lifestyle enabled by boundless self-confidence embodied by Charles Mann. Only when he was in Charles’s body did he feel he was alive. In his own life, he was just Takumi Naoto, a programmer in a dead-end job, a failure whose life was devoid of excitement, who was estranged from his parents, whose girlfriend had left him for another man, who didn’t even have a single real friend. A few years ago, he had contemplated suicide. If Charles’s livecast hadn’t come along to save him, Naoto would have long passed the slope of Yomotsu Hirasaka and entered the underworld.\nCharles gave him a new life and hope, and resculpted his soul so that he believed that he could possess a life with value and dignity. But everything had changed. Yesterday made Naoto realize that Charles could cease livecasting at any moment, cut off this link that to him was inseverable. Everything he had thought about Charles had just been his own fantasy. Even if he possessed a soul just like Charles’s, he could never have his life.\nHe was still just Takumi Naoto, just himself. However, today’s experiences made him feel that being Naoto from time to time wasn’t so bad. Of course, he would still tune into Charles’s cast, but not right now.\nHaving made his decision, he got up and stretched. “Minami, let’s run some more. My goal is three kilometers today.”\n“All right!” She laughed in delight.\n9.\n“Charles, I’m going to say it just one more time: You cannot do this!” Lisa was screaming at him through the phone.\n“Lisa, I’ve already told you at least ten times: my time with Homi will never be livecast. This is my decision.”\n“That means you’re livecasting for no more than eight hours a day. This is going to break the bond between you and your fans. Your ratings have taken a nosedive this month, and last week the number of viewers tuned into your livecast fell below two million. You were once alone at the top of the ratings, and now you’re not even in the top ten. Wake up, Charles! Even that Chinese clown, Baby Phoenix, has more subscribers than you.”\n“Fine, let them go follow Baby Phoenix. What does it matter to me?”\n“Charles.” With visible effort, Lisa managed to contain her impatience. “Listen, we need to have a real discussion, as soon as possible.”\n“Let’s do it another day,” Charles said. “Homi and I are celebrating our 100-day anniversary tonight. I don’t want to be disturbed.”\n“But—”\nCharles disconnected.\nHomi, who was standing across from him, asked, “What’s wrong?”\n“Nothing. Just work stuff.”\n“Then let’s continue. I don’t think you’ve had enough.”\nHomi grabbed hold of him. Charles went for her waist, and she leaned into him compliantly. Watching her shy, smiling face, Charles’s concentration wavered. Suddenly, Homi wriggled out of his grasp, and he felt her weight pushing him off balance over her leg as he collapsed to the mat.\n“Ha! You lost again!”\nCharles was glad that there was no livecast to show his humiliating wrestling defeat at the hands of someone weighing at least 80 pounds less than he did. Of course, these were hardly fair contests, as Homi was a professionally trained fighter.\n“I think you need to admit defeat, and it’s ‘pony time!’” said Homi, her eyes flashing mischievously.\nCharles sighed and got on all fours, and with a delighted whoop Homi jumped on his back and guided her new mount around the room.\nWhat had happened to the suave, slick Charles who once boasted of never sleeping with the same woman two nights in a row?\nOn that day more than three months ago, after Charles shut off the livecast, confused fans had surrounded Charles and Homi in Akihabara. In the end, the pair had to escape by taking off in Pegasus. But Charles had forgotten the fact that his ship was almost out of fuel, and once they reached orbit they were stuck. Charles then turned on the livecast to call for aid, only to realize that there wasn’t even enough juice to power the neutrino converter, cutting them off from the rest of the world. A simple postprandial stroll had thus turned into a little castaway adventure in space.\nFortunately, the experience brought the pair together. Homi had never been to space, and as they drifted in near-weightlessness, she didn’t even know how to take a sip of water, leading to many embarrassing situations. They did not, in fact, “do it” on that first night together. But after they returned to Earth, Charles arrived in Japan several days later with a Pegasus full of roses, and finally managed to convince Homi to go on a second date with him . . .\nHomi imposed one condition: no livecasting while they were on dates. Charles agreed right away. And soon, he discovered a novel pleasure in this secret relationship. He ended up doing many things he had never thought of doing before: meowing at Homi like a cat, whispering ridiculous lovers’ prattle that made even him blush, horsing around like a couple of kids, doing whatever felt fun and relaxing at the moment instead of trying to perform as the perfect lover while the whole world watched.\nYears earlier, Charles had lived in such a carefree manner, but he had forgotten that past self during the years of continuous livecasting.\nTonight, in the new cabin that Charles had bought on the shore of the lake in Hakone, they were just a relaxed couple enjoying their time together. It wasn’t particularly romantic or exciting, but they were free to be as silly as they wanted.\n“Listen, baby, your ride needs a break,” Charles said. He twisted, dislodging the protesting Homi from his back, and then rolled until she was under him. He kissed her neck with fervor. “Anata,” he whispered—the ‘pony’s’ Japanese had been improving under expert guidance—“Let me . . . ”\nHomi moaned and her eyes lost focus as she licked her lips in anticipation. The whole night lay ahead, and this cabin belonged just to the two of them with no stranger’s gaze . . .\nHe reached out to unfasten her gi. But his hand stopped and pulled back—\n—and slapped hard against Homi’s cheek.\nHomi’s smile was frozen. She was stunned and unable to speak, staring at him in utter disbelief.\n“What in the world is wrong with you?” she finally managed after a few seconds.\nCharles’s features twisted into a hideous, savage expression, the muscles of his face twitching. He lifted an arm and pointed at the door. “Get out of here. Now!”\n“How can you speak to me—”\nHe shoved at her roughly. “Get out!”\nAfter staring at him for an interminable moment, Homi got up and put on her coat. “Charles, you really are an asshole.” She kicked him hard in the crotch and then hurried out the door.\nThe pain from his lower body doubled Charles over, and then he fell to his hands and knees. His throat spasmed and he coughed violently, as if he needed to expectorate his innards. His eyes filled with tears, and his limbs jerked uncontrollably in cramped agony. He didn’t know how long he was seized by such physical suffering. It was only after he had recovered that he saw a pair of slender legs in a pair of bright red high heels in front of him.\nHe looked up and saw a familiar face.\n“Lisa?” He struggled to get up. “What are you doing here?”\n“Since you wouldn’t see me, I had no choice but to come to you.”\n“But how did you know I was here? I shut off all location services and—”\nLisa didn’t answer his query but posed a question of her own. “How does it feel to get rid of your girlfriend with a good, hard slap to the face?”\nCharles’s vision blurred. “How did you know—wait, did you . . . did you—”\nGently caressing his face, Lisa said in a pitying tone, “Charles, my dear Charles, don’t blame me. You made me do it. Don’t you see?”\nHis worst fear had been confirmed. Eyes wide in shock, Charles muttered, “Oh my God, I didn’t know you could control my body through the implant . . . But, how could the chip . . . I thought it was just a transmitter.”\n“There’s no such thing as ‘just a transmitter.’ Others are able to receive your brain activities through neutrino beams, and you’re also able to receive brain activity signals.”\n“But I thought it was limited to sensory input—”\nLisa’s look was a mixture of pity and contempt. “There are so many things you don’t know. Let’s start from the beginning. Do you remember the autumn ten years ago? That was the year after your first race, when you did unexpectedly well. You had spent hundreds of thousands to outfit your ship, thinking that you could win a championship. The result? You didn’t even place, losing all your investment. You were on the verge of giving up your dream of being an aviator and returning home to Tennessee to be a farmer just like your father.”\n“Yes, I remember.” Charles said. Lisa had found him, almost passed out, in a little dive bar. She told him that she worked for an experimental neural research institute, where they were testing a new cranial implant device that could allow different people to share sensory perceptions. If Charles volunteered to be a subject, they’d pay him two hundred thousand dollars. And if the experiments caused irreversible damage to his health, they’d compensate him with even more money. In order to raise the funds for the next race, Charles accepted. And soon, they began the first trial livecast with him.\n“In reality, what I told you was not the real experiment at all,” said Lisa. “Fifteen years ago, Bell Labs invented a new direct neural interface chip capable of being implanted into the pons. The original intent was to implement a mind-machine interface, but the results were less than ideal. Unexpectedly, the researchers found that the implant did allow the sharing of brain activity patterns between different subjects. Before you, we had already conducted multiple trials on animals and humans with excellent results. But this transformative technology lacked a suitable application. No one wanted to cut open their brain to insert a metal box that would transmit their brainwaves to other people, though they weren’t against tapping into other people’s brainwaves.\n“In order to popularize this technology, we found a few subjects and compensated them handsomely to become livecasters. But once that was done, no more than a few extremely curious individuals were interested in the constant goings on in the lives of ordinary people—especially since the cost involved surgery.\n“We needed a celebrity livecaster to present a compelling use case for the technology. The celebrity’s fans could bring along more early adapters until a market emerged.\n“We got in touch with multiple movie stars, athletes, and prominent authors, but unfortunately, no one wanted to do it. This wasn’t entirely unexpected. If you were already famous and successful with a good life, why would you take the risk of drilling a hole in your skull to add some gizmo just so that strangers could peek into your head? We needed to create someone specifically for the purpose of catalyzing this new technology revolution. The management decided that we had to find a young person with potential and then package him, craft him, and advertise him until he became the spokesperson for livecasting.”\n10.\n“And so you found me.”\n“That’s right.” Lisa said. “You were already semi-famous, but your career was stalled in a tough spot. You needed money, and you were willing to undergo surgery to get it. You craved the feeling of being worshipped by the crowd, and so you wouldn’t be opposed to the idea of livecasting. You are blessed with good looks as well as easy and open manners. As long as your career took off, it was easy to see that more and more people would be attracted to your life. To be able to become the coolest and most relevant person in the world with little effort is a temptation few can resist.”\n“I see. But how did you know that I would be so successful in the future?”\n“Ha!” Lisa was shaking her head. “My dear Charles, you’re such a narcissist. Don’t you get it?”\nA cold sweat broke out on Charles’s back as the truth pressed against an old, insecure wound in his psyche, but Lisa ripped off the last bandage concealing the truth without mercy. “We didn’t know, of course. You were just one of many candidates who made it through our selection process. The fact that you were chosen was purely by accident. Had we picked any of the others, we would have been able to engineer their incredible success as well. Charles, you were never successful because of your own efforts—without us, you would be nothing.”\n“That’s not fair. Of course the livecasting has helped my career, but I worked hard for my success!”\n“You worked hard?” Lisa chortled. “Charles, you’ve been enjoying a marvelous fantasy for ten years, but it’s time to wake up to reality. Do you really think you’re some once-in-a-century aviation genius? Your experience and skill as a pilot are only secondary contributors to your numerous racing trophies—the real reason you won is because you possessed the most expensive and advanced racing craft. You can afford to hire the world’s foremost aviation experts and engineers. Your victories are bought. I bet if you left Pegasus on autopilot it would still win most races.”\nCharles’s face was now crimson and throbbing, but he couldn’t find an effective retort. “Even if . . . even if that were true, I used my own money! I’m the spokesperson for several spacecraft and aircraft manufacturers, and I earn plenty of sponsorships for my races.”\n“You’re just arguing the question of whether the chicken or the egg came first. Who arranged those sponsorships for you? Who got you in front of the advertising executives? Who convinced them to back you instead of a rival? Think about it: you get the newest prototypes for experimental craft as soon as they emerge from the wind tunnel; you have access to the latest engine technology and avionics; you enjoy the most ergonomic hull interior design and air filtration systems, customized and assembled by the most experienced engineers on the planet—do you really think you’re entitled to all these advantages with no hustle from anyone? Charles, you’re not stupid, but years of being surrounded by applause and constant praise have blinded you to the way things really are.”\n“So I’m just a puppet . . . with you and Bell Labs pulling the strings?” Charles felt his world crumble around him. “I’ve always thought you more than a bit odd. At first you told me you were a representative from Bell Labs, and then you worked at the implant start-up before becoming my professional manager—who’s the one giving you orders?”\n“That’s a pointless question, and the answer won’t mean a thing to you anyway. Bell Labs, Cartel Nanotech, Connally Entertainment, Griffin Media, Douglas Astronautics, Springer Publishing, Time Media, Pacific TV & VR, Foundation for Democracy in America . . . the companies and organizations who have invested in you are members of a common interest community, but no single entity calls the shots. If you insist on identifying a puppeteer, it’s neither the US government nor Wall Street—it’s capital itself. You’re the most important link in the system, but you’re not independent. Your pathetic attempt to make your own decisions is harming the interests of the entire community.”\n“Just because I stopped my livecast?” Charles laughed helplessly. “But you’ve already gotten your technology revolution and new market. There are more than a hundred thousand livecasting right now. Why don’t you let me go?”\n“But no one can compare to you, Charles. Even though we now have many livecasters, few are willing to do so 24 hours a day, and among them you’re the most significant. You’re the first idol we created for the livecasting age. People might go view a third-rate fad like Baby Phoenix out of curiosity for the exotic, but you embody the dream of billions with your life. There is no substitute for you in the livecasting industry. Your book My So-Called Livecast Life has sold more than three hundred million copies! You symbolize a new way of life.\n“If you go back to casting only from time to time, then livecasting will never be more than mere entertainment, and not nearly as many would be infatuated with it. It might take us ten, twenty years to recover from such a setback.”\n“I thought you were very good at building up idols,” said Charles. “Why don’t you just make another Charles?”\n“Why should we repeat the work we’ve already done? You’re now the world’s most prominent brand. Take your novels, for example: every one of them sells at least thirty million copies. But if the name of Jackson Smith were on the covers, I don’t imagine we’d move more than a few thousand.”\n“Wait a minute.” Charles was unnerved by where this was going. He stared at Lisa. “Who’s Jackson Smith?”\n“Of course you don’t know him.” Lisa waved his question away like a buzzing fly. “Jackson Daniel Smith, graduate of UT Austin, a failed novelist and former Hollywood scriptwriter, was the author of two novels published under his own name whose total sales never broke ten thousand. You can also find his name attached to a few B movies that no one has heard of. Twice divorced and bald by the time he was forty—oh, let me just add that he’s also the author of most of your novels.”\n“What?!?” Charles was sure Lisa had gone too far. “What kind of bullshit is this?”\n“Calm down. Think about it: before you got the cranial implant, you thought of yourself as a connoisseur of literature and published some online essays and short stories, but you never managed to even finish a novel. How could you have published your breakout debut, The Parthenon, the very next year?”\n“What does when I began writing have to do with you? What are you trying to prove?”\n“Let’s go back to your composition process, shall we? For every one of your acclaimed novels, don’t you remember how the key plot points and wonderful twists seemed to just appear in your brain out of nowhere? Did you think you were communing with your muse? In reality, inspiration is also a sensory phenomenon. There’s a part of your brain, right here in the frontal lobe, which is the site of your sense of self and integrated cognition. That part is generally thought of as inviolable—not that we can’t get into it, but if we did, you’d become a patient in the psych ward. The rest of your brain, whether we’re talking about the sensory or motor cortices, or even the language center, can be stimulated with neural patterns from corresponding regions of other brains. We took Smith’s ideas and beamed the same patterns into your language center, where they triggered similar concepts. When the neural impulses were combined in the frontal lobe, your consciousness chooses to interpret the inspirations as your own.”\n“That’s impossible!” Charles was now screaming at her. “Those inspired strokes . . . they were mine! I stayed up late and got up early for them . . . that feeling of creativity . . . how . . . how can they belong to this Smith?”\n“In the future, there will no longer be any so-called ‘self,’” said Lisa. “That’s nothing more than an illusion created by a small cluster of decision neurons in the frontal lobe, but we, naively, thought of it as the soul that encompassed the senses, emotions, and all cognition. The livecasting age is going to tear away these illusions. You’re the pioneer of this brave new age, Charles, the apostle of a fresh epoch.”\nCharles was now curled up in a corner. A bout of hysterical laughter burst from him. “Oh, you’re a real comedian, aren’t you? You spend half the night ripping me apart and telling me that I’m a useless puppet, all my proud accomplishments nothing more than illusions. Yet now you call me an apostle?”\n“Reality is frequently painful,” said Lisa. “But you must press on down this path. Very soon you will come to understand that whether you’re a genius or a fool isn’t so important. What matters is who do you feel you are? Even if those ideas came from Jackson Smith, as long as you really felt that you came up with them, that was enough to satisfy your need to be creative, wasn’t it?\n“In our world, there are tens of millions who can feel that they are you, Charles, the Man. They couldn’t care less who they really are. Millions have become you, melding completely with you. You endow their meaningless lives with hope. Their ranks will continue to swell because no one can resist the temptation. As we improve and perfect the technology for translating and transmitting neural patterns, millions more—billions—will join the livecasting revolution, and they won’t be able to stop. In the not too distant future, I’m certain we can enable the transmission and reception of more complicated senses and emotions, or even fully formed thoughts. No one can predict how far the technology will ultimately develop, but this is surely the beginning of a true singularity. The traditional life of an individual will be swept away, replaced by a new world we have yet to imagine.”\n“But that’s not my ideal. I’ve always wanted everyone to become their true selves, to pursue their own values.”\n“No.” Lisa shook her head emphatically. “Even your most devoted fans, deep down, want to become you. Not many of them want to be themselves. This is human nature.”\n“All right,” Charles gritted his teeth. “Since everything about me is false, illusory, at least my beliefs are real. I won’t give that up. I will reveal everything you’ve told me to the world.”\nHe tried to turn on the livecast, but nothing happened.\n“Trust me, you don’t want to do that,” said Lisa. “We always have more than a dozen people monitoring everything you do. No matter where you are or when, as soon as you even say more than three words that we don’t like, we’ll activate our remote control and make you babble utter nonsense that will get you committed. Have you forgotten how you drove your girlfriend away?”\nCharles dropped his face into his hands and collapsed back to the floor. “If you’re so powerful, why not just take over my body and start pulling on the strings? You can then make me say what you want and dance to your tune.”\n“We don’t yet have that level of technology. The sensory cortices and the motor cortices are distinct, and the necessary inputs and computations to fully direct your limbs are complicated. It took almost everything we had to make you say those words to Homi just now, and you didn’t sound natural at all.”\n“It’s too bad that Homi didn’t notice these subtle differences. Otherwise she would have seen through your plot.”\n“Actually, I did.” The voice was clear and crisp, a voice that he never thought he’d hear again.\nCharles turned and saw the bright face of Hosokawa Homi.\n11.\n“Homi!?”\n“I’m back.” Homi nodded at the surprised Charles. “I really wanted to storm out and never return, but as a police officer, I’m trained to notice whether someone is speaking in a natural manner or not. I soon realized that something wasn’t right, and returned to confront you—at which point I noticed someone else was here. I’ve been listening for quite some time. Since I don’t have any implants in my brain, there’s not much they can do against me.”\n“Charles, you’ve got to make her shut up!” Lisa glanced at Homi and turned back to Charles, her tone turning anxious. “If you don’t want to lose everything you have, you must continue to collaborate with us. You’ll get to keep your fame and riches, and we can discuss reserving some measure of privacy for you—”\n“Collaborate?” Charles gritted his teeth so hard that the noise was audible. “Didn’t you just a second ago threaten to send me to the madhouse?”\n“Oh come on, Charles, you know perfectly well we’d never do that unless we had no other choice. We worked so hard to create you! We would never harm you if we . . . Look, I’m just trying to persuade you.”\nHomi turned to face Lisa. “You must free Charles and extract that devilish implant from his brain. I recorded the conversation between the two of you, and if anything happens to Charles, I will make sure the whole world hears about it. Even though you work for some powerful companies and people, I doubt they’re powerful enough to control the whole world. Public opinion will not be on your side. Imagine the panic when people realize that the implants they got for receiving livecasting could be used to control them—your whole industry would collapse overnight. Ms. Goldstone, you no longer have a hold over Charles.”\nLisa looked from Homi to Charles and gave a helpless smile. “I guess we’re in a stalemate then. If we do as you demand and take the implant out of Charles, we’ll be handing you all the cards. No one is that stupid. But if you do tell the media what we said, I guarantee you Charles will instantly become a babbling idiot. Ms. Hosokawa, I doubt you’d be willing to risk that.”\nThe three fell silent, but the tension in the air only grew thicker.\n“No matter what, you have to stop manipulating Charles,” said Homi after a while, her voice tinged with a conciliatory note.\n“Yes,” said Charles, whose voice was infused with pain. “I want you and those you represent to leave me alone, and get as far from me as possible.”\nA series of complicated expressions flitted across Lisa’s face before she spoke. “Let me be sure I understand your offer. We’ll stop interfering with you, and you’ll keep everything we talked about today under wraps. Do I have that right?”\nCharles nodded. All he wanted now was to wake up from this nightmare. “If you really let us go.”\n“But you’ll tumble from your successful perch and lose everything.”\nWearily, Charles shook his head. “I’ve never been successful at all. I’ve just been living a ridiculous fantasy. Now that I understand the truth, I want to end this farce as quickly as possible.”\nLisa looked at Homi, who mutely endorsed Charles’s words. Lisa nodded. “All right, we’ll do as you demand. But remember, whether you turn on the livecasting function or not, we’ll be watching your every move. Don’t think you can play some trick against us. You’re a smart boy, Charles, and you won’t make trouble for us, right?”\nSlowly, Charles nodded.\n“You better uphold your end of the bargain as well,” said Homi. “I will be storing multiple copies of the recording—if anything happens to us, you bet the whole web is going to be alerted.”\n“Goodbye, Charles, my old friend. I hope you don’t regret it.” Lisa turned around and swept by Homi as she left the room. Soon, the pair heard the noise of a small flying car’s engine coming to life outside.\nCharles remained curled up on the ground, unable to speak. Homi knelt by him and silently placed a hand against his cheek. Charles stared at her: her gaze was full of concern; her hand felt warm and soft; her scent was elegant, understated.\nHe knew that he had lost everything, but he had her. From now on, the two of them would live like just any other ordinary couple.\nCharles wrapped his arms around Homi and cried like he had never cried before. Homi lightly stroked the back of his head to comfort him. He squeezed his arms about her, so tightly that she had trouble breathing. But it was the only glint of hope in a dark sea of sorrow.\nBy the time Homi realized that Charles was squeezing her too tight, it was too late.\nSomehow, Charles managed to get on top of Homi, and with her body held down by his weight, he locked his hands like a pair of vice about her neck. He was trying to crush her windpipe with almost superhuman strength, and his eyes bulged as his throat made a series of croaking noises, as though it were he, and not she, who was being choked.\n“Let . . . go . . . please . . . ” Homi couldn’t even get the words out. She struggled and scratched at Charles’s arms with her nails, but Charles seemed to have become completely immune to pain, his eyes glazed over.\nHomi understood that it was the doing of Lisa Goldstone. She couldn’t afford to let them go. Her vision dimmed as her consciousness faded. Life was about to depart from her body, and all that Homi could do was to kick her feet instinctively in a last, desperate struggle for breath—\nAbruptly, Charles lowered his head and bit hard into his own wrist. Blood spurted from the wound, and his fingers loosened reflexively. Without thinking, Homi snapped his fingers off her neck and pushed him away. She rolled along the floor and scrambled to get as far away from him as possible.\nCharles got up on his unsteady legs, swaying from side to side. Then he tumbled back to the floor, his limbs jerking violently.\n“Run away . . . Run!” Charles’s voice, twisted almost beyond recognition, emerged from his bloody mouth. He was struggling mightily against the invisible forces that had possessed his body.\nHomi didn’t know what to do. Out of the corners of her eyes, she saw the hexagonal black box, and a flash of inspiration seized her. She dashed over to the box, lifted it over her head, and smashed it against the ground with a dull thud. The box rolled a few times on the floor and revealed a large crack in its side. Homi rushed up and gave it a few hard, well-placed kicks. A series of grinding and snapping noises emerged from the box, and smoke rose out of the crack.\nCharles was no longer moving. Like a deflated ball, he lay flat and gasped. Homi went over and helped him up. “It’s all right. I destroyed the neutrino converter. They can’t control you any longer.”\n“But we can’t leave this cabin either.” Charles’s voice was faint from weakness. “There are neutrino transmitters and converters everywhere.”\nAt Homi’s insistence, the cabin had contained only a single neutrino converter and the walls were built to shield electromagnetic waves from outside transmitters. But if they left this sanctuary, Lisa and her people would be able to take control of Charles at any moment.\n“Then . . . what can we do?”\n“Call the media,” said Charles. He closed his eyes in exhaustion. “We have to give a press conference now.”\nAn hour and a half later, the cabin was overflowing with reporters representing twenty-plus Japanese media outlets and almost as many foreign agencies. Curiosity filled the gazes roaming around the messy room and taking in the wounded Charles and Homi. As the reporters whispered to each other, most of the rumors being passed around involved some romantic dispute.\n“Good evening,” said Charles as he got up from the sofa. “I’ve asked you to come tonight because—”\nThe reporters hung on every word, but Charles had stopped speaking. His eyes were focused on something above and behind the crowd of reporters as his lips fluttered subtly, as though he was speaking to some invisible being.\n“Charles!” Homi realized that something was wrong and turned to the reporters. “We are about to tell you something that—”\n“—something that is very important,” said Charles. He seemed to have recovered, though his face was even more weary than before. “I’ve decided to join the Plutonian Grand Race next month.”\n“What?” Homi was shocked. The Plutonian Grand Race was a gimmick, and a successful aviator like Charles wasn’t expected to participate at all. Just a few days ago, in response to an interview question, Charles had made it clear that he wasn’t interested.\nCharles continued. “As everyone knows, this race will take place on the longest course in human history, far surpassing the Circumsolar Grand Race conducted along Earth’s orbit. Although this is the first time the race is being held, it will no doubt be deemed a landmark achievement in racers’ careers one day. I’ve heard that not many racers have signed up, and so I guess if I want to be the champion, this is my best chance.”\nA few in the audience guffawed. Homi saw that Charles’s manner seemed quite natural and not under someone else’s control. She held her tongue despite the impulse to interrupt.\nCharles looked around the room, and when he spoke again, his tone changed. “But since Pluto is about thirty AU from Earth at the present time, the entire race will take place over the course of two years. Limited by the speed of light and signal decay, I don’t think it’s possible to livecast during this time. I’m sorry.”\nA few of the reporters grumbled and protested. Apparently some of them were fans.\n“What about Miss Hosokawa?” someone asked. “Are you going to be separated for two years?”\nCharles held Homi by the hand and squeezed her palm meaningfully. “I don’t believe two years will prove to be much of a barrier between us. I will carve her name into the million-year ice crust of Pluto.”\n“What was that about?” asked Homi. The reporters had all left.\nA drained Charles massaged his temples. “One of the reporters was carrying a portable neutrino converter with him, and that allowed them to send a message to me via the visual texting window in my cranial implant.”\n“Did they threaten you again?”\nCharles shook his head. “Worse. They threatened all of humanity.”\n“What?”\nCharles recalled that silent conversation:\n- Remember, at least a billion people have already had the implant, and their lives are now in your hands. If you insist on telling the truth, we may not be able to control everyone, but we certainly can beam a series of chaotic signals to all implanted subjects within a few minutes. Most will at least suffer temporary psychosis, and some may become deranged permanently. Who knows how many accidents will occur as a result, and maybe a few choice subjects will push the buttons for launching nuclear missiles . . . The world will be turned upside down in a catastrophe that will make a world war seem like child’s play. Earth would be sent back to the Stone Age in a matter of days.\n- And so I have no choice but to shut up, is that it? I have to stand by and watch as you continue to push your devilish implant until everyone has become a slave who has lost all sense of self. I should just wait until you control the whole world and are no longer afraid of anything?\n- This is the inevitable progress of history. We will either keep on going down this path until we reach a brand new future, or a war will lead to the deaths of hundreds of millions and civilization’s complete collapse. The choice is yours, Charles.\n- What choice do I have when you have a billion hostages?\n- You did make the right choice, which is why you managed to change your speech to the reporters in time and avert a disaster. The idea of going to Pluto is not bad: this way, we can avoid direct conflict with each other, and you can stop worrying about another plot from us. By the time you return two years from now, you will no longer be the focus of the world’s attention, and you can live as you like.\n- And I will finally accomplish something that belongs entirely to me. I will prove that I’m no puppet, but the invincible Charles.\n“Charles, what’s wrong?” Homi’s words pulled him back to the present.\n“Nothing.” Charles pulled her to him and caressed her long hair. “Everything will be all right. I promise.”\n12.\nAn unprecedented three hundred million people tuned into Charles’s final livecast. Three hundred million pairs of eyes accompanied Charles’s strides into the launch facility and then turned to regard the writhing sea of people as well as the azure sky overhead.\nThe launch complex was located in Tanegashima, Kagoshima Prefecture, JAXA’s traditional home. Twenty-four spacecraft of different designs were clustered near the center of the complex. Unlike ancient spaceships, however, these new spacecraft no longer needed massive gantries and launch towers. Advancing technology meant that these ships could be launched anywhere from the surface of the Earth, and the choice of departing from here was mainly symbolic.\nThough many advances had already been made, manned space exploration was still in its beginning stages. The space race today wasn’t aimed at the moon or Mars, but at Pluto, a celestial body billions of kilometers away whose surface bore no trace of human exploration except a few robotic probes. The entire race would take more than two years.\nAfter the participating spacecraft left Earth, each was supposed to make use of solar sails or planetary gravity assists to accelerate and head for Pluto on its own. Once there, they were supposed to close their solar sails and use the remaining fuel for the return trip. Though the astronautic principles were simple, the journey, traversing the entire Solar System and measured in tens of billions of kilometers, was breathtakingly bold.\nTo be the first human being to set foot on Pluto would be a milestone in the history of the exploration of the Solar System. As Pluto was not deemed scientifically as significant as the major planets—of which it was no longer a member in any event—no government bothered to devise manned missions to it after sending a few probes. But as it was such a famous place, many civilian space enthusiasts made it their dream destination. During a span of a few decades, about eight manned spaceships had been launched toward Pluto, but most had to abandon the journey partway through due to the many difficulties encountered. A few were destroyed by micrometeoroids in the asteroid belt, and some vanished in deep space without a trace. The reputation of Pluto as a planet of death grew, and in recent years no more missions to Pluto had been launched. This Grand Race, however, had rekindled the enthusiasm of explorers for the conquest of Pluto.\nThe addition of Charles Mann to the roster of entrants raised the profile of the race further. Although many complained of not being able to tune into Charles’s livecast for the duration, his steadfast courage moved the hearts of millions. The number of entrants doubled almost overnight to more than twenty, and all were among the ranks of elite aviators and astronauts. The Grand Race was now truly grand.\n“Charles!” A familiar voice broke through the background noise of the crowd. He turned to see the approaching figure of his old rival, George Steele.\nCharles grinned. “George, I have to thank you for being so willing to play the part of my runner-up every time.”\nGeorge rolled his eyes. “Let me tell you something, playboy: you’d better be prepared to congratulate me this time.”\n“Why’s that?” Charles asked, and the two headed for the cluster of spacecraft at the center of the complex shoulder by shoulder.\n“I heard that you turned down the high-tech gear donated by Cartel Nanotech and the Douglas Group. Instead, you bought off-the-shelf equipment from a couple of no-name manufacturers. Is it true that you even designed the basic layout for your ship and assembled it yourself? You’re too arrogant. Cartel’s solar sail technology is unparalleled, and using the same mass, they can achieve an effective area one-third greater than competitors. Surely you must know what this means.”\n“I do. But Steele, I used to rely too much on technology. This time, I want to win by skill,” Charles said earnestly.\n“Then it’s true that you’ve reduced the habitable space to the minimum in order to cut down the mass and increase speed?” The shocked look in Steele’s eyes was tinged with respect. “I know you’ve kept all your plans secret, but I’ve studied the publicly available information on your ship’s design in detail. My conclusion is that if you really intend to win, your habitable module must be about the size of a coffin. You won’t have space for any entertainment or relaxation facilities in that cage. How can you live like an anchorite for two years? It’s so unlike you!”\n“To achieve our destiny of flying toward the end of the stars,” Charles said. “If necessary, I believe you would do the same.”\nSteele nodded. “Charles, I have to admit, you’re not at all what I expected. All right, for the next two years, we’ll have plenty of opportunities to chat by radio. Maybe we’ll become friends.”\nConversing like two close companions, the pair reached the center of the complex and separated, heading for their respective ships, where they carried out the final inspections and preparations. Many pilots were saying farewell to their families and friends. As Charles checked his engine, a curvy, elegant feminine figure approached him.\n“Masa-chan?” He stood up.\n“Charles, I came to see you off.”\n“Thank you.”\n“No, I should be thanking you . . . actually, I came to apologize as well.”\n“Apologize?”\nAoi Masa took a deep breath. “Two years ago, I was just an average AV idol whose career was in its twilight. Thus, I orchestrated that ‘chance’ meeting between us at the Maldives. I seduced you and spent the night with you. The world got to know me through your livecast, and I became a renowned sex goddess. Thereafter, I managed to leverage my fame into a career as a mainstream actress, and just recently I took a role in a Hollywood production. My success is all because of you.”\n“Don’t say that. Your achievements are the results of your hard work.”\n“But all those sweet words I whispered to you . . . they weren’t real. I used you to climb up the ladder. I’m sorry.”\n“That’s . . . look, Masa, life is like that. We are often forced to play roles, and sometimes we are so absorbed by the performance that we disappear into our characters. You don’t need to apologize for what you did.”\n“Thanks for saying that.” Masa took out a refined cloth packet. “You’re a good friend, Charles, and I really did enjoy our time together. I sincerely wish you a victory in this race. I went to the Meiji Shrine to get this omamori for you. If you wear it, the spirits will protect you.”\nCharles locked gazes with her and accepted the charm. “Thank you. I will keep it with me.”\n“Goodbye, and good luck!” She gave him a light hug and turned to leave.\nA complicated smile curved up the corners of Charles’s mouth as he watched her departing figure. He was aware that Aoi Masa had just managed to squeeze the last bit of use out of him. That the “love” between him and her had just been a performance was not only clear to both of them, but also to every subscriber to his livecast. This final speech from Masa was no doubt calculated to further rehabilitate her image as she transitioned to a mainstream career: now everyone would think she was a woman of deep and true passions.\nYet . . . this didn’t mean that Masa was a lying hypocrite. That the speech was prepared and calculated didn’t mean that it wasn’t also sincere. All the world’s a stage, and all of us mere players—always have been, and even more so in the livecasting age. Maybe our heartfelt honesty is nothing more than a heartfelt performance of the self.\n“Oh, Charles!” Masa suddenly halted and turned to him. “Where’s Miss Hosokawa? I was hoping to see her.”\n“She’s . . . not feeling well,” Charles said.\n“Ah.” Masa gave him an understanding look, and a triumphant look flitted through her eyes, though she said nothing more. Charles knew that Masa had always been slightly miffed that Homi managed to “steal him away” from her. She must now be thinking that the relationship between Charles and Homi had soured.\nBut Homi didn’t need to be here to bid farewell to him, and she shouldn’t be. She was hiding in an absolutely secure location, holding onto crucial evidence to prevent Lisa and her people from plotting against them at this critical moment and killing them both simultaneously. After he left Earth, Lisa would no longer have the ability to control him through the cranial implant, and Homi would maintain contact with him every day. If anything were to happen to Homi, he would reveal the truth through radio broadcast. After much thinking, this seemed the best plan available to them.\nCharles watched the joyous crowd in the distance. Maybe this is the last time I’ll be at the center of the stage. Steele is very likely right. This time, my ship holds no technical advantage. I have no hope of victory and will be forgotten by the world as a failure.\nBut what of it? It has been my dream to go to the stars, to head for the most distant planet. Being the champion isn’t everything. Indeed, the only true dreams are those that you’re willing to sacrifice a great deal for.\nThis is my last chance to be myself. What I’ve lost in the noise and glitz of this planet, I will recover in the infinite expanse of space. Only there will I find true peace and salvation . . .\nThe final countdown was about to begin. A few dozen lucky audience members came into the launch complex to take pictures with the racers. Most chose to have their pictures taken with Charles first, and a smiling Charles obliged. He also signed their books or t-shirts. The last person to come to him was a plain looking and plainly dressed young woman, whose gestures betrayed nervousness.\n“How . . . how do you do, Mr. Charles,” the young woman said.\n“Hello! What’s your name?”\n“I’m Asakura Minami.”\nCharles nodded without reaction. But behind his thoughts, another consciousness was suddenly jerked awake. What is she doing here? When did she . . . become a fan of Charles?\n“Ms. Asakura, a pleasure to meet you. Would you like a picture with me?”\n“Yes, absolutely.” Minami stood next to him for the photo. But she lingered even after the picture. A few launch facility staff came to bring her away, but Charles gestured for them to back off.\n“What else can I do for you?”\n“I’m sorry, Mr. Charles.” Minami bowed to him deeply. Blushing, she said, “I’d like to ask for your help with something.”\n“As long as it’s not illegal, I’m at your service.”\nMinami fidgeted for a while before lifting her head. Gazing straight into Charles’s eyes, she said, “Watashi . . . watashi wa Naoto-kun no koto o daisuki yo.”\nCharles had no idea what she said, but another consciousness did. He understood why Minami had traveled for so long and stood in line for hours. She wasn’t here for Charles at all; she just wanted to tell him a single sentence.\n“I . . . I like Naoto-kun very much.”\nBefore Charles could react, she took two steps forward, wrapped her arms around his neck, stood on her tiptoes, and kissed him. Naoto could feel how soft and supple her lips were, laden with the scent of summer sunlight and youth.\n“Naoto,” Minami whispered into Charles’s ear, “I’m right next to you, but can you only feel my presence through the body of a man thousands of kilometers away?”\nSecurity personnel rushed up to drag Minami away, but Charles had already figured out the truth. He gestured for them to stop and looked at Minami. “Ms. Asakura, I believe the person you love will understand.”\nThen, he spoke to Naoto, a stranger he had never met, “You lucky bastard, don’t miss out on the joy right next door.”\nNaoto didn’t know when he had left the livecast. Staring at the stained ceiling, he felt tears fill his eyes and then overflow the corners to spill down his cheeks.\nAfter subscribing to Charles’s livecast for so many years, he had enjoyed the pleasures of romancing countless beautiful women. But deep in his heart, he knew that they had nothing to do with him; they were there for the charismatic Charles. He preferred to forget the truth so that he could be fully immersed in the happiness that was being Charles.\nBut today, in this last livecast of his three years of living as Charles, everything had turned upside down. That sentence and that kiss were for him, Takumi Naoto, not Charles.\nHe wasn’t Charles and he never would be. But he could be himself, possessing a joy that was common but not commonplace, measured but not mean. Indeed, some portion of it was unachievable even by Charles.\nNaoto sat up, his head throbbing. He had lived his last day in self-imposed numbness. Charles’s livecast was over. Even if he returned from Pluto, he would probably not resume casting. Naoto was going to find a new life, find his own happiness.\nNaoto made his decision. He dialed. After a few rings, the other end finally picked up. “Moshi moshi, this is Asakura.” Her voice was tense, expectant.\nBefore he could say a word, Naoto’s ears were filled with the rumbling of engines and the wild cheers of a crowd. Naoto glanced at his computer screen and saw the spaceships taking off from the launch complex, trailing long columns of smoke behind them like a flock of migrating wild geese. Charles had departed for space, and this time, Naoto couldn’t and didn’t want to attach himself to Charles’s soul. He had more important things in mind.\nHe took a deep breath and spoke with a trembling voice. “Minami-chan, I like you. I would like to see you.”\nGoodbye, Charles.\nEpilogue\nOne year later.\nA cobalt blue spaceship closed its solar sail and activated the landing thrusters to slowly descend toward the planetary surface shrouded in darkness below. The flight was steady and stable; all status indicators nominal. A human was about to set foot on Pluto for the first time in history.\nBut when the ship was still about two kilometers from the surface, it began to accelerate in an odd manner. Spinning, it plunged toward the thick icy crust of the planet of death. A few seconds later, a faint explosion bloomed on Pluto like a match lit for a moment in the long night. And then, the eternal void.\nThe image was taken by the Chinese exploratory probe Mamian. About five hours later, the image data arrived at Earth, bringing with it the sad news at the edge of the Solar System. For forty hours afterward, all attempts at re-establishing communication failed. Two days later, a second racer, George Steele, successfully landed on Pluto and discovered the wreckage of the first spaceship as well as the carbonized remains of Charles Mann.\nBack on Earth, grief united everyone. The mainstream explanation for Charles’s death was a technical malfunction. Charles had put together his ship by himself, and there were no doubt latent defects. Experts debated the exact nature of the accident: some argued that it was a programming bug; others pointed to the engine; still others said that it was because the buttons and dials on the control panel were too densely clustered, leading to an operator error when Charles was under pressure.\nSome subscribed to the belief that Charles had committed suicide. They scoured Charles’s final recordings before his departure for odd statements and behaviors to support their theory that Charles was tired of life. Falling to the surface of Pluto was a genius bit of performance art. They specifically pointed to his strange demeanor during the last press conference he held at which he announced the intent to join the Plutonian Grand Race.\nOthers argued that Charles had been murdered. This was the most outrageous of the conspiracy theories. A long list of suspects was constructed: George Steele, his rival and competitor; Aoi Masa, his ex-lover; the Douglas Group; Bell Labs . . . One particular bit of evidence this group pointed to was the fact that Charles’s girlfriend, Hosokawa Homi, died on the third day after Charles’s own death in an explosion as her air car struck another head-on above Tokyo. This “coincidence” could certainly be viewed as evidence of conspiracy, but a more logical and simpler explanation was that she had been distracted in her driving by grief.\nAll sorts of rumors and so-called “evidence” emerged on the web. Most were easily proved to be hoaxes, but a few pieces resisted debunking. There was an audio recording that seemed to be an argument between Charles and Lisa Goldstone; a video that appeared to capture an affair between Charles and the wife of a celebrity; a phone call from Charles’s father that claimed that his son was a spendthrift who had lost all his money . . . but none of these were hard to fake, and it was impossible to prove that any of them was directly connected to the death of Charles. Finally, there were even some nuts who claimed that Charles had been killed because he discovered a secret mind-control conspiracy by the megacorps behind the cranial implants. No one took them seriously.\nIn any case, it was incontrovertible that Charles was dead. A dead man, no matter how famous, was very quickly forgotten. For a month or so, there were all sorts of memorials and tributes to the memory of Charles. But soon, a few hot new livecasting stars emerged: prodigies, hot girls, self-taught innovators. Most of Charles’s fans immersed themselves in newer, richer entertainment.\nBut many didn’t know what to do with themselves. They couldn’t understand Charles’s death.\n“I . . . I just can’t figure it out,” Naoto muttered. He poured himself a beer. “How can he be dead? For three years, I knew every gesture he made. I have almost every memory he had. If I’m alive, how can he be dead?”\n“You are you; Charles is Charles.” Minami said, her voice cold. She was running out of patience with Naoto.\nNaoto shook his head. “You don’t get it at all. That feeling . . . I can recall literally everything about Charles: the way he climbed and dove through clouds in his aerial acrobatics; the way he wove through coral reefs and shoals of fish as he scuba dived; the way he spoke to readers at his signings as though he knew each and every one of them; the way he dropped bon mots and commanded everyone’s attention at parties; the way he inspired global compassion as he worked with refugees . . . for me, all these memories are as fresh as though they happened only yesterday. I see the spinning Earth far below me; I hear the music wafting from Wiener Musikverein, I smell the scent of cherry blossoms at the foot of Mount Fuji, I . . . ” Somewhere along the way, he had shifted from the third person to first.\n“Do you also remember those long nights with Masa, Paula, and Mariana?” Minami asked, her expression darkening.\nUnaware of the danger, Naoto nodded distractedly. “Of course I do. Those were utterly unforgettable experiences. It’s too bad I have no memories of being with Hosokawa Homi—”\n“Damn you, Takumi Naoto!” Minami could not take it anymore. “Are you going to spend the rest of your life imagining you’re Charles?”\n“Minami-chan, what’s wrong?” Naoto was genuinely confused.\n“Charles Mann has been dead for more than six months! But every day, you just talk to yourself about all these memories that have nothing to do with you and these women who have no idea who you are. You don’t even hear me anymore. I’m going crazy, I swear!”\n“You don’t understand! I was there for all these memories. There is absolutely no distinction between them and memories that I formed while I was in this body. I know that I’m not Charles, but these were also a part of my own experiences.”\n“Oh come on!” Minami was so angry that she started to laugh. “Your experience consists of lying on your tatami mat and receiving a livecast. How are you different from those idiots who watch some TV show and then imagine themselves as the hero?”\n“Shut up!” Now it was Naoto who could not take it anymore. “You are always criticizing me. But you’ve never even tuned into a livecast. How can you possibly know what it feels like? Who died and made you judge of my life? You have no right to tell me what to do.”\n“I have no right?” Minami’s eyes flashed. “Oh that’s right. I’m nothing. I think we should stop seeing each other.”\n“Fine!” Naoto shouted. “I should never have agreed to your pleas.”\nMinami stopped arguing with him. Quietly, she began packing up her clothes and possessions. As Naoto watched her, pangs of regret gnawed at him, but he just couldn’t bring himself to apologize. Only when Minami stood at the door, a few suitcases at her feet, did he finally panic. “What are you doing? It’s the middle of the night. Why don’t you wait at least until morning? We should—”\n“Naoto”—the calm manner in which Minami was talking terrified him—“I once thought I could change you, but I was wrong. You’re probably right: you are indeed Charles, and you will live forever in his memories. But I’m sorry I can’t be here with you. That’s not a life I want.”\n“I . . . I don’t . . . ” Naoto didn’t know what to say. He stood by and watched as Minami opened the door and went out. He listened as her footsteps grew fainter and fainter, and eventually, vanished.\nAfter some hesitation, Naoto dialed Minami’s number. But Minami had turned off her phone, and there was no answer.\n“Fuck it.” Naoto let out a few more curses, fell back into his chair, and continued to drink his beer.\nWhy is my life always like this? Why can’t I ever get along with anyone? No matter how many times I try, I’m met by failure after failure. In this “real world,” even the very air is stifling. If I could only return to the body of Charles and live that spirited life once more . . .\nAs he continued to daydream, Naoto carelessly tapped on his keyboard. He signed on to a discussion forum for livecasting, and the large-font text at the top instantly grabbed his attention.\nCHARLES MANN REVIVED!!!\nWhat in the world?\nNaoto clicked on the link and found himself staring at an ad from Time Media.\nIn order to pay tribute to the heroic Charles Mann, we have purchased the rights to the entire archive of his livecast for the delectation of our subscribers. The entire livecast stream is 85,439 hours long, encompassing about ten years of his life. You may jump to review any particular segment or play it from end to end in order to gain a deeper understanding of this amazing life . . .\nNaoto’s heart began to leap wildly. Ten years of livecasting data! As a subscriber to Charles’s stream, he had been prevented by technical means from recording the sensory signals, but of course the company that handled the livecast would have a proper archive to permit re-livecasting. Since Naoto had tuned in only during the last three years of Charles’s life, he had never lived the first seven years of the livecast. But now . . .\nNaoto sucked in his breath. He was going to possess the entire ten years, the best part of Charles’s life. He was being given a chance to once again meld into Charles, and to anticipate an exciting life in a bright new future (even if it had happened in the past). And this time, he would no longer have to worry about anyone cutting him off for at least ten years. He could confidently lose himself as deeply in Charles as he liked.\nOf course, this time the subscription was no longer free, but the price they were charging was reasonable: only 100 yen an hour. If he purchased more than a day’s worth of data, the price was discounted to 50 yen per hour. If he purchased the entire archive at once, the price was further reduced to 20 yen per hour. This was eminently affordable.\nQuickly, he connected his bank account. The entire archive would cost him almost 1.6 million yen. He didn’t have that much in savings, so he decided to pay over two hundred thousand yen for the rights to the first year’s archives. He would have to earn more to pay for the rest later.\nHe lay back on his tatami mat and switched on the neutrino converter. The computer voice informed him that the connection was being established, and the data stream was being buffered. The livecast, no, the re-livecast, would begin in about one minute.\nAs Naoto waited anxiously, his phone rang, informing him there was a voice message from Minami. Naoto quickly switched off his phone. Perhaps Minami had changed her mind about the break-up, but it was too late now. As long as he could be Charles again, why would he need a woman like Minami?\nThe neutrino beam was converted into electromagnetic waves, and then, into brainwaves. The re-livecast began:\nVestibular systems synchronized: I am lying down somewhere; tactile sensations synchronized: I think this is a bed, rather soft and comfortable; olfactory sensations synchronized: it smells medicinal, like a hospital, but not too overwhelming; hearing synchronized: a woman is speaking to me, her voice gradually becoming clearer; sight synchronized: a blurry figure looms before my eyes . . .\nHe is gazing up at the ceiling, and his future manager, Lisa Goldstone, is bending down to speak to him. “How do you feel?”\n“I’m all right,” he says, his voice sounding a bit weak. “I think.”\n“We’re about to start the livecast now. Do you remember who you are?”\nA confident smile appears over his pasty face. “What kind of question is that? I’m Charles, the one and only Charles.”\nFootnote\n1 - All East Asian names are rendered with surname first in this translation, following the custom of the region.\nOriginally published in Chinese in Science Fiction World, September 2014.\nTranslated and published in partnership with Storycom.\nBaoshu is a science fiction and fantasy writer. He has published five novels and dozens of shorter works since 2010, including Three Body X: Redemption of Time, Ruins of Time (winner of the 2014 Chinese Nebula Award for Best Novel), Seven States of the Galaxy: Phantom From an Ancient Empire, and \"Everybody Loves Charles\" (winner of the 2015 Galaxy Award for Best Novella). He lives in Xi'an, China.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts."}