{"fingerprint": "m3B2nPFGaugNaQBOKt2F8g9EYaw=", "sitename": "Clarkesworld Magazine", "title": "Bringing Down the Sky by Alan Bao", "author": "Alan Bao", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bao_12_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bringing Down the Sky by Alan Bao", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11590 words, novelette\nBringing Down the Sky\nBoy\nThe wind howls over Big Sky Ridge.\nFlecks of sour rain fall from the sky, and we waste no time putting on our breathers to ward off the stinging droplets. We look for smog sign—up, down—valley and sky. The sky-smog is always the trickiest to manage—especially on wet days, when the moisture brings it lower towards the peaks. If we start imploding at the wrong turn of the wind, it could mean wasting an entire expedition’s worth of sky.\nOld man Li watches the swirling mists and sniffs the air. When he gives the go-ahead, we switch on the L-boxes. The machine booms its defiance against the clouds. I take the chance to stretch out my back, while Fong and Xiaoling take turns lifting up their breathers and spitting off the edge of the cliff. We started our trek before dawn, and it will be nightfall by the time we get back.\nThe valley-smog lies dark and still below us.\nWe return to the city in the dark. The highway we walk is silent except for our footsteps and the occasional passing bicycle. A faded road sign overhead proclaims the city’s name—Xin Xi’an, to the schoolbooks—Xiao Hui Cheng, the Little Gray City, to those of us who live here. The city splays on the plateau like a dried-out husk, its boom years long forgotten, shanties and dead street lamps creeping half-heartedly up the mountainside. Aside from old man Li, none of us can remember a time when petrol-cars drove on these wide, empty streets.\nWe squirrel through skeletal alleyways, spines creaking against the weight of the canisters on our backs. The pitter-patter of little feet greets us as we come to the edge of the migrants’ quarters.\n“Foreigners!” Jinjin flies squealing out of the night. “Did you hear? There are foreigners at the shop!”\n“Yeah right, you little fibber.”\nFong hustles him out of the way. Foreigners do not come to Xiao Hui Cheng. The few who do stay at the city center, or are driven up by mule-cart into one of the bureaucrat lodges where they do business. The city is about as far as you can get from a tourist attraction, and Dhampa’s street is by far one of the dirtiest neighborhoods in town.\n“Nuh-uh. I saw them. Even Dhampa said so. Did you know they live inside domes and make their own air?”\nJinjin places himself between me and Fong and tugs on our arms as we walk.\n“And nobody wears a breather, even during the summer!”\nWe round the corner, past the crumbling brickwork of the old roti shop, until we come to the peeling aluminum eaves where old Mama Liu waves us in.\n“And their cities are so full of light that it’s like daytime, even at night!”\nWe drop off our canisters at the shop window. Jinjin dances around as we pull out the cricks in our backs. Mama Liu shoos him away and ushers us inside.\n“Stew’s in the pot. One bowl of rice each. Don’t get greedy, Fong.”\nFong pulls a face. We find a spot among the other troupes in the mess hall and tiredly suck down our stew. Jinjin casts furtive glances at Dhampa, chatting with two pale-skinned foreigners over his countertop.\n“Ask them.” Jinjin whispers, peeking over the table with bashful eyes. “Ask them about the fans and the domes!”\nFong looks up from his stew.\n“Hey, laowai!”\nThe fat foreigner looks up with surprise on his face. The other glares at us. Fong ploughs on: “Is it true that you build giant fans to blow away smog from your cities?”\nDhampa growls our way.\n“Shut it, Fong. Don’t you go starting anything.”\n“Hey, I’m just asking—”\n“It’s all right, it’s fine,” the first foreigner says in a rolling accent, a smile over his friendly face. “Yes, we do have climate control programs in America—but nothing as crude as giant fans!” He laughs. “Where I’m from, microclimate domes are the way of the future.”\n“See, see! I told you they live in domes!” Jinjin squeals.\nDhampa harrumphs and taps his liquor glass impatiently.\n“ . . . I was saying, white man—all my sky goes out to channels in Beijing and Shanghai. Only rich people in big cities can afford to pay for imported air. It’s always been a cutthroat business, and now that big companies like Xintian are elbowing their way in . . . ”\nHe let the sentence hang. Fong returns to his stew, spooning it into his rice and slurping it down.\n“And anyway, what about planes? You must still have a few somewhere. Why not just write to the government and fly your planes up there?”\nThe fat foreigner shakes his head.\n“Transportation is a balancing act these days. Michael Fineman wrote a wonderful book on the subject—it’s the economic hairsplitting between the value of the load and the cost of oil. Only low-mass, high-value payloads get any time in the air these days—so a speculative venture like ours . . . ”\n“So even you foreigners are feeling it now, huh? Times sure have changed.”\nThe flabby foreigner nods his agreement. “Do you know, they used to fly people around commercially, back in the day? Everyday folks like you and me, eh? Fineman says in his book . . . ”\nThe rest of his sentence trail into unintelligible technobabble. But Dhampa seems to understand well enough, and engages the foreigner in deeper conversation. After a while, he looks up from the table and waves me over, as if having an afterthought:\n“Hey, boy, didn’t your father used to teach you English?”\nAfter dinner, Fong and the others head out to the shop front to play dice, while I take my turn at cleaning duty with Mama Liu. I toss the night’s wash-gunk into the ditch lining the alley, where it oozes to the pits like thick congee. The bones go to the strays. Stephan (the talkative foreigner) watches me as I clean.\n“You know, I’m surprised you’re not wearing a breather right now,” he says through the silver mask on his face. “Untreated air just kills my throat.”\nHe speaks in Mandarin, for my benefit. I try my best to return the courtesy.\n“We’re used to it. We’re high enough up here that the black smog only comes around in summer. There are people in the lowlands who have to keep their breathers on all the time, even when they sleep.”\nI scrape the last bit of grit from the pots with a moistened cloth and head back to the kitchen. Stephan shadows me uncomfortably close, asking questions like a child might. What is the weather usually like here? How much money do we make each day? How many troupes work out of the shop?\n“What about other foreigners? Your landlord was talking about other sky-running companies moving into town—are they all domestic Chinese, or . . . ?”\nI shrug.\n“I don’t know about foreigners, but we have a doctors’ charity from Shanghai that visits us sometimes . . . ”\n“Zhang and his do-gooders,” Dhampa and the other American saunter into the room, shooing me away. Stephan sits up and nods their way.\n“Where’d you get off to, Wes?”\n“Washroom,” says the one called Wes. I’m shocked by the disgust and hostility in his voice. Dhampa winks at me and engages Stephan in rumbling English again, leaving me in the company of the sulking foreigner.\n“Hey kid. You understand what I’m saying? I’ll give you an American dollar if you fetch me a drink.”\nDhampa looks up.\n“We’re not a bank. It’s forty yuan for the drink.”\nThe one called Wes shrugs. He puts his money on the table and tosses me a coin.\n“Name’s Wesley, by the way.”\nI extend my hand, the way my father had taught me.\n“It is good to meet you, Wesley.”\n“Yeah, yeah. You were talking to my friend Stephan back there?”\nI nod.\n“Well, he is what we in America call a pontificating cunt.”\nI do not understand the words, and Wesley does not stop to explain what he means.\nWesley\nWe start our trek before dawn. The local boy tells me it’ll be dark before we get back again.\nEverything in my body hurts.\nLook: it wasn’t supposed to be difficult. Just go in, get the lay of the business, pay off a few officials, and establish the contacts needed to circumvent the usual routes of imported air. Cut, dry, fucking simple. We’d talked about it beforehand. Normal business ethics didn’t apply here. Here, the bureaucrats dealt in guanxi—personal connections—and the line between good networking and corruption didn’t exist. We’d gone through the wringer just to get here, landing in Manila on a company cargo plane (the pilot complaining bitterly about the extra poundage), then hopping a nuke-barge to Shanghai, where we boarded the ancient Qinghai line among a crush of bodies and breather-masks. The Chinese had clearly neglected to modernize their rails when they made the switch to electric: the train could barely break 50 km, the way stations were glorified shacks, and when you opened your eyes in the 8-beds-per-cabin bunks, you felt like you’d woken up in a coffin.\nSometimes, I wonder where Stephan got off being such a moralizing ass. A sour meeting and a pissed-off bureaucrat later, we were not only on the outs in business talks, but had our accommodations at the guest lodge revoked.\nWhen we get back stateside, there’s going to be a few bitter words to be had between us.\n“Did you and Stephan have good rest last night?”\nOur boy-guide treks ahead on the mountain, hauling a disproportionate pack of canisters on his back. He’s making brisk conversation even as I struggle to keep up. The rest of the troupe has already disappeared into the mist. Stephan lags behind on the mountainside.\n“Oh yeah, terrific,” I gasp. The sarcasm’s mostly lost on the kid. The bunk we slept on was so small that you couldn’t lie down flat. The sheets smelled like straw and stale sweat. Taking a shit was a nightmare—your balls shriveled up from the cold, and you could physically see your body heat leaking away in steam as you squatted over that outhouse hole. My nose clogged up fast as hell—a blessing and a curse, since I couldn’t smell the stink of human feces, but instead had to gulp the fetid air with my mouth.\n“At least it’s winter. No flies!” The landlord Dhampa had chuckled at me when I finished my business. I’d cleaned my shivering hands in a trough of still water as the gremlin walked off chortling.\n“Yeah,” I sigh at the swirling mists above. “We’re just short a space heater and a flushing toilet for maximum livability, but we’ll make do.”\nThe boy looks back and smiles politely. I get the feeling that maybe he’s never even seen a flushing toilet before. Christ. I’ve lived in my share of shitholes back in my college days—leaky plumbing and insta-ramen and rats in the floorboards—New York living at its finest, you know—but this takes me to a whole new level. I think back to the fetid outhouse, and am doubly thankful that I had at least brought my own tissues, and didn’t have to use the scrap paper that the locals used to wipe.\nThe boy stops at an outcrop, waiting for us to catch up.\n“We are quarter of the way up, now,” he gestures at the horizon. “The sun is rising.”\nWe wait as Stephan hacks his way up the hill toward us. Our guide tries to engage me in conversation, falling into Mandarin and onomatopoeia when his vocabulary fails him. Considering his background, his English is quite good—but there’s room enough for misunderstandings. Mispronounced words and overemphasized consonants. Weh-suh-lee. Suh-teh-fan.\n“Stephan Anderson. The fat one.” I point at Stephan and then at myself. “Wesley Hughes.”\n“Weh-suh-lee Hew-seh.”\nThe sun breaks over the mountains just as Stephan heaves up to us, retching as he tries to catch breath. I run a hand along my stomach—flatter and more well-toned than Stephan’s (I gym), but probably not as fat-starved as our boy-guide’s. The light washes across the mountaintops, painting the plains below an orange hue that makes the entire landscape look like effervescent fire. Even through the nausea in my stomach and the headache in my skull—the early fingers of altitude sickness—I feel awed and exhilarated.\nStephan ruins the moment by moaning pathetically and collapsing into the snow. I fight down the urge to smack him across the skull.\n“Oh, get up, you wuss. Could you get any softer?”\nI wave our boy guide towards us.\n“How much farther from the summit?”\nThe boy shakes his head.\n“We don’t go to the summit. It takes us too close to sky-smog.” He points upwards past the swirling mist. “We go there—Big Sky Ridge. Old man Li found it, most troupes don’t know it. It is a reasonable climb, and you can get very clean sky up there.”\nThe mountain stretches precipitously in front of us. Following the boy’s finger with my gaze, I begin to have serious doubts over his understanding of the word “reasonable.”\nIt’s late afternoon by the time we stop and bring out the L-box. The boy tells us that we haven’t yet reached Big Sky Ridge, but at our pace, the path would’ve taken us back to the city after midnight. Stephan wheezes to himself in the distance, and I throw a couple of pastry-themed insults at him. Meanwhile, a tendon in my foot seemed determined to curl in on itself like a snake eating its own tail.\n“Foreigners shouldn’t climb the paths after dark. It is easy to fall.”\nHe unhooks the Leibenstein apparatus from his back, hands dancing around the tangle with practiced speed. I wipe down the goggles on my breather, my thumb coming away black and sticky. Behind me, the L-box begins to boom in its contained implosions. Pressure valves hiss and air crystals tinkle in their canisters.\nA flash from the tangle catches my eye.\n“Hey, what is that?” I ask. Our boy guide looks up at me, then down at the vial of talcum-looking powder that he was tipping into the L-box.\n“This? This is tian-zhi powder. It helps seed the crystal and keep it solid, outside a pressure canister. We use it when we run out of canisters to store the good sky.”\nStephan wheezes and stumbles past me for a better look.\n“That’s—that’s really, very interesting. We’ve never heard of anything like this in America. I suppose it’s some nucleation agent for the crystal to precipitate around? Can you show us how it works?”\nOur boy-guide smiles politely. He feeds the vial into the L-box, and after a few booming seconds, detaches the canister and pours out a cluster of crystals—porous and opaque, unlike the translucent lapis of the market-ready air-cubes. He tips a few into Stephan’s palm, and the shards sit quiet and inert, not sublimating in the mountain air.\n“Fascinating,” Stephan mumbles. “What’s the nucleation agent made out of?”\nThe boy shrugs.\n“Old Man Li showed it to us. It’s a powder made with tian-zhi, the sap of a plant that grows on the mountain.” He mimes out the contours with his hands. “Big, thick stem, tiny leaves; red speckles all over.”\n“And it keeps the Leibenstein crystals solid outside of a cooled, pressurized container?”\nThe boy nods. “But it is not very good sky. None of the vendors will buy it, but some people in town like to use them as jewelry.”\n“Very, very fascinating.”\nOur guide pressurizes the last of the canisters and lashes them back onto the tangle. We make small talk as we trundle down the mountain—some business, some personal. He seems happy enough to oblige our curiosity.\n“I used to work in the mines with my father,” the boy says as he tramps on ahead. “We lived inland. The mine went out of business when I was twelve, so we came to work out here. He was sick with the miner’s cough, by then. He learned English when he was working for an American sweatshop, back when the big inland boom happened. He taught me a little before he died.”\nHis words are calm and unsentimental. I see Stephan trying to catch the boy’s eyes with this mawkish, puppy-dog expression on his face. I cut him off before he has the chance to say anything stupid.\n“What about the sky you’ve got?” I ask, fighting for breath against the rake-thin air. “Any particulars you watch out for?”\n“All we do is get sky and avoid smog,” the boy shrugs. “The black smog is the most poisonous, but it is heavy and stays in the valleys, so we needn’t worry about it unless it’s a hot day in summer.” He points upwards. “When we go into the high mountains, we look out for sky-smog. It gets brought downwards by the wind and rain. Sky-smog is always unpredictable—so the high peaks are a bad place to get sky.”\nI receive this information with a grunt. Stephan wheezes to my right, his face the gray color of dead fish. The more we march, the more I think that he’s not so much walking as he is falling forward, barely catching himself with his legs with every step. The boy continues blithely ahead.\n“The places in the middle, where Big Sky Ridge is,” he throws a thumb backwards, “that’s the cleanest sky. You can get a very good price per tank with that. And we never try to be clever about it—the dealers can always tell the mountain air from the cheap cubes that the townspeople make on a clear day.”\nI suck at the thin air and make mental notes. I can hear Stephan dry heaving to himself behind me. About forty yards on, I stop to look back, and find him standing by the side of the path, unmoving, pointing to something on the mountain slope.\n“What?” I snap.\nStephan wheezes as he moves towards the edge.\n“The tian-zhi—red-speckled—with thick stems?” His limbs move stupidly with oxygen deprivation. I wonder if he’ll accidentally overstep and fall. The vague panic of it snaps at my brain—and I am suddenly fed up—with Stephan, with this trip, with the bureaucrats, the smog and the kid and the entire goddamned mountain, and I fight down my own nausea to yell at the pontificating, bumbling fool.\n“Stick to the path, you pastry-ass idiot!”\nAnd now the boy:\n“You must be careful on the snow!”\nStephan doesn’t even acknowledge us. I wonder if altitude sickness has compromised his judgment, or if he’s trying to prove something after my ribbing earlier. I turn to our guide.\n“That idiot. If he dies, we leave him. I swear to God, we leave him to get eaten by wolves or vultures or whatever the fuck lives in these goddamned mountains, and—”\nOur boy-guide interrupts me with a loud shriek, and rushes clanking back up the path.\nI look back in time to see Stephan tumbling over the edge.\nDhampa\nThe foreigners left the shop with a full troupe at five in the morning.\nThey came back alone after midnight, clattering into the alley on a mule-cart, with one of them moaning in the back, clutching a mess of plant stems.\n“We need to get him to a hospital—a real hospital, not a local one.”\nI brush off the scowling one called Wesley. I know the kind of hospital he means—the foreigner hospitals like they have in Chengdu or Hyderabad; expensive beyond the means of the locals, where rich tourists are treated like royalty.\n“We only have one hospital in town, dōsta.” I smile a little: “Of course, the bureaucrats have their own private clinics. You can always have him treated there, if you have the clout.”\nThe one called Stephan moans in his makeshift stretcher. The boy tells me that he fell off a slope while reaching for some tian-zhi plants. Lucky it’s been a wet winter, he says. Lucky the slope was snowy. Lucky he fell into an outcrop.\nLucky.\nI shake my head. That’s the problem with these foreigners—rich and soft and lucky. And always too keen to overestimate their own worth because of it.\n“Look, dōsta: there are no fancy foreigner hospitals in Xin Xi’an. And the city closed the 24/7 ward years ago, for lack of doctors.”\n“To hell with that . . . is there anything we can do now?”\nI shrug.\n“I can call my friend Zhang from the doctors’ charity to come take a look at him. It is late, and it will cost you a lot of money—for his trouble, and for using my rooms as a hospital bed.” I heave a sigh and look down at the broken foreigner with theatrical exasperation. “But you say he’s your friend. Shall I make the call?”\nThe one called Wesley looks at me like he is about to have a stroke.\nDr. Zhang arrives at one o’clock, pulling up to the alley on his bicycle. I have Wesley and the boy make a room ready. The hurt foreigner is placed on one of the dining tables, and Zhang wastes no time in examining him.\nThe one called Wesley look incredulous.\n“He’s not even going to take an X-ray?”\nI pull the boy out of the room. My pockets are full with two thousand yuan from Wesley, and a promise to square up the rest before they head out to the rail station. The day has not been a waste after all—at least it would cover some of the shop’s losses from last month. As the rectangle of light narrows, the last pieces of conversation float out from inside:\n“ . . . I can splint the leg for now, but you’ll want to get to a hospital, as soon as you can. I’ve brought some medication for the pain.”\nOutside, the air is acerbic and cold. The boy and I sit like Bodhisattvas at the mouth of our alleyway, our breaths turning into wisps under the smog-hidden moon.\n“You ought to get rested up for tomorrow,” I tell him. The boy grumbles bitterly, but gets up nonetheless. A shrewder negotiator might have known to leverage the foreigners’ payment against tomorrow’s haul—but the boy apparently hasn’t inherited his father’s talent in negotiating for small comforts.\nI shrug and sip my tharra. Nothing asked-for, nothing given. In another two hours, he will be roused from his nap to head out with the troupe. The climb is tiring on the best of days (I would not have relished it even when I was a young man), but after a long night and so little sleep, his workday will be nothing short of brutal. I make a mental note to have old lady Liu feed him better for a few days.\n“Do you think Stephan will be okay?” The boy mumbles, swaying slightly with exhaustion.\nI laugh and take another swig from my flask.\n“Smug, fat American. Can’t even climb a mountain without breaking in half. What a joke.”\n“He is not a joke. Stephan wants to give clean sky to everyone—that’s why he’s here. He wants to help people, while you only care about making money.”\n“He is an American. He already has the luxury of money, so he can afford to be a smug, self-satisfied pug. And anyway, who do you think he really means by ‘everyone’? Not you or me, for sure. He means rich folks in a big city, where people can get anything they want by throwing money at it. They only need people like us to get it to them.”\nThe boy heaves one last column of wispy breath into the night before dragging himself sideways towards the bunks.\n“And you only need people like me to bring it to you, so you can sell it to them,” he murmurs.\nThe frankness in his voice is a pleasant surprise. No self-pity or rancor—just the acknowledgement of a simple truth: the starving will sell to the poor, who will sell to the middlemen, who will sell to the rich. The chain goes on and on, and those at the top will always find a way to live well, even when the world chokes and starves around them.\nI tip my drink to the boy’s silhouette.\nI’m going to make sure that old lady Liu feeds him well for an entire month.\nThe next morning, the foreigners are loaded onto a mule-cart as a muggy red sun crests over the peaks. Bound for the hospital, or the rail station—it didn’t matter which, so long as they were gone from my shop. The one called Wesley had paid up the rest of our agreement in full, and as they made their way out of the shop doors, I’d heard him complaining bitterly:\n“Back in my dad’s day, they would’ve sent a whole fucking chopper out to get us. Now we’re not worth the gas it takes to get a truck out here. I told you all that humanist talk is just moral posturing for the rich.”\nHe said this as though he considered himself one of the poor. I’d laughed loud enough to startle the mule.\nBefore the cart pulled away, the injured one had grabbed me and pressed a hundred yuan and a stack of handwritten notes into my hand.\n“Look, I just wanted to thank the boy for everything he’s done,” he slurred through Zhang’s painkillers. “Tell him I said thank you, all right? Tell him I said thank you and to keep in touch. I saw an old computer back there in the shop. You’ll let him keep in touch, won’t you?”\nI nodded vaguely, and put the papers in my pocket.\nZhang strolls out of the shop in time to wave the foreigners off. The sun shines coldly overhead, a muggy red sphere cradled in a jagged-peak horizon. The air is almost fresh enough to sell.\n“Had a comfortable sleep, Zhang?” The good doctor had decided not to cycle back to the hotel in the dark, and had slept instead on a spare cot in the mess room. The working troupes had almost trampled him flat when they got up in the early morning.\n“It’s no luxury resort.” He throws me an eyebrow. “Why did you call me last night, Dhampa? You must’ve known I couldn’t do much without seeing an X-ray.”\nI shrug and count out a wad of bills from my pocket.\n“Scared foreigners are good money. Here’s your share.”\nZhang stares at me. He shakes his head vigorously, as I knew he would—and I pocket his share of the money, as I knew I would.\n“I’m going back to the coast in a few days, Dhampa. Next time, leave me out of your money-grubbing schemes.”\nHeat rises in my face. I grit my teeth. As much as I respect the good doctor, he is still a big-city man: a child of middle-upper-class academics, indulging the self-gratifying charity of the comfortably rich.\n“You’re right.” I stuff the bills in my pocket. “I suppose I should be more like you, Zhang. Take some time away from my penthouse in Shanghai, travel a few weeks each year for a round of inoculating the poor and pooh-poohing at what the little people must do to make their living. Go back home to a round of applause from my rich, academic friends.”\n“Everything is about money with you, isn’t it?”\nI laugh at the sanctimony in his voice. There are few things the rich love more than complaining about the penny-pinching habits of the poor. Money certainly isn’t everything—especially to those who have an abundance of it.\n“Oh, you’re right, Zhang. Money hasn’t done a thing for you, I’m sure. Maybe you can spare me that valueless suburban home you own sometime? Maybe you can gift me the assurance of food and shelter and a lazy, comfortable retirement, and the similarly valueless lifestyle that you provide for your family?”\n“I give to charity,” Zhang snaps. “Those foreigners—you had no right—”\n“No right? You and the Americans are the same. You have no right. Your cities spew out smog, but you breathe clean air from our skies. Your factories spew out waste, but you drink clean water from our rivers. You buy your daily injustice with the money that you don’t even appreciate—but you condemn me, because I conned a money-fat foreigner out of some traveling cash?”\n“I do what I can to help, Dhampa. But if that’s not enough, then what would you do? Tear down the infrastructure of the domed world? Make the quenched ones thirsty, make the fed ones starve, in order that everyone can become equals?”\n“At least then the thirsty might be spared the sanctimony of the quenched.”\nZhang gives me a pitying look. I ignore him. On matters of medicine, the man may be an expert; but on matters of life, he knows nothing. There are certain truths about the world that the well-fed and -watered cannot know. Without money, a man cannot make a life for the woman he loves. Without money, one cannot buy justice, as the rich do in their courts of law; cannot buy mercy, as politicians do in their courts of public opinion; he cannot buy the voice to express himself, locked out as he is from the satellite and intranet stations that would otherwise happily broadcast the most puerile of opinions from the rich and famous. Penniless peons die every day, anonymously and under terrible duress; but it is the wealthy folks in the big cities who fill the tribute sections of newspapers when they drop dead, having bought their legacy in sponsorship deals and billion-yuan houses.\nZhang and I are silent for a while, and content ourselves with watching the sunrise. I invite him back inside for some tea and steamed buns, and he accepts graciously—perhaps a little apologetic after such an early-morning argument. Ten minutes later, I wave him off down the street, tinkling back to the hotel on his bicycle.\nI do not think I will see him again before he leaves for the coast.\nStephan\nRain falls over Pleasant Valley. The neighborhood’s microclimate dome arches overhead, its chromatophoric cells reflecting a sweep of metallic gray instead of its usual sunny blue. The ratio of simulated rain days is something like 1:14 this year—Jaine and I had been at the community meeting when they voted on it. Pleasant Valley is one of the nicer domed communities in Stamford, and its developers have always responded well to residential opinions.\nI take the stairs to the living room like an awkward crab-thing. It has been six months since Xin Xi’an, and my leg still cannot take too much weight. The soft hum of the massage chair saturates the living room. Jaine smiles as I lean in to kiss her cheek—then covers up her head with her hands.\n“Don’t look at me. Dana had an off day at the salon last night. I look like I should be in some pre-millennial boy band.”\nI laugh. The glow of the telewall fills the room, and I spend the next five minutes trying to coax her hands from her hair. Outside the window, beyond the simulated rain and the siliglass canopy, the coastline sits in its usual haze of smog.\n“Oh, hey,” Jaine says suddenly, forgetting about her hair-related woes. “You have mail from your Tibetan boy.”\nShe grabs the mo-flip, pulling up a short message in broken English.\n“There was even a picture in it. Have you seen? Oh, it’s just horrible what these poor people have to live with, Stephan. Just heartbreaking. I meant to tell you about it yesterday, but I was so distraught after the salon it completely slipped my mind . . . ”\nI shake my head sadly at the picture: a sky-running troupe, hooded and masked, staring like blank-eyed ghosts out of a smog bank. I dress myself in double-time and try to shake off the weekend-morning haze. Monday was going to be the second round of advisory reports to Scott Timwell, the Special Projects manager at Weidmann-Colliers—a recap of all the data analysis following our Xin Xi’an trip. Between our conflicting work schedules, Saturday was the only time Wesley and I had to get together and finalize the presentation.\n“Hey, will you be seeing your friend Wesley today?”\n“He’s not my friend, hon. We’ve just known each other since college, that’s all.”\n“Well, just tell him about my fundraiser if you do, will you? We could use his business.”\nI groan inwardly, picturing Wes’ smirking face over his trademark, sardonic swank.\n“I can already tell you what he’s going to say—‘no’—in the most insulting way he can manage. Remember the Dance for Somalia bash at St. James? He called it the ‘new-age White Man’s Burden.’”\n“Did he really?”\nI nod. Jaine purses her lips, her eyes flickering as she leans deeper into the massage pads.\n“Everyone’s so spiritually empty, these days. They don’t know how to empathize with the common folks, the way we do. People like Wesley need our help as much as that Tibetan boy.”\nI nod in agreement.\n“Anyway, have yourself a wonderful day, dear. And don’t forget to collect your overtime this time around.”\nMy ears pop with the air pressure as I step out of the neighborhood airlock. I take the underground path for the tram on foot, its dank, municipally-filtered air in sharp contrast to the imported quality of Pleasant Valley.\nWe pull out of the station in good time. Pleasant Valley fades small on the horizon. We blaze through Greenwich and Port Chester, flashing between bustling domes and abandoned suburbs. The skeletal houses of the old suburban sprawl blur in the haze. We pass the open-air grime of South Bronx, where masked people stalk the acid-rain streets, their breathers as surreal as staring ghosts. My flip beeps as we duck back underground at upper Manhattan. A few minutes later, Wesley comes slogging through the cabin, clutching a coffee and a breather, and what looks like a terrible hangover.\n“Christ, you will not believe the riffraff in the public cars. Some people just can’t control their kids.” He elbows past some tourists in the adjacent seats. “Thank God for business-level seating.”\nI nod absently. When the oil market collapsed, some folks fell back on cycling, and some shelled out a fortune to continue running on gas—AlternaCorp even launched a line of solar- and nuke-cars to some serious marketing fanfare back in ’49, though that venture never really took off. In the end, the big money proved to be in public infrastructure, as the cities converted to hydrogen and electric. The system in the tristate is managed by Transat, who run their commuters’ trams with an executive lounge in the first car, business seats following up after, and public seating for the next fifteen lengths—each section with its own exits and loading platforms, to avoid congestion for the high rollers. Wesley, as always, prefers to travel business—but personally, I’m more of a man of the people, so I’ve never really minded the squeeze.\n“You look wasted.”\n“Hrmph,” says Wesley, downing his coffee. “Me and Crosby went out with a bunch of chicks from PR last night. We drank. Everything.”\n“Ah.”\n“Not as exciting as it sounds, I promise. Cheap club. Municipal-aired shithole.” He starts up from his coffee as if remembering something. “One of the girls said she knows you, apparently. A delightful career bitch under Ronscelles. Angela Whitman, you know her?”\nWe pull into the financial district and squeeze through the throng, mostly shoppers and tourists in town for the weekend. One level above us, the private single-cars of the exclusive service come and go with easy precision.\n“I know her mother, for heaven’s sake. Please don’t put your moves on this girl, Wes. And for heaven’s sake, don’t call her the b-word.”\nWe walk out of the station, into the noise of the Manhattan streetscape, gleaming steel and plastimer in its perpetual upward sprawl. A sprinkling of hydrogen cars trudge doggedly through the tide of cyclists under the microclimate canopies. Wesley shakes his head in front of me as we weave through the crowd.\n“You know, sometimes I have trouble believing that we’re the same age, Steve. You’re fat and disapproving enough to be my father.”\nThe rest of the morning passes in a flurry of datapads. We work nonstop until three, when Wesley decides he can’t hold up anymore and calls for delivery. We root around for our flips, throwing open the window as the gunmetal gray of the delivery drone buzzes its way towards our floor.\n“Thank you for ordering at Rubarb’s Deli.”\nWesley makes the payment with his flip and digs into his Reuben—New York style with mustard—the lump of salted meats bursting from the bread like a cow stuffed between two crackers. He casts around for conversation, eyes lingering over the miscellany on my desk.\n“That’s new,” he says, gesturing at the handful of talcum crystals by the keyboard. “What is it?”\n“Some of the Leibenstein crystals from the mountain—the ones our guide seeded with the local tian-zhi, remember? Look,” I pull out a vial from my drawer. “I had Stephano from R&D collect some plant extract from the stems I got.”\nWesley laughs, looking down at my bad leg and the cane leaning awkwardly against my desk. I turn a little red.\n“There might be practical uses for this tian-zhi stuff, you know. It’s not purely sentimental.”\nWesley chews skeptically.\n“The locals said they’re hardly worth a buck.”\n“Well, yes—but I’ve been thinking—what if we were able to precipitate the tian-zhi out of the solid? Stephano thinks it might be possible to isolate the nucleating agent . . . ”\nWesley wolfs down the rest of his sandwich and misses the wastebasket with the balled-up wrapper.\n“So, what, you alchemy the shit out of this thing and remove the tian-stuff? What would you have left over?” He picks a crystal from my desk, squinting at it through the flexiglass glare like a gold appraiser.\n“Something like a Leibenstein cube, most likely. The catch is, the locals use these unrefined crystals for decoration—which means they can be kept for years, outside of a cooled and pressurized container . . . ”\nI let the sentence hang. Wesley licks a sliver of meat out of his teeth.\n“Are you saying you could distill market-ready, Leibenstein air-cubes from this chaff?”\n“Well, maybe not market-ready—but theoretically . . . ” I watch with some satisfaction as he snaps from the desk, to the window, to the datawall. Files open and bleep as he brings up the company’s inventory and shipping manifestos.\n“Steve. This is alchemy,” he mumbles, scrolling through the wall frenetically. “Fucking, volume, man. Lead into gold.”\n“Well, look: let’s not get too ahead of ourselves. It’s just a theory that we started thinking about the other day—”\n“How many people have you told?”\nI stop. Wesley looks at me like a shark that’s just smelled blood.\n“Uh. Just Stephano, so far.”\n“Good. Tell him not to breathe a word of this to anyone else.”\nHe turns back to the datawall and starts scrolling again.\n“The first mention of this in print is damn well going to have our names on it.”\nAngela\n“Down with Weidman-Colliers! No foreign air!”\n“Move on, get out of the way!”\nThe canopy hangs above in its usual cloudless blue, throwing stark patches of light and shadow onto the crowd. A thin woman with teeth like a leopard grabs my arm and gives me a face-full of bile.\n“American jobs are not a commodity!” She screeches. “NO FOREIGN AIR!”\nI shake her off. There’s nothing I can say to her—nothing she’d listen to, anyway. Historically, every domestic attempt at sky-running has always been hobbled by expensive labor and unsustainable profit margins. What she should have been doing was yelling at the geriatric men in Congress—they were the ones who’d legislated against the WC biotech that would have made the domestic air trade viable again. Their arguments boiled down to the fear that it could damage the ecology of the clean-air zones. Late and reactionary, as usual; sixty years ago, the entire country was a clean-air zone.\n“Can you believe this, Angie?” Loris says as we duck into the foyer. It’d been no small surprise when Ronscelles suddenly retired last month and dumped the whole PR clusterfuck on us. The atrium doors slide shut on the chanting protestors outside, and a voice in my head slaps me with a stern little reprimand.\nNo, not a clusterfuck—that was the wrong way to think about it.\nAn opportunity.\n“American jobs are not a commodity!”\n“Down with Weidman-Colliers!”\nWe pile in line for the lobby bistro, behind tired-eyed suits looking frazzled by the protestors outside. Halfway through our line up, I spot a familiar smirk drifting past the procession. The Hughes half of our proprietary Anderson-Hughes compound. The great Mr. Ego himself.\n“Jaysus Christ. Can you believe this riffraff?”\n“Morning, Wes.”\nHe slips into the line as if we were saving him a spot all along.\n“I hear Burnham’s been throwing a fit over these protests,” he says, tossing a distasteful glace at the crowd outside. “You got a game plan for the meeting today?”\nI yawn and wave my flip noncommittally.\n“Present a human face to the news outlets. Work the consumer benefits angle. The classic.”\n“Same as Ronscelles?”\nI shake my head, remembering the defensive, smarmy ad sketches that Loris had forwarded to me. Apologetic little numbers that started off with “we know you don’t know who to trust, and you’re pretty sure it isn’t us . . . ”\n“Ronscelles played it way too passive.” I grab a frothing latte out of the barista’s hands. “If we’re going to be that apologetic, we might as well be guilty. You don’t win public confidence by being a quivering, defensive quim.”\n“What’s your take, then?”\nI shrug.\n“They’re playing up the blue-collar advocate angle—well, we can play that game too. If our ops go through, we can provide people with clean air for a fraction of the current market price, effectively putting it within range of working-class families.” I gesture at the sign-waving crowd outside. “And what kind of snooty protectionist would fight against that?”\nLoris munches his Danish skeptically. “People tend to approach these things with their minds already made up.”\nWesley nods. I take a deep draught of my coffee, tasting the scalding latte on my tongue.\n“There’s a reason you don’t work in PR, boys. The point is, we don’t need to win over everyone. At the end of the day, there are more Americans who want clean air than there are sky-runners who want jobs.”\nLoris smiles and nods.\nBlue-collar sympathy is worth its weight in gold these days.\nMy father used to say that the biggest mistake of the uninitiated mind is to divide the world into truths and falsehoods, as if they’re two equal sections of a pie. The world is more complicated than that. Leave the black-and-white thinking to the children and the partisans, he’d say—there’s always a truth and a more marketable counter-truth. The point is to steer the public towards a truth that’s more convenient for you.\nTruth: The American sky-runner is now a superfluous commodity in a free market of twelve billion, each willing to work heavier loads, longer hours, for a fraction of the cost.\nTruth: The move to foreign air will drive floundering domestic operators under completely, resulting in a net loss of American jobs.\nCounter-truth: Moving to foreign air will allow the new WC biotech to be used on a commercial level, which will in turn lower prices of Lebenstein air-cubes to within the reach of working class families, reducing the rate of asthma, emphysema, and other air-quality diseases, and improving overall quality of life—especially for those on the bottom ends of society.\nAll of these things are true. The job of a good PR doc is to make sure that the more convenient truth gets picked up and talked about by the general public. It’s the same doublespeak that allowed millennial ideologues to march under banners of “pro-choice” and “pro-life”, instead of the more-accurate-but-less-marketable, “pro-abortion” and “anti-abortion.” You can call cigarettes “cancer-sticks,” or cheese graters “sponge-ruiners”—twist meaning and perception all around in a catchy sound bite—and still end up with the same net quanta of truth. The screeching protectionists had no objections fifty years ago, when the doublespeak was working to their benefit—but now that they’ve realized the system runs both ways . . .\n“Down with Weidman-Colliers!”\nIn the end, it was another six months of finagling press releases and calling in favors from people I haven’t seen since university before we put the controversy to bed.\nThe hologlass banners of the 36th Annual Business Innovation Gala glow like mirages overhead, our Weidman-Colliers sponsorship ad dominating the bottom quarter. The lights dim and the music rises. I thank the MC and the band—I thank the guests and the Chamber of Commerce. When the applause dies down, I make my way out of the limelight, shuddering at the thought of how many favors I now owe. Snippets of conversation assault my ears as I push through the guest area:\n“I liked the presentation from Kaltec. Outside-the-box thinking: seeding the Anderson-Hughes right into the atmosphere, using open-air implosions for maximum volume.”\n“Well, they’d better work out a clean-zone for heavy and light particulates—”\n“Of course.”\n“And obviously figure out some kind of collection process—”\n“—obviously.”\n“There’s my Golden Girl,” Ted Burnham thunders as I approach the WC tables. There’s a round of obligatory flattery from the assembled faces. I tip them a toast in mock humility.\n“Let me see, let me see—have you met Avery Rhaman, our CTO? And I think you know our very own Stephan Anderson and Wesley Hughes?”\n“Yeah, we’re acquainted.”\nI take the empty seat next to Loris.\n“Damn good turnout tonight. Damn good,” Burnham says, patting his paunch. “Hell of a turnaround from where we were six months ago.”\nI take a swig of champagne and massage my tired eyes. A suit pipes up from the other end of the table:\n“Good show on getting the boys in the Chamber, too. Our guy in Washington says we can expect some solid support next election cycle—maybe find a way around the domestic ban . . . ”\nI recognize the speaker: Larry Brzozowski, one of mine. It’s a classic line that’s been bouncing around the department—but the truth is, half of it is bravado. Ever since the gas markets collapsed, the DC field has normalized around a staunch lip service to conservation—dogmatic and overbearingly shrill, in the way of most way-too-late-to-matter reactionaries. The epithet “robber baron” has made a comeback, and accusing an opponent of being a heartless industrialist is now the go-to smear for spin-doctors and character-assassins across the political spectrum.\nI down my drink and excuse myself for a smoke. Reactionary old men and their reactionary caucuses. A few months ago, a couple of protestors found their way into our press conference and tried to storm the stage. As they were dragged out, one of them turned to me and said:\n“You don’t know, girl. You gray-gens have no idea what a blue sky even looks like . . . ”\nThe old man obviously thought he’d made some kind of point, because he stopped resisting security after that. I couldn’t stop myself from laughing. You gray-gens—you gray-gens. As if it was somehow our fault for being born after the last generation smothered the sky.\nI blow a column of smoke at the twinkling canopy overhead. I’m no stranger to sentiment, but that sort of mawkish obsession with the greener pastures of the past has always irked me. I’ve seen my fill of starry nights and sweeping sunrises on old holotapes. It’s nothing the chromatiphores can’t replicate. Yet if the old men and the stuffy politicians are to be believed, my entire generation should feel guilty because we learned to make our own blue skies, rather than pining for the one our parents destroyed before we were born.\nI finish my cig and toss it into the path of a humming sweeperbot.\nI’m twenty-seven, and I’ve never seen the stars.\nFrankly, I don’t miss them at all.\nDr. Zhang\nThe tram blazes through the Chengdu prefecture, turning the landscape outside into expressionist art. A cup of barley tea sits to my left. Big Zhou is on my right, squinting at the grayscale tide of humanity below. Rickshaws and bicycles ply the open-air streets. Out in the distance, we can just make out the gleaming domes of the state-run greenhouses on the Chengdu Plains.\n“Thirty-nine years, Zhou,” I sigh over the steaming cup. “That’s how long it’s been since we’ve been here.”\nZhou chuckles.\n“I was here last year, but I take your point. The world moves fast when you’re old, huh?”\nI yawn and massage my eyes feverishly, feeling the unpleasant grit of eye-gunk on my thumbs. Old is not the word I have in mind. Old is respected. Old is venerable. But this empty, scraped-out feeling, this weariness in my bones that has nothing to do with sleep . . .\nLast time I was here, I could still see the sky.\nMy flip beeps with an incoming message, but I swipe away the alerts and try to return to the budget spreadsheet. Numbers roll like mnemonics through my brain. Zhou once said that in business, profit is king, and in life, money is freedom. To exist without money is to exist without station, on the whims of another’s charity. It makes me wonder why he’s stuck it out with me as long as he has, begging at the hems of businessmen and bureaucrats, over an idealism that should’ve died long ago, when we were young men.\nI swipe my flip shut and chug down the scalding cup of tea.\n“I’ve come to a conclusion, old friend.”\n“What’s that now?”\n“I fucking hate nonprofit administration.”\nBig Zhou guffaws over his tea like a jolly old Buddha. The city center glitters like a swelling jewel on the horizon.\nI stare out the window, futilely hoping to spot a shred of blue in the haze.\nWe make it to the city center with twenty minutes to spare. The district pulses with a stylish beat under the glittering canopies, and we take the Wenxi chute skywards, coming up to the Hundredth-Floor restaurant in a swoop of acceleration.\nThe private bureaucrats’ room opens in a blur of light and import-quality air. We do our usual scan around the room, finding and paying respects to the senior officials gathered around the table. I shake hands with the city’s Party Secretary. Down the table, the directors of Xintian busy themselves in conversation with a few SOE reps on the logistic side of things. I groan as the last smarmy face comes into focus: the infamous NGO-eater, Ji Wenxiou. As a by-product of the Communist Party’s institutional paranoia, he had the distinction of having the most stupidly ironic job title I’ve ever seen: General Supervisor of the G-NGOs—the “Governmental Non-Governmental Organizations.”\n“This guy,” I mumble into Big Zhou’s ear, “has been going around shutting down half the NGOs in the southwest. Are we supposed to buddy up to that snake?”\nZhou’s beaming smile doesn’t miss a beat.\n“You never were any good at this game, Zhang. Follow my lead, and remember: guanxi. Be kind, be pleasant, do a favor and get one in turn.”\nHe grips Ji Wenxiou’s hand and lavishes him with praise. When the bureaucrat turns away to greet the other guests, Zhou turns back to me with a sardonic smile.\n“We do, after all, exist on the charity of others.”\nThe rest of the dinner goes as well as I expect. The opening salvo of small talk is fairly harmless—a few references to my previous tenure at Jiaotong University, and some disingenuous praise of a collection of essays I published last year. A fat party official to my right comments that the volume would’ve been bestseller material, were it not for its bleak overtones.\n“The point is to engender positive conversation about the party’s vision for society. My wife used to work with poor children in Chongqing—so I know all about the concerns on the ground. But still, you’ve got to try to find some romance in it. You’ll never be on a bestseller list if you’re always, hrm, doom-and-gloom all the time.”\nTaking a sip of his rice wine, he adds:\n“My boy volunteered all over Yunnan, you know,” as if that settled the matter. “My daughter went to Cambodia.”\nI smile politely and defer to the authority of his poverty-tourist kin. Meanwhile, at the other end of the table, the conversation is winding toward business: the proposed Expedited Processing Zone in Xizang, and the experimental tech that a foreign importer had tabled at the Shanghai International Summit. Big Zhou nudges me to pay closer attention.\n“As for the amount of volume this new tech is supposed to generate—if anyone’s worried about devaluing the product—”\n“Oh, I wouldn’t worry about that. The central government has enough fingers in that pie to prevent any undercutting of our domestic market—the SOE’s, too. This is about exports. We get their tech, and they get a break on tariffs as a state-sanctioned partner.”\n“And what about the ecological damage? I heard the only reason they’re here is because their own government blocked their tech in America.”\nTheir eyes turn toward me and Zhou. I clear my throat and pull up the introduction holo on my flip.\n“Well, full disclosure, gentlemen: I’m no ecologist. But our organization has a long track record of health and environmental monitoring all across the southwest—including sky-running hot spots like Xin Xi’an. We’ve already expressed our willingness to come on board and observe the enterprise as a third-party—”\nJi Wenxiou clears his throat from across the table. The room is silent as the NGO-eater speaks, rolling his r’s in a thick northern accent.\n“Monitoring is one thing, Dr. Zhang—perhaps that’s something that we’ll ask of you, in time. As of now, we envision your organization to fit a more—hrm, advisory role.”\nI say nothing, waiting for him to elaborate.\n“Speaking frankly, doctor, we want your reputation. Your involvement helps to reassure the general public against rumormongers on the intranet—but please understand that any publication of health or environmental issues will be handled exclusively by the central publicity department.”\n“So, the actual monitoring—”\n“Will not be any of your concern. The publicity department will provide you with briefs, and you are expected to deliver them to the public.”\n“In other words, you’re looking for yes-men—not a third-party watchdog.”\nBig Zhou gives me a warning nudge under the table.\n“Call it what you will, doctor—we simply offer this partnership as a win-win arrangement. There are significant sponsorship opportunities for you if you do decide to come on board.” He fixes his eyes on mine. “And those would be funds that you can freely use elsewhere.”\nA murmur of consensus passes around the Xintian and SOE representatives. Big Zhou nudges me again under the table. I smile stiffly and swipe away the holo with shaking hands.\n“I—we will definitely take that into account.” My face feels like cracked glass as I smile at each of the bureaucrats in turn. “Thank you all very much for the opportunity.”\n“Well. I think that went as well as expected, don’t you?”\nChengdu passes in a blur of humanity and neon. We walk the city center on foot, having made our excuses at the various “extracurricular” offers that were extended to us. The fat party official had been insistent on going to some luxury sauna that sells love by the hour. Big Zhou had laughed him off when he made his overtures.\n“Central is launching its biggest anti-graft campaign in decades, and the idiot still can’t keep it in his pants. He’s going to get shuanggui’d by the CCDI sooner or later, you mark my words.”\nI sigh and massage my eyes. The sinusoidal dance of intra-party corruption is an old, tired refrain. A sweeping anti-graft campaign every time a new strongman crops up in Beijing—and then a slow, gradual resettlement into the familiar web of backroom nepotism. Culling the flies while breeding the maggots, the netizens called it.\nThe noisy cityscape pounds a drumbeat against the inside of my skull. The lingering rice wine in my system makes me hot and hazy, and the faces of bureaucrats merge with the figures on my budget spreadsheet. I stop to lean against an artificial tree, suddenly aware of the aches in my joints, the gray in my hair. The rolling accent of the NGO-eater fills my mind.\n“There are significant sponsorship opportunities for you if you do decide to come on board—and those would be funds you can freely use elsewhere.”\nOverhead, lights from the skyscrapers heliograph through a translucent canopy. The sky-chutes flow upwards, channeling all towards those inscrutable, artificial peaks. Up, up—the power and the wealth. I crane my neck and wonder if there’s any end to it—if there is still an inflection point at which they might blow through the ceiling, catapulted into a gray, dusty grave by their own inertia, like all the pre-peak pundits had so wrongly predicted they would. I’m reminded of something I once heard in Xin Xi’an: the rich will always find a way to live well, even when the world chokes and starves around them.\nI sigh as we move through the station, squinting at my reflection in the moving tram doors.\n“Tell me the truth, Zhou. Do you think we’re actually doing any good here?” The tram hisses to a stop. “Or are we just a pair of self-righteous old men, bargain hunting for our own moral gratification?”\nMy knees pop as we sit down by the window. Above us, there’s only smog and darkness: no moon, no stars. Below, the feeble firefly lights of crank-lamps dance among the bicycles and rickshaws on the open-air street. Zhou busies himself with his complimentary barley tea, then turns to me and grins.\n“I don’t see why it can’t be a little bit of both.”\nBoy\nThe wind howls over Big Sky Ridge.\nA light acid drizzle settles into droplets on our breather-lens. I wipe my thumb across the American-made surface—Stephan had accidentally left it behind years ago, and had passed it on to me with his blessings. We’ve kept in touch the best we could over the years, though lately, he has stopped writing.\nOld man Li holds his finger up to the wind. A straight-angled shadow passes over the mountain. He looks up and frowns. Then, a mighty roar—thundering, bone-rattling, as though the mountain itself were coming to life.\n“What the hell?” Fong yells, gripping his ears under his breather. Our troupe presses back against the shadow of the cliffs. Only Jinjin, still green and oblivious to danger of rockslides, steps out into the open for a better look.\n“What is it?”\n“A bird?”\n“It’s too high. Going too fast.”\nI squint at the silhouette cutting through the sky-smog. Fong is right. A bird that high up would have been poisoned by now. The roaring continues, a deep, dark timbre that rattles our bones. We look at each other, but none of us want to be the first one to say it.\n“It’s a petrol plane!” Jinjin squeals, not caring about sounding stupid.\n“It can’t be.”\n“A real-life petrol plane!”\nWe squint at the shape fading into the smog: the straight, unyielding cut of the wings, the wide plumes trailing behind, just like the pictures on Dhampa’s TV.\n“It must be billionaire Americans!”\n“I bet it’s the premier of China!”\n“Is it the army? A secret weapon. Nobody will expect a plane!”\nAnother thundering roar echoes across the mountain, and Jinjin almost loses his footing as he jumps and whoops in excitement. I pull at his back to stop him from plummeting. A second plane strafes between the peaks. Up above, in the distance, a third, trailing wide plumes from its tail that seems to spread and dance in the wind. The smell of tian-zhi fills the air.\n“Three planes! Three!”\n“They’re stirring up the sky-smog,” Old man Li grumbles.\nWe watch the stiff-angled shadows strafe back towards us, parting the smog as they come. Jinjin shakes with excitement. Fong and Xiaoling have taken off their breathers entirely, squinting red-eyed against the acid drizzle.\nThey are still busy gawping when the world explodes.\nThe first blast knocks me off my feet. The mountain shakes as a shower of rocks rain down on our heads. A huge gust of wind catches me in the chest, nearly hurling me off the edge. I scramble instinctively towards the shelter of the cliff-face as talcum rocks scatter around our feet.\n“What the hell is happening?”\nThree more blasts pummel us in reply. Old man Li is yelling, straining against the wind, dragging a shell-shocked Fong in one arm and the unstrapped L-box in the other. I feel rather than hear the next few blasts. By then, we’re all flying down the rock-shard slope like all the hounds of hell were after us. Talcum shards rain down like hailstones, welting our necks and clipping our ears. We run until our joints creak, until our lungs ache.\nIt is a long time before the blasts stop—even longer before our ringing ears can hear again. We pad dumbly down the mountainside on legs as soft as rice pudding, occasionally catching each others’ eyes as we turn to look at the swirling mess of sky-smog the planes had left behind. Down in the lowlands, the blackness of the valley-smog seems to be stirring too.\nAs we reach the foot of the long cliff, Fong grunts from behind me.\n“Looks like it’s going to be a smog night.”\nOld Li grumbles, staring at the roiling blackness in the valleys below.\n“At this time of year.”\nDhampa is livid when we get back to the shop.\n“That damned L-box is worth more than all of your salaries combined!”\nHis hands fly back and forth over the dented contraption, like a father trying to comfort an injured child. He flicks the box on for a few test implosions, and only softens when he sees that it still works.\n“And where the hell did you get this sky, anyway? It won’t fetch half the price of your usual haul . . . ” He squints at the evanescing lapis that we’d gotten halfway down the mountain.\n“Something happened up on the mountain, Dhampa.”\n“We told you, boss,” says a middle-aged man from another troupe. “Something big happened. Something exploded.”\nDhampa stares us down as if waiting for an answer.\n“Well?”\nOld man Li shrugs. Our feet are bruised and our ears still thrum to the aftershocks of explosions. We are stiff-faced and silent, like a troupe that’s just lost a member to a rockslide or a loose footing. We know that something big has happened—we know in our bones that something has changed. But we haven’t the words to say anything out loud, not even to ourselves.\nAt night, we sleep with our breathers on. Mornings come in an indistinguishable haze of gray and black. Most days, we manage to make it three-quarters of the way to Big Sky Ridge before the explosions drive us away again. Our habitual climb up the mountain has become an unfamiliar minefield, and even the smog of the skies and valleys no longer follow their old, familiar convections. Through the breaks in the haze, we can see dark swirls churning up from the lowlands, as if the earth itself had opened up and was hungrily clawing for the sky.\n“It’s the middle of winter,” Old Li grumbles daily into the gray. “The valley-smog should have cleared up by now.”\nOn the sixth day, we’re almost run down on the road as we return to the city in the dark. A sudden halo of light swallows the smog-veiled highway behind us, and the convoy roars by in a blast of sound and grit, forcing Fong to jump the crumbling divider to avoid being hit. We gape dumbly in their wake. The night is silent, except for Fong cussing his brains out on the roadside.\n“Petrol cars,” Jinjin trembles with excitement. “Real-life petrol cars! They must be rich out of their minds!”\n“Only one place in town that lot can be headed,” old man Li mumbles.\nWe detour through the bureaucrats’ district on our way back to the shop. Most of the trucks have disappeared into the bowels of the canopied complex, but a few sit on the street outside, crouching like mythical beasts in the smog. Rough-looking army men flank the gates, ushering people in expensive-looking clothes into the compound. Some of their breathers look American-made, and I have to fight down a sudden urge to shout Stephan’s name down the street, as if he would perk up and come right out of the complex to greet me.\nBy the time we get back to the shop, dinner is already over. Fong grumbles as old lady Liu scoops the bottom-of-the-pot dregs into our bowls, and we suck down the gristle as quickly as we can. The mood in the shop is gloomier than usual. Dhampa does not even comment on the quality of our sky as we take inventory.\n“You hear about the petrol-trucks at the bureaucrats’ compound today?” Fong says, dumping his canisters on the counter. Dhampa hands him a meager wad of bills, eyes dark under his breather-mask. “Damn near ran us over on the main road . . . ”\n“It’s the same buggers who are making a mess up on the mountains, I’ll bet,” says one of the other troupe leaders. “Who else would be rich enough to ride around in petrol-machines?”\n“I heard they’re foreigners.” Jinjin bounces up and dumps his stash of canisters onto the counter.\n“Don’t be daft. We saw the army out there—they wouldn’t be working for foreigners.”\n“Nuh-uh. I heard they’ve come for the sky. Mama Liu says they’re going to put Dhampa out of business.”\nA collective hush falls on the hall. Dhampa slams the next few canisters onto the counter, and practically throws the money at Jinjin’s face.\n“Ah, come on, Dhampa. The kid doesn’t know what he’s saying.”\nDhampa does not respond. He stares bitterly out the pitch-black window, slamming canisters down on automatic. When the accounts are paid and the room has emptied, he pulls off his breather-mask and pours an entire flask of his foul-smelling tharra down his throat.\n“Goddamned rich folks and their petrol machines,” he mumbles as he stalks away. “Wave a profit in their face, and they bring down the entire goddamned sky.”\nDhampa’s old computer hums fitfully in the back room. I stuff my clothes into improvised rucksacks and wait for the machine to load. Fiber weave strains and cardboard groans as the bulging sacks are tied together.\nDhampa hadn’t given us much of a warning when he sold the shop, but most of us had seen it coming. The army men had been turning people away from the mountains for months, with incomprehensible explanations of “foreign partners” and “state-controlled enterprises.” Most troupes had no trouble taking the footpaths to get around them, but between the implosions and the constant smog, the entire operation had become a risky, unprofitable business. Every day is a smog day now, and we barely get the chance to take off our breathers, even during the cold nights.\nI turn and check on Dhampa’s old, clunking machine. There is nothing new in my electronic mailbox. Nothing from Stephan. Dhampa had laughed in my face when I told him that I was going to ask the foreigner’s advice.\n“You think a rich pug like him is going to care about your peasant problems?”\n“Why not? He said before that he was concerned about our situation—”\n“Your situation, boy. After all, you have nothing and you demand nothing. You are their perfect, doe-eyed little victim.”\nHe emptied his flask and walked away.\nI did not tell him that I hadn’t heard from Stephan in more than a year.\nThat night, I sleep in an empty room. Fong and Jinjin had left for the inland three days ago, and old man Li had gone down to the valleys. Most of the other troupes were finding work with the army men, who were supposedly paying two yuan per kilo to anyone interested in collecting the tian-zhi rocks that had fallen in the mountains.\nI close my eyes. Everything I own sits underneath my bunk, tied up in cardboard and fiber weave. The savings in my pocket are just enough to buy one train ticket as far as Chongqing. I pull my covers over my face, and try my best to shut out the what ifs and maybes that whirl around my mind.\nMaybe one day, I will follow Fong inland.\nMaybe one day, I will save up enough money to go to the rich cities along the coast, like Shanghai or Beijing. Maybe I will even travel far, far west, to America, and I will walk the streets of those impossible, gleaming cities, and find the people who brought the sky down on Xiao Hui Cheng.\nMaybe one day, I will get the chance to tell them to give it back.\nAlan Bao is an illustrator and multimedia designer currently bouncing around East Asia with no real plans or life goals. He has been known to occasionally write poetry and prose in order to cope with the bone-breaking emotional strain of drawing pretty pictures for a living.\nHis work has been published sporadically in places like Ricepaper and Cicada Magazine. He spends his free time traveling, jamming, and feeling vaguely under-qualified while browsing other people's author biographies."}