{"fingerprint": "dGgGQ9Swe/5jXYbsMpRlWvE/fGQ=", "sitename": "Clarkesworld Magazine", "title": "Martian Heart by John Barnes", "author": "John Barnes", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/barnes_02_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Martian Heart by John Barnes", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6640 words, short story, REPRINT\nMartian Heart\nOkay, botterogator, I agreed to this. Now you’re supposed to guide me to tell my story to inspire a new generation of Martians. It is so weird that there is a new generation of Martians. So hit me with the questions, or whatever it is you do.\nDo I want to be consistent with previous public statements?\nWell, every time they ask me where I got all the money and got to be such a big turd in the toilet that is Mars, I always say Samantha was my inspiration. So let’s check that box for tentatively consistent.\nThinking about Sam always gives me weird thoughts. And here are two: one, before her, I would not have known what either tentatively or consistent even meant. Two, in these pictures, Samantha looks younger than my granddaughter is now.\nSo weird. She was.\nWe were in bed in our place under an old underpass in LA when the sweeps busted in, grabbed us up, and dragged us to the processing station. No good lying about whether we had family—they had our retinas and knew we were strays. Since I was seventeen and Sam was fifteen, they couldn’t make any of our family pay for re-edj.\nSo they gave us fifteen minutes on the bench there to decide between twenty years in the forces, ten years in the glowies, or going out to Mars on this opposition and coming back on the third one after, in six and a half years.\nThey didn’t tell you, and it wasn’t well-known, that even people without the genetic defect suffered too much cardiac atrophy in that time to safely come back to Earth. The people that went to Mars didn’t have family or friends to write back to, and the settlement program was so new it didn’t seem strange that nobody knew a returned Martian.\n“Crap,” I said.\n“Well, at least it’s a future.” Sam worried about the future a lot more than me. “If we enlist, there’s no guarantee we’ll be assigned together, unless we’re married, and they don’t let you get married till you’ve been in for three. We’d have to write each other letters—”\n“Sam,” I said, “I can’t write to you or read your letters if you send me any. You know that.”\n“They’d make you learn.”\nI tried not to shudder visibly; she’d get mad if I let her see that I didn’t really want to learn. “Also, that thing you always say about out of sight, that’d happen. I’d have another girlfriend in like, not long. I just would. I know we’re all true love and everything but I would.”\n“The spirit is willing but the flesh is more willing.” She always made those little jokes that only she got. “Okay, then, no forces for us.”\n“Screw glowies,” I said. Back in those days right after the baby nukes had landed all over the place, the Decon Admin needed people to operate shovels, hoes, and detectors. I quoted this one hook from our favorite music. “Sterile or dead or kids with three heads.”\n“And we can get married going to Mars,” Sam said, “and then they can’t separate us. True love forever, baby.” Sam always had all the ideas.\nSo, botterogator, check that box for putting a priority on family/love. I guess since that new box popped up as soon as I said, Sam always had all the ideas, that means you want more about that? Yeah, now it’s bright and bouncing. Okay, more about how she had all the ideas.\nReally all the ideas I ever had were about eating, getting high, and scoring ass. Hunh. Red light. Guess that wasn’t what you wanted for the new generation of Martians.\nSam was different. Everybody I knew was thinking about the next party or at most the next week or the next boy or girl, but Sam thought about everything. I know it’s a stupid example, but once back in LA, she came into our squat and found me fucking with the fusion box, just to mess with it. “That supplies all our power for music, light, heat, net, and everything, and you can’t fix it if you break it, and it’s not broke, so, Cap, what the fuck are you doing?”\nSee, I didn’t even have ideas that good.\nSo a year later, there on the bench, our getting married was her having another idea and me going along with it, which was always how things worked, when they worked. Ten minutes later we registered as married.\nOrientation for Mars was ten days. The first day they gave us shots, bleached our tats into white blotches on our skin, and shaved our heads. They stuck us in ugly dumb coveralls and didn’t let us have real clothes that said anything, which they said was so we wouldn’t know who’d been what on Earth. I think it was more so we all looked like transportees.\nThe second day, and every day after, they tried to pound some knowledge into us. It was almost interesting. Sam was in with the people that could read, and she seemed to know more than I did afterward. Maybe there was something to that reading stuff, or it might also have been that freaky, powerful memory of hers.\nOnce we were erased and oriented, they loaded Sam and me into a two-person cube on a dumpround to Mars. Minutes after the booster released us and we were ballistic, an older guy, some asshole, tried to come into our cube and tell us this was going to be his space all to himself, and I punched him hard enough to take him out; I don’t think he had his balance for centrifigrav yet.\nTwo of his buds jumped in. I got into it with them too—I was hot, they were pissing me off, I wasn’t figuring odds. Then some guys from the cubes around me came in with me, and together we beat the other side’s ass bloody.\nIn the middle of the victory whooping, Sam shouted for quiet. She announced, “Everyone stays in their same quarters. Everyone draws their own rations. Everyone takes your turn, and just your turn, at the info screens. And nobody doesn’t pay for protection or nothing.”\nOne of the assholes, harmless now because I had at least ten good guys at my back, sneered, “Hey, little bitch. You running for Transportee Council?”\n“Sure, why not?”\nShe won, too.\nThe Transportee Council stayed in charge for the whole trip. People ate and slept in peace, and no crazy-asses broke into the server array, which is what caused most lost dumprounds. They told us in orientation, but a lot of transportees didn’t listen, or didn’t understand, or just didn’t believe that a dumpround didn’t have any fuel to go back to Earth; a dumpround flew like a cannon ball, with just a few little jets to guide it in and out of the aerobrakes and steer it to the parachute field.\nThe same people who thought there was a steering wheel in the server array compartment, or maybe a reverse gear or just a big button that said TAKE US BACK TO EARTH, didn’t know that the server array also ran the air-making machinery and the food dispensary and everything that kept people alive.\nI’m sure we had as many idiots as any other dumpround, but we made it just fine; that was all Sam, who ran the TC and kept the TC running the dumpround. The eighty-eight people on International Mars Transport 2082/4/288 (which is what they called our dumpround; it was the 288th one fired off that April) all walked out of the dumpround on Mars carrying our complete, unlooted kits, and the militia that always stood by in case a dumpround landing involved hostages, arrests, or serious injuries didn’t have a thing to do about us.\nThe five months in the dumpround were when I learned to read, and that has helped me so much—oh, hey, another box bumping up and down! Okay, botterogator, literacy as a positive value coming right up, all hot and ready for the new generation of Martians to suck inspiration from.\nHey, if you don’t like irony, don’t flash red lights at me, just edit it out. Yeah, authorize editing.\nAnyway, with my info screen time, Sam made me do an hour of reading lessons for every two hours of games. Plus she coached me a lot. After a while the reading was more interesting than the games, and she was doing TC business so much of the time, and I didn’t really have any other friends, so I just sat and worked on the reading. By the time we landed, I’d read four actual books, not just kid books I mean.\nWe came down on the parachute field at Olympic City, an overdignified name for what, in those long-ago days, was just two office buildings, a general store, and a nine-room hotel connected by pressurized tubes. The tiny pressurized facility was surrounded by a few thousand coffinsquats hooked into its pay air and power, and many thousand more running on their own fusion boxes. Olympica, to the south, was just a line of bluffs under a slope reaching way up into the sky.\nIt was the beginning of northern summer prospecting season. Sam towed me from lender to lender, coaching me on looking like a good bet to someone that would trust us with a share-deal on a prospecting gig. At the time I just thought rocks were, you know, rocks. No idea that some of them were ores, or that Mars was so poor in so many ores because it was dead tectonically.\nSo while she talked to bankers, private lenders, brokers, and plain old loan sharks, I dummied up and did my best to look like what she told them I was, a hard worker who would do what Sam told me. “Cap is quiet but he thinks, and we’re a team.”\nShe said that so often that after a while I believed it myself. Back at our coffinsquat every night, she’d make me do all the tutorials and read like crazy about rocks and ores. Now I can’t remember how it was to not know something, like not being able to read, or recognize ore, or go through a balance sheet, or anything else I learned later.\nTwo days till we’d’ve gone into the labor pool and been shipped south to build roads and impoundments, and this CitiWells franchise broker, Hsieh Chi, called us back, and said we just felt lucky to him, and he had a quota to make, so what the hell.\nSam named our prospector gig the Goodspeed after something she’d read in a poem someplace, and we loaded up, got going, did what the software told us, and did okay that first summer around the North Pole, mostly.\nGoodspeed was old and broke down continually, but Sam was a good directions-reader, and no matter how frustrating it got, I’d keep trying to do what she was reading to me—sometimes we both had to go to the dictionary, I mean who knew what a flange, a fairing, or a flashing was?—and sooner or later we'd get it figured out and roll again.\nYeah, botterogator, you can check that box for persistence in the face of adversity. Back then I’d’ve said I was just too dumb to quit if Sam didn’t, and Sam was too stubborn.\nUp there in the months and months of midnight sun, we found ore, and learned more and more about telling ore from not-ore. The gig’s hopper filled up, gradually, from surface rock finds. Toward the end of that summer—it seemed so weird that Martian summers were twice as long as on Earth even after we read up about why—we even found an old volcanic vent and turned up some peridot, agate, amethyst, jasper, and garnet, along with three real honest-to-god impact diamonds that made us feel brilliant. By the time we got back from the summer prospecting, we were able to pay off Hsieh Chi’s shares, with enough left over to buy the gig and put new treads on it. We could spare a little to rehab the cabin too; Goodspeed went from our dumpy old gig to our home, I guess. At least in Sam’s mind. I wasn’t so sure that home meant a lot to me.\nBotterogator if you want me to inspire the new generation of Martians, you have to let me tell the truth. Sam cared about having a home, I didn’t. You can flash your damn red light. It’s true.\nAnyway, while the fitters rebuilt Goodspeed, we stayed in a rented cabinsquat, sleeping in, reading, and eating food we didn’t cook. We soaked in the hot tub at the Riebecker Olympic every single day—the only way Sam got warm. Up north, she had thought she was cold all the time because we were always working, she was small, and she just couldn’t keep weight on no matter how much she ate, but even loafing around Olympic City, where the most vigorous thing we did was nap in the artificial sun room, or maybe lift a heavy spoon, she still didn’t warm up.\nWe worried that she might have pneumonia or TB or something she’d brought from Earth, but the diagnostic machines found nothing unusual except being out of shape. But Sam had been doing so much hard physical work, her biceps and abs were like rocks, she was strong. So we gave up on the diagnosis machines, because that made no sense.\nNowadays everyone knows about Martian heart, but back then nobody knew that hearts atrophy and deposit more plaque in lower gravity, as the circulation slows down and the calcium that should be depositing into bones accumulates in the blood. Let alone that maybe a third of the human race have genes that make it happen so fast.\nAt the time, with no cases identified, it wasn’t even a research subject; so many people got sick and died in the first couple decades of settlement, often in their first Martian year, and to the diagnostic machines it was all a job, ho hum, another day, another skinny nineteen-year-old dead of a heart attack. Besides, all the transportees, not just the ones that died, ate so much carb-and-fat food, because it was cheap. Why wouldn’t there be more heart attacks? There were always more transportees coming, so put up another site about healthful eating for Mars, and find something else to worry about.\nChecking the diagnosis machine was everything we could afford to do, anyway, but it seemed like only a small, annoying worry. After all, we’d done well, bought our own gig, were better geared up, knew more what we were doing. We set out with pretty high hopes.\nGoodspeed was kind of a dumb name for a prospector’s gig. At best it could make maybe 40 km/hr, which is not what you call roaring fast. Antarctic summer prospecting started with a long, dull drive down to Promethei Lingula, driving south out of northern autumn and into southern spring. The Interpolar Highway in those days was a gig track weaving southward across the shield from Olympic City to the Great Marineris Bridge. There was about 100 km of pavement, sort of, before and after the bridge, and then another gig track angling southeast to wrap around Hellas, where a lot of surface prospectors liked to work, and there was a fair bit of seasonal construction to be done on the city they were building in the western wall.\nBut we were going far south of Hellas. I asked Sam about that. “If you’re cold all the time, why are we going all the way to the edge of the south polar cap? I mean, wouldn’t it be nicer to maybe work the Bouches du Marineris or someplace near the equator, where you could stay a little warmer?”\n“Cap, what’s the temperature in here, in the gig cabin?”\n“Twenty-two C,” I said, “do you feel cold?”\n“Yeah, I do, and that’s my point,” she said. I reached to adjust the temperature, and she stopped me. “What I mean is, that’s room temperature, babe, and it’s the same temperature it is in my suit, and in the fingers and toes of my suit, and everywhere. The cold isn’t outside, and it doesn’t matter whether it’s the temperature of a warm day on Earth or there’s CO2 snow falling, the cold’s in here, in me, ever since we came to Mars.”\nThe drive was around 10,000 km as the road ran, but mostly it was pleasant, just making sure the gig stayed on the trail as we rolled past the huge volcanoes, the stunning view of Marineris from that hundred-mile-long bridge, and then all that ridge and peak country down south.\nMostly Sam slept while I drove. Often I rested a hand on her neck or forehead as she dozed in the co-driver's chair. Sometimes she shivered; I wondered if it was a long-running flu. I made her put on a mask and get extra oxygen, and that helped, but every few weeks I had to up her oxygen mix again.\nAll the way down I practiced pronouncing Promethei Lingula, especially after we rounded Hellas, because Sam looked a little sicker every week, and I was so afraid she’d need help and I wouldn’t be able to make a distress call.\nSam figured Promethei Lingula was too far for most people—they’d rather pick through Hellas’s or Argyre’s crater walls, looking for chunks of something worthwhile thrown up from deep underground in those impacts, and of course the real gamblers always wanted to work Hellas because one big Hellas Diamond was five years' income.\nSam already knew what it would take me fifteen marsyears to learn: she believed in making a good bet that nobody else was making. Her idea was that a shallow valley like the Promethei Lingula in the Antarctic highlands might have more stuff swept down by the glaciers, and maybe even some of the kinds of exposed veins that really old mountains had on Earth.\nAs for what went wrong, well, nothing except our luck; nowadays I own three big veins down there. No, botterogator, I don’t feel like telling you a damned thing about what I own, you’re authorized to just look all that up. I don’t see that owning stuff is inspiring. I want to talk about Sam.\nWe didn’t find any veins, or much of anything else, that first southern summer. And meanwhile Sam’s health deteriorated.\nBy the time we were into Promethei Lingula, I was fixing most meals and doing almost all the maintenance. After the first weeks I did all the exosuit work, because her suit couldn’t seem to keep her warm, even on hundred percent oxygen. She wore gloves and extra socks even inside. She didn’t move much, but her mind was as good as ever, and with her writing the search patterns and me going out and grabbing the rocks, we could still’ve been okay.\nExcept we needed to be as lucky as we’d been up in Boreas, and we just weren’t.\nLook here, botterogator, you can’t make me say luck had nothing to do with it. Luck always has a shitload to do with it. Keep this quibbling up and just see if I inspire any new Martians.\nSometimes there’d be a whole day when there wasn’t a rock that was worth tossing in the hopper, or I’d cover a hundred km of nothing but common basalts and granites. Sam thought her poor concentration made her write bad search patterns, but it wasn’t that; it was plain bad luck.\nAutumn came, and with it some dust storms and a sun that spiraled closer to the horizon every day, so that everything was dimmer. It was time to head north; we could sell the load, such as it was, at the depot at Hellas, but by the time we got to the Bouches de Marineris, it wouldn’t cover more than a few weeks of prospecting. We might have to mortgage again; Hsieh Chi, unfortunately, was in the Vikingsburg pen for embezzling. “Maybe we could hustle someone, like we did him.”\n“Maybe I could, babe,” Sam said. “You know the business a lot better, but you’re still nobody’s sales guy, Cap. We’ve got food enough for another four months out here, and we still have credit because we’re working and we haven’t had to report our hold weight. Lots of gigs stay out for extra time—some even overwinter—and nobody can tell whether that’s because they’re way behind like us, or they’ve found a major vein and they’re exploiting it. So we can head back north, use up two months of supplies to get there, buy about a month of supplies with the cargo, go on short term credit only, and try to get lucky in one month. Or we can stay here right till we have just enough food to run for the Hellas depot, put in four months, and have four times the chance. If it don't work Goodspeed’ll be just as lost either way.”\n“It’s going to get dark and cold,” I pointed out. “Very dark and cold. And you’re tired and cold all the time now.”\n“Dark and cold outside the cabin,” she said. Her face had the stubborn set that meant this was going to be useless. “And maybe the dark’ll make me eat more. All the perpetual daylight, maybe that’s what’s screwing my system up. We’ll try the Bouches du Marineris next time, maybe those nice regular equatorial days'll get my internal clock working again. But for right now, let’s stay here. Sure, it’ll get darker, and the storms can get bad—”\n“Bad as in we could get buried, pierced by a rock on the wind, maybe even flipped if the wind gets in under the hull,” I pointed out. “Bad as in us and the sensors can only see what the spotlights can light. There’s a reason why prospecting is a summer job.”\nShe was quiet about that for so long I thought a miracle had happened and I’d won an argument.\nThen she said, “Cap, I like it here in Goodspeed. It’s home. It’s ours. I know I’m sick, and all I can do these days is sleep, but I don’t want to go to some hospital and have you only visit on your days off from a labor crew. Goodspeed is ours and I want to live here and try to keep it.”\nSo I said yes.\nFor a while things got better. The first fall storms were water snow, not CO2. I watched the weather reports and we were always buttoned up tight for every storm, screens out and treads sealed against the fine dust. In those brief weeks between midnight sun and endless night, when the sun rises and sets daily in the Promethei Lingula, the thin coat of snow and frost actually made the darker rocks stand out on the surface, and there were more good ones to find, too.\nSam was cold all the time; sometimes she’d cry with just wanting to be warm. She’d eat, when I stood over her and made her, but she had no appetite. I also knew how she thought: Food was the bottleneck. A fusion box supplied centuries of power to move, to compress and process the Martian air into breathability, to extract and purify water. But we couldn’t grow food, and unlike spare parts or medical care we might need now and then, we needed food every day, so food would be the thing we ran out of first. (Except maybe luck, and we were already out of that). Since she didn’t want the food anyway, she thought if she didn’t eat we could stay out and give our luck more of a chance to turn.\nThe sun set for good; so far south, Phobos was below the horizon; cloud cover settled in to block the stars. It was darker than anywhere I’d ever been. We stayed.\nThere was more ore in the hold but not enough more. Still no vein. We had a little luck at the mouth of one dry wash with a couple tons of ore in small chunks, but it played out in less than three weeks.\nNext place that looked at all worth trying was 140 km south, almost at the edge of the permanent cap, crazy and scary to try, but what the hell, everything about this was crazy and scary.\nThe sky had cleared for the first time in weeks when we arrived. With just a little CO2 frost, it was easy to find rocks—the hot lights zapped the dry ice right off them. I found one nice big chunk of wolframite, the size of an old trunk, right off the bat, and then two smaller ones; somewhere up the glacial slopes from here, there was a vein, perhaps not under permanent ice. I started the analytic program mapping slopes and finds, and went out in the suit to see if I could find and mark more rocks.\nMarkeb, which I’d learned to pick out of the bunched triangles of the constellation Vela, was just about dead overhead; it’s the south pole star on Mars. It had been a while since I’d seen the stars, and I’d learned more about what I was looking at. I picked out the Coal Sack, the Southern Cross, and the Magellanic Clouds easily, though honestly, on a clear night at the Martian south pole, that’s like being able to find an elephant in a bathtub.\nI went inside; the analysis program was saying that probably the wolframite had come from way up under the glacier, so no luck there, but also that there might be a fair amount of it lying out here in the alluvial fan, so at least we’d pick up something here. I stood up from the terminal; I’d fix dinner, then wake Sam, feed her, and tell her the semi-good news.\nWhen I came in with the tray, Sam was curled up, shivering and crying. I made her eat all her soup and bread, and plugged her in to breathe straight body-temperature oxygen. When she was feeling better, or at least saying she was, I took her up into the bubble to look at the stars with the lights off. She seemed to enjoy that, especially that I could point to things and show them to her, because it meant I’d been studying and learning.\nYeah, botterogator, reinforce that learning leads to success. Sam’d like that.\n“Cap,” she said, “This is the worst it’s been, babe. I don’t think there’s anything on Mars that can fix me. I just keep getting colder and weaker. I’m so sorry—”\n“I’m starting for Hellas as soon as we get you wrapped up and have pure oxygen going into you in the bed. I’ll drive as long as I can safely, then—”\n“It won’t make any difference. You’ll never get me there, not alive,” she said. “Babe, the onboard diagnostic kit isn’t perfect but it’s good enough to show I’ve got the heart of a ninety-year-old cardiac patient. And all the indicators have gotten worse in just the last hundred hours or so. Whatever I’ve got, it’s killing me.” She reached out and stroked my tear-soaked face. “Poor Cap. Make me two promises.”\n“I’ll love you forever.”\n“I know. I don’t need you to promise that. First promise, no matter where you end up, or doing what, you learn. Study whatever you can study, acquire whatever you can acquire, feed your mind, babe. That’s the most important.”\nI nodded. I was crying pretty hard.\n“The other one is kind of weird . . . well, it’s silly.”\n“If it’s for you, I’ll do it. I promise.”\nShe gasped, trying to pull in more oxygen than her lungs could hold. Her eyes were flowing too. “I’m scared to be buried out in the cold and the dark, and I can’t stand the idea of freezing solid. So . . . don’t bury me. Cremate me. I want to be warm.”\n“But you can’t cremate a person on Mars,” I protested. “There’s not enough air to support a fire, and—”\n“You promised,” she said, and died.\nI spent the next hour doing everything the first aid program said to do. When she was cold and stiff, I knew it had really happened.\nI didn’t care about Goodspeed anymore. I’d sell it at Hellas depot, buy passage to some city where I could work, start over. I didn’t want to be in our home for weeks with Sam’s body, but I didn’t have the money to call in a mission to retrieve her, and anyway they’d just do the most economical thing—bury her right here, practically at the South Pole, in the icy night.\nI curled up in my bunk and just cried for hours, then let myself fall asleep. That just made it worse; now that she was past rigor mortis she was soft to the touch, more like herself, and I couldn’t stand to store her in the cold, either, not after what I had promised. I washed her, brushed her hair, put her in a body bag, and set her in one of the dry storage compartments with the door closed; maybe I’d think of something before she started to smell.\nDriving north, I don’t think I really wanted to live, myself. I stayed up too long, ate and drank too little, just wanting the journey to be over with. I remember I drove right through at least one bad storm at peak speed, more than enough to shatter a tread on a stone or to go into a sudden crevasse or destroy myself in all kinds of ways. For days in a row, in that endless black darkness, I woke up in the driver’s chair after having fallen asleep while the deadman stopped the gig.\nI didn’t care. I wanted out of the dark.\nAbout the fifth day, Goodspeed’s forward left steering tread went off a drop-off of three meters or so. The gig flipped over forward to the left, crashing onto its back. Force of habit had me strapped into the seat, and wearing my suit, the two things that the manuals the insurance company said were what you had to be doing any time the gig was moving if you didn’t want to void your policy. Sam had made a big deal about that, too.\nSo after rolling, Goodspeed came to a stop on its back, and all the lights went out. When I finished screaming with rage and disappointment and everything else, there was still enough air (though I could feel it leaking) for me to be conscious.\nI put on my helmet and turned on the headlamp.\nI had a full capacitor charge on the suit, but Goodspeed’s fusion box had shut down. That meant seventeen hours of being alive unless I could replace it with another fusion box, but both the compartment where the two spare fusion boxes were stored, and the repair access to replace them, were on the top rear surface of the gig. I climbed outside, wincing at letting the last of the cabin air out, and poked around. The gig was resting on exactly the hatches I would have needed to open.\nSeventeen—well, sixteen, now—hours. And one big promise to keep.\nThe air extractors on the gig had been running, as they always did, right up till the accident; the tanks were full of liquid oxygen. I could transfer it to my suit through the emergency valving, live for some days that way. There were enough suit rations to make it a real race between starvation and suffocation. The suit radio wasn’t going to reach anywhere that could do me any good; for long distance it depended on a relay through the gig, and the relay’s antenna was under the overturned gig.\nSam was dead. Goodspeed was dead. And for every practical purpose, so was I.\nNeither Goodspeed nor I really needed that oxygen anymore, but Sam does, I realized. I could at least shift the tanks around, and I had the mining charges we used for breaking up big rocks.\nI carried Sam’s body into the oxygen storage, set her between two of the tanks, and hugged the body bag one more time. I don’t know if I was afraid she’d look awful, or afraid she would look alive and asleep, but I was afraid to unzip the bag.\nI set the timer on a mining charge, put that on top of her, and piled the rest of the charges on top. My little pile of bombs filled most of the space between the two oxygen tanks. Then I wrestled four more tanks to lie on the heap crosswise and stacked flammable stuff from the kitchen like flour, sugar, cornmeal, and jugs of cooking oil on top of those, to make sure the fire burned long and hot enough.\nMy watch said I still had five minutes till the timer went off.\nI still don’t know why I left the gig. I’d been planning to die there, cremated with Sam, but maybe I just wanted to see if I did the job right or something—as if I could try again, perhaps, if it didn’t work? Whatever the reason, I bounded away to what seemed like a reasonable distance.\nI looked up; the stars were out. I wept so hard I feared I would miss seeing them in the blur. They were so beautiful, and it had been so long.\nTwenty kilograms of high explosive was enough energy to shatter all the LOX tanks and heat all the oxygen white hot. Organic stuff doesn’t just burn in white-hot oxygen; it explodes and vaporizes, and besides fifty kilograms of Sam, I’d loaded in a good six hundred kilograms of other organics.\nI figured all that out a long time later. In the first quarter second after the mining charge went off, things were happening pretty fast. A big piece of the observation bubble—smooth enough not to cut my suit and kill me, but hard enough to send me a couple meters into the air and backward by a good thirty meters—slapped me over and sent me rolling down the back side of the ridge on which I sat, smashed up badly and unconscious, but alive.\nI think I dreamed about Sam, as I gradually came back to consciousness.\nNow, look here, botterogator, of course I’d like to be able, for the sake of the new generation of Martians, to tell you I dreamed about her giving me earnest how-to-succeed advice, and that I made a vow there in dreamland to succeed and be worthy of her and all that. But in fact it was mostly just dreams of holding her and being held, and about laughing together. Sorry if that’s not on the list.\nThe day came when I woke up and realized I’d seen the medic before. Not long after that I stayed awake long enough to say “hello.” Eventually I learned that a survey satellite had picked up the exploding gig, and shot pictures because that bright light was unusual. An AI identified a shape in the dust as a human body lying outside, and dispatched an autorescue—a rocket with a people-grabbing arm. The autorescue flew out of Olympic City’s launch pad on a ballistic trajectory, landed not far from me, crept over to my not-yet-out-of-air, not-yet-frozen body, grabbed me with a mechanical arm, and stuffed me into its hold. It took off again, flew to the hospital, and handed me over to the doctor.\nTotal cost of one autorescue mission, and two weeks in a human-contact hospital—which the insurance company refused to cover because I’d deliberately blown up the gig—was maybe twenty successful prospecting runs’ worth. So as soon as I could move, they indentured me and, since I was in no shape to do grunt-and-strain stuff for a while, they found a little prospector’s supply company that wanted a human manager for an office at the Hellas depot. I learned the job—it wasn’t hard—and grew with the company, eventually as Mars’s first indentured CEO.\nI took other jobs, bookkeeping, supervising, cartography, anything where I could earn wages with which to pay off the indenture faster, especially jobs I could do online in my nominal hours off. At every job, because I’d promised Sam, I learned as much as I could. Eventually, a few days before my forty-third birthday, I paid off the indenture, quit all those jobs, and went into business for myself.\nBy that time I knew how the money moved, and for what, in practically every significant business on Mars. I’d had a lot of time to plan and think, too.\nSo that was it. I kept my word—oh, all right, botterogator, let’s check that box too. Keeping promises is important to success. After all, here I am.\nSixty-two earthyears later, I know, because everyone does, that a drug that costs almost nothing, which everyone takes now, could have kept Sam alive. A little money a year, if anyone’d known, and Sam and me could’ve been celebrating anniversaries for decades, and we’d’ve been richer, with Sam’s brains on the job too. And botterogator, you’d be talking to her, and probably learning more, too.\nOr is that what I think now?\nRemembering Sam, over the years, I’ve thought of five hundred things I could have done instead of what I did, and maybe I’d have succeeded as much with those too.\nBut the main question I think about is only—did she mean it? Did she see something in me that would make my bad start work out as well as it did? Was she just an idealistic smart girl playing house with the most cooperative boy she could find? Would she have wanted me to marry again and have children, did she intend me to get rich?\nEvery so often I regret that I didn’t really fulfill that second promise, an irony I can appreciate now: she feared the icy grave, but since she burned to mostly water and carbon dioxide, on Mars she became mostly snow. And molecules are so small, and distribute so evenly, that whenever the snow falls, I know there’s a little of her in it, sticking to my suit, piling on my helmet, coating me as I stand in the quiet and watch it come down.\nDid she dream me into existence? I kept my promises, and they made me who I am . . . and was that what she wanted? If I am only the accidental whim of a smart teenage girl with romantic notions, what would I have been without the whim, the notions, or Sam?\nTell you what, botterogator, and you pass this on to the new generation of Martians: it’s funny how one little promise, to someone or something a bit better than yourself, can turn into something as real as Samantha City, whose lights at night fill the crater that spreads out before me from my balcony all the way to the horizon.\nNowadays I have to walk for an hour, in the other direction out beyond the crater wall, till the false dawn of the city lights is gone, and I can walk till dawn or hunger turns me homeward again.\nBotterogator, you can turn off the damn stupid flashing lights. That’s all you’re getting out of me. I’m going for a walk; it’s snowing.\nOriginally published in Life on Mars, edited by Jonathan Strahan, 2011.\nJohn Barnes has thirty-one commercially published and two self-published novels, some of them to his credit, along with hundreds of magazine articles, short stories, blog posts, and encyclopedia articles. Most of his life he has written professionally, and for much of it he has been some kind of teacher, and in between he has held a large number of odd jobs involving math, show business, politics, and marketing, which have more in common than you'd think. He is married and lives in Denver."}