{"fingerprint": "2o8awBHRNQ5sOEYydXwiG8EBYD4=", "sitename": "Clarkesworld Magazine", "title": "Jazz Music and Greek Myths: A Conversation with Peter S. Beagle by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/beagle_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Jazz Music and Greek Myths: A Conversation with Peter S. Beagle by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Jazz Music and Greek Myths: A Conversation with Peter S. Beagle\n Stories and jazz music go hand in hand. Imagination lays the foundation built on a feeling until structure emerges. The plot twists, the characters evolve, and what you end up with is something far more than the sum of its parts.\n Peter S. Beagle has always been an author with an ear for beautiful writing. His work has always been deceptively simple. From his short fiction set in New York City to his beloved novel The Last Unicorn, Beagle has been delighting readers with his mastery of language and heartfelt storytelling. His latest novel Summerlong, is no exception. Set in the Pacific Northwest, it features his subtle brand of fantasy entwined within the lives of people living by Puget Sound.\n Peter S. Beagle is the author of numerous short stories, novels, and screenplays. He is best known as the author of The Last Unicorn. He has won the Hugo, Nebula, Locus, and Mythopoeic Fantasy Awards. His latest novel, Summerlong, was published by Tachyon in September.\n When did you know you wanted to be a writer?\n I wanted to be a writer, literally before I could write. I used to make up stories and get my mother to write them down—and frequently illustrate them, now that I think of it. (Actually, I still dream of being a great finger-style jazz guitarist, like Chet Atkins, Jerry Reed, Marcel Dadi, or Guy Van Duser.) On the one hand, somehow knowing the only thing I was fit for in this world was telling stories obviously had its uses in teaching me to take work, and everything about it, seriously. But could there ever have been some other road not taken for me? Okay, playing first base for the Yankees was definitely out—but still . . .\n How are music and writing interconnected for you?\n I always think in terms of music—especially jazz—when I work, whether or not I’m actually listening to anything. Dialogue clashing or criss-crossing in my head can sound to me like a woodwind quartet; a passage of description may be in some way prodded into existence by memories of Miles Davis’ Sketches of Spain, or images of Sonny Rollins practicing alone on the Brooklyn Bridge at night. The Brandenburg Concerto #5 always brings certain people from important times in my life back into my voice, however silently. The music’s always there.\n Can you play any instruments or are you primarily a singer?\n I learned to read music on the piano, but guitar’s the only instrument I’ve ever learned to play. Singing is quite possibly my greatest joy, and I’m still proud—even thirty years after the fact—of having sung in a French restaurant in Santa Cruz for twelve years on weekends. I sang mostly in French—the songs of Georges Brassens (my one guru, if you will), and those of Charles Aznavour, Leo Ferre, Jacques Brel, and Jean Ferrat. Sometimes I’d go all evening without singing anything in English; on others, I’d break in something in Spanish or Yiddish, or even Bernie Kalb’s charming “Frog-Kissing,” to a dinner audience who had no idea that I spoke English. It was pure theater—a mask, nothing at all to do with writing—and I loved it deeply. More recently, I’ve gotten to sing with musician friends who have their own bands and small groups, and it never changes—I walk away saying to myself, “God, this is so much more fun than writing!” It still is.\n Why did you choose to set Summerlong in the Pacific Northwest?\n I lived in Seattle for six years (well, one year in Seattle proper, and five on Bainbridge Island, six miles offshore), but Summerlong didn’t begin to happen until I’d been gone from the Northwest for about a decade. I’ve no idea why that should be so . . . perhaps simply because it takes me a long time to realize what I’m looking at. Reviewers have complimented me specifically on my sense of the atmosphere of Seattle and Puget Sound, which pleases me a great deal. It’s something I admire in other writers, whether they’re dealing in genre fantasy or the grittiest realism, and I’m rarely sure that I’m getting it right myself.\n The characters in Summerlong feel complex and real. How do you create characters like Abe, Lily, and Lioness? Are they a pastiche of traits you’ve picked up from people or more formed completely from your imagination?\n My characters are always a mixed bag. Abe’s got a good deal of my more aggravating characteristics, certainly. Joanna is based, in her occupation, on a very sweet neighbor who lived downstairs from me in Seattle. In her personality—not to mention her love for basketball and rollerblading—on a dear friend who was once my literary agent. Lioness . . . well, I really do know a remarkable lady in Portland, Oregon, by that name. And Lily—my favorite character, or anyway the one who touches me the most deeply—Lily just came out of nowhere, the way it happens when I’m lucky. Mostly my characters begin as voices in my head, as they always have. It’s all right: I’m officially a Writer—an Artist—so I’m entitled to hear voices. I can produce a license whenever requested.\n What was it about the story of Persephone that inspired you?\n Persephone actually got me into college, by the way. I was so intrigued by the legend that I wrote a sonnet, “Persephone In September,” which my high-school creative writing teacher Mollie Epstein—may her name and all her descendants be blessed for a thousand generations—submitted to Scholastic Magazine’s annual writing contest. The winner—that little old failing-in-everything-but-English-and-history, me—received a full tuition scholarship to the University of Pittsburgh.\n The fantastical aspects of Summerlong can be subtle and intertwine seamlessly with reality within your novel. Do you find there is a bit of fantasy to be found in reality?\n I’ve always thought of fantasy as that thing that exists just to the side of my peripheral vision, so to speak; but the moment I snap my head around for a full view . . . it’s just gone. I have written non-fantasy works (spent a fellowship year at Stanford, in a class with people like Larry McMurtry, Ken Kesey, Jim Hall, Judy Rascoe, Joanna Macdonald and others, and spent it writing a godawful novel about a young musician in Paris); but very little of it could ever be considered fantasy. It just seems to be the way I think, from my earliest childhood all the way to . . . well, to where I am. Wherever that actually is.\n In addition to novels and short stories, you’ve also written a number of screenplays. What did you learn from your time writing for the screen?\n Screenwriting—the small amount of it that I’ve done over the years—if it’s taught me anything, has taught me not to think in strictly linear ways. The form is so much a modular one that I’ve learned that if a scene doesn’t work in its present location, try moving it around, or reshaping it in a different style. One does that with fiction, of course, but I take a long time to learn certain things, and for me it was movie work that dislodged me from my stubborn adherence to the same technique.\n Do you have any plans to write more short fiction set in NYC?\n I have no idea whether I’ll ever again set a story in New York City. The city I grew up in is long gone, in so many ways, and so am I. But in the words of the great Fats Waller, which I quote more often than I should, “One never know, do one?” And as an artist, I always think of an interview with the trumpet player Roy Eldridge, in which he said, “The trumpet is a mean instrument, man. You come to the club one night, and everything comes out through the instrument—everything you ever felt, or thought, or were—and you go home thinking, ‘Wow, forty, fifty years at it, and finally I understand the trumpet!’ And you come to work the next night, and you pick up the trumpet, and the trumpet says, ‘Hey, fuck you, man!’”\n Writing’s like that.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}