{"fingerprint": "Ry1Q+5lS9rZlbzp92zBLmIxIMOk=", "sitename": "Clarkesworld Magazine", "title": "Hard Truths in Our World: A Conversation with Bradley P. Beaulieu by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/beaulieu_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Hard Truths in Our World: A Conversation with Bradley P. Beaulieu by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nHard Truths in Our World: A Conversation with Bradley P. Beaulieu\nThe world of Bradley P. Beaulieu’s, The Lays of Anuskaya trilogy expands ever outward, with windships, mountain peaks, elemental spirits and archipelagos, greed and revenge—endlessly fascinating, always wondrous and evocative, even as the internal conflicts twist and swell and threaten to break even the strongest character.\nHere is world-building at its best—character and setting intertwined, the interior and exterior landscapes equally compelling, and in constant interaction with each other.\nIt’s hard to believe that the two entities—the world and the characters—haven’t been created together, simultaneously.\n“I really enjoy the character creation process,” said Beaulieu, “but I’ll be honest, I don’t do much of it until I’ve completed the world-building to a fairly large degree.”\nWhy? How? What good is a farmer without a farm? A seed without soil?\n“The cultures and their histories are completely made up,” said Beaulieu. “Yes, I borrow from Earth-based cultures, but I can’t use them as-is, and I can’t borrow from our own history at all. So all of that—the world and magic and cultures and histories—becomes the soil in which the story will grow.”\nBy preparing the soil separately, Beaulieu ensures the interconnectedness as the characters grow.\n“As I create more and more characters, I know where they came from, what biases they will have, what likes and dislikes will have been taught from a young age, and so on,” he said. “And then they can become their own unique people, either subscribing to those biases or going against them. And that’s when the tapestry of the story really starts to come alive, when the characters breathe life into it and play against not only one another, but the world in which they were born and raised.”\nPerhaps his method of building the world before the character—soil before planting, the nest before laying the egg—is not unique—but the result is certainly compelling. Beaulieu’s novels achieve that rate effect of being richly textured, complex without being cluttered or garish.\nTo run wildly across a palette of metaphors—Beaulieu’s prose is fine-grained, high resolution; it has a high thread count; and it’s highly readable while rewarding careful attention to detail.\nFurthermore, through all the violent disputes and irreconcilable differences, there is always a ray of hope. Below, Beaulieu and I talk about character and world-building, style and more.\nHow would you describe your style?\nI would say I’m an amalgam of George R.R. Martin, C.S. Friedman, and Guy Gavriel Kay. I like Martin for his grittiness and the breadth and depth of his writing. The sheer amount of scope in his work is staggering, and I wanted to bring some of that sense of grand tapestry to my own work. Friedman I love for her serious and dark tone, the relentlessness of her storytelling, and the depth of her characters. It’s a heady mix, particularly the Coldfire trilogy, which had a great effect on me and my writing. And Kay I love for his elegance of prose. His stories also tend to be romantic, and while I do like to bring a sense of grit to my stories, particularly when battle is at hand, I also think there’s room for romanticism.\nI picture my novels as rich pre-Raphaelite paintings, pulling in hues and tones from the writers who’ve had an effect on me. Or at least, that’s how I would have described them as I was learning the ropes. Now I like to think that I’m moved beyond the point where I even notice my own style. It simply is, a part of me as much as what I choose to write about.\nWhat do you enjoy about writing fiction, long or short?\nI enjoy short fiction, but I love novel length work. There’s something to be said, certainly, of the short form. I love it for its brevity, for the power it can pack in such a short space, for the wonderful flash of imagery it can give to the reader. But I grew up reading Tolkien, and then gravitating to things like Thomas Covenant the Unbeliever and The Belgariad and The Coldfire trilogy. The stories I loved most were the ones that had rich secondary worlds, the ones that had full cultures unlike our own, populated with magic and warriors and wizards. It’s quite difficult to get the feel of those kind of worlds in a short story. Sure, you might catch a glimpse, but if you truly love a world, you want to spend more time in it.\nAnd so it was with my writing. When I began toying with the idea, I did so with novels, but even when I started writing short fiction to stretch my writing muscles, I found myself creating entire secondary worlds in which to tell a 7,000-word tale. It was fun, but exhausting for so little output. Just as I want to explore and relate to characters I love while reading, I want to inhabit them while writing novels. I want to explore them more than short fiction will allow. Sure, I could write many short tales in a single world, but that means that the tale itself is but a glimpse of some larger tale. At least, it is for me. I tend to think in trilogies—an affliction so many of us, me included, can lay at the feet of Professor Tolkien—and so I want something large and grand to be told by the time I’m finally ready to put a story to rest.\nWhat’s at the heart of The Lays of Anuskaya trilogy? And did that change or drift or evolve at all over the years of writing the books?\nThe heart of The Lays of Anuskaya can be found in 9/11, the Iraq War, and the surrounding conflicts. Like so many people—not just Americans, but people all over the world—I was greatly affected by the events of 9/11. There was rage and confusion and a deep desire to “get to the bottom of it,” to understand why the perpetrators of that crime had done what they’d done. The more I searched for answers, however, the more I realized that it’s an endless story with endless causes and endless consequences.\nI’m a pragmatist. There are hard truths in our world, and I understand the need for war in certain circumstances, but I’m also very much in the “can’t we all just get along” camp. It was in that frustration that the seeds of the story were laid down, and they started to bear fruit as I fleshed out the conflict that’s told in the story, one that has roots in the generations past but that’s coming to a head just as the story opens.\nThe heart of the story—a tale of irreconcilable differences—didn’t change very much in the telling. It continued to be the primary driver of what happened. But I was able to show where some people, if they try hard, can meet in the middle, and I was able to bring that new perspective to several different characters. That was one of the more gratifying things for me, to show a tale in which the characters learn and come to understand another culture from a perspective that was beforehand very limited. Not everyone ended up agreeing with the other side—that wouldn’t be a truthful story—but they certainly understood more if nothing else, and all of that came from my inner desires for us, in this world, to do the same.\nWhere would you most like to visit in that world? Least like to visit?\nI would have to say the island of Galahesh, where the Straits are. I wrote about this more in Mary Robinette Kowal’s blog. It’s a very interesting place because it stands between two worlds: the Empire of Yrstanla to the west and the islands of the Grand Duchy of Anuskaya to the east. It has parts of both, and so represents a lot of things in the world, and certainly for the second book, The Straits of Galahesh. I also like it from the sheer vista it would provide. I was struck when I visited the Cliffs of Moher near Galway, Ireland. It’s a popular tourist attraction there, and you’re able to go right up to the edge of the cliffs and stare straight down. I stayed there for over an hour and could have stayed for several more, just staring down at the churning sea below, the seagulls that were wheeling several hundred feet below my vantage point. It was amazing. And it would be incredible to see that in the form of the straits on Galahesh, with two tall cliffs and a massive bridge spanning them.\nI think I’d least like to visit some of the islands to the east of the Grand Duchy. I was born and raised in Wisconsin, and I do enjoy a month or so of cold, but I would detest living like that for six or seven months out of the year. And it would be worse as barren as some of those islands are. Then again, with a warm fire and some vodka, perhaps it wouldn’t be so bad...\nWhere did you start in building the world of the Anuskaya trilogy?\nThe origins of The Lays of Anuskaya was a bit multimedia in nature.\nFirst, I used some artwork to help with inspiration. In 2004, my wife and I went to the National Gallery in Edinburgh, and we saw some wonderful paintings. I decided that my next project (which eventually became The Winds of Khalakovo) would include the artwork I bought in postcard form. At the time I was working on another novel. I was finishing up a draft and knew that it would need at least one more to make it work. I was also working heavily on short fiction. I went to Orson Scott Card‘s Literary Bootcamp the summer following, and Clarion the summer following that. Suffice it to say that the story didn’t really get my full attention until around 2007, several years after spying the artwork. But that was great, actually, because I was still learning a lot about writing, which helped me to take on such a large project. Plus, the delay afforded my hindbrain to work on the story without the pressure of actually writing it. It was nice for the pressure to be off, so to speak, but of course the pressure was “on” in other pieces of fiction I was working on at the time.\nSecond, I used an excellent little piece of mapping software called Fractal Terrains. The program allows you to specify some basic parameters about a world—things like diameter, water coverage, mountain height and ocean depth, the number of moons—and the software will then render a world for you. I played with the software a lot, altering the parameters and retrying until I had something I liked. I knew that I wanted a world with archipelagos. The rendering of the terrain and the channels beneath the ocean surface ended up advising me on the magic of the world. It also created the geo-political structure. I circled the island chains until I had what I wanted: a loose collection of archipelagos that depended upon one another for survival. These became the Grand Duchy of Anuskaya, and two of my main characters became a Prince of one duchy and a Princess of another. It also made sense to me that there might have been an indigenous people on these islands that were pushed out by the expansion of the Grand Duchy. And from this flowed both the Aramahn, the peaceful peoples that originally inhabited the islands, and the Maharraht, the warlike splinter of the Aramahn that wish to push the Grand Duchy from the shores of the islands at any cost.\nAnd how did you develop it from that original seed?\nI mentioned earlier that I had some time to let it marinate, which was good for me. Perhaps even crucial to the success of the trilogy. It let the world mature, and the cultures, the histories between them, and so on, and that allowed more of the conflicts in the “current” story to manifest. Extra time also allows me to work on the magic systems, which I really want to be something unique and meaningful to the story and to be entwined with the history of the world. And that takes a lot of time. At least it does for me. I don’t want the story to feel like it’s a cheap veneer for a D&D spell manual, so I try to take care with the magic. I tend to use a light hand, á la J.R.R. Tolkien or George R.R. Martin, but even so, what lies beneath the page must be worked out in detail so that what’s shown above the page makes sense and is internally consistent.\nI really don’t like diving too deeply into a story until I know a lot about the back story and magical elements of a world, so this developmental stage is a very important step for me. It’s something I’ve continued to use since. I recently sold a new trilogy to DAW Books, a story about a pit fighter in a powerful desert city who rises to challenge the rule of the Twelve Kings. I had written a partial before selling the series, but before that I had worked on the world and characters and story for about two years. I’m doing the same for a middle grade series I’m working on now. And frankly, it’s one of the most fun parts of writing for me, the creation of new worlds from scratch.\nWhat are some of the cool things that got left out of the novels—places or ideas or scenes that didn’t make it into the book?\nI didn’t really get a chance to explore many of the duchies in the Grand Duchy. The story had characters from all of the nine duchies, but I could only fit so many locales between the covers. It would have been fun to explore the other duchies more, to flesh out their shared history and their differences.\nI also would have liked to explore the desert cultures that became more important to the story in the third book, The Flames of Shadam Khoreh. In Flames, the characters go to the great Gaji Desert to look for the fabled valley of Shadam Khoreh. I really do love Arabian Nights style tales, and I got to scratch that itch a bit in the writing of the third book. Then again, it was just the right amount for this particular story, and I do get to explore that milieu a lot in my next series, which will take place almost exclusively in a massive desert with sand-skimming sailing ships.\nWhere did you start The Flames of Shadam Khoreh—character, setting, idea, somewhere else all together? And how does that compare to the beginning point of the other novels in the trilogy?\nThe genesis of The Flames of Shadam Khoreh was in the rifts that are spreading throughout the world. We learn in The Winds of Khalakovo that these rifts exist. They are tears between the material world and the world of the spirits, which are elemental in nature: water, air, earth, fire, and life. These rifts were caused hundreds of years ago, but they’re becoming worse—much worse as The Flames of Shadam Khoreh opens. I didn’t know it when I first started writing The Winds of Khalakovo, but the rifts are the throughline for the entire series. The story in essence starts and must also end with them. It made for a satisfying story for me personally as the story in many ways came full circle from where it had began. On the other hand, the world had changed greatly, and it was interesting seeing those two sides of the same coin play out.\nIn what ways did the writing of The Flames of Shadam Khoreh challenge you as a writer? What were some of the surprises it threw at you?\nThe biggest challenge for me was to pull in all the threads that I had set up in Book One and expanded on in Book Two. Those threads are unspoken promises to the reader. They have a certain trajectory and they create within the reader certain expectations: not only that they will be resolved, but resolved in a satisfying way. And that “satisfying” formula is a very difficult one to solve. You want to create surprise in the reader without surprising them too much. You want conflict without it becoming overly chaotic. You want change in character without it being either predictable or illogical. There are so many things to get right, and the ending of a story, especially for something so broad as an epic fantasy, it’s a tricky thing to do. Well, who am I kidding? It’s tricky in any genre. And it certainly was in this case. I was very pleased with how it turned out, and I hope the fans of the series are too.\nWhat’s next for you?\nI mentioned the two series I’m working on above. One is called The Song of the Shattered Sands and will be coming out from DAW Books in 2014. Here’s the blurb for the first book in the series, Twelve Kings in Sharakhai:\nIn the cramped west end of Sharakhai, the Amber Jewel of the Desert, Çeda fights in the pits to scrape a living. She, like so many in the city, pray for the downfall of the cruel, immortal Kings of Sharakhai, but she’s never been able to do anything about it. This all changes when she goes out on the night of Beht Zha’ir, the holy night when all are forbidden from walking the streets. It’s the night that the asirim, the powerful yet wretched creatures that protect the Kings from all who would stand against them, wander the city and take tribute. It is then that one of the asirim, a pitiful creature who wears a golden crown, stops Çeda and whispers long forgotten words into her ear. Çeda has heard those words before, in a book left to her by her mother, and it is through that one peculiar link that she begins to find hidden riddles left by her mother.\nAs Çeda begins to unlock the mysteries of that fateful night, she realizes that the very origin of the asirim and the dark bargain the Kings made with the gods of the desert to secure them may be the very key she needs to throw off the iron grip the Kings have had over Sharakhai. And yet the Kings are no fools—they’ve ruled the Shangazi for four hundred years for good reason, and they have not been idle. As Çeda digs into their past, and the Kings come closer and closer to unmasking her, Çeda must decide if she’s ready to face them once and for all.\nThe other project I’ve just started writing is a middle grade series called The Tales of the Bryndlholt. It’s set in a secondary world, but it will be loosely based off of our own Norse mythology. The story itself is about a group of misfit kids who usher in the end of the world.\nAny parting words?\nOnly a quick thank you for having me by, and a shout-out for fans of science fiction and fantasy to check out the podcast I run with fellow author and English professor Gregory A. Wilson. The show is called Speculate! The Podcast for Writers, Readers, and Fans, and on it we talk about the field of speculative fiction, review works both short and long, discuss writing technique, and interview authors. We’ve had the pleasure of having on our show authors like Robin Hobb, Patrick Rothfuss, James Patrick Kelly, Brent Weeks, Kij Johnson, and many more.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}