{"fingerprint": "XAT5WGAat23nvfAQ1I5krLcpQRM=", "sitename": "Clarkesworld Magazine", "title": "The Immolation of Kev Magee by L.X. Beckett", "author": "L X Beckett", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/beckett_08_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Immolation of Kev Magee by L.X. Beckett", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11030 words, novelette\nThe Immolation of Kev Magee\n2021 Finalist: Aurora Award for Best Novelette/Novella\n“Ogua-Lik is Kevinsberg’s true name.” Breeze Frame panned their cameras up from the beach, capturing a scaffold of industrial build clamped to the rough-hewn island cliffs. The tide was in, obscuring the submarine roots of the settlement’s forest of upthrust pipes, power mains, and chimneys climbing to the plateau. Following them to the top, Breeze kept the shot moving, zooming in on the air cannons, which were even now firing packets known as lily pads out to the Labrador Current.\nPhut! Fire one! Phut! Fire two. Each thirty-seed barrage sent ice and liquid oxygen fizzing skyward, slicing a glittering parabola into dawn skies, then splashing down over two klicks away. Breeze adjusted their goggs, taking in the process as one lily pad inflated into a bright white disk and began sending out tendrils of slush-laced cobweb to entangle with its kin. The quilts thus formed would reflect sunlight, preventing uptake by the North Atlantic, while simultaneously creating a platform for accumulating real snow and ice.\nPerfect!\nOne of the other shooters jostled them, but Breeze was big, and solidly planted. They held the shot despite the bump, taking the view wide-angle and tracking it out to the sunrise purpling the horizon.\nSnagging the primo spot on the cliff had meant showing up before dawn, when it was still pitch freezing dark, thereby beating out fifteen other videographers who’d had the same great idea. Breeze scanned the periphery, weighing the competition . . . and caught a glimpse of one outlier who had apparently come to take in the view for its own sake. A police-looking type, muscly and scarred. Below the eyes, her skin was basically hamburger. Burgerface locked gazes with Breeze without moving, seeming to sense the attention.\n“Um. According to others, Ogua-Lik is unceded territory. Which means—”\n“Good morning!” A ping from the Kevinsberg city manager interrupted the sputtering history flow. “There is a gig opp in freshwater loading. Accept or decline?”\nBreeze saved their capture and let the gig specs fill their augmented field of vision. The offer was for an outdoor shift, but a sheltered one. Better than spraying slush onto the lily pads from the deck of an icemaker. And there’d be time, after, to try to get on a sim shoot.\n“Accept. Be there in twenty.” Pretty pics of sun on the water and spieling about old land ownership grudges weren’t going to boost them up any leaderboards anyway. Breeze needed unique footage, not stuff every other simmaker wannabe could pick up here on the cliff. “Earmark my pay stub to club dues, Moil.”\n“Of course,” the app said, posting a status bar for the payout.\nResetting the goggs, Breeze turned from the rail and the rising sun. Another would-be auteur barged into their spot, narrating a take of their own: “ . . . tidal generators and the facility constructed around them are the core of a massive geoengineering project, life support for a planet in trouble. It’s a big give for the common good, courtesy of a CEO who escaped the US with his billions intact!”\nGood technique, Breeze thought. Better than mine.\nKeisha, who pretended to cynicism, said megaphilanthropy was a survival strategy. That the richies were fending off governments who’d otherwise straight-up seize their money. Maybe there was truth in that.\nStill, Kev Magee’s version of saving the world had a scale that appealed to the imagination. Making icebergs on an industrial scale, just to draw heat out of the oceans? Several legit sciencers had noped the idea, but Magee fought back with flotillas of in-house researchers, a veritable publishing industry devoted to Kevinsberg success metrics.\nHe’d expanded beyond icebergs, too. The embroidery project laced hectares of highly reflective sheet ice across ocean spaces that used to freeze over, all on their own, decades ago. Perimeter expansion of the winter freeze, they called it. And a wildly popular innovation team, deep in the Arctic, was even now rolling out ice barges meant to somehow boost polar bear survivability.\nCould all these hundreds of thousands of tons of man-made ice, literal drops in a literal ocean, truly make a dent in the ongoing global overheat? Perhaps not. But Magee was a billionaire, and as long as he was creating gigs and homing refugees, that meant something. Breeze figured—knew—that serfing for a megaphilanthropist was as close as it came to getting a fresh start. It certainly beat trying to scrape by in the cross-continental shooting gallery south of the Great Lakes.\nAnd Kevinsberg had a simmaker community.\nThey took a heat lock out of the cold, back into the steady eighteen Celsius degrees that was the city ambient. Popping up their goggs as they steamed over, Breeze stripped off parka, gloves, hat, and scarf, leaving the gear in the club’s communal cloak room. Aiming for a pace that would warm the body, without building up a lethally chilling sweat by the time they got to the docks, they strode from the viewpoint. They racked their brain all the way to the harbor, trying to come up with a capture nobody else would’ve uploaded a thousand times over.\nThe rhythms of physical labor beat the day out swiftly. Hitch up a watership, connect hoses, check seals. Pump the tanks, next: bilge out to compost facilities, desalinized potable in. Watch the readings, ping safety checks to the dock foreperson, then unhitch the whole thing and move on to the next ship. Faster you worked, more you got for bonus.\n“A bot could do this in good conditions!” the dock supervisor bellowed, over clanking equipment and the howl of wind, as Breeze clumped into the reports shed at the end of the day.\n“Be glad conditions are bad, then,” Breeze said. Bots were scarce and pricey, and the docks could be slick. Nobody had yet written an algorithm more sophisticated than that trickster ice, with its tendency to foul gauges and metal joints, to shatter water hoses.\n“Thanks for that, you big Pollyanna.”\n“Freshwater loading’s not a bad gig!” Breeze insisted.\nOne of the other loaders slammed in behind them, gusting cold through the shed. “Hey’d you hear? Magee’s moving to monetize the desal operation!”\n“For-profit freshwater?” The supervisor scoffed. “From fuckin’ Labrador? How they gonna ship?”\n“They’re not, exactly. They’re talking to the JobBezos foundation about pipelining it cross-continent.”\n“Beyond!” Breeze said, earning a withering look, in stereo. “How, though?”\n“Steam her, pump her, spurt-spray-splash it goes west. Outflow pipes can dump the flow into all the half-dried rivers and they’ll charge dams downstream for the give to their reservoirs. They call it . . . ” He flourished, like a magician, mittens dripping. “ . . . hydrotransfusion!”\n“They’re just laying a big-ass pipe dream on Global Oversight before someone claws back their cash balance for tree planting,” said the supervisor.\n“But if it worked!” Breeze couldn’t help speaking up. “That’s amazing—the scale of that!”\n“It means we’re desperate, kid.” The supervisor snorted. “You are a Pollyanna.”\n“Whatever.” The city manager app, Moil, completed their pay stub and punched them out. “I’m gonna go chase my dreams now.”\n“You mean you’re going to work a double,” said the other guy, “Just like every other putz in this sardine can.”\n“You say poh tay toh.” Waving a jaunty goodbye, Breeze made for Ashevak Park.\nThe Kevinsberg town square was a domed quarry running the length of three football fields, surrounded by thirty-story greentowers and tasked to providing city residents with a perpetual illusion of springtime. Roofed in crystal-clear nanoglass that never iced over, it was warmed by heat the city extracted from the sea. The park’s lawns and flower gardens drank desalinized seawater and battened on local compost. Meadows, waterfalls, rhododendrons, scent of honeysuckle, and buzzing honeybees—the whole dome was supported by steel-core pillars designed and printed by the Dorset Fine Arts Collective on Baffin Island.\nThe carvings had elevated the dome from greenhouse to temple—Parthenon of the North, some called it. The Inuit pillars spoke a visual language Breeze couldn’t quite decode. Rising asymmetrical columns featured smooth gray seals, ptarmigan, sleek arctic foxes morphing into albatross. Sculpted hunters paddled kayaks twenty feet up, flying amid flocks of geese and owls.\nAt ground level, the gray scale accumulation of stone depicted large-mouthed bipedal hunters on foot, rising out of clematis vines and stands of daisy to pose with harpoons. Here and there, misshapen, half-human deities seemed to climb out of the hedges. Alice screamed whenever she caught a glimpse of the monument-scale walrus woman overwatching the mint gardens.\nThe central pillar was Qilalugag, a pod of narwhals cut into porous layers of printed whalebone. The pod tapered at top and bottom, so that the whole column balanced, at its base, on a single curving horn. Looking up, viewers could see the apex of the Ashevak Park dome resting on the red-stained tail flukes of a narwhal calf.\nThree points of contact, holding up a glass house. That was the noper take on it. But actual tourists came to see Qilalugag. Came to ooh and ahh, in the flesh, at the vision of swirling monodon monceros under the stars, under the whirl of northern lights.\nIts immensity, many points of interest, and the variety of artificially cultivated environments within the quarry also meant that Ashevak Park was where most of the local sim shoots took place.\nPunched out, dues paid, Breeze picked up a pair of cannabis-laced curry skewers, printed meat with deep-fried crunchy rice packaging. Munching, they found the Orphan’s Club reserved pavilion, conveniently near the casting tent. They stretched out on a patch of lawn, bumping fists with some other off-shift teens, feeling muscle-sore but pleasantly tired.\nUnlike on the docks, the chatter here stayed upbeat and hopeful. Rumor had it the current VR feature would be capturing a police foot chase. The crew would be looking for real bodies, maybe lots of them, for crowd shots.\n“Take off your goggs.” Tenor voice, unfamiliar accent.\nBreeze jumped. Burgerface, from this morning, was crouching in a spot Breeze had saved for Keisha. Tall, fit, with close-cropped white-blonde hair and that shiny-pink ruin of skin below the eyes, she had a twist to her speech patterns that sounded . . . Brit maybe?\n“What?” Breeze said. “Why?”\n“Want to get noticed, let them see your face.”\n“I’m widecasting headshots.”\n“So’s everyone else. Go on. They’ll snag on me and look away. Staring’s rude after all—”\nBreeze redirected their eyes hastily.\n“—they’ll land on you. You got good cheekbones, Blossom, nice big eyes . . . ”\n“Which you’re seeing, in my headshot.” Reluctantly—unaugmented reality was superboring—Breeze pushed their goggs up. The woman fluffed a few wisps of their hair around their temples.\n“Hey! Mitts off! I don’t know you!”\n“I’m Zero. Pronouns she/her. I’m your Orphan Club mentor and we’re roommates.”\n“Since when?”\n“Since I just took the spare bed in your pop-in.”\nBreeze was crunching feels about this revelation when two things happened at once: Keisha came striding up the path, looking almost animated, and the casting agent for the crowd scene emerged from the production tent.\nExcitement surged through the gathered aspirants. Breeze refluffed the hair; Zero barely twitched her scar tissue and still managed to look smug.\n“Did you hear?” Keisha said breathlessly, plopping down in the nonexistent space between them and accepting the other skewer from Breeze. “Someone beheaded the EXOshell CEO in Paris!”\n“Calling fakenews,” Breeze said, automatically.\n“Hi, Zero. Noping you back, Breeze—there’s footage.”\n“They caught the killer?”\n“Footage of the body.”\n“Don’t you dare share,” Breeze said. Keisha seemed to think leaning into the stuff of nightmare would somehow make it easier to forget what things had been like before they got out of Detroit. Like filling their heads with new horrible garbage would crowd out the past\nBefore Keisha could respond, the casting agent pinged them—actually pinged them! “You three—step up!”\n“Told you,” Zero said. As one they rose, obedient and eager, to get their bodies into the capture.\nEveryone wanted to be in sims, of course, so the work paid minimum gig rate. After six hours of playing crowd members while Breeze tried to take in every single thing the crew was doing to pull the shot together, the three of them punched out and trudged off, barely richer, making for the Orphans Club.\nZero, inexplicably, had energy for chitchat. “How’d you two meet?”\n“Partnered up for a school project.”\n“I assumed you were lovers. Or family.”\n“Ha! We were practically strangers.” Keisha pinged Club Receiving, summoning a baggy-eyed twelve year old with a baby carriage, who verified Alice’s dependent status.\nPractically strangers. Stung, Breeze forced cheer into their voice. “Yeah, school. Keisha’s aces for math and chemistry, and I had a few levels on her in reading-writing-rhetoric. The club’s StuddyBuddy app matched us when our school went kaboom.”\n“All hail the mighty Orphan’s Club.” Keisha lifted Alice out of the carriage, settling her into a sling. Then, abruptly, she stepped behind Breeze, blocking the gaze of the two oil-stained male machinists who liked to watch from across the way, stickily zooming views of every young who came and went.\n“They bother you?” Zero asked.\n“The zoomers? What do you think—” Keisha said.\n“All they can do is look,” Breeze said. “Cameras everywhere, right? Supposedly the walls are laced with tasers.”\n“Don’t mind Breeze, Zero,” Keisha said. “They’re hoping if they bury their head deep enough, they’ll rediscover their innocence in the sand.”\nBreeze turned away, breathing out hurt. Zero moved into a pool of light, hands on hips, catching one zoomer’s eye. His leer broke on the terrain of her face, or possibly on some threat in her expression.\nMaybe rooming with a muscly type would have unexpected perks.\n“Let’s shift,” she said.\nThey shuffled off through the corridors to Magenta block. Breeze held the door for the women as they trooped inside their pop-in. “Home sweet home.”\n“Very posh,” Zero said, tone appreciative. It was, too: four bunks, private toilet with a change station and thrice-running water—cold tap, warm tap, and a locked spigot for boiled.\nAlice was the reason for the upscale accommodations—and also the reason most of their allotted roommates requested new quarters after a day or two.\nBut Keisha got the baby into her crib without waking her, doing an immediate collapse onto her own bunk. Breeze pulled blankets over them both, then mixed up a bottle of printed formula for the baby, setting it in the warmer. They dug out a cube of mint tea. “Want a cup?”\nZero shook her head: “You take the childcare in shifts?”\n“No. I pay top-ups to Orphan’s Club to give Keisha breaks. And she gigs there, helping the smalls with starter math.”\n“Kid doesn’t resemble either of you.”\nOblique way of pointing out that the two of them sucked at parenting? Breeze decided they were being oversensitive. “We’re just fostering. Keisha was doing a nanny gig when Alice’s mom vanished.”\n“Where?”\n“Detroit.” Before this could turn in to a heartfelt round of I’ll show you mine if you show me yours, Breeze took a too-hot gulp of partially diffused mint tea and gave Zero a stroke for her social capital. “Thanks for getting us onto the shoot today.”\n“Stick with me, kid. Club’s appointed me your fairy godmentor, what?”\n“Mother, yeah. You’ve got to be close to aging out—” Breeze shut up then, averting their gaze as Zero stripped off her fitted vest and body armor, revealing a torso that belonged on a classical Greek statue, with full breasts and hard-looking coral-colored nipples. Cat-light and silent, she vaulted into the bunk above Keisha.\nIf she lasts, we’ll have to talk about boundaries. Breeze settled, spider delicate, into the lower bunk. They took another sip of mint, checked the laces on their boots, and shut off their hearing aids.\nIn the resulting blessed silence, they primed their goggs with a text-only scan of the latest headlines. Nothing about murdered CEOs on the official channels, but Kevinsberg censored that kind of thing, and Breeze ran a heavy-duty app, Can’t Unsee, that kept things like decapitated bodies—real or deepfaked—off their feeds.\nThey read one aspirational squib about the proposed desalination pipeline. Engineering wet dream, said the commenters. The lingo got technical pretty fast—stuff about gravity generators, forced steam at designated choke points. Lots of blahblahblah about power recovery in a closed system, and kickbacks from dams.\nIt looked good in sim, and Kevinsberg sciencers had a total #bigdreamer brand. Why not try it? The seas were overfull, and the continents were parching up.\nClosing the newsflow, Breeze brought up their lullaby app, Hayride.\nThe view of their bunk dissolved, morphing into a cart. The pop-in apartment became a sea of hypnotically waving, silent canola blossoms. Breeze fished a fauxfur-lined mitten from under their pillow, wrapping their fingers in softness. They cued the program to add in a dog.\nThey were asleep before it loaded into the picture.\nQuick haptic jolts, just above the ears, brought them out of dreams. The rig was programmed to wake Breeze every time they started trying to run, or if rate-of-breath or heartbeat stats suggested they were sinking into nightmare. Preemptively noping out of whatever horrors their subconscious was cooking up kept Breeze from whiting out entirely.\nUnhappily awake, they inhaled on a four-count, then unclenched their eyelids, feeling fight-or-flighty. The Hayride app on their goggs was deep into cornfields now. The dog of the day was a stunningly beautiful Irish setter, silky to the touch.\nProgrammed illusion warred briefly with a hint of dream memory. Something about thick wool socks—their only socks—grinding against their toes, steeped in something sticky . . .\nPet the dog, pet the dog, pet the dog . . .\nBreeze cleared the sim from their goggs. Zero was sitting up in bed, tits mercifully draped under a blanket, watching Keisha walk Alice back and forth. No sound for Breeze, but they could see baby screaming the walls red.\nZero’s mouth moved. Breeze stayed still, faking sleep. Badly, apparently, because their fairy godmentor finger-spelled. “You need better headshots.”\nA kick of insult. Breeze rebooted their rig.\n“I’m doing on-camera gigs to make contacts,” they said. “I want to get on a crew and work my way up to directing.”\nBoth hearing aids engaged midway through this declaration, filling the already close room with baby wails and the sound of their own voice.\n“Good, you’re up!” Keisha handed Alice over.\n“Awww. How’s our little hot potato?”\n“Don’t say our.” Keisha vanished into the bathroom.\n“Sorry.” One-armed, Breeze shook themselves out of bed, digging in the pantry box for fish broth cubes and dried dumplings. Unlocking the boil tap, they topped up three metal cups. The baby arched and wailed.\n“So the reason you were gawping at the pretty sunrise yesterday,” Zero said, as if there’d been no interruption. “Is you want to craft sims proper.”\n“Practice, yeah. Until I can take a capture course.”\n“You and every other glamor hound in the city, I’ll wager,” Zero hopped off their bunk and dropped into a push-up. “You’re not in the scholarship queue.”\n“Gotta get Alice adopted first,” Breeze said, keeping their voice light. “I’m learning what I can on the job.”\n“And when you’re a big shot director, you’re going to . . . what?”\n“Show the world rising from the ashes,” Breeze said promptly.\n“On a front of man-made ice?”\n“People need to see what we’re building here. How hard everyone’s trying!”\n“That is a genuinely heartwarming take.”\n“Sarcasm’s antisocial, Zero.” Dumplings began plumping up in the three cups. Keisha had exhaustion as an excuse. If Breeze had to live with two neggers . . . their vision blurred. Alice slapped at their goggs, almost dislodging a hearing aid.\n“Relax, Blossom. My point is you don’t have to wait out the slow queue of wannabes. You must know you’re bloody gorgeous. Those wide-eyed peepers, the cheekbones . . . add to that to your apparent faith in humanity and the rare sense—”\n“Trade on my looks? Don’t you feel like that’s kind of—”\n“—rare sense of fair play,” Zero overrode them. “Get that idealism out where people can see it! I promise you, they will eat it up. Sweet-tempered giants are trending.”\n“It sounds like cheating.”\n“Or maybe you’re not serious about your ambitions,” Zero said.\nBreeze was starting to wish they’d never given Zero that stroke. “Of course I’m serious! We picked Kevinsberg because of the sim studio.”\n“Yet you’re pumping bilge water, eight to six.”\nBy now Alice’s wails had reached rock-shattering volume: the Club’s social worker app was probably tallying complaints against them, and downvoting her adoptability stats. Again. Breeze bounced her. “What do you suggest, oh exalted godmentor?”\n“Fix your headshots,” Zero said implacably. “Get better clothes.”\n“Like any of that is affordable,” Keisha came out of the bathroom, sighing over the dumplings before taking a cup.\nBreeze thought of the crowds at the sunrise yesterday. “Zero may have a point.”\nKeisha slammed the cup onto their stub of a counter, startling Alice to silence, for a breath, anyway. Broth sloshed her fingers. She started the cold tap, thrusting the burned skin into the flow.\n“One day’s wages, Blossoms.” Zero finished up her round of push-ups, tested her weight on a ceiling pipe, and transitioned into chin-ups. “Two at most. I’ll haggle a photographer for the shots—”\n“And branding,” Keisha interrupted. “I’m not rocking cradles all day so Breeze can start trending on the deepfake porn sites.”\n“How’s she supposed to pull off a brand?” Breeze objected, although the thought of being the VR fucktoy of the month made their stomach go queasy. They burped—fish—and thought of the neighborhood zoomers.\n“I can haggle a brand,” Zero agreed, not breaking rhythm. Up, down, up like a machine.\nBreeze gave Keisha the wide-eyes. She seemed to deflate. “Fine.”\nIn the end it was three days without childcare. Three shifts Breeze spent on a midsize icemaker, tethered to the deck as waves whiplashed the crew, freezing in a moldy-smelling extra-large life jacket as part of a crew spraying fine mist on the artificial icebergs anchored at the edge of the Current. Three days of hazard-grade wages, all vanished into Zero’s growing shopping list. Hairstyle and makeup first, then a set of fashionable VR goggs that didn’t quite sync with their hearing aids.\nThe final buy was a temp brand, complicated aurora spray above their left eyebrow, inked in emerald using something called Slowfade.\n“It gives you a whiff of the exotic,” Zero said, as Breeze looked it over.\n“It gives me a recurring monthly expense,” Breeze countered.\n“We’ll get it tattooed when we can.”\nThree days of Keisha deteriorating into zombie, in the twenty-four-seven yellscape.\nBreeze did what they could. Came home after the photo shoot and cajoled her out of the apartment. Spent their last on a stroller booking, collecting the wagon under the ever-present leer of the zoomers, then adjusting its settings to extra jouncy. That, and a white noise app, was one of the few things sure to lull Alice into quiescence.\n“So, the park?” Keisha said, as the baby quieted and a two-hour countdown popped up in their peripherals.\n“Let’s take her outside,” Breeze said. “Change of pace, right?”\nKeisha signed agreement. Bundling up with things from the Club’s communal cloakroom, they sealed the stroller, cycled through a heat lock, and stepped out onto the island’s cliffside walk.\nRough winter fingers poked the gaps in their ill-fitted coats and mittens. Hunching as they walked, looking east at slate-gray seas and waves like rolling pumice, the two teens let the crash of water against the shore render them insensate for a while. The day shift was over, and the Club had got up a tobogganing opp for the under-fourteens, building an artificial mound of snow and staffing a hot cider fountain at its base. Further on, ice sculptors were taking advantage of the day’s remaining light. Wannabe simmakers were out collecting action shots. They looked to Breeze, suddenly, like hungry gulls snatching at a scantness of crumbs.\nEveryone froze as rotors sounded, audible even over the sputter of the ice cannons at the cliff. People paused, craning necks, tracking a trio of black helicopters making for Head Office, the tallest tower, at the heart of the island settlement.\n“Guess Kev Magee’s back in residence,” Breeze rasped. They were tired enough that reporting the obvious was as close to conversation as they could manage. “Didn’t know he was gone.”\n“To Paris, for the funeral.” Keisha said. “That EXOshell CEO who got beheaded.”\nBreeze flinched.\nA passing tobogganer, kid of about thirteen with a prosthetic for a left arm and a cheap print job for teeth, chimed in: “They still haven’t found the head!”\n“I don’t want to know,” Breeze said.\n“#Eattherich!” the kid screeched, giving the choppers the finger. Up on the tower roof, black-clad figures were taking up positions around the building perimeter.\n“I’ll eat you, you wake our baby,” Keisha said.\nThe kid made lip-smacking noises. Breeze took a step closer, reluctantly using their bigness as threat. The kid bounded away like an ape.\n“Don’t think about newscycle, Breeze.” Keisha said. “It’s just noise.”\nBreeze watched the kids. A couple of the ten-and-unders were helping load five year olds into sleds. The barely teens were helping smalls pull their toboggans up the hill. They might all have been decades younger, instead of just a couple years. “How many you think there are, like that?”\n“Like what?”\n“#Eattherich kid. Think Magee has a list? People he’s brought to town who’d just as soon shank him as thank him—”\n“Thank what? His abundant generosity?” Keisha kicked a pebble at the pram. “Magee’s not doing this out of the goodness of his heart.”\n“He could just restrict himself to making ice. He doesn’t have to fund sims and sculptures and ski hills. That concert hall’s opening soon—”\n“He’s got to live here too, doesn’t he?”\n“People can help themselves and do good,” Breeze insisted.\nHer eye fell on Alice. Remembering their own devil’s bargain?\nOne of the sculptors was putting the claws on a dancing bear, sending ice dust into the breeze as they chainsawed form into frost.\n“Almighty Magee’s got nothing to fear.” Keisha indicated the toboggan pack. “Not from the likes of them.”\n“No? What about your EXOshell guy?”\nShe zoomed to a close view of the helipad, with its black-clad muscly contingent. “Anyone getting through that kind of security? Has got to be another one of them.”\n“Right. Billionaires preying on each other.”\nShe blew a plume of foggy air out at the disturbingly colorless ocean, losing interest. “You’ll get Alice back into care tomorrow?”\n“I promise,” Breeze said. “I’m sorry it’s been so—”\n“Don’t. You work more doubles, we can start buying Alice up the adoption queue. It’s all win.”\nThe guilt lessened, but didn’t go entirely. But then Keisha leaned in, blocking out a flag of wind with the warmth of her body, and one of the tobogganers did a flip that made them both gasp. They watched the sculptors spray crystalline grit into the breeze until they couldn’t feel their feet for the cold, until the stroller pinged a warning—fifteen minutes until its next rental, its next hot date with another throwaway baby.\n“Get up, Blossom, there’s a rumor of a morning shoot.” Zero made this impossible to ignore by tugging on their boots, as if she meant to remove them.\nBreeze yanked both legs away, blinking away views from Hayride—poppy fields and a springer spaniel. “Go away. Don’t touch me! I can’t today.”\n“There’s speaking parts. An actual director. You want to make contacts, don’t you?”\nThey did, but . . . “Keisha needs a break.”\n“It’s not your kid.”\n“Alice,” Breeze signed. “Is our responsibility.”\nFlat look, like Zero was sifting them. Then: “I’ll gig for the childcare.”\n“Really?” The promise felt sticky.\nZero made an almost ostentatious show of taking a bag-searching shift at the boat docks, then tasking their stub to the household account. “Happy now? Run some varnish over your eyebrow brand and wear this.”\n“This” was a navy blue coat, well worn, but a far cut above their drab weather-stained work sheath.\n“Fancy!”\n“We’ll raise your standards yet.”\nBreeze bit their lip. “You’re trying to get in as my manager, right? That’s what this is?”\n“I’m not after sex, if that’s what you’re thinking.”\n“No, no!” A blush that went through their whole body.\n“Come on, it totally was. You think shaking down people at Customs is all I want out of life? You and me, Blossom, we’re going all the way to what passes for the top of this desperate scrape of an ice-encrusted fucking anthill.”\n“Language,” Breeze managed. “The baby.”\n“I’m trying to help you, Breeze. Don’t you want help?”\n“I know. I’m sorry.”\nZero clamped her hands over her cheeks, making the scars look fake, almost plasticky, and shoved her nose right up to the edge of Breeze’s new, improved goggles. Well past their consent barrier, but somehow they didn’t feel like they could say so. “You got your ears turned on? You capturing footage?”\n“Why would I?”\n“I want to review your audition later. Unless you prefer to debrief me verbally?”\n“Noping that!”\n“Cams on then. They’ve got those nice new lenses; you should be practicing your captures. Do your hair like I showed you.”\nSpeaking part. Breeze powered up, fluffed hair, checked their emerald-branded aurora, and plunged out into the city.\nThey hadn’t realized how early it was. Wee hours, really. With the timing offset from the usual commuter flows, the passages were deserted. Excess hot air from submarine ice condensers gusted warmly, creating an artificial wind laced with antibacterial measures and a smell of stale potato. Nobody was around.\nBreeze found themself tagging security cameras as they passed.\nI’m on that one, I’m on that one. Nothing to fear! I’m probably the most interesting thing on the security feeds. There could even be live eyes on me . . .\nSilly litany, maybe, but it kept them from running home.\n“Zero, where’s this gig?” They texted, turning a slow three-sixty to pan Ashevak Park. Ground-level lights beckoned, colors programmed to simulate sunrise in March. The dome above was black and star-sprung. Silhouettes of geese and kayaks blacked out the constellations.\nBreeze bent to check their boot laces. And then, straightening up, jumped as a shadow melted out of the central pillar.\nSomeone was trying to climb Qilalugag, the narwhal pod.\n“Shouldn’t that be . . . not allowed?” Breeze muttered. “Moil?”\nThey zoomed, bringing in facial features. It was one of the two pervy machinists. The zoomer was dressed for deep winter, bundled in a thick coat that made him look lumpy, and sporting an extravagantly rolled-up toque with a smeary looking pompom. As Breeze watched, he lost his grip on a narwhal fluke. Teetering, he lost ground, not quite falling to the base of the statue. Rebalancing before he landed flat on his butt, he tottered, kicked the pillar’s base, and then hunched in on himself.\nWas he . . . crying?\nThe hearing aids glitched back into sync with the gogg view, bringing muttered monologue: “Oh no, oh no, no no, oh no nuh no . . . ”\nBreeze flashed on Zero, saying Alice wasn’t their problem. Tried to vanish behind a carved sea lion. Speaking part, come on Breeze, just find the casting tent . . .\n“Hey,” they said instead. “Hi? Bonjour? Hola?”\n“Nuh Nuh oh no oh no no no . . . ”\nBreeze felt acid burning in the back of their throat. “Moil!”\n“Good morning Breeze! You’re up early!”\n“Can you Whooz this guy for a name?” Breeze put up both hands, waving to get the zoomer’s attention. “Hey . . . neighbor! Hi, it’s me. Breeze? I live in Magenta—”\nOMG, why am I telling him that?\nCome on, he must know.\n“My friend and I are the ones with the baby. Remember?”\nMoil spoke up. “That individual is named Douglas Farrow. Pronouns he/him.”\n“Douglas, right? Or Doug, maybe? Hey, Doug! What are you doing out here?”\n“Nuh nuh nuh no, no oh—” Dirty hands with ripped, bloodied nails fisted into the oily weave of the toque. His nose was squashy and red, like he’d banged it.\nBreeze murmured: “Moil, you’ve called someone, right? A social worker. An ambulance?”\n“Douglas does not appear to be in grave physical distress—”\n“He’s melting down!”\n“I can place him in the voluntary psychiatric services queue. If he refuses and you authorize a medical call that is later tagged as #falsealarm, you may be expected to compensate City Services—”\nThey’d never be able to start moving Alice up the adoption boards if they had an outstanding ticket to pay. Breeze took another reluctant step toward Doug, who was yanking the toque and making nuhnuh noises. “Listen. Can I help? Um, friend—”\nDoug’s head whipped up. “Friend? Friend?”\nDragging the hat down over his face, he charged.\nIf a toque had eyeholes, did that make it a balaclava? It was the last thing Breeze remembered thinking before a wash of white light and the sound of static carried them away.\nBreeze came out of the static on their back, lying in beyond-fancy accommodations. Sage-green sheets, whiff of honeysuckle. A flawless nanoglass window overlooked the very first Kevinsberg ice shop, ten stories below.\nThey flexed their toes. Their boots were still on; Keisha must have told them.\nTiny damp fingers brushed their nose. Alice was tucked under Breeze’s arm. She had managed to extract one arm from the cocoon of a clean and shockingly soft yellow swaddle. She drew her fingers back from Breeze’s nose, shoving them into her gob.\nThey ran a cheek over her head, self-soothing by drinking in baby smell, and for good measure focused on the view, rhythmic descent and splash of buoy-shaped cones of ice, big as houses, sliding off the assembly line. Hitting sea, the baby bergs tangled into nets of faux spidersilk that caught, spooled, and strung them in long lines hitched to towboats bound for the Current. The ships would draw them into temporary anchorage, hunting big winter storms that might be expected to dump ice rain and snow onto surfaces already configured to maximize droplet catch.\nBreeze realized their hands were bagged in cotton. Burned?\nThey peeked sideways. Keisha was nearby in a rocking chair, watching the ice cones too—the hypnotic rhythm of them rolling off the line into the bay.\n“Where’s Zero?” Breeze texted, so the baby wouldn’t hear.\n“You’re back!” Keisha lit up.\nBreeze felt tears threatening. Instead of asking how long they’d blipped out for, they signed: “Zero?”\nShe frowned. “Inola—the nurse—spooked her, I think.”\n“Didn’t know anything could.”\n“You don’t get a face like that without getting a few triggers too, right?”\n“Guess not.” The idea of Zero having trauma rang . . . false somehow.\n“She said she’d go scare up some interview gigs.” Breeze must have looked puzzled, because Keisha added: “You’re a sensation. Like, locally famous.”\n“Why?”\n“Hashtag hero,” she shared a capture.\nBreeze fumbled down their goggs. The footage came in, record of a memory that felt all of five minutes old. Lumpy upset Doug, refusing to be talked down. Moil saying an ambulance would cost.\nOn the views as the zoomer rushed closer, yelling, an ice chisel dropped out of his sleeve. Short chopping blade. Probably not all that dangerous?\nBreeze put a protective hand on the baby. The angle of the shot made it obvious they’d scrambled backward. They heard their own voice, kind of crooning: “Doug, Doug, you’re okay, you’re okay! Calm down—”\n“We’re not friends!”\nSuddenly a pair of beanbag cannons deployed, emerging from gaps in the nearest walrus statue. Fire one, fire two, fire three—\nThe footage paused as the bags hit the zoomer. The image pixelated.\nMoil said: “This content is rated high-risk by your Can’t Unsee application. To view—”\n“Decline.” Breeze put their nose on the baby’s head, nuzzling her silky, white-blonde hair. A ping from their biofeedback augments showed their pulse verging to ninety beats. “So I’m a #hero for . . . what?”\n“For trying, I guess.” Keisha said. “Those lumps in Doug’s coat? When the beanbags hit, they exploded.”\nBreeze focused on the now. “And he—”\n“Went splat, yeah,” Keisha climbed into the treatment bed, on the no-baby side. Leaned in, a comforting weight. “Bob—the other one—is missing.”\nPet the baby, pet the baby. Breeze remembered the three of them, cuddled up like this back in Detroit. Only six months ago? Seemed like longer.\nThat day of waiting, endlessly waiting, on Alice’s mom. They’d sat it out in rising hunger, because of the heat and the rat-a-tat of drone platforms nearby, too near. They’d reported Cynthia missing and waited some more, this time on police and child welfare agents who never came.\nOn the third day, they’d widecast a WTF do we do? They didn’t get many commenters, though, just a couple chatbots who said it was illegal to abandon an infant.\nBut there wouldn’t have been any consequences. City systems were overwhelmed. Any adult who might arrest or help them was busy taking care of themselves.\nLeaving one option: the Orphan’s Club. Upgrade their membership from casual. Formally join the chain of elders helping youngers, gigging childcare until someone found new mommies for the baby.\nNo choice at all, really.\nBreeze had headed out to find formula, leaving Keisha to fill out the forms. They were loading up milk and diapers when they saw a bright new thousand-pack of bullet drones, deploying from the roof of One Detroit Center, making straight for the safe zone.\nNext thing Breeze knew they were back in the basement, bloody-footed, shaking Keisha, or being shaken by her. Arguing about something. Breeze remembered shouting, over the rat-a-tat: “But she can get us out! Babies top the queue for evacuation!”\nSo Alice had become their ticket to Kevinsberg. To a pretty great house, and most of all not getting shot at. Pretty good deal, even if neither of them could have known she’d score so low within the queue of adoptable infants.\nShe hadn’t refused to be cute before her mother went AWOL.\nKeisha tapped their goggles with a finger. “Still with me?”\n“Who is this child in my arms and what have they done with our portable scream machine?”\n“Don’t say our.”\n“Sorry.”\n“Nurse thinks maybe there’s some kind of lack . . . lacto thing she’s got? Tummy ache from printed milk.”\n“But,” Breeze said. “You asked about that.”\n“Over and over!” They were allowed to log into the pediatric care queue every time Alice cried for six hours straight.\n“We could’ve been . . . are you saying she could’ve—”\n“You better not be blaming me.” Keisha pulled away, jolting Alice. Instead of shrieking, baby blew a for-real spit bubble.\n“Jeez. If all we’d needed was fancy milk . . . ” Breeze reached up to rub the spot above their branded eyebrow. Gauze-wrapped fingers dragged on yet more bandage.\nThey got a ping from Zero.\n“What is it?”\n“Call from the fairy godmentor,” Breeze shared the specs. “Zero’s put together an interview opp, just like you said.”\n“Great!”\n“Yeah . . . ” Breeze rubbed their bandaged palms together.\n“But?”\nRidiculous, to be whispering. Still. “Keish. I don’t know if Zero’s got our best interests at heart.”\n“No. You don’t get to do that.” Keisha practically snapped to attention. “You don’t get to decide now, for the first time in your life, that you don’t trust someone.”\n“No, I know, but—somehow I end up—Zero decides things, and—”\nA strangled laugh. “Like you deciding we should form a refugee threesome and fly off to the North Fucking Pole?”\nBreeze blinked. “That’s not fair.”\n“You said there’d be people here who’d want Alice, Breeze. Who’d love her, or at least know what the fuck they were doing—”\nA chime. Strike for them both—social worker app, flagging the profanity.\nShe rolled off the bed, pacing. “We got clear of the shooting. You were right about that, it was good. It is good. I don’t mean to be a . . . but Breeze, we can’t hand Alice off to a playgroup until she’s four!”\n“We’d never put her in one of those feral—”\n“For fuck’s sake!” Keisha spun, pressing both fists against the nanoglass, then smacking her head against it once, twice. “Would you stop assuming I’m as good of a person as you!”\nWithin the circle of their arm, the baby shivered.\n“Stop! I’m sorry, okay?” Breeze felt white edges forming on the periphery of their vision. “I’m taking the gig! Interview, accept. I’m sorry!”\nKeisha deflated, curling up against the window. Sweat smudges from her forehead and hands were already cleaning themselves off the nanoglass. “Fuck.”\nSocial worker gave them another strike for profanity.\n“You’re right,” Breeze said. “She needs . . . good parents. Permanence. We’ll home her, we will.”\nEyes dull, she nodded.\n“We will!” Breeze cast about for something else they could say. “We’ll lose the place on Magenta, when Alice goes. If we want to stay together . . . ”\nThey left room for an of course we’ll stay together . . .\nInstead, Keisha said “Just keep godmentor happy until we’ve homed the baby. Will you? Please?”\n“I accepted the interview, all right?” Breeze said. “It’s a done deal.”\nAlice blew another bubble. She let out a toothless half smile and then, fists clamping, filled her diaper, extravagantly, with a sound like a French horn tuning.\n“Yeah, done deal,” Keisha echoed. She picked herself up, scooped the baby, and made for the door. “No one’s gonna be able to resist her.”\nBreeze picked at their hand bandages. Cool air caressed the space on their chest where Alice had been.\nIf we want to stay together . . .\nKeisha didn’t owe them anything.\nDoesn’t she? I could’ve left her holding that baby. Goddamnit, I just went over there to study and flirt a little—\nA woman knocked on the door just then, softly, waiting on an invite to enter.\nBreeze motioned consent. Tried wiping their face with the backs of their gauzy hands and smeared their goggs.\nThe woman asked. “Feel like getting those bandages off?”\nBreeze nodded. Looking sharp, a little like a mom, she plopped her seat down on the edge of the bed, waiting. Like she had forever.\nThey said. “You know those days where everything’s terrible?”\n“I hate those days,” she said. “I’m Inola, by the way.”\n“She/her?”\n“Sure.”\nTears slipped down their face.“Breeze, they/them. Did you put our baby on the allergy list?”\n“And gave a strike to the intake nurse who told you Alice didn’t have a sensitivity.”\n“Thank you.”\n“Orphan’s Club will strike ’em too. I’m not usually punitive, but . . . ” She looked over their readings—pulse, blood pressure, whatever. “So. From the footage, it looks like you tuned out when you were attacked.”\nThe query probably meant Inola was a psychiatric nurse. Breeze bonked the bandages on their hands together, trying to choose their words. “Flight, fight, freeze, right?”\n“You freeze up often?”\n“Not since Detroit.”\nFlicker of a memory. Arriving back at the Detroit basement with formula, to find Keisha packing up some of the family valuables, and none of the baby stuff.\n“Breeze?” Inola said.\nThey signed, both bandaged hands moving clumsily, to indicate general unwillingness to talk about it. “I need to be able to work dock shifts.”\n“I’m not going to ban you,” Inola said. “You’re not being punished. It was a good thing, son, trying to talk that man down.”\nBreeze shrugged. “He still died.”\n“Not alone.”\n“Does that matter?”\n“It would to me.” Another sharp look. “People abandon each other all the time, don’t they?”\nDefinitely a psych nurse. Breeze stared at the production line of icebergs—grind down the slide, splash in the water, tangle into towline—as Inola unwrapped the bandages on their hands. The palms were a little raw, but there was no real damage.\n“Is my face okay?”\n“Let’s see.” She shared her own view, sending footage from her goggles as she pulled off the tape bandage. The emerald aurora in the swirl above Breeze’s brow had crisped to a purple-tinted burn, edged with white. It looked surprisingly good.\n“Battle scar,” she said, handing them a wipe for their goggs. “Almost like someone planned it that way.”\nBreeze swallowed. I think our fairy godmentor made Doug do the firebomb, they wanted to say.\n“Good morning, Breeze!” Moil pinged them. A new offer popped up in their sked.\nIt was VIP invites to the Kevinsberg Concert Hall grand opening the next evening. For Keisha and Alice too, plus a childcare worker. During intermission, there’d be a photo opp with Kevin Magee and two sim directors.\n“Accept or Decline?”\nA pop-up sweetened the opp: Alice would be the evening’s Featured Adoptable.\n“Breeze?” Inola moved right into their line of sight, using hospital overrides to minimize the offer, so she could compel eye contact. “Something you want to tell me?”\nBreeze blew out what little breath remained in their lungs. “Everything’s great,” they mouthed, airlessly, and added—to Moil—“Accept.”\nZero turned up in the flesh early the next morning, while Breeze was waiting on discharge from the hospital. She inspected the burned-in brand on Breeze’s eyebrow, looking satisfied as she settled them onto a stool in a white-walled corner of the room and set up a remote interview with a journo.\n“This won’t take long. We’ve prefabbed most of the content,” the journo said. “Zero will capture your answers. Just look at her and, you know, speak from the heart.”\n“About what?”\nZero shared text. “These are the questions.”\nBreeze took a quick scan. “There’s nothing here about the baby.”\n“Already backgrounded. We talked to Keisha about your determination to rescue Alice—”\n“I don’t know if I’d call it—”\n“Don’t worry, Blossom, everyone’s on message. You’re a big-time hashtag hero with dreams of stardom. Baby saving in your past, testimonial from Keisha as appetizer, and poor doomed Doug as . . . ”\n“Main course?” That was Inola.\nZero turned abruptly, pointing her face at the view as the nurse scanned the room, and then said—a little coolly—“Breeze, we’ve got one more general assessment to upload. You’ll get a greenlight for discharge within the hour.”\nBreeze sent thanks, wondering again what the nurse had done to spook Zero.\n“Let’s talk about the concert opp,” Zero said, as soon as the latch clicked behind her. “We watch the first half, then head toward stairwell two and the board box. Kev Magee and company will be waiting. He’ll invite you over, all spontaneous like, and shake your hand. You introduce Keisha, he gives little Alice a peck on the cheek. Says the usual about how adorable she is. Our newsy friend captures the whole encounter and then you’re free and clear, for ten minutes, ish, to kiss up to the sim directors while Keisha shops Alice to potential parents. Got it?”\n“Sure,” Breeze said.\nZero pointed at a tatter of flesh below her eye. “Gaze here. One, two . . . good! See the text of the questions, Blossom? Anything you want to know before you start answering?”\nJust keep her happy, Keisha had said. Breeze shook their head.\n“Fluff your hair, then, and start talking.”\nThe brand new Kevinsberg Concert Hall had been covered in a cylindrical veil of nanosilk, four stories high, for as long as Breeze had been on the island.\nThe structure beneath had been the subject of much speculation. Everyone expected some variation on an igloo, but nopers had countered that if the hall was too spherical it would end up looking like something called a Death Star, thereby drawing branding ire from litigious rightsholders.\nBreeze could never have guessed they’d see the unveiling live, much less from a front row, elbow-rubbing vantage point with richies. The three of them were behind a velvet rope—crappy, ineffective fence, but Keisha said it was symbolic. They were the youngest people in the whole velvet-corralled throng.\nPop of fireworks. The silk curtains concealing the building shredded into multicolored streamers. From a thousand throats, all at once: “Oooh!”\nThe architects had levered the dome and entryway of the fantasy igloo up, as if it was on a hinge, and then used etched nanoglass to fill the space between the cup of the dome and the ground. The dome itself was surfaced in local stone, pale shakes overlaid in layers, each piece cut like a snowflake.\nBreeze clapped along with all the others. The crowd sound was tinny—their fashion-plate goggs were still syncing badly with the hearing aids.\nZero pulled Alice’s diaper bag off their shoulder.\n“Don’t touch me.”\n“Bag ruins your look, Blossom.”\nZero had haggled finery for all three of them. Keisha was clad head to toe in a silvery tulip dress, an off the shoulder garment with a skirt so tight she was mincing. The baby had a dress and bow that made her look cute, in a sort of malevolent strawberry way. Breeze was fitted with hunter green trousers and a coffee-colored jacket.\nWith the tipped igloo unveiled and the applause finally wrapping, the crowd moved inside. All too close and jostly, and as they passed over the threshold, someone handed Breeze a piece of paper.\nThey almost backpedaled. “I don’t need—”\n“I’ll take it,” Zero said. “It’s okay, kids. Program for the show, that’s all.”\n“Why would we need paper—” Breeze’s gogg offlined, and their sound system shut down. Everything went smeary and silent; then the whole rig rebooted.\n“What happened, Moil?” they texted. All around them, people were pushing their goggs up . . . into hair that looked, they realized, like they had styled it expecting a data blackout.\n“Under the Ogua-Lik intellectual property user agreement, concertgoers are forbidden to run upload tech at live concerts. However, you have an accessibility waiver, on condition that you don’t transmit anything you hear or record. Personal use only.”\n“Accept terms,” Breeze said. Feeling perverse and apprehensive, they reactivated their capture app.\nThis will be what Zero wants, they thought—me getting another one of a kind recording.\nThe concert hall interior carried on the igloo metaphor with transparent bricks, all angled differently, faceting the lobby with varying shades of white, yellow, and gold. Like walking inside an intricately faceted diamond, Breeze thought. They could have stayed forever, watching the shifts and cascades of light, but the crowd was moving, an inexorable wash of bodies, into the amphitheater itself—a darker space, blue lit, like the depths of a glacial cave.\nMore oohs. The stage looked as though it was surfaced in black seawater. Two carved pillars of ice, swirling arrays of orcas rising to the roof, had been erected to form its proscenium. Mist feathered around their bases.\nZero started to lay a hand on Breeze’s shoulder as they all trooped to the balcony stairway. They turned, clearing the grip as they stopped abruptly. “Zero. About Doug—”\n“Whatever that pathetic old zoomer may have done to himself—”\n“I’m not stupid.” Breeze kicked at her ankle, just a little.\nHer expression blanked, just for a breath. Then: “I didn’t know he’d fireball, Breeze. I thought you’d go out there, charm him out of vandalizing the pillar, and get a few strokes for keeping him from self-harming.”\nA rush of relief. “Really?”\n“What do you think I am?”\nA shiver ran through them. “I’m sorry.”\n“Anyway, virtue prevailed, didn’t it? You got your face on the local leaderboards. Baby’s on the market. All your dreams are about to come true, Blossom.”\nBreeze fought the urge to just let it go. “Okay, but. Where’s his buddy?”\n“Who?”\n“The other zoomer.”\n“How would I know?”\n“Zero . . . ”\n“He ran for it, one imagines. Partnership of convenience, easily dissolved in a crisis.”\n“Speaking of partnership.” Breeze forced the words out. “I don’t like surprises. You and I can’t team up if you’re going to—”\nAn odd smile crossed Zero’s face, distorting the scar tissue, giving it that fake-looking sheen. She dropped a hand on Breeze’s arm. “I notice you’re telling me now, when it’s too late to cancel this opp.”\nKeisha turned back, an inquiring look on her face.\n“I’m not a saint, whatever you think.” Breeze shook their head. “We meet Magee, we boost Alice up the adoptee queue. But then you . . . ”\n“What? Go away?”\n“Yes.” The necessity of it, the need to get clear, was so strong it weakened their knees. “I’ll pay if I have to.”\nTo their surprise, Zero nodded. “I give you my word, Breeze. After tonight, I’ll never do a single thing on your behalf again.”\nAbruptly, she turned, hoofing it up the stairs, gliding past Keisha. Breeze frowned, puzzled. Then they saw the nurse, Inola, toiling up the steps in a vintage-looking ball gown.\n“I said I’d do your babyminding gig,” she said.\nFeeling absurdly touched, Breeze gave her social capital a stroke.\n“And if you find you want to tell me what’s bothering—”\n“Everything’s fine.” Keisha had backtracked to collect them.\n“She’s right,” Breeze said. “This is going to be good for us. For Alice.”\nIf Inola had misgivings, they didn’t show. “Come on, then. A concert like this is once in a lifetime for you. Don’t miss out.” She gestured gently—go, go!—and they all started shuffling, once more, up the stairs.\nBreeze hadn’t been sure what a “box” was, but it turned out to be a curtained private room, up high, with seats overlooking the stage. It offered unobstructed naked-eye views of the musicians, who were all clad in deep glacier blue. A single violinist wore a sheath dress in flame red—she, apparently, was a soloist.\nThey looked old, thirty at least, and some even older than that, and in the one-page paper program for the show most of them had listed missing loved ones in US cities within the space provided for their bios.\nBreeze dutifully scanned for names from Detroit. They hadn’t known any musicians, they didn’t think. But you never knew.\nThe event was billed a celebration and the music was matched to that brand: thrilling whirls of sound that came in tinny and discordant at first, forcing Breeze into a deep dig on their hearing aids’ settings. It took some fiddling to get the metallic edge tuned out of the soundflow. Clang clang squeak, and finally their rig reset. In flowed a vast richness of chords and changes—strange, hot, lavishing waterfall of music.\nThey didn’t quite know how they were supposed to react to the onslaught. There were olds in the audience, down below, who were dabbing at their eyes. Everyone seemed rapt. Keisha seemed fidgety. Inola was far away.\nAcross the auditorium was Kev Magee.\nBreeze zoomed surreptitiously. The billionaire looked just his newscycle images: ectomorphic twist of white in a whiter suit. His brand was tattooed on the backs of his hands, blue-lined circuit board diagrams, connected to navy blue permanails.\nAside from the dark-clad muscly types encircling the back of his box, Magee was the only one of his party not leaning forward hungrily as the orchestra brought the music to a bubbling crescendo, following the violinist into bright exaltations reminiscent of birdsong. Magee was chilled, all but swallowed by his seat. Aware, Breeze supposed, that the floorboards, the lights above, and all the musicians toiling below were essentially there for him.\nThe journo, sitting one row behind him, was muffling sobs into a handkerchief.\nZero slid into place beside Breeze just as the song ended, as everyone else, apparently having gotten some secret etiquette briefing, burst into applause. She had acquired a veil from somewhere, a drape of black fabric that hid the scar tissue below her goggs.\n“Remember what I said?” Zero signed. “Turn left, meet up, do the glad-hand. Aw shucks it weren’t nothing, Mer Magee. Anyone woulda tried to save that old pervert.”\n“Don’t talk like that about him,” Breeze said, undertone.\n“Up,” she said, nudging them to their feet and holding out a hand to Keisha, almost gallant. Keisha shifted her shoulders in the unfamiliar gown, getting her feet under her, adjusting the weight of the baby.\nBreeze looked at Keisha. Read my mind, read my mind!\nMiracle of miracles—she did. “I’ll be right behind you guys.”\n“No,” Zero said. “We’ll wait for you.”\nKeep the godmentor happy. Breeze’s sense of something about to go horribly amiss went from embarrassing throttle-it paranoia to ice-hard certainty. The journo with Magee was setting their goggs into place; they probably had special dispensation to capture the “spontaneous” encounter between the island CEO and the community’s new-minted hero.\nZero set Keisha’s hand into Breeze’s. “Remember, Blossoms, you’re doing it all for the baby.”\nThey got moving, stepping out of the box, once again getting carried along . . .\nUntil Inola, blessedly, stepped into their path. “How’s it going, Breeze? Keisha? Need anything?”\n“Yes!” Breeze said, stopping dead. “Can you take Alice and give her a primp and—”\nZero’s hand tightened on their shoulder with almost crushing force. Breeze felt the edges of their vision whitening. They struggled to hang on. Whatever staged footage Zero was hoping to capture now, the baby didn’t have to be in the shot. And maybe Inola was more than just a psych nurse . . .\nMaybe she’s a cop, maybe she’s a soldier, maybe . . .\nKeisha thrust the baby out. “Yeah! Please! Head down to the adoption table with her? We’ll be right there.”\nBreeze felt something lighten, somewhere in their gut.\n“On it, kids.” Inola slung the diaper bag over her shoulder, plucking up Alice and heading down.\nKeisha gave Breeze a wild, wide-eyed smile. On the same page, the two of them stepped up to the staircase.\nZero’s claw tightened, guiding them left. As they pivoted, zoomed-in views showed Kev Magee and his entourage.\nAnd suddenly they realized where their mistake had been. The answer was right there, in the center of the frame. Breeze had assumed they were the point of Zero’s actions. That she wanted sex after all. Or a meal ticket, at any price. But no—Breeze was just another game piece, just like the baby and Keisha and poor dead Doug the zoomer.\nThe carpet on the staircase was plush and new-smelling, the corridor spacious. They were walking side by side, each with one of Zero’s hands on a shoulder, Keisha taking tiny steps in her tight silver dress. All the while getting closer as Kev Magee loitered by the entrance to the grand box, waiting for his close-up. Ten feet away now, surrounded by security.\nIn their peripheral, Breeze saw a uniformed server working their way up a side staircase—the place was a maze—carrying a tray piled with treats and printables, stack of food so high they could barely see over it. The server fell into line behind the three of them.\n“I think this must be Breeze Frame,” Kev said, in a booming baritone. He lit up with pleasure and surprise, as if he hadn’t planned this encounter down to its tacks. With a flick of one blue-nailed hand, he signaled the muscly types surrounding him. They parted, melting to the walls like so much overheated glacier.\nThe clamp of Zero’s fingers released its grip on Breeze’s shoulder. Kev Magee offered a megawatt smile. The journo was in position, optimal camera distance.\n“Come on over here, my young hero,” the CEO prompted. “It’s so good to meet you. Do you shake hands?”\nBreeze did the only thing they could think of. They pivoted sideways and pushed Keisha back, hard, toward the nearest muscly type. Surely any act of aggression would make the security guards snap to order.\nBut the guard wasn’t in position. He was collapsing, doing a twitch-and-drool into the new carpets. They all were.\nA flat disk rose above Zero’s head, sweeping the corridor. Taser-drone?\nMolten light bubbled on the edges of Breeze’s field of vision. They fought the desire to make a mental run for it as the tray of food packets hit the floor behind them. Behind it, the server—it looked like Bob, Breeze realized, Bob the missing zoomer—broke into a run . . .\n. . . don’t white out, don’t white out . . .\nBreeze grabbed for Keisha, pressing their body over her, sinking them both into thick velvet curtain.\n. . . it was Bob, literally trampling the poleaxed muscle, scrambling over their broad backs as, arms out, he caught fire, going up like a torch, embracing Kev Magee in a flaming hug in the doorway of the CEO’s box . . .\n. . . screams, an auditorium full of people screaming now . . .\nZero did one last thing with her taser and it dropped into the heap of twitching security guards. She gave Breeze a contemptuous glance, ripped off the prosthetic scar tissue covering her face, and tossed it at them as she vaulted up into the array of pipes in the ceiling.\nThere were weeks of questions afterward, of course, and Breeze had to answer them again and again. When had Zero shown up? Had they checked her Orphan’s Club membership? Didn’t they suspect the scar wasn’t real? Did they know what she really looked like? What had she promised them? What did they think of Magee? Did they know he had a thing for wide-eyed idealistic kids?\nIt was the footage that kept them out of jail—Breeze’s shaky cam shots of Zero and her military-grade taser drone, working over the muscle. The follow-up shots after Breeze tried to climb into the pipes, attempting to give chase but getting wedged—there were no gaps wide enough for their shoulders. And Keisha, ripping off her shawl and trying to put out the flames on the burning bodies.\nInola vouched and vouched and vouched again, and made the Orphan’s Club get them lawyers, who argued Breeze and Keisha could never have afforded any of the tech involved in the hit.\nFirebombs and flying tasers cost real money, after all.\nIt was billionaires killing billionaires, just as Keisha had said. And for what? Breaking with their cohort? Pitching in with the rest of humankind?\nNearly three weeks passed, long days of secured custody, of zoning out in the Hayride and taking appointments with Inola. Of telling the security people their story, over and over again, every last detail.\nPermitted visit to a gym every day. Nap every afternoon.\nNo pings from Moil.\nNo job.\nNo baby.\nNo friend.\nWhen security let them go, issuing stern warnings to turn down all interview opps unless they wanted to risk getting arrested again, Breeze walked through Ashevak Park, past a sim shoot—historical, with fake nineteen-fifties families eating a fake barbecue. Business as usual. They watched for a while, feeling a little numb.\nThen, with no other destination in mind, they headed to the corner of Magenta block.\nKeisha was there, eating a printed muffin on one of the ready-made stoops, dressed in fireproof pants. A welding torch was tucked at her feet.\nBreeze stopped. Dropped their head. Almost walked on.\n“Hey!” Keisha signed, patting the space beside her.\nBreeze perched on the bench. “They let you out a week ago, they said.”\nShe nodded.\n“Alice?”\n“Homed. There was a bidding war, actually. One of the Magee heirs took her. She’s probably—” She pointed in the direction of Head Office.\n“Good.” Breeze shuddered. “That’s good?”\n“Good, yeah. But. I kind of miss her. All that time keeping her alive. Habit forming?”\nBreeze picked at their cuffs for a second. “Were you going to leave her, that day?”\nKeisha let out a weird, low chuckle. “For a minute. You didn’t give me the choice.”\n“I’m sorry for that,” they said. “I—”\nKeisha shrugged. “One less thing to feel bad about.”\n“I don’t think you would’ve, you know,” Breeze added. “Even if I didn’t. Insist. Assume? You’d have kept her.”\nKeisha smiled a little at that. “In jail, I thought about how that was the thing I’d miss most about you. The way you thought well of me.”\n“Think. I still think well of you,” Breeze said.\nThey glanced at each other, then away. Then back. All under eyelashes and through overgrown hair. Trying to see each other without the weight of obligations or thunderclouds of mutual resentment.\n“We’re a good team, you know,” Breeze added.\n“We are,” she agreed.\n“If you wanted to try staying homed together, we could put in a provisional family agreement, at the Club.”\nHer jaw dropped. For a second, she looked like she might cry.\nBreeze put up both hands. “No assumptions, no pressure. There’s an app to walk us through making a fair deal. Short-term, renewable. And only if you—”\n“If we both want,” she said.\nIt was hard to catch their breath, suddenly. “I get it if you don’t want to.”\nKeisha nodded. Put out a hand, checked that it was okay, and then wrapped it around their fingers.\nThat day Alice’s mom had gone missing, the two of them had been in her mother’s room, spread out on the bed, ignoring math and rhetoric. Taking a minute out from trying to get by and do school, all while trying to figure out how to avoid getting shot. It was their first time together, for sex. More than blowing off steam, less than romance.\nAnd it would maybe have been a one-off hookup, study buddies getting busy. A little anatomy to go with the quadratic equations.\nThey’d showered, had sex, showered again. They’d fed Alice and put her in her bouncy swing. As the afternoon wore on and Cynthia didn’t return, they’d even washed the bedsheets. Breeze had enjoyed that—enjoyed playing house, spouse, and baby makes three. Imagining old-school family.\nAll pretty fun . . . until it hadn’t ended.\nWas Keisha remembering that too?\n“Good morning, Breeze!” Moil chirped to life for the first time since their release, interrupting the flow of memory. “I have a gig in iceberg fabrication! Punch in time is in twenty minutes.”\n“Accept gig,” Breeze said. They squeezed Keisha’s hand. “What if we meet after work, eat some chicken sticks, and talk about it then?”\n“I’d like that,” she said, and with that she ran a single finger over the burned-in brand over Breeze’s eye, and the two of them got to their feet, Keisha heading off to fuse the joints and pipes and bones of Kevinsberg together with fire, while Breeze joined the countless thousands making desperation ice, dumping cold hope by the ton into the still-warming sea.\nToronto author and editor L.X. Beckett frittered their youth working as an actor and theater technician in Southern Alberta before deciding to make a shift into writing science fiction. Their first novella, \"Freezing Rain, a Chance of Falling,\" appeared in the July/August issue of the Magazine of Fantasy and Science Fiction in 2018, and takes place in the same universe as their 2019 novel Gamechanger and forthcoming 2021 sequel, Dealbreaker. Lex identifies as feminist, lesbian, genderqueer, married, and Slytherin. An insatiable consumer of mystery and crime fiction, as well as true crime narratives, they can be found on Twitter at @LXBeckett."}