{"fingerprint": "dni+f4k0EbLBB6LgmUXAScQpR+U=", "sitename": "Clarkesworld Magazine", "title": "The Future of Shame and Hope: A Conversation with L.X. Beckett by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/beckett_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Future of Shame and Hope: A Conversation with L.X. Beckett by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n The Future of Shame and Hope: A Conversation with L.X. Beckett\n Not all is bad and terrible and grim in the future. Sometimes disaster means change, and change means growth, and growth means a future full of cool ideas and good-hearted people. Hopepunk as a genre creates an opportunity for writers to explore positivity and kindness within the context of science fiction. Beckett’s “hopetopia” does just that, offering a kind action hero in a grounded but optimistic vision of the future.\n Cherub “Rubi” Whiting is a VR action star turned lawyer. Luciano “Luce” Pox is an embattled client, said to be outspoken, controversial, and downright rude, in a society where bad behavior has social and financial consequences. But when Rubi shows up to their first in-person meeting in Paris, Luce is missing. Worse, the authorities think Luce is an ecoterrorist. He may be on the run from the authorities, he may be under psychological attack, or he may be caught up in a far-reaching conspiracy. Whatever the case, Rubi has to find out what’s really going on and, perhaps more importantly, who Luce really is.\n L.X. Beckett is a “feminist, lesbian, genderqueer, married, and Slytherin” science fiction author and editor. Their novella, “Freezing Rain, a Chance of Falling,” a biting critique of the gig economy, appeared in The Magazine of Fantasy & Science Fiction July/August 2018 and The Best Science Fiction of the Year: Volume 4. Their novel, Gamechanger, is scheduled for publication with Tor Books in September 2019. They live in Toronto, Ontario with their wife, Kelly Robson.\n What books did you read growing up and how did that transition into writing?\n The first chapter books I read were biographies of famous American women, from a series written for school-age kids. They mostly fell into three categories: authors, the wives of presidents, and suffragettes. (In the latter case, the books almost never actually talked about the suffragette/feminist part.) So I read about Louisa May Alcott, Harriet Beecher Stowe, Julia Ward Howe, Jane Addams, Clara Barton, and Dolley Madison. A single book from the Lives of the Saints series had also crept in there . . . and that one was about Joan of Arc.\n The cumulative effect was to make me deeply interested in history, perhaps especially US history, and to give me an idea of women as authors, warriors, movers, and shakers. (And yes, occasionally martyrs.) People, basically. Despite the fact that marrying a president has never been one of my ambitions—the effect was to create a sense of possibility. It certainly never occurred to me that I couldn’t or shouldn’t write!\n When I was about seven my mother handed me A Wrinkle in Time by Madeleine L’Engle and Dandelion Wine by Ray Bradbury. A few years after that, I was reading whatever I could get my hands on—school library books plus whatever bestseller was lying around the house. I seesawed from Nancy Drew mysteries and The Witch of Blackbird Pond to Roots and Jaws and Raise the Titanic!. Then on to Andre Norton! (Also there was a lot of crime fiction and horror in the mix.)\n This sometimes makes me a writer who wants to be all genres, all the time. I write SF hopetopia thrillers, procedural eco-fantasies, and horror stories about time travel.\n How did you develop as a writer? Did you take classes or use crit groups or did you just read tons and try to learn from what you read?\n Both! I was writing and submitting short stories to places like Asimov’s from the time I was 16. But in time I went to Clarion West because I just didn’t feel like I was getting better fast enough. And a few years ago I started feeling strongly that I wanted another level-up, so I embarked on an MFA in creative writing.\n Has your focus always been speculative fiction or have you/do you write other kinds of fiction as well?\n It was only after I felt like I had figured out how to write a good speculative story or novel that I branched out. The first experiment has been writing straight up literary mysteries, sort of Canadian versions of the books I love by Brit crime deities like Tana French and Minette Walters. I wanted to see if I could write a murder story without mashing it up with ghosts, spaceships, or a time warp.\n Now, because I have dipped my toes back into going to school, I have recently had lots of opportunities to write other things: literary flash stories and TV pilots and horror movies and poetry and creative nonfiction pieces. There’s a whole pile of experiments in progress sitting on my desk, waiting to see which one I will dive into next. But all of that takes second seat to my SF writing—the current book, specifically.\n How does your background in acting and theater impact your writing?\n Lots of ways! I lean hard into dialogue—all my books are talky—and sometimes when I’m writing a tricky scene I will specifically think in terms of direction or blocking or even lighting cues. When I’m reading, if I can’t set the characters on a stage, it creates a big disconnect. On the other side of it, I often write about performers. Rubi, in Gamechanger, has a side gig as a performance VR player, and her father Drow is a has-been rock star.\n Does your approach to writing change if you are working on a shorter piece of fiction?\n If I think I am writing something that will turn out to be short, I spend a lot of time praying this will prove to be true. I like complicated things and given the slightest bit of rope, my stories tend to expand. I always start by saying “This one will be under 5,000 words . . . well, 6,500 . . . well . . . ” Every writer has hang-ups and my biggest one is an idea that I ought to be capable of brevity.\n Some of my best short work has, therefore, been for theme anthologies where someone else has set very particular limitations for both length and topic.\n How did Gamechanger start for you? What was the inspiration and did the direction change after you went deeper into the writing?\n Gamechanger’s initial seed was an obsession with Internet shamings. I had tried three or four times to write a story about a journalist who’d written a true story that got them vilified online. After a bunch of false starts, this idea became my novella “Freezing Rain, a Chance of Falling.” (Which is a Best Science Fiction of the Year pick and reprinted in Forever!)\n The journalist is Drow (who is an old man in Gamechanger) and once I had found him and shattered his life, I decided I wanted him to have an artificially intelligent sidekick that actually worked. I was very into Gotham at the time and had a lot of passionate fannish feels specifically about Sean Pertwee’s Alfred Pennyworth. So I imagined a couple of Batman fans who’d created a piece of sentient fanfic to more or less raise their son for them and Crane was born.\n My final inspiration came from the environment. I’d moved from the West Coast to Toronto, and was experiencing real Canadian Winter™ for the first time in 22 years. They weren’t quite the winters I grew up with in Northern Alberta but my reaction to bundling up and schlepping through snow drifts connected to a lot of thoughts I was having about climate change.\n After I wrote the novella I knew I wanted to think beyond the Setback-era world it imagined, building forward through a few more generations. I imagined the Clawback period and then the Bounceback. Then I came to Rubi.\n As for direction, by the time I got to Rubi the idea had come full circle. Rubi is a public defender representing Luciano Pox, who is at risk—just as Drow once was—because he’s unpopular on the future Internet. Thinking about what our current online honor/shame culture could do if it was rigorously channeled in positive directions, and existed in a world where we were making massive efforts to address climate change. That lead to a lot of extrapolation for Gamechanger.\n Gamechanger is really chock full of ideas. There’s a lot of SF going on. But everything blends seamlessly, makes sense to the world, and is important to the story. How did you manage all these ideas, along with making them relevant?\n Seamless—thank you!!\n I think the biggest challenge with keeping it relevant was not falling behind! I had started writing about the likes and strikes economy before Black Mirror did a similar riff, and before I found out that China was test driving an equivalent of the same idea.\n Every day I go online and see people in STEM working their asses off to find ways to stabilize our ecosystem, often in the face of corporate, government, and public indifference. They are inventing marvels as we speak—nuclear diamonds! Tree planting drones!! All I had to do was imagine a future where we develop and deploy these technologies with heart, intelligence, and yes, sometimes a bit of desperation too.\n There’s a visionary element to this story, in that everything has this sense of . . . potential realism. By that I mean, we don’t necessarily expect life in the future to be the way it’s depicted on Star Trek, but Gamechanger seems grounded in more realistic extrapolations of current situations, in terms of climate, politics, and culture. At the same time, the narrative leans less “fantastic” because of it. Can you talk a bit about the purpose, the drive for this; or perhaps the challenges of it?\n Star Trek was hugely optimistic and aspirational, and it changed a lot of lives. I wanted some of that sense of hope and aspiration, even though we live in a time when it’s so much easier to be cynical. We hear about or imagine something good, and there’s a temptation to dismiss it as impossible, without even examining it. It’s because we’re scared to hope, essentially. We’ve been encouraged to be super-scared and give in to helplessness.\n Me, I decided: screw that!\n The Bounceback future is our world in a hundred years(ish). It’s a world where we find a way to make our current techno-encroachments on privacy a social good. It’s a world where built-in cameras and consent assessment apps radically reduce the incidence of sexual assault and other acts of interpersonal violence. It’s a world where we don’t futz around wasting police time on property crime or drug prohibition, where we instead police wage theft and triage corporations with rapacious environmental practices. It’s a world where we don’t give up everything we have and value now—though we do lose some things! It’s the opposite of descending into fascism, cannibalism, and dystopia.\n This is an optimistic future, and I’m not saying we can achieve everything in my book just as I imagined it, but a lot of what’s in it is possible. It’s a world our current crop of high-flying tech bros could go a long way to building, if they cared to consult stakeholders widely, think about the knock-on effects of humanity’s remarkable achievements, and imagine harnessing our best ideas in the cause of extraordinary good.\n Cherub Whiting (aka Rubi) is a great, complex character. Do you see yourself in her, or did you draw directly on specific people as models for her?\n Thank you! I know a lot of crusading lawyers and social activists. (I don’t know so many people who do parkour, but I do know a lot of sporty folk and gamers.) Rubi had lots of inspirations. She’s a naturally generous do-gooder, from a generation of people who have begun to renew the world.\n Rubi does, as the book opens, have a dose of what is sometimes called compassion fatigue, and that is something I’ve experienced as an activist. And she’s pulled in multiple directions by the demands of her multiple work gigs, which is a problem I think will resonate with a lot of readers in the here and now. Plenty of us have two (or three or four!) jobs instead of one, and even though on paper the hours are supposed to come to a full work week and a decent standard of living, we all know the bite of having the week run long and the money run short.\n What is your favorite thing about Gamechanger, what was the hardest thing about writing it, and what do you really want readers to know about it?\n I want readers to know it’s fun! Fun fun fun! It has an old rock star chasing a conspiracy theory. Rubi has an awesome love interest/archenemy out in the gaming world. It has megastorms and a big fight at a small Piccadilly theater and a strange mystery at its heart. Also shrink-wrapped Manhattan, giant nuclear-powered pyramids covered in LED artwork, and very flexible ideas about how many people belong within a legal marriage.\n The hardest thing about writing it was definitely keeping all of my balls in the air—it is quite the juggling act, with lots of POV characters. Even being sure the reader and I knew where any given scene was taking place, and whether it was in the real world or VR, was sometimes a challenge.\n My favorite thing about Gamechanger is that it’s a story about how we survive, how we keep being lovers and parents and gaming fans and activists and friends and lawyers and artists. We don’t all get taken over by oligarchs and racists. A century from now, in my world, compassionate, cool people are living smart, productive lives in an ecosphere they worked incredibly hard to preserve . . . and they’re even beginning to see the big first hints of a chance to re-wild other animal species.\n (My second favorite thing is the happiness management app, Happ, because everyone who has read the book has adored him.)\n What are you working on now that readers can look forward to?\n I am so close to having the sequel to Gamechanger finished! It’s called Dealbreaker and it also jumps forward . . . not quite a generation in this case. I can’t tell you anything else because: spoiler spoiler and more spoiler. But! It also has all of the above fun things, plus a global push to develop both FTL spaceships and viable wormholes. At speed. And to do it, no less, in the midst of my personal nightmare, a worldwide coffee shortage.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}