{"fingerprint": "5iIqwBHtDhcbuyGDudDMJVRySnY=", "sitename": "Clarkesworld Magazine", "title": "Astounding Scientists and Alternate History: A Conversation with Gregory Benford by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/benford_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Astounding Scientists and Alternate History: A Conversation with Gregory Benford by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Astounding Scientists and Alternate History: A Conversation with Gregory Benford\n The effects of World War II echo through today. The scientific advances conceived on both sides during and in the wake of the last World War shaped the world. The Manhattan Project ushered in the atomic age and NASA sent astronauts to the moon utilizing V2 technology. But, as it is with many things, a slight change to the history books may have yielded a very different outcome. The Berlin Project by Gregory Benford explores an intriguing “what if” scenario where the first atomic bombs were ready to go earlier. Karl Cohen, a chemist and mathematician on The Manhattan Project helps the team find an alternate way of isolating Uranium 235 making a bomb ready to drop on Germany in 1944. Together, with some of the most brilliant scientific minds of the 20th century drawn with painstaking detail and humanity, Karl hopes to alter the outcome of the war and hopefully save millions of lives.\n Gregory Benford is a physicist, educator, and author. He has also served as scientific consultant to the NHK Network and for Star Trek: The Next Generation. He’s won the John W. Campbell Award, the Australian Ditmar Award, the 1995 Lord Foundation Award for achievement in the sciences, the 1990 United Nations Medal in Literature, and is a two-time winner of the SFWA Nebula Award. His latest novel The Berlin Project was release by Saga Press on May 9th.\n WWII has continued to fascinate the world and numerous alternative history novels have been set in that era. What was it about the creation of the atomic bomb that inspired you to write this book?\n Alternate History provides a way to think about the fragility of history. It lets us see what later might seem inevitable, yet is the outcome of chance and many unpredictable forces. WWII is the source that keeps on giving, for it touches on many problems we have today, especially the role of all-powerful weapons like nuclear, biological, and chemical ones.\n I’m a physicist, with a PhD earned in 1967 at UCSD. I was a postdoc for Edward Teller, who gave me the central idea of the novel: that we made a big error in judgment in 1942 and wasted a year before getting the bomb. I worked with Teller and came to know him well. My job interview with Teller was both terrifying and stimulating—at the end of it I suspected Teller understood my thesis better than I did. I was vastly surprised when he hired me immediately.\n The entire history of nuclear weapons is interlaced with scientists thinking about the future, using science fiction as a prompt. H. G. Wells’ “atomic bombs” and the Robert Heinlein and Cleve Cartmill stories in Astounding Science Fiction were indeed broadly discussed at Los Alamos (as told to me by Edward Teller). The investigation into the Astounding stories now seems odd, but it was viewed as very important by the security agencies, including the FBI. As Robert Silverberg has remarked, “Turning war secrets into second-rate SF stories might seem, to the dispassionate eye, a very odd way indeed of betraying one’s country.”\n Plus, as son of a military officer, I lived 3 years each in occupied Japan and Germany. I saw the aftermath of WWII everywhere, talked to the survivors (among them my father, who was also in Korea and retired as Commandant of the Artillery School, Ft. Sill). About a million people died every month in the war’s last year. Avoiding that seemed tantalizing.\n Many of the characters featured in The Berlin Project are scientists that are very well known in name, but not quite as well known in character. We know what they discovered, but most don’t know what they were really like. What sort of research did you do to help imbue these famous scientific figures with humanity?\n I knew many figures in this novel personally, so I wrote them in from memory; writers are magpies. Freeman Dyson, whom I met at the UCSD daily coffee in 1963. Maria Goeppert Mayer, for whom I graded the homework and exams in her graduate nuclear physics course at UCSD. Dick Feynman, I met several times. John W. Campbell, editor of Astounding. Many others. I tried to echo their manner of speaking and thinking. Further, every document quoted in the novel is authentic, though some have dates altered to conform to the plot.\n Your novel is filled with some complex scientific concepts but never gets mired in jargon or tedium. Did you find it difficult striking a balance between thoroughness of the science and keeping the story clear, concise, and moving?\n That took work. I used over forty figures and photos, thinking ‘This is an historical, why not show readers what that era looked like?’ Hard science fiction, even hard alternate history, shouldn’t be hard to read, too. So, let the past speak for itself, visually. And keep your finger on the pulse of the science. It helps that I worked on nuclear weapons at Livermore. I know this stuff in great detail.\n What was the first science fiction novel to really grab hold of your imagination and made you want to become both a scientist and a writer?\n Farmer in the Sky by Robert Heinlein. Plenty of orbital mechanics, planetary savvy, and even an explicit prediction of the microwave oven! I fell in love with the genre. I even have my copy, first hardcover I ever bought, in the Army Post Exchange in Tokyo, in 1950. My brother and I were nine years old.\n You once said, “Science is . . . like literature, a continuing dialogue among diverse and conflicting voices, no one ever wholly right or wholly wrong, but a steady conversation forever provisional and personal and living.” What are some dialogues you’re seeing in both science and literature happening right now?\n Increasing mining of SF ideas by mainstream writers accelerates steadily. Mostly they misuse the ideas but sometimes they bring fresh talents to them, all to the good. Hard science fiction is hard to write, so mainstream writers (mostly English majors) avoid it, leaving the advances to us. We write for a scientifically more knowing audience the mainstream can’t entertain. Our major social problems come framed in science fiction terms: If this goes on . . . and What if?\n How has your career as a scientist informed your writing and vice versa?\n I mine my life for material. Everything goes into the unconscious and emerges as fiction. I’ve often used fellow professors at UC Irvine, thinly disguised. My research often comes from speculations that border on fiction: What makes the huge luminous streamers at galactic center glow, a hundred lightyears long? How would you propel small vital packages around the solar system? How would faster than light particles change our perception of time? I’ve published papers on all these ideas, and novels too.\n You’ve written novels with David Brin and William Rotsler and Gordon Eklund. How do such collaborations arise and how do they typically work?\n Also, Arthur C. Clarke and Larry Niven. Writing is lonely work. Science fiction, idea-rich, profits from knocking ideas back and forth, intellectual ping-pong. This mirrors science, in which the majority of published papers have multiple authors. That’s a signature of the closeness in feel, the fact that science fiction springs from the technoscientific culture, which finds its voice in science fiction, and so has come to dominate much of popular media.\n Each collaboration worked differently. David Brin and I took different characters in Heart of the Comet. Rotsler and I did that and threw in vagrant scenes to keep ourselves amused. Gordon Eklund and I rewrote each other a lot. Larry and I trade ideas and text incessantly. Arthur called me up and we wrote while telephoning, at long distance from Sri Lanka. You gotta be flexible.\n I’ve read that you started reading science fiction while you were living in occupied Japan after WWII.\n Yes, Heinlein, Clarke, the gamut. My twin brother and I became such devotees we subscribed to the magazines when back in the States for two years, then published a fanzine, Void, while in Germany for three years. That pitched us forward into a future we wanted—so became physicists, and on to a rich professional life in which my hobby was writing.\n You’ve done work for NHK and lived in Japan. Do you know any Japanese? Do you have a favorite word or saying?\n Indeed! 一期一会\n “One life, one encounter.”\n Every encounter is a once-in-a-lifetime meeting. This underscores how many first-and-only-time things happen in the day-to-day. So, treasure the moment!\n I studied Zen Buddhism to learn this.\n How did you meet Buzz Aldrin?\n He lived in Laguna Beach, had read my work, so he called me up to ask if I wanted to co-write a novel with him. I liked him, but was too busy, so handed him off to John Barnes, who did a great job. Great guy, Buzz. Send him back into space!\n Do you have any other projects in the works?\n I’ve finished my next novel for Simon & Schuster, titled Rewrite. It’s about a man who reawakens after his death, in his eighteen-year-old body, and reinvents himself. But what made that happen? In the end, it’s a novel about quantum mechanics and living in our weird world.\n Now I’m deep into the third novel with Larry Niven, concluding the Bowl of Heaven sequence. Then I’m doing a novel about a woman librarian in a future SETI Library. Ideas abound!—mostly coming from my continuing scientific career. Use what you know!\n Do you have any advice for aspiring scientists? Writers?\n Write daily. Use your own life. Plotting is hard, so spend your time on it. Be generous to your readers. Make them want to turn the page. Rewrite!\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}