{"fingerprint": "fV34QAoaT19qs0C+Sl/b6+P9aTQ=", "sitename": "Clarkesworld Magazine", "title": "Now Dress Me in my Finest Suit and Lay Me in My Casket by M. Bennardo", "author": "M Bennardo", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bennardo_12_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Now Dress Me in my Finest Suit and Lay Me in My Casket by M. Bennardo", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2040 words, short story\nNow Dress Me in my Finest Suit and Lay Me in My Casket\nEvery night as a young girl, I would help my grandfather finish dressing in his nicest, cleanest suit.\nHe would stand in his black gold-toed socks on the bedroom rug, his twill trousers hanging slack as he threaded cufflinks through the buttonholes of his shining white shirt. His tie knot was always a double Windsor, with a tie-pin pushed through to keep it in place above the collar—a cheap manufactured ruby on the end of the pin to match the cufflinks.\nHis grey hair was carefully shaped and parted too, then sprayed into permanent obedience, the individual marks of the comb-teeth preserved like furrows in a field. Earlier, just after dinner, there had been a fresh shave for his cheeks and neck, a fresh trim for his moustache, and two quick sharp splashes of aftershave that lingered now in a muddled miasma of witch hazel and alcohol.\nAny night of the week, my father might pass by as I helped my grandfather into the cool black sleeves of his jacket, dusting his shoulders and back for stray cat hairs. Father wouldn’t say anything—wouldn’t even look in the room. But a slam of a door down the hall would let us know how he felt.\n“No shoes,” grandfather would say to me, as if he were imparting a great secret of life. “No shoes and no hat. And every pocket empty.”\nAfter that, there would be only the newly pressed crimson pocket square for his jacket breast, and then the short climb up to the casket where I would help him lay down on his back, his eyes closed and his hands folded over his stomach, black plastic rosary beads spilling over bloodless white fingers.\n“Good night, Patty,” he would say.\n“Good night, Grandpa,” I would reply.\nThen I would screw the casket lid down and leave him inside until morning.\nAs Doc screwed down the collar of my EVA pressure suit, my mind swam back from forty-five years ago back to the present. A humorless smile twitches on my lips as my eyes dart to Doc’s face. “Do you know what this makes me think of?”\n“What?” she asked. Her voice was quiet and accommodating, but her fingers flashed quickly and precisely over the suit as she snapped collars together and pulled the insulated fabric into place around my limbs. Without ever talking about it, we had somehow all agreed that her cool surgeon’s fingers would do the fastest job of dressing me. “What does it make you think of?”\n“Did I ever tell you about my grandfather?”\nShe paused, stretching a heavy sleeve over my arm, just about ready to fasten it to the hard torso shell. It lasted no more than a second, but my heart seemed to beat ten times before she moved again.\n“You ready down there?” It was the commander on the radio, cutting clumsily into our solitude. “We now have twenty-nine minutes until the defect rotates into the radiation zone again. That’s two-niner minutes.”\nThe defect. The hole in our ship, through which a steady stream of atmosphere was venting into space. The hole that would render our fragile life-giving envelope a lethal vacuum in six hours if not repaired now.\n“Almost ready,” said Doc, completing a last check on my limbs and torso. “Just the helmet left to go.”\nNo helmet, I thought absurdly to myself. No shoes and no hat. Every pocket empty—! But I was already in boots, and my toolbelt bristled with tools. Already, I’d gotten grandfather’s secret formula wrong.\n“Patty, you sure you can do this in time?”\nThat was not my grandfather. It was the commander again, and I could sense the doubt in his voice. I was faster and better at the needed repairs than anyone else aboard, but if it was going to take too long—if somebody had to soak up a few hundred rads of solar radiation sealing that defect, then it by God it was damn well going to be him—\n“Affirmative.”\nI didn’t hesitate, didn’t stop to think. I’d already committed to the lie back when the commander had asked for possible solutions. He’d been skeptical then. Doc had been skeptical too. But I’d been convincing—or maybe they had all just wanted to believe me.\nAnd I would get the leak fixed. But the angle of the images we had was poor, and I didn’t really know how long it would take. Sixty minutes, I would have guessed, if I were being honest. Maybe as long as ninety. And by then I would have spent over an hour bathed in heavy SPE radiation and might even already be showing symptoms of acute poisoning—\n“He did it as a kind of practice run, right?”\nI looked up. It was Doc asking me now. It was just the two of us in the airlock, and I suddenly felt as though there was also some kind of leak in me. I felt a coldness creeping in. Loneliness and fear and sullenness—\nI could fix the leak, and I could do it before any symptoms got too bad. But that was all I could guarantee.\n“You told me that your grandfather wanted to practice dying, until he got used to it. Until he wasn’t afraid anymore.”\nI nodded. Doc was trying to calm me. I must have been starting to show signs of panic. I’d be useless if I froze up, if I let the panic take hold—\nI took a deep breath. I looked in Doc’s face. “Yeah, I guess he got into the casket and thought about bright lights and clouds and angels—” I laughed sadly at that, but I shivered too. “But with me—” I had never much believed in angels or heaven, not even as a girl. I grunted. “I suppose these EVAs out in the vacuum of space make a pretty good practice run for eternities of atheist nothingness—”\nAnd suddenly Doc stopped what she was doing with the helmet. She had her back to me, and I could see the line of her spine change. I could almost see the puzzle pieces linking together in her head.\nBut it was all right. I realized that I had wanted her to know. I had wanted somebody to know. But I also knew that, unlike the commander, she would still let me go. That I was still the best hope they had.\nWhen Doc turned back around, her voice sounded light, but her eyes were growing soft and watery. “Did it work?”\nI closed my eyes. I thought of the morning I found my grandfather’s dead body. I unscrewed the casket and lifted the lid, uncovering that horrible expression on his face, his twisted mouth and bruised forehead, his wide popping eyes, the blood under his fingernails and the scratches along his face.\nIt was a face of horror. Horror at the finality and loneliness of death. Despite all the practice runs, every night for years, the real thing had still caught him unprepared.\n“No,” I said. I breathed a deep breath, the coldness and loneliness enfolding me utterly. “It didn’t work at all.”\n“Suppose I tell you about my grandfather?”\nIt seemed like a million years before I heard Doc ask me the question. With effort, I pulled up out of my funk and looked at her. In reality, it must have been something like five seconds. But time passes slowly, darkly, horribly in the void of tangible death—\n“He was in special forces in the Second World War,” Doc was saying. “Secret, dangerous, behind-the-lines kind of work. Serial numbers filed off the dogtags.” She held up a small brown rubber ball, no bigger than a pea. “He even carried an L-pill.”\nMy eyes focused on the ball. It looked like nothing so much as a rabbit dropping. “A what?”\n“A lethal pill,” said Doc. “A rubber-coated glass ampoule filled with concentrated potassium cyanide. Bite it open, and death comes in minutes.” She thrust it toward my mouth and automatically I opened my lips. It fit easily, comfortably between my gums and cheek. I inhaled a shocked breath. The pill stayed in place.\nDeath in minutes, I was thinking. So different from what I had imagined would happen to me. Acute radiation poisoning—skin drying out, internal organs in revolt, waves of painful headaches turning my thoughts into knives—\n“You brought it up here . . . ?”\nDoc smiled wryly. “Even after the war was over, my grandfather carried it everywhere. He said it terrified him to leave the house without his L-pill in his mouth. Funny, I know. But he couldn’t stand the idea of the randomness of the world, the uncontrollable nature of his own fate, when any moment a thousand different accidents might befall him.” She lifted the helmet and lowered it over my head. “Then, of course, he died peacefully in his sleep, with his L-pill in the nightstand drawer. After his funeral, I took it and started carrying it with me too.”\nI nodded inside the glass dome of the helmet, the sound of the enclosed air echoing in my ears. I was still afraid, still stressed to the limit, still twisting and twirling on the cold hook of dread that pierced my stomach—\nBut the pill did feel comforting in my mouth. I couldn’t understand how or why. It wasn’t simply that I wouldn’t have to go through the worst of the symptoms of poisoning if I didn’t choose to. I had already fantasized a dozen different escapes from that.\nBut this pill was also a relic—a real man’s memento—a physical link to another human soul that ventured into the dark and cold and the prospect of near-certain death, and who had done it not cheerfully and not willingly, but perhaps lovingly—\nYes, how odd to think of that word, but it was the right one. To go lovingly into the empty and lonely void of death, as this man before me had also done—!\n(And who lived! Did I dare to remind myself of that as well? That miracles did happen still?)\n“Thank you.”\nDoc smiled and patted the top of my helmet. “We love you too.” And that was how she left me, alone in the airlock, with her grandfather’s pill in my mouth.\nAs I turned toward the airlock doors, watching the clock count down until the instant they would open, a thousand different thoughts raced through my mind.\nI thought of my own life—what I had learned and what I had striven for. The children I had raised, the careers I had followed. The strange and singular and unlooked-for roads that had led me to this very moment—a last moment perhaps, the last moment ever that I might have for introspection or reflection or to understand what it all meant—\nI thought of my own grandfather, and his nightly ritual. My child hands helping him dress for sleep, my ears listening to the totems and talismans he threw up against the coming night. Now dress me in my finest clothes and lay me in my casket. I’m going where I won’t be back to a gentle friendly death—\nI thought too of Doc, and what she was doing now that the door had closed irrevocably between us. Whether tears were falling from her eyes, whether prayers were stirring on her lips. What she was doing in this moment—a singular moment for her too, a moment where we had both stood powerless together before the void of death, able to recognize it but unable to defeat it, able only to spend one last moment together in whatever way made us most human—\nBut by then the doors had opened and the commander was saying something in my ear over the radio, and I was already pushing off from the airlock (no! wait! called something inside me, only to immediately fall silent again) out into the awesome expanse of waiting space.\nThere was my job to do now, and a million details to keep straight in my head. And above it all, through every last second to come, no matter how many they should be, the faint tang of old rubber in my mouth."}