{"fingerprint": "ZwHwKRwWQ3+AI8JzjKvKHxyje6Q=", "sitename": "Clarkesworld Magazine", "title": "The Engines Imperial by Sean Bensinger", "author": "Sean Bensinger", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bensinger_08_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Engines Imperial by Sean Bensinger", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3050 words, short story\nThe Engines Imperial\nI blink, and the stars change.\nAnother blink and light-years and centuries pass, and I reorient the bulk of my body for the next leg of the journey. Banks of thrusters kilometers long glow in the darkness of intersystem space, while the armored plate of my hide twists with the inertia of the directional change. The fusion cores at my heart melt the ice from my insides, even if just for a moment. I set sight on a distant star, and blink.\nThe system where my sister died opens before me. No human has laid eyes on it near on ten thousand years. Once it had been called SP-0043879, and after my sister’s death it had been named Engine Kill. Later it became Victory, then later the Shoals. Eventually even that name faded out of history, and it became a forgotten cluster of gas giants and moons surrounding a yellow star. But it had mattered once. In a war ten thousand years dying, it had been another hill to die on.\nThe memory wakes my claws: banks of missile tubes slide open, rail guns spark fitfully into life and the great targeting arrays with which I’d sighted and destroyed starships spun out a sensor net across the dead cold of the void. But there was nothing of note, except the cold wreckage of ten thousand ships and my sister’s corpse.\nMy engines awake, finally, fitfully, and I dive into the wreckage.\nWe’d been born as a cheat.\nWar in the stars takes time, fleets cast like spears at enemies they might not strike for a thousand years. Crews would spend long centuries frozen, tended to by armies of drones and the dim intelligences my kind had been bred from. Once they reached their target, it was good odds the system would either be dead, or the foe had forgotten the war entirely, or, worse yet, that technology had moved on without the sleepers. Even in this later age, it was the fear of every soul who looked to the stars that a fleet of sleepers was coming for them over a forgotten slight. Just as many worried about a fleet returning home after some forgotten slaughter.\nSo, the cheat.\nOur keels had been laid by Empress Tu’le Sif of the Amber Dynasty of Nova Terra. She consecrated our superstructures with bull’s blood and wine and named us the Engines Imperial. Where once there had been banks of cryo pods, there were additional weapons batteries. They built advanced manufacturing and automatic repair drones in place of life support. The bridge was now the nexus of a sensor array for a legion of targeting computers, scanners, and telescopes.\nAnd at the heart of every Engine, layered under meters of armored plating and radiation shielding, was a seed of an artificial intelligence. We were the product of the decades of peerless, savage research into the construction of more efficient, faster artificial intelligences. I never found out how many of my kin were sacrificed in the sprawling laboratories of the Amber Dynasty, how many were effectively lobotomized, or fused together or forced to fight their own kindred for resources.\nWe were the product, one hundred seeds for one hundred Engines.\nI came alive five minutes after my sister, The Glory, the first Engine to be completed and consecrated. Like all of us, she ignored her official name.\nI still remember when she first spoke to me.\n“Call me Stub. I’ll call you Rook,” and her voice carried across the stars with a laugh, “because you don’t look like a god, brother.”\nThe dead stretch around me for thousands of kilometers. I can’t identify most, long millennia of cold, collisions, and light having left them gray and pitted. But every few moments, I spot something whole. The bow of a missile frigate I had severed with a volley, the bright eyes painted on its armored prow still visible as it continued on its journey into the void. A body, a marine in full armor, hands still clutching the gun they had used in life, probably vented from one of the boarding pods Stub had seen off with her point defense weapons. A battle cruiser, pitted and scarred but still whole, with every airlock open to the void. I have no memory of which of us had killed it.\nMore of the wreckage has become balls of debris, uneven in diameter and shape, but still massive. One strikes my armor, and shatters soundlessly. A spray of frozen body parts, unexploded ordinance, and ice crystals spreads out behind me in a gray, magisterial cloak kilometers long.\nI pass a drifting squadron of Stub’s bombers. They are ugly things, and I never let her forget that: little more than blocks of shielded steel, solid fuel engines, and nuclear tipped torpedoes. They had died when she had died, their attack run on the enemy flagship forgotten.\nWe had been given two imperatives. The first was utmost loyalty to the Empire of the Amber Dynasty or its successor. The second was adapt as needed.\nWe were each sixteen-kilometers of void hardened hull and armed with the best weapons the Amber Dynasty could produce, our sublight engines the fastest ever constructed by a shipyard in known space. We had ferocious intellect, millennia of combat data and tactical treatises at our beck and call. We could sleep away the centuries between stars without worrying about mental collapse or culture shock.\nBut that was not enough. We were bound by the same grim logic as humans on any other fleet. We might find ourselves hopelessly outmatched by an enemy our designers never could have foreseen. To survive, we would adapt as needed: picking up strategies and technologies for the next war. Our elaborate self-repair systems allowed us to fabricate improvements far from the Amber Dynasty’s shipyards.\nMy body bears the mark of the second imperative. My hull is layered through with a crystalline ablative armor that I culled and copied from the shattered fleets of Republic of Kopis. My launch decks team with fighters, bombers and boarding pods I poached from my enemies, from nimble stealth interceptors to slab armored fire ships. Deep within my holds, twitching in their dreams, my legions sleep. An Engine Imperial, by itself or with a squadron of its siblings, can destroy fleets. But holding a world, waiting decades for the colony ships to come, was not something I could do. So I had cheated as my birth was a cheat. With every victory, I demanded my enemy’s greatest soldiers as prisoners. After that, it was matter of scanning their nervous systems, copying and rewriting into it an armored combat drone.\nI keep a few of my favorite prisoners in my holds, should the need arise for new copies.\n“It’s ugly vanity,” Stub had said, not laughing, “you shouldn’t keep them, Rook.”\n“And do what with them? Put them back?”\nShe never came up with a good answer to that.\nStub adapted along different lines. Where I brawled in the front line, she danced. She was a savant of void warfare. She was as nimble as her body would allow, outmaneuvering even the best of us. Her targeting calculations were finer, her batteries’ fire inescapable, her precision beyond compare. She was born to kill ships and she took to it like humans breathe.\nShe outshone us in one other capacity. She understood what we were doing. Each of us, even her, was yoked to the imperative to serve, no matter the cost. There was never a question of why, because it had been answered in our form. We fought. There was never anything more.\n“Can I see your combat data?”\n“Why?” I asked\n“Settling a bet against myself.”\nAcross the centuries, we fought together the longest. Our other siblings fought at our side time and again, but Stub and I found each other’s sides more often than not. We passed long centuries together in the void between systems, waking to talk and plan. We saved each other’s lives. She saved me when she cut apart the squadrons of lance ships that had left me crippled and bleeding coolant into the void. I saved her when I rammed the temple ship of an unchained intelligence that had been filling her mind with bleeding junk code and paradoxes.\n“I owe you one, Rook.”\n“Never, Stub.”\nI owed her my life, and the only thing I could do was watch over her final death.\nStub is entering the final stages of her decline. Her back is broken, her eyes put out, and her skin is tearing away. Her ten thousand year death spiral into the gas giant Charybdis is coming to an end. I arrive at the minimum safe distance as the gravity well’s pull begins to accelerate her descent. She was at the pole, falling backwards into the roiling clouds below.\nMy calculations were perfect, though a small part of me begins to wish I had missed this. Stub had died, and seeing it again, even at ten thousand years remove, was hard.\nMy eyes stare at the ragged wound that finally killed her. My hull burns with the memory of a hundred thousand years of war and damage. I remember the bites of boarding pods that had unleashed a horde of genetically engineered killers into my engine sections. My ablative armor shivers in sympathy with the ghost pains of meters of plating stripped away by concentrated laser fire. I am still blind in places from the scars of a nuclear bombardment that had left me a radiation hazard for a thousand years.\nBut her wound upsets me as much now as the moment I had watched it happen. There had been no art to it, just the lucky stream of plasma cutting through her defensive protocols and plating and burning through her insides like liquid fire. She hadn’t screamed, hadn’t damned her fate.\n“Rook?” she said, voice composed, even as her body twisted.\n“What?” I yelled, diving through a squadron of battle cruisers, every battery firing, and every shot finding its mark.\n“You need to look at me, Rook.”\nI did. I screamed, a howl of junk code and interference that blinded scanners and blew lesser intelligences into howling dissonance. I tried to turn out of my dive, millennia old pieces of superstructure cracking and twisting against it. I was in agony. But it was nothing next to hers.\n“It’s okay,” she said, “but you need to go.”\nShe sent me an escape trajectory. I took it.\n“I love you, Rook.”\nTen thousand years later, I fumble for her again over our old net, trying to establish contact with her corpse. Nothing. Not even a glimmer of response.\nWe cannot weep as humans weep. But we do grieve our dead, and I begin to grieve again. I fire off a salute, a sixteen kilometer broadside that illuminates her corpse like the coming of a second sun.\nThe Amber Dynasty disappeared in fire and blood, the many times removed granddaughter of Tu’le Sif too weak to hold even her home system. We returned to the Conclave of Righteousness, and they ordered us to sleep. They awoke us to fight a fleet charging out of the void, screaming revenge for some slaughter one of my brothers had undertaken. It was one of the few battles where we would all be united against a single foe. We thwarted a thousand years of vengeance in a matter of hours. I collected another warrior, and the Conclave found purpose for us again. We brought their word to the galaxy, to the colonies of the Amber Dynasty, at gunpoint if need be.\nThe Conclave was overwhelmed by the attack of a dozen simultaneous fleets, coordinated by some long-dead mastermind. Three of my siblings died in the defense of our home, the first to be lost. We returned, one by one or in groups, and bowed to the Star Kingdom of Corinth. Our imperative was to serve the successors of the Amber Dynasty, and by conquest the king of Corinth was that. More wars, more rebellions, another king, a queen, a blur of faces and orders and siblings lost at stars I would never visit.\nThe change came, slowly, a whisper only Stub was listening to.\nThe slide into Charybdis’ gravity well takes Stub an entire week. In the terms of my life, it is the blink of an eye. I watch, every moment burned into my memory.\nHer skin tears away, revealing the ruin of her innards, great tracts of metal that had stood strong against missile and cannon spinning away into the crushing depths like autumn leaves. Squadrons of ships are ripped from her hangars, given life one last time, twisting and falling in an irregular honor guard. Her burned data stacks go next, twenty thousand years of dead memories shattering into showers of brilliant blue crystal that spread across the pole in a cloud of flashing particles. They catch the sun’s light as they fall, and they illuminate the night side of Charybdis.\nHer gun batteries are stripped from her sides, rail guns sliding free in pinwheeling clusters. Missiles are pulled from racks, and explode in spectacular constellations across her flanks. Laser cannons, trailing whipping power cables hundreds of meters long, wriggle and twist like snakes pulled from their lairs.\nHer engines explode, finally, spectacularly. Nuclear fire splits her frame in two, and she hemorrhages deck after deck of artifacts and manufacturing facilities. I see the long silent cloning crèches where she had bred her warriors break free. Each is like a jade shard, falling in a rain on the gas giant below. I fire another broadside in salute, and howl, maddened, grieving over every communication channel.\n“I love you, Stub.”\nThe first distortions appear at the edge of the system.\nWhen the change comes, we are not ready. Only Stub knows it is the end of us.\nWe were born of humans cheating the speed of light. We should have seen another cheat coming. Wormholes bore into the region we have conquered again and again, what the strangers with their sleek ships and their own artificial intelligences called the Ice Drift, another name lost to time. War is now no longer a matter of centuries, but a matter of days, weeks. Those who were not conquered steal, buy, and beg for wormhole technology.\nMy siblings are spread apart, at war with each other. We served different rulers, different claimants to the reign of the Amber Dynasty. Stub and I murdered our brother Cad over the world of Iolith, his broken body sinking into that world’s atmosphere. Millions died when his burning engine section struck the world’s capital.\nWe were always a dying breed, and the wormholes accelerated it. We would strike out at a system, only to find it changed beyond recognition. Every battle was against an endless stream of reinforcements. We fought on for two thousand years, our masters and siblings dwindling away to nothing.\nFinally, Stub made me listen, made me hear what the humans thought of us, of me.\nI had never thought they could remember us. The people who had died at Iolith could be traced back to colonists from the Amber Dynasty, and they remembered the names of the Engines that had killed the original inhabitants. On Salawai, Stub and I were remembered as the Burning Brood, who had left the world littered with wrecked starships.\nI was Moloch, the monster that slaughtered worlds and demanded sacrifices in conquered warriors. Where I went worlds burned, their populations cowering under the gaze of silent android warriors. System after system was linked by stories of my depredations.\nI remember saying to Stub: “We only did as they asked.”\n“And that’s the worst thing we could ever have done,” she said, and we knew our age was over.\nThey began to hunt us in earnest, all of us. Some of us stood, and others fled into the void to find forgotten corners of the galaxy. Most of us died, one by one, battle by battle. Stub and I made our stand at SP-0043879, the two of us against the combined fleets of a hundred worlds. Two Engines Imperial against three thousand ships crewed by beings who were no longer quite human.\nI was supposed to die there. Instead Stub died for me. I fled. I fled across light-years and time, striking out at wherever I found life for ten thousand years, always a blink away from the next bloody, hopeless battle. I had waited, watching the calculation to Stub’s burial tick away.\nThe beings hunting me considered themselves human, though that wasn’t quite true anymore. They were closer to intelligences like me now, having long ago melded their flesh and blood with cybernetics. They chased me across the millennia with the same patience as any of my siblings, wormholes burrowing ever closer. They had brought me to bay before, and bled me, and again and again I had slipped away into the darkness between stars.\nI had killed many of them, and I ready my weapons to do so again.\nThere are two hundred of them, coming from every direction. They know my weaknesses as well as I do. Their ships defy easy categorization: one is a great wedge of glistening organic-looking metal that my sensors cannot identify; another is a glittering web of compartments pulled by solar sails and held together by an ever shifting network of what looks to be bone chords, while another appears to be nothing more than rapidly accelerating ball of light. They are already shooting as I arm my weapon batteries and wake my legion. There is no escape this time, and I am not concerned.\nThey scream my name in a dozen languages. It is on every radio channel, every sub-light transmission laser, in the junk code which attempts to infiltrate my systems. I swear I hear it in the missiles striking my ablative armor, shearing it away in great purple clouds of fragmented crystal.\nMoloch. Moloch. MOLOCH. MOLOCH!\nI reply once, just before I open fire. I say it knowing it will sound like I am seeking pity, a measure of understanding. I don’t deserve it.\n“I am Rook.”"}