{"fingerprint": "m4n7xl6UPUqmyQ6PDERx0UakqGI=", "sitename": "Clarkesworld Magazine", "title": "Bioengineered Athletes and True Stories: A Conversation with Lauren Beukes by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/beukes_interview_2016/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bioengineered Athletes and True Stories: A Conversation with Lauren Beukes by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Bioengineered Athletes and True Stories: A Conversation with Lauren Beukes\n Sometimes the reality is stranger than fiction and sometimes fiction helps to shed some philosophical light on reality. Both are entwined, influencing each other and the author placing one word after the other. Lauren Beukes is one such author that has the imagination and the journalistic chops to craft both stories of marauding art installations and true crime.\n Fact and fiction intermingle within Lauren Beukes newest collection. Slipping collects together essays and short fiction that highlight the varied aspects of the author’s career. Her imagination is on full display with the titular story of biologically enhanced athletes while essays like “Adventures in Journalism” showcase stories a little closer to our present time. The short fiction in this collection can be bitingly satirical while some of the essays will make you take a harder look at the world around you.\n Lauren Beukes is a South African novelist, journalist, and short fiction writer. She may be best known for her novels Zoo City, The Shining Girls, and Broken Monsters. Her newest collection Slipping will be available on November 29th from Tachyon Publications.\n With all the advancements in medical tech, do you think it's inevitable that we may have enhanced athletes?\n I do, but as in the title story, I’m not sure how mainstream the acceptance will be.\n In “Confirm/Ignore,” you highlight the ephemeral nature of identity on the Internet. How do you think it has changed human interaction?\n It’s based on a real incident of a Facebook imposter in Cape Town who was virtual friends with lots of people in the music scene, but no one had actually met her. The Internet allows us to curate our lives, or invent them entirely. We’re our own spin machines, which often means presenting a false front, but I’ve also found that Twitter in particular has let me be my most authentic, weird, silly self and connect with other like-minded people. The nature of it’s changed, alas, but some of my finest real-world friends were Twitter friends first.\n Voice plays an important role in many of your stories. How do you find or develop a voice for a particular story?\n This is going to be one of those very annoying answers. It just . . . comes out that way. The voice drives the story. It’s in the character—what they’re thinking, what they’ve been through, what they’re interested in.\n How has your background in filmmaking and animation influenced your writing?\n Writing for kids’ animation means that I’ve had to learn to think very visually, to write scenes in a way that’s very clear, visually, and tonally, because some poor bastard has to draw it (some poor bastard, often sitting two desks over from me and certainly within spitball range). In an 11 minute or 24 minute show, you don’t have time to mess around, you want to get into the scene and out of it as fast as possible, you want to only show the interesting stuff that drives character or plot and you have to make every line of dialogue really count, to reveal something about the people or the world or the story. It’s definitely where I get my pacing from.\n What do you find appealing about writing and reading short fiction?\n Reading short fiction is a pleasure, because you can dip in and out—although really it’s deep, intense immersion for brief periods, like diving into ice water. I really got into short stories when I was living in New York in 2000, because they were perfect for the rattling spaces between subway stops. Writing short fiction is lovely because it’s not a novel. It will all be over relatively soon. Although it always takes me longer than I think it will because of the demands of the form. That water better be super-icy, that dip in the immersion tank better be compelling.\n You've lived in quite a few places. Do you find your writing is influenced by where you live?\n I’ll always be a South African author, that’s my aesthetic, my interests, my themes—social justice, the fracture points of society, the ghosts of history, the psycho-geographies, violence, segregation, the possibility of redemption, but how hard that is to fight for. I’ll bring that with me to other places, look at them through that lens.\n There are some dark scenes and themes in your work. Have you ever frightened yourself with something you've written?\n No. Because I know it’s imaginary. I have upset myself writing from Harper or Clayton’s perspectives, because I write in close third person or first person, so it’s very intimate. Writing is expanding parts of yourself, growing a tree from a tiny seed within yourself. It’s horrible to confront that I have some shard of their cruelty and cynicism or madness inside me, enough to be able to write about it. But that’s the human condition. We are capable of all the horror and all the good in the world, all of us, in the right circumstances.\n What made you decide to include essays and non-fiction in this collection?\n I was a journalist for ten years before I was a novelist. It’s part of who I am and it would have been weird to leave it out. I wish I had included more, actually.\n How has your time as a journalist influenced your writing?\n It was a back-stage pass to the world, a license to be nosy and have amazing conversations with people I wouldn’t have been exposed to otherwise, from a lisping dominatrix to a wannabe teenage vampire, HIV+ beauty queens, activists and metro cops patrolling the ganglands, to ordinary people. Transcribing hours of interview tapes also taught me an ear for dialogue, how real people speak and speak differently. And because I was freelance, and had to write a story on “rehab safaris” this week and “best small conference venues in Cape Town,” the next, it taught me to be flexible, to play with style.\n “All The Pretty Corpses” is a frank look at a real world murder close to you. Was writing this essay a way of organizing your own thoughts, an attempt at making sense of the event?\n It comes out of a series of blog posts I wrote at the time of Thomo’s death in 2010 to help raise money for her funeral (we raised R10 000 in 24 hours from amazing strangers on the Internet) and then to try and process the horror of the injustice that the police botched the case, that the man who did this to her, who stabbed her and poured boiling water over her head and left her locked in a shack, got off free. It took her three months to die, in-and-out-of-hospital, in agony and trauma. It shattered my faith in the fairytale of justice I’d fundamentally believed in up until that moment in the prosecutor’s office, when he said he couldn’t take this to trial, holding up one miserable sheet of paper that represented the entirety of the investigation—her testimony. He said, she said, but she was dead. It was very hard to write about; it still upsets me. I feel like I failed the family, that maybe I could have done more, and I know, logically, that’s not true, but it sits in me, regardless. At least in fiction, you can have justice.\n “Dear Mariana” uses some interesting formatting choices to enhance the story. What inspired this?\n Haha. I was house-sitting a friend’s apartment in Brooklyn and she had an electric typewriter. I wrote the story that night on the typewriter, so most of those formatting errors are genuine, although the sentiment wasn’t mine and I definitely didn’t go through her stuff, or do any of the other things the narrator does in Mariana’s apartment.\n What was the one piece of writing advice you've been given that has stuck with you throughout your career?\n Finish the damn book, nothing else matters. That’s my paraphrasing of the advice I’ve heard. I can’t remember where I heard it first. Also: Jenefer Shute told me “a writer writes.” I’d much rather a writer just did cool research trips and got to tell engaging anecdotes and have amazing conversations with interesting people—but there’s that annoying part where you actually have to staple-gun your butt to the chair and write the words and make them work.\n What's the next project you're working on?\n A new novel, due out in 2018, a TV show pitch, some new comic ideas with Dale Halvorsen (my evil genius co-writer on Vertigo’s Survivor’s Club—about what if the ’80s horror movies were real and where are those kids today).\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}