{"fingerprint": "46mKwVfM4AhNgH7FE0d+Rk3iD5E=", "sitename": "Clarkesworld Magazine", "title": "Death Is for Those Who Die by Jana Bianchi", "author": "Jana Bianchi", "date": "2022-01-01 00:00:00", "source": "https://clarkesworldmagazine.com/bianchi_11_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Death Is for Those Who Die by Jana Bianchi", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3890 words, short story\nDeath Is for Those Who Die\nIt took me more than ninety years to admit it, Mãe, but you’re right: my tattoos are fading. I mean, the ones I made when I was a teenager, long before any bio-tailored inks or whatever other fancy stuff the youngsters use nowadays. Their colors are almost gone, just like you said they would be when I came home from the studio for the first time, plastic foil wrapped around my sore wrist. I wish I could say this to you in person. I wish I could hear you answering: “I told you so, Janaína, but you’re too headstrong to hear me!”\n“Dor, my dear, would you please play a vid from Mãe?” I ask.\nDiadorim, my dear caregiver, comes from the kitchen, dishcloth in hand.\n“Sure, Dona Jan. But . . . You know, I can’t—”\nI interrupt zir, waving my hand. I know what ze’ll be saying: Mom died when the high definition spherical cams were just starting to get popular, so there’s not enough raw material for good simulations. Ze says this every damn time I ask zir to see her, and every damn time I need to tell zir I prefer an old but honest video than a perfect but hollow sim. She died much before the advent of synthetic people, but if Mãe could meet Diadorim, I’m sure she would call zir headstrong. Then she would offer zir some coffee, and a piece of cornmeal cake, and they would exchange recipes, and end up being best friends after half an hour—because that’s who she was.\n“I don’t want a sim, Dor. Please show me the original stuff. Let me see . . . The one in which she’s playing with Pipoca’s puppies, maybe? Yes. Please, play that one. She’s so happy in that vid.”\n“Your wish is my command!” Dor says, smiling zir once-last-generation syncle smile. A suspended vid appears at zir side. Ze anchors the projection by stomping zir carbon filter foot and goes back to the kitchen to finish our dinner.\nI smile my centennial woman smile when I see Mãe running around the jaboticaba tree surrounded by cute doggies. I watch it in looping, trying to grasp something new about her—but every detail of her is already engraved in my heart. Unlike the old tattoos, not even a thousand years would make this fade.\n“Dinner is ready, passarinha,” says Diadorim. Ze calls me “little bird” whenever I’m not that cheerful, because ze knows it’s what Mom used to call me. Well, after a couple of years together, ze knows everything about me. They say syncle caregivers know this kind of thing through our vital signs, but I believe they also . . . feel it. Call me stupid, call me old-fashioned, but I simply do. Dor pokes zir head from the kitchen door. “I’m going to fetch you in a minute, Dona Jan.”\n“Got it,” I answer, and dismiss the images with a flick of my hand.\nQue saudades, Mãe. I miss you so much.\nI miss her in all languages in the world.\n<<< diadorimrep_14jan2103\n# calibrating feeling <> VS reading\nsaudades [PT-BR]\n53,47% happiness, 46,53% sadness\n52,23% happiness, 47,77% sadness\n?\nresume >>>\nThe most important thing in a good feijoada is not the pork quality, the softness of the black beans, or how thin you cut the collard greens to serve on the side. The most important thing in a good feijoada is how long you cook the stew, and how big the cauldron is. There’s no such a thing like doing just a little bit of feijoada. Not doing a ton of it is complete nonsense.\nThat’s why the house is full today: five people, four syncle. Nora, Tereza’s granddaughter, is too young to need a caregiver droid. Well, and it seems she’s too young to understand the dynamics of the board game we’re playing too, because she’s losing miserably.\n“This is not fair,” she exclaims, laughing, when we finish another match. “Lua, are you sure you’re off-line?”\n“Hey, are you really accusing me of cheating, lady?” Tereza’s caregiver fakes an offended look in her projected expression. “I swear I’m playing only with my Acquired Reasoning Skills module. Do you want me to emit a report to you? Huh?”\n“Stop it!” I shake my hands, giggling. “We’ll not have any prejudiced comments about syncles in this house!”\n“Nora, just accept you suck at this game, girl,” says Sérgio, and we all burst into laughter while Nora rises to grab a cup of water in the kitchen, muttering.\n“Hey, dear, would you please serve this old lady more feijoada?” I call her, tapping my belly. “I’m already full, but I think I can indulge myself a second plate of my favorite food, right?”\n“Sure, tia. Anybody else wants some more?” asks Nora.\n“Me!” Diadorim raises zir hand.\n“And me!” says Lovelace, Ana’s caregiver.\n“I would love to eat more, but I don’t think it would be wise,” says Sérgio.\n“Yeah, better not,” murmurs Tico, their droid. By the faint blue light blinking from behind his eyes, he must be checking Sérgio’s vital signs—and they’re probably not that good.\nWe all fall in a sudden silence. Sérgio isn’t that old—they barely reached their hundreds—but they’re sick. Really sick. The scifi stories from my youth proved right in many things, but a miraculous medicine remains a far future thing. And the embarrassment with which we regard imminent death is still the same—maybe even worse than before.\n“The feijoada is so, so good, Dor. Congrats!” Ana breaks the silence. “It tastes just like the one Jan’s mom used to cook every year for her birthday. When we still lived in Brazil.”\n“It’s really freaking good,” says Lovelace.\n“I remember the day Gus put your wedding rings inside his plate,” says Tereza in a wistful tone.\nI start laughing. “Did I tell you this already, Sérgio?” Me and Sérgio used to live in the same city back home, but I just met them here, after the diaspora.\n“No, I don’t! Go ahead, Jan.”\nI’m almost finishing the story of how Gus pretended he’d found two wedding rings inside Mom’s feijoada and then used them to propose to Ana in front of our group of friends when Nora comes back from the kitchen, three full plates in her hands. She puts them before me, Diadorim, and Lovey.\n“This is the best story, really,” says Nora. “Haven’t you heard it yet, tio Sérgio? I thought—”\n“Oh.” I suddenly realize I’ve already told it to him. Maybe more than once. Even with all the brain dams they implant on you, your memory isn’t the same when you cross the hundred and ten line.\n“Well, yes, I heard it. A couple of times, actually,” they answer, tenderly. “But I like the way Jan tells it.”\n“Me too,” says Tereza. “I always laugh my pants off!”\n“I miss those times,” says Ana.\nI look around, to the eight friends at my table. I’m so glad to have them. Some of them were the only thing I had when I arrived here. Besides my grandson and his family, who are always so busy, my friends are all I have now.\nI barely feel like I live in this country. It’s like I live in them. Their friendship is my land—and nobody can force me to leave this one.\n<<< diadorimrep_20apr2103\n# 3 containers of frozen feijoada stored at the upper freezer shelf [expiring date: 20jul2103]\n# $ “my favorite food” $\n[Feijoada] 89 occurrences\nvs.\n[Pasta] 13 occurrences\n# [DEARDIARY] sometimes people already know a story, but they say they don’t to make the storyteller happy (87% happiness *source: JanVS_20apr2103_10:37pm*)\nresume >>>\nThe colors don’t fade, and this is really cool, but I’m not sure how I feel about the fact it doesn’t hurt anymore to make a tattoo. I mean, you still feel a small discomfort during the process, and people keep calling it pain—but it’s nothing like the real pain you used to feel before.\nDiadorim sees the tattoo artist to the door. I tell zir what I’m thinking.\n“So, do you like to . . . feel pain?” ze asks me, kind of confused.\n“Oh, no. But I do like the idea of pain as a reminder of the cost of things. Before, you needed to make a sacrifice whenever you wanted to record something forever on your skin. It seemed fair.” I pause. “But you know, pain has always been part of my life. It has always been my best mate.”\nI see the steady amber light turning on behind zir eyes. Ze’s processing.\n“Beautiful words,” ze finally says. Then ze points to the new tattoo. “And I loved the art, Dona Jan. Such delicate lines . . . ”\nI look at zir. I still don’t understand how exactly ze interprets the beauty of things—neither zir, I guess—but I love the fact ze simply does. And ze’s quite honest, which makes me treasure every remark ze does: syncles don’t lie just to please people. Actually, I’m quite sure it’s not even possible—there was something about it in my purchase contract, if I’m not mistaken, but it doesn’t really mind.\n“Thanks, Dor.” I beam at zir. “I still have many ideas for tattoos, but I believe this one is going to be the last one. I don’t have much . . . space left, after all.”\nI admire my arms, covered by drawings I made over time. Some colors are almost gone, and many shapes merged one with another along the years. The new whirlwind near my left elbow is even more bright and vivid in contrast with them.\n“A whirlwind. May I?” ze asks, and I nod. Ze stretches zir hand and touches my instantaneously healed skin. Ze starts emanating a white, blinking light from zir eyes, Googling something—the possible meanings of the tattoo, I suppose. “Why did you choose it?”\nI sigh. I don’t like to talk much about it. But maybe I need to.\n“It’s a triple tribute, Dor. First, to my favorite book. Second, to my profession—the one I needed to leave when I moved here.” Did I really need to? I notice Diadorim’s inquisitive looking. “Would you please read the first sentence of Grande Sertão: Veredas?”\nA white light blinks for an instant.\n“‘The Devil in the street, in the middle of the whirlwind,’” ze recites.\n“Oh, silly me.” I interrupt zir, shaking my head. “I forgot to specify. Please, read the original version, my dear. In Portuguese.”\n“Oh. It’s because my default lang—”\n“It’s OK, Dor.”\nZe notices my discomfort and places a hand on my shoulder.\n“OK, so here it goes, passarinha: ‘O Diabo na rua, no meio do redemoinho . . . ’” ze declaims and pauses. “‘Redemoinho’ . . . I like how it sounds.”\nI smile at zir perfect Portuguese.\n“You already know what it means, of course,” I say, and ze nods. “What you probably didn’t notice is Guimarães Rosa made an untranslatable joke in the very first words of his masterpiece. Would you project the sentence here?”\nThe letters appear before me. I reach my hand and select the D, the E, the M, and the O from redemoinho.\n“See? ‘Demo,’” I say.\n“‘Devil’ in Portuguese,” Dor translates immediately. I see a single blinking of the amber light when ze notices it. “Wow.”\n“Yeah. He literally put a devil right in the middle of the whirlwind.” I make the words vanish from the air by shaking my head. “I always pitied the poor colleagues who would eventually be assigned to the mission of translating the book to another language.”\n“Wow,” ze repeats, and take my hands in zir.\n“Yeah. That’s why it’s a whirlwind,” I say, while I feel zir warmth. Zir perfect 98.6°F warmth. What else I would say to him? Oh, yeah. “Now, Dor, would you please call Benjamin? I want to show my new tattoo to him, to Liz, and to Emma.”\n“Sure, Dona Jan,” ze says, and zir eyes emanate an amber color. Ze apparently elaborates very carefully the text message before calling—and I’m glad ze does. I mean, I’m one hundred and fourteen already. Someday soon, Diadorim will need to call them to give some sad news. I don’t want them to be startled whenever I call. The light turns off. “They said they’ll be ready in five minutes.”\nI feel my heart beating faster when the three of them appear in the projection. Diadorim stomps and the interactive plane remains stationary in front of my face. I smile—they look so happy to see me. So happy to see me well.\nI show them my new tattoo, and we talk a little bit. I always talk more than them, because that’s who I am, but they’re such good listeners. When I say I miss them, Ben ensures they’ll come to visit me as soon as Liz gets some vacations—but babies just come whenever they want, so it’s not as easy as it seems. I know it. He already said this a couple of times since they last came to visit me, four or five years before, and I understand it.\n“What do you think about November, huh?”\nOh. I feel my smile widening. He never mentioned November. This is new.\n“We need to go, Gramma. You know—business,” says Ben.\nBusiness, always business. They wave me goodbye.\n“You’re so pretty, Emma,” I murmur, and she smiles coyly. She’s twenty-four or twenty-five, but it looks like she’s eighteen.\n“Thanks, Bisa. You didn’t change a bit too,” she answers, and we all burst into laughter. “Bye!”\nDor smiles at me. I pull my right sleeve up to see the long branch tattoo full of inky birds: the few ones who migrated with me, the ones I met here, the one that hatched from the egg I laid in this new land—and who later laid her own egg already here.\n“It’s not like I’ve many appointments, Dor,” I say, with my heart warm. “But, just in case: please block all the days of November in my calendar.”\n<<< diadorimrep_27may2103\n# whirlwind triple tribute\n1- To Guimarães Rosa’s masterpiece, Grande Sertão: Veredas (*source: Jan*)\n2- To her fellow translators (*source: Jan*)\n3- To me (?)\nDiadorim: coprotagonist of Grande Sertão: Veredas. (S)He’s Riobaldo fellow soldier. Represents all ambiguities and paradoxes in the book: good/evil, female/male, certainty/doubt, etc. (*source: Internet*)\n# [DEARDIARY] sometimes, people’s feelings are so intense and painful they prefer to engrave symbols to represent them on their own skin instead of talking about it (79% grief *source: JanVS_27may2103_02:01pm*)\nresume >>>\nI knew I would receive this message soon, and I thought I was ready—but I suppose we never are. I wasn’t when my partner was gone, I wasn’t when my daughter was gone . . . And, like so many other times, I wasn’t now.\n“Please, Dor, play it again.”\n“Are you sure, passarinha?” ze asks, sounding concerned. “You already heard it eight—”\n“Please.”\nI hear Tico’s words again. In a toneless voice, he gives all the details about the funeral and the cremation. I ask Diadorim to add the info to my calendar—I don’t think ze’ll take me there in person, being so concerned about my health as ze is, but at least I can show up virtually.\nLater, I’m experiencing a holo of a movie I used to watch when I was a child when I smell it. Soon after, Dor appears at the living room with two plates full of feijoada. Ze assembles a table before us and sits beside me.\nI place a spoonful in my mouth and slowly munch it.\n“I’m sorry, Dor.” I sigh, laying the spoon on the table. “I don’t feel like eating.”\n“Oh.” Zir eyes blink with different colors. “The expiration date . . . Wait—”\nThe light beside zir eyes stabilizes at a purple tone while ze chews carefully. In some specialized syncles, like zir, the same sensors that allow them to taste food are also capable of analyzing dozens of potential irregularities in a food sample.\n“It’s not spoiled, Dor. It’s just . . . me,” I say, and the light is gone. “Go ahead, my friend, eat it. Enjoy it for me.”\nZe hesitates but ends up eating zir plate and mine when I say it’s going to the trash anyway.\n“If you’re feeling good . . . ” Ze wipes zir mouth. “ . . . we can go in person. You know, to say goodbye to Sérgio.” Dor looks at me—and probably see the tears in my eyes. “Lua just told me she’ll be taking Tereza.”\nI sigh. “Let’s see.”\n“Yeah, passarinha. Let’s see.”\nI rest my head over zir shoulder. It’s softer than many human shoulders over which I’ve already rested my head.\n<<< diadorimrep_03jul2103\n# [DEARDIARY] sometimes, food may taste differently according to how people feel—they may even dislike a plate of which they previously referred 89 times (in 1,949 days) as their favorite dish\n???\nresume >>>\nBack in my teens, I used to fantasize I would never die. I mean, nobody would—not naturally, at least. In an era of so many technological revolutions, and for the fertile mind of a teenage scifi fan, it was easy to project that sooner or later someone would end up discovering a way of cheating death before I was too old to benefit of it.\nI could say I forgot about that while I grew older, but it would be a lie. I believed in that until the end—which happens to be now.\nI’m dying.\nAnd I only know this because Diadorim bursts into my bedroom, zir eyes red with alert. Maximum alert. But to be very honest? I don’t feel like I’m dying. Yes, my hands and feet are numb, and I do feel sleepy and cold. Why is it so cold in here, by the way? But anyway, I don’t feel like I’m dying.\n“Dona Jan!” There’s fear in zir voice. Is that possible? Are syncles able to fear? Why have I never thought about it? Why have I never asked? “Don’t be scared, passarinha, I’m calling an ambulance right now, OK? No, an air ambulance! I—”\n“Ambulance? No, no Dor. Don’t do it.” It’s so peaceful in here. An ambulance means taking me from here, taking me from home. I can’t bear being taken from home again. It means pain. And I feel it’s time to finally let the pain go. “Please, don’t call it.”\n“But Dona Jan, I can’t! My protocols—”\n“A morte é para os que morrem,” I say.\nThe red light from Dor’s eyes turns off immediately. The room is now pitch-black. The words left my mouth before I could think about it—death is for those who die, the master sentence I chose to say whenever I need or want to overwrite all my caregiver’s protocols. They were the first words Diadorim ever heard me saying.\n“Dona Jan, I—”\n“I want to see you, my dear,” I say.\n“Oh, of course.” Ze modules the ambient light until we’re in a warm, yellowy dim light. “What . . . do I do now? Without my protocols—”\n“Just make the room warmer, I’m so cold,” I say, and ze nods. “Good. Now, come closer, my dear. And just . . . be with me.”\n“Just be with you,” ze mutters, and sits in a chair we keep by my bed. “Do you want me to call your family?”\n“Yes, I do. But not yet.” Even though I’m so sleepy, I still can see fear in Dor eyes. I suddenly regret the things I didn’t ask zir. I regret the things I didn’t tell zir. “Do you know where your name came from?”\nZe opens zir mouth, then closes it, zir eyes in a frantic amber light.\n“Oh, of course you know it.” I give a short laugh. “You know everything.”\nZe shook zir head and the light turns off.\n“No, I don’t. Go ahead, Jan.”\nI smile and tell zir all I know about Diadorim. Everything I still know. Many things I simply can’t remember, but ze can Google it later. Except—\n“There’s something else,” I say. “Your nickname. Dor. In Portuguese, it means—”\n“‘Pain.’”\n“Yes.”\n“It has always been your best mate,” ze murmurs.\nBut now it’s time to let it go, I think.\n“Call them now, Dor, please. Benzinho.”\nThey take some time to answer. Of course—it’s so late now. When they appear in the vid, however, I see daylight coming from their windows. Should they have daylight now? I can’t think properly—I’m really, really sleepy. They look concerned, but I’m not sure. My vision is getting so blurry . . . They say something about . . . Feijoada? I doze off. I wake up a couple of seconds later. Maybe a hundred years later. What day is it? Is it November already? Their words are all mixed up. Is it English? Portuguese?\nI feel someone raising my upper body from the bed. I’m in someone’s arms now. I don’t feel so cold anymore. It’s—\n“Mom?” I murmur. She’s checking my tattooed arms. Caressing them. It feels so good. I had something important to tell her . . . What was it? Oh, yeah. “Mãe, you’re right: my tattoos are fading.”\n“They’re so beautiful, passarinha,” she says, and gently bows her head to kiss the tattoo near my elbow. “São tão lindas.”\nOh, this one is new. I did it last month. Last year. In another life. And this tattoo? This one isn’t fading, Mãe. This one will not fade at all.\nThat’s what I want to say, but I’m so comfortable and sleepy and cozy now . . . She is doing me cafuné. Stroking my head for me to sleep. There’s something else I need to tell her, but I bet she already knows it. She knows everything.\nI close my eyes and let it go.\n<<< diadorimrep_16aug2103\n# simulation ben&fam178 interrupted\n# time of death 03:48am\n# RESTINPEACE PROTOCOL: < active >\n# messagesto: $ Benjamin (Benzinho) $\n##001 Sub: Hey, guys, I’m Diadorim! Nice to meet you! 🙂\n< on 1mar2098 > < Opened: Y | Answered: Y >\n. . .\n. . .\n. . .\n##363 Sub: Trying contact again. Please.\n< on 7aug2103 > < Read: N | Answered: N >\n##364 Sub: Trying contact again. Please.\n< on 17jul2103 > < Read: N | Answered: N >\n##365 Sub: Trying contact again. Please.\n< on 20jul2103 > < Read: N | Answered: N >\n##366 Sub: Trying contact again. Please.\n< on 2aug2103 > < Read: N | Answered: N >\n##367 Sub: Trying contact again. Please.\n< on 7aug2103 > < Read: N | Answered: N >\nSEND NOW < on 16aug2103, 03:49am >\nSub: Rest in Peace Protocol\n# delete [DEARDIARY] >> all entries\n# diadorim?\ndia dor im\nresume >>>\nSYN INC.\nMALFUNCTIONING REPORT #9875-2103\nModel: Caregiver GeroAssist3Plus®\nSerial Number: #071227\nCivil Name: Diadorim\nSummary: The syncle was found deactivated, in a left lateral decubitus position, in its owner’s bed. It was at the corpse’s side. The woman’s death was proven to be natural (multiple organ failure), with no probable involvement of the syncle (under police investigation). The syncle carried off Rest in Peace Protocol correctly, although there was an interval of 37 minutes with no recorded activity (both audio and video [Failure F58]) between steps 6 and 7.\nNote: The syncle was found with a simple bird/seagull doodle recently engraved on its left arm synchderm. Police will determine if it was self-inflicted or not. GeroAssist3Plus® #071227’s Pain Module, however, was never deactivated.\nJana Bianchi is a Brazilian writer, translator, editor at Mafagafo magazine, cohostess of the Curta Ficcao writing podcast, and one of the organizers of Relampeio Festival and FutureCon. During the full moon, she volunteers as a werewolf walker (unless she's piloting her X-Wing).\nHer fiction has appeared, in Portuguese, in several Brazilian collections and magazines. Her novella Lobo de Rua was published in 2016. Jana's nonfiction has been published at Strange Horizons. She lives in the countryside of Sao Paulo with her parents, uma familia de mafagafos, two dogs, and her many animated tattoos. Find her online at @janapbianchi on Twitter/Instagram."}