{"fingerprint": "TqvUbyQoJY6tNcTj7igCh1JMrYE=", "sitename": "Clarkesworld Magazine", "title": "The Hole in the Hole by Terry Bisson", "author": "Terry Bisson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bisson_06_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Hole in the Hole by Terry Bisson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "12090 words, novelette, REPRINT\nThe Hole in the Hole\nTrying to find Volvo parts can be a pain, particularly if you are a cheapskate, like me. I needed the hardware that keeps the brake pads from squealing, but I kept letting it go, knowing it wouldn’t be easy to find. The brakes worked okay—good enough for Brooklyn. And I was pretty busy, anyway, being in the middle of a divorce, the most difficult I have ever handled, my own.\nAfter the squeal developed into a steady scream (we’re talking about the brakes here, not the divorce, which was silent), I tried the two auto supply houses I usually dealt with, but had no luck. The counterman at Aberth’s just gave me a blank look. At Park Slope Foreign Auto, I heard those dread words, “dealer item.” Breaking (no pun intended) with my usual policy, I went to the Volvo dealer in Bay Ridge, and the parts man, one of those Jamaicans who seems to think being rude is the same thing as being funny, fished around in his bins and placed a pile of pins, clips, and springs on the counter.\n“That’ll be twenty-eight dollars, mon,” he said, with what they used to call a shit-eating grin. When I complained (or as we lawyers like to say, objected), he pointed at the spring which was spray-painted yellow and said, “Well, you see, they’re gold, mon!” Then he spun on one heel to enjoy the laughs of his co-workers, and I left. There is a limit.\nSo I let the brakes squeal for another week. They got worse and worse. Ambulances were pulling over to let me by, thinking I had priority. Then I tried spraying the pads with WD-40.\nDon’t ever try that.\nOn Friday morning I went back to Park Slope Foreign Auto and pleaded (another legal specialty) for help. Vinnie, the boss’s son, told me to try Boulevard Imports in Howard Beach, out where Queens and Brooklyn come together at the edge of Jamaica Bay. Since I didn’t have court that day, I decided to give it a try.\nThe brakes howled all the way. I found Boulevard Imports on Rockaway Boulevard just off the Belt Parkway. It was a dark, grungy, impressive-looking cave of a joint, with guys in coveralls lounging around drinking coffee and waiting on deliveries. I was hopeful.\nThe counterman, another Vinnie, listened to my tale of woe before dashing my hopes with the dread words, “dealer item.” Then the guy in line behind me, still another Vinnie (everyone wore their names over their pockets) said, “Send him to Frankie in the Hole.”\nThe Vinnie behind the counter shook his head, saying, “He’d never find it.”\nI turned to the other Vinnie and asked, “Frankie in the Hole?”\n“Frankie runs a little junkyard,” he said. “Volvos only. You know the Hole?”\n“Can’t say as I do.”\n“I’m not surprised. Here’s what you do. Listen carefully because it’s not so easy to find these days, and I’m only going to tell you once.”\nThere’s no way I could describe or even remember everything this Vinnie told me: suffice it to say that it had to do with crossing over Rockaway Boulevard, then back under the Belt Parkway, forking onto a service road, making a U-turn onto Conduit but staying in the center lane, cutting a sharp left into a dead end (that really wasn’t), and following a dirt track down a steep bank through a grove of trees and brush.\nI did as I was told, and found myself in a sort of sunken neighborhood, on a wide dirt street running between decrepit houses set at odd angles on weed-grown lots. It looked like one of those leftover neighborhoods in the meadowlands of Jersey, or down South, where I did my basic training. There were no sidewalks but plenty of potholes, abandoned gardens, and vacant lots. The streets were half-covered by huge puddles. The houses were of concrete block, or tarpaper, or board and batten; no two alike or even remotely similar. There was even a house trailer, illegal in New York City (so, of course, is crime). There were no street signs, so I couldn’t tell if I was in Brooklyn or Queens, or on the dotted line between the two.\nThe other Vinnie (or third, if you are counting) had told me to follow my nose until I found a small junkyard, which I proceeded to do. Mine was the only car on the street. Weaving around the puddles (or cruising through them like a motorboat) gave driving an almost nautical air of adventure. There was no shortage of junk in the Hole, including a subway car someone was living in, and a crane that had lost its verticality and took up two back yards. Another back yard had a piebald pony. The few people I saw were white. A fat woman in a short dress sat on a high step talking on a portable phone. A gang of kids was gathered around a puddle killing something with sticks. In the yard behind them was a card table with a crude sign reading MOON ROCKS R US.\nI liked the peaceful scene in the Hole. And driving through the puddles quieted my brakes. I saw plenty of junk cars, but they came in ones or twos, in the yards and on the street, and none of them were Volvos (no surprise).\nAfter I passed the piebald pony twice, I realized I was going in circles. Then I noticed a chain link fence with reeds woven into it. And I had a feeling.\nI stopped. The fence was just too high to look over, but I could see between the reeds. I was right. It was a junkyard that had been “ladybirded.”\nThe lot hidden by the fence was filled with cars, squeezed together tightly, side by side and end to end. All from Sweden. All immortal and all dead. All indestructible, and all destroyed. All Volvos.\nThe first thing you learn in law school is when not to look like a lawyer. I left my tie and jacket in the car, pulled on my coveralls, and followed the fence around to a gate. On the gate was a picture of a snarling dog. The picture was (it turned out) all the dog there was, but it was enough. It slowed you down; made you think.\nThe gate was unlocked. I opened it enough to slip through. I was in a narrow driveway, the only open space in the junkyard. The rest was packed so tightly with Volvos that there was barely room to squeeze between them. They were lined up in rows, some facing north and some south (or was it east and west?) so that it looked like a traffic jam in Hell. The gridlock of the dead.\nAt the end of the driveway, there was a ramshackle garage made of corrugated iron, shingleboard, plywood, and fiberglass. In and around it, too skinny to cast shade, were several ailanthus—New York’s parking-lot tree. There were no signs but none were needed. This had to be Frankie’s.\nOnly one living car was in the junkyard. It stood at the end of the driveway, by the garage, with its hood raised, as if it were trying to speak but had forgotten what it wanted to say. It was a 164, Volvo’s unusual straight six. The body was battered, with bondo under the taillights and doors where rust had been filled in. It had cheap imitation racing wheels and a chrome racing stripe along the bottom of the doors. Two men were leaning over, peering into the engine compartment.\nI walked up and watched, unwelcomed but not (I suspected) unnoticed. An older white man in coveralls bent over the engine while a black man in a business suit looked on and kibitzed in a rough but friendly way. I noticed because this was the late 1980s and the relations between blacks and whites weren’t all that friendly in New York.\nAnd here we were in Howard Beach. Or at least in a Hole in Howard Beach.\n“If you weren’t so damn cheap, you’d get a Weber and throw these SUs away,” the old man said.\n“If I wasn’t so damn cheap, you’d never see my ass,” the black man said. He had a West Indian accent.\n“I find you a good car and you turn it into a piece of island junk.”\n“You sell me a piece of trash and . . . ”\nAnd so forth. But all very friendly. I stood waiting patiently until the old man raised his head and lifted his eyeglasses, wiped along the two sides of his grease-smeared nose, and then pretended to notice me for the first time.\n“You Frankie?” I asked.\n“Nope.”\n“This is Frankie’s, though?”\n“Could be.” Junkyard men like the conditional.\nSo do lawyers. “I was wondering if it might be possible to find some brake parts for a 145, a 1970. Station wagon.”\n“What you’re looking for is an antique dealer,” the West Indian said.\nThe old man laughed; they both laughed. I didn’t.\n“Brake hardware,” I said. “The clips and pins and stuff.”\n“Hard to find,” the old man said. “That kind of stuff is very expensive these days.”\nThe second thing you learn in law school is when to walk away. I was almost at the end of the drive when the old man reached through the window of the 164 and blew the horn: two shorts and a long.\nAt the far end of the yard, by the fence, a head popped up. I thought I was seeing a cartoon, because the eyes were too large for the head, and the head was too large for the body.\n“Yeah, Unc?”\n“Frankie, I’m sending a lawyer fellow back there. Show him that 145 we pulled the wheels off of last week.”\n“I’ll take a look,” I said. “But what makes you think I’m an attorney?”\n“The tassels,” the old man said, looking down at my loafers. He stuck his head back under the hood of the 164 to let me know I was dismissed.\nFrankie’s hair was almost white, and so thin it floated off the top of his head. His eyes were bright blue-green, and slightly bugged out, giving him an astonished look. He wore cowboy boots with the heels rolled over so far that he walked on their sides and left scrollwork for tracks. Like the old man, he was wearing blue gabardine pants and a lighter blue work shirt. On the back it said—\nBut I didn’t notice what it said. I wasn’t paying attention. I had never seen so many Volvos in one place before. There was every make and model—station wagons, sedans, fastbacks, 544s and 122s, DLs and GLs, 140s to 740s, even a 940—in every state of dissolution, destruction, decay, desolation, degradation, decrepitude, and disrepair. It was beautiful. The Volvos were jammed so close together that I had to edge sideways between them.\nWe made our way around the far corner of the garage, where I saw a huge jumbled pile—not a stack—of tires against the fence. It was cooler here. The ailanthus trees were waving, though I could feel no breeze.\n“This what you’re looking for?” Frankie stopped by a 145 sedan—dark green, like my station wagon; it was a popular color. The wheels were gone and it sat on the ground. By each wheel well lay a hubcap, filled with water.\nThere was a hollow thud behind us. A tire had come over the fence, onto the pile; another followed it. “I need to get back to work,” Frankie said. “You can find what you need, right?”\nHe left me with the 145, called out to someone over the fence, then started pulling tires off the pile and rolling them through a low door into a shed built onto the side of the garage. The shed was only about five feet high. The door was half-covered by a plastic shower curtain hung sideways. It was slit like a hula skirt and every time a tire went through it, it went pop.\nEvery time Frankie rolled a tire through the door, another sailed over the fence onto the pile behind him. It seemed like the labors of Sisyphus.\nWell, I had my own work. Carefully, I drained the water out of the first hubcap. There lay the precious springs and clips I sought—rusty, but usable. I worked my way around the car (a job in itself, as it was jammed so closely with the others). There was a hubcap where each wheel had been. I drained them all and collected the treasure in one hubcap. It was like panning for gold.\nThere was a cool breeze and a funny smell. Behind me I heard a steady pop, pop, pop. But when I finished and took the brake parts to Frankie, the pile of tires was still the same size. Frankie was on top of it, leaning on the fence, talking with an Indian man in a Goodyear shirt.\nThe Indian (who must have been standing on a truck on the other side of the fence) saw me and ducked. I had scared him away. I realized I was witnessing some kind of illegal dumping operation. I wondered how all the junk tires fit into the tiny shed, but I wasn’t about to ask. Probably Frankie and the old man took them out and dumped them into Jamaica Bay at night.\nI showed Frankie the brake parts. “I figure they’re worth a couple of bucks,” I said.\n“Show Unc,” he said. “He’ll tell you what they’re worth.”\nI’ll bet, I thought. Carrying my precious hubcap of brake hardware, like a waiter with a dish, I started back toward the driveway. Behind me I heard a steady pop, pop, pop as Frankie went back to work. I must have been following a different route between the cars—because when I saw it, I knew it was for the first time.\nThe 1800 is Volvo’s legendary (well, sort of) sports car from the early 1960s. The first model, the P1800, was assembled in Scotland and England (unusual, to say the least, for a Swedish car). This one, the only one I had ever seen in a junkyard, still had its fins and appeared to have all its glass. It was dark blue. I edged up to it, afraid that if I startled it, it might disappear. But it was real. It was wheel-less, engineless, and rusted out in the rocker panels. But it was real. I looked inside. I tapped on the glass. I opened the door.\nThe interior was the wrong color—but it was real, too. It smelled musty, but it was intact. Or close enough. I arrived at the driveway, so excited that I didn’t even flinch when the old man looked into my hubcap (like a fortune teller reading entrails) and said, “Ten dollars.”\nI raced home to tell Wu what I had found.\nEverybody should have a friend like Wilson Wu, just to keep them guessing. Wu worked his way through high school as a pastry chef, then dropped out to form a rock band, then won a scholarship to Princeton (I think) for math (I think), then dropped out to get a job as an engineer, then made it halfway through medical school at night before becoming a lawyer, which is where I met him. He passed his bar exam on the first try. Somewhere along the line he decided he was gay, then decided he wasn’t (I don’t know what his wife thought of all this); he has been both democrat and republican, Catholic and Protestant, pro and anti gun-control. He can’t decide if he’s Chinese or American, or both. The only constant thing in his life is the Volvo. Wu has never owned another kind of car. He kept a 1984 240DL station wagon for the wife and kids. He kept the P1800, which I had helped him tow from Pennsylvania, where he had bought it at a yard sale for $500 (a whole other story), in my garage. I didn’t charge him rent. It was a red 1961 sports coupe with a B18. The engine and transmission were good (well, fair) but the interior had been gutted. Wu had found seats but hadn’t yet put them in. He was waiting for the knobs and trim and door panels, the little stuff that is hardest to find, especially for a P1800. He had been looking for two years.\nWu lived on my block in Brooklyn, which was strictly a coincidence since I knew him from Legal Aid, where we had both worked before going into private practice. I found him in his kitchen, helping his wife make a wedding cake. She’s a caterer. “What are you doing in the morning?” I asked, but I didn’t wait for him to tell me. I have never been good at surprises (which is why I had no success as a criminal lawyer). “Your long travail is over,” I said. “I found an 1800. A P1800. With an interior.”\n“Handles?”\n“Handles.”\n“Panels?”\n“Panels.”\n“Knobs?” Wu had stopped stirring. I had his attention.\n“I hear you got your brakes fixed,” Wu said the next day as we were on our way to Howard Beach in my car. “Or perhaps I should say, ‘I don’t hear.’”\n“I found the parts yesterday and put them on this morning,” I told him. I told him the story of how I found the Hole. I told him about the junkyard of Volvos. I told him about stumbling across the dark blue P1800. By then, we were past the end of Atlantic Avenue, near Howard Beach. I turned off onto Conduit and tried to retrace my turns of the day before, but with no luck. Nothing looked familiar.\nWu started to look skeptical; or maybe I should say, he started to look even more skeptical. “Maybe it was all a dream,” he said, either taunting me or comforting himself, or both.\n“I don’t see P1800s in junkyards, even in dreams,” I said. But in spite of my best efforts to find the Hole, I was going in circles. Finally, I gave up and went to Boulevard Imports. The place was almost empty. I didn’t recognize the counterman. His shirt said he was a Sal.\n“Vinnie’s off,” he said. “It’s Saturday.”\n“Then maybe you can help me. I’m trying to find a place called Frankie’s. In the Hole.”\nPeople sometimes use the expression “blank look” loosely. Sal’s was the genuine article.\n“A Volvo junkyard?” I said. “A pony or so?”\nBlank got even blanker. Wu had come in behind me, and I didn’t have to turn around to know he was looking skeptical\n“I don’t know about any Volvos, but did somebody mention a pony?” a voice said from in the back. An old man came forward. He must have been doing the books, since he was wearing a tie. “My Pop used to keep a pony in the Hole. We sold it when horseshoes got scarce during the War.”\n“Jeez, Vinnie, what war was this?” Sal asked. (So I had found another Vinnie!)\n“How many have there been?” the old Vinnie asked. He turned to me. “Now, listen up, kid.” (I couldn’t help smiling; usually only judges call me “kid” and only in chambers.) “I can only tell you once, and I’m not sure I’ll get it right.”\nThe old Vinnie’s instructions were completely different from the ones I had gotten from the Vinnie the day before. They involved a turn into an abandoned gas station on the Belt Parkway, a used car lot on Conduit, a McDonald’s with a dumpster in the back, plus other flourishes that I have forgotten.\nSuffice it to say that, twenty minutes later, after bouncing down a steep bank, Wu and I found ourselves cruising the wide mud streets of the Hole, looking for Frankie’s. I could tell by Wu’s silence that he was impressed. The Hole is pretty impressive if you are not expecting it, and who’s expecting it? There was the non-vertical crane, the subway car (with smoke coming from its makeshift chimney) and the horse grazing in a lot between two shanties. I wondered if it was a descendant of the old Vinnie’s father’s pony. I couldn’t tell if it was shod or not.\nThe fat lady was still on the phone. The kids must have heard us coming, because they were standing in front of the card table waving hand-lettered signs: MOON ROCKS THIS WAY! and MOON ROCKS R US! When he saw them, Wu put his hand on my arm and said, “Pull over, Irv,”—his first words since we had descended into the Hole.\nI pulled over and he got out. He fingered a couple of ashy-looking lumps, and handed the kids a dollar. They giggled and said they had no change.\nWu told them to keep it.\n“I hope you don’t behave like that at Frankie’s,” I said, when he got back into the car.\n“Like what?”\n“You’re supposed to bargain, Wu. People expect it. Even kids. What do you want with phony moon rocks anyway?”\n“Supporting free enterprise,” he said. “Plus, I worked on Apollo and I handled some real moon rocks once. They looked just like these.” He sniffed them. “Smelled just like these.” He tossed them out the window into the shallow water as we motored through a puddle.\nAs impressive as the Hole can be (first time), there is nothing more impressive than a junkyard of all Volvos. I couldn’t wait to see Wu’s face when he saw it. I wasn’t disappointed. I heard him gasp as we slipped through the gate. He looked around, then looked at me and grinned. “Astonishing,” he said. Even the inscrutable, skeptical Wu.\n“Told you,” I said. (I could hardly wait till he saw the 1800!) The old man was at the end of the driveway, working on a diesel this time. Another customer, this one white, looked on and kibitzed. The old man seemed to sell entertainment as much as expertise. They were trying to get water out of the injectors.\n“I understand you have an 1800,” Wu said. “They’re hard to find.”\nI winced. Wu was no businessman. The old man straightened up, and looked us over. There’s nothing like a six-foot Chinaman to get your attention, and Wu is six-two.\n“P1800,” the old man said. “Hard to find is hardly the word for it. I’d call it your rare luxury item. But I guess it won’t cost you too much to have a look.” He reached around the diesel’s windshield and honked the horn. Two shorts and a long.\nThe oversized head with the oversized eyes appeared at the far end of the yard, by the fence.\n“Two lawyers coming back,” the old man called out. Then he said to me: “It’s easier to head straight back along the garage till you get to where Frankie is working. Then head to your right, and you’ll find the P1800.”\nFrankie was still working on the endless pile (not a stack) of tires by the fence. Each one went through the low door of the shed with a pop.\nI nodded, and Frankie nodded back. I turned right and edged between the cars toward the P1800, assuming Wu was right behind me. When I saw it, I was relieved—it had not been a dream after all! I expected an appreciative whistle (at the very least), but when I turned, I saw that I had lost Wu.\nHe was still back by the garage, looking through a stack (not a pile) of wheels against the wall.\n“Hey, Wu!” I said, standing on the bumper of the P1800. “You can get wheels anywhere. Check out the interior on this baby!” Then, afraid I had sounded too enthusiastic, I added: “It’s rough but it might almost do.”\nWu didn’t even bother to answer me. He pulled two wheels from the stack. They weren’t exactly wheels, at least not the kind you mount tires on. They were more like wire mesh tires, with metal chevrons where the tread should have been.\nWu set them upright, side by side. He slapped one and gray dust flew. He slapped the other. “Where’d you get these?” he asked.\nFrankie stopped working and lit a cigarette. “Off a dune buggy,” he said.\nBy this time, I had joined them. “A Volvo dune buggy?”\n“Not a Volvo,” Frankie said. “An electric job. Can’t sell you the wheels separately. They’re a set.”\n“What about the dune buggy?” Wu asked. “Can I have a look at it?”\nFrankie’s eyes narrowed. “It’s on the property. Hey, are you some kind of environment man or something?”\n“The very opposite,” said Wu. “I’m a lawyer. I just happen to dig dune buggies. Can I have a look at it? Good ones are hard to find.”\nI winced.\n“I’ll have to ask Unc,” Frankie said.\n“Wu,” I said, as soon as Frankie had left to find his uncle, “there’s something you need to know about junkyard men. If something is hard to find, you don’t have to tell them. And what’s this dune buggy business, anyway? I thought you wanted interior trim for your P1800.”\n“Forget the P1800, Irv,” Wu said. “It’s yours. I’m giving it to you.”\n“You’re what?”\nWu slapped the wire mesh wheel again and sniffed the cloud of dust. “Do you realize what this is, Irv?”\n“Some sort of wire wheel. So what?”\n“I worked at Boeing in 1970,” Wu said. “I helped build this baby, Irv. It’s off the LRV.”\n“The LR what?”\nBefore Wu could answer, Frankie was back. “Well, you can look at it,” Frankie said. “But you got to hold your breath. It’s in the cave and there’s no air in there.”\n“The cave?” I said. They both ignored me.\n“You can see it from the door, but I’m not going back in there,” said Frankie. “Unc won’t let me. Have you got a jacket? It’s cold.”\n“I’ll be okay,” Wu said.\n“Suit yourself.” Frankie tossed Wu a pair of plastic welding goggles. “Wear these. And remember, hold your breath.”\nIt was clear at this point where the cave was. Frankie was pointing toward the low door into the shed, where he rolled the tires. Wu put on the goggles and ducked his head; as he went through the doorway he made that same weird pop the tires made.\nI stood there with Frankie in the sunlight, holding the two wire mesh wheels, feeling like a fool.\nThere was another pop and Wu backed out through the shower curtain. When he turned around, he looked like he had seen a ghost. I don’t know how else to describe it. Plus, he was shivering like crazy.\n“Told you it was cold!” said Frankie. “And it’s weird. There’s no air in there, for one thing. If you want the dune buggy, you’ll have to get it out of there yourself.”\nWu gradually stopped shivering. As he did, a huge grin spread across his face. “It’s weird, all right,” he said. “Let me show my partner. Loan me some extra goggles.”\n“I’ll take your word for it,” I said.\n“Irv, come on! Put these goggles on.”\n“No way!” I said. But I put them on. You always did what Wu said, sooner or later; he was that kind of guy.\n“Don’t hold your breath in. Let it all out, and then hold it. Come on. Follow me.”\nI breathed out and ducked down just in time; Wu grabbed my hand and pulled me through the shed door behind him. If I made a pop I didn’t hear it. We were standing in the door of a cave—but looking out, not in. The inside was another outside!\nIt was like the beach, all gray sand (or dust) but with no water. I could see stars but it wasn’t dark. The dust was greenish gray, like a courthouse hallway (a color familiar to lawyers).\nMy ears were killing me. And it was cold!\nWe were at the top of a long, smooth slope, like a dune, which was littered with tires. At the bottom was a silver dune buggy with no front wheels, sitting nose down in the gray dust.\nWu pointed at it. He was grinning like a maniac. I had seen enough. Pulling my hand free, I stepped back through the shower curtain and gasped for air. This time I heard a pop as I went through.\nThe warm air felt great. My ears gradually quit ringing. Frankie was sitting on his tire pile, smoking a cigarette. “Where’s your buddy? He can’t stay in there.”\nJust then, Wu backed out through the curtain with a loud pop. “I’ll take it,” he said, as soon as he had filled his lungs with air. “I’ll take it!”\nI winced. Twice.\n“I’ll have to ask Unc,” said Frankie.\n“Wu,” I said, as soon as Frankie had left to find his uncle, “let me tell you something about junkyard men. You can’t say ‘I’ll take it, I’ll take it’ around them. You have to say, ‘Maybe it might do, or . . . ’”\n“Irving!” Wu cut me off. His eyes were wild. (He hardly ever called me Irving.) He took both my hands in his, as if we were bride and groom, and began to walk me in a circle. His fingers were freezing. “Irving, do you know, do you realize, where we just were?”\n“Some sort of cave? Haven’t we played this game before?”\n“The Moon! Irving, that was the surface of the Moon you just saw!”\n“I admit it was weird,” I said. “But the Moon is a million miles away. And it’s up in the . . . ”\n“Quarter of a million,” Wu said. “But I’ll explain later.”\nFrankie was back, with his uncle. “That dune buggy’s one of a kind,” the old man said. “I couldn’t take less than five hundred for it.”\nWu said, “I’ll take it!”\nI winced.\n“But you’ve got to get it out of the cave yourself,” the old man said. “I don’t want Frankie going in there anymore. That’s why I told the kids, no more rocks.”\n“No problem,” Wu said. “Are you open tomorrow?”\n“Tomorrow’s Sunday,” said the old man.\n“What about Monday?”\nI followed Wu through the packed-together Volvos to the front gate. We were on the street before I realized he hadn’t even bothered to look at the 1800. “You’re the best thing that ever happened to those two,” I said. I was a little pissed off. More than a little.\n“There’s no doubt about it,” Wu said.\n“Damn right there’s no doubt about it!” I started my 145 and headed up the street, looking for an exit from the Hole. Any exit. “Five hundred dollars for a junk dune buggy?”\n“No doubt about it at all. That was either the Hadley Apennines, or Descartes, or Taurus Littrow,” Wu said. “I guess I could tell by looking at the serial numbers on the LRV.”\n“I never heard of a Hadley or a Descartes,” I said, “but I know Ford never made a dune buggy.” I found a dirt road that led up through a clump of trees. Through the branches I could see the full Moon, pale in the afternoon sky. “And there’s the Moon, right there in the sky, where it’s supposed to be.”\n“There’s apparently more than one way to get to the Moon, Irving. Which they are using as a dump for old tires. We saw it with our own eyes!”\nThe dirt road gave out in a vacant lot on Conduit. I crossed a sidewalk, bounced down a curb, and edged into the traffic. Now that I was headed back toward Brooklyn, I could pay attention. “Wu,” I said. “Just because you worked for NAPA—”\n“NASA, Irv. And I didn’t work for them, I worked for Boeing.”\n“Whatever. Science is not my thing. But I know for a fact that the Moon is in the sky. We were in a hole in the ground, although it was weird, I admit.”\n“A hole with stars?” Wu said. “With no air? Get logical, Irv.” He found an envelope in my glove compartment and began scrawling on it with a pencil. “No, I suspected it when I saw those tires. They are from the Lunar Roving Vehicle, better known as the LRV or the lunar rover. Only three were built and all three were left on the Moon. Apollo 15, 16, and 17.1971.1972. Surely you remember.”\n“Sure,” I said. The third thing you learn in law school is never to admit you don’t remember something. “So how did this loonie rover get to Brooklyn?”\n“That’s what I’m trying to figure out,” Wu said. “I suspect we’re dealing with one of the rarest occurrences in the universe. A neotopological metaeuclidean adjacency.”\n“A non-logical metaphysical what?”\nWu handed me the envelope. It was covered with numbers:\n“That explains the whole thing,” Wu said. “A neotopological metaeuclidean adjacency. It’s quite rare. In fact, I think this may be the only one.”\n“You’re sure about this?”\n“I used to be a physicist.”\n“I thought it was an engineer.”\n“Before that. Look at the figures, Irv! Numbers don’t lie. That equation shows how space-time can be folded so that two parts are adjacent that are also, at the same time, separated by millions of miles. Or a quarter of a million, anyway.”\n“So we’re talking about a sort of back door to the Moon?”\n“Exactly.”\nOn Sundays I had visitation rights to the big-screen TV. I watched golf and stock-car racing all afternoon with my wife, switching back and forth during commercials. We got along a lot better now that we weren’t speaking. Especially when she was holding the remote. On Monday morning, Wu arrived at the door at nine o’clock sharp, wearing coveralls and carrying a shopping bag and a toolbox.\n“How do you know I don’t have court today?” I asked.\n“Because I know you have only one case at present, your divorce, in which you are representing both parties in order to save money. Hi, Diane.”\n“Hi, Wu.” (She was speaking to him.)\nWe took my 145. Wu was silent all the way out to the Eastern Parkway, doing figures on a cocktail napkin from a Bay Ridge nightclub. “Go out last night?” I asked. After a whole day with Diane, I was dying to have somebody to talk to.\n“Something was bothering me all night,” he said. “Since the surface of the Moon is a vacuum, how come all the air on Earth doesn’t rush through the shed door, along with the tires?”\n“I give up,” I said.\nWe were at a stoplight. “There it is,” he said. He handed me the napkin, on which was scrawled:\n“There what is?”\n“The answer to my question. As those figures demonstrate, Irv, we’re not just dealing with a neotopological metaeuclidean adjacency. We’re dealing with an incongruent neotopological metaeuclidean adjacency. The two areas are still separated by a quarter of a million miles, even though that distance has been folded to the width of a centimeter. It’s all there in black and white. See?”\n“I guess,” I said. The fourth thing you learn in law school is to never admit you don’t understand something.\n“The air doesn’t rush through, because it can’t. It can kind of seep through, though, creating a slight microclimate in the immediate vicinity of the adjacency. Which is probably why we don’t die immediately of decompression. A tire can roll through, if you give it a shove, but air is too, too . . . ”\n“Too wispy to shove,” I said.\n“Exactly.”\nI looked for the turn off Conduit, but nothing was familiar. I tried a few streets, but none of them led us into the Hole. “Not again!” Wu complained.\n“Again!” I answered.\nI went back to Boulevard. Vinnie was behind the counter today, and he remembered me (with a little prodding).\n“You’re not the only one having trouble finding the Hole,” he said. “It’s been hard to find lately.”\n“What do you mean, ‘lately’?” Wu asked from the doorway.\n“Just this last year. Every month or so it gets hard to find. I think it has to do with the Concorde. I read somewhere that the noise affects the tide, and the Hole isn’t that far from Jamaica Bay, you know.”\n“Can you draw us a map?” I asked.\n“I never took drawing,” Vinnie said, “so listen up close.”\nVinnie’s instructions had to do with an abandoned railroad track, a wrong-way turn onto a one-way street, a dog-leg that cut across a health club parking lot, and several other ins and outs. While I was negotiating all this, Wu was scrawling on the back of a carwash flyer he had taken from Vinnie’s counter.\n“The tide,” he muttered. “I should have known!”\nI didn’t ask him what he meant; I figured (I knew!) he would tell me. But before he had a chance, we were bouncing down a dirt track through some scruffy trees, and onto the now-familiar dirt streets of the Hole. “Want some more moon rocks?” I asked when we passed the kids and their stand.\n“I’ll pick up my own today, Irv!”\nI pulled up by the gate and we let ourselves in. Wu carried the shopping bag; he gave me the toolbox.\nThe old man was working on an ancient 122, the Volvo that looks like a ‘48 Ford from the back. (It was always one of my favorites.) “It’s electric,” he said when Wu and I walked up.\n“The 122?” I asked.\n“The dune buggy,” the old man said. “Electric is the big thing now. All the cars in California are going to be electric next year. It’s the law.”\n“No, it’s not,” I said. “So what, anyway?”\n“That makes that dune buggy worth a lot of money.”\n“No, it doesn’t. Besides, you already agreed on a price.”\n“That’s right. Five hundred,” Wu said. He pulled five bills from his pocket and unfolded them.\n“I said I couldn’t take less than five hundred,” the old man said. “I never said I couldn’t take more.”\nBefore Wu could answer, I pulled him behind the 122. “Remember the second thing we learned in law school!” I said. “When to walk away. We can come back next week—if you still want that thing.”\nWu shook his head. “It won’t be here next week. I realized something when Vinnie told us that the Hole was getting hard to find. The adjacency is warping the neighborhood as well as the cislunar space-time continuum. And since it’s lunar, it has a monthly cycle. Look at this.”\nHe handed me the car wash flyer, on the back of which was scrawled:\n“See?” said Wu. “We’re not just dealing with an incongruent neotopological metaeuclidean adjacency. We’re dealing with a periodic incongruent neotopological metaeuclidean adjacency.”\n“Which means . . . ”\n“The adjacency comes and goes. With the Moon.”\n“Sort of like PMS.”\n“Exactly. I haven’t got the figures adjusted for daylight savings time yet, but the Moon is on the wane, and I’m pretty sure that after today, Frankie will be out of the illegal dumping business for a month, at least.”\n“Perfect. So we come back next month.”\n“Irv, I don’t want to take the chance. Not with a million dollars at stake.”\n“Not with a what?” He had my attention.\n“That LRV cost two million new, and only three of them were made. Once we get it out, all we have to do is contact NASA. Or Boeing. Or the Air & Space Museum at the Smithsonian. But we’ve got to strike while the iron is hot. Give me a couple of hundred bucks and I’ll give you a fourth interest.”\n“A half.”\n“A third. Plus the P1800.”\n“You already gave me the P1800.”\n“Yeah, but I was only kidding. Now I’m serious.”\n“Deal,” I said. But instead of giving Wu two hundred, I plucked the five hundred-dollar bills out of his hand. “But you stick to the numbers. I do all the talking.”\nWe got it for six hundred. Non-refundable. “What does that mean?” Wu asked.\n“It means you boys own the dune buggy—whether you get it out of the cave or not,” said the old man, counting his money.\n“Fair enough,” said Wu. It didn’t seem fair to me at all, but I kept my mouth shut. I couldn’t imagine a scenario in which we would get our money back from the old man, anyway.\nHe went back to work on the engine of the 122, and Wu and I headed for the far end of the yard. We found Frankie rolling tires through the shed door: pop, pop, pop. The pile by the fence was as big as ever. He waved and kept on working.\nWu set down the shopping bag and pulled out two of those spandex bicycling outfits. He handed one to me, and started taking off his shoes.\nI’ll spare you the ensuing interchange—what I said, what he said, objections, arguments, etc. Suffice it to say that, ten minutes later, I was wearing black and purple tights under my coveralls, and so was Wu. Supposedly, they were to keep our skin from blistering in the vacuum. Wu was hard to resist when he had his mind made up.\nI wondered what Frankie thought of it all. He just kept rolling tires through the doorway, one by one.\nThere were more surprises in the bag. Wu pulled out rubber gloves and wool mittens, a brown bottle with Chinese writing on it, a roll of clear plastic vegetable bags from the supermarket, a box of cotton balls, a roll of duct tape, and a rope.\nFrankie didn’t say anything until Wu got to the rope. Then he stopped working, sat down on the pile of tires, lit a cigarette, and said: “Won’t work.”\nWu begged his pardon.\n“I’ll show you,” Frankie said. He tied one end of the rope to a tire and tossed it through the low door into the shed. There was the usual pop and then a fierce crackling noise.\nSmoke blew out the door. Wu and I both jumped back.\nFrankie pulled the rope back, charred on one end. There was no tire “I learned the hard way,” he said, “when I tried to pull the dune buggy through myself, before I took the wheels off.”\n“Of course!” Wu said. “What a fool I’ve been. I should have known!”\n“Should have known what?” Frankie and I both asked at once.\nWu tore a corner off the shopping bag and started scrawling numbers on it with a pencil stub. “Should have known this!” he said, and he handed it to Frankie.\nFrankie looked at it, shrugged, and handed it to me:\n“So?” I said.\n“So, there it is!” Wu said. “As those figures clearly indicate, you can pass through a noncongruent adjacency, but you can’t connect its two aspects. It’s only logical. Imagine the differential energy stored when a quarter of a million miles of space-time is folded to less than a millimeter.”\n“Burns right through a rope,” Frankie said.\n“Exactly.”\n“How about a chain?” I suggested.\n“Melts a chain,” said Frankie. “Never tried a cable, though.”\n“No substance known to man could withstand that awesome energy differential,” Wu said. “Not even cable. That’s why the tires make that pop. I’ll bet you have to roll them hard or they bounce back, right?”\n“Whatever you say,” said Frankie, putting out his cigarette. He was losing interest.\n“Guess that means we leave it there,” I said. I had mixed feelings. I hated to lose a third of a million dollars, but I didn’t like the looks of that charred rope. Or the smell. I was even willing to kiss my hundred bucks goodbye.\n“Leave it there? No way. We’ll drive it out,” Wu said. “Frankie, do you have some twelve-volt batteries you can loan me? Three, to be exact.”\n“Unc’s got some,” said Frankie. “I suspect he’ll want to sell them, though. Unc’s not much of a loaner.”\nWhy was I not surprised?\nHalf an hour later we had three twelve-volt batteries in a supermarket shopping cart. The old man had wanted another hundred dollars, but since I was now a partner I did the bargaining, and we got them for twenty bucks apiece, charged and ready to go, with the cart thrown in. Plus three sets of jumper cables, on loan.\nWu rolled the two wire mesh wheels through the shed door. Each went pop and was gone. He put the toolbox into the supermarket cart with the batteries and the jumper cables. He pulled on the rubber gloves, and pulled the wool mittens over them. I did the same.\n“Ready, Irv?” Wu said. (I would have said no, but I knew it wouldn’t do any good. So I didn’t say anything.) “We won’t be able to talk on the Moon, so here’s the plan. First, we push the cart through. Don’t let it get stuck in the doorway where it connects the two aspects of the adjacency, or it’ll start to heat up. Might even explode. Blow up both worlds. Who knows? Once we’re through, you head down the hill with the cart. I’ll bring the two wheels. When we get to the LRV, you pick up the front end and—”\n“Don’t we have a jack?”\n“I’m expecting very low gravity. Besides, the LRV is lighter than a golf cart. Only 460 pounds, and that’s here on Earth. You hold it up while I mount the wheels—I have the tools laid out in the tray of the toolbox. Then you hand me the batteries, they go in front, and I’ll connect them with the jumper cables, in series. Then we climb in and—”\n“Aren’t you forgetting something, Wu?” I said. “We won’t be able to hold our breath long enough to do all that.”\n“Ah so!” Wu grinned and held up the brown bottle with Chinese writing on it. “No problem! I have here the ancient Chinese herbal treatment known as (he said some Chinese words), or ‘Pond Explorer’. Han dynasty sages used it to lie underwater and meditate for hours. I ordered this from Hong Kong, where it is called (more Chinese words), or ‘Mud Turtle Master’ and used by thieves; but no matter, it’s the same stuff. Hand me those cotton balls.”\nThe bottle was closed with a cork. Wu uncorked it and poured thick brown fluid on a cotton ball; it hissed and steamed.\n“Jesus,” I said.\n“Pond Explorer not only provides the blood with oxygen, it suppresses the breathing reflex. As a matter of fact, you can’t breathe while it’s under your tongue. Which means you can’t talk. It also contracts the capillaries and slows the heartbeat. It also scours the nitrogen out of the blood so you don’t get the bends.”\n“How do you know all this?”\n“I was into organic chemistry for several years,” Wu said. “Did my master’s thesis on ancient Oriental herbals. Never finished it, though.”\n“Before you studied math?”\n“After math, before law. Open up.”\nAs he prepared to put the cotton ball under my tongue, he said, “Pond Explorer switches your cortex to an ancient respiratory pattern predating the oxygenation of the Earth’s atmosphere. Pretty old stuff, Irv! It will feel perfectly natural, though. Breathe out and empty your lungs. There! When we come out, spit it out immediately so you can breathe and talk. It’s that simple.”\nThe Pond Explorer tasted bitter. I felt oxygen (or something) flooding my tongue and my cheeks. My mouth tingled. Once I got used to it, it wasn’t so bad; as a matter of fact, it felt great. Except for the taste, which didn’t go away.\nWu put his cotton ball under his tongue, smiled, and corked the bottle. Then, while I watched in alarm, he tore two plastic bags off the roll.\nI saw what was coming. I backed away, shaking my head—\nI’ll spare you the ensuing interchange. Suffice it to say that, minutes later, we both had plastic bags over our heads, taped around our necks with duct tape. Once I got over my initial panic, it wasn’t so bad. As always, Wu seemed to know what he was doing. And as always, it was no use resisting his plans.\nIf you’re wondering what Frankie was making of all this, so was I. He had stopped working again. While my bag was being taped on, I saw him sitting on the pile of tires, watching us with those blue-green eyes; looking a little bored, as if he saw such goings-on every day.\nIt was time. Wu grabbed the front of the supermarket cart and I grabbed the handle. Wu spun his finger and pointed toward the shed door with its tattered shower curtain waving slightly in the ripples of the space-time interface. We were off!\nI waved goodbye to Frankie. He lifted one finger in farewell as we ran through.\nFrom the Earth to the Moon—in one long step for mankind (and in particular, Wilson Wu). I heard a crackling, even through the plastic bag, and the supermarket cart shuddered and shook like a lawnmower with a bent blade. Then we were on the other side, and there was only a huge cold empty silence.\nOverhead, a million stars. At our feet, gray dust. The door we had come through was a dimly lighted hole under a low cliff behind us. We were looking down a gray slope strewn with tires. The flat area at the bottom of the slope was littered with empty bottles, wrappers, air tanks, a big tripod, and of course, the dune buggy—or LRV—nose down in the dust. There were tracks all around it. Beyond were low hills, gray except for an occasional black stone. Everything seemed close; there was no far away. Except for the tires, the junk, and the tracks around the dune buggy, the landscape was featureless, smooth. Unmarked. Untouched. Lifeless.\nThe whole scene was half-lit, like dirty snow under a full moon in winter, only brighter. And more green.\nWu was grinning like a mad man. His plastic bag had expanded so that it looked like a space helmet; I realized mine probably looked the same. This made me feel better.\nWu pointed up behind us. I turned, and there was the Earth—hanging in the sky like a blue-green, oversized moon, just like the cover of The Whole Earth Catalog. I hadn’t actually doubted Wu, but I hadn’t actually believed him either, until then. The fifth thing you learn in law school is to be comfortable in that “twilight zone” between belief and doubt.\nNow I believed it. We were on the Moon, looking back at the Earth. And it was cold! The gloves did no good at all, even with the wool over the rubber. But there was no time to worry about it. Wu had already picked up the wire mesh wheels and started down the slope, sort of hopping with one under each arm, trying to miss the scattered tires I followed, dragging the grocery cart behind me. I had expected it to bog down in the dust, but it didn’t. The only problem was, the low gravity made it hard for me to keep my footing. I had to wedge my toes under the junk tires and pull it a few feet at a time.\nThe dune buggy, or LRV, as Wu liked to call it, was about the size of a jeep without a hood (or even an engine). It had two seats side by side, like lawn chairs with plastic webbing, facing a square console the size of a portable TV. Between the seats was a gearshift. There was no steering wheel. An umbrella-shaped antenna attached to the front end made the whole thing look like a contraption out of E.T. or Mary Poppins.\nI picked up the front end, and Wu started putting on the left wheel, fitting it under the round fiberglass fender. Even though the LRV was light, the sudden exertion reminded me that I wasn’t breathing, and I felt an instant of panic. I closed my eyes and sucked my tongue until it went away. The bitter taste of the Pond Explorer was reassuring.\nWhen I opened my eyes, it looked like a fog was rolling in: it was my plastic bag, fogging up. I could barely see Wu, already finishing the left wheel. I wondered if he had ever worked on an Indy pit crew. (I found out later that he had.)\nWu crossed to the right wheel. The fog was getting thicker. I tried wiping it off with one hand, but of course, it was on the inside. Wu gave the thumbs up, and I set the front end down. I pointed at my plastic bag, and he nodded. His was fogged up, too. He tossed his wrench into the toolbox, and the plastic tray shattered like glass (silently, of course). Must have been the cold. My fingers and toes were killing me.\nWu started hopping up the slope, and I followed. I couldn’t see the Earth overhead, or the Moon below; everything was a blur. I wondered how we would find our way out (or in?), back through the shed door. I needn’t have worried. Wu took my hand and led me through, and this time I heard the pop. Blinking in the light, we tore the bags off our heads.\nWu spit out his cotton, and I did the same. My first breath felt strange. And wonderful. I had never realized breathing was so much fun.\nThere was a high-pitched cheer. Several of the neighborhood kids had joined Frankie on the pile of tires\n“Descartes,” Wu said.\n“We left it down there,” I said.\n“No, I mean our location. It’s in the lunar highlands, near the equator. Apollo 16. Young, Duke, and Mattingly. 1972. I recognize the battery cover on the LRV. The return was a little hairy, though. Ours, I mean, not theirs. I had to follow the tires the last few yards. We’ll spray some WD-40 on the inside of the plastic bags before we go back in.”\n“Stuff’s good for everything,” Frankie said.\n“Almost,” I said.\nIt was noon, and I was starving, but there was no question of breaking for lunch. Wu was afraid the batteries would freeze; though they were heavy duty, they were made for Earth, not the Moon. With new Pond Explorer and new plastic bags properly treated with WD-40, we went back in. I had also taped plastic bags over my shoes. My toes were still stinging from the cold.\nAs we went down the slope toward the LRV site, we tossed a few of the tires aside to clear a road. With any luck, we would be coming up soon.\nWe left the original NASA batteries in place and set the new (well, used, but charged) batteries on top of them, between the front fenders. While Wu hooked them up with the jumper cables, I looked around for what I hoped was the last time. There was no view, just low hills all around, the one in front of us strewn with tires like burned donuts. The shed door (or adjacency, as Wu liked to call it) was a dimly lighted cave under a low cliff at the top of the slope. It wasn’t a long hill, but it was steep—about twelve degrees.\nI wondered if the umbrella-antenna would make it through the door. As if he had read my mind, Wu was already unbolting it when I turned back around. He tossed it aside with the rest of the junk, sat down, and patted the seat beside him.\nI climbed in or rather “on,” since there was no “in” to the LRV. Wu sat, of course, on the left. It occurred to me that if the English had been first on the Moon, he would have been on the right. There was no steering wheel or foot pedals either—but that didn’t bother Wu. He seemed to know exactly what he was doing. He hit a few switches on the console, and dials lighted up for “roll,” “heading,” “power,” etc. With a mad grin towards me, and a thumbs up towards the top of the slope (or the Earth hanging above it), he pushed the T-handle between us forward.\nThe LRV lurched. It groaned—I could “hear” it through my seat and my tailbone—and began to roll slowly forward. I could tell the batteries were weak.\nIf the LRV had lights, we didn’t need them. The Earth, hanging over the adjacency like a gigantic pole star, gave plenty of light. The handle I had thought was a gearshift was actually a joystick, like on a video game. Pushing it to one side, Wu turned the LRV sharply to the right—all four wheels turned—and started up the slope.\nIt was slow going. You might think the Earth would have looked friendly, but it didn’t. It looked cold and cruel; it seemed to be mocking us. The batteries, which had started out weak, were getting weaker. Wu’s smile was gone already. The path we had cleared through the tires was useless; the LRV would never make it straight up the slope.\nI climbed down and began clearing an angled switchback. If pulling things on the Moon is hard, throwing them is almost fun. I hopped from tire to tire, slinging them down the hill, while Wu drove behind me.\nThe problem was, even on a switchback the corners are steep. The LRV was still twenty yards from the top when the batteries gave out entirely. I didn’t hear it, of course; but when I looked back after clearing the last stretch, I saw it was stopped. Wu was banging on the joystick with both hands. His plastic bag was swollen, and I was afraid it would burst. I had never seen Wu lose it before. It alarmed me. I ran (or rather, hopped) back to help out.\nI started unhooking the jumper cables. Wu stopped banging on the joystick and helped. The supermarket cart had been left at the bottom, but the batteries were light enough in the lunar gravity. I picked up one under each arm and started up the hill. I didn’t bother to look back, because I knew Wu would be following with the other one.\nWe burst through the adjacency—the shed door—together; we tore the plastic bags off our heads and spit out the cotton balls. Warm air flooded my lungs. It felt wonderful. But my toes and fingers were on fire.\n“Damn and Hell!” Wu said. I had never heard him curse before. “We almost made it!”\n“We can still make it,” I said. “We only lack a few feet. Let’s put these babies on the charger and get some pizza.”\n“Good idea,” Wu said. He was calming down. “I have a tendency to lose it when I’m hungry. But look, Irv. Our problems are worse than we thought.”\nI groaned. Two of the batteries had split along the sides when we had set them down. All three were empty; the acid had boiled away in the vacuum of the Moon. It was a wonder they had worked at all.\n“Meanwhile, are your toes hurting?” Wu asked.\n“My toes are killing me,” I said.\nThe sixth thing you learn in law school is that cash solves all (or almost all) problems. I had one last hundred-dollar bill hidden in my wallet for emergencies—and if this didn’t qualify, what did? We gave the old man ninety for three more batteries, and put them on fast charge. Then we sent our change (ten bucks) with one of the kids on a bike, for four slices of pizza and two cans of diet soda.\nThen we sat down under an ailanthus and took off our shoes. I was pleased to see that my toes weren’t black. They warmed fairly quickly in the sun. It was my shoes that were cold. The tassel on one of my loafers was broken; the other one snapped when I touched it.\n“I’m going to have to bypass some of the electrics on the LRV if we’re going to make it up the hill,” said Wu. He grabbed a piece of newspaper that was blowing by and began to trace a diagram. “According to my calculations, those batteries will put out 33.9 percent power for sixteen minutes if we drop out the nav. system. Or maybe shunt past the rear steering motors. Look at this—”\n“I’ll take your word for it,” I said. “Here’s our pizza.”\nMy socks were warm. I taped two plastic bags over my feet this time, while Wu poured the Pond Explorer over the cotton balls. It steamed when it went on, and a cheer went up from the kids on the pile of tires. There were ten or twelve of them now. Frankie was charging them a quarter apiece. Wu paused before putting the cotton ball under his tongue.\n“Kids,” he said, “don’t try this at home!”\nThey all hooted. Wu taped the plastic bag over my head, then over his. We waved—we were neighborhood heroes!—and picked up the “new” batteries, which were now charged; and ducked side by side back through the adjacency to the junk-strewn lunar slope where our work still waited to be finished. We were the first interplanetary automotive salvage team!\nWu was carrying two batteries this time, and I was carrying one. We didn’t stop to admire the scenery. I was already sick of the Moon. Wu hooked up the batteries while I got into the passenger seat. He got in beside me and hit a few switches, fewer this time. The “heading” lights on the console didn’t come on. Half the steering and drive enable switches remained unlighted.\nThen Wu put my left hand on the joystick, and jumped down and grabbed the back of the LRV, indicating that he was going to push. I was going to drive.\nI pushed the joystick forward and the LRV groaned into action, a little livelier than last time. The steering was slow; only the front wheels turned. I was hopeful, though. The LRV groaned through the last curve without slowing down.\nI headed up the last straightaway, feeling the batteries weaken with every yard, every foot, every inch. It was as if the weight that had been subtracted from everything else on the Moon had been added to the LRV and was dragging it down. The lights on the console were flickering.\nWe were only ten yards from the adjacency. It was a dim slot under the cliff; I knew it was bright on the other side (a midsummer afternoon!), but apparently the same interface that kept the air from leaking through also dimmed the light.\nIt looked barely wide enough. But low. I was glad the LRV didn’t have a windshield. I would have to duck to make it through.\nFifteen feet from the opening. Ten. Eight. The LRV stopped. I jammed the joystick forward and it moved another foot. I reached back over the seat and jiggled the jumper cables. The LRV groaned forward another six inches—then died. I looked at the slot under the cliff just ahead, and at the Earth overhead, both equally far away.\nI wiggled the joystick. Nothing. I started to get down to help push, but Wu stopped me. He had one more trick. He unhooked the batteries and reversed their order. It shouldn’t have made any difference but as I have often noticed, electrical matters are not logical, like law: things that shouldn’t work, often do.\nSometimes, anyway. I jammed the joystick all the way forward again.\nThe LRV groaned forward again, and groaned on. I pointed it into the slot and ducked. I saw a shimmering light, and I felt the machine shudder. The front of the LRV poked through the shower curtain into the sunlight, and I followed, the sudden heat making my plastic bag swell.\nThe batteries groaned their last. I jumped down and began to pull on the front bumper. Through the plastic bag I could hear the kids screaming; or were they cheering? There was a loud crackling sound from behind the shower curtain. The LRV was only halfway through, and the front end was jumping up and down.\nI tore the bag off my head and spit out the cotton, then took a deep breath and yelled, “Wu!”\nI heard a hiss and a crackling; I could feel the ground shake under my feet. The pile of tires was slowly collapsing behind me; kids were slipping and sliding, trying to get away. I could hear glass breaking somewhere. I yelled, “Wu!”\nThe front of the LRV suddenly pulled free, throwing me (not to put too fine a point on it) flat on my ass.\nThe ground stopped shaking. The kids cheered.\nOnly the front of the LRV had come through. It was burned in half right behind the seat; cut through as if by a sloppy welder. The sour smell of electrical smoke was in the air. I took a deep breath and ducked toward the curtain, after Wu. But there was no curtain there, and no shed—only a pile of loose boards.\n“Wu!” I yelled. But there he was, lying on the ground among the boards. He sat up and tore the bag off his head. He spit out his cotton and took a deep breath—and looked around and groaned.\nThe kids were all standing and cheering. (Kids love destruction.) Even Frankie looked pleased. But the old man wasn’t; he came around the corner of the garage, looking fierce. “What the Hell’s going on here?” he asked. “What happened to my shed?”\n“Good question,” said Wu. He stood up and started tossing aside the boards that had been the shed. The shower curtain was under them, melted into a stiff plastic rag. Under it was a pile of ash and cinders—and that was all. No cave, no hole; no rear end of the LRV. No moon.\n“The cave gets bigger and smaller every month,” said Frankie. “But it never did that, not since it first showed up.”\n“When was that?” asked Wu.\n“About six months ago.”\n“What about my jumper cables?” said the old man.\nWe paid him for the jumper cables with the change from the pizza, and then called a wrecker to tow our half-LRV back to Park Slope. While we were waiting for the wrecker, I pulled Wu aside. “I hope we didn’t put them out of business,” I said. I’m no bleeding heart liberal, but I was concerned.\n“No, no,” he said. “The adjacency was about to drop into a lower neotopological orbit. We just helped it along a little. It’s hard to figure without an almanac, but according to the tide table for June (which I’m glad now I bothered to memorize) the adjacency won’t be here next month. Or the month after. It was just here for six months, like Frankie said. It was a temporary thing, cyclical as well as periodic.”\n“Sort of like the Ice Ages.”\n“Exactly. It always occurs somewhere in this hemisphere, but usually not in such a convenient location. It could be at the bottom of Lake Huron. Or in mid-air over the Great Plains, as one of those unexplained air bumps.”\n“What about the other side of it?” I asked. “Is it always a landing site? Or was that just a coincidence?”\n“Good question!” Wu picked up one of the paper plates left over from the pizza and started scrawling on it with a pencil stub. “If I take the mean lunar latitude of all six Apollo sites, and divide by the coefficient of . . . ”\n“It was just curiosity,” I said. “Here’s the wrecker.”\nWe got the half-LRV towed for half-price (I did the negotiating), but we never did make our million dollars. Boeing was in Chapter Eleven; NASA was under a procurement freeze; the Air & Space Museum wasn’t interested in anything that rolled.\n“Maybe I should take it on the road,” Wu told me after several weeks of trying. “I could be a shopping-center attraction: ‘Half a Chinaman exhibits half a Lunar Roving Vehicle. Kids and adults half price.’”\nWu’s humor masked bitter disappointment. But he kept trying. The JPL (Jet Propulsion Laboratory) wouldn’t accept his calls. General Motors wouldn’t return them. Finally, the Huntsville Parks Department, which was considering putting together an Apollo Memorial, agreed to send their Assistant Administrator for Adult Recreation to have a look.\nShe arrived on the day my divorce became final. Wu and I met her in the garage, where I had been living while Diane and I were waiting to sell the house. Her eyes were big and blue-green, like Frankie’s. She measured the LRV and shook her head. “It’s like a dollar bill,” she said.\n“How’s that?” Wu asked. He looked depressed. Or maybe skeptical. It was getting hard to tell the difference.\n“If you have over half, it’s worth a whole dollar. If you have less than half, it’s worth nothing. You have slightly less than half of the LRV here, which means that it is worthless. What’ll you take for that old P1800, though? Isn’t that the one that was assembled in England?”\nWhich is how I met Candy. But that’s another story.\nWe closed on the house two days later. Since the garage went with it, I helped Wu move the half-LRV to his back yard, where it sits to this day. It was lighter than any motorcycle. We moved the P1800 (which had plates) onto the street, and on Saturday morning, I went to get the interior for it. Just as Wu had predicted, the Hole was easy to find now that it was no longer linked with the adjacency. I didn’t even have to stop at Boulevard Imports. I just turned off Conduit onto a likely looking street, and there it was.\nThe old man would hardly speak to me, but Frankie was understanding. “Your partner came out and gave me this,” he said. He showed me a yellow legal pad, on which was scrawled:\n“He told me this explains it all, I guess.”\nFrankie had stacked the boards of the shed against the garage. There was a cindery bare spot where the shed door had been; the cinders had that sour moon smell. “I was sick and tired of the tire disposal business, anyway,” Frankie confided in a whisper.\nThe old man came around the corner of the garage. “What happened to your buddy?” he asked.\n“He’s going to school on Saturday mornings,” I said. Wu was studying to be a meteorologist. I was never sure if that was weather or shooting stars. Anyway, he had quit the law.\n“Good riddance,” said the old man.\nThe old man charged me sixty-five dollars for the interior panels, knobs, handles, and trim. I had no choice but to pay up. I had the money, since I had sold Diane my half of the furniture. I was ready to start my new life. I didn’t want to own anything that wouldn’t fit into the tiny, heart-shaped trunk of the P1800.\nThat night, Wu helped me put in the seats, then the panels, knobs, and handles. We finished at midnight and it didn’t look bad, even though I knew the colors would look weird in the daylight—blue and white in a red car. Wu was grinning that mad grin again; it was the first time I had seen it since the Moon. He pointed over the rooftops to the east (towards Howard Beach, as a matter of fact). The Moon was rising. I was glad to see it looking so—far away.\nWu’s wife brought us some leftover wedding cake. I gave him the keys to the 145 and he gave me the keys to the P1800. “Guess we’re about even,” I said. I put out my hand, but Wu slapped it aside and gave me a hug instead, lifting me off the ground. Everybody should have a friend like Wilson Wu.\nI followed the full Moon all the way to Alabama.\nOriginally published in Asimov’s Science Fiction, February 1994.\nTerry Bisson is the author of a number of critically-acclaimed novels such as Fire on the Mountain, Wyrldmaker, Talking Man, Voyage to the Red Planet, Pirates of the Universe, The Pickup Artist, and, in a posthumous collaboration with Walter M. Miller, Jr., a sequel to Miller's A Canticle for Leibowitz called Saint Leibowitz and the Wild Horse Woman. In 1991, his famous story \"Bears Discover Fire\" won the Nebula Award, the Hugo Award, the Theodore Sturgeon Award, and the Asimov's Reader's Award, the only story ever to sweep them all. In 2000, he won a Nebula Award for his story \"macs.\" His short work has been assembled in the collections Bears Discover Fire and Other Stories and In the Upper Room and Other Likely Stories. His most recent novel is Any Day Now, an alternate history of 1968 He lives in California."}