{"fingerprint": "/SJdw1G+Jt/y6kUTdq0fPIewyhQ=", "sitename": "Clarkesworld Magazine", "title": "Decadence & Buckets of Blood: A Conversation with Holly Black by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/black_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Decadence & Buckets of Blood: A Conversation with Holly Black by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Decadence & Buckets of Blood: A Conversation with Holly Black\n Holly Black wrote a vampire novel, The Coldest Girl in Coldtown, and she had a whole lot of fun doing it.\n It’s hard to pinpoint what Black is best known for or what she does best. Her first novel, Tithe, is a modern fairy tale. Her Spiderwick books tell the story of three children, a magic book, and fairies, and that series propelled her into international fame. The Curse Workers series wove urban fantasy, touch magic, and organized crime with a noir-ish tone and the dark secrets of the con.\n With her most recent book, Doll Bones, this highly imaginative and ever playful fantasist, asks what happens when we stop engaging in imaginative play.\n “Holly is one of the more dynamic and interesting writers out there in terms of the variety of things she’s doing,” said Jeff VanderMeer, the author of the Ambergris Cycle. “I love her dark sensibilities.”\n Black and I talked in a hotel restaurant in Spartanburg, SC, the morning after she arrived to speak about creating magic systems at Shared Worlds, a world-building and creative writing camp I co-direct with Jeff VanderMeer.\n Fresh off a pre-pub dinner tour with booksellers and the chaotic carnival of Comic Con, Black claimed to be off her game. However, she was animated and quick to laugh as we talked about plotting novels, zombies, and the decadent joy of reading and writing vampire books.\n Back in 2009, you gave a presentation on plot here at Shared Worlds. You’ve covered a lot of ground since then. Has the way you plot a novel changed much?\n Definitely, I’ve been thinking about plot differently. The reason there are so many systems of plotting is that you need to hear different parts of them at different times. For a long time I would write chapter one then write chapter two then re-write chapter one then re-write chapter two then write chapter three then re-write chapter one then re-write chapter two, and I had a really hard time planning forward. Then I wrote the Curse Worker series of novels which have cons at their center, which meant I had to plan the books in greater detail. The cons had to stay the way they were and they gave a spine to each book. I thought, “This is great! I’ve figured out plotting!” Then I sat down to write Coldtown and it doesn’t have a con at the center of it and I was back to sort of feeling my way in the dark.\n I understand the three arc—or sometimes four arc—structure that people talk about. At least I think I understand it. But it’s not always the thing that will help me puzzle through the thing I am puzzling through.\n Is that part of the thrill of potting—that puzzling, that feeling your way in the dark?\n I would not say so! [Laughter.] I would say just the opposite. It’s the thing that’s the most painful. I feel like writing a book is a magic trick. Each time I am fairly sure one day I will not pull off. The book I am working now is called The Darkest Part of the Forest. It’s a Faerie book. And I was really having a rough, rough time with it. On the plane ride out to do the pre-pub tour, I finally got the idea that made me understand what the book was, but until then I thought, this is one. This is the one where I’m going to have to call up my editor and be like, “Can I write you a different book, because I don’t know how to write this book? I thought I did, but now I don’t.” [Laughter.]\n Until that draft is turned in, I often feel a great deal of anxiety and dread that I will be unable to pull it off. I think that’s why I like re-writing so much.\n Because you have something in front of you?\n At that point, it’s cleaning it up. It’s making it better. It’s enhancing it. I know what it is then.\n How do you balance the need for time to figure out the puzzle and an increasing number of shorter and shorter deadlines?\n I do a lot of talking about stuff with writer friends. Like, “I’m stuck on this thing. What am I missing?” That can be really helpful because you use a different part of your brain to talk about story than you do to write. I think that when you’re talking about your book you can get a greater sense of the whole book at once, whereas when you’re down in it you’re often looking at it through the protagonist’s eyes and you can only look a little bit ahead. Or, at least, I have difficulty seeing more than a little bit ahead, so talking about it is really helpful. Sometimes you just know that there’s something wrong and you don’t know how to make it right until . . . until you do. That’s the part that I’m not sure there’s any other way through.\n Also, I suppose when you’re talking with someone you can gauge by their response, their facial expressions.\n And they can call you out. They can be like, “That doesn’t make any sense. What do you mean? How do they get from here to there?” Stephen King, in On Writing, talks about plot as being something that you have to discover like you’re in an archaeological dig. If you take a jackhammer to it, you’ll destroy it. I remember reading that when I was working with friends to try to figure out how to make a plot. We’d sit down and they try to help me figure out the plot and I thought, “That can’t be true! We’re getting a plot and this is great.”\n But more and more I’ve come to understand what King was saying and I don’t think it was what I originally took it to mean. But, rather, that you can create a plot but you still have to find your way to the story that it is. When your perfectly laid plan falls apart, it is only for a good reason and it’s because you need to find the story still.\n Has the plot of any of your books changed drastically from talking with friends?\n Absolutely! You hear yourself and you’re like, “Oh! That’s what it is!” Stuff floats in your head and you don’t realized quite what it means until you’re really talking about it. A lot of times I have floaty ideas about what happens, and it helps to actually say, “This then this then this then this . . . Or the consequences of that is this . . . Or what I really mean by that is this . . . ” Taking it from the general to the specific is really, really helpful and, a lot of times, it really pushes your forward.\n Speaking of pushing forward, where does a book usually start for you?\n They usually start with an image or a little bit of a premise and a mood—very much a mood. I want to feel this. I want the reader to feel this. With Doll Bones, I knew that the doll was going to be made out of bone China that was made out of human bones. I knew that, and I knew that it was going to be a story about what it mean to stop playing, to stop telling stories together.\n How do you—\n [Laughter.] I don’t know. I don’t know. I don’t know.\n As your career grows, it seems like it’d be harder for you to take risks, but here are you are taking greater risks.\n Doll Bones is a story I wanted to tell for a long time. When I was first talking about it with people at my publisher, everybody had a story about how they stopped, when they stopped, why they stopped playing, and a lot of times it wasn’t that they wanted to stop. Someone mocked them for playing a game they’d always played. Something went wrong and there was some reason why they stopped.\n The obvious way to tell Doll Bones was from the girl who is visited by the ghost and who sends him on the quest and who doesn’t want to give up playing with dolls. Her name is Poppy. Originally, I thought this was Poppy’s story. And I don’t think I could’ve written it until I realized, no, it’s Zach’s story, because you are asking the same questions Zach is asking.\n Do you know whose story it is before pen hits paper?\n Ideally, you know but that’s not always how it happens. In the case of Doll Bones I’d only written a very little bit before I realized it.\n In reading the “How I wrote . . . ” posts on your blog, it seems like you throw out a lot of what you write.\n I threw out the first three chapters of Coldtown and then I threw out thirty thousand words in the middle. It was really painful.\n Why?\n “The Coldest Girl in Coldtown” was originally a short story. And I had some idea that what I was going to do in the novel was take the characters from the short story plus new characters and take them on an adventure. Great! I had a different idea for a different beginning where a girl woke up after a party where everyone was dead. But I thought I probably shouldn’t do that because it’s probably a noir-ish leftover from my Curse Worker days. I wrote three chapters with a different beginning, and then I realized, no, that the other beginning is the beginning and when I started writing it I really, really liked it.\n You feel it in your body. It’s like you have a limb that is out of place and you get it snapped back in. You can just tell when it’s the right thing.\n Do you labor over cutting 30,000 words? Try to save them?\n What happened is the kids in Coldtown are on a sort of road trip to Coldtown, which is a desperate move. Once you go inside the gates you can’t go unless you have this particular kind of marker which means you bounty hunted a vampire. It’s pretty scary. It’s been built up throughout most of the book and I was so excited to be in Coldtown that I wrote a lot of things in Coldtown, had a lot of fun in Coldtown at first, and that was just wrong. You don’t have fun in the vampire city. It’s terrifying! [Laughter] Well, maybe you can have a little fun. But not then. Not when you just go in. So I had all this really fun stuff that I had to take out because it wasn’t pacing right.\n I had so much I wanted to show the characters! From a pacing point of view it was meant to be a misdirect. Look, I’m going to lull you. But it didn’t work that way. You guys can’t not hang out in Coldtown! It didn’t feel right. My friends were supportive but slightly horrified when I cut it. There were like, “Do you really need to? It was fine! Don’t! Don’t!” But they’re used to it by now.\n It was complicated. I had to take two kids out of the group. I had to change the dynamic of who met who when.\n To take out the middle do you have to go back to the beginning?\n Sometimes you do. I’ve re-thought the book I am writing now, and I’m back in the beginning, retyping every word, because there’re too many changes. Re-typing the whole thing, then I have to write the rest. I really envy people who have a better process! [Laughter.] Someday I’m going to have a better process. That’s my goal. That’s why I love reading these books about how write a book in like thirty days. I just feel someday someone is going to say the thing that’s going to fix my process.\n What has been your most efficient book?\n I think Red Glove. That book was fast. I wrote the beginning of it in Mexico on a writing retreat. I’d come right off the last Spiderwick tour and I knew the characters from writing White Cat. It was a direct sequel and I had thought a lot about the beginning. I was really excited to work on it. It went the most smoothly of any book I’ve ever written. Pretty fast. Pretty painless. Not entirely painless. Coldtown, for all I had to gut it twice, it was a lot of fun to write.\n What was fun about Coldtown?\n I took every single thing about vampires that I liked in my misspent youth and jammed them into this book. It’s full of decadence and buckets of blood. All the things I like.\n Vampires have gone through a lot of changes since you and I were teenagers.\n Whenever you write a book, you are in dialogue with what came before it and certainly there’s no way to write a vampire book now and not have people think of Twilight. It’s just not possible, because Twilight has loomed so large in the public consciousness.\n You know, I thought, “Really? Am I really going to do this? Am I really going to write a vampire book now?” Part way through, I turned to my friends and said, “Who let me do this?” In all the time I’ve been around, vampires have only ever been “so over” that someone would be crazy to write one or so popular that someone would be crazy to write one. I figured that there’s no time that they’re not going to fall into one of those two categories so I might just as well write it now.\n But I had to ask myself, “Do I have anything to bring to the genre? Do I have anything to add?” In Coldtown, there are these quarantined areas, but people are able to broadcast out of them with live feeds. They’re able to update their Tumbler pages from the inside.\n When I was writing Coldtown, I was thinking a lot about reality television. I watch some truly crappy reality television, by the way, so I’m not writing a book judging reality television. But I was interested in the way that real reality is inevitable in reality television. A few years ago on VH-1 there was a show called “Megan Wants a Millionaire,” which was an off-shoot of Brett Michael’s “Rock of Love,” you may recall which in itself was an off-shoot of Flavor Flav’s show. They had to pull the plug on “Megan Wants a Millionaire” because one of the contestants had allegedly killed his girlfriend. I say “allegedly” because he never went to trial. He killed himself. They cancelled the show halfway through the season. Like, “Let’s pretend this show never happened.” Several years later on “Real Housewives of Beverly Hills,” one of the husbands killed himself. Who knows why anyone does anything, but . . . Some of his sketchy financial dealings had come to light. And they didn’t cancel the show. They broadcast it. They re-cut it to pull that into the storyline. At the re-union show, someone said, “Well, maybe we shouldn’t have shown this?” And I thought, “That’s true!” But I watched all of it and didn’t feel culpable.\n So, what would it be like if you could watch kids in this quarantined area, going to vampire parties, wanting to become vampires, killing and dying? How far away would it seem like it was happening?\n How do your long-time readers feel about a vampire novel from you?\n I think that they’re “in.” I was asked by fans if I’d ever write a vampire novel. People like vampires.\n Why, though?\n Why? [Laughter.] Vampires are an endlessly flexible metaphor. We go through a cycle with vampires. We have vampire as as villain force that we fight, then we have vampire as anti-hero, then we have vampire as romantic obsession, then we have vampire as hero. And we cycle right back around.\n Yeah, but—\n Everybody’s got their thing. For years, I’ve been having people telling me they don’t like fairy books. So now I go and write a vampire book.\n When I was a kid, the first vampire book I read may have been Interview with a Vampire [by Anne Rice], which I bought for 25 cents at a garage and it had this old cover of the characters on the back with their faces painted white. They looked ridiculous—a really amazing cover. I read that book over and over again. I loved it so much. Then I read Les Daniels who had that series about a vampire who traveled through time, I believe, by going back into his silver skull. He was some kind of alchemist or magician in addition to being a vampire. Each time he traveled he romanced a different lady. One was [set in] the Dark Ages; one was set during the French Revolution, called Citizen Vampire, and then one was Aztec. Then I read Tanith Lee’s Sabella, or the Blood Star, which is one of my favorite books ever.\n What was it about vampire books that appealed to the teenage and twenty-something you?\n Certainly, being in the monster’s head the way you were with Interview felt real fresh at the time; it felt very shocking. The book was scary but I wasn’t scared. And . . . it was very decadent! It’s this fabulously decadent, debauched story—that’s what appealed to me! [Laughter.] Descriptions of wine and blood co-mingling, you know? I was into it. I was all for it.\n The thing about vampires is that they create an idealized version of us and they create a debased version of us in one being. They’re us, staying as young as we are. We’ll never get older. We’ll never get less beautiful. We’ll probably be able to manage our money situation because, let’s face it, we can invest now. Vampires are the aristocrats if the undead, but they are also us in our most uncontrolled, debased state.\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}