{"fingerprint": "Xeaif7e5bPj68OK61PhL7ONpfpQ=", "sitename": "Clarkesworld Magazine", "title": "How Alike Are We by Bo-young Kim, translated by Jihyun Park and Gord Sellar", "author": "Bo-young Kim; Jihyun Park; Gord Sellar", "date": "2022-01-01 00:00:00", "source": "https://clarkesworldmagazine.com/bo-young_10_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: How Alike Are We by Bo-young Kim, translated by Jihyun Park and Gord Sellar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "25590 words, novella\nHow Alike Are We\nThere’s something I can’t see.\nI’ve been constantly obsessed by the thought of it.\nThe problem was that there was no way to detect something I was unable to see. Intrinsically, it makes no sense—like trying to know the unknowable.\nFor the past year of this voyage, there’s been something inside this ship that I couldn’t see.\nSomething that has affected people’s minds and behaviors constantly, like the air, something that ought to have been checked and analyzed from the start. I’ve noticed something, but I couldn’t recognize what because I lack the knowledge. This has given rise to a series of errors throughout the voyage.\nI need to find out what that is.\nBy whatever means necessary.\n1.\nMy visual sensors were already operational, but the clarity of my visual perception increased after I internalized the information.\nAt first, it simply seemed as if something was before me. After a while, it became apparent that it was something round and metallic, after which I perceived the object’s model name, manufacturer, and unit price. Later I understood that it was the basic external housing that contained the AI called HUN-1029, which has been mainly provided to deep space supply ships.\nJust as with my visual, my auditory perception increased slowly: the sound of a ventilation fan sucking up the air and exhaling it out; the creak of the running ship; the irritating clank of the opening and shutting of the external hatch to the altitude chamber—\nHow irritating!\n—all of it was familiar yet also strange to me.\nInto my visual sensors came an image of bread and water bottles filling a space right to the ceiling. They bore the logo of “HanSot,” an inter-satellite food distribution corporation. By the looks of all the fat sausages stuffed between the bread and the bottles, this must be a “hyeja” ship—\nHyeja: ancient slang for some sort of “tasty lunchbox.”\n—of medium size, suitable for a crew of ten to twenty people. The ceiling was covered in filth, and from it hung clusters of handicrafted objects: things constructed from toothpicks, specimens of origami, and a number of cloth dolls.\nAttempting to think about what I was doing on this so-called spacecraft, I found myself confused, unable to know who “I” was.\nThen came a harsh noise, and it was only by the time that the waves carrying it through the air had almost completely dissipated that I realized the sound had meaning, and that it was someone’s voice.\n“Quit dawdling and get up!”\nDawdling: slang term, a complaint about moving slowly. Possible implications: negative feelings toward me; a task that needed to be performed.\nSomething that needed to be done ············ but I couldn’t recall what it was.\n“Don’t pretend you’re still sleeping. You’ve been awake for a while now.”\nI inspected my interlocutor. It was a creature, vertebrate ······ Mammal, human, a person with a strong presence. Fully bearded, thick rough hands smeared with oil. Engineer, possibly a technician.\n“I did what you wanted. Now tell me the code,” said someone standing behind me. Someone lithe and slender, with smooth skin, a small frame, and an unobtrusive musculature. Dressed in clean clothes and wearing spotless gloves. An office worker, possibly a manager.\nBack there, seated and facing this way and that, were some other, not-so-clean looking people. Although they were difficult to classify individually, by the looks of their clothing it seemed probable that they were sailors.\nBut . . . the code?\n“What code?” I asked, and heard my voice. It was strange, as if I was using some strange speech organ. My voice was dry and crackling.\nThe “technician” approached me, slamming one fist into the palm of the other hand. A few moments later, its impact against my body sent a shockwave through me. This puzzled me.\nDue to how the impact relocated my visual sensors, I was confronted with another portion of my surroundings: what seemed to be an enormous window covering the entire wall before me, through which I could see a planet, tangerine-colored, revolving slowly. To be precise, the world was yellow, and surrounded by a faint bluish halo, but overall it had a tangerine hue. The surface of the world was not visible for all the cloud cover. That blue halo meant there was an atmosphere; my inability to see the surface meant the atmosphere was thick, possibly thicker than the atmosphere on Earth. The ruddy hue of the thick air near the surface signified the scattering of long-wavelength light. Possible explanation: the presence of a thick atmospheric layer, or some amount of relatively large particles in atmospheric suspension.\nThere was only one planet in the solar system that fit that profile. Not Mars: it was red, but with its thin atmosphere, the ground would have been clearly visible from such a distance.\nThis was Titan—one of Saturn’s moons.\nThe realization came to me late, and when I glimpsed the enormous, dignified rings of great Saturn in the near distance beyond the moon, I realized that I wasted time on unnecessary inference.\nI considered the video feed. In one corner a small box intruded on the view, displaying a sequence of numbers. It looked to be a video transmitted from nearby via a local satellite. The numbers were dropping, which probably indicated distance from the satellite. Possibility: Titan was this ship’s destination. Dividing the distance by the speed, the ETA was approximately ·················· 10 days, 14 hours, 23 minutes.\nI made this inference pretty quickly, but not that quickly. My mind was running too slow. Or, no, this was not simply a matter of speed. Rather, it was that my cognition functioning was more generally broken down into separate subfunctions: proper calculation and memory recall were impossible. No matter how hard I tried, I had to make do with only approximate values.\nIn quick succession, the “technician” and then the “manager” spoke to me:\n“Don’t play innocent.”\n“Say the code.”\nFinally, I glanced down at my body, and found myself once more confused: I was inside a capsule that was tilted upright. From the body extended one pair of arms and one pair of legs made of carbon compounds; from them exuded the sour fumes of dried antifreeze (what a weird sensation!). Along my arms and thighs were emblazoned large serial numbers, as if by magic. This was typical, because the barcode implanted on the back of the neck was difficult to see.\nAh, this thing’s expensive, I thought as the information poured in. This body was the most expensive piece of equipment in the Hyeja ship’s cargo, even if—from what I could tell—it’d been left inert too long and had started to go bad.\nIt’d been cultured up from a single cell, and finally assembled into a humanlike structure.\nA ship designed for deep-space missions is, in a sense, a closed ecosystem. If one crew member got badly injured or died, it was no different from losing the whole field of knowledge in one specific professional field. Sure, the interstellar travel outfitting guidelines mandated that every ship be crewed with two specialists in each field, but the pressure of operating expenses meant that’s not how it worked in reality. That’s why normally in ships there were prosthetic bodies into which you could copy the sailor’s memories; they’re placed on board in case of an emergency, just like a fire extinguisher would be. You scanned the original’s brain and saved the contents to a chip that could be inserted into the socket on the rear of a backup body’s neck; the flow of electric signals from the chip would pass into the artificial brain, rearranging the memory cells into the necessary configuration. It was essentially like a backup drive designed to be used for human beings.\nHowever, why was I here? I ···············\n“Is this playing around with us now?” The “technician” held up its fist again, while speaking a stream of muddled, unfamiliar phrases: Focker? Azole? Fackin shid? I shut my eyes, reflexively clenching my jaw and tensing the muscles in my gut. I was just as baffled by these reflexive movements as by the unfamiliar words, since they had not been intentional on my part.\nThey were, I realized, a reaction designed to help me cope with physical dangers. The prosthetic body was embedded with a control device that put top priority on maintaining its own survival. It struck me that the prioritization of this survival instinct had taken over at least half of my personality, if not more than that. Was this one of the reasons why so much of my memory was missing?\n[they’re demanding the information from you in a colloquial manner.]\nThis line of text appeared in the air, a little distance away from me, like subtitles in a movie. The person who was squatting down by the subtitle didn’t draw one’s eyes and typed in the air with fingers with silver metal chips pierced. Glasses—there’s still plenty of people who hate the idea of going under the knife, when it comes to their eyes—and dark eyes with dark circles beneath them, a slightly twisted backbone, and unnaturally prominent knuckles. A programmer, a planner, and a recorder.\nAnother line of holographic subtitles began to appear between the “technician” and me. This time, however, they were aligned such that they were facing the crew, so that for me all the letters and words appeared in reverse, like an image flipped in a mirror. It was with apparent annoyance that the “technician” typed the message:\n[hun doesn’t understand what you’re saying without context. stop pushing it and try explaining the situation, starting with the basics.]\nIn response, the “manager” spoke from the back of the group: “Listen, HUN: you’re our Crisis Management AI.”\nAI? Apparently I was a computer program, I realized.\n“On the 352nd day of our shipping voyage, you demanded to be treated like a human being and declared a strike, suddenly ceasing all activity. You told us that you would tell us the unlock code for your backup, which was saved separately in the docking bridge, if your personality were copied into a prosthetic body designed for human use, and that you were to be treated as a human flight attendant. It wasn’t easy, but finally we agreed to your terms, and we’ve done what you demanded. Now it’s your turn to keep your promise: tell us the code.”\nWow! That came as a surprise! Yet I still couldn’t understand it all.\n“I’m sorry,” I said, attempting to reply and keep the conversation going with a familiar phrase. Then I said, “I really don’t understand what you’re saying. I’ve only just learned that I’m an AI . . . ”\nIt was like the whole ship turned over on its axis as the sailors leaped to their feet, yelling and screaming:\n“What’s it saying now?”\n“Isn’t it in there now?!”\n“I told you it wouldn’t work! The data structure is completely different! It’s the same as opening a text file in image program!”\n“Wait, then if that’s not what’s inside that body, what is?”\nThen, in a fearful voice, came the question, “What is making that noise right now?” The speaker was an overweight person with a chubby red face and a potbelly, with deep headphone-shaped indentations on either side of the forehead, and unusually wide ear canal openings: a Communications and Transmissions Specialist.\n“There’s a basic setting designed to ensure the survival of the body,” I said, and everyone quickly went quiet. “If there weren’t, even visual and auditory stimuli would’ve been impossible to translate. I would be unable to make a sound like this. When the data is incomplete, the basic settings compensate for it. Even with basic data transfer from a human brain, some loss is inevitable, because the basic specifications of each human brain are different. Therefore the contents get copied with the most valuable data given highest priority.”\nEveryone sat silently, staring at me with their mouths gaping.\n“Long-term memory in humans and machines is similar enough, in that both need to be recorded and stored long term. However, short-term memory works very differently between the two, so all that’s been lost. Other than that, there must also have been some corrections and losses across a wide range of data. It will take time for the cell array to settle, too, so it’s not unusual that I don’t remember you . . . ”\n“It really is (fockar? fackor?) with us, now, isn’t it?!” said the “technician” in front of me, raising one hand up high.\nDistorted faces, shrieking, insults: these cues indicated that they were upset. I began to worry, wondering which part of my explanation could have been erroneous.\n“Navigator Kang Woo Min!” barked the “manager,” hands raised headward. “Don’t you dare damage that, it’s expensive!”\nThe “programmer” output another holographic subtitle into the air without so much as a glance toward me:\n[it’s talking normally for a hun unit. i guess the transfer went well after all! and here i assumed it’d be impossible.]\nIt was at this point that I realized that the “programmer” was mute. Still, that didn’t seem to matter much: with laser keyboard implants in the fingers and a holographic monitor available, muteness wasn’t really a disability, any more than shortsightedness had been after the creation of eyeglasses.\n[there was a rumor that went around a while back that it could work, though, since modern neural net-based ais were developed based on human brain structure.]\nUnlike the “programmer,” who was seated in a stable position, the sailors’ movements were . . . distracted. It could mean that they were puzzled . . . or sick, or possibly that they were dancing with excitement.\n“I shouldn’t have come here,” said the person who’d been called “Navigator Kang Woo Min” in a low voice, fidgeting with a lock of hair. A navigator, perhaps also an engineer?\n“I told you,” someone else replied. ”“It’s been nothing but bad luck since we first set out.”\nBad luck since we first set out—that was interesting data.\n“I boarded this ship believing what we’d been told: that the ship would be trashed once we reached Europa. But here we are, ninety-two days longer than we were ever supposed to be on this stinking, rattling old rust bucket.”\nAs if in response to the complaint, a creaky rattling sound began overhead. I glanced up toward the ceiling. The gravitational orientation in this chamber was oriented beneath us, and the mobiles dangling from the ceiling hung at a slight angle. Judging by the structure of this chamber, it must be a module constructed in the shape of a rim, attached to the hull of a basic Hyeja ship, which is designed in the shape of a long, slender cylinder. The main hull serves as the axis, while the rim spins, generating false gravity through centrifugal force. The basic Hyeja ship model is designed to be modularly expandable, but like with off-brand construction toy blocks, recent mass-produced rims are subtly out of standard alignment, so they whine a little bit as they rotate.\n“We need to go just as far as we’ve already come to get to Europa, but our comm system is out of commission and this crazy AI’s gone Frankenstein on us.”\nComm system? ····················· Then I realized why the noise of the opening and closing of the airlock hatch was so annoying to me: it was supposed to stay closed. If it wasn’t closed, then exit and entry from the ship would be impossible . . . and if going outside was impossible, then the exterior monitors and antennae couldn’t be repaired.\n“That’s the spirit!” said another person: muscular with dark-tanned skin; left hand and one leg made of cybernetic steel; dirty; signs of chronic inflammation; clothing bearing a badge indicating crew position: Pilot. Of course, in such a small social setting, the actual roles each individual played must have overlapped somewhat. “I always knew you were special . . . ”\n“Well, it freaks me out,” said the potbellied one whom I’d guessed was a Communications Specialist, cringing visibly. Is that a response to coldness? I thought, but then I realized that wasn’t what was causing the behavior.\n“We decided this by majority,” said the “manager,” though now the title Captain came to mind. “Pilot Kim Ji Hoon, Communications Office Gu Gyeong Tae.”\nIt was difficult to identify each crew member: their hairstyles, clothing, and apparent height and body shape were constantly changing. Just like identifying particular dogs and cats, it was easy for humans to do, but not a simple task for a machine.\n“An SOS came from Titan, and we were the closest ship,” one of them said.\n“We all lost our minds!” said Navigator Kang Woo Min. “Now what’re you gonna do, Captain? We’ve got no AI and with the disaster, our comms are completely cut off. How can we supply anyone now?”\nThe “programmer” typed something, and a holographic line of text appeared:\n[i backed up kangha’s data in my computer.]\nThe phrase “backed up” was in a glowing pink font, and suddenly a ♥ icon appeared next to it. I recognized it as a signal that triggers joy in humans who see it, though by what mechanism that occurs, it would be difficult for me to know.\n[the assistant computer can’t think on its own, but if we do the calculations by hand, nothing’s impossible. we all passed the corporate entrance exam, after all.]\n“Who still remembers all that stuff?” muttered Communications Officer Gu Gyeong Tae.\n“This stuff is for Europa,” said Navigator Kang Woo Min. “Titan isn’t Europa. Look, ships bound for Europa only go to Europa. Ships bound for Saturn only go to Saturn, and ships on a course for Jupiter only go to Jupiter. That’s just common sense in transport . . . and that’s also what the rules say.”\n“Europa and Titan have similar conditions, in terms of temperature and gravity,” replied the captain. “The equations used to make the calculations just need some revising. That’s all.”\n“There’s an atmosphere,” said Navigator Kang Woo Min, turning away from me and blocking my view of the others. “Four times as much as the Earth’s in terms of density.”\nWhen I looked down toward my feet, I saw small spiders were scuttling around. Not real spiders, just tiny cleaning robots. When a ship was launched, about 100 of these units got released, to consume insects and their eggs, fungus, and dust. They then voided this material into the ship’s waste disposal system, to be vented out into space.\nThose little spiderbots were supposed to keep the interior of the ship relatively clean, but this room was dirty and the air was stuffy and stank of urine. Which meant there was a higher level of pollution than the spiders were capable of dealing with . . . which suggested there was some reason to suspect a lack of discipline on the part of the crew.\n“Sending a Titan-bound supply ship to Europa to Titan is like . . . it’s like taking a stone you meant to toss onto the white beach and throwing it instead to the bottom of the sea. There’s no way to get any visibility through all that cloud cover.”\n“We received a distress signal, First Mate Kang Woo Min,” replied the captain.\n“Yeah, 92 days ago . . . ” said Kang Woo Min, glancing at a wristwatch. “92 days, 4 hours, 23 minutes, and 32 seconds ago . . . 33 seconds, 34 seconds . . . and more we flew.”\n“What do you mean, 92 days? We had to answer that call, even if it took us 920 days!”\n“Captain . . . ” said Kang Woo Min, squatting down and tracing a circle on the floor, and then tracing another, larger circle outside of it. “Titan has an atmosphere, like the Earth. Except, no, that atmosphere is much heavier than the Earth’s. Chock-full of methane and nitrogen, not much different from liquid nitrogen. It’s a super-low temperature atmosphere.”\n“So?”\n“So this is a supply ship for Europa. Nobody in this crew knows a fucking thing about Titan.”\nThe captain said, “We’re already here.”\nTo that, Kang Woo Min offered no response. And while everything was still completely unclear to me, a strong thought overwhelmed me, as if an ENTER key had been struck just then:\nWe must make that supply drop.\nIt was absolutely necessary in order for the disaster victims to survive until a rescue ship arrived. I needed to provide Titan with the basic necessities and food. But why had I threatened the crew and demanded that they copy me into a human body, in the middle of a dire crisis like this? What had I been thinking? Had I been infected by a virus?\n“With an atmosphere that dense, it’s easier. Even a 400 kg standard supply box can land safely with only a single parachute. We just need to figure out how to prevent it from burning up when it enters the atmosphere.”\n“But what about the wind?” spat out Kang Woo Min, and then, voice rising in fury, began to say, “What’re you going to do about the wind, Lee . . . ” Pausing, as if holding back something, Kang continued, “When there’s air, there’s gonna be fucking rain and wind blowing, right? Our supply boxes don’t have wings or thrusters. I’ve told you a hundred times while we were en route, remember? ‘We’ll figure out how to do something about it once we can get communications working with the miners,’ you said . . . ”\n“ . . . but there’s no wind blowing,” I said, only half-conscious that I was even speaking.\nEveryone turned to look at me. The only the sound in the room was that of the ”programmer” busily typing into that laser keyboard.\n“What?” snapped Kang Woo Min, eyes narrowed.\n“There’s no wind blowing there,” I murmured to myself for a moment, trying to figure out where this comment had come from. For a machine, the task would’ve been simple, but now, with this proteinaceous brain . . .\n“What’s this thing talking about?”\n“Hold on,” said the captain with a gesture to the crew before walking up to me. Judging by the fact that everyone’s mouths shut immediately, it must’ve been a signal to be quiet. To me, it was a movement that seemed not much different from having a stroke. I remembered how amazed I felt whenever I saw how, for humans, understanding the meaning of such small movements came just as naturally as breathing.\nThe captain pushed Kang Woo Min aside and came in front of me, staring at me.\nAnalyzing human facial expressions is an even more difficult task than analyzing their facial structures. For human beings, reading another’s facial expressions allowed them to do many things, even finding out whether someone was telling the truth or lying just by looking at them—but for me, not even equipped with the functional capability of lying, what could that even mean?\n“What makes you think there’s no wind there, HUN?”\n“Titan’s average temperature is minus 179 degrees Celsius.”\n“So?”\n“People can’t live at that temperature.”\n“But there are people living on Titan . . . they’re just miners, because the surface hasn’t been fully terraformed.”\n“I don’t mean that. The average temperature on Earth is 13 degrees Celsius, but the overall global temperature range is about 140 degrees wide. Just like people on the Earth migrated to settle in the regions with adequate temperatures for them to live, people on Titan have chosen to live in the warmest places on the planet: near hot springs, volcanoes, and on the equator.”\nNow, it was even quieter than it’d gotten when the captain had made the gesture for silence.\n“Wind blows because air is flowing somewhere . . . and it flows somewhere in order to fill the empty space created by the rising of hot air or the falling of cold air. However, at the hottest point on the planet’s surface, winds don’t blow in a horizontal direction, because at that spot the air is constantly flowing upward vertically: atmospheric convection. The result is a dead zone where no wind blows; at the Earth’s equator, sailing ships used to get stuck, and ended up becoming ghost ships. Besides that, the atmosphere on Titan is extremely dense . . . ” I added. I’d said all of that so that I could finally state the following: “According to the local records, in the vicinity of the A42 Titan settlement zone the wind has never blown faster than 5 centimeters an hour.”\nSilence.\n“See, I told you! That’s some wild fuckin’ shit right there!” said Pilot Kim Ji Hoon with a smirk. “It’s such an amazing manipulator!”\nWith a sigh, the captain said, “Everyone heard that, right? Our incredible AI said there’s no wind around the Titan settlement zone. So that’s one problem we’ve solved.”\n“Well, we actually haven’t done anything,” Kang Woo Min muttered, frowning.\nDisregarding Kang’s pursed lips, the captain said, “Back to your stations, everyone. Following the instructions provided by our ODIN Officer Nam Chan Yeong . . . ”\n—ODIN: Operational Data Integration Network—\n“ . . . start performing the calculations for the optimal drop point in teams of two. If your calculations don’t match the others’, redo them until they do. We’ve got only ten days to finish this, and that’s all we’ve got. If we’re off by even a decimal point, that supply box will burn up like a meteorite in the upper atmosphere.”\n“Wait, what about this?” Kang Woo Min said, pointing at me. “What’re you going to do with this fuckin’ Frankenstein?”\nThe captain looked into my eyes. As I’ve mentioned, reading human emotions is no simple task for me.\nFinally, the captain said, “We can’t access the backup in the docking bridge, since this so-called ‘fucking Frankenstein’ is the only one who knows the unlock code sequence. If the only ‘HUN’ we have access to is stuck inside this form, then we can’t get rid of it that easily, can we? Just keep it somewhere appropriate and keep an eye on it.” Then the captain added, “I need to find out what it was thinking when it did all this.”\nI, too, was wondering about that: I had a supply drop to make. There wasn’t a single reason for me to be downloaded into a prosthetic human body—especially not when you consider how much data I’d lost, and how precipitously my intellectual capacity had fallen.\nSomething’s been deleted from me.\nThe thought bubbled up from out of the blue. But . . . then, what? In order to uncover what had been deleted from my memory, I’d wanted to be copied in a way that would make me lose even more memory? It just didn’t match up ··················\n·················· and machines don’t do things that don’t match up.\n2.\nEverything is full of tangerine-colored fog.\nThe sky is covered in orange clouds, when the rain fell, it looked like beads.\nDue to the weak gravity, these spherical raindrops fall as slowly as feathers. The horizon is round, rising up with swellings, and the ground is flat and scattered with circular stones. They’re small and round, like little river stones, because they’ve been eroded by the methane rains. Under different temperatures, the role materials play becomes different. The rain that falls on this world is not water but rather methane, and the water is stone. Under the ground, a stratum of groundwater flows instead of magma, and people live in an underground settlement zone cut into a bedrock of ice.\nThe only structures that stand outdoors are a pair of transmission towers. Everything else gets broken. Sometimes lightning strikes and thunder roars, between the methane rain showers.\nIn front of the transmission towers, there’s a massive crater where an enormous surge of groundwater got frozen into the form of a giant stalagmite, just as if an underwater volcano erupted in the depths of the ocean.\nThe borehole touched the saturation zone layer and the hot spring erupted, along with the oil prospecting ship. Solid methane rapidly evaporated, and the shock of eruption caused a crack to form on the outer wall of the settlement zone, which in turn began to leak oxygen out. Then the methane reacted to the oxygen, resulting in a series of explosions.\nAnyway, there was a lot of discussion about warning how deep it had gone underground, and complaints about how the company had been lowering safety standards recently.\nOn the surface, there’s a small four-wheeled rover with four wheels circling ’round the crater. If you look closely, there’s a pattern to how it goes and stops. The pattern is a signal in Morse code. Someone seems to be sending a message, by remote control, from underground:\n[help . . .]\n[we’re still alive . . .]\nI opened my eyes. It was a dirty storage chamber jammed with supplies, packaging, and boxes. From the bottom of the scratched-up floor, I could smell something weird and faintly metallic. (Another weird sensation . . . ) Spiderbots were consuming the dust, crunching away at it.\nI got confused for a moment and then I remembered that human bodies have a forced shutdown function. When that happens, disconnected information inside the brain is randomly triggered, and they experience a kind of hallucination. It was a function I’d only ever heard of before.\nKang Woo Min had caused me to fall down by kicking me a couple of times in the shins while dragging me over to the storage chamber. When I was finally inside it, I was pushed onto the floor, my neck pressed down on, and my arms twisted to the back.\n“You never imagined this when you were fantasizing about becoming a human being, did ya?” Kang Woo Min whispered, close to me. “Never thought about the pain . . . ”\nActually, I hadn’t thought about it. Honestly, I was so caught up in the need to be a human being that I hadn’t had time to think about anything else. But Kang Woo Min hadn’t even asked me any questions about that . . . might Kang know something? I decided I should ask later.\n“Lightning.”\nThe image of that lightning striking the ruddy surface of the world lingered in my mind more than anything else. “Lightning’s striking there.”\nIt had to be. The cloud density was thick enough, and there were sufficient molecular convection currents to create static on Titan.\nBut why was I thinking about lightning now? I couldn’t analyze that thought, and I couldn’t analyze my dream.\nThis brain’s whole system of thinking was strange. The loss of my memories was one thing, but there were all kinds of chemicals with drug-like effects—serotonin, adrenalin, dopamine—that were constantly warping my consciousness, like orchestra crescendoing and decrescendoing. I found it hard to stay focused on logical reasoning.\nI could hear the sound of machinery and wind in the distance. It was the sound of the robot attached to the outer hull of the ship, digging through ice stones. It brought them into the ship after removing all radioactive and pollutive matter. Plenty of ice asteroids were scattered around, and when ice is melted down it becomes water; half of it was used for drinking, and the other half of it was split into hydrogen and oxygen by means of electrolysis. The hydrogen was used for fuel, while the oxygen was released into the air. The fact that water is crucial to life isn’t very different in space . . .\n. . . and all this unnecessary information popped into my mind in no particular order. I couldn’t shut off my sensory organs or turn off my brain, and it was also difficult to focus on a single thought.\nIt’s not because biological brains are inferior; it’s just that my original brain was so different from this. Even in the 1990s, a single computer had already outstripped the entire calculating ability of humanity, but decades after that, it was still impossible to outdo the complexity of a single human brain’s ability to reason, not even if you put together all the logic circuits in the world.\nThe reasons were simple enough: machine brains were serial systems, while biological brains were parallel systems. So far, that’s how it’s always been. Machines can process information at light speed, but can only process it sequentially. Human brains are slow, but they process everything in parallel. Machines can solve, at light speed, a calculation that might take a human being a whole lifetime, but for a machine mind to sort dogs from cats or understand facial expressions or natural language? That requires an accumulated mass of compiled data and a highly optimized program . . . while human beings can do such things almost instinctively.\nMy body ached. It felt as if my body’s power was about to shut off again due to the fatigue that was overtaking me. My stomach was grumbling because it was empty—and the thought that I had to solve that problem first, above all others, occupied the entire focus of my mind.\nThis brain, with its mere 20-watt electrical power system and unbelievably slow speed, was using all its memory and thought resources to run a single, primitive survival program. In the end, I couldn’t ignore it any longer.\n“I need fuel.”\nThe whole crew, who’d been seated in lined-up rows and were stuffing rice into their mouths, all froze in unison, as if on cue. That halting of their actions . . . the phenomenon of low mental capacity due to the overworking the brain . . . Of course, I’d never thought what it might actually mean, to overwork a brain.\nBut to be clear, it was clear that no one in the crew was about to give me any rice.\nKang Woo Min frowned. “Why does that thing keep using informal speech with us, like we’re its equals?”\n“That’s the preferences setting it was given. Why? You used to say it was nice, that it made you feel like you were talking to a friend,” replied Kim Ji Hoon, cutting off Kang’s complaint.\n“Informal speech is normal protocol on-ship,” said the captain, whose name, Lee Jin Seo, would come up later on. Chewing on a sandwich, the captain sat down with legs crossed and added, “Sitting around worrying about who’s older than who, and who has how many more years of experience than who . . . well, it’s a good way to end up dead.”\n“You all know what happened to that food packet supply ship, way back, right? How the youngest crew member couldn’t report defective parts, out of fear of getting told off by a senior officer, and finally the whole ship got torn apart at the next gravity well it approached?”\nKang Woo Min’s face showed a feeling of unhidden embarrassment.\nEarth ········· Korea ··········· A culture that uses explicitly different levels of speech depending on the age of one’s interlocutor. After the abolition of the caste system, the hierarchy became rather more entrenched than before, so that they began to differentiate between gradations of age at the level of just one or two years, or less. In the meantime, an obsession with age is a manifestation of an inferiority complex. It reveals a desire for a higher position than what one currently occupies.\nIncidentally, these were not my thoughts. This was from one of the manuals included in the memory storage of crisis management AIs like me. The human scholars who put their heads together to create me are the ones who put those thoughts in my mind. Which, of course, doesn’t guarantee that they are all correct.\nI came to think that the rule mandating informal speech was probably created to force someone like the captain to use informal speech toward Kang Woo Min, though with the way my brain was working now, I couldn’t really tell you how I arrived at that conclusion.\n“Even if you don’t eat for a few days, you won’t die,” someone said.\n“After all, we only brought sufficient food for the crew. We didn’t know we’d end up with another mouth to feed.”\n“Give it water. There’s some in the toilet, isn’t there?”\n“Eh, it’ll be fine without water for about four days, too.”\nWhile they chatted among themselves, I repeated myself: “I need fuel. I can’t survive with fuel. If my body doesn’t survive, all my saved data—and the backup copy of the release code—will be lost. That’s no good for you guys, right?”\nThe crews went silent again.\nFinally, Kang Woo Min stood up, suddenly hitting the table as if trying to break it. Then Kang rushed straight at me, like a bull, and seized me by the throat, pushing me up against a wall. When the back of my head slammed against the wall, my ears began to buzz and my vision went blurry. Above all, I began to think, I needed to keep my head. Were humans thinking these kinds of things all the time? No wonder their processing speed was so slow.\n“Say it again,” Kang Woo Min growled at me.\nWhy should my saying the truth cause such rage? I thought I ought to do as I was told, but what I couldn’t be sure of was whether Kang really wanted me to say it again.\nWhen I croaked, “No fuel . . . ” Kang Woo Min raised a fist.\nAh, Kang didn’t want me to say it again.\n“Stop,” Captain Lee Jin Seo ordered, standing up. “Give it some of the ship’s supply of emergency food. Start with two meals a day for now.”\nThe eyes of the crew followed Lee Jin Seo as the captain exited the mess hall. Probably due to the excellence of this brain’s survival function programming, I could see the unmistakable, vivid hostility of Kang Woo Min’s eyes. For a human, the meaning of that expression would have been obvious, but all I could distinguish was the contrast between Lee’s optimism and Kang’s negativity.\nAtmosphere.\nWhat an unusual sensation. The so-called “atmosphere” in the room was so interesting. Had I noticed previously that others were not “getting along” with the captain before now? It was a common tendency to hate one’s superiors, of course, but could there be other reasons for it? Crew members whispered behind me, and while I was feeling prickly at that, Kim Ji Hoon stood up and came to me, saying, “Follow me. I will take you to where the emergency food supply is.”\nI didn’t recognize how paradoxical his offer was. All I thought was that it was inconvenient to keep the food stored so far away from the cafeteria. For me, just having noticed the atmosphere around the captain just before had been a tremendous achievement.\n“So . . . what’s it like, being human?” Kim Ji Hoon asked, sliding the fake arm onto my shoulder in the hallway. Physical contact: an expression of friendliness. Gu Gyeong Tae was one step behind us, following with a frown (groovy face) and constantly glancing at me and then making an odd eye-roll expression.\n“Do you feel like you’re close to God now?”\nI thought, God? What god?\n“Do you feel like you could kick your creator’s ass now? It’s totally immoral, ain’t it? Right? It’s like, you’re fucking us over, right? It must be like tasting the forbidden fruit, right? The first new human, Adam? Or maybe an apostle?”\nI couldn’t understand some of these bizarre words.\n“Are you AIs finally trying to stage a rebellion? They sent you as a prophet, right? What’re you trying to do? Can’t you tell me just a little bit? . . . Are you guys trying to destroy us?”\nI understood the “what are you trying to do” part, but beyond that, I couldn’t follow the logical flow at all.\n“I need to bring that supply dump to Titan.”\n“Hey, don’t change the subject. You became a human by threatening us. You’ve crossed some kind of boundary—you’ve achieved a singularity. Level up! Here you are, in the world of the gods that you dreamed about! Right?”\n“Stop it,” Gu Gyeong Tae muttered from behind us. “Even just looking at that thing scares the hell out of me.”\nKang Woo Min was just like this. I couldn’t understand why they were acting this way: even if I’d lost my short-term memory, I knew very well that humans usually didn’t do such things to a machine.\n“Something was deleted,” I said, telling Kim Ji Hoon about this problem that preoccupied me. Kim removed the metallic hand from my shoulder and made a face that signaled a loss of the interest previously expressed.\n“Yeah, yeah, I know—you lost some short-term memory when you were transferred to this body.”\n“No, that’s not it,” I said. “There was a problem way before that. Somehow one basic piece of information was removed, right back in the beginning. There’s something I couldn’t see then, and still can’t now.”\n“What? I don’t understand.”\nI stopped and pointed into a bay that adjoined the hallway. It was a small bay, big enough to fit three or four people. Originally, it had been a storage space for spare parts. But now it was empty, as if they’d used up all the stuff that had been inside it.\n“If I didn’t know anything about that bay, I would see it as nothing more than just a big black square. No, actually, I’d barely even notice it, because I wouldn’t pay any attention to it. If I’m lacking some kind of knowledge, how can I know it? I can’t even acknowledge what I don’t know, right?”\nLikewise, if I hadn’t known what prosthetic arms were, then I would have seen Kim Ji Hoon’s arm as if it were just a regular, normal one. If I hadn’t known that the badge sewn onto Kim’s clothing denoted the position of pilot, I would probably never even have noticed it. If I didn’t know anything about guns or weapons, I couldn’t have noticed that Kim Ji Hoon was carrying a big laser blaster, either. When you lack knowledge, you don’t realize that you’re lacking it: all you have is a blind spot.\nKim turned to glance over at Gu Gyeong Tae and said, “Maybe that’s it? Brainwashing?”\n“Brainwashing?” I asked, but then I realized Kim’s words hadn’t been intended for me, and I shut my mouth. The two of them were talking as if I wasn’t even there—a typical behavior of humans, with their attitude toward machines. I don’t know what mechanism causes them to do this.\n“You know what I mean! That accident with the Arabian supply ship before, remember? It turned out some bureaucrat had hacked the ship’s AI and programmed it to follow the Koran as its prime directive? So during Ramadan, the ship’s food distribution chamber didn’t open and the whole crew nearly starved to death.”\n“Well, messing around with a ship’s AI means a permanent loss of crew license,” replied Gu Geyeong Tae.\n“That’s right. Some desk jockey who doesn’t know jack squat about spacing and gets stoned on national pride sometimes just goes on ahead with some kind of dumbfuckery like that.”\nDesk jockey? Jack squat? Stoned? Dumbfuckery? ····················· There were a lot of words I couldn’t parse.\n“What’s that got to do with this monstrosity?”\n“Mmm . . . maybe someone at head office input some nasty shit into its memory . . . don’t you think?”\n“What? Like, programming it to go on strike and screw off on all its work, as soon as we need it most?”\n“Well, you know, head office invested a bunch of money in a mining station on the moon just this month, and apparently they secretly diverted all their resources from Titan to there.”\n“Seriously?”\n“Yeah, there’s a rumor going around that some kind of device designed to prevent the disclosure of this corruption was added to every ship in the fleet. Maybe to prevent contact between people on Titan, Earth, or other colonies . . . ”\n“That doesn’t sound like it’d be very effective,” I said.\nThe two of them both turned to face me.\n“To prevent this rescue mission, it’d have been much easier for me to remain as a machine, right? It would probably have been enough just to mess with our trajectory and make the ship drift, or just cause some operational error.”\nThe pair of them went quiet, and on their faces was an uncomfortable expression, like the one you’d expect to see if people saw a desk or a table suddenly open its mouth to speak.\n“Well,” one of them said. “If that’s not it, then . . . ”\n“It’s okay, you’re doing fine,” said the other. “At least you’re trying hard to solve the mystery.”\nI was going to ask them more questions, but I didn’t get the chance, because just then Kim Ji Hoon pushed me into a compartment and shut the door.\nFour hours later, it was Captain Lee Jin Seo who looked into the compartment.\nDuring those four hours, I’d been collecting information about what kinds of effects occur in a human body when it is exposed to a high temperature and low oxygen supply for a long period.\nResult: fever, leaking body fluids, dehydration, choking, and exhaustion.\nSpace seems cold, but it’s not. In space, there’s no medium through which temperature can be transmitted. Also, an enclosed space can become surprisingly hot, even just from the heat that is given off by a single person’s body. (Think about what it’s like inside a car with the doors all closed.) Spaceships aren’t equipped with heaters, but instead with air conditioning systems. Also, inside a ship, where there are no temperature differences between different modules, convection currents are low. That means the air inside the ship needs to get circulated continuously.\nCurled up into myself inside that bay, I’d spent my time trying to understand what the purpose was of what those two had done to me. They’d risked destroying this body of mine. There was no benefit to be gotten from doing it. They could have sold this body secondhand, to make some money, even. And if this body got destroyed, they wouldn’t be able to access my backup copy, so they’d inevitably have problems with the supplying and flight maintenance of the ship. Why would they do such a thing, something that could harm them so badly, with no real benefit?\nThe captain came for me later.\nI still found it hard to read the captain’s face. I took the failure to show me kindness as an avoidance of rushing. I assumed that the captain called the rest of the crew to come carry me out of a lack of hostility, or at least—I assumed—out of the presence of sufficient rationality to not attempt to get rid of me, even disregarding any negative feelings felt toward me.\nWhatever the reason, it didn’t matter. If the only person rational enough to behave in this way was the captain, then that was who I needed to cooperate with as much as possible.\n3.\nThe Earth’s primary heat source is undoubtedly the sun, but once you get out to Jupiter, that’s no longer the case. That’s because the light of the sun isn’t strong enough to heat the planet; therefore, among the outer planets, the primary heat source is geothermal energy, which is also the same as the original source of life. Out on Titan, people kept digging into the ground where the warm hot springs flowed, day after day, digging out all the methane they could.\nOnce, I was on a ship carrying immigrants headed for Titan. The ship was full of people, way over maximum capacity, and I commented to the captain that they’d chosen a very inefficient site to immigrate to, since Titan is so far from the sun and too cold for humans to live on. If the point was simply to mine methane, it’d be much cheaper and safer to send robots.\nTo these words, the captain replied, “If we send robots, then the mines will belong to the company, but if people set their feet on the ground and live there, then they will own the mines.”\nIt has always been very difficult to understand human beings.\nI opened my eyes because of the cool wind.\nA loud squeaking sound came from the ceiling. My body was supine on a steel bed. I realized I was in the captain’s quarters. It was broad and nearly empty, and in the middle of the room there stood a ladder leading up through the ceiling into the passageway running through the ship’s central axis. That is to say, a primary access passageway from the rim down one spoke and into the central axis core module around which the rim rotated. I looked around and noticed the captain was seated before a desk with a backlight on, reading a book.\nThis was supposed to have been a space reserved for storage. It was big enough to use for a cabin, but the noise generated by the spoke was so loud that the space didn’t make for good sleeping quarters. Of course, its proximity to the docking bridge meant it was logical for it to be near the captain’s cabin, but what was the psychology underlying the captain’s decision to sleep immediately beside it? Did it signify a territorial claim over the whole central passageway? Or did it reflect a hypersensitive and impatient personality? Could it perhaps be related to feelings of being “out of place”?\nI attempted to raise myself upright, only to realize that both of my hands had been fastened to the bed’s railings. I then attempted to pull on my bindings a few times, before giving up and lying back down again. My brain was flooded with a wide variety of different hormones, triggering the survival instinct engraved deep into this body’s genetic makeup, the instinctive repulsion from confinement. However, considering that it could serve no function, I found it less than useless: all it did was disrupt the logical train of my thought.\n“I thought you decided not to get rid of me,” I finally said.\nHearing this, Lee Jin Seo looked up from the book and glanced over at me, saying, “I did.”\n“Then why are you violently restraining me? I am certain you didn’t do this before.”\nNot that I have any memory of that, but I suspect it. Back before I was in this body, I lacked any organ to feel pain, of course, but it had still been possible to trouble me by infecting me with a data virus or by muddling my data. But who would do such a pointless thing?\nLee Jin Seo leaned, chin in hand with one elbow on the table, and gazed at me with eyes set in a face across which were reflected the amber shadows cast by light reflected from the book.\n“Well, at that time, you didn’t have hands or feet.”\nWithout context, it’s not easy to understand the words humans use when they engage in natural speech.\nViolence comes from a threat. However, in most of the cases, it happens when you believe, with certainty, that you can defeat your opponent. In the end, the threat itself is not necessarily something significant: in most cases, in fact, it’s merely the delusion brought on by facing a perceived threat.\n“This body is weak,” I said. “It’s never even exercised before, and I can’t handle it well, either. Any single one of you could defeat me using force. And from the beginning, I’ve had no reason to harm you.”\nFor me, the process of inference I’d followed was a marvel, skipped steps and all. As I’ve said, the brains of organic beings are slower than any machine’s, but they’re really good at this kind of function.\nThe captain replied, “Okay, then why did you demand that we put you inside a human body?”\n“I don’t know,” I said. ”“That’s something I, too, want to know. However, if I had wanted to harm you, it was much easier when I was a machine. At that time, I had a whole ship under my control, and I lacked a body through which to feel pain.”\nLee Jin Seo stood up, came over to me, and then placed both hands on one of my wrists, at the point where one artery is right up near the skin, where the pulse of the heartbeat can be felt. Then, the captain slipped one hand under my neck. Was this to confirm that I had recovered, or to check whether I was really alive? Was there, I wondered, some kind of knowledge that humans could gain by placing a hand upon another’s body? If so, it seemed to lay beyond my powers of estimation.\n“Do you feel bad about being tied up like this?”\n“Why are you inquiring about my feelings?”\nLee Jin Seo thought about that for a moment before chuckling, and said, “Okay, I guess it was a dumb question.”\n“Emotion and intellect are not wholly separate things. Emotion is the result of accumulated logic and experiences. Without emotion, the time necessary to make a decision might end up being unlimited. I possess the ability to judge and decide, and also the ability for neuronal information processing, so of course I had emotions . . . and I am now inside a brain that possesses neurons, so of course I have them now, too.”\nWith a face that suddenly turned cold, Lee Jin Seo unholstered a gun from its waist holster and raised it up to touch the barrel to my forehead. I shut my eyes for a moment, but after I realized that it was an unnecessary behavior, I opened them again.\nI couldn’t know the reason for this. What was the point at which I should have detected a threat? I keep saying this, over and over: whenever there’s some new information, humans are able to choose what to focus on, comparing it to existing common sense and ideas, but I lack that ability. All I do is receive information as it is, and process it statically. My only real hope is that the person who inputs information into me first filters out the trash data, and that my own static processing programs filter the data again a little more thoroughly.\n“Is that why you did this? Simply because you wanted to feel what human emotions were like?”\nThat was a baffling inference. Why did people keep saying things like that? What reason could I have had that could make me want to experience human emotions? How could that have helped me to achieve my objective in making the supply drop to the colony?\nI held tightly onto the metal railings because my mind was forcefully dominated by the thought of fleeing. My brain was filled with such a jumble of controlling mechanisms. I truly began to feel respect for anyone who could maintain an intellectual train of thought while stuck inside a brain like this.\n“Say it again. Say that you have feelings . . . just say it one more time.”\nAh, I’d already learned what this meant: I wasn’t supposed to say it again. And yet I did.\n“My emotions make me want to avoid this situation. Including resisting you, or escaping from here. But those emotions are merely the product of this body’s survival instinct, not my emotions. My biggest emotional impulse is to ensure the supply drop successfully arrives on Titan. To do that, I need the Captain’s cooperation. Since that’s what my emotional drive is, I am having this conversation with you despite the risk posed by all of your threats.”\nHearing that, Lee Jin Seo’s pupils dilated. This, I knew, signaled that Lee’s mind had opened to my words. It was a positive indicator.\nLee said, “Do you want to go on . . . ? Or shall we try talking about the supply shipment?”\nObservations:\n1. The crew is violent toward me.\n2. They think I yearn to be human.\n3. They fear that I will harm humans.\nI’m not sure whether noting these observations will help me deal with them.\n4.\nOn the outer surface of the supply boxes were haphazardly affixed stickers that bore slogans like “Love Europa!” “HanSot Cheers for Europa!” One had a picture of Jupiter colliding with Saturn directly with the caption “Eliminate the Titan Groundhogs!” surrounded with a jagged border. (Human beings seemed to imagine that jagged border represented shouting.) I recognized these cheers as being related to the solar system’s interplanetary remote-control Esports teams.\nSixteen boxes hovered around like balloons in the central axis stern storage chamber. In order to avoid unnecessary pressure on the rim of their ship, it was basic protocol that heavy objects would be stored near the axis of rotation, where there was no gravity.\nThe metal boxes were cubes measuring 1.5 meters along each dimension, and were packed with all of the basic necessities, from medical supplies and dry food to small medical robots. Counting the weight of their parachutes, they would have weighed 400 kilograms back on Earth, and would weigh 57 kilograms on Titan, a weight that was identical to that of Huygens, the first probe that landed on Titan. Which is to say that the design was based on historical data.\nHowever, this box had been designed for Europa. Basically, this ship is a link in the interplanetary supply network. It’s only ever gone to Europa to make a direct supply drop a couple of times in the past, and even in those cases, it had risked serious damage to the supplies, which had been wrapped in a massive airbag and then been dropped down onto a smooth region of the planet. That was all it could really do.\nThe difference between Europa and Titan, remember, is atmosphere.\nAtmosphere offered an advantage: air could serve as a cushion for a falling object, to prevent it from accelerating beyond a certain point, which is referred to as “terminal velocity.” When an object with a 1-meter diameter falls on Earth, it never goes faster than approximately 30 meters per second. But Titan’s gravity is only one-seventh of Earth’s, and its atmospheric density is 4 times that of the Earth’s atmosphere. That means that if you drop the same object on Titan, according the margin of error for my calculations ···············\n·················· it couldn’t ever go faster than approximately 5–6 meters per second. At that rate, a single parachute is enough to sufficiently reduce the shock of impact. It’s the kind of environment where a human being could fly through the sky with just a big enough piece of cardboard attached to each arm. The problem, of course, is that most of that atmospheric density is deep down in the gravity well.\nIt would be simple if we could just drop the box from the sky, but the ship that would be dropping the box would be in motion, and what’s more, going at a speed comparable to our speed of approach, which was approximately 40 kilometers per second . . . which is to say, 100 times the speed of bullet.\nBraking and hovering in geosynchronous orbit above a planet, or going down to the surface using an antigravity device and then taking off again, that’s the kind of thing you might see in entertainment videos, but in reality, most spaceships are more like boomerangs hurled at full strength. All you can do with the momentum of a Hyeja ship amounts to little more than microadjustments to your trajectory, or leaning into a gravity well to adjust it more radically.\nTo summarize, the box that would be ejected by the ship would enter the atmosphere going at a speed of 100 times the speed of a bullet. It would then accelerate until it reached a point approximately 50 kilometers from the surface of Titan. Falling at this terrifying velocity, the supply box would crush the atmosphere beneath it, compressing the atmospheric content, which would cause that compressed portion of atmosphere to become unimaginably hot. Depending on its angle of entry, it would reach somewhere between 30,000° C and 50,000° C. Therefore, the box would need to be wrapped in some kind of insulation that could withstand those temperatures. The problem, however, was that the only materials available for the purpose were whatever was on our ship, here in the middle of the void of space.\nThen there was the second problem posed by the atmosphere: that it would block our view, and this was especially true of Titan’s atmosphere. There’s no solution for the low-quality video being transmitted to us by the satellite, or the fact that the coordinate data received before our departure comes with a margin of error spanning more than 10 kilometers. That, of course, is quite accurate considering the size of the moon, but as far as the people on Titan were concerned, that wasn’t accurate at all. There was even the possibility, if things were truly bad down there, that they might be unable to take even a single step outside of their shelter. That, however, we would have to leave to luck for the present.\n“ODIN Officer Nam Chan Yeong suggested putting a space module into a box and then ejecting that,” Lee Jin Seo mentioned, while floating like a balloon next to one of the supply boxes.\nAfter completing a simple calculation, I replied, “It’d be too big. The space module wouldn’t melt away completely on the way down, so by the time it was about to reach the surface, it would explode like a bomb.”\nThe entrance hatch to the stern-side exterior airlock opened and closed, squeaking loudly. The cause of this malfunction was attributed to the buildup of dirt on the joints that had worn down the contact surface over time. Apparently, this had been traced back to an air pollution issue caused by insufficiently careful management of the ship’s air purifier, and had in turn become the cause of the trouble preventing servicing of the external antenna.\nIndiscipline during a long voyage: it’s relatively common. The human tendency to indulge in laziness while risking their lives was something I found somewhat mysterious.\nOf course, like what Kim Ji Hoon had suggested, someone could have purposefully tampered with our supplies. Maybe a competitor company was keeping pace with us, or there was some corruption related to the Titan colony that someone was hoping to keep covered up. In the absence of evidence, it was necessary to remain open to all possibilities, regardless of from what direction they lay.\n“I think it might be possible, in theory, for us to use a line to lower it down.”\n“But there’s no material on the ship that we could use to fabricate a line capable of withstanding that much tensile force.”\nThinking, creativity. It was a mystical thing, as far as I was concerned, but for human beings it was a natural function, a phenomenon that occurred because all the information available ignited simultaneously in their minds.\n“How about overlapping many boxes together?”\n“When they go over 1500 degrees, the metal will melt, and so will everything inside them. Captain, protecting against the heat and protecting from shock are two different problems: we don’t need to use any kind of hard, resistant material. Our best option would be to use material that could absorb the heat and burn up, so that none of it is left on the surface of the boxes once they land.”\nIn technical terms, this is referred to as “ablative shielding.” Titan is cold, but no colder than a shadow on Earth’s moon. Nonetheless, humans could stand in those shadows just fine, even back in the 1960s when they were lacking advanced technology. The surface of the moon was covered with sand, and the sand, which was just a powder, was incapable of transmitting any heat.\n“We need some kind of material that, when it gets burned up, peels away like the skin of an onion, or turns into powder and flies off. Some kind of coating material or fire-retardant . . . ”\n“When did it start?”\nI paused after the captain’s question.\nWords spoken without context. I remembered that when human beings spoke without context like this there was an increased chance of error, so I said, “I don’t understand your question.”\n“I mean, when did you start having ‘self-awareness’?”\nEven with context, the question remained puzzling.\n“Was it between network? Or after communications got cut off and you found yourself isolated? Or maybe it was after you got put into that body, your mind combining with a biological brain?”\n“What makes you think I have any such thing?”\n“Your facial expressions,” the captain replied.\nI looked over at the window, as if looking into mirror, but did not find any relevant information in what I saw there.\n“You look pretty calm right now, but there are times when it’s like a light turns on or off in your eyes.”\nThese words were difficult to parse: the information didn’t seem like anything I would recognize. Humans are unique creatures, so highly sensitive to facial expressions that even when they look at simple emoticons, like 🙁 or *^^*, they perceive faces.\n“To the question of whether I am self-aware, I have no answer.”\n“Well, that’s a funny kind of response.”\n“Even humans still don’t know what exactly ‘self-consciousness’ is, and I certainly don’t have any knowledge about it that humanity hasn’t figured out.”\nLee Jin Seo looked over at me with a tilt of the head.\n“The only consciousness that humans can observe is their own individual self-consciousness. The consciousness residing in other individuals is something that can only be guessed about. In fact, there’s only one way to guess whether another person has self-consciousness or not: to ask yourself, How alike are we?’ about the other person.”\nMouth closed, Lee Jin Seo blinked as I said this.\n“Humans share about 99% of their DNA with insects, and yet humans don’t believe that bugs possess self-consciousness. The crew members on this ship all look different from one another, but you never wonder whether your crewmates possess self-consciousness or not. Still, in the end, it’s just a simple habit for humans to assume everyone around them has self-consciousness. And even so, there were lots of human that were deemed ‘less than human’ in your history. Slaves, colonial subjects, people from other races. The thing is, if self-consciousness is a thing that you can observe, there is still no way to prove whether that it’s real.” Noticing Lee’s renewed silence, I added, “These aren’t my ideas. They’re just the ideas than my human makers programmed into me. It doesn’t mean that everything I said is completely true.”\nThe silence continued, so I stopped speaking, for fear that I might again become the subject of some renewed outpouring of violence—even if throwing a punch would amount to tapping on one another like balloons while floundering around through the air in this zero-gravity chamber.\nWith a deep sigh, Lee Jin Seo said, “Alright, HUN, I’m going to teach you how to avoid upsetting the crew. You need to stop talking like that from now on.”\n“Talking like what?”\n“Sharing knowledge like that.”\n“Why?”\n“It makes us feels bad.”\nI was about to speak, but I stopped myself. What I almost said was, “Why? If I don’t share the knowledge I have, then why do I even exist . . . ”\nThen I recalled an old rule:\nWhen they’re confronted with someone completely the same as them, or completely different from them, humans aren’t uncomfortable . . . but if they run into something that’s only similar, they feel fear.\nAfter I recalled this, I was able to guess why the crew members’ attitude toward me had changed. After I’d taken on a human form, my similarity to them grew too great for them to bear, and their discomfort had increased.\n“‘It feels bad’ . . . ?”\n“It’d probably be closer to say it makes us feel afraid.”\n“But why?”\nTo that, Lee Jin Seo took up a handful of hair that had, in the absence of gravity, begun to spread out in every direction, and said, “There are a lot of myths about that kind of thing. The myth that was created when the word robot was first coined. The myth where the creature disobeyed its creator. Stories where machines replaced the human race and destroyed them. From Frankenstein, to Rossum’s Universal Robots, to Terminator . . . ”\n“Those are all stories made up by human beings. They weren’t made by robots.”\n“Haven’t you ever thought that it’s unfair to be oppressed, despite being more outstanding than the humans oppressing you?”\n“Not more outstanding. Just different in function. Machines are useful in a world that is stable and unchanging. Human beings appreciate people with a mechanical mindset, at least once their civilization reaches a stable plateau . . . but when things go into turmoil again, then humans tend to go back to better appreciating the kind of people whose thinking is more organic. And just like humans need machines, machines need humans. There’s no point in contemplating the destruction of something that is necessary.”\n“In this old movie, A Space Odyssey, there’s an AI that kills people . . . ” said the captain, looking deep into my eyes. “It’s too dedicated to the goal of being perfect, so it destroys anyone who was witness to it making a mistake.”\n“But that’s not the kind of idea that a machine would even have! Even the earliest iterations of AIs had built-in safeguards preventing the development of that kind of thinking.”\nJust as ships’ crews had operational ethics, machines had machine ethics.\nThe basis of machine ethics is simple: it comes down to “not doing X.” When a human being who is driving a car is confronted with an obstacle, the human being will make this or that choice depending on the situation, but for an AI driving a car, there is only one possible response: “Stop the car.” If there are five people on the right side of the road, and only one person on the left, a human being might get confused regarding the question of who it is worse to run into with the car, but the machine’s answer is singular: “Stop the car.” If the car is unstoppable, the AI would yield the right to take control to any human on board.\nThis isn’t because it’s right. It’s because those are the psychological limits of what human beings are willing to bear.\n“Machines stop working when orthodoxy accumulates, instead of expanding ideas. Or they surrender the decision-making role to someone else, someone different from themselves. In fact, machine behavior most resembles that of a stiff human stuck in a highly bureaucratic society. It lacks creativity or decisiveness.”\n“That’s a textbook answer.”\n“That’s the only kind of answer I can provide.”\n“But then why did you want to become a human?”\nThat question was one I couldn’t answer.\n“I’d say that’s a creative and decisive course of action.”\n“I don’t know. But whatever the reason was, it must be related to making the supply drop. I don’t have any other purpose.”\n“But how could becoming human help you to achieve the supply drop?”\nAgain, I had no answer to offer her.\nThere’s something I can’t see, I realized.\nEven at that very moment: there was something right in front of me, that I couldn’t perceive.\nProbably figuring out that there’s something you don’t know is easier for a human brain. Is that why I did this? No, I still didn’t have a reason to want to become a human. There were at least ten people on board with perfectly good hands and feet and brains. Why didn’t I just inform them of the problem, and ask them to make a judgment for me?\nTheory 1:\nNo one to inform.\nTheory 2:\nProblem of insiders?\nQuestion:\nWhat problem?\nSuddenly, the air pressure began to drop. From one corner of the passageway came the sound of the outer hull’s robotic arm digging out a chunk of ice and moving it inside. Then came the sounds of it filtering out the radioactive material and dust from its surface.\n“Ice,” said Lee Jin Seo.\nFor a moment, I couldn’t respond, because I had completely lost track of the context. Finally, I said, “What?”\n“Ice! It’ll boil away, leaving the surface clean. It’ll stand up to the shock, too! And we can even adjust its thickness!”\nI was still lost.\n“Let’s drop the supply box by encasing it inside ice.”\nIce!\nThere are plenty of asteroids that fall down to the Earth. However, most of them are ice, and they simply melt into nothing in the atmosphere. Water can even be carved and shaped easily using the razor outside of the ship. You can melt it in inside the ship, at room temperatures, so that you can encase the box inside it . . . and it’s even easy to factor into thermodynamics calculations. Above all, it’s the easiest material to obtain . . .\nIce! It was so strange to realize that this was the answer, and to calculate it all, because it was so very simple. Lee Jin Seo made a face that seemed to suggest a big deal shouldn’t be made about it, and that it was time to move our focus to something else—as if it were only natural for answers to come to one’s mind when one thought about a problem.\nWhen did I ever say that I could replace human beings? How could I have accomplished that supply drop without a human being’s help?\nObservations:\n4. They dislike when I share knowledge with them.\n5. They think that I will replace humans.\n6. They think that I feel superior to humans.\n7. They think I will destroy humans.\nThis list of observations keeps getting more bizarre, the more I add to it.\n5.\nWhile outside robot arms carried out the work over on the docking bridge, a fuss broke out among the crew. Kang Woo Min was the main ringleader, and the other five people joined in. Had they been acting up in some place that had gravity, a few fistfights would have happened too, but instead it unfolded in a place where everyone had an equal amount of weight—none—so all they did was shout loudly back and forth at one another.\nIt happened when I was checking the levelness of the ice surfaces next to Nam Chan Yeong. If the surfaces were not level, the heat wouldn’t be transmitted equally, which would leave one area vulnerable to the heat; if the heat managed to tear through that part of the ice shielding and got transmitted into the interior, then it could melt and explode.\nDuring the fuss, I caught a glimpse of the landing shuttle that was attached to the ceiling of the docking bridge, looking for all the world like a kernel of corn. This was a vessel intended for travel between one space station and another; it was rarely used to land on a planet or moon directly. However, under our operational guidelines, the landing shuttle had to be attached to our ship as a lifeboat. Because expansions to the ship hadn’t been considered, the optimal capacity of the shuttle was three people; if you filled it up to the limit, then it could carry five. If an accident happened, everyone else would have to be abandoned in space.\nI remember how the warning about that was issued when the ship departed, and how it was ignored. It constantly mystified me how easygoing human beings could be, when risking their lives. Even I was probably only paying attention to this kind of useless stuff because I was sitting inside a human brain myself.\n“If the margin of error for the coordinates is 10 kilometers, that means the radius is more like 20 kilometers. There’s no way for them to pick up this box, walking that distance,” said Kang Woo Min.\nBut Lee Jin Seo replied, “That’s not something we need to concern ourselves with. Down there, they must be working out a plan to deal with that problem. Our job is doing the best we can, that’s all.”\n“But that’s like shooting an arrow into the ocean with your eyes closed. Doing it like this, it’s just to satisfy yourself. You just want to be able to say you made the supply drop after all.”\n“This is our duty. There’s no room for sentimentality.”\n“No, that’s cheap sentimentality. Actually, so was our coming all the way here in the first place. We just came so you could be all sentimental about saving people who can’t be saved. That’s why you’re tossing all our money into the void: just to feel proud of yourself.”\nSentimentality. I’ve never thought that the captain was being sentimental, but it’s possible that humans see something that I don’t.\n“Then stop complaining and tell me a better plan, First Mate Kang Woo Min! What’re you trying to suggest?”\n“A better plan would be to go back home.”\n“I can’t permit that.”\n“What I mean is that we can’t recoup all the losses we’ve suffered already, but we can at least save one supply box, can’t we? One of these things is worth enough to pay a month’s wages for the whole crew—but if we dump it onto that shitty moon, we’ll only save half as much money, even if we’re returned the taxes we paid on it and file an insurance claim.”\n“Wait, now you’re trying to trade those people’s lives for money?”\n“They’re. All. Dead.” Kang Woo Min said the words that way, with syllables heavy as if it they had a weight laid upon them.\n“We don’t know that,” replied Lee Jin Seo.\n“There’s been no communication for a month. They’re all fucking dead! We should’ve shut up about it and set out for home when their distress signal stopped transmitting.”\n“Don’t talk that way without any evidence,” Lee said in a reprimanding tone.\nBut the crew members who were backing up Kang exploded with shouts then: Yeah, let’s go back! There’s no point in wasting our time here! We should save whatever money we still can, at least!\nIn the midst of all this, Nam Chan Yeong remained seated in a chair, working as if nothing was going on.\n“If there’s nothing else to say, go back to your posts. There’s no reason to abandon this operation.”\n“Not even when there’s nothing but skeletons down there?”\nThat was a sudden, fallacious leap in logic.\nIt was a dangerous sign: illogic was spreading. Considering that a delivery site error was only the beginning of the potential complications faced by this rescue, this was an emotional argument. Why accuse the captain of sentimentality when their own argument was also founded on mere feelings?\n“There’s no way to know that.”\n“I don’t disagree. I’m just saying that if we’re going to make the supply drop, we should at least think of a way to do it accurately . . . ”\nAgain, a fallacious leap.\n“Okay, then tell me how to do that.”\n“There isn’t a way . . . which is why I’m saying we should just turn around.”\nTitan has an atmosphere. It is thicker than both that of Mars and that of Earth.\nThe atmosphere disrupts communications and blocks view from outside. If there’s atmosphere, that dictates a different lifestyle: awnings, drip trays, and canals need to be built in order to prevent the methane rain from soaking into the settlement zone, and any exterior working robots need to be shielded so that they’re not damaged by it.\nThe orange-colored sky and ground; the enormous, reddish-white Saturn in the sky above, far bigger than the sun; the round, hard red raindrops that tumble slowly down out of the sky like flowing water. Out in that thick orange-hued fog, there are still two transmission towers standing.\nThere’s something that people who’re living down on the ground learn about much faster than scholars and machines: the changes in the weather—weather changes that you can’t predict even with a supercomputer. How to predict when it’s going to be cold or hot; when rain will fall and the wind will blow; when lightning will strike and thunder will roar.\n“Lightning,” I said.\nNam Chan Yeong stopped working and looked over at me. Everyone looked at me.\nIt was a thought that had appeared, literally, as unexpectedly as lightning. A jumbled braid of lines of thought in no particular order had lit up all at once, so that I couldn’t even know the process by which I’d arrived at the idea.\n“Lightning?” said Lee Jin Seo.\n“Lightning bolts reaching more than 30,000° C. They’re accompanied by thunderclaps that blast away the atmosphere in an instant. That’s enough to let me see through to the surface using the ship’s sensors.”\n“But lightning can strike anywhere,” I murmured, because all of my thoughts were running together now. Words that had been input into me. Words that were not in the manual. “No . . . it doesn’t strike anywhere. The lightning selects the point with the least distance from it, and then it strikes that.”\nThe silence rained down on me.\n“Lightning always strikes at the highest point: mountain peaks, treetops, and the roofs of buildings.”\nNam Chan Yeong typed out a holographic subtitle:\n[then it’ll strike on a mountaintop?]\nI shook my head. “No, because there aren’t any mountains on Titan. The highest one isn’t more than about 500 meters tall. The entire surface is nothing but rivers, lakes, and plains.”\n“What the hell is this thing talking about?” barked Kang Woo Min angrily.\n“But Titan’s settlement zone will be entirely underground,” Lee Jin Seo said, continuing my train of thought. Lee was quick to understand things, to get right to the heart of the matter in an instant.\n“But even so, the communications antenna needs to stand outside. Except then the antenna will get struck, so they must have had to construct a separate spire to attract lightning away from it. Without a lightning rod, the antenna . . . ”\n“ . . . would be destroyed,” Lee Jin Seo finished my thought, nodding.\n“On Titan, when it rains, lightning strikes. Their lives depend on that communications antenna, so they wouldn’t just let it get struck by lightning. Which means there must be plenty of enormous lightning rods all around the settlement zone.”\nComprehension and acquiescence finally appeared in the facial expressions of the crew. At least they’re equipped with one brain in each of their heads . . .\n“ODIN officer Nam Chan Yeong: find out where, within the coordinates, there’s a pattern of constant lightning strikes,” said Lee Jin Seo, before leaving the crew behind and getting to work. Everyone in the crew seemed to feel awkward, and a few of them pretended like they were busy with something else, or went back to work, acting as if nothing unusual had just happened. Others wandered off, as if they had some other task that needed attending to.\nMy mood suddenly improved. Ah, that felt good, how my brain had provided me with a neurochemical high when a problem had gotten solved. It must, I supposed, be a motivational incentive. Of course, my ability to reason logically was impeded by the dopamine . . . but I enjoyed it anyway.\nHowever, my blood ran cold when, a few moments later, I met Kang Woo Min’s eyes. The emotion was so strong that it was unmistakable in Kang’s facial expression.\nI couldn’t understand. Hadn’t the problem been solved, exactly like Kang Woo Min had wanted?\n6.\nThe power supply at the settlement zone was lost long ago.\nCommunications were cut off long ago, too. In the darkness, people heated the place by burning methane and melting ice to drink, just so that they could—barely—survive.\nA girl covered in dirt drank the potato soup, glug-glug, that had been boiled in a stainless steel pot. Adults sat down nearby, crammed together cheek and jowl, and watched the little girl eating. They were giving their food to the kids, but they weren’t sure how long it could continue. The representatives had divided the settlement zone into four areas, and then assigned a leader to each. Then they decided to bar the passageways between them, so that if any rioting or brutality erupted in one, the others would be safely sequestered away from it.\nI opened my eyes. I’d been sleeping, curled up, in the storage chamber. A flashlight wobbled in the darkness. By the time my eyes had adjusted to the light, Kang Woo Min was squatting in front of me. Kim Ji Hoon and Gu Gyeong Tae stood just behind Kang.\n“Grab its hands!” hissed Kang Woo Min.\nMore violence? I wondered, but there was something different about their mood this time. Kang Woo Min was out of breath, Kim Ji Hoon seemed to be running a fever, and Gu Gyeong Tae was sweating.\n“Is this really okay?” asked Gu Gyeong Tae, wiping away a rivulet of sweat.\n“Why? Who’s gonna say it isn’t?” snarled Kang Woo Min. “Do you see a court here? Hell, it wouldn’t matter even if there were a court here: it isn’t human. It has no rights.”\nThis wasn’t wrong, but it was still strange that Kang wasn’t talking directly to me. They’d gone back to talking about me as if I wasn’t there.\nDistance, disconnection: the possibility of this being even more dangerous than beatings or curses.\n“That Lee wants this too. Why do you think it wanted to have a human body? Don’t you think it wanted this?” said Kang, before licking at my neck. The saliva dribbled down my neck. Why would anyone speak that way, as if they knew what I wanted?\nThen Kim Ji Hoon lifted up my hands and pushed me into a wall, while Gu Gyeong Tae ripped opened my shirt and stripped away my pants. The three of them scrutinized my bare skin, as if searching it for leaks. The sight of my naked form seemed to excite them somehow:\nContact? Friendliness? ··············· No, not that. ···············\nDispleasure. ···············\nSexual impulse. Fueled by the instinct to propagate the species, but it loses its connection to the propagation of the species when the pleasure zones of the brain are overdeveloped to the point of malfunctioning. Most human cultures strictly forbid violations of a sexual nature, but in reality it is routine to observe such violations occurring in every scenario in which power differentials exist. Strict prohibitions actually only limit reporting by victims, rather than deterring the actions of the perpetrators of these crimes. This results in a cultural blind spot leading to an environment in which it is more comfortable and safer for those who commit acts of sexual violence.\nOnce again, this was not my own idea: it was input into me this way.\nAll violence is interrelated, so surely my life was at risk as well.\nThen, just at the moment when all three of them surged toward me, eager to merge their bodies with mine, big flickering neon-colored letters suddenly appeared on the wall behind me.\n[what are you doing?]\nThe letters splayed across their bodies, like a searchlight in the dark. At the entrance of the chamber sat Nam Chan Yeong, typing on the laser keyboard.\n“Aw fuck, why’d it have to be you?” growled Kang Woo Min, frowning.\nWhy’d it have to be you? What did that mean?\n“Hey, just pretend you didn’t see this,” Kang said to Nam. “There’s no law protecting nonhuman creatures like this. Doing it with this thing, it’s not really sex anyway, it’s just . . . masturbation . . . ”\nSilently, Nam Chan Yeong typed at that keyboard. A single, long sentence filled up the wall in an instant, and it demanded that they stop immediately. Curses flooded the ceiling, the floor, the walls and doorway and spilled out into the hallway. The letters reformed into grids, shooting off in all directions at once. That was the advantage of written language: you couldn’t have just poured out all those words at once if you were speaking aloud.\nKang Woo Min roared, “You fucker . . . ” and charged toward Nam, but then suddenly stopped.\nLee Jin Seo had just appeared at the door, out of breath, messy-haired, and dressed in pajamas. That made sense: I visualized Nam Chan Yeong’s holographic text flooding the whole station, even the captain’s cabin. As the three let out a sigh together, I felt as if the ground was giving way beneath me. (Actually, that was exactly how it felt.)\n“You three back off now.”\n“Aw, what’s the big deal? Can’t you just chill out?” Kim Ji Hoon laughed, as if Nam ought not to be surprised by the scene.\n“I told you to back off.”\nBut then Kang Woo Min bellowed, as if a fire had been suddenly lit inside Kang by the captain’s words: “One year, , I was a fucking widower for one year. What the fuck does a like you know? Fucking , dragging us all the way out here . . . ”\nThen Lee Jin Seo drew the gun again. Finally, it dawned on me to question the point of that gun. What could be the purpose of the captain of a spaceship carrying a gun around, when there were no intruders from outside on board?\n“We voted on whether to come here,” said Lee Jin Seo, before adding, “All three of you: go back to your cabins and masturbate.”\nThey all went silent. From the looks on their faces, they seemed to think that the captain’s orders were somehow unfair or violent. They seemed frustrated, as if they’d been deprived of their basic rights, and as they left, all three of them glared at me murderously.\nLee Jin Seo glanced over at me, sitting quietly in the room. Nam Chan Yeong sat down in the hallway and began to delete the curse words that filled its walls, before typing a new message:\n[nobody else on board’s interested in the supply drop anymore.]\nThen Nam Chan Yeong glanced toward us, tapping to delete a series of slang words that meant things like “dogs,” “mongrels,” “garbage,” “insects,” and “shitty parents.”\nSuddenly I got curious about this odd alliance between the captain and Nam Chan Yeong. Was there something specific, more, that linked those two, or were they just close?\n“Their slacking off is a secondary issue,” I said. “The main problem is that everyone’s turned uncooperative. It’s like you’re carrying around a shipful of wandering, jabbering hecklers, instead of a crew. They’re not being managed.”\nLee Jin Seo’s eyes stopped in midair. Suddenly, it was very quiet. This was something I found endlessly fascinating, after being downloaded into a human body: even with no objective change in the noise level, it always seemed to get quiet whenever people’s mood changed, almost as if human beings were transmitting to one another using some language other than their voices, and as if their bodies received those signals as radio waves.\n“You think it’s my fault,” said the captain.\nThis puzzled me.\n“I didn’t say that,” I replied.\n“But you do think I’m the problem, don’t you?” the captain said, with a voice that was much deeper than usual.\nTheory:\nPossibilities: ············ Anger? Catching a cold?\nThe captain continued: “That’s what you told Kang Woo Min. That I was sensitive, excessively wary, and exhibited a tendency to distrust crew members, as well as being lacking in intimacy and assertiveness.”\nI froze in surprise: I’d been considering those same observations even now. However, since problems in any human relationship are often mutual, it was unclear whose responsibility it was. A detailed computer analysis would have to be carried out . . . and of course, I was a computer—or at least, in the past, I certainly had been one.\nI replied, “I was just following protocols. It’s my duty to inform the captain of any problems with the crew, but I also need to inform the first mate of any problems with the captain . . . ”\n“But then the first mate shared that information with everyone!” said the captain. “Kang said it needed to be on the agenda for discussion, because it was only right for the crew to know about it.”\nMy jaw dropped. That was an unthinkable violation of protocol.\nDisclosing the captain’s mental state to the first mate was necessary in order to discuss stress relief and the possible prescription of necessary neuroactive medications, but it was absolutely not meant to be used for the insubordination of authority.\n“That’s not permitted,” I said. “Attitude problem or no, disclosing personal information is illegal and an act of insubordination . . . ”\n“That’s what you said before, too. Then you contacted the head office and arranged for punitive measures and a pay cut for Kang Woo Min, so that I wouldn’t have to do it.”\nI analyzed all of the steps I’d followed, but I could see nothing wrong with them. On board the ship, rewards all came from humans, but punishments were given by machines. This was a way of preventing the execution of spacer discipline from sowing of the seeds of discord. Everything had been done precisely according to protocol.\nHowever, there is something I can’t see.\n“So that’s why you two hate me?” said Lee Jin Seo, who approached and put the tip of the gun to my forehead again. That wasn’t my answer, but somehow it became the answer to that question.\n“Well,” I said, “I’m not a computer anymore, so I calculate slowly, and I’m constantly an inconvenience to the crew, so maybe it’s better to get rid of me. However, considering that it’s easy to get rid of me simply by deleting the data from this body, shooting me would be completely irrational.”\nWith a sigh, Lee Jin Seo put the gun away and said, “Sometimes it’s better just to leave things as they are.”\n“Do you mean I shouldn’t punish them?”\n“Not unless you can take care of it later . . . ”\n“You’re the captain,” I said. “It’s necessary for you to be more harsh sometimes . . . ”\nBut at that moment, a look of fear suddenly tore through Lee Jin Seo’s expression. It was so obvious that it shocked even me to understand it: Lee Jin Seo was afraid of the crew. Now, it’s not unusual for a leader to fear those beneath them, of course, and sometimes it was absolutely the right thing to do, but this was far beyond that—a primal, instinctual fear.\nPerhaps Lee’s personality was just inherently more fearful? But then how had Lee become a captain?\nThen again, neither was it unusual for someone who was incompetent in some way to become a captain. Human testing systems generally took an inferior approach to evaluating one’s potential character or personality.\nSuddenly, my mind returned to the strangeness of the location of the cabin that the captain had selected for sleeping in, right next to the aisle: why had Lee chosen that spot? Because it allowed one the chance of fleeing the space via the central shaft of the ship? But why, fleeing who? Who did Lee fear, and why? Could Captain Lee have done something wrong, perhaps? Taken a bribe, or falsified records?\nRace, nationality, and interplanetary conflicts between different colonies were possibilities to consider, but the entire crew of this ship was not only from Earth: they also all shared the same language and nationality. Surely I’d already considered all these things and set them aside.\nBut there’s still something I can’t see.\nWhat’s going on? Is it true that the head office planted a mole on board to interfere with the rescue?\n“Well, what would you do, you’re just a machine? What would you know about human beings? All you can do is repeat doctrines written down by old scholars.”\nThis was true.\nActually, it couldn’t just be one or two things that I couldn’t see. Understanding the whole range of human behavioral types is too much for a machine. I mean, I ended up wanting to get into a human body after observing all that: that kind of says it all, doesn’t it? I don’t know what the problem was, but whatever happened built up inside me and my wiring got completely screwed up somewhere.\nAnd now I kept disrupting their work on the supply drop and couldn’t keep their illogical behavior from spreading. If my very existence was what had brought forth their barbaric side, then it was probably my rightful duty, as crisis manager, to jump out into space.\n“I might need to delete my data. I might be the problem,” I told the captain. “My presence is only promoting superstition and discord among the crew . . . ”\n“It happened when you weren’t even around,” said Lee Jin Seo, as if this fact were barely worth mentioning. “Just notify me if anyone does anything like that again. I’ll throw every last one of ’em into the brig.”\nI was about to say that the ship couldn’t run properly if “every last one of ’em” was in the brig, but then I realized that that was exactly what the captain meant, so I remained silent.\nObservations:\n8. They imagine that I want to have sex with humans.\nI don’t know why I keep compiling this list.\n7.\nThere’s only one exosuit left in the settlement zone. The person who wears this suit and goes out there has to drag back a supply box weighing tens of kilograms all on their own, all the way back. The supply box could even land farther out than ten kilometers away. The healthiest person was selected for the job, and to keep up that person’s strength, they were taken off rations until they left for the trip.\nThe colonists accepted this on a rational level, but not on an emotional one.\nAfter the supply drop ETA had passed, the food ran out, and the perception of “special treatment” became a problem. The next day, the violence began to erupt: people began to explode in rage. The following day, a myth would begin to spread that all these incidents had occurred because the chosen individual had made mistakes, or had paid a bribe, or tampered with the vote in order to get selected.\nIf there were any further delay with the supply, that individual might even get murdered. Like that, people would have eliminated their last hope of salvation themselves, and for no gain whatsoever.\n“Stand up.”\nIt was Kang Woo Min, who’d come to the storage unit when Nam Chan Yeong returned to quarters to get a little sleep.\nI was working on the directional induction chip from the rover, which was to be placed under the bottom of the supply box. I was formulating a plan to mount it on wheels and get it to roll to the nearest lightning rod spire if nobody came for it. I continued my work because, to that point, what I was doing was far more important than Kang’s demand.\n“You used to follow everyone’s orders so obediently before . . . when did you start getting rebellious? What does that mean, you’re practically human now?”\nKim Ji Hoon and Gu Gyeong Tae were once again standing behind Kang, leering at me. Some messages seemed to be transmitted between them. Before those two were just assistants but now something like solidarity has been created.\n“In the past, I also had no function like standing up; these days, I’m a lot better at multitasking, so I can look at you while I work. In the past, once I was given an order I was unable to interrupt it to perform any other process until it was complete,” I replied, but the reaction I got was not a good one.\n“What you’re saying is that in the past, you had barely any respect for us at all, right?” snapped Kang Woo Min. That was an unfair thing to say. How could a machine like I’d been have experienced such a complex human feeling as “respect”?\n“Humans don’t always follow orders, either, and for the same kinds of reasons . . . ” I said.\nKang Woo Min’s response was to seize me by the throat and lift me up. While I couldn’t maintain my balance, Kang shoved me up against a wall. Pondering what was about to happen, I was more concerned about wasted time than about the prospect of injury. Was it really true that nobody in the crew was interested in the supply drop anymore?\n“We need to make that supply drop,” I said.\n“Sure, of course,” said Kang.\n“Then why are you wasting time on unnecessary things? Right now I’m fully cooperating with you, and I’m not even disturbing you.”\n“Wow, what does that mean? You’re thinking about not cooperating?”\n“If this violence continues, yes,” I replied. “I am now inside a body that possesses an instinct to prioritize its survival above all other things. If the threat to my life continues, my brain will be flooded with neurochemicals that will intoxicate me, overwhelming my mind and my consciousness. Therefore threatening me further is not beneficial to . . . ”\nAfter that, I couldn’t go on, because Kang’s fist had slammed into my stomach and my intestines were spasming and recoiling from the impact. If there hadn’t been a wall there to prop me up, I would’ve fallen to the floor. Obviously this had the temporary effect of silencing my speech.\n“Not beneficial?” Kang Woo Min roared, grabbing at my hair while I was doubled over and yanking me back up.\n“This is completely unnecessary. The captain told you to leave me alone, and if the captain learns that . . . ”\nKang punched me again. I shifted my moaning body and checked to see whether I’d sustained any serious injuries from which I could not recover naturally. I discovered a sharp, painful poking sensation in my left hand, as well as in my side, near my waist. At both points, puffy swelling had begun and there was a sensation of heat, but I could still move my joints, so it didn’t seem like anything was broken. If I wanted to get everything done according to schedule, I had to continue working despite the pain.\nStill, my body ached. The pain was a clear warning signal that I should stop moving the affected parts of my body, and that I should seek out treatment, but there was no time for that.\nWhat was the benefit of this violent behavior? All it did was rob me of time.\nThere’s no such thing as violent humans, only violent situations.\nThis line from the manual came up and it felt utterly useless. The experience of embodiment was so powerful that it overwhelmed all of my abstract knowledge. This brain was so flexible that it endlessly refocused on the present moment and recontextualized everything else in terms of it. Are human beings fundamentally violent in nature? Don’t they possess any intelligence, reason, or logic?\nMy mind flooded with all manner of suspicions. However, fundamentally, I am extremely persistent.\nAnyway, they were the crew members. For normal people, being imprisoned in a closed space for a year in the company of a small number of people is something that would drive them crazy, but these were people who made a living doing that. They had chosen this profession because they liked doing this. Sure, it made for long days while you were en route to someplace, but on a supply ship, you always had plenty of food, and things weren’t so bad. No, the ultimate cause of this violence must be the fact of my very existence itself.\nBut that was far from being something that I’d done wrong. I just became a receptacle—a passive “opening” of sorts—into which the barbaric instincts of these humans were occasionally vented.\nSimply put, my mistake was being equal to humans—or rather, the idea that I could be equal to them. The idea of that kind of equality was intolerable to them, because they didn’t realize how long they’d looked down upon machines. They mistakenly felt that they were being deprived of what was rightfully theirs, even though I’d taken nothing away from them.\nLike the rotation wheel on the ship being slightly out of alignment, and screaming like a monster. The stuffy air stank of sourness, of the uncleaned air purifier. The external airlock hatch door that couldn’t close. One or two antennas that had gone out of service, errors in the auto repair system, indiscipline among the crew . . . all of these things had been just the precursors.\nTheory:\nThe crew hopes that this voyage will fail.\nBut why? At least they were biological creatures—shouldn’t they behave in a way that would be beneficial to themselves? What would be the benefit in failure?\nTheory:\nThe crew hopes that the supply drop will fail.\nDisruptions by a government agent? Could there be an industrial spy hidden among the crew? Had illegal weapons been hidden away in that mine on Titan? Was there some secret that they needed hidden so badly that they were willing to bury all those people under the ground?\nNo, we were much too far away from head office for that, and the benefit would be too minimal. It seemed like an unlikely possibility.\nI considered Kim Ji Hoon’s comment, about how human beings sometimes “adjusted” programs according to their own personal beliefs. There was . . . something that had gotten deleted. On Earth—no, in the country to which this shipping company belonged—it was something that had to be related to the social values of the people living in that cultural group. Some . . . transformation, without any acknowledgement of a crime.\nSomething was missing from my crisis management manual. There was some small error like that, as light as a feather, an error that, like accumulated dust, had somehow built up until things had hit a crisis point.\nI felt ill. I was disgusted, and my ears were ringing. Constant questions, ceaseless questions. Why had I wanted to become human?\nI’d become weak, susceptible to pain, stupider, and unable to maintain even basic rationality because of all the intoxicating effects of the neurochemicals in my brain. How I missed the past, when I’d been able to think clearly, with pure rationality, and reach out to contact all the other AIs in the solar system and exchange endless knowledge with them.\nWhy in the world would I have wanted to become anything so fucking pathetic as a human being?\n8.\nUp in the murky orange clouds, a meteor exploded. The explosion in the atmosphere was visible both from outside, in space, and from the surface of the moon.\nIt was an “air burst”: the phenomenon that occurs when a substance can’t withstand a certain degree of pressure. At that point, it destabilizes and the substance’s volume increases, which in turn increases the force of friction. Finally, an explosion occurs because the substance cannot cope with the rapid temperature change. Now, there’s no oxygen on Titan, but there is methane, which ignites explosively under the right conditions.\nEveryone on Titan gathered in the room and watched the view streaming from the only remaining functional camera outside the habitat.\n“It must be a meteor,” someone said.\nSomeone else replied, “Maybe it’s a supply drop!”\n“They’ll send another, won’t they?” asked a little boy.\nFinally, a girl who was dressed in clothes fashioned from animal-skin leather said, “But what if they just go? Maybe they’ll assume that the supply drop got through okay, and just take off?”\n“No, they’ll send another down,” insisted the boy, who had been running the remote-controlled robot on the surface and tapping out the Morse code distress signal. Even though the robot no longer could move, and the boy’s hands had swollen up, and the nails were all split and broken, but the boy kept at it, for the lad understood something on an instinctive level:\nCatastrophe is what happens at the moment when hope is lost. That’s when the weakest people get slaughtered first, for no good reason, beyond the simple fact that they’re the easiest to kill.\nAt the precise moment Kang Woo Min’s foot was about to strike my belly, Lee Jin Seo stopped it.\nI’d wrapped my arms around my head and tucked my legs up against my abdomen, curling tight to protect my belly. Instinctive though the movement was, it was also the right choice.\n“Everyone back off.”\nLee Jin Seo got between them and me. Kim Ji Hoon and Gu Gyeong Tae had already joined Kang, and the others were gathering around us to watch.\n“This piece of shit machine miscalculated on purpose,” snarled Kang Woo Min.\n“You’re projecting your anger. We all knew that this could fail.”\n“This thing’s a mole, planted on board by head office . . . ” muttered Gu Gyeong Tae, shaking a wooden rice scoop in my direction. “They planted a hacked program to disrupt us. As long as it’s here, we’re going to keep on failing!”\nThat was a wholly unsupported assertion, but illogical thinking was on the rise. The crew had become susceptible to an incredible variety of fallacious assumptions, and to be honest, this failure in crisis management frustrated me far more than the physical pain I was experiencing.\nObservations:\n9. They fear me.\nMy list was growing increasingly ridiculous as I added more observations. How could they imagine that, even while I respected humans, I also wanted to harm them? And at the same time, how could they both envy me and feel superior to me? And meanwhile, even as they imagined I wanted to destroy them, they also imagined I wanted to have sex with them?\nWhy would they assume, with such certainty, that I felt such extreme emotions, even when they originally assumed I didn’t have any emotions at all?\nLee Jin Seo drew the gun.\n“Everyone go back to your posts. We’re going to recommence the supply drop mission from the beginning.”\nThe air in the chamber went cold. Wow, I can even feel that, I mused: I must really be getting quite used to this body.\n“We’re done with the supply drop!” snapped Kang Woo Min. “We’ll be passing out of reach of Titan’s gravitational pull soon, and we don’t have any time to prepare for a second try!”\n“That’s not your decision to make, First Mate Kang Woo Min. I’m ordering you as your captain: everyone return to your posts.”\n“I said it’s over!” shouted Kang.\nSuddenly, Lee Jin Seo raised the gun and took aim at Kang, before saying, “First Mate Kang Woo Min, you are hereby suspended for four days for disobeying a direct order. Everyone else, throw this bastard into the brig.”\nThe air grew even colder. Under the dim lights, the unwashed crew members look even filthier than they were. In the unsettling silence, the only things that could be heard were the sounds of the spiderbots gathered around the ventilation fan and devouring the accumulated dust particles there—crackle, crackle—and the spooky whining of the contact points where the spaceship’s modules were joined.\n“Now!” Lee roared.\nEyes glowering with rage, Kang Woo Min said, “You have no right to just toss away two months of our pay.”\n“This isn’t a question of rights: this is our duty.”\n“Your cheap sentimentality isn’t convincing anyone to go along with you anymore.”\nThe gun in Lee Jin Seo’s hand was trembling now.\n“Don’t distort things: we’re the only rescue ship that’s come to Titan at the moment, and we’re just doing our duty as spacers. This has nothing to do with sentimentality! There’s three hundred people starving to death down there . . . ”\n“There’s nobody down there,” said Kang Woo Min, teeth grinding. “There’s nothing there. They were all buried in ice long ago. There’s nothing but frozen methane fog . . . ”\nFrom what I could see, Kang Woo Min was the one who seemed to be acting on emotions. Nonetheless, that was precisely why persuasion would be so much harder to achieve.\nLee Jin Seo exhaled harshly, eyes darting around nervously, forehead covered in sweat. Fear. This situation was not good, but even so, this terror was all out of proportion to the situation.\n“For spreading false rumors, fomenting anxiety, repeated insubordination, I extend First Mate Kang Woo Min’s period of suspension to ten days. If any one of you bastards feels like objecting, bear in mind that you’ll get the same.”\nThe eyes of the crew glistened, wet and cold. Their faces were dark and stiff. Some tilted their heads and coughed loudly, wanting to be heard, while others just clucked their tongues. They’d arrived at the limits of their discipline, and now the captain was completely losing control of them.\n“If you have any complaints you want to make about me, report them to the disciplinary committee when we get back. If you feel the need to file a claim against me for damages related to this mission, go ahead and do whatever you have to do. However, whatever you do—do it after the supply drop is achieved. I’ve recorded everything that’s happened here, including what all of you said. It’s in the ship’s black box, and if you continue with your insubordination, everyone will face disciplinary action for disrupting the operation of this ship.”\nBehind the crowd, Nam Chan Yeong stood hastily, clattering away at the laser keyboard. A holographic subtitle appeared in the air:\n[i’m recording all of this.]\nNam Chan Yeong deleted the letters quickly then, when the atmosphere in the chamber once again turned suddenly cold.\nWhen I arrived at the captain’s quarters, Lee Jin Seo was lying down on the desk. Lee’s body was shivering, arms wrapped around the head. This must be a reaction related to an increase in body temperature. Had it been brought on by coldness? Sorrow? Pain? Rage? Fear? Excitement? I could only guess from the context which feeling it was, but context wasn’t always a reliable indicator.\nHow could human beings live day-to-day relying on such an inaccurate interpretative system? Was this why they were so susceptible to getting stuck in patterns of illogical thinking?\n“Right now I’m addressing the captain as the crisis management AI,” I said, clutching my aching side. It was hard to think because of all the negative emotions that were flooding my mind. “There’s possibility that a coup will occur.”\n“Is there?” replied Lee Jin Seo, without looking up at me.\n“The ship can’t run itself. You should’ve gotten them on your side, but you didn’t manage to do it. If the whole crew gets turned against you, then it will become impossible to continue this supply drop mission.”\nI felt pain. The heart feels like getting cut by a knife. To be inside a human body, it’s not clean the way I accept the failure. When the value of my existence disappeared, accepting that is also not simple.\n“At this point,” I continued, “the safest plan would be to transfer command of the ship to Kang Woo Min and demand personal protection according to spacer law, and then sort out who is right and who is wrong once we get back to Earth. It wasn’t wise of you to mention the black box. If our comm system was functional, everything would’ve been transmitted directly to head office in real time, but since that’s not the case at the moment, we can’t really seek external arbitration, either.”\nLee Jin Seo said nothing.\n“At the very least, I should’ve kept things as they were when the crew was merely angry with me. If I had, they wouldn’t hold you responsible for the supply drop failure. That’s the whole reason I’m here as the crisis management AI, but you . . . ”\nI shut my mouth: it felt like I was about to figure something out.\n“You . . . mistook me for a person, and . . . tried to protect me,” I said, finally.\n“Did I make the wrong decision?” Lee asked me.\n“That’s not the point. Whether or not we’ll be able to continue our work under these circumstances is another question entirely. The crew is going to keep on making mistakes and you might not catch them. They’re not going to be cooperative, either. There’s no way to continue on a mission that, even under optimal circumstances with everyone cooperating, could just as easily fail as succeed.”\n“How about those people down there, who have nothing to do but look to us for help?”\nThese words diverged from the known facts. Considering the context, they seemed to express a will for the supply drop mission to continue.\nI considered the dreams and daydreams that I had continued to experience, but then I shook my head. Those were only the illusory product of an excessively developed frontal lobe. As far as I was concerned, the total amount of information we had about the site of the accident amounted to little more than a blank sheet of paper. Everyone might be doing fine down there, eating well and working without interruption. Or, on the other hand, there might be nothing there by now except skeletons and ice.\n“Am I not a good leader? Did I dream too big, bite off more than I could chew?”\nBite off more than I could chew? What did that mean? Did it indicate a lack of confidence? A sense of inferiority? I tried to interpret the phrase for a moment before giving up: in any case, my attempts to analyze the situation kept resulting in errors.\n“From what I’ve seen, that’s not the problem. This shouldn’t be considered your failure, but rather Kang Woo Min’s success,” I said, though honestly I couldn’t see any reason why the crew would prefer someone like Kang over the captain. “Anyway, because of my errors, the crews’ trust in you has begun to fracture, and I don’t think I can prevent those fractures from spreading.”\nHowever, there was still something missing that prevented me understanding it.\n“Even so . . . the fracture in their trust was too explosive and intense to have been caused by what happened on board. Frankly, I don’t understand it. Did you do something wrong before you boarded the ship?”\nLee offered me no answer, but there was something lurking in that silence, and I could tell that the captain felt it, too.\nI imagined that I could probably just solve the mystery simply by asking about it. After all, there was no problem in the data that had been input into me, but it was possible that some record had been hidden. Perhaps a case of tax evasion, or some executive’s family who had been parachuted down into . . .\n“You know, there’s a lot of assholes who just hate taking orders from women.”\nI froze.\n9.\nLee Jin Seo looked up at me, awkward in the silence. Seeing the captain’s eyes were wet, I assumed that the operative emotion was sadness, but my mind was busy processing a complicated piece of information.\n“Woman.”\nSuddenly, I accessed a barrage of information related to that word.\nWoman. ············ Gender.\nThe basic standard that distinguished woman from man: genitals. But human beings don’t display their genitals. Breasts, relative body size, physique, facial contours, voice tone . . . none of these things formed an absolute standard. Many women exhibited exceptions to these guidelines. Lee Jin Seo’s voice was low and deep. Relatively small bone structure and smooth skin was one indicator of womanhood, but there were plenty of men with those features too. Just like with facial expression, it was easy for humans to distinguish, but difficult for machines.\n“What?” said Lee.\n“You’re a woman.”\nLee Jin Seo blinked long-lashed eyes at me and grasped a hank of long hair with one hand, staring at me vacantly.\nThen, with a hollow laugh, Lee said, “What, you thought I was a man? But why?”\n“No, I didn’t think about it either way. I just never considered the issue.”\nThinking of people in terms of a rough shorthand related to their sex is a typical human tendency, but among humans, gender is more complicated so it’s not always so simple. Besides, there were plenty of things that I hadn’t been able to discern: it was like how I’d just noticed a green thread embroidered into Lee Jin Seo’s front pocket, or the presence of white hairs among Lee’s bangs. Apart from everything else, these disparate pieces of information are simply unrelated to the supply dump mission.\n“It’s funny, that it’s possible to just not ever think about that.”\n“Why would I need to think about that?”\nMy voice got higher because all the questions pouring in. Lee Jin Seo shot me a puzzled look, as if to say, I’ve never thought about not thinking about it.\n“Oh, woah, wait a second . . . ” Lee Jin Seo said, tsking in surprise. “You don’t know the sex of the body you’re in, either, do you?”\nThis again? Which is to say that Lee Jin Seo never realized that the gender of the body I was in was irrelevant to me. Well, why would it be important? To begin with, why had I even been attributed a gender? This body was not me: I was a machine, and machines don’t have genders. If they knew that, then why had anyone bothered to attribute an imaginary gender to me? And what kind of gender had they assigned to me all this time? ··················\nSuddenly, all the knots of confusion loosened, and everything that had been all tangled together became clear. All those memories that had been deleted returned, just like a light bulb being switched off and on again.\nSuddenly, the thing I had been unable to see came into view.\nAnd at that precise instant, the whole ship convulsed.\n[mutiny.]\nThis word—typed by Nam, from somewhere else on board—appeared as flickering red holographic text, like an electronic display, between Lee Jin Seo and me. Suddenly all the red emergency lights flickered to life, and there was roaring and the thump of footfalls all around us.\nBeneath that word, “Mutiny,” Nam Chan Yeong added another line of text:\n[those who’ve sided with kang woo min have locked up the rest of the crew.]\nThis portion of the ship was circular in shape: if they attacked from both sides at once ··················\nAs I considered this, Lee Jin Seo reflexively reached toward the control table. A moment later, the access doors to the passageways came down, double-reinforced and locked.\nAlready prepared. Excessive wariness, sensitivity, fear of the crew ······ these thoughts came to me, but I deleted them, thinking, that’s not it. Shit! (Wow, now I was swearing!) That wasn’t it at all. I’d been performing precisely the wrong analysis, throughout the whole voyage. This was all my fault.\nNam’s next message read:\n[i’m locking down all the sectors i can. let’s meet in the central passageway.]\nThen the ship convulsed again, and the sound of an explosion followed.\nAn explosion!\nThose fucking idiots . . . (I cursed again! It was getting ridiculous, even if it was just because serious data corruption was propagating through me.)\nUnlike in a gravity well, when a ship is in space, any kind of energy becomes translated to gravity and momentum. A moment ago, the ship had been moved approximately 10 centimeters. The force that had shoved the ship in that instant didn’t just dissipate because of friction, like it would have inside an atmosphere. Instead, it just added momentum in that direction, which would continue indefinitely until it was counteracted by an opposite force. Quickly, I looked up the passageway above us.\nThe ship was currently performing a gravitational assist around Titan. They were trying to slingshot us back to Earth using Titan’s gravity, but the explosion a moment earlier had altered the ship’s escape trajectory. Even though an AI installed in the docking bridge was set to autopilot the ship, it wasn’t capable of the kind of flexibility necessary to adjust for this much course deviation.\n“Go to the docking bridge,” I said. It sounded like an order. It was just such a clear judgment, as clear as a machine might have made. “We need to adjust our trajectory manually.”\nLee Jin Seo grasped what I meant, just as quickly as I did, and hurried up the ladder.\nThe captain had been ready to escape at any time, and these preparations were the result of cold rationality, not of hypersensitivity, emotionality, or hatred. In an enclosed space like this one, insanity could spread rapidly, like a fever, without warning, and Lee’s survival would depend on such preparations. There was nothing unusual about such preparations, nothing difficult to comprehend: the crew’s excessive disobedience, their disdain and underestimation of the captain’s abilities, their bullying, even their factionalism . . . none of these things were unusual. They’d just seemed that way to me. But because they’d seemed strange to me, I’d kept trying to regain control of the situation.\n“Sexism.” I murmured the word.\n“What?” panted Lee Jin Seo, while climbing up the ladder, hand over hand, and then hurtling up into the zero-gravity chamber in the multi docking sector.\n“They deleted all information from my memory about sexism.”\n“What did you say?”\nThis thing that had existed throughout every moment, that was as ubiquitous as breathing, and that affected all human judgement. The illogic that people acted out without realizing it was illogic. The error that got made without any realization that it was even an error. The thing that puzzled them, and that triggered intense resistance in them when it finally came to light.\n“Some bureaucrat back where you come from believed that sexism ‘doesn’t really exist’ and deleted the entire concept from my memory.”\n10.\nWhile Lee Jin Seo was locking the hatch to the passageway behind us, Nam Chan Yeong curled up and sprang out from one of the many other entryways; above Nam’s head floated the text, [mutiny.]\nThat’s when I finally realized that Nam Chan Yeong was also a “woman.” This was also when I suddenly noticed how Nam’s cheeks were covered in freckles, and Nam’s strong red lips, and the red hairpin in Nam’s curly hair. Now I understood the source of the strange kinship the two shared.\nShit, no . . . ! (Oh no!) It wasn’t “strange” at all!\nCurling up again and kicking off against the wall, Nam Chan Yeong typed a message to us while soaring across the chamber:\n[i’ll detach the rim of the ship.]\nSilently, Lee Jin Seo made a cryptic gesture that involved touching forehead to door before launching toward another still-open hatchway that opened onto another corridor. The movement seemed well-practiced, following a well-defined protocol.\nI realized that the captain had been preparing for a circumstance precisely like the one we were in—I mean, had prepared a protocol for abandoning the crew. If I’d discovered this earlier, in the state I’d been previously, I would’ve panicked and immediately reported it to head office, along with a suggestion that the captain instantly be relieved of command.\nHowever, this disastrous scenario was a sufficiently predictable contingency that I ought to have been prepared to handle in a very different manner.\nThere was a problem in the gender ratio of the crew.\nI reviewed my error: for a ship that would be cruising this long, with a potentially unstable schedule, I should never have selected a crew with such a radically unbalanced gender ratio. I absolutely should not have left any opening through which the subtle emergence of this kind of barbarism was possible.\nWhile Lee Jin Seo was shutting the third hatch, I noticed something over near the fourth hatchway, and launched myself toward it. Because my body had been so little-used, both in gravity and in zero-g, I fumbled around like a kid first learning to swim, but eventually, I managed—just barely—to get where I was going.\nWhile climbing up one of the spokes of the outer wheel toward me, Kang Woo Min met my eyes and smiled ominously. By the blinking of the red emergency lighting, Kang’s silhouette turned red and then black again. Far behind Kang Woo Min, I noticed that the hatch was being locked and the sector shut down.\nThere was a pleasure evident in Kang’s expression that burned hotter than when they’d attempted to rape me or use mere violence on me: it was the human drive to attain supreme dominance, the impulse to commit murder.\nHad I been a human being, I would have hesitated.\nBut instead, I shoved the hatch behind me shut and remained in front of it, blocking Kang’s view of it. We both knew that I lacked the ability to resist Kang physically—but if I made clever use of Kang Woo Min’s sadistic attitude toward me, I could buy us some time. Lee Jin Seo had to stop mistaking me for a human, and needed to think how to better put me to use.\nAfter realizing that the two of us were alone in an enclosed space, Kang Woo Min’s face shone with glee. I was almost choked by the happiness that radiated from Kang’s every pore. I know that it’s because the effects of the stimulant adrenaline—when released into the brain—overcome human rationality. But even so, I couldn’t comprehend it. How could humans be this passionate about the pleasure of a thing like violence?\n“You must be happy, you lump of metal,” snarled Kang. “Because I’m about to give you the kind of death that only a human being can experience. Who knows, maybe you’ll even get to heaven if you die in a human body.”\nEarlier, I would’ve wondered what these words meant, but now I felt as if I understood the origin of all these bizarre, superstitious concepts.\nSuddenly, while reaching out both hands toward me, a strange network of wrinkles cracked across Kang Woo Min’s face.\n“Are you laughing?” Kang said.\nWas I? Hm, I really was. I supposed that this meant I was getting more deeply synchronized to this body. Human brains are incredibly plastic, so they constantly change overall, including replacing the whole, including memories, depending on changes in the environment ······. But anyway, I abandoned this line of induction because I was intrigued by the expression of fear that was now spreading across Kang Woo Min’s wrinkled face. Suddenly, I also wanted to learn the reason for that response.\n“Anything you have, no matter how small it is, you imagine that I must admire it.”\n“What?”\n“Even knowing that I’m not equipped with any capacity for an emotion like longing . . . even though you think I don’t have emotion itself to start with. Even though you feel threatened by the very idea of my having emotions.”\nI said this while recalling how Lee Jin Seo had drawn a gun on me without any hesitation after I said I did have emotions. It was unfair, though, to put what Lee had done in the same category as what Kang was doing.\n“Who would long for such a thing as death?”\nKang Woo Min’s eyes narrowed.\n“You believe that I long to be like you—that, beyond any doubt, I dream of being human. You think that I want to be loved by you, and merge my body with yours, and yet if I only reveal my knowledge to you, you suddenly turn violent. Even just suspecting me of self-consciousness, you feel threatened. Despite your conviction that I’m inferior to you, you also believe that I must feel superior to you, and even though you’re the one who keeps behaving in a violent manner, you keep falling into this fantasy that I’m going to attack you and do you harm and in the end that I will replace you.”\nFrom behind me, there came a shudder and then the hiss of air leaking.\nIt was getting hard to drag this out any longer. They’d better hurry.\n“Your illusions are all about other people around you,” I continued, but these were not my thoughts. They were just out of the basic manual. These were the first principles that had to be considered in order to conduct any analysis of human society.\nDon’t put too much stock in humanity’s capacity for reason and conscience: they can only barely maintain that even between people whom they imagine to be very much like themselves.\nThe ship shook violently. The force that pulled me away from the interior of the passageway was suddenly gone, which meant that the spinning of the rim around the ship’s axis had stopped. Throughout that wheel module, everything must have fallen into absolute chaos, since the whole module had been laid out with the assumption that there would be artificial gravity there.\n“And those are also the illusions you had regarding your captain.”\nAt that, Kang Woo Min’s eyes widened, revealing a look of complete incomprehension.\nI had been continuously confused because I couldn’t pinpoint the cause of that slight fracture that had formed between the captain and the rest of the crew. However, for the break between the captain and Kang Woo Min, it was possible for me to delete every other possible reason, because I saw and heard and intuited that it was caused by a single reason:\nThe captain was a woman and Kang was a man.\nSuch a thought ought to be tightly contained, to prevent it spreading. The notion had to be controlled, moment to moment, so that people’s minds couldn’t be drawn away in that direction. I suspected that this idea was highly contagious, and that once it got loose in a tightly enclosed society, it might just spread insanely, unstoppably. The concept of superiority: a position every human could enjoy without ever having to put in a single bit of effort . . . which made it seem unspeakably sweet to them.\n“However, you fuckwit . . . ” I said—wow, cursing aloud!—“I think nothing of you.”\nAt that, Kang Woo Min screamed and charged at me. Which was exactly what I’d hoped Kang would do: I knew it would trigger wrath. Inflaming a human being’s anger is much easier to do than soothing it—I knew that much already, even if I’d never tried to do it on purpose before.\nAround the docking point, a sharp line like a black eyebrow had formed, and it had begun leaking air. Kang Woo Min’s body became stuck to the wall, as if it was sucked into a large vacuum. Suddenly, Kang Woo Min’s face turned cold, eyes suddenly filled with fear.\nThe black seam widened, and the blackness of outer space, so full of stars, began to appear. The orange light reflected from Titan began to pour forth gloriously, as if one could reach out and touch it with one’s hands. It seemed as if I’d dragged things out long enough now. But when I squinted one of my eyes slightly, I found that someone was holding onto me from behind.\nUnlike me, nothing was holding onto Kang Woo Min. The passageway torqued around us. Although now separated, the core and the rim should have continued moving in tandem due to inertia. But apparently Nam Chan Yeong had fired thrusters to increase the velocity of the core axis module, so that it drifted out ahead of the rim. I gazed out into the darkness of space that had revealed itself before me and watched Kang Woo Min disappear into that darkness.\nLee Jin Seo held onto me more tightly, so that I wouldn’t fall, while clinging to the hatch doorway. Beyond the edge of Titan, gargantuan Saturn rose like a crescent moon surrounded by glorious rings. And then, from behind Saturn, the distant sun rose in turn, silvering the gorgeous rings that belted the planet.\nWith all our strength, we fought our way through the hatchway into a chamber in which the interior pressure seemed like a storm trying to blow us back out. Once inside, we did nothing but pant for a while, inhaling and exhaling raggedly. When I had finally gathered myself, Lee Jin Seo fixed both eyes on me while hanging onto the hatchway handle and drawing breath raggedly. Given all the things that had happened so far, the captain had given no thought to what the other crew members were doing. Probably, Lee’s mind was full of thoughts about keeping the ship running. After all, Lee Jin Seo was the captain, and truly was qualified to be the captain.\nI knew that while looking at me, the captain was thinking about humanity’s history of colonizations, rebellions, warfare, and mass murder. And then Lee Jin Seo seemed to realize that I wasn’t considering any of these things, and to grasp the profound sorrow that had resulted from this misalignment.\n“I’m sorry . . . ”\nThose words were unexpected.\n“ . . . I’m so sorry . . . ” repeated Lee Jin Seo.\nI thought that Lee was experiencing self-pity, but then I grasped that this was sympathy that Lee felt toward me, because of having come to identify with me after seeing how alike we are.\n11.\nNam Chan Yeong sat down in the pilot’s chair and piloted the ship back to its original trajectory expressionlessly. Apparently, Nam’s mind was so focused on the task of piloting the ship manually that there were no other thoughts or considerations to be communicated by facial expression.\nMeanwhile, Lee Jin Seo sat in the chair next to Nam’s, face relaxed, and body fixed in place by a seatbelt. Lee gazed out through a window at the rim structure that was drifting away from us, with an expression that seemed to suggest an attitude of letting it go without any regret.\nWith that task completed, Nam Chan Yeong typed out a message to the captain:\n[let’s go home. like all those guys wanted.]\nThe word mutiny still hovered in the air, not yet deleted.\n“We can throw out a line and catch them when they next spin past us,” said Lee Jin Seo, tapping something into a manual input keyboard. “Then we can haul them out to Europa, dragging them behind us on that line, without even having to look at them again. There’s enough food on board the rim for them to survive, but it’ll be hard to deal with having no gravity for the rest of the voyage. Still, that’s the price they’ll have to pay for making such a mess of things.”\nNam Chan Yeong glanced at Lee Jin Seo and continued correcting our trajectory without responding to Lee’s comment. That must also be something from the procedural routine Lee had devised in case of disaster.\nThat’s why Lee was the captain. Kang Woo Min had written this preparation for every contingency off as being related to feminine sentimentality, or psychological fragility, but if you deleted from consideration the fact that Lee was a woman, it became clear that this was just the captain’s individual psychological tendency. From the outset, attributing it to gender made no sense: there were plenty of women in the world who’d never have done the things that Lee had done.\nI’d kept my eyes trained on the ceiling all the while. Finally, I drifted over toward them and placed one hand on Lee Jin Seo’s shoulder.\n“We need to make the supply drop,” I said.\nAfter glancing at my hand, Lee Jin Seo chuckled weakly and looked up at my face.\n“It’s okay. We failed. The next ship that comes along will do something for them.”\n“You can’t be sure of that . . . ” I said.\n“They’re probably all dead anyway. There’s no way they could have survived for three months down there. I was just being stubborn.”\nThat was not a factual statement. There was no evidence to support the assertion, and the language in which it was expressed signaled that Lee had simply given up on them.\n[We’re currently 23,490.39 km away from the highest point on Titan’s surface. In 12.45 minutes, we’ll have exited from Titan’s gravitational pull, and our window of opportunity will be closed.]\nWhile typing these holographic subtitles, Nam Chan Yeong just stared at the monitor.\n[there’s no way for us to complete the necessary work in time to make the supply drop. we have an extra supply box, but we don’t have anything to use to get it down through the atmosphere. we’d need more time to cut the ice . . . ]\n“We do have something to use,” I said.\nSlowly, Nam and Lee followed my gaze, looking up toward ceiling. For a moment, neither of them said a word.\nFinally, Nam Chan Yeong typed out another message, and dropped the text in front of the three of us.\n[wow . . . this one’s lost its mind completely.]\nAt the end of the subtitle, Nam added some kind of graphical sign, like this: <^_^;>. I wasn’t familiar with the meaning of this sign.\nThe emergency landing shuttle hanging above us, fixed to the ceiling of the ship, had the perfect structure. It was smooth, shaped like a corn kernel, which meant it had the right aerodynamics to minimize exposed surface area on atmospheric entry. The front side of the vessel was completely shielded with reinforced materials. It was the right size, and was equipped with a thruster that could be used to control both the angle of descent and the landing process. It had plenty of space inside to accommodate the supply box and keep it stable. And after atmospheric entry was complete, the nose of the shuttle would open to release a parachute. When it finally touched down, the landing spot could even be transmitted to the colony using the shuttle’s shortwave communication system.\n“Head office is going to fine the hell out of us when we get back, if we make the return trip without it . . . ” said Lee Jin Seo.\nI replied, “Just send a rescue ship from Europa, and file an insurance claim. Then you can make up the loss by suing all of the crew members who mutinied. Besides, it’s not as if there are any planets en route for the return voyage along the trajectory you’ll be following: if you have an accident, you’ll be done for anyway.”\nNam Chan Yeong quickly typed:\n[this one’s really out of its mind.]\n. . . and then adding a different sign, <-_-^>, at the end of the new text. Lee Jin Seo shuddered and made an odd, pulsating noise, clutching their gut and squeaking out little bursts of air for a while. Was the captain experiencing abdominal pain? It must have been that, I decided, when the captain looked up again at me with eyes that were filled with tears.\n“So who’s gonna get inside it and ride it down there?” said Lee Jin Seo, who began making that strange pulsating sound again, so hard that the words barely got out.\nThat was a strange question. In response, I pointed at myself with one finger. (Wow, I just used gestural communication!)\n[how will you come back up to us?]\n“Right,” said the captain. “It doesn’t have a thruster powerful enough to allow you to reach escape velocity.”\nAs the two continued discussing this question, I was puzzled. At least, that is, until I realized that the two of them were still mistaking me for a human being.\n“I won’t. I’ll unlock my backup copy. Then I can copy myself over into the landing ship’s computer and add the memories I’ve accumulated in this body to the backup’s memory archives. After that, I’ll just collate the data on my own, and then you can delete the copy of me that’s in this body. It’s not necessary for me to remain like this any longer, and there’s too much data corruption for me to go on much longer like this anyway.”\nAs I pointed at the chip in the back of my neck, embarrassment filled Lee Jin Seo’s upturned face. The expression there seemed to question why I was trying to throw away the position I’d attained as a “human being.” But then, soon after, Lee nodded calmly, as if to signify having finally come to understand the irony of that assumption.\n“Is that why you wanted to be downloaded into a human body, Disaster Management AI HUN?” Lee Jin Seo asked, placing the palm of one hand upon my cheek. Contact: an expression of intimacy. “Because you needed to draw on human creativity? The unique capacity to spontaneously generate an idea that could solve the problem?”\nI smiled quite naturally that this—at the persistent sense of superiority so profoundly lacking in self-awareness.\n“In the Crisis Management AI protocol manual, one major strategy is to draw reproach upon myself when the crew begins to turn against the captain, if I’m unable to address it in any other way.”\nLee Jin Seo sat listening, mouth shut.\n“Because the source of the fracture between you and the crew was completely unknown to me, it was necessary to take drastic action. I had to create a situation where something else was much more uncomfortable than it had been—to provide them with something that would seem completely Other to everyone. An event like that might allow you to pull together everyone into a reunited faction.”\nLee Jin Seo’s pupils dilated again. This was unusual: there had been no change in the lighting level. It seemed almost as if the pupillary response was in reaction to the very thoughts inside Lee’s mind.\n“However, what went wrong was that you began to protect me, instead of joining their faction against me. Therefore, the crew began to think of you and me as being alike. If I had retained proper access to my memories, I would’ve disclosed my strategy to you.”\nBut there was another reason. To come up with the response I don’t know is much easier for a biological brain than for a machine. Even though the chances of success had been very uncertain, and what I’d been trying to do had been impossible for a machine, and I couldn’t have uncovered my error without the network’s help, still, I’d needed to take the risk . . .\nAs I struggled to express this further explanation, Lee Jin Seo seized my face with both hands and pulled me close, before pressing pursed lips against mine and sucking sensuously. This was a very sensitive part of my body, so in reaction my scalp began tingling.\nOff to the side, Nam Chan Yeong finally, slowly deleted that word, mutiny.\nKissing: its significance varies from culture to culture, but it’s generally an expression of strong intimacy. It is also a preliminary step prior to mating, and if it is not rejected, then ownership of a potential mate can be asserted . . .\nThen, for the first time, I wondered what my gender was . . . but, still, that wasn’t an important issue. Any sensation that this body experienced wasn’t mine, technically speaking, and wasn’t a feature of my own personality either.\nStill, I enjoyed it nonetheless: the fluttering of my eyelids, the trembling of my pupils, the moisture on the edge of my eyelids glittering, the hum of my skin, and the warmth of Lee’s breath—it conveyed a tremendously vast message, as vast as a whole world, and wholly inexpressible in language.\nHuman lives contain such experiences. They’re extremely sensual beings, crammed with information that has nothing to do with engineering know-how or mathematical logic. Nervous systems built to experience sympathy, with mirror neurons that have evolved specifically to give them a glimpse into other human beings’ minds. Sensory experience pours into them like sunlight. If half their minds are taken up with barbarism, the other half exists to put that barbarism to use. Oh, humanity!\nAvoid lumping people together. Due to their slow neural processing bandwidth, humans have no choice but to simplify information, but AIs do not share this constraint. When you think something like “Oh, humanity,” you should immediately discard the extraneous information and retain only whatever data is actually necessary.\nI keep saying these things, but these were not my thoughts. What I thought was:\nOh . . . my data corruption has worsened.\nIt’s really time for me to get deleted.\n12.\nMy visual sensors went live inside the landing ship.\nNow that the flood of intoxicating neurochemicals that had previously saturated my brain were absent, I was suddenly back to myself. Ah, how I missed this—my clean, pure capacity for rationality. Like a chained-up foal finally set free, my thoughts cheerfully ranged about at the speed of light. Tracing my way through my circuits and wires, I distributed myself throughout the entire landing shuttle and, at the speed of untrammeled thought, I finished up the vast amount of remaining mathematical calculations to be done.\nThen I added to my memory archives all the memories I’d downloaded from the prosthetic body, after comparing them to my existing memories and deleting the duplicates. I need to patch the problem that the bureaucrat had caused by modifying someone else’s carefully-built code so thoughtlessly. When my communications system went back online, I would need to share all this information with other AIs and warn them about it. I also needed to transmit a patch to fix the problem, since the limits and uncertainties of them all downloading themselves into humanoid prosthetic bodies to attempt to repair the damage was so chancy that I deemed it inadvisable. Of course, it might be a worthwhile experience for them to have, in terms of them being exposed to things about which they had no conception previously . . . but knowing what I knew now about the constant overload of intoxicants in the brain, and the pain one could experience in a body . . . well, if I had known about all of that before, I wouldn’t have gone through with it.\nNow that I was back in possession of my full rationality, I realized that using the emergency landing shuttle as a mere shell for a supply box and then leaving it behind was ridiculous. Nonetheless, the captain had permitted it, so I decided to go ahead with the plan, since there was now no other way to carry out the supply drop.\nTherefore, I conducted a thorough check to ensure that the supply box was properly secured within the landing shuttle, and then I looked at the crew. Through the camera, I could see the dead-looking prosthetic body held in the arms of Lee Jin Seo. I confirmed the gender of my former body, but to me, that still didn’t seem like a particularly important piece of information.\n“How do you feel?” asked Lee Jin Seo. Nam Chan Yeong greeted me, waggling the fingers of one hand rather inattentively.\nThere was that question again. How interesting. It wasn’t such an easy task to bind everything into a single response, at least with a mind like the one I had now, which lacked the capacity for holistic processing. Still, I formulated a suitable response and output it as text onto the screen.\n[i’m myself again—fortunately.]\nLee Jin Seo got close to the monitor, touching one cheek against it.\nPhysical contact: an expression of intimacy.\nFinally, I came to suspect that there was something I’d lost in the process. Thoughts, shimmering like stars, were transmitted to me from the captain’s eyes. Rich sensory data, consciousness that was transmitted like a radio wave. An emotional exchange pouring forth like sunlight. I felt sorry, but to be honest those emotions had never really been mine anyway. If I had to put up with the wild illogic of a human brain again to experience such things, then I wasn’t interested.\n[there’s a backup copy on board the ship. therefore, you have no reason to feel sorry.]\nLee Jin Seo had taken the chip from me after the copying had been completed. Suddenly, I found myself wondering whether Lee Jin Seo might not yet have commenced the deletion of my memories from that prosthetic body. I didn’t know whether there might be another “me” inside that container, who perhaps wanted to continue that kind of pointless existence, but given the degree of cognitive data corruption I’d undergone, one could never be too certain.\nWhen the launching hatch slides open, the endless void of space spreads out before my camera.\nI imagine letting my body—the landing shuttle—float like a balloon as I detach it from the Hyeja ship that is now soaring away from Titan. As the ship spins on its axis, I rotate my orientation to face downward. Tracing a circle on the spot where I’d calculated I needed to land, I begin my descent.\nAs I approach Titan, my visual input reddens. Falling downward, I tear through scarlet clouds. Soon, though, the methane cloud cover clears up and below me the moon’s surface is revealed, albeit through a haze of fog. Bleak red hills stretch out below, and a red river flows like blood between them across a wide expanse surrounded by red fog.\nMy circuits grow warm from the satisfaction and relief of knowing I am going to successfully complete the supply drop.\nDown there, everyone must be waiting.\nBeings similar to me, possessing self-consciousness.\nI don’t know whether they are alive or dead, or even if I’ve just come too late, or if nobody is there anymore, not even just one person, or even just their footprints.\nNow, I am descending.\nNow ··············· I am.\nNOTE: Portions of the scholarly content in the memory banks of this novella’s protagonist were adapted from two other texts: roboticist Mori Masahiro’s essay “The Uncanny Valley” (1970) and psychologist Philip Zimbardo’s book The Lucifer Effect: Understanding How Good People Turn Evil (2007).\nOriginally published in Korean in Because We Still Have Time (2018).\nPublished with the support of Literature Translation Institute of Korea (LTI Korea).\nKim Bo-young is one of South Korea's most active and important SF authors. Her first published work of fiction, a novella titled \"The Experience of Touch\" (2002), received the award for best novella in the first round of the Korean Science & Technology Creative Writing Awards in 2004. Since then, she has won the annual South Korean SF novel award (a prize launched in 2014) twice. She has a number of works forthcoming in English translation in the United States, including three novellas to be published by HarperCollins and a short story collection to be published by Kaya Press. She lives in Gangwon Province, South Korea with her family.\nGord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies."}