{"fingerprint": "0S00Ou15vJJZGmiifODH9KB0VMI=", "sitename": "Clarkesworld Magazine", "title": "Flowers on My Face by Geo-il Bok, translated by Elisa Sinn and Justin Howe", "author": "Geo-il Bok; Elisa Sinn; Justin Howe", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bok_07_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Flowers on My Face by Geo-il Bok, translated by Elisa Sinn and Justin Howe", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6750 words, short story\nFlowers on My Face\n1\nI carefully sat down on the plastic tarp covering the flat rock and sighed. Since my transfer to Flake Station, I’d visited this spot whenever I’d gone aboveground alone. It was at the bottom of a steep slope inside a small crater, hidden from others and well-guarded against flying objects.\nInstinctively, I put my feet on the ground and checked for signs, but the soles of my feet didn’t pick up any vibration. Nodding absently, I looked up and away from Jupiter, which dominated the sky. But my eyes returned there, as if drawn by some great force: Jupiter was so overpowering that it was impossible not to look at it. The planet seemed as if it might fall at any moment and crush this tiny satellite. No, it wasn’t the biggest planet in the solar system that would fall; it was this insignificant satellite I was on that would be dragged in by its terrifying gravity. Whatever approached Jupiter had to always be on the alert for its fatal embrace, a fact made evident by the tragic fates of nuclear fuel transports that approached Jupiter to obtain deuterium or tritium but instead obtained only engine failures.\nI was, of course, very well aware of these facts. Every piece of knowledge on Jupiter had been installed into me at birth, along with images captured by astronomical telescopes. Still, the world felt mysteriously new every time I saw it with my own eyes—as if it were the great god Jupiter himself. I suddenly felt somewhat peculiar, and cleared my throat. Perceiving something as at once both new and familiar was quite a strange feeling, of the kind that could not be put into words. That’s how I felt about Jupiter, a presence that was so familiar and dominating for everyone here on Ganymede.\nWhen my excitement tapered off, sadness crept up from somewhere deep in my heart, hovering over everything. Into everything that I had seen and remembered, and all of the feelings I’d felt. Throughout my body and soul, sadness seeped in like water. The longer I gazed up at the sky, the more forlorn I became, and the vague awareness of having lost something very precious wavered in the depths of my consciousness. I concentrated, trying to remember what it was that I missed, but found nothing.\nStaring up into the stars above the horizon, I slowly tasted the drops of my sadness. Moments of this sort, when my sorrow buried me, were bearable when I was alone; when I was among others, their liveliness made my despair seem even darker, and I grew still more depressed.\nSuddenly, a few fragments of memory stirred in a deserted corner of my mind. They gathered, struggling to take shape. There was the face of a young girl there, fighting to solidify out of those fragments, but her blurry visage eventually collapsed, the pieces scattered like petals blown from their branch by the wind.\nI exhaled, letting go of the breath I’d been holding, and rubbed my forehead as if I were wiping away droplets of sweat. A deeper sorrow awaited me in broken memories than in forgotten ones. Trying to still the lonesome wind in my heart, I slowly stood up. When I felt this way, the enormity of Jupiter blocking out much of the sky was somehow comforting.\n2\nAs soon as I stepped inside the south airlock, my ears tickled. Then, a scent reached my nose: the wet and sour aroma of organic molecules in the air. It almost sickened me, but at the same time something about it was enticing and bittersweet. Air had returned to the underground, filling it more and more, now that the subterranean complex destroyed by “the Great Disaster” had been almost fully restored. No more would we need to go to the surface, but we could travel anywhere through the tunnels.\nBecause I didn’t want to get noticed, I entered The Moulin Rouge by the side door. The café was particularly busy, with most people gathered around the big head table and intently listening to a stranger. Thankfully, this distraction prevented anyone from paying attention to me.\nI leaned against the bar, studying the stranger. There was definitely something unusual about him. Some energy hovered about his body like a powerful aura, yet his long beard made him seem old. On his head he wore a cloth like a turban, and his face looked gentle but strong. I took a few steps closer, as if drawn toward him by some outside force.\nJust then, he finished his story with a carefree gesture of his hand. People applauded earnestly. It must have been quite the interesting tale.\nThe mayor was seated beside the stranger, and he saw me standing there like an oaf between the tables. He called out cheerfully: “Hey, Jimmy, you’re here!”\n“Hello, Mr. Mayor. How are you?” Trying to conceal my embarrassment, I lowered my head.\n“Same old, same old. How about you?”\n“Likewise . . . ” I answered vaguely, searching for a way to escape.\n“Dr. Julius,” the mayor turned to the stranger, “this young man is Jimmy Chan. He was revived last month. He used to work for the Hyclide Power Station and was patrolling the Hashimoto Plateau when the Great Disaster struck. He’d been buried in ice and was only discovered by chance.”\n“Oh, is that so?” The man respectfully bowed his head toward me. “It’s a pleasure to meet you. We wouldn’t have survived if it wasn’t for those who protected the Hyclide Power Station.”\n“Nice to meet you, too.” I answered politely, bowing back to him.\n“Jimmy, this is Dr. Bonas Julius. You must’ve heard of him. He’s a renowned linguist and a very popular poet and musician.”\nI had never heard of any renowned linguist and popular poet and musician named Dr. Bonas Julius. Yet I bowed my head again politely, mumbling a few words that even I couldn’t hear.\n“Dr. Julius is on a nationwide tour. He heard about our town while visiting Drake Station and decided to make an unplanned stop. Oh, right! He’s also extremely good at face reading.” The mayor turned to Dr. Julius, and said, “Dr. Julius, would you mind reading Jimmy’s face?”\nWithout replying, Dr. Julius began staring at me, his kind eyes suddenly turning sharp and piercing.\nAs I turned my head away from his gaze, the mayor’s words finally registered. A fit of frustration stirred, and my feelings were clouded by a haze of bilious yellow bubbles.\nHumans enjoy the art of physiognomy. They use a variety of tricks to try to divine their future: astrology, palm reading, face reading, tarot reading, crystal reading, interpreting the I Ching, interpreting the Sexagenary Cycle, and more. The types of tricks they rely on are, indeed, innumerable—and in ancient times, some human societies even employed corpses for this purpose. I’m not dead set against such customs, mind you. In a way, I find them rather well-suited to human nature. Objectively speaking, humans are all freaks. They are rational beings that nonetheless behave irrationally. They are reasoning thinkers that casually engage in unreasonable behaviors. It seems to me perfectly suited to their nature that they would fret over their destinies by playing with gimmicks of this sort.\nBesides, face reading is at least somewhat rational. A person’s physique does reveal plenty of information about their personality, health, and background. In particular, the shape of the head and the face holds valuable clues, and it wouldn’t be too hard for someone wise to use what people’s faces convey to speculate regarding their futures.\nWe, however, are not human beings: we are robots. Our bodies are not composed of flesh and bone, but of materials like alloy steel, plastic, mineral fiber, and ceramics. We don’t become who we are through a long period of growth and development, but are assembled in a sudden flash inside a factory. Naturally, there is little variation between our bodies, and our mannerisms and facial expressions are much less creative, unique, and subtle than those of humans. Our faces’ lack of expressiveness was something that humans often complained about. Which is to say that attempting to read a robot’s future in its face is a truly ridiculous notion.\nNonetheless, sitting before me right now was an elderly robot with his paint chipped off, attempting to divine my future from my face. Of course, robots enjoy imitating ludicrous human behaviors: we don’t even care what the behaviors mean, or whether they make any sense. The fact that they were things humans did was a good enough reason for us. I myself used to enjoy rock climbing. If that isn’t nonsensical, I don’t know what is! How can you explain the desire to climb up frozen rocks despite the risk of getting injured or even dying when there is no tangible reward whatsoever? Still, I’d taken pleasure in rock climbing, and whenever I could, I climbed in craters that many others wouldn’t dare visit. Eventually, I’d become known as a rock-climbing expert, and after that I’d joined the task force organized to protect the transmission network.\nStill, some things were just too ridiculous for robots to mimic, and face reading was certainly one of them. What I found even more annoying was that I’d been made the subject of this nonsense. The bilious yellow frustration that had bubbled up inside me was now transmuting into crimson anger. I stared straight back into the doctor’s studying eyes, straining so hard to express the rage within me through my eyes that I felt as if my face began to stretch.\nThe ancient robot continued scrutinizing my face sharply. He resembled nothing so much as an entomologist examining some intriguing bug.\nThen, an odd realization startled me: when the mayor had introduced me to Dr. Julius just a moment before, he had not spoken aloud his true intent. He hadn’t mentioned to the doctor that my experience-memory panel had been almost completely crushed, and therefore I’d lost my memories of nearly everything that I’d ever experienced. Everyone who knew this, including me, believed that my depression was rooted in this mechanical amnesia. He had, intentionally withheld a crucial piece of information about me from the face-reader. However naïve and good-hearted he seemed to be, the mayor was in fact quite clever. Which fit with the rumor I’d heard about how, before the Great Disaster, he’d worked as a sheriff at Rodriguez Station.\nSo that’s what this is about. With a surge of interest, I cast a quick glance over toward the mayor. It’s not my fortune he’s interested in. It’s whether Dr. Julius can . . .\nThe mayor didn’t acknowledge my inquiring look, but merely kept that smile fixed on his innocent-looking face and continued to watch Dr. Julius from the side.\nDr. Julius was a keen observer. He must have sensed this slight shift in my mind, for the curiosity in his eyes deepened. It wasn’t surprising. If you introduced yourself as a face-reader, whether you were a robot or a human, you must at least have a knack for noticing minor changes in facial expression, gestures, and tone of voice. Dr. Julius glanced around at the group, which was eagerly watching him. Finally, his eyes fell upon the mayor seated there beside him.\nThe mayor seemed uncomfortable under his gaze, and, clearing his throat, turned his head away.\n“So, Mr. Chan,” Dr. Julius said, staring straight at me, “you were buried in ice for thirty years.”\n“Yes, twenty nine years and eight months to be precise.”\nHis face suddenly turned grave as he observed my face. Then, in a low voice he said, “People always ask me about their future. But I only tell them their past.”\nThe room was silent as he muttered these words. No one dared to speak, and they all seemed to be trying to figure out his puzzling words. Eventually, the mayor coughed dryly once more. As if that were some cue, people rustled, shifting positions and clearing their throats.\nDr. Julius turned toward the mayor. “Mr. Mayor, I’m afraid my eyes are quite dim today. I can’t see very clearly. So, unfortunately, I won’t be able to say anything about Mr. Chan. Next time I get a chance, I’d like to try to read his face again.”\n“Yes, of course. Perhaps next time you visit our town, then . . . Thank you very much, doctor.” The mayor responded, his voice cool and his manner unflustered by this unexpected outcome.\nPeople nodded, but nobody was fooled by the doctor’s conciliatory words: it wasn’t hard to guess that the signs he’d read in my face were not good.\nMy heart sank further, but I appreciated his kindness and bowed my head very politely. “Thank you, Dr. Julius.”\n“Mr. Chan, I do wish you the best of luck,” he said with a warm smile and a hint of sympathy in his voice.\nHis sympathetic tone burned my heart like some toxic solution, and I flinched. Pity was the last thing I wanted right then—especially from a stranger, in front of so many other people. Struggling to keep my face still, I turned and left the café.\n3\nWithout truly seeing them, I looked upon the desolate, unfinished roads that I marched down, my motions exaggerated and my head held up high. A cold flame blazed inside of me. It was the kind of fire that froze your heart instead of warming it.\n“There’s no need to be upset at the face-reader,” I reasoned with myself. “He was just trying to be kind, not putting me down. If everyone I meet notices sooner or later that I’m not entirely well, how much more obvious must it be to a face-reader?”\nDepression is one of the few illnesses from which both robots and humans suffer. Typically, it is incurable for us. Because robots have a “care circuit” installed, we’re incapable of harming ourselves or others, so a robot can never kill itself. Or at least, such a case has never been reported. Still, when robots fall into a deep depression, they often behave just like a human in despair. Pyotr Velinkovsky, the micro-mechanist who revived me, told me that dealing with depression was much more difficult for robots than for humans. After all, since most diseases that afflict humans are caused by chemical reaction, drugs can inhibit those reactions and ease the symptoms to some degree. Unfortunately, that doesn’t work for robots.\nAnd so everything I saw was suffused by the waves of sorrow that crashed over my heart. The despair found its way into those few fragments of memory that I still retained, seeping into every last trace and even into those empty spots where the last trace of memory was gone.\nA sigh escaped me. What did I lose? What am I pining for? What vanished with those lost memories? I don’t know, I really don’t. What I’ve lost, what it was that I once treasured . . . I don’t know.\n4\nAfter walking this way for some time, the northeast airlock came into view. Near the airlock, a big woman was humming and watering flowers. The long, narrow garden along the road was brightly lit and filled with flowers. Gardening had become a thing on Ganymede these days, and everyone seemed to think that each robot with even a shred of dignity ought to keep a garden.\nRobots obsessing over gardening. Honestly, it’s very odd. Since we’re constructed from mechanical parts and electronic circuits, we tend to shun moisture, but gardening requires proximity to water. So, as humans would say, robots and gardening aren’t “harmoniously matched.” Still, we didn’t care much about fortune-telling. When the Hyclide nuclear plant started generating electricity again, the very first thing we did was to repair the broken airlocks and fill the underground complex with moist air.\nOf course, I was dead at the time, but I always hear others jabbering about how great it was when the air was refilled. People couldn’t stop chattering for days on end. They were so excited about being able to hear voices again. Now, we robots can use radio communication when we’re in a vacuum, but for some reason, communicating via radio doesn’t feel comfortable or pleasant to us. We prefer listening to one another’s voices, just as humans do.\nIt’s the same with gardening. On Ganymede, flowers have a special meaning. Because the surface of the satellite is frozen, corpses don’t rot here, and even underground, there’s no bacteria to decompose a body. That’s why the people who first settled Ganymede came up with a funerary custom suited to this environment. When a human died, they placed the body in a crematorium and then heated it up very slowly, so that all of the moisture in it could evaporate. Then the dried-out corpse was ground up into fertilizer. You have to understand that in this frozen world, a body made up of water and organics was just too good a resource to abandon. By these means, human bodies were able to return to life as flowers.\nIn 2998, Comet Rashid collided with an asteroid and was smashed into many pieces. One of those pieces slammed into Ganymede, causing the Great Disaster that killed off all of the humans living here. In the wake of the disaster, the most urgent task faced by the surviving robots was to conduct funerals for all of the dead people. They made a heroic effort, but digging every last body out of the ruins of those underground cities had been exhausting enough, let alone performing proper funerals for everyone. It would have taken many, many years for all of those humans who died in the Great Disaster to be reborn as flowers.\nI hesitantly approached the woman. The plants in her garden were all small, common flowers like garden balsam, moss roses, pansies, violets, and cyclamens—and they were all in full bloom.\nSensing someone approaching, she turned around. “Oh . . .”\nHastily bowing my head, I said, “How do you do?”\n“Hello, young man.” She smiled brightly as she straightened her back. “You don’t look familiar. Are you new here?”\n“Yes, I arrived a month ago.”\n“Oh, you’re that youngster Pyotr found and revived, aren’t you?”\n“Yes,” I said with an embarrassed smile.\n“Happy to meet you.” She held out her hand. “My name’s Ludsk 2201, but I go by Elizabeth Encush, and my friends all call me Liz.”\n“I’m Ruport 18034, and I go by Jimmy Chan. Please call me Jimmy.”\n“Ever since I heard your story, I’ve been meaning to stop by The Moulin Rouge. But then the fertilizers came in from Borsalino Station, so I’ve been busy with that new flower bed.” She pointed to an empty plot of earth that had just been laid out.\n“I see. Well, you have a wonderful garden. The flowers are so lovely.” I looked around in admiration. The flowers were indeed lovely, though even more marvelous were the butterflies and bees flying among them.\nShe nodded cheerfully. “I figure the dead will be a little less sad now.” She squatted in front of a particularly charming garden balsam and beckoned to me. “Think about it, Jimmy. How many of their bodies did it take for this lovely flower to bloom? How many bodies do you think went into the Borsalino factory? Thousands? Tens of thousands? Countless corpses were turned into fertilizer, so they could be scattered and finally burst into life as these flowers. How marvelous! How fortunate! Wouldn’t you say that’s a true revival?”\n“Yes, it really is.” I squatted next to her and stared down at that plump little flower. Out of nowhere, despair rose in my heart. I turned my head to hide this unexpected surge of emotion, and something caught my eye: a cluster of frail-looking, leafless flowers off to the side, standing in a corner of the garden. “What kind of flowers are those?”\n“Which? Those ones over there?”\n“Yes.”\n“Why, they’re azaleas. I guess you’re not much into flowers?”\nI laughed sheepishly. “No, not really . . . I notice them when they’re around, but that’s pretty much it. Do you like gardening?”\n“At first, I was scared about the watering. After all, we are not that crazy about water, are we?” She smiled at me with her eyes. “I still sometimes forget that they’ll wither and die if I don’t water ’em.”\n“Liz, does growing flowers make you . . . happy?”\nShe nodded. “It does. Tending flowers, it’s different from other kinds of work or chores. Think about it, Jimmy. If we trace back our ancestry to what first made us, they were living creatures, with bodies and forms, right? So I guess it’s only natural that we’d feel joy from tending life.”\nI nodded as I looked deep into her eyes. “Liz, you lost many human friends too, didn’t you?”\nWith a bitter smile, she nodded. “I’m pretty old . . . I lost everyone.”\n“I don’t even remember who I lost. I have no memory,” I confessed impulsively.\n“Oh . . . ” She sighed deeply and stared down again at the garden balsam before us. “These days, looking at these flowers lightens my heart. Sometimes I see the faces of my dear friends in the flowers.”\n“You do?”\n“Well, the friends I loved died, but in a way, they live on in these flowers. If you look into the blooms, you can see those who have yet to be born—generations of future flowers, sleeping inside these flowers here.”\n“Generations of future flowers, sleeping inside these flowers . . . ” I mumbled after her, and then, I studied her face. “Liz, what did you do before?”\n“Before the Disaster, I worked at Galileo University. I taught religious philosophy.”\nI stood up and looked around the garden. “I can see the long and winding road of samsara here, all at once.”\nHer smile was radiant. “You really can, can’t you? From human to flower, then from one flower to another, or sometimes to a butterfly or a bee. That’s not such a bad fate at all, is it?”\nI said, “I should go now.” Then, again acting on impulse, I added, “Liz, would it be okay if I stop by again and help you out here occasionally?”\n“Sure, Jimmy.” She stretched out her arm and gestured toward the road. “My dream is to turn all of old Dragon Street into gardens. To cover everything here with flowers. There are still so many bodies waiting to be processed, and I’m going to help them be reborn as beautiful flowers. Then, when humans return to Ganymede, I’ll show them the flowers and say, ‘Here, your ancestors have been waiting for you.’ I chuckle to myself, imagining the look on their faces when they hear me say that.”\n5\nThe airlock opened to reveal a long tunnel, and at the far end of it was a small, so far unrestored, town. At the edge of the town stood a sign that read NIGER STATION RESTORATION PROJECT.\nLike with everything else these days, the restoration work dragged. One bulldozer and a pair of haulers stood in the middle of the road, and there was nobody around. Sparse streetlights cast a lonely glow on the emptiness there. What this project needed was human beings, and their indispensable boldness and drive. They constantly came up with fascinating projects and pushed them to completion with remarkable energy. Once they got things started, we robots worked on and on, tireless and without need of rest, and this synergy between humans and robots accomplished many seemingly-impossible tasks.\nI wandered the ruins. Looking around, it somehow felt like the tragedy that had befallen this place thirty years ago could’ve happened just a week ago. There was nothing here to disturb or cover the remains. No sunshine, no wind, no sudden changes in temperature, no bacteria, no grass, and no bugs—only a profound sense of emptiness.\nAfter wandering for quite some time, I arrived at a dead end beside a little house built into the bedrock. The gate had been flung free of its post and still lay abandoned on the ground. Boxwoods bordered a small garden, their flowers stooped to the bedrock and completely withered, yet somehow still holding their shape.\nSome irresistible force drove me through that gateless entrance. The tiny front yard was strewn with a jumbled disarray of broken and shattered objects. I felt like an intruder and hesitated for a moment before bracing myself and cautiously making my way across the yard and into the dark living room.\nA dim light in my chest illuminated the shambles within. Pieces of shattered glass and broken furniture lay everywhere. My footsteps disturbed the dust. The other rooms were the same, everything in such disarray that it made my head spin. Still, at least there were no corpses. This relieved me, and it was only then that I realized how, deep down, I was anxious about the prospect of coming across a dead human.\nAs I turned around to leave, I noticed a small door in the corner of one room. I forced it open and peered inside, and immediately flinched. There were humans lying on the floor in there. Three of them. One young man, one young woman, and a baby. I stood still at the door, looked down at them for a long time. The woman was holding the baby tightly, as if she’d been trying to protect it. Meanwhile the young man half-covered the other two.\nFinally, I sighed. Since I knew that humans shunned leaving corpses uncovered, I looked around to see if there was anything I could use to cover them. Fortunately, there were some blankets on one side of the room. I placed one on top of the embracing family, and then I radioed Drake Station City Hall. Drake Station was the closest city with a crematory. The voice on the other side said there were just too many bodies waiting to be cremated, so they couldn’t take anything in for another year or so. I gave them the house’s location and then I disconnected.\nI could do nothing more for the dead, but still I lingered there. Something burned inside me, keeping me in that place. By the light on my chest, I looked around once more. This looked like a baby’s room. There was a child-sized bed in one corner, and toys and picture books lay scattered across the floor. A little piano stood in the room’s other corner. I walked up to it and lifted the cover. There was a small book inside: a collection of children’s songs, well-thumbed, its corners worn.\nI could clearly picture the woman sitting there with the book open, singing to her baby, and my melancholy returned. Did having tender bodies make them more affectionate? I wondered, gazing at the bodies lying on the floor once more before carefully opening the little book. I saw a song titled “Over the Rainbow,” and a strange feeling came over me.\nWithout thinking, I played the melody with one hand as I read the lyrics. Before I knew it, I was singing along. Ah . . . yes, I know this song. Below the title was a line of text: “From the movie The Wizard of Oz.”\nI sat up and played the piano with both hands, singing about blue skies somewhere beyond the rainbow, where dreams might come true.\nMy heart swelled with feelings that were at once unrecognizable yet oddly familiar. Just when I thought my circuits were about to burn up, overloaded with such searing emotions, I sensed something happen in my head: something that had been dislocated suddenly reconnected, and fragments of memory on the horizon of my mind merged together to form the shape of a little girl. Seeing me, she ran happily toward me, shouting aloud. My heart contracted with a dense yearning, and I reached out my hands toward her. Here, grab my hands, quickly! When her small hands were just inches from mine, something invisible seized her. She struggled and fell over. Then, she sank back down behind the horizon of my mind, leaving me in that dark room, filled with the sound of my own moans.\nFor a long time, I simply stood there, my hands still stretched forward, my heart filled with that relentless sorrow. I didn’t know what to do when my heart ached this way. Unlike humans, who experience the pain of parting from early on, a robot like me never got the chance to learn how to cope with losing a loved one. I’d never had a parent, or a sibling, or a lover, and so I’d never had to lose anyone, until . . . The sudden sense of loss that unexpectedly gripped my heart made me dizzy, so I closed my eyes and concentrated on my respiration.\nOnce my heartache lightened a little, I approached the three people and kneeled down next to them. Slowly, I lifted the blanket and looked at the baby clasped to its mother’s breast. Looking at this baby, all skin and bones, summoned something desperate up from the depths of my heart.\nI stood slowly and began singing once more. I sang for the baby, and I sang for that girl that had disappeared again beyond the horizon of my memory, too.\nAfter finishing the song, I kneeled once more beside the family. “Rest in peace, baby. Rest in peace. Your mother and father are watching over you, so don’t you worry about anything. When you wake up again one beautiful spring day, you’ll know—you’ll know that you’ve become a lovely flower. Until then, rest in peace, dear baby . . . ”\nI straightened myself and lifted my hand to salute the family in their deep, long sleep. Then I switched off my chest light and left them in complete darkness and silence. Only a while later, when I was back in the tunnel, did I notice the new bounce in my footsteps.\n6\nLiz wasn’t in the garden when I returned through the airlock. Instead, only well-watered flowers greeted me. I looked out across them as if seeing them for the first time. A bumblebee buzzed around the garden balsam that Liz and I had marveled at earlier.\nThen a sudden chill struck my heart. Wouldn’t it be nice if there were someone next to me right now, someone with flesh, to admire these flowers with? The flowers would probably rather see a human here than a robot, since they themselves were once humans.\nI looked up instinctively, as if the sky were visible above me, with old Earth in it. Staring instead at the rocky ceiling above me, I said aloud, “Why don’t they come? They know we’re here.”\nWe ask that question all the time here. Many humans live on old Earth, but they stopped coming to Ganymede after the Great Disaster. Once they confirmed there were no human survivors here, they lost all interest in this place. A rescue shuttle dispatched from old Earth came and retrieved all of the humans from the other Jovian moons and took them back to the planet where humanity had originated, but they abandoned everything else, even the robots that had worked with humans on those other moons. We had to send rescue shuttles to bring all those robots to Ganymede.\nThe heartlessness of humanity’s behavior had scarred us deeply. It proved that they didn’t think of us as people, but simply as lumps of metal—machines that could easily be tossed away as soon as we ceased to remain profitable. Of course, we never expected the humans of old Earth to treat us the same way the humans on Ganymede had: we’d gotten so used to the quasi-citizen status that Ganymedean society had granted us by law that we were completely unprepared for the Earthlings’ attitudes. On Ganymede, everyone had understood and believed that homo sapiens sapiens and homo sapiens roboticus should live in harmony, each a fitting counterpart to the other.\nIn any case, I missed humans. I thought that if only I could look upon these flowers with a human being beside me—like the little girl who had momentarily appeared over the horizon of my memory—then the darkness cast over my heart might have lightened. This longing, which filled my heart with a cold ache, strangely strengthened my belief that humanity would someday return to Ganymede, and that we then could once again live here in harmony, helping and complementing each other. In the harsh environment of outer space, that was the only way to survive. As if they all agreed with me, the garden balsam flowers, the moss roses, and the azaleas, each bearing their own stories from previous lives, looked up at me and smiled brightly.\n7\nWhen I got back into The Moulin Rouge, the café was bustling as usual. There were even more people there than before.\nAn earthling bereft of love or money,\nWhere am I headed? Where?\nIn the midst of that ruddy desert,\nIn the midst of that arid sea,\nA lonesome lighthouse, a lonesome lighthouse.\nIn the accursed year 2530,\nOn the first day of the first year,\nI reached it.\nOn accursed Mars,\nIn the accursed desert,\nThe lonesome lighthouse, the lonesome lighthouse.\nEveryone looked delighted as they savored Dr. Julius’ song. Poets always received such a welcome, wherever they went—and here was one who could also read faces. Little wonder that people had flooded the café.\nI didn’t want to deal with the face-reader, so I stood at the bar and drank my beer. It was tremendously refreshing, after my long walk. When Dr. Julius finished “Lost on Mars” and set down his guitar, applause and whistling erupted throughout the café. Still, even with the crowd and the clamor, the face-reader managed to spot me.\nI was startled, but quickly I regained my composure and bowed my head. Then I took a seat at the nearest table, next to Pyotr. Ever since he’d repaired my damaged circuit panel and revived me, he’d been like a guardian to me.\n“Jimmy, you should try this.” He pointed to a delicate-looking glass that sat on the table before him. It contained a reddish, threatening-looking liquid. “It’s Kenji’s new recipe, and it tastes really interesting.”\nKenji Tanaka was a bartender at the café who had a knack for coming up with interesting new cocktails. Pyotr said that Kenji was the reason behind The Moulin Rouge’s fame, and that thirsty souls made a point of visiting the place even from faraway cities.\nI nodded, and Pyotr turned to the guy clearing the next table over and said, “Sean, two Red Fujis, please.”\nBefore Sean was back with our drinks, Scarecrow, our settlement’s chief librarian, dragged his skeletal frame up to our table. “Jimmy, Dr. Julius wants a word with you.”\n“Me?”\n“Yeah, that’s what he said.” Scarecrow threw a glance at the head table.\nI also briefly glanced in that direction, and found the face-reader studying me intensely. Wondering what he wanted, I pushed my way through the crowd toward him.\nThe face-reader exchanged glances with the mayor and then, in a low voice, he said, “Please have a seat, Mr. Chan.”\n“Alright.” I was puzzled, and my voice came out raspy.\n“Here, Jimmy.” It was Annie Boyd, the town clerk. She rose hastily and offered me her seat, the one right across from the face-reader.\n“Thank you, Ms. Boyd.”\nWhen I sat down, silence descended suddenly all around us. People were observing our table with great interest, and their curious attention stung my face like needles.\nThe face-reader gazed into my eyes again, and softly said, “Mr. Chan, I couldn’t read your face well before because my vision was blurry. But I can see much more clearly now.”\nBehind me, someone cleared their throat in anticipation, but I just sat there and calmly looked into his unexpectedly tender eyes.\n“So, what does Jimmy’s face tell you, Dr. Julius?” asked the enthusiastic mayor.\n“I see a flower on Mr. Chan’s face. One truly radiant flower.” His bright smile made his heavily chipped faceplate somehow almost resemble the face of a kindly old human being.\nAs for me, I was astonished. “A radiant flower” was a splendid image for how I was feeling at the moment. Marveling at his keen observation and poetical metaphor, I bowed my head deeply. “Thank you, Dr. Julius . . . ”\n“A flower?” asked the mayor.\n“Yes, there is a glowing flower on Mr. Chan’s face.” His smile widened as he turned to the mayor.\n“A flower . . . ” The mayor repeated contemplatively, rubbing his chin. “Isn’t that a good sign?”\n“Definitely. A flower signifies life. If there were no flowers, we wouldn’t be here, either.”\nThe mayor nodded his head with a big smile. The crowd behind me burst into applause. Dr. Julius lifted up his guitar and started playing again, as if that was the most natural thing for him.\nLast stop for doomed good-for-nothings,\nI arrived here on wretched Ganymede for the first time.\nDescending from the rickety spaceship with spinning thoughts,\nI stepped out of the New Houston Space Station.\nIn a tiny alley behind Erongos Square,\nA tiny girl watering a garden filled with moss roses\nLooked up at me and softly asked,\n“Where did you come from?”\nThough his voice cracked on the high notes, he sang nicely, and his guitar sounded amazing. When the mayor had introduced Dr. Julius as a renowned poet and musician, it hadn’t just been out of politeness.\nA few people sitting nearby began to sing along with the song: everyone knew “Near Erongos Square.” The verses had been borrowed from the last stanza of that remarkable poem, “Where My Flesh and Soul Point Toward” by RUFOB1002, the only robot author that human beings considered to be a true poet. Her poems had been praised by human critics and were even very popular on old Earth.\nDr. Julius acknowledged the people singing along with a nod, and he began singing the tune again from the beginning. This time, even more people joined in.\n“I come from the place where the sunshine comes from.\nWe all come from the place where the sunshine comes from.”\nNodding her head, the girl spoke again, asking,\n“Where are you going?”\nSoon, everyone in the café was singing along. Before the Great Disaster, humans and robots had used to sing this song almost any time they got together.\n“I’m headed to where the sunshine goes.\nWe’re all headed to where the sunshine goes.”\nNodding with a serious face, the girl spoke again, asking,\n“Are there flowers there as well?”\nI nodded, pointed to the heart—\nTo her heart and to my heart.\n“Wherever people go, there are always flowers.\nWe all carry the seeds in our hearts.”\nThe singing grew so loud that it became nearly deafening. As I sang along with that poet who sat there, smiling kindly as he played his guitar, I felt a flower—one which I hadn’t even realized had been part of me—opening its bud upon my metal body.\nWhen the song was over, the mayor jumped up and waved his arms like a conductor, shouting, “One more time!” Everyone cheered.\nLast stop for doomed good-for-nothings,\nI arrived here on wretched Ganymede for the first time.\nDescending from the rickety spaceship with spinning thoughts,\nI stepped out of the New Houston Space Station.\nIn a tiny alley behind Erongos Square,\nA tiny girl watering a garden filled with moss roses\nLooked up at me and softly asked,\n“Where did you come from?”\nIt was enchanting, all that singing. With our hearts pining for all those humans who had lived and died on this moon, with the voices that were full of longing for those still waiting to be reborn as flowers, we sang our song, raising our voices as if the sound of our singing might reach old Earth, the place where we all, humans and robots alike, had come into being . . . as if we were trying to let the humans there know that we were still here, still waiting.\nI nodded, pointed to the heart—\nTo her heart and to my heart.\n“Wherever people go, there are always flowers.\nWe all carry the seeds in our hearts.”\nOriginally published in Korean in the collection Rome of Wistfulness.\nPublished with the support of Literature Translation Institute of Korea (LTI Korea).\nBok Geo-il graduated from the Business School of the Seoul National University and held various jobs in banking, manufacturing, and trading until 1987 when he made his literary debut with the novel, In Search of the Epitaph (Bimyeongeul chajaseo). A writer of many interests and multifarious voices, Bok has also experimented with science fiction as a vehicle for exploring the effect of scientific innovations and technological development on human life. Notable among his science fiction works are Under the Blue Moon (Parandal arae, 1992) and A Wayfarer in History (Yeoksa sogui nageunae, 1991) which features time travel back to mid-Joseon Dynasty period.\nJustin Howe was born and raised in Massachusetts. His work has appeared in Strange Horizons, Spacesuits & Sixguns, and The Internet Review of Science Fiction. His story \"Skillet and Saber\" will appear in the anthology Fast Ships, Black Sails available from Night Shade Books in October 2008. He is a graduate of the Odyssey Writers workshop, works for an architectural preservation company in New York City, and belongs to the Homeless Moon."}