{"fingerprint": "ZjHEtRTw6RDCT7UIxDEScgrNUDw=", "sitename": "Clarkesworld Magazine", "title": "Terra Rasa by Anastasia Bookreyeva, translated by Ray Nayler", "author": "Anastasia Bookreyeva; Ray Nayler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bookreyeva_02_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Terra Rasa by Anastasia Bookreyeva, translated by Ray Nayler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5660 words, short story\n Terra Rasa\n The train hurled along at such speed my ears kept popping. We rushed through Voronezh in minutes. More accurately—through what was left of Voronezh. Where there had been a river, there was an empty trough. The fire had burned away the flesh of humanity here and retreated—for a time.\n Back when trains went slower, I loved looking out the window at the villages—the houses with their yellow windows, the forests and fields. Boring, sure—but this was my country, after all. I especially liked the railroad that ran along the foot of the Caucasus Mountains, the trains to Sochi rushing to the sea and back.\n Now there was no more railway—and no more Sochi. Sometimes it seemed the mountains were gone as well.\n Despite the air conditioning, it was so hot you wanted to strip down to indecency. At the depot the trains were sprayed down with flame-retardant solution. But that wasn’t enough. They also had to be hosed down periodically with non-potable water from tanks stationed along the rails.\n The train was supposed to be full, but in fact there were many empty seats. Across from me in my compartment sat a grandmother with her granddaughter. Next to her was a fat man in a tie and long-sleeved dress shirt. I still remember his sweaty face. News reports flashed across the television at random. The grandmother sat nervously. And then there was the priest in the upper berth—as grim as the latest weather forecasts. Toward evening, he began singing psalms.\n The grandmother had one of those faces that told you at any moment she might pull smoked chicken, boiled eggs, and a pickle out of her pocket. I was almost drooling just thinking about it. Luckily, she didn’t do anything of the kind: I don’t know what I would have done if she had.\n “Are you headed to Murmansk?” she asked, as if there were other options.\n “Yes. To the bay.”\n All the ships were leaving from there, headed for the pole. As she well knew, of course. The only question anyone was asking was how to get there. People didn’t think about anything else—about food or a roof over their heads. All they thought of was of something to drink. Up there was snow, ice—and that meant salvation. The problem was, there were practically no ships left.\n “Where are you from?” I asked.\n “From Saratov.”\n Saratov, Volgograd, and everything around them had burned first.\n “Do you have money?”\n “Burnt.”\n In truth, there was practically no money left in the world. A world without money. What could be better? Maybe we’d ended up in heaven and just didn’t realize it yet.\n I decided not to ask about the parents of the child sitting in front of me, frozen in a doll-like pose.\n “I’ve seen so much sorrow. I’ve seen everything: War, and hunger. But nothing like this,” Grandma said.\n “Exactly right,” said the priest. “This was visited upon us for a reason.”\n Great. Now it would start—the talk about anger from on high, about the end of the world and all that. This was the crap that had driven my boss crazy right at the beginning of it all. It came into his head one hot morning that we all needed to confess. He forced everyone to run off to church. The next day, the church burned.\n I have no idea what happened to my boss. The evacuation took place, as usual, in total confusion.\n “Don’t talk to me about God. He’s not worth praying to, if he allows all this to happen,” Grandma said angrily. “And what are you doing here, I’d like to know? You should have burned up along with your flock.”\n I decided not to stick my nose into any religious arguments. But anyway, it was clear you don’t just end up on this train. This was the last high-speed train from the south. All the airports had closed long ago. At first from stupidity—and then necessity. Incidentally—this grandmother and her child ending up here? Even that was some kind of miracle. But the priest?\n This trip was one-way. The authorities had selflessly fled to Siberia—where, by the way, fires were also raging. Only the temperature was a little lower. That was exactly why so many people were saying God was to blame: only He, they said, could make things burn that were never meant to burn.\n In my opinion, He had nothing to do with it. Whose fault was it? I had no idea. And no time to think about it, anyway.\n Down at the end of the railway carriage, someone began to cry loudly. Between sobs he said, over and over, “Where is this fucking train going?”\n It was clear enough where: To the end of the tunnel. But there was no light there—we were all very mistaken on that account.\n “Night, street, streetlamp, pharmacy . . . ” I mumbled.\n All the streets, streetlamps, and pharmacies had long ago turned to ashes.\n I wanted to smoke, but I’d quit when the fires started. A lot of people quit—almost everyone I knew. It was hard to hold matches or a lighter in your hand nowadays.\n A dismal landscape drifted past—burned villages and forests, their outlines sketched behind the leaden wall of smoke. Scattered red blotches of flame. The fire swept in one direction and then another. After it passed, nothing was left but gray-black dust.\n “Everything will be like this,” I said to myself. “There’s no way out . . . ”\n Fall came late, that year. The leaves began to fall, but without changing color. Everyone waited for winter, but it never arrived. They waited for it the following year. And then they stopped waiting. And the fires came . . .\n Air conditioners disappeared from the market, and the polite girls at the electronics stores apologized.\n They apologized for two weeks, while the telephone lines and electricity held out. Then the stores closed. The aquifers dried up. The lakes and rivers shrank with every passing day. A liter of drinking water was worth a fortune.\n People turned primitive slowly, but irreversibly. They came to hate one another. They were prepared to commit any act of cruelty for a drop of moisture.\n The more or less normal among us became volunteer rescuers—although everyone knew it was useless.\n I wasn’t normal, but I volunteered—and I understood the futility of it. Better to occupy your brain and your dehydrated body with something than to simply die of despair.\n The drought and constant fires led to a shortage in food—but the lack of water was more serious. The government gave out all its reserves of food, caches the public hadn’t even known about. When there’s no future, why conserve any longer? Tins with unknown markings and white labels were scattered everywhere. The contents were always mushy and tasteless—but at least not rotten. Sometimes they made me nauseous, and I ate almost nothing. Only anger gave me the strength to stagger on.\n The most terrifying of all the things I saw was burning people. They lit up as if on their own, falling into fiery whirlwinds and dying in moments. Sometimes it seemed the vortex came from nowhere at all. A man would be walking, say, on the sidewalk, and suddenly the air around him would begin to drift and crackle, becoming so thick with its own inner life it seemed you could touch it.\n There, in that transparent jellyfish mass, people said you could see strange forms. Beautiful, delicate atomic worlds. No one who saw those mirages could describe them to anyone else.\n I had nightmares almost every night, waking up cold and wet, filled with death. The fire had burned away everything in me. Every morning was another looming hell.\n I sat across from the old woman and thought: Does she really understand how lucky she is? At the station where she had boarded, there must have been a scene like that on the sinking Titanic. And as if by some idiotic tradition, the trains, like the lifeboats of the Titanic, always left half empty.\n But somehow, she and her granddaughter had gotten on board. Everyone they had left behind on the platform was dead. There was no communication from the cities. No communication—no life.\n “Attention! Hazardous zone! Attention! Hazardous zone!” the receiver crackled in a metallic voice. “We request everyone take your places, lie down, and put on your gas masks!”\n I never really took my gas mask off. The rubbery little bastard hung on my shoulder like a house pet. When you live in a normal world, you don’t really understand what carbon monoxide is—a gas from which it is impossible to hide. And then there’s radioactive gas from a burning nuclear power plant, or from the burning, irradiated woods and swamps that once surrounded it.\n “Grandma, why do we need to lie down?”\n “They said lie down, so lie down!”\n She covered the girl up with a blanket. I couldn’t just sit by and watch.\n “You might as well put some wool socks on her. Make sure she overheats to death.”\n “But at least the gas won’t get in.”\n “The gas mask is enough.”\n “How would you know?”\n “I’m a rescuer.”\n “There are a lot of you. Half the country, if not more. One of you stole our suitcase.”\n “I’m not that kind. I’m different. Unique.”\n “Sure you are.”\n There were plenty of crooks even before the fire, of course. After it started, they just became more aggressive. And now, instead of your wallet or your jewelry, they were after your water or something worse.\n The fat man didn’t sit with us for long. By the time we crossed into the hazardous zone, he’d moved to the next coupe. There was some woman in there he was interested in hitting on. I hadn’t seen her, but I could smell the traces of her expensive perfume.\n I was amazed people could even think of these things—perfume, neckties. Although, come to think of it, the lack of showers made perfume and cologne concepts worth considering.\n As he was getting up, the fat man said: “It’s them. They’re coming. Do you have your passes?”\n Them—the hungry police with gray faces, who personally examined everyone’s passports and special passes. Grandma tensed up.\n “Do you have a pass?” she asked.\n “Yes. To everywhere.”\n I wondered whether the old lady was willing to kill me for that piece of paper. And if she could do it, more precisely. A pass to everywhere was a real chance at salvation. For service to the fatherland they gave out third-, second-, and first-level passes. The first-level “everywhere” pass was a true rarity—more expensive than a bottle of spring water.\n I came by my “everywhere” pass by pure chance. I’d saved some big shot from the Leningrad region, and he’d actually turned out to be thankful. I found him burned, cowering in a manhole. He’d ended up there when his entire elite neighborhood went up in flames. How he’d managed to survive, I had no idea. There wasn’t even any air to breathe. The air was scorching. I knew people hid in manholes from my own experience: I had dived into them more than once to save myself from a fiery death. But underground there was almost no oxygen, and practically as much smoke on the surface. He wouldn’t have held out for long.\n I was the one stuck with the duty of checking underground. Our brigade had already passed through the area, and I had no time to linger. Climbing down I didn’t see anything, at first, though I expected to find a few bodies.\n I had already started back up the ladder when, for some reason, I turned back: I must have had a sense of some kind that there was someone alive down there. I almost stepped on him. He was lying at the bottom of the access pipe like a perch gasping its life out on land, his eyes bulging in fear.\n I never asked survivors any questions. I wasn’t especially interested in their stories and their feelings: That was a psychotherapist’s job. But there wasn’t anywhere I could go to get away from him, and he wanted to talk.\n He hadn’t been able to save his wife. He’d arrived to find his home gone, tornadoes of fire rotating through the neighborhood. His bodyguard was killed almost immediately, but he’d managed to scramble into this hole.\n The big shot never thought any of this could happen. He’d never imagined the world could be so terrifying. If he had known, he said, he would have “taken measures.”\n When I heard that, I just smiled. There weren’t any “measures” the fire understood. But this guy had been in power for so many years, he thought the phrase “we are taking measures” always worked. It turned out it was just a way to look like you were doing something. In the old days, that might have been enough. But not now. But back when I rescued him, official information about the size of the disaster didn’t exist, or was carefully hushed up, so I wasn’t particularly surprised at the foolish ideas the big shot was carrying around in his head.\n I have to say—he didn’t seem all that upset about the death of his wife. Maybe that disaster had brought him a bit of relief.\n I had no idea what happened to him in the end. It’s possible he headed to Siberia or Alaska. Or even out into space . . .\n It didn’t matter to me who I saved. But he wrote down my name. In a week, they found me and brought me into the local military headquarters. They did a few of their conjuring tricks, took my fingerprints, and handed me my pass to everywhere.\n They had just begun to appear at that time: A handsome little square of plastic with a numbered piece of paper that came along with it. A real rarity, as it turned out. You know how it is: Everyone is equal, but there are always some who are more equal. With my handsome little pass, I could go wherever I wanted. Fitted with a biometric chip, the pass was hard to forge, although some of the more talented craftsmen around managed to do it.\n For an hour, she stared silently at the gray fog of smoke outside the window. I could guess what she was thinking—it was the same thing everyone thought. Of course it wasn’t fair I had a pass, and she didn’t. How was I better than anyone else? I was just a little luckier—and so on, and so on. And here she was, with a child she needed to save. No, she was thinking—it wasn’t fair.\n The priest lay quietly on his bare bunk, his face blank. To be honest, I felt sorry for him. First of all, due to the drubbing the atheist grandmother had given him. Secondly, because he had betrayed his God. He’d decided to save his own skin, probably hiding behind the excuse that someone would be needed to preach the word of God to the survivors.\n But no matter how you sliced it, there would be no God among the survivors. After all, who were they? Those who managed to get onto Noah’s Ark. And who would clamber aboard? Those who always managed to climb aboard in the old days. The trash.\n There was the sound of rustling and shuffling behind the door.\n “They’ll kick us off the train,” she said.\n “Where? This train can’t stop, and they have nowhere to put you.”\n “Then why are they checking passes?” asked the girl, terrified.\n “It’s required.”\n “For what?”\n “Do you know what happens, when panic begins? Do you know what panic is? At all times, everywhere, there needs to be order. And anyway, little girl, why are your sandals scattered in every corner?”\n “We’ll put our sandals wherever we want,” Grandma snapped. “Why are you bothering her? Pay no attention, bunny.”\n Bunny . . . as if she had no name of her own.\n “My heart is pounding,” Grandma said.\n “Don’t worry. And don’t worry the bunny.”\n “You know how they are. You know.”\n Yes, I knew. There were no good police left. The good ones had died first: We called them “overachievers.” Nowadays, the only police left were the ones we called “werewolves.” Monsters lusting after bribes and power, tearing apart others’ lives to prolong their own.\n I sat the girl on my lap. She was light as a stuffed bear. Before the fires, I had never thought about things such as whether or not I wanted children. Before—well, I had leaned more toward no than yes. But now—well, I felt differently. It turns out I did want them, after all.\n “Listen, don’t worry. There’s nowhere for them to take you off to. Especially with us going at full speed . . . ”\n But in fact, I wasn’t really sure. You couldn’t be sure of anything anymore.\n “Grandma, I’m scared.”\n “Right, then . . . ” Standing up, I pulled open the lower berth. “Get in! And be quiet.”\n The grandmother wouldn’t fit in there. But they wouldn’t find the girl.\n The grandmother wasn’t able to part with the girl for a long time. This will end badly, I thought. She came to her senses only when someone touched the coupe door’s handle. Before the door was pulled open, we were able to get the berth closed—and even cover the girl with a mattress and suitcase, just in case.\n The police came in quietly. The grandmother didn’t resist. She just fell into a stupor and looked at them with indifferent eyes. I resisted, but gave up and sat down after getting a rifle butt in the shoulder. My argument that everyone needed a bit of help sometimes, and they should lend a hand to their neighbors, went nowhere with them. Big surprise. They no longer had bosses, but their habits remained.\n I prayed only for one thing: that the girl hidden in the berth would not cry out in terror.\n All the grandmother managed to say before they tore her from the compartment was “Help!”\n How many hundreds of times had I heard that word now? The werewolves thought she was talking about herself. I knew better—she was begging me to save the girl.\n The priest in the upper berth just blinked his eyes in fright and empathized with Grandma with all his strength. I wanted to ask where they were taking her and what they planned to do with her, but thought better of it. The werewolves never told the truth—and if they did, it would just be all the more horrible.\n They took the fat man in the corridor’s pass away, despite the fact that he waved some important-looking blue card in front of their noses. His pass had been filled out in someone else’s name. He swore he had signed his own over to his son. Okay—maybe so. But where then, they asked, did he get this new, false one? They seized his stolen first-level pass. But what of it? It was much easier anyway for people like the fat man to get onto Noah’s Ark than it was for us mortals.\n In the end—unlike Grandma—they didn’t take the fat man anywhere. I guess he had an extra bottle of water.\n Once everything quieted down, I could hear the sound of muffled sobs from the lower berth. The child lay on her side, crammed against the iron partition.\n “Okay—listen. Come out, please. We’re almost there. I promise everything is going to be all right.”\n I promised, but I was certain it wouldn’t be all right. And unfortunately children, unlike adults, know exactly when they are being lied to.\n After a few hours, the fog of smoke began to thin. But the smell remained. I was used to it by now. The girl sat silently next to me. I didn’t even know her name. Why bother finding it out? She was just a girl. A bunny. Knowing her name would just make it harder to part with her.\n The train convulsed and came to a halt with a lingering scream. This was its last journey—and the train seemed to know it as well.\n In Murmansk, where once snow had fallen even in the summer, it was twenty-eight degrees Celsius at the end of December. Well—at least it wasn’t forty-eight degrees. That was such a miracle in itself that it was hard to believe. And the breeze was almost fresh.\n The last of the city’s supplies had been loaded onto the ships. There was little food, and no water, and only one ship in the harbor.\n “This is it, unless you want to build yourself a raft. Let’s move! You can still die from the smoke, you know. So hurry up!” the commandant at the station said. “We’re loading without delay. This is the last train.”\n The commandant had stars on his shoulders. A major. Second-class pass. If he was lucky, they might take him on board. But only if he was lucky.\n “Have a lot of trains arrived?”\n “Just this one. We were waiting for you. They’re closing the station.”\n “What do you mean?”\n “According to instructions. It’s been determined.”\n Amazing. It’s been determined. I wondered if it had also been determined how exactly we were supposed to die a few days from now.\n From the number of people streaming to the port, it was clear: Only the chosen, or the aggressive, would be saved. The ones who managed to get into the country’s best universities. The ones who had the highest salaries. The ones for whom an open position was always waiting at the best companies. And now they (and how strange, that I found myself among them) were the last hope for humanity’s future. I was glad I had somehow managed to keep my pass to everywhere from disaster. But of course, if the werewolves wanted to take it, they would . . .\n “This is it! The end! Nothing but a new life before us! Yes!” someone shouted on the street. I recognized the voice of the man who had been sobbing in the train car.\n There was a long line near the ship. As it moved, I looked the vessel over. It was too old for a long voyage. Clearly, the better ships had long ago left port. I didn’t know much about these things, but I could tell this was a military vessel. Probably mothballed for decades. There was a red star painted on its prow. The guns had been removed, but traces of their emplacements remained.\n All of the ships leaving port now were called “arks,” but Noah would have been very surprised if he saw some of them.\n The line moved forward slowly—those who had been refused salvation didn’t always want to accept the decision.\n “As soon as all of this began, they packed their suitcases and got out however they could,” one of the refused complained.\n He was as dirty as if he had been living in a barn for all these years. I had grown used the stench of human uncleanliness. Only children smelled decent, anymore.\n “They sailed off to Norway, to Canada. It’s no better there anyway—even worse. Half the population swept away in a day. These tornadoes of fire—they call them a combination of circumstances, factors. Nonsense! This is a cleansing. The problem is, the garbage got away—as always. It’s the garbage that has the special passes to everywhere.”\n I turned away. It wouldn’t pay to show off my pass here. Yeah, I thought, but what about those of us who ended up with a pass to everywhere by chance? What should we do? Tear them up and throw them away out of solidarity? Solidarity with who? This loudmouthed citizen would have been the first to cut my throat for it?\n People didn’t shove one another too hard: the ship was well-guarded, and it was clear from the faces of the werewolves at the checkpoint that their hands wouldn’t shake when they shot you.\n In addition to the inspectors, they had installed a serious-looking turnstile near the gangplank—something I’d never seen before. It was a meter and a half in height, with iron spikes grinning along its top and bottom. Some torture device out of Madame Tussauds’, designed in a hurry, capable of crippling someone even by accident.\n But most of all, more than the guards or the nasty-looking turnstile, what I feared was a general panic. If one of those got going, “Noah’s Ark” would be sailing nowhere, and no monster of a turnstile would help. I’d seen those panics more than once. Madness is contagious.\n When we reached the front of the line, I heard engines humming in the vessel’s depths. The werewolves stood up straighter as the inspector waved his hand.\n “Only one,” he said, looking closely at my pass.\n “Listen—she’s small. How am I supposed to leave her behind?” Please. In the depths of my soul, I did not want to die.\n “No! You know the rules. Only one. The second one won’t get through the turnstile anyway. Next!”\n “Wait! Okay . . . ” I bent down and handed the girl the pass. “You’re smart. I understood that right away. Now—you need to listen to your elders.”\n “I’m not going! I’m not! Why can’t I stay with you?” She began to cry.\n “Listen to me. If you don’t go, you’ll die. You understand? Now don’t be a fool. Go!”\n “So—I’ll get to meet my mom in heaven?”\n And your grandmother too, I thought.\n “Don’t talk nonsense. Your mother wants you to live.”\n “Next!” yelled the inspector.\n “How do you know? Did she tell you herself? When?”\n “Enough! Get out of the way!”\n The fat man from the train, still in his white shirt and tie, shoved me aside, snatched the pass out of the girl’s hand, and shoved it into the slot in the turnstile. Before I could even cry out, he had stepped through.\n How I wished I had a pistol or at least a brick in my hand. In the turmoil, no one even chased after him. The inspector announced to the line that the ship would sail in ten minutes.\n To hell with them, then. Let them sail. The end would come for them as well, eventually. And it would probably be just as terrible. It didn’t matter anyway.\n Making my way out of the crowd, I sat us down on a bench and watched the farce unfold from a distance. Just like on the train, the girl sat meekly beside me. Someone offered her a package of dried bananas, which she ate with pleasure. The priest from the train, who hadn’t managed to board, was running around in confusion—ascending and then descending the gangplank in indecision. I grew sick of looking at him.\n “I’m so tired I’m not scared anymore,” the girl said. “Are bananas a healthy vegetable?”\n With my head in my hands, I sat and watched the last ark sail away and wondered what else I could possibly do. It made me sick that some son of a bitch in a tie should survive instead of a little girl. How could I save her?\n The werewolves drove us away from the port. I felt the muzzles of their submachine guns pointed at our backs for a long time. No water, food running out—but plenty of bullets, of course. To them, I was just another person gone mad with fear or anger. They knew as well as I did: It’s hard to stay human during the apocalypse. Most people turn into something else, eventually.\n I knew that all over the world, the ships were leaving the same way. The last Titanics of civilization.\n Personally, I couldn’t stand all those idiotic films about flesh-eating zombies and drowning worlds. Too dramatic. Fact is, when the end of the world is happening in real life, it’s not nearly as terrible. In reality, there’s just too much gray. It dulls the senses. The fact is, until that moment, I’d sometimes even enjoyed what was happening.\n I know—those aren’t normal thoughts. But my entire life, right up until the fires, had been a meaningless, lonely dream. No one had ever needed me. No spouse, no children—I was too cool for those kinds of commitments. They weren’t in style. I’d just drifted along as well as I could.\n But that shouldn’t be the point of living. And if it is, to hell with it all anyway. Let the Earth scrub us away, and start again from a blank page.\n The end of the world wasn’t so frightening, after all: what was really frightening was the idea that it might not happen.\n They didn’t take animals on the ships, so people just abandoned them wherever it was convenient. One such abandoned dog—a golden retriever—was wandering the concrete pier howling, unable to understand its owner had really left it behind. The dog stopped and ran to the edge of the pier, about to jump off.\n I’m no saint—but I just couldn’t leave him there. Taking the girl by the hand, I rushed over.\n “Hey! Dog! Come here!”\n The dog turned and froze, as if “Dog” really was his name. What was I doing? What did I even know about golden retrievers? They ate a lot. That was about all I knew.\n This one was skinny and dirty, but its leather collar looked expensive. I tied a rope to it to keep it from leaping into the water to swim after the departing ship or simply commit suicide. I managed to pull him away, and we headed back to the train station.\n We hid from the blinding Murmansk sun under the station roof, with all the others who had been left behind. How was I supposed to feed these two? Cannibalism? I knew a lot of people were already considering it. Some of them were giving the dog strange looks, as well.\n I had already decided not to give him up for anything—even water. He was mine now, just like the girl. If we were going to die, then it would be the three of us together, and with a clear conscience.\n There weren’t many people left—just some defeated looking stragglers. “Unpromising types,” as my former boss would have put it. He’d never have hired them. There were some determined faces among them. But so many were ill. And the elderly . . .\n “That’s it! The last,” sighed the commandant.\n I was surprised to see him: I would have thought he’d have sailed off with the “Chosen Ones.” One of his hands was bandaged, and in the other he held a bottle of cloudy liquid.\n “Alcohol. Want some?”\n “No,” I answered. Then: “The ship could have taken more people.”\n “Of course it could have—but they just would have been extra mouths. Everything went according to the passes. But didn’t you have one? I saw you in line. You wouldn’t have had a chance without one.”\n “I had one.”\n “Third?”\n “No. To everywhere.”\n The commandant frowned. “So—what are you doing here?”\n “I just decided to stay.”\n “And the girl?”\n “The girl decided to stay too. And the dog. What about you?”\n “Why bother? There’s nothing out there.”\n “What do you mean?”\n “Fairy tales. All of it. There’s no promised land,” the commandant laughed, “and you and I both know it.”\n “What are you talking about?”\n “There’s nothing out there,” the commandant said, “but hurricanes and tsunamis.”\n “If that’s true, why didn’t you tell anyone?”\n “Why would I?”\n “No, really—why didn’t you say anything?”\n “Look—they needed something to believe in before dying. Sure, they’ll die anyway, but at least they’ll feel like they did everything they could. Like they died trying to accomplish something.”\n “You’re insane.”\n “Come on. That kind of talk won’t help. Look—they did everything they could to save themselves. Isn’t that worthwhile—trying to save oneself?”\n I’d seen plenty of people lately who had been warped by what was happening, but the commandant’s cynicism cut into me.\n “How do you know? How do you know there’s nothing out there? You’re here, and they’re there. You can’t possibly know.”\n “We modeled it all out with our guys from the Center for the Study of Natural Disasters. There’s nothing out there. They’ll drift a while, then try to turn around. But they’ll run out of fuel. They don’t have much of it to start with anyhow. And it’s more dangerous right now at sea than it is on dry land. There’s nowhere to sail to . . . ”\n “How long have you known this for?”\n “A few days.”\n “You . . . how could you . . . I almost . . . you’re sick.” I was close to hyperventilating, either from a feeling of horror at what was to come for those who had sailed off, or from relief that the girl had not left on the last “ark.”\n “There are people on board.”\n “Who are you calling people? The ones on that boat?” He laughed. “Where’s your pass?”\n “It’s not important.”\n “With those ‘people,’ probably. Is the dog yours?”\n “Go to hell.”\n “Is it yours?”\n “No.”\n “You want to give him back to his owner?”\n “No,” I said.\n “Then let them sail off with their passes to everywhere. Turns out those passes are only accepted here, in this world.”\n You never see the northern lights in the summer heat. It seemed wrong. But although the heat made it seem like August, it was the end of December.\n The little “bunny” slept curled up in my arms, with the dog at our feet.\n The priest wandered the concrete pier with lowered head and folded hands. Praying, most likely. And yet everything remained the same.\n After two days, the fires came. Severomorsk and Apatity burned. The fires approached the outskirts of Murmansk and . . . turned back.\n In another five days, the rains began.\n I finally asked the girl her name.\n Originally published in in Russian in Terra Rasa, edited by Nova Team (2018).\n Playwright and short story writer Anastasia Bookreyeva graduated from the Russian State Institute of Stage Arts (Theatre Academy) in 2016 with an M.A. in Theatrical Arts. She is the winner of many literary and theatrical contests. Her plays have been performed in more than twenty-five productions since 2016 in cities across Russia, including in Moscow and St. Petersburg. Her plays and stories have also been published in several anthologies. Ms. Bookreyeva is a teacher and coordinator of drama laboratories for teenagers and adults. A member of the Union of Writers as well as the Union of Theatre Workers of Moscow, she currently lives in St. Petersburg.\n Ray Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG."}