{"fingerprint": "lvMSV3SZ7grWNJlfnowU7VOk8ug=", "sitename": "Clarkesworld Magazine", "title": "The Accord by Keith Brooke", "author": "Keith Brooke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/brooke_07_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Accord by Keith Brooke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8840 words, novelette, REPRINT\nThe Accord\n1. Tish Goldenhawk\nTish Goldenhawk watched the gaudy Daguerran vessel slide into the harbor. If she had known then what she was soon to learn, she might even have settled for her humdrum existence, and even now she and Milton would be living a quiet life, seeing out their days before finally joining the Accord.\nBut no, unblessed with foresight, Tish stood atop the silver cliffs of Penhellion and watched—no, marveled—as the Lady Cecilia approached the crooked arm of the dock.\nThe ship was unlike any she had seen. Far taller than it was long, it rose out of the mirrored waters like some kind of improbable island. Its flanks were made of polished wood and massed ranks of high arched windows, these revealing bodies within, faces pressed against glass as the grand touristas took in yet more of the sights of the worlds.\nHe might have been among them. Another face staring out, its perfect features only distinguished by a crooked incisor. But no, he wouldn’t have been part of that gawping crowd. She would have known that if she had been blessed with foresight, if she had somehow known that there was a “he” of whom she could speculate just so at this moment.\nThe ship, the Lady Cecilia . . . it towered unfeasibly. Only vastly advanced engineering could keep it from toppling this way or that. The thing defied gravity by its very existence. It sailed, a perfect vertical, its array of silken sails bulging picturesquely, its crew scrambling over the rigging like squirrels.\nAt a distant screech, Tish tipped her head back and stared until she had picked out the tiny scimitar shapes of gliding pterosaurs. It was a clear day, and the world’s rings slashed a ribbon across the southern sky. Why did beauty make her sad?\nTish breathed deep, and she knew she should be back at the Falling Droplet helping Milton and their fifteen-year-old son Druce behind the bar.\nAnd then she looked again at the golden, jeweled, bannered sailing ship now secured in the harbor and she felt an almighty welling of despair that this should be her lot in a world of such beauty and wonder.\nShe walked back along a road cut into the face of the cliff. She was lucky. She lived in a beautiful place. She had a good husband, a fine son. She could want for nothing. Nobody starved or suffered in the worlds of the Diaspora, unless it was their choice to do so. People were born to different lots and hers was a good one.\nShe was lucky, she told herself again. Blessed by the Accord.\nThe Falling Droplet was set into the silver cliffs of Penhellion, its floor-to-ceiling windows giving breathtaking views out across the bay to where the coast hooked back on itself and the Grand Falls plunged more than a thousand meters into the sea.\nRainbows played and flickered across the bay, an ever-changing color masque put on by the interplay of the Falls and the sun. Pterosaurs and gulls and flying fish cut and swooped through the spray, while dolphins and merfolk arced and flipped in the waves.\nTish was staring at the view again, when the stranger approached the bar.\n“I . . . erm . . . ” He placed coins on the age-polished flutewood surface.\nTish dragged her gaze away from the windows. She smiled at him, another anonymous grand tourista with perfect features, flawless skin, silky hair, a man who might as easily have been twenty as a century or more.\nHe smiled back.\nThe crooked tooth was a clever touch. A single tooth at the front, just a little angled so that there was a gap at the top, a slight overlap at the bottom. An imperfection in the perfect, a mote in the diamond.\nIn that instant Tish Goldenhawk was transfixed, just as she had been by the sight of the Lady Cecilia earlier.\nShe knew who he was, or rather, what he was, this stranger, this not quite perfect visitor. A made man should always have a flaw, if he were not to look, immediately, like a made man.\n“I . . . erm . . . ” she said, inadvertently repeating his own words from a moment before. “What’ll it be?”\n“I . . . ” He gestured at one of the pumps.\n“Roly’s Scrumpy?” she said, reaching for a long glass. “You’d better be watching your head in the morning, if you’re not used to it. That stuff’s an ass—drink it full in the face and you’re fine, but as soon as you turn your back it’ll kick you.”\nShe put the drink before him and helped herself to some of the coins he had spread out.\n“Been on Laverne for long?” she said, knowing the answer he would give. He had just landed, along with all these other touristas. Struggling with the dialect and the coins. These poor over-rich sods must be constantly disoriented, she realized, as they took their grand tours of the known. The poor lambs.\nHe shook his head, smiled again. A day ago—even a few hours ago—he had probably been in a jungle, or in a seething metropolis, or deep in an undersea resort, ten, a hundred, a thousand light years away, along with others on the grand tour.\nOr that, at least, was probably what she was supposed to think. But Tish stuck with her hunch instead. She often constructed stories about the people she served in the Falling Droplet—the spies, the adulterers, the scag addicts, and the gender-confused. Sometimes she even turned out to be right, but usually she never confirmed her hunches one way or the other. This man was no grand tourista, although he might indeed be a new arrival.\n“You on the Lady Cecilia?” she asked him, hoping he would give himself away but knowing he wouldn’t.\n“I am,” he said, and then dipped his head to take a long draw of the cider. He glanced around. “Or at least,” he added, “I was . . . ”\n“Tish?”\nMilton. He gestured. They had customers lined up at the bar. The Droplet had grown crowded and Tish had barely noticed. She moved away from the stranger, and served old Ruth with her usual Brewer’s Gold and nuts.\nLater, she noticed the three men as they came in from the darkening evening. They were strangers too, as were many of this evening’s clientele, but they didn’t look like they were on any kind of grand tour. Their eyes scanned the crowd, and as one of the men fixed on her for the briefest of instants she felt skewered, scanned by some kind of machine.\nBut no, these three were men, if clearly enhanced. They wore identical dark-gray outfits, and now she saw what appeared to be weapons at their belts.\nTish had never seen a weapon before, unless you counted harpoons and ginny traps and the like. She had never seen men who looked like machines, although up in Daguerre she had seen machines like men and women.\nOne of the men pointed, and the other two swiveled their heads in unison until all three looked in the same direction, motionless like a sandfisher poised to drop. The pointing man opened his hand and a beam of light shone from it across the crowded bar.\nTish turned and saw a single man picked out by the beam, a long glass poised partway to his mouth, a mouth which revealed one imperfection in its otherwise flawless ranks of teeth.\nThe stranger dropped his glass, ducked down, darted into the pack of bodies near to the bar.\nThe three . . . they were no longer there by the door, they were across the room, standing where the stranger had been, motionless again, robot eyes surveying the crowd.\nTish revised her earlier assessment. These men could not be mere humans—enhanced or not—and move as they did. They must be more than that. Other than that.\nThe stranger . . . a tussle by the far door, and there he was, reaching for the handle.\nBut the handle vanished, the door blurred, its boundaries softening, merging . . . and it was wall, not door. There was no exit there. There never had been.\nThe stranger’s hand slid across the smooth surface, and he staggered. Why was he scratching at the wall like that?\nThe three stood, watching, eyes locked on the stranger . . .\n. . . on nothing.\nThe stranger had ducked into the crowd again.\nTish leaned against the bar, her heart pounding, her mind swirling, her brain playing catch-up with the succession of images crammed into the merest of seconds that had passed since the door had opened and the three more-than-men had appeared.\nAnother disturbance.\nThe stranger.\nHe had a wooden chair raised above his head. Beyond him, the sun was setting, heavy and swollen over the rainbowed water. The sky was cast in bands of the deepest of crimsons, a staggering gold, shading up to a high, dreamy purple. Laverne’s rings slashed darkly across this vivid sunset.\nThe sky shattered. Crazed lines divided it up into an enormous, jagged jigsaw.\nSomeone screamed, someone else shouted, someone else . . .\nTish could no longer see the three men, and she could no longer see the stranger. She could see the chair embedded in one of the big windows though, the glass crazed but still holding in its frame.\nThen she saw him, a silhouette against the fiery sky, diving.\nHe hit the glass and for an instant it held and she thought he would end up embedded like the chair. And then the moment had passed and the glass shifted, bulged, and it, the chair, and the man tumbled out into the air.\nSomeone screamed again, and the shouting continued, as the crowd shuffled back from the abyss.\nTish looked away. They were half a kilometer up here, nothing but an awful lot of air between them and the rocks and waves below. No one could survive such a fall.\nShe looked up again. The three were standing by the opening, peering out into the gloom. They were not talking, but she could tell from the poise of their bodies that they were somehow communicating. Was this a satisfactory outcome for them, or was it not?\nAnd then she thought, why would they do such a thing? What was it that had brought them here, on this evening, to do this?\nWhy would they come here, to her normally peaceful cliff-hanging bar, and pursue this stranger in so startling and violent a manner?\nWhy would anyone want to chase God, or even a very small fragment of God?\nTish dropped in an air-shaft to Fandango Way, Penhellion’s main thoroughfare. The Way was cut into the base of the cliff, and ran from the docks to where it wound its way up the cliff face three kilometers east.\nShe stepped out among the stalls of itinerant traders. She nodded and smiled and exchanged words here and there. She was not here to buy, and most of the traders knew that anyway—these same traders delivered supplies direct to the Falling Droplet. Tish had little need of market shopping.\nShe carried a basket though, and in the basket, beneath a checkered cloth, there was a crust of bread and a fistful of feathers from a quetzal.\nShe crossed the road, dodging rickshaws and scooters. Lifting her feet daintily over the low wall, she stepped out onto the rocks.\nDown by the water’s edge, first of all she looked at the gentle chop of the waves, and then she craned her neck to peer upward, but she could not pick out the Falling Droplet’s frontage from all the others. So many dwellings and other establishments, set into the cliff here. It was a very desirable place to live. She was lucky.\nShe knelt on a big rounded boulder and wondered why she should be so sad also. She knew this feeling from the months after Druce was born. Back then she had been offered medication but had refused. Such feelings were part of the full spectrum of being and she had felt it her duty to endure them, so that one day she could carry them into the Accord—her contribution, a droplet of despair in the ocean of human experience.\nBut this . . . this weight. She could not remember when it had started, and she suspected that there could be no such neat line—in some ways it had started in the mixing of genetic material used at her conception, while in others it might be quite recent.\nThis melancholy was different to the post-natal darkness. Not so deep, yet somehow more pervasive. A flatness that smothered everything, a tinge of desperation in her thoughts, a clutching at the straws of strangers’ imagined lives.\nShe told herself to stop being so maudlin.\nShe pulled the cover from her basket and took out the crust of bread. She broke it into three pieces and hurled each as far as she could manage out onto the waves. Then she took the quetzal feathers and cast them into the breeze, watching them as they fluttered, some onto the water and some onto the rocks.\nFood for the journey and feathers for the passage. An old family tradition, perhaps even one that came from Earth.\nSoftly, she wished the stranger a peaceful transition into the Accord.\nMilton had square shoulders and a square face. Most often, if you caught him unawares, you would see him smiling because that was the way his features settled themselves.\nHe was a good man.\nTish came into the bar of the Falling Droplet just as Hilary and Dongsheng were leaving, having replaced the picture window through which the stranger and one of their bar chairs had plummeted the night before.\nMilton was looking out through the new glass, relaxed, smiling gently.\nTish came up behind him, put her hands on his shoulders and turned him, kissed him, first close-mouthed and then, briefly, allowing her tongue to press between his lips.\nHe stepped back, smiling more broadly now—a sure sign that he was unsettled by her ways. “Steady, steady!” he said. “What’s got into you, then, eh? Won that grand tour ticket or something?”\n“No,” she said. “Not that.” She took hold of a handful of his shirt and smiled. “No,” she went on, “I just want to fuck you, Milton.”\nHe looked scared, like a small animal. Once, she had found that endearing.\n“But . . . ” he said. “What if someone comes in?”\n“We’re closed.” She toyed with the handful of shirt she still had, knowing she was pulling at the hairs on his chest, knowing how that turned him on.\n“But Druce—”\n“Isn’t here,” she said.\n“But he might—”\n“So you’d better be quick.”\nBut the moment was going, had gone. Had maybe never really been there at all.\nShe released his shirt, moved away.\n“You’re a good man, Milton,” she said, looking out over the bay.\nWhen she glanced back over her shoulder, Milton was smiling, because that’s how his features tended to settle themselves.\nIt would have ended there, if she had not gone up top to the Shelf—the window repaired, the stranger and his three pursuers gone, the spark just beginning to return to Tish Goldenhawk’s life—and to Milton’s, whether he wanted it or not.\nBut no, four days after paying tribute to the stranger’s passing over into the Accord, Tish took a shaft up to the top of the cliffs again, to the Shelf, and there she saw what her first response told her must be a ghost.\nHere, a row of homes and bars and shops lined the cliff top, so that one had to enter a building in order to enjoy the view over the bay to the Grand Falls.\nTish had been in a bar called the Vanguard, sharing gossip with Billi Narwhal, a multicentenarian who was currently wearing his hair white on the principle that it advertised his many years of experience to any of the youngsters wanting lessons in love. The Vanguard was busy, with another two cruise ships in harbor having replaced the Lady Cecilia, now two days south.\nA little tipsy from Billi’s ruby port, Tish left the bar. A little way ahead of her was a man and there was something about the way he held himself, something about the slight taste of cinnamon on her lips—on the air, a scent.\nHe turned. The stranger. Undamaged, unblemished by his fall.\nTish clutched at the doorframe and blamed the ruby port, both for her unsteadiness and for the apparition.\nThe stranger was no longer there. For a few seconds Tish was able to convince herself that he never had been.\nShe gathered herself and tried to remember what she had come up to the Shelf to do. She hadn’t just come up here to gossip with Billi Narwhal and flatter herself with his attention.\nShe pushed through the crowd. She was following him. Following so quickly that it was more pursuit than passive following.\nShe paused, thinking of the three men in the Falling Droplet. Had it been like this for them? Were they mere innocents suddenly overcome with the urge to pursue? She knew such things were possible—the Accord could reach out to any individual and guide their actions.\nBut why? Why pursue this man? She was convinced now that he was a part of the Accord, a fragment of God made flesh. Why, then, were the men pursuing him? Or rather, what was it that was guiding them?\nShe sensed no dark presence lurking in her mind, no external force appropriating her body, her senses.\nShe started to walk again, eyes scanning the faces.\nShe found him at a cafe, sipping jasmine tea while a newscast spoke to him from the middle of the table. She sat across from him. “May I?” she asked.\nHe smiled and blanked the ‘cast with a pass of his hand. He looked quizzical.\n“The Falling Droplet,” she explained. “You . . . left rather abruptly.”\nUnderstanding crossed his face. “I’m sorry,” he said. “I did not anticipate that. I should have known.”\nShe smiled. He should.\n“There are expenses?”\n“Oh no,” she said. “Well, yes, actually, but they’re covered by the city.” Acts of God.\nThey sat quietly for a while, and Tish started to think he might prefer to be left alone. “How did you survive?” she blurted out eventually.\n“There are ways,” he said. “It’s not important.”\nShe smiled. So far he had said nothing to deny her belief about his true nature, her fantasy.\n“How do you find all this?” she asked him now, making conversation, prolonging their exchange. “The world of Laverne?”\n“It’s a mystery to me. The place, the people. You. It’s beautiful. You’re beautiful. Being chased by men who wish me harm—it’s all beautiful.”\nThat last bit rather detracted from what he was saying, Tish felt. Here, sitting at a table with a strange and handsome man, telling her she was beautiful . . . yet, he was like a child, eyes newly opened to the world.\n“Shall we walk?” he asked.\nThey walked. Out past the last of the clifftop dwellings, to where the road became a track, became an ill-defined path.\nThey walked—Tish Goldenhawk, hand in hand with God.\n“Why did you come after me if there is no debt?” the man asked, after a time.\n“I’ve never met anyone like you before,” Tish told him. Then, brave, she added, “Anyone of your kind.”\nHe was shaking his head, smiling as if at the wonder of the world, of this simple exchange. “You people,” he said. “Always drawn to me . . . ”\nShe knew what he meant. Their touch—her small hand in his larger, smoother, stronger hand—was like a wick in an oil-lamp, energy flowing through it, always from her to him. It made her buzz, made her feel alive.\nLater, stopping on a promontory, breathing salt, cinnamon, grass, with butterflies flitting about the flowers in the turf and gulls raucously occupying the cliff below, they stopped. Picking up the thread of their conversation as if there had been no gap, he said, “My kind. What did you mean by that?”\nSuddenly shy, Tish looked away, then lowered herself to the springy grass, spreading her skirts out across her legs, smoothing the fabric down.\n“You,” she said, wondering how to shape her words, “you’re no grand tourista. Even without the goons chasing you through my bar, it was obvious that you’re different.”\nHe nodded, smiled, waited for her to continue. A bee hummed nearby.\n“You’re of the Accord, aren’t you?”\nThat single question embodied so much more. The Accord—the Diaspora-spanning networked supermind where we all go when our time in the real world is up, the amalgam of all past human experience, a super-city of the mind, of minds, of souls, even. The Accord.\n“I don’t understand.”\n“Your body,” she said, “grown somewhere, budded off a clone of a clone, just waiting for an emissary of the Accord to occupy it. Don’t worry—we all know it happens—the Accord reaching out to the real world.” All that stored experience and individuality was nothing without a connection to real life. Not nothing, but something other—the Accord sent out men and women like this stranger all the time. The process kept it human.\n“If the Accord is our God, then you are a part of God,” she told him. As he kneeled before her, she added, “You are God, too—God in . . . in a man’s body.”\nAnd she hoped desperately that he would not correct her, not now. She reached for him and in her mind she pleaded that he should let her believe, for now, at least.\nAfterwards, she lay back, enjoying the play of the clifftop breeze on her body.\nShe had never done this before. Never taken one of her fantasies and played it out. Never betrayed poor, dull Milton, whom she had once, long ago, loved and now merely liked.\nShe turned onto her side as this man—this God—rose to a squatting position.\n“Let me show you something,” he said.\nShe laughed. “I’m not sure I’m quite ready yet,” she joked.\nHe stood, wearing only a creamy cotton smock top that buttoned to halfway down. He reached down, arms crossing, took its hem and pulled the top over his head, discarding it so that now he stood over her, fully naked.\nShe looked at him, enjoying what she saw, his nakedness somehow adding to the frisson of sheer badness that touched every aspect of this engagement.\nHe turned, and she saw a strange lump between his shoulder blades. She was sure that had not been there moments before, when she had held him. As she watched, it bulged, grew, bifurcated.\nAs she watched, feathered wings sprouted from his back.\nWith a shake, he settled his flight feathers and held his wings out stiffly behind him. He turned and stepped off the cliff and, moments later, was soaring, swooping, cutting back heavenward in an up-draft like a giant gull, like an angel.\nHer angel.\nTish returned to the Falling Droplet late, unwashed.\nMilton smiled at her, because that was how he was, and she wondered if he could tell, if she was that changed by what had happened.\nShe certainly felt different. She felt like something had been added, something taken away. She was not the woman she had been this morning.\nShe kissed Milton, willing him to taste the salt on her lips, to smell the cinnamon scent on her hair, her clothes.\nShe had arranged to meet her angel again the following day, and she knew she would keep the appointment.\n“Customers,” murmured her husband, drifting away.\nShe turned, looked out across the bay to where birds and pterosaurs flew, wondering if he might be out there too.\nIt couldn’t last, of course. It could never last.\nEver more brazen, Tish had brought her lover to the Vanguard to eat the renowned dipped crabs. They had met in the street, like passing friends, with a smile and a few words, with not a single touch exchanged. Even now, sitting across a table from each other, their hands did not touch, their feet did not brush against each other. Only their eyes met, filled with promise, anticipation.\nBilli came across before their food had come out, unable to resist finding out more. Tish was tempting fate, and she knew it. If Billi put two and two together, word would be all over Penhellion before nightfall.\n“Going to introduce me to your friend?”\nTish looked up, and casually stroked a hand across her lover’s wrist, their touch like electricity. “Hello, Billi,” she said. “This is—” barely a pause “—Angelo. Angelo, meet Billi.”\nShe saw Billi’s eyes narrow, a slight nod. “You like my bar, Angelo, eh?” he said. “What’re you eating? Crab’s good. Crab’s always good here. Don’t touch the lobster, though. Trust me on that.”\n“Crab,” said Angelo—the name fitted, the name stuck. “I took Tish Goldenhawk’s advice.”\nBilli’s eyes narrowed again, and Tish wondered what connection he was making now. Then his eyes widened, turned more fully on Angelo.\nShe had seen that look before, that mechanical movement.\nBilli raised a hand, held it palm-out toward Angelo with the fingers stiffly pointing.\nHis palm glowed.\nAngelo ducked, dived forward, knocking the table aside, hard against Tish’s knee so that she screamed, then gasped as his weight struck her, sending her back off her chair.\nShe looked up from the floor, as voices rose around them.\nThe chair where Angelo had been seated was a blackened lump, smoking furiously.\nBilli was turning slowly from the burnt chair to where Angelo and Tish lay on the floor. He had a puzzled expression on his face, a smooth, mechanical glide to his movements.\nHe was not Billi. Not for now, at least. Billi had been pushed aside and someone—the Accord, presumably—had taken over.\nWhy try to kill one of your own angels?\nBilli raised a hand and Angelo stood, hauling Tish to her feet, kicking a chair and table back at the old man to stop him pursuing.\nThey were standing by one of the Vanguard’s big picture windows.\nTish looked out, suddenly dizzy at the height.\nAngelo took a chair and raised it.\n“You’re making a habit of this,” she said, as he swung it down against the window, crazing the glass.\nThis time, he gave the chair a twist, and the glass gave way.\nSalty air leapt in through the opening.\nAngelo opened his arms and wrapped them around Tish as she stepped into his embrace, and then he jumped clear, taking her with him.\nThey fell, air rushing, whistling in Tish’s ears.\nThey were going to die on the rocks this time, she felt sure. This was a lovers’ end, and they would move on into the Accord for eternity.\nFabric ripped, wings broke free, and their fall became a graceful swoop taking them out across the water, toward the place where the rainbows filled the air and the gulls and the pterosaurs flew.\n“You need to escape,” she told him. “You need to get away from here. Why ever did you stay here in the first place after they found you?”\nHe shrugged. “I don’t think they expected me to still be here,” he explained.\nThey were on an island, one of the many islands where the Grand River became the Grand Falls and tumbled over the cliffs to the sea far below.\n“If you want to get away why can’t you just . . . I don’t know . . . snap your fingers? If you’re of the Accord then you should be able to just slip away and reappear somewhere else.”\n“Like a god?” he laughed. He raised a hand and snapped his fingers. Nothing happened.\nTish stood and looked down at the seated Angelo. Time to confront things.\n“If you’re no god, then who are you? What are you? Who are these people chasing after you? If they’re agents of the Accord, then why is this happening? What have you done?”\nHe let her finish. He smiled. He shrugged. “I don’t know,” he told her. “I don’t know who or what I am. I don’t know why these people are chasing me or who they are. I don’t know what I have done, if I’ve done anything at all. I don’t remember much before a few tens of days ago. I don’t understand at all, but I can tell you one thing.”\nHe waited. She asked, “What’s that?”\n“I love every moment of this existence. Every last detail. I’m soaking it up. I’m a sponge. I want more. I want ever and ever more.”\nTish heard the buzz of a motor—a flyer, perhaps. “You have to get away from here,” she said. “They’ll destroy you.”\n“Will you come with me? Will you share it with me?”\nShe nodded. She remembered that moment, walking back into the Falling Droplet and realizing that she was irrevocably changed. She felt that again, only more so. She hoped it would carry on happening, because she wasn’t finished yet.\n2. Er-jian-die\nI have no past. I have no future. Only now.\nI have many pasts and many futures, but as me, as this, there is only now. I am a composite. I have been cast for this occasion, for this task.\nI am of the Accord.\nI am assembled from the many, from the multitude. I will go back to the multitude.\nI am of the Accord.\nI am male, in this body. My skin is dark, my hair short, straight. I am slim and strong and fast, of course. Why would I be anything else?\nI am enhanced. In many ways.\nI am not alone. I will not be alone when I step out of this cabin. There are two others. Two like me, Ee and Sen. We are a team.\nI step out through the cabin door, having opened it first. My others are here already. Their heads turn, we nod simultaneously. I join them at the rail.\nWe are high up, on the deck of a faux sailing ship that is really powered by twinned gravity-wave microgenerators below decks. Above us, sails bulge in a manner designed to appeal to the grand touristas.\nWe are only a few hours from port. I know this for a fact, like I know much for a fact.\nI close my eyes. We close our eyes. Together.\nData flashes.\nWe open our eyes.\nHe is here, on the Lady Cecilia. The anomaly.\nIn a realm where everything is known to the Accord—where everything, by its nature, must be known to the Accord—he is different. He is unknown. He, by his very nature, does not conform with the rules that govern our existence, your existence, everyone’s existence.\nHe must be found.\nHe must be stopped.\nHe must be reabsorbed before he becomes self-propagating.\nI turn. We turn. Together.\nWe smell him.\nHe has been here, on this deck, recently. He must be nearby.\nWe will seek him out, find him, reabsorb him, before the Lady Cecilia docks. We know this for a fact.\nThe Lady Cecilia docks at Penhellion, sliding smoothly into her space in the harbor.\nWe have not found him, the anomaly.\nWe have found places where he has been, places where he has spent long hours alone, no doubt doing battle with his perverse nature. They do that. They don’t understand, but they try. They are you and me, us; it is their nature.\nIt is their nature to hide, and to run. This one has been here, in this world called Laverne, for longer than initial data indicated. Re-run analyses give him perhaps twenty more days’ existence in which to accumulate knowledge, experience, before he was first detected.\nHis development is not linear. Those twenty days are days in which every aspect of his self has become exponentially more complex and data-rich.\nThis one is no babe in arms, then. He is a whirlwind, a destroyer of worlds.\nHe does not know it, of course.\nOur task is to stop him from finding out.\nPenhellion is a city built into a cliff. They could have built it on top of the cliff. They could have built it a few kilometers along the coast where the cliffs are not anything up to twelve hundred meters high. Human nature is not such, and they built it in the cliff. We built it in the cliff. We are of the Accord.\nData flashes.\nThere are agents in this city. Many agents. They will look out for him and their reports will be relayed to us whenever they hold anything of relevance.\nThey do not know they are agents. They do not know they have been selected. Sanji Roseway does not know that she is watching, as she happily stocks her fabric stall on Fandango Way. Neither do the street musician, Mo Yous, or the bar-owner, Milton Goldenhawk, or the dreamcaster, Serendip Jones. They will not know when they are reporting, or when they have reported. That is not their place.\nWe did not see him leaving the Lady Cecilia, but he has done so. Those extra days, that logarithmic escalation of his survival instinct and wiles, have made a difference.\nWe must not underrate him.\nBut first, we must find him.\nHe has been quiet, which has not helped us in our task. He should be like a whirlpool, drawing in the human debris of this society, feeding on it. Such activity sends out signals, leaves traces, a pebble dropped in our collective pool.\nBut with experience comes guile and with guile, restraint. Perhaps he has stabilized. That would be unusual, but not a first.\nWe remain in Penhellion, studying and using our agents to study. He will break cover. He will reveal himself by his actions. They always do.\nWe proxy into a bar—a bar through the eyes of another.\nThere has been a ripple—only the slightest of ripples, but detectable nonetheless. He has emerged.\nWe look across the bar. We are behind the bar, its surface finely polished flutewood. The bar room is crowded, which is good. Picture windows show sunlight splitting into separate colors through water droplets. I like rainbows. I am not an artist, but once I think a part of me was a part of an artist. Alizarin crimson. Venetian red. Monastral blue. Yellow ocher. I could paint that view a million times and in every instance it would be different.\nMy team, my others, are also proxying this bartender, and our gaze is drawn away from the picture windows, and we look along the bar.\nAnother bartender is serving, or rather, not serving, but leaning on the flutewood bar-top, chatting. She is of indeterminate age, as are most adult humans. She has long auburn hair with natural wave, wide eyes with burnt umber irises.\nShe is talking to him. The anomaly. He has the shape of a man, but we find it hard to focus our eyes—this proxy’s eyes—on that shape and determine any detail. He swirls and flows. He is drawing her in.\n“Tish?” we say, addressing the bartender. She looks, we nod toward the crowded room. This proxy is not communicative, but his meaning gets across even so.\nTish moves off to serve other customers.\nWe withdraw, as data flashes.\nThe Falling Droplet. We are several levels away, in this cliff-face city. We open a channel through the consensus, arriving in seconds.\nWe enter the bar. It looks different from this perspective, from the crowd rather than from behind the bar. I look around, orientating myself. We each look around. We scan faces, locating Milton the bartender and then Tish the other bartender.\nI see him. I point.\nHe is intense. I feel dizzy, sick, as if I am being sucked in even though I know that cannot be so, due to the heavy levels of security built into my being.\nI am aware of the others, Ee-jian-die and Sen-jian-die, turning to look. I sense their turmoil.\nI open my hand and spotlight him. That should stun him, lock him into a pool of slowed time so that he will be swimming through perceptual treacle.\nHe is unaffected.\nHe drops a glass, ducks, moves, is gone.\nWe channel, and are standing where he was.\nWe know of the other exit. We look, and he is there, reaching for the door.\nWe close our eyes, lock minds, shift consensus. There is no door there. There never has been a door there.\nHe ducks, vanishes again. He is channeling too, although he does not know it. Short, desperate hops. He reappears by the windows, snatching a chair.\nHe does not understand what is happening. He is resorting to violence, the chair his only weapon against us.\nI smile. He is making it easy.\nHe swings the chair—but not at us, at the window. It shatters, he turns, he throws himself after the chair.\nWe look out of the smashed window at the sea and rocks below.\nHe is not dead.\nHe cannot be dead.\nHe can only be reabsorbed.\nWe remain in Penhellion, even though our anomaly has probably moved on now. He would be foolish to remain, after our first contact. We do not think he is a fool.\nHe is still here. Or rather, he has not gone far—only as far as the clifftop community.\nWe tackle him immediately when contact is made, through our proxy Billi Narwhal.\nHe pulls the same trick and evades us.\nHe is fast, but he appears to be a creature of habit.\nHe has another weakness, too—the woman, Tish Goldenhawk. She is with him. She appears to have retained her integrity too, which is a bonus.\nHe is an anomaly. He can be detected by his disruption patterns, but equally, he can lie low. That is the nature of an anomaly. Or one of its natures.\nBut Tish Goldenhawk . . . If we find her, there is a high probability that we find him.\n3. Tish Goldenhawk\n“Who are you? What are you?”\nTish Goldenhawk has traveled the length of Laverne’s main continent with the man she calls Angelo, and finally she realizes that her invented name for him, “Angelo,” is a more appropriate label than “man.”\nShe has traveled the length of the continent with him, but today is the first time she has seen him kill, although she suspects it is not the first time he has killed. She has dispensed bread and feathers for his victim before confronting Angelo.\nShe has traveled the length of the continent with him and she is ill, drained both physically and mentally, like a scag addict.\nHe smiles. He shrugs. He says, “I don’t know. I did not know the first time you asked me and I have not yet made that discovery. You are beautiful. Death is beautiful. I soak up beauty. That is as close as I have come to defining myself—I am a receptacle.”\nDeath. Tish had never witnessed violent death until today. She hoped young Ferdinand would find peace in his absorption into the Accord.\nThey were walking, Tish and Angelo at the front, and his ragged band of followers, now numbering some twenty-four, doing as their role demanded, following.\nAngelo accumulated followers. It was his nature. People he encountered, people with a sharp enough sense of perception, of distinction, were always able to detect his special nature, his divinity, the fact that he had been touched by the Accord.\nThey wanted to be with him.\nThey wanted to share with him.\nThey wanted to give to him.\nAnd he, like a child with toys made of flesh and not even the slightest sense of responsibility, took.\nThe first time Tish had found him with another, she had ranted and raved, and he had smiled and looked puzzled, and she had seen that he had no concept of what she was feeling, and anyway, she could never be the first to cast stones in matters of infidelity.\nBlind to herself, Tish had first seen the weakness in others. In Maggie and Li, who had joined the group late but had given so wholeheartedly, she had first seen the addict look in the eye, the transformation of devotion into something physical, something living. Each of them carried a cancer, and that cancer was Angelo.\nFerdinand had been one of the first to join. Tish and Angelo and three or four others had stayed the night in a grand ranch-house somewhere a few days to the northwest of Daguerre. The welcome was warm—as welcomes for Angelo tended to be—and the seventeen-year-old son of the owner had been cute and, instantly, devoted.\nFerdinand had come with them. Told his parents he was guiding them to the river-crossing and just carried on with them, and then they’d had to speed up a bit, hitching a ride on a goods wagon, because their welcome at that ranch would never be as warm again.\nFerdinand supplanted Tish as Angelo’s favorite, if he could be said to have such a thing. To be honest, she was not too put out by this development, as already she was starting to feel that psychic leeching that would only get worse.\nFerdinand went from fresh-faced disciple to hollowed devotee to shuffling, skeletal wreck in only twenty or so days.\nIt happened among them—it was happening to all of them, only at a slower rate—and yet it had taken far too long for Tish to notice. In the worlds of the Diaspora suffering had long since been banished. It was not even something readily recognized, like a language newly encountered. There was a whole new syntax of suffering for them to learn.\n“What am I? I don’t know. But I can tell you that it is like flying. I wish to fly and I fly, but once I am up there it is only the air and a few feathers that prevent me from plummeting. So tenuous the thread of existence!\n“You are strong, Tish. So much stronger than the others. You hold me together. You are my air, my feathers. Without you . . . well, I don’t know what I would be without you to support me, to contain me.”\nShe was growing weak. Had been growing weak.\nBut not as rapidly as Ferdinand.\nShe came up on them early that morning, when the sun was still heavy over the mountains, painting them gold and pink.\nAngelo was holding him, his arms easily enfolding the wasted frame.\nTish almost turned away. She had seen this kind of encounter often enough by now. She closed her eyes and thought back to those few precious nights when it had just been the two of them, sleeping rough, both enfolded by his wings.\nShe had been strong then.\nShe opened her eyes just as Ferdinand started to vanish.\nShe watched. She could see through him. See the stones, the thorn bush, the tussock grass, the inside of Angelo’s embracing left arm, previously obscured by Ferdinand’s bony torso.\nThings blurred. Things dissolved, melted, slipped away from this existence.\nHe was gone.\nAngelo turned to her, his expression startled as if he did not know what had happened, had not expected it to happen; but beneath the surprise there was satisfaction, a thrill of pleasure, of strength, and the first hint of that crooked-toothed smile.\n4. Er-jian-die\n“Your air, your feathers . . . so poetic. If you weren’t such an innocent I’d say you had the crassest line in smooth-talk, but you don’t have a clue, do you?”\nWe have her. We have him. I see him through the eyes of Tish Goldenhawk and it is as if a distorting lens has been removed. He is male, of indeterminate age, of mid-brown skin tone and dark hair. He is beautiful and engaging.\nHe draws you in.\nEven at this remove—proxied and many hundred kilometers distant—he draws you in.\nWe debate, as he moves out of view. Act now, via proxy, or attend in body, allowing a short interval in which he might detect our approach and take evasive action? We do not know how much his powers have grown.\nData flashes.\nEe-jian-die takes the proxy, turns her head so that he is back in our field of view. Sen-jian-die and I withdraw, lock, open a channel through the consensus, step through.\nThere is momentary disorientation and then we are standing on a plain, surrounded by cacti and thorn bushes and oddly balanced round boulders.\nThe two of them are there, locked in conflict. A short distance away there is an encampment of bubble tents and track trikes. The people there look on, too damaged to stir.\nShe has him in the beam. She stands, knees slightly bent, body tipped forward, one arm stretched out, palm first, fingers straight, and a beam of white light lances from her hand to him, the anomaly.\nHe stands there smiling.\nHe looks at us as we materialize, although he should not be able to turn his head at all.\nHe raises a hand so that he mirror’s Tish Goldenhawk’s stance and his palm cuts out the beam, reflects it.\nIt shines on her face and she crumples, sobbing, more damaged than she had been before.\nEe-jian-die appears at my side, his proxying of Tish abandoned.\nHe looks ashen, damaged by the encounter, even at a proxy.\nI allow myself to be identified as leader, even though we three are equal; we three are far greater than we three alone. “Your time is up,” I tell the anomaly. “Let these people go. Come back with us. Allow yourself to be reabsorbed.”\nHe smiles in a way that indicates taht he is both amused and puzzled. “Reabsorbed?” he said. “Re . . . ?”\nI nod. “You are a glitch,” I tell him. “A chaotic anomaly. The Accord contains all the individuals who have lived and then died since its inception. You are a bug in that process, a self-resonant fluctuation in the billions upon billions of human elements within the Accord. A remix error. You’re a strange attractor and you need to be smoothed over. Come with us, you will not be lost, you will simply be reabsorbed.”\n“But how . . . ? How can I be reabsorbed if I am not yet dead?”\nHe doesn’t know. He has grown, but he does not know.\n“ ‘This is the Accord,” I tell him. “We are living the afterlife. The afterlives.”\n“What happens if I say ‘no?’ ”\n“We will force you.”\n“And if you fail?”\n“You will carry on growing. Like a leak in a pool, you will continue to drag in those about you, soaking them up until they are husks. They are drawn to you. We are drawn to you. You are like a black hole in human form. You will suck us all in and the Accord will fail to be. It will crash on a galaxy-wide scale.”\nHe—this thing, this entity, this it—is smiling. “So, if I believe you, then I—” it thumped its chest in apelike display “—am an alternative to the Accord? An alternative reality?”\nIt laughs. “I like this,” it says. “It is all so beautiful. So, so beautiful.”\nWe strike, synchronized.\nHe locks him in the immobilizing beam, far more powerful than we have used so far. I lock him in a second, our combined beams more than doubling their intensity in combination. Sen moves in to interface, a physical connection with the Accord.\nThe anomaly is still smiling.\nIt turns and lashes out a beam of light and Sen flies through the air in several pieces.\nIt turns again, and lashes at Ee, and I sense our hold—if ever we had had a hold—weakening.\nAnd then . . . light, dark, an absence that is where the pain would have been if my body had not immediately shut down those pathways. A lot of absence.\nMental silence. Ee-jian-die and Sen-jian-die have been returned to the Accord. They will reappear, but not here, not now.\nI am still here, though. I have not been returned.\nI open the eye that I am able to control.\nI see sky, a thorn bush.\nI see her. Tish Goldenhawk. Looking down at me.\n“What can I do?” she says.\n“Nothing,” I tell her. The body that carries me is too fundamentally damaged. It could be repaired, of course, but what is the point? My task is over, I have failed. I will be reabsorbed. Someone else will be sent, and they will try again. The anomaly will have grown, but it will be fought, only not by me next time, or at least, not by the combination of traits that is this me.\n“What happens to us when he has sucked us dry?”\nShe is strong, this one.\n“If this is the Accord, then where does the data go when he has absorbed it? You said he’s some kind of black hole—what’s inside him?”\n“Who knows?” I say. “The physically dead enter the Accord and we live on, again and again, for eternity. But attractant anomalies like this remove us from the afterlife. It’s like asking where the dead went before there was an Accord. They died. They stopped being. They ended. If he takes us from the Accord, we end.”\n“What can I do?” she repeats, and I realize that she does not mean to ask what she can do to help my mortally damaged body, but rather what can she do to stop the anomaly, the attractor, her lover.\n“He said I was his air, his feathers, that I held him together,” she said. “I want that to stop.”\nIn that instant I want to paint her. Like the rainbows, I could paint her a million times and each would be different, but always her strength, her purity, would come through.\n“You have to get close to him,” I tell her.\n5. Tish Goldenhawk\n“You have to get close to him,” this wreck of a human construct tells her. “Hold him.”\nTish Goldenhawk nods. In her mind she can see Angelo holding Ferdinand, absorbing him. She knows exactly what this agent of the Accord means. “What then?”\n“That’s all,” he tells her. “I will do the rest.”\nAngelo waits for her in the encampment, smiling. She should have known he would not go on without her.\n“I’m sorry,” he says. His words have no meaning. They are just vibrations in the air. “They tried to kill me.”\nShe nods. “They’re dead now,” she says, wondering then at the lie—whether she has made a fatal mistake already.\nHe shakes his head. “One lives,” he says, “but only tenuously. He does not have long, I think.”\nHe turns. “We must move on,” he says. “There will be more of them. Another day and we will reach a city, I think. A city would be good.”\nShe looks at him, tries to see him as she had once seen him, a charming, exciting escape. That had only ever been one of her fantasies. She tries to see him as her lover, but cannot. Tries to see him even as human, but no.\n“I can’t,” she says in a quiet voice.\nHe turns, raises an eyebrow.\n“I can’t go on.” Getting stronger. “I’m leaving. Going home. You don’t need me anymore.”\n“But . . . ”\n“No buts,” she says. “I can’t do this. I’m exhausted. Drained. I’m leaving.”\nHe is not human, but there is so much in him that is.\n“You can’t,” he says. “I . . . You’re my support. My feathers, the air that holds me up. The air that I breathe!”\n“I’m tired,” she says. “You can’t lean on me anymore. I’m none of those things . . . I’m not strong enough. Can’t you see? It’s me who needs supporting!”\n“I will always support you,” he says.\nHe opens his arms, just as he had for Ferdinand, who had been too weak to continue.\nHe steps forward.\nShe waits for him to come to her, to hold her.\nScent of cinnamon, of dry, dusty feathers. She holds him.\nShe senses the flow, the seething mass of energies. They came from . . . beyond.\nHe gasps, straightens.\nShe holds on.\nHe is looking down at her. He knows. He dips his head and kisses her on the brow.\nShe holds nothing, holds air, hugs herself. She drops to her knees.\nThere are feathers, nothing else. She gathers some. She will cast them for him, with bread, when she gets back to Penhellion.\nShe does not doubt that she will go there, go home.\nPoor Milton. Poor Druce. She has changed. She does not know what can be salvaged, but she will go home now and she will see.\nShe stands.\nEven if nothing can be repaired, she has no regrets. She would do it all again.\nShe is of the Accord.\nThey all are of the Accord.\nOriginally published in The Solaris Book of New Science Fiction, Vol. 1, edited by George Mann, 2006.\nKeith Brooke is the author of fourteen novels, six collections, and over 70 short stories; his most recent SF novel alt.human (published in the US as Harmony) was shortlisted for the 2013 Philip K Dick Award and is story \"War 3.01\" is shortlisted for the Seiun Award. He is also the editor of Strange Divisions and Alien Territories: the Sub-genres of Science Fiction, an academic exploration of SF from the perspectives of a dozen top authors in the field. Writing as Nick Gifford, his teen fiction is published by Puffin, with one novel also optioned for the movies by Andy Serkis and Jonathan Cavendish's Caveman Films. He writes reviews for the Guardian, teaches creative writing at the University of Essex, and lives with his wife Debbie in Wivenhoe, Essex."}