{"fingerprint": "0XKvRylmdTmHyIdPkh742W5XAns=", "sitename": "Clarkesworld Magazine", "title": "Laying the Ghost by Eric Brown", "author": "Eric Brown", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/brown_10_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Laying the Ghost by Eric Brown", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6130 words, short story\nLaying the Ghost\nWe were winding down after coming in from Aldebaran with a haul of starship wreckage. I’d sold the scrap en route and left it in geo-sync orbit above Constance, Altair III, for the merchant to collect. The funds were already in my account and I was treating Ella and Karrie to a meal and a few drinks.\nA pianist was improvising Lyran mood-music and the ceiling pulsed with images of Jovian superstorms. Across the spaceport, starships were phasing into and out of the void in eerie silence.\nWhile Ella was at the bar, Karrie said, “For an AI, you know, she’s almost . . . well, human.”\n“She’s running on a self-aware paradigm, Karrie. That paradigm is human. She has all the emotional capacity of you and me. As far as I’m concerned, she’s our equal.”\nKarrie just looked at me.\n“What?” I said.\n“Talking about emotional capacity, Ed . . . Have you ever considered your own?\nI stared at her. “Mine?”\n“Have you heard of the expression ’a cold fish’?”\nYou can know someone for years—in this case almost ten—and still be amazed at how they view you. “Me? What on earth makes you think that?”\nShe enumerated her argument with calloused fingers. “One, you never talk. I mean about things that matter, your feelings, your emotions. You never allow people into your head.”\nI said, “You wouldn’t want to go there. It’s full of day-to-day rubbish. Nothing deep going on in there.”\n“You see—there you go again. Trivializing what is important. Two,” she went on before I could protest, “you never talk about your past, what’s affected you. Three, you rarely speak about the future, what you want—other than the next big haul.”\n“And what wrong with talking about the next big haul?” I said dismissively.\nKarrie snorted.\nI was glad to see that Ella was returning with a tray of drinks. As she slinked through the crowd, I noticed a few men and women covertly eyeing her slim body. She slipped into the booth, smiling at me.\n“What do you think, Ella?” Karrie said, taking her drink.\nOh, God . . . I thought.\n“About what, Karrie?”\n“About Ed. Do you think he has deficient emotional capacity?”\nElla looked from Karrie to me, her expression serious. She said, “I think his emotional capacity is far from deficient, Karrie. What is deficient is his ability to express, to show, those emotions. I suspect some past trauma is inhibiting him in this respect.” She looked at me. “Maybe you will tell us about it, one day?”\nKarrie was smirking at this turn in the conversation.\nI said, “Well, thanks. Here I was, enjoying a quiet drink with my crewmates, when everything gets suddenly psychoanalytical. Listen, there’s nothing wrong with me, emotionally or otherwise. I have no hang-ups, no inhibitions. I’m happy Ed, the salvageman . . . ”\nI raised my glass. “Anyway, here’s to many another successful haul.”\nAround then I noticed the figure in the Orion warware spacesuit. It was moving from group to group of drinkers, talking to them briefly and then moving on. From the dismissive gestures of the people spoken to, I received the impression that whoever was in the suit was asking for something, and being turned down.\nA minute later the figure perched itself on a stool at the opening of the booth and stared in at us.\nI say ’stared’, but I only assumed that. The oval faceplate in its sleek, silver helmet was as milky as opal. Its silver suit was streamlined and body-hugging, the surface swarming with millions of nanoware-bots like iron filings in oil.\nFrom its shape, I guessed there was a woman in there.\n“What do you want?” Karrie asked brusquely.\n“I find myself in a difficult situation,” it said. Its voice was feminine, but transistorized. For all I knew, the inhabitant of the suit might not even be human.\nShe went on, “I need to leave Constance, but I cannot locate a ship heading in the direction I require.”\nBefore Karrie could jump in with some sarcastic comment, I asked, “And where’s that?”\nA hesitation, then, “The Chandrasakar Stardrift.”\nI whistled. “That’s quite a way away.”\n“Five thousand three hundred light years, give or take.”\nKarrie shook her head, derisive, and took a long swallow of beer.\n“Where specifically in the Stardrift?” I said.\n“A planet called Serimion, Kharran II.”\n“Serimion . . . ” I said. “Now where have I heard the name before?”\nElla said, quick as a flash, “Serimion: site of the war between human colonists and the native inhabitants of the Kharran system. It was a particularly brutal and bloody conflict. The alien race known as the Kha, from the fifth planet of the system, invaded without provocation. Approximately three million humans lost their lives on Serimion.”\nThe person in the suit said, “Precisely three million, two hundred thousand and ninety. Let no lost soul go unmourned.”\nI asked the obvious question. “But why do you want to go to Serimion?”\nThe being hesitated again, before saying, “I have my reasons.”\n“But won’t it be dangerous? I mean, won’t the Kha be hostile to human arrivals?”\n“They allow a certain number of mourners and war historians to visit the shrines of Serimion every year,” she said.\nI wondered which category she fell into.\nI considered for a minute, then said, “Well, it’s a long way, and not where we were heading . . . The fare would be hefty.”\nA silence. The opalescent faceplate turned to me, and the soft, feminine, transistorized voice said, “That is the other slight problem. I am without the funds to finance the journey.”\nKarrie snorted and shuffled from the booth. “I’ll be back at the ship, Ed.” She stood and hurried from the bar.\nThe milky oval of the faceplate, behind which anything might be lurking, was still regarding me.\nI said, “A lack of funds is certainly a problem. I don’t see how . . . ”\nThe figure pointed to my flight-suit. “I see you bear the sigil of a salvage captain. There is a small starship, a strike vessel, drifting in orbit around Serimion. It belongs to me. You may take it in recompense if you agree to transport me there.”\nI looked at Ella, who said, “What kind of strike vessel, exactly?”\n“A Corinthian, Class II.”\nElla said to me, “Even badly damaged, it would fetch approximately twenty-five thousand Altairian units on the open market.”\nWhich would more than cover the cost of the return journey to the Chandrasakar Stardrift.\nOf course, there was no way of telling if the being in the suit was telling the truth.\nI said, “Show me your face.”\nAfter a moment, on some internal command, the faceplate cleared.\n“You’re human?” I stared at the pretty, impish face revealed; dark, short hair, high cheekbones, a snub nose. She looked no older than twenty.\n“But why the suit?” I asked.\nShe shrugged, twisted her lips uncomfortably. “I . . . I have a certain condition. My immune system is dysfunctional.” And she left it at that.\nShe looked at me, hope evident in her big brown eyes. “Well . . . ?”\nI said, “What’s your name?”\n“Katerina,” she replied. “Katerina Reverte.”\n“Well, Katerina . . . Why don’t you give me five minutes to discuss things with my co-pilot here?”\nKaterina nodded, rose and strode across to the floor-to-ceiling viewscreen that looked out over the expanse of the spaceport. Reduced in the perspective, she looked tiny, vulnerable.\n“Well,” I said. “What do you think?”\n“I think the situation is certainly odd. She is wearing an Orion warware suit, which is even more expensive than a Corinthian. She could sell the suit, which would more than pay for her medical treatment. It would also pay for her return to Serimion.”\n“You think she’s lying about her condition?”\n“That is certainly a possibility.”\n“And about the Corinthian, too?”\n“Impossible to ascertain.”\nI nodded. “It’d be a risk.”\n“I would like to know the reason she wishes to return to Serimion.”\nI shrugged. “My guess is she fought in the war. She wishes to return to lay ghosts, to revisit old battlefields . . . ”\n“Maybe.”\n“Well, perhaps we’ll find out along the way.”\nElla fixed me with one of her impassive stares. “You will agree to take her?”\nI nodded, and looked across the lounge to the suited figure. Katerina had turned and was watching us. I signaled her over.\nShe came hesitantly, almost wincing. I held out my hand. “We phase out in five hours,” I told her.\nHer expression, behind the faceplate, was joyous.\nKarrie took a while to simmer down, even when I told her about the Corinthian.\n“But you know nothing about her! Who she is, what she is! She’s striding around here in that damned war suit . . . you realize how powerful those things are?”\nI shrugged. We were a day out of Altair III, sailing through the marmoreal realm of void-space, two days away from the Chandrasakar Stardrift.\nKarrie went on, “Why did you agree, Ed?”\nI shrugged again. “She’s young, vulnerable. Everyone else back there had turned her down.”\nShe stared at me. “I just don’t believe you . . . ”\nI smiled at her. “What did you say back at the port, that I didn’t show my emotions? Well, I’m showing them now. I feel sorry for the kid and I want to help her—”\nKarrie pointed at me. “This has nothing to do with your emotions, Ed, and all to do with your male biology.”\n“Bullshit, Karrie!”\nElla chose that moment to slip through the hatch and cross the flight-deck. She eased into her sling with a smile at me. “For two people who have been in each other’s company for almost ten years,” she said, softly, “you spend a lot of time in altercations.”\n“That’s what ten years of being banged up with a sarcastic, sour-faced cynic like Karrie does to you.”\n“And fuck you, too,” Karrie spat.\n“Anyway,” Ella said, “the drives are functioning at ninety-eight per cent efficiency, the smartcore reports no problems, and mechanically all aboard the ship is running smoothly.” Did I discern the stress she put on the word mechanically?\nUnder her breath, Karrie muttered, “And you’d know about that, girl,” but if Ella heard her, she chose to turn the other cheek.\n“Have you had a chance to talk to Katerina?” I asked.\nElla nodded. “I took her on a tour of the ship.”\n“Learn anything?”\n“Very little. She said she was born and brought up on Serimion, but when I asked about the war, and whether she fought in it, she clammed up.”\n“Do you know much about Serimion?”\n“My cache has an extensive file on the planet: settled by humans over two centuries ago, a pastoral place of vast agricultural concerns, a million villages, considered by the rest of the Expansion to be technologically backward. It was settled by a breakaway faction of the Amish community of Mars. The attack by the neighboring Kha came out of the blue.”\n“And no one has ever found out why the aliens invaded?”\nElla shrugged. “A motive was never discovered. That’s what rankles with the survivors to this day, as well as the terrible loss.”\nShe fell silent and stared through the viewscreen at the grey void.\n“I think I’ll go talk to Katerina,” I said.\nAs I slipped from my sling and approached the hatch, Karrie said, “You’ll have difficulty getting that suit off her, if that’s what you’re thinking about. Seems she’s welded to the damned thing.”\nI bit my tongue and pulled myself through the hatch, wondering what Karrie’s problem was.\nAs I descended the ladder, I heard Ella saying, “You should cease your criticism of Ed. He is, after all, biologically impelled by male drives.”\nAnd I’d thought Ella was on my side . . .\nI found Katerina in the observation lounge. She was seated before the great curving viewscreen, staring into the void. She had the cowed aspect of a devotee at a temple, a worshipper in a cathedral of the infinite.\n“Do you mind . . . ?” I asked, gesturing at the foam-form beside her.\nShe looked up. “No, please. Be my guest.”\nI sat down beside her and saw that her faceplate was once again blank.\n“Ella told me she’d shown you around the ship.” I stared at her sleek silver suit, wondering at its power.\n“She gave me a guided tour.” She paused, then went on, “She is an AI, isn’t she?”\nI nodded. “Yes, but one running on a self-aware paradigm.”\nShe turned her faceless faceplate to me and said, “Does that make her human, Ed?”\nI smiled and shrugged. “I honestly don’t know, Katerina. It does make her a sentient being. And my equal. That’s what matters to me.”\nShe nodded. “Will you apologize to Ella for me, Ed?”\n“What for?”\n“For my inability to . . . to talk to her openly. She wanted to talk, I sensed, but I was unable to respond.”\n“Because she wasn’t human?” I asked.\nInstead of replying, she retuned her gaze to the infinite. A little later she said, “Do you believe in vitalism, Ed? The idea that—”\nI smiled. “I know what vitalism means.”\n“Well?”\n“I don’t know. Perhaps, once, I did. It’s a nice idea, after all, to think that humans are imbued with a special, God-given light of fire, vitality, soul . . . ”\n“Perhaps once?” she said. “But no longer?”\nI smiled. “Then I met Ella and I had to rearrange my thinking a little.”\n“So you think that life can exist without that vitality?”\n“Look at Ella,” I said.\nShe turned to look at me. “Yes,” she said, “but is Ella truly alive?”\nI shrugged, and let out a long sigh, out of my depth and uncomfortable. I said, “What about you? Do you believe in vitalism?”\nShe turned her head to me and said, “Oh, I know vitalism is real.”\nI nodded. Ella had informed me that the Serimion colony had been religious.\nShe went on, in her own time, “I was brought up believing in a just God, a God who punished the bad and rewarded the good. We were a peaceful people. We practiced non-violence, living within our means, at one and in harmony with our environment, our world. We knew how lucky, how God-blessed we were in settling on Serimion, and we gave thanks.”\nBeyond the viewscreen, the grey void swirled. There were times when I thought I discerned patterns in the marmoreal streaks in the infinite, and others when I knew that the void was purely random and chaotic.\nKaterina went on, softly, “I was brought up on a big farm, run by my parents. I had four older brothers . . . They treated me like a princess.” I’m sure, had I been able to see her face, I would have witnessed her smiling. “We worked hard and worshipped daily, and life was bountiful and good. We knew our neighbors and trusted them. They were like us. I never really apprehended that there was an outside world . . . another way of doing things. Even when I graduated from school and attended college . . . all the world was one, one belief, one way of doing things. And then . . . ”\nAnd then, I thought, the Kha attacked.\n“I was on holiday with friends at the time. We were in a resort on an island far to the south. This saved my life. We were aware that something terrible had happened . . . the firestorms in the atmosphere, the explosions. We saw their attack ships in the distance. When we returned to the mainland . . . ”\nShe fell silent. I reached out and laid my big hand over her small, cold silver mitt.\nShe went on, “Devastation. Destruction. All the cities, every one of them, all the small towns . . . destroyed. Firebombed, and worse . . . They’d used weapons we didn’t even understand. Reducing people and places to dust . . . We never stood a chance. We didn’t even . . . didn’t even have an army.” She fell silent. Then: “I returned home, or to what was left of it. I found my parents, my four brothers. They were dust, Ed, with just scraps of clothing here and there to identify them.”\nI let a respectful interval elapse, then said, “How did you get off planet?”\n“A Federation ship had monitored the attack and sent rescue rafts. All told, just seven thousand of us survived. We—well, a few thousand of us—decided to fight back. Our rage, our grief, overcame our pacific instincts, our long-held beliefs. We had assets lodged in banks across the Expansion, and we bought attack ships and . . . ” she raised her hand, “and state-of-the-art warware. And we returned to Serimion and fought the Kha.”\nI said, “What happened?”\nShe turned her helmet toward me. “We lost.”\nSeconds, then minutes elapsed. We were alone with our separate thoughts as we stared into the void.\nA while later I said, “And vitalism, Katerina? Your certainty . . . ?”\nShe turned to look at me. “I know it’s real, Ed, because of what happened to me in orbit around my homeplanet.” And she left it at that and hung her helmeted head.\nI hesitated, then asked, “What happened, Katerina?”\nShe just shook her head, silently.\nI squeezed her gloved hand, and thought it wise to leave her to her memories.\nI returned to the flight-deck and was relieved to see that Karrie was not there.\nElla hung in her sling, her head flung back, the whites of her eyes showing.\nShe sensed my presence and came back from whichever cyber-realm she’d been inhabiting. “I was integrating with the ship’s smartware core, Ed,” she said matter-of-factly.\nI smiled to myself, wondering at the process which allowed her to commune with my ship’s logic matrix.\nI said, “I’ve been talking to Katerina. She told me about what happened on Serimion.” I told Ella what Katerina had said about the attack, her return to fight the Kha. Her defeat.\n“Which makes me all the more curious as to why she wishes to return there, Ed.”\nI shook my head, and then found myself reaching out and taking Ella’s hand. It was small, warm, and very human. I held it tight and said, “Ella, when I was young . . . my sister died. That’s another story. I don’t want to talk about it now.”\nShe stared at me with her big brown eyes. “What do you want to talk about?”\nI took a breath. “After what happened, I found myself drawn back to the place where Maria died. I was compelled. I couldn’t explain why. It was the place where she’d last been alive; perhaps that was it. Perhaps I thought I might commune with whatever of her remained. Silly, I know. But anyway, I had to go back. And you know something? When I did, when I went back and stood on that spot, and thought of my sister and the silly accident that robbed her of her life, and when I cried . . . well, I felt a lot better for doing so.” I squeezed Ella’s hand. “Perhaps that’s why Katerina’s going back? Can you understand that, Ella?”\nShe returned my gaze with her lustrous eyes. “Yes, Ed,” she said. “Yes, I understand perfectly.”\nOne thousand Kha sentinels, grey and monolithic and as vast as ten city blocks, hung in space around the defeated planet of Serimion.\nMy ship’s smartware core spoke in its soothing, feminine contralto. “Kha AIs have established contact, Ed. They wish to know the purpose of our visit.”\n“Tell them that we’re here to pay our respects to the human dead,” I said, “and we seek clearance to land on Serimion.”\nWe eased to a halt beside one of the sheer grey monoliths, and waited.\nFramed within the girdle of sentinels, the planet tilted ten degrees off its polar axis, blue and white and twice the size of Earth.\nElla said, “It’s beautiful.”\n“I’m not looking forward to finding out what might be down there,” I said. “If the Kha let us through, that is.”\nKarrie joined us on the flight-deck and eased herself into her sling.\nI said, “So, our passenger proved the security risk you mentioned, Karrie?” I couldn’t help the jibe.\nShe looked at me. “No, but there’s something seriously wrong with the girl.”\n“What?” Ella asked.\n“Have you noticed she doesn’t eat? It’s been three days since leaving Constance, and I’ve taken six trays of food to her berth. She hasn’t touched a thing.”\nI shrugged. “So . . . the girl wasn’t hungry. She’s returning to the place where her family, her people, were massacred, after all.”\nElla turned in her sling. “Ed,” she said, almost reluctantly. “There is something else that doesn’t quite ring true. Physically, Katerina appears to be twenty, twenty-five years old.”\n“Go on.”\n“I’ve been double-checking the records. The Kha attacked Serimion twenty-five years ago.”\nI stared down at the slowly rotating planet. I recalled Katerina’s youthful, elfish face within her helmet.\nKarrie said, “Seems to me like the girl’s been lying to us, Ed.”\nI was about to ask Ella why Katerina might have lied when the smartcore said, “Clearance granted. The Kha have issued a two day pass. We must be out of Serimion airspace within forty-eight hours.”\nMinutes later Katerina joined us on the flight-deck. She stood between my sling and Ella’s and stared through the viewscreen at her homeplanet.\nShe had cleared her faceplate, and her youthful face stared out, her eyes wide in wonder.\n“I have the co-ordinates for the Corinthian,” she said, and reeled off a series of numbers to Ella.\nWe eased past the sentinel. I was glad to leave the cold, inhuman monolith in our wake. Ten minutes later, Ella pointed. Through the viewscreen we made out the becalmed wreck of the Corinthian, nose down in relation to the planet, ragged holes puncturing its fuselage.\nKarrie said, “And you survived that?”\n“I wish I hadn’t,” Katerina said, softly.\nI said, “Okay, Ella. Stow those co-ordinates and we’ll tractor beam the Corinthian on the way out.” I turned to Katerina. “Now, where do you want us to land?”\n“No one has ever seen the Kha,” Katerina told us. “They have had no contact with the Human Expansion, and do not allow visitors to their homeplanet. When they struck Serimion, they did so from altitude. Later, when we returned and engaged them in battle, we saw their ships but never the Kha themselves. The few Kha vessels we managed to destroy exploded in space, so no alien remains were ever discovered.” She paused, then went on, “Some say the Kha resemble devils, others maintain they are insectoid. To me, it does not matter. The very sound of their name conjures absolute evil.”\nWe were drifting slowly over the planet’s vast southern continent. Ruined villages and townships punctuated the green continuity of the veldt. Roads and rivers threaded the landscape, but nothing moved down there. Absolute stillness greeted our gaze, and I could not help but think of the planet as a cemetery without gravestones.\nWe floated towards the planet’s equator, where Katerina’s family had farmed the land. Veldt turned to rainforest, a vast tangle of alien vines and great gnarled, crimson trees, and then the rainforest gave way to a range of purple mountains that ran parallel to a great rift valley. Between these geographic features stretched a plain of fertile land that was Katerina’s birthplace.\nElla touched my arm. “Look. Down there.”\nSomething squatted on the plain. I said, “Bring us down, slowly.”\nElla eased the ship to within a hundred meters of the thing.\nKaterina said in a tiny voice, “Could it be a Kha?”\nWe hung in the air, observing.\nI could not tell whether it was mechanical or biological. Twenty meters long, perhaps ten high, it was armor-plated with what looked like matte black chitin, domed and segmented and squatting on the ground as if devouring prey.\nFrom what I guessed was its head-section, or what might have been its control center, a long proboscis—or drill—punctured the soil.\nWhether a Kha, or one of their creations, its act was symbolic of the rape of the planet.\nAs we watched, it seemed to shiver with ecstasy, or maybe just mechanical vibration.\nI glanced at Ella. “Sound?”\nShe passed her hand over her controls and seconds later a deep ululation filled the flight-deck. It reminded me of the chanting of a thousand monks, resonant and dolorous.\nI asked Ella, “Do you know whether it’s alive, or . . . ?”\nShe went rigid in her sling, her eyeballs rolled to show only their whites as she attempted to communicate with the thing.\nShe shook her head. “It’s hard to tell. I sense a biological core, surrounded by extensive technological addenda.”\nI looked at Ella, saying nothing.\nIn a tiny voice, Katerina said, “We revered our planet, Ed. We loved the earth. This . . . this thing is robbing its vitality . . . ”\nI reached out to take her gloved hand, but she pulled away. “Get us away from here! I don’t want to . . . ” She turned from the viewscreen, holding her helmeted head in her hands.\nElla sped us from the thing, towards the continental rift valley.\nOne hour later we came down on a plain of lush grassland beside the escarpment.\nA hundred meters before the ship was the outline of farm-buildings, and beyond them the geometric pattern of fields, their crops gone wild long ago.\nKaterina said, “I would like a few minutes by myself, Ed. Then, would you come and join me? I have a lot I must explain.”\nI nodded. “Of course.”\nShe moved from the flight-deck. Minutes later her tiny figure emerged from the shadow of the ship, moving past the ruins of the farmhouse towards the edge of the escarpment.\nShe stood with her arms on her hips and stared about her.\nIn silence, we watched.\nAfter a minute she moved towards a lone tree that grew at an angle, leaning out over the rift valley. It was similar to those I had seen in the rainforest, crimson and contorted, with a vast, spreading leaf canopy.\nShe found a place in its gnarled root system and sat down, staring out across the abyss.\nLike this, very still, she remained for perhaps fifteen minutes.\nAt length she turned and raised a hand, and I took this as a summons.\nElla and Karrie said nothing as I left the flight-deck and climbed down to the air-lock. I cycled myself through and stepped out onto the soil of Serimion. The first thing I noticed was the scent, a heady, spicy mix of soil and flower blooms. The grass, I saw, was embroidered with a spread of tiny yellow flowers, which gave off an almost overpowering perfume as I strode from the ship towards where Katerina sat.\nAt one point I paused and looked back. Ella and Karrie stood before the viewscreen, gazing down at me like figures in an aquarium.\nI passed into the shade of the great leaning tree and picked my way through the knuckled roots until I came to the girl. I sat down beside her. “It’s a beautiful world, Katerina.”\nShe turned to me. Her youthful face showed behind her faceplate, and she smiled. “It was even more beautiful, Ed, before they attacked.”\nI looked away, and then saw, standing among the raised roots on the edge of the escarpment, six simple wooden crosses.\nShe saw the direction of my gaze and said, “We had a custom on Serimion, Ed. We buried our dead beside trees, and this was my parent’s favorite place on the planet. At sunset they would come out here with a drink and just sit and admire the view.”\nThe silence stretched. A gentle, warm wind picked up the scent of the flowers and swamped us.\nShe said, “After the attack, I drove back here from the southern coast, passing devastated towns and knowing what I would find . . . The farm was destroyed, looking much as it does now. I found no personal possessions, no mementos . . . Perhaps that was a good thing. To have found objects that belonged to mother and father and my brothers, that would have been too much. Now, I would like something to remind me . . . ” She turned and smiled at me. “Is that silly?”\nI returned her smile. “Not at all, Katerina.”\n“I found what was left of my family . . . or perhaps I was kidding myself. I found scraps of clothing, and dust, and scooped it up and carried it over here and buried it beside the tree, then planted wooden crosses I made from what remained of the farmhouse. I even said prayers, and then vowed to get my revenge.\n“I don’t know whether it was hours or days before I was found by a rescue ferry and taken to the nearest human colony world.” She waved. “Anyway, two years later I did come back, in this suit, in the Corinthian, and I did exact a futile, limited form of revenge. I destroyed two Kha craft and then, and then . . . ”\nShe gathered herself, then went on, “And then a Kha fighter struck, and disabled the Corinthian, and left me for dead. A rescue vessel picked me up, took me back to the colony world . . . ”\nShe gazed down at the forlorn row of crosses. From this angle, I could not see her face.\n“I said I had a lot to explain, Ed.”\n“The attack happened twenty-five years ago,” I said, “and yet your face is that of a woman of twenty. You never eat, never open your suit . . . ”\nShe turned her helmet and looked at me. Behind the faceplate I could see silver tears tracking down her cheeks. She raised a gloved hand and stared at it. “These suits were the latest Orion warware. They were made to help a fighter fight, augmented with an integrated AI to boost physical reaction time, mental acuity.” She stopped, and her next words surprised me, “Do you know why I came here, Ed?”\nI said, “To pay respects, to . . . to lay the ghost?”\nShe laughed, briefly. “That’s good. I like that. Yes, to lay the ghost.” She stared at me. “I came to this gravesite to bury myself.”\nI stared at her, and watched as she lifted her gloves to her helmet and touched a control at the neck. The helmet opened slowly, folding out in sections, blooming like a flower. At some point in the process the hologram showing her youthful face flickered off. And I stared, unable to believe what I was seeing.\nA skull sat askew on the notched column of her vertebrae, grinning out at me.\nIt was all I could do not to back away in shock. I almost retched.\nHer voice, her soft, feminine voice, continued, “These are fighting suits, Ed. And they go on fighting when the fighter within them is technically dead. Shrapnel punctured an elbow seal in the suit when my Corinthian was attacked, and I died of asphyxiation. I was cerebrally integrated with the suit’s AI, and it uploaded my memories into its operating system . . . and I would have gone on fighting, if the Corinthian had been capable.”\n“Oh, Christ, Katerina.”\n“For two days after the attack, when I was rescued and taken back to the colony world, I thought I’d managed somehow to survive. And then a medic broke it to me, and opened my suit, and . . . ”\nHer gloved hand lifted, indicated the grinning skull.\n“You cannot begin to imagine the shock, Ed, the terror.”\nI could only shake my head and bite my lips in an effort to stem my tears. I stared at the lop-sided skull, and it stared back at me, its orbits huge and shadowy. I wanted to get to my feet and run, but my legs felt weak and bile rose, acid, in my throat.\nShe said, “I told you that I believe in vitalism, in the soul, because of what had happened to me. I am less than human, now, a mere mechanical set of stored memories and emotions.”\nShe reached up, took her skull in her gloved hands and lifted it from her spine. She lowered the skull to her lap, where it sat gazing blindly out across the abyss.\n“The terrible, terrible thing is, Ed, that in my heart . . . or whatever passes for my heart now . . . I know that vitalism is a fact. Because now I am reduced.” She touched the chest of her suit, and slowly its torso opened, two flanges hinging outwards to reveal a chaotic jackstraw assemblage of bones within.\nShe leaned forward, over the skull in her lap, and with both hands scooped a hollow in the fine earth before the closest cross. I watched, appalled yet fascinated, as she placed her skull in the grave, then reached into the cavity of her chest and one by one withdrew her bones.\nShe raised her right arm and her ulna and radius, then her smaller metacarpal bones, rattled into the suit’s torso. She did the same with her left arm, and collected the bones and laid them, reverently, in the grave. Next she split a seam in her legs and withdrew the femur and tibia from her right leg, along with the smaller bones, and then the left, and I closed my eyes and wept.\nWhen I looked again she was covering the bones with soil to create a small, compact mound.\nShe turned her suit to face me, and her disembodied voice said, “Humans, Ed, are far more than mechanistic machines. I know this because of what I am now. Although I have the memories of what happened, I do not have the ability to feel real emotion, to grieve.”\nI wanted to tell her that she could be upgraded, that AIs had developed so much over the past twenty-five years. I wanted to tell her that she could be made human.\n“I had a lover, a young man who fought alongside me and survived. While I was in hospital, he came to see me. I had just been told what I had become, and I showed him . . . ” She paused, then went on, “Ed, the look on his face, the horror, before he fled . . . ” She turned her opened helmet to me. “But for all I could intellectually appreciate what he might be feeling, I could not find it within me to empathize. And I felt . . . nothing.”\nThe silence stretched, and I could find not one word to comfort her.\nThe sun was setting behind the far horizon, laying down gorgeous laminates of tangerines and pinks. Far below us, shadows turned the abyss into a dark, inky pit.\nAt last she said, “I came here to bury myself, and I came here also to die.”\nAnd she reached into the cavity of her chest and pulled out two slim columns. She held them up before me. “The suit’s energy system, Ed. Without them the suit will run down in hours.”\n“Katerina . . . ”\n“It’s what I want. Peace at last. I can’t feel grief. I can’t feel sadness or pain. Or joy, or happiness, or love . . . All I have is the memories of these emotions. Now is the time I have dreamed of for so long. To die, here.”\nShe took the silver columns, drew back her arm and flung them into the rift. I watched them sail through the air, end over end, catching the dying sunlight as they fell.\nShe hunched forward, hands upturned in her lap, her open helmet bowed as if in supplication.\nShe said, softly, “I can feel myself slowing down already, Ed, and it is wonderful.”\n“Katerina, I’ll stay.”\n“No, please go. And say to Ella . . . tell her that I’m sorry, so sorry.”\n“Goodbye, Katerina.”\nShe failed to respond, and I reached out and took her gloved hand for one last time, then stood and made my way through the root system of the great tree towards the ship. I stopped, once, and looked back, but the woman who had been Katerina Reverte was now no more than an empty Orion warware suit, seated on the edge of an abyss.\nI heard the hatch of the ship hiss open, and Karrie stepped out and faced me. Her eyes were hard, questioning, and I knew I could not bring myself to describe what had happened, yet.\n“Ed?”\nI hurried past her, and stopped before the hatch. Ella had appeared, and was watching me. Her expression was unreadable. She said, “I listened, Ed. I heard what Katerina told you.” She reached out her arms towards me. “And I just want to say that I understand your pain.”\nAt the sight of her standing there, so slight and vital and human, something broke within me\nI stepped forward, and took her in my arms, and wept.\nEric Brown began writing when he was fifteen and sold his first short story to Interzone in 1986. He has won the British Science Fiction Award twice for his short stories and has published over thirty-five books. His latest includes the novel Engineman and, due out in December, Guardians of the Phoenix. He writes a monthly science fiction review column for the Guardian newspaper. He lives near Cambridge, England."}