{"fingerprint": "ptIyoZiCPmD2anSLhOMyPlzbmq0=", "sitename": "Clarkesworld Magazine", "title": "The Fish Merchant by Tobias S. Buckell", "author": "Tobias S Buckell", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/buckell_08_16_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Fish Merchant by Tobias S. Buckell", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5210 words, short story, REPRINT\nThe Fish Merchant\nLi Hao-Chang, standing in front of a colorful array of fresh-caught fish, bargains with a Cantonese peasant over the price of yellow-tailed snapper. Where the Wharf tapers out, and the harbor is too shallow for the larger trawlers, the fish market thrives over a patch of old concrete and dirt.\nThe peasant finally offers enough yuan to satisfy Li.\n“Xie xie,” Li thanks the peasant, wrapping the fish up in old newspaper. The edge of the newspaper catches Li’s eye.\n“Signals From Outer Space,” it reads.\nLi doesn’t much care. All men can be awed by discovery, for Li there is selling fish. He has to make enough to pay rent, to eat, and to save. If he doesn’t sell enough fish for rent, the local thugs come over to beat him up. If he doesn’t make enough to eat, his wife goes hungry, and if he can’t save, he’ll never be able to leave Macau and the smell of fish that seems to taint his life.\nThe frenzied noise dips slightly near the stall. Li looks up from tossing ice on the fish to see what it is. A dark figure in a duster, moving through the fish stalls with a quiet confidence.\nPepper.\nThe man called Pepper stops and sniffs. Li knows the air he sniffs is alive with fish, and street sewer, and sweat. And something else. On the edge of all the sandpapery shark and still croaking grouper is the smell of fear.\nLi Hao-Chang watches Pepper carefully. Li stands nervously behind his untreated plywood table glistening with fish juices, and keeps his eyes averted.\nMaybe the mercenary senses something, maybe his reflexes are keyed up beyond belief, a soup of tailored chemicals thudding through his bloodstreams. Maybe he is about to reach beneath the heavy folds of his dark gray oilskin duster and pull out a massive shotgun.\nPepper’s steely gray eyes roll over the street and bore into Li Hao Chang.\n“Afternoon, Hao-Chang.”\nHis voice is as artificially gray as his eyes. All are carefully designed with respect in mind. Li knows Pepper sure as hell isn’t here to buy grouper.\n“Afternoon, Mr. Pepper.”\nLi is careful to keep conversation at a minimum. Pepper is usually not out in the street to chat.\nPepper looks around the surrounding stalls, his presence cutting though the babble of the crowd. The kaleidoscope of multi-racial faces washes past Li’s table, their differences slight in comparison to Pepper’s own contrasting strangeness. Rastafarian mercenaries do not seem to belong in any landscape, let alone Macau. His leather duster hangs low, the soft rain running off in rivulets and his half dreadlocks are tied back into a ponytail.\nLi notices slight movement in the far distance, the crowd jostled by someone, and his ears catch the distant delayed puff of a silenced weapon. Pepper’s body jerks sideways, and he crumples to the sidewalk. A peasant hurries past, ducking. The man who steps forward out of the crowd pockets his gun, then leans over. Li can hear the distinctive British lilt.\n“Oy. He’s down.”\nA silver armored Rolls Royce with tinted windows quickly parts the wave of panicked fish buyers. The rear doors open forward, and the mercenary is pulled across the cement, up into the car. The Brit has enough grafted muscle to have trouble getting into the Rolls.\nLi looks down at spotted grouper and waits for the Rolls to leave. When he looks back up there is only an empty sidewalk in front of his table.\n“Ni hao,” he mutters to himself. The sidewalk is not entirely empty. A small disk lies near a puddle of thickening blood, already rust-colored against the dirty cracked concrete of the Wharf.\nLi darts out to pick it up. Pepper haunts the Wharf regularly. If Li does him a favor and saves the disk, then maybe Pepper will do him a favor.\nThe disk, covered in green symbols Li doesn’t understand, makes a ‘snick’ sound as he picks it up. He looks down at his finger to see a point of blood, and thinks maybe he has cut his finger on a piece of glass.\nLi Hao-Chang returns to his stall and puts the case into his purse. Maybe Pepper will pay him yuan for the case.\nIf Pepper returns, he thinks, dabbing at the cut with a piece of newspaper.\nBut Li has faith in Pepper. Pepper gives off a mystique of calculated invincibility. Pepper walks the Wharf, and the Wharf stays away from him. All the local gangs, no matter what color. Tan Italian, pale American, each learn Pepper’s skills the hard way. They never try again.\nBlacks are particularly nervous around him. Pepper is chocolate, with a white’s gray eyes. He shows no ties to skin, he kills black as efficiently as white or any other shade. They call Pepper the black ghost.\nThe black ghost, because after every battle, no matter the injuries, Pepper comes back to life. How many back-up blood pumps are laced through his torso? How much artificial adrenaline is produced by small chemical factories in his stomach? Are his eyes really spliced hawk genes? Rumors trickle.\nLi Hao-Chang has seen this scene before. Pepper will be back.\nLi Hao-Chang gets home early and hands Mei two snappers.\n“Yi qi chi fan ke yi ma?” He asks very formally of his wife, as if they were meeting for the first time. Mei smiles and curtseys.\n“I would be honored to have dinner with you.” She has rice already boiling in a wok; the fish can be chopped and sautéed, then mixed with rice. She is used to fish. Fish boiled, fried, baked, or cooked in any manner she can think of. Fish broth she gives to him in a thermos for lunch. And breaded fish they eat for breakfast before he leaves.\nLi knows she hungers for a beef stir-fry almost as much as he does, but they are saving the money for the trip. Out of Macau, and over to Manila, then to the United States of America.\n“Wo ai ni,” he says softly, kissing her hair. She laughs and pulls away with the fish.\n“Let me cook the fish, Li, then we can talk of love over rice.”\nLi smiles and pushes through the beads into the washroom.\n“Pepper was at the fish market,” he says, scrubbing away at the smell of fish vigorously. It doesn’t work. The smell stays on despite the hard loamy soap. It reaches into clothes, into the sleeping pallet, and into the walls of the house.\nHe rinses his hands and comes back into the kitchen.\n“Did he buy any fish?”\nLi laughs and moves over to help Mei cook, expertly searing the strips of fish she hands him over the bubbling oil. The aroma is sweet with Mei’s spices, but still familiar.\n“No, I do not think Mr. Pepper likes fish. A British car came and took him away.”\nMei swears to herself and chops at the head of the snapper, startling him. Mei doesn’t like the British. Her family maintains the distrust, over Taiwan, over the Opium Wars, all history that to Li is many generations buried.\nHe gives Mei a long hug.\n“The British will not hold him long.”\n“I wonder,” she says, “why they took him away? He is a dangerous man.”\n“Maybe they have something they want from him. Pepper, he knows things.”\nLi can tell, though, that Mei does not wish to speak about Pepper any more. So he changes the subject, while testing fish broth with a wooden spoon.\n“It is good, as usual.”\n“Xie xie.”\nLi takes a rice bowl and spoons in fish and broth, clicking his chopsticks, a gift from Mei’s brother. He always honors Ahn’s memory at meals with them.\n“More foreigner tourists today,” she says through a mouthful of rice. “I got generous tips. A man from Texas. I told him our dream. He was very nice.”\n“That is good.”\nLi talks to his wife about weather, and the new docks being built. She tells him about the white tourists she guides around the city of Macau. They record everything on little cameras as she herds them around in little groups like sheep. She does not believe they ever actually see the city, they hide behind the small screen, and icons like ‘zoom,’ and ‘pan left.’\nLi chuckles. His wife is quick-minded.\nAfter dinner he washes the bowls quickly and follows Mei to their pallet. Even after five years he still finds it amazing that she gave up Beijing for him.\nHe kisses her, then they lower down to the pallet.\nWhen he pulls out the government condom he can see the sadness in her eyes. He knows she wishes for children, but they cannot afford a child now. Not until they reach America.\n“It is all for the better,” he says, knowing that the sadness will pass quickly, and that Mei will become her cheerful self after a while.\n“I know,” she says, pulling him to her. “It doesn’t make it any easier.”\nA tapping wakes Li. He blinks the sleep out of his eyes and stumbles through the dark. It is raining, and a dark figure stands at his door.\nLi fights a wave of dizziness.\n“Hao-Chang.” Pepper’s voice penetrates Li’s befuddlement, and he snaps awake.\n“Pepper, I have something for you,” Li says quickly. He wonders what the mercenary is doing here.\nPepper’s steel eyes blink.\n“Qing jiang ying wen,” he says slowly, as if unsure of himself. His Cantonese is usually impeccable, now he stumbles over the words as if they are unfamiliar.\n“In English,” Li nods. “I am sorry. Of course. I have something you dropped, a disk, on the pavement, earlier today.”\nPepper nods. Li notices that Pepper is in bad shape; blood soaks the shirt underneath the leather duster.\n“It has a tracker in it. I followed it here.”\n“I will get it for you.” Li turns to go back in for his purse, but Pepper grabs his forearm. Li reflexively tries to pull away, fear spiking as he turns back, realizing the grip is unbreakable. Pepper pulls out a small needle, ignoring Li’s wince as he slides the tip under the skin.\n“The disk is important, and poisoned, to kill the one that steals from me. You were infected, when you touched it. Now you will be safe.”\nPepper walks into Li’s kitchen and carefully sits down on the bench, just as Mei comes in, wrapping herself in a robe. Li looks down at the tip of his finger, then closes the door.\n“Wan shang hao,” she says, greeting Pepper.\n“Evening,” he replies. “I apologize for waking you. I’m hurt very badly, and I don’t have anywhere to spend the night.”\nMei shoots Li a quick glance of inquiry, what is this dangerous man doing here? Li wonders himself, but he thinks of Pepper’s yuan and America, and he nods okay to her. She reluctantly turns her questioning glance to Pepper.\n“I will get you a blanket.”\nLi grabs his purse and hands Pepper the small disk. Pepper pockets it, then takes the blanket Mei comes back and offers. Within a minute the gray eyes slide shut, and the man is asleep.\nMei quietly makes a pot of tea, and they sit and look at the massive black man asleep on their floor.\n“Is he going to die?” Li wonders, amazed. His voice cracks slightly. Mei shakes her head.\n“He will not die. He is strong, he is built to handle and take these kinds of things.” She would know such things. She once studied medicine at Beijing University. “He will probably be here a while,” Mei continues.\n“What would you have me say?” Li hisses. “No? And refuse him?”\nMei doesn’t answer, she stares just past him, disapproving. Li sips his tea and calms himself. She knows that he is making the best of what he can in the situation for both of them.\nLi leans forward and kisses her on the forehead.\n“I must go to the fish market early,” he says. “I am going back to bed.”\nMei’s warm body is snuggled alongside him. Li reluctantly pulls away and into the cold morning. Pepper is asleep on the kitchen floor, the blanket Mei gave him discolored with rust-brown stains.\nThe rain still beats a tattoo against the side of the small apartment.\nLi makes tea, sipping it quickly, then pauses to grab two large wicker baskets before he leaves for the docks. There, in the dim light of the morning he buys his fish from the back of a trawler. An eerie, silent, process. Li points with yuan clenched in his fist, then the men shovel fish into his baskets.\nHe carries the load of fish back to his stall, back straining against the weight.\nMei comes over to the fish stall at lunch with his thermos of fish broth.\n“Forgetful,” she teases him.\n“Always.”\nShe kisses him on the nose. Then she furrows her eyebrows.\n“Our ‘guest’ still sleeps. I washed and changed his blankets. He is feverish now. I think it will break before tonight.”\n“Can I sell you a fish?” Li asks, holding a large squid out at her. “Very delicious.” Mei pushes it away.\n“Bu shi. I do not want your fish, vendor, now go and sell it to some other poor soul.”\nMei turns and walks away down the rows of stalls, and Li watches his wife walk with pride. She is a beautiful woman, and he is a lucky man. In America, they will do well, he thinks.\nThere is fish to be sold, though.\nPepper’s face is much paler than it should be, and covered in a fine sheen of sweat. Li is worried.\n“Ni hao ma?” Mei asks him.\n“I am fine,” Li replies. “But what of him?”\n“Pepper is sick. But he is getting better,” Mei reassures him. “His body knows what is best for him. The Westerner has things in his body that are cleansing it, and fixing the damage.”\nLi remembers some of Mei’s tales about Western medicine. Tiny machines that he could not see even if placed on a fingertip can run through Pepper’s body to find what is wrong, then fix it.\nPepper mumbles through his shivering.\n“Jah, ya man. Irie. Okay, okay, there it is, a sweet thing, no? English, English.”\nMost of the rest Li does not understand. It is in English so heavily accented he cannot make it out. It is not English like everyone else speaks. Li thinks he sometimes hears some of this strange accent when Pepper speaks to him at the Wharf, but not much. Pepper must suppress it, he decides.\nHe takes his bowl of rice and fish and heads over to their pallet to eat it.\nAfter washing, Mei kisses him fiercely, but tonight it is Li who is thoughtful.\n“I cannot,” he says, “with another man under the same roof.” The apartment is small, and he cannot forget the presence of the large mercenary.\nPepper is sitting on the bench in the morning, sipping tea, his jaw a chiseled line of thoughtfulness. Mei makes to batter fish for a breakfast as Li grabs his two wicker baskets, but Pepper holds up a hand.\n“You stay here, today, Li,” he says in that startling voice. “I need you.”\nLi looks down at his baskets.\n“I must sell fish.”\nPepper holds out a fistful of yuan. It covers a week of fish selling, and Li looks greedily down at it.\nPepper hands the yuan to Li.\n“You need not sell fish today. Buy breakfast for us, something with lots of meat. I need the protein. But not fish.” Pepper smiles a perfect set of teeth. “I have an errand for you to run. It is very important.” He has the disk Li rescued earlier in his hand.\n“What is it you need, Pepper?”\nWith the thick fold of cash in his hands, under the watchful eye of Mei, Pepper has Li’s full attention.\nPepper tells Li to first go straight down past the Wharf into town, to David Tsung.\nWith the wad of yuan in his pocket Li decides to first detour down a street lined with food stalls.\nHe stops in front of a small cart on wheels.\n‘Wok on wheels’ emblazons the side of the cart, in both English and Chinese characters.\nLi is not as interested in deciphering the unfamiliar English symbols; the scent of meat frying on oiled metal draws him in. He realizes his mouth is full of saliva. He hands over yuan for a small dish, greedily scooping meat and sauce into his mouth, relishing the taste of meat.\n“Xie xie,” he says, but the cook has already turned away from him to toss more strips into the wok to sizzle and dance.\nLi watches the cook tease ingredients into the mixture for several seconds as he finishes his meal, then tosses the paper dish at a gutter and continues on.\nDavid Tsung is an old man from Canton. He sells computers. Or at least, Li thinks so, as the windows of the small store show computers in fading old pictures. As Li steps in a bell dings. He closes his eyes to muster courage, and wishes he had never picked up the tiny disk. Even despite the promise of Pepper’s yuan, Li is scared.\n“What do you want?” A sharp voice from behind the counter.\n“Ni hao. I am here to buy a laptop, and a cellular modem.”\nDavid Tsung looks Li up and down slowly, squinting eyes scrutinizing the shabby clothes, dirty hands. The smell of fish has entered the store with Li. Li self-consciously rubs his hands against his trousers to try cleaning them.\nTsung abruptly cackles laughter.\n“You have won the lottery, then?”\nLi shakes his head.\n“What money do you have?” Tsung asks. Li pulls the black info-disk out and sets it on the counter in front of Tsung.\n“Pepper says you should know what to do with this.”\nDavid Tsung jumps slightly at the mention of the name ‘Pepper.’\n“Shi. But I told him I would think about it, I never have promised anything. It is dangerous.”\nTsung thoughtfully picks the disk up, then drops it and swears. Li sees Tsung’s finger drop a bead of blood, and assumes that Tsung is also now poisoned. Li is having trouble staying calm. His heart is running away from him, and nervous sweat beads his brow. The threat of death through poison is an ancient bargaining chip, Li knows. It is all that Pepper has armed him with. He hopes it is enough to force the old man to do Pepper’s will.\nBut Pepper’s words are in his head, walking him through. Li can still feel the pleasurable press of the yuan in his pocket against the side of his leg, and the beef in his stomach, so he speaks up.\n“Pepper says not to be alarmed. The infection will take a day to develop. Only Pepper knows the antidote.”\nTsung’s voice rises in pitch as he continues swearing, but he looks scared.\n“Pepper wants a laptop with cellular modem,” Li repeats. “And he wants you to make safety copies of this info-disk.” As Tsung steps back from the counter Li sees the shotgun strapped to his forearm, and his heart quickens.\nI’m going to die, he thinks. The poison isn’t enough of a threat. Maybe Tsung is going to kill me. Does he think I carry the antidote with me?\nBut Tsung beckons for Li to come through into the back with him.\n“You Pepper’s messenger, eh? How is Pepper. He okay?”\nLi nods.\n“Good. I’m glad.” Li follows Tsung through the door, and they stand in a room filled with computers of all ages in various states of disassembly. Tsung hunts through several drawers before he pulls out a small laptop. “Here, here,” he says. Li accepts the small notebook and stands waiting.\nTsung plugs the disk into another computer. He fiddles around with something on a screen, then smacks his lips as the drive begins whirring.\n“I will make copies.”\nLi nods. Even if Tsung weren’t, how would he know otherwise? So he stands and waits for the old man to finish and hand him the original plus a copy.\n“The antidote?” Tsung asked.\n“Pepper says it is in the mail for you. It will arrive in time.”\nThe little old tech-man seems to deflate even further into himself. He holds up another disk in his clawed hands.\n“You tell Pepper I have copies. I will send them out if I don’t get an antidote. You understand. Tell him.”\nLi nods.\n“You make sure you tell him to send me antidote.”\nOn his way back Li stops at the ‘wok on wheels’ and orders several dishes of Iron Plate Beef. Rice will be waiting at home. The cook remembers him and smiles as he hands Li the covered paper dishes all in a bag with the logo emblazoned on the side.\nHe splashes through the early morning with a faint smile. The sweet aroma of stir fried beef mixed with kuomo mushrooms and bamboo shoots reaches his nose.\n“Wo ai ni,” Mei says the second he steps through the door. She hugs him fiercely, and he kisses her back.\n“I love you too.”\nPepper waits for the exchange to finish before he steps forward.\n“Did you get everything?”\nLi unshoulders the strap of the laptop case and hands it over. Pepper unzips it and sets in on the small table in the corner.\n“I bet Tsung was pissed.”\nLi nods.\n“He swore much.” He catches Mei’s glance out of the corner of his eye. She is looking at the bag in his hand. He gives it to her.\nMei breezes out of the kitchen with a paper dish into their sleeping room. Li knows she doesn’t want to be seen greedily bolting the food down. He respects that. He can still taste the aroma on the edge of his tongue. He desires more. Instead he crosses his legs and sits with Pepper.\nPepper’s bulk dwarfs him.\n“You risked my life for this, what is it?” Li asks.\nPepper looks up at him and makes a sucking sound with his teeth.\n“Man,” he says in English, “you risked your own life, for the money I gave you.” He smiles perfect white teeth again. “But I shouldn’t be hard on you. Na.” Li notices the strange lilt still in Pepper’s English. “It is a great secret.”\n“Some secrets are better kept secret.”\n“Not this one.” Pepper boots up the small laptop, and it makes squealing noises as it dials into an invisible network. “This secret is exactly the kind that shouldn’t be kept.”\n“Tell me.”\n“You read much, Li? Do you read the newspapers you wrap your fish in?” Pepper looks up and around. “A few months ago satellites around the world received a message from somewhere outside of the solar system. Then it stopped. No one could decipher it, it didn’t make any sense, but it was definitely artificial.” Pepper’s yellowed nails are dancing across the small keyboard.\nLi waits as he plugs the disk into the laptop.\n“Of course, everyone is curious. What sent it? Will there be more messages? That’s what I am here for. My superiors tell me to keep my eyes open and ears to the ground.” The English adage is unfamiliar to Li, but he guesses the meaning.\n“You found things.”\n“Observatories on each major landmass across the world are receiving similar messages now.” Pepper shifts on the seat and reaches for a dish of beef. He keeps talking through a full mouth. “North and South America, Africa, Europe, Australia . . . but Chinese officials denied they had any message. It took two weeks to find this damn version of the message, I got it through a scientist working at a deep-space observatory in Canton. And the message he received is different from all the others. The Chinese clocks show that this message is received first, and only in China. And the intervals in between the message are getting smaller. The other signals are merely repetitions to make sure the rest of the world is blanketed.”\n“I don’t understand.”\n“Hao-Chang. Whatever it is, it will come here.”\nPepper unplugs the case and slips it deep into the folds of his duster.\n“Now, everyone in the Western Hemisphere has a copy of the Chinese message. Everyone is in on the great secret.” The modem is quiet, the screen asks the user if they would like to send another message. “And there it is. For what it’s worth. Now maybe foreigners will quit harassing me.”\nMei comes back into the room, discreetly wiping at her chin. Li unconsciously moves closer to her.\nBefore he reaches her there is a polite knock on the door.\nLi knows that he has no neighbors here, and he knows Mei has no family anywhere near the Wharf. The fact trickles down through his mind with a cold shiver. Pepper looks up from the paper dish and puts it to his side. He reaches deep into the duster.\nThe knock comes again.\nOnly this time the door is flung aside and a dim figure is in the room. Pepper rolls and fires something loud through his duster. Instinctively Li closes his eyes against the noise. He drops to the ground, and stays still.\nHe hears more clatter, the sounds ringing in his ears. His heart thumps loud, and he prays for life.\nMei gasps and falls near him. As Li looks down at his hands he sees blood, Pepper and the assailant are gone, chasing each other through the maze of small huts and apartments.\n“Mei,” he whispers. The only response is a short gasp, Li can hardly hear it. He gets to his knees and bends over his wife.\n“Mei.”\nHe sees her reaching for air, but not getting any. Instead of exhaling she coughs up blood. It runs down her cheek and onto the dirt floor. Li cannot find words; he starts to gather her up in his arms, but she coughs again, the action racking her small body. He holds her there, in his arms, just above the dirt floor.\nHer eyes are glazed, wandering around the room unfocused. Li puts his face before her. For a brief second her eyes seem to focus on him, then they are looking past him, and he can no longer feel the slight flutter of her heart.\n“Mei.”\nLi allows her body to gently slip back onto the dirt floor. He weeps, his tears mixing with the stale rainwater dripping in through the bullet-holes in the roof.\nHe barely notices the gun battle outside cease, or Pepper silently returning. Pepper stands at the door for a minute, then carefully crawls into a corner.\nLi stays kneeled over the body of his wife for several hours.\nPepper shakes Li’s shoulder early in the morning. Pepper is pale, and the duster is once more soaked in blood. But he moves with quiet confidence.\n“I am sorry about your wife,” he says. “She was a good woman.”\nLi looks at the man uncomprehendingly.\n“Good woman? Of course she good woman,” he yells in broken English, tears flowing. “What know you of sorrow son of bitch?” He screams. He wants to attack Pepper for cursing him so. He wants to see Pepper dead on the floor with his wife. He wants his wife back. He wants what has been ripped from him. And he is drowning in an empty void.\n“My superiors have what they want,” Pepper continues haltingly. “I have to leave and go home.” He opens his duster to expose chewed up skin. Underneath his flat stomach the glint of metal flashes. “I was given orders to leave as soon as possible.”\nLi squints his eyes against the early morning light streaming in through the half open door.\n“Go home. Never come back.”\nHe turns back away and shivers as a draught of cold air passes through the room.\n“I just wanted to apologize . . . and give you this.” Pepper steps forward and hands Li another thick wad of bills. It is enough to go to America. It is enough for Li to do anything. Li throws the money back at Pepper.\n“Keep blood money. I do not want.”\nPepper takes the money and sets it on the small table next to the laptop. He looks around the room one last time, shakes his head, wraps his duster back around himself, then steps through the door, softly shutting it behind him.\nLi sits still for another few minutes, then carefully kisses Mei’s forehead and gets up, rubbing at red eyes.\nPepper had left the laptop, with the small black disk sitting by it, behind.\nMei’s grave is a small one dug by the Macau missionaries. Li is not sure what else to do, and the eager white missionaries are thrilled to preach the good news to an ignorant foreigner. Li ignores them, and sets an elaborate bunch of flowers next to the headstone.\nLi isn’t stupid. Something grand is happening. The message senders are closer now. He wonders if the Western scientists have gotten Pepper’s data. Someday the messages will stop, and an alien craft will shake the sky, part the clouds, and land in Canton.\nPepper is no longer seen on the Wharf docks. And Li no longer sells fish. He has enough money to live well in Macau for the rest of his life. Pepper’s gift is generous.\nOn the deck of a large old ship that stinks of diesel fumes, Li leaves Macau. Another peasant on the deck, another hoping for a new life. He ignores the crates of loud fowl, the grubby smiling kid with the caged cricket, and the old lady who loudly farts on the bench across from him. He braces himself against the heavy sea, letting the salt blow away the fish smell, looking back at the distant shore.\nTwo weeks later, on the shore of a small beach in California, Li tosses a small black disk into the water, careful to not let it prick him, and then drops a single Hibiscus in after it.\nLi heard that, earlier, that Western scientists are in Canton, the Chinese government finally admitting the existence of its message. Pepper’s work is done.\nAnd today in Canton, everyone repeats with wonder, the scientists looked upwards at the sky in wonder as a sleek shining alien craft slowed to a gentle stop between the massive radio dishes.\nMaybe they will bring an order to the chaotic world, Li thinks, or change the world in other, fairer ways. He wants to meet the distant entities, and tell them how important his Mei was to their historic event. But for now . . .\n“Farewell, Mei,” Li says.\nThen he turns to walk back up the beach, smiling at the children screeching and running through the cold surf.\nOriginally published in Science Fiction Age, March 2000.\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs."}