{"fingerprint": "vyJSGlOax+zahsOObpZSNJ3+YfU=", "sitename": "Clarkesworld Magazine", "title": "Dead Heroes by Mike Buckley", "author": "Mike Buckley", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/buckley_11_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dead Heroes by Mike Buckley", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5030 words, short story\n Dead Heroes\n Tim has worshipped Catalus forever. If you let him, he’ll go on about the grace and speed of Catalus, about the bravery of the charge they made against the cliffs within The Living Forest. Speed and grace. Bravery. In the end, it’s just love. Everyone’s eyes glow when they describe their favorite soldier.\n Mine is Lt. Farea. His statue is usually on the upper floors of the stadium. You can spot it even from far away by its rigid posture. They say he killed an Inhabitant with his bare hands once.\n Farea is a perfect soldier.\n Today, Tim sees the statue of Catalus by the field the first thing in the morning. He wakes me up by whispering this in my ear. I can practically feel his heart beating through his breath. He’s excited.\n “Meet me at the intersection,” I say, not wanting to wake my dad, but after Tim is gone and I am dressing, I see that he is already awake. His eyes stare out of the pile of blankets at me like two half-healed wounds. What would I say at this moment if he wasn’t him and I wasn’t me? Maybe: Good morning, dad; do you have enough whiskey for today; is that pain in your gut worse? Do you know who I am? Do you know where you are? How much has The Blank taken?\n Do you want to see the statue of Catalus, dad, it came up from the tunnels.\n But he wouldn’t. The Blank has taken much of my father’s memories, and the whiskey has scorched the rest. As he watches me get dressed he shifts and his eyes flick around the room, like a bird looking for a crack. An awful smell comes out of his blankets. I leave, walking out of the row of shacks and down the cinderblock hallway. Tim is at the intersection as he said he’d be, shadowboxing his nervousness away.\n “You sure it was Catalus?”\n Tim doesn’t answer. He runs and I follow, down hallways and to the ramps, down and down. Tents web the cinderblock walls, the people inside them staring at us as we pass. Some of them are deep in The Blank, and just getting a brief glimpse at their empty eyes makes me feel like I’m forgetting something, so I look out over the wall as I run. The Living Forest is visible from up here. It shifts in the sunlight, in its world-sized bed of dirt and history, watching us run down the ramps of the stadium.\n After we get to the bottom levels, we cut in, and emerge from a thin block hallway into the wonderful light of the field. The statue of Catalus is slowly making its way, alone on the grass, between second and third base.\n “I told you,” Tim says quietly.\n We stand in front of it and watch the massive thing slowly walk, its marble eyes angling in our direction. A glowing roll of stats scrolls next to it. Tim has them memorized. He refers to them every time we debate who the best soldier is, so they’re familiar: Catalus: Specialty, Heavy Weapons/Mech Assault; Homeworld, Rimward Colony, Name Unrecorded; Four hundred and seventy six confirmed kills; Sub-commander, Expansion Forces.\n “Catalus,” Tim says, then looks at me, embarrassed.\n “Go ahead, Tim,” I say, but still he looks at me with that lean, sad, dark face. My best friend.\n I walk over to the pits that edge the field. Tim has privacy now, and I see him talking to the statue of Catalus, and then slowly climbing the marble and settling into its arms, which wrap around him slowly. It might be a mural.\n Tim has no father. The first time I saw him he was sitting in one of the lower hallways of the stadium, naked, watching people pass. My father and I were leaving the stands, carrying one of those large fruits that grow on the edge of The Living Forest in the shape of a human head, the kind that some people distill for whiskey, although my father didn’t care about whiskey back then. We had chosen a fruit that appealed to us (it looked like me, I think), and as Tim watched us pass, I caught his hollow, weird gaze.\n Children live in the hallways when they have nowhere else to go. They could be dangerous places. But even back then Tim was tall and strong, and could be mean if he needed to. It was during his time in the hallways that he’d encountered the statue of Catalus. It had emerged from the darkness one day, and as it walked out of the perennial night of the tunnels, Tim watched its heroic bearing, and he recognized something in it, and fell in love.\n The real Catalus was a street kid before he joined the Expansion Forces, that’s well known. He was from an awful neighborhood in an awful city in an unsanctioned colony and he learned to kill very early. He did it well and often for the gang that ruled his street.\n Redemption came in the form of a mech rolling down the street one day, blaring over its speakers that everyone within hearing was now officially drafted by Expansion Forces. Catalus himself burned the first mech he saw, but they kept coming, better ones each time, giant with heroic frames and spotlight eyes. The mechs gave their recorded spiels to the gangsters that Catalus had revered his whole life, and then one day the soldiers came too, and Catalus realized that the gangsters were just skinny, mean children. The soldiers seemed like visitors from a truth that had always enwrapped his heart. They saw the same in Catalus, and he was in the first group assigned to infantry.\n The story goes that Catalus was the commander of the first wave off of the ship. They flamed a bald spot into The Living Forest and discovered the stadium. They landed, fighting their way down. The Inhabitants were ferocious, but wave after wave of Expansion Forces came.\n Once the forces were established, General Plata led her troops out into The Living Forest, soldiers like Farea and Catalus, and all of the brave, unknown others. Administrators and engineers stayed behind, guarded by a few squads. Once the fighting intensified, even the guard squads were called out into The Living Forest, and the people left behind turned the stadium into their city. Stories came back about the soldiers’ exploits for awhile, but once they’d fought their way deep enough into The Living Forest, the distances became too great.\n The statue of Catalus carries Tim across the grass, growing closer, so I can hear.\n “When are you coming back?” I hear Tim say, and then he looks down at his own knees, ashamed.\n We lose the statue of Catalus in a crowd a few hours later. Once people realize that it has emerged from the tunnels below the stadium, they follow it, take pictures with it, stand in front of with faking ferociousness like an inhabitant. Tim and I know from experience that after a few hours the whiskey will set in and the crowd will smash bottles over the statue, and maybe even light it on fire. Following whatever mech logic exists in its marble head, it will go back down into the tunnels, so we sit in the seats above the field and watch the crowds form around it.\n When he finally says something, Tim’s voice is raw.\n “The real Catalus would hate it here. He’d leave these half ass fuckers behind.”\n “He’d die if he went into The Living Forest alone.”\n Tim doesn’t answer and I understand why: Catalus dying isn’t the point. The stadium is corrupt, and we are stuck here with nothing but statues and stories.\n “Let’s kill your dad,” Tim says.\n He has said it before, but he doesn’t mean it. Tim despises weakness, but in a very complex way. He wants to nurture sufferers and burn them at the same time. Sometimes he brings my dad whiskey, even, but when he does he always dangles the bottle over my dad’s blankets, just out of reach, to humiliate him.\n “Let’s go to the library,” I say.\n Tim looks at his knees again, then down at the crowd around Catalus, then throws a couple loose uppercuts. I can tell he doesn’t remember, that The Blank has occluded his memory of The Library. The Librarian was mean to Tim when he was a kid looking for food, not letting him stop in The Library for food or shelter, so sometimes he lets The Blank cover it up. As for me, I like The Library, so I think about it more, and try to keep the memory fresh.\n After a moment I see him remember.\n “I hate the library. That fucker talks and talks.”\n I leave Tim watching the people flood around Catalus. I walk around the outer edge of the stadium. In the part of the stadium where the library sits, the walls are stained in long upside down Vs of moisture with disconcerting cracks lightning through, meeting at the corner of the ceiling. Empty and quiet.\n A man leans out a doorway: “My boy,” he says.\n I never forget the librarian.\n The face disappears and when I enter the library it might as well be abandoned. Books sit neatly stacked in open lockers. Piles of fragile paper sit in plastic bins that are stamped in the ship’s logo. I sit and the man reappears holding a tablet in a way that reminds me of someone carrying a dying animal.\n “This is almost drained,” he says, “but I wanted you to see it first.”\n I take the tablet and it slowly comes to life. I’m looking down from space at a blue and green planet, and I hurtle backward and past the ship. Somehow I know it’s the one in space and then I have such a forceful memory that it hurts.\n “You remember,” The Librarian says.\n “Yes.”\n He means that I remember we are not on a distant, wild planet. He means that we are on Earth, and were brought here by the ship, which is still in orbit and not talking to us, and hasn’t been for thirty years. He means that The Expansion Forces are really recapturing Earth from The Living Forest.\n He means that The Blank lives in the forest, and creeps in to take our memories bit by bit.\n I set the tablet down gently at his feet and the image flickers out.\n “How is your father?” The Librarian asks.\n “Drunk. Probably asleep.”\n “The Blank has taken too much of him,” he says. “He’s not a man anymore. He’s just a body.”\n For some reason I want to defend my father, but I know the librarian will laugh if I do, and that would be worse than hearing that my father is just a shell. Which I know.\n “I haven’t seen you in a very long time,” The Librarian says.\n “Yeah.”\n From this moment, from having emerged from The Blank, I understand: Of course I have stayed away. It hurts to think about how The Living Forest surrounds us, feeds us the head-shaped fruit, contains us. It hurts to think that the soldiers are lost out in the trees. And this last hurt echoes the pain I always hear in Tim’s voice, and makes me think that perhaps even when The Blank has crept in, that our memories are alive beneath it.\n “You needn’t leave,” The Librarian says, as if he knows.\n I shake my head.\n “One might stay. Study. Keep The Blank at bay.”\n I shake my head again.\n “I’m sorry,” The Librarian says. “I was so anxious to show you the tablet that I forgot how much it hurts to know the truth sometimes. I can entertain you.”\n The Librarian gestures and a glowing face appears over his hand.\n “I know he’s your favorite.”\n It’s a still of the real Farea, the darkness of The Living Forest behind him.\n The Librarian wants me to stay. No one else ever comes down here. Thinking back now, I remember that he usually waits until I have been here awhile before he reminds me that we are on Earth, trapped in the stadium. Usually he tells jokes. He asks about Tim, about the statues. Of course The Librarian is hiding. Down here on the bottom level of the stadium with his ancient books, replenishing his knowledge each morning after The Blank has sipped from it in the night. Thinking about Tim’s breath against my ear, and his hopeless, hard face . . . I have to leave. The Librarian is still talking as I go, Farea’s face floating next to him, watching me move down the hallway.\n I find Tim ascending the ramp to the uppermost floors. The statue of Lt. Farea is standing at the uppermost row of seats. It is staring down at the field. The crowd around Catalus looks small from up here, and Farea’s head turns slowly toward us.\n “Where were you?” Tim asks, having forgotten The Library again.\n “With my father,” I say. The lie is easier.\n Tim sits himself a few rows down, as if I wanted to be alone with Farea, but it isn’t like that for me. Statues are what they are: mech sense in articulated stone, made by the people the soldiers left behind when they went into the forest. The stories about the soldiers aren’t so different. We grow up with them, and some we fall in love with.\n For me, it had been the dreams that had bonded me to Farea. In the dreams we are always in The Living Forest, Tim and me and my father. When we walk the trees lean out of our way and when we stop they rearrange themselves around us. Flowers bunch up into bright walls. Mud slips underfoot. And then we are in a circle, all of us worn and beaten soldiers, and we’re listening to Farea—the real one. The man. And he’s me. I look at my hands and they’re covered in scars and I touch my face; it’s scarred too, and rough with whiskers, and feels old, even from the inside. I say that General Plata needs us to take a hill. It is warrened with Inhabitants and I think about them in their tunnels, whatever they are, whatever they look like, whatever odd eyes they see The Living Forest through, and more than anything else I want to burn them out of their tunnels. I want to take the hill and I want them to hurt me. I want to heap all of the pain and harm that they have to give within my ribcage, around my heart.\n I want to be burned and broken.\n I always smiled at the soldiers in the dream, just as Farea’s marble face grins at me now, as shadows from the roofs above us move slowly over our heads, creeping toward Tim as he watches Catalus getting shouted at by the crowd below.\n “Come on, Tim,” I say. “I have something you gotta see.”\n We leave the statue of Farea and walk around the edge of the top of the stadium, until we find the ladder that leads to the roof. I step out over the empty space and climb. Tim follows. Instead of sitting on the side that overlooks The Living Forest, I lead us up the grade of the awning, stepping carefully, and then when vertigo laps coldly at the base of my guts, I belly crawl, and Tim follows suit. When we get to the edge I pretend to be fearless and throw my legs over.\n Tim’s voice barely trembles.\n “Shit this is high.”\n “You scared?”\n “No. Shit. Kinda.”\n We sit for an hour and watch the drunk crowd harass Catalus on the field below, until it disappears back into a tunnel. Tim and I look at each other, and we don’t have to say anything—we back-crawl down the awning, carefully down the ladder, and down and down the ramps, then out the gate.\n Surrounding the stadium is a belt of dead foliage. We step over blackened, woven roots. The dirt is exposed beneath them like flesh. My father told me once that for the first decade after they’d left the ship The Living Forest was almost impossible to keep at bay. Thick roots grew—almost crawled, he said—out of the trees, and people worked day and night chopping them away. Severed flowers rode the wind into the stadium and settled on the grass field and within an hour had produced a tree that was already budding with tiny visages. They cut these down too. After awhile, my father said, it was like The Living Forest stopped trying and just kept its distance from us. This is how I’ve always known The Living Forest. A dark, breathing wall. As Tim and I get closer to it, we pass out of the shadow of the stadium.\n The Living Forest is tall and dark when you are close to it, and the trees that ring the stadium are covered with fruit. There’s a dozen at eye level, each one grown into a bright green or orange or scarlet version of someone’s face. Those who know say that there isn’t this much fruit deeper in the forest. It’s almost like it wants us to stay here, well fed, in the stadium.\n Head level, closest to me, is a bright orange fruit, wolf-lean like Tim.\n I smile and tap Tim’s shoulder, pointing to it.\n He looks at me but beyond him I see an odd movement in the darkness of the trees. Something I’ve never seen in The Living Forest—a light bobbing between branches.\n “Shit,” I say, and Tim looks too, barely registering it before breaking into a run. I follow.\n It emerges from the darkness, snapped branches falling around it, shattered fruit beneath tri-part treads that step over the heavy foliage. Two large lamps regard us as it comes, but instead of producing light, it feels like they are sucking it out of the surrounding world and holding it. The mech’s body is the soft, contoured green of the forest behind it, even rippling along its planes as the tree trunks do. It regards us, weapons along its back tracking, and steps out into the clearing, toward the stadium. I can see movement deeper in the trees. Faces moving in the darkness; the dim but living whiteness of eyes, two by two, trailing back into the trees.\n An illusion. It has to be. A trick of The Living Forest.\n But then they come out of the forest. The soldiers.\n Tim is crying and laughing, and so am I.\n The soldiers set up camp on the field. It isn’t even as grand as the tents we have in the hallways, just blankets unrolled over the grass, the mech standing off to the side, watching over them. There’s about twenty of them, skinny and old.\n Tim stands in front of me, on a seat in the first row next to the field looking out at the soldiers. A few people are closer than us, but they are quiet, and they’re keeping their distance.\n “What’s on them?”\n I shake my head.\n When I focus my eyes I realize I am alone. Tim is gone, and I know where. I go to the tunnels.\n The darkness in the tunnels is complete.\n I follow the sound of footsteps.\n Tim’s soles are rasping across the concrete.\n “Tim?” I say. “Wait.”\n The rasping stops, but a slow hiss continues—stone dragging over stone. A statue. But there’s another sound, too, breathing, deeper than Tim’s. A torch flares up and I’m looking at faces.\n Tim’s, on the edge of the light. The untenanted stone face of the Catalus statue. And a man’s face, a foot shorter than the statue, like rags of leather clinging to failing clockwork: his jawbone is exposed, teeth bare and rotten, and he’s crawling with small silver insects. He leans in close and I can smell him. Rot. The Living Forest. Blood pumped through a corpse. His eye sockets vomit streams of silver insects which pour vertically back across his head, weaving through his thin hair, and he moans. A burnished object crawls up the back of his head, collecting the insects. It is making its way over his skull by way of a small track that has been bolted into the bone, and I look down, and see that his throat is a row of metallic valves, popping open and shut gently. That’s where the smell is coming from.\n Somehow I know.\n “Catalus,” I say.\n He isn’t smiling, more like sustaining an effort to peel the bones of his face from within, but at the edge of my vision Tim’s hand rests on his shoulder.\n “They’re back, and they won,” Tim says.\n Torches ring the field and it is wild with noise. Throughout the day people have found their way from the tent cities in the hallways and gathered around the soldiers. At dusk they lit torches and brought fruit and whiskey. From the first row of seats in the stadium I can see a hesitancy in the celebration. People approach the soldiers slowly, smiling, then stand and mingle. The soldiers themselves are all odd. Some, like Catalus, are crawling in small silver bots. Others are mishmashed together with machinery. One of them makes its way across the field on something like blades, popping down into the dirt with each step, then shaking the blades clean like some kind of awful dog.\n Once the whiskey takes hold, though, the hesitancy disappears. Bodies blend in the firelight. There is laughter and shouting. Statues emerge from the shadows at the edge of the field, moving slowly among the crowds, and the soldiers laugh at the marble heroes.\n Tim is down there somewhere. I can see him now and again moving among the people. He’s smiling too, so happy that it might be mistaken for panic.\n The Librarian sits next to me in the darkness.\n “Happiness,” he says.\n “Yes, they’re happy.”\n “I confess. Sometimes I thought they wouldn’t return.”\n “Me too,” I say, then realize I have forgotten something. “Where were they?”\n “In The Living Forest.”\n “Why?”\n “Fighting the Inhabitants.”\n The dreams come back. The fear of The Inhabitants, even though I can’t picture what they look like.\n “Their numbers are greatly diminished. It is said they entered The Living Forest with ten thousand soldiers.”\n Two children that I do not recognize are standing on the top of the mech that Tim and I had seen in the forest. They’re cheering as if they’re in the middle of a game. The soldiers stare from below, their faces dark in the torchlight.\n “What do you suppose will happen now?” the Librarian asks. “Will we go back to . . . ”\n He looks up also, and when he sees the emptiness of the sky above us, says “Oh yes, I’d forgotten. We are on Earth. We have been sent to destroy The Living Forest but it keeps us here, trapped. Contained.”\n There’s a glimmer of recognition in what he says, but I can’t place it, and a moment later don’t remember or care to try.\n I wake up to the sound of bones crunching. And moaning behind it, very gentle.\n The dim light in the tent is occluded by a large shape that my mind cannot make sense of as The Blank slowly recedes. It might be the moon, but dark rather than bright, filling the room, and to the side of it is my father’s face. His eyes are on mine. There is something there that I haven’t seen in years. Clarity. He’s looking at me, and he knows me, and he needs me.\n “Dad?” I say.\n The darkness turns to me. It is not a moon. It is half a face and half an iron mask. Currents of movement flow in and out of holes in the mask, and holes in the face. It has been working on my father. There is blood and my father’s open body and two loaf-sized robots crawling into and out of him, holding up guts in the dimness as if to examine, cutting them.\n “Not him,” I hear a voice say.\n Someone pulls me to my feet and out into the cinderblock hallway. I’m shivering. It’s dark.\n “I gave him whiskey first,” Tim says.\n “What . . . ”\n I shove Tim. I have to get to my dad. He’s bigger and faster, though, and pins me against the wall.\n “They need him,” Tim says. “Need it.”\n But he’s my father, I mean to say. The words are tied to memories that emerge from the normal distance of time and the absolute of The Blank. My father sitting on the edge of the stadium’s roof with me. My father taking me to the library. The sound of my father’s voice in the middle of the night, outside the tent talking to someone I have long forgotten—the warmth and strength of that voice.\n “The Blank took him a long time ago,” Tim says. It isn’t a concession. He’s daring me to disagree.\n “Let me go.”\n Tim’s voice is cold.\n “If you go back into that tent, I’ll let him eat you.”\n The moment of shame is like hot blood in my throat. Catalus’ dark face. The moaning.\n I can’t help my father.\n I stand up and walk back to the hallway.\n My father had told me once that The Librarian didn’t sleep, and it’s true: I find him awake, candlelight flickering in orange clouds of light on the ceiling.\n “My boy,” he says, and lets me in.\n I sit on the floor.\n “Tim gave them my father,” I say.\n “Gave?”\n “The soldiers. They cut him. He was . . . ” Watching me. Those calm eyes, how terrible that he was dying so calmly, and I was the last thing he saw in that dark tent as he did.\n The Librarian goes through books and holotech and other things that I’ve never seen. After awhile I look up and a picture of a soldier is floating in front of me. It’s pristine, a tall man in camouflage with weapons floating next to it and protruding from its back. His face is covered by scopes and lenses. Loaf-sized bots sit on its shoulders like pets.\n “This is what they looked like when they went into The Living Forest,” he says.\n I point to the robot.\n “I saw those.”\n The Librarian nods. Somehow the image has shifted and the soldiers as they appear now, ragged, half human, is in front of me.\n “They are changed. That is certain.”\n The Library is full and quiet. People stand shoulder-to-shoulder among the books, some of them looking around as if they’d never known it was here, and maybe they didn’t.\n A voice: “Someone said they’re taking people.”\n Another: “I saw them eating someone in the hallway.”\n And The Librarian must’ve already told them because a lot of the eyes in the room turn to me.\n “Him,” someone says, “his dad, the drunk.”\n The Librarian is talking now.\n “Not eating, strictly speaking. Using.”\n An image of the loaf-sized bots appears in the middle of the room, spinning slowly.\n “Their technology repurposes bio-matter. It’s how they stayed out there so long. They have taken The Living Forest into themselves. Perhaps it has changed them.”\n “Who are they?” someone asks from the back.\n “They’re the soldiers,” comes the answer from another corner of the crowd.\n And another: “We’ve been waiting for them.”\n The Librarian, with the clearest memory among us, speaks.\n “The Blank has affected our memories for many years, my friends. How many of you remember when The Blank first came?”\n Silence.\n “We began forgetting. Every morning there was less. We wrote down what we could. Here.” The Librarian gestures around himself. “And then slowly we forgot even the necessity of that. Then more, and more, and now here we are in the stadium, not sure where we came from or why we are here, sure only that we love the heroes.”\n And still silence. Finally someone asks: “What do we do now, Librarian?”\n I haven’t gone back to my father’s tent. I won’t. I can’t get the image of the bot patiently pulling his guts apart out of my head. Anything I think about—father, tent, Tim, darkness—I see the bot inside a body, slick with blood.\n The Librarian was so sure. What do we do now, they asked, and he said we fight them. The crowd left the library and boiled in the tunnels awhile, drinking whiskey and getting ready. I didn’t go. It was impulsive at first. I just didn’t want to follow. But then I thought about it, and knew The Librarian would know I was gone, and would think I was scared of the soldiers.\n And that’s right, of course. And I’m scared of Tim. And Farea, if he’s among the soldiers, and what I might do for him—he’s been my hero for so long.\n I watch from the roof as the people rage out of the tunnels at the sleeping soldiers. All the fires are burned down now and it is dark on the field. The people scream for bravery. They hurl whiskey bottles. They hold planks and pipes above their heads, ancient things they have torn out of the guts of the stadium.\n It doesn’t last long. The mech comes to life when the people get close and leaps over the sleeping soldiers, stomping through the attackers. Screams change register. People are running, some of them already having forgotten why they were attacking, or who. The soldiers are running too but even from this height, in the swinging light beams of the mech’s eyes, I can see that they are not angry. They chase people down, flatten them, leave them tied up.\n Tim is down there somewhere on the field.\n My best friend, down there in the panicking mix of light and shadow, there to feed our heroes.\n I haven’t gone back to my father’s tent.\n I won’t.\n Mike Buckley is a widely-published short story writer whose work has appeared in national journals such as The Alaska Quarterly Review, The Southern California Review, and Clarkesworld, Daily Science Fiction, and Escape Pod. His work has been anthologized numerous times, including in The Best American Non-Required Reading, 2003, and the upcoming Red Hen LA Writers Anthology. His debut collection of short fiction, Miniature Men, was released in 2011."}