{"fingerprint": "LNnEHh1AleKfh2HtQmGCw7S+AQE=", "sitename": "Clarkesworld Magazine", "title": "Helio Music by Mike Buckley", "author": "Mike Buckley", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/buckley_07_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Helio Music by Mike Buckley", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2800 words, short story\nHelio Music\nWake up, killer. For a year, two, you’ve been the static hum of space, floating, spread out over a solar system, asleep, invisible.\nGirl born on Helio 70, you.\nProperty of Fonta Corp.\nLittle skeez life crouched on a side street in the darkest spiral neighborhood.\nMusical genius, you.\nIt started as humming. You watched people walk the spiral streets and hummed with their movements, flashing high notes at the stumbling drunks with their jaws hanging, rotten from using fermented calorie paste. Low notes described the mothers who watched their children move through the pools of light under the lamps, and hard mean rhythms fit the children best. They got worse all the time, meaner, hungrier.\nOne day, at the edge of the light from the last lamp, where there are ancient, rotting machines rowed up in the darkness, you saw two boys on their knees, swinging rocks. They banged out a wet rhythm, and you got closer, and saw they were smashing another child’s skull. So you started using rocks to make music, too. Quick tapping on the little upturned cupstone that you carried like a charm. Slower tapping on a bigger, softer stone that sat at the edge of the lamplight. A skeleton wandered over at hearing the noise, a man pure grotesque, a hole rimmed in sores where his nose should be, no fingers, his forehead covered in carved-in scars.\n“Why do you do that, hit those rocks,” he asked.\nWhy?\nThere was no answer ‘cause you didn’t know the words to say you were building a world made of sound and it made more sense than the dark spiral. So you sat, staring at your rocks, not wanting to look at the man’s face.\n“You’re pretty good. Are you from this spiral?” he asked, and you looked at him like he’s crazy. Where else could I be from, you thought.\n“There’s other spirals,” he said. “Right next to this one. Some aren’t so bad. They have lights and aren’t as crowded.”\nYou looked at him, killer—and although what he said was crazy, his eyes in among the fresh sores on his face were shiny with a kind of truth.\n“Other spirals? But . . . ”\n“Yeah. I know. We’re vaulted in here, but there are ways out. And in.”\nHis forehead, close up, was scar upon scar upon scar, each a letter, or a symbol, maybe a note. You didn’t recognize them.\n“You have a mom?” he asked.\nYou ran your palm over the cool stone and thought about the music inside it, the rhythms that it had yet to produce, and you shrugged. The memory of your mother wasn’t there—the first thing you knew was a street, foggy almost always, and the older children that slept in the middle of it. This was a good distance from the lamps so you knew their faces by touch, and their voices by how angry they were. The angry ones hit or bit or found other ways to hurt.\n“If there are other spirals, how come those have lights and this one doesn’t?”\n“Cuz you’re the cheapest,” the man said.\n“What?”\n“You know what Helio 70 is?”\n“A mine,” you said, ‘cause you’d heard that somewhere.\nThe man laughed.\n“Flesh mine, maybe. The spirals are . . . Tanks. Pens. You wouldn’t know those words, but the spirals hold people. Someday Fonta mercs will open up the vaults and clear everyone out of here, straight into a ship. If you’re lucky it will take you to a labor colony. If not it’ll drop you into protein tanks, turn you into high quality calorie paste for someone in a nicer spiral.”\nYou stared at the rocks, you Helio girl. Unmoved even hearing this. The man’s hand on your shoulder felt light and hot.\n“There’s a way out, like I said. But not for everyone.”\nThe man told you about Charles, a boy he’d taught to hotwire a launch system in a lander that could get you off of Helio 70, into monitored space.\n“If they can find you, that’s where it would happen,” the man said.\n“Who?”\n“The Flayed Eagles. They’re the closest squadron, a light assault unit stationed right now on the rim of Gristal’s Cluster. The music,” the man said, tapping your head with his fingerless hand. “That’s what they’ll want.”\n“Music?”\n“You rather stay around and wait for the mercs?”\nHe led you through the dark neighborhoods at the edge of the lamplight and found Charles, a thin boy sitting on a pile of bricks. The man left you there with him, and whoever the man was, you never saw him again.\nThat night Charles made a fire out of garbage scraps, singing as he did. His songs were all about the darkness. He’d known his mother, though. Her face was soft and pale. And then one day she was gone and he was running through the spiral, being chased by the sound of ragged breaths in the dark, then he was at the lamps, watching a dizzy drunk named Gog walk an imaginary tightrope between them.\nYou laughed; you’d seen Gog do that.\nWhen he’d gotten the fire struggling along, Charles set out two cups and squeezed calorie paste into them. You slurped the paste, thinking about what the scarred man had told you about mercs and pens and other spirals. Charles hummed quietly and when you looked up his cup was empty, backlit by the sad little fire, and he was close to you.\nHe kissed you on the eyebrow and his hand settled on your knee. The nerves in your shoulder and elbow twitched, killer, and you were about to slap him, but Charles took his hand away, and lowered his eyes, and walked to the other side of the fire.\nAfter you slept, Charles, using instructions that the scarred man had forced him to memorize, took you through a forgotten ductmaze up to the storm-whipped surface of Helio 70. The sky was dark, flashing with lightning. There you were, killer, screaming and laughing in the rain that fell so hard and cold it felt like shards of glass. Charles laughed too. The darkness of the surface was as total as the darkness of the spiral except for the scope and the stars—it stretched above you forever, and the only way that you could think about it was to make it into a sound. A song. You stared at the stars, singing to yourself, until Charles had rigged up the lander, and waved you over to it.\nYou both squeezed into specimen tanks and used handmade air masks, pulling rubber gloves over your mouths, taping them into place. In the dark, in the cold of the specimen tank, you heard Charles fumbling with wires, enabling the auto pilot that would jump the lander into space, singing still, and then the thrusters kicked hard, and the music was swallowed by sheer noise.\nThe lander had been rigged with a drive that hummed alive once you were in orbit. Two cold days later, yes, The Flayed Eagles found you.\nTorches cut open the lander. Long, soft legs reached in and gently pulled you out into brightness and zero-g and swabbed your filthy Helio skin. Charles floated next to you, a ribbon of black blood stretching from his mouth, his eyes crossed and dead. The g-load from the thrusters had crushed his sternum, they told you later, his Helio bones weakened from calorie paste, and he drowned in himself before the lander even cleared the gravity of Helio 70.\nYou were close to dead too.\nThe Flayed Eagles spent a year making you healthy.\nTwo years training you with games and musical drills and puzzles.\nFirst it was simple. You woke up in a room with nothing. When you tapped the walls different sounds came out: chimes, whispers that reminded you of Charles singing about Gog, moans. They’d just fed you, something like calorie paste but so rich that it made the insides of your bones tremble. You burped.\nThe wall burped back, in music.\nYou learned that everything you did in this room made music. A symphony would wake you up in the morning, and your job during the day was to try and recreate it through your movements. You danced and music poured from the walls and it was so complex and pure and your control over it was so seamless that it felt like the revelation of a kind of light that no one else could see, a brightness that almost hurt to think about.\nHere it was—your purpose in life.\nOne day you woke up next to a small pile of copper-colored triangles. When you hummed they rose into the air. They followed your voice. It didn’t take you long to learn how to train them, killer, these little copper deltaics. Hitting out a rhythm could make them dance or whip tight circles around the room. Hitting out another rhythm could make the deltaics shred across the walls, opening up long gashes that bled a thick white fluid. They’d heal up soon after and you’d cut them again, killer, sometimes all day and night.\nYou woke up and one day she was there, a nude woman crouched in front of you, smiling. She was like no one you’d ever seen.\n“I’m Mother,” she said.\nShe told you about her children, The Flayed Eagles. The squadron had left Earth hundreds of years ago and had been fighting ever since.\n“You’re one of us, now,” she said. “And your gift.”\nShe gestured to the pile of copper deltaics.\n“Put me to sleep,” she said.\nYou hummed, and the deltaics rose in a small, quivering column. They floated to Mother, hovering over her, and you could feel all of the strength in them, the edges. It was like holding a rock over a sleeping person’s head and knowing you could kill them.\nYour song was almost a whisper, and the deltaics settled down around her shoulders, gently stroking her bare skin, and then spinning in a slow ascending circle around her torso, very gently. Mother’s eyes closed, and she smiled, and settled onto her side. You sung the deltaics into smoothing her hair, her eyebrows, touching her shoulders.\nThe deltaics were yours now, as surely as your own music was yours, and now The Flayed Eagles spent another year pre-surgical, mapping your nerves, flashing images of your brain, your whole body stretched out, shaved clean, gridded over by a projector.\nOne day Mother revealed it: the fighter.\nIt was a million hand-sized deltaics that could puzzle together to form a battering ram or spread out over miles and miles to become something more like a storm. They were networked like your training set was, and you controlled them by thinking of music, but control is the wrong word for it: a dancer is movement, not the control of it. A pilot in The Flayed Eagles is will and destruction married together.\nThe fighter had a designation, a name, but killer, here’s the thing, a human throat can’t say it. The name was only a thought, a conception of sound. It was the brain screaming in a certain rhythm and lacing it through with a metallic grind, and this is a kind of thought that only people with a specific kind of musical intelligence can have.\nMusical genius, you.\nThen one day you woke up and you were not you—the knob-kneed, bucktoothed girl who left Helio 70. You were the sound. You were the ship. You were the storm of deltaics that was at that moment resting in a bay, waiting for its first training flight. Some pilots lose it at this moment, but not you—the body of a Helio girl wasn’t you anyway. Inside the ship, your mind networked throughout the deltaics, it felt like being made up of shattered glass or bones or slivers of light, just like they used to splinter sometimes in the fog around the lamps in the spiral.\nAnd it felt good to work the way a pilot does. You made rhythms to shape the movements of the deltaics into one swarm or ten or whatever. Your favorite, killer, is to tap out a jaunt, very repetitive, that assembles the deltaics into a vast, circular mouth.\nHere was this mouth hovering at the edge of a boring solar system. Battles were behind you—you’d gone with The Flayed Eagles to Residua Prime and met the ancient, world-sized galleons of The Rolling War there, dangerous for their optics and their range, but once you got past the torpedoes, you landed on galleon after galleon and stormed through their hull and bored, tearing and screaming and dancing the whole way, until you came out the other side into cold void, a plume of wreckage and flesh behind you.\nYou’re good and The Flayed Eagles know it so when you tell Mother that you need a break, you need to fly into the black alone, she says ok, good, come back soon.\nAnd so here, void-scale, a maw stretching a thousand miles lip to lip, deltaics like rows of shark teeth. At the edge of a solar system. Invisible to the naked eye was Helio 70 in its dark little orbit.\n“Colony, acknowledge,” you said, like you’re nobody.\nAfter the lag, they sent you a ping back, just a click, a simple way of saying that they give not a shit about you, whoever you are.\n“Identifying as Flayed Eagles, element four . . . ” You let it drift off.\nThey didn’t ping back this time. Piped right in was the image of someone called Bishop Fongin, artificially tanned and smiling like daddy.\n“Flayed Eagles, element four, welcome to the radial of Helio 70. There is no scheduled visit. Is your ship damaged?”\n“A violation has been reported.”\n“Oh no, that’s a mistake. Our license is current.”\n“Current for what?” you asked.\n“Mining, of course. We are an ore station. Precious metals.”\nYou tried to put words to it. You’re a flesh mine, like the man said. You’re a suffering mine. You’re a blood mine. You’re a nightmare dug into rock.\n“Not metals. People. You sell people,” is what you said.\nFongin went incandescent. He stood up, his robes falling heavy around him.\n“We are, in no way, guilty of that. And certainly you have no proof . . . ”\nBut now you’re hearing something. It was the song that Charles sang as he arced wires together, trying to get the lander to jump off into the dark sky; it was the sound of a child’s head being hit by a rock again and again; it was the sound of children screaming in the darkness, happy, murderous, both, trying to a find a little girl to hurt. It turned the deltaics into a spear a hundred miles long, and your gaze locked onto Helio 70, the colony which was in every way nothing more than a pit down-spiraled in miserable humanity, a few Fonta mercs and those who owned them at the top, with a view of the stars.\nThe spear would hit them first.\nFongin said something, raising his arms and his great fleshy hands as if he could intimidate you. Surely not in alarm. Helio 70’s sensors weren’t good enough to see the ship coming at them. It was some kind of fake outrage, the last thing he said.\nThe spear was a tight whirlwind of grinding deltaics and it blasted through the top of the colony and down, obliterating the spirals so quickly that you didn’t even feel the rock vaporizing, much less the people and their pathetic shelters and the fields of castoff machinery and the darkness and the stones you’d tapped with sticks, discovering your gift for music and destruction.\nYou blasted out the other side of the planet and in a rage you tore around the solar system, you tore, killer, and tore, and finally you drifted off in all directions, deltaics subject to whatever momentum was touching them at a given moment, and then you went to sleep.\nNow you’re awake. Consciousness passes through the deltaics again. You flex and draw yourself together and look at what is left of Helio 70: a rock with a perfect hole driven right through it. You constrict into something like the spear you’d been but this time slower, quieter, and you sink into the hole, deltaics reaching out gently to hiss along the smooth walls as they had once against Mother’s skin.\nYou cling to the inside of the walls now, killer, deltaics flattened, and although you know it is gone forever, at least on Helio 70, you listen for music, and the ticking of life in the darkness, and the beating of a young girl’s heart.\nMike Buckley is a widely-published short story writer whose work has appeared in national journals such as The Alaska Quarterly Review, The Southern California Review, and Clarkesworld, Daily Science Fiction, and Escape Pod. His work has been anthologized numerous times, including in The Best American Non-Required Reading, 2003, and the upcoming Red Hen LA Writers Anthology. His debut collection of short fiction, Miniature Men, was released in 2011."}