{"fingerprint": "pwopO2Kk2z9Rgab/5jnXEEsNiOk=", "sitename": "Clarkesworld Magazine", "title": "All Original Brightness by Mike Buckley", "author": "Mike Buckley", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/buckley_03_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: All Original Brightness by Mike Buckley", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4460 words, short story\n All Original Brightness\n Gonzo arrived in an assault of brass music and spilling banners rippling the pelt of cannon smoke where her feet would’ve been, taking up the hotel entrance in all its marble and chrome—its expensive anachronisms and the people paid to stand next to them in red vests—filling it up as I probably had, Mitchum thought. Funny; from the inside, none of us feel so big.\n But then PFC Evelyn “Gonzo” Gonzalez’s immerso read the space it had available and shrunk. The smoke recoiled as if some great lungs within had inhaled, banners withdrew, the brass march quieted. A hovering face clarified in the nano swarm of the immerso, shifting features, for a moment not quite this person or that, then Gonzo’s still-beautiful voice came out of it.\n “Mitchum, you goat rapist.”\n “Gonzo, you short bus rock star.”\n Medals blinked into existence on Gonzo’s immerso, and Mitchum watched the floating pictures next to them—images that expressed her state of mind: Gonzo pretending to ride a broken surfboard, or standing in the sun at high school graduation. And here, with a boy. Mitchum felt his weight shift among the suspension gel in his tank—or maybe it was his imagination. Seeing Gonzo now, he wondered if she could feel her weight in the gel, if she sometimes felt the tug of the jack that ran from the inside of the tank and bolted to her forehead just like Mitchum’s did, between his two vanished eyes, the jack that carried images from the cameras on the outside of the tank and landed them in his brain, in what the AIs called the V2 portion of the gray matter. The AIs had a separate language altogether. Multisensory Projective Identity Display is what they called the nanites that clouded around the tank and formed images to express the tanked Marine’s emotional state. The Marines just knew them as immersos.\n They stood apart from each other, as soldiers do, looking at and thinking about the other.\n Gonzo broke the silence.\n “What are we waiting for?” she said. “Let’s drink, man.”\n A year ago, Mexico City, following the purchase of the Mexican capital by the Morninglory Corporation\n For the first two months it had been DF, Distrito Federal, but then the Marines changed it. DF, USA. Then just DFUS, Distrito Federal United States, they told the officers, but it really meant something nastier. The 5th was billeted in a church close to the city center. Pews had been yanked out to accommodate the rows of Marines. During the day the middle of the church was a sort of communal space. Mitchum left it alone as much as he could and spent time in one of the draped-off naves, reading the books his mother sent him. Gonzo got them after he was done.\n “I think your mom’s a lonely woman,” Gonzo said one day.\n “Huh?”\n “All she sends you are romances.”\n “It’s what she reads.”\n “Which is why I said she was lonely, Brainstein.”\n Every night they suited up and met the patrol convoy out front. Fat bellied med robos, carrying gallons of compressed stabilization gel, passed the thinner, lethal firing platforms. The boss robo, the thing that had taken the place of the officer corps in the field, wasn’t even within sight. It floated a mile above DF, staring down at the squad and reading the nano-spread in their blood. These patrols were meant to hit the Narkys, gangsters from all over the world hired by Morninglory, brought in to cause mayhem, just before they bought DF—to drive the price down, of course. The Narkys were too dumb to know that once the deal was done Morninglory would turn its attention to killing them off. They’d hired the USMC to do it.\n “Good evening, Squad six,” the boss robo said into their earpieces as they stepped out into the night. No one answered. Humvees moved up the block, patched in scrap metal. Small black globes floated over them, anti-ballistic nano swarms. Once on the road they’d disperse around the vehicle.\n Their ritual: Before every patrol Gonzo smacked Mitchum’s back hard.\n “Tip of the spear,” she said.\n Gonzo and Mitchum walked farther into the hotel, their immersos expanding from the joy they felt at seeing each other.\n “Where you been,” Gonzo said.\n “Been home.”\n “So I was right about the goats?”\n They floated into the Marine Corps Ball.\n Mitchum and Gonzo ordered drinks, and red-suited waiters reached in to the multicolored boil of the immersos. The bottles of beer were gripped by the nano swarms in the immersos, which could act like hands. Around them other Marines started arriving, grouping up, formal but just barely containing their joy and rage. Mitchum had felt this before. Get a bunch of Marines in a room and you can almost hear the whir of life. What other people were like this? Mitchum’s mom had been a teacher. Get twenty-five teachers in a room and the bitterness and disappointment they put off was like scalded coffee.\n “God,” Gonzo sighed, sipping through the oral port in her tank. “Beer tastes like God.”\n “You’re a heathen, Gonzo.”\n “You can’t tell me you still believe in that shit you used to talk about.”\n “What?”\n “Jesus. God. The holy toast.”\n Mitchum twitched. To calm himself, he watched Gonzo’s medals turn. He had the same medals: campaign ribbons, Mexico and Panama; meritorious service award; Purple Heart.\n Mitchum didn’t believe in God anymore. Not even close.\n But because it was Gonzo, he lied. “Of course I do. Now more than ever.”\n “Ain’t that special,” she said.\n Mitchum drank.\n “There’s something I have to tell you,” he said to Gonzo. “It’s important.”\n “What?”\n Mitchum thought about what he needed to say to Gonzo. He formed the words but didn’t release them. And then he lost his nerve.\n “I’m going to the head,” he said.\n “You’re right, that is important. Thanks for keeping me in the loop,” Gonzo answered as he moved away.\n This was Mitchum’s first MC Ball. They always happened in hotels like this one, expensive enough to have marble and soft carpets, but cheap enough to have rooms available to Marines that would trash half of them. Every Marine brought a date, which they ditched when they arrived so drinking could begin. The Dump tonight was a bar adjacent to the main ballroom. The abandoned dates were standing in groups, mostly women but a few men. They weren’t excited to be here, but seeing women dressed in their gowns calmed Mitchum, reminding him of pictures of his mother, and rose petals fell around him in a drifting snow—a reflection in the immerso of the change in his heart rate.\n “Ah, womanhood,” a monotone voice next to him said. It was Mandell, his immerso part dress blues and part mind-bending mirror labyrinth.\n “Yes,” Mitchum said.\n “They possess many pleasing features. Their neck. Their asscrack.”\n Mandell had gone down in a helicopter crash over DF, broke his neck and got total body burns and a TBI so bad that his eyes popped out and gray matter leaked from his ears. When they were done putting him back together again, Mandell had become all interface, an AI that connected to hyped-up receptors in his brain. It put together the Marine’s thoughts as best it could and spoke them for him, usually in its own halting lingo, so the Marine could have a version of a social life. The more messed up your brain was, the more the interface scrapped together neural impulses, adding its own halting lingo when it needed to. It made him creepy to talk to.\n “The pleasing tractability of their flesh,” Mandell said.\n “I live with my mom,” Mitchum answered. “Ain’t had no pleasing tractability in awhile. Not like I could feel it anyway through this tank.”\n And of course among the things I lost in DF were my hands, my arms, my shoulders. Eyes. Jaw. Face. Who would want to be with me?\n Beer traveled through the sip port. Had he wanted to drink?\n The women in the bar shifted closer together. Some of them tilted their heads and smiled at Mandell and Mitchum. Others pursed their lips and looked away. The male dates talked loudly about sports.\n “We’re making them uncomfortable,” Mitchum said. Unbidden came the image of his legs, balls, dick—where they’d been. He ended in a tucked abdomen now. Fourteen robo surgeries. Every inch of his flesh mapped out in constructs, mulled over day and night by med AIs trying to think up new surgeries.\n Again beer in the sip port.\n I know I didn’t want to drink this time, Mitchum thought. I’ve got to keep a clear head.\n “Their pre-orgasmic sighs,” Mandell said.\n One of the women split away from her group, glaring at Mandell and Mitchum as she crossed the floor, pure disgust and hatred.\n That expression hooked into such a lovely, delicate face made Mitchum boil in his gel.\n DF\n Despite the rumors, nothing had ever happened between them. Mitchum spent down time with Gonzo, slept next to her, played cards with her. Sometimes he helped her trim her toenails, taking each toe gently and carving the excess half-moon nail away with a blade. As he cut she told him all of the different things about him that made him impossible to love. His melon head. His pale, disconcerting eyes. The smell.\n At night they talked.\n “What do you do back in Fresno?” she asked. They were on the roof of the church, DF stretched out around them, light spread like shells upon the cathedrals.\n “My mom has goats. I help out.”\n “How many goats?”\n “Thirty-six.” He thought back to the last letter he’d read. “Thirty-five.”\n “Your mom is an animal hoarder,” she said, and flicked his ear hard enough to make him duck.\n “Ow. What?”\n “She collects animals ‘cause she’s lonely.”\n “No.”\n “Clever refutation. I take it back.”\n Gonzo was from West Long Beach, the Morninglory part, which had been bought out by the corp when she was eight. Ten story tall Panopticon towers stood in the neighborhood. She lived near the one closest to Santa Fe Street. People in her neighborhood called it The Dick. All night Morninglory agents watched the houses from The Dick, shining spotlights up and down the streets. Once in awhile they caught somebody breaking the law, usually boys, and they made examples of them. Frank Andrades was crucified just before Gonzo signed up with the Marines, right on Santa Fe, near the food complex.\n “Which is why it’s a very bad time to be a male,” she said. Gonzo’s argument was that the young male’s in-built desire to peacock all over the place had outlived its genetic usefulness. Frank’s body hung there for a month, she’d heard, The Dick shining a spot on it all night to make sure no one cut it down. Finally the ligaments in the arms gave, and he fell to the sidewalk.\n Gonzo was a scholar. She read everything, and spent high school lunch periods in the school’s library touring the world via holo and even reading the old, tagged-in books. When she learned that the university allotments for West Long Beach had been filled, she snuck out and joined the Marines instead of going to work for the corp.\n The night before they got hit they’d played Threes. Scholar though she was, Gonzo was a dunce with cardplay. Mitchum destroyed her game after game. It got boring, and only because the option of straight conversation was worse, they played and talked.\n First the future.\n “I’ll finish here. Go back to Fresno. Live with my mom,” Mitchum said.\n “Which is the only thing that could possibly make you more attractive to the ladies.”\n He ignored that. “I’ll raise goats. When my mom gets old I’ll take care of her.”\n “Me—I’m gonna take the GI bill and go to school, somewhere still in the US, not bought up by Morninglory yet. Maybe Seattle.”\n Then they talked about the past.\n “It’s because of my dad,” Mitchum said, answering a question from Gonzo. “Mom was all messed up after he left. So when I think about, you know, standing in the door, about to leave, I can’t do it. It was hard enough joining the MC.”\n Gonzo answered a version of her own question. “My mom would’ve sold us for cigarettes. But I don’t hate her for it.” She went on to tell Mitchum what it was like after the US sold West Long Beach to Morninglory. The Panopticon going up. The city cops walking off the streets for the last time. Everyone in the city being drafted to work in the corp’s factories. “If you stay in that city you learn to see people as money on legs: you spend them. Which is why I’m getting the fuck out.”\n Then, obliquely, they discussed each other.\n “Something I learned here,” Gonzo said, “is that most of these Marines are all talk. They’re so brave smoking cigarettes in the church. But Narkys start shooting and you can see it in their eyes that they’re afraid. And that they’re somewhere in their minds weighing whether you’re worth saving. Like they see you as currency too.”\n Mitchum shrugged.\n “But you, Mitchum,” Gonzo set her cards down in a small fan around her left knee. “I look in your eyes and I know. You’d do anything for someone you love.”\n Mitchum stared and gulped and tried to think of something to say. Gonzo beat him to it.\n “You dumb motherfucker you.”\n Da Fuck Us, the Marines called Mexico City. Like this: the Morninglory agents da fuck us, the Narkys da fuck us, we’re living in a church da fuck us.\n When they got back from patrols Gonzo would sit and smoke cigarettes and re-read letters. She told Mitchum everything going on back home. West Long Beach was locked down. A street gang had sprung up, something that Morninglory had promised to abolish when it bought the city. The corp had a couple gun battles, burned down half a block of houses. Snipers were assigned to The Dick.\n “And how’s mom and the goats?” she asked one day.\n “Good.”\n Sometimes it dizzied Mitchum to compare Gonzo to his mother. Gonzo was strong. You could see it when she moved, light and precise on her feet like they were blades. She had the kind of presence that could make even the biggest Marines shut up. These same guys would dog Mitchum out day and night when they first got to the church, but Gonzo had stopped it. One day in the common area of the church the Marines were calling Mitchum slow, stupid-quiet, and doing impressions of him staring at things. All he could think was—is that really me? Do I stare at stuff like I’m slow?\n Gonzo was cleaning her weapon and cut in.\n “Why do you think Mitchum don’t say much?” she asked.\n That shut the room up in a way that Mitchum hadn’t expected. Then she answered her own question.\n “ ‘Cause he ain’t gotta say shit. You all . . . ” Gonzo moved her hand like a talking mouth. Then she pointed to Mitchum. “Dude just does his job, no hype. That’s what a hero looks like.”\n Mitchum thought about that every night. He didn’t feel like a hero. They’d been in a few firefights and he’d done all right, but nothing special. Gonzo had tied him to her in a kind of charity, and he wasn’t sure why.\n But there were the rumors.\n “People say we love each other, you know that, right Mitchum?” Gonzo said to him one afternoon. They were checking each other’s gear for the night patrol.\n He shook his head. Gonzo waited; she was beautiful in the way that frightening things sometimes were, appreciation mixed up with mortality.\n “Do you love me, Mitchum?”\n What did she want him to say? Mitchum thought, his eyes on her boots. He wanted to say yes, yes, yes, but he couldn’t even bring himself to look at her.\n Mitchum traveled back through the lobby, the immerso around him full of eagles and footage of squads moving down ruined streets. A march played softly, laced through with snippets of famous Marine Corps speeches. Holographic children followed the immerso, barefoot and filthy and starving, vanishing once out of projector range, expressions of liberated glee on their faces. Gonzo was in the middle of the dance floor, shooting off lightning bolts and banging street grind. Regular Marines around her did something like dancing.\n Marines parted as Mitchum crossed the dance floor. Somehow Gonzo didn’t see him coming. Mitchum passed through the projective area of Gonzo’s immerso until their tanks clunked together.\n “Shit,” Gonzo said. “Mitchum.”\n “Evelyn Gonzalez,” Mitchum said, to get her attention.\n “Since when do you call me that?”\n “This is what I wanted to tell you: They’re taking my immerso.”\n The street grind raged around them.\n Finally: “How?”\n “I was at the VA a week ago. DF’s gone way longer than anybody expected. There aren’t enough immersos. They told me about a guy from a mech unit that got burned in his tank. No skin, barely any muscle left. He’s lying in a bed, can’t say shit, probably crazy from the pain. They told me all about his wife and kids.”\n Imagine that he’s your father, the med AI had said, trying to be casual—but that, a flayed tortured speck of life, was Mitchum too.\n “I don’t care whose father it is,” Mitchum had answered.\n But that was it. An up-and-running immerso cost as much as two drone-swarm networks. And what would happen to Mitchum? The casual AI answered: you are stable, private.\n It’s not like he’d die.\n “They’ll let me stay in the tank. Everything else they’ll take. The interface, the V2 jack. Everything. I won’t be able to talk, see anything, hear. They’ll feed me, those fuckers, through a gastro-drip.”\n Gonzo was quiet. But he knew what she was going to ask next.\n “Shit. Will they take mine?”\n Mitchum stared at Gonzo—stare—that was the word he had to use, although it wasn’t accurate. Nano-swarms were networking visual data about Gonzo’s tank, her own projections and nano-swarm, the dancing Marines, the disco lights hung high in the room, and firing it back to a pinpoint receiver on Mitchum’s tank, which piped it through his V2 jack. His thoughts were on Gonzo’s future, alone in the tank when someone else needed her immerso, in the dark of West Long Beach, the spotlights from the Morninglory tower dragging back and forth across the barred windows of her house.\n “There are enough of us,” Mitchum said, “and enough tanks to keep us alive, in the dark, forever. Everything else is going away. I’d rather be dead than be locked in the dark alone. I’m going to . . . ”\n Mitchum thought of what he had decided to do. Of Mandell. And then he turned and moved away.\n DF\n In DFUS, just before the sun came up, there was this quality to the air. Clean, a little cold. Mitchum and Gonzo used to sit on the roof of the church, watching the robos float over the city, and not even talk, just breathe. The lights below winked out one by one as the sun came up, a dog barked somewhere, sometimes there was gunfire. But in between the sounds was silence. A perfect tension of being.\n Mitchum and Gonzo had been hit on the same block.\n It was a day patrol, around three o’clock. Mitchum was standing on a corner, shoulder against a building, watching Marines move up the street ahead. He wasn’t nervous. The days were usually peaceful in DF. Network implants were part of the contract the Narkys got from Morninglory and they turned them into fast-eyed psychos for twelve hours at a time and crashed them the rest.\n That day, on the corner, Mitchum watched Gonzo step out into the empty street and look from one building to another. A Humvee idled behind him. The driver called out Mitchum’s name. At that moment, while his name coursed its sonic wash through the air to his ear and through that into his understanding, into his self-told-history, into the synaptic constellation that was the memory of the awful thing that was about to happen; at that moment while Gonzo squinted into the sun, while Mitchum registered the kneeling point-man’s back as a brown loaf shape a hundred yards away, Mitchum’s thought was of the church they were billeted in, his thought was that the city itself was also a church, as was the Humvee behind him and the robos slipping through the air and of course Gonzo too, there in the sun.\n He turned. The driver was already looking past him.\n The EMP rocket hit Gonzo first. It was the Narky’s way of counteracting the defensive nanite swarms that every Marine had—EMPs were RPG shells emptied of their explosive and loaded with a one-time, short-range pulse that killed any computer tech. Mitchum heard the EMP rocket hit the defensive swarm then heard the swarm hit the street like a bucket of uncooked rice. He didn’t see the second rocket hit Gonzo, but he felt the explosion in the soles of his feet. The med robo fell toward the smoke. Gonzo was crumpled there on the street, and Mitchum broke into a run, firing his mod gun at the roof of the near building. The med robo disgorged its suspension gel over Gonzo in a loud splat.\n Mitchum ran.\n When he got to her he kneeled, firing his mod gun. Shapes dropped out of sight on the roof. He looked down and saw the gel over Gonzo. She was raw beneath it, her limbs ruined, her face occluded as she bled into the gel.\n A firing platform hit the building to his left, peppering glass and stone across him, and Mitchum looked back in the direction he’d come from. The Humvee had been hit—flames licked up behind the cracked windshield. The Marine who had called his name a few seconds ago was slumped on the dash.\n A sound like a reversing thunderclap hit him. Another EMP. Mitchum’s nanite swarm fell useless around him.\n Thoughts came fast: I’m naked here, a perfect target. But I can’t leave Gonzo. They’ll pick her apart.\n Mitchum fired at the roofs on both sides of him. Then he reached down, through the gel, and grasped Gonzo under her arms. Her skin was hot mush.\n He stood and began to pull her to safety.\n The next thing Mitchum remembered was darkness.\n They told him later that the second rocket had landed right behind him, and although he was mangled, his body had shielded Gonzo from most of the blast.\n Mitchum found Mandell still by the Dump, his projections whorling spirals of cloud and garbage, staring at the women. They’d forgotten about him, it seemed, and were drinking champagne.\n Mitchum focused his attention into a fist and the nano cloud obeyed; he slammed it into Mandell’s tank, aiming through the projection cloud as best he could to hit the seam, the weakest spot. It busted under the nano fist and Mitchum felt the raw, shameful glee that came with hurting someone.\n Mandell roared and turned, his projections enflaming and turning the room incandescent. Mitchum’s tank rocked as Mandell struck back and then the two tanks collided and fell, their projections intermingling into swirling light and smoke, faces, eagles in panicked flight, refugee children dragging bleeding American flags across the floor . . .\n “Conflict is sexually gratifying . . . ” Mandell growled through the overly formal interface, and Mitchum hit him again, feeling another section of the tank burst under the nanite fist. And Mitchum decided maybe it was exciting. There were such fine degrees between stroking and hitting. Either way the flesh is there, that dumb, wonderful moment of contact.\n In DFUS he used to think about Gonzo’s stomach, just above her hips. How smooth it would be. He’d never seen it, of course, and now her skin, like his, was gone.\n Mitchum felt a strange agony grip him: the stabilization gel was leaking out of his tank. What was left of his body was settling against the inner wall. He experienced an intense thirst for air, the empty space where his lungs had been throbbing in some involuntary spasm, and then the nanite clouds lost power and fell to the floor.\n As his consciousness narrowed, Mitchum listened to Mandell scream about the gel leaking out of his own tank, about the uncomfortable sensation of weight upon him, about women and how in all their beauty he wanted to smash them to shards.\n Weight. Blackness. And then gone.\n Slowly the darkness coned away until there was a small point of dim light.\n The presence in the darkness thought. It realized it was Mitchum, a grievously injured Marine, what was left of a man. He remembered Gonzo and the MC Ball and what he’d done to Mandell, but he couldn’t see the outside world or hear anything or feel his body. His interface was off. He was alone in the suspension gel.\n So what is this light? I don’t have eyes . . . How is this light getting into my brain?\n Don’t start singing, a voice said. It ain’t Heaven.\n Gonzo?\n Tip of the spear.\n Where are we?\n In the same tank. There’s a jack cable going between our heads.\n How did we get in the same tank?\n After you hit Mandell—and he’s OK by the way, nice of you to ask, at this moment he’s probably telling a nurse that she has pleasingly tractable flesh— they were gonna take your interface gear and leave you in your tank, just like you said they would. I made a deal.\n What?\n I told them they could have all of my interface gear too, and even my immerso tank, if they just put me in here with you and connected us.\n It was hard to explain, but Mitchum could feel Gonzo’s presence. It might’ve been a degree of warmth in the gel. It might’ve been that they were touching; perhaps their ruined skulls were forehead to forehead. Perhaps the V2 jack was unneeded.\n Gonzo laughed.\n Two bodies, one coffin.\n Mitchum watched the light in front of him. Slowly it clarified. He was back in DF, on the roof of the church. But it wasn’t. This roof had a forest of statues. Saints towered over him, ribboning the sun across his face, and there were statues of killers and con men and mothers and children too. There were statues of soldiers rushing through the other statues, panic and bravery mixed on their faces like lightning in full sunlight.\n Her voice echoed out from within the stone shapes.\n Mitchum? Find me, she said. I’m here.\n Mike Buckley is a widely-published short story writer whose work has appeared in national journals such as The Alaska Quarterly Review, The Southern California Review, and Clarkesworld, Daily Science Fiction, and Escape Pod. His work has been anthologized numerous times, including in The Best American Non-Required Reading, 2003, and the upcoming Red Hen LA Writers Anthology. His debut collection of short fiction, Miniature Men, was released in 2011."}