{"fingerprint": "HEy7KWDgWstoJqp0TlzBcSyrTQc=", "sitename": "Clarkesworld Magazine", "title": "Artificial Wombs and Control of Reproductive Technology by Stephanie M. Bucklin", "author": "Stephanie M Bucklin", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bucklin_09_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Artificial Wombs and Control of Reproductive Technology by Stephanie M. Bucklin", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nArtificial Wombs and Control of Reproductive Technology\nA new technology could help save the lives of premature babies—and raises new questions about both age of viability and reproductive control.\nIt’s called the Biobag, an artificial womb designed by researchers at the Children’s Hospital of Philadelphia. Essentially, the Biobag is a fluid-filled bag hooked up to wires and cords. Researchers maintain the bag at a constant temperature and in a sterile environment, with other monitors keeping an eye on vital signs and blood flow, according to a press release on the new technology.\nAnd in that bag, fetuses can actually grow and develop: researchers were able to grow fetal lambs for up to 28 days, until their time of “birth.” The lambs developed normally, even growing wool, opening their eyes, and developing normally. Once born, their organs showed no signs of malformation, nor did they appear to suffer any brain damage.\nThe breakthrough signals a potential new age of reproductive technology—if researchers can eventually bring the Biobag to human trials. In fact, the image of human fetuses growing in bags seems like science fiction, and science fiction points the way to some of the major implications of that breakthrough.\nWhat the Biobag Could do for Human Infants\nSo why do we need to grow humans in Biobags in the first place? The new technology could be used to treat premature infants. Right now, infants born at about 22 to 23 weeks will survive—but they’ll most likely face chronic lung disease and other complications related to their immaturely developed organs. When infants that young are exposed to air, their lungs actually aren’t able to continue to develop normally, a problem that could be circumvented if they are instead placed in a Biobag that mimics the womb. Instead of air, the infants would continue to breathe amniotic fluid, and their organ development could continue normally.\n“These infants have an urgent need for a bridge between the mother’s womb and the outside world,” said study leader Dr. Alan W. Flake. Flake is a fetal surgeon at the Children’s Hospital of Philadelphia. “If we can develop an extra-uterine system to support growth and organ maturation for only a few weeks, we can dramatically improve outcomes for extremely premature babies.”\nResearchers hope they’ll be able to support babies from about 23 weeks to 28 weeks, after which most of the major complications associated with premature birth start to disappear.\nAge of Viability\nBut Flake and his team are already anticipating some of the major questions swirling around the new technology. He emphasized that he and his team have no interest in pushing back the age of support to younger than 23 weeks—in part because the fetus would be too small and the procedure would be too risky.\n“It’s certainly not our goal to extend the limits of viability,” he said during a press conference on the results, as reported by National Geographic. “Our goal is to improve survival for extremely premature infants.”\nOther doctors also dismiss the idea that technology like the Biobag would be used to extend viability. George Mychaliska, a pediatric and fetal surgeon at the University of Michigan told National Geographic that the artificial womb system is not produced or designed in order to grow babies outside of a mother’s womb entirely. “That’s a Matrix thing,” he told National Geographic. “The whole point of the artificial placenta is to re-create the uterine environment for a period of time and allow the organs to develop to a point where the infant can tolerate postnatal life.”\nWhat Bioethicists Say\nBut not everyone agrees. Bioethicists, in particular, point to some of the unintended consequences of these technologies. Dena Davis, a bioethicist at Lehigh University, told NPR that the technology could blur the line between a fetus and a baby—which could affect abortion laws.\n“I could imagine a time, you know sort of [a] ‘Brave New World,’ where we’re growing embryos from the beginning to the end outside of our bodies. It would be a very Gattaca-like world,” Davis told NPR.\nAnother bioethicist from Oklahoma State University, Scott Gelfand, told NPR that such technology could even be used to control certain reproductive situations. For example, women getting abortions could be forced to place their fetus inside the devices, or employers could require female employees to use more advanced artificial wombs in lieu of maternity leave. Insurance companies could incentivize or even require women to use the device to avoid paying for complicated health risks associated with pregnancy and delivery, Gelfand told NPR.\nOf course, such a technology could have positive effects as well: it might represent a viable alternative to commercial surrogacy, The Guardian reports. In addition, it would mean all types of parents—same-sex couples, trans people, and others—could have the same experience of pregnancy, without prejudice. The Guardian also noted that it could allow for a more equitable distribution of labor, if mothers did not have to carry a child unless they chose to do so.\nBut Flake insisted that his own team has no ambitions to create an artificial womb that serves as an alternative to pregnancy. “That’s a pipe dream at this point,” Flake told NPR. “I want to make this very clear: We have no intention and we’ve never had any intention with this technology of extending the limits of viability further back . . . I think when you do that you open a whole new can of worms.”\nWhat Science Fiction Can Tell Us\nThat can of worms has been extensively explored in science fiction literature, even literature that dates back decades. Aldous Huxley’s 1931 Brave New World opens at the “Central London Hatchery and Conditioning Center,” whose motto is “Community, identity, stability.” The Director of the center is giving a tour to some students, and shows his audience the Fertilizing Room. In it, numbered test tubes are kept inside incubators—male gametes and ova that technicians will then fertilize.\nFertilized eggs are then placed back inside incubators. But not all eggs will remain there to grow: the Director explains that while “Alphas” and “Betas” are left uninterrupted in the incubators, “Gammas,” “Deltas,” and “Epsilons” are brought out again to undergo the ominous-sounding “Bokanovsky’s Process.” In it, fertilized eggs are bombarded with X-rays, until they proliferate into up to 96 different humans, all genetic twins.\nWhen one student questions the Director, he exclaims, “Can’t you see? Bokanovksy’s Process is one of the major instruments of social stability!” The center can produce 96 identical twins to work 96 identical machines, the Director says—one person for one job. A human grown specifically for one purpose, reflected in the human’s entire creation and upbringing.\n“If we could bokanovskify indefinitely the whole problem would be solved,” the Director finishes.\nIn Brave New World, taking the human womb out of the reproduction process has resulted in a society of mass production, where mechanical reproduction has allowed not diversity, but a terrifying sameness. Control is essential: humans are born not to two parents, but to a society that has a function for them to fill, and is dead set on molding them to it.\nThe idea that technology can replace natural human reproduction entirely is both enticing and alarming—because, the more control humans have over the process, the more opportunity there seems to be for abuse. In Brave New World, humans have designed a system to not just control the traits of one child, but the traits of every person in society. They grow embryos and destine them for certain jobs and roles in society, breaking down individuality and lauding the creation of enormous amounts of twins who can perform exactly the same role—as if each individual human could be designed for one purpose specifically, a purpose with the society’s own larger goals in mind. Human society becomes less human. Instead, it becomes a type of beehive.\nMadeline Ashby explores issues of control and technology in her short story “A Stopped Clock,” recently reprinted in Clarkesworld. In it, two cooks deal with a world whose (invasive) technological systems are starting to fail, turning order into chaos.\nWhen reached for some insight, Ashby remarked, “I think that examining the implications of change and the structures of power within any society is an important thing for all artists to do.”\nAnd reproduction is one major avenue for artists to grapple with these questions: “Stories about reproduction are intrinsic to humanity’s identity,” Ashby explained. “As humans, we’re faced with the paradox that in order to continue the species, we have to take a huge gamble on a future generation that may not survive, may not love us, may not even wish to have been born, and will doubtless blame us for everything that goes wrong.” Through technology, we impose control—but rarely is the next generation compliant with the rules that the previous generation set up.\nIn “A Stopped Clock,” humans begin fighting, dying, and panicking when long-established systems begin to glitch or turn off, possibly due to a cyberattack. The freedom this gives the two older main characters is not liberating, but frightening. Ha-eun, an older female cook, briefly thinks about her and her previous husband’s decision to not have children—a small way to wrest back some control from a regimented society. Absence becomes a form of empowerment, even if the characters themselves don’t view it that way. Avoiding that basic human impulse in an ever-watchful, technologized society is one way to maintain some separation from the organism that society has become. To procreate is to feed into it.\nLois Lowry also explores questions of control and reproduction in her much-lauded The Giver, where procreation occurs separate from the family unit. “Mothers” and “fathers” take pills to suppress any sexual or reproductive urges, and instead are given babies birthed from unrelated mothers who are screened for health before being placed with a family.\n“People read fiction in order to rehearse life, I think,” Lois Lowry told us. “At every decisive juncture in a book, the reader thinks subconsciously: what would I do, under these circumstances? To read speculative fiction about the future is to plan one’s own role in the future.”\nLowry continued that in that future, technology will be an integral part of our lives, and that it is thus imperative to consider the various ethical and political considerations that come with advanced technology.\n“The questions of control are already political issues,” she said. “How we address these questions will determine the future. It is vital, I think, to explore them by any means . . . including fictionally . . . now.”\nOf course, control doesn’t inevitably come with advanced technology—it can manifest in a number of other ways, too. In Octavia Butler’s unsettling short story “Bloodchild,” humans have developed a symbiotic relationship with an alien species in order to survive on another planet. There, in return for protection, males and females alike—but mostly males—host the eggs of the alien species in their bodies until it’s time for them to hatch, after which they’re surgically removed. In this story, humans have lost control of reproduction not because of technology, but because of a need for survival. The alien’s ability to use the humans as host, complete with anesthetic and surgical accuracy, allows them to exploit the humans’ bodies in unusual ways. And while the story touches on issues of need, permission, and consent, the end result appears to be: reproductive control leads to exploitation in some form.\nMargaret Atwood also explores the idea of reproduction and control in The Handmaid’s Tale, where fertile women called handmaids are forced to procreate with high-status, married men, whose wives are often barren. In the book, no artificial technology is used—in fact, the future seems a bleak throwback to earlier, technology-free days. A faux religiosity and sense of duty are used to control women, not any strange or frightening machines. Atwood indicates that it’s not technology, but people, who are responsible for this subjugation. Technology is a tool, and its application can be used for good or ill.\nThe Future of Reproduction\nScience fiction isn’t the only medium that can predict the future. As The Guardian reported, in 1924 evolutionary biologist J.B.S. Haldane predicted that, by 2074, artificial wombs would become so prevalent that fewer than 30% of children would be born naturally, “of woman.”\nAre we on our way to that kind of society? Some of us might see 2074 in our lifetimes, and while growing an infant from conception to birth in an artificial womb may be a way off technologically (and a way off from society’s acceptance), the possibility does not seem out of reach. With technology always pushing for new frontiers, an artificial womb may seem almost inevitable—meaning the questions that it raises will not long be just the province of science fiction.\nAnd in 50 years, we may come to understand just what artificial wombs and reproductive technology means for infants, mothers, and societal control.\nStephanie Bucklin is a freelance writer. Her children's book, Jack Death, was published by Creston Books in 2016 under her pen name, ML Windsor. Her nonfiction has been published on outlets including NY Mag, TODAY.com, and Vice. She graduated from Harvard with a degree in the history of science."}