{"fingerprint": "oZs4BGQWex9hSM/Q6HKA62rgmmA=", "sitename": "Clarkesworld Magazine", "title": "Flying Ponies: A Conversation with Lois McMaster Bujold by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bujold_interview_2020/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Flying Ponies: A Conversation with Lois McMaster Bujold by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Flying Ponies: A Conversation with Lois McMaster Bujold\n Lois McMaster Bujold has won the Hugo Award for Best Novel a record-tying four times: The Vor Game in 1991; Barrayar in 1992, which also won a Locus Award; Mirror Dance in 1995, which, again, also won a Locus Award; and Paladin of Souls in 2004, which also won a Nebula Award and a Locus Award.\n As notable as this is, making history is just one of many accolades Bujold has accrued over a decades-long career.\n Bujold started reading at a young age and dabbled in writing as early as junior high. Years later, seeing her friend Lillian Stewart Carl sell work, Bujold decided to make a serious effort of it. She brought her array of interests into her fiction: biology, ecology, and more. Her career as a novelist launched in 1986 with Baen Books publications Shards of Honor, The Warrior’s Apprentice, and Ethan of Athos. Her fourth novel, Falling Free, was originally serialized in four parts in Analog beginning December 1987, then republished by Baen in 1988. Falling Free won Bujold her first SFWA Nebula Award in 1989, by which time she’d already received a handful of other nods and nominations, including appearing on the Hugo ballot and Locus lists.\n Bujold has received sixteen Hugo nominations and seven wins, including receiving awards for Best Series for The Vorkosigan Saga in 2017 and World of the Five Gods in 2018; eight Nebula awards nominations and three wins; a slew of other wins and nominations, including foreign awards such as the Seiun; and most recently, Bujold was named the thirty-sixth Damon Knight Grand Master “for her contributions to the literature of Science Fiction and Fantasy” by the Science Fiction and Fantasy Writers of America.\n Your bio at The Bujold Nexus says you started reading adult science fiction at age nine. What were a few of the most memorable or most important genre works from your childhood or teens, and why?\n You do realize that was fifty to sixty years ago . . . ?\n That said, I probably remember the books I read better than I remember most of my schoolteachers. Sadly for them.\n In the sixties, which is the decade we’re mostly talking about here, I was mainly getting my SF from Analog and the school and public libraries. So, among the writers back then whose tales I recall fondly are Eric Frank Russell, Poul Anderson, Randall Garrett, Zenna Henderson, Anne McCaffrey, James H. Schmitz, and Lloyd Biggle Jr., Roger Zelazny and the excellent Cordwainer Smith both came along a bit later, after I’d connected to local SF fandom in my early college years. If you want to extend the question to fantasy, Fritz Leiber, L. Sprague de Camp and Fletcher Pratt, and of course Tolkien.\n Heinlein, Clarke, and Asimov were unavoidable in that era, especially Heinlein’s juveniles, which I read when I was actually the intended target age. Clarke was possibly more alien to me when I was a kid for being British than for being SFnal. Asimov’s robot stories were my favorites of his.\n Are you still a voracious reader? What do you look for in stories or books, what is important for you in the things you enjoy reading? And what are some of your recent favorites?\n My reading has become annoyingly limited by aging-eye issues—macular pucker, mainly, which one can look up on Wikipedia. It’s an untreatable distortion of the retina that, effectively, turns lines of print into CAPTCHAs. To work around it, I painted the left lens of an old pair of reading glasses with black nail polish to mask my inferior left eye. (I painted the front side dark blue with silver sparkles, like a starry night sky.) I also use large print on my computer and tablet. So work-related reading gets first dibs on my endurance.\n I’ve been watching more TV to force an eye break; nonfiction vids that fill in for some of the nonfiction research reading (Great Courses live up to their name) and a great deal of anime and animation, which I’ve always liked, but now have vastly increased access to. This in turn has led back to reading more manga, also now far more accessible than it used to be, by preference e-manga on my tablet where it is big ’n bright. For whatever reason, I can read manga for a longer stretch than print or type, or maybe the works are just shorter, dunno. Anyway, the exploration has been fun. Japanese weird is nicely brain-bending.\n I first encountered anime in the eighties, btw, in convention film rooms where some rare bootlegged copy was shown to the fans by an earnest live narrator standing up beside the screen and translating on the fly. So, it’s not a recent interest.\n I’m not reading for my moral improvement anymore; I figure it’s all downhill from here. In life’s literary banquet, I’ve moved on to the dessert course. So, for my leisure reading I avoid dystopias, horror, crime, true crime, and other downer content. (I acquired my lifetime fill of giant fighting robots early in my anime explorations, but that’s another medium.) A large enough audience seems to eat that stuff up with a spoon, I doubt my opting out is going to affect its market share.\n I like random things in all sorts of genres, but the one thing I most seem to require is not so much overt humor, but that the author possesses a sense of humor or at least kindness in there somewhere, on some level. For me these days reading feels less like entering another world than like entering another writer’s head. I want to be visiting in a congenial headspace, as it were.\n Writers who work for me that I’ve discovered recently—that is, since the turn of the millennium—include Megan Whalen Turner, Ben Aaronovitch, and T. Kingfisher, among others. Caitlin Doughty was a pretty extraordinary recent find (Smoke Gets In Your Eyes: and Other Lessons from the Crematory, 2014) but that’s memoir, not genre fiction.\n I’ve been leaving little reviews of some of my reading on my Goodreads site for a while, because they have a function that makes it easy. It’s interesting, looking back over several years of accumulation, how many things I read that I’ve forgotten. Books that make me remember them—ah, that is to say, in a good way—are the valued minority.\n What are some of your favorite anime shows, and what do you like most about them?\n For TV series, Mushi-shi; for feature films, the late Satoshi Kon’s Paprika.\n Both are about realistic grown-ups, if not realistic situations, a refreshing change in a medium that tends to be largely aimed at middle school students. Mushi-shi is subtle, beautiful, brilliant, and hard to describe, but its big draw is its main character Ginko, a wandering medicine seller and naturalist who deals with supernatural problems generated by his mysterious subject of study, magical sub-life-forms dubbed mushi. Paprika has more of an ensemble cast of science types working together to solve the surreal problems generated by their hijacked medical device prototype, and, in a medium full of dire characterizations of females (to be fair, of males as well), one of the best heroines ever.\n There follows a list too long to describe, even though I actually like only a tiny fraction of the works now out there. Viewer beware; some anime runs off the rails with filler episodes or false truncations when their parent manga goes on without them, and the viewer needs to switch over to the manga to try to figure out what the hell the story was actually supposed to be. In no particular order: Cells at Work! and its sequel Cells at Work! Code Black; Tsubasa: Reservoir Chronicle and its braided series xxxHolic; Pandora Hearts; Saiyuki (and sequels, but oh dear the filler episodes are bad, so adding the manga is advised); Natsume’s Book of Friends; Natsuyuki Rendezvous; Bleach in parts; The Morose Mononokean; Midnight Occult Civil Servants; The Case Files of Jeweler Richard; Blue Exorcist; Goblin Cat and its sequel series Mononoke; Sekai Ichi Hatsukoi and siblings; feature films Your Name; Wolf Children; Tokyo Godfathers; Spirited Away; and the many many rest left as an exercise for the student of cognitive torsion. (Brain-bending, aka WTF!Japan.)\n In your 2012 Locus interview you said, “Characters almost always come first. Then the world assembles itself around them.” Who are some of your favorite or most interesting characters from your work, and why?\n It would seem logical that the characters most of interest to me should be the ones I visited over and over, series protagonists. But that is not quite the case. Some characters who have thoroughly gripped me nonetheless had only one tale to tell, such as Cazaril or Ista, or even trailing Ingrey who gets such short shrift, from the Chalion/World of the Five Gods books. Their lives may go on, but their book-worthy spiritual journey is done, accomplished.\n (I’ve recently decided to dub that a trio of books, rather than a trilogy, to try to redirect readers attempting to process them as one continuous tale and then being very confused. The Sharing Knife books would definitely be a trilogy in this latter sense, if there weren’t four of them, thus acquiring the awkward label “tetralogy”.)\n Other characters, such as Miles or Penric, are protean enough to fit into more than one kind of story, in a more picaresque or free-form mode. Their spiritual journeys are ongoing, more easily broken up into smaller steps, stumbles, and side trips.\n Your first publication was short story “Barter” to Rod Serling’s The Twilight Zone Magazine, in the March-April 1985 issue, and you’ve landed on awards ballots with your short fiction. Are you as comfortable writing at short story length and novel length? Do you find one or the other more challenging? And does your writing process change in any significant way depending on the length or format?\n I actually haven’t written a short story since I was trying to break in during the mid-eighties. I’m way out of practice for the length. Short stories, I feel, work by delivering ideas, that quick intellectual hit. Novel-length works can be more character-centered-and-driven. Novellas are a different beast than short stories, closer to novels I think, or at least I classify them so; long enough to explore characters as well as ideas, or at least ideas through characters. So, for me novellas are like novels on speed, rather than like padded short stories.\n My writing process really doesn’t change between novels and novellas. I still piece my tale together scene-by-scene, and all the writing mechanics are identical. I just get to escape sooner.\n You have a huge amount of work out. Did you ever hit a career slump or a writing slump, where you struggled to sell or produce work?\n Once past the first three dire years spent breaking in, selling has not been an issue for me, at least not at the slow speed and long lengths that I write. Writing slumps and snags have occurred for a variety of reasons, some quite standard life-event-related: medical issues or surgeries, death, divorce, house moves, and so forth.\n I was once blocked for nine weird months on what proved to be a process snag; I’d attempted to work on two novels at once, for two different publishers, and found I couldn’t move forward on either one. (Also impeded by menopause and an ill-considered attempt to just suffer through it like women are now supposed to—when I pried my estrogen back from the medical establishment, brain function improved.) I finally picked one novel, mentally shelved the other, and was able to write again.\n Gentleman Jole and the Red Queen, for all that it was not a long work, also suffered a long break in the middle—house move and spine surgery and sales doubts and internal-to-the narrative issues all piled atop each other, no wonder. But it came around in the end.\n You were recently named SFWA Grand Master. In the official press release, SFWA president Mary Robinette Kowal said of you, “Importantly, she also serves as a role model for many writers, including me.” Looking at your career and your work, what are some of the most important things other writers (new, established, or both) can take away as lessons, examples, or advice?\n I really have no idea. My experiences at breaking in (sounds like a crime caper!) to publishing are decades out of date for new writers now. Looking back, what I think I’ve always been writing, regardless of genre or length or marketing, have been Bujold books. So, I guess my most general advice would be, “Write your own stories, the ones that matter to you.” Which sounds pretty inevitable to me. I mean, it’s not as though I have another brain to write out of, just this 1949 model. I can’t trade it in on a new one, so I just have to keep patching, repairing, and repainting. Which makes me wonder if I can get it historical plates, but maybe that’s what the Grand Master honor is.\n In 1986 Shards of Honor, The Warrior’s Apprentice, and Ethan of Athos came out. Over thirty years later you have new editions coming out, and you’re a SFWA Grand Master. What does it take to stay in the game, to sell books/stories, and still remain part of the genre conversation over such a span of time?\n I would quip, “Desperation? Being otherwise unemployable? Running out of money?” except I’m rather comfortably semiretired but still can’t seem to stop generating stories, just more slowly. I’ve only partly joked that I suspect fiction writing is actually a dissociative disorder, and if only we were on the right meds, we’d all stop.\n Which may not be a joke at all; I was on a medication last fall for back issues that flatlined my creativity for months. It gave me strong motivation to develop other coping methods for the back pain, which I did manage, and soon after I discontinued it my normal-for-Lois brain came back online, to my relief.\n Staying in the game I take to mean staying published, which, again, is a task that’s changed a lot over the past three decades and is going to keep changing. It’s also something that’s not wholly under the control of the writer; it takes faithful editors, publishers, and agents who will support one’s work over a long haul, and I was very fortunate to have these. And, of course, e-publishing has been a game changer, one I’ve watched and been part of from before its beginnings to now.\n Writers are buried in an avalanche of distracting advice on self-marketing, which I think mistakes our job. Our job is to write stories, and the best thing one can do for one’s sales is to write more stuff. They’ve just now removed the feature, but Amazon used to have a “sales ranking” graph that gave at least a broad picture of an author’s sales over time. Periodically releasing new works left a track on mine like a heartbeat monitor, pulse after pulse. Nothing else, no PR efforts, ever did that. Long stretches between new works, and the graph slowly and inexorably went down.\n Do you feel like the SFF industry, market, or community has changed in any significant or important ways over those years? Are there any specific things you would like to see happen in the community or in the genre?\n To answer the second question first, I am not in charge of this circus, and I am so glad. I will be over here writing Bujold stories, thanks. The rest of you can do whatever you want.\n The changes over the course of my career have been many, partly market-driven (the vagaries of paperback distribution and the returns system, ferex) but mainly technology-driven—though paperbacks are a technology, too, so maybe that distinction is moot. The audiobooks market was remade by the arrival of audio downloads, making room for many more and more kinds of books—like mine, formerly too niche to be stocked on limited physical bookstore shelves. I have, of course, lived through and participated in the entire development of ebooks, from SFnal dream to early, clumsy efforts through the Kindle revolution. (Ben Bova’s 1990 satire Cyberbooks was so prescient about that. I can’t help wondering if Jeff Bezos read it.)\n I talked about this in my 2008 Denvention Worldcon GoH speech, but to briefly recap, I don’t see science fiction as being a platonic ideal toward which all works and writers should convergently aspire. I see it as a tapestry of many individual writers’ threads which, taken together, give the illusion of a picture. I only spin my own thread. “The genre” is an emergent property of all this shifting substrate. All those madly flapping, or typing, butterflies, and weird temporary feedback loops, seething around like those arcs that spurt off the surface of the sun and fall back. Not under anyone’s control.\n A little more kindness and charity to each other wouldn’t hurt, but that’s true of all communities, not just this one. We may all be geeks raised by wolves, or at least by books, but brain-to-mouth filters and business etiquette can be learned. Fortunately for me.\n Several novellas originally published by Spectrum Literary are seeing life in new editions. Penric’s Progress came out in January 2020 from Baen, the omnibus of novellas Penric’s Demon, Penric and the Shaman, and Penric’s Fox. Omnibus Penric’s Travels is due in May, and an edition of The Orphans of Raspay (2019) is scheduled for June 2020 publication from Subterranean Press. What is the most important thing about these stories to you, and what’s the most fun thing about them?\n I talk in my introduction to Penric’s Progress about the pleasures and advantages of the novella form and length. Possibly the most important thing to me about these tales is that they have been fun. On the business side, the fact that I was writing them as à la carte original ebooks, with no contracts, deadlines, schedule, or set plan, was very freeing. (Spectrum, incidentally, is my literary agency. I self-e-publish more through than by them, but the folks there are a huge help to me in managing the mechanics and the business side, including the knock-on subrights sales in audiobooks, the paper reprints, and foreign rights.)\n The same freedom applies to the e-novellas’ content. Penric—and his resident demon Desdemona, since they come as an unbreakable set—are as I mentioned protean characters, capable of being in many kinds of stories. Like other chaos demons, I am easily bored; my interests, knowledge, and psychological mood change from year to year, and these shorter stories can change along with them. Even to things that aren’t Pen & Des stories at all, which I see you ask about next.\n Knife Children also had a recent Subterranean edition in February, a blend of the fantastic and the domestic, of mystery and familial drama. What, for you, are the best aspects or elements of this story?\n Barr and Lily’s tale was a story idea that rooted in my brain way back when I wrote the epilogue to the The Sharing Knife tetralogy’s final volume, Horizon, where Barr’s illegitimate-child dilemma first came to light for both him and me. The last gasp of a sixteen hundred-page fantasy epic, or anti-epic, was no place to start exploring it, but Barr had proved one of the more interesting secondary characters of the tale to me. He had the most unexpected growth as a person, admittedly because he started at such a low level, being a self-centered and thoughtless youth skating by on his obnoxious charm. He may be an exemplar of one of Heinlein’s story categories, “The Man Who Learns Better.” I wanted to watch him tussle with his karma over the kind of time span that blunders like his really earn.\n It was also a redemption story, which, I have long known by some of my favorite characters from other fiction and including my own, seems to be my jam. I am a sucker for redemption stories, apparently, but only if they feel authentic. I don’t care for fake redemption, where the narrative retreats from whatever initial sin it has set up by revealing at the end some equivalent to “But it’s all right! Assuage your guilt, Angstyman! That person was already dead/evil when you set the house on fire!” or whatever.\n Sticking to one’s authorial guns on this aspect risks offering a character that some readers will find insurmountably unsympathetic. They don’t, in that case, want a redemption story; they want a vicarious revenge story, to see the sinner not redeemed but punished by the narrative, cosmic justice. “My name is Inigo Montoya . . . ” Which can also be a thing to write, and I have—consider the lurid fate of Ges Vorrutyer—but it wasn’t Barr and Lily’s story.\n Not that Barr wasn’t fun to torment in his own way, as he struggled with his chicken coming home to roost. But in a genre often full of teenagers having teenage problems, I wanted to watch a character grapple with grown-up issues. Just exactly how does one step up to that plate? Show me, Barr. For the other side of that generational tug-of-war, I simultaneously had his fourteen-year-old daughter Lily and her own supply of sharply real troubles, soon shared with her inexperienced parent.\n Do you feel like a story can just be a fun story? Is it important for fiction to challenge the reader and ask questions? Are there themes and ideas in your fiction that stand out as more important to you, or about which you feel passionate?\n I covered my tastes in redemption themes above. My other large interest is biology in all its aspects which, actually, has been a hard science for quite some time, though a few readers seem oddly tone-deaf to this. I once, not joking nearly as much as it looked, defined the romance genre as a subset of science fiction devoted to tales of the promulgation of human evolution through sexual selection. Physics is not the only fruit, folks.\n A lot of the work of our own human biology at ground level—life-maintenance tasks, children, relationships, family creation—has been shuffled off into a box falsely labeled “women’s work.” (Or, as I think of it, “Keeping people alive.”) But a large part of SF tends to be about self-actualization, about the serious adolescent task of splitting off from the family and acquiring adult status. This tends to find itself in psychological conflict with the foregoing, as if an individual could not become an empowered adult except by escaping all that. (For people in more toxic families, this is actually true.) Making these two immiscible aspects work together in the same story requires shaking the bottle really hard.\n Certainly, a story can be a fun story. It can also be a fun story and more. A story can be anything. Whether the readers who encounter it will like what it does is a separate question, without a singular answer. Though if a person is dead serious about grappling with the real world’s challenges and questions, I’d point them to the nonfiction section as more directly useful to the task. (With the caveat that a lot of nonfiction isn’t nearly as nonfictional as it’s labeled.)\n Fiction . . . is doing a different job. Why the hell our brains evolved to do such a bizarre thing is another question, and one I’d love to see answered. Creating pictures in one another’s heads through language to convey useful survival information, sure, not hard to see why that would be favored. Hijacking that function and using it to make art, to tickle each other’s emotions? Much more mysterious.\n Imaginative play seems universal in children. One theory is that it’s cognitive practice for later grown-up tasks, but it’s hard to see where, “Let’s all pretend to be ponies! I’ll race you! Now let’s be flying ponies!” fits into this.\n Comments on fiction that make it sound as if its function is to fix its readers always make me uncomfortable. I channel Tolkien’s cogent remark on the difference between allegory, which he cordially detested, and applicability: “I think that many confuse ‘applicability’ with ‘allegory’; but the one resides in the freedom of the reader, and the other in the purposed domination of the author.” If folks find my stories applicable, that’s fine. I would also observe that applicability has a much longer shelf life.\n Me, I’ll be over here with the flying ponies.\n As someone who plays in various genres successfully and blends genres to the delight of readers, do you feel like genre definitions are important and useful? Does genre fiction do something or operate in some specific way that “mainstream” or “literary” fiction does not?\n Well, I consider mainstream fiction to be another genre, and, like SFF, it contains a vast range of story types. So, anything one says about either is bound to be wrong somewhere.\n It’s a figure-ground problem. Given an undifferentiated sea of, well, anything, but let’s say books, as soon as you pick out one part and label it a Thing, you have created a Not-Thing out of the rest. The literary genre was first created as a concept by the extraction of all the other genres or kinds of books in its sea. Like a splitting amoeba, it then reformed its own boundaries to defend the life within.\n (Also, as soon as you have two or more of anything, humans will start trying to rank them by status and align themselves with the higher side and/or decide which side is theirs and try to put it on top. Whether it makes any damn sense or not. You can’t stop them. Which is better, red or green? Any sentences with the words “better” or “best” in them are meaningless unless they also include the information, “Better for what?” But that’s another rant.)\n That said, as soon as there came to be more books than any reader could sort through, there needed to be guiding categorizations to speed selection. The categories we ended up with are rather arbitrary historical artifacts, as one can see by looking at an alternate scheme that has evolved over in fanfiction. There is no commercial bookstore shelf labeled “angst” or “hurt-comfort” or “character death” or “slow burn” or “smut” or “fluff” (or “fluffy smut”). These are categories that sort by emotion, interestingly, and are no less helpful to their users than “romance,” “thriller,” “travel,” or “cookbooks.”\n So, briefly, genre boundaries are useful as a guide or a doorway, not so useful as a wall. Granted, if a writer does not like the wall, they can just paint a doorway on it and march through. It was an imaginary wall to start with, and there really aren’t any genre police out there to stop you.\n Functionally, from the creators’ side, I’ve defined a genre as “any group of works in close conversation with one another.” This includes a great deal of sharing and swapping of tropes, an enthusiastically communal toolbox, not because the creators can’t be original, but because they love this stuff. It’s why they’re here in the first place. The conversation’s boundaries are wildly permeable, though, with ideas constantly being imported from the larger world according to each writer’s experiences. Alive, moving, breathing, changing, growing, evolving—it’s all very organic. Genres can also die, and end up in sort of taxidermic museum displays.\n You are known to do a lot of research for your fiction. What are a few of your favorite deeply researched concepts you’ve used in your science fiction?\n Hm. “What I know and how I know it” falls roughly into two parts. There’s all the knowledge I accreted just by living my life in the world, or learned from following up on random impulses of curiosity, with no particular use in mind. This has gradually turned into a rather large bag of potential material, easy to reach into and grab from. Then there is more directed collecting, when I have a particular story in mind and need details.\n Speaking of modernity, Internet resources have made an enormous difference in the ease with which these may be acquired. Back in the day, I needed to seek out big unwieldy nonfiction books—everything from Cunningham’s Textbook of Anatomy to Space Physiology and Medicine to Terraforming to an 1882 edition, in three volumes, of Prescott’s 1837 history Ferdinand and Isabella—or telephone NASA physicians, or write to engineers. Now I can just Google something like “Roman army fort design” and have more than I could possibly use delivered, all collated, right to the screen in front of my eyes.\n I’m not sure if this is good or bad, but having done it the hard way I think at least makes me more conscious of potential pitfalls in material acquired with such ease, better able to judge it. Fortunately, I don’t think anyone has ever died (directly) from reading a bad novel, so my duty of care has a limit.\n Just as a single illustration, my design for uterine replicators as detailed at the beginning of Ethan of Athos (1986) and elsewhere in my series was actually closely researched, both directly by visits to that anatomy text, and inadvertently by actually giving birth to kids. In concept, in terms of the science involved, the design would work. The rest is engineering details . . .\n What else are you working on now, and what do you have coming up that you can tell us about?\n Well, I did have that several-month involuntary break last fall, so build that into any timeline for expectations. The two Penric collections Baen just did were so pretty, I want to have another, but that will require writing two more Penric novellas to go with the stray The Orphans of Raspay, which is going to take a while. So, nothing to report at this time.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}