{"fingerprint": "AEOkux2Wy7Eehz6hZdU91y/SOI8=", "sitename": "Clarkesworld Magazine", "title": "Testing What They're Made of: A Conversation with Lois McMaster Bujold by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bujold_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Testing What They're Made of: A Conversation with Lois McMaster Bujold by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Testing What They're Made of: A Conversation with Lois McMaster Bujold\n Miles Vorkosigan is back. He's been around, here and there, for the last few years, but with the release last month of Cryoburn he's really back. It's been a while, definitely. His story could've ended with A Civil Campaign or with Diplomatic Immunity. But, for now, he's back and death is on his mind.\n Miles Vorkosigan's creator, Lois McMaster Bujold, is very much alive and on the brink of yet another career reinvention, detour, or leap of faith. Bujold has been publishing novels for a quarter of a century now. In 1985, she sold her first three novels — completed manuscripts all, not proposals — in one fateful sale to Baen Books. Since then her bibliography has grown to include more than 30 books (including omnibus editions) of science fiction and fantasy.\n Bujold has been nominated for and won just about every major speculative fiction award, often more than once. For all the laurels, Bujold remains a fan's writer, a reader's writer. \"To me,\" said Bujold, \"the value of fiction is in the joy it brings to its readers, for all the varied values of joy — and of readers — that one can imagine.\"\n Bujold is best known for the Vorkosigan Saga, which features Cordelia Naismith and, later in the chronology, Naismith's son, Miles Vorkosigan. Vorkosigan is a dashing, complicated figure, short in stature, big in personality. He is quick of wit and somewhat hyperactive. When assassins failed to kill a pregnant Naismith, Vorkosigan was poisoned in utero, resulting in a bone disorder that has left his spine crooked and skeleton brittle. He is both frail and larger than life, endearing and annoying — the perfect protagonist for sweeping, character-based space opera — a brat, conman, (sort of) soldier, outlaw, commander, ambassador, entrepreneur...\n Vorkosigan is, as Bujold says below, \"a character with a lot of potential scope.\" And characterization is Bujold's strong suit.\n Bujold writes \"about characters on spiritual journeys through their lives. The SF (or the fantasy, or the speculative theology) is just there to give them interesting challenges, to test what they are made of. Plots and settings explore characters as much as the other way around.\"\n Bujold has lived a life of reading, travelling, studying and, of course, writing — a life doing what she loves to do, testing herself and what she's made of.\n And what does she enjoy about writing?\n \"I enjoy the writing when it is going well, when the ideas and images are boiling up as fast as I can write them down,\" she said.\n Below, Bujold and I talk about how things have changed, how they stay the same, and what the future holds.\n You've been publishing since 1985. In nearly three decades of publishing, what changes have caught you off guard? Pleasantly surprised you? Has the business side of writing ever made you want to give up?\n I am a shy person when allowed. I regard a lot of the PR — book tours, speeches, appearances, media interviews — with much the same dismay as a non-swimming parent would contemplate the prospect of jumping into a raging torrent to rescue their child. One doesn't really see how any good can come of it, but one can't not jump. (\"My baby book, help, it is drowning!\") I need to get in touch with my surly side more, I suppose, to learn to say \"no\" to nice people who like me.\n I have certainly been pleasantly surprised by the burgeoning of the audiobooks market, which is entirely tech-driven. It has gone from very constricted distribution of bulky and awkward physical media, to essentially unlimited distribution through MP3 downloads over the Internet, which people load up on their iPods or whatever and take along everywhere. Blackstone Audiobooks has brought all of my titles, both fantasy and SF, into availability, and has been producing more royalties in the past couple of years than my backlist paper book sales (but see below), nearly all sold as downloads through their partner Audible.com and other on-line outlets.\n At the same time, the independent distributor implosion of the mid-90's, the increase in the number of competing titles, and the rise of e-book sales have been nibbling away at mass market paperback sales, which are down from even a few years ago, and way down from a few decades ago.\n The business side of writing has been good to me — without ever achieving the highly visible sales spikes of the most famous bestselling writers, I have nonetheless managed to sell a startling number of books spread stealthily over the past quarter-century. Baen, in their latest PR, claims to have sold over two million of my books, and that's not counting the fantasies from Eos/HarperCollins, e-books, audiobooks, or foreign translations, now up to twenty languages. Some of those latter markets are really tiny, but they do add up.\n Fred Pohl once remarked to me, almost twenty years ago: \"The good news about a writing career is that the sales curve is asymptotic. The bad news is that it starts at zero.\" I certainly experienced the long, shallow left-hand slope in the 80's and early 90's. (In my first three years of writing, from late 1982 to late 1985, in which I wrote three novels, I made a grand total of $250.) We'll see if he's right about that right-hand rise...\n What are some of the things you learned from Jim Baen? Did you ever disagree? What footprints did he leave in the Miles Vorkosigan universe?\n Jim, very patiently and bit-by-bit, taught me a lot about the business of writing, about which I knew almost nothing when I started, talking me down off the ledge of my newbie-writer paranoias. He told me once that from his point of view I only budged about half an inch, when being edited.\n Jim would have liked, I suspect, if I had written the Vorkosiverse as the continuing military adventures of Mercenary Admiral Naismith. (The novella \"The Mountains of Mourning\" was written by me, in part, to settle the question of whether the banner on the front covers should read \"A Miles Naismith Adventure\" or \"A Miles Vorkosigan Adventure\".) To Jim's credit, he took what he got instead in pretty good humor, though I suppose the awards helped. He never did love Mirror Dance, or Miles's clone-brother Mark, I thought, though when I turned in the 167,000 word draft, he manfully said, \"We'll find the paper somehow.\" Squirming a bit, he did try to talk me into making Mark muscular instead of fat, in the first draft; I thought that missed the point of Mark's essential transgressive qualities. Baen never did put on the paperback cover the fact that the book had won a Hugo (my third for best novel), but that may have been an oversight.\n Jim also once told me, when I was whinging about my books not selling as well as someone else's (a favorite pastime among writers, alas — we are a green-eyed bunch) that my books were \"too smart\" to be bestsellers. To this day, I don't know if he meant that sincerely, or if it was just a very sly way to get himself off the hook. Like I'm going to argue...?\n How much outlining or preplanning did you do for the Sharing Knife series? Did it change much as you wrote it? What were the challenges (and joys) of making the transition from an interstellar future to a pre-industrial past?\n The story really began with a very simple, classic, soldier-meets-girl seed crystal. The decision to use a Midwest-American-frontier-inspired background instead of the default European medieval, and for the sharing knives, both symbol and technology of sacrifice, created the beginnings of the backdrop, which as usual grew in detail and implication — and consequence — as I wrote.\n There were snags and pauses, also as usual, but no real dead ends. Each pair of books came with an inherent shape built in, though the details of what should fill that shape were a constant surprise. Most of my false starts and wrong turns were fixed in the outline stage, when it's cheap and easy, which is why I use a constantly-mutating rolling outline the way I do.\n I wrote what became the first two volumes of the tetralogy as one volume, split subsequently for publisher-economic reasons; Beguilement and Legacy really should be stacked up and read as one book. The second pair, Passage and Horizon, had a brief period at the beginning where I thought they might be one fat book, making a trilogy, but they split early on — into \"There\" and \"Back Again\" — and their events are more naturally rounded as a result.\n I loved the chance to get outdoors, at least in my imagination, with all of these books, and of course relished being able to incorporate the landscapes and lake experiences of my lost Ohio childhood. Not to mention the old river lore passed down by my father, who loved the great river system of the region going back to his own childhood with his father on the Allegheny River near Pittsburgh. Three generations of love of the muddy Midwest waters, moving or still.\n How do you sustain a character like Miles Vorkosigan over so many books and stories?\n Well, it certainly helps to have a character with a lot of potential scope, who can act in many different sorts of stories. Plot and character are closely intertwined, and create each other. The two elements have to coordinate — the classic example being, if you dropped Othello and Hamlet down in each other's plots (or Bertie Wooster down in either's), in no case would you get a 5-act tragedy. Othello would run the wicked uncle through no later than Act Two, and Hamlet might well dither around and dither around until he established Desdemona's innocence. Not sure what Bertie would do, though the prospect does invite wonder...\n Miles can do adventure, mystery, occasionally romance, comedy or tragedy. He can't do women's issues, and he's not terribly good at humility, nor deep spirituality. (Although he did a bravura job on abject, once.) Hence the need for Cordelia, Ekaterin, Ista, Cazaril, and so on.\n The fact that Miles grows and changes over time means that neither of us has to get bored.\n In the recent CryoBurn, you've returned to a Miles Vorkosigan novel after a few years away. Did you miss Miles? Had he changed much while you were apart?\n He and I have both aged a comparable amount, I think. I would have been content to leave him with his well-earned happy ending at the close of A Civil Campaign. I did manage to find a second organic series-closure with Diplomatic Immunity. CryoBurn brought us both face to face with some issues of aging and mortality I had spent seven books ducking — in a sense, the whole of CryoBurn is an extended meditation on death, thematically speaking, but I think we were both ready to grapple with that at last.\n I was surprised at how fast his \"voice\" came back to me, I must say. Practice, I suppose.\n The drabbles were written to stick a sock in the outcry for an immediate sequel right then that I actually don't want to write ever, and to prevent fannish speculation from galloping off in all directions. And because they were a kick to do — all that concentrated story folded into such a small space, like literary origami. Five small spaces, I suppose, like the fingers of the hand or the gods of Chalion.\n I must mention, the first hardcover printing of CryoBurn contains, bound in the back, a CD-ROM with a dozen of my prior series books as various open-format e-texts, starting with Cordelia's Honor, including the e-text for CryoBurn itself, essays and interviews, and other fun tidbits. About the only things missing are Memory and The Vorkosigan Companion, both left out by accident in the scramble last spring when the table of contents was being put together. I figure it will give us something else to include should I ever do another book with Baen with this value-added feature.\n What are you working on now and what's next?\n Last winter I got on a strange, abrupt roll and started a book for Ivan (Lord Vorpatril, a long-running secondary character in the Vorkosigan series, to those not already on a first-name basis with him), probably as the result of the accumulated power of fannish suggestion. It went well for a couple of months, but derailed when I went out of town and then plunged into some long-overdue and disruptive house maintenance projects in the Spring. These dragged on, as construction generally does, until overtaken by the unexpected extension of book launch madness season for CryoBurn — I'd been expecting the noise to start up in November, and last about three weeks, but between the release of the e-ARC at the beginning of August and the shifting forward of the release date to October 19th, it looks to occupy three months, first to last. We'll see what happens with the writing when I finally get my life and brain back in mid-November. No contract yet, so no deadline pressure, which I prefer just now. Nonetheless, there are too many chapters to abandon, so Ivan'll have to be brought up to scratch before I can involve myself in any other novel-length project. There are, so to speak, special challenges in making a dedicated slacker the hero of one's supposed action-adventure novel. I'm feeling more and more on Ivan's side about that, personally.\n Notions for the last two Chalion books have been rattling around in my head for years, but neither has reached critical mass yet. It feels like it's about time to remake myself as a writer yet again, think of something new and unexpected, but really, the pleasures of slacking loom ever larger.\n I've been wondering what the heck retirement means for a writer. At the end of a long career, I can at last... stay home and write books? Puzzling. I have been more-or-less retiring piecemeal, dropping chores or outgrowing life-phases. Right now I have two part-time jobs, one as a writer, the other as a writer's secretary/bookkeeper/housekeeper/publicity manager. I think the next thing I would like to retire from is being an author — all those time-consuming PR chores that were an exciting challenge once, but are now more of an energy drain than an energy boost. I mean, they are all very well, but they aren't writing. Or slacking, for that matter.\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}