{"fingerprint": "a4icpVmBJ3c+Xn6pbNz9GVqAghU=", "sitename": "Clarkesworld Magazine", "title": "They Have All One Breath by Karl Bunker", "author": "Karl Bunker", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/bunker_01_19_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: They Have All One Breath by Karl Bunker", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "12420 words, novelette, REPRINT\nThey Have All One Breath\nA passing streetcar noticed me on the sidewalk. It slowed to a stop, opening its door and dinging its bell to invite me on board. I ignored it, preferring to walk. It was hours before dawn, early to be heading home by the standards of some, but I’d had enough club-hopping for one night. My skull, my brain, my body were all still vibrating with echoes of the evening’s music. It was a good feeling, but I wanted to get home and put in a few hours of work before crashing. I was walking down Boylston Street, enjoying the cool evening air.\nThere was a loose crowd filling the little plaza at Copley Square. As I walked past, a tall, thin figure separated himself from the rest and called out to me: “James! Hey James, Maestro James!” He laughed, dancing up to me on the balls of his feet.\n“How goes it, Ivan?”\n“Goes good, confrere.” He fell into step beside me, then lifted his hand and pointed straight up. “The sky is busy tonight. I don’t suppose you’ve noticed, walking along with your nose scraping the ground the way you do.”\nI looked up. He was right. White and blue sparklers were winking on and off in a dozen places, and three separate shimmery threads stretched across random patches of the sky.\nIvan hooked his thumb in the direction of the crowd now behind us. “It’s got this pack spooked. They think the AIs are putting the finishing touches on a starship, and any second now they’re going to fly away, leaving us poor miserables to fend for ourselves.”\nI grunted, still watching the sky. One of the big orbiters had scrolled into view, its X shape visible as it crept along.\n“Kind of like in that E. M. Forster story,” Ivan said. “‘The Machine Stops.’ Have you read it?”\n“Yeah.” Lisa had given me a copy of the story; Forster was responding to what he saw as the naïve optimism H. G. Wells expressed in some of his science-exalting utopian fiction. In Forster’s dystopia people live in hive-like underground dwellings, cared for by a great machine that provides them with everything. They rarely have any physical contact with other people, rarely travel or even leave their rooms. They sit and watch entertainments, talk via videophone, eat machine-produced food, breathe machine-produced air. Many of them have come to worship the machine as a kind of god. (“O Machine! O Machine!”)\n“That’s what they’re afraid of—that the machine will stop,” Ivan was saying. “And then where will we be? No more freebies, no more zaps to keep us all behaving like good boys and girls. All the bad old stuff of the bad old days will come back again.” He turned and walked backward for a few steps, looking back at the people filling the square. “Some people just like to fret. About what the AIs have done, about what they’ll do next, or this bunch—fretting that they’ll stop doing anything.”\n“The Machine,” I pondered aloud. People have never been able to settle on a good name for the whatever-it-is that runs the world now. “The AIs” is an awkward mouthful. And should we properly be calling it/them “the AIs,” plural, or “the AI,” singular? Nobody knows. Some like using the term “the I’s” for short, which of course has a handily appropriate homophone. But usually people just talk about “they” and “them.” They did this, they ought to do that, they won’t do this other thing. They’ve been making it rain too much. I wish they’d move me to a bigger house. I can’t believe they zapped me—I wasn’t really going to hit her. They they they they. “The machines” is what Lisa used to call them. “The Machine,” dressed up in singular and capitals, has a nice ring to it, too.\nIvan got ahead of me and started walking halfway backward, bending his knees to get his face into my field of vision. I guess I was staring down at the ground again. “Where are you headed, James? Home to the salt mines?”\n“Yeah, home,” I said. “Maybe get some work done.”\n“Ah . . . work.” He turned to face in the direction he was walking. There was an extra bounce in the rhythm of his steps, like there was too much energy in him for the act of walking to contain. People who don’t know Ivan want to know what kind of drugs he’s using and where they can get some. But it’s all just him, just the way he is. He’s a man who looks like he’s all crackling hyperactive surface charge, but who in fact has more depth and inner stillness than anyone I know. “I should do me some of that ‘work’ stuff myself,” he said. “I’ve got an idea for a mural, and there’s a restaurant in Oak Square that’s talking about letting me do a couple of walls, one inside and one exterior.” He scanned the space around us until his gaze settled on a curbside tree. “I’m thinking something natural. Old nature, from back when it was scary.”\n“Red in tooth and claw,” I said.\nWhen I was about ten years old, my mother had a job that was walking distance from where we lived. Her walk to work took her past a park with a pond that was home to a population of ducks, and as winter came on some of these ducks chose not to fly south. It was a typical New England winter, with the temperature fluctuating randomly between mild and brutally cold. On one of the colder mornings, my mother decided that the ducks, now huddled together on a small part of the pond that remained unfrozen, must be hungry. And so from that day on she began bringing food for the ducks on her morning walk to work. First it was a few slices of bread, then a half-loaf, then a whole loaf, then a concoction of bread, cheap peanut butter, and lard that she would mix up by the gallon every evening. Naturally, ducks greeted her in greater and greater numbers every morning, and to my mother’s eye at least, ate with greater and greater frenzy and desperation.\nOne day she came home with her right hand raw and red, the tips of three fingers bandaged. She’d given herself a case of frostbite by scooping the gooey duck food out with her bare hand in sub-zero weather. She sat at the kitchen table, crying as my father gently re-bandaged her fingers. Her tears weren’t from the pain, but over the plight of “her” ducks. My father began to argue with her, using his calm, captain-of-the-debating-team tone that my mother and I alternately admired and loathed, depending on whether it was directed at us. “This is crazy, Ann. You’re killing yourself over a few birds that were too stupid to fly south when they should have. And as long as you keep feeding them, they never will fly south. And there’s just going to be more and more of them . . . ” And on he went, softly logical and reasonable. I saw my mother’s face hardening with anger and saw my father being oblivious to this. Knowing that an explosion was coming, I retreated to my room.\nI didn’t have to wait long. First there was my father’s voice—too muffled to make out any words, but so recognizable in its stolid rationality—and then my mother’s ragged shout, interrupting him: “Natural? Why would I give a damn about what’s natural? Nature is a butcher! Nature is a goddamned butcher!” Next came the sound of my parents’ bedroom door being slammed.\nOf course. This was a recurring theme with my mother. She loved the beauty of nature, loved animals of any species, but always she saw ugliness behind the beauty. Every bird at our backyard feeder would remind her of how many chicks and fledglings died for each bird that survived to maturity. Every image of wildlife on television or the web would bring to her mind the bloody, rapacious cycle of predator and prey. The boundless, uncaring wastefulness of nature infuriated her. All through my childhood our home was an impromptu hospital, rehabilitation clinic, and long-term rest home for a host of rescued wild and domesticated animals. Orphaned fledgling birds and baby squirrels, starving semi-feral alley cats, and then the mice and birds rescued from the jaws of those same cats.\nA few moments after my mother’s tirade, my father came into my room and sat beside me on my bed, looking as shamefaced and apologetic as a scolded dog. He often came to me in situations like this. As poor a job as he often did of understanding her, I never questioned that he loved my mother with a helpless intensity. And when he had made her angry he would come to me, as if I were the closest replacement for her that he could find. “You’d think I’d know her better by now, eh, champ?” he said with a sad smile, resting a hand on my shoulder. Then we talked about trivialities for a while, my father ordered a take-out meal, and life went on.\nWhen Ivan and I arrived at our building, a squat little delivery bot was trundling up the outside steps with a stack of packages. Moving ahead of us, it opened the door to Ivan’s studio, deposited the boxes a few yards inside the door, and left again, silent on its padded treads. “Ah,” Ivan said, looking through the packages. “Every day is Christmas, eh? Canvas, stretchers, some tubes of color, and . . . ” he yanked open the top of one of the boxes, “yup; some genuine imitation AI-brand single malt scotch. Yum yum.” He pulled out a bottle and cocked it at an angle near his head. The label had the words “Scotch, Islay single malt (simulated)” printed over a nice photograph of (presumably) Scottish countryside. Nothing else. “Join me in a few, confrere?” Ivan asked.\nI dropped into one of Ivan’s hammock chairs while he flitted into the kitchen for glasses and ice. “You know what I hear?” he said when he came back, handing me a clinking tumbler. “Shanghai, man! That’s what I hear. People say great things are happening there. Really happening. Music, art, literature, movies . . . They say it’s wide open there. New ideas, new things, stuff like nobody’s done before, nobody’s thought of before. A real renaissance, happening right out on the streets! We should go, James. We should go!”\nI grunted noncommittally. Ivan had these flights of enthusiasm; a new one every few weeks, it seemed. A while ago he’d been reading about the Vorticists and Futurists of the early twentieth century, and had been wild to write an artist’s manifesto like theirs—one that would “encapsulate the role of the artist in a post-singularity world.” That had kept him busy for a month or two, and then there had been some vague but dangerous-sounding talk of performance art involving pyrotechnics, and after that he’d returned to painting with a deep dive into old-school realism and precise draftsmanship.\nIvan had been wandering around his studio as he drank, and now, standing at an open window, he said, “Hey, come look.” I weaved my way around a half-dozen or so unfinished canvasses on easels and went to him. He pointed down at the outer woodwork of the window. The building was old, with brick walls and weathered wooden trim around the windows. The wooden sill Ivan was pointing at was partly rotted at the corners, and busily at work in those rotted areas was a crew of micro-bots. Vaguely insect-like and about a quarter-inch long, they were the same grayish brown as the weathered wood. There were around ten or twenty of them crawling over the sill, some making their way to one of the rotted voids in the wood and squirting out dollops of resinous material. Others were engaged in chewing away bits of rotten wood, using ant-like pincer jaws.\nIvan reached out and picked up one of the chewer bots, first holding it between thumb and forefinger, and then letting it crawl over his hand. It moved with an unhurried purpose, eventually dropping off the side of his hand to the windowsill and rejoining its comrades. “You remember Louisiana a couple of years ago?” he said, still watching the little bots at work. “The governor and legislature were puffing up their chests about reintroducing a money-labor economy by making it illegal to accept any goods or services from ‘any artificial entity.’ Then it turned out that little mechanical bugs like these guys were swarming through both the statehouse and the governor’s mansion. They’d been rebuilding both from the inside out for months.”\nI reached out to the window myself, picking up one of the bots and holding it by the edges. It churned its legs for a moment and then went still as I held it close to my eyes. A memory of Lisa’s voice murmured into my ear, vicious and accusing: You love them. It makes me sick how much you love them.\nLisa appeared in my life right about the time of the world’s big tipping point. It was during the few days of the last war in the Middle East. The War That Wasn’t; the Fizzle War. I was in a club called The Overground, and the atmosphere was defiantly celebratory. The wall-sized screen behind the stage was showing multiple videos—scenes that have since become iconic, even clichéd and boring: tanks rolling off their own treads and belly-flopping onto the desert sand, soldiers trying to hold onto rifles that were falling to pieces in their hands, a missile spiraling crazily through the air before burying itself in the ground with the impotent thud of a dead fish. And from other parts of the world, scenes of refugee camps where swarms of flying bots were dropping ton after ton of food, clothing, shelter materials.\nNo one claimed ownership of these Good Samaritan cargo-bots, nor of the gremlinesque nanoes that were screwing up the mechanisms of war. It soon became known that these were machines built and run by other machines. It was becoming undeniably evident that something new was moving upon the face of the land. Indeed, that the world was being rebuilt around us, disassembled and reassembled under our feet. The AIs were taking over, and they were changing the rules.\nThe bands playing at The Overground that night had hastily cobbled together some new songs for the occasion. I remember one was “Slaves to the Metal Horde,” played to a bouncing dance tune and with silly lyrics about politicians and generals losing their jobs to automation and joining the vast ranks of the unemployed. “God 2.0” was another song; only a few vague and suggestive phrases for lyrics, but with a sly and sinister tune that made it a bonafide hit for a few months. It was during one of those songs that Lisa and I, both partnerless, eyed each other on the dance floor and fell into a face-to-face rhythm. She had a broad smile, a strong, graceful body, and a fondness for dancing with her hands behind her back. Her dancing consisted of lots of dips and hops and twisting her upper body to one side or the other. Often she would seem to be on the verge of throwing herself off-balance, but then she would smack a foot to the floor in flawless synchrony with the beat of the music, showing she had herself exactly where she meant to be. In height, her proportions were as close as my eye could measure to Polykleitos’ ideal, and she had lean breasts and a solid muscularity that suggested she had seriously applied herself to some sport in her student days.\nBut the real story of her beauty was in her face. It wasn’t the beauty of clinical perfection, but of personhood. There was a whole human being written out in the length of her nose, the curve of her jaw, the hard straightness of her eyebrows. And of course her eyes. They were eyes that were full of knowing humor and incisive smarts and even more full of absolutely no bullshit. Usually when I see a face as beautiful and interesting as hers, I set about memorizing it so I can sketch it later. I look and then look away, rebuild the lines, curves, shapes, and shadows of the face in my head, then look again to check my reconstruction against the original. Repeat and repeat until the person gets annoyed and asks what the fuck I’m doing. I didn’t do this with Lisa, and it took me a while to realize why: You only have to memorize a face when it’s a face you might not see again, and I didn’t want to think about not seeing this woman’s face again.\nAfter dancing for a while we had a couple of drinks, and after that we left the club together. The sudden quiet and fresh air of the street hit me like a splash of cold water, and I just stood there for a bit, breathing and looking up at the starry sky.\n“I hope it’s going to be something good,” Lisa said, the first words we’d spoken to each other without having to shout over music. “I hope to hell it’s going to be something good.”\nFor an embarrassing, imbecilic moment, I thought she was talking about us, about the prospects of a relationship between us. That’s how I was thinking already. Something had me already thinking about “us” before there was anything remotely resembling an “us.” I said “Yeah, I hope so too,” but before the sentence was halfway out of my mouth I realized that wasn’t what she meant. She was talking about the subject that everyone was talking about—the AIs and what they were up to; what was happening to the world and what was going to happen to it. Then she grabbed my hand, yanked our bodies together and gave me a grinning kiss on the lips, and I went back to thinking maybe she was talking about us. We walked and talked for a while, and then she keyed her number into my phone, gave me another peck on the lips, and left.\n“Anyway, Shanghai is the place, man. That’s what I hear.” Ivan said, trying to pull my attention back to him. Then he added, “She ain’t up there, man.”\nI realized I was standing with my head tilted back, staring up as if I could see through the ceiling above me and the floor above that and into the apartment over Ivan’s. My apartment, where Lisa would be, if she were there. Ivan was eyeing me obliquely, neither pity nor ridicule in his expression. “She’s been gone a long time.”\nTrue, but she’d been gone before, and come back before. Three times, or was it four? A funny thing to lose track of.\nI started wandering around Ivan’s studio, looking at some of his recent work. As usual I liked his charcoal sketches and pencil drawings better than his paintings; maybe I only have a sculptor’s eye for color—which is to say, no eye at all. Maybe it’s all shades of gray with me. Or maybe my problem was that the color had gone out of my life, ha ha. One piece he’d clearly put a lot of work into was done up as an imitation of an old-style biological illustration. It was several images on one canvas, depicting the same creature from different angles and in different postures. Each image had a caption in precise calligraphy, short quotations from Genesis and the Rig Veda. But the creature wasn’t a creature. It had pinkish skin, no apparent head, only vague flippers for limbs. It looked something like a cross between a jellyfish and a rat. It was creepy as hell. “What the fuck is this?” I asked.\nIvan only glanced at the painting, as if he didn’t like looking at it himself. “That’s a squirmer. That particular one was picked up somewhere in Costa Rica; some scientists posted an article about it, about what it does and how it works, with a bunch of pictures and videos.” When I gave him a blank stare Ivan went on. “You know, food! Manufactured food for animals that will only eat live prey. Not all the predator animals in the world are happy eating the piles of synthetic puppy chow that our AI friends leave lying around, so they also make these things—blobs of protein that act alive, that squirm around on the ground. Nice, eh?” He took another quick look at the canvas, then turned it to face the wall.\n“They think of everything, huh?” I said. And of course they do. That’s what you do when you have an IQ in the millions or billions: You think of everything. All the infinite details that go into remaking a world, dismantling every minutest bit of the old world that doesn’t fit your idea of how things should be and replacing it with a corresponding bit that suits you better.\nIvan and I sat facing each other across a neat little table a woodworker friend of his had made, the bottle of scotch on the table between us. Over what was left of the night we got as drunk as the faux booze—or maybe it was the nanoes in our blood—would allow, which turned out to be pretty drunk.\nAfter his third refill, Ivan started holding his glass close to his chest and staring sullenly at an empty spot in the air about four feet in front of him.\n“Tell me about Shanghai,” I said.\n“Fuck Shanghai. It’s all bullshit. Things are as dead there as they are here, or New York, or Palookaville, or anywhere.”\n“You really think things are all that dead?”\n“Agh, you know . . . ” He paused, rolling the ice around inside his glass. “They aren’t alive. Not like they used to be.” He raised his eyes to meet mine. “You were at the Carver Club tonight?”\nI nodded.\n“How was it?”\n“Good,” I said, tilting my head to the right.\n“Yeah. Exactly. You remember the early days? The Fizzle War and all that, when it was all starting? You remember—” He started tossing out the names of bands and of songs, and I started throwing back some of my own favorites, and for a while we may as well have been two geezer-farts, grinding our rocking chairs into the ground as we reminisced about The Good Old Days.\n“Anyway,” Ivan said, “things were alive then. The bands were trying to be different, trying to do something new. And it wasn’t just the music. It was right around then that Johansson started writing her crazy Extinction poems, and the contra-perspectivist painters sprang up in LA, and the New Minimalist writers in the US and India . . . New stuff, man. Great stuff. Back then there really was a renaissance going on. It didn’t last, but it was sure as hell something real.”\nI got caught up in Ivan’s enthusiasm. “It was, wasn’t it?” I said. “That’s how a renaissance happens. One schmoe sees another schmoe doing something amazing, and he gets pumped up. Even if he works in a totally different field, he gets inspired. He starts thinking about trying to do something amazing himself. And before you know it you’ve got Italy in the fifteenth century, or Harlem in the 1920s. You’ve got Duke Ellington and Aaron Douglas and Fats Waller and Josephine Baker, all rubbing shoulders, lighting each other up, driving each other to greatness.”\nI knew the scotch was making me blather, and I shut up. But I went on thinking about those days of a few years ago, when the world felt a lot more alive, as Ivan put it. I thought about spending night after night running from one club to the next, trying to catch every one of the dozens of new bands that were springing up, trying to take it all in, feeling awed by the energy, the newness, the vitality. And more than that, feeling a burn, an absolute burn to go back to my studio and create something, make something, even though I doubted I would ever, in a hundred lifetimes, be able to sculpt anything half as good as all the examples of genius that seemed to be roaring to life all around me . . . Of course, my relationship with Lisa was gleaming and new back then, and that added its own brand of creative fire to my life.\n“I think it’s because we were scared in those days,” Ivan said. “A lot of the creative types were making a joke of it, but that was just whistling past the graveyard. We didn’t know what the AIs were going to do, and we were scared. Maybe it was that fear that made people more creative. Nowadays nobody’s really afraid about anything. The worst thing anyone feels now is bored and cranky.” He caught my eye as soon as he said this, then looked down at the floorboards. “Sorry, man. Stupid thing for me to say.”\nI grunted and waved a hand to dismiss the subject, and we went on talking. We talked about the old world, the new world, about scotch, about art-world gossip, and not Lisa. I spent a lot of time not talking about Lisa.\nThe first time Lisa came home with me to my studio, she went straight to the shelves that held my sculptures. She looked at each one slowly and carefully, taking it in from different angles. I was working small in those days, figures eighteen inches tall at most, and she leaned in close to squint at all the fine details I’d sweated over in anticipation of just such a squint. “Hmm,” she said now and then, and “Ah” once or twice. These little vocalizations were hardly more than a breath, and when she was done looking she summarized with a quiet “Okay” and a smile. I suppose it was just me being silly, but those few syllables felt like all the praise in the world; like a Guggenheim fellowship and a MacArthur grant and a hearty handshake from Rodin, all rolled into one.\nShe spent the night, and the next morning we went to her place so she could make us breakfast, and later that day we went back to my place so I could make us lunch, and some time after that we went to her place for supper and to see if the sex was as good in her bed as it had been in mine. After a few weeks of this, the back and forth was getting kind of tiresome, so we packed up her stuff and moved it to my place. And that was that; there was officially an “us.”\nI suppose—one has to suppose—that to the AIs, love is just one more quantifiable entity in a universe of quantifiable entities. Probably it’s as basic to them as a bit of clockwork; the right neurons firing, a few chemicals in the right combination. But then again, the same can be said of life itself. The sweet, living Earth, with all its countless green fronds and numberless beating hearts, is all just clockwork and chemistry, all eminently quantifiable and understandable. That doesn’t stop it from being something amazing and magical, measureless and infinite.\nAfter some impassioned entreaties, Lisa agreed to model for me. I had just started working on Geckos then; a pair of female figures climbing up a smooth vertical wall, their bodies somewhere between lizard and human, and also abstracted and simplified à la Constantin Brâncuși. It was a design that could easily slump into kitschy faux-deco drivel, but I was hopeful I could hopscotch my way across that minefield. When Lisa saw how abstract the piece was going to be she laughed. “Are you sure you need a naked woman to model for this?”\n“Oh absolutely. It’s all in there, even if I don’t do a straight copy of it; the muscles, the bones, the skin and hair, all the lines and curves, all the, um . . . details . . . And it can’t be just any naked woman. It has to be you. It’s all about capturing the inner essence, don’cha know, and if there’s anyone whose inner essence I want to capture, it’s yours.”\n“I can think of six or seven dirty jokes about that,” she said, “but they’re all really lame.”\nI answered her grin with one of my own, but I wasn’t kidding. I had visions of this woman being my lifelong inspiration. My muse, I would have said, if that word weren’t too worn out and clichéd to speak without gagging. She would be the Rose Beuret to my Rodin, the Jeanne Hébuterne to my Modigliani, the Wally Neuzil to my Schiele. That’s the sort of thing that runs through your mind when you’re young and in love and have enough naïve ego to insert your own name into a sentence alongside some of the world’s greatest artists. As it turned out, I would work on that sculpture throughout all the time Lisa and I were together.\nMeanwhile, the world outside our lust-fogged windows was continuing on its way. After stopping all mechanized war, the AIs set about rebuilding slums and refugee camps. Beginning with the worst of them, these wretched huddling places of tents and corrugated iron shacks were suddenly—by seeming magic—replaced with rows of cute little cottages, neatly trimmed out with comfortable furniture and curtains in the windows. Sewer systems and running water appeared where there had only been open ditches and hand pumps. The shiny kiosk buildings started to spring up like oversized mushrooms, first in the poorest parts of the world, but soon to expand globally. Aisle after aisle of shelves filled with the necessities of life, all of it free for the taking and constantly restocked by the endlessly roving supply-bots. Clearly the AIs had solved the riddle of nano-assembly. They could put together matter of any size and complexity from base molecules, base atoms, and for all we knew, maybe even base protons and electrons. However they did it, the bottom line was that they seemed capable of making anything, anywhere, of any size, in any quantity.\nIt was a fun time when this age of abundance came home to the First World. Mysterious online catalogs started appearing; you could order a pair of shoes or a dozen eggs or new dining room furniture, with no mention of the awkward little detail of payment. Needless to say, this was seen as a threat to the economy—to the whole idea of there even being anything worth calling an “economy,” and this scared a lot of people. It scared some people even more than the fact that mankind’s God-given right to wage war had been taken away. A lot of people were scared, and a wealth of imminent dooms were predicted, but there was nothing much anyone could do. The AIs had seen to it that there was nothing anyone could do. They’d thought of everything.\nFewer people found any reason to object when disease stopped happening. This one began with hospitals noting a slump in new admissions, and with doctors finding nano-sized foreign bodies of unknown origin in the blood of some patients. But soon it was everyone’s blood, and everyone, everywhere, stopped getting sick. At all, ever.\nIt’s funny how people adjust. The world was going through changes that, before they happened, would have been thought of as mind-boggling, world-shattering, unfathomable. And yet life just went on, the way it does. In years past, people had adjusted to the notion that humanity might be wiped out by a couple of psychotic button-presses. People had adjusted to living in the midst of bubonic plague, to having their cities bombed every night, to being ruled by lunatic, murderous despots. If people could adjust to those things, they could adjust to a life of no war, no disease, and unearned abundance.\nIt was right around the time Lisa moved in with me that the zaps were added to the catalog of revolutions being wrought upon the world. They started out as just one more among thousands of not-too-believable rumors flitting around the web, but in a matter of days the reports became a flood. The zaps were real.\nFor Lisa and me, that reality was visited on us late one night as we were walking through one of the less-affluent neighborhoods of Cambridge, on a residential side street off of Mass Ave. In the middle of a quiet, poorly lit block, a man was suddenly standing in front of us. He was big, broad, and pretty rough-looking, with a dried road-rash scab on one cheek, torn and dirty clothes, and hair that might have been neatly combed earlier in the day but was now a crazed mop. “Hey, man,” he said, apparently to both of us, “you gotta see this.”\nI tightened my grip on Lisa’s hand and tried to sidestep around the guy, but he sidestepped with me, putting a hand on my chest. “No. You got to see this!” His eyes roved over the empty air around him, somewhere above head level. “It’s like they’re here. Watching. They know what I’m going to do, before I even do it!”\nI figured him for crazy and/or drunk, and tried to convince myself that crazies and drunks usually aren’t dangerous. “It’s okay,” I said. “They won’t hurt you. They haven’t hurt anyone.”\nHe widened his eyes at me, smiling like he knew something hugely funny that I didn’t know. “It kinda hurts, actually,” he said, a thoughtful look crossing his face. “But it’s wild . . . Wild. Just watch. Just watch this!” His hand was on my chest again, this time grabbing my jacket. He wrenched me around, shoving me up against a parked car. Lisa yelled something, grabbing at his free arm. He shook her off and grinned wildly at her. “Just watch!” he said again, turning back to me and bringing his right arm up with his fist clenched and his elbow cocked in a classic I-am-going-to-punch-your-face pose. Lisa screamed.\nWhen you’ve played a memory over and over in your head a few hundred times, it becomes difficult to know what you actually saw at the time and what details your mind has edited in after the fact. Since those early days, everyone’s seen slow-motion videos of zappings, heard people describing the sensation with all brands of colorful language, seen scientists expounding on the probable mechanism of their function. But reliably or not, I remember the electric buzz-pop, a flash of light with no apparent source, and then our unpleasant companion going into shuddering rigidity for less than a second before slumping to the ground like an abandoned marionette. Lisa and I stood looking blankly at each other for a moment, and then she bent over the man, reaching out to touch him. There was an acrid, bleach-like smell in the air, which I later learned was the smell of ozone.\n“Did ya see it?” the man cackled, turning his head toward Lisa. He was breathing hard and clutching at his right arm—the arm he’d been about to punch me with. “Did ya fucking see it?” It seemed to be really important to him that we’d seen it.\n“Yes, we saw it,” Lisa said, and we left.\nWe walked a block or two in silence, just absorbing what had happened. I was mostly thinking about the implications of this new manifestation of the AIs. They would be able to stop any human action they didn’t approve of, and I wondered what that was going to mean. Lisa was thinking more about the man we’d left lying on the sidewalk. “He wanted it to happen,” she said softly. “Everyone keeps wondering why the machines won’t talk to us, why they won’t tell us what they’re going to do, what their plans are. That guy wanted that thing to happen to him, because he knew it was them, speaking to him, in a way. He wanted to be electrocuted, or whatever that was, so that he could feel them doing something, saying something. It was like he thought of it as being touched by the hand of God.”\nI figured she was right. Luckily, before too long there was so much coverage of people being zapped that it became old hat, and not many were silly enough to go out of their way to provoke getting zapped just for its own sake. It also turned out that only violence or extreme cases of theft or destruction of personal property would bring on a zap, so fears of the AIs trying to whip the human race into robotic docility and uniformity died down after a while.\nBut the zaps meant there was no longer much use for police, the courts, laws, politicians, or government. All of these grand edifices of Civilization As We Know It were becoming as obsolete as buggy whips. The faint electric crackle of the zaps was really a thunderclap. It was the boom of a coffin lid slamming shut on the notion of humans being in charge of humanity.\nNaturally, this fact once again made many people unhappy, or frightened, or both. Worrying about what the AIs were up to was becoming humanity’s favorite pastime. And Lisa was becoming one of those people who worried.\n“You have to wonder,” she said one day. “When you look at what the machines are doing from a few different angles, it makes me wonder.”\n“Wonder about what?” I asked. “No more crime or war or disease or poverty. Those are good things to be rid of, I’d say.”\n“Sure they are. The world is a million times better off now than it was before. But . . . ” She paused for a long time before continuing. “I was just reading about the women’s suffrage movement. Some of those women went through hell year after year after year; getting beaten up by cops at their protest marches, getting arrested, going on hunger strikes in prison, being force-fed with tubes rammed down their throats. And then when they were released from prison, they just went back out on the streets to march again. Some of them had their health ruined for the rest of their lives, and some of them died.” She looked at me, her eyes shining with tears. “How many millions of stories like that are there in history? People fighting and dying for human progress—for freedom and democracy, to end slavery, to end war, to make progress in science—all the ways people have worked and suffered and sacrificed themselves to make the world a better place.” She paused again, looking away from me, looking out a window at a blank sky.\n“And now all of that is over,” she said. “The machines are jumping in and kicking us off the field. They’re saying we’re nothing but a bunch of screwups, so they’re taking over, taking the world out of our hands. So as of now, there’s no such thing as human progress anymore, because it isn’t humans who are doing it. It’s them. It’s all them, imposing progress on us from above.”\n“That’s true, I guess,” I said. “But it’s also true that their sense of morality must have come from us. Either it was programmed into their ancestors or they learned it by observing our culture, and now they’re only taking those human ideals and applying them, enforcing them. And isn’t that what laws have done throughout history? To apply the highest human ideals that one can realistically hope to enforce? So you could say they’re just super-cops, enforcing a system of morality that’s entirely human in origin.”\n“But it’s not human. It’s a change in how we behave that hasn’t come from us. It hasn’t evolved. It’s just being imposed on us by goddamned machines.”\n“Yes, and what’s wrong with that? So maybe it bruises our little egos that they’re in charge, that they’re more powerful than us, that they’re smarter than us. Maybe a bruised ego is an okay price to pay for children not being shot and napalmed and dying of dysentery.”\n“I’m just saying that being human used to be something special,” Lisa said. “People like Martin Luther King, like Mahatma Gandhi, like those suffragettes and like all the millions of plain, ordinary people who did some little thing, just out of the hope that they were helping to make the world a better place—they made us special. The human race was progressing, it was evolving. And now that’s all over. We’ll never progress to anything, because we don’t have any choice. Whatever progress we make, it won’t be us doing it. We aren’t free. We’re just pets who belong to them.”\nI kind of slumped at that, a realization settling over me. “The difference between you and me,” I said, “is that you have a lot more faith in humanity than I do. I’m not so sure we were progressing anywhere. And if we were, it could have taken a million dead martyrs like Martin Luther King and Mahatma Gandhi before we got to the place where we are today: People not killing each other. And personally I’m not sure the human race would have lasted long enough to kill off many more martyrs.”\nOf course, a lot of what both of us were saying was just rehashing arguments we’d read or heard from others. All these issues and lines of thought had been chewed over endlessly by everyone with a keyboard or microphone. But for Lisa and me, the argument died there, for the time being. It was our first glimpse of the distance that could exist between us, and neither of us wanted to dwell on it. We didn’t want to admit to ourselves that it was a real thing; that it mattered. Life went on, and we went on being happy.\nWhat we didn’t realize was that the AIs still weren’t done with remaking the world. Their next bombshell came about a year later. Seemingly overnight, the birthrate dropped. Nine births per thousand population per year was the new number, and it was quickly confirmed that it was the same everywhere in the world. This worked out to about one and a quarter children per family, and was well below replacement level. Apparently the AIs had decided that the human population needed to be lowered, so in their inimitable manner they had made it come to pass.\nAnd once again this latest seismic readjustment to the world brought out a thousand gradations of response, from joyful acceptance on down to batshit hysterical predictions of doom. It was calculated that the population would dwindle down to nothing at all in several hundred years if the birthrate stayed as low as it now was. “They’re wiping us out,” some declared. “Yeah, but,” the more moderate yeah-butters said, “if they wanted to get rid of us, why wouldn’t the birthrate be zero? Or why wouldn’t they just kill us outright, disassemble us into pink goo, and be done with the job in a millisecond instead of centuries?”\nThere was another wrinkle to the new birthrate, and it was one that many disliked even more than they disliked the plain numbers. The AIs appeared to be picking and choosing who would be allowed to conceive. Unwanted pregnancies dropped to zero, as did pregnancy among the mentally ill, those who were in bad relationships, and women who already had two or more children. Teenaged pregnancy likewise became almost unknown. When a pregnant teen did occasionally appear, she would turn out to be some absurdly mature and levelheaded girl who was studying for her Master’s in developmental psychology or some such thing. Or it would be discovered that she was best friends with a gay couple next door who were breathlessly excited about the upcoming birth and had already redecorated one of their rooms as a nursery and installed childproof locks on all their cabinets.\nSo those granted the gift of conception were clearly all good and deserving people, as determined by the AIs in their presumably infallible wisdom.\nAs for me, because I’m an idiot, a blinkered idiot, days went by before I thought much about where I stood on this issue. Or rather, before Lisa pointed out to me where we stood. We were talking about one of the endless “why do you suppose this couple was allowed to have a baby” stories, when I realized that Lisa’s expression had gone dark. She was glaring at me with something in her eyes I couldn’t identify, but I knew it wasn’t good. She looked at me like that for a long time.\n“You really don’t care, do you?” she said finally, making it more of a statement than a question.\n“Care?” I said blankly.\n“I mean you aren’t thinking . . . You aren’t thinking about . . . ”\nStill I was clueless. “About what?”\n“About us!” She yelled, suddenly almost in tears. “About the fact that this means us, too! Did it really never occur to you that you and I might want to have kids some day? Maybe get married, be a family, all that bourgeois middle-class crap? Does that really never cross your mind?” We were sitting on our couch, and at this point she leaned into me, resting her head on my shoulder. She sniffed noisily, openly crying now. “Did it never occur to you that . . . ” She made a fist and thumped it down softly on my thigh, “that I love you so much that I would feel blessed—fucking blessed—to have a baby with you?”\nIn my imagination, her words echoed in the room for minutes. No, it hadn’t occurred to me. How could I, miserable finite entity that I am, ever think that someone like her could feel a thing like that about me? And in any case, all thoughts of fathering children had always been a pretty distant thing from my notions of life and my place in the world. I knew the possibility was out there, and I suppose in some dusty, unused corner of my mind I connected that possibility with Lisa, but . . .\nIn a kind of stunned internal silence, I reached out for the idea, drawing it from its dusty corner and into the light. A child. Parenting. A child with Lisa. A son, or a daughter . . . The image burst on me then, like a sculpture suddenly assembled out of particles of light. It was beautiful. It was the most beautiful thing I’d ever imagined. Yes. A baby. A baby with Lisa.\n“Yes,” I said aloud, suddenly teary. “Yes, yes, yes. Let’s have a baby.” I grabbed her hands in both of mine, then let go again so I could pull her to me, hug her hard, bury my face in the crook of her neck. “Yes, yes, yes.”\n“Who says they’d let us?” Lisa asked. “Even if you wanted to.”\n“I do want to!” I sputtered. “And they’ll have to let us! We’ll get married, we’ll be a family. We’ll read books, take courses on parenting, we’ll . . . I don’t know, do whatever responsible, well-adjusted parents do. Maybe we can’t count on a whole brood of kids, but we can have at least one. They’ll have to let us have at least one.”\n“You want to?” Lisa said, her voice quivering again. “You really want to?”\nI said “Yes” a dozen or so times more, and then we just sat there with our heads together, both of us sniffling, grinning, laughing.\nSo the next day we started figuring out how to get married. There was still a functioning city hall in those days, so we filled out the required forms, got the required signature, and lined up a justice of the peace. As soon as I told Ivan what we were up to, he leapt into the job of planning the thing like a frenzied mother-in-law-to-be. I had some pieces in a group show at the time, and Ivan convinced the gallery owner to let us use the space for the ceremony. He pestered us with a flurry of different designs and redesigns for invitations. He begged and bartered with one of the better local bands, not only getting them to play some upbeat and danceable music after the ceremony, but also brow-beating the guitarist into working up a Jimi-Hendrix-esque version of the wedding march. And when the day came it was a great little party, much like the night when Lisa and I first met. Only when Lisa danced this time, it was with her arms high in the air, as if there was too much joy in her for her body to contain. And looking at her, that feeling was echoed in my own heart. Until that moment, I wouldn’t have guessed I could love anyone as much as I loved this woman.\nBut the wedding was to be the last truly, purely happy moment of our lives. After that began the long succession of monthly disappointments; the repeated non-conception of our child. Though statistics showed that the birth rate was steady and unvarying, once we were in the game, once we were among the ranks of those hoping for a child, it seemed that everyone except us was getting pregnant. Middle-aged couples, young couples, single women, seventeen-year-old girls. How were the AIs choosing? Had they modeled the human personality so perfectly that they could know, to some Nth level of certainty, who would make the best parents? And what did “best” mean? By whose definition? What kind of next generation did they want? These were just a few of the infinite questions that the whole world was pondering, arguing over, fighting and breaking up over.\n“It’s probably me,” Lisa said. “The machines know that I’m not all gung-ho for the new world order, so why would they let me be a mother? You should hook up with some woman who loves Big Brother as much as you do. You’d have six kids by now!” And I would take issue with that line about loving Big Brother, and we would argue and fight over that.\nOr: “Maybe it’s you. Maybe they won’t let us have a baby because they know you don’t really want one. You’re happy with your life the way it is. You don’t want a messy, noisy brat screwing up your neat little world. I know it, and they know it.” And we would fight over that.\nThe topic of parenthood and our persistently not-appearing child was the main locus of argument between us, but there were others. I’d been keeping my day job when an increasing number of people around us were finding it easy enough to live without employment. But when the company that we’d been paying our rent to went out of business and wasn’t replaced by anyone or anything who cared about the building or who lived in it, I told Lisa I was going to quit. It was a doomed job anyway; there’s not much use for an ad designer when the whole institution of selling goods for money was crumbling apart.\n“If you don’t work, you’re giving up.” Lisa said. “You’re dropping out of the economy and dropping out of human society. You won’t be contributing anything; you’ll be nothing but a pet to the machines.”\n“All I’m ‘giving up’ on is being a damned wage-slave,” I snapped back. “I’m dropping out of spending half of my waking life doing work I don’t care about for a company that doesn’t matter. And we don’t need the money. I’ve got savings enough to get the few things we want that you still have to pay for, and who knows where the world will be by the time that runs out? Money may not even exist by then. And meanwhile I’ll be able to spend full time doing the work that matters to me.” I waved an arm in the direction of the room set aside as my studio.\n“Sure. Let the machines feed you and clothe you and keep you warm in the winter. Let them give you toys to play with and let them clean your litter box and let them wipe your ass when it needs wiping. Be a good little pet.”\nAnd so on, and so on, and so on. Of course, I’m the one remembering all this, so it’s a given that my memory is biased. I’m sure I said my share of stupid and hurtful things too, when it was my turn to be stupid and hurtful. And no amount of skewed memory, of snuffling self-pity and hurt feelings can hide the fact that we had great times too. Times when Lisa’s smile and laughter lit up the air and washed over me like sunlight. Times when the two of us fit together like the jagged half-pieces of something that was meant to be whole. Times when I was sure that nothing in the world could ever make sense without her at my side, completing me.\nThen the company Lisa worked for went out of business, and she couldn’t find a job anywhere else. For a while she filled her time with watercolor painting and drawing, and I swear she had a natural talent that would have had my professors at the MFA School weeping onto their smocks. But she gave it up, switching to guitar playing for a while, then keyboard, then reading nineteenth-century novels, then studying political theory . . . Nothing lasted, nothing consumed her, nothing gave her the sense of purpose that a lump of clay and a few modeling tools gave to me. She became more and more convinced that only one thing would do that for her, and that was the one thing the machines wouldn’t allow us to have. I convinced her to see a therapist—a profession that was grandly thriving, thanks to the vast population of the unemployed who were thrashing about for something to give meaning to their lives—but that too didn’t last.\nAt some point our arguing and bitterness seemed to become the rule rather than the exception, and she left me. And a few weeks later she came back, both of us extravagantly tearful and contrite and swearing that we’d never fight again and blah blah blah. And we didn’t, until we did. So she moved out again, and came back again, and left again. How many times? A funny thing to lose track of.\nI do remember what triggered our last breakup, though. It was the thing with the animals. When the AIs decided to extend their reach into the realm of animals and nature, that was what finally and utterly ruined my marriage.\nAs usual, the news crept in on us by degrees. First came the stories of some act of violence against an animal being prevented in one way or another. A deer hunter in Vermont found his 30-06 falling to pieces in his hands, just like the soldiers in the Fizzle War. A short-tempered dog owner in Egypt and a malicious slingshot-owning youngster in France were zapped onto their respective behinds. Soon the scattered reports became a deluge, and the meaning was clear: The AIs’ umbrella of protection had been spread to animals. All animals, everywhere. Harm to any creature larger than a bug was no longer allowed, and even wholesale attacks on insects were liable to bring down the stinging reprimand of a zap. Slaughterhouses around the world were disassembled to dust overnight, and the herds and flocks of livestock wandered off, to be fed and cared for by the machines. By this time, synthetic copies of every food imaginable had been available for years, and they’d been shown to be indistinguishable from their real-food counterparts. So this latest stricture had no real impact on anyone’s dining habits, but needless to say there were many who chafed under this imposition on their inalienable right to kill things. No matter. As ever and always, there was nothing anyone could do about it.\nAnd then came the capstone on the AIs’ new world: Reports from forests, jungles, and wildlife reserves began to show that it wasn’t just humans who were prohibited from harming animals. One early video showed a pride of lions stealthily closing in on a mother zebra and her foal. Then there was a series of flashes and crackles, and predator and prey darted off in opposite directions. That same afternoon, a drone on caterpillar treads was seen dropping off a load of realistic-looking but undoubtedly synthetic meat upwind of the lions. The lions ate well that night, and the zebra mother and her foal lived to see another sunrise. A thousand confirmations eventually followed, and soon after it was reported that the birthrate of all prey animals had dropped precipitously. The new rulers of the Earth weren’t content to simply take a hand in the affairs of humans; they’d decided that nature itself needed some straightening out. So no longer would a mother zebra need to birth and rear ten or twenty offspring so that one or two might live to reproductive age. No longer would nature be so profligate with lives, so red in tooth and claw. That bit about God’s eye being on the sparrow would no longer be a cruel joke at the sparrow’s expense as its life ended in agony and terror, with torn flesh and crushed bones. Now, in the remade world, that sparrow could look forward to a long and carefree life, a dignified old age, and a quiet death in its little sparrow bed, the whole of its time on Earth innocent of pain and fear.\nMy mother died when I was sixteen. She was driving and somehow managed to swerve off the road, hurtle down a steep embankment, and crash into a tree. I was sure I knew how it had happened—almost before I could even fathom the what of her being dead, I was sure of the how. She had seen something in the road, a squirrel or a cat, a turtle or a snake, and had yanked the wheel over to miss it. I was sure, and though we never mentioned it to each other, I felt my father had the same thought, and was just as sure.\nThe idea of a funeral would have been anathema to my mother, but my father held a small “memorial gathering” for her in our home. It was one of those secular affairs where a succession of friends and relations stood and spoke. Many had reminiscences, some recited poetry or other texts. My father went last, and he started by noting that although his wife was the staunchest of atheists, she had a fondness for certain parts of the King James Bible. Then he read, very briefly, from Ecclesiastes:\nFor that which befalleth the sons of men befalleth beasts; even one thing befalleth them: as the one dieth, so dieth the other; yea, they have all one breath; so that a man hath no preeminence above a beast.\nHe spoke softly, as if his words weren’t intended so much for the people in the room as for himself, or for some closely-hovering spirit of my mother—though she would surely have been as disdainful of that image as she would have been of a traditional religious funeral.\nI imagine everyone likes to think that they aren’t fettered by their parents’ beliefs. Even while she was alive, I made little rebellions against my mother’s militant veganism. I would spend my allowance on sneaky little violations of the diet she’d raised me under. With all the furtive subterfuge that other kids invested on illicit drugs, I bought ice cream and pizza with real cheese; I ate snack foods without checking the ingredients list. And in my teens and adulthood I abandoned one after another of her strictures. I wore leather shoes; I stopped checking for “cruelty free” labels; I even nibbled at an occasional hot dog. I thought I was freeing myself from my mother’s irrationality, that I was growing up, becoming my own person.\n“This really tears it, doesn’t it?” Lisa said. “This just wraps it up for you.” She was standing behind me, and we were watching the news of the AIs’ latest doings on our wall screen. At that moment the screen was showing a picture of a female mallard duck swimming on a sunlit pond, followed by a single fluffy duckling.\n“What are you talking about?” I said. I honestly had no idea, but the anger in her voice was making my own anger flare up. It felt like we’d leapt into the middle of another argument, with no preamble or warm-up.\n“I mean that this is where you find your god.” She waved an arm at the wall screen. “This is him, or it, or them, climbing up onto his golden throne.” She made the same arm-wave in my direction. “And this is you, getting ready to kneel and worship at his feet.”\n“Damnit, Lisa, I’m not worshiping—”\n“And this is me, being a monster,” she interrupted. “A fucking monster who cares more about her own right to have a baby than she cares about war and disease and poverty and . . . ” She waved her arm once more, this time hitting the screen with the back of her hand, “and a million, billion fucking baby ducklings being born just so they can be eaten by foxes or crocodiles or whatever the fuck eats baby ducklings!” Her voice became choked and strangled, and she pressed her forehead to the screen, banging it with her fist. “I’d let them all die! I’d let the world burn, so long as I can have my baby! Doesn’t that make me a monster? Doesn’t it?” She turned to me, her face twisted and smeared with tears.\nThe anger melted out of me, replaced by a sense of hopelessness that wasn’t much of an improvement. “You’re not a monster, and you don’t feel that. You don’t want anyone or anything to die. You just want to have a baby, and so do I, and we have a right to want that. But . . . ”\n“But everything’s for the best in this, the best of all possible worlds. You believe that, don’t you? Especially now—now that the machines are fucking with nature, now that they’re so moral and righteous and holy that they’re saving little birdies and mousies and zebras and whatever the hell else from getting eaten. It used to be a joke when people talked about them being the new god. But now . . . now they really are god. The best god ever, isn’t that right? Isn’t that what you believe?”\nThat damn duckling picture was still on the screen, and I couldn’t help looking at it. “It matters, Lisa. There’s so much less pain and misery in the world now that I can’t even get my mind around it, and that matters. I’m not about to get down on my knees and pray to the machines, but . . . it matters. It matters a lot.”\nLisa turned her back to the wall then, slowly bending her knees until she was sitting on the floor. She looked beaten, as if all the fight had been burned out of her. “It matters more than our baby, you mean,” she said flatly. “And yeah, how can I argue? I can’t say that we should go back to the way things were, bring back all the war and disease and shit. I can’t say I want the world to burn. I can’t even say bring back the slaughterhouses and little birds getting eaten.” She turned her head to look at me, her face slack and infinitely weary. “But I can say one thing. I can say that I hate them. I hate them for treating the human race like it was their property. I hate them for making us into something less than human. And most of all I hate them for telling me that I’m not good enough to be a mother.” She made a dry, humorless laugh. “People in the old days didn’t know how good they had it. Back then, if you didn’t like the way God was running the world, you could just stop believing in the old bastard. You didn’t have to go through life being angry at him, hating him, wishing he’d get his fucking hands off of your life.”\nI didn’t say it, but I knew she was wrong about that. My mother didn’t believe in God, and yet she hated him with a boundless ferocity. She hated the blood-soaked cruelty of nature as if it was an animate thing, and what other name is there for that animate thing if not God? And despite my attempts to be free of her, to be my own person, I was still my mother’s son. Her hatred of the old God was still a part of me. So now, with this latest act of the machines—this remaking of the world of nature, this act of compassion, of tenderness for all the creatures of the world, I found it impossible not to feel something like love for them.\nSo Lisa left me, for good and all, this time. There was just too much distance between us. “Irreconcilable differences,” as they used to say in court. We were simply lost to each other. I can remember every detail of her face and body, every nuance of expression and every habit of gesture. And yet when I visualize her I see her as a dim, far-off figure, obscured by misty distance, separated from me by a bottomless chasm.\nThe birds were chirping hello to another day when I left Ivan’s and weaved my way upstairs. I was debating whether to make some coffee or just drop into bed when I saw there was a message waiting for me on my screen. It was from Gwen, one of the people who works—or maybe a better term would be hangs out—as voluntary caretaker of the workshop where I get my sculptures scanned, enlarged, and 3-D printed as faux-bronze polymer.\nHey James,\nOur bot buddies just delivered a new printer. They also built a whole new wing to the building here to hold it, because this sucker is big. Like, printing out sculptures 10 meters tall and 5x5 meters footprint. Nobody asked for this beast, of course, it just appeared overnight, the way things do.\nAlso, some new equipment and spec files showed up at the same time. They’re instructions and materials for attaching big things to the exterior walls of buildings, even glass-walled buildings like the Hancock Tower.\nSo the other folks here were scratching their heads wondering what’s up with this and what we can do with it, but not me. My thoughts went straight to your piece Geckos, of which you sent us some pics of your clay original a few weeks back, asking if we had any ideas about where you might do an installation of a life-size copy. You maybe remember that I wrote you back saying that I thought this was a really great piece, and it deserved as big and noteworthy an installation as we could manage. Well, how about a five times life-size copy, dude? You could put those figures ten or twenty stories up on the side of the Hancock Tower! Is that an awesome thought or what? We all figure this must be exactly what the AIs have in mind. Nobody else around here has been talking about sticking anything big onto the outside wall of a building, so this delivery has got to be their way of giving you the go-ahead to do the biggest- and coolest-ass sculpture installation this town has seen since, well, forever.\nGet back to us quick, dude, or just show up with your clay original. All of us here are really jazzed about firing up this big printer and making this project happen.\nYrs. etc.,\nGwen\nI sat staring at the text on the screen for a long time, waiting. Waiting for the good feeling this news should have given me. It didn’t come. It didn’t come, and it kept on not coming. I got up and pulled the dustcover off of the two clay figures that were Geckos. A crazy obsession of a piece; one that I had kept working on, giving up on, trashing and restarting, rethinking and un-rethinking, over the past four years. I’d finished plenty of other work, but this was my Big One. It’s no Guernica, no Nude Descending a Staircase, no Balzac, but it’s as close to all of that as I expected I’d ever get. It was the best thing I’d ever done. It had as much of me in it as I could tear out through my skin. It had my blood and sweat and everything I knew about what’s beautiful and true in it. It had my love of Lisa in it, and her love for me.\nI visualized the whole installation project to come. There would be six or eight volunteers from the fabrication shop; Gwen, José and Steve, maybe Philipa and her latest partner, probably some others whose names I don’t know. There would be the cheerful camaraderie, the enthusiasm of working on a nifty new project. The specs and equipment the AIs had provided would be pondered and discussed carefully in advance, and then we’d set off to the site and do whatever it was we were supposed to do. Set up a scaffold or run cables from a window or whatever. The project would take a while, maybe a few days. And when it was done we’d all look up at it, a big, conspicuous sculpture, visible for miles around, with my name attached to it. The crew of volunteers would grin and pop open beers and congratulate me, still breathless from their exertions.\nAnd it was all a crock of shit. If the machines wanted that sculpture expanded to five times life-size and stuck onto the side of the Hancock Tower, they could do it themselves. In hours, maybe minutes or seconds, they could use their nano-assembly trick to make it materialize in place, no human participation required. No camaraderie, no good friends toiling happily together. All of that was crap. It was just their way of putting some stupid humans onto a hamster wheel, running from nowhere to nowhere as fast as their stupid little legs could go.\n“Fuck you,” I said, talking to the empty room, to the room that would have been empty if there were any such thing as an empty room in the world today. “Fuck you. You can go to hell.” I went to the cabinet where I kept my stone-cutting tools and pawed through it until I found the heaviest mallet. “You can all go straight to hell,” I said to them, to them, them, them, as the room got blurry through my tears.\nThere’s something I never told Lisa. Because it was silly and goofy, and because it wouldn’t have made a difference. Because I was afraid she’d laugh at me with that cruel, barbed laugh she used when she was angry enough. It’s this: I have seen our child. She doesn’t exist and she never will, but I’ve seen her. She comes to me like a ghost. Standing in a doorway and looking in at me, sitting on a sunlit patch of grass in a park, looking out a window at the huge world that waits for her. I see her as she would be, not yet three years old, all toddling legs and chubby arms; tiny, gentle fingers. I see her eyes looking at me; wonderful eyes that are too wise and too full of no bullshit for a kid her age, and yet innocent. They’re eyes that haven’t known pain, aren’t even sure that pain is a real thing in the world, and yet belie enough strength to endure pain when it comes. They’re eyes that are open wide to the whole world, ready for all of it. I see our child; I see her as all the best parts of Lisa and all the best parts of me embodied, walking around, breathing and living. And it rips my fucking heart out every time I see her.\nI took the mallet back to where the two clay figures of Geckos were standing on their low plinth, and lifted it up over my head, my arm already tasting the long swing downward, the thudding impact on soft clay. “You can all go to—”\nI was sitting on the floor, my back to the studio wall. The mallet lay on the floor beside me, near my right hand. A hand that seemed disconnected from me; that only made a vague twitch when I told it to move. As my mind slowly cleared, I became aware of a buzzing, numbing pain through my whole right arm. The bleachy smell of ozone was in the air.\nThe two figures of Geckos were in front of me, but for a few seconds I resisted the urge to lift my eyes to look at them. When I did, I was looking up at my sculpture, unharmed, un-bludgeoned, not smashed into an amorphous lump. I let out a long, shaky breath.\nA motion caught my eye. One of the little insect-sized bots was crawling up the wall on my right. Probably it was one of the team I’d seen in Ivan’s studio, busily engaged in repairing the building’s exterior woodwork. It paused in its climb as I watched it, as if it was looking back at me. How much like a bee it was, I thought, busily going about its little bee life. At that moment the bot flexed itself in an odd way, seeming to expand a little and then shrink again, as if taking a breath. Then it continued up the wall, disappearing into a crack under the frame of a window.\n“All right then,” I said, climbing to my feet, flexing life and sensation back into my right arm. “Okay.”\nOriginally published in Asimov’s Science Fiction, December 2016.\nKarl Bunker's short stories have appeared in Asimov's, Fantasy & Science Fiction, Analog, Interzone, Cosmos, The Year's Best Science Fiction, The Best Science Fiction of the Year, and elsewhere. He lives in a small town north of Boston, MA with his wife, sundry pets, and an assortment of wildlife."}