{"fingerprint": "4Pg7/b74qb5eCi/YdajBsNb8UCE=", "sitename": "Clarkesworld Magazine", "title": "You're Not the Only One by Octavia Cade", "author": "Octavia Cade", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cade_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: You're Not the Only One by Octavia Cade", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3770 words, short story\nYou're Not the Only One\nDisappointment is such a solitary affair. Worse, it tends toward self-involvement, to shutting people out, and the determined failure to recognize there are disappointments that, if not worse than yours, are at least equally valid. I couldn’t stand to shut myself up with my own. It would have been unkind, and not only to myself.\nMarcus was meant to be going to the moon today. Years of training, years of anticipation. I can’t imagine the letdown. Instead, he’s in the community garden, as usual, weeding. Marcus hates weeding. He’d rather prune the fruit trees or tie up the bean plants or be in the kitchen, cooking. Anything but weeds. “I’d like to say I feel a sympathy,” he says, when I bring him over a glass of water. “That I know what it’s like to feel out of place, and that’s why I hate digging them up. But I picture myself saying that aloud and meaning it and it just sounds so bloody whiny. Can you get secondhand embarrassment for what future-you might have said?”\n“Only if present-you has the common sense to recognize self-pity when he sees it,” I say. I don’t bother to say that weeds are good for compost. We both know it already, and besides, if anyone deserves to have a few moments of private self-pity today, it’s him. “Shit day. I’m sorry.”\n“Hey,” he says, stretching out his back, and even having been hunched over for the past couple of hours he’s more graceful than I am. I’d get down on my knees to help him finish the last of the rhubarb patch, but when I’m this pregnant it’d take a winch to get me back up again. “It’s not over, it’s just put off for a bit. There are a lot worse things.”\nHe doesn’t look at my belly as he says it, not even a passing glance, so I know that he’s not thinking of me. And because he’s a kind man, even in the midst of his own terrible disappointment, he winces when he realizes what he’s just said. “I didn’t mean Hannah,” he says, and it was the right decision to give her a name, even if she’ll never take more than a few breaths with one. “Is it better or worse to say I wasn’t thinking about her at all?”\n“Horribly, I think it might be an improvement.” It’s not that I don’t appreciate the sympathy, but it all gets a little cloying sometimes. I miss being treated like a person, instead of a vessel of tragedy. People try, of course they do. But sometimes all that pity, for a future gone wrong, or gone unexpected, is hard to take. “If it makes you feel better, yeah, there’s part of me a little glad not to be the only one to experience crushing disappointment this year. Oh, and you missed a spot.”\nMarcus glares at the weed and laughs at me. “I see how it is. No coddling required. Well then, get your massive self down here, if you can, and help me weed the rest. I suppose I can heave you up afterward.”\n“I’m not that big,” I huff at him, but that’s an absolute lie. I feel like an elephant. Elephants are pregnant for over eighteen months, so Marcus is right: it could always be worse. I don’t think I could stand being pregnant for eighteen months, not when I know that Hannah won’t live long past her birth. I guess in that respect the elephants are lucky: they don’t know when disaster’s coming for them.\nThen again, neither do we. Melting ice at the poles has released more carbon dioxide than expected—much more—and it’s blown the global carbon budget. That’s why Marcus is grounded right now. Space exploration is a wonderful thing, but it’s environmentally expensive, and we need to balance our priorities.\n“I should have expected it,” he says. “I’ve seen the numbers. I guess I let hope get in the way. Well, not hope. Wanting. I don’t think they’re the same.”\n“Only sometimes.” I’d hoped for, and wanted, a healthy child, but scans showed that Hannah had abnormalities that were incompatible with life. I had no hope for her, but I still wanted her . . . even if I only had her for a little while. It helped to know that she wouldn’t be in pain, and that some of her organs would help other children who had a little more hope to go with their parents’ wanting. “There’s different kinds of hope. I don’t think wanting things for ourselves is any less bad than wanting things for everyone. You’ve just got to find a balance you can live with.”\n“Hence the weeding,” says Marcus, clearing another space around the rhubarb plants. “I thought I could sulk at home today, feel sorry for myself, or I could come do something useful.” His movements were awkward, as if he were embarrassed by the admission, or at least embarrassed to be making it to me. I’d experienced this before. The doubt of how to act around someone who was going through something so cruel; how much normality to inject into conversation, how much sympathy. I’d bursted into tears at people before. It made them think their own problems were lesser things, as if they didn’t have the right to feel unhappiness themselves in the face of mine. I never wanted anyone to feel that way, or at least I tried very hard to not want it. And so when Marcus looked up at me, with that same steady expression I’d seen on his face so often over the past few months, choosing to accept the awkwardness so that he could give me the laconic, half-teasing support that I’d discovered I needed to simply keep functioning, I made myself choose to do the same in return.\nI had to. We are more than the losses that life gives us.\n“You don’t even like rhubarb.” There’s a lawyer who works in the kitchen garden sometimes who loves the stuff and is always bringing in rhubarb muffins. They taste pretty good, but I’ve never seen Marcus choke down one, not even to be polite.\n“Can’t stand it,” he says, determinedly cheerfully. “It’s revolting. But I got here early, and I saw the bed needed a weed, and I had to laugh. No trip to space, and now rhubarb. The universe is clearly out to get me.”\n“Suit yourself. I mostly came for the strawberries.” They’re planted beside the rhubarbs, a small field of them, and I’d like to say it’s Hannah who’s responsible for just how many of them I’ve managed to eat, but I’ve loved them ever since I was a kid myself, so it’s only fair that I do my share of looking after them. I’m not the only one who likes them, either. “No strawberries on the moon,” I say, nudging him and nearly overbalancing with it.\n“No rhubarb either,” says Marcus. “Damn, but I wish I were there.”\n“I know. Are you coming tonight?”\n“Don’t really feel much like celebrating, to be honest.”\n“It’s not a celebration, it’s a pity party. For us, not you. We thought we were shot of you; turns out we’ve got you for a bit longer anyway. Come along and rub our noses in it, why don’t you.”\n“You’re a cruel and heartless woman. Go on then. I accept.”\nThe entire neighborhood was at the party. A mutual decision, to make it a celebration anyway. No one’s quite sure for what, but we’re trying to make something better as much as we can. It’s an exercise in compassion, I suppose. We all know how disappointed he is; the thought of one of us going to the moon to build a base there, the first of the colonists . . . it’s a childhood dream, and we got to be a part of it by proxy.\nChildhood dreams rarely involve, “Not now, but later.”\nMaybe that’s what we’re celebrating. That we’ve come together enough for there to be a later, that we’ve collectively developed the compassion not to let dreams get in the way of decency. That we have, as a society, decided to be adults. What use is it to go to the moon if the tides that moon influences are so very much larger than before, that they drown the coastlines beneath us, that they send entire nations into homelessness and want?\nIt may be an exhibition of smugness to celebrate selflessness, but the celebration is an indication of value. Marcus knows it too. I can see his shoulders relax as the night goes on, see his gestures become more open, hear the laughter without a tinge, at last, of bitterness. Part of that could be the booze, of course. Last year’s cider has come in, the orchard next to the school well-tended. There’s beer brewed from the hops grown on the roof of the community center, and of course everyone has a lemon tree. We can’t sweeten lemonade with sugar anymore because it doesn’t grow here, but there are beehives in the garden, and we get honey enough to substitute.\n“I’m going to try making limoncello,” Marcus says to me. He’s brought over a plate because I’ve had enough of standing for a bit, too much weight on my feet. “Jamie’s been experimenting with the potatoes again, says she’s got a good vodka going. I reckon if I can set up an air circulation system so far above the Earth, I can manage a still now.”\nJamie and I share glances across the room and try not to laugh. Marcus has tried stills before. It never goes well. I remember a cucumber gin that was brown and tasted nothing like cucumbers. Marcus had drunk it anyway, trying not to wince. “It’ll toughen the stomach,” he said, but none of the rest of us were game. I mean really, wastefulness is a ridiculous thing but there are limits. He’s not managed anything drinkable yet, but this party is to celebrate postponement as much as anything else: the idea that anything can be achieved with dedication and time, that a dream deferred isn’t a dream given up on.\n“Have they set a date yet?” I ask him.\nMarcus shrugs. “For the next launch? No. It’ll be a couple of years at least, I think, depending on how much carbon we can claw back.” He smiles as he says it, and it’s bittersweet. The local school kids had offered, earlier, to forego their yearly camp, wanting to contribute their share of carbon reduction so that he could get into space just a little earlier. The emissions from their transport might only be small, but every bit added up. He hadn’t accepted, though we’d all seen how touched he’d been, and the kids had bargained down to some extra days of planting. The lawyer who made the muffins that Marcus so loathed—there had been muffins tonight, brought as contribution to the meal and as usual demolished by everyone but him—had a son who specialized in wetlands, and who was organizing to restore a small stream. The kids could help with that, both with planting and restocking the stream with eels and fish, and in return Marcus would visit the school and talk to them about disappointment, how to live with it and turn it into something better, and how it wasn’t the end of dreams.\n“What about you?” he says. “Set a date yet?” It’s a difficult question, and one I wouldn’t have brought up on my own, not at a celebration that isn’t about me. For Hannah’s life to have the most impact, for her to be able to make her own great contribution, the birth would have to be carefully managed. Induction was set for only a few weeks away. Part of me couldn’t wait to meet her, and the other part wished to keep her with me forever, elephantine pregnancy or not.\n“Yes,” I say, “but I’d rather not talk about it right now if that’s alright. It’s supposed to be a happy day.”\n“It’s supposed to be but it’s not,” he says. “Don’t look like that, I’m doing my best. I’m grateful for what I’ve got, for the opportunities I’ve had. But it’s not the same.”\n“No. It isn’t.”\n“Well,” he says. “In a minute or two I’m going to ask you to dance, if you think you can manage it. We’ll spin about a bit and pretend to be happy until we are, or until we’re as close as we can get. But before then, if you can spare an hour or so in the next few days, Matt would like to talk to you.”\nMatt was his brother, an artist who I spoke to rarely these days because he preferred to spend his time in the garden tending to the greenhouses, and the humidity there made me uncomfortable now.\n“Sure thing. I haven’t had much of a chance to talk to him tonight anyway.”\n“Great. Up we go then. Jesus. Are you sure you haven’t expanded since this morning?”\n“You bastard! I have not. I think.”\n“Well, don’t expect me to dip you or anything. I don’t think my back could take it.”\n“Pity your feet can’t,” I say, tartly, and contrive to step on them at every second spin. It makes the both of us laugh, but me a little bit more.\nMarcus isn’t the only one to visit the school and speak of disappointment. Honestly, I thought twice about it. Changed my mind more than once, but there’s a responsibility, isn’t there, and you can’t argue for the value of compassion without being willing to receive the same. The kids might be young, but they deserve the dignity of being allowed to be kind.\nI went the week before Hannah was induced. That way they could feel her even if they couldn’t see her, though of course I took along the ultrasound photos so they could see her face while she was still alive. I don’t know how many of them have seen an adult cry before. I hope I’m not the first. The questions are different from the ones I’m used to.\n“Are you going to have a birthday party?”\nThat one hurts.\n“Hannah isn’t going to live long enough to have a birthday party,” I tell them.\nThis strikes them all as monstrously unfair. I didn’t think I’d find myself laughing, but the absolute indignation on their faces is horribly funny. The conversation devolves into the kind of birthday cake that Hannah would like best, if she were able to live long enough for a birthday and solid food. I tell them how much I like strawberries and that’s the decision-maker: a sponge cake stuffed with strawberries and cream.\nI’m not sure I’ll ever eat one again. It’s not their fault; they’re doing the best they can. And it’s not like I’m here for emotional support. That would be unfair to expect. They’re only kids, that shouldn’t be on them. It’s important that they learn to feel for other people, to be comfortable with their emotions, but some things are as yet beyond them.\nOne of the kids asks about termination. She’s twelve years old, and that’s not a discussion I was expecting to have, but I’ve always thought anyone old enough to ask a question should have it answered honestly. “I thought about it,” I tell them. “I wondered if it would be kinder to let her go quietly, to let her go to sleep before she was old enough to be born. And I wondered if it would be kinder to me, if it would hurt less that way. I didn’t know what to choose. I didn’t think either choice was bad, and kind people would have helped me either way. But in the end, I decided that making it hurt less was maybe not so important. The only way to be hurt this badly when someone dies is to love them, and it’s not good to live without loving someone. Grief isn’t a bad thing. You’re all going to feel it one day, if you haven’t already, and it’s important to be kind to yourself when you’re sad, and to let people be kind to you, and to be kind to them when they are grieving too.”\nIt was something I tried to remember when Hannah was born, and the school sent a packet of cards and drawings. I opened the first one and it said, “Welcome Hannah! I’m glad you’re here, and I’m sorry you don’t get to stay,” and when I stopped bawling, I gave myself permission to pack up the rest and read them later, when her absence was an accomplished thing. (When that later came, months afterward, it was . . . I don’t want to say it was a relief to read them, because relief isn’t quite the word, but I was glad to see her acknowledged, her existence celebrated, because she deserved it, and so did I.)\nBefore Hannah passed, the nurses at the hospital made ink prints of her little hands, her little feet. I took them with me when I went back to the school to tell the story of what had happened to her. I told them about the child who had received her corneas, and how he would grow to see the world through a lens of generosity. I told them about the child who received her heart, and how he would grow to feel kindness pulsing through the world like a living thing. I told them about the child who received her lungs, and how she would breathe in the air of a world where all the living creatures were connected.\nThe kids asked if the grief was worth it.\nI told them that it was.\n“I knew that Hannah might be able to help other people grieve a little less, perhaps, and that seemed like a good thing. I think if she were healthy, I would like to see her grow into a child as kind and clever as all of you. A kid who would help people if she could. I wanted to give her the chance to make a difference.”\nI got home, feeling wrung out, and found a couple of bottles of limoncello left on my doorstep, from a man who had visited the same school not so long ago to speak of his own disappointment, who knew how it felt to flay yourself open before others and to stand upright, still, and accept instead of scream. I drank myself silly and sobbed into pillows until they were as covered with snot as I was, and I woke in the morning with a pounding headache and not much sense of relief.\nTwo days later I dropped back the empty bottles. “You look terrible,” Marcus observed. “Want to come weed the strawberries with me?”\nHe’d taken over my own volunteer hours at the community gardens, I’d heard. Him and a few others, contributing what they could so that I’d be able to have the time and space to grieve. I knew some people who wanted to work through their own trauma, who’d wanted routine and labor and something to structure their days by, but that hadn’t been me, and so my own needs had been quietly accommodated.\nIt had been a while since I’d been to the gardens. I found it hard to remember when. The past few months had done for all my sense of time.\n“I can’t promise it’ll make you feel better,” he says.\nI go anyway, and it doesn’t, at first.\nMarcus finds me in the memorial garden. It’s not just for Hannah, though the sculpture his brother made to help me remember her is here, amidst all the other signs of remembering, for all the other grief and losses. The sculpture’s a pretty thing. A little abstract for my tastes, perhaps, but there are times when I visit and see it out of the corner of my eye and the pieces seem to slot together and shimmer, somehow, and it looks like a shining bird about to take flight. Three years since she died, and the thought of her now makes me smile before anything else. I’m considering trying again. I think I’d like that. I think that Hannah would have liked being a sister.\nI know why he’s here. Awkward, his hands not quite relaxed enough, wanting to be the first to tell me and not knowing that a friend had broken the news this morning, after she heard it from someone she worked with at the university, on the quiet.\nI smile at him, and it doesn’t hurt. “Carbon’s under control again,” I say, and Marcus winces.\n“You heard.”\nExploration is important. Going to the moon is important, and people all over the world have been saving, so that there’s a chance for others to go ahead. The space program’s back on, the moon shot brought out of abeyance, albeit a year later than anticipated. Marcus’ dream will be realized on Hannah’s birthday.\n“I can remember and be sad for me and still look ahead and be happy for you,” I tell him. No one has been crass enough to tell me that life goes on, but it does, and that has come to be a comfort. There is comfort, too, in reciprocity, and how, in the past, he had put his sadness aside in service of mine. It would be shameful to do less.\n“I’d rather it were any other day, but it’s not up to me,” he says. “And I know that sounds like I’m making this about myself.”\n“There’s going to be a party,” I say, because of course there is. Why wouldn’t there be? It’s something to be celebrated, that one of us is going to the moon. A member of our community, reaching for the stars. “You’re not going to be here for this one.”\n“Fingers crossed,” he says. He stands beside me, and we contemplate his brother’s sculpture, the clean lines and intimations of it, the quiet beauty. “I won’t be upset if I hear you don’t go.”\n“Of course I’ll go.” As if there was any question. “Would you be upset if I brought a cake? I know you won’t be there, but it’s your party really.”\nThe scent of strawberries wafts over the hedge, warm in sunlight. “Something with candles,” he says. “I think that’d be lovely.”\nOctavia Cade is a New Zealand writer. She has a PhD in science communication, and is currently occupied writing climate fiction and writing about urban ecology. She’s won four Sir Julius Vogel awards, and was the 2020 writer in residence at Massey University. Her latest book, The Impossible Resurrection of Grief, was published in 2021 by Stelliform Press."}