{"fingerprint": "B7PqYK/++0lqStT4f2ayzdEx1sI=", "sitename": "Clarkesworld Magazine", "title": "The Stone Weta by Octavia Cade", "author": "Octavia Cade", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cade_08_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Stone Weta by Octavia Cade", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4350 words, short story\nThe Stone Weta\n2018 Finalist Sir Julius Vogel Award for Best Short Story\nHemideina maori\nIn winter, the mountain stone weta crawls into crevices, into cracks in the stone and it squats there, waiting. It is a creature of summer days and winter strengths, of cryogenic hibernation. When the world freezes about it, becomes a stretch of snow and ice and darkness, the stone weta freezes solid in its bolthole. Eighty-two percent of the water in its body turns to ice; the weta is climate in a single body, it is a continent broken off and geology made flesh.\nWhen the weather warms the weta thaws, resumes its life amidst the stone monuments of the Rock and Pillar range.\nFemale weta survived the cold more readily than the males. The Stone Weta laughed under her breath. There was a frigidity joke to be made there somewhere, but in her experience winter was a time to lie low and endure and women were better at that, overall, than men. Resistance was revolution, sometimes, blood and dramatic acts, but more often it was survival. More often it was preservation, and the data she carried with her was for preservation more than revolution.\nThe new data she’d received, smuggled over from Resurrection in a tiny drive, hung down between new breasts. The Stone Weta was still getting used to the weight of them, in love with the curves of the body she’d always felt she was meant to have. The university had been supportive of her transition, colleagues coming by with easy-freezing foods so she wouldn’t have to cook so soon out of the hospital, and there was still some leave left. But the Stone Weta didn’t like to leave data where it might be searched for, or where someone could stumble over it when they popped by to fill up her cupboards.\n“There’s such a thing as too dedicated,” said her doctor when the Stone Weta decided to come back to work early. The invertebrates could wait, he argued, but what he didn’t know was that they were only an excuse. The Stone Weta had an insulated lockbox hidden up in the Rock and Pillars, buried deep in a lonely crevice.\nThe lockbox was stuffed with climate data. Information come from another country, an administration that was purging files—and the Stone Weta was a biologist with colleagues in other disciplines, and she kept their geology for them.\nSelaginella lepidophylla\nA desert dweller, the resurrection plant is adapted to dehydration, to the long dry seasons of its arid environment. Parched for short periods, its outer stems curl into circles, but as the waterless days endure the resurrection plant hunches further down, its inner stems compressing into spirals and minimizing surface area. Tucked in, the resurrection plant survives almost complete desiccation. Until the rains come it takes on the appearance of a dead thing, but beneath the surface there is revival waiting.\nResurrection was raised on the southern borders of the Chihuahuan desert. She played there as a child—carefully at first, until she learned to adapt her play to climate—and she was grateful for that apprenticeship in aridity. It had taught her what it was to have boundaries, and what it was to have them broached. Water evaporated out in the desert; sweated through skin that seemed sometimes to be a too-permeable thing.\nBut then all borders were permeable. There wasn’t a wall built that couldn’t be overcome, and although Resurrection had relatives she no longer saw, could no longer see for they were afraid of leaving a country they might not be able to return to, she had other means of contact.\nA botanist was expected to attend conferences, to promote the conservation of her region. “Mexico has one of the most biologically diverse deserts on the planet,” she said, talking of the work she was doing, the population surveys, the challenges of long-term monitoring. “We have a responsibility to ensure the preservation of this natural wonder.” She took some of the attendees on a field trip, introduced them to ecologies not their own. In the middle of the hike, one of the foreign scientists—a woman who was deliberately, inanely chatty in her conversation and as such roundly ignored by the rest of the party—stumbled in the sand. When Resurrection took her hand to help her up, a drive was pressed into her palm.\n“Thanks,” said the scientist. “Clumsy me! Always tripping over my own feet.”\n“You’re welcome,” said Resurrection, pocketing what was given her without a glance. “But it wasn’t your feet you tripped over. Have you seen this plant?” She explained about the curling as the others gathered round, demonstrated the beginnings of reversal with her water bottle. “It’s amazing what can survive out here,” she said.\nFor all the drama of above-ground, of the resurrection leaves, it was what was buried beneath that she found most important.\nRoot systems went deep in the desert.\nThe Stone Weta always copied any data she was given before she buried it in the Rock and Pillars. Caching data was a useful fallback, but caches had been discovered before. The Stone Weta had only heard bits and fragments, passed on from her own minimal sources, but Bristlecone Pine had gone silent. Arrested, most likely, with her data confiscated and, presumably, destroyed.\nNow it was spread internationally, each piece of information replicated and hidden at several sites. The Stone Weta didn’t know all of them. She only knew who she was to pass her data sets on to. That way her potential for betrayal was limited.\n“Not that I would, not if I had any choice,” she promised. She tried very hard not to think of the choices that Bristlecone might have been given. (The choices that might have been taken away.)\n“We all like to think that we’d be brave,” said the Glass Sponge. She’d come to stay for the party the Stone Weta was throwing, to celebrate her new shape with friends while she could.\n“A Show-Us-Your-Tits Party,” said the Glass Sponge, into her third wine and tactful with it.\n“You’re all class,” said the Stone Weta, emptying the bottle. “Such a fucking lady. And you should be so lucky.”\nThe Glass Sponge sighed, wistful, and the Stone Weta sniggered into her glass. She’d been recruited by the other woman a couple of years previously. They’d flatted together at uni, and the Stone Weta hadn’t ceased to be amazed that such were the things resistance was made of—the memories of Dunedin winter, cheese rolls and tramping; a history of shared homework and early morning lectures. Soft power and social circles.\n“My turn to find someone soon,” she said.\nScolymastra joubini\nThe glass sponge crouches on seabeds beneath the Antarctic ice. The silica skeleton sways in the dark water, chilled by the currents of a continent. It is the oldest organism on the planet; for 15,000 years, perhaps, the glass sponge endures a long night, its growth a slow and silent thing. But the ice shelves collapsing above, calving off in response to climate, have brought light and plankton in levels the glass sponge is not accustomed to and it grows wildly, branches out quickly while destruction takes place above it.\nThe Glass Sponge spent her summers in the Antarctic, trying to determine the effects of a shifting climate upon polar biota. She was part of a community there: scientists stacked on top of each other, a small society isolated by climate and vocation.\nHer secondary role there was an open secret. Scott Base was a facility set up for knowledge and the sharing of it, run by a country that was far enough away from the seats of power that it was frequently overlooked. Being small and hidden away at the bottom of the world had its uses, and unimportance was as much a defense as armor.\n“Don’t you ever want to just come straight out with it?” the Glass Sponge was asked. “Say to hell with it, Scott Base will take your data, send copies to us and we’ll store it away where no one can tamper with it.”\n“I’m sure the government would love that,” she said.\n“It’s not like New Zealand hasn’t told a superpower to fuck off before. We did it on nukes, we can probably get away with it on climate. It might encourage those bastards in Wellington to finally take a stand for once.”\n“If Wellington wants to come out on data protection I won’t stop them,” said the Glass Sponge. “But I’m not in charge of what we do here, and I’m not just talking about the Base. I didn’t set up this network. The person who did is responsible for scientists all around the world—and not all of them live in countries that wouldn’t sell them out if power came knocking.”\nThere was no answer to that. The Glass Sponge waited to be asked who was in charge, but the question never came. She took that discretion for the support that it was and was grateful.\nBesides, even if she were aware of the real-world identity of the Sand Cat she would never have shared it. Some secrets weren’t hers to tell.\nFelis margarita\nThe sand cat protects itself from sunlight, and from the lack of it. The desert is a place of extreme temperatures and the bottom of its feet, the spaces between its toes, are thick with fur for when the sand is scalding in the noon sun. This fur blurs its footsteps, and the tracks of the sand cat through the dunes are hard to follow.\nThe sand cat, relative to its size, bites harder than any other feline.\nThe Sand Cat learned early and well the importance of preservation, and of libraries. The Timbuktu manuscripts were the pride of her city, hundreds of thousands of them spread through numerous private households. As a girl, the Sand Cat had seen her uncle inherit the family library, had seen him swear to protect it for the whole of his life, as was right and good.\nAs a woman, the Sand Cat had seen those manuscripts a source of danger as well as pride. The Islamic fundamentalists in northern Mali had tried to destroy them, and while they had managed to burn some the people of Timbuktu had come together to preserve the rest. Manuscripts were bundled up, were buried, were smuggled out of the city to safety, a costly and perilous process but one that had resistance and love of learning down the very spine of it. Residents endangered themselves, endangered their families, by accepting small parcels of text to hide in their homes. People were beaten every day on the streets for lesser crimes. They were mutilated, they were executed.\nThey hid the manuscripts regardless.\nWhen the Sand Cat saw the same thing happening again, albeit in another country and with another target, perpetrated this time by government instead of rebels, she refused to countenance it.\nThe very idea offended her. It offended her down to the marrow, and the Sand Cat felt herself begin to hiss with rage.\n“Why do they keep trying to do this?” she spat. “It is knowledge they go after every time!”\n“Of course it is,” said her uncle. “People who know nothing can be controlled.” His texts had been saved, but the effort had turned his hair to iron.\n“It has done the same to my heart,” said the Sand Cat.\nTimbuktu had taught her the value of knowledge, and of preservation. It had also taught her how to network. The Sand Cat was involved in setting up reforestation projects, working to increase planting and this gave her access to scientists involved in similar projects in other countries. It was perfectly normal for her to consult with them on best practice, on their strategies for environmental conservation and how best to involve affected communities. Such consultation was not only normal, it was encouraged.\nAnd if the conversation wandered, what of it?\nGeckolepis megalepis\nThe fish-scale gecko is an escape artist of particular and gruesome aspect. Its sister-species amputate themselves in the face of predation, but the fish-scale gecko holds its escape in its skin instead of its tail. That skin is large-plated and scaly, and its attachment to the flesh beneath is temporary. When the fish-scale gecko is grabbed or threatened, it sheds its skin and skitters, bald and pulsing, into trees.\nThe Fish-scale Gecko was in constant contact with the Sand Cat. Madagascar was not Mali, but the Fish-scale Gecko spent her days as a park ranger, encouraging eco-tourism in the tropical forests. “Poverty is a trap,” she said. “People need to live. And if slash-and-burn is the only way for them to make a living, then that’s what they’ll do. You have to find a way to make sustainable use of the forests economically viable.”\nThe Sand Cat knew that, but she made appropriate noises anyway, was seen to take notes. Escape was a useful survival tactic but camouflage was better. “Eco-tourism is proving a viable option, then?” she said.\n“Over fifty percent of visitors take part in some form of eco-tourism. The forests are a big part of that. Something I’ve found tourists particularly enjoy is being hoisted up into the treetops. It gives them a whole new perspective on rainforest ecology. That’s particularly useful given how much tropical forest cover is decreasing globally.”\nOther operatives might hide the data entrusted to them in the ground, but the Fish-scale Gecko was a creature of heights and canopies, and when she stashed it was arboreal.\n“Is this just at the one location?” asked the Sand Cat.\n“For now, but it’s a popular activity. Too popular, perhaps. I begin to think all the activity in one area is compromising the local ecology.”\nOver the monitor, the Sand Cat froze and it was almost imperceptible, had not the Fish-scale Gecko been looking for it. “That is . . . concerning.”\n“I’ve been scouting for new sites. But we’ve a busy program of local events coming up, so I might have to put it off for a little while.”\n“You’ve been so helpful,” said the Sand Cat. “I really appreciate the time you’ve spent advising me. I realize I’ve been adding to your workload. Would it be useful to put our consultations on hold for a few months?”\n“That’s probably a good idea,” said the Fish-scale Gecko. Her skin itched, and she could feel the talons closing around.\n“We’re going to miss you.”\n“I’ve still got a few months,” said the Stone Weta. “But thank you. I’ll miss you too. I’ll miss everyone here. The department’s been good to me, and that’s in no small measure down to the administration. Down to you.”\n“My pleasure,” said her department head. “You’ve been a real boon to us. It’s not many universities can say that one of theirs has been tapped for Mars.”\n“Mars needs entomologists too!” said the Stone Weta. The first manned mission, a colony group of scientists and that mission one way. “It’s an extraordinary opportunity, to help create an ecosystem.”\n“You’ve certainly had practice,” said the head. Her voice was carefully bland. “I mean, of course, your work up in the Rock and Pillars. Though I suppose that’s as much preservation as creation.”\n“It’s an extraordinary interaction between organism and environment,” said the Stone Weta. “It deserves to be protected.”\n“Absolutely. Oh, talking of the extraordinary, you won’t believe what’s turned up in my inbox. Accusations that someone at this university is smuggling, if you can believe it. Smuggling data. Ridiculous—sounds like they’re fishing to me. I forwarded the email on to Foreign Affairs, told them I didn’t know anything about it.”\n“Don’t you?” said the Stone Weta, her voice level.\n“Not a thing,” said the head. Her gaze was very direct. “And I certainly don’t have time to go looking. I’m too busy hunting for a replacement for you!”\n“I’m sorry to cause you trouble,” said the Stone Weta.\n“If you’re that sorry you can help out. There’s a young woman visiting next week, come for an interview. She’s a potential grad student, looking to do her PhD. Was recommended by a colleague over in Suva—she did some summer fieldwork there in her undergrad. I’d like you to talk with her, see what you think. I hear she’s very independent-minded. I like that in this department.”\n“I’ve noticed,” said the Stone Weta.\nAsterias amurensis\nThe Japanese seastar owes its success to adaptability and reproductive strategy. It owes that success, as well, to the interconnection of the world. Its larvae spread through ballast waters, are shipped to other oceans and other countries. It is one of the most invasive species alive, and there is hungry persistence in each of its five arms.\nOne of the things that the Japanese Seastar enjoyed most about marine biology was that it gave her the opportunity, so often, to speak with others in her field. The marine environment was linked, all of it flowing together, and the conferences were frequently global in subject as well as in participants.\nShe had just attended a particularly interesting session on the effects of climate change upon Antarctic glass sponges. Her own contribution, as one of a panel on combating invasive species, was scheduled for later that afternoon. It promised to be popular—invasion was an issue that could exercise many a biologist.\n“We so often have to deal with pests. It’s rewarding to find a way to hit back! A job for scientists of sneakiness and strategy.” She grinned coquettishly as she said it, circulating through the morning tea, relishing responses. The Japanese Seastar was aware that she looked pretty and small and unthreatening. Charm was her greatest asset.\n“I need a deputy who can make connections quickly,” the Sand Cat had told her. “Someone who can accurately and discreetly assess the character of others. Someone people will trust.”\n“I’m your woman,” the Japanese Seastar had said. “I’ve a very long reach. Fingers everywhere!” And held them up, wriggling. The nails were brightly painted.\nIt amused her to take the name of an invasive to fight invasion. She’d seen what happened when things went wrong. It wasn’t enough to store data online, to spread it over the net where everyone could see it. Viruses could change that data easily enough, falsify findings and make the effects look smaller than they were, make the data less of a threat—and without a hard copy to compare it to, without the original data cached, it was difficult to prove the tampering.\nThe Japanese Starfish didn’t hold a cache. Instead she held drives in her bright pretty handbag, and handed them out like candy at conferences, albeit quietly and carefully. A good proportion of the scientists attending worked for her anyway, and the contents of their own handbags would later disgorge in other waters, and go to ground in foreign shores.\n“I’ve felt a chrysalis for so long,” said the Stone Weta. “Transformation comes easily to me.” Change of body, change of purpose. Change of planet. “Well, not always easily. But it comes and I have learned to adapt to that. It doesn’t work that way for everyone.”\n“If you think I don’t understand necessity and change you can think again,” said the girl. The girl—she wasn’t very much younger than the Stone Weta. And she had a name, but the Stone Weta tried not to think of it. That name was irrelevant—she was here to see if there was a Fish-eating Spider, not a tired young woman from Tuvalu, forced into immigration as a child because of rising waters.\n“Why Dolomedes dondalei?” asked the Stone Weta.\nThe girl who might be the Fish-eating Spider shrugged. “There aren’t many species where individuals go hunting for prey bigger than they are,” she said. “I found it refreshing.”\n“You’re angry.”\n“My home is being swallowed up by climate. No one gives a shit. You think my family was the last to leave? Hell, we weren’t even the first. We left years ago. I can’t even speak the language anymore! How’s that for transformation?\n“No one gives a shit,” she said again. “It’s all screwing with data now, trying to pretend that nothing’s happening. Fine. We’re all going to pretend everything’s fine. I can pretend too. But I’m going to pretend with an insect I can at least admire for gumption, because God knows the people around me don’t have any.”\n“It’s a dangerous identification though, isn’t it?” said the Stone Weta, remembering the sound of ancient trees gone quiet, of the silence where Bristlecone Pine had been. She couldn’t let anyone else get involved without making sure that they knew the risks they were taking. “Identification like that might make it easy to forget that hunting generally goes the other way.”\nThe girl narrowed her eyes, and for an instant the Stone Weta could see in them the shadow of many legs. “Sometimes danger is necessary,” she said.\nDendrocnide moroides\nThe gympie gympie covers itself with stinging hairs and neurotoxin. It is one of the most poisonous plants in the world, and one of the most painful. A human who brushes up against a gympie gympie will experience agony for up to two years: it is a most persistent reminder of trespass.\nIt flourishes best after disturbance, when the ground is overturned and in full sunlight.\nThe Gympie Gympie buried her caches in shallow soil. She didn’t use a single lockbox, didn’t add to the same location more than once. Instead there were a dozen little burials, all in the open air with gaps in the rainforest canopy above. Atop each burial she planted a small specimen of D. moroides.\nShe wore protective gear when she planted; amused herself by picturing what would happen if some poor bastard came looking for what he shouldn’t. The Gympie Gympie’s ancestors had walked the tropical ecosystems of northern Australia for tens of thousands of years before the Europeans came, and she had been raised with their knowledge, had gone away to university for ecology and come home to her own lands.\nShe didn’t much care if she were followed; there were more dangers here than interrogation, than imprisonment and the betrayal of science. No one that followed would know those dangers like she did. Anyone alien enough, who didn’t know what they were getting into, deserved what they got as far as the Gympie Gympie was concerned. There was a reason she supplemented the buried seeds of science with silica and poison, and it was so the lands of her childhood weren’t ravaged further than they had to be when the climate turned.\nThe Sand Cat might have prioritized preservation, but the Gympie Gympie was all about justice. Her own country wasn’t so fucking innocent, and she had no pity left in her burials for guilt.\nBuellia frigida\nThis Antarctic lichen of the Dry Valleys grows slowly, perhaps a single centimeter for every millennia, but it does grow. The lichen is so accustomed to extreme cold and aridity that it is used as an approximation of what life may be capable of on Mars. Experiments on the International Space Station, where the lichen is exposed to the conditions of space, as well as to a simulation of Martian environments, prove that the lichen is capable of enduring both.\nThe Antarctic Lichen floated through the ISS, making her way to the docking port. The transports to the Mars colony were almost ready to go, and the scientists that had been ferried up and through the ISS to their respective ships had almost been offloaded. Only a few were left, and the Antarctic Lichen, assigned on permanent rotation to the Station, was going to say goodbye.\nShe didn’t know the Stone Weta, had never been informed of her true name, but when the Stone Weta had first stepped aboard with the tattoo curling round her forearm, all spiky legs and long antennae and big striped body, the Antarctic Lichen had recognized her.\n“Nice ink,” she said.\n“Kind of a last minute reminder,” said the Stone Weta, smirking. “I’m still not entirely sure of what. Endurance, maybe.”\n“Persistence,” said the Antarctic Lichen. “Rebirth, into a different world.” The world below them hung in space, green and blue and with the ice at its edges draining, the polar caps melting away almost as she watched.\n“Transformation,” said the Stone Weta. “I am . . . familiar with the concept.”\nThere was little chance to talk. But as the Stone Weta prepared to disembark, the Antarctic Lichen gave her a small box. “If you could transport that over to your ship I’d be grateful,” she said. “Last minute additions for Buellia. Just pass them on, please.”\nAnyone around them would have thought the box was to be handed over to the colony’s botanical department. B. frigida was making the trip, after all, and it gave the Antarctic Lichen some comfort to know, after all her experiments on it, that if the lichen’s native environment was at risk then there was, still, the potential for it to survive on other worlds.\nMars had the potential to preserve a lot.\n“It’s amazing what can survive in such inhospitable places,” said the Stone Weta.\n“I have every faith,” said the Antarctic Lichen, waving through the window in the airlock. It was perhaps paranoia that made her send data to the open plains of another planet, but she couldn’t keep hoarding on the ISS, where there were limited opportunities to unload.\nData that couldn’t be shared was always at risk.\nThe Fish-eating Spider stared up into the dark. Though she could not see it, the ship carrying the Stone Weta had begun its journey to a harder planet. The Fish-eating Spider did not envy her. She would have missed the stream-sides, the night-sounds of water and the creatures that lived beside it. The way the earth smelled when she turned it over for burial, the shovel new-bought and shiny in her pack.\nA drive of smuggled data hung between her breasts, waiting for the morning.\nOctavia Cade is a New Zealand writer. She has a PhD in science communication, and is currently occupied writing climate fiction and writing about urban ecology. She’s won four Sir Julius Vogel awards, and was the 2020 writer in residence at Massey University. Her latest book, The Impossible Resurrection of Grief, was published in 2021 by Stelliform Press."}