{"fingerprint": "wkVjY913tvKRv56ZlLptXPpmkrY=", "sitename": "Clarkesworld Magazine", "title": "An Urge To Create Honey by Martin Cahill", "author": "Martin Cahill", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cahill_04_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Urge To Create Honey by Martin Cahill", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4680 words, short story\n An Urge To Create Honey\n You stand in the airlock, wondering when they’re going to let you come back home.\n As you wait, the new, delicate hairs on your body twitch, thousands of silent cilia sipping at this new vacuum, processing data at a rate nearly twenty times faster than your meat-brain. We can feel you trying to understand, trying to adjust.\n Your new vocal cords modulate internally, the infant drone’s song of frustration, of fear. Your hands, new and old, flex; two of them clutch at your head, just shy of the eyelash-fine antennae, which twitch in your distress. Your song of unhappiness is shifting from subvocal to aural, and even in the dead air, a hum is building. After all, we were grown to sing to each other between the stars; one day, you will, too.\n But for now, you stand here, frustrated and sad as the people behind the glass wait, growing nervous at your buzzing.\n You’re so new to the hive, young one. Our memory is long; sometimes, we forget the now, that you are so new to being one of us, your connection to us fragile as spun sugar. If we’d had our way, you would be cradled still, connected by dandelion tendrils to the heart of home, growing, learning. We would not have let you go so easily.\n Yet here you are, standing patient at the doors of your past, ready to do your duty when you should still be with us, nestled in the gold heat of the hive, learning to become us.\n But no, the need is dire. The humans—excuse us, the station wouldn’t have hailed us if they didn’t need us.\n Need you.\n We didn’t know what you would become when we rescued you all those months ago, when we fed you and clothed you and healed you as we only know how, by consuming you, transmuting you.\n We didn’t know what the first human to enter our family would be like; in moments of darker humor, some of us thought you would not survive our honey.\n But you did.\n Then, we feared you would not thank us for saving your life. That it was not our right to collect you from the velvet dark and nurse you back to health. It would not be the first time a human had misunderstood us, deliberately so, and if you ran away in horror, at least you would do so with a beating heart.\n But you did thank us. With a newborn’s unsteady buzz, you were gracious, kind. Even as your psyche only partially melded with our hive, you exuded gratitude, warm and glowing. Even as new appendages grew outward and your body changed from our honey, even in your deepest moments of despair, which we felt as much as we saw, you clung to curiosity’s mast, unwilling to drown in fear’s roiling waves.\n Here, as you wait for the figures behind the glass to hold up their end of the deal, we taste your fear again. There are many kinds within you, of course; but the string that is plucked loudest is that you will not be able to go home again. That the crèche-room you grew up in will have been given away, that the books with your old name in them will not be waiting for you, patient as only paper saints can be. That image of the twenty-foot cell, your previous hive, sits in your mind, solid as a stone.\n How we wish we could encircle you in our million-arms, hold your body thorax-close, and whisper from soul to soul: child, there is no going back; there is no home to return to, only the one you make.\n But this is a truth you know, even as you try to hide from it. A relic of your humanity, that; your need for evasion will fade. All we can do is midwife you through it.\n A hiss slices the air. The massive metal door shunts open, and you walk into the corridor, relieved, the song within you growing loud and vibrant.\n When it closes behind you, small cannons burst from the metallic walls, pivoting to face you. Of course, we sigh. Your humans, they don’t know the difference in your songs like we do. They think you are dangerous, while dismissing how dangerous they are in turn. Even if they cannot hear overtures of peace in your song, they should at least see you’ve retained your humanoid shape, despite the changes.\n If it was one of us in that death-box, moments from erasure, the answer would be immediate and aggressive, as it has been through our generations of conflict. The war-echo would begin, and our song would begin to vibrate with the millions of millions of us back in the hive, a show of force, sword-heavy with meaning: kill this one and you will answer to all of us.\n But already, you show us the ways we can grow. All four of your hands raise, gesturing to the cameras with open palms. Your vocal cords do not naturally move in the ways of your former physicality, but with strain, you help them remember their old shape. Through the buzz of the fear-rattle, you speak with words, physical words that people of your once-home can hold in their hands and hearts.\n “Noooooooot daaaaaanger,” you speak, voice thrumming like digital discharge. “Heeeeeeeeeere toooooo heeeeeelp . . . ”\n Words, crude. Inefficient. Dead little sounds that convey no depth, no truth. The humans behind the glass cannot understand the burst of pheromones from you, can’t taste the complexity of your fear, or your hope, that now, today, a bridge can be built if only it isn’t burned down first.\n We catch a whisper from behind the glass, “God, it still sounds like him . . . ” Your four hands tremble, and we wish we could comfort you.\n But you asked to do this alone, and so we let you.\n There is a hum as the weapons within the death-box lose power and go silent. Your eyes flick up, staring into the one-way glass, your new layers of lids opening and closing; already you develop your nervous tics, your habits of worry; you adapt. We are so proud.\n And then the door opens and in floods education.\n You see, though we’ve met humans on battlefields of star and stone, not a one of the hive has ever made it past these bulkheads alive. Neither drone nor gatherer nor knight has ever walked through on forelegs with heart still beating. From the dying minds of our beloved children, we had seen only phantoms on the other side, tasted the ghost flavors of the station air of our then-enemies.\n It all only added to our terror, our rage, that we couldn’t understand them, couldn’t know the contours and steel-smells of their own hive when they have so ruthlessly sent their metal-drones into ours with not so much as a greeting dance.\n But today is a new day for many reasons, and as you walk in, we drink deeply from your thousand-points, learning finally the world of humanity.\n A hiss-hum tango of oxygenation through vents like veins. The sterile, fractal nothingness of vaporized trash and dirt particulates hushing through space as cleaning programs activate. Flashes of light from pedestals and screens, winking in a language all their own. And there, the sweat sitting unscrubbed from starched uniforms, as deep a blue as Midori’s cosmic heart; it twinkles through the air like song, their own pheromones recognizable as music but so different from ours, so vulnerable.\n We . . . hadn’t expected them to be as afraid as we are. Were. Are.\n Nor as hopeful.\n One of the uniformed people steps forward, knight-caste. You are a head taller than them, and they look unaccustomed to tilting their gaze up. Looking up at you in particular.\n You sink to a knee, and they adjust their gaze. There is a smile on their face, barely so. Your song has shifted, and it is mournful and joyful, seeing this knight-caste. An old friend, we realize, recognizing the key change. An old friend who you are so happy, so scared, to see.\n They place a brown hand under your chin, tilt your head up. We look through your eyes, two old, four new, and we see them study you until finally: recognition.\n “It really is you, Jonah,” they say, the words soft as breath, making the hairs of your face swoon with movement.\n Jonah. A word as useless as a molted husk, as precious and tender as newborn carapace. A name. Not a thing we’ve ever had use for, but your song deepens at the mention of who you were, what you were called.\n That it still has meaning to you is bittersweet in our hearts. But we will regard it as lovely because that is how you feel about it, too.\n You nod your head, not daring to attempt the dead-sound speech again. But in your mind, we hear the whisper of a name, a title for the knight-caste: Isla. So, Isla they will be to us.\n As you nod, they nod in turn, raising another hand to signal the soldier-caste surrounding you both. There is a shift of gravity as the rifles trained on you lower, a relaxing of muscle; is it wrong that we didn’t even notice? So often it was the last thing our beloved drones saw.\n May things be different this time.\n We see them study you as the thought enters your mind, a dream remembered from a sleep you haven’t partaken in, not yet. Such is the way of the hive; memory is a currency we freely trade, not even knowing we have the coin until it is time to lend. The memory tickles neurons, stimulates muscles, and a twitch runs through you.\n A secretion builds on your wrist, bubbling like foam. One of the soldier-castes with a face like a detritus moon gestures to you, face turned up in disgust. “Christ. Is that what I think it is?” Many take a step back on instinct, though not Isla. They watch in fascination as the fear-glands of the others begin to pump.\n We . . . have labored hard within the hive to understand this fear. The substance that they fear is as holy to us as their deities, more so, since it is real and tangible. They call it, “honey,” a remark of wary wonder made in the heat of first contact all those generations ago. It is like that substance of Earth-past, yes. When produced, oxygenated air turns it a brilliant gold, and it sits thickly where it lands, before becoming part of the holy chosen. The closest approximation would be the human word “alchemize.”\n With our honey, we heal you. We fix what is broken by turning it into us.\n At least that’s what we always theorized would happen.\n You, beautiful you, are the exception to the hypothesis. You are not us, nor are you who you were. You are something new.\n No, what you make now at the wrist is opaque, more akin to webbing than honey. Some part of you knows what it will do, and you raise your three other arms, a universal gesture of “May I?”\n Isla, solid as truth, raises a dark eyebrow at the gesture. “You trying to get me to join your new club?”\n You shake your head, move a delicate hand from your lips toward them, willing them to know your meaning: communication.\n Finally, looking around, they nod. “Stand down, men. Jonah, approach. I’m . . . trusting you.”\n Ah, but we can hear the individuality within that “you.” Your old friend summons the ghost of loyalty they had for you, back when you were of their number. It is a kindness we did not expect, but we know it doesn’t extend to us. The hive will have to earn the kindness of humanity, as they will have to do the same.\n With a delicate pluck, you lift free the little spore and place it on the back of their neck. The pain is quick, the flash of a psychic-needle as their mind finds a place next to your own. We understand little of privacy, so we hear all that is to come.\n Is this better, Isla? Your meat-words are more elegant here within your mind; they are more than sounds here; they are the heat-flash of worry, the blue-star heaviness of fear, the worried erosion of confidence moment by moment, a remembered hand holding another hand.\n They touch the back of their neck, feeling the little spore sitting at the base of their skull. It will come away easily, and you both know it at the same time. They think at you, finding comfort in that which we find sorrowful: the voice in your mind is the same as when you were human.\n Jonah, this is all so . . . bizarre. Bruised violet petals of panic, quickly gathered up in a gale-force wind of control, scattered and just as quickly in order.\n You quirk your head to the side, and you smile as best you can around your new mandibles. Is it? I regret I can’t speak the way I could before. I know it makes communication . . . hard. But this way, I can do more than talk with you. I can show you.\n There is joy in your mind, and we feel them assent, agreeing as you show them the world of the hive, its warrens and catacombs, its royal-orrery and its library of minds, its many souls all working in harmony. And while they see the new world you inhabit, even this is not true communication. They hear your voice, yes; they see what you wish them to see.\n But Isla is not like you; they can’t taste the shades of radiation painting the dark highways of space. They can’t pluck memories from the millions strong of the hive. They can’t even understand the five-part song of worry-tenacity-fear-joy-comfort you’re humming to yourself right now, could only ever hear that top bass note and wonder.\n Ah, we have disappointed you. Strange, this. That we cannot flood your mind with serotonin or bliss, can’t extract you from sorrow as we can the others.\n That’s okay. Your individuality is not something we would want to erase, even if it confuses us. Besides, if the plea is to be believed, there is a chance, however slim, that true connection can be found here.\n Your mind turns toward the reasons for this visit and Isla catches the image of a young human strapped to a soft, teal bed. Isla blinks, disoriented, unused to the psychic bleed. “Right,” they verbalize for the benefit of their other soldier-caste, “you’re here for the girl. Come on. I’ll show you to her.”\n You walk past the dead-metal at the soldiers’ sides, flinching from the scar-memories of other drones; burning-red weapon barrels form a wall of testimony in your mind, the last thing many saw. Here, or at the Zeldrin Frontier or the Burning Border or the [static-filled song-screaming, distorted by weeping, under the indifferent light of a white dwarf star].\n The soldier-caste stare at you, even as the millions of the hive watch you with us. You don’t bow under the weight of these innumerable eyes on you. You can’t.\n There is work to be done.\n They’re young. It’s the first thing you notice, walking into the sanctified air of the medicinal-comb, the air cool as mist on your fine hair. They are barely out of larval stage, it seems, though we have always had difficulty knowing when your children stop being children.\n A palpitation. Old scar tissue pulses with pain, a score from memory’s knife.\n Cassie.\n Long, dark hair, missing teeth within a small jaw, a light of mischief in eyes hidden behind large, glass frames.\n This name, like Jonah, is precious to you. Maybe even more so. We will hold it to our many-hearts with reverence and care. It is always dear when your child has had a child, no matter the pain that comes next.\n “She’s been in a coma for a little over a month,” Isla says, reading a chart at the foot of the bed. “Found her in a distress pod, malnourished and unconscious. Oxygen was running low; too low. We fear brain damage. And we don’t really know the extent of it; medical has been hesitant to do anything beyond scans. They don’t want to be the one’s responsible for her flatlining. She was drifting in from the Grenna colony, and we lost communication with them months ago. Who knows what she was running from?”\n You go to a knee beside her bed, putting a long, delicate hand on the larva’s, your eyes searching their face. We know as well as you; the Grenna system is many light-cycles from here, and there are hungry things between there and here.\n Why wait for me? Why ask for me, Isla? You don’t take your eyes from the young one, but your voice is all iron in the mind of your friend. I’ve been with the hive for six months. Initial friendly outreach from the Queens had been batted aside, dismissed as nonsense or mind games. Not a one of you could believe I was alive; let alone a part of the hive you’ve been waging war on for generations. So, why the change of heart?\n The silence between you both is thick, congealing with all that’s unsaid. Finally, they say, Those reasons are classified, Jonah. If you want to know what Command was thinking, you’ll have to rejoin the Union, and on our terms.\n Bullshit. A flash of memory, the oceans of paperwork any human would have to swim through for even a simple answer. I’ve learned much in the hive, Isla, and first among them: there is no secret between minds that paper can capture. If you can’t speak freely here, you say, tapping your temple, then the Union truly has bought you, body and soul.\n A moment passes, two, lengthened by the speed of thought. You are ready to shunt them from your mind when they speak again, quiet and reverent, as though truth were church, and confession holy.\n I . . . was tired of this station continually failing its children, no matter where they came from among the stars. And I saw, in the message from the Queens, you had bothered to sign your actual signature, with the little star curlicue I always told you was unprofessional at best and I . . . I thought if it was really you, and the Queens were really interested in opening peace talks with an ambassador, access to their technology and medicine . . . that together, we could redeem this station, even a little.\n Again, the face of Cassie. That loss echoes through you like an ancient bullet, shattering every delicate organ it touches with its horrible momentum.\n Thank you. You both share a memory of the young one, of Cassie, before turning back to the child on the table. We’ll see what we can do.\n You stand then, turning all four arms over their prone body, whose mind has been sent away, it seems. For how long, we do not know.\n But we will.\n Our connection is different than with the other drones of the hive. Your mind does not unbend from the shape of individuality so easily. Your body grows and changes as ours has, retaining something of humanity, but your mind . . . at times, we know you worry you will never fully integrate into the hive.\n But when you focus and bear all your will, you can bring us to you. We can work through you. With focus as mighty as any starship engine, you open the mental floodgates, and we join you.\n Our millions are alive in the delicate strands of your cilia, the fine points of your antennae, the filaments on the pads of your hands and chest, the many facets of your eyes; we are you, and you are us. Together, we examine the larva-youth.\n Fluctuations in body temperature and reoxygenation, the history of trauma living in their blood and bone, the bruising internally, the healed wounds of the body . . . these are not the issue. No. Your old friends, the doctors, have done what they can physically. It is as Isla intimated: this is an ailment of the mind.\n Our many minds push at the child’s psyche, gentle as a scalpel in the hands of a surgeon. The reaction is almost immediate; they are in there, still.\n We renew our search with vigor, the old term on our thousand-tongues: cerebral hypoxia. We understand this; some drones are born blue, unable to fly into the ether-heights, destined for a life on the lower combs, content until the day they return to the Great Gold. This little one was starved for oxygen, but not all at once.\n You read their chart as we probe deeper, hoping to find a solution. We dance light-limber across their mind, seeing where it is safest to lift their mind up and out of this sleep.\n But as you read, we learn with you: the damage is too much. Too extensive, some of us whisper. We cannot raise the dead. We cannot forgo the price the Great Gold taxes us with. Even we have limits.\n Somewhere amidst the mass of the hive, we feel you react. We see you comb the child’s memory, those long, dark, cold days in a shuttle of the dead. Clutching a crinkled photograph to their chest, breath fogging the icy glass shield. Unable to see. Alone in the dark, dying by a thousand breaths.\n It is a miracle they have even survived so long, to make it here. We think as one, that it is not a bad thing, to die surrounded by the warmth of the comb, a knight-caste overseeing passage of the mind.\n Which is when it fills you.\n As we reconcile with the truth, a burning sparks within your chest, just beneath the fresh carapace. It aches through you like a minor key and in its sweet heat, you keen at the sorrow of it all.\n Yes. Yes, you feel it now. That which we felt upon finding you. That which we always feel when presented with a cold, unfeeling universe. The burning desire to make it right. The evolutionary imperative to heal that which is broken.\n An urge to create honey fills you, and it doesn’t matter how you are different: the hive shouts its pride and joy in unison as our new child understands us. It is enough to make the stars quake.\n Isla is not fast enough to stop you, doesn’t see what you’re doing until your hand is already deep within your chest cavity, desperately reaching for the answer your body is creating. Your fingers grab onto that vital thing and pull out a little white pearl, already turning gold as it’s exposed to the air, turning thick, oozing, becoming honey.\n You place it on the tongue of the child before Isla can finish drawing their pistol. “Jonah, are you fucking kidding me?” they scream, slamming a button with their other hand. A wailing klaxon rises into the air and all the doors open, the room flooding with soldier-caste.\n You stand there, patient and waiting, fearless in the face of so much death staring you down, as rifle after rifle pins you there. Oh, we will learn this fearlessness from you, beloved.\n “What did you do to her?” Isla demands, barking their meat-words like you are dumb, or like you cannot hear the frantic thump of their adrenalized heart.\n There is still enough humanity in you that you attempt to meet them where they’re at. You speak back, the word leaking out of you. “Heeeeeaaaling.”\n It doesn’t take long. Our alchemy works fast, races to repair neural tissue, coat vocal cords, begin to convert proteins, and rebuild.\n Like the faint, opening strings of an orchestra, we feel the stirring of a new mind enter the hive. Senses, cognition, awareness, each rising and falling as easy as breath, as beautiful and simple as math. Faint words flutter across our minds, as tender as newborn wings. We taste a name, a life, a history, we—\n Oh.\n Jonah?\n You turn, hearing them in your mind, clear as bell and twice as bright. Their eyes flutter open, though their mouth moves silently, grasping at words. But from their mouth they say, “Am I going to be okay?”\n The room goes quiet.\n Then, a mad scramble for a med-chart, which pulses red with the activity of our alchemy. Shouting that varies from, “What in the world has happened to her cognitive functions?” to “I’m reading dermal variations unlike anything we’ve ever seen. Is she becoming one of them?”\n But that is a silly question, we’re realizing, all of us dawning on the same point at the same time. This child isn’t becoming one of us.\n They’re becoming like you.\n Will I become a bee-person? they think at you as electrodes are placed on their temples.\n No, Kat, you think back, because of course you know their name like you know the back of your hand. I felt the urge as they do, to save a dying being by turning it into them. And while I had to be rebuilt like them in some ways after my accident, you didn’t need that. You just needed to be healed in your own way. I did my best to help. Do you feel better?\n Oh. Yeah, I do, they think while doctors shine lights in their eyes. Does that mean you and I are in our own hive now or something? You can feel the thrum of their song within them, not as complex as yours, but already their vocal cords hum in a stranger way than they ever did, their eyes drink in more richness and clarity in the world around them.\n You know, you respond, knowing they can feel the depth of your joy that you aren’t alone anymore, I get the feeling we could be, if you were okay with that. Maybe there are some more people we could help, who could join us. Would that be okay with you?\n Yeah, I’d like that. And the hunger in their voice is unmistakable. We all saw the crushing dark they passed through to get here. I’ve been alone for a while. I’d like to . . . not be alone for a while.\n You nod and are escorted away, Isla already screaming at you for what you’ve done. But you can take some loud meat-words; not too high a price to pay for what’s been accomplished. You did what they asked you to do. You saved the child. And you did it by building a bridge.\n For how many more are out there in the vast dark in need of healing with no one to help? How many could use the help of a child of two worlds, with an urge to heal through that honeyed touch? Those who know the value of a community and an individual mind, who can utilize the best of both?\n We are weary of war, of willful misunderstanding, of mourning drones who hardly tasted the stars on their wings. This room vibrates with fear, yes, but awe, its sibling, is present, too. With you and this new child, maybe that bridge between worlds is possible; maybe it can stand firm against those who would destroy it.\n Though you are only a hive of two for now, we hope that number will grow. And when it does, we will welcome them all, holding them thorax-close, and remember that even this is holy, and that makes it alchemy.\n We are so proud of you, child. You have exceeded our every hope.\n You’re everything a hive could want.\n Martin Cahill is a science fiction and fantasy writer living in NYC and works as the Marketing and Publicity Manager for Erewhon Books. He’s a graduate of the Clarion Science Fiction and Fantasy Writers’ Workshop of 2014 and a member of the NYC-based writing group Altered Fluid. You can find his fiction in Lightspeed Magazine, Nightmare Magazine, Shimmer Magazine, Fireside Magazine, Beneath Ceaseless Skies, and now, Clarkesworld. His short story “Godmeat” appeared in The Best American Science Fiction and Fantasy 2019 anthology, and he was part of the writing team for Realm’s Batman: The Blind Cut. Martin also writes, and has written, book reviews and essays for Tor.com, Book Riot, Strange Horizons, and the Barnes and Noble Science Fiction & Fantasy Blog."}