{"fingerprint": "lzjZBlw/QH5nhuLRzs4ixtRcw0w=", "sitename": "Clarkesworld Magazine", "title": "The Oddish Gesture of Humans by Gabriel Calácia", "author": "Gabriel Calácia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/calacia_07_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Oddish Gesture of Humans by Gabriel Calácia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1890 words, short story\nThe Oddish Gesture of Humans\nKarier-lah had been staring at the image for some time now. That was starting to bother Hiimar, who walked up and down, busy with spreadsheets, theoretical books, memos, and ideas weighing inside her head. And Karier did nothing but look at that damn image.\n“Ier,” she called one more time, still being able to find patience somewhere. “You’ve been looking at that image all morning, please come help.”\n“It was just nine hundred and sixty-seven kuynas,” Karier said, checking the watch in his ring.\n“For the Stars’ sake, Karier! We retracted that probe so long ago and all you do is stare at that, that . . . photograph.” She pronounced the word in the human language, which felt weird to say. It was a sort of rolling language, sticking in the mouth, like melted koku sweet. “The linguists haven’t even finished deciphering and we already have a significant amount of data to review, analyze, and interpret. All you can do to help is obsess over this single image?”\nFor a moment, she thought he wouldn’t answer.\n“Why do they do this, Hiimar?” he asked. “What is it they’re doing?”\nKarier turned to an open book on his desk. It was the volume twenty-seven of the Manual of Civilizations, but there was little help for him there.\n“It’s a demonstration of love, Karier, you know it very well. The sociologists, the psychologists, all of them agreed already. What else could it be?”\n“I know, I know, it’s a demonstration of love. But . . . it couldn’t be just that.” He turned and looked at Hiimar. “Could it?” His four eyes blinked, bright and anxious.\n“Karier-lah, my little,” she said. “You don’t study civilizations, psychology, or species behavior. You’re an oceanographer. Now, would you please stop with these pointless questions and help me interpret these awful sounds? I can’t stand to hear them all over again, I’ve toggled my ears four times, they’re hurt. All these things do is scream uuuurrrrghhhh and throw water somewhere.”\n“They’re sea creatures, Hiimar.” His gaze returned to the image. “Just sea creatures,” he said as he reluctantly turned off the display.\nAfter eighty-four hundred painful kuynas, Hiimar was sitting down on her armchair at the end of the day. She loved things like the probe they had retracted earlier—it was great to have new info about a civilization of which almost nothing was known—but she had to admit that she hated them sometimes. The labor it took! It mobilized hundreds of professionals of every known area, all of them bursting with theories, digging into old books as if looking for precious stones.\nNow, thanks to the Stars, she was sitting down, the hurtful muscles of her legs at last relaxed. She was all ready to enjoy a sleep that, although short, should be invigorating enough. Another full day of work awaited her tomorrow.\nAll ready. That is . . . until Karier-lah came back from the bath.\n“I’ve been thinking . . . ”\nPlease, no, Hiimar thought, exhausted, her eyes closed.\n“Do you think more people can do that?”\n“I don’t see why they couldn’t. How many humans must be out there, billions? Those aren’t the only ones who can do that.”\n“But do you think that more than two can do it at the same time?”\nHiimar had to open her eyes.\n“You can’t be serious,” she said.\n“No one wondered that.”\n“Because it’s stupid,” Hiimar said. “Imagine how it would be. It doesn’t look very . . . doesn’t look very practical to me, Karier. Another person can’t fit there. Humans have small heads, but they are still pretty round. Imagine three kra-kri-kra balls together. If humans did it, they’d get their cheeks stuck to one another’s.” She made a pause. “And why am I talking about this?!”\n“That’s my point!” Karier said. “I don’t doubt that it’s possible, after all they seem to have a very mushy, rubbery consistence. But surely it’s not practical. So, if only two people can do it at the same time . . . ”\nHe tapped his nails on his chest bone, producing loud snapping sounds.\n“If only two people . . . ” Hiimar pushed. “Say it at once so I can go to sleep.”\n“If only two people can do it . . . well . . . look! Just imagine it. I’m looking for a good example, Hiimar, but I can’t find it! What do we do with two people only?”\n“Irritating someone,” she said. “Exactly what you’re doing right now.”\n“Oh, please. This is interesting, I promise.”\n“I don’t doubt that it is interesting, but this is not our area, there are people who . . . ”\n“I know! The scientists of civilization, of mind, of this and that. But just because it’s not our field it doesn’t mean we should avoid thinking about it, don’t you agree?”\n“I do, Ier . . . ” she said. “And don’t doubt me, don’t make that face. After all, you remember the day when we discovered that those sounds in the labevita’s recordings were words of a children-exclusive dialect, right? That didn’t have any connection to oceanography.”\n“Yeah,” Karier smiled. “That was a very beautiful day.”\n“It was,” she smiled too, and her eyes blinked bright. “But I’m really-really tired, my little. And we have much more work to do tomorrow.”\nKarier-lah looked at her for an instant. He seemed to be still thinking about the day of that linguistic discovery. Two oceanographers, who could tell . . . the linguists were nuts.\n“All right, Hiimar,” he said. “You’re right. I’ll see you tomorrow.”\n“Where are you going?” she asked. “Are you not going to sleep?”\n“I think I’ll take a walk. I’ll be back soon. But sleep, please.”\n“Yes . . . ” she said, as Karier went out and the door came down again. She looked at the empty chair by her side. That was unusual.\nShe closed her eyes, foreseeing it would be hard to keep them like that for long.\nHiimar found Karier exactly where she expected him to be, some kuynas later, when she decided that she couldn’t sleep.\nHe had a quirk of sitting on the floor between two shelves in the library. Though the environment was acclimatized, the floor was still very cold, and at that time everything was dark in the library. Some of the books created a dusty atmosphere, and the smell bothered almost everybody, but it never bothered Ier.\n“Ier . . . where are you?” she asked, in a hushed tone, knowing he would hear it.\n“Hiimar?” he asked, and his long head creeped out from behind a shelf in the language section.\n“Hi,” she said, approaching him.\n“What are you doing? You can’t sleep?”\nShe didn’t answer before sitting by his side, looking at the books at the level of their eyes. Original and translated volumes, a few not fully deciphered. It was an area they were very interested in when younger.\n“I’ve been thinking about many examples for your problem,” she said.\n“What problem?”\n“The photograph one, the one from the humans. You asked me what kinds of things we do with only two people.”\n“Yes. And I can’t think of anything. All we do, whether work or fun, always takes a lot of people. That varrmoine psychologist said we are a race of needy people.”\n“That is true, but not for us.”\n“What do you mean?” Karier looked at her.\n“Us, Ier. We always did things together. We played together, when we were kids . . . ”\n“Yes, but only because the other kids didn’t want to play with me. Only you did.”\n“Right. We studied together.”\n“For the same reason. And, in college, the library was always full.”\n“We work together.”\n“We are the only oceanographers!”\n“We are talking together, Ier. Right now. What we’re doing right now takes two.”\n“Yes, but . . . but it can be done with more people. Do you understand?”\n“According to your theory, that thing in the picture can as well.”\n“They can, but they don’t do it very often. It may be rare. Maybe the humans have something like the frikar herb, or the kutu juice. They’d only do it when numb. But, for most people, in most situations, I picture it as something only two people do.”\n“And what’s the importance of that, my little?”\n“I don’t know,” Karier said, and he seemed honestly frustrated. “Something in that gesture impresses me a lot. It’s not because it’s weird, and the Stars know it is. Don’t the humans know that their mouths must be as dirty as their feet? But because it’s . . . I can’t find the word. I don’t believe we have a word for it. It’s like something . . . inner, but not inner for one person. Inner of two people. Do you understand what I mean, Hiimar? Interior between two people?”\n“I bet the humans have a word for that.”\nKarier-lah looked at the books in the language section. The shelf was huge. There were books on the language of almost every known race and species in the Manual of Civilizations. Of almost all of them, but not the humans’. What they knew about humans could be summed up in a small chapter in volume twenty-seven, section four of the manual. With the probe they had collected this might change soon, but it still didn’t seem enough to him.\n“I wish I could know more,” he said.\n“Me too. You know what’s funny, Ier? For humans, that gesture that causes us so much doubt must be something so simple.”\n“Do you think so?” Ier asked. “What if it’s socially complicated?”\n“By the happy expressions on their faces, it doesn’t seem complicated at all. Did you see the female’s face? Her skin seems to glow. I mean, figuratively. They are all a little glowy, literally speaking.”\n“It’s true, it doesn’t seem complicated. But it can be hard. Wasn’t it hard for me to find a friend before I met you?”\n“But it wasn’t a fair situation, Ier. You suffered prejudice. It was rare before, and now it’s gone. We left those things behind. The new generations are getting better.”\n“Yeah, yeah. But some say the humans are not that noble.”\n“We don’t have reasons to believe that. At least not yet.”\nThey remained silent, thinking. They did it a lot, in those nights of talking until dawn that, as life went on, became more and more rare.\n“I hope it’s not,” said Hiimar.\n“What’s not?”\n“The gesture. I hope it’s not complicated. The female looks so happy.”\n“Yeah, I hope too.”\nThey spent the night talking. Now that Karier seemed to be done with the topic, it was possible to talk about other things. They realized it had been a long time since they talked like that. The simple act of sitting down and talking about things until the night was over. When they started talking about why they weren’t talking so much anymore, Hiimar presented the hypothesis that in space there was no night or day, so talking until dawn was not as fun. It wasn’t the same without both suns rising from the mountains.\nEven without the suns, they talked until they fell asleep in an unusual position: sitting on the floor, the points of each one’s forehead touching. The floor made them cold, so they touched shoulders.\nAnd, in that sleep, right before drifting into unconsciousness, Karier thought he was getting closer to understanding what was so amazing about that oddish gesture of humans.\nGabriel Calácia is a writer from Brasília, Brazil. He started writing science fiction, fantasy, and horror during high school and since 2015, he has been studying Brazilian language and literature at the Universidade de Brasília (UnB). He hopes to teach Portuguese language at the high school level while pursuing a career as a writer. In addition to some short stories and novellas, he has completed an unpublished novel and currently finishing a second one. \"The Oddish Gesture of Humans\" is his first published story."}