{"fingerprint": "0B0RI3FCSBAOQLHvMVX/ySAQmk8=", "sitename": "Clarkesworld Magazine", "title": "The Language Birds Speak by Rebecca Campbell", "author": "Rebecca Campbell", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/campbell_11_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Language Birds Speak by Rebecca Campbell", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10560 words, novelette\n The Language Birds Speak\n Alex cantilevered from her hip, his neck arched, knees and elbows braced against her gut. Gracie widened her stance so they wouldn’t pitch forward onto the kitchen floor while he screeched, an emphatic, full-bodied “NO” that felt like the crunch of a car accident one block over. Except he didn’t really say “NO,” it was instead this—noise—not a word, but a howl.\n It had started when he turned two, just when she was waiting for a sudden explosion of words. He made the sound when she took his boots off, carried him in the front door, gave him cocoa, denied him the iPad, allowed him the iPad, but not the cartoon he wanted. She’d given up on talking through it: you can’t run out into the street, you have to hold my hand, you can’t stay at the park forever. Instead, she held him and waited as he vibrated in defiance. She vibrated in sympathy.\n In her arms he changed from cat to cannonball, grinding into her hip bone. Then fish, sliding over her arms and hands, then he was a pinching crab. Clinging to him, exhausted, she made a sound like a croon or a sleepy purr.\n It stopped them both. He changed again, now warm and still. He whispered the first new word in months: “[ ].”\n And he curled into her arms, his head resting on her shoulder, an egg cuddled into her chest. Looking down at him, she wondered that he was the same boy who’d shape-shifted from spike to stone to crab, and now fit perfectly into her arms. It was hard to believe he had ever been hard to hold.\n “You’re an egg,” she said. “My little egg.”\n But he had fallen asleep between one word and another. She was left doubting what she had heard anything like “[ ],” which was a word both unfamiliar and true. It might be an exhausted mother hoping for meaning in the noise. Nevertheless she muttered it, testing the sound: “[ ]. [ ].”\n Munira sat across the desk, a manila folder open in front of her.\n “Tell me why you came in.”\n “I don’t know where to start.”\n “What did you first notice?”\n “He has trouble.” Munira’s easy hands and professional watchfulness made Gracie at once comfortable and guarded, her shoulders rising toward her ears. Alex wasn’t the only person being evaluated, she guessed. “Trouble talking. I say. I say use your words. But he doesn’t.”\n Alex refused to roll the ball toward the child, who asked nicely, “would you like to share?” Sunny curls and a red playsuit. Her mother standing back, glancing down at her phone.\n “No,” with such force the little girl took a step back. Then she stepped forward again, her bottom lip pushed out in reproach.\n “You’re not very good at sharing,” she said. Each syllable clear, the voice of a good kindergarten teacher, a beloved but strict grandparent.\n Then she reached for the ball.\n “It’s her ball, Alex,” Gracie said. “Let her—”\n —He scooped it up then. “It’s hers,” she repeated, trying to cover the space between them.\n When he made the sound, he was still crouching, but now the girl crunched on her back in the gravel, and Gracie couldn’t tell how it had happened.\n “Alex!” Her own strangled shout. “Alex!”\n Then the mother was there as well, the little girl bawling while Gracie picked Alex up and kicked the ball over to mother and daughter, locked in their own moment together. Alex wailed into her shoulder. A feeling like gravel in her chest.\n “I’m sorry, I’m so sorry,” she said.\n The other mother laughed uncomfortably, rocking the little girl back and forth on her hip. “Kids. Won’t be the last time.” She glanced at Alex, burrowing. The little girl wiped her eyes. The woman set her down, and she ran back to the slide, ignoring Alex. “He seems upset—”\n “Yeah I think he—” silence, then, “He’s tired. We should—”\n She shrugged and walked homeward, Alex still clinging. He whispered in her ear. “[ ].”\n It was not just what the sound meant—his disorientation and pain, his discomfort, his sadness—but the physical effects of the sound that stopped her, rough against her brain, overrunning her nerves with broken fingernails. His voice caught on her in a way she had never before experienced. Motherhood, she imagined. This must be that maternal connection they always talk about. Was it supposed to be so complicated?\n Mal didn’t have the same trouble. He’d say, dadly, “come on kid, not in my ear” when Alex climbed up his back and sat on his shoulders, shrieking with laughter.\n “Does he point?”\n “Yes.”\n “That’s good. That’s important.”\n “But. Is that enough? You worry.”\n “Why is that?” Munira’s voice inviting, her hands open, her shoulders low. The familiar and clinically friendly posture of therapists and psychologists.\n “Because the world is full of awful things? And kids who can’t talk—”\n A playground full of children. One little girl with a high-pitched shriek that drove Gracie through the trees to a chain-link fence that adjoined a farm where she could examine the grass, the birds with the focused attention of a child trying not to be seen. Sometimes the other kids left her alone. Sometimes they didn’t. She imagined Alex a few years from now, going off to first grade, and—\n “It’s. He’s. Delayed.”\n “Maybe. But delays don’t have to be catastrophic. We know a lot about expressive language acquisition. And we’re going to figure out what Alex needs.”\n He was out there, right now, with the speech pathologist, little boy in a little room, the brittle cheerfulness of institutional toys. Animal decals on the walls, squirrels, and elephants two-by-two through the Garden of Eden. She had watched him through the window, one small hand reaching toward the toys. It hurt her heart to think this was just the beginning.\n “So how many words does he use regularly?”\n “Oh. One. Two—” she counted on her fingers. “He says Mommy and Daddy. Alex. It’s okay. Juice. No. Maybe seven? Do foreign words count? Or made up?”\n Munira stopped. “Made up?”\n “I mean. Everything’s an arbitrary sign blah blah blah. But we also say things like [ ] or [ ]. We say those a lot.”\n For the first time in their meeting, Munira looked surprised, and Gracie saw the mind behind her professional demeanor: curious, pleased. She asked quickly, “What language is that?”\n “I don’t know. I heard it when I was a kid. My grandma was—it’s probably highland something. Gaelic.”\n “That doesn’t sound like—what was that again?”\n “[ ],” she said, and felt the blush of firelight on her skin. She wished Alex was in her arms to share it, so they could imagine together the way a room heated by a woodstove felt when you opened the door on a wet evening, heat emanating from the stony mass of the chimney. The sweet smell of wood burning, its music.\n Munira sounded it out. “Grckqhsh?” Hearing it put wrong startled Gracie out of her reverie.\n “No. [ ]. It’s probably an obscure Norse word.”\n “Krrrrichs? Cchchhkssj?” She laughed. “I’ve never heard anything like that. It’s the oddest sound, usually you can recognize language patterns, and I studied Old Icelandic—could I record that? Or maybe the first word you said.”\n Gracie hesitated. “If you—”\n Munira pulled out her phone. “Could you say that twice? With a pause in between?”\n “[ ],” Gracie said, “[ ].”\n “And what does it mean?”\n “It’s hard to. It means kind of longing. Separation, maybe? Loneliness. I say it when I’m telling him goodbye. Saudade. Sehnsucht.”\n “Yes. That’s what I guessed, maybe it shares a root with—anyway. You don’t often hear something genuinely new. I’m going to send that to a friend who can probably tell you what dialect your Grandma was speaking.” Here Munira smiled, unprofessionally delighted. “But, Alex. So you’ve been teaching him these words? And he’s comfortable using them?”\n “I guess. They come up.”\n “So we’ll call it a vocabulary of ten words.” After a bright moment of confusion and joy, the institutional calm had reasserted itself. It was both lonely and comforting, a necessary loss.\n “Just give me a moment and then we’ll talk to Mikkel about the evaluation.”\n Gracie waited in the still, beige room, admiring the medical diagrams of the larynx, of Broca’s area, the infant development charts on the acquisition of language, the drawings by children—Munira’s kids?—of flowers and crooked unicorns. She remembered this morning, when Alex said “[ ].” Not “apple” like the logo on the back of a computer, but cool skin against the palm of her hand as she stopped on her way to the bus stop, late September morning soaked through with dew. She pulled it from the tree and polished it shiny before she bit into it. That was [ ].\n Eating his breakfast apples, Alex bit. Smiled. Bit again. Then looked up and said, “[ ].”\n In that moment nothing was wrong with either of them. But then he tried his tongue at English, and it was different: words sounded once, never to be repeated. Maybe none of them were words, just accidents that she, in her hopefulness, had named. Which was why they were here, to be evaluated, and start spending long afternoons in beige playrooms, with plastic toys a million other children had mouthed.\n She was in the waiting room when Munira rejoined her.\n “Take this card,” she handed Gracie a rectangle of thin gray plastic. “They’re offering some new resources and techniques. It might be useful.”\n “Are they part of the ministry?”\n “No—NGO. But doing excellent work. You should call.”\n Gracie thought of classrooms and living rooms where, as a child, she had sat in terrified silence, fearing the sounds that came out when she tried to speak. None of that would happen to Alex.\n She’d been bent over a smartphone, absorbed, her face unresponsive. He’d been six months old, dozing in her lap, and seen that blank nightmare mask of a mother. Her disregard had permanently scarred him. The core trauma of his life already underway and unstoppable: parents so busy with their work and themselves that he, little visitor, found himself too often alone, a social animal in unnatural isolation, like an orca in a tank at Sea World. Or a rhesus monkey snatched from his mother and consigned to the stainless-steel pit of despair, surrounded by nothing but the distortions of that mirror, the reverberating cries of his isolation. For science.\n “That’s ridiculous,” Malcolm whispered when he lay with Alex asleep in the crook of his arm. “I mean, I get the feeling, because we all suck as parents. But kids develop at their own pace.”\n Alex had been fretful all day, refusing naps, refusing all food but apples and ice cream. He had finally fallen asleep, his hands curled around Mal’s sleeve. They were too tired to move.\n “But it’s so many things. How he is. You know. With kids.”\n Mal snuggled Alex closer to his chest. Alex turned over and burrowed his head farther into his father’s armpit. “He’s healthy. He’s our little guy. Don’t worry so much.”\n She rested her head on Mal’s chest, hearing his heartbeat and Alex’s sleeping breath. Closing her eyes, she felt the slow nighttime cadence of their family, drifting into stillness, while outside the last light faded, and the crescent moon rose—leaving a smudge on the water of a black inlet that filled the darkness behind her eyelids.\n “[ ].” she said.\n “What?” Mal asked, rousing, the room lit by his phone. “What did you say?”\n “[ ].” she repeated, and then she was asleep again, standing on the moonlit edge of that dark inlet.\n “Hi. It’s Munira. I’m wondering if you followed up on that study I told you about. I’ve been talking to the primary investigator, and I really think Alex is a good candidate. I’m going to email you the info on the card.”\n Sometimes when he was asleep, sprawled in his little-boy exhaustion, she thought she saw the man he would one day be. She loved that man, too, as she loved all the varieties of Alex from infancy to the distant years after her own death.\n The gray plastic card was still in her purse, where she had kept it carefully. She practiced. “Hello, Hello, Hello. My name. Is Grace.”\n The more she spoke, the more awkward the words were in her mouth. “Hello. Hello. My name is Grace. Grace Feradach. Grace. F. E. R. A. D. A. C. H. Grace. Hello. My son Alexander.” Her hand shook on the phone, “my name is. Gr—” she began again. “Name—”\n “Alexander,” she said carefully, “yes I’ll hold yes I’ll hold yesillhold” and felt the consonants and vowels sliding, stranger with each repetition, until they were a morass of clicks and whistles. Yesillholdalexandergracehellohellohello. Feradach. Feradach.\n She had to be careful not to over-rehearse, or the words came back to her like echoes, bouncing out of her mouth when she didn’t mean it. Once, freshly dumped at twenty, she had walked home drunk from his house saying I hate you I hate you I hate youihateyouihateyouihate, first under her breath, then slowly—she realized midway through the walk—out loud to the blackened streets. Three a.m. in the kitchen, her roommate came home too, and she’d meant to say how was your night mine sucked dead bears, but what had come out was I hate you.\n Steph had burst into tears. It had taken her weeks of apologies to fix it, and things had always been a little weird after that.\n She stopped practicing, in case yesillhold came out of her mouth when she meant to ask Mal if he wanted last night’s leftovers for lunch.\n She breathed the way she had been taught, from her belly, and dialed the number, listening to the chime at the other end and the posh woman’s voice announcing that she should wait for all options before she made her choice. A voice like polished concrete in a gray-glass office.\n “Hello,” the gray concrete woman said. “You’ve reached the Genesis Project. Please enter your seven-digit code.”\n “My name is—” then she stopped, flipped over the card, and saw the tiny numbers on the other side.\n This time a man’s voice, warm and low.\n “Hi, Tom Pryce. How can I help you?”\n “Hi. Hello. Hi. My name is Gracie, and someone gave me your card about a. About a. A.” Here she floundered, as she always did when speaking to new people.\n Tom seemed to realize, and carried on in that warm, slow voice. “You’re interested in the program, aren’t you? Did Munira tell you about us?”\n “Yes.”\n “She’s brilliant. Excellent clinician and we’re lucky she’s part of outreach.” He said it easily, like she hadn’t babbled. Like he understood. “Okay, so this is for your son?”\n She paused, then meant to say, my son, but what came out was “[ ],” which Alex said pointing to his chest, and which she repeated often because it made him laugh and pat his chest. She hadn’t said it for months. It encouraged him.\n She covered her mouth, like she could snatch the sounds back. But the silence was brief, and Tom carried on, as though he had not noticed her gibberish. “Great! We work with a lot of kids with expressive language issues.”\n “Okay. K.”\n “I’m going to text you a link to the app, okay? It’s still in beta, but it’ll give you an idea of what we do. And you can use it to set up an appointment if you’re interested. You’ll need the number on your card to register.”\n “K. I. K.” She wanted to laugh—no talking to anyone if she didn’t want to, just an app. No stumbling over her words, no embarrassed blush when she misspoke.\n Tom was as his voice sounded: intelligent, warm, around her own age.\n “We’re definitely seeing a few points of concern. Cognitively he’s great. Fine and gross motor skills are excellent, weight, height, all that—he’s aggressively healthy, this little guy—but you’ve already seen his issues with expressive language. Is there a family history of language delays?”\n “Not on Mal’s side. My father stuttered.”\n “Okay.” He probably knew the minute she opened her mouth. Most people did—she put them off. She never knew when to start talking, when to stop, and she had to think so carefully about when to make eye contact and when to break it. You couldn’t stare too long, but if you didn’t look at them, people shifted uncomfortably. The more she thought about it, the stranger her performance grew.\n “I wasn’t ever diagnosed.” she began. “I’ve been through a bunch of. You know. Sensory stuff. Anxiety. No diagnosis. But I always wondered if.”\n She wanted to explain that the words in her head worked. She understood words on the page, too, even if she preferred other media: colors, for example, were far easier to understand and manipulate. Numbers, too, and diagrams. But when it really mattered, her voice went wrong, an empty and hollow thing that honked and whispered, words emptied of meaning as she rehearsed them hellohowareyouihateyouitsokay. She tensed for the usual response: he’d jump in, offer a word, finish her sentence. He did neither.\n “As a kid. They took me out of the regular system one year, but I wasn’t held back or anything. Sometimes the wrong word, you know, to my mouth. I’d think. I want an apple, but what came out wasn’t apple. It was.” She waved her hand.\n “So when you talk to Alex . . . ?”\n “I’m so careful when I talk to him. To say things good. Right. Correct, you know. I say it all. Good. I talk.” She tried to find the words, but they slid away from her, and inverted themselves, and she could not make her tongue shape them—“It’s okay.”\n She discovered over the course of that first week that Tom liked to talk. He talked right through her awkward silences, answering questions she couldn’t form, like he could see the direction her mind had leaped in as she listened.\n “We’ve experimented with other methods, and we’re still looking for a way to record the total acquisition of language. Our goal isn’t just to understand how language functions on a practical level, but what it is. It started, oh, twenty years ago, at U of T—have you ever heard of Dr. Harlow? Worked on AI and linguistics and neurology. Do you want another cup of coffee? Because you just have to ask and—no, I’m happy if you’re happy. Anyway. Carnegie and his wife had a baby just when he needed to do a NSERC application. We funded him, too, so he could basically wire his kid. They set up cameras in all the public rooms in their house, and the kid’s bedroom, and recorded his entire life, audio, and video. The expensive part wasn’t the actual equipment—that’s a one-time purchase—it was managing the data. And that’s where we came in—we helped design software that could organize and search these recordings. Some poor bastard grad students were in charge of uploading all the data. We fed the software everything we could find on language acquisition, so it could identify patterns in the recordings. Harlow basically made a career out of watching his kid learn to speak. Now he does TED Talks. And we’re still using the software and the archive he built.”\n The kid must be at least twenty by now. Did he know at the time he helped uncover the very core of human nature?\n “It’s a massive archive, not just Harlow’s kid, but everything we had in our collections, and all the other research going on in language acquisition. And we’ve learned some pretty interesting things that let us help kids who are struggling.”\n Was he embarrassed by these videos? Did he make snarky comments at family dinners, pass the potatoes, would you like to capture my cognitive-linguistic development, Dad?\n “Especially now, since the original software has also evolved, and we’re using some current developments in machine learning. It sees things we don’t—patterns, correlations. And the more kids involved, the more sophisticated the analysis.”\n “You’re. Watching?”\n “I understand your concern—I do! But it’s anonymized. And we give back as much as we receive. Kids come out of here talking, Gracie. We’ve had a hand in creating some serious little chatterboxes.”\n She wanted to tell him how bright Alex was, how perceptive, how gentle with cats he met on the sidewalk, how he imitated the cries of gulls when he was a baby, and how the crows seemed to speak back to him from the branches overhead. She wanted to say all that, but she felt a deep, queasy panic that made no sense.\n “We’re not,” Tom began, as though he read her mind, “going to surveil Alex’s whole life. That’s not what we want. We’ve benefited from so many kids like Alex, it’s part of our mandate to give back to the community. These little guys are the real heroes. With a little help we can rescue them.”\n She nodded.\n “So, we’ll offer Alex a place in our eight-week program. We can revisit at the end and talk about the second phase.”\n She felt herself standing then, his hand was on her shoulder, walking her toward the door.\n “We’re going to need blood samples from Alex, and you, and Mal. I’ll get you the releases. You can read over them at your leisure. And don’t worry—your genomes don’t end up on any government database or anything. It’s all just ours.”\n “But. Just.” He stopped and waited for her to continue, which surprised her. “Where does the money come from?”\n “Oh.” Tom laughed. “Telecoms, mostly. The Org owns a couple of very useful but boring patents.”\n Then they were at the door to the yellow room, and she could see Alex through the window, at play in the sunny window with a beautiful young woman sitting cross-legged beside him. He threw back his head and laughed and handed her a toy. When she opened the door, he scrambled over to her and seemed to fly up and into her arms.\n “What? No.”\n “But early intervention in language acquisition is vital, and every delay costs his social, emotional, and cognitive development.”\n “Why do they even need my DNA?”\n “This is a huge longitudinal study, one of the first of its kind combining genetic and social and educational and economic factors. All of them cross-referenced over a population of tens of thousands. They have an AI. Or. Something.”\n “You sound like a press release.”\n She blushed. Everything she’d just said she’d read in the app and memorized. But then she thought of Alex at the park, shoving the little girl. She began again: “Mal. He needs—”\n “—I wouldn’t even do the test Mom sent us at Christmas. And how much did she hassle me about that? I don’t trust DNA collection.”\n He couldn’t. Not when there was a chance to get Alex real help. Without thinking she stood up, her fingers tied up in fists. Mal was at the sink still, fiddling with one of the plants on the windowsill. “Do these need water?” he asked.\n “No,” it wasn’t a shout, but some quality in her voice had intensified. “[ ].”\n He stopped. Startled into attention.\n She felt the command in her voice, and she was afraid. She had never seen him look that way before, his eyes wide, receptive. Her stance belligerent, shoulders tight, jaw clenched.\n Then the moment passed, and he relaxed, spoke as though she had not interrupted their conversation, “I just don’t want Alex’s grandkid turned down for a job because my DNA is in a bank somewhere and it says he’s an INTJ and a cancer risk and a bad fit for the company.”\n “That’s not—they won’t use it like that.”\n Mal laughed. She liked his laugh. He touched her hand.\n “There are other ways to help him that don’t, you know, fundamentally compromise my privacy.”\n Tom shook his head. “The thing is, we need the data. It’s out of my hands.”\n “You have mine. And Alex’s.”\n Delicately, and with total attention, Alex picked up a block on the floor of the yellow room.\n “We need a complete archive. I’m really sorry. I was hoping we could help you. Dr. Peterson is the speech therapist—a really excellent researcher—and she was looking at Alex’s file. Making a plan, you know.”\n “Is there,” she heard herself ask, “anything else I can do?”\n “[ ],” Alex said, not looking at her. The sound he made for reassurance. The sound he would’ve made, she always thought, if they were out hunting and gathering and she had left him in a nest of grass while she picked apples or dug clams. The sound they would have sung to one another, that meant only “here I am” and “I am here, too!”\n “[ ].” she answered.\n “Look,” Tom said, “we might be able to waive Mal’s direct involvement if we get the data. I really believe Alex has a chance with us. Does your husband have a hairbrush?” He asked it like it was a prank, something fun and silly they would do before, surprise, everything worked out on the end.\n She felt cold.\n “You can tell him later, once Alex has the help he needs. I doubt he’ll argue with the results.”\n She made a sound, not quite a word.\n “It’s just information. That’s all. It’ll be anonymized. Just make sure you get follicles—and don’t accidentally bring some of yours.” He laughed. “Once we tested dog hair. That was a genetic mystery.”\n “I can’t.” she began.\n “Just. Take the kit, and if the opportunity presents itself, you know. Grab it.”\n “If I—don’t. Can Alex still come?”\n Tom shrugged. “Sure, the initial program—that’s open to everyone. But if you want to take part in the really cutting edge stuff, you’re going to need Mal’s DNA.”\n When she and Mal were first going out, he used to visit her in the room she rented just off Quebec and 14th. Every time he knocked on her window she startled. Once she fell off her office chair. He laughed, then rubbed her shoulder. “You knew I was coming,” he said. “What’s up with you?”\n “I’m made like this,” she said lightly, unnerved that these unfortunate effects had returned to her, her clumsy voice, her startle reflex, her exhausting misophonia. Every time she thought she’d learned to act like a person, this happened: a new experience—puberty, love, motherhood—and she was back again, retranslating her whole changing self into a language she had never learned to speak. She had thought: Mal will be a good father. He’ll teach his kids to speak like people, and I can fade mutely into the background.\n She’d thought Alex would be okay. Every time she brought it up, and every time Mal reminded her about Alex’s eye contact, his early walking, his early smile, how much he enjoyed sitting in their laps and looking at pictures, touching the pages of books. His acute hearing, when in the backyard his head raised, he pointed at the trees, and after a moment’s concentration Gracie, too, heard birdsong.\n Tom talked about the fusiform gyrus, the architecture of facial recognition deep in the brain. It didn’t even work through the same channels as language because you knew faces with a part of your brain far more essential than that which decoded, say, the letters F, A, C, and E. Same with snakes. We can see them and react to them without knowing what we’ve seen. We’ll be overcome with dread, and flee, and only later realize the snake we avoided in the grass. He told her about the FOX2P gene, how it’s linked directly with human speech, but deviations in birds can affect their songs, too. Damage to that gene—or its absence—changes expressive language radically.\n He talked about the growing white matter in the maternal brain during gestation, the neural networks dismantled and rebuilt to perceive signals from the prelinguistic child. Hunger. Loneliness. Fear. No conscious work, this, but communication so different from language, words seemed irrelevant. Affect, Gracie thought, but did not say it. The deep sea of meaning that underlies those flimsy little words. The richest parts of our selves beyond the reach of language, and words only float on it, moved by currents far deeper than anything they communicate, a rich, dark inlet of the great sea of meaning we cannot ever hope to speak.\n “But what if,” Tom asked, conspiratorial, “there was a language that bypassed conscious representation the way snakes and faces do? It’s more like pheromones. Like music or empathy. If you hug someone for thirty seconds, you’ll both release oxytocin. It’s not about the mind—it’s about body speaking to body. It’s a kind of truth that language can never capture.”\n His soothing gold tones, the sound of a sunny room full of geraniums. She thought: it’s what I feel when Alex is fractious, and I hold him until he aligns himself with my heartbeat, calm again. When he was a baby, he couldn’t regulate his temperature or his emotions. I lent him my quiet and my warmth. That’s what I was there for.\n “It’s there on a cellular scale, even. If you put living heart cells together—even from different species—they’ll synchronize. I keep asking myself if that’s a kind of language. Or communication. And what kind of language would that be?”\n “It’s not. It’s.”\n She could not speak, but the thought formed, not a word but a series of impressions. Two people sharing something essential, filamentary connections that extended beyond the flesh, a subtle element that bypassed the siloed loneliness of the singular, repudiating the broken vessel that is the word. She thought of the way her heart hurt when Alex wept. How she knew Mal was frustrated because of the way the air crackled. How she knew he’d had a good day at work, that he was hungry. How she had known the first time he kissed her what he felt, the confusion between them, skin against skin.\n “Gracie?”\n “-”\n “Gracie?”\n “It’s.” She tried again. “It’s okay. It’s [ ].”\n Their first awkward silence. He was staring at her, his mouth open, the way he always did when her carefully construction performance failed. She collected herself, looked at her phone. “Alex is done the. I better.” Then, fumbling, she picked up her bag and knocked over the chair as she stood up. Tom caught it.\n “I’ll see you next—week. Our next meeting.”\n “Thursday.”\n At the door to the playroom, Alex threw himself into her arms. She wanted to tell Tom thank you, to say, it’s working, while Alex buzzed all the way home, a happy sympathetic hum in the back seat that warmed her, despite the rain. Before she got him out of the car seat at home, she wrote a text—Alex is so happy thanks so much—and deleted it.\n Alex arrived at his sessions curious, left exhausted, descending into tears each evening. She stopped taking him anywhere but to the yellow playroom where the young woman sat cross-legged beside him.\n “Aren’t you taking him to the library?” Mal asked one morning while Alex sat bashing trucks into one another.\n “No.”\n “Don’t you guys do story time?”\n “No.”\n “But. Why not?”\n “Last time I took him he. He.”\n Mal waited as long as he could. “What happened?” he prompted.\n The little boys beside him screeched at the top of their lungs, laughing, screeching, laughing. She felt it—fingernails on the inside of her spine, beestings on her eardrums—and knew he did, too. But she had learned—after years of discomfort—to live with those noises.\n The boys screeched again. Laughed. Screeched.\n “Settle down,” from the tired librarian. Screech. Gracie looked around for a supervising mom. Alex crouching now, on his knees.\n “Do you think,” Gracie began to say to the librarian, “we could—”\n —Screeeeech—\n It happened as quickly as the incident in the park, only this time she felt it like a current in water. He made that sound, [ ], then the three toddlers nearest him were on their backs, howling in an even higher register.\n “He hit me! He hit me!” One of the boys shouted.\n Mothers intervened. From somewhere far away, a woman with a stack of books ran toward the story circle, the boy continued to scream and tumbled at her feet. She dropped the books and gathered him up. Alex was at her feet, too, ears covered, pressed into her thigh, crying.\n “What did he do?” She heard someone say.\n “He knocked down like five kids!”\n “He shouldn’t be here—” Bilious green disapproval on her face, like sputum sprayed from an angry teacher.\n Alex’s tears on her neck, his eyes covered as though the light hurt him. His arms and legs tight knots around her, the weight of him as she dipped to pick up her bag and walked toward the door, past the arriving librarians. A voice behind them, where do you think you’re going?\n She didn’t answer. He clung so tightly that his hands pinched her neck. Out onto the street, then back toward the parking lot, afraid to look up because what if they were following.\n “[ ],” he said, and she felt his longing for understanding, to make the pain in his head better. She knew that pain. She had spent thirty-five years learning to manage it.\n “No,” she answered.\n “[ ],” he said again. This time it hit her in the chest.\n “No.”\n “[ ],” he said again. Strong enough to hurt, a blow right through bone to her heart.\n “Words, Alex. Use words.”\n He struggled, then cried. “Kids mean!” he said finally, the longest sentence he’d spoken in months.\n Then her own anger collapsed, and they curled together around the hurt in their hearts. “I know. But we can’t.”\n She knew Mal loved her. When she was upset in the car, he handed her a granola bar and a bottle of water he kept in the glove box because she didn’t always know she was hungry. He’d started carrying juice boxes, too, on the principle that Alex had the same problem. She knew Mal loved her because he waited on those tangled evenings when all words were garbled, and she—like Alex—threw up her hands in fists, ready to punch holes in the hollow-bodied doors of their home. She knew Mal loved her because when she used the wrong word he didn’t laugh.\n She knew Mal loved her, so why was she contemplating the sterile plastic bag hidden in her sock drawer. Tom kept leaving messages. “Hey Gracie. Any luck bringing Mal around on the DNA?” his voice easy to agree with. It was no trouble at all to take Mal’s hair. A little hair—who would begrudge that? No condemnation, just an indulgent eye roll at the man’s peculiarity.\n “Hey Gracie, just checking in to see if Alex is going to make the Wednesday morning appointment. Jess is going to be coming in from Toronto to evaluate kids for the second phase. It’s a great opportunity. Let me know.”\n “Hey Gracie, Alex’s report came back, and I think you’ll be interested to hear a bit more about how he’s doing.”\n So. She rehearsed her speech while vacuuming the living room, it’s a tiny thing that will make a huge difference. The vacuum cleaner stopped. She looked up to see Alex by the outlet, the plug in her hand, his tiny face stern.\n She plugged it in again. One swipe across the floor and he’d unplugged it.\n “No. Stop it, Alex.”\n She plugged it—\n “—NO!”\n She plugged—\n “—STOP.”\n She gave up. He pulled his LEGOs back out onto the half-vacuumed floor and began building stacks. Rocket ships. The trunks of trees. Then Mal was home again and she said, without preamble, “It’s such a small—”\n “—I just don’t get the decision. It’s the worst kind of NIMBYism. City hall declined the permit for the safe injection site, and it looks like we’re going to have to go back to the old—”\n On the floor, Alex knocked over his towers.\n “Could you not,” she said, “just. It’s such a small—”\n “—Hey, kiddo, give your mom a break. We’ll write another proposal. But it’s a waste of time. If they’d just—” Mal’s full-bodied sneeze, so loud it surprised even him. A nail through her ear.\n “—JUICE.” Alex shouted. “JUICE.”\n “Say please, dude.”\n “You have to give them the DNA sample.”\n “Didn’t we talk about this?”\n “It’s such a small—”\n “—JUICE.”\n “You can’t just give up on—”\n “—There are a ton of other ways to—”\n “—him.”\n “No.”\n But that is misrepresentation: the sound she made was not the English “No.” Neither was it a familiar word from the secret language. It was something new, like whiplash, a broken tooth. A sound like falling face-first on black ice. She felt its power as she shaped it not only with her lips and tongue, but with her diaphragm, her shoulders, channeled in a hurricane from her mouth.\n Their silence startled her as much as the sound she’d made. Their faces blank, watching. Mal opened his mouth and closed it again. She left the room, shutting the bedroom door just as she heard Alex begin to cry.\n That was magic, to say a word and have it—momentarily—open up a conduit to the reservoir of feeling in which we all float, but from which we are separated by words, words, words. She felt it in music, and in the accidents of running water or birdsong, the cries of a child. All things—death rattles and purrs and tears—that channeled the unspoken. The Enochian. The Adamic. The language of birds and angels, of the spheres, the sounds that had knit ylem into reality as we know it.\n Then you could say, the house is haunted, and it would be suddenly true. Or a kid could scream out in rage and terror at another child and knock them down with the force of his anger. You could say to your husband, “[ ],” and he would comply, signing the consent form, and spitting into the DNA collection vial, his face calm and blank, as though his soul had been displaced by your voice and by the magic of [ ].\n Temporarily displaced. She hoped.\n There was so much she’d forgotten that now returned to her, as though [ ] had cracked something in her mind. A spring evening, when it was still cold, but you could play outside after supper. She often sat in the garden of their little house where it backed onto a ravine. There were frogs, a hunting owl, rats rooting through garden refuse, mice and voles and rabbits. Once, after the stars came out, she heard a singular note of birdsong and called back to it, wondering if it was singing in its sleep.\n Until the evening she heard that sound, a scream tiny and incessant like an alarm, broadcasting its terror. It grew louder as she walked toward the ravine, and she grew more and more afraid of what it was. Not of anything the creature might do, but what had happened to it to make it cry out like that. She wanted to run away, let it die, but suffering stained the air and she stepped forward, covering her ears. Then—knee deep in the ivy—the scream intensified, and she thought maybe she’d stepped on it and now blood gushed like panic from its mouth. She’d made things so much worse. The new sound galvanized her skin, she felt, almost, as though the noise was not something she heard, but something that was now inside her brain, in her blood. It felt like alcohol on road rash, like nightmares and migraines. Like your mother turning away in brittle rage because you couldn’t stop crying.\n So she ran away, the scream falling behind her, but the panic remaining. She wanted to cut the thread that bound her to that suffering creature, now burrowed into her heart.\n She wished she’d dug through the ivy until she found where it was hidden. When she crept home, she had tried to talk about it over the bleed of the TV in the living room, where Mom sat smoking in the blue-dark and watched grown-up shows. “You’re too sensitive,” she’d said as she always did when Gracie wept. “It’s nature.”\n But Gracie knew the truth: she should have been a braver child, defied nature, found the wounded creature, and brought it home.\n By train to Toronto early the next morning. A car would collect them at Union.\n “I don’t get why. Like. Why do you have to.”\n She put another stack of small T-shirts in the duffle bag. She couldn’t look at him. If she did she would—“It’s okay,” she said.\n “You said how long but.”\n “Ten days. They do this on-site therapy. It’s supposed to be immersive. It’s okay.”\n Mal yawned. “Okay.”\n “You need to sign the thing.”\n While he signed—slowly—the parental release form, she collected books and stuffed animals and small cars. Alex and Mal sat on the couch watching cartoons. She ordered a pizza.\n “I feel like I took a bunch of cold pills. Like I just hit the DXM or something.” Asleep against Mal, Alex grumped. “You sure you don’t want me to drive you to the station?”\n “We’ll cab. Way too early.”\n That was a lie. Much of what she had said to Mal in the last week was a lie. She felt the ugly weight of it in her mouth, the way she had leaned into his resistance and said, it’s okay, and how that had left him fuddled and compliant. She felt how easy it would be to do this daily for virtuous reasons: to stop a fight, to put him to sleep, to prevent him from eating the chocolate he was allergic to but loved. All for his own good.\n She set the duffle bag by the door and swore—in silence—that this was the last time she would ever exercise her peculiar and terrible gift. She’d get Alex the help he needed, then she’d fall silent forever. But right now—this moment, her hands shaking as she filled Alex’s backpack with snacks and small cars—she needed to be brave and reckless and dangerous.\n “I’m sorry. I love you,” she said to the sleeping house. No one answered.\n She lost her bearings north of Toronto, after the sun set. Soon after that, she lost reception. Their first stop in hours was at a tidy, chain-link gate. “How much further?” she asked the driver. Alex asleep in the car seat, holding her hand.\n He cleared his throat, “Half an hour.”\n When they stopped again, she woke, suddenly well-lit in the parking lot of a building surrounded by bush. Alex’s resistant cries as she unbuckled him, and the driver had their bags, even her purse, before she realized.\n “Grace! Alex! You guys must be exhausted. We have your room set up. Are you hungry?” Tom’s familiar, honeyish voice was a relief. She was happy to follow him through glass doors to a quiet room, lux and hotel-like, a large TV, a small kitchen.\n She stood at the huge windows, buzzing, an irritating, low-frequency sound that seemed to emanate from inside her own head, as though all the anxiety of the last months now flooded her auditory nerve. Alex hung in her arms like he was still a baby, his face buried in her neck.\n “Do you hear that?”\n Tom shrugged, “Maybe climate control? I can’t hear anything.”\n But the next morning she woke with the same low buzz, like an oncoming migraine. Tom knocked at the door midmorning. For the first time in their acquaintance, he seemed brittle, nervy, his eyes bright, and his hands restless as they walked to the playroom where Alex would spend most of the next week. He showed her views from high windows, a sunny courtyard with a swing set. The unbroken horizon of boreal forest.\n “Where are the other kids?” she asked.\n “The last group left on Sunday, and we’re waiting for another cohort next week.”\n “I thought—”\n “—Alex is temporarily our sole charge, and I think he’ll really benefit from that. You ready for that, buddy?”\n “Is that—”\n “—you want to go play with some toys?” Tom glad-handed, cheerful. “They have some awesome fire trucks in there.”\n There was room for a dozen kids in the playroom, invisibly wired—she guessed—to record every utterance. Alex alone and doubtful, holding her hand until a pretty blonde woman took him away to the coloring books by the window.\n In Tom’s office she tried to breathe deeply. It should be serene: blond wood, white walls, abstract art. Tom smiling and smiling and smiling. But the sound—\n As though he recognized her disorientation, he started the conversation, “So. How are you doing.” He said it like they were friends, one hand on her shoulder, with the comfortable manner that had enchanted her when they first met, which made conversation easier than it had ever been in her life. Which had brought her here.\n She struggled, “I.”\n “I know. But now we’re going to talk about you. And what you are.” He laughed. “God, it feels good to just tell you everything. I haven’t lied. But you had to trust me first, or I knew we’d never get you here. I’ve wanted so badly to tell you where you come from. Genetically. Epigenetically. I kind of don’t know where to begin. But you’re part of this project. A few centuries in the making.”\n She licked her lips. They cracked. “What. Are you looking. For.”\n “I told you weeks ago. The language the birds speak. The language of the spheres. We want to know the native language—the mother tongue—of the universe.”\n There was no possible response to this statement.\n “I know, it’s insane. Actually we don’t know if you speak it, exactly, but you’re closer than a hundred thousand other experiments.”\n “Is there something wrong with your monitor? Where is that sound coming from?”\n “It’s all been dead ends. A few hundred years ago we conjured angels in scry glasses and tried to translate what they told us. In Iowa in the 1930s, we induced stutters in the children at an orphanage because we thought perhaps the original language was socially created. We had families raise chimpanzees with human children in the 1940s. That led to more work on animals in the 1960s. We funded fieldwork in the Congo, with the gorillas. Then more primates and the isolation experiments.\n “I told you about the software we wrote for Harlow. We also used it on our own archive. Centuries of stuff all integrated by machine learning. Genetic profiles and field notes. All the studies of Romanian orphans and hospitalism. It’s giving us a God’s-eye view of centuries of inquiry. Millenia, if we go back to Herodotus’ account of Psamtik I.\n “This is where it gets strange. A couple of years ago that software flagged a record from the sixteenth century. Six children were placed on an island called Inchkeith in the Firth of Forth. Two young women cared for them, but were forbidden to speak to them, sing, even look them in the eye. It’s a very old experiment and it always failed, but they kept trying. Apparently, they were onto something, because in this case one of the children survived. A little boy they named Enoch. He spoke words in a language the officers did not recognize, but which made them weep. However, when it was time to take him back to Edinburgh, Enoch and the young woman were gone.”\n Through her headache, Gracie was visited by a strange and irresistible conviction. The girl was young, maybe eighteen, paddling through the blackened sound under a sliver of moon, a little boy strapped to her back. They traveled north, disappearing into the highlands. She was clever and wild, and she might not have understood what was happening, but she had watched the other children die. Enoch in her arms, a changeling, a creature no longer quite human, by reason of—them. She loved him. She was brave.\n “A hundred years ago—fifty years ago—we couldn’t have followed up on Enoch. But now we can access genetic databases from Scotland and the diaspora. We were identifying FOX2P mutations in the R1b-M269 group and it seemed like another dead end. Until I thought of phonemes. Jesus. I just wish I could show you everything I’ve learned, Gracie. I know you’d understand it better than I can. We had to write a bunch of new code to analyze audio, so that slowed us down for a couple of years. But ultimately it worked. We fed it everything we could find, every utterance, ever field recording. And it found this. I think she’s one of your kind. She’s singing to bring the cattle home.”\n His hands shook as he found it on his phone, and she listened, while the vision of the girl and the little boy persisted in her eyes. The woman’s voice was elderly, without the range it must have once had, and her breath was short. She seemed to sway toward and away from the mic, a rhythmic swing in time to her call.\n She was sweating. She gripped her knees so her hands wouldn’t shake. His eyes were brilliant, searching.\n He didn’t seem to notice her fear, just showed her the image he found. “So this is where it was recorded, and this is where we found some curious genetic markers.” A scattering of red on a map. “And this is where your great-grandmother came from.” Zooming out, Grace could see that the girl had carried Enoch as far north as she could from Inchkeith.\n “It’s just Gaelic,” she began. But no. Among the soft gutturals she heard something that cut through her heart, that might be mistaken for an artifact of recording, a fumble of the singer’s tongue. But it wasn’t: it was [ ] Come home, come home it sang to her, oh come home to me.\n Her eyes prickled. Home was Mal and Alex falling asleep in the early evening. Was he still sunk in cobwebs as she had left him? What had she done to—\n “What does it mean?”\n Come home [ ] come home to me [ ] the old woman sang, now joined by the lowing of cattle down from the high field, where—\n “What does it mean?”\n “I don’t—”\n Mal was home, alone. Oh, come home, oh [ ].\n “—I can tell you recognize it.”\n “It’s. Home. Like. Imagine it’s eleven and you just finished your shift at Starbucks and locked up alone and it’s raining, but you know someone is coming to get you, and you see their car turn the corner. Home.” It meant—but how would he grasp it?—Mal and Alex cuddled together, asleep. It meant the bier in darkness, and the sound of breathing animals, the rain falling outside. It meant a girl’s arms around the surviving child, carrying him to safety across the black water, guided only by the moonlight—\n As she said it, the buzz in the room grew, once again, unbearable. She covered her ears.\n “Say another word. Say something.”\n “I don’t—”\n “—Say what you say to Alex when he’s sad.”\n She swallowed drily.\n “[ ].”\n “Say it again.”\n “[ ].”\n “I can almost—Sometimes I think I can. When I listened to you talking to Alex one night, when he couldn’t sleep—Don’t look so shocked. We record everything within the range of your phone’s mic. It’s in the permissions on the app. Always read the EUA.”\n “Don’t—” she tried to say. “I don’t want you to—”\n “Say it again.”\n She started to shape the sound, but something ruptured inside her. It breached her throat, and her tongue shaped it into a sound she had never made before. [ ].\n Tom cried out. Fell back like he’d been shoved. When he straightened again he smiled, and she was—how could it be?—more afraid of his smile than she had been of his demands.\n “Do you know what I would give to be what you are? I tried. Salvia. DMT. Sweat lodges. TM for a while. Electroshock—I have probes in my brain originally developed to treat Parkinson’s. Back in the sixties some researchers thought trepanning was an early response to the loss of that faculty—that we could regain our ancient voice through psychosurgery. I’m slightly embarrassed to say I considered it.”\n He laughed. Viscous spray from his mouth, where there had been the gold honey-tones of their first conversations.\n That night, she locked and dead bolted their door and pushed a chair against it before she lay down beside Alex. He tossed and climbed and floundered, refusing to stay still long enough to fall asleep. She, exhausted, slept briefly, then awakened to find him pawing at her face.\n “What is it? What’s wrong with my Alex?”\n He covered his ears.\n “I don’t know how to stop it. But we’ll leave in the morning, as soon as the sun comes up. I promise. We’ll talk to Daddy, and he’ll come get us.”\n “[ ],” a rough-edged grunt that buzzed her eardrums painfully.\n When he fell asleep—after eleven—it was in her bed with the blankets pulled up over his ears. She got up to check the locks, then sat at the open window so the sound of insects and trees could drown out the building’s whine.\n She had been fighting it like a headache, but now in the quiet she closed her eyes and listened for the first time to the terrible ambient noise. It was the touch of a damp finger, a torn fingernail, a rusted wheel screaking on the edge of audibility. The flicker of the lights overhead so subtle she could not be sure it wasn’t some throb of her eyes.\n “What do you want?” she asked the air around her.\n What happened next was not a sound, but a bursting sensation inside her skull, like noise could shift muscle and bone and neuron with the weight of its longing. For what? For something precious and lost. For the loneliness of living in a world that cannot hear you.\n She remembered Alex when he was very small and fretful, ill at ease in the first weeks out of the womb. How she had lent him her calm and her stillness and helped him through that first strange transformation from inside to outside. She hadn’t spoken, just let their heartbeats twin until he felt safe. She remembered the pain of his crying in those first weeks, her breasts heavy and leaking milk with each wail. She remembered how she had whispered nonsense syllables—or so she’d thought—into Alex’s ears, and how Mal lay there, too, and listened to the sounds of angels, and birds, and the world before Babel fell and we all lost one another, falling away into the lonely silos of our hearts and words.\n She collected her phone and their bags, filled a water bottle, and wrapped Alex in the coverlet. Then out the door, quietly down the hallway where they would—if they had to—walk out. She was down the stairs to the lobby, and through the window she saw moonlight.\n “What are you doing, Gracie?” Tom. Her heart accelerating. “It’s the middle of the night. Aren’t you tired?”\n “I thought I heard—is there another kid somewhere? Do you have—”\n “Jesus Christ! It’s not like—we don’t have a dungeon or anything. You know, I didn’t want to do this. But it should be fast. I hope. It’s a blunt instrument.”\n He fumbled for his phone. It started in her neck, a familiar prickle and crawl, a wriggling finger inside her spine. She gasped.\n “Alex—”\n And then she recognized her own voice—but not precisely her own voice. Some process had rendered it strange to her, and terrible, but she knew the moment they’d recorded. It was the day she made Mal sign the release and give her the sample. She could hear the cruelty, the fear, in [ ], the sound of high treason committed against the man she loved.\n Alex was crying. She couldn’t do anything. And Alex was crying, and now it crescendoed. The air itself grinding, like the machinery of the universe had locked up tight. The abjection of a child separated from his mother, like a rabbit dying in the ivy—the sound—\n “Yeah. We got that from your phone. It seriously made me feel bad for Mal. You’re on the floor again. Don’t worry, it won’t last long—”\n “You’ll like this. There are ancient records—Herodotus mentions them, and Josephus—You okay on the floor?”\n The sky behind his head was blue. Somewhere, Alex was alone. The carpet beneath her was warm, surprisingly plush. She must—\n “Where. Is Alex?”\n “We’re going to have to start soon. You don’t have to worry about him.”\n The sickly grind of a car accident inside her head. “Where,” she repeated.\n Then he was talking about epigenetic triggers that produce unexpected expressions of familiar genes. CHRM2, for example—this is interesting—in a positive environment, is associated with superior intelligence. But it’s associated with mental illness and addiction in traumatic environments.\n “You carry an unusual mutation of CHRM2, which is usually recessive in women. You’ve passed it on to Alex. You also have an unusually expressed HRM17, which interacts with both CHRM2 and the FOXP2. Do you understand? Four hundred years ago we triggered a change in your ancestor, and here you are. Our prodigal daughter.”\n “No,” she said. The air rippled. “Stop.”\n He shuddered, but his mouth still smiled.\n “[ ].”\n He coughed something thick and wet onto his desk. Then he had the phone again, and—\n He told her: We have a dark history. We don’t want to pretend otherwise. But should we give up everything we learned in those centuries? We’re a different organization now. We reached our ethical event horizon in the last century, when we affiliated with Indian Affairs and started working on the reserves. Then in seventies, with the pit of despair, but that forced us to rethink our priorities, not least because it just didn’t work. The rhesus monkeys went mad, and when they were impregnated, they ate their own children. It’s a stain on the otherwise transcendent goal of our organization.\n He told her: Some of them wanted to harvest your eggs as soon as we’d identified you, but I said no—we’ll start with the EEG and the neuronal probes and when she’s ready, we’ll think about eggs. Besides, you might need to gestate the children yourself—the parental bond is obviously important.\n He told her: You can leave at any time. The doors aren’t locked.\n He told her: Alex is fine. We’re not monsters.\n He told her: We’re not monsters.\n “[ ],” she said, “[ ].”\n The nurse attached the electrodes to her scalp with a thick paste. A thin shriek from somewhere nearby, maybe the walls, startled her like ice water. She struggled to sit, and Tom smiled, and she heard the warm purr still emanating like honey from his lips. A confusion of scent and sound—\n —That shriek again.\n “No,” she said to the nurse. “Don’t.”\n Another electrode. She filled her lungs.\n “[ ].”\n The nurse looked surprised. “What—” he managed to say before she inhaled again.\n “[ ].”\n Like your knee slamming into the stone floor. Like a finger bent backward at the knuckle. Like stepping on a nail.\n He hit the floor. She had not expected the blood. She staggered to her feet as Tom fumbled for his phone, his nose bleeding.\n “Gracie. Please. Don’t—”\n “[ ].”\n In the dark hallway she crept forward by the light of the moon, which sailed over the black boreal forest outside, and she was more lost than she had ever been. She paused at each corner to listen for a footstep, or the sound of a door closing in a concrete stairwell. Nothing. Only the whine, growing now, of something deep in the building she could not name, which nevertheless called out to her, mumbling and roaring and chattering. A social creature in total isolation, tormented by a thousand thousand simulations that nevertheless failed to teach it the language of the birds and the spheres and the angels.\n She was afraid, but she must be brave and wild and clever and follow her ears and her instincts through the dark, listening at each door in turn, until she heard a tiny voice calling out.\n On the other side of the door, Alex lay sedated in a hospital bed, communing with a machine. Someone taking his pulse. Someone else watching. She had never hated like this before.\n “What are you—” one of them began.\n “[ ].”\n She had done something. It was bad. The blond woman. The driver. Another woman she didn’t recognize.\n Blood, some of it hers. The sun was far above the horizon. No cell reception. Alex sleepy, scratched the abraded skin at his hairline. The building had fallen silent, waiting for those strangers to wake again from their brief, violent sleep.\n She traced the red skin and found four points, as though he’d been fixed in place, screws digging into his scalp. She found no flaps of skin where neuron-sized probes might have been inserted through a hole in his skull. She found no stitches.\n “You okay?” she asked him. He said nothing, rested his head on her shoulder.\n She shaded his eyes against the brilliance of the day. “It’ll get better, I hope. [ ]?”\n He drank the water across her hand, then set his head down again on her shoulder.\n She wondered if one of them was waking to blood trickling from nose and mouth. The red crusts in ears—burst eardrums, perhaps. She knew, only, that she had carried away her thin, feverish Alex, and that in the darkness a strange, inhuman voice had helped her. That was something. Maybe. At home, Mal waited for them, and he was afraid. She would make it right. She would tell Munira the truth. She would be brave and clever and wild.\n “Can you ride on my shoulders? We’re going to have to steal a car.”\n “[ ],” he responded, and she lifted him up and over her head. Somewhere above them, a bird sang.\n Rebecca Campbell is a Canadian writer and teacher whose speculative fiction has appeared most recently in The Magazine of Fantasy and Science Fiction and Shadows and Tall Trees. Her work has won the Sunburst and Theodore Sturgeon Memorial Award, and been nominated for the Aurora Award. NeWest Press published her first novel, The Paradise Engine, in 2013, and in 2022, Undertow Publications will publish her First World War horror novella, The Talosite. She mostly uses her PhD in Canadian literature to make up sad futures and weird fictions."}