{"fingerprint": "O8t4LWdoIqDW9hbxCGgwJUmYaPU=", "sitename": "Clarkesworld Magazine", "title": "When We Find Our Voices by Eleanna Castroianni", "author": "Eleanna Castroianni", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/castroianni_12_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: When We Find Our Voices by Eleanna Castroianni", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10340 words, novelette\nWhen We Find Our Voices\nThey load us on a boat on the night when the moon’s egg cracks. I put one foot behind the other on unsteady cedar wood planks, my ankle ornaments shaking. We are veiled in purple damask, our hair and feathers oiled with aromatic resin. By the time we reach the shore, the smells of tar and stale water will have latched onto us, baptizing us in the memory of blood.\nThe lake shimmers crimson against the lantern light. Nyalu huddles close to me and I’m trapped between his spicy breath and the lacquered boxes that contain our few possessions. Beneath our veils, he links a talon to mine, our feathers brushing one against the other in comfort. He is looking away from me, beyond the boats floating around us, towards the bonfires waiting on the other side. His profile is glowing red-white, aquiline nose and swanlike cheekbones.\nWhen he’s not watching I steal a glance back, to our island. They say it’s bad luck to look over your shoulder on weddings and on funerals, because you’re looking back at a life that needs to end.\n“You’re still close,” Nyalu whispers without lifting his eyes from the bonfires. I can barely hear him over the sound of oars against water. “Take in as much as you can.”\nAs we draw farther from our shore and closer to our new homes, I follow his eyes. The faces of our husbands stare at us. Each of them is holding a torch as if they’re about to set things on fire. Each of them is wearing undecipherable expressions on smooth faces, the highlights and the shadows of the torch flame dancing over their features like moths.\nNyalu squeezes my hand, burying a blunt talon into my flesh as if to wake me up from sleep. It’s time to wear our wedding rings—the gifts sent to the island two moons ago, for our husband to mark us as his. Nyalu slips one pearl-white ring over my wrist, then traces the chain to find the other one; I push it down gently over his hand. His fingers shake—it’s not the boat’s rocking. The pairs of brides around us are already restless, already standing on their feet inside the boats, wings flapping anxiously underneath their veils.\nThe hairless, featherless arms of men are tying our boats to the pier, unloading the stacks of lacquered boxes. A gloved hand reaches out. Nyalu is behind me and almost loses his balance as he hops from wood over water and onto the earth.\nBeneath our feet we find flat, concrete rock. We careen through the silent faces of husbands, through a swarm of veils, feathers, hands, and feet covered in bridal tattoos. No words of welcome, no music or dance to celebrate the group wedding. No mothers-in-law to host us. This is a nation of men.\nWhen our feet touch the shore, we’re married to the land. When we reach the country of the Un-Adapted, we belong to them.\nThe stars unfurl like ribbons above us. Between unsmiling faces of stark shadows, between the chains of gold and silver, bone, iron, and coral, I see the man that carries a pearl-white chain. Our eyes lock and I float his way, dragging Nyalu behind me.\n“Is that him?” he whispers into my ear and I squeeze his hand in response. Our husband turns his back to us and, without a word, without a touch, starts walking home.\nNyalu and I will share a room. A servant takes us to the bridecote and we are left to stare at each other. Since we found him on the pier, our husband hasn’t spoken a word to us.\nThe room is small and dark, but it smells of roses and is equipped with every possible comfort—although weapons, knives and anything that could be used to cause harm are strictly forbidden. We are shown a little protrusion on the wall. When down, it’s dark. When up, the room is full of artificial light, making evenings as bright as days. The room is warm, but we see no fire. What strikes me most is the tub that can be filled with hot water. We are used to bathing in the lake and warming tubs of water sounds wasteful. The Sons of Man have all these tek-magics we barely remember, although even they must use them wisely now. For our husband to have all these luxuries in his home he truly must be a powerful man.\nOn the table, there’s an earthenware bowl of thick cream littered with flower petals, and a plate of thin biscuits smelling of seed grass and rain. The smell is enough for me to notice how hungry I am. The full, buttery taste of the cream leaves me stunned. We’ve never had food as good as this. We grew up in scarcity, yet here is the land of plenty. All I can hear is my teeth’s clatter and suddenly I see Nyalu’s tears.\n“I’m sorry,” he says. “I’m not brave.”\nNyalu first tells me the same thing three years ago. It is the time when the moon cracks and acidic blood colors the water of the lake red. The time when brides leave to meet their husbands.\nOn this day, the year of our first birthday after we turn twelve, we are designated a bridal couple by a paya elder and we are asked to bathe our arm-wings in the bloodied lake and burn the tips of our feathers, to brandish them in the vitriol that will dye them scarlet forever. They give us roses to eat and mine are salted with Nyalu’s tears. Men and women of our kind are allowed to show emotion—men are supposed to lean more toward anger and passion, women toward sadness and exuberance. But I’m neither man nor woman; I’m etu, and it is not acceptable for us to display any emotional extreme. Sometimes people tend to think we don’t feel at all.\n“Keredi, I’m not sad because you’re my pair,” he says, wiping his tears hastily. Some of these, I think, are tears of happiness. “I’m so glad we’ll be brides together. I wouldn’t want anyone else.”\nI say that I know and that I feel the same. I let him cry inside my arms and feel my own forbidden tears finding a way out through his.\nHe lifts his head to look into my eyes. His irises, awash in saltwater, have faded from tree-bark brown to a golden honey hue. His breath smells of roses. “I cry because I’m not brave,” he says.\nOur world once cracked like the moon’s edge does, once every three years. Blood water rained from the skies and burned us, changed us. To survive, we were made into what we are today: Descendants of Bird. When I travel further back inside my mind’s time, I remember paya Alti saying it was the things that the Sons of Man did to our land, when they arrived from their faraway homeland. Those were the things that ruined our world, that changed it forever. Once they destroyed their own, they sought other worlds to satisfy their greed.\n“They harnessed the forbidden power of beasts to fuel their perverse visions and desires,” the paya says, eyebrows curling fiercely like shiny beetles. We are sitting inside a grove’s cool shade, paya on a rock, we on the ground.\n“So the Sons of Man tamed the gru?” a girl asks, her jaw slightly ajar in a foolish manner.\nWe watch the paya’s eyes widen with well-controlled indignation. “Idiot!” the paya exclaims, as they do every time. Paya Alti is etu—but also very old and very opinionated and their failed efforts to control emotion are endearing to our eyes. “Idiot!” We are holding our bellies from laughter, yet paya Alti is oblivious to our amusement. They take a piece of calico fabric out of a pocket and wipe the sweat trickling down their temples. Hot summer days are tough because of all the thick, black-and-white feather ruffle around their neck. This makes the paya look even more comic to our eyes. “Not gru, of course not gru! You think a trunked beast could crack the ground in two and make rain of blood? Beasts of power, idiot! The beast that made light. The beast that made warmth. And so on. These are the gods of the Sons of Man. The gods they made for themselves. The gods that almost destroyed them!”\n“Why don’t the Sons of Man have women or etu?” another child asks, a slight lisp in their diction. “Did they run away and leave them?”\n“The men claimed they never had etu,” the paya says, lips pursed with the weight of knowledge. “I don’t believe it. I think they had, but perhaps they were different from us. Now we’ll never know. The women—they killed them all in an accident.”\n“An accident that only kills women?” Horrified gasps and whispers, especially from the girls. I am among the older children in this group and I’ve heard all of this before.\nThe paya nods. “Another one of their beasts. They thought they could overcome illness and death! Such arrogance! They made worms that went out of control and killed everyone who could carry a child—that was their women. They could carry children inside them, like gru ewes. You can’t play around with illness, can you? You’ll get sick yourself.”\n“Why do they take us as their women? What do we owe them?”\nThese words are mine. These words make paya Alti stop and share a stare with me, a measured glance that marks me a rival and an equal: an etu with the power of wording the truth in questions. And it’s the moment Nyalu first notices me and decides to befriend me later that day, because, just like he sheds the tears I can’t shed, I speak the truths he cannot utter. Early on, we learn that we need each other.\nAfter a long pause, the paya whispers: “Idiot.” No one laughs this time. “Don’t you know one does not bite the hand that feeds them? You think we’d survive without the Sons of Man? They have all the food. And all the weapons. And our Voices.”\nI am on the losing side of this etu argument, but I’m young and want to win. “But we’re the Changed ones,” I say, my voice coming out too high-pitched for anyone to take me seriously. “They’re the Un-Adapted. They should perish—”\n“Idiots!” Paya Alti screams at our faces and walks away. The children are left to stare at each other embarrassed. Only Nyalu comes to me that day and declares me friend.\nNo one asks the paya this question again.\nI see our husband only once each day—in the morning, when he gives every member of his household their list of duties and chores. From between my eyelashes, I watch him: young, confident, with rich dark curls and cold eyes. What must their women have looked like? I understand enough of his tongue to know that our husband calls us both “she” although neither of us is a she back home. Here, we’re brides, we’re a category, we are their women. He never says our names, only “she for the bed” and “she for the egg.” I doubt he even knows what our names sound like.\nNyalu sees him twice each day, once in the morning with the rest of us and once in the evening, alone. After the sun sets and after we finish our dinner of wrinkled dates and gru milk pudding, Nyalu opens the door and heads to our husband’s bedroom. He comes back half an hour later, somewhat fidgety but always with a little smile. He never cries now—he cried only that first evening when we arrived, then stopped. I don’t know if this means he’s gotten braver. I think bravery has nothing to do with not shedding tears, anyway.\nI lift a blanket and let him curl inside, my own body too warm against his gentle coolness. Like a child, he closes his eyes and his grin widens. His feathers smell of lemon balm and something I cannot recognize.\nWhen we live on the island we have washing days—warm afternoons when we go to the lakeshore to bathe ourselves. Nyalu has been brushing a talon obsessively and I know something is on his mind. “Our Voices are in the land of the Sons of Man. They keep them locked,” he says at last, after many, many questions and answers around the bush.\nWe have been designated a couple; we have seen the Voice of Kitu. We are walking inexorably toward our fate. The Voice of Kitu left me changed, and I see how it has changed Nyalu too. Once he saw it, he couldn’t put it out of his mind. Have the paya ever wondered the point in showing us the only Voice we have? I see none, except planting obsessions in the minds of youngsters.\nI comb my hair with the spinebone of a grass trout, spreading flower scents along its length. I am careful what to say to Nyalu sometimes, because he takes things to heart. But I can only speak the truth, like the paragon of etu that I must be. “No one is supposed to ever get their Voice, Nyalu,” I say softly. “Not even in times before the Sons of Man arrived.”\n“I thought you shared these thoughts.” A small wound in his voice.\nI stop my combing and breathe deeply for a few moments. “I do,” I admit. “I am angry. But remember what paya Alti said. Remember what happens to us when we transgress.”\nTo my surprise, he doesn’t look shaken. He pours more water over himself—droplets clinging onto his eyelashes like dew—then shakes his head violently, hair and feathers flying around. The way his eyes harden like ice scares me—it’s the first time I see them this way. “I’ll find a way,” he says. “I’ll get my Voice. And I’ll get yours too.”\n“Keredi. I think it’s time.” He tells me these words in the middle of the field, when my hands are raw and the basket on my back almost full of water yam.\nI take a moment to breathe, to squint at the blinding sunlight. “Are you certain?”\nHe laughs and I realize how silly I must have sounded. “Look,” he says and turns his back to me. He drops his basket and reveals the feathers attached on his back-wings, glowing magenta and blue. The shimmer travels all the way down to his wing-arms, clinging tightly onto each feather-spine.\n“Is this the Glow?” I ask and he nods from over his shoulder. Nyalu is smiling and I can’t help but smile back. “Alright.” I pull yam from the earth again. Its sweet and salty smell fills my nostrils. We are both excited. “Tonight we head to the Temple.”\nWe never learn who our parents are. We never learn because it doesn’t matter—children don’t belong to their parents, as Sons of Man like to think. Among us, the paya raise the children, because they’re older and wiser, because they’ve been brides, mothers, women, and then Sintar again. And often, children raise themselves.\n“Come, we’re playing Blood Water Wedding!” By this time I am older and I know better what these words mean. But the allure of the game is too strong.\nOn one side of the creek, children are standing in a row. We are on the other side.\nA girl gives us flower crowns to ornament ourselves with—we are the brides. Then Nyalu takes the impromptu role of a paya that pairs the brides: for every male or female, an etu. He is giggling the whole time, thoroughly enjoying the power in his hands. When he stands in front of me, his smile grows bigger. We are still young and not paired, but Nyalu anticipates the future in this small game. “O, my favorite etu!” he says in an imitation of paya Alti’s raspy voice. “You’re paired . . . with me!” He finishes his words in his own, mischievous voice as he holds hands with me. He is back in his role as bride and we are ready to cross the lake and find our husbands.\nOnce we are on the other side of the creek, a much younger etu asks, “What do we do now?”\nA grave Nyalu knits his eyebrows. “We make the children, of course.”\nWhispers follow, some giggling. Most of us know how it goes, but my eye catches a couple of children staring at each other blankly until someone elucidates them: “You go to bed. Then we make the egg.” Nyalu shoots me another little smirk before heading off with our “husband” behind a bush, where I suppose they act out whatever they think lovemaking is. All “etu” have stayed awkwardly behind, anxious for the two thirds of their marriage to come back. “Why can’t we go?” the young etu asks. They are staring at me with big eyes and I’m feeling impatient and uncomfortable.\n“Men and women collect the seeds. Etu make the eggs,” I repeat the words the paya taught us.\n“But I want to go,” the small etu pleads in a low voice.\n“You can pretend you’re Son of Man in the next game. Now, see? They’re coming back.”\nNyalu is once again heading the procession, reveling in the drama of it all. “We bring you the seeds,” he announces. For additional gravity, he is holding his taloned palms cupped, as if protecting a secret. “One seed of Son of Man, one seed of Sintar, Descendant of Bird. Etu, you now make the egg.”\nHe drops in my hands a dandelion stalk and a tiny yellow stone. Meticulously, I kneel and start making a small egg out of mud as the other ‘etu’ imitate me using whatever seeds their spouses bring them. I shove Nyalu’s and his husband’s “seeds” inside the mud, then hand it back to them. “Now we wait,” I say and turn to the other children. This is always our favorite moment of the game. “What will hatch?” I ask.\n“Son of Man! Son of Man!” the children shout, ecstatic.\nTo make the egg, we must leave the house. To mark the importance of the event, our husband’s servants put us in a palanquin and carry us to the Temple of our ancestors. At the sight of it, the magnitude of our culture, of what we used to be, strikes me for the first time. Statues of giant birds—much like us, but also, very different from us—grace the entrance. Our ancient gods are broken in several places and claimed by vegetation, rain stains, and lichen. Even like this, they’re still our own. As we enter, I wonder how many more places inland used to be ours, how many traces of my people were erased by Sons of Man as if we never existed.\nInstead of the Temple hall we’re led down, down inside the basements in the belly of the building, where the eggs are kept in rows of shelves, clearly labeled with the fathers’ names. The only moment we are given any privacy is when they put us in a small, windowless room from which we cannot leave unless we have produced an egg.\nIn the dimness, I look at Nyalu’s bright eye-light. “Are you ready?” I whisper.\nHis excitement beats my nervousness. “I’ve always wanted to make an egg with you,” he says and my heart wavers inside my ribcage.\nHe turns his back to me and I can see everything clearly. The Glow and shimmer have amassed, painting every rib of every feather in light. I gently touch one with the soft pad of my finger and the bright light sticks on it as if it’s solid.\n“Ah!” Nyalu gasps over his shoulder. “It always slips from my hand! Is this an etu’s touch?”\nI say nothing, only wrap the Glow around my talon as if I have always known what I’m doing. We’ve received training, of course, but a lot of this is pure instinct. I start to soften the light into a thread, then maintain a steady pace: with one hand I pick up and soften the light, with the other I mash it into concrete. I try to reference the long lessons intended only for etu and all I can remember is that the Glow is truly but a watery sack in which Nyalu’s body keeps his own and our husband’s seeds. The “egg” is the case where the combined seeds can grow.\nAlthough Nyalu and our husband produce the same type of seed, the egg can join them as long as there are three distinct parents involved. This is the wonder of Sintar, who join in threes just like the bird we merged with—unlike the gru and other animals that join in twos. I think a paya once mentioned this highly advanced tek—never to be repeated, as it is lost forever—is one of the reasons why we survived the damage to our world: we mixed with another species, so we learned how to adapt. We were changed, so we can now change the world. We can mix with Sons of Man and keep them from perishing. In a way, all Sons of Man are now part Sintar.\nNyalu lifts his head, stares at the desolate ceiling. “Our Voices are in this building,” he whispers. “They’re sleeping somewhere above us.” It’s a punch in my stomach; I thought he had forgotten all about them. Visiting the Temple rekindled his obsession.\nWithin a few moments, he is very, very far away, and I’m all alone with a half-made egg in a half-ruined world.\nOur first child is etu. Naturally, since our kind is about half etu, and the other half shared between men and women. We never see the egg hatching; they hatch in the Temple. We never hold our child in our hands; it is not ours. “You made a neuter.” We are only told this fact, so as to know that our duty has not ended. Tonight, Nyalu goes upstairs to our husband’s room again.\nI lie wide-eyed in the darkness, the moonlight holding me. Somewhere on this shore of the lake, my and Nyalu’s child is waiting to be shipped back to the island. I close my eyes, trying to feel grateful that our offspring is going home, to the care of the paya. I’ve heard what Sons of Man call etu babies when they are born—sexless, neuters, freaks—and I wouldn’t want young etu anywhere near here.\nWhen Nyalu comes back his dragging feet wake me up. I don’t see him smile. He turns slightly away from me and I can’t find his eyes. “Did something happen?” I ask and open my arms wide. He doesn’t come in. He only lies at the edge of the bed, a sea of empty space between us.\n“Are we so hideous?” His voice is like a funeral drum. He never says a thing about our child. Ever.\nI dare not speak of what I heard as I passed by the common room last night, where our husband was entertaining guests. Winged pussies that can’t fly. Damn hens. Do you fuck with eyes closed? I need something to not feel the feathers. I ripped the talons from mine.\nPerhaps Nyalu heard this too. I don’t wish to repeat it.\n“Maybe we are, to them. Paya used to say our kinds were alike, but we Adapted and they didn’t. So they think we’re tainted or something.”\nHe turns to look at me and his eyes are ice-cold again. His whispers are screams.\n“Tainted? We Adapted! We have adapted so well we can even mate with them and save their worthless kind! What do we get in return? Exile and servitude! They should depend on us, not we on them.”\nI was waiting for this, waiting for it ever since the day we were designated a bridal couple and he was crying. Nyalu has been changing, day by day. I know I’m changing too, but my nature is more private and more taciturn. I can see change and not allow it to take over me. Change finds me and I try to make it my own; Nyalu is at its mercy.\nI reach out to touch an arm, a soft, comforting rustle of feathers. I meet tense muscles, a desire to run away and yet, quietly, he melts into my arms.\n“Soon we’ll have a human child and we can leave. Paya always said it’s better at the Women’s House. And when we’re old enough we can finally go back to the island.”\n“We should let them perish,” he says into the darkness, as if he didn’t hear a word I said. “This was our land—this is our land! We work it! We should take over the Temple. Take back our Voices.”\nNyalu from our childhood is here, in his fancies and follies, and Nyalu of that time during our washing day when he announced he would one day steal our Voices back. I don’t know if I want this Nyalu or not. But I know I need to stop him.\n“You don’t even know what the Voices do,” I rebuke him.\n“All I know is that, now, we’re Voiceless.”\nThere’s not much I can say to that. I close my eyes and seek sleep.\nOur kind’s biggest treasure is the Voice of Kitu. It’s the one and only, first and last Voice we’ve all seen during our Passage ritual. Even after that experience, I’m still not sure what a Voice is or does or how it can be used, but they say all of us have one and that it’s kept inside the Temple. But no one can go in and see their Voice or anyone else’s. I used to wonder if they even existed.\nBecause Kitu’s is the only Voice we have on the island, we’ve built a smaller temple to house it. Whenever we asked grown-ups to tell us what a Voice sounded like, they could never answer because—they said—you only look at a Voice, not hear it. This never made much sense.\nAll I can say is, when I see the Voice of Kitu, I feel I know him, not for what he was, all those hundreds of years ago when he lived, but for what he could have been. His Voice emanates from a small glass the color of bright blue sky—only brighter, brighter, so bright it hurts your eyes. It spreads everywhere around me in rings, it clings on the ivy leaves, on the small temple’s terra-cotta tiles, and the latter acquire a little of its glow. I think I can inhale it. Perhaps I can see the notes of his song, but I don’t understand. I can’t hear, because I have no Voice.\n“Why are our Voices locked in the Temple?” I ask the paya. They have done something to the Voice and it is now slowly withdrawing, returning to the small glass where it is normally contained.\n“Because they’re too strong for us. We must grow into them first.”\n“Only that won’t ever happen,” I say, watching the Voice becoming smaller and smaller. A slightly intoxicating feeling suddenly pushes me to ask for more, more of it. I can see how one might even become addicted to Voice. It is probably wise to keep them locked. “We’ll never take them back, will we?”\nThe paya smiles. “They’re very dangerous,” is all they say, and I know they don’t tell me more because this is all they know.\nThree years later, on the Blood Water Wedding night that follows ours, we make our second child. In the silence of the Temple’s entrails I weave the egg, round and calciferous, when Nyalu jolts up all of a sudden, nearly breaking my thread.\n“Did you hear that?”\n“Hear what? Please come back down, I need to finish.”\nHe sits in visible discomfort, tension lining his jaw.\n“I thought I heard . . . I heard a song. From the Temple.”\n“It’s not Voice,” I rush to warn him, although I’m not certain myself. “You only see Voice, remember?”\n“In the form it’s kept in storage, yes, you see it. But we’re in the Temple. Maybe . . . ”\nFor his sake, I stretch my ears. I instantly regret it. “I hear nothing,” I say.\nHe stays quiet, trying to listen. “Maybe it was my imagination.”\nWe weave the egg for three nights. On the second night, every once in a while, he tenses like a feline, listening. On the third, he simply says, “Did you hear it?”\nI did hear it. But I say nothing.\nAs we wait for the second egg to hatch, our husband wastes no time. He sees Nyalu night after night, hoping to attach enough seed on him for me to make another egg. When I ask to see him, to explain that making eggs is terribly hard and I can’t make another one that fast, he slams the door in my face. Nyalu is waiting for me at the edge of the corridor.\n“Don’t mind him,” he says. “I’ve learned not to mind him.”\nEvery night takes longer now. At first I worry about him, but he always dismisses my worries gently. Then suspicion hits me along with the waspy sting of jealousy. Maybe he likes him, after all? Does he spend more and more time with him, reaching our bed only before dawn? I want to ask him those questions but my pride won’t let me. I iron our tunics and prepare our yam-bread lunches, but up in the hills where we herd the gru during winter, I always disappear, not wanting to talk. When he comes to our room I pretend to be asleep.\nTonight he arrives, smelling of roses and rolled incense. Maybe grass and mud too. Has he been outside? I’m about to turn and have a look when he kisses my cheek in the darkness, then wraps his arms around me, buries his face in my back, and falls asleep instantly. I press my lips tightly together and my teeth rattle. I want to toss his hand to the side, to start yelling. But his warmth is dear to me and I choose to stay silent one last time.\n“Where do you go at nights?”\nHe isn’t expecting the question. We’re milking a gru—an early spring mother—one of us on each side of the massive breast. There’s nowhere to hide with the sour smells of the pachyderm’s sweat suffocating us. “It’s a secret,” he says eventually.\nI can’t translate his tone. Is it playful? Is it serious? “Do you love him?” I dare ask after a while.\n“Gods, no!” he says. A splash of warm milk ends up near my foot. “You . . . you don’t understand, do you? It’s okay. I’ll tell you soon. Please trust me.”\nI have no idea what he has in mind and his secrecy is angering me. But I can trust him, even against my better judgement. This is the easiest task he could have given me.\nOur second is a girl—a bird girl, because Sons of Man can’t have baby girls of their kind, not anymore. If they could, they wouldn’t need us.\nThey tell us of the birth at dinner. The servant leaves us alone and I stop eating. Nyalu’s spoon continues stroking the bowl rhythmically, as if nothing happened.\n“I barely have thread for a third one,” I confess. An etu’s capacity for egg-making varies: two or three is among the lowest, four to five is normal. I can feel it in my bones that three is possibly the maximum I could ever achieve. We both know what this means. “We must make it this time.”\nHe is silent.\nWhen we start making the third egg, a few nights later, he whispers, “I saw it. No, I heard it. I’ve seen what they’re doing here, Keredi.”\nI’m taken by surprise. My head jolts up and I almost miss a thread. “What? What have you been up to, Nyalu?”\nI realize it’s time to reveal his secret. I had been a fool to ever imagine his obsession had settled or that he enjoyed our husband’s intimate company. There has only been one thing in his mind.\n“Every night I spy on them, waiting for a clue.”\nIt’s hard to believe him. As I go back to my thread, disappointment spreads inside me. I thought Nyalu to be wiser. “You’ll get caught,” is all I say.\n“I don’t care,” he mutters over his shoulder and I know he means it. Such words sound courageous to some, but to me they reek of despair. “I need to know. We are born with the Voice and they cut it from us. I used to wonder, why don’t they just throw it away? But they’re using it, Keredi. Oh, I’ve seen it. They’re using the Voices. Ever wondered at the heated bath in our husband’s house, at the artificial light?”\nI keep silent for a few moments, the slow rhythm of egg-making enfolding us. “Magic. Eeneertzee,” I say, the old, melodic word for tek-magics found only in our stories from the past. Eeneertzee: what beasts of light and warmth feed on.\nNyalu nods. “The Temple is where they make eeneertzee. Our Voices fuel it like wood into a fire. Now you know the true reason why our servitude won’t end. We make their babies, we make their food, we make their eeneertzee. In exchange, we are allowed to live. In segregation. Always.”\nSudden panic makes my hands shake. He has gone too far. “Nyalu,” I urge him with a trembling voice. “You learned what you wanted to learn. Promise me you won’t go again. It’s too dangerous, Nyalu. For you. For all of us. Promise me.”\nMaybe it’s the first time he sees me on the verge of tears. He ought to look shaken, he ought to apologize and reassure me.\nHe stays quiet, possibly weighing if he’ll be able to keep such a promise. “I promise I won’t get caught,” he says and I can feel something inside me breaking.\nFor years, I didn’t know why paya Alti was so grumpy, a laughable excuse for normally reticent etu. For years, I couldn’t understand why all of us were so submissive, so obedient. The day I learn, fear lays bone-white fingers on my heart and snatches me. It never gets hold of Nyalu, not quite. This will always be the ravine between us, only growing wider, only love flying from one side to the other like the shadows of birds.\nIn times before our birth, Sintar tried to rebel several times. Every time they were thwarted, every time a bigger massacre, a bigger punishment. “Why are we forced to live on the island? Why are weapons forbidden to us? Ever wondered that?” Paya Alti says. They are calmer this time and I’ve limited my outrageous questions to the vicinity of my mind alone. “All this happened because we wouldn’t collaborate with them. There was war. There was bloodshed.”\nThis doesn’t justify their actions, though, I think, but hesitate to speak this time. The words that follow silence that voice inside me forever. “Last time we rebeled—I did it. I was the one.” The children watch the paya enraptured, their breaths audible in the thick quiet. At once the paya is dangerous, heroic, so much more than another grumpy old person. “I tried to lead us out of the Women’s House and take over the weapons. Take over the land. Want to know what happened?” Brief pause. Anxious eyes everywhere. “They starved the island. They killed wives and sent their parts to the island instead of food. Do you know now what Sons of Man are capable of? Do you understand why they have all that power, not us?”\nPaya was looking straight into my eyes. It must have taken them a lot of courage to say this, when they could have let someone else inform us on our recent history. We locked eyes and, as much as I wanted to defy them, I lowered my glance.\nBut the paya didn’t notice Nyalu stiffening with anger at the atrocities done to us. The paya couldn’t hear the sound of a heart ossifying with rage.\nOur last egg is a Son of Man. At the sound of the news my knees bend at my weight. Nyalu is patting my shoulder in comfort. I have no more eggs left and if no Son of Man had hatched out of this one, I would have had to leave alone for the Women’s House. Nyalu would have stayed behind and another etu would have taken my place.\nFor four years we raise our husband’s son, feeding him milk of gru, giving him all the care that Sons of Man seem to consider motherly. We alternate between us days of work in the fields and days of mothering, and it seems that we have set up a nice little household of our own in our small rooms. A servant inspects our work daily, but otherwise leaves us alone. His father looks at him once—the spitting image of himself—and pays no more attention. His own duty is done, too.\nWe must not teach our son the words of Sintar. It is forbidden, so we must raise him in silence. But he is growing smarter every day and I teach him the signs all Sintar know, the signs with which paya train us too. Now I understand why we have this extensive silent language—it is the only language we are allowed to use with our inland children. Secretly, I call him Thalu, as is our tradition, to take half a name from one parent and half his own. Lu means kind. I chose Tha because it means filial. It is my little weakness, because I hope he doesn’t forget us.\nFour years pass quietly, Nyalu not repeating his wild ideas. I am not sure if he’s stopped believing or if he’s just being cautious. It is a sweet, quiet time of our lives and we both seem to enjoy it. Then at four years, we hand our son to his own kind: to the barracks where Sons of Man grow up and learn the arts of war.\n“Just as I found something I wanted to keep,” I tell Nyalu the night before our separation, “and it has to be taken away from me.”\nMy etu truth seems to resonate with him. “Sounds that this is our fate, always,” he retorts, in a truthful manner that many etu would envy. Then he stretches his arms tenderly, our little son between us, and limbs knit like the petal layers of a rose, we are all holding each other one last time.\nThe day we leave is less ceremonial than any transition we’ve lived through. They take our son at dawn, before we have a chance to hear his cries. How he must be terrified, away from his home, a mere babe?\nEvery single one of the women, of our fellow Sintar, is waiting for us outside the oblong structure that is to be our home now. We are climbing the hill with our lacquered dowry boxes hanging from our backs. An older Sintar that reminds me of paya Alti is heading the welcome committee. From the headdress, I know they are etu. They hold me in their arms and kiss me three times. “Welcome home. I’m Essei.”\nIn the evening, the other Sintar make a feast for us. The thick gru milk pudding is delicious and the loud chatters in our tongue make me feel warm again. Soon, music starts, and dance.\nWe work during the day, then enjoy the nights between us, in laughter and music. Nyalu is sitting away from me, quietly watching the dance. “It’s too fresh,” Essei puts a hand on my shoulder. “I understand.”\n“He is still our child.” The son of our husband, whom we raised for four years. I never thought that the cruelty of taking this child away from us could surpass the cruelty of sending our Sintar babies back without ever looking at them.\n“I know,” Essei tells me. “This too, shall heal.”\nIn our days at the Women’s House, working the fields, herding the gru, Nyalu and I grow apart.\nAt first he avoids me. Then a couple of Sintar—a female and two male ones—befriend him. He slowly seems to find himself again, telling stories in his loud dramatic voice, staging plays. I am happy with how he seems to be doing better, but I cannot ignore the jealousy nesting inside me. At least he is not seeing Sons of Man: some of our fellow Sintar have maintained good relationships with their husbands, and the latter even visit them for sex sometimes. After our unpleasant experience I could not even imagine such an arrangement.\n“Sometimes this happens,” Essei reassures me. “Two brides of the same husband growing apart.” It was our turn to sit inside and make the wool. Nyalu casually avoids every task he has with me and switches chores so that he is with one of his new friends. I pretend to not look hurt. “They’ve been through so much, they know so much of each other. It’s better to just grow apart, for now. Later, when we’re back to the island, it might change again,” Essei explains. I keep silent. I want to say I’ve been watching him drifting away from me for years, but I don’t. I want to say He has never really spoken to me since that night he revealed his secret, never really spoken to me again, but I don’t. For an etu who always speaks the truth, I’ve changed, as much as Nyalu has changed in keeping his feelings hidden.\nIn the Women’s House, we, etu, keep mostly to ourselves. I don’t know what it is that makes us seek each other’s company more. We grow up to always handle more responsibility than men and women, and this weighs on us. I spend my days with Essei and other etu and enjoy only casual conversation with men and women. It seems that the gap between us, the things that keep us apart, have widened now that we’re not sharing the fate of a bride in the same household. They enjoy sexual games, even with their husbands, and we etu cannot partake in this. All we have is conversation between us, storytelling, and loving bonds of other kinds.\nDays without Nyalu are lonely, no matter how many bright etu I can converse with, no matter how I’m surrounded by people of my kind. The small, intimate moth-life we used to share is a treasure that belongs to the past.\n“We have a problem.” These are Essei’s words. They have gathered us all in the Women’s House. In the midst of our circle, lies the culprit: an egg, a pale blue Sintar egg, made lovingly. The parents are two Sintar women and an etu. “You should not have done this,” Essei and other, older etu admonish. “You know it is forbidden for us to make eggs alone. Yet you chose to make it.”\n“I thought I had no more thread left,” the etu parent says the truth solemnly, although their voice is shaking a little. “But . . . turns out I had more. So I had to make this egg. I had to.”\nEssei shakes their head disapprovingly. “Etu make choices; they don’t act on impulse,” they say, their words a sting. The parents look miserable. I glance at Nyalu, who seems lost in his thoughts. Somewhere inside me I’m thankful that the egg is not his.\n“We can keep the child hidden. Can we not?” I dare to suggest. One of the mothers looks at me and I smile back to her.\n“We can’t,” an etu says. “We are not allowed to raise our own on this side of the water. All Sintar children must be shipped back to the island. But there are a few husbands who will be understanding . . . We have contacts with them. Someone can arrange to send the child back. This is the best we can do.”\nThe group seems to accept this decision, albeit with a little worry. I realize that the parents were not afraid of separation—we have learned to not be too attached to the children we bear—but of a bad fate for the child. Essei warns us to keep the egg a secret until it hatches. No Son of Man has need for an egg that will most definitely hatch a Sintar. The only way to save the child is to let it hatch first.\nMonths later, a beautiful baby boy emerges on a moonless night. We are all gathered to watch a mystery we weren’t allowed to experience when we had our children. Before our eyes, the pale blue egg breaks, cracks deepening like lightning, a small head bumping its way out. Feathers still swimming in the liquids of its first cradle, eyes shut that won’t open for a while—he still looks more like a bird than Sintar. The etu parent picks the baby up and they pass her to all of us, to hold and to bless. After that, one of the mothers sits on the floor to feed him the soft, watery worms all newborn Sintar eat. Until he grows un-birdlike teeth and starts to feed like we do.\nI am lost in excited voices and tears of laughter, the sheer emotion at what we just witnessed. I can’t find Essei or Nyalu. Then I see them: they are the only two, far from the others, looking at the egg’s remains intently.\nThey are glowing blue, bright blue, emanating light. “It reminds me of something,” Essei murmurs, almost in monologue. “Never crossed my mind the egg would look like this after hatching! Poor thing,” they glance at the baby. “I must go tell them she needs to go to the Temple now. Have her Voice taken out.”\nWhen Essei is gone, my eyes find Nyalu’s and I discover something there, something I thought I’d never see. I kneel beside him, both of us watching the broken eggshell. We are sharing something I have no words for.\n“You understand what this is,” he says not in a question, but in affirmation. It’s been so long since we spoke to each other, since we sat close and shared important things.\n“It reminds me of the Voice of Kitu,” I whisper, hoping no one else listens. No one else has noticed. No one seems to remember as much from the trance-like encounter with the Voice of Kitu as we do.\nNyalu says nothing. I watch him steal a piece of bright blue eggshell.\nI am tempted to do the same.\nOur friendly Son of Man who would help the new baby Sintar go back to the island turns out to be not as friendly as we hoped. He is angry that we kept it a secret and angry that we let the baby hatch in the Women’s House. After an hour of bargaining with Essei, he takes both baby and eggshells and leaves. Word arrives in the evening that the baby girl had her Voice taken and is on a boat back home.\nIt has been an anxious day, leaving all of us jittery. Did no one else notice the egg? No one else wonder why the Son of Man wanted the eggshells? “They don’t know,” Nyalu whispers to me. We are setting the cutlery on the floor for tonight’s dinner and we speak in low, conspiratorial voices. Our shared secret brought us closer and somewhere inside me a small happiness is warming me. “They don’t really know what it’s like. Essei seemed to remember something, but not much. Only you and I remember Voice of Kitu.”\n“But why?” I ask, as if Nyalu knows. Perhaps he does.\nHe makes a gesture of ignorance. “I don’t think it’s meant to be remembered. The paya wouldn’t show it to us if we could remember. We are the exception.”\nThere is a legend about our Voices, or perhaps several. Now that I know what I know, I can find in the tales the fragments of truth. The Voices can only be seen, not heard. With our Voices, we are too dangerous. We are too weak for our Voices; we must grow into them first, although this never happens.\nBut also, our Voices are taken from us at birth. We don’t know how it’s done and why because our paya have lost that knowledge. And that Voices are used to make tek-magic for Sons of Man—what Nyalu discovered. And what we heard, that night while making an egg, was not a Voice, but the sounds of machines turning Voices into eeneertzee.\nThis is what he tells me soon after the event with the egg. Because the day comes when Nyalu and I are put in charge of the same chore at last. We have to clean up the stone mill that grinds lotus rice into flour. It is the first moment we are alone since the day we moved to the Women’s House, about a year ago. Perhaps it’s the first time he didn’t try to avoid me.\nOur moments with the egg brought us close again, but there is still a lot of awkwardness hanging between us. I am reminded of all those days we used to work together, tending to the fields, herding and milking the gru. “You’ve made friends,” I say. He has heard me, but makes no reply. “I’ve made a few, too.” Still no response. My head is getting hotter, my tongue is ready to speak something hurtful. “I miss our time together. Perhaps we can enjoy our lives more, now that we’re here?”\nThese words grab him, at last, and he lifts a set of eyes to meet mine. I’ve missed those eyes; and yet, they’re not the same I used to know. But it’s alright. I can accept that. I surely can.\n“I’m sorry, Keredi. I’ve been . . . busy.”\nHis apology sounds genuine but I can barely keep silent this time. “I’ve noticed it,” I say and bite my lower lip, instantly regretting my words.\nHe lowers his eyes into a frown. “You don’t understand again, do you? Let me tell you then.”\nThe grinding of the stone halts. We’re covered in white rice powder, like creatures of dawn. “I have a plan, Keredi. You know I do.” My heart aches. Of course I know. I wish I didn’t. “And you can’t stop me.”\nAll this time we kept apart I was secretly hoping he had new friends, new lovers, and that I could feel jealous. But no. The truth was worse. “I thought you gave up on plans a long time ago,” I mutter. “Is this why you’re avoiding me? Because you don’t want me to stop you?”\nHe scratches a feathered elbow and suddenly looks like a child again. I am reminded of a tactic of the paya—a tactic I, too, will employ when I’m paya to the children—that of always ensuring the endangered one is on your side. I have been watching Nyalu drifting away from me for years and, I realize, what hurts me most is that I can’t stop it. The last time I rebuked him he distanced himself completely. But perhaps I can learn how to float with him if it’s the only way to save him from himself.\n“Well,” I say, “if I can’t stop you, then how can I help you?”\nHis eyes brighten with a joy I haven’t seen in years. My own heart sinks as I try to listen. He speaks of the Voices for a long, long time. The sun lowers and Nyalu hasn’t spoken so much to me in ages. “The Voice is really small,” he says, “but it can produce a lot of eeneertzee. It’s like the kind of energy Sons of Man had before everything changed, the energy that blasted this world.”\nI recall stories of small fragments of the world colliding so fast with each other and bursting into uncontrollable light and power. “It’s not the same,” Nyalu explains, “I’m not sure how it works . . . yet. But it’s that much powerful, perhaps more.”\n“What about your plan?” I ask, hoping to get a glimpse soon enough to prevent whatever disaster I can prevent.\n“Not here. Some other time,” he says and my hopes are crushed. “But I will, because, Keredi, I need you in this. It’s the only way.”\nWe grind the rice into flour, its delicate scent coloring our evening. We head back to the Women’s House in a good mood, Nyalu blabbering loudly about last night’s play that the men and women of our House staged, of the heroine’s dress of leaves and of the clever use of dividers to signify different scenes.\nI notice something selfish in what I did: I want him close to me again, I want him back. Although he seems to be back, he’s more distant than ever. When I find some privacy inside my blankets I want to cry; I can’t. I’ve never really learned how to cry.\n“Tomorrow night, I’m not coming back. I need you to lead them all out in the water. Take supplies. As many as you can.”\nHis words leave me stunned. It is too sudden.\nTime has passed since that day on the mill. The crisp winter chill wraps us tightly in her arms. The yam field is bare and we herd the gru, fatten their ewes so that spring brings robust fresh kids. The beasts are peaceful and slow-moving in their endless grazing, their moans echoing in the crystalline air.\nI try to keep my voice steady. To be the wise, sober etu I must always be. “What are you doing, Nyalu? You’ve never really told me your plan.”\n“Trust me. Please.”\nThis time, I’m sick of trusting him. He never shares his plans yet expects that I follow. I can feel my jaw tighten as I say, “I demand to know. I deserve to know.”\nHe sighs and his voice is drowned inside a gru moan. “So it’s time to tell the truth, as you taught me,” he whispers. His voice is frosty like the winter morning. “And it’s time for you to learn how to cry.”\nThese words alone bring tears to my eyes. But I won’t shed them. Not yet.\n“I’m eating the egg, Keredi. The piece of Voice I stole,” he says, matter-of-factly. I turn to face him in shock and his cold eyes are already wandering far. “I know what it’ll do to me—not everything, but enough to know how to use it. The tek that merged us with birds? It helped us survive the destruction. But at the cost of a long life. We used to live much, much longer.”\n“Why eat the egg?” I’m failing to understand. “How do you know all this?”\n“It’s all in the Temple. Not everything, but a lot. The egg is full of eeneertzee. And guess. We are, too. So the two of us . . . Too powerful, Keredi. It will most likely destroy me, but not before I destroy the Temple. This is why I want you safe on the water. If their eeneertzee is gone, we can negotiate. As we should have done, all these years.”\nWords falter me for a few moments. “You’re turning yourself into a weapon?” I ask when I have them back. The gru are now watching us, munching languidly on their grass, their centennial eyes a little agitated. They know their herders are supposed to be calm and we clearly are not.\n“I am,” he admits, almost like an etu. “There’s no point in hiding this from you.”\nMy throat is dry. I’m frantically seeking the right thing to say. “I can’t just summon them all on the boats like this. You know I can’t. I will have to reveal your plan.”\n“Find the boats tonight,” he insists, answer ready. “Tell them of the plan tomorrow.”\n“This is too much.” I close my eyes and try to shut this all out. I can feel a timid taloned palm over mine, hot like coal.\n“I’m sorry. It’s the only way.”\n“I don’t think your plan is worth it,” I say bitterly. I must be honest. “Their eeneertzee is not as vital to them as you think it is. You’ll only give us poor negotiation power and doom us all.”\nHis palm drops from mine. “I’ve studied a lot and decided that striking the Temple is the best option. We’ll see,” he adds casually, as if it were a small thing. I can hear something hidden, something else into his plan.\n“Nyalu. Don’t do it.” By now, I’m crying. It ought to shock him, it ought to make him hesitate.\nBut all he says is, “You promised me, Keredi.”\n“I never promised to help you kill yourself!” I yell these words and the gru huddle together in alarm.\n“Then you won’t. You’ll help me bring justice to our people.”\nI want to say many things, truthful things and hurtful things, I want to shout Who do you think you are, a martyr, making a revolution of one? But I can’t anymore. I’m tired of telling the truth.\nOnce more, I feel his warmth around me, feather against feather. “Keredi. Thank you. I could never do anything without you. You taught me how to be brave.”\nI didn’t do anything. All these years, I have done nothing but watch him slowly drifting away from me, from everything.\nI want to share our son’s secret name, the name I gave him. Don’t tell me, I can hear him in my mind. Please don’t.\nJust like the night we all arrived, we sneak into boats. The darkness is our friend; it hides us well. Word spread fast. Many of us came directly from the households. Some chose to stay. We can’t guarantee their future.\nWhen I told my fellow Sintar, I didn’t hold anything back. “It’s either getting on the boat or suffering the consequences. Nyalu won’t be stopped. I tried, but he wouldn’t listen.”\nMany men, women, etu disagreed. I could see terror in their eyes. They asked what about the angry Sons of Man, what about the Sintar that stay behind.\n“What will happen to those of us still living with husbands? Will they kill us again, send our limbs back home?”\n“They won’t have the power to do that. Not anymore. They will be too busy fixing their ruins. Nyalu was onto something. Too bad he has to do this alone.”\nThese are Essei’s words. They are the one who supports me, the one who convinces the others. “Nyalu needs us to succeed. It never was a revolution of one. He is only starting one for the rest of us,” they say to me privately, a worried smile on their face. Because of their leadership, I half-believe in Nyalu’s plan myself. We are now hurrying into stolen boats, tears muffled. Sons of Man have sniffed us out; they are after us. Nyalu must be quick, otherwise we’ll never make it.\nAnd just like he promised, we see it. The bright streak of light, glowing like a blue sky, but brighter, brighter. Like a moon’s egg cracking, he turns the sky red and orange.\nWe see him, glowing blue, entirely blue, an eggshell, a Voice in himself. By the gods, he has turned into a Voice. “He’s flying!” someone says, and maybe he is, for only a while, for only the time he’s one with the Voice, brimming with power before it tears him apart.\nThe water surface shakes; boats are overturned. We are too busy saving ourselves; Sons of Man are too busy saving themselves. And above us, Nyalu burns like a winged god of vengeance.\n“What is he doing?” someone asks. I’m too distracted, even though I turn to look.\nThe Temple seems intact. He never touched it.\nWhat’s swallowed in flames is the barracks. Where all the weapons are kept and where all the boys learn how to be men.\n“He killed the children,” Essei says, their voice like death. Shrieks and cries from the others.\n“Our children! Our children are in there too!”\nOur child too, I think, and cry with them. Our Thalu. Oh, Nyalu. This is the reason why you’ll be damned forever. You knew it. You knew it all along.\nWould I have stopped you if I had told you his name?\n“Let’s go back home. Hurry.” I speak without thinking. I try not to focus on all the things Sons of Man could still do to us after this. I want to think that Nyalu made the right choice. My mind is racing again—this time, I need the right words. “We won’t give them any more children,” I raise my voice. “They don’t have weapons to threaten us anymore. They will have to negotiate. Siblings, a new life starts. Let not the sacrifice of our children go to waste.”\nEssei eyes me in mild awe and also, intense disapproval. No one will ever forgive Nyalu; heck, no one will ever forgive me. All we can do is try and make something out of this.\n“Come,” Essei shouts, following my lead. “It’s time to go home.”\nWe row and tears burn scars on our cheeks. The air is heavy with sulfur; our tongues are dripping ash. And in the sky, my only friend dissolves into stars.\nI can hear a song—the only song that ever rang true.\nWhen we find our Voices, perhaps we can learn how to sing.\nEleanna Castroianni is a writer, poet and oral storyteller from Greece. A cultural geographer by training, Eleanna tells stories from the margins of history and the far futures of the Anthropocene. Their written work has appeared in Clarkesworld, Strange Horizons, Beneath Ceaseless Skies, Podcastle, The Stinging Fly, and elsewhere. They live in Athens, Greece, with a growing number of string instruments."}