{"fingerprint": "L0gpoIzpiCKf5KNv3NDjLa3Tejo=", "sitename": "Clarkesworld Magazine", "title": "The Translator, at Low Tide by Vajra Chandrasekera", "author": "Vajra Chandrasekera", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chandrasekera_05_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Translator, at Low Tide by Vajra Chandrasekera", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3960 words, short story\n The Translator, at Low Tide\n 2021 Finalist: Theodore A. Sturgeon Memorial Award\n The sea lapping at my back and my face to the fire, I translate: poems, mostly. Now that entire languages and cultures are on the verge of being lost forever to the sea, the storms, the smog, the plagues, and the fires, now the art of the dead and the almost-dead have become quaintly valuable to a small but enthusiastic readership of the living. The wealthy and living, I should say, but are those not the same thing, now? I am alive; I breathe in and am overcome with riches. It itches, deep in my lungs.\n The big publishing houses (we used to count their decreasing number; I don’t know where the dice finally rolled to a stop) in distant walled New York pay an entire pittance for authentic translations from the lost world, which translates into a moderate income for me because of the horrific exchange rate. It keeps me fed and sheltered—long may the fashion in third world ruin-poetry last—and I pray now only for the goodwill of distant tastemakers. The world’s decay is now the province of poets, not the useless powers and principalities of the world. There was a war on loss and we lost. It is now the age of mourning. I only wish it paid better.\n The air is bad again today, scraping like grains in my lungs. I am naked to the hostile air, unfiltered, unconditioned, my window open to the smog and, on the days with fires, the smoke. Fifty years ago, this was a luxury apartment building with a view of the ocean: I remember that I envied it. Now the lobby floods at high tide; I try to think of living here as a victory, of some description. The views are supposedly good on the ocean-facing west face, if you’re high enough. I make do with a first-floor view on the east face, and my window faces nothing more prepossessing than a grimy empty lot that was once a children’s playground. The battered city stretches beyond it, half-inhabited, the other half gone to wrack if not yet quite ruin. The sepia sky above makes my throat itch.\n The stairs are always damp from feet, because the lobby is always wet, even at low tide. The rugs stink of mildew. I slosh through it at least once a week for Sunday market, but sometimes also for no good reason.\n I buy supplies for the week every Sunday, but the other reason I go to the market is to see if Eesha has any new books or payments for me. Eesha is a hawala broker; she’s the one who originally helped me figure out how to get the money for my translations now that bank fees have become unmanageable. She also has the only library within easy walking distance: she has an informal network of citycombers who bring her any books they find. I don’t see her wife often because she’s part of a collective that grows manioc and sweet potato, so she’s always busy. The two of them do quite well for themselves. I suppose they are the richest people I know, now. We are not exactly friends. I envy them, unfairly.\n Eesha is a little younger than me, I think, but her hair is still gray. Her library is just one medium-sized room with a few thousand books piled up. I browse through them every week and have grown familiar with these stacks that don’t change. They are like acquaintances I nod to. I’m comfortable with them. They make no demands on me that I can’t answer, but more than that, I know there is no crisis that could make them turn on me, cut me out, leave me to die. You can’t say that about people anymore. There is always some threshold, some hard limit to friendship, to solidarity, even to kinship.\n The tenants’ association sends each other angry notes about the state of the lobby, and of the building generally—I find complaints piled up whenever I can afford to check my email. But we all pay different landlords and we have no collective bargaining power. By rights we should have just fixed it ourselves, at least stripped out all the rugs so that it didn’t smell so bad. But we have never been a good we; we are merely eyes through our peepholes, eyes against the world.\n Daytime heat is intense: it’s bad in my apartment but much worse outside, so I stay indoors and keep my window open to cool down. When the building’s electricity is working, the sluggish ceiling fan is a blessed relief. The unseen sea’s briny, rotten smell is pervasive, accompanied by the angry hiss of waves reaching deeper, deeper inland with every year, as if flailing and clutching for a grip at the throat of the city. Eventually its fingers will close and the city will die.\n So far the city has mostly been stripped of its middle generation, the adults in their prime who left looking for someplace to go. So many gone, promising to bring their children and their ageing parents to them when they could—most of them in camps somewhere on the continent now, working for nothing. Or lost. There are no havens: the poets knew that.\n Being left behind in a dying city is no better, but the city’s death will come après moi, I comfort myself. I have already lived longer than I ever expected, and the city has decades of decay yet to go. Cities don’t die so easily. We still have municipal government, to some degree. We still have utilities, most of the time. We have markets every Sunday and the food is mostly fresh, if low on options. I think perhaps that a younger person, or even just a more optimistic person, someone like Eesha, might even say, if pressed to say it, that the city still thrives. Much of this country is doing worse. Much of the world is doing worse.\n Perhaps even this building will outlive me, though also perhaps not—it isn’t as well-maintained as some others. The electricity is intermittent because the solar is iffy, and the elevators usually don’t work, which offends our uppermost because they pay more for the privilege of distance from the ruined world but also desire more ease in the ability to access it at will. I loathe and envy those people, though this is also unfair of me: they are barely better off than I am.\n It blurs together in my head, I admit: the richness of raw life, unclean and unfiltered, which I thank even as I choke on it, and the petty wealth of lesser privileges like youth, ability, or simply being born in a city wealthier than this one, these are not the same thing as true wealth, the world’s bane. I know, when I remember to know, that the truly wealthy are not to be found in cities half-eaten by the sea, in these old worlds slowly boiling and decomposing. Somewhere far to the north, I imagine—farther north than the wars and the camps and the horrors, farther north than the mountains and the miserable steppes, as north as north can be—in once-frozen and now summery tundra, the wealthy must still live in luxury in secure climate-controlled habitats. They disappeared from the world we can afford to know. Legend has it you can still see their social media feeds if you pay for the highest premium Internet, but who can find out?\n Oh, I lied when I said I only pray for the goodwill of tastemakers: I also pray for the failure of the arcologies of the elite. I pray for rust and decay, for infections and leaks. I pray that the rich die badly, wherever they are.\n Speaking of prayer: I also lied when I said I sometimes go outside for no reason. Apart from food and books, the other reason I leave the house is because I feel the need to pray—to actually pray, to dredge old words up in a language that was dead thousands of years before the world died—so I visit the temple.\n It is something of an embarrassment for someone who has lived a long irreligious life, but I remember that it is also traditional to get religion in one’s old age. It is supposed to be sowing season for people of my age. We are meant to start thinking about the next life, doing good works and nurturing virtue for the reaping. Nothing terrifies me so much as the thought of the relentless wheel, being born again and again into this world as it decays further and further. The thought of—just the emancipatory possibility of—being blown out like a candle flame is relief.\n It takes me almost two hours to walk to the temple, which is exhausting enough that I have to rest for twice as long before I can walk back, so it takes all day and leaves me aching, winded, and full of self-loathing for my capitulations to once-despised pieties.\n The temple is also a ruin, of course. No monks have lived there in decades. Nobody has piously swept the sand free of fallen leaves, which are a thick decomposing layer. The sacred fig is still alive, though sickly. The statues are weathered. The cetiya is half-shattered, perhaps in a storm, but I take care to sit at the one angle at which the dome still looks unbroken. I am no longer limber enough to sit cross-legged, so I just sit on what was once probably part of a low wall demarcating different areas of the temple and is now just a serendipitous raised surface, anonymous like a rock.\n I say the words in the dead language, which I do not speak outside of the prayers I know from memory. I do this just for the sound of it. I have memories of monks in song from when I was a child, from the village temple my parents used to take me to, the bass rumble of bull monks in fine fettle, the winding, gasping quaver of the decaying senior. It was a different world even by the standards of the world that we now look back on: a twice-lost world. Even alone, I don’t sing the prayers: I only mumble them. I am embarrassed to break the silence, unsure of my voice, uncertain of the tune. I’m not sure if I remember those dead words right. I know what the prayers mean, more or less, but the words themselves are alien. Some are etymologically familiar, or at least suggestive, but most of them are just dead, even to me.\n I frequently pause in my work to look out my window. It is the only thing large and generous about my apartment, and I have placed my desk and bookshelves to take full advantage, hoping for breezes against the cloying heat and for sun to charge my computer. The ruined playground below is not a restful sight even when there is no fire burning in it, but it has an eerie charm: the rust-mangled ruins of a fallen swing; a gutter that was probably once a slide; and a seesaw still standing, though long since rusted into place.\n After its abandonment, and before the sea drew so near, the playground must have once been overgrown. Empty land here has always been quick to return to the wild, as if eager to shrug off the marks of human habitation. This island’s longest-serving capital, the heart of a thousand-year kingdom, was lost so thoroughly to jungle that it was almost another thousand years before the British dug it out again, as an amuse-bouche for empire. These are spans of time that comfort me; they remind me that history is long and the unnatural compression of these past decades, the suddenness of the unraveling, will be compensated for. Perhaps someday there will be future cruel empires that dig up our bones and condescend to them. Is this not hope?\n The playground is not overgrown anymore. There are still scraps of invasive vegetation that betray that greener past, but the salt wind has now scoured away anything weaker than weeds and rendered it twice abandoned. Now it looks not wild, but ruined, as is proper. The earth around the remnant structures is churned mud. And of course, there is the huge mound of ash and remains, turned to mulch in the damp. High tide doesn’t quite drown the playground yet, but the soil is often soggy. The children don’t bother trying to light fires then, for which I am thankful because it allows me to work in peace.\n Yesterday was very productive. In recent months I have been translating the works of K___, a remarkable early twenty-first century poet notable for a sly earthiness that sells quite well, by the standards of poetry. I have to embellish the translation just a little to accentuate the peculiar working-class authenticity its faraway readers crave—that tenuously romantic sensibility of the pitiable oriental world lost to climate change, the past that is further away for being so near and yet so strange, so alike and yet unlike. I wonder what K___ would have made of my translations; a personal phone number is published in their first collection, inviting an immediacy of contact with their readership that seems frighteningly intimate. Did people ever call that number after reading a poem? Did they laugh, did they weep? I sometimes consider calling it myself, on the days when the battered landline in my apartment gifts me with a dial tone. I’ve got as far as dialing the first few digits, but then I stop myself. I don’t want to know how K___ died; I don’t want to know who was left behind. I am not, thankfully, a biographer.\n The work of translation is slow but pleasurable. I have forgotten so many words and must refer often to my dictionaries, which don’t always know either. Here I miss the Internet; I haven’t been able to afford more than email in many years. Instead, I must sit and stare out my window and try to dig the right words out of my memory. There are so many different words for losing, loss, lossiness, loserdom, නැතිවීම, හානිය, පරාජය, පාඩුව. If I am patient and clear of mind, if the sea has made the playground too soggy for the children, the words eventually unfold for me, slow and hazy.\n On dry days like today, though, with the sun beating down at low tide so the sea is as far away as it ever gets, the children come to the playground below, and I work even more slowly, hunched with dread, attention diverted.\n The playground fires were very few and far between at first. I don’t remember when they started. I am sure that the children now are not the same as the children back then: they always look the same age, perhaps late preteens or early teens, and I remember that children grow fast at that age so they could not possibly be the same. A poetic conceit: perhaps the playground has become a bubble cut free from the further ravages of time. But no, that doesn’t work because the playground surely already represents nothing more or less than the ravages of time.\n More likely, the fires have become one of those childish traditions passed down between cohorts as if they were generations. Children teaching children. This is one of the frightening things about children: they have always had their own culture, independent of ours. Once, at least, they were an occupied culture, subjugated to adult rule and forced to acknowledge our superiority and our right to describe, and thereby define, the world. But now we have lost that power, and the children are making their own.\n Perhaps I am romanticizing. I never had children of my own: the thought filled me with repugnance. I must find some more sober poetry to translate next. Something high-minded and abstract and relatively free from these longings and despairs—though that will not sell so easily. This work is a little like being a hatter in the days of mercury: long-term exposure sinks into the skin, pools in the organs. Poetry causes delirium and weakness. It burdens the heart.\n I got caught by the children again yesterday. It was a Sunday; I was returning from market with supplies, but I unwisely took the shorter path home because I was worried about the tide. Instead, I must have been spotted by a scout, because I was barely within sight of home before I heard the pitter-patter of little feet behind me. I tried to run, the bag of vegetables heavy and ungainly in my hand—a plastic bag, cutting into my palm from the weight as if in rebuke for that old sin—but of course they outran me. The first blow hit me in the back of the thigh and I fell. I curled up into the fetal position while they kicked at me. I let the bag go at once—they just want food, sometimes. Their feet are mostly bare and they can’t kick with their toes, so it’s not as bad as it sounds. Some of them are so little their kicks are gentle despite themselves, their legs unable to generate much force. I would say that they howled and ululated like wild beasts, but in truth they just laughed. It’s a game to them, and by that I don’t mean that they are wrong. They live in a ludic age; life and death and violence are their games of choice and necessity.\n They did not bind me or drag me away, for which I was so grateful that, after they left, I found myself praying amidst the sobs. We don’t have a prayer of thanks, so I said the prayer of praise instead. It used to be said that the prayer of praise would ward against devils and hungry ghosts and pogroms; now I don’t expect it to do so much as save me from a kicking. I’m just glad to be alive; I am overcome with the riches of pain. They took my bag but I have a little food stashed away yet. This week I’ll just go a little hungry.\n When the children first started to set fires in the playground, they began by burning innocuous things. Dry leaves and grass. Old newspapers. Books. Poetry.\n One Monday, they broke down the door to Eesha’s library and took all her books for the fire. I didn’t know it was books burning at first, but the smoke I choked on that week felt different. I thought I could smell the poetry distinct from the textbooks and the novels and the books of religious instruction and the political literature. All of it is bitter, but the poetry burns to the uttermost depth of your lungs. When I saw Eesha again at the next Sunday market, her head was bandaged and the room of books was desolate of my old acquaintances, the nodding stacks. Ever practical, Eesha’s wife had already started storing coconuts in it.\n For a while, the children experimented with burning each other. They would select one of their number through a counting chant, whose rough melody evoked old memories but that I couldn’t quite place. That chosen child would allow themselves to be bound and burned. If they screamed in the fire, that was lost to me. I rarely hear anything from up here other than the sea nowadays. Sometimes I dream of cicadas and wake up weeping. Perhaps weeping is not the right word. Seeping, perhaps. The tears seep from my eyes but my face is like dead wood.\n Children always frightened me. Feral creatures, not quite human. I dimly remember being one, the hot animal intensity of it, the sharpness of my teeth. It doesn’t surprise me that they turned on each other.\n I wasn’t fool enough to attract their attention by intervening, but eventually I saw someone try to stop a burning. From my window I could only tell that it was an adult. Passerby? Parent? Vigilante do-gooder who held to some lost-age moral code? I don’t know who he was, but he was the first adult that the children gave to the fire. He gave them a taste for burning, it seems, that their own had never quite done. To this day I don’t know if they are innocent of the difference in meaning.\n I wonder, sometimes, what they say to each other in their teachings. If they have a discourse of the fire; oh, I wish I could know it and write it down in a language I can understand. What poetry it would make.\n The fires have become more frequent. The children go hunting for sacrifices now, bringing back adults battered and bound. The fires become bigger. I used to only get a distant whiff of smoke. Now smoke seeps chokingly through my window, and no doubt every other low window on the building’s east face. Only the high and uppermost lumpenbourgeoisie are free of it. To them the children must be as ants, and the smoke not even a wisp at those heights, while it rampages like a great gray serpent into my home, smothering me. More than smoke, I feel the heat of the fire itself on my face. The air shimmers with it and the day, already stifling, becomes hell. My throat itches and my eyes burn. I try not to cough too loudly, but I also don’t dare venture out of my apartment while the children are about. It’s low tide and their scouts range widely. I don’t even raise my head too high—they might see it through the window.\n I know the children will soon graduate to searching door to door. The game has a logical progression through levels that they are still discovering but are obvious to me. They will learn culmination; they will want to be thorough. Eventually they will come to my door.\n I won’t run from them, I have decided. I probably could not run from them anyway. I couldn’t do it before and now I am even more stiff and wretched from the beating; it takes me a long time to heal from such things. Anyway, I was never fleet. But it’s more than that. I won’t run because it seems right that they should come for the likes of me, or at least, it doesn’t seem so wrong. It wasn’t my generation that destroyed the world—it was like that when we got here, honest—but we didn’t fix it either, did we? We were the last to have that chance, just one chance in that long-gone day, the last long day that was oh so short in the end. But we balked at the uprising that was demanded of us. We shied away from the violence that we were being asked for. We were meant to break down the gates and roll heads and throw our bodies in their billions upon the gears and wheels of the machine until it choked on our high tide. But we didn’t, and that day grew later and later until it was too late, or so asymptotically close to too late that despair broke the hearts we should have broken on barricades and bullets. Perhaps that day never ended and we are still in its endless evening, always almost or just a little too late. We have a thousand words for losing, crash, crisis, debt, ruin: I am trying to remember the one that means the precise feeling of a seesaw rusted still and forever imbalanced, as seen through the black smoke billowing from the burning of a guilty human body."}