{"fingerprint": "J2qYUaHK9uADI3STh3B9O5I8Khg=", "sitename": "Clarkesworld Magazine", "title": "Pockets Full of Stones by Vajra Chandrasekera", "author": "Vajra Chandrasekera", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chandrasekera_07_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pockets Full of Stones by Vajra Chandrasekera", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4860 words, short story\n Pockets Full of Stones\n The ghost of my grandfather Rais flickered when he talked about first contact. He was a decade younger than me now, unwrinkled and black-haired, far from grandfatherly.\n Beside me, Hadil gestured for a pause. My grandfather’s ghost stopped talking, his features losing expression. The rich brown of his skin faded, became ghostlier, as the imago switched over to standby mode.\n “Dike,” Hadil said, nudging me unnecessarily. “You notice the flicker?”\n “Probably lost some frames in the cooker,” I said. Error-correction was tricky with neutrino-based communications over the light-years. The original Rais, very much alive, was extremely far away and travelling fast. “Did he say first contact?”\n “He did,” Hadil said. He took off his augmented-reality glasses to rub his temples. Without them, his eyes looked too big, the red veins standing out. Too much time behind the glasses. “But I think that’s all the time he’s going to spend on it, no matter how important it might be. He just wants to talk to you.”\n I would have argued, except it was true.\n Picked up a neutrino transmission, the ghost of Rais had said tiredly. Could be pulsar activity. Some talk of first contact. See attached update for details. As if that closed the matter. Then he had changed the subject to his obsession: the petition to open up a bandwidth allocation for family members of his twenty thousand fellow colonists on the Cây Cúc. The right to talk to the Earth they’d left behind.\n “Let me take a look at the attachment before Da Nang comes up,” Hadil said. On Makemake Station, we lived in epicycles. The station’s magnetic transmission horns tracked Earth in her orbit, waiting every day for the planet to spin Da Nang Mission Control into our line of sight so we could report home. There were a few hours left to go today.\n “Do you mind if—” I nodded at the silent ghost. Without his glasses on Hadil couldn’t see the imago, but it hadn’t moved since he paused it.\n “Go ahead,” Hadil said, getting up. “It’s your Grandpa. He probably spends the next twenty minutes crying about bandwidth and your Grandma, anyway.”\n I scowled at his back as he walked to the other side of the workroom, walking through all the phantom displays he couldn’t see without his glasses on: bright screens and blinking glyphs, the scale model of Makemake Station in the corner, the wall of clocks hovering in mid-air, my silent flickering grandfather, and my favorite Gauguin, D’où Venons Nous / Que Sommes Nous / Où Allons Nous. Hadil had once complained it gave him nightmares, but I found it both soothing and ironically appropriate.\n I had pulled rank and kept it at full size, four meters wide in our shared virtual space. Hadil always sat facing away from it.\n As the relay station, the only link between Earth and her first colony ship, we could read the Updates from the Cây Cúc but they weren’t meant for us. Once we transmitted it back to Earth, it would be unpacked and pored over by analysts at Da Nang. This Update would have details about the mystery transmission, phrased carefully so that Da Nang wouldn’t think that the crew of the Cây Cúc was having a collective psychotic break. But there wouldn’t be much in the way of analysis from the Cây Cúc, just raw data. The time dilation meant they had no time to sit on information.\n And neither did I. Hadil could satisfy his curiosity, but I had laws to break and no time for hypothetical aliens.\n It couldn’t possibly be real aliens. They’ve probably discovered a new kind of pulsar.\n “You want coffee?” Hadil said.\n “No, thanks.”\n The slightly acrid smell of instant coffee filled the room. You couldn’t virtualize a kettle, Hadil always said. “Do we have any fresh fruit left?” I asked, not turning around.\n The fridge door opened and closed behind me. “Nope. Three days to the next supply drop.”\n When he first got here, Hadil had been a little shocked to discover what I was doing. Makemake Station was a two-person miniature civilization at the outer edge of the solar system. There could be no secrets here, so I had just told him: I was dipping into that precious bandwidth to talk to my grandfather on the Cây Cúc. A strange crime, I’d admitted, but a crime nevertheless. He could have reported me, had me shipped off back home, banned from space.\n But Da Nang was very political, even so many years after the troubles. He would be tainted by association, I had told him. I didn’t say that I would make sure of it. He wasn’t stupid. After a few months, he had relaxed. After his first year, we had become friends.\n Given enough time, all problems are solvable.\n “Oh, crap. Look at this,” Hadil said. He pushed an array of screens across the room in my direction, displacing my own virtual workspace. Process listings and system status monitors, bars in the green flickering up to angry reds.\n I rubbed my hands over my close-shaven scalp. “What did you do now?”\n “There was an executable binary in the Update,” Hadil moaned. “It was part of the signal they said they picked up.”\n “You opened an attachment . . . from space?”\n “No! I swear,” Hadil said. He sounded guilty. “Only in a sandbox. I was curious. I’m rebooting.”\n I waved at the illegal ghost of my grandfather to continue. Color bled back into the imago’s skin, and light into his eyes.\n Dear Dikeledi, Rais said. Granddaughter. He kept looking down at the photo in his hands. I’d walked over and looked at it once, but it cycled through so many pictures of my grandmother and Mom as a baby that it came across blurry and indistinct in the imago. Please let me know about the petition. Has Da Nang given answer? His voice was warm, a little too loud. Little puffs of air from the tiny speakers in my glasses, as if my too-young grandfather had his lips pressed to the soft skin behind my ear.\n If things had been different, I would have been one of the twenty thousand colonists. No, that wasn’t right—I wouldn’t even be born yet. If Rais had been allowed to take his wife, Abena, and their infant daughter along with him, my grandmother would be a young woman, my mother still a baby. I wouldn’t be born for another four hundred years.\n But he hadn’t been allowed to take them with him. Something happened, eighty years ago, while the family was preparing for departure. My grandmother wouldn’t speak of it except elliptically, to say that Rais made an enemy of someone powerful, someone in the junta, someone with control over the colonization project’s approvals board. I didn’t know exactly what it was that Rais had done to deserve this—Grandma Abena wouldn’t speak of it, and Mom didn’t know. It had been serious enough that after Rais left, Grandma Abena had changed her name and gone into hiding for a while. But by the time Mom was grown up, the urgency and the terror had faded. By the time I was born, it was only history.\n I could even appreciate the clever cruelty of it: to give him the choice of being part of the colony, but only if he went alone.\n A forced decision, made in haste. I distrusted haste. Decisions needed planning, strategy, not a wild leap into a dilemma constructed by somebody else. And it was still so recent for him, just a year and a half at relativistic speeds. A year and a half of recent memories and regrets, against eighty years of half-forgotten family history for me.\n There had been no contact for all of that time, until he got that first message from me. An older woman who called him “grandfather” and told him that his wife and daughter had grown old and died, that I was his only family.\n I look forward very much. Your next message, Rais said. Your last before you leave Makemake. Perhaps petition will move faster when you are back in Da Nang.\n Rais kept pausing, as if expecting an answer. He wasn’t used to one-way messages yet, having only been doing them for a few weeks. His messages were full of awkward pauses and non sequiturs. Or perhaps the error correction at this range was poorer than I’d accounted for and parts were being lost. There was no way to tell.\n Family, under time dilation: he’d append a personal message to the Cây Cúc’s daily update; I’d get it every two months. I’d add a small personal message to the annual update from Makemake; he’d get one of those every week.\n When it ended, he would have spent a month talking to me. I would have spent five years, the full term of my contract on Makemake Station. It was almost done.\n I nudged Hadil. “Your spikes are on the host network now,” I’d just noticed the angry red spikes indicating increased activity on Makemake Station’s computers both physical and virtual.\n “Everything’s showing spikes,” Hadil said. “Except ops and life support.”\n “Those are physically separate networks,” I said, absently. The CPU temperature graph was climbing steadily. I’d missed something Rais said. I’d have to rewind him later.\n “Will you please switch off your Grandpa and check the logs?” I could hear the glare in Hadil’s voice. He was right, but I was reluctant to stop listening.\n I’d been ten years younger than Rais was now, when the plan occurred to me. I was still at Nha Trang University, working through the qualifying courses to apply for extraplanetary duty. Plan—more of an intention, then, an understanding that I wanted to do this, that maybe I could, that maybe I should. I’d grown up hearing about Rais from Grandma and dreaming of space, which may have had something to do with my choice of career. But that was the year I put the plan together. The time dilation, Makemake Station, my career, the time and training I’d need to get there. I could talk to Rais himself; I could close the loop, answer the nagging little questions.\n Now at forty-two I was as old as Mom when she had me. Ten years older than Rais, who had aged less than a year in my two decades of putting all the pieces together. I’d thought I knew him from Grandma Abena’s stories, from the things Mom didn’t say. Rais had grown bigger in the tellings, his absence having density and mass.\n In person, he was too small, too young.\n My grandfather’s ghost was flickering again, almost strobing.\n Hadil and I both looked at it.\n “Did your Grandpa break the imago?” Hadil said.\n “Shut up,” I said. “I’m pretty sure this is all your fault.” I grinned at him to take the sting out of it a little, while swiping rapidly through the last hour of logs. Makemake generated a lot of logs even when not doing anything in particular. Anything of note should have been flagged. There was nothing.\n I really miss Abena, Rais said. He said this every time. He had never known her as a grandmother, with the wrinkles and the white hair that I kept expecting him to have. He wouldn’t talk about Mom at all.\n I’d told him in my second message that Mom had lived into her eighties and taught art history. She specialized in Lý dynasty ceramics. But he didn’t acknowledge what I said—or he did and it was lost in the sea, neutrinos that didn’t ping. To him she was still a baby, or should have been.\n When I made my plans I had intended to ask him questions. Why leave? Why not stay? Did they force you? Did you choose?\n But well-made plans adapt to changing circumstances. I realized when I first saw his imago that closing the loop wasn’t about getting answers to those questions. It was about resetting our time-twisted family’s history back into a single story. It was the open-endedness that nagged at me, the sense that Rais had vanished into some other world—the future, perhaps, or the past—which was forever cut off.\n I hope you plan to have kids, Rais whispered.\n Rais believed that the petition would allow him to talk to any descendants I left behind, after I died. He didn’t put it like that, but we were all mayflies to him now. Four centuries would elapse on Earth by the time he sent foot on his colony world in a few years. At least a dozen generations. Would my descendants even want to talk to him? I didn’t know, but it felt distant and irrelevant to me.\n I didn’t know if I wanted children. I’d had my eggs stored before I left Earth, left myself options. But I didn’t want to pass Rais down like a demented heirloom. I’d made up the story about the petition to get him to stop talking like I was a candle about to be blown out, and now he was obsessed with it.\n There was no petition, of course. I wasn’t stupid. That would just attract the wrong sort of attention in Da Nang. People would figure out that what I’d been doing here. At the very least, I’d never work in space again.\n “Hey, Dike,” Hadil said. “Is everything flickering for you?” He had taken his glasses off and was rubbing his eyes. “It’s giving me a migraine.”\n “Mine seems fine, except for Grandpa,” I said, looking around. “Here, use these. I need a break anyway.” I walked over to him and handed him my glasses.\n With my eyes bared, the room was empty and silent. The walls were a neutral grey, designed to be unseen to operators who would cover them with virtual displays. I looked for the spot where the imago had stood, but of course there was nothing there.\n I stretched, relaxing my eyes, rolling my neck. On Earth, at least there was a world for the glasses to augment. The sky might be covered in advertising, but you could take the glasses off to see it be blue. Here, it felt like being in an abandoned house. Everything gone but for these ratty old chairs, a couple of desks, the kettle and the fridge in the corner. No color to any of it. I already missed the bright yellows and haunted blues of the Gauguin.\n Hadil was waving his arms in the air as if conducting an invisible orchestra.\n When they built this habitat and set it spinning eighty years ago, they had ensured that operators would experience standard Earth gravity, for health and sanity. So just sitting, standing, drinking water from a cup, they were all reminders that we lived in a tin can on a string.\n The status glyph in one corner of the workroom—invisible to me now without my glasses, but after five years as familiar as the furniture—only drove that home. Makemake Station, rendered as a football-sized globe. The muon storage rings were just faint lines describing great circles on the sphere’s surface; the fusion reactor a tiny, indistinct blob; the magnetic horns of our transmitter, too small to be seen and represented only by an icon. The habitat we lived in was just a dot on a near-invisible tether, sweeping around that giant sphere like the hand of a clock, doing a circuit every half hour.\n Almost all of Makemake Station by volume was accounted for by the millions of cubic kilometers of heavy water inside the sphere. Neutrinos were ghost particles, easy to lose if you didn’t have a whole sea to listen with. Hadil claimed he could hear it sloshing, for all that it was kilometers away and separated from us by vacuum; I dreamed about it sometimes, swimming in a pitch darkness broken only by tiny flashes like fireflies.\n “Dike,” Hadil said.\n “Yes?”\n He looked at me with both eyebrows raised. Sweat was beading on his temples. “I think I’ve figured it out.”\n “Really?” I walked over to him and tried to grab the glasses off his face. “Show me!”\n “Wait, wait, wait,” Hadil said, fending me off. “Or try mine, maybe they’ll work for you.” His old pair was still sitting on the shelf, next to his gently steaming coffee.\n “No thanks, I’d rather not borrow your headache,” I said. “Just tell me.”\n “This signal the Cây Cúc picked up,” Hadil said, speaking so fast he was almost breathless. “It’s like a virus but more so. Like artificial life. It can rewrite itself to adapt to new architectures.”\n “It evolves?” I leaned against the back of his chair.\n “I suppose,” Hadil said. He wiped the sweat from his forehead. “Our hardware’s a lot faster than what they’ve got on the Cây Cúc. So it’s cycling faster. We’ve got an infection.”\n “Start shutting everything down,” I said. My head felt a little light. “Shut down everything that’s already infected or connected to anything that’s infected. We’ll restore from a clean backup.” At least life support wasn’t threatened.\n Hadil pulled the glasses off abruptly and threw them down. I jumped aside as broken glass and tiny electronics littered the room.\n “Hadil, what’s wrong?”\n “Flicker,” Hadil said, thickly. His scalp was shiny through his close-cropped hair. “I can’t feel my legs.” His voice sounded both slurred and very small, as if not quite certain what he was saying.\n “You can’t—” I grabbed him by the shoulders, too hard. “Okay, okay. Let me get you to your bunk.” I reached for the other pair of glasses to put them on, run a medical diagnostic, but Hadil stopped me, clutching at my wrist.\n “Don’t,” he said. He was trembling.\n I tucked them into the collar of my shirt instead. “Okay. Let’s get you lying down and then you can talk me through why not.”\n Helping him into his bunk was difficult. His legs dangled, dead weight. He drank the water I gave him, though I had to help him sit up. Lying down again, he seemed to recover a little. He seemed even younger than he was.\n “Your Grandpa’s talking again,” he said.\n I fished the glasses from my collar, but Hadil stopped me again.\n “I’ll have to eventually,” I said, as gently as I could. Without the glasses, I had no way to interact with Makemake Station. No computation, no communications, no medical telemetry, no helpful wiki. “Is it the flicker?”\n He stared at me, unblinking, sweating freely. “My head hurts.”\n Strobe lights at some frequencies could induce seizures—or I thought so, at least, without the wiki I couldn’t be sure. I suggested this theory to Hadil but he shook his head, and then winced.\n “I feel drunk,” he said. He was speaking with exaggerated care now, slow and deliberate. “Your Grandpa’s still talking,” he said, then pointed at his head. No glasses, no little speakers tucked behind the ear.\n “What’s he saying?” Stupid question. Was I feeding a delusion? I was really starting to miss the wiki.\n “Gibberish,” Hadil said. He closed his eyes.\n “Just get some rest,” I babbled. My basic medical training hadn’t covered anything like this. It didn’t need to: Earth could provide emergency support within a day. “I’ll call Da Nang, we’ll get help.”\n “They figured it out,” Hadil muttered, too quickly as if he was trying to get the words out. “Figured us out.”\n “Who?”\n “The aliens, Dike,” Hadil said. His eyes were still closed, as if unwilling to face his own words.\n “The aliens who sent the signal?”\n “They are the signal.” Hadil said. “The human brain is a computational substrate. They’ve adapted to our architecture.”\n “That’s ridiculous,” I said, automatically, then winced. “How would they even—”\n “Listen,” Hadil said. He opened his eyes. His pupils were very wide, frightened. I realized I was holding his hand. “They hacked me. I can feel it. It’s jumbling up my—”\n He paused for a moment, as if expecting me to interrupt again, but I didn’t. When I touched his temple he didn’t react. The vein was pulsing violently.\n “Don’t look into the glasses,” Hadil said, finally. “They must hack the brain through the eye. The visual cortex. It’s transmitting some sort of compressed signal, that’s got to be why the displays are flickering.”\n “Without the glasses, I can’t call for medical assistance,” I said. I tried to put motherly reassurance in my voice, tried to remember what Mom had sounded like when I was young and broke my arm falling out of a tree. Make a plan. “I need to be able to run the diagnostics on you, I need to update Da Nang that something weird is going on—at least that we may have been infected with a virus from the Cây Cúc— “\n “It’s not a virus,” Hadil said. He sounded very tired. “Not infection. Invasion.” I squeezed his hand and listened to him breathe, but he didn’t say anything more.\n When he died it was sudden. He wheezed twice, horribly, and then he was gone. I closed his eyes, my hands trembling and cold.\n My head was too full of ghosts.\n When I was an undergrad at Nha Trang, before I came up with the plan, I’d drive down to Ba Ho once every few weeks. Early in the morning before the tourists came, I’d climb the rocks beside the waterfall and then leap off with my eyes closed, nothing but the wind in my face and the hammering of my heart. Blind, terrified, exhilarated. I felt like that now.\n Don’t put on the glasses, Hadil said.\n I didn’t want to look at his body. I went back to the workroom and sat in his chair instead of mine. Glass crunched under my shoes.\n The other pair of glasses still sat on the shelf. If I put them on, I would see all the screens and displays that filled this empty room. The ghost of my grandfather, standing in the corner, perhaps still talking about the wife and child he left behind.\n The telemetry would tell me that one of Makemake’s operators was dead. There would be data on his death. I could find out what had really happened. Explain his hallucinations, if that’s what they were. A stroke? A seizure?\n There would be a clock to tell me how much time was left until I could send a message back to Da Nang Mission Control. It would take five hours for my message to reach them, and Earth would spin Da Nang into line of sight within—how long? An hour? Two? The Update from the Cây Cúc would be already queued for automatic forwarding. I could hold that back and send a call for help instead.\n Unless Hadil was right, and then if I put the glasses on, I would die like he did.\n Was Rais still undead and unaging? Were they all dead on the Cây Cúc? If the aliens could infect the human brain—many of the colonists could have been wearing a slightly older version of the augmented reality glasses. If the vulnerability was in the visual cortex then any kind of display might do. Any screen, physical or virtual. A book, a phone, a photo. Like the one that Rais always had in his hand.\n But Rais was still alive when he sent the message, and many people would have been exposed by then, but there was no indication anyone had died. Maybe their hardware was just too slow. Despite us sending them tech schematics every year and them using the ship’s fabricators, they couldn’t keep up with time-dilated technological change. A lot of the hardware on the ship was eighty years out of date.\n Your Grandma hated him for leaving, Mom said. But we don’t need fathers, you and me.\n Rais would send another message tomorrow, but that wouldn’t arrive at Makemake Station for a couple of months.\n I hope you have kids someday, Rais said.\n “Yes, yes,” I said. My own voice was shockingly loud in the silence.\n Hadil said it wasn’t a virus. More than a virus. Something smart, something that could explore and experiment. Find new territories, expand into them, adjust the terrain to their liking.\n Informational life. Ghosts. Like infectious ideas that echoed in our heads until we could not think of anything else, until we forgot how to move, how to beat our hearts, how to breathe. Did they know they were killing us? Did they even know we existed? That there was a whole plane of physical reality that lay beneath theirs?\n Rais could have stayed behind, said Grandma Abena. He could have turned down the adventure. He was selfish.\n They must have made him go, said Mom. Maybe they threatened to kill us if he stayed.\n “You’re both dead, give it a rest,” I said. “He was barely a grown man. He ran, that was all.” Just leaped into the unknown, eyes closed and heart hammering.\n Was that what it was like to be a ghost? Jumping off the ledge, not knowing if it was water or rock at the bottom, terrified and laughing? Were they conscious? They could only be conscious when they had something to haunt. Crossing light-years as signals, riding pulsars across the galaxy—\n There couldn’t be more than an hour left before Makemake Station automatically forwarded the last Update to Earth. I needed to switch that off.\n I don’t want you to tell me about him, Mom said. I don’t need to know.\n Mom had insisted on that, when I finally told her my plan for contacting Rais. I waited until the last moment to tell her, just before I left for Makemake Station. That was only a year before she died. “It was Grandma who would have really wanted to know,” I said.\n You don’t know what I wanted, said Grandma Abena. You were just a child.\n When I got your first message, Rais said, I knew it couldn’t be, but I thought you were Abena. You look just like her. Only older.\n Maybe the ghosts were mayflies. Maybe generations passed in the twenty minutes it took them to kill Hadil. His coffee wasn’t even cold yet.\n “I know you’re in me already,” I said. “My ghosts aren’t usually this literal.”\n I put the glasses on. Decisions made in haste. Look, grandfather, we have something in common after all.\n We were going to the colony as a family, Rais said. That was the plan. I’m so sorry it didn’t work out that way.\n I didn’t notice the flickering anymore, or perhaps it had stopped. My head was pounding.\n He was afraid, Grandma Abena said. The stars are wonderful, but if you lower your eyes to ground level you’ll see the men with guns in the night.\n The clock said I had ten minutes left to the automated Update to Earth. Less than I had thought.\n After I grew up, Mom said, I didn’t waste any more time thinking about that man. I got on with my life, and so should you.\n I disabled the scheduled transmission, reoriented the magnetic horns away from Earth, told them to always point out into empty space. To stop tracking their targets, to forget. Such a simple thing, but my hands were slick with sweat and trembling when I was done.\n Could the ghosts reset this? Could they manipulate the system, move the horns back? They could, but why would they understand the universe of ships and stations and worlds? Could they even find Earth again? I invoked superuser access, deleted the memory of Earth’s path from Makemake Station. Would it be enough?\n Maybe they wouldn’t care. Maybe even if they managed to get the transmissions working again, they would be happy to spill out endlessly into the dark, neutrinos passing intangibly through rock and vacuum alike. Maybe that was how they got into the signal that the Cây Cúc picked up in the first place. Someone else, somewhere, impotent and desperate as me.\n I couldn’t feel my legs anymore.\n My arms shook as I lowered myself to the floor. Something cut my hand painfully when I rested my weight on it. A shard from Hadil’s broken glasses. I wanted to go sit with Hadil in his room, but I didn’t think I could get that far. My chest felt hollow.\n One more thing, Hadil reminded.\n With Makemake silent, Da Nang would send a team within a day. As soon as they entered the station, their glasses or helmets would connect with Makemake’s network and open themselves to invasion. They’d probably re-establish communications with Earth before they realized something was wrong.\n I started an imago recording of myself, looping it to display everywhere in the station. I’d have to keep it short. It was getting hard to breathe, and the first responders would not have much time before they died.\n It’s just like the waterfall, but with your pockets full of stones when you jump.\n “If you’re seeing this, you’re already dead,” I began, and made myself a ghost."}