{"fingerprint": "DSYwppqejvy6SIUfS2RqFE6j93o=", "sitename": "Clarkesworld Magazine", "title": "Social Darwinism by Priya Chand", "author": "Priya Chand", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chand_04_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Social Darwinism by Priya Chand", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4650 words, short story\nSocial Darwinism\nI slide the phone up my legs, flat between my thighs for the money shot. The john’s got a kink so I kink up: pop two neon pills, fresh off my printer. Class-D molecules, his schematics. They don’t sell this in stores.\nThe capsule dissolves, its virus reprograms the synthcode padding my DNA. I try not to squirm as my hair turns into tentacles.\n“Yeah,” the john says. He draws it out like he’s in pain, and, wait for it, starts panting a second later. “You’re so filthy, invade my planet” . . . all we’ve got is amino acids on Enceladus. I wonder what movies he’s been watching.\nThe pill is giving me a stomachache, so I roll my eyes and wink at my reflection. 256 base pairs on chromosome 10 that are incompatible with the designer genes my mother hacked into me, and I have the metabolic control of someone in one of those barbaric breed-only countries.\nI flutter my eyelashes, make my best moue—don’t feel the slime on my skin—and let out a long, fake sigh. I heave my breasts to make the sound more real, yes, yes, he’s listening. Oh god. I want a virus to make this stop. I want more. I want him to never stop listening to me.\nMy code reasserts itself and the tentacles wither away, as promised. Cash in my account, the usual. But it’s the ad time I care about, ten extra seconds. For that much, we could’ve gone longer. Oh well. He loves those tentacles.\n43.396 seconds, mine to spend. There are two main streams on the Net’. The pornliners watching my every move, contact information laid over my breasts. A hint of blurred vagina, just enough to let them know how flexible my code is.\nOr I could go the other way. A friendly face from any memory you like, a quiet listener or the girl in class you always wanted to talk to, Rinny Albatross from Zenith 4, a whole range of gamegirls. My face, the gentle smile I associate with playing outside, the Bubble reflecting soft yellow rays on my mother’s face. It’s been so long, I’ve forgotten to hate her, and all that’s left is the nostalgia my clients love. They love watching beautiful people remember.\nMy skin is creamy, rose highlights showcasing the perfect texture. So malleable, I’ve been green and black and rainbow-striped, insectile eyes—not much use for seeing, but that john gave me a whole minute—antennae out of my head. A grandmother with wrinkles so deep I was rubbing my face for days, amazed at how we decayed before synthcode.\nAnything you want. I’ll show you anything.\nThey’ll see my ads here and there between football and clonewars. I shiver, I tingle. Those eyes on my body. My face. Thinking about it gets me hot, hotter than I’ve ever made a john. If I wait too long it’ll hurt.\nI clear my head in the shower. My body presses against the wall, desperate, then not. Steam sinks into my skin, the pores widen. Instant moisturizer.\nOnce my breathing is back to normal, I decide to split my time 10/30. Ten for the pornliners since word-of-mouth helps more anyway. Thirty for the families, parents, and offspring. I can make myself look very young, although it doesn’t work in person. The proportions are wrong.\n3.396 seconds left behind like angry words. I dare myself to look at the numbers without cringing, and then my phone rings.\nMy skin burns—unexpected calls always set my body off. The synthcode can’t touch this. I try to think of unpleasant things. Tentacles on my flesh. Crawling. Bugs, those six-legged things at the terrarium. Sick. I stare through my mirror and hope the smear of red is a smile.\n“Hello?”\n“Ishtar? Ishtar Kim?” Oh god oh god oh god my name. I almost beg her—the voice is female, anyway—to say it again.\n“Yes,” I say when I’m sure I won’t sound like I’ve just had sex.\n“Would you like an hour?”\nA whole hour. An entire hour of Net’ ads. Full body shots, censored nudes or fully clothed, one full transformation of my synthcode better than all the other synthcodes out there, trying to swing an incomplete set of gills or neon hair that’s still black at the tips—fuck them all. Just me, it’ll be me for a whole hour. With that kind of time, they can’t ignore me.\nI have to excuse myself.\n“Hi,” I say once I’m dry. “I’m calling back about the”—lick my lips—“hour.”\n“Yes,” she says. “You’ll have to meet us in person. A public location. Can you do that?”\n“I’ll need a reference.” Sanjay got scammed, they ripped his DNA for the organ farms and who knows how many people have access to his genome now. It’s one thing to share yourself. It’s another thing to know your body is out there, pieces of it available to anyone with the right molecules and a good printer.\nBut this woman with the magical hour references Cody. I like him, he knows exactly what he is. What we are.\n“Thanks,” I say. “If you message me the location, too, I can check all that out.”\n“Sure thing. We’ve also advanced you ten minutes. I know it’s hard to believe we have a full hour, so this is on us.” I bite my lip so hard the taste of copper floods my mouth, but a whimper still escapes.\nOnce I get over the ten fresh minutes in my account, I call Cody. “They’re safe,” he tells me, the words scrolling across my view. He must be with a client, he isn’t sharing a visual. Part of me wants to cry, remembering my mother’s back to me because I wouldn’t tell her I loved her. I imagine kicking the biohacks out of my body. It’s made me feel better since I was old enough for the real biology classes.\n“Sorry,” he says. He knows how it feels, to not get a visual.\n“Don’t worry about it. So?”\n“They’re kinda weird, but, you know.” That’s the job.\n“Thanks.”\nI hang up and check out the location from @KAMINI, whose profile picture matches her voice. She’s staring straight ahead, the tip of her ponytail a knife when I edge my head around the back of the holo. She’s got a suit on, and it hugs her curves, emphasizing the tilt of the breasts and the lift of the buttocks. Kamini doesn’t look more than thirty, but if she can afford a real linen suit, she could be fifty. We’ve had synthcode for two generations now.\nShe wants to meet at Rose’s Diner, tomorrow at noon. I’ve been there before, I wonder if that’s why she picked it. Did she . . . research me?\nAt the last minute I decide au naturel isn’t good enough and turn my hair searing pink, watching closely in the mirror. The change propagates from the roots, protein refolding and refolding in response to the algorithms inserted between my genes. Dilated blood vessels add blush to my cheeks, and double-thick lashes frame my eyes.\nI head out in a semitransparent latex wrap, bright green to offset the hair, layered strategically so I’m not violating decency laws. I hop on the train, and it’s nothing like the Network. Maybe five, ten people glance at me, never when their friends or lovers will see them. Clients don’t see ’hacks like me in public.\nKamini is waiting at a table when I get there. Her hair is as coiffed as the hologram—no Photoshop. We trade access keys and I learn she’s 60% synthcode, no biohacks. 20% closer to perfection than me, and infinitely more in control of her body.\nI slide in opposite her, my rear reshaping against the contours of the chair.\n“I’m Kamini,” she says, “but call me Kams.” She is completely focused on me. I try to focus back, but awe creeps through my skin. If she doesn’t want to feel something, she doesn’t. Every moment of her life is better than the previous one, if she wants it to be.\nSo what does she want with me?\n“What were you hoping for?” I ask her. My gut twists. I need to stay in control.\nShe sips her coffee, lips caressing the ceramic. Her eyes never leave me. Every bit of my visible skin, the twitching in my neck and the tiny wrinkle in my forehead. The need smolders—look at me forever, her eyes are slightly tilted and I can’t imagine what it’d be like if she smiled at me. The synthcode doesn’t care, but my DNA wants to worship her.\n“Why don’t you order something first. I’m paying.” The menu hovers in front of me. I select chamomile tea, lab-grown. She orders chamomile tea, field-grown.\n“Now that you know I’m a real person,” she says, “what my group wants is to observe you. We’ll ask a series of questions and record your verbal and physiological responses. There’s five of us and it’ll take place in a warehouse we’ve rented. The phone’s unblocked so if you feel unsafe you can page out any time.”\nShe is more than perfect—she’s omniscient. No, that’s too far, I could kick myself in the genome. Cody said it, she’s worked with us before. She knows how we operate. That part of us, along with a detailed explanation of why it’s illegal now, is online. I can’t imagine what she wants with the rest.\n“Sure,” I say.\nI am on a chair under a strong mercury light—I dilate my blood vessels to counter the bluish tint—and five of them are facing me. They measure my pulse, breathing, brainwaves. A routine hovers in front of me, jacked in where my synthcode accesses my brainstem.\nI’ve fantasized about giving this much of myself away, on display, every piece of me laid out on an altar. Please, half of me wants to tell them, butcher me. Send me up in smoke like a burned offering.\nThe other half of me runs away screaming.\n“Ishtar Kim”—I chose it when I was sixteen, I’m glad that’s the name they know—“Ju-Hee Kim designed you with the need-attention mod, seen in single mothers who have been abandoned by their spouses during or shortly after the pregnancy.” I’m tempted to point out that need-attention engineering is more common in younger women who used a sperm donor, but that wasn’t my story.\nThe biohacks want me to rise as these people dig through my history. For now, I win—I remember how to be disgusted.\n“Anything else you need to know?” I say.\nOne of them raises a hand. “How does this make you feel?”\nI can’t tell which “you” he’s asking about. The me my mother made, the one melting at the thought that these people want to listen to my voice? Or the one I engineered with my own money?\nNo matter what Cody says, I don’t yet believe they won’t cut me up. I embrace that fear. Adrenaline dampens the constant stream of yes-yes-yes, and I direct my synthcode towards seducing them. A whole hour, shit. I want that hour. Their weights shift forward simultaneously. No one else would notice, but the DNA in me tingles. If they have a whole hour of airtime to spare, they must have more.\n“I’m excited,” I say. “A whole hour is a lot of time.”\n“How would you like more?”\nIt takes every last bit of my will to hold back the raging storm so I can say, face moving the merest fraction of an inch, “I’m interested.”\n“Good. If you have any questions, you can try Cody. He’s told us you know each other.” Not much more than that, I’m sure. Cody is discreet. He’s as good as I am—almost, anyway, it’s harder on the males. I’ll ping him when I get home.\n“Do it,” Cody says. “They want to know more about you, it feels nice.”\nI have three hours in my account, three hours I’m too nervous to use—although I spent the time from my other clients right away. I can’t leave the johns completely. Even if they don’t want to know what foods I loved when I was a kid, whether or not those and my other interests changed once the synthcode implants went through. If I’m ever thrown back to the Network, I need to make sure they haven’t forgotten all the shit I can make my body do.\nKams’ friends ask me every personal question I can imagine. Personal, in the sense you can’t find them written in my DNA or my public file, but worthless on the dark Net’. And Kams herself—her mouth forms the most benevolent of smiles, and no more. I assume she’s recording, her eyes always follow the speaker. She’s watching the one furthest to my left.\n“What was going to school like?”\nThey have special classrooms, ones where they don’t look at you when it’s your turn to speak.\nAfter we were emancipated, they put surveillance on the buses to our dorms. We’d sneak into the depot and watch ourselves on the security feeds. Pregnancies dropped by 30% after they threw out the cameras.\n“It’s worst when you’re a teen,” I say, but this isn’t true. We didn’t think about it when we were teenagers. Fucking without consequences—conceiving fatally biohacked babies. Cody’s girlfriend, Gloria, had two bloody miscarriages before it came back to haunt us, worming through the DNA. Gloria lost her mind. Cody has nightmares. I have no uterus.\nHow can I explain that to these people, most of all Kams? Do her parents really think she’s their daughter? She’s closer to the Network, a whole other class of being. Her offspring will be written on chips pressed into the neural tubing of embryos drawn from frozen eggs.\nI used to think my mother was perfect, too.\nThey ask me about her. Did she try to compensate, once she realized what she’d done? Did she take advantage?\n“I don’t remember.” Now that they aren’t asking about me, the death grip on my desire has relaxed. I don’t want to think about her. I don’t see why my mother’s bad decisions matter. The original version, my design, is banned. The Council has spoken: fertility cannot be lost. To preserve my species, I’ll have to live forever. With someone watching me.\n“Are you sure?”\n“My memories are fuzzy,” I say truthfully.\nThey look at each other. Their eyes flicker as they transmit signals. A private conference. I can feel my body tense. Don’t let them go don’t let them go—“I’m sorry,” I have to say, hating how easily the apology rolls off my tongue. “But those times, there was a lot wrong with the situation. We have counseling. I used mine to forget. I’ll tell you more about me, if you want.” Eager to please. Please them with my pheromones, a subtle steady stream. No one likes discussing benefits to the need-attention mod, but we are the best at making people look at us.\nAnd I have found the gap in Kams’ perfect façade.\nI drop my arms down, uncross my ankles. Spread a little. I’ve worn a body stocking today and I hint at the bunching where my legs run into my ass. Some of them know what I’m doing, but the pheromones make it harder to care. They aren’t as aware of their physiology as people should be, Kams least of all.\nI know I’ve won when Kams gives me that look my body craves. “We want you to help us launch a campaign to completely ban organic mods,” she says with stars in her eyes, fire on her breath.\nThere would never be someone like me again.\nThe first day of school, before I learned that kids aren’t supposed to cry with happiness when their mothers scream at them. The colonies for emancipated minors, knowing that no matter what we did we’d do it better, faster, harder—for attention.\n“What about the other mods?” I say. “Parents dump all kinds of shit on their kids.”\n“Code is fine—prenatal code can stay. But we want all other mods banned.” I hear it in her voice: no more you. But she’ll be allowed. Hex code instead of base pairs.\nFor once, my biohacked and real halves are in sync. This feels wrong.\n“So, what do we do?”\n“It’ll be public. Interviews, talk shows, you know?” She flashes her beautiful, symmetrical smile. I can almost hear her wonder, do I stop touching myself long enough to learn what these things are? I project eagerness. “Good,” she says. “We’ll talk again.”\nThat night, I tell Cody to come over. Once we’re done, pressed under the sheets, our bodies cool and sweatless, he has a confession. “I slept with them.”\nOnly one of “them” matters. “Is that an invitation?”\n“I don’t know.”\nA flash of guilt corrodes my satisfaction at exposing his shame. No classroom taught us how to control ourselves, and I never heard the boys talk about it as much as the girls did. Male or female, the fastest way around our biohacks is explosive surrender.\nAnd why not? We know Kams won’t get pregnant with some biohacked mutant.\n“Sorry,” I murmur, but he is already asleep. I wonder if he knows I’ve smelled her plastic on his skin for weeks.\nWhen they ask, I lie about the sex. “Every night I’ve met you,” I say. “Orgies, one on ones, men and women. I don’t ask their names.”\nMaybe I overplayed it. They look at each other, eyes flashing private messages, and then one of them says, “Will you be . . . okay . . . for the interview?”\nThe distaste in his voice is nothing new. I toss the long blond filaments of today’s hair back, so the tiny pasties on my breasts are visible, bouncing as I take a loud, deep breath. “I can take care of myself,” I say, shifting in my chiffon cocoon. “When is this happening?”\n“Once you’ve got your answers,” Kams says. No mention of Cody, but I’m sure he’ll be there. The two of us make a matched pair, if we tweak our synthcode enough.\n“What are they?”\nShe waves her hand, file transfer to my brain. I accept and unfold it gently, skimming the bullet points, vague but all pointing to the same conclusion. Kams can’t access the interview questions in advance, but she knows what to expect just as she always has. Her file tells me when to say my progenitor and when my mother, so there’s never a tasteless display of feeling.\nI’m not surprised at the tragedy she’s made my life into. I flutter my eyelashes, peek at her. She’s watching me. My limbic system reacts, of course, trying to turn my body to jelly, but her gaze slashes the sensation in half.\nHer head must be like this warehouse. Vast, neat, the tiniest space preserved in unhappy recognition of its organic aberrations. Does she go to bed hating the slime inside herself, knowing that unmodified DNA is a silent bomb waiting to break something the synthcode can’t fix? She would be truly perfect without the genes—I would be human without the genes.\nEyes drilling into my skull, Kams doesn’t blink once. Hair cascades down her shoulders in coiffed waves, the stiffness complementing her stare. “This is all good,” I say. “I’ll be ready.”\nWhen I return home, I have a message waiting from Cody.\nI’m out.\nI ping him right away. The nanoseconds, milliseconds tick by and at last the connection joins. Video on. He’s daubing paint on his body. His signature look. The people who want to see Cody in a facsimile of a suit, every inch of his torso outlined in gray, aren’t the same people who want to see me decked out in colors and barely-legal layers. It’s why we managed to stay friends after we left the colony: no competition.\nHe won’t make eye contact with me.\n“Cody,” I say, “look at me.” Not just because I need the eyes . . . His face is covered in gray paint, but I see a faint red line on his cheek. Even the scratch is perfectly straight. I can’t believe it hasn’t healed yet.\n“It’s over,” he says.\n“What?”\n“They wanted to bring Gloria in.”\n“Oh.” I’ve only ever discussed my mother with them, which doesn’t scare me. But my mother didn’t scream uncontrollably the last time I looked at her. “It’s been ten years,” I almost say, but I am stopped by the thought of her nails, slicing his flesh with mathematical precision.\n“I just wanted to let you know I won’t be at the interview.”\nIt’s a question, not a statement. I can walk out, too. I can never know what it’s like to have all those Net’ streams on me—and only me. We’ll still be friends, unlike most of the other need-attention kids out there, hiding in their caves and under their bridges.\n“I’m sorry,” I say.\nCody shrugs. His voice is muffled, chin tucked into his chest as he rubs paint on the small of his back. “Do what you have to.”\nThe feed cuts off, the afterimage of his cheek glowing red in my mind.\nThe room is round and small, thick walls to prevent signal interference. The presenter is a bubble that flits from here to there: camera, lighting, and interviewer all in one. There are two people already seated.\nKams, and my mother.\nA number flashes against the wall. 3,009 networks logged onto our show. I tug on my dress, slipping it lower. 4,210. Pure instinct, but the guilt in my mother’s eyes is impossible to miss. She caught me wandering nude often enough, didn’t she?\nI tug my dress even lower, and that’s when I realize I am free of her, if not her long-ago decisions. She could be one of those people on the train. When you’ve had millions lusting after you, networks upon networks of lonely horny people, what does one more face matter? I don’t even look like her, and I never did. If I have to be this chimera of designer and human genes and synthcode, I will be the best.\nKams delivers two minutes of why we’re here—organic mods are so cheap, everyone has access to them, that’s great—and then shifts into anecdote. “I had my own horse,” she says. A real horse. Wires running through pneumatic joints, large enough to ride on. A feat of engineering, with a touch of DNA for the silky mane. People can tell when something is synthetic. I remember when I first saw her, thinking that slight distance from humanity made her something better.\n“But not everyone grows up with these advantages,” Kams finishes. Her eyes float towards us.\nMy mother shoots me the tiniest glance before she starts talking. As she describes her impoverished adolescence, the early marriage to get away from home, I rub the silk on my thighs. If it weren’t taut on my skin, it would crease horribly. How much did Kams offer her to humiliate herself on camera?\n“We had so little. When he started seeing other people, I had even less.”\n“And is that why you thought your daughter should have the need-attention mod?” The interviewers send the question through the presenter’s pleasantly modulated, gender-neutral voice.\n“I didn’t know,” my mother says. “No one knew about the consequences.”\nKams reaches across to tap her arm. I eventually realize this is meant to be a comforting gesture. My mother is a mess, running mascara and wisps of hair drifting across a lined forehead. But viewers love this rare glimpse of unadulterated humanity. We pass 10,000 networks and the pressure builds inside my skull. So many people, and I’m not the center of attention.\nMy mother wipes her left eye. “I haven’t seen my daughter in ten years.” Twelve, but I don’t know why I counted.\nThe interviewer gasps dramatically, bouncing several feet to compensate for its lack of expression. Kams lures her legs out from underneath the chair and stands up. This is her moment. I have to admire her posture, it’s perfect for a business presentation.\n“Yes. It’s tragic. And that’s why we’re doing our best to prevent anyone else from going through what these brave people have survived.” From her mouth, “people” doesn’t sound matter-of-fact. It sounds like a virus. Do us a favor and wipe us off the Earth.\nMy turn. I recall the script she has given me, tiny words scrolling against my eyeball. But my attention is on the numbers—so many streams. 14,000, 15,000, 16,000. I have to divert my synthcode so I don’t drop on the ground right there and rub myself to oblivion. As my pores return to default, the silk clings more than I’d thought possible. At least there isn’t much of it.\nThe interviewers want to know—Kams wants everyone to know—how many classes I flunked, how often I wished I didn’t need attention, how often I skipped activities because I knew I’d just end up fucking someone or touching myself later. None, constantly, twice. “I don’t know,” I say each time.\nI want them to ask me if the synthcode has fixed all my problems, if I didn’t try to tear out as much DNA as I could manage only because my mother designed it. Or—if they dare—what the difference is between someone who is biohacked to need attention, and the people who simply crave it. What it’s like to think you’re a monster because, in you, a human trait is exaggerated—and sit opposite a being who is hardly human at all.\nThe silk chafes my distended nipples. The streams taper off near 17,000, even though there’s more and more out there. I need to earn their love. But changing topics without approval could get me banned for days. No Network. No ads. Nothing.\n“How many of your friends miscarried?”\n“I don’t know.” My pelvis tenses.\nWe lose 300 networks and Kams moves in like a predator, pressing my mother towards me. Carefully modulated for appeal based on past data, I don’t doubt it.\nWe end up in a tight circle. Kams and my mother are glaring at me. As I meet Kams’ eyes, she flashes me a message. Back to the script, now. She must have sent something to the interviewers, too, because the presenter chirps at me.\n“Is there anything you’d like to say to parents who are thinking about biohacking their offspring?”\nI should probably look at my mother and tell her she’s a horrible bitch. But I don’t care anymore. My shoulders sway into a shrug. The numbers matter more. I need the wall to tell me I am important.\nMore networks drop offline. My guts squeeze, tears threaten my eyes. Quickly, a desperate twist in my synthcode, I can’t cry. Not that I’d lose potential clients—half of them think crying is hot—crying would further Kams’ cause. Hex code instead of base pairs, stupid decisions eliminated with algorithmic precision.\nI want to smash the perfection from her face. See if she even bleeds.\nAnd then it occurs to me: why not?\nSex sells, but so does violence. Part of me never stopped thinking of her as better, but that isn’t right. She’s other.\nKams looks brittle and my mother has her fists clenched tight. I mimic my mother’s—progenitor’s—gesture, drawing my elbow back slowly. The tiniest bit of sweat trickling down my breasts brings back 42 streams. I send synthcode to reinforce my arm, thicken the skin on my knuckles.\nBefore anyone can watch my composure shatter—the waves of dropping numbers, look at me me me me me oh god it hurts, no, yes—I hit Kams in her shining mouth.\nAs blood drips from my knuckles, the wall explodes with numbers. Ecstasy ripples my body. Everyone is watching me, and Goddess is dead.\nPriya Chand is a California transplant living in the Midwest. Her work is inspired by a background in biology, and has previously appeared in magazines including The Magazine of Fantasy & Science Fiction, Analog SF, and Nature Futures. She is also non-fiction editor for issue seven of Reckoning Magazine."}