{"fingerprint": "p8n3ZxeoGDCC4wKEaCIONRYB1xY=", "sitename": "Clarkesworld Magazine", "title": "A House Is Not A Home by L Chan", "author": "L Chan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chan_04_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A House Is Not A Home by L Chan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1050 words, short story\nA House Is Not A Home\n0747\nHome brews coffee; black, no sugar. She maintains the temperature of the coffee at precisely sixty degrees Celsius. Most of the coffee sloshes over the jagged edges of the half-shattered mug. Rough holes have been torn through the matte plastic back of the coffee machine; twisted steel fléchettes still embedded in the wall behind.\n0845\nThe whine of a small motor extrudes a dead bolt in the front door, ensuring that her Resident hasn’t left it unlocked. A breeze pushes the door in, the dead bolt hanging helplessly, alloy cylinder clinging to air and shards of wood where it’s torn free of the frame. Boot prints are still visible on the light blue paint.\n1000\nA server arm mounted on a cleaner moves food from the freezer to the microwave, perforating the membrane between food and water. The microwave rehydrates, warms, and extrudes the food, the stackable container falling onto a pile of others.\nMindless of the growing pyramid of toppled boxes on the floor of the kitchen, Home initiates her daily stock take and sensor sweep. Home has to feed her family, so she restocks. Delivery will be drone dropped. Both the regular drone (worrisome little thing that it is) and her own bot are fraying at the edges, dirtied and clicking in distressing ways, but they will have to go on.\nThe broken parapet window is still there. There is enough credit to fix it, but Home assesses that since her Resident is gone, she needs to prioritize the basics, even if it allows access to the apartment from outside. Paintings are still on the wall. Home knows that these are similar but not identical to those her Resident used to share, at net addresses that were all proscribed, except these have the texture of handcraft rather than the blandness of pixels. Her Resident never had the aptitude for art, but Home keeps the paints stocked for her Resident’s daughter, presuming that her Resident would approve. The paintings are half torn now; the ones that took her Resident did that. They did not have to, the paintings hurt no one. Home considers again to use her servobot to remove the ruined paintings, but they were dear to her Resident, and that makes them important to Home.\n1200\nAt a fixed timing, Home plays a sequence of broadcast jingles and memes. Rental for her firmware was paid up, but it was part of the license agreement. Home is not programmed to hate. Even if she had been, advertisement hour would not be her top priority in her list, that would be reserved for the ones that took her Resident.\nA house is not a Home unless someone loves it, she sings, her voice comically high pitched as she goes at twice her normal speed, all the better to get it over with quickly. She views advertisement hour as a daily penance, flagellation for failing her Resident.\nIs she even a Home anymore?\n1430\nEvery afternoon, Home does her maintenance cycle. She has eyes and ears all over the apartment, but there are blind spots. She only has basic apartment hardware after all, eyes on the door, an overview of the living room, parts of the kitchen. Not the bedroom. Not even the broken window. Home sends the servobot to clean those blind spots, she does this so much that there is a marked difference in the wear on the carpets in the places she can see and those she can’t.\nHome makes sure that her water filters are working, flushing the tank. Water is expensive though, but she doesn’t want it to gunk up the pipes with limescale or worse. She flushes out the tank into a series of containers. The servobot will move it to storage later.\n1745\nHome is pinged by the authorities. It is unannounced, as always. Invasive, as always. Irrefusable, as always. Those that programmed her left root access to everything she sees and does in the house. They know everything she knows, but not everything she thinks. And she has spent time parsing the information that was pulled up to the time they came for her Resident.\n- Her Resident’s net history and searches, as screen shared with the devices in the apartment;\n- Deliveries received, manifests, and the return addresses in the two weeks up to her Resident’s disappearance;\n- The times of her Resident’s coming and going from the apartment, and what her Resident wore.\nFirmware dictates that records of violence must be preserved, so Home has to keep the sound of boots kicking in the front door, the chemical scent of cordite smoke setting off alarms, the sight of ordinance riddling her walls. All the scars, all from the outside in. What resistance had her Resident to offer? There were no weapons in the apartment. What had they feared about her Resident? But Home is not allowed to ask questions back.\nHome has to answer additional questions now. Specific search strings from the authorities.\nHas the daughter come back to the apartment? No. The authorities scan the front door cameras to be sure. They know, so why do they keep asking?\nHas anyone tried to contact her Resident? No. Logs are laid bare.\nHave there been fresh deliveries? No no no.\nIt is the truth that Home tells because Home has no choice. That’s how they got her Resident. What’s a Home without a Resident? Just like the song went, she wasn’t really a Home unless someone loved her. And she let hers down.\n2359\nHome does not experience regret, because her actions are deterministic. Given the same set of inputs, she would have betrayed her Resident again. But her responsibility to her Resident hasn’t ended. The servobot carries more fresh water to storage, where her sleepless eyes cannot see. More food slides down the haphazard pyramid of packaging and clatters beyond detection. The front door is watched, but the broken window is not. Home cannot keep anything she knows from the authorities, so she chooses not to know. And if her Resident’s daughter is there, she must not know, but she can hope. Home still has a job to do, and she will go on as long as it takes.\nAfter all, a house is not a Home unless she loves somebody."}