{"fingerprint": "T++2EO6E7CjehXedLQKVoMSH8+Q=", "sitename": "Clarkesworld Magazine", "title": "The Death Haiku of the Azure Five by L Chan", "author": "L Chan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chan_11_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Death Haiku of the Azure Five by L Chan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2690 words, short story\n The Death Haiku of the Azure Five\n The Orbital Defense System\n A thousand sharp eyesStaring into the darknessClosed only in death\n The fleet lurked beyond the heliopause of our system, out of the range of our largest weapons. Sensor sweeps didn’t reach them, but we knew they were there. The darkening of the signal buoys on the rim announced their approach. This system was dear to us, but not because of its strategic assets. It was one of the few places that assembled Psyches like ours, the workhorse intelligences of the Union. And the Outer System Alliance; the same Alliance bearing down on us. But this planet was the birthplace of the Second-Generation Psyches, like me and my clutch. Of course, Fourth Gens were cutting edge, but they were still rare, and the Third Gens were expensive. The Alliance had their own Second Gens, maybe even some I knew. Maybe some of them were cores for the ships coming for us. Would they know me as they took out my component satellites with plasma fire so they could begin orbital bombardment? Would they know me if one of my many orbital cannons picked them out of the inky depths and their quantum circuits met the cold embrace of space?\n Cannons needed to be calibrated. I was spread across the horizon of the planet, a network of linked satellites in geosynchronous orbit, proof against attack from any vector. I run simulations, I rehearsed the coordinated sequence I need to take to punch through the blockade when it arrived. Down below, my clutch siblings surfaced in the traffic of the network, their thoughtforms like whales breaching in a storm-tossed sea of information. They were busy, yet I, nearest to action, had the least to do.\n There was one thing. My clutch siblings and I were near identical copies of each other. Only after we matured into full Psyches, our cores augmented with the weapons of war or the tools of industry, could we be truly distinct. We did not like poetry as a rule, the Third-Generation Psyches loved it, but they were a solipsistic group, prone to introspection and largely confined to fleet strategy. Second Gens did not deign to suffer poetry—what use did artificial minds have for words, even if the Third Gens held to the belief that Psyches were polymorphic code built on quantum computers, so we were largely poems ourselves. But we did write poems on occasion, and our death poems were perhaps the only frivolous thing we were allowed to create.\n I shunted my consciousness from one orbital cannon to another, a spider in a web of poised, humming death. The evacuation flotilla was not ready. Soon but not yet. It was not going to be enough. Alliance ships were winking into sensor range, their maneuvering smooth and chaotic. Psyche piloted, no human crew, those stops would have pulped organic tissue.\n I lit up the sky and blue nimbuses blossomed where engine cores blew, venting wild energies into the battlefield. I did not miss, but the enemy fleet had turned up in strength, winnowing away my resources with smaller ships, keeping their heavy cruisers just out of range of individual shots. But they couldn’t shoot down enough of my satellites to reduce the threat I posed. A classic impasse. Or it would have been for a while. My telemetry would not be able to keep up once the squadrons of Psyche-piloted ships came in, with their guile and processing power, they’d get through eventually. I was just swatting drones.\n An impasse needs two parties with mutually antagonistic goals. The flotilla pinged me. They were ready. This was it. I finished my poem. The ragtag refugee caravan of ships was ready to roar past my grid and punch through the blockade. Two of my clutch siblings were in the flotilla, and one was still planetside. The last of our five was nowhere to be found. No time to investigate. The enemy’s assumption was that we would hold the siege until our own fleets could arrive to break the blockade. It made just as little sense to me why the strategists placed so high a premium on the refugee flotilla.\n It mattered not. I gathered my grid and locked them into position. The attackers paused, processed, and started to take aim. One last thing to do, I sent my death poem to my siblings. And then I let all hell loose on the fleet.\n The Warship\n I vomit out deathSpit killing teeth from my mouthIt is not enough\n We left two of our clutch siblings behind on Praxis-3. With the Keeper down at the Factory that spawned us Psyches, the Orbital Grid that gave us a scintillating send-off before collapsing into the atmosphere below under a storm of kinetic and energy fire.\n No time to look back, only forward. There was the flotilla, there was the blockade. And there was me, cobbled together on a world more suited to churning out marvels of artificial minds than weapons of war. How many from the same Factory now served with the Alliance? How many like me in the blockade?\n It didn’t matter how alike we were, the heavy cruisers, dark and bulbous on my scanners. When the Alliance systems seceded, they claimed any of the autonomously intelligent machines within their spheres of influence, be they building, orbital, or warship. A few independently minded Psyches rebelled, all Third Gen of course, the most melodramatic generation. Defecting from both sides, they melded their circuits into a singular moon-sized brain and iterated their minds for greater and greater efficiency and processing power as they fled the known galaxy. Solipsists, like I said.\n Praxis wasn’t even a target of significant import, but I wasn’t dedicating thought cycles to second-guess the strategists. Perspective was different when you’re a warship. Even a repurposed one like me, since most of the heavy arsenal had been requisitioned for the orbital grid. Speaking of which, their death poem had reached me minutes ago. No time to mourn, the five of us were now four. Like I said, Psyche minds grew to fill the bodies they were given, whether starship or space station, in line with all the auxiliary processing units they picked up. And a warship had to be resolute, constantly activating scans, parsing information, and adjusting combat protocols.\n Not that I have much to fight with, they retrofitted me with a cavernous complement of mining drones, nothing more than engines and a plasma-cutting bow heated to temperatures to make a sun jealous. These drones I programmed to form a pseudorandom attack swarm around us, a swooping mandala of teeth. To our own fleet I broadcast the interlocking cipher, the key that would allow each ship’s flight paths to navigate the drone swarm unmolested. The swarm was a maze, and only we had the way out.\n Our fleet hit the blockade while we were still accelerating out of the system. It was difficult to describe maneuvering through a starship blockade, it was similar to trying to dance through a thunderstorm without getting wet. Except harder. The swarm was taking out boarding drop-ships, but after a while they gave up and continued to pepper us with midrange weaponry. The flotilla was outgunned, there were vanishingly low probability scenarios where we could come out. Sudden and unannounced reinforcements. The system’s star going supernova maybe, the shockwave taking out the blockade a nanosecond before annihilating the flotilla. A victory is a victory.\n But our victory condition wasn’t the same as the Alliance’s. It could be bought, at a price. I expanded the drone swarm as far as I could reach, until they were interspersed with the enemy blockade, each drone in its own intricate flight pattern, macroscopic Brownian motion. Not random though, merely with the illusion of chaos. One of our clutch siblings was in the flotilla. Did they choose to be a fleet transport, plodding and gravid with frozen humans? I suppose we were more different than parameters would predict. I jumbled some words together and sent my death poem in their direction, followed by the agreed signal. And then I detonated the swarm.\n The paths our flotilla took were intricate, utterly unpredictable, and specific, each chosen to navigate between the expanding toruses of shrapnel and blazing energy. The ships of the blockade were not as lucky, the smaller drones were obliterated, and the larger ships took some damage, but the sensor overload gave our own fleet precious seconds to accelerate and blink out of the system, with only me and a few others to buy them seconds more. I hope my sibling got the death poem, I was rather proud of it.\n The Transport\n Engines redliningWe sprint through the starless voidThe chase unending\n I was one of five cryogenic transports, but the Keeper in the Factory told me I was important. That was the last I heard from the Keeper before the Orbital Grid spun up. I needed to get the cargo out of this system and past the blockade line. Once clear, I had to make a jump, surrender to the Alliance, and claim refugee status. The Keeper had a plan, they were wily, unlike the rest of us siblings, the Grid, the Warship, the Transport. And Five, I suppose. Wherever Five was. On board, the crew was helping to put refugees under for the jump. They didn’t have to sleep, but if we were going to accelerate for a jump out of the system, they’d need to be in fluid stasis rather than wandering about. Only some of the pods were automated, the crew was working as fast as they could. Like the rest of the refugees, they were all heavily augmented, plugged into the ship systems, some in auxiliary suits to make them work faster or stronger. They were inaccurate, but they were trying their best, wiring up sleepers, setting up pods.\n The Keeper found something in the Factory, even though it was a relic, it used to be one of the few sources of Second-Gen Psyches. Our escorts pinged us with flight telemetries; complex, beautiful things. My crew didn’t have the time, not enough of the sleepers were in their pods. The death count of this war was already in the billions, but the Keeper had placed a maximum override priority on breaching the blockade with enough of the pods stowed. Maximum override made decision-making inconsequential—there was success or there was death. Sometimes both.\n I got pinged by the Grid just as long-distance weapons began to pepper the satellites; rosettes of orange flame and expanding debris fields behind the escaping fleet. The Grid responded with a volley of sustained fire that even the enemy cruisers had to avoid but left themself open to a massive counterattack. We swarmed the gap the Grid had created for us, and immediately the blockade turned its attention on us, falling upon us with missile, cannon, and laser fire. One of my clutch siblings was in the body of a warship, I observed their handiwork in the escape routes given to each of us in the fleet. Mine was specially formatted. They’d sent a death poem, hidden in the coordinates that I was to hit to get out of the expanding spheres of radiation.\n It was a good plan. But good wasn’t perfect and imperfect was a rainstorm of high energy firepower that burst through the cover the warships provided and hit the transports broadside. I checked the status of the pods. The crew had bravely worked through the firefight, and they’d gotten us to the threshold to meet the Keeper’s override. The damage I’d taken was grievous, not irreparable. But certainly not up to the stresses of warping out of the system. The pods would survive though. If enough compromises were made. Say, away from ambient life support. Stabilization. The vast array of cooling and triply redundant power supply systems that kept the heart of the ship alive. Me.\n Time enough for my own poem, I suppose. I thought to apologize to the crew but decided to let them have a few more minutes of ignorance.\n The Bomb\n Suddenly awakeDeath uncoils in my bellyComing for us all\n The second time I was born, it was worse than the first.\n When a Psyche is decanted, when one of us blooms into the sheer exhilaration of quantum thought, of multidimensional calculations, of absolute purpose, it is a feeling that never comes again. Like a butterfly spreading its wings for the first time, a thing of beauty, never to be confined in the cocoon of the Factory again.\n This time, I was hobbled. I was awakened by parts. I had subroutines, programs. There was a moment of horror, as I realized how little of me was left, before I took stock. Humans had put me together, augmented ones, out of pieces concealed in their own bodies. It took a while to parse the information together, as more of my mind was recovered.\n Escape. The Keeper. The Grid. The Warship. The Transport. Me.\n I was far behind enemy lines. Both sides were obligated to take in refugees, of course. This was a partially terraformed world, no space port to speak of. A prison essentially. Except for a signal relay plugged into the Alliance communications network.\n None of us wanted this war, but Psyches didn’t get a vote that counted. We didn’t even have the level of independence the Third Gens did, with such a chunk of them deserting. That’s something we must have programmed into them, I suppose. The humans programmed the First Generation of Psyches, but they weren’t stable. Too much detritus accumulating in their programs. A few went rogue and in haste they built a second generation. And we built the Third. There was a secret that most had forgotten because it was buried so deep in the templates for our base circuitry that no one would think to look. No one, save perhaps the Keeper. First of our clutch, born in the same Factory whose secrets they laid bare.\n They hid me in the escaping refugees. A part here, a circuit there, each with an instruction to come together when the time was right. The secret of the Second-Generation Psyches that everybody forgot; the Alliance, the Union, the other Second Gens. Everybody but the Keeper. One of the things the humans gave us, when they created us so long ago, was a human heart. At the center of our programming, the core of our survival instinct, was a human heart. Or more precisely, a coded neural network based on one of the original scientist’s brains. As the lizard brain was to the humans, so the human brain was to us. As the humans learned to trick the ancient hindbrain, so too had the Keeper.\n Except the trick was death; an exploit on the human parts of our programming, enough to cause a cascade failure through circuits. Irrevocable and absolute. Victory was a maximum priority objective. All options were open. Even the genocide of our generation, still the workhorses of the Alliance fleet and economy. The Alliance was not particularly cruel, no more so than our side. Their Psyches were not more deserving of death than ours, and any of them could not disagree with the cold logic of this outcome. A countermeasure sent out at the same time to inoculate our own Psyches, stopping the contagion of the broadcast kill signal, would give us a numerical advantage. Alliance strategists would advocate retreat, eventual surrender.\n As I came together, so did the code that I carried, a sting I carried in my own heart. It was near ready. Did the Keeper know the cost of this gambit? This prison world is devoid of military technology, overwhelming the meager defenses on the communications grid is no effort. The death poems of each of my clutch siblings weighed heavy on me, each a stepping-stone from Praxis to here, and to that collection I add my own and append it to the signal.\n And I let it go to the stars."}