{"fingerprint": "uU72YeEeLbfcYsL1FVrDorFM5jg=", "sitename": "Clarkesworld Magazine", "title": "He Leaps for the Stars, He Leaps for the Stars by Grace Chan", "author": "Grace Chan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chan_07_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: He Leaps for the Stars, He Leaps for the Stars by Grace Chan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5260 words, short story\n He Leaps for the Stars, He Leaps for the Stars\n 2021 Finalist: Aurealis Award for Best Science Fiction Short Story\n Yennie’s new therapist started by checking his biorhythm recordings—sleep patterns, heart rate, blood pressure. Then, the therapist’s soma projection leaned into the space between them and asked what Yennie would like to talk about.\n Yennie glanced out the window. An ice storm, a froth of glassy dust, was blowing in over the bone-colored hills. He was on Enceladus; his therapist was on Mars. He wanted to describe how sometimes his body felt hollow, and other times he felt his skin could not contain all that was within him—but he didn’t have the words. Half the solar system divided them, and more.\n Yennie woke to a niggling headache, a finger poking into the base of his skull. Today’s lottery winner was already pacing in the waiting room of his mind.\n The muscles of his neck, back, and legs groaned from yesterday’s eight-hour dance practice. His left knee, bruised and swollen from spinning on it, throbbed sweetly. On his tongue was the stale aftertaste of last night’s hastily scoffed dinner—three hundred grams of AtSal Fancy Fillet and two hundred and fifty ml of WheatGermProShake.\n He opened his eyes. Ambient yellow light, a simulation of a sunrise. White marbled walls, sculpted to resemble a rocky cliff-face. Black ceiling, shimmering with rivers of projected content: news channels, line graphs tracking sales of his latest single, invitations for product endorsements, philanthropic appeals, a calendar detailing his daily schedule, an updated meal plan from his dietitian . . .\n Suyi walked into the room, brown ponytail swinging to her trim waist. “Good morning, Yennie.” She waved a hand, and the sunrise sped through to the brightness of full morning light. “You’d better let her in. She’s been waiting almost an hour.”\n “Can’t I at least brush up first?”\n “Today’s guest is a VIP,” said Suyi. “A good review would really cement your spot in Sol’s Stars of the Soma Age. Plus, fans usually enjoy seeing the mundanities.”\n Yennie shivered. His assistant was right. Fans were obsessed with the intimacy of a bodily merger with their favorite celebrities. Inside Your Idol had become a cornerstone of an entertainer’s profile. A couple of bad ratings could nosedive a promising career.\n He swung his legs over the side of the bed. The cool air against his goose-pimpled thighs evoked the fuzzy remnants of a dream—dark corridors between rows of sleeping pods, bare feet soaking up noise from freezing tiles, someone’s nervous breath tickling the nape of his neck . . .\n Shaking his head to dispel the last tendrils of sleep, he accessed the waiting room. The VIP’s profile bubbled up. Hespera Soo: eldest daughter of media tycoon Wesley Wen-Ching Soo and heir to his estate. Twenty years old, narrow eyes, black hair pulled into a twist, accentuating her round jawline. Studying new media and international relations at the University of Singapore.\n He granted Hespera entry. The Ghost™ implant immediately linked to his visual, auditory, and somatosensory networks. A husky voice with a posh Earth accent spilled across his mind.\n “Oh, finally. I thought there might be a connection issue, what with the Belt telecommunications strike this week and all that bother. Is this your bedroom? Gorgeous. Liisa Mäkinen, right? She did my lunar penthouse apartment.”\n “We must have similar taste,” Yennie replied, quirking the corner of his mouth so Hespera could feel his smile. He was designed to charm, selected before birth for charisma, whetted and sharpened by every preceding moment of his life. He could swivel like a dial—aligned for banter, indignance, sympathy, tears, whatever the moment required.\n “Maybe because I’ve tried to emulate you since I was a kid,” said Hespera, with an equally effortless air. “Your guests probably all say this, but I’m one of your oldest fans. You’ll be more delighted than my parents, at least, to know that I keep every album edition and product endorsement of yours in a vacuum-sealed collector’s vault.”\n She wasn’t quite what he expected. Usually, Earth fans were dominating, entitled, squealy, and streetwise. Hespera’s ironic self-awareness didn’t feel like a cigarette burn in his frontal lobes. Despite her accent, she impressed as somewhat likeable. He let himself relax, just a millimeter. Maybe the next fourteen hours wouldn’t be so terrible.\n “My truest fans have learned all my dance routines, too,” he teased.\n “Anyone with an iota of common sense would not be encouraging me to dance. Are you questioning my devotion? Sad to say, I’ve bought a ticket for this Inside Your Idol lottery every day for five years. Unik Management guards their leading light so closely, even my glorious father couldn’t pull any strings.”\n Yennie wondered if Hespera was telling the truth, or if she simply thought she was. There were always strings to be pulled, especially by those who coordinated the whole puppet show.\n In the bathroom, Yennie brushed his teeth in front of transparent walls. Glittering ice dust drifted over a crystalline landscape of chipped hills and massive craters. Enceladus was in the height of a tidal summer. Saturn’s golden orb, tidally locked, glowed close and large in the pale sky. The subsurface oceans were quiescent, the crust fractures only emitting a fine spray of water and silica.\n The thin young man in the mirror slowly disappeared under the cosmetic-bot’s deft touch. Sharp cheekbones, softened by shimmer. Concealer, dabbed over the shadows underscoring his eyes. Blush, to enliven his wan complexion. His long, dark-green locks, combed, ironed, pulled back into a braided tail.\n Suyi laid out his breakfast on the kitchen bench: an espresso, a raspberry flavored protein bar, and two hundred and fifty ml of WheatGermProShake. Hespera asked to have a closer look at the android. Suyi obliged, standing and smiling as Yennie circled her.\n “She’s gorgeous. Her micromovements and microexpressions are so seamlessly integrated. Is she a Biograftica model?”\n “Good pick,” said Yennie, gulping the espresso. “She’s an expansion of the LR-10 line.”\n “I thought that line was discontinued. Are they reviving it?”\n “I’m part of a research and development project,” said Suyi, who was privy to the guest’s transmissions. “Biograftica haven’t decided whether to go commercial with me yet. Yennie, let’s talk through your schedule for today.”\n The schedule was more or less the same as yesterday’s, but with new partners scheduled in for meetings. 9:00 a.m., vocal coaching. 10:00 a.m., charity morning tea. 11:30 a.m., cosmetic touch-up. 12:00 p.m., lunch with ProShake marketing rep. 1:00 p.m., acting lesson. 1:45 p.m., filming a variety segment for Kuiper Belt Tourism. 3:00 p.m., afternoon tea with Disney Merchandise. 3:30 p.m., dance practice. 7:30 p.m., dinner. 8:00 p.m. to12:00 a.m., dance practice.\n “Eight hours of dancing again?” he groaned, just as Hespera muttered, “Does she also let you know when to pee and jerk off?”\n Ignoring Hespera, his assistant continued, “Management has decided to bring forward the release of your new single from January seventh to December tenth.”\n Yennie’s heart sank, but he tried to control his breathing and expression so they couldn’t sense his disappointment. December tenth was only two weeks away.\n “They think Eyes Like Snowflakes will sell better in the lead up to the festive season. Plus, it’ll line up with Swarovski announcing their Snow Crystals range. Don’t forget they’re sponsoring your show. You need to be sharper than your last performance, Yennie. You need to sparkle.”\n There was something chiding in Suyi’s tone. He peered suspiciously at her. He was sure that a human intermittently co-opted Suyi’s circuits. Maybe his doctor or acting coach or dance instructor, or more likely some tosser from Unik Management, wanting to make sure he wasn’t straying outside his position description.\n “I’d like to see my therapist today,” Yennie said suddenly.\n “Your therapist? Why?”\n “Bringing the launch forward by a month is incredibly stressful. I need to make sure I’m in the best mental health to keep up with practice.”\n “You don’t have time—”\n “One hour, at the end of the day. Please, Suyi.”\n The android contemplated him impassively. “Fine. I’ll schedule it in.”\n Yennie knew the truth: he was not really one person. He held millions of potential lives within him. How were you supposed to live your life, when you were the convergent endpoint of so many spreading trajectories, terminated too soon?\n “You look afraid,” Micah had observed, in one of their early sessions.\n At first, he’d mistrusted this latest iteration of a listening ear. For one thing, Micah was younger than his previous therapists—probably only in his mid-twenties, not much older than Yennie, if he had to guess. His slender physique and grungy shirt inspired little confidence. For another thing, he didn’t speak with a refined sunward accent, as all the others had. His unusual blend of neutral interplanetary, with a twist of working class, dislocated him, made him impossible to pin down.\n With the passing of weeks, unfamiliarity turned to curiosity. Yennie wanted to ask about Micah’s background, but he knew it was against professional code for therapists to reveal personal information. Moreover, to ask would be, in turn, to reveal too much about himself.\n Yennie adjusted his features, pushed his spine against his seat. “No—just thinking.” He hesitated. “You know why they farm us out here, right?”\n Micah waited.\n “Two reasons. Climate and money. The average surface temperature on Enceladus is two hundred degrees below Celsius. In the cold, it’s easier to control gamete engineering in bulk. And here, it’s cheap. Rental on Earth and Mars costs you a kidney or three. But this far rimward, you can build whatever you want, in land or air space, for a fraction of the price.”\n Yennie bit down hard on his lower lip, tasting flesh. He didn’t like the sound of his voice: boyish, frayed. This hadn’t happened with the others—this impulse to let everything pour from his throat, accompanied by a fear that the torrent might not end.\n “Many people nowadays are born from gamete labs,” Micah said gently.\n Yennie glanced away. The glow of the soma projection turned the rest of the room to grainy darkness. Micah wouldn’t be able to grasp the scale of the farms. Embryos with excellent probability genes for facial symmetry, coordination, musicality, and stamina, progressed along the Entertainer production line. Ship-sized factories of fetuses, suspended in sim-uterine stasis, selectively advanced through phases according to samples of their early epigenetic patterns, tests of rhythm responsiveness, quality of neural activity, resilience to environmental challenges.\n “Did you know they held my embryo in stasis for twelve years? Ninety-nine percent of my germ line mates are still stuck in production. Maybe it would be better if they just destroyed them—but I guess you don’t delete old files until you run out of space.”\n “What happened after you were selected for birth?”\n “Management compressed my early development from three years into one. They said they were eager to see my potential. I joined the training program when I was four years old—biologically, at least. I won my first dance competition at five, started singing professionally at six, and was playing the adorable kid in serial dramas by seven.”\n There were thousands of other trainees in the program. By probabilistic luck and the irresistible forces of calibration and design, he’d floated to the top, like pond muck.\n He remembered yearning for stardom with every cell in his body. He poured this yearning into every vocal lesson, dance practice, audition, and performance. It wasn’t so much that he wanted to be better than his peers. His drive wasn’t external, but internal, burning, pure—a crater of molten lava in his belly. Like the final output of a complicated equation, he wanted to achieve the greatest amount with the immense potential invested in him.\n The others in the program had all craved success just as deeply. Huddled in their sleeping pods at night, bruised and bone-weary from training sixteen hours a day, they’d whispered their dreams across airless shadows. Sometimes, Yennie wished he were still back there, holding hope and tears with his left-behind friends, urging one another on, knowing most would fall short. Only a few could be stars, but still they strived.\n “They never told us we had to stay, but who would leave? I mean, how could we imagine anything different, when they taught us from conception what we wanted, and how to be happy?”\n Yennie stepped into the soma projector to meet with the Kuiper Belt Tourism film crew. The machine sent a bodily projection of him back to Earth, to a studio above the flooded city of Melbourne. The technology to project physical and neural states near-instantaneously using quantum entanglement was commercialized in the late twenty-first century and had revolutionized interplanetary communication. Hespera, still leeched via the Ghost™ implant, came along too, her sensorium beamed all the way to Enceladus and back again.\n “Sweet Mary, I better download a couple of aspirins,” Hespera muttered, as they materialized in a warehouse illuminated by floodlights.\n The Kuiper Belt Tourism host quizzed Yennie about his traveling likes and dislikes, made Yennie play a slapstick game involving hopping around in an inflatable rocket ship, and cheered as Yennie read out the company’s festive season promotional deals.\n “Your dream holiday is a Michelin-starred kaiseki aerial tour of Neptune’s rings?” Hespera asked skeptically, as they soma projected to afternoon tea.\n “Sure,” Yennie said, knowing just as well as she did that he’d simply said what the host wanted to hear.\n But as he strode, sure-shouldered and smiling, across a sunny Californian esplanade, extending his hand to the Disney reps in their pressed suits, Yennie wasn’t so sure if there was a border between his invented self and whatever lay beneath.\n Halfway through Yennie’s second dance session, with his instructor looming impatiently and Suyi hovering nearby, ready to beam across a bunch of post-experience surveys, today’s Inside Your Idol finished. Hespera bid him goodbye. Yennie rubbed his aching knee and told her he hoped she’d had fun.\n “Get that poor knee examined, my friend,” Hespera murmured, her voice coiling between his ears. “Oh—and look out for a parcel next week.”\n “I’m sorry, Ms. Soo, but gifts are outside protocol—” Suyi interjected.\n “My five-star reviews always come with a small token of appreciation.”\n Hespera’s tone was clipped and emphatic. Suyi said nothing further. Then, today’s guest was gone, and Yennie’s head was empty again. There was only a gentle, ballooning space inside his skull, and the bloated pulsing of his left knee, almost comforting. He sat back on his heels, stretching out his sore calves. Eyes Like Snowflakes began to play from the top, for the billionth time, and his instructor’s soma projection gestured for him to stand.\n Suyi observed the first few steps of Yennie’s routine before walking away briskly, her heels tapping on the tiles.\n “Your blood pressure’s a bit low today,” said Micah, a crease dimpling between his brows as he glanced over the readings. The therapist’s previous pastel, spacious background was gone. He seemed condensed, shoulders hunched, attention darting intermittently to something out-of-capture.\n “I’m probably just dehydrated,” Yennie said. He took a big mouthful of electrolyte water as appeasement, gripping the bottle tightly to hide his tremble of fatigue. “My instructor’s a failed military sergeant trapped in a dancer’s body.”\n A soft smile, lopsided across a mobile mouth. “You must be exhausted.”\n When their eyes met, Yennie had to look away after a mere two seconds. The intensity of concern in Micah’s gaze was unbearable, even terrifying. The other therapists had worn their kindness like an embroidered mantle: delicate, curated, and warm, but ultimately only a shroud of specific thickness. Micah, however, appeared to care with every fiber of his being—or he was an excellent actor.\n Yennie thought back to how he’d terminated the last one’s contract, after enduring that saccharine smile for months, and rifled through the applications until he’d stilled over Micah’s animated hologram. There’d been something in Micah’s sweet, tentative movements that pulled a strange feeling from the depths of Yennie’s memory.\n Since then, they’d learned to speak in layers of meaning. They knew someone was always monitoring. They parsed a subsurface language composed of brief glances, shifts of shoulder, quirks of the mouth, a flutter of fingers. Until finally, Micah found a hole in the shell around Yennie, and, in the secret hours, the real work began.\n The feeling still came, from time to time—something shadow-swathed, and only remembered in glittering fragments like broken glass.\n A week before the performance, Suyi sat down across from him at breakfast. Yennie paused with his spoon halfway to his mouth. Suyi never sat.\n “What’s wrong with you?” the android asked.\n Confused, Yennie glanced down at himself. His tresses, now back to their original black, were neatly braided. His cheeks and eyelids gleamed with psychedelic swirls. His pleated silk gown draped artfully across his lean waist.\n “You’re hardly sleeping.” Suyi’s fingers twitched. His biometrics projected onto the high ceiling. Sure enough, his sleep score was a measly twelve percent, characterized by periods of nocturnal waking and restless activity. “What’s happening? Do I need to observe you overnight?”\n “No, no.” Yennie rubbed his neck. “It’s not as bad as it looks.”\n The android peered into his face. “You must be under too much stress from the upcoming launch. You’ve dropped three point one kilograms, your blood cell production has slowed, and your hair loss rate has nearly doubled. Do you feel unwell? Headaches? Stomach pains? Night sweats? Fatigue?”\n “Are you worried about me, Suyi?”\n “Of course I am. We need you in good health for next week. Let me cancel your talk show appearance tonight. I’m booking you in with Dr. Phuong and Dr. Vaz.”\n “There’s no need for that.”\n Suyi ignored him. “In fact, I’ll cancel all your interviews this week. A counterintuitive strategy might work in our favor, actually—build suspense leading up to the release. Yennie, make sure you ask Dr. Vaz to increase your calorie intake and check your micronutrients. And if Dr. Phuong wants to reformulate your sleeping meds, please don’t protest. I’m sure the side effect last time was a coincidence. All right?”\n Yennie had no desire to see his dietitian or doctor, who both seemed bent on turning him into a superhuman and disappointed when he repeatedly proved to be an ordinary mortal. Nevertheless, a brief respite from publicity would be welcome. He’d be able to fit in an extra session with Micah, perhaps. And he’d have more time to prepare for the big day.\n Hespera’s gift arrived in an unmarked silver box, only a little bigger than a ring box. The fingerprint-identification lock showed evidence of tampering; he knew Unik Management checked all his mail. Within the box was a velvet pouch. When he loosened the drawstring and tipped it upside down, two things fell into his palm: a brown paper-wrapped lolly, and a silver heart-shaped locket on a chain of delicate snake links.\n Sitting in the corner of the bathroom, Yennie unwrapped the lolly and popped it into his mouth. It took him a while to find the locket’s clasp, which was disguised in a pattern of tiny, interwoven vines. When he hooked his fingernail beneath it, the heart split open. Two words were engraved on the mirror-flat surfaces within: Blueberry Masquerade.\n The taste of caramel melted over his tongue, leaving a tiny, hard lump. He spat it onto his palm. The computer chip was the size of a lentil. Miniscule filaments on its surface gleamed like a maze of gold.\n Creating a deepfake simulation of a person is just a function of enough data and processing power, Micah whispered into Yennie’s ear, in the unwatched hours between midnight and dawn. He murmured phrases no therapist should know, like autoencoder and unsupervised learning and generative adversarial networks.\n “A generative network trains on your data and constructs outputs, and a discriminative network tries to pick the constructed from the real—until the fakes get good enough, the discriminator can’t tell them apart. The more training data we give the program, the better the models will be.”\n “There’s an avalanche of media of me going back to when I was little,” Yennie whispered back. “Holos, videos . . . everything’s on record.”\n “Then it will be easy to replicate the externalities—your appearance, your voice, the way you move. But we also need to replicate your internal world. The fake needs to mimic the kinds of things you’d say and do, how you’d go about them, your microexpressions, your unconscious habits, every subtle twitch as you process a decision tree. We want it to be as close to perfect as possible.”\n “You think we need more data.”\n “Yes,” said Micah, his tone growing even more hushed, until he was no more than a low tremble in the darkness. “Current data.”\n Yennie wanted to ask so much. He wanted to ask how Micah knew all these things, how he had access to these programs. Even more, he wanted to ask who Micah was, and why he was here, in the dead of the night, whispering with him about deceit.\n But Yennie swallowed his questions, because to ask might be to shatter hope.\n “There’s still a few weeks until the launch. We’ll use these secret hours. I’ll just sleep less.”\n “You’re sure about this?”\n Micah’s soma projection shimmered, ghostly and mesmerizing, in Saturn’s faint aura. A lock of black hair crinkled around Micah’s left ear—touching helix, lobe, neck. Yennie stretched his hand out, sliding it into the shadowy space between jaw and collarbone, but catching only empty planetglow.\n “I’m sure,” Yennie said. “Let’s start.”\n Forty billion people were already soma projected into the concert, waiting for the young man prophesied to be the “Rising Comet of the 20s” to storm the stage with his shiny new song. There were rumors, cobbled together from interview answers extrapolated beyond-context and insider scoops from self-proclaimed close acquaintances, that Yennie had written Eyes Like Snowflakes about a current crush, or maybe a recent failed relationship, or maybe a childhood sweetheart. Whichever it was, it was sure to be spectacular and heartfelt.\n The stage itself was real, constructed on a film set in Argyre Planitia. An elevated white platform, draped in Swarovski Snow Crystals and illuminated by gyrating floodlights, stood against a backdrop of ochre massifs and alluvial fans.\n As the rear curtains began to rise, the soma crowd released a cheer like a battle roar. Anticipatory beats thumped from the sound system. A pair of gleaming white shoes appeared first, one heel tapping in time to the music. Then, inch by inch, a slender figure in a gauzy robe, silhouetted by a blue spotlight.\n The beats rolled into a chord progression, floodlights twisted in rainbow spectra, sequined backup dancers poured from the wings, and fans thrust an ocean of hands toward a roiling, rust-red Martian sky.\n Yennie danced.\n More than a billion kilometers away, back in the quiet house, Suyi rearranged items on Yennie’s calendar. She graciously deleted a vocal coaching session the following morning so he could have a post-performance rest. A delicate smile curved the Biograftica android’s lips. Little did she know that just an hour ago, her treasured star had stood in front of her, face devoid of makeup, dressed in a plain gray Terra-Suit.\n “What are you wearing?” she’d cried, horrified. “Where’s your show costume?”\n But Yennie had only shouted, “Blueberry Masquerade! Blueberry Masquerade!”\n He’d only needed to say it once to initiate her emergency shutdown, but no doubt he’d been nervous.\n Immobilized and powered off, Suyi had not been aware as Yennie walked behind her and opened the control panel between her shoulder blades. She hadn’t seen him attach the lentil-sized computer chip to her central processing unit. And five minutes later, when Suyi’s system restarted, she hadn’t known that she was actually alone in the house—that the young man standing in front of the soma projector, limbering up for the big show, glinting like a knife’s blade in his silver gown, was merely a projection of the deepfake, cast continuously by the foreign chip into her sensory networks.\n Yennie’s breath rattled against his eardrums. His eyeballs ached with the onslaught of blinding light, even though his visor’s filter was set to maximum. He stumbled in the direction indicated by his wrist-GPS.\n It took all his concentration to stay upright. The ice was as slippery as wet glass and riddled with ridges and cracks; deprived of the artificial gravity of his house, he felt as though he might spontaneously drift into the sky. In a particularly treacherous patch, his legs flew out from beneath him and he landed on his stomach, his chin banging the base of his helmet, the world splintering into blissful shadows.\n As he left, he’d glanced back briefly at his house. The tripartite black building seemed much smaller from the outside: a lonely beetle perched on the side of a tracing-paper mountain. In the distance, the colossal structures of the gamete farms were wreathed in ice-dust churns.\n In the eight years since his recruitment from the training program, had he never ventured outside his house? There hadn’t been any need to leave, though—not when they could yank his mind or his body anywhere in the system, at any whim. He hadn’t imagined that Enceladus would be so frictionless, so swollen with silent light and terrifyingly spacious. Out here, a god’s finger could descend from the heavens and remove him from the landscape like a stray eyelash.\n He brought the GPS close to his face. Four hundred meters to go. That didn’t sound so far. Gasping, he tackled an incline on all fours, losing purchase in the steepest section, jamming his fingers into a crack to keep from tumbling all the way back down. Cold and pain numbed his limbs.\n A gloved hand closed around his wrist and pulled him over the crest. A helmet bumped against his. Behind the visor’s glare, a familiar face. Micah made a questioning sign, wobbling index and little finger near his chin. Yennie replied with an OK sign.\n They scrambled together across the last stretch, to the flat of a crater where a black cuttlefish of a spacecraft waited, wearing a veil of icefall. A round door in the ship’s flank snapped open. They jumped in.\n In the bubble of the airlock, they collapsed to the floor, quivering from the cold, waiting for their eyes to adjust to the dimness. Another person stepped through the inner door—a petite, plump young woman in a black jumpsuit, wearing motion capture gloves and a glowing lens over her left eye. In the flesh, Hespera looked different from her profile picture: less polished, more withdrawn, a little weary. She glanced from Yennie to Micah and back to Yennie.\n “You’re burning up in Argyre Planitia. Ratings are beyond the belt. I think new Yennie’s already a bigger star than old Yennie.”\n Yennie slumped against the wall. In his real body, without any projections or filters, he felt strangely vulnerable, his charisma trickled away. He hadn’t had time to assemble a new internal framework to replace the one that was slowly, soundlessly collapsing.\n On the other side of the airlock, Micah was peeling his Terra-Suit away from his thin form. As Micah’s helmet lifted, that familiar lock of hair unfurled around his left ear. Something warm tugged at Yennie’s chest.\n In all these months of preparation, Yennie hadn’t dared ask why two strangers would cross half the system to help him. He hadn’t been sure Hespera was an ally until the gift; and as hard as he’d tried, he couldn’t think of any rational explanation for Micah. Even now, at the end of one thing and the beginning of something else, he couldn’t find the words.\n “I don’t know how to thank you both,” Yennie said.\n “Don’t look at me.” Hespera turned away, a glimmer of concern disappearing behind a wry smile. She manipulated the info-feeds scrolling down her lens with dexterous fingers. “Iseul planned everything. You’re just lucky he reached out to me. Orchestrating an interplanetary escape for my childhood idol beats college assignments, that’s for sure. Plus, I’ve always wanted to steal my father’s favorite dartship. Sorry it took me a while to win a spot in the lottery. It wasn’t quite five years, but it was trickier than we’d expected.”\n Yennie turned back to the young man who’d leaned across the system for nights on end, asking him if he was all right, as the battling networks gathered and tested and duplicated.\n “Iseul?”\n As Yennie spoke the name aloud, a dam broke. A memory reformed in a corner of his skull, like a window smashing in reverse. Micah was a false identity. How could he have forgotten something—someone—who painted his time in the program with such vivid color? Side-by-side in their sleeping pods, surrounded by hundreds of other trainees, their breath had fogged the translucent wall separating their pillows, as they traded secrets as bulwarks against despair. Hand-in-hand, they’d wandered unlit corridors with bare feet and roaring hearts, hunting for a way out—and then, when that proved impossible, a moment of relinquished control.\n Had they erased Iseul from his mind because he was inconvenient to Yennie’s ascendance? Where had Iseul been these last eight years? Had he traveled from place to place, gathering knowledge, and shaping technology into an escape tunnel? How long had Iseul been searching for a lucky thread to follow into the walled maze of Yennie’s life?\n As Yennie reached up to grasp Iseul’s proffered hand, he realized he would have plenty of time to ask all these questions, and to hear their answers. They followed Hespera out of the airlock and into the sleek, illuminated ship’s bridge, where she activated the protocol to reconnoiter with the orbiting module. Wipers swept icefall from the viewport, revealing a timeless Enceladean horizon: sunlight breaking over glassy mountains, haloed by a froth of silica spray.\n One of the dozens of overhead screens showed Yennie on the Martian stage. How long would the fake last? Maybe this other version of Yennie would entertain the system for decades to come. Or maybe, next week, or tomorrow, a netizen’s surveillance-bot would pick out a discrepancy in his simulated movements. But by the time Management sent someone to Enceladus, his footprints would’ve already melted away.\n Doubt wrenched his gut. He was choosing everything against his nature: a life of hiding instead of fame; anonymity and insignificance instead of worship. For the first time in a long time, his mind was private, his waiting room empty. Never again would his days be laid out before him in neat parcels, meticulously calibrated to both his immediate physiological needs and the highest possible projection of his future.\n His bones ached to run back to his marble-walled house: to jump into the soma projector and stand before the frenzied crowd, to bask in their adulation, to simmer in dopamine waves. But he knew he couldn’t always trust his instincts, because they could betray him. No—that wasn’t quite right. He chose not to trust them, this time—and this act of choosing elsewhere, elsewhen, made it right.\n As the ship shivered into the air, he glanced up at the screen. Spangled and breathless, chest heaving, Yennie struck a final pose and bowed deeply, twice, three times, his black hair trailing onto the floor. Then, seized by some uncanny impulse, he was running across the stage, accelerating as he flew down the sloping ramp. His robes unfurled in translucent wings. Without breaking pace, he leaped forth—an iridescent flash, resplendent with momentum and grace, before the soma crowd, a forest of arms outstretched in glee, consumed him.\n Grace Chan is an Aurealis and Norma K Hemming Award-nominated writer and doctor. She was born in Malaysia and lives in Australia. Her writing explores brains, minds, space, technology, and narrative identity. Her short fiction can be found in Clarkesworld, Lightspeed, Space and Time Magazine, Aurealis, Andromeda Spaceways, and other places. Her debut novel, Every Version of You, will be published by Affirm Press in 2022."}