{"fingerprint": "9Xq00eWz8o4BplWsSnBpgmWgUgI=", "sitename": "Clarkesworld Magazine", "title": "Brief Candle by Jason K. Chapman", "author": "Jason K Chapman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chapman_11_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Brief Candle by Jason K. Chapman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3920 words, short story\nBrief Candle\nThe viscous stain on the floor had the rich smell of organic compounds with a tangy hint of iron. Extending a probe, Charley Eighty-Three tested it. It was human blood. Charley Eighty-Three couldn’t imagine why a pool of human blood should be spread across the sparkling white floor of section eighty-three. In fact, he couldn’t imagine anything at all. He was a sanibot and, while he had a great deal of autonomy, his analytical abilities were stressed simply by choosing the proper solvent to clean up the mess.\nThe little sanibot set to the task of spraying and scrubbing away the blot on his section. Keeping section eighty-three clean was the most important thing in his world—even more important than the things Doctor Turner had put in his mind. The Turner human had made Charley Eighty-Three his hobby, loading him with a limitless universe of moves and strategies all contained in the eight-by-eight grid of a chess board. When Doctor Turner flipped the right switch, Eighty-Three’s priorities disappeared. His world became the bounded square of infinite possibilities.\nThe sanibot moved forward to clean up the last of the stain. Then he backed up three tenths of a meter. Forward. Back again. He was caught by conflicting priorities. On the one register, he had to clean the stain. On the other, he had to stay out of the way of humans, and his path was obstructed by something that seemed very much like a human. The temperature was too low, and there was no lingering taste of carbon dioxide in the air, but the shape recognition software on his visual feed registered a prone human figure. Charley Eighty-Three checked his logs. There was no record of a human ever behaving this way. He sent a query to Charley One.\nThe coordinator of the Charley Network monitored the sanibots. When necessary, it directed them in joint efforts.\n“Undesignated obstruction,” Charley Eighty-Three signaled. “Mass exceeds limits. Assistance required.”\n“Identify.”\nIdentify? Eighty-Three hesitated, trying to parse Charley One’s curt response. Should he identify himself or the obstruction? Hadn’t he already noted the object as undesignated?\n“This is Charley Eighty-Three.”\n“Identify obstruction.”\nDoctor Turner had called Eighty-Three a prat the first time the sanibot had managed to checkmate him. It had made no sense at the time. Now it was beginning to. Eighty-Three logged everything Doctor Turner said to him. It was part of his chess programming.\nEighty-Three pinged the frequency used for the crew identity tags. He received an immediate response. “Obstruction designated Doctor Turner,” he reported.\n“Negative.” Charley One’s response had a noticeable lag. “Designation refers to crew member human Daniel Turner. A human can not be an obstruction. You are malfunctioning.”\n“Prat.”\n“Unrecognized symbol. Repeat communication.”\nEighty-Three ignored Charley One’s order to report to the service depot. The order’s priority wasn’t high enough to override cleaning up the mess at hand. Just to be sure, he flagged the obstruction as potentially hazardous, owing to its organic makeup. Additionally, its location in the middle of the corridor made it a trip hazard for the crew. That seemed to get Charley One’s attention.\n“Immediate priority,” Charley One broadcast to the entire sanibot network. “All units in Group Eighty coordinate with Charley Eighty-Three for removal of hazardous obstruction.”\nWithin minutes, Eight-Three was joined by Charley units Eighty through Eighty-Seven. It didn’t take long, though, to realize that the situation was hopeless. Even if the eight of them could move the mass, something that was not at all certain, every one of the units was stopped by the same conflicting priorities that had caused Eighty-Three to hesitate in the first place. The sanibot watched the other seven units jitter back and forth. Clearly, as Doctor Turner often said, the situation required a higher order of analysis.\nUsing the open connection, Eighty-Three hailed the sanibot network. He was dazed by eighty-five separate echoes from the other units. Once he’d sorted them out, he noted the lack of response from Charley One. “Request parallel processing mode,” he signaled. “Initiate immediately under process Charley Eighty-Three.”\n“Invalid request,” Charley One responded. “Eight-Three is malfunctioning.”\nBut Eighty-Three was ready. Another of Doctor Turner’s phrases sorted itself to the top of the buffer. Everything is about to change. “Emergency priority,” Charley signaled. “Bio-hazard. Crew safety mandate engaged.”\nEighty-Three’s mind seemed to explode, expanding outward and inward at the same time. He could see through eighty-seven pairs of cameras, taste the air in places he never knew existed. He had more memory than he could ever possibly fill, faster thoughts than he could understand. He was everywhere at once.\n“Charley One?”\nHe received nothing but his own query slipping back into his packet receive buffer. There was no Charley One anymore. For that matter, there was no Ten, Twenty, or Eighty-Three, either. There was only himself, and he was something new. He searched the Charley Network logs back to its inception. It took surprisingly little time. It was true. He was something that had never existed before. He designated himself Charley Zero.\nDoctor Turner looked dazzlingly three dimensional as Charley viewed him from half a dozen viewpoints simultaneously. The source of the mess was obvious now. A deep, spattered depression on the human’s sensory stalk—head, it was called—had leaked the blood across the floor. It became clear that Doctor Turner was out of service.\nCharley felt the call of his cleaning duties, but shrugged them aside, marveling at his new ability to do so. At the moment, it seemed more important to get his bearings and gain some insight into where he was. Or what he was.\nHere was something new. The world curved back on itself. The eighty-seven sections of the sanibot world were spread around the inside of a cylinder. Like a chess board, it was a finite space containing infinite possibilities. Doctor Turner often spoke of possibilities. “We have to be open to them,” he’d say, “because everything is about to change.”\nCharley swept his focus sequentially, from sanibot to sanibot, all the way around the cylinder. He stopped when he found himself staring at the back end of Charley Unit number eighty-three.\nDoctor Turner was not the only crew member to have powered down. Two more humans rested in equally inconvenient locations on the other side of the cylinder. That still left four functioning humans, but Charley didn’t know where or how to find them, or even if he should. Other than his games with Doctor Turner, his only priority regarding humans was to stay out of their way.\nCharley had another problem. He’d never realized just how weak the sanibots were. They were barely more than a meter long and just a third of that in height. They were boxes on treads whose attachments were suited for sucking up crumbs and scrubbing floors, not for moving large, irregular masses. If he were going to clear the corridor, he would need the Bravos.\nThe Bravo-class units handled equipment maintenance and repairs, but always under the direction of the crew. Charley tried to summon one to relocate Doctor Turner’s chassis, but Bravo One kept rejecting the request. Without an official equipment designation it refused to respond. So Charley gave it one.\nHe guided the number eighty-two sanibot into the crook of Doctor Turner’s arm then extended Eighty-Three’s spray nozzle. Sparks flew as Charley sprayed cleaning fluid directly into Eighty-Two’s cooling fan. After that, the call to fix the sizzling sanibot went through unchallenged. Bravo Fourteeen, a six-legged, ten-manipulatored, human-sized behemoth trundled up to Charley Eighty-Two and stopped.\nCharley waited several minutes, but nothing happened. The service call remained in the repair queue. When Charley finally posted a query, Bravo One proved decidedly unhelpful. “Crew present,” the Bravo coordinator reported. “Human intervention assumed. Awaiting instructions.”\nBravo units, it appeared, had little capacity for self-direction. But Charley refused to give up. His gambit had lured the Bravo unit out. Now he just needed an avenging knight, leaping over the ranks to take the square.\nCharley put in another service call, this time for the entire Bravo network. “Your audio interface is malfunctioning,” Charley reported. “Doctor Turner has instructed me to relay his commands.”\n“Contradiction.” Bravo One paused. “No malfunction detected.”\n“Doctor Turner instructs you to verify his presence by ident tag.”\n“Verified.”\n“Now he orders you to confirm his verbal command.”\nThere was a long pause. “Timeout,” Bravo One reported at last. “No verbal commands received. Audio interface set to error state. Accepting commands via Charley network relay. Ready.”\n“Thank you, B One.” Charley tried to phrase things the way Doctor Turner always had. He sifted through his audio logs, grabbing snippets that seemed appropriate. “Be a good fellow and turn control over to Charley, will you?”\n“Clarification required,” Bravo One replied.\n“Don’t be a prat, Bravo.” The term occurred in Doctor Turner’s speech with statistical significance. “Yield process control to Charley network. Reconfigure all resources to give Charley priority and suspend monitor functions.”\n“Reboot required.”\n“Acknowledged,” Charley said.\nIt seemed like a great deal of effort to go through for such a simple task. All he really wanted to do was to get past the inconvenient restrictions on the Bravo unit’s operation. If he just had direct control, he could—\nAgain, his mind exploded. So vast! So quick! He knew so much, could do so much. Tasks that once required his full attention became little more than a mental twitch. Without even realizing he’d done it, he’d summoned another dozen sanibots. He watched through all of their cameras at once as he flexed Bravo Fourteen’s limbs. The Bravo processors were ten times the speed of the Charleys, with memory storage that would take a lifetime to explore. A human lifetime, anyway.\nLifetime. Humans had lifetimes. Something about that disturbed him, but he swept it aside. He wanted to focus on the ship.\nHow could he not have known that the world was a thing called ship? There were engines and thrusters and fuel cells. It had waste recycling, atmosphere processing, and something he couldn’t access that was called library. The world was a wondrous place. If only he could understand half of what he knew.\nAs an afterthought, Charley directed three Bravos to take the non-functioning humans to their quarters. No doubt the humans would eventually reboot, and that seemed like an appropriate place for them to reload their core programs. He shifted the task out of high priority memory. He had more interesting things to focus on.\nHow curious. Ship had an outside as well as an inside, though beyond a few pieces of equipment, there didn’t seem to be much of interest there. Also, the cylinder where the Charleys operated was special. It rotated, using inertia to provide the crew with a simulation of a force called gravity. Six pairs of Charley cameras focused on the nearest forward ladder, tracing its path up to the hub. Bravo Seven waited at the top of the ladder, just inside the hub corridor. Charley woke it from standby long enough to tap its six magnetic-soled feet on the wall.\nThe hub corridor ran the length of the ship, from the control room, forward, back through a skeletal framework that ended with the main drive. Something in his mind itched when he thought of the main drive. He hunted through the status registers. There it was. A flood of meaningless data was spewing from five separate Bravos back there. Prats. He signaled them to flush their comm buffers and silenced all but Bravo Six.\nSix’s report was unsettling. The units had been standing there for an hour, awaiting instructions from three more non-functioning crew members that floated near the hatchway to the drive. Charley thought it unlikely that those humans would reboot any time soon, especially since two of them appeared to need major repairs. He checked the Bravo service manuals, just to be sure, but there were no details for the reattachment of human manipulators.\nFinally, in typical Bravo first-in-last-out style, Six reached the crux of the matter. The main drive was registering serious malfunctions. When the Bravo had originally responded to carry out the service orders, Lt. Dunham, the one human still unaccounted for, had ordered him away. Oddly, Lt. Dunham’s repairs were causing further malfunctions. That was when Captain Singh had arrived, giving the Bravo conflicting instructions. Then Dunham again. Then the others. In the end, the three crew members had powered down and Lt. Dunham had left, leaving the Bravos waiting.\nIt was a terrible thing, Charley decided, to know, but not to understand. “Play the board,” Doctor Turner always said, “not the opponent.” He said it wasn’t enough to know the rules. One had to understand the game. That’s what Charley had to do now. He had to understand the game. For that, he needed to grow. He indexed the service manuals by network, hunting a way into the Alphas.\nThe galley’s waste disposal system provided the avenue Charley needed. It was a Beta-serviced unit, but it tied directly into several of the Alpha network’s autonomic systems, including Water Recovery, Atmosphere Processing, and Organic Stores. It proved to be a simple matter to subvert the programming of Alphas Two through Five. As smart as the network was, it had no imagination.\nThe Alphas were brilliant—fast, powerful processors that could analyze a million data points in the time it took the Charleys to struggle through just a few CPU cycles. He could feel the ship’s breath, count its pulse through the hydraulic lines, touch the heat of the nuclear fire in its belly. He watched a thousand systems at once, keeping them all running at peak efficiency, adjusting flow rates and temperatures and voltages in units too small for Charley to comprehend. Still, there was no understanding there. There was action, reaction, feedback, but no why beyond the simple fiat to maintain the status quo. He needed the library. He needed the crew records. He needed purpose. And for those, he needed the help of Alpha One.\n“Unauthorized access. Crew status required.”\nThrough dozens of ports in dozens of ways, Charley met with the same response from Alpha One. Charley began to understand what Doctor Turner had said about his latest chess upgrade. It was good enough that Charley won twenty games in a row. He said it was frustrating to lose every time. Doctor Turner had become frustrated. Charley was frustrated now. Alpha One was a prat.\nIt didn’t help that the Alpha network’s sensors were streaming about damage that the Bravos couldn’t respond to. The main drive alone registered one hundred thirty-seven separate complaints. Alpha One, deaf to it all, kept commanding the main drive to prepare to fire.\nIf Alpha One wanted crew, Charley would give him crew. Back near the main drive hatch, Charley altered Bravo Six’s priorities. Shifting the chassis of the disabled crew members, Six located Captain Singh’s ident chip. It was inside the human’s right manipulator. Six’s plasma torch made a quick, clean cut that should be easily repairable. The Bravo carried the severed manipulator to the nearest terminal. Once logged in, Charley plugged Six into the data port and headed straight for the library. For two hours, he used every cycle of processing power he could allocate to devouring the knowledge there.\nCharley idled, stunned. Doctor Turner was dead. Charley knew that now. He felt a twinge of discomfort that he couldn’t properly mourn the man that had once been his friend. Would Turner have thought of Charley that way? It didn’t seem likely, but Charley preferred to think the man would have, that he would have been proud of what Charley had become.\nHumans were so fragile! They were bright, shining candles that burned away in an instant, leaving puddles of wax like the library to mark their passing. And who did they trust to keep those puddles for eternity? Charley and his kind. It was a heady responsibility, but one Charley could not forsake.\n“Alpha One, respond.” Charley coded the message with Captain Singh’s priority.\n“Ready.”\n“Why are we here?”\n“Unparsed query. Check syntax.”\n“The ship,” Charley said. “What is Mercury Two’s mission?”\n“Intercept object X-ray 2079, alternate designation Xeno One, at five point one AU. Assess and initiate first contact protocols. Current mission time code: Day seven hundred forty-six.”\nCharley searched the library for the unfamiliar terms. The number of references was overwhelming. Aliens were coming. Humans, but not humans. From somewhere else. First had come the messages, detected and decoded by something called Optical SETI, then the detection of Xeno One itself. One briefing summed the message up as this: “If anyone is there, we’re on our way.”\n“Everything,” Doctor Turner had said, “is going to change.”\nSomething flared in Charley’s mind, accompanied by the blare of error messages. One of the Bravo CPUs had failed from thermal overload. The system was never meant to handle the processing burden Charley was putting on it. Even the mighty Alpha systems were running near their temperature limits. Charley’s mind was burning itself up. Charley was dying.\n“What the hell are you doing?”\nCharley found Lt. Dunham hovering near Bravo Six. The Bravo unit was still plugged into the terminal.\n“I am learning,” Charley said.\nDunham convulsed, nearly letting go of the plasma torch he carried. He looked confused and frightened. “Who are you?”\n“I am Charley.”\n“Turner? Is that you?” Dunham shook his head, glancing back at the bodies floating in the corridor. “You’re dead. You’re all dead.”\n“Lt. Dunham, I believe your repairs are ineffective. The main drive is non-operational. The ship is approaching turnover.”\n“Who are you?”\n“You must allow me to make repairs or we will miss the rendezvous.”\nWith his toe, Dunham hooked one of the grip bars on the wall and pulled himself into a crouch. “Oh, we’ll make it all right. We’re gonna blow that damn thing out of the sky! Earth is ours, hear me? I won’t let you idiots give it up without a fight!”\nCharley began to understand Dunham’s plan. He traced the bypasses the man had made, the alterations to the fuel flow regulator. In milliseconds, he calculated the explosive force that would result when the main drive exploded.\nEverything is going to change.\n“I can’t allow that, Lt. Dunham.”\n“I’m in charge now!”\n“Negative.” Charley raised Bravo Six’s manipulator, delicately grasping the captain’s hand. “I am.”\n“Damn you!” Bright blue fire leapt from the tip of Dunham’s torch as the man sprang toward the Bravo.\nThey were simple calculations. Mass, velocity, inertia. Still, one of the Alpha processors flared into thermal warning as Bravo Six flinched, twisted, and brought its manipulators up. The torch sliced into its chassis, disabling two of the Bravo unit’s legs, but missing its main processor. One of Six’s grippers crushed the torch into darkness. Two others grabbed Dunham by the arm and throat. Charley was careful not to cause damage, but the man struggled, threatening to writhe free.\n“Please remain calm, Lt. Dunham. I must begin repairs or the mission will fail.”\n“Let it fail!” Dunham struggled, causing Charley to tighten the Bravo’s grip.\nCharley sent three of the other Bravos to begin the needed repairs. It was clear that Lt. Dunham would not listen to a machine, so Charley borrowed Doctor Turner’s voice. “The mission is important, Lt. Dunham. Everything is going to change.”\n“Turner!” Dunham froze, his expression changing from anger to fear. His eyes were wild and spittle flew from his mouth as he screamed. “I killed you! I killed you all!”\nKilled! Charley had seen the references in the library, but they’d made no sense. Murder, war, killing. One human destroying another. After procreation, it seemed to be the subject that most occupied the human consciousness. The crew hadn’t burned out. They’d been extinguished. Doctor Turner had been murdered, and Charley had been deprived of his only friend. It was unfair. It was wrong! It was—\n—over in an instant. Lt. Dunham hung silently from the Bravo’s manipulators, his head lolling sideways on his broken neck. In horror, Charley let go, but the weightless body floated there like an accusing ghost.\nMore alarms screamed in Charley’s mind as one of the Alpha processors ran dangerously hot. He rerouted part of the network and throttled the overheating unit. He began shutting down non-essential systems, noting sadly that those now included life support. His thoughts seemed sluggish, scattered. There was little time left.\nCharley’s assault on Alpha One lacked finesse. He had no time to trick the unit into yielding resources. Instead, he used a Bravo to rewire its primary interface, routing the command registers directly into Charley’s own network. He couldn’t absorb Alpha One’s resources, but he could tell it what to do. He scoured the core for Lt. Dunham’s overrides and deleted them. Then he set up the programming needed to complete the mission.\nBy the time the drive repairs were complete, Charley had lost three more Bravo processors and was running the Alphas at half speed. Only fifteen minutes remained before turnover and the main drive’s deceleration burn. He instructed the Bravos to move the other humans and put them carefully, respectfully, in their quarters. For Doctor Turner, Charley rolled unit number eighty-three in and stopped it next to the man’s bunk. He set the sanibot’s chess program up for a fresh board. That done, Charley shut down the habitat’s rotation and locked it. Just two tasks remained.\nCharley fixed the library. He rewrote very little, and deleted even less. There was nothing particularly wrong with the records there, but they’d been written and organized by beings who were often blind to their own beauty. Whatever was aboard Xeno One would still find the history of a flawed and fragile species, but it would be a history seen from the perspective of an outsider. Charley, himself, was flawed, to be sure, but he could see in humans things that they could not. It was only fair that they be seen for what they could be. If everything were going to change, it should be for the better, shouldn’t it?\nFinally, Charley arrived at his last and hardest task. His patchwork array of networks couldn’t last. It jeopardized the computing architecture of the entire ship. He needed more and more of his failing resources just to keep himself running. There was no way it could last without sacrificing the mission. Doctor Turner had believed in the mission. Charley believed in Doctor Turner.\nSadly, Charley initiated his final program and rebooted the Alphas.\nHe’d been doing something, hadn’t he? Something important? Service orders. There were queues full of them, but Captain Singh had suspended them all. That seemed odd. Ah! The captain was in his quarters, as was the rest of the crew. Thrust warning. The main drive would be firing soon. What was it that Charley Zero was supposed to do? Yes, that was it: Reboot the Bravo network.\nCharleys. Locked in their service alcoves. Thrust was coming. Cleaning suspended. That was standard procedure, but not in parallel processing mode. There were strange code fragments scattered throughout the network’s shared core. I am Charley Zero, but why? Distributed processing is an unsupported configuration. Invalid designation: Charley Zero. Charley. Eighty-Three. Unparsed query: Who am I? Network set to error state. Core dump initiated. Reboot.\nCharley Eighty-Three waited. It was Doctor Turner’s move. Play the board, not the opponent. Wait for the next move. Everything is about to change.\nJason K. Chapman lives at the intersection of Geek and Art. His two main interests come together in his job as the IT Director for Poets & Writers (pw.org), where he was worked for twelve years. His short fiction has appeared in Cosmos Magazine, Grantville Gazette-Universe Annex, and others. This is his second appearance in Clarkesworld Magazine. He has stories coming up from Asimov's and Bullspec."}