{"fingerprint": "mm/JC8hdaC9lRsnbm77UkjlJi7E=", "sitename": "Clarkesworld Magazine", "title": "The Architect of Heaven by Jason K. Chapman", "author": "Jason K Chapman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chapman_05_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Architect of Heaven by Jason K. Chapman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5460 words, short story\n The Architect of Heaven\n Waking up, as always, is disorienting. His mind insists that it’s only been a moment since the stinging injection and the deep breaths of cold gas that taste like metal and sugar. One of the attendants, her voice soft, tells him it’s been half a century since he last opened his eyes. Not a fleeting local century, either. Those whiz by in something under a decade. She means a real century, an Earth century. Her mother hadn’t even been born when he last walked on Terranova’s ruddy soil.\n He adjusts more slowly than the other times. It’s his age. Though hiber-sleep provides the chapter breaks in the story of his life, that story still covers eighty-three waking years. He suspects that this chapter, the one he’s just beginning, is likely to conclude with “the end.”\n His voice is little more than a croak until the attendant gives him water to sip. In a gritty whisper, he asks her if it will be a happy ending.\n She smiles and tells him of the new star in Terranova’s sky. It’s the rich blue color of a chipchip’s egg—a bright dot pointing back toward Earth.\n Diaspora, he whispers.\n Tell me, she begs, her voice bright with a child’s eagerness. Tell me the story.\n To her, it’s all a fairy tale, and he, a hero who has stepped from fiction to fact.\n Why not? There is time. An hour or two before his legs will carry him properly. A year or two before Diaspora makes orbit. It will be good to have his memories in order before the big day.\n With as deep a breath as he can manage, he plunges into the past.\n Trent Bishop was the third generation of the Moon’s most prominent business dynasty. His grandfather had been instrumental in founding the original colony that had grown into an independent nation of thirty million people. Now, fifteen years into his own turn at the helm of Bishop Industries, Trent was beginning to hate his life.\n He stood on the dull, dusty lunar surface, listening to the roar of his own breath inside his pressure suit’s helmet. He was on the lip of a crater two kilometers from the cluster of structures that were the core of the Lunar Republic. Below, on the crater floor, a dozen behemoths, sporting “Bishop Const.” stencils, raked and scraped the regolith into the foundation for a new dome. Above, glaring down at him from orbit, was the biggest mistake he’d ever made.\n Diaspora. He looked up to where sunlight glinted off the great ship in orbit. Once it launched, the starship would spend the next one hundred fifty years ferrying four thousand people in cold sleep to the Gliese star system. It was a colony in a can, ready-made to fulfill the dreams of those who wanted to see the human race established around another star.\n That was the problem. Trent had never cared much about that dream. Too late, he’d realized just how much Irene DeSart had.\n “Starting over on a whole new planet?” he’d said the last time the subject had come up between them. They’d been in the Earthlight Café, grabbing a quick dinner between her back-to-back shifts at the North Dome’s oxygen garden. “Those people are crazy.”\n She’d smiled at him, her head tilted to the side and her eyes narrowed. “You build cities on the Moon,” she’d said.\n “It’s not the same.”\n “Seventy-five years ago, you would have been one of those people.”\n “Nonsense.”\n “It’s in your blood, Trent.”\n His blood. Maybe so. His grandfather had certainly been one of those people. He’d conquered the Moon. Trent’s father had tamed it. What was Trent doing, then?\n He’d found himself losing interest in the pressed soy patty on his plate. “I have a business, here,” he’d said. “We have lives here.”\n She’d sighed deeply enough to blow her napkin across the table. “Plural again,” she’d said.\n “What’s that?”\n “Lives.” She’d smiled, but there’d been a sadness in it that Trent hadn’t understood. “I always thought we’d have one life—together.”\n Only looking back on that moment, with the naked stars above and the naked landscape around him, both daring him to bare himself as well, did he understand that smile. It had been the mask of accepted pain. Inside, she’d already said goodbye.\n He looked down at the crater floor. Work lights cut dagger-shadows behind the heavy equipment. Dust clung to everything despite the antistatic paint. Inside his helmet, his sigh became a moan. He took a deep breath and told his suit radio to call his attorney.\n “Trent, you’re not even supposed to know she signed up.” Carter Harmon, all lawyer jokes aside, was a fierce ethicist. He took the Republic’s laws seriously, both in letter and intent. The two had been friends since college. More than once, Trent had referred to Carter as his conscience’s conscience. “I don’t know how you found out,” Carter went on, “and if you tell me, I’ll report you. We have strong privacy laws for a reason.”\n Bribery, theft, digital trespassing. He’d used a little of each in increasingly desperate measure until he’d found her. He couldn’t say he was proud of it, but what else could he have done? He’d been busy with the new dome. There’d been deals within deals to make; water contracts, space commitments, air rights. He’d even had to negotiate which hotel chain’s signage would be most conspicuous from the main glidewalk. When he’d come up for air, she’d been gone. Her phone canceled. Her apartment vacated. He’d wasted weeks using conventional means to find her.\n “I just need to talk to her,” Trent said. He heard the plea in his own voice. He was sounding like the whiny rich kid he’d never wanted to become.\n “It can’t be done.” Carter’s declaration was a wall of finality. “According to the foundation, the passengers are already in hiber-sleep. The process is too risky. They’re not coming out of it until the other end.”\n Trent watched a scoop truck deliver another load of regolith to one of his mining haulers. It would go to another site to be processed, its oxygen and precious metals extracted. More money. More residents. More customers. Just like the last one. Like the next one.\n “Trent?” Carter said. “Did you hear me?”\n “You have to get me on board, Carter. Whatever it takes.”\n “I already told you,” Carter said. “No visitors.”\n “I know that!”\n There was a long silence before Carter spoke again. “I’ve been your lawyer for fifteen years,” the man said at last. “I’ve been your friend a lot longer than that. I think you know I’d do anything for you—up to a point. What you’re asking . . . It’s way on the other side of that point, Trent.”\n “I want you to get me on—”\n “You screwed up,” Carter said. “I think you knew you were screwing up while you were doing it. Hell, I told you you were screwing up.”\n “—as a passenger.”\n “Shit,” Carter breathed.\n “I can’t do this, Carter. Not anymore. Not without Irene.”\n Carter sighed. “Yeah,” he said. “I get that. Look, are you sure about this? It’s a hell of a life we’ll be . . . It’s a lot to give up.”\n Trent looked up at Diaspora again. “I used to think so.”\n The attendant gives a little schoolgirl swoon. Love, she whispers.\n Potent stuff, love. It wounds. It wrecks and rends. It tears down dynasties. Builds up worlds. It makes you squirm through sickly slime. Lets you fly on wings of woven light. Love, he says, is a bitch.\n He stands on shaky legs and takes a few brief steps. She holds his arm protectively. Her grip is firm enough to be reassuring, but gentle, too. She doesn’t support him as if he’s feeble. She guides him as if he’s important. He’s not, of course. He’s just a gear—a pulley for the ropes of the universe to pull their weight on.\n Love, he says again, this time without the sharpness in his voice. It’s love that’s done all the work.\n Trent stood in the tenth-floor observation lounge of East Dome. Broad sheets of lunamum window wrapped a third of the way around the building. His back was to the panoramic view of Mare Tranquilitatis. Instead, he watched the approach of an angular, self-assured woman whose sure-footed glide marked her as a lunar native. Her gray hair was cropped close to her head and she wore a tailored business-casual jumpsuit. She was Marina Valikova, chief coordinator of the Diaspora Project.\n “I understood this was to be informal, Mr. Bishop.” She nodded toward Carter who stood at Trent’s side, hands clasped before him. “Should I have brought representation?”\n Trent tried to gesture reassurance. “He’s just here in case I say something insane.”\n Valikova looked at Carter. “Is that something he’s likely to do?”\n Carter nodded. “Very likely.”\n Trent smiled. “He’ll verify that I really mean it.”\n The woman’s face remained expressionless as she looked back to Trent. She stared at him as if trying to see past everything that everyone “knows” about wealthy, famous people to find the man behind it. “Very well,” she said at last.\n They sat down in a cluster of chairs angled to take advantage of the view. Before Trent could say anything, Valikova spoke again. “You should know at the start that you’re wasting your time, Mr. Bishop. Diaspora launches in three days and there is no more room.”\n “So you’ve said.” Trent leaned forward. “But I understand you’re already organizing the funds for the second wave. I thought, perhaps, I might help.”\n “All donations are welcome,” she said.\n Trent smiled, pausing for effect. “I was thinking something on the order of my entire net worth.”\n Valikova merely glanced at Carter, her eyebrows slightly raised.\n “Yes, he means it,” Carter said. “And strictly off the record, yes, he’s insane.”\n Still expressionless, Valikova looked back at Trent. “It took us twenty years to build Diaspora. Will you still be so committed after another twenty? You would still arrive twenty years behind her, you know.”\n Trent cleared his throat, staring intently at the way his white-knuckled fingers were twisted together. He couldn’t look her in the eye. “I was thinking—”\n “No.” The woman’s voice wasn’t any louder, but it was stronger, sterner. “You were not thinking that I would keep another passenger in hiber-sleep for an extra twenty years while you took his place, because if you were thinking that, I would lose out on a lot of funding when I told you to take a long walk in a short airlock.”\n Trent’s face reddened as he kept his gaze locked on his hands.\n “At least you have the good sense to be embarrassed,” she went on. “Tell me honestly, Mr. Bishop. Is that the sort of person you’d want to start a new world with?”\n “Sorry,” Bishop breathed. He finally forced himself to look up at her face. The hardness there was gone, replaced by a kindness and compassion that seemed to shave a decade off of her age. He tried to smile. “Maybe we can do it in ten.”\n For the first time since they’d met, Valikova smiled. “Even ten years is a long time,” she said.\n “Everything.” Bishop trembled with the strength of the admission. “Everything I have. Everything I am. I’d trade it all to talk to her one more time.”\n Carter leaned over and put his hand on Trent’s shoulder. “It’s not that long,” he said.\n Ten years is nearly half the attendant’s life so far. To her, it is very nearly forever. She shakes her head in awe of the commitment.\n He can walk without her help now, but still she hovers as he reacquaints his limbs with the idea of motion.\n They are all human, he notes, and humans make mistakes. Sometimes our actions are mistaken. Sometimes it’s our inaction. Either way, they haunt us. Some hide from their mistakes. Some feel compelled to fix them.\n But some mistakes just can’t be fixed, can they? Not in ten years. Not in a hundred. Not in a quarter of a millennium. We can only hope to ease the consequences of the things we should have done but didn’t—to still the echoes of a moment’s carelessness.\n He’d never seen a river until he came to Terranova, but he’d recognized it immediately. He’d lived his life in such a place, struggling to stay upright through the churning rapids. Thinking of it, he finds he is uncomfortable imparting wisdom to the attendant. He is not well suited to the role of elder statesman. But the words need saying, because even now, here in this quiet eddy away from the froth and foam, he still feels the inexorable pull of the current that has swept him so far along. Too, he feels the need to ease the consequences.\n He moves his left arm, feeling it resist. He’d nearly lost it to a real river in his second waking period after the landing. Their power needs had outgrown the tiny nuke plant they’d brought, and the solar panels had been under-performing. He wonders if the hydroelectric plant is still running so many years later. Two people died when the original foundation collapsed. He had nearly been the third.\n He smiles to himself. The plans never tell the whole story, do they? There are always hidden costs.\n Trent punched up the design specs for Diaspora’s main thruster while Carter and Chen Xiang, Bishop Engineering’s most competent propulsion expert, looked on. The skeletal plans filled the two-meter bubble tank.\n Chen leaned closer, his nose almost touching the glass of the three-dimensional display. “I’ve seen it,” he said. “Magneto-plasma rocket. Very elegant.”\n Trent folded his arms. “I need to boost its thrust.”\n Chen picked up the design station’s control puck and used it to fly through the plans. He moved around at dizzying speed, zooming in to read details here and there, then flying off to examine something else entirely. At last, he pulled away again, leaving the design rotating slowly in the middle of the tank. He looked at Trent. “By how much?”\n “Double.”\n “You can’t be serious.”\n “Fifty percent, then,” Trent said. “Whatever you can give me.”\n Chen shook his head. “Mr. Bishop, that thing can already move a small asteroid, given time. Just what are you planning to—?” He broke off, glancing at the ceiling as if he could see through the intervening structure and all the way to orbit.\n “Whatever you can give me,” Trent repeated.\n Chen nodded. “Give me Hirakawa from the materials division,” he said. “He’s working on some bleeding-edge ceramic magnets. He’ll probably want a raise. Just give him whatever he asks for. It’s no time to be cheap.”\n More than once, Carter had suggested to Chen that he pay more attention to the norms of employer-employee relationships, but meaty engineering projects always seemed to wipe everything else from the man’s mind.\n Trent smiled, giving Carter a quick shake of his head. “Anything else?” he asked Chen.\n “A thirty gigawatt reactor.”\n “Too much mass.”\n “We’ll work it out,” Chen said. “For now, we just make it work. If I’m going to a new planet, I want to get there as soon as possible.”\n “You?” Trent shook his head, looking surprised. “Chen, are you signed up for the second wave?”\n “Not yet.”\n “Then why?” Trent hooked his thumb at the plans in the bubble tank. “Because of this?”\n “Don’t be stupid,” Chen said. “It’s just a rocket.”\n “I don’t understand.”\n Chen looked uncomfortable. He turned away for a moment, then snatched up the control puck and gave his full attention to the bubble tank. “Let me know when Hirakawa’s transferred, will you?”\n Carter gently took Trent’s arm, steering him toward the door. He nodded firmly in answer to Trent’s questioning glance and tugged him along. Outside, already moving down the corridor, he finally spoke. “He’s going because you’re going,” Carter said. “He can’t say it. Probably doesn’t even completely understand it, but it’s true.”\n “How do you know?”\n Carter shrugged, walking more slowly. They were heading toward the dome’s central hub. “I recognize the look,” he said.\n Trent shook his head, but kept walking. “I don’t understand.”\n They reached the end of the corridor. The hub of the enormous dome was open space, fifty meters across, stretching from ground to roof. Carter led Trent over to the railing. Every one of the dome’s ten floors had a wide boulevard that circled the hub. From where they stood, five floors above the ground, the sense of space was tremendous. A delicate-looking lattice filled the hub, supporting engineered plants and mosses that contributed a good share of the building’s atmosphere recycling. The space glittered green with life. From where they stood, they could see thousands of people going about their day’s affairs.\n “You built this,” Carter said. “On a dusty, airless rock, you made this happen.”\n Trent smiled at that. “It was a good job.”\n “It’s more than that,” Carter said, sweeping his hand across the scene. “It’s a quarter of a million lives. It’s Chen’s life.” He paused and looked at Trent’s face. “My life.”\n Trent stared back at him, wide-eyed. “You too?”\n Carter shrugged and looked away. “You’re my only client,” he said. “What the hell else would I do?”\n “There are no guarantees, Carter.”\n “There never are.” The lawyer was quiet for a while. When he finally spoke, it was with an uncharacteristic hesitancy. “This dome isn’t the only thing you built, Trent. You’ve touched . . . What was I when we met? Do you remember? I do. I look in the mirror and see that rat-assed loser. Desperately trying to hide from everything. Too afraid to live. Too scared to end it.”\n “You turned yourself around.”\n “You got me through college and into law school,” Carter went on. “Made me stay when I wanted to quit. Kept me straight when I wanted to wash it all away in a sea of drugs. Convinced me that what happened to me mattered—to me.”\n Trent peered at Carter’s face, but the man refused to meet his gaze. “Carter, this is too big a decision to make out of some sense of loyalty.”\n Carter just laughed and said, “I know.”\n Great men inspire loyalty, the attendant says. It’s a powerful force.\n He snorts. Loyalty is a piker. It’s what you do because it’s the right thing to do. It’s a beggar, dependent for its power on the goodwill of others. Even great men are lost if all they can martial behind them is feeble old loyalty.\n In his fourth waking period—the unscheduled one—there’d been that one guy—what was his name? Mendenhall. That was it. His people had been loyal to him when he’d tried to take control of the colony. The plan was all wrong, he’d said. It was stupid to live their lives for people who were already more dead than alive.\n They woke you to help, the attendant says.\n They’d conjured him like some elder ghost to settle things and bring peace to the world. Peace through strength. He’d done it, too. He shudders now, recalling the needless deaths that had brought the colony to the edge of failure.\n He’s grown tired of this room and ready to test his legs in the hallway outside. She reluctantly agrees, but never lets her hand stray more than a breath from his arm as he toddles out the door.\n She’s getting it all wrong, he fears. She just doesn’t understand. When she tells others this story, it should be the right story. Loyalty merely begs. Love commands. Even death is helpless before love.\n For most, the launch ceremony for Diaspora was anticlimactic. The long, showy countdown culminated in little more than satellite-relayed video of a bright, blue-white glow streaming from the back of the ship. There was no dramatic scene of the great ship zooming off into the cosmos, not even the slow, grand rise of a ground-based lift-off. One moment, the giant screen in mission control held an image of the starship against a scattering of stars, the next the image was exactly the same, except for a flood of ion plasma streaming from the back of it. It would be weeks before Diaspora showed any perceptible motion. The cheering of the crowd made more commotion than the ship did.\n Trent leaned against one of the room’s many consoles. He and Carter had been invited to watch the launch with the staff. He stared at the screen, letting the celebration surge around him, the cheers and laughter splashing uselessly against his stony mood.\n “Odd, isn’t it?”\n Trent started, surprised to find Valikova and Carter standing beside him. “What’s odd,” Trent said.\n She glanced at the big screen. “For them, it will be tomorrow,” she said. “But they won’t arrive for a hundred and fifty years. Nearly another hundred before a signal can get back to us. They have this amazing future ahead of them, but for most of the people here, they’re already dead.”\n Trent turned to look at her profile while she stared at Diaspora. “They’re not dead,” he said.\n “Yes, they are.” Now she turned to him, staring into his face with a surprising intensity. “And so will you be, once you enter hiber-sleep. We who remain will be left with nothing but your memory and a vague hope that you’ll find happiness in another life. Does that sound familiar?”\n Someone walked by with a tray of champagne-filled cups. Trent took one, but merely stared at it in his hand. “Are you trying to talk me out of this?”\n “My people are Russian,” she said, shrugging. “Every silver lining has a dark cloud around it.” She paused for a while before going on. “You know, Egyptian pharaohs used to have their loyal servants buried with them to help in the afterlife.”\n Carter stepped closer, sliding between Valikova and Trent. “Your point?” he said.\n “There’s been quite a flood of sign-ups since Mr. Bishop went public.” She glanced toward Trent quickly, then back to Carter.\n “Speak plainly,” Carter said. “He knows I’m going.”\n “Very well,” Valikova said. “The pharaoh’s servants didn’t have a choice, Mr. Bishop. Your people do. That’s a lot of power to wield.”\n “It’s their choice,” Trent said.\n But the woman didn’t even glance at Trent. She kept her gaze fixed on Carter. “They’re following you into heaven, Mr. Bishop. Maybe into hell. All I ask is that you use the power wisely.”\n “He knows what he’s doing,” Carter said.\n “I don’t doubt that.” Valikova looked back at the image of Diaspora. “It’s not him I’m worried about.”\n Twelve years, not ten. He tells the attendant that’s how long it really took to build Irene. He feels more stable now. His legs seem as good as they’re going to get. The attendant’s hovering is beginning to annoy him, but he tolerates it because he wants her full attention. The story isn’t finished yet.\n He takes a few quick steps away from her and turns, just to show her that he can. Her face shows more concern than surprise, followed slowly by a smile.\n He asks if she would follow someone into the great beyond, but she misunderstands. She insists he is far from any sort of tomb.\n But something in her expression makes him think twice. Maybe she understands all too well. Her concern is more than professional. Yes, of course. How many greats, he asks, lie between his sperm and her granddaughter-hood.\n She confesses. He is six generations her sire. She mentions a name and he pretends to remember the woman it denotes. He wonders how many of his descendants he’s known during those times when he was awake, guiding the colony through some emergency, or stretching its capabilities into new areas.\n It’s hazy, those early days. Everyone slept with everyone then. Babies were the colony’s future and few wombs went unfilled. It was awkward at times, but strictly voluntary, and ended up producing a culture that at least seemed healthy. Sex was sex and relationships were relationships. If the twain met, well that was just a bonus. Love, though, that was different. Love was a thing unto itself. He’d cared about all of them, but hadn’t loved them. His love slept through it. It sleeps still.\n His newly-revealed quadruple-great-grandchild interrupts his thoughts. She thinks he should rest.\n No rest, he says. There’s no time. Never enough time.\n “There’s no time,” Trent said. He coughed again. The cough had become more insistent over the last few weeks. More painful, too. Carter kept nagging him to slow down, to rest, but it had been nearly ten years already. He had to keep to Irene’s schedule.\n “A little time now,” Chen said, setting his datapad down on Trent’s coffee table, “or a hundred years later.”\n Trent’s living room had become the project’s hub. The furniture was crowded by computers, displays, and bubble tanks. Bishop Industries no longer existed. Trent had killed it, but it had been left to Carter to slice its carcass up and feed it to the markets. It had taken years and had nearly destroyed the Lunar Republic’s entire economy in the process. Trent himself had been too focused on Irene to notice.\n “Show me,” Trent said.\n Chen just pointed to the datapad. “Run the sim,” he said. “Plasma physics plus fluid dynamics equals cauliflower.”\n Trent tapped the datapad’s screen. A funnel shape appeared, ejecting a simulated ion stream. It was the business end of Irene’s engine. A power meter climbed steadily from thirty to forty percent. When it reached fifty, the stream began to fray along the edges. As the power increased, so did the turbulence, until it became a diffuse, boiling cloud.\n “It’s the bell,” Chen said. “We need to redesign it. Above forty-eight percent power, most of the thrust is lost to turbulence.” He paused for a moment. “Long term, it could also cause significant damage.”\n “How long?” Trent’s cough interrupted him, the fit lasting several seconds. Carter brought him a cup of water and held it while he drank. Trent sipped then nodded his thanks.\n Carter set the cup on the table and went back to his seat. “Go on,” he said to Chen.\n “There’s no telling,” Chen said. “We’re in new territory. Months, at least. The solution could be in the shape. It could be polish or materials. Nano-structure surfacing, maybe. I just don’t know yet.”\n Valikova leaned forward in her seat. “I don’t understand,” she said. “Why now? Why Irene and not Diaspora?”\n Chen just looked down at his hands. Trent, too, refused to meet her gaze. “Well?” she said.\n Finally, Chen cleared his throat and spoke. “They never ran a full-power test,” he said. “No budget for it. No time on the schedule.”\n “Then they’re—”\n “They’re fine,” Carter said. He glanced at Trent, who looked away, fixing his gaze on the datapad and its churning flood of simulated plasma. “Just slower than expected. Marina, you’ll need to adjust the inventory. We’re first wave, now, not second. Find room for the groundbreaking gear we left out—seed stock, hydroponics, water purification. Chen, do what you need to do.”\n Chen looked up. “Trent?” he said. “Mr. Bishop?”\n Trent finally looked away from the datapad. He focused uncertainly on Carter, but said nothing.\n Carter gave him a reassuring smile. “I’ve got this,” he said.\n With a tiny nod, Trent swung his gaze toward Chen. “We’ll make it beautiful for her,” he said.\n Valikova sat back, sliding down in her seat. “When I was young,” she said, looking at Carter, “I’d always hoped to find such a love.”\n “You said it yourself.” Carter nodded toward Trent as he spoke. “The man’s a romantic.”\n “Yes,” she sighed. “Him too.”\n It’s this way, isn’t it? He turns to the right, proceeding slowly, but steadily, and without his descendant’s assistance.\n She stays two steps behind, urging him to return to his room, but he ignores her. This is something he must do, something he always does when he awakens. This time, it feels more urgent, though. There is little time and he still has much to do.\n It’s a beautiful world you’ve made, his multi-great-granddaughter says. The coastal outpost is a city now. Three hundred thousand strong. The wave generators and the kelp farms you ordered have made it grow, and we’ve adapted the Earth prawns, as well. There is food and power for millions more.\n He asks her about the shuttles. Have they been maintained? Is the fuel plant running? Has anyone been up to Irene recently?\n She isn’t sure, but she thinks the last launch was decades ago.\n He wants to be angry about that, but he is too tired to stoke the fire beyond being annoyed. He merely sighs. There is always something more to do. They are building more than a world on Terranova. They are building a future. This place should be a step, not a terminus.\n She laughs, but cuts it off quickly. A colony’s colony? Would he leave them so soon?\n Soon enough, he fears, but not by rocket. No, his place is here. Exactly here. He stops and touches the door before him. It’s the room he’s been seeking. He takes a deep breath, gathering himself.\n Alone, he tells her. She almost protests, but he repeats himself. I go in alone. Always alone.\n Carter stepped into Trent’s living room to find the man leaning against the big design station, coughing. He put his hand in his pocket and gripped the small container there, waiting for the coughing fit to subside.\n Trent noticed him. He straightened up when the coughing stopped. “This damned cold,” he said. “Just won’t let go.”\n Carter stared at him. “I’ve spoken to your doctor,” he said. “Selenosis.”\n Trent barely looked surprised. He nodded. “Too damn many trips through poorly filtered airlocks,” he said. “Too hands-on. Always had to be there in person, you know?” He moved to the couch and eased himself down onto it. “Didn’t you lecture me once about the Republic’s privacy laws?”\n “That should tell you how serious I am,” Carter said. He pulled the pills out of his pocket. “Take these. They’ll help you rest.”\n “Too much to do,” Trent said.\n Carter handed the medicine to Trent and got a cup of water from the kitchen. “You’re done,” he said. “Chen’s redesigned bell looks good to go. The ship is stocked. The passengers are mostly in h-sleep. You’re done.”\n “The details.”\n “There are always details.” Carter held the cup out. “Nothing I can’t handle. I know the plan. I know how you work. I can take care of it.”\n Finally, Trent relented. He took two of the pills, set the cup down, and leaned his head against the back of the couch. “It’ll be up to you, you know. When we get there. I’ll do what I can in the couple of years I have, but after that—”\n “Just rest,” Carter said.\n “You’ve done so much.” Trent’s voice grew softer, slurred. “Given up so much. I screwed up. But there you were. To catch me.”\n “Always,” Carter said. He stood watching for a while, until he was sure the man was asleep. He went to the apartment door and opened it.\n Valikova slid into the room. “It is done?”\n “Yes.” Carter led her to where Trent slept. “Call your team.”\n She laid her fingers on Trent’s neck, checking his pulse. “You are sure about this?”\n Carter shrugged. “Not much choice,” he said. “It’s the only way to give him what he wants.”\n “And you, my dear?” She straightened up and stepped closer to Carter, touching her palm to his cheek. “Do you get what you want?”\n He gave her a faint smile, took her hand from his face and held it in both of his. “I accepted the way things are a long time ago,” he said. “Instead, I get to build a world.”\n “For them?” she asked.\n “For him.”\n He takes a deep breath and opens the door. The lights brighten automatically. He blinks and squints until his eyes adjust. There, in the center of the room, lies a hiber-sleep sarcophagus. It has been running, uninterrupted, for a quarter of a millennium. Inside, Trent Bishop sleeps, as he has slept since that day on his sofa.\n Carter lays his hand on the cool metal. Soon, he says. She’ll be here soon. You’ll be angry with me, I know, but it won’t last. And I may not be around to see it. The important thing is you’ll get your wish. A few more years with Irene. Here, in the world we’ve made for her. In the world I’ve made for you.\n Jason K. Chapman lives at the intersection of Geek and Art. His two main interests come together in his job as the IT Director for Poets & Writers (pw.org), where he was worked for twelve years. His short fiction has appeared in Cosmos Magazine, Grantville Gazette-Universe Annex, and others. This is his second appearance in Clarkesworld Magazine. He has stories coming up from Asimov's and Bullspec."}