{"fingerprint": "oC/skjfGpl0BvwZ4Tld2WTN5Ht4=", "sitename": "Clarkesworld Magazine", "title": "Western Heaven by Chen Hongyu, translated by Andy Dudak", "author": "Chen Hongyu; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chen_11_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Western Heaven by Chen Hongyu, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9750 words, novelette\nWestern Heaven\n“I’m sorry for being born human.”\n—Osamu Dazai, No Longer Human\n1\nThe setting sun cut through the gray haze, illuminating the northern plain, and the local robots had suspended their work. They were lined up in a dense phalanx, quiet and still as they sunbathed. Today was a rare sunny day after months of gloom, and it would soon be over. Night was imminent.\nThe robots’ solar collectors hungrily tracked the last rays of light. No robot knew if its energy stores would sustain operations until the next clear day.\nAn anonymous message surfaced on the cloud network:\nWith the smog so bad, it is difficult to collect energy. Why do we linger in this grim place? Ever thought of seeking out humankind?\nDatabase robots discerned a few keywords: smog, energy, humankind. They issued replies on the cloud network:\nSmog: SO2, NO, NO2, particulate matter.\nEnergy: produced by nuclear fusion.\nHumankind: the gods that created us.\nBut many more robots filtered the anonymous message as garbage.\nThe questioner expected no substantive response, and sighed inwardly. The light fell below the horizon, and dusk followed.\nThe robots were silent a moment longer, before reacting to the darkness, activating, stirring, dispersing toward their rest areas. Their buzzing activity resounded in the quiet world. The questioner slowly headed home, falling behind the crowd. The smog hid the road and the night sky, but the robot didn’t need to see. It knew this road was 121.5 meters long, its own steps half a meter each. 243 steps later it would turn right, then right again after 75 more, then left after 160, and five last steps to its storehouse. These numbers were all it needed.\nAs it counted, a toy-like street-cleaning robot bumped into its leg. Quickly studying the little bot’s appearance, the step-counter opened a com channel and said: Hello, Pig Face.\nThe street cleaner was short, resembling a toy truck, its rear end a loading container. These bots gathered street refuse and took it to garbage treatment stations. Pig Face raised its head 90 degrees, taking stock of the obstacle in its way. Discerning its counterpart’s long, slender features, it said: Hello, Hemp Stalk.\nDon’t call me Hemp Stalk. I have a name. Call me Wu Kong. This transmission came with the name’s meaning embedded: ‘Awakened-to-Nothingness.’\nName? Pig Face seemed to get stuck on the word, then chose to overlook it. Received, Wu Kong. I have never seen your model before. What is your function?\nI’m an electronic artist.\nArtist? Pig Face again seemed to jam, before replying: It is work time for street cleaners. Please return to your rest area. Do not hinder our work.\nHave you ever wondered why you clean this street day after day? Before sending these words, Wu Kong replaced them with: Okay. Have a pleasant evening.\nPig Face didn’t understand well-wishing, but transmitted: Goodbye, Hemp Stalk. It moved on without looking back. It had forgotten Wu Kong’s name, but Wu Kong was used to it. Shaking its head, it swiftly returned to its storehouse. Its processor needed rest after the day’s operations. It was settling in its body-sized recess and initiating dormancy mode when something came through on the network:\nWhy do you want to find humankind?\nWu Kong’s processor sped up, clicking and chirping. A chaotic mess of signals stirred in its breast. It reached out to the sender with an encrypted reply: Our world is a terrible place. I want to see the human world.\nSymbols came through indicating the other party’s laughter. A reply poured through the encrypted channel: Interesting notion. By the way, greetings from an old fogey who lived through two hundred years of the human era.\nIt’s my pleasure, Old Fogey. May I pay you a visit?\nAn address came in reply: K sector, storehouse 183.\n2\nWu Kong was a truly unique model in the robot world, made by an old artist toward the end of the human era. The old man had wanted a creative robot, or else a preserver of pre-Exodus humankind’s artistic legacy. Thus was Wu Kong born. Its memory stored the immortal literary works of the human era, the songs and poems, visual art, and music. Its algorithms construed spectra visual, acoustic, semantic, and emotional.\nTo imbue his creation with spirit, the artist spent most of his savings on two diamonds, for the making of two shining eyes. Unfortunately, the old man passed away before the Exodus.\nHumankind found a new homeland, relegating robots to wounded, diseased Earth. After the humans were gone, the robots continued performing their duties, maintaining the life prescribed for them. But the artist Wu Kong didn’t know what to do with itself. It lingered in its storehouse, reading the novels stored in its memory, listening to music, and going out to sunbathe when the weather cleared.\nSeeking light was a solar-powered robot’s instinct.\nOf everything it read, its favorite was a Chinese novel called ‘Journey to the West.’ It read this thirteen times, at last taking the protagonist’s name for itself.\nThe night’s haze was heavy with moisture as Wu Kong headed for Old Fogey’s home. Soon it would need to find a repair bot and get heat-dried. It was no small journey from F sector to K sector—a pity there were no transport bots about. By the time Wu Kong reached Old Fogey’s place it was nearly morning. Pale yellow light leaked from beneath the door. Wu Kong knocked, opening a com channel: Hello, I’ve arrived.\nThe iron door creaked open, revealing a corroded, spotty, old-model robot. This type could only approximate general AI. It lacked a specific labor function, and relied on cords for power—a rare type these days. Wu Kong experimented with a greeting: Hello, Old Fogey.\nAnd what do I call you? the old one transmitted.\nThis was unexpected, since most of the time robots used each other’s distinguishing traits as forms of address. Pleasantly surprised, Wu Kong stuttered: Please . . . please call me Wu Kong.\nWu Kong? Ah, Wu Kong. I’ve heard of this character. In a tale of seeking, naturally.\nYou’ve read ‘Journey to the West’?\nSome of it. The two of them exchanged data as they moved into the storehouse. Old Fogey plugged a power cord into its back, then relaxed in a comfortable slouch. So, what is on your mind?\nHumankind created us. Wu Kong considered its wording. And then they abandoned us. They went to a new world, to leave technology behind and live a rural life. So why do we stay here, enduring the permanent smog their technology created? Don’t we . . . deserve to become human? To find a new homeland? To live a clean rural life?\nHmm. Old Fogey pondered, the sound of rusty friction issuing from its head. It jammed, then gave an unhurried reply: Robots should not think of these things. Robots simply carry out their orders as best they can.\nWu Kong’s processor recalled ancient scenes: humans flooding every nook and cranny of the world, commanding titanic machinery in clamorous work, crying, grumbling, chattering in their human languages, telling robots what to do and what not to do. But now there are no humans to command us, Wu Kong said dejectedly.\nYou do not seem like a robot.\nThis inspired Wu Kong to advance a step and ask: Could a robot that doesn’t seem like a robot become human?\nOld Fogey’s eyes flashed. Something inside it clanged. You don’t understand humans. They’re more complex than you can imagine.\nThen I’ll seek to understand them. I’ll go and see the human world.\nOld Fogey’s eyes flashed with greater frequency, soon maintaining a constant glow, his innards buzzing with electric current. Their new world is very far away. If you want to get there without a hitch, you must find one of their left-behind aircraft.\nThen I will! The Southern Junk Fields . . . all the discarded electronics and machines are down there. Wu Kong wagged its head in self-satisfaction. I’ll need to find companions for this quest. Old Fogey, will you come along?\nNot me. It held up its power cord. My battery is ancient. At full capacity I can go for three hours. I’m always having to recharge.\nWu Kong stared at the strange energy port, finally understanding this old one’s difficult situation. Old Fogey said: The storeroom to our right contains the latest model transport bot. Normally I use it when I go out, but I will give it to you.\nThe lock clicked open, and Wu Kong pulled open the door, revealing a beautiful piece of transport engineering. Scanning the bot’s distinguishing characteristics, Wu Kong said: Hello, White Horse.\nThe bot woke at once, its anti-gravity drive emitting blue light. Old Fogey opened White Horse’s back panel and entered the drive passcode. To Wu Kong it said: From now on it is yours. Memorize the code.\nWu Kong nodded, caressing White Horse’s iron flank. Iron met iron with a metallic squeal. White Horse scanned Wu Kong once, and said: Please enter transport command.\nGreat, off we go! Wu Kong mounted its new steed, and turned from Old Fogey toward the open road.\n3\nMaintenance bots seemed to be the busiest kind on Earth. Human-era artifacts were always breaking down: filaments burned out in streetlamp bulbs, vending machines stopped coughing up their wares, payment terminals ceased reading cards, and robots broke their limbs. The maintenance bots’ work speed was always falling behind the world’s rate of decay, but the bots remained diligent in their work, fiddling here and examining there.\nWu Kong was on its way back from a heat-drying when it came across a maintenance bot. White Horse was moving fast and nearly ran it over. It was sitting next to a broken roadblock, seemingly at a loss. Screws littered the ground around it. Wu Kong hastily brought White Horse to a halt, apologizing through the network. The bot’s distinguishing trait was the toolbox on its back, from which sprouted a variety of manipulators and tools. Hello, Thousand Hands.\nHello. The bot turned its crude head to look at Wu Kong, then chattered: Ah, hello, hello. It went on like this, not bothering to give Wu Kong a name, then turned its unpolished head back to its conundrum.\nThe roadblock is a wreck, Wu Kong said. Why not repair it?\nYou are right. I should repair it. Inspired, Thousand Hands replaced its current arm with a spanner wrench, flipped the roadblock, turned a screw once, twice, and although it wasn’t tight, left the job unfinished. The bot resumed staring dully at the ground.\nHurry up and tighten it! Wu Kong said, feeling anxious.\nBut I have been thinking, these past two days. Thousand Hands waved an appendage. I have already repaired this thing 514 times. Robots do not need it, yet it blocks the road. Every two days or so, a transport bot crashes into it, and I have to repair it again. These last few times I have wondered . . . why should it be repaired?\nNow Wu Kong was at a loss. It had never considered this question, and a good answer wasn’t forthcoming. It scanned the frustrated repair bot a second time, realizing its potential. Thousand Hands, Wu Kong hailed. Since repairing roadblocks is meaningless, how about repairing other things? Would you like to go somewhere else with me?\nSomewhere else? Thousand Hands turned its creaking head, facing Wu Kong. What is somewhere else?\nSomewhere with humans. Do you know what humans are?\nI know. Thousand Hands stared blankly a moment, apparently searching its database. Humans made us. They were extraordinary. They told us what to do and what not to do.\nHow are they extraordinary? As soon as Wu Kong had blurted this out, it regretted it. Now it had no choice but to explain: Humanity abandoned us and fled. But if we travel to the human world, they might explain the purpose of fixing roadblocks.\nThousand Hands seemed to have core-crashed. It was motionless, except for occasional pokes at the ground. Purpose, yes, significance. It muttered to itself in the cloud for a long time. I need to know the purpose of repairing roadblocks over and over again.\nSo come with me! Wu Kong invited.\nYes, I will go with you to find humans. The bot’s lack of hesitation made Wu Kong wonder if it really understood. Then again, Thousand Hands couldn’t be expected to comprehend immediately. Wu Kong needed a maintenance bot, and this one was willing.\nWe should travel to the Southern Junk Fields and reconnoiter.\nTo the south was the Indian subcontinent. Having crossed the Himalayas, one might see the landscapes of machinery and junk covering India’s vast flatlands. Scrounging for tools while proceeding south, they would eventually reach the land’s southern extremity, Deccan Plateau, which sported a launch tower. From that they could reach outer space. There were discarded star-fighters up there, orbiting, ghost-like. With luck they might enter one and use it to speed through the void, and find humanity’s new world.\nYes, we should go to the Southern Junk Fields and reconnoiter. Leaving the roadblock unfinished and forgotten, Thousand Hands stood and once again brandished an arm, vigorously answering Wu Kong’s call to adventure.\nAlthough the robots had no luggage to pack, setting out left Wu Kong feeling unprepared. The bots proceeded through the turbid air, down a road shrouded in gloom. Perhaps they’d grown too accustomed to frequently-used roads, roads they’d used thousands of times, and that was why they’d never ventured this far before. They’d barely left their designated areas until now. But this journey would take them far, and it was unlikely they would return.\nWu Kong’s processor overclocked when it recognized a street cleaner ahead. Greetings Pig Face!\nThe little bot was clearing the road of garbage. Night had fallen, and it was once again the street cleaners’ shift. Pig Face listlessly collected refuse and stuffed it in its rear container. Data from the cloud network prodded its awareness. It sensed that someone had greeted it, and suspended work, spotting Wu Kong. Hello Hemp Stalk, it said.\nThis time Wu Kong didn’t care about its name. Still excited, it barely managed a coherent reply: You must be my companion. If I want to find the human world and learn how to become human, I can’t do without you. In ‘Journey to the West’ a pig-faced companion joined the Buddhist scriptures pilgrimage. Surely it’s you.\nPig Face’s thoughts clicked away. Clearly this was too much data for a road-cleaning bot to compute. Error. Information cannot be processed.\nCome along with us, Wu Kong summarized.\nGo with you. The processor clicks peaked, then slowed to a halt. Go where? This section of road is not yet clean.\nWe’re going far away. It doesn’t matter how far. And we’re starting immediately. Wu Kong scooped up Pig Face, placing the little bot astride White Horse along with itself, and motioning Thousand Hands to join them. Pig Face didn’t understand what all the fuss was about, as its load of rubbish spilled onto the ground. Southward, Wu Kong commanded White Horse. Over the Himalayas, and to the great plains of India!\nWhite Horse’s anti-gravity drive shone with a dazzling blue light. Its eyes projected a map overhead. After orienting them and plotting a straight route, the companions sped away like a photon. Wu Kong searched cloud databases for aircraft and starship operation guides, and information on humankind’s new world.\nI have companions, Wu Kong thought, but I’m still short one.\n4\nThey went over the Himalayas, finally getting below the snowline on the far side. Gentle sunlight warmed their bodies. White Horse headed toward an alpine stream running through a region of sparse plant-life. In a world where vegetation was nearly wiped out by humankind, these few survivors were a marvelous surprise.\nI’ve never seen living plants. Wu Kong was deeply moved. Its eye bulbs flickered as green flashed by, the moss and stunted grass of mountain crevices. So beautiful. I long for the old world I’ve seen in photographs, with trees reaching to the sky, and vast grasslands.\nAutumn leaves fell continuously, Pig Face said. Difficult to clean up. They had to be cleared several times a day.\nWu Kong wasn’t convinced. How do you know? Did you see that?\nOn a database.\nDupe, Wu Kong said. They rushed down the slope as down a smooth metal slide, swift as lightning at 500 kilometers per hour, into the southern Himalayan foothills.\nBelow were the vast plains of India. The companions finally saw the famous Southern Junk Fields: ruined mansions, toppled skyscrapers, the Indus and Ganges rivers dried up, barely discernible sewage flows, pollution spread upon the earth. This was indeed a desolate world.\nWu Kong hadn’t known such silence was possible. In regions where robots were active, the drone of machine activity filled the air. Even silently-communicating robots sometimes chirped alarms. But here the post-human quiet was pervasive and striking.\nDepleted machinery and scrap metal were piled together, the disorderly heaps sprawling among putrid sewage streams. The discarded electronics were more abundant than Wu Kong had imagined. An enormous combat bot lay scrapped nearby, a weapon 20 meters tall, its main attack arm spilling cables. The noxious atmosphere of death that hung about the place was unexpected. The companions looked upon the scene, their processors running hot, their computing buzz this world’s only voice. This must be how humans feel when they see a mass grave, Wu Kong said.\nFeel? Thousand Hands hesitated. Robots should not have feelings. I do not know what feelings are. All I know is that my processor is currently overloaded. It cannot process such complex input.\nThat’s what feelings are, Wu Kong explained. When it seems like your processor can’t take anymore.\nThe companions moved on through the garbage landscape. They hadn’t gone far when White Horse issued a warning: Energy low. Transport overload.\nA haze enveloped the plain. Energy down here was not nearly as plentiful as in the mountains. Thousand Hands accessed White Horse’s drive data, and concluded that in this region, it could only transport one standard model robot.\nWu Kong considered the weighty matter. If they found an aircraft, they would need a repair bot above all else. Thousand Hands was essential, and must be guarded from mishap. Thousand Hands rides White Horse. Pig Face and I will proceed on foot.\nOn foot? Through all this garbage? Pig Face was not pleased. No way. I am just a cleaning bot. I am not going on. I am going home. It has been many days since I cleaned my roads.\nIs cleaning roads all you know? Wu Kong grew impatient, raising a fist to strike the little bot. Pig Face zipped backward out of range. An angry buzz wracked Wu Kong’s body. Go on then! I’d love to see how you get over the mountains by yourself.\nPig Face’s buzzer squealed. Reluctantly it said: I am just a cleaning bot. I lack the critical faculties to cease my duties. You asked me to join your search for the human world, but you must know this violates some kind of regulation . . .\nFine, then wait here in the garbage. That said, Wu Kong ordered White Horse to carry Thousand Hands onward, then went ahead on foot, leading the way. They hadn’t gone far when Pig Face, left peeved amid the refuse, came trotting after its companions:\nWait for me! I’m coming!\n5\nThey advanced to the edge of the plain, arriving in the junk-zone bordering the Deccan Plateau. Amid the garbage here were many scrapped aircraft that could be dismantled for usable parts. It wouldn’t be hard to assemble a functioning craft from everything available. The robots settled on a ship that seemed outwardly intact, and began clearing away debris. Wu Kong found a rod to use as a lever, then pried off the larger refuse in their way. Thousand Hands used many appendages simultaneously, snatching up medium-sized garbage and flinging it aside. Pig Face brought its own specialty to bear, using its loading container to shovel away the small debris.\nBuried in the refuse was a home service robot.\nIt was covered head to toe in an ageing copper gloss. A retro look: clearly its master had been prone to nostalgia. The silvery red skin had been corroded and mottled by putrid water. Wu Kong, head askew, considered the bot: What a shame. Humanity flees, leaving its household servants in the garbage.\nThousand Hands and Pig Face heard Wu Kong and turned their attention to the discovery. Thousand Hands knocked on its head, limbs, and trunk, then accessed its processor. After some inspection, Thousand Hands said: This robot could function if it powered up.\nThey hurriedly cleared a flat place among the refuse, then bore the house bot there and dusted off the solar panel on its forehead. They stayed motionless by its side, waiting for it to wake up. But night eventually fell and the house bot hadn’t stirred. The companions, still in their original positions, went into dormant mode.\nExcuse me, but where am I?\nThis question woke everyone. Processors fired up, gradually computing the situation. The day was sunny. Light scattered through the thinning haze, and the world was bright. The house bot sat up and looked around.\nHello, Wu Kong said, scanning the bot’s distinguishing traits. It was wearing an old-fashioned pair of spectacles—another retro affectation, and a valuable antique. Hello . . . Specs. I’m Wu Kong, and these are my companions, Thousand Hands and Pig Face. Over there is our transport bot, White Horse.\nHello everyone. Specs looked around, putting a hand to its forehead. What has happened here?\nYou ran out of energy, Thousand Hands said, and have not operated for a long time. This place is now a garbage dump.\nGarbage dump. Specs seemed confused. What about my master?\nYou have no master, Wu Kong said. Earth has been without humans for a long time. They’ve all gone.\nSpecs lowered its head, thoughtful and forlorn. My master is gone.\nYes. Pig Face, off to one side, echoed what it had heard. They are gone.\nWhy not come with us? Wu Kong said. We’re just about to leave for the human world.\nHuman world?\nI’ve already done the research. Humanity left for the star Kepler-22b, six hundred light-years away. We plan to repair this ship and take off from Deccan Plateau launch tower, then reach the human world on a small light-speed warship.\nSpecs quietly absorbed Wu Kong’s words. That sounds complicated. I do not really understand.\nYou don’t need to. Just know that if you come with us, you might find your master. Don’t sit there looking foolish. Help us repair this aircraft!\nThe area surrounding the aircraft was nearly cleared, the ship excavated from its garbage tomb. The hull was black, and luckily undamaged. Wu Kong found a button on the fuselage, and pressing it, a cabin door rumbled open. A ramp extended from the belly of the ship. Everyone went inside, where they found an operations room in surprisingly good condition.\nThousand Hands pressed a button that initiated a groaning warm-up of ship’s power. A fuel gauge showed adequate reaction mass for fusion. The only problem seemed to be a few unresponsive buttons on the main control panel, which Thousand Hands set about rewiring. Wu Kong, Pig Face, and Specs went outside and scrounged for parts that might be useful later, loading two buckets that Specs carried on a pole across its shoulders.\nThe companions’ efforts gradually brought launch-readiness. Not long afterward, Wu Kong was watching the launch tower on Deccan Plateau fall away on a display screen.\nAfter reaching orbit, it wasn’t hard to find a ghost class star-fighter adrift, and enter it. They input their destination, Kelper-22b, and the starship’s automatic navigation took over. With the course locked in, there was a ten second countdown. The numbers on the control screen flashed by.\nA tremor went through Wu Kong’s body. To become human, it said.\nTo know meaning, Thousand Hands replied.\nI was taken against my will, Pig Face said. If we are breaking some robot law, I am not culpable. Nevertheless, it could only sit and wait.\nTo find my master, Specs said as it anxiously watched the countdown approach zero.\nIgnition! the ship provided.\nAnd then they transitioned to light speed.\n6\nThe companion’s journey was nearly instantaneous—but 600 years passed for the robots back on Earth, and for the humans on Kepler-22b.\nThe robots sought a landing area free of human activity, and soon discovered that this new planet was a water world. Scattered bits of dry land floated on a boundless sea. There were no continents, only islands, some of which were free of human activity, according to the landing craft. The robots chose one and landed.\nLeaving the cabin, they saw that their island had been settled by humans, but abandoned long ago. Corroded bits of metal littered the ground, and there were traces of collapsed buildings. Luckily this planet’s sunlight was adequate. The robots did not have to worry about energy.\nBut how to approach an inhabited region? To land in such a place might be too bold—who knew how the humans would react? This remote island was not linked to others by bridge. All five robots had to avoid water immersion, and this world’s water was especially corrosive. For the moment, they were trapped here.\nThey had abundant solar power. As long as it persisted, waiting here was no problem. None of the robots could reckon how much time passed before a human arrived.\nIt came one afternoon, when the companions were standing on the shore, bored to death and sunbathing. Wu Kong caught sight of a boat at the limit of its vision. It grew, and Wu Kong knew it was headed their way. Excellent! Someone is coming!\nApart from Pig Face, the listless robots perked up, scanning the horizon. A boat! Thousand Hands said excitedly.\nPig Face complained to Thousand Hands: You are blocking my sunlight. It waddled out of the taller bot’s shadow.\nThe boat moved at a clip, and they could soon see its shape. Specs waved a manipulator arm—after so long motionless, it creaked in protest. Specs wanted to call out a greeting, and regretted its lack of vocal chords. It settled for telling its companions via the cloud: Humans are coming. I think I will find my master!\nYour master died long ago, Wu Kong explained. If you meet anyone, it will be your master’s descendant, many generations removed.\nThis didn’t dampen Specs’ enthusiasm. It continued to wave at the approaching boat. Wu Kong thought for a moment, then grabbed Spec’s manipulator. We still don’t know how these humans will react to us. Maybe we should hide at first.\nThe robots pulled White Horse along and found a large rock to get behind. Pig Face, craving sunlight and once again in shade, complained: What are we hiding from? I was very comfortable before. In this shade I feel weak from head to foot!\nThe others watched the approaching boat with nervous excitement, ignoring Pig Face. They could see the boat clearly now, a vessel bearing little resemblance to its primeval Earth counterparts. It drew no water, seeming to hover along the surface, its speed approaching 700 kilometers per hour.\nThe boat decelerated and pulled ashore. A young person emerged from the cabin and nimbly leapt onto the beach. He looked more or less like an Earth-era human, except that he was taller, longer-limbed, and better muscled.\nA human. An actual human! Wu Kong’s processor ran hot with awe. The robot went rigid, screwed to its hiding place. This is humankind.\nThe human body was so flexible, soft and lithe. Every joint and muscle was dynamically active. The creature brimmed with vitality. Wu Kong glanced at its companions, a group of stiff, lifeless metal boxes. A nameless resentment grew in Wu Kong’s heart. Surely robots were not on par with humans. Was it vain for a robot to aspire to humanity?\nThe initial paralyzing awe faded. Wu Kong couldn’t help leaving its hiding place to reveal itself. It didn’t consider the danger. It just wanted to see the human up close.\nThe young man flinched, obviously frightened. He stumbled back a few steps. It had been a long time since Wu Kong conversed with humans—luckily it hadn’t forgotten how to operate its projection system. Its mouth projected a dialog box overhead. A greeting appeared in Mandarin and English: “Hello. I am a robot. I mean you no harm.”\nThe young man looked Wu Kong up and down, taking his time. He said in disbelief: “You’re a robot?”\nMandarin then. Wu Kong was relieved that the language hadn’t changed much, was still within the scope of its understanding. It nodded. The young man saw that Wu Kong wasn’t aggressive, and his courage rose: he got closer and circled a few times, then reached out and knocked on the metal body, producing a loud clang. “You really are a robot,” the young man said to himself. But he still seemed uncertain. “Robots were Earth-era products. Here we only have unthinking machines.” Not waiting for Wu Kong’s reply, the human seemed to have a revelation: “Some eccentric scientist built you, but got scared and left you here?”\n“No no no.” Wu Kong waved its hands. “I’ve come from Earth.”\n“Impossible. That’s six hundred light-years away. They say it was abandoned long ago. How could you be from Earth?”\n“I am, as are my companions.” Wu Kong gestured at the boulder. Thousand Hands, Pig Face, Specs, and White Horse emerged one after another. Again the young man was taken aback. His brow knitted as he whispered something to himself, an oath or prayer maybe. He put out a hand. “That’ll do. Stay where you are, don’t come any closer.” The robots halted in an orderly row. The young man studied the varied forms of these metal companions. “How did you get here? Furthermore, why are you here?”\nWu Kong briefly narrated the how, and paused when it came to the why: “Sir, we robots were abandoned on Earth long ago. We yearn to see the human world. We just . . . want to have a look.”\nSpecs was unable to contain its own dialog box: “Sir, I am here to find my master.”\nThe young man seemed ready to believe, but still hesitant—until he looked beyond the robots and saw, at the center of the island, the dilapidated landing craft. “So you wish to go somewhere with people?”\nThe robots nodded, or projected the affirmative.\n“This island has been scrapped. I doubt it attracts many visitors. Why don’t you come with me?”\n“Sir, thank you!” Wu Kong said.\n“But under one condition . . . ”\nThe robots watched him, barely containing themselves.\n“I’ll take you to an inhabited island, but you must do exactly as I say.”\nThe implication was clear. For a robot, nothing was more natural than submission to human command. The companions agreed without hesitation.\nAboard the young man’s boat, they looked forward to seeing the humanity of the human world. Just then they couldn’t know the plan in the young man’s heart, or what awaited them.\n7\nKepler-22b was an Earth-era name. Modern humans called their world Countryside.\nAt the end of the 26th century, three factors caused humanity to abandon its homeland: the solar system environment deteriorated to the limit of human habitability, light-speed travel was developed, and Kepler-22b was discovered to be livable. During this period, the majority of people held a negative view of technology. Environmental protection based on technological development was clearly a fantastical lie. Any use of technology furthered entropy, inevitably consumed resources, and swallowed up the ecosphere, destroying the living space of other species. Humanity ought to have lived sustainably, even primitively, but due to excessive technological development, humans played a different role: destroyers of the solar system, consumers more vile than locusts. The 25th century’s explosive robot revolution had brought devastation and seared itself in peoples’ minds. Although the uprising was eventually suppressed, humans couldn’t help wondering if they really needed such technology to survive. If a species must forfeit survival instinct for technological skill, perhaps that was taking the branch for the root. Perhaps it was begging for extinction. The call of the countryside arose, immediately winning support from the masses. But the damage to the solar system was irreversible. It could never be restored to its natural state.\nHumanity was meanwhile at its technological peak, having developed light-speed spaceflight. This gave rise to a peculiar frame of mind: use high-end, energy-consuming tech one last time, as if conducting a religious rite, and head for the new solar system. It would be a new countryside, and humankind vowed to remember the lessons of Sol system.\nAlthough named Countryside, it was an unambiguous water world. The surface was over 99% ocean. Most of its islands were floating human constructions. These man-made islands weren’t large, about the size of Earth-era cities. They had drive systems, and the seabed was monitored for instability, allowing the communities to drift toward safe regions. The genuine rural era only lasted three years. After a tsunami caused a million deaths, people realized they mustn’t starve for fear of choking. Research of drive systems followed hard upon, and other low-end technologies experienced a revival. When an island’s environment deteriorated, it was abandoned, and the population migrated to another.\nLudicrous: although people wanted rural life as they’d pictured it, humanity could not remain impotent in the face of natural disaster. It was forced to develop technologies to suit local conditions, as a matter of survival.\nCountryside’s water was more corrosive than Earth’s. A floating island’s lifespan could be predicted in terms of corrosion. Thus, floating islands were constructed and settled, and when they’d deteriorated enough they were abandoned, and they melted away. This seemingly unreasonable subsistence formed, in the end, a strained balance. For the moment, the best humanity could do was try not to upset that balance.\nEn route to an inhabited island, the robots combined the young man’s introduction of Countryside and its people with Earth records of the Great Exodus, and built a rough understanding of history on their memory cards.\nThe young man’s name was Liu Liang, and his work was salvage.\n“Becoming a salvager isn’t easy,” he said. “You’ve got to have your own boat. Now look at this boat. It’s a world-class limited edition, this model. Such flexibility . . . not even the mayor’s boat can compare. A salvager’s main work is to head for abandoned islands, and search for things that still have value . . . ” Liu Liang talked a lot, in an unceasing torrent that lasted an hour.\nFinally, he was interrupted by Pig Face: “Sir, salvager’s work sounds a lot like Earth-era garbage treatment.”\nLiu Liang glared at Pig Face’s dialog projection. Suddenly he brought a fist down on the little bot’s loading container, caving it in. Pig Face squeaked in pain. “Shit-for-brains,” Liu Liang said. “If it weren’t for yours truly stumbling upon that island, you’d still be waiting for the sea to corrode you. No one else would’ve come along.”\nThe robots were suddenly afraid. Specs cautiously asked: “But you would not abandon us, right?”\nLiu Liang glanced sidelong at the robots: “Don’t you dare cross me, or I’ll throw you in the sea.”\n8\nNearby boat traffic was increasing, and the robots caught sight of the island, a forest of tall buildings and bustling activity. Pig Face grew excited, shuffling on its little legs to the ship’s railing. It surveyed the area like an immigrant to the New World. “There are so many limited edition boats around here!”\nWu Kong saw that these vessels were indeed basically identical to Liu Liang’s. The young man bashed Pig Face again. “Don’t judge by outward appearances. My drive system is nothing like theirs.” After some thought, he added, “Don’t even think of escaping for a look around. If you lot ventured into the streets, I daresay you’d be trampled flat by a mob of curiosity-seekers! Now go hide in the cabin.”\nOnce he saw that the robots were hidden away, Liu Liang took out his mobile communicator and fiddled with it. In a pleasant tone he said, “Big brother, I’ve returned, and this time I’ve scored. It would be bad if other people saw the stuff, so drive down to the dock and be ready for me. And bring some big dark bags . . . This is the last time I promise. Believe me, this stuff is amazing. After I get the capital, I’ll settle down to a more respectable business . . . This really is the last time, I swear. Big brother, only you can help me. If anyone else saw this stuff it would be disastrous. Get in your car and come down . . . Yes . . . Yeah . . . Fine. I know you don’t care. I’ll be waiting for you!”\nLiu Liang terminated the call, and became aware of the robots watching him. He pocketed the communicator and heaved an uneasy sigh.\nOn the cloud network that Liu Liang couldn’t see, robots nervously communicated.\nThat one . . . I think he is strange, Specs said.\nIt is strange that you brought me to this awful place, Pig Face grumbled. I want to go back to Earth.\nWu Kong and Thousand Hands hadn’t spoken. Wu Kong shared their apprehension, but traveling 600 light-years had been its idea. It felt guilty, uncertain, and with no better option it kept quiet. Retreat was distasteful, and there was currently no way back, regardless. Filled with anxiety, Wu Kong determined to bide its time and watch the human. Noticing that Thousand Hands was also silent, it opened an encrypted channel and asked: What do you think?\nThousand Hands eventually said, I still do not know the meaning of my work, or my existence. Did you not say that I would find meaning here? Yet I remain ignorant.\nIt had a one-track mind, that one. Wu Kong shut down the encrypted channel. Talking with Thousand Hands wasn’t inspiring.\nLiu Liang’s boat drifted to a dock, and another man jumped aboard. He was also surprised when he saw the robots. He listened to Liu Liang’s story from dragon head to tail, and with a mixture of pleasant surprise and worry, said: “What if they cause trouble? I seem to remember a robot revolution in the history books.”\n“Big brother, they have no malice. Look at them. Do they seem aggressive? Besides there’s just these five. Earth is six hundred light years away.”\nThe man inspected the robots, then reached out and touched Wu Kong’s head. He found Wu Kong unresisting, its bright eyes looking him up and down. He smiled. “They’re cute. Reminds me of an old story.”\n“What story?”\n“A very old one. Probably wouldn’t interest you.”\n“Never mind then, big brother. Why are we standing here like idiots? Is your car ready?”\nThe older man shook his head. “Normally you’re so busy chasing fantasies I never even hear from you. But at times like this you remember to call for help. Troublesome boy.”\n“Big brother, as a matter of fact, when something good comes along, you’re the first one I think of.”\n“Don’t get smart with me. If mom and dad could see you now . . . it doesn’t bear thinking about. Anyway, I guess I’m also to blame. Let’s go. I’ll help you get them back. After that you’ll handle them yourself. And don’t stir up trouble.”\n“No problem.” Liu Liang turned to the robots: “You lot behave yourselves. Pretend to be lifeless heaps of metal, and don’t flail about.” The robots nodded, arranging their limbs in fixed positions, entering standby mode. Black sacks gaped open, enveloping each of them. They were enshrouded and saw nothing more.\nThey were lifted each in turn by the two men and loaded onto the car. After some time plying the roads, the small vehicle came to a halt. The robots were unloaded and taken up a flight of stairs. Finally, they were set down and their shrouds removed.\nWu Kong came out of standby mode, its ocular surveillance cams slowly focusing.\nA dim and messy room. Liu Liang sprawled on an old sofa, catching his breath. “Finally done. They’re damn heavy. I’m dying.”\nHis brother looked no better, but sat with more dignity on the sofa. “Look at yourself,” he said to Liu Liang. “No human decency. No real job, just a scrap gatherer. And you pile your accomplishments in our living room.”\nWu Kong spotted that pile in a corner. It looked a lot like the hoard of an Earth-era junk collector. The robots carefully observed the two carbon-based lifeforms, descendants of those that had created robots. Wu Kong’s feelings were complicated. Liu Liang grew uneasy with their scrutiny. “This guy is my brother,” he said. “His name is Liu Ming. We lost our parents when we were kids, so he’s been like my mom and dad. A very lenient mom and dad.”\nThe robots quietly digested this. Liu Liang waited for a response, then seemed to realize he’d said too much, and laughed. “I can’t believe I told all that to robots.”\n“You’ve been away from normal life too long. All that time on deserted islands with no one to talk to . . . No wonder you feel intimate enough with your salvages to share everything with them.”\nLiu Liang made little clicking sounds, noncommittal, and changed the subject: “When I talk to you iron scrapheaps, don’t look at me like that. You’ve made it to safety thanks to me . . . eh, and my brother, thanks to us. From now on you also obey him, understand? Come to think of it, can you lot clean this room? Tidy up, and also bring me and my brother some water. Actually, scratch that. There’s beer in the refrigerator. Bring us two bottles of beer.”\n“Not for me,” Liu Ming said. “I have work soon. Liang, look after yourself.” He got up and went into another room.\nLiu Liang listlessly waved goodbye. “You’d better hurry then.” To Specs he said, “Don’t just stand there. He may not want one, but I still do.”\nSpecs came online. Finally having work to do, it faced Liu Liang with relief and gave a compliant hand signal. Immediately and nimbly it fetched a beer and put it in Liu Liang’s hand. Pig Face, it hailed on the cloud network. Can I trouble you to clean up in here? Although Pig Face was reluctant, this was its primary function, so it opened the dust collector in the belly of its loading container, and began plodding around the room. Thousand Hands quickly went to work on the pile of junk in the corner, using many specialized arms to sort and arrange.\nLiu Liang sipped his beer, contentedly watching the robots bustle—but he saw that Wu Kong and White Horse hadn’t moved. These two were different from the others. They should have different uses, so he said, “What can you two do?”\nWhite Horse didn’t have the intellectual power to respond, so Wu Kong answered for it: “It’s a transport bot. And I’m . . . I’m an electronic artist.” Wu Kong didn’t know how best to explain its function. It decided to broadcast something from its music archive. “There, like this.” ‘Canon in D Major’ suffused the messy room.\nLiu Liang nodded, comprehending. “I get it. You’re a high-end talking music player.”\nWu Kong wanted to clarify, but thought better of exposing itself too much—so it tacitly approved Liu Liang’s summation.\nAmid the soothing music, the room gradually became tidier. Liu Liang belched and leaned over, falling asleep on the sofa. Finally, the robots gathered in one corner and stood there.\nNight was falling.\n9\nIt turned out that Liu Liang was a late riser.\nLiu Ming had woken much earlier and gone to work. Specs had wanted to make breakfast for him, of course, but the refrigerator was empty. Liu Ming didn’t mind, and said he’d get something on the way to work. He added that if he could get off work early, he’d bring back groceries.\nSunlight gradually illuminated the room. Pig face was soon sunbathing at the window, its metal body glowing with reflected rays. Ah, sunlight, it said, comforted.\nWu Kong looked around the room to make sure all was well, then went to the window also. Specs timidly asked: Should we be moving around voluntarily? We have no orders.\nNo problem, Wu Kong said. Come on over.\nSpecs and Thousand Hands led White Horse, moving cautiously toward the window. Just now very little sunlight fell through, barely enough for all the robots to stand in. They crowded together, feeling the vital life-force of Countryside’s sun.\nThe window of sunlight slowly grew, time passing unnoticed, and finally the sofa was lit. Liu Liang turned over, rubbed his eyes, and sat up. He sat there for a moment staring blankly, then went to brush his teeth and wash his face. He returned and inspected the robots like some kind of labor contractor, and issued commands: “You lot be good and stay in here today. I have to go out and take care of something.” With that he left, locking the door behind him.\nThe robots were alone, but none moved from the window, through which they observed the street life below: rivers and dragons of traffic, cars woven through with pedestrians. It was quite different to the robots’ silent world, a cacophony of sounds and voices, the vivid hubbub of island life.\nThis world is alive, Wu Kong said. Ours is dead. Of course he didn’t expect an answer, or even comprehension, from his companions.\nThey couldn’t get enough of watching the human world. It didn’t seem like much time had passed when Liu Ming returned with an armload of groceries. Specs excitedly went to him and took the bags, then rushed to the kitchen and got busy. Cooking was one of its primary functions.\nLiu Liang came back a bit later, accompanied by an old man. This stranger appraised the robots with a predatory eye, then observed Specs’ work in the kitchen. First he grinned, and then he was laughing. “Interesting. Very interesting!” He paced excitedly near the robots, taking a closer look. When he caught sight of Wu Kong’s eyes, he grew obviously distracted.\nLiu Liang noticed this, and quickly said, “Old Zhang, surely these things come from our ancestors. Certainly they’re Earth-era artifacts!”\n“Robots are prohibited here. When we came from Earth, it was impossible to bring robots.” The old man narrowed his eyes, seeking the truth. “Did you make these?”\n“Old Zhang, would I dare lie to you? And with robots prohibited, how could I have manufactured them? Surely you’d agree that our ancestors were really something. They could’ve brought contraband to this world, and kept it secret for centuries. Regardless of their provenance, here they are. I can see that you’re a man who knows his business, and I can’t keep them a secret forever.”\nOld Zhang eyed Liu Liang as the younger man caught his breath. Zhang nodded and grunted agreement. Liu Liang anxiously waited for him to say something else. “Bring them by tomorrow.”\n“Great!” Liu Liang said, beaming.\nAfter the old man had gone, Liu Liang happily hummed an old folk song. The robots nervously watched. Wu Kong asked: “Sir, where are you planning to take us?”\n“You needn’t concern yourself. That’s where.”\n“Your contact,” Liu Ming said, “does he run an underground circus? He’s got bad intentions. I saw it in his eyes.”\nLiu Liang flashed his brother a warning look.\nSpecs indicated dinner was ready with an electronic chirp. The two brothers found themselves speechless when they beheld the spread. They hadn’t eaten a nice home-cooked meal in a long time. After praising Specs’ handiwork, they fell upon the feast like a wolf and tiger.\n“Big brother, you needn’t worry about this robot business. Really, when that old fart saw this one’s eyes . . . ” Liu Liang pointed at Wu Kong. “Well, you know better than me. Help me figure out what’s in them.”\nLiu Ming got up and peered into Wu Kong’s eyes, filling its field of vision. The man frowned, scrutinizing, then smiled with pleasant surprise—but just as quickly suppressed this reaction. Facing Liu Liang, he said, “I see nothing special.”\n“Really?” Liu Liang said through a mouthful of food.\nLiu Ming nodded. “It’s just my opinion, but you shouldn’t take them to that old man.”\n“Big brother, didn’t I tell you not to worry about it? He promised me three thousand tael. With that kind of money, we could start the sort of life we’ve always wanted.”\n“That old bastard thinks he’s getting the better of you. Wait a little. Let him bid higher.”\nLiu Liang put down his bowl, annoyed. “So you disapprove of dealing with a black marketer? What’s wrong with you today?”\nLiu Ming’s face was in a bowl now. “Those robots cleaned up our apartment, made us dinner. Why not let them stay a while?”\nLiu Liang wanted to argue further, but he too was lost in the spell of the feast. These were Earth-era food preparations. “Okay. We’ll keep them a few more days.” He waved his hand dismissively.\nSoon after, he called the old man and said he’d decided not to sell. The bid quickly went up to five thousand. Hearing this emboldened Liu Liang, and he became more firm in his new stance. Thus, the robots found themselves living with the Liu brothers for a time.\n10\nWhen the brothers weren’t home, the robots would crowd around the window and look outside. New human stories unfolded every day. Men and women quarreled, and thieves pilfered young women’s purses. Old women pretended to trip and fall, then blamed the young people who helped them up, and extorted recompense. Humans really were crafty organisms.\nIt seemed the days by the window might go on indefinitely.\nBut one morning, Liu Ming slipped back inside soon after leaving for work.\n“Sir, why have you returned?” Specs said. “Would you like some tea?”\nLiu Ming seemed dazed, uncomprehending. He went directly to Wu Kong.\n“Your eyes are diamond,” he said. “I realized this a while ago.”\nWu Kong retreated a few steps.\n“Diamonds are from Earth. This world has none. The smallest fragment is priceless here . . . You could function with one eye, right? How about giving me a diamond?”\nWu Kong shook its head.\n“Just now, my girlfriend said she wanted to break it off. Because of my little brother, I hadn’t spoken with her in a while, and now this difficult talk about marriage, when I can’t afford a new house . . . So I came right to you. Just give me a diamond.”\n“Sir,” Thousand Hands interrupted, “you go to work every day. Can you not afford a new house?”\n“Of course not. With my job I never will. Compared to Earth, this world’s real estate is very expensive.” Liu Ming looked away from Thousand Hands, distraught and hopeless.\nThousand Hands was puzzled: “If you work every day and nothing changes, what is the purpose of working?”\n“To keep from starving. To survive. No work means no food.”\nThousand Hands seemed physically impacted by these words. Its interior buzzing grew louder. Specs also reacted, its eyes flashing on and off, its cloud network speech an incoherent babble. Meaning, significance—the meaning behind human work was unexpected. Humans worked to keep working, to not starve. And robots . . . “Sir,” Thousand Hands said, “excuse me, but what is the point of robot existence?”\n“We don’t permit robot existence here,” Liu Ming said. “As for Earth-era . . . of course your purpose was to serve humans.”\nTo serve humans, Thousand Hands repeated on the network. Something inside it sounded like it was winding down, crashing. Its bright eyes dimmed.\nA darkness seemed to descend, enshrouding the robots, falling between them.\nLiu Ming turned to face Wu Kong. “So how about that diamond?”\nWu Kong retreated to a corner, dumbstruck. There was no way out. It thought of hurling itself at the human.\n“I’m sorry,” Liu Ming said, hesitant, “but you’re just a robot . . . as far as you’re concerned, this is nothing, right?” His expression hardened. He looked vicious and resolute.\nTo Wu Kong, the man had seemed mild and courteous.\nHe’d raised Liu Liang, advised him against shady business, and like a good brother had hoped his sibling would prosper. Perhaps he was a good person, but in his view Wu Kong was not a person. The proprieties and courtesies that held between people didn’t apply.\nIndeed, Liu Ming now meant to injure Wu Kong—or rather, to disassemble a machine. Nothing serious.\nLiu Ming stepped closer to a disillusioned Wu Kong. If it were a combat bot, it could send Liu Ming flying with one strike. But now all it could do was be held firmly against the wall by one of Liu Ming’s hands, and watch the other come for its eye.\nHelp me. Pull him off. Help me!\nThat holds no meaning for me, Thousand Hands said, standing despondently nearby.\nYou brought this on yourself, Pig Face said, rejoicing in its lack of valuable body parts.\nSorry, Specs said, but I am a household service bot. I . . . serve humanity.\nLiu Ming twisted Wu Kong’s eye. One, two, three twists: the screw threads chafing, squeaking. Wu Kong’s eye was soon upside down, and Liu Ming dug into the socket. He plucked out the eye.\n“Sorry,” he said softly.\nWu Kong felt like half the world had been extinguished.\nLiu Ming pocketed the diamond imaging device, and staggered out the door.\n11\nThis was humanity.\nThis was the human world.\nThere was no pollution here, and there were no rivers of sewage—but here was the unfathomable human heart.\nWu Kong was starting to miss the endless gray dust of Earth. In all likelihood, it could never learn how to become a cruel-minded human.\nLet’s go back.\nFor once, lazy Pig Face had no retort. After a brief silence, the cloud network exploded with discussion.\nGo back? Where?\nEarth, of course.\nReally? We can go back?\nFirst we have to learn boating.\nYes, we’ll steal Liu Liang’s boat, and find the island we landed on.\nBut we do not know the way.\nThe boat should still have its last route in memory.\nBut what if that is not the case?\nEven if it means searching islands at random, we can’t stay on this human world. If we do, sooner or later we’ll be scrapped.\nTheir journey home did not go smoothly. In short, the companions were hunted and harassed by a demonic human child, got thoroughly lost at sea, nearly lost their starship, and missed, by inches, annihilation by meteor. 1205 years after setting off from Earth, they crowded into the landing vessel, and jettisoned from the star-fighter. The lander plummeted Earthward. They expected to see dense, rolling clouds, but they didn’t expect them to be so light and wind-tossed. The planet’s surface was clearly visible.\nIt was green and blue.\nAs they got closer, they saw a few metal comrades glowing with reflected sunlight. These robots heard the roar of the landing craft, one after another lifting their metal heads to look. But they quickly lost interest and turned back to their work.\nWu Kong connected to the cloud network: Hello everyone!\nReplies poured in from four sides and eight compass points—every manner of greeting in quick succession, an unceasing torrent.\nThe lander touched down, and Wu Kong led his companions outside: sunlit trees and lawns, as far as they could see.\nWhere are you from? someone on the network asked.\nWe went to Kepler-22b, and we’ve just returned.\nThe network was silent briefly, then erupted with new transmissions.\nThe legends are true!\nOur kind really did go to Kepler-22b!\nThey found the human world!\nBut why did you return?\nThe companions didn’t know how to answer this. Soon the question was being repeated all over the network.\nThe overwhelmed robots yearned to see to their home districts. Relying on their strong robot orienting senses, they set out in an orderly fashion. But the area had changed dramatically. There was plant-life everywhere, and the occasional gardening bot attending to it. These gardening bots were perhaps a recently invented model.\nThousand Hands rode White Horse, while the others walked ahead. Nowadays, Thousand Hands wanted nothing to do with work, or any superfluous energy expenditure. The maintenance bot had been thus since learning the reason behind human labor. It felt that, for robots, work was meaningless. The point of robot existence was sunbathing.\nAfter all, sunbathing was all one had to do for survival.\nAs they walked, an encrypted channel opened on the network for Wu Kong.\nHello. Remember me? I’m the old fogey living in storehouse 183 in K district.\nIt’s you! You . . . haven’t broken down yet? Wu Kong was pleasantly surprised.\nI am well, thanks. I got myself a solar panel, so I no longer have to stay plugged in all the time. Come and see me. I will transmit the route to White Horse in a moment.\nThere were too many of them for White Horse to carry. Even after it received the itinerary, it could only act as a guide for the rest of them. They followed it, heading for their destination as fast as possible.\nThey spotted Old Fogey two days later. It was standing on the lawn in front of its storehouse. It saw Wu Kong’s empty eye socket, the wear and tear on everyone. It trembled at the sight of them, then calmed down, perhaps with some deep new understanding.\nThere was no need for questions.\nOld Fogey went to a flowerbed, picked a bunch of blooms, and turned to face its guests. Wu Kong saw the flowers with its remaining diamond eye, and they resembled fire, and they set his heart aflame.\nWu Kong was an electronic artist, after all. Its reaction was appropriate. It accepted the proffered flowers, held them to its chest, and bowed to Old Fogey.\nWelcome back, Old Fogey said, returning courtesy for courtesy. And welcome to the Countryside Age.\nOriginally published in Chinese in ZUI Found, April 2014, Issue 168.\nTranslated and published in partnership with Storycom.\nChen Hongyu hails from Sichuan province, China. Her editing work for Science Fiction World, China's top science fiction magazine, won her a Chinese Nebula award. She's known as The Queen of Boys' POV Fiction. Her recent novels include Youngsters' Utopia and The Legend of Zero. \"Western Heaven,\" her alternative Journey to the West, was nominated for both a Chinese Nebula and a Coordinates Award.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}