{"fingerprint": "KOH4vuH5eCVcDKXKkmEH18wMx7o=", "sitename": "Clarkesworld Magazine", "title": "Coming of the Light by Chen Qiufan, translated by Ken Liu", "author": "Chen Qiufan; Ken Liu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chen_03_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Coming of the Light by Chen Qiufan, translated by Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8360 words, novelette\n Coming of the Light\n 0.\n My mother told me about a Buddhist monk she and I met while shopping on my first birthday.\n The monk caressed my head—back then as bald as his—and chanted a few lines that sounded like poetry.\n After we returned home, my mom recited a few fragments to my father. Dad, who had had a few more years of schooling than my mom and completed middle school, told her that the lines weren’t poetry, but from a Buddhist koan. Only by consulting the village schoolmaster did he finally discover the origin of those fragments, words which would come to determine my life.\n As clouds drift across the sky, so Master in the Void is seen.\n Dust clings to everything but what is true.\n Over and over the monk queries: “What does your visit mean?”\n Master points to cypress which in courtyard has taken root.\n They thought these lines must contain some deep meaning, and so they renamed me Zhou Chongbo, which means “Repeat-Cypress.”\n 1.\n I’m sitting in a steamer. I’m a dumpling being steamed.\n Everyone keeps on inhaling and exhaling and then staring at the white smoke coming out of everyone else’s mouths, like cartoon characters with thought bubbles drifting over their heads containing logical musings, naked women, or frozen obscenicons. Then the smoke dissipates, revealing coarse, swollen faces. The air purifier screams as though it’s gone mad, and the young women sitting in chairs along the wall silently put on their face masks, slide their fingers across the screens of their phones, and frown.\n I don’t need to look at the time to know it’s past midnight. My wife won’t even respond to my WeChat messages anymore.\n I was dragged here at the last minute. My wife and I were on our way home after taking a stroll when we encountered a man dressed in an army coat on the pedestrian overpass. With a booming voice that startled both of us, he said, “The Quadrantid meteor shower will come on January 4. Don’t miss it—”\n I waited for him to finish with what is known to us marketing professionals as the “call to action”—e.g., “Join the Haidian Astrology Club,” “Call this number now!”, or even pulling out a portable telescope from his pocket and telling me “Now for only 88 yuan”—which would have made this a reasonably well executed bit of street peddling.\n But like a stuck answering machine, he started again from the beginning: “The Quadrantid meteor shower will come on January 4…”\n Mission failed.\n Disappointed, we left him. That was when my phone rang.\n It was Lao Xu. I glanced apologetically at my wife, who gave me her usual unhappy look when my work intruded on our time together—this was certainly not the first time. I answered the call, and that was how I ended up here, sitting in this room.\n The last thing my wife said to me was: “Tell your mother to quit pestering me about a grandchild. Her son is such a pushover he might as well be a baby.”\n “Chongbo!” Lao Xu’s voice drags me back to this room filled with cancer-inducing smoke. “You’re in charge of strategy. Contribute!”\n Peering through the obscure haze, I struggle to make sense of the confusing notes on the whiteboard: user insights, key selling points, market research . . . dry erase marker lines in various colors connect the words like the trails left by the finger on some mobile picture-matching game: triangle, pentagon, hexagram, the seven Dragon Balls…\n It’s all bullshit. Meaningless bullshit.\n The pressure in the steamer is rising. Beads of sweat form on my forehead, slide down my face, drip.\n “Is it too hot in here?” Lao Xu hands me a wrinkled paper napkin whose color is rather suspect. “Wipe yourself!”\n I obey, too terrified to object.\n “Mr. Wan wasn’t happy with the marketing plan last time and wanted to switch agencies. I begged and pleaded to get him to stay. If we don’t succeed this time, I think you all understand what that means.”\n The cheap napkin comes apart in my hand and bits of paper are stuck to my sweaty face.\n Mr. Wan is our god, the CEO of an Internet company. Out of any ten random people who accost strangers in the streets of Zhongguancun—“China’s Silicon Valley”—one would be engaged in “network marketing,” two would be trying to hook you on pyramid schemes, three would be trying to talk to you about Jesus, and the rest would all be founders or C-whatever-Os of some startup.\n But if you got these individuals to engage in one-on-one conversion bouts—time limited to three minutes—I’m sure the last group would achieve complete victory. They’re not interested in selling you a mere product, but an idea that would change the world. They’re not there to speak for some deity; they’re gods already.\n Mr. Wan is just such a god.\n Due to Lao Xu’s persistence and luck, our little agency managed to land Mr. Wan as a client. We are supposed to spend the euros, dollars, yen, and yuan flowing in from angel investors, from private equity funds, from rounds A-B-C-D, and help Mr. Wan’s company expand the market for their mobile app, raise product awareness, and improve daily engagement levels so that Mr. Wan could then use the new numbers to attract even more investment.\n The flywheel goes round and round.\n So where is the sticking point?\n “Where is the sticking point?” Lao Xu’s dry and thin voice screeches like a subway train shrieking through a tunnel, and an invisible force presses against me until I’m about to blackout. Trembling, I stand up, avoiding the gazes of others on purpose. I’m like some two-dimensional inhabitant of a mathematical plane: my body is made up of points, but I can’t see any.\n “It’s . . . a problem with the product.” I lower my head shamefully, prepared for an angry tirade from Lao Xu.\n “This is your fucking insight?”\n I hold my tongue.\n Mr. Wan’s co-founder—let’s call him Y—is a former classmate from USTC who had worked in America for many years. Mr. Wan convinced him to return to China, bringing with him valuable key patent rights to build a business. Y’s patent covers a digital watermarking technology, which, because it involves information theory and complex mathematics, is a bit hard to explain.\n I’ll use a simple example. Let’s say you take a picture and use the patented technology to add a watermark invisible to the naked eye; then, no matter how this photograph is subsequently modified or edited—even if 80 percent of the image were cropped—you would still be able to apply a special algorithm to recover the original image. The secret is that the invisible watermark itself carries all the information in the photo at the time it’s applied.\n This is, of course, only the most basic application for the technology. It could become an authentication/anti-tampering mechanism with many uses in fields such as media, finance, forensics, military security, and medicine—the possibilities are endless.\n However, after Y returned to China, the two co-founders discovered that all the core industries they were interested in had barriers to entry—the difficulty wasn’t so much that the fences were high, but that they couldn’t even tell where they were. After bumping into walls multiple times, they decided that they had to make an end run around the difficulties by starting with entertainment, hoping to popularize the technology first through grassroots consumer acceptance before gradually infiltrating enterprise business use cases.\n Mr. Wan is always emphasizing the word “sexy,” as though this is the only yardstick by which everything should be judged. But their product rather resembles a punctured, crumpled blowup doll left to dry in the shade.\n “Why don’t you use our client’s product?” Lao Xu screams at the young women sitting along the wall. Blood drains from their faces as they pretend to be busy taking notes.\n Mr. Wan’s mobile app is called “Truthgram,” and it automatically applies the special digital watermark to every picture the user takes. No matter how many times the image is transmitted, photoshopped, or otherwise altered beyond recognition, a simple button press would restore the original image. At first, the marketing angle focused on safety: as long as you stick to Truthgram, Mom will never have to worry about your face showing up in some photoshopped pornographic image.\n Besides priming the sales channels, we also planned a web marketing event called “The Big Reveal.” We recruited a hundred women and helped them take selfies with Truthgram, which we then retouched until everyone looked like a supermodel. We posted the photos on the web along with an animated GIF explaining how to use Mr. Wan’s app to reveal the truth: “Turn Beauty to Beast in less than one second!”\n Male users—maybe losers would be more accurate—responded to the gimmick with extraordinary exuberance, recommending the app to each other and coming up with a veritable flood of variations that fulfilled the promise of user-generated content. Women, on the other hand, detested the marketing trick. They filled the forums with negative commentary about the company, arguing that the app vilified and insulted women by playing up the hoary trope of treating women’s right to pursue beauty as a twisted form of narcissistic deceit. The marketing event became a PR crisis.\n If it were up to me, I would have declared victory. Developing a market is all about pressing the key point, like plunging a sharp needle into the hypothalamus, the emotional center of the brain. If you don’t see some blood spill, it probably means your needle is too dull or maybe you haven’t stabbed at the right spot.\n But Mr. Wan thought our little exercise could only grab some eyeballs temporarily at the cost of damaging the long-term brand value. As it turned out, the data proved him right. After a brief spike, the number of downloads went down and stayed down, and the losers we managed to attract eventually stopped using the app because we couldn’t keep them stimulated with a constant stream of new content.\n “I’m more interested in whether others see me from the most beautiful angle than in the security of my photos,” a perfectly ordinary girl stated in an interview we conducted with our customers. Her phone’s photo album was filled with selfies that showed signs of excessive retouching, all of them similar and none resembling her. Still, every half hour or so, she would hold her phone overhead at a 45-degree angle, pout her lips like a duck, and snap a shot.\n If a tower’s foundations are built on the shifting sands of a beach, how can you expect it to stay standing until the tides come in?\n Lao Xu stares at me; I stare at the whiteboard; the whiteboard stares at everyone; everyone stares at their phone. We are like a flock of birds lost in fog, constantly drawn to flashing screens until we’ve forgotten the direction we were headed in. Yet, cold night has fallen, and hungry predators are approaching in the dark.\n My phone beeps, indicating that it’s nearly out of battery. My instinctive reaction is not to conserve, but to rush to look through WeChat Moments posted in my network. Every last drop of juice must be used to its fullest extent and not be wasted with invisible background processes. Now you get a glimpse of my values, my philosophy.\n I see the latest posts by Mr. Wan. All of a sudden, the dumpling skin has burst, and the fillings spill out.\n “I’ve got it!” I slam my hand down on the table. Everyone jerks awake from their somnambulant state.\n I hold my phone under Lao Xu’s nose.\n Under Mr. Wan’s profile, he has posted a new photo, accompanied by the following caption:\n On Saturday, the fifteenth of the month under the lunar calendar, I’m going to perform the Buddhist good deed of freeing captive animals on the shore of Wenyu River. I’ll purchase and free river snails laden with eggs, birds, reptiles, fish, and other animals. By this compassionate deed, I hope the Buddha brings blessings to everyone so that the aged may live longer, the middle-aged may have harmonious families, and children may gain wisdom and health! Happy Saturday! (Donations to help purchase more animals to free gratefully accepted: more animals = more good karma for all! Funds may be sent to this account: XXXXXXX. Sharing and reposting this message will also gain you blessings.)\n “Err—I hadn’t realized that they were running so low on funds.” Lao Xu’s eyes are wide as teacups. “They haven’t paid us our last invoice yet!”\n “Keep on reading,” I say. I continue to slide my finger up the screen. Mr. Wan’s dynamic timeline is woven from high-tech news and pop-Buddhism, a mixture of concentrated caffeine pills and chicken soup for the soul. “I think we’ve discovered his other passion.”\n “So what?”\n “Let’s think about why, every day, so many people share and forward these posts about how to do good deeds to build up merit and gain the Buddha’s protection. Are they really that faithful? I doubt it. Maybe preventing their photographs from being tempered with isn’t a core need for people, but the anxious contemporary Chinese are obsessed with personal security, especially the psychological sense of being safe. We have to connect Mr. Wan’s product with this psychological need.”\n “Be specific!”\n “Everyone, what kind of posts would you share to feel more secure?” I ask.\n “Powerful mantras!” “Pictures of buddhas!” “The Birthday of the Buddha, and other festival birthdays!” “Wise sayings by famous master monks!”\n “What sort of posts would make you believe and willingly hand over money?”\n There’s a pause as everyone in the room ponders my question. Then, one of the girls timidly speaks up, “Something that’s been con…consecrated . . . um, you know, when the light has been—”\n “Bingo!”\n The room falls silent. Lao Xu gets up, and, poker-faced, walks behind me. I hear a loud slam, and a chill wind pours into the back of my shirt as though a bucket of ice has been emptied into it. The haze in the room instantly dissipates.\n “Awake now?” Lao Xu closes the window. “Explain what you mean again, but stop being so damned mystical.”\n I hold his gaze and speak slowly. “Let’s find a famous and respected monk to consecrate this app—‘bring light into it’—so that every picture it takes becomes a charm to ward off evil. We’ll create a sharing economy of blessings.”\n Everyone shifts their gaze from the phone screen to me; I gaze at Lao Xu; Lao Xu says nothing but gazes at the phone.\n After a while, he lets out a held breath. “You know, all those rinpoches in Chaoyang District are going to get you for this.”\n I have no idea what’s in store for me.\n 10.\n My wife is a Neo-Luddite.\n Once, she had been a heavy gamer. She spent so much time on the computer that her parents sent her to a summer camp that specialized in curing Internet addiction. The experience caused her attitude toward technology to turn a hundred and eighty degrees.\n Many times I asked her, what really happened in that campground located on Phoenix Mountain called “The Nirvana Plan”?\n She never answered me directly.\n This was the biggest philosophical difference between us. She believed that despite the appearance of unprecedented novelty, the high-tech industry was ultimately no different from another ancient trade: they both took advantage of the weaknesses of ordinary men and women, and, under the guise of words like “progress,” “uplift,” and “salvation,” manipulated their emotions. Whether you put your hand on a Bible or an iPad, in the end you were praying to the same god.\n We only give the people what they want. They desire comfort, joy, a sense of security. They want to improve themselves, to see themselves stand out in the crowd. We can’t take such desires away from them. That was how I always argued back at her.\n Oh, please! Don’t give me that. You’re just playing a game to satisfy your own yearning for control, she said.\n Come on, give people a little credit! I said. Everyone’s got a brain. How can anyone “control” anyone else?\n There are always NPCs.\n What are you talking about?\n Non-Player Characters. What if everything is controlled from behind the scenes by some invisible background process? Then every action you take will affect the game logic. The system will react with NPCs and they will carry out their predetermined programming.\n I stared at her face as though I’d never really known her. I even wondered whether she had just joined some new cult.\n You don’t really believe that, do you?\n I’m going to walk the dog. There shouldn’t be much dog poop in the streets this early in the morning.\n 11.\n Every day, as the temple bell tolls five, I have to get up to sweep the grounds. I sweep the wooden floor of the gallery from the new library to the stone steps, and thence to the temple gates, where the ancient pagoda tree grows, its gnarled branches spread like the talons of a rampant beast.\n As for whether I will be quietly reciting the Surangama Sutra, the Lotus Sutra, or the Diamond Sutra as I sweep, that depends on the day’s PM2.5 air quality index. My throat hurts when I breathe the polluted air; I don’t need the distraction.\n Any of the faithful coming to the temple to make offerings can see that I haven’t been truly called by the Buddha. Just like all the other “disciples” flocking here on weekends to study Buddhist doctrine, I’m here to hide from the real world.\n In a way, I’m not too different from the throngs of shoppers at the Buddhist shop outside Yonghe Lamasery vying to buy electronic “Buddha boxes.” They bring the box home, push a button, and the box starts chanting sutras. On the hour (or at designated times), the box will even emit a tranquil, meditative duannnnng, like the ringing of the bell in a temple. The purchasers apparently think this will bring them blessings and cleanse bad karma. I often imagine all the passengers squeezed like canned sardines into the number 2 subway train leaving from the lamasery station, all of their Buddha boxes ringing harmoniously together on the hour. Perhaps the so-called Chan state of mind refers to the detachment of such a moment from real life.\n And now that I have to commit to a Buddhist vegetarian diet, I miss the restaurant at Beixinqiao where they serve chitterlings soup made from ancient stock that has supposedly been accumulating flavor for years.\n I’ve canceled my mobile number and deleted all my accounts on social media; my wife has left me and returned to her hometown; I’ve even been given a Dharma name: “Chenwu” – “Free of Worldly Dust.” All I want is for those crazy people to never find me again.\n I’ve had enough.\n Everything began that night with the crazy marketing scheme that seemed to make no sense.\n Mr. Wan bought my idea. Overnight he summoned the engineers to develop the new product. Lao Xu laid out the marketing plan and strategy. The most important piece of the project, of course, was assigned to me, the originator.\n I had to go find a respected master monk willing to consecrate our app, to bring it light.\n Lao Xu demanded that the entire process be filmed and turned loose online to go viral. I ran through every excuse I could think of: my family have been Christians for three generations; my wife is pregnant and can’t come in contact with raw foods, animal fur, or anything having to do with spirits…\n Lao Xu responded with only one line: This is your baby. If you don’t want to see it through, get out and don’t come back, you get me?\n I visited every temple in Beijing, begging and pleading with the master monks, and I sought out every lama secluded in spiritual solitude in the city’s various nooks and crannies. Each time, however, even after having come to an agreement on the price, as soon as I brought out my camera, the monks’ faces turned stony, and after a few Amitabhas, they would cover their faces and escape my presence.\n We tried using hidden cameras a few times, but the combination of incense haze and camera shake made the results unwatchable.\n As the deadline approached, I could no longer sleep, but tossed and turned all night. My wife asked me what I was doing.\n “Rolling dough for pancakes,” I said.\n She kicked me. “If you want to do that, get on the floor. Don’t pretend you’re a rolling pin in bed. I’m trying to sleep.”\n The kick managed to free my clogged neural pathways. Instantly, I was inspired.\n Mr. Wan’s new app went on sale on time. Lao Xu, energized like his Land Rover, shifted into high gear and whipped us into a frenzy. Videos, new concepts, and new campaigns were released one after another. Soon, a video depicting a master monk consecrating a mobile phone went viral, and Buddhagrams began to conquer Weibo and WeChat. The number of downloads and daily engagement level rose exponentially like rockets heading for the clouds at escape velocity.\n Don’t ask me the impact of such growth on the long-term brand value; don’t ask me what this meant for the subsequent development and application of the digital watermark technology. Those are problems Mr. Wan had to solve. I was only a strategist for a third-rate marketing company who had some crazy ideas. I could only work on problems that I was capable of solving with my own methods.\n In the end, we underestimated the creativity of users. It turned out that Buddhagram pictures, due to the presence of the watermark, could be recovered from even low-resolution copies or cropped fragments. This meant they could be shared and forwarded without taking up much bandwidth or time. Trying to take advantage of the situation, we released a series of new ads touting this newly discovered advantage.\n Downloads spiked again, but no one anticipated what happened next.\n It started with a picture of an apple taken with Buddhagram. A week later, the poster shared a second picture of the same apple: it was apparently rotting at a much slower rate than other apples.\n Next came the various pictures of pets that miraculously recovered their health after having had their pictures taken with Buddhagram.\n Then, an old lady claimed that after she had taken a Buddhaselfie, she managed to survive a deadly car accident.\n Rumors multiplied. Taken individually, each seemed some preposterous April Fool’s joke, but behind every story stood a witness who swore it was true, and the number of believers snowballed.\n The posts grew stranger. Patients with terminal cancer posted selfies showing their tumors diminishing daily; couples who had trouble conceiving took nude selfies and became pregnant; migrant laborers took group selfies and won the lottery. The kind of news that one would normally expect to find only on tabloids on the subway filled every social media platform. All the pictures had the Buddhagram watermark, and all of us thought they were from astroturfers hired by the company.\n We thought wrong.\n Supposedly, Mr. Wan’s phone was ringing nonstop with calls from interested investors. Other than asking about a chance to invest, the next most popular question was: Who is the master monk who brought light to the app?\n The logic was simple: if a consecrated mobile app could have such magical effects, then asking the monk himself to perform some rite would surely result in earthshaking miracles. The investors thought of this, and so did millions and millions of users.\n In this age, truth was as rare as virtue. Even more tragic, when faced with the truth, most people preferred to doubt its veracity because they would rather believe the truthy mirage created by their own minds.\n Soon, my contact details were leaked. Email, phone, text . . . everyone screamed the same question at me: Who is the master monk???\n I refused to answer. I knew they would figure it out sooner or later.\n Crowdsourcing the search, they finally managed to locate the master monk and the disciples in the viral video—a bunch of actors my friend had found for me among the crowd of extras congregated at Hengdian World Studios, hoping to get a role. They were supposed to portray commoners during the Qing Dynasty, which meant they were already shaved bald—just like Buddhist monks. This made negotiations rather easy. The extras who harbored dreams of making it big in the movies were especially diligent, and the lead even argued with the makeup artist over the correct placement of the burn marks over his head to indicate his ordained status. Watching the scene, I grew concerned.\n They were all good people. The fault was entirely mine.\n The poor actors who had been located by the “human flesh search engine” could no longer live in peace. The enraged netizens hounded them and their families using the vilest language, forcing them to acknowledge what was obviously true: they were mere extras hired by the company to portray the master monk and his disciples.\n Except that the crowd still wasn’t quite on the same page as me: they continued to believe that my company—or more precisely, I—was hiding the real master monk. Out of greed or selfishness, I was refusing to disclose his identity to the public so that everyone could benefit from the master’s powers.\n I really wasn’t.\n Lao Xu closed the company temporarily. Every day, groups of middle-aged women congregated at the foot of the building, holding up protest banners. Even if we could endure the pressure, the building’s property manager couldn’t. Lao Xu put us all on paid leave, hoping that the storm would quickly blow over. Kindly, he told me that it was best for me to leave the city and return to my parents’ home for a few days. It was just a matter of time before one of the netizens who was terminally ill might arrive at my door with his family, pleading with me to give up the master monk’s WeChat ID.\n I realized that Lao Xu was right. I couldn’t put my family at risk.\n And so, after I settled my affairs, I came to this ancient temple to become a grounds sweeper.\n The bell tolls nine times, indicating the end of morning lessons. The staff of the temple, including me, assume our positions. The temple is open to the public today, and the abbot, Master Deta, will be greeting a group of VIP faithful from the Internet industry and conducting a salon to discuss the connections between Buddhist doctrine and the Web.\n My assigned job is to hand out the visitor’s badges. On the list of VIPs, I see more than a few familiar names, including Mr. Wan.\n Though it’s thirty-eight degrees Celsius, I put on my cotton medical face mask. Sweat pours off me as though I’m drenched by rain.\n 100.\n The faithful, now dressed in the yellow robes and yellow shoes normally reserved for monks, stream in one after another, their colorful badges swaying on lanyards before their chests. For a moment I suffer the illusion of having returned to my old life from a few months ago: the China National Convention Center, JW Marriott Beijing, 798 D Park . . . I was either at meetings or on my way to meetings, handing out my business card, adding people’s WeChat IDs, puffing up our clients, sketching incredible visions, peppering my speech with “Internet thinking” buzzwords—like some updated version of a Red Guard clutching his Little Red Book.\n The faces before me are still the same, but now their badges have been stripped of the eye-catching titles. “CXO,” “Co-Founder,” and “VP of Investment” have been replaced by “Householder,” “Believer,” and “Benefactor.” At least for the moment, they’ve retracted their typical arrogance and protruding bellies. Mumbling mantras, they take their seats, and piously hand their phones, iPads, Google Glasses, smart wristbands, and so on to the waiting novice monks in exchange for a numbered ticket.\n I see Mr. Wan. His face looks pallid and thin, but his gaze is steady and his steps airy. Placidly, he places the palms of his hands together and bows to the guests on either side of him, showing no trace of his former domineering air. As he passes me, I lower my head, and he lowers his in turn to acknowledge my greeting.\n Many things must have happened in the intervening months.\n Supposedly, Master Deta had once been a promising student at the Computer Science Department of Tsinghua University. However, as a result of his enlightenment, he gave up offers for graduate study at Stanford, Yale, UC Berkley and other ivy-clad campuses, took up vows, and became ordained as a monk. With him as an example, a group of other graduates of elite colleges also joined our temple and began to spread the teachings of Buddhism online, bringing relief to all mortal beings with methods adapted to the Internet age.\n The master’s lecture today roams over many subjects—so many that I barely remember any of them. I do see Mr. Wan holding a pious pose and nodding frequently. When the master discusses how big data techniques could be used to help locate the young reincarnations of tulkus, his eyes even grow tearful.\n I’m trying to hide from him, but I also can’t suppress the urge to go up to him and ask if the storm has finally blown over. I don’t miss my old life, but I miss my family.\n Here, only monks who have achieved a certain status have the right to use the Internet. The layered green branches of the ancient cypress grove, like a firewall, separate us from the noise and dust of the secular world. My daily life, however, is not boring at all: sweeping, working, chanting, debating, and copying. Uncluttered by material possessions, I’ve been sleeping without trouble for the first time in years, and no longer live in constant dread of sudden vibrations from my phone—though occasionally my right quadriceps still suffers phantom pulses. But my teacher tells me that if I count my prayer beads—all one thousand and eight hundred of them—every day for a hundred eighty days, I shall be fully cured.\n I think it’s because we want too much, more than what our bodies and minds are designed to withstand.\n My old job was all about creating need, encouraging people to pursue things that didn’t matter for their lives, and then I used the money they gave in exchange to purchase illusions others had created for me. Round after round, we never seemed to tire of the game.\n I think about my wife’s words: Her son is such a pushover he might as well be a baby. Fuck, I’m even more useless than a baby.\n This is my sin, my bad karma, the blockage I need to clear for my progress.\n I’m starting to understand Mr. Wan.\n After the lecture, Mr. Wan and a few others surround Master Deta, apparently because they have many questions that need his insight. Master Deta beckons to me. I gird myself and walk over.\n “Would you bring these honored guests to meditation room three? I’ll be over in a moment.”\n I nod, and lead the group to the room in the back reserved for VIPs.\n I ask them to sit, and I pour tea for everyone. They nod and smile at each other, but their conversation is restricted to small talk. I’m guessing that they are competitors outside the temple.\n Mr. Wan doesn’t look at me directly. He sips his tea and closes his eyes, meditating. His lips move as he silently recites some mantra, and his hands are busy with a string of rosewood prayer beads. After the forty-ninth time through the beads, I can’t hold myself back any longer. I walk up to him, bend down, and whisper next to his ear, “Do you remember me?”\n Mr. Wan opens his eyes and scrutinizes me for half a minute. “You are Zhou . . . ”\n “Zhou Chongbo. You have excellent memory, sir.”\n Mr. Wan grimaces and lunges at me, wrapping the string of prayer beads about my neck and pushing me to the floor.\n “You fucking idiot!” He curses and strikes me. The two guests next to him stand up, startled, but they don’t dare to intervene. “Amitabha. Amitabha,” they murmur.\n I protect my face with my hands, but I don’t know what to say. “Mercy!” I cry. “Mercy!”\n “Stop!” Master Deta’s voice booms. “This is a sanctified place! Such violence has no place here.”\n Mr. Wan’s fist, suspended in midair, stops. He stares at me, and tears suddenly spill from them and fall onto my face, as though he’s the one wronged.\n “All gone . . . I’ve lost everything . . . ” he murmurs. Then he falls back into his seat.\n I get up. I guess someone who’s lost everything can’t even strike very hard. My body isn’t hurting at all.\n “Amitabha.” I put my palms together and bow to him. I know he’s not feeling much better compared to me. Just as I’m about to leave the meditation room, the abbot stops me, and strikes me with his ferule: twice on the left shoulder, once on the right.\n “Don’t discuss what happened today with others. You still have too much worldly arrogance about you and cannot handle important tasks. You must study harder and reflect on your actions.”\n I’m about to argue the point but then remember that I once tolerated much worse from Lao Xu and Mr. Wan. Master Deta is basically the temple’s CEO. I have to swallow my pride.\n I bow to him and back out.\n I lean against the wall of the gallery and watch the woods in the setting sun. Smog glistens above the city like the piled layers of a sari. The bell tolls on the hour, and startled birds take to the air.\n A thought flashes through my mind. I am reminded of how Master Subhuti once struck Monkey three times on the head with a ferule and then walked away with his hands held behind him, which was a message for Monkey to come to the backdoor of the master’s bedroom at the hour of the third watch for special lessons.\n But how am I supposed to interpret two strikes on the left shoulder and one on the right?\n 101.\n At around nine o’clock at night—that’s when first watch turns to second watch under the ancient time system—I head for the abbot’s chambers via backwoods trails. My journey through the dark woods is accompanied only by the gentle susurration of pines, with not even a chirp from a bird.\n I knock twice on the door, and then once. Someone seems to be stirring inside. I knock again. The door opens automatically.\n Abbot Deta is sitting with his back to the door. Before him is a giant screen, completely dark. I seem to hear the low-frequency buzzing of electronics. He sighs loudly.\n “Teacher! Your student is here!” I fall to my knees and prepare to kowtow.\n “I think you’ve read Journey to the West too many times.” The abbot gets up, and I can see that his expression isn’t one of joy. “I told you to come at one minute past ten o’clock.”\n I’m stumped for words. Apparently the master was using binary notation.\n I hurry to hide my embarrassment. “Um . . . this afternoon—”\n “It wasn’t your fault; I know what happened. As soon as you stepped into this temple, I learned everything about you.”\n “… then why did you accept me?”\n “Though your heart wasn’t directed towards the Buddha, you have within you the root of wisdom. If I didn’t take you in, I’m afraid you might have sought refuge in suicide.”\n “Master is indeed merciful.” I’m still completely as a loss.\n “I know you don’t understand.” Master Deta isn’t actually that old. He’s barely in his forties. As he laughs with his glasses perched on his nose, he resembles a college professor.\n “Forgive your foolish student, master. Please enlighten me.”\n Master Deta waves his hand. The giant screen, apparently controlled by body motion, lights up. The image on the screen is difficult to describe: a gigantic, compressed oval whose background is various shades of blue, studded with irregular patches of orange-red dots. Or maybe it’s the other way around. I think the image resembles the false-color version of some planet’s topographic map, or maybe a slide full of multiplying mold seen through a microscope.\n “What is this?”\n “The universe. Or more precisely, the cosmic microwave background. This is the image of the universe about 380,000 years after the Big Bang. You’re looking at the most precise photograph of it so far.” His enthusiastic admiration contrasts sharply with his humble monk’s garb.\n “Um . . . ”\n “This was made by computation based on the data gathered by the European Space Agency’s Planck space observatory. Look here, and here—do you see how the pattern is a bit odd? . . . ”\n Other than patches of orange-red or cobalt mold, I can’t see what’s so special.\n “Are you saying that . . . um . . . the Buddha doesn’t exist?” I ask tentatively.\n “The Buddha teaches that the great trichiliocosm consists of a billion worlds.” He glares at me, as though forcing me to retract my words. “This picture proves that multiple universes once existed. After so many years of effort, humanity finally proved, through technology, the Buddhist cosmology.”\n I should have realized this would happen. The abbot is just like the pyramid schemers in Zhongguancun—anything, no matter how unrelated, could be seen by them as powerful proof for their point of view. I try to imagine how a Christian might interpret this picture.\n “Amitabha.” I put my palms together to show piety.\n “The question is: why has the Buddha chosen now to reveal the truth to all of humanity?” He speaks slowly and forcefully. “I pondered this question for a long time, but then I saw your scheme.”\n “Buddhagram?”\n Master Deta nods. “I can’t say I approve of your methods. However, since you ended up coming here, that proves that my guesses were correct.”\n Cold sweat seeps onto the skin at my back, not unlike that night so long ago that it seems unreal.\n “This world is no longer the same as its original form. Put it another way: its creator, the Buddha, God, Deity—no matter what name you give it, has changed the rules by which the world operates. Do you really believe that the consecration was what allowed Buddhagram to perform miracles?”\n I hold my breath.\n “Suppose the universe is a program. Everything that we can observe is the result of the machine-executable code. But the cosmic microwave background can be understood as the record of some earlier version of the source code. We can invoke this code via computation, which means that we can also use algorithmic processing to change the version of the code that’s currently running.”\n “You’re saying that Mr. Wan’s algorithm really caused all of this?”\n “I dare not jump to conclusions. But if you forced me to guess, that would be it.”\n “I’m pretty science-illiterate, master. Please don’t joke with me.”\n “Amitabha. I am a Technologist-Buddhist. I believe in the words of Arthur C. Clarke: ‘Any sufficiently advanced technology is indistinguishable at first glance from Buddhist magic.’”\n I know there’s something not quite right here, but I don’t know how to debate him. “But . . . but that project failed. Look at what a sad state Mr. Wan is in. I don’t think I have anything more to do with this.”\n “What is not real? That which form possesses.\n The Tathagata will be seen\n When mind past form progresses.”\n “Master, please allow me to leave the temple and return to the secular world. I miss my wife.” A nameless fear suddenly seizes me like a bottomless pit rising out of the screen on the wall, trying to pull me in.\n Master Deta sighs and smiles wryly, as though he has long since predicted all this.\n “I was hoping that by studying Buddhist doctrine with me, you would be sufficiently calmed to stay here and wait out the catastrophe. But . . . you and I are both caught in the wheel of samsara, so how can we escape our destinies? All right. Take this as a memento of our time together.”\n He hands over a gold-colored Buddha card. On the back is a toll-free number as well as a VIP account number and security code.\n “Teacher, what is this?”\n “Don’t lose it! The resale value of this card is 8888 yuan. If anything happens, you can give me a call.”\n Master Deta turns and waves his hand, and the moldy image on the screen is replaced by regular TV programming. An American quantum physicist has been killed by gunshot. Bizarrely, the shooter claims that it was an accident because he thought the victim was someone else.\n 110.\n Half a year passes. I meet Lao Xu at Guanji Chiba, a popular barbecue restaurant in Zhongguancun.\n Lao Xu hasn’t changed much. He’s still pathologically in love with barbecued lamb kidneys. Like a stereotypical Northeasterner, after a few bottles of beer, his face glowing with grease and jittering with emotion, Lao Xu begins to say what’s really on his mind.\n “Chongbo, why don’t you come and join me again? You know I’ll take care of you.”\n Animatedly, Lao Xu tells me what’s been going on with him, spewing flecks of spittle through the smoky haze. After he hid and rested for a while at home, another phone call drew him back into the IT world. This time, he didn’t start a marketing company with no future, but became an “angel investor.” With all the contacts he made among entrepreneurs, now he gets to spend other people’s money—the faster the better.\n He thinks I have potential.\n “What’s going on with Mr. Wan?” I change the subject. My wife has just found out that she’s pregnant. Although my current job is boring, it’s stable. Lao Xu, on the other hand, isn’t.\n “I haven’t heard from him for a while…” Lao Xu’s eyes dimmed, and he took a long drag on his cigarette. “Fortune is so fickle. Back when Buddhagram was on fire, a whole bunch of companies wanted to invest. An American company even wanted to talk about purchasing the whole company. But at the last minute, an American man showed up claiming that Y’s core algorithm was stolen from one of his graduate school research labmates. The American sued, and he just wouldn’t let it go. So the patent rights had to be temporarily frozen. All the investors scattered to the wind, and Lao Wan had to sell everything he owned . . . but in the end, it still wasn’t enough.”\n I drain my cup.\n “It wasn’t your fault,” Lao Xu said. “Honestly, if you hadn’t come up with that idea, I bet Lao Wan would have failed even earlier.”\n “But if they hadn’t made Buddhagram, maybe the Americans wouldn’t have found out about the stolen algorithm.”\n “I’ve finally got it figured out. If what happened hadn’t happened, something else would have. That’s what fate means. Later, I heard that the labmate Y stole from was shot and killed in America. So now the patent case is in limbo.”\n Lao Xu’s voice seems to drone on while time stands frozen. My gaze penetrates the slight crack between his cigarette-holding fingers, and the background of noisy, smoky, shouting, drinking patrons of the restaurant fades into the distance. I remember something, something so important that I’ve managed to forget it completely until now.\n I thought everything was over, but it’s only starting.\n After saying goodbye to Lao Xu, I return home and begin to search, turning everything in the house upside down. My wife, her belly protruding, asks me if I’ve had too much to drink.\n “Have you seen a golden card with a picture of the Buddha on there?” I ask her. “There’s a toll-free number on the back.”\n She looks at me pitifully, as though gazing at an abandoned Siberian husky, a breed known for its stupidity and difficulty in being trained. She turns away to continue her pregnancy yoga exercises.\n In the end, I find it tucked away inside a fashion magazine in the bathroom. The page I open to happens to be the picture of a Vaseline-covered, nude starlet lounging amongst a pile of electronics. Each screen in the image reflects a part of her glistening body.\n I dial the number and enter the VIP account number and security code. A familiar voice, sounding slightly tired, answers.\n “Master Deta, it’s me! Chenwu!”\n “Who?”\n “Chenwu! Secular name Zhou Chongbo! Remember how you struck my shoulders three times and told me to go to your room at ten-oh-one to view the picture of the cosmic microwave background?”\n “Er . . . you make it sound so odd. Yes, I do remember you. How’ve you been?”\n “You were right! The problem is with the algorithm!” I take a deep breath and quickly recount the story as well as give him my guess. Someone is working really hard to prevent this algorithm from being put into wide application, even to the point of killing people.\n The earpiece of the phone is silent for a long while, and then I hear another long sigh.\n “You still don’t get it. Do you play games?”\n “A long time ago. Do you mean arcade, handheld, or consoles?”\n “Whatever. If your character attacks a big boss, the game’s algorithms usually summons all available forces to its defense, right?”\n “You mean the NPCs?”\n “That’s right.”\n “But I didn’t do anything! All I did was to suggest a stupid fucking marketing plan!”\n “You misunderstand.” Master Deta’s voice becomes low and somber, as though he’s about to lose his patience. “You’re not the player who’s attacking the boss. You’re just an NPC.”\n “Wait a second! You are saying . . . ” Suddenly my thoughts turned jumbled and slow, like a bowl of sticky rice porridge.\n “I know it’s hard to accept, but it’s the truth. Someone, or maybe some group, has done things that threaten the entire program—the stability of our universe. And so the system, following designated routines, has invoked the NPCs to carry out its order to eliminate the threat and maintain the consistency of the universe.”\n “But I did everything on my own! I just wanted to do my job and earn a living. I thought I was helping him.”\n “All NPCs think like that.”\n “So what should I do? Lao Xu wants me to go work for him. How do I know if this is . . . Are you there?”\n Strange noises are coming out of the earpiece, as though a thousand insect legs are scrabbling against the microphone.\n “When you are confused . . . hiss . . . the teacher helps . . . Enlightened . . . hiss . . . help yourself. All you have to do . . . hiss . . . and that’s it… hiss . . . Sorry, your VIP account balance is insufficient. Please refill your account and dial again. Sorry, . . . ”\n “Fuck!” I hang up angrily.\n “What’s wrong with you, screaming like that? If you frighten me and cause me to miscarry, are you going to assume the responsibility?” My wife’s voice drifts to me slowly from the bedroom.\n In three seconds, I sort though my thoughts and decide to tell her everything. Of course, I do have to limit it to the parts she can understand.\n “Tell Lao Xu that your wife is worried about earning good karma for the baby. She doesn’t want you to follow him and continue to do unethical work.”\n I’m just about to argue with her when the phone rings again. Lao Xu.\n “Have you made up your mind? USTC’s quantum lab is making rapid progress! Their machine is tackling the NP-completeness problem now. Once they’ve proved that P=NP, do you realize what that means?”\n I look at my wife. She places the edge of her palm against her throat and makes a slicing motion, and then she sticks her tongue out.\n “Hello? You there? Do you know what that means—” I hang up, and Lao Xu’s voice lingers in my ear.\n Every program has bugs. In this universe, I’m pretty sure that my wife is one of them. Possible the most fatal one.\n 111.\n I still remember the day when Lailai was born: rose-colored skin, his whole body smelling of milk. He’s the most beautiful baby I’ve ever seen.\n My wife, still weak from labor, asked me to come up with a good name. I agreed. But really, I was thinking: It really makes no difference what he’s named.\n I’m no hero. I’m just an NPC. To tell the truth, I’ve never believed that all this was my fault. I didn’t join Lao Xu; I didn’t come up with some outrageous idea that would have caused the whole project to fail; I didn’t prevent that stupid quantum computer from proving that P=NP—even now I still don’t know what that fucking means.\n If this is the reason that the universe is collapsing, then all I can say is that the Programmer is incompetent. Why regret destroying such a shitty world?\n But I’m holding my baby son, his tiny fist enclosed in my hand, and all I want is for time to stop forever, right now.\n I regret everything I’ve done, or maybe everything I haven’t done.\n In these last few minutes, a scene from long ago appears in my mind: that guy wearing the army coat on the pedestrian overpass.\n He’s staring at me and my wife, and like some stuck answering machine, he says, “The Quadrantid meteor shower will come on January 4. Don’t miss it . . . ”\n No one is going to miss this grand ceremony for going offline.\n I play with my son, trying to make him laugh, or make any sort of expression. Suddenly, I see a reflection in his eyes, rapidly growing in size.\n It’s the light coming from behind me.\n Originally published in Chinese in Offline Magazine, February 2015.\n Translated and published in partnership with Storycom.\n Chen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.\n Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\n Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\n Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\n He lives with his family near Boston, Massachusetts."}