{"fingerprint": "4oz/pkKFoahZbpCtiwYnJ7S7/i4=", "sitename": "Clarkesworld Magazine", "title": "A Man Out of Fashion by Chen Qiufan, translated by Ken Liu", "author": "Chen Qiufan; Ken Liu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chen_08_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Man Out of Fashion by Chen Qiufan, translated by Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11640 words, novelette\nA Man Out of Fashion\nWaking from an endless dream, Du Ruofei found himself naked in bed.\nFor a long while he simply lay still. The dream had lasted so long that he had forgotten where he was supposed to be. Finally, he recognized the dilapidated apartment he had been renting for the last three years: unfashionable décor dating from the 1990s; sagging gypsum board ceiling; scratched wooden baseboard under wallpaper yellowing after many rainy seasons, with green patches of mold in the corners. The bed, desk, and dresser were all made from cheap particleboard. He knew which doors were broken, and which door was the dam holding back a flood of clothes redolent of mold.\nHe sighed. Nothing had changed. The dream was, after all, just a dream. He ran his hands over his pallid skin, examining his wrists, neck, and the insides of his thighs: everything was smooth, normal. In his dream, these spots had been stuck full of tubes and needles, connected to machines whose names he didn’t know, buzzing and humming so loudly that it nearly drove him mad. The noises from his dream persisted in his mind. He waved his arms, trying to chase away the invisible swarm of bees.\nThe curtained windows glowed white, making it impossible to tell the time of day. Out of one corner he glimpsed tall buildings drifting through the haze of smog. Pollution was the reason he kept his windows shut year-round, relying on air-conditioning for fresh air.\nWithout putting on a strip of clothing, he climbed out of bed and turned on his PC, confident that no one was going to intrude on his privacy. His roommate had just moved out, and for the time being, he was paying double the rent, a thought that made his heart sink a little. He was trying to make ends meet by working as a freelance translator, but editors frequently delayed paying his invoices for as long as possible, and the income stream was far from steady.\nSomething seemed to be wrong with his computer.\nAll signs pointed to the network functioning properly, but Ruofei’s favorite websites showed the same headlines as yesterday, June 26, 2018. He clicked on the somehow-familiar titles, only to be shocked anew by the content.\nThe final group of the fortunate few will enter hibernation today.\nFamiliar faces scrolled past the screen: business magnates diagnosed with fatal diseases, politicians past their prime, comedy stars, prominent mathematicians, hacking prodigies, Miss Globe . . . most of the hibernauts had received their coveted places in the hibernation chamber as the result of a complicated and opaque formula devised by the UN Future Affairs Office. A special drug would allow them to sleep for hundreds of years, accompanied only by their private dreams and wishes, waiting to be awakened by future generations.\nWho may be robots! wrote the article’s author.\nAmong the processed commercial headshots of the cream of society, Du Ruofei saw a young face, sallow, stiff, peculiar, clearly out of place though not exactly repulsive. The face seemed to be struggling to smile, but utterly failing. The crooked lips and twisted muscles gave off an air of reluctance and awkwardness. He read the caption beneath the image.\nDu Ruofei, aged 24, from Shanghai, is the only winner of the hibernation lottery!\nHe was looking at his own face.\nShaking, Ruofei stood up. He couldn’t understand any of this. Was his dream real? If so, how could he explain what he was seeing now? Or maybe he was only in the middle of yet another dream in the long slumber of hibernation. His fragile body was still trapped in the pure white cocoon, waiting for the right moment to emerge.\nHe walked up to the door and twisted the knob, expecting to see the familiar dim hallway that led to the cramped, dirty common room.\nWhite light filled his vision. He saw—\n—a milky-white bubble.\nHis whole room was wrapped inside the bubble. Against the smooth surface, Ruofei saw projections of the familiar sights of twenty-first-century Shanghai: skyscrapers, elevated highways, narrow alleys, streets lined with Chinese parasol trees.\nRuofei caressed the illusory city. The thin membrane of the bubble deformed under the pressure of his hands: the skyscrapers twisted and bent, the horizon undulated. He pressed harder; the membrane stretched thinner.\nA sudden burst of fluorescent blue text, and the city swayed, creased, collapsed, dimmed. The translucent bubble, like a shed snakeskin, fell in heaps to the ground.\nThe sight revealed behind the collapsed membrane astonished him. He was standing in the middle of a space that reminded him of a sports stadium. All around him were rings of rising seats, in which countless maggot-like shadows wriggled. Blinding flashes came to him from every direction, and he shaded his eyes, unable to see anything. Some kind of noise-canceling system seemed to have been suddenly shut off, and he was inundated by waves of wild cheers and applause.\nThe cheers were at least human. He sighed with relief. Almost subconsciously, he bent down and covered his privates, realizing that he was nude.\nThe cheers grew even louder, now also mixed with laughter. Abruptly, all noise ceased.\nA cacophony of male voices followed, speaking simultaneously in multiple languages. Somehow, Ruofei realized that the voices were introducing him to the crowd. Spotlights highlighted his nude body, and he wanted to escape back into his own room—but when he turned around, he found only emptiness. He was like a monkey who had been shaved smooth all over, exposed to the gaze of an innumerable multitude. He almost fainted from the shame.\nA figure appeared some distance from him at the center of the stage and approached slowly. From the shape of the body, he realized that it was a woman. Her head was bald, decorated with strange, complex patterns. Her features suggested a Eurasian heritage. At first glance, he thought she was also nude, but as she got closer, he realized that she was covered by a skin-tight membrane that gave off a shimmering sheen as the light changed with every step.\nAstonished, Ruofei made no move. The woman walked up to him, holding up a football-shaped device. She aimed it at him, and a spray of mist shot out of the nozzle. He covered his face with his hands and squeezed his eyes shut, terrified that the spray was poisonous.\nNothing happened.\nHe opened his eyes and saw that where the spray had struck his arms, a thin membrane had precipitated against his skin, plastic-like, but far lighter and breathable.\nUnderstanding dawned on him. Embarrassed, he stood up straight, keeping his hands over his privates as the woman continued to spray him, covering him in a new outfit—though the outfit was crotchless, as he refused to move his hands.\nAn odd expression appeared on the woman’s face as she reached out and shoved him. He stumbled, his hands shooting out to keep from falling. By the time he had recovered, the woman had managed to spray a patch over this most critical part of his clothing.\nShe handed over a tiny device shaped like a termite with a long abdomen. She pointed at her ear.\nStill confused, Ruofei placed the device in his ear. The woman began to speak, and in his ear, Ruofei heard proper Standard Modern Mandarin. The words didn’t match the movements of her lips, as though he was watching a dubbed film.\n“I’m your mate,” she said. “Azul450-Qin-Ye.”\nThree hundred years have passed.\nDu Ruofei stood in front of the floor-to-ceiling window of the apartment, gazing at a completely changed world. The same thought looped through his head.\nHis mother had given birth to him at the age of thirty-four, a premature, frail baby delivered by C-section. The only good news was that he was alive. The bad news, however, came in an unceasing stream in the following years: after a botched flu vaccination, he was diagnosed with a rare neurological disorder involving loss of control over his facial nerves; when he was five, his parents divorced; when he was eight, the principal of his school persuaded his mother to withdraw him because so many parents had complained that their children were suffering nightmares from looking at his face; between the ages of ten and seventeen, the long middle-school and high-school years, he suffered more than the usual share of pain and endured the nickname “Poker-Face”; at seventeen-and-half, he was rejected from art school as the result of a face-to-face interview, and could only specialize in foreign languages at a night school.\nAny normal person would have blamed all of his misfortunes on that flu epidemic.\nHis eyelids did not close completely, and the left corner of his mouth was skewed, giving his face the general appearance of a sloppy rubber Halloween mask. Years of acupuncture and physical therapy improved his control over the twitching eye muscles—as long as he didn’t try to smile.\nOver its long history, humanity evolved a marvelously sensitive system for processing facial expressions. At a glance, one could tell the subtle difference between an insurance salesman’s fake grin and the genuine smile triggered by a sweetheart’s bouquet. An electric shock to the face and a good joke would both cause the zygmaticus major muscles to contract, pulling up the corners of the mouth into a smile. The secret, however, lay in the orbicularis occuli muscles around the eyes. Only a smile from the heart would contract these muscles to tighten the cheeks and pull down the brows, leading to subtle creases around the eye corners.\nEarlier in his life, Ruofei had locked himself in the bathroom to practice his smile in the mirror. His mother suspected him of masturbating because whenever the door opened, his face was filled with an expression of empty melancholy.\nSince the orbicularis occuli muscles couldn’t be consciously controlled, the human mind was primed to notice this detail and tell real smiles apart from fake ones. But for Ruofei, since his orbicularis occuli muscles stayed loose, he could smile only one kind of smile, the kind deemed fake by everyone.\nHis smile was thus the source of all his tragedy.\nMany times, his mother cried in private for his condition, but she never shed a single tear in front of him.\nOne time, when he was five, he lay in bed and heard his father scream He doesn’t even know how to smile! Then the sound of a slap to the face, a long silence, the slam of a door, followed by suppressed sobs. With all his strength, Ruofei, lying in darkness, forced a grin onto his face, but his father never returned.\nAfter his mother had completed the paperwork to withdraw him from school, she cursed and swore the whole way home. His small hand, squeezed so tightly in his mother’s grip that it hurt, felt the tremors of her pain. His mother never once turned to look at him.\nA bald man who claimed to be an expert at curing neural disorders ran into him in the hallway of the tiny hotel. He leaned down to squeeze Ruofei’s cheek. You smile just like your mother. His mother stayed in the bathroom for over an hour, and the sound of running water never stopped.\nHe knew all of it.\nHe could imagine the many silent weeping hours that still awaited her.\nHe decided to end this tragedy, to give his mother a chance at bowing out of the show. He imagined all the ways he could kill himself, and the method that called to him the most was to suffocate by overdosing on laughing gas. Such morbid humor was perhaps the only way he could imagine giving value to the world. Out of cowardice, or perhaps courage, in the end he chose the gentle exit of leaving his mother behind to pursue a new life in the big city.\nThree hundred years earlier, he was a lonesome man living at the periphery of society. Away from family and friends, he struggled to make a living. But life cast him aside and imposed in his way obstacle after obstacle. His dreams, like soap bubbles, expanded and then burst, leaving no trace.\nThen, overnight, everyone called him fortune’s favorite, just because he won the lottery that would allow him to leave the old world behind.\nAzul450-Qin-Ye’s slender fingers brushed across Ruofei’s left eye, as if seeking proof of the truth of his story.\n“You are cool,” she said. “You’re not at all like the others. You’re brand new.”\nNo one had ever described him that way. In his memory, from the time his father left, everything in his life was old, used up. Beat-up backpack, worn pencil box, used textbooks, frayed clothes handed down from older cousins, his father’s old shoes loose on his feet, socks so tattered that the patches had patches . . . he felt that even his heart was ancient. From the moment his parents had separated, he no longer grew, but only aged.\nYet, this “mate” from three hundred years in the future called him “new.” He found it incomprehensible. In fact, in this brave new world, the meaning of “mate” was also brand new.\nThe woman told him that since the birthrate had fallen so low, she and others like her had all been grown in incubation vats. “Azul450” designated her genotype, while “Qin-Ye” commemorated the family names of her foster parents. However, she preferred to be called “Jingjing” by her friends.\n“In my time, that’s the sort of name we give to pandas,” said Ruofei.\n“What are those?” she asked, utterly confused.\nHe realized then that pandas had probably long since become extinct, though he had seen many fantastical animals parading through the streets. This new world’s biotechnology had advanced to the point where new creatures could be assembled like Lego blocks, but the people seemed to lack interest in extinct species such as pandas, dinosaurs, mammoths, and dodo birds.\nThis was an age that worshiped novelty above all else.\nAccording to Jingjing, the practice of bonding for life (or at least intending to be bonded for life) had disappeared. Mates negotiated and determined the duration of their time together. Monogamy had been abolished, and the law protected one-to-many as well as many-to-many limited-time bonds.\n“In my time, this would have been considered a sign of fickleness in one’s affections,” said Ruofei.\n“We think of it like this—” Jingjing spat out a string of syllables, a word he didn’t know. The basic idea was something like this: the old is already a part of me; only the new can unlock the potential of the future.\nRuofei thought this over.\n“If you don’t like me, we can terminate the bonding agreement at any time and find you a new mate,” said Jingjing. “You’re our guest, after all. We have a duty to make you comfortable.”\nJingjing’s expression was so guileless that Ruofei looked away in embarrassment.\n“How . . . how did they pick you to be my mate?”\nJingjing’s face lit up—even the patterns on her forehead began to swirl and change.\n“I won the lottery!”\nAha, thought Ruofei. Apparently some things never change. But he had a more important question.\n“What happened to the other hibernauts?”\nJingjing looked away. “You’ll find out . . . at the appropriate time. I can tell you that you’re the only one who’s ever awakened.”\nRuofei pondered the many possibilities encompassed by this answer.\n“There’s something else you should know.” Jingjing pointed above their heads. “Thawing you out and maintaining your lifestyle both require funds. We’ve decided to grant your livecast rights to the three broadcast networks. A portion of the income generated by advertising and pointcasting will be directed into your personal account.”\nRuofei glanced up at the glowing ceiling. He couldn’t see any cameras, but he figured that saying “no” at this point wasn’t a possibility.\n“I understand,” said Jingjing as she put a hand on his shoulder. “People from the past had a kind of obsession with ‘privacy.’ They were . . . overprotective of the sense of self. Believe me, put that old self away. You’ll be rich.”\nAs though suddenly remembering something important, she added, “At least you now have the possibility of becoming whatever you want to be.”\nDuring the past three hundred years, two total wars and over four thousand regional wars had erupted over the surface of this planet. At least once, the world stood on the brink of nuclear annihilation. Three times, extreme ecological crises threatened mass extinctions. Governments and borders changed countless times.\nIn contrast, technological progress, made by generations of scientists standing on the shoulders of giants, had been steady. There were multiple breakthroughs in materials science and biotechnology, but due to the destruction of high-energy particle accelerators in war, theoretical physics never developed to the point of enabling interstellar flight.\nFor Du Ruofei, however, none of this was as important as one particular development.\nHe gazed into the perfect face in the mirror. The features were flawless, symmetrical. His eyes shone like the glint off the edge of a sword. His nose was straight and refined. The most striking feature was his mouth, whose lips were of just the right thickness. He smiled, and two sensual dimples appeared on his cheeks. Bright, impossibly straight teeth peeked between the lips.\nHe pulled back from the mirror, and the augmented reality effect disappeared, returning his face to its habitual, unnatural state, full of flaws and pockmarks. He glanced away, as though seeking an escape.\n“How do you like the face I picked for you?” asked Jingjing.\n“It’s . . . good. Except . . . except that it doesn’t look like me.”\n“This is the most popular face this season,” said the sales clerk. “We can always make minor adjustments once you start wearing it. It takes just an hour to fix the mold. And if you get sick of it, we offer two free exchanges.”\n“Why don’t you give it a try?” said Jingjing encouragingly.\n“Let me think about it.”\nRuofei was unsettled by this world, full of men and women more handsome than any he had seen in his life. But the repetitiveness of aesthetic perfection was exhausting him. When everyone sported perfectly symmetrical features cut to the proportions of the golden ratio, it was the imperfect faces that struck deeper impressions.\n“How do you recognize anyone if they are constantly changing their shells?” he asked Jingjing.\n“The superficial features may change, but poses and subtle habits don’t, and neither does the timbre of the voice. Retina patterns and DNA sequences are constant. All these are stored in a central database. You can look up anyone’s data when you meet them.”\n“Don’t you find it odd to see someone else with the exact same face as yours? Or to see your lover changing looks? In my time, there was a superstition that the moment you meet another person who looks just like you, you’ll die.”\n“Like I said—”\n“The old is already a part of me; only the new can unlock the potential of the future.”\n“You’re a quick learner.”\n“But I still can’t get used to it.”\n“Then let me wear your face tomorrow. I’ll help you adjust.”\n“Don’t! I can’t stand this face.”\n“Then change to something new.”\nRuofei said nothing. He had run out of excuses to resist, but the pull of traditions from his previous life forced him to ask one more question. “What if I want to change back?”\n“Anytime, anywhere.”\nDu Ruofei, the time traveler who came from three hundred years earlier, was the most coveted guest in this new age. He was invited to all kinds of events, where his stories of the strange customs and practices of the ancient past fascinated audiences. Any party without Du Ruofei could not be considered truly first-rate.\nAt the opening ceremony for a somatic singing competition, Du Ruofei was invited to perform a song from the twenty-first century. He chose the theme song from the last Olympics he could remember before going into hibernation.\nHe thought of it as the last song of the old world, for that world had ceased to exist the moment he entered the hibernation chamber.\nThe number of viewers crested as he sang the chorus, though many had complained to the broadcasters that Ruofei’s singing was upsetting their digestion as well as their pets. But polite applause still filled the venue.\nDu Ruofei, now preternaturally handsome, and Azul450-Qing-Ye, in an elegant evening gown, walked together into the VIP section. The competition consisted of each contestant generating vibrations from different parts of their body, which, after processing by a snail-shaped synthesizer called an Auto-Soma, was turned into a symphonic soundscape. To enhance their somatic singing, the contestants had implanted into their body various objects of different materials and acoustic qualities. Integrated into muscle and bone, the implants turned each body into a unique musical instrument.\nListening to the eerie music literally made the hairs on the back of his neck stand on end, but Ruofei maintained his mesmerizing smile.\nAt an exclusive party, Ruofei described for the guests his life in old Shanghai: squeezing onto the subway, queuing up to buy lunch at a 7-11, downloading pirated films, translating meaningless clickbait celebrity gossip, watching couples kiss in the street, running to get home before the rain, showering, and sleeping. When the guests heard that the average Shanghainese would spend more than fifteen hours a day working, they gasped in shock. Some had been so stunned that they forgot to suck on the tubes next to their mouths that dispensed simulhol.\nAnd when he mentioned that sometimes he would call his mother at home but find himself with nothing to say, the elegant ladies made exaggerated sad faces to show how much they were touched.\nI guess three hundred years aren’t that long, thought Ruofei.\nGradually, he grew to like and to even crave such performances. Wasn’t this exactly the life he had wanted so much in the old world but could never obtain? To dress up every day, to dine on fine delicacies, to mingle with the famous and powerful, to be constantly bombarded by the new. The elites who invited him were so skilled at subtle manipulation via words and expressions that he often felt eerily pleased with himself, as though he oozed wit from every pore.\nJingjing explained that the elites were not bred in incubation vats. Their origin was in fact shrouded in mystery. As children, they were implanted with precise neural programming for language and body expression so that, as adults, they would fulfill their social interaction duties and perform the prescribed etiquette routines with perfection. They were social managers under management.\nThe real authorities, the ones who made the rules, lived in a space station in near-Earth orbit. People on the surface could only communicate with them from a data tower on the north coast through an encrypted satellite link.\nThere was one time, Jingjing recalled, when those tightly-controlled facial muscles had seemed to malfunction, and the elites had worn expressions of terror and embarrassment.\nOn one occasion, as Ruofei entertained his audience with tales of how in his old life, to save money, he had removed the lightbulbs from his apartment, unplugged all uncritical appliances, and even dimmed his computer screen until he could barely make out the text, a scholar suddenly interjected, “Sounds like something a three-legged crow would do.”\nEveryone present laughed.\n“What’s a three-legged crow?” asked Du Ruofei. Surely the scholar meant something other than the mythological creature from ancient tales, symbolizing the sun?\nThe laughter stopped abruptly. People exchanged looks, but no one answered him.\nJingjing squeezed his hand and whispered, “I’ll tell you later.”\nRuofei suddenly had the sensation that even this perfect world had its own cracks and seams.\nThe Three-Legged Crow was a group of extremists that threatened the security of the world order. They viewed modern technology as the enemy and sought to destroy automation systems and consumerism. The Three-Legged Crow had its own system of quasi-religious beliefs, with the preservation of the so-called “essence of humanistic civilization” as its ultimate goal. Since their opponent, the modern world, was far too powerful, members of the group could only eke out a living in distant, rural wastelands, waiting for a chance to strike at the heart of civilization.\n“So . . . are those in the Three-Legged Crow evil?”\nJingjing’s eyes flickered in the dim light. “I think . . . they just view the world differently.”\n“Why did everyone look at me so strangely earlier?”\nA long sigh. And then, “Members of the Three-Legged Crow attacked the base with the hibernation chambers. You’re the only survivor.”\nRuofei’s heart clenched. He understood everything.\nDriven by an irresistible curiosity, Ruofei gathered all the information on the Three-Legged Crow he could find, but as could be imagined, there wasn’t much. Moreover, from different sources, he got different, conflicting impressions that left the group even more mysterious in his mind.\nHe found himself changing.\nHabituating to the endless pursuit of the new meant also habituating to an interminable sense of weariness and dissatisfaction. He was tired of his possessions and clothes, which could be changed whenever he wanted, tired of his own face, tired of even Jingjing, despite her constant efforts at renewing herself. Her skin, once a glowing vision of perfection, seemed to dim in his eyes day by day, revealing intolerable flaws. He knew this was the mechanism by which boredom operated in the brain.\nThere must be something constant under this inconstant exterior, he thought. Though he was beginning to doubt whether he knew the real Jingjing at all. Surely she was also fighting her own war against boredom?\nSeveral times, Ruofei almost brought up the topic of changing mates, only to swallow the suggestion at the last possible minute. Like a baby bird being imprinted, a kind of unique bond connected him to her, the first human being he met in this new world. This was a bond that could not be replaced by any sense of novelty.\nFrom time to time, he thought about his father. A kind of rebelliousness, rooted in the old world, was perhaps the real obstacle to his completely embracing this new way of thinking. He did not want to become like his father.\nSide effects followed: headaches, nausea, but there seemed no clear cause. Finally, after a psychedelic art exhibition, as he vomited in front of a glass wall, he watched the reflection of a beautiful but unfamiliar face approach from behind his own beautiful but unfamiliar face—Jingjing, who had just changed faces again.\n“Do you need medicine?” she asked.\n“I don’t know. I’ve never had this happen before.” He cleared his throat, and the effort hurt. “I feel bloated, or maybe my body just isn’t adapting. Do you ever travel and feel out of sorts?”\nJingjing shook her head. “You need to be checked.”\nAn instrument that reminded him of a white octopus wrapped its arms around him and tentacles probed into his orifices. They were smooth, pneumatic, simulating the feeling of human skin and body temperature. He felt a series of tremors before the tentacles pulled out.\n“I see,” said Jingjing, glancing at the data streaming over a transparent membrane. “You’re overloaded.”\n“What?”\n“The human mind has its own bandwidth limit. Being stimulated by too much information will lead to rejection reactions, manifesting in symptoms of suboptimal health. This is a theory long accepted since the last century.”\n“What can be done?”\n“You can clean.” Jingjing showed him a flat, thin slate, on which the information he had been exposed to that day was categorized and sorted: social encounters, VIPs, newsworthy events, rituals, trivia, emotional experiences, dreams . . .\n“You can delete whatever memories you no longer need. Throw them into the trash and empty it to reduce the cognitive load.” Jingjing’s golden eyes stared at him. “But you can’t do this because your brain comes from the past. You don’t have the implant port for the memory-manager. Unless . . . ”\n“Unless what?”\n“You agree to undergo surgery.”\nInside and out, Du Ruofei was now a new man.\nEvery day, he set aside some time to delete unnecessary memories, leaving more room for fresh experiences. He got rid of memories of anyone he met who wasn’t deemed important—even if they met again, it was no big deal to repeat the ritual of mindless introductions. Polite social conversation about the weather—delete. Repetitive sights in the streets—delete. Nostalgia triggered by recounting stories about the past—delete.\nHe didn’t need to be weighed down by the past. He was a new Du Ruofei, a machine skilled at piecing together bits and pieces of the old world into exotica for the delectation of the new world.\nYet, the invitations for him to attend fashionable parties and cool gatherings slowed to a trickle.\nHe hypothesized that in this novelty-obsessed world, the sensation of newness he generated was fading, much like the impression left by foamy surf on the beach, the sweetness left by candy at the tip of the tongue, the warmth left by Jingjing’s fingers on the skin of his chest.\nWhat was going to happen to him? Could he integrate into this world as an ordinary man? Somehow, he sensed a subtle change in the way others treated him. There was a polite distance, tinged with a hint of fear. He heard rumors that he was the next target of the Three-Legged Crow, though no one knew what they planned.\nRuofei had never imagined that his own name would one day be linked to a group of anti-government extremists. Based on the news streams he had tapped into, members of the Three-Legged Crow were fanatics who relied on violence, assassinations, and kidnappings to express their ideas. They believed that the only hope for humanity was to cast off the chains of all technology and material wealth, to return to nature and find true inner peace in the wilderness.\nFrom the blurry, shaky footage of their violent attacks, he saw shadows of the old world. He grew terrified.\nIt happened when he was delivering a commencement address.\nIn this new world, there were still institutions that served purposes similar to schools—or maybe it was more accurate to describe them as summer camps. Students were free to pick from among tens of thousands of different classes. There were no teachers. All teaching materials were presented via augmented reality. Students assembled into groups based on common interests and completed research projects suggested by the material. It was said that these educational institutions prized students who worked well with others and helped each other.\nPredictably, Ruofei gave a speech excoriating the old world’s rigid, hidebound school system: foolish teachers, useless and boring information, the only thing worthwhile being rebellious classmates. He even made up a story of his first love. For four years, he admired a girl from afar. Each day, he watched her take her seat by the bright rays of dawn and depart from it under the gentle glow of the moon. They had never spoken to each other. Even an inadvertent touch or an occasional, accidental eye contact would set off fireworks in his mind.\n“However,” he continued, “in my imagination, we held hands, kissed, got married, raised kids, grew old together. It was a most marvelous memory, even if it never took place.”\nHe stopped and waited for the applause, but only silence greeted him. Something wasn’t right.\nAmong the sea of perfect, young faces, one stood up. Hesitantly, he asked, “Do you think people were more satisfied with that kind of old-fashioned relationship? Or . . . maybe what I really want to ask is this: as the only person who has experienced both the old world and the new, which era has made you happier?”\nUnprepared for the question, Ruofei struggled to come up with an answer. But just as he was about to speak, the MC rushed over to say that due to time constraints, they had to end Ruofei’s speech right away. Students grew agitated in their seats, and dissatisfied murmurs filled the hall.\nLater, in the darkness, Ruofei glanced at Azul450-Qin-Ye, lying next to him in bed. By the faint glow of the metropolis outside their window, her new face was another vision of perfection.\n“Are you happy?” he asked, uncertain what answer he preferred.\nSlowly, Jingjing opened her eyes, as though expecting this question all along.\n“Why haven’t you asked to change your mate?” she asked. “You know you can do it any time.”\nAfter a moment of silence, Ruofei said, “You are not a shirt, a gadget, a goldfish, or a plant—I can’t discard you the moment I want something new.”\n“I don’t understand.” Her voice was confused, uncertain.\n“I don’t understand either. Maybe I’m too old-fashioned. Can’t keep up with the world—”\nThe passionate kiss stopped his words. The woman who embraced him seemed a stranger who cared nothing for the rest of the world. It was as if a shell that had imprisoned her had fallen off, as though some wild beast roared from the depths of her soul.\n“You’re special,” Jingjing panted. “Maybe they’re right.”\n“Who are they?”\nJingjing subtly glanced to the side, reminding him that the livecast cameras behind her were still on.\n“They are the ones who let you become who you are.”\nUnderstanding dawned on Ruofei. “I want to see them,” he growled. His fingers dug into Jingjing’s skin.\nJingjing let out an animal-like howl. She closed her eyes, as though two gems had been covered by black felt.\nShe moved against him, speaking to him without words. Be patient. The opportunity will come.\nA global athletic competition was going to be held soon. It was called the “Olympic+ Games.”\nUnlike the old Olympics, the new games no longer limited competition to the human body’s capacity for speed, strength, and technique; instead, the emphasis was on integration with new technology. Thus, the games, held once every four years, were an opportunity for medical equipment manufacturers, arms dealers, and genetic engineering firms to show off their newest products. The contestants, like superheroes, upgraded their bodies to pursue new records unbounded by the limitations of the human body.\nRuofei was asked to deliver a speech at the opening ceremony.\nHe turned down the honor.\nHis refusal became a topic of speculation. Some thought that he had received threats from the Three-Legged Crow; others whispered that he was bored with his life. Rumors even spread that he had requested to be returned to hibernation.\nRuofei refused to answer any questions related to his decision, deepening the mystery.\nFinally, the invitation that he could not refuse, the invitation that he had been waiting for, came. It was from the space station, and Jingjing was asked to take him to the data tower.\nWe know you have questions. We’ll answer.\nThe data tower was on the northern coast. Even in high summer, the foam from the pounding surf solidified into white frost in midair, and, blown by the strong gusts, tumbled along the beach like fragile creatures chasing one another.\nThe high-speed train didn’t go directly to the tower, so the two of them had to hike along the slate-gray sea, leaning into the cold gale and getting buffeted by sheets of hail. Their footprints persisted for mere seconds before the wind wiped them away. The wind also made it impossible to talk, so they struggled on in silence. The tower, a central column with radiating support pylons, rose from the water and pointed into the sky, glinting white like a seashell.\nBefore they entered the security gate at the base, Jingjing explained to him that no cameras were allowed inside. Thus, the livecast would be paused for the duration and be substituted with other programming.\nThey rode the elevator to the floor specified in the invitation. After multiple security checks to verify their identities, the pair stood in the communication chamber. There was no visible machinery or input surface, and random geometric figures flowed across the spherical ceiling. Supposedly, this setup wasn’t intended to protect the equipment but to safeguard the fragile nervous systems of the human users.\n“Be careful.” Jingjing looked at him as though she wanted to say something more. Then she withdrew, leaving him alone in the room.\nThe patterns in the ceiling changed. Now they resembled undulatus asperatus, the roiling clouds before a storm.\nWelcome, Mr. Du. We’ve been observing you for some time. It’s good to finally meet face to face.\nThe voices, speaking in sync, were androgynous.\n“Great to . . . meet you too. But I must confess that I don’t understand the purpose of this meeting.”\nThe parameters of your behavior model have been displaying some wild swings in the last few weeks. We cannot explain such shifts unless you are harboring doubt. Your doubts, unresolved, may become everyone’s doubts.\n“I doubt I’m as influential as all that.”\nLet’s get to the point then. You’re threatening our entire value system.\n“I think . . . I’m just not used to this new way of life.”\nA sudden feeling of absurdity seized Ruofei. He was literally trying to justify monogamy to the ceiling.\nNo. You’re doubting the very foundation of this world. That is why your body is showing signs of rejection.\n“I’m not—”\nLook at yourself!\nCountless faces appeared on the ceiling.\nThe refined, handsome, perfect faces drifted across the ceiling like tentacleless jellyfish. Each was a face that Ruofei had tried at one time or another. At this moment, all the mouth corners drooped and eye corners stiffened, smiling in that empty, anguished, false manner.\nPained, Ruofei lowered his eyes. But beneath his feet was another familiar but also strange face. He squeezed his eyes shut.\n“Why are you doing this to me?”\nBecause you’re special. You bear a responsibility to this world.\n“I’m nothing more than an outcast who won the lottery. I had no choice.”\nWhen in Rome, do as the Romans do. Right? Why can’t you perform your role as an idol like you’re supposed to?\nRuofei began to laugh. He couldn’t help it.\n“No, you’re the fool, sitting up there on your throne in space like some despot of old. Your people are tired of this life of endlessly chasing the latest and newest. They can’t see a future in it. They want another possibility.”\nAnd you’ll provide them that?\n“I’m only speaking the truth from my heart.”\nThe ceiling dimmed, as though the speaker at the other end of the link was deep in thought. The pause grew so long that it became suffocating.\nRuofei leaned against the wall and sat down. The whole room glowed with an anxious red.\nWe’ve made a mistake in our calculations concerning you. We have to correct the error.\n“What correction?” Ruofei realized that he could no longer move his feet.\nA minor surgery lasting only a few minutes. You won’t feel a thing.\n“Don’t even think about it!”\nRuofei fought against the invisible force immobilizing him, but the more he struggled, the more stuck he became. Suddenly, some force dragged him toward the center of the room and held him there. From far away he heard knocking noises as well as the faint voice of Jingjing.\n“Jingjing! Help!”\nA smooth tentacle dropped down from the ceiling, nimbly twisting as it sought the brain port at the base of Ruofei’s skull.\n“I’d rather be killed by the fanatics from the Three-Legged Crow!” Ruofei grimaced and dodged the tentacle.\nAll of a sudden, the mysterious force disappeared. Ruofei collapsed to the ground.\nHow can you—\nBefore the voices could finish, the floor beneath Ruofei whorled open. He was pulled into the hole, and, as though guided by a transparent tube, slid through the many floors in the tower like a bullet shot down the central column. Faster and faster he plunged, and he felt his innards flattened by the acceleration until, with an abrupt turn, he fell into endless darkness.\nAs he suddenly sped up again, he lost consciousness.\nRuofei was watching a film starring himself. All of the scenes were so strange, so illogical, as though cut from films from different genres in different periods, spliced together randomly, and then played back as a long, under-cranked reel.\nHe saw himself being stuffed into a silver hover car by people dressed in black. The hover car then swept with incredible speed through mountains, valleys, tunnels, highway recharge stations, streets and alleyways until it reached a beachside concert that had just ended, with scattered bottles and cans on the sand, simulhol dispensers, quick-mold masks, aphrodisiac sticks, and used injectors glinting everywhere like seashells. A speedboat rushed toward the coast, hopping over the waves.\nThe black-clothed people carried Ruofei onto the speedboat. Like a twitching sperm, the speedboat raced toward a large ship in international waters. He was lifted high by a crane and then gently deposited into a coffin.\nMen and women dressed in elegant clothing from a bygone age sat around a stage, among them a beautiful man who smiled at him, revealing shell-like teeth. Spotlights swung to focus on the coffin at the center. After a drumroll, the coffin cover slowly slid open, revealing his sallow, deformed old face. The audience called for him to smile. He obeyed, and sustained applause followed.\nMusic, champagne, dancing, singing . . .\nA beautiful woman led him through the narrow and twisted hallways of the ship. Just before they entered her cabin, another woman stopped them. The first woman shouted in rage, and summoned sailors to tie up the second woman, stuffing her into a large cask. Apparently the first woman was the captain’s lover. Ruofei stared at the woman in the cask, thinking that she seemed somehow familiar. Before they pushed the cask off the side of the ship, the woman inside cried. Suddenly, Ruofei realized that the woman’s face was one of the many once worn by Jingjing. The cask sank into the water and then floated up, bobbing as it disappeared into the darkness.\nFinally, the ship reached the end of its long journey and docked at a harbor. They crossed dense tropical forests, dirty slums, neon-lit commercial sex districts, and entered a magnificent palace, where nearly nude men and women cavorted in sacred dances to outlandish drumbeats. They surrounded Du Ruofei and lifted him into the air. A woman wearing a black veil appeared, and everyone knelt to her. Ruofei saw that on the back of every neck was a tattoo of a three-legged crow.\nThey pushed Ruofei to stand in front of the woman, whose eyes shone with an eerie golden light.\nShe lifted one hand and pressed it against Ruofei’s chest. He closed his eyes, expecting his chest to be torn open and his heart ripped out.\n“Are you happy?” the woman whispered.\nShocked, Ruofei tried to open his eyes. But the hand gave him a gentle shove, and he fell backward.\nThe same scenes began to run in reverse in rapid succession until everything faded to black.\nAn acrid smell filled his nostrils, waking him. He found himself in a tiny hut. There was no palace, no woman in a black veil. There was only a crude wooden bowl bubbling over what was left of an open-pit fire.\n“You’re finally awake.”\nHe turned at Jingjing’s voice, but he saw an unfamiliar face lit by the soft light of dawn.\n“This is the original me.” The woman drew close to him. It was a plain, imperfect face, but a face that struck him with inarticulable power.\n“ . . . I hope you don’t mind.”\nRuofei hadn’t realized how long it had been since he had seen an unmodified face. He was touched.\n“Not . . . not at all,” he said. He felt clumsy as he tried to assemble the words. “Where am I? What happened?”\n“This is the wilderness, far from the panoptic gaze of the space station. Three days ago, you were almost turned into a puppet. We rescued you.”\nHe lowered his gaze and saw the three-legged crow tattooed on Jingjing’s arm. His face froze.\n“Have you been lying to me all this time? Why?”\n“Listen to me. I can explain.”\nHer voice was as placid as the sea before dawn.\nThe Three-Legged Crow wasn’t nearly as fanatical or violent as rumored. Members believed that a spiritual nature pervaded all beings, so that worshipping idols or any infallible authority was a laughable error. There was a compact that bound all things in nature, and humanity was merely one party to the compact, no more noble or special than any of the other parties. The technology-driven novelty-lust promoted by the new world was not only damaging to the relationship between humanity and nature, but also disruptive of the common web of bonds between all creatures and their environment.\nWorse still, humanity thought of itself as the only subject. Lost in an endless narcissistic dream, humans maintained only a compact with technology, having abandoned the capacity to connect with the wider universe.\n“We call that capacity wildness,” said Jingjing. She bit her bottom lip, as though trying to forget some unpleasant memory. “In order to successfully integrate into the new world, you have no idea how much training I had to undergo to disguise my wildness under a veneer of so-called ‘civilization.’ I was absolutely disgusted.”\nRuofei finally understood the source of the odd quality he had detected in his mate.\nIn a society devoted to the pursuit of the new, some must be out of fashion. Each bored soul was potentially a recruit for the Three-Legged Crow. Like cancerous cells slowly dividing, they infiltrated every nook and cranny of the new world. Azul450-Qin-Ye was one of them.\n“So . . . you’ve been acting with me all along.” Ruofei felt wounded. “I suppose acting is the custom of the new world.”\n“Yes and no.” Jingjing didn’t avoid his gaze. “You’re extremely important to us. You’re a man from outside of our era. You can influence many with your observations, your stances, your choices.”\n“Then why did you kill all the other hibernauts?”\n“Lies.”\n“But you’re the one who repeated those lies to me.”\n“No, you don’t understand.” Jingjing dropped her gaze. “You’re special . . . to me.”\n“If I had petitioned for another mate back when you first brought up the idea, would you still think I’m special?”\n“Are you certain I’m still the same woman as the Azul450-Qin-Ye you knew then?”\nRuofei had no response to that. Jingjing held his hand.\n“You are that man. Help me.”\n“I’m no one. I’m nothing. How can I help you?”\n“You’ll find out. But we need to get going. It’s almost time.”\nBack in the old world, Ruofei had never experienced such landscapes devoid of signs of civilization.\nRiding on giant deer-like creatures, they departed from the Three-Legged Crow camp and passed through a kingdom of wildness birthed by time and gravity. The kingdom’s history was far apart from human rationality, and yet it was also full of the chaos, lusts, taboos, and ignorance projected thereon by human nature. Order emerged in places far older than Hammurabi’s code and Solon’s laws; mountains and rivers moved in accordance with their own regularity, merging into oneness. The bodies and treasures buried here bore witness to the process by which humanity emerged from wilderness and then returned to it in another form. Countless living things nested and multiplied here, generations without end.\nThe weather was unpredictable, temperamental. Ruofei found the extreme variation difficult to adjust to, but Jingjing seemed to find delight in the uncertainty itself.\n“Life in the new world is rich but empty. We look at nothing but ourselves, thereby cutting off our links to the world and everything in it. Rocks, clouds, and our bodies are all reflections of nature’s laws. Only when we’re completely immersed in them can we appreciate their beauty and become aware of the entirety of the system’s meaning, including the irrational, the corrupt, and the cruel.”\nAs she preached, Jingjing also showed him how to eat a wriggling larva to derive nourishment.\nRuofei missed most the automatic shower stall.\nFinally, the journey took its toll. Ruofei fell ill. His face turned as pale as the larva, and his body trembled like a cicada’s exuviated shell dangling in the wind. Jingjing squeezed a cup of dark green liquid out of a thorny plant and held it in front of Ruofei’s lips. He took one whiff and vomited.\n“Trust me,” said Jingjing, her eyes full of love. “Drink it.”\nRuofei drained the cup in one gulp.\nHe fell into a bottomless abyss. He was stabbed by needles, drowned, burned, shocked, bitten by chitinous jaws.\nHe saw a giant three-legged crow spread its wings to cover the sun. Black feathers fell to the earth, and, carried by streams and blood, passing through the food chain and nervous systems, entered the body of every person, leading to violence, instability, massacre, chaos.\nWith a shock, he realized that the wilderness was the only true form, and the new world was but a projection. The moment a person stepped across the border between the two worlds was also the moment the human shadow turned into animal, river, rock, and grass.\nHe tried to describe this chaotic world using words, but the moment he spoke, all meaning disappeared like an intricate papercraft palace bursting into flames.\nHe fell into a coma, hallucinated, woke up, and then began the cycle anew.\nFinally, as he felt himself pressed to the limits of endurance, on the verge of a slumber from which he would never awaken, his soul was yanked from his body and hauled through an endless tunnel.\nA pale, creamy light glowed at the end of the tunnel.\n“You made it!” Jingjing was holding his sweat-drenched body, murmuring into his ear. “You’ll be fine now. You’ll be fine.”\nAs the sun set, they finally reached the edge of the new world.\n“Do you remember what you must do?”\n“First, I must turn you in to the authorities as the Three-Legged Crow spy responsible for sabotaging the data tower.”\n“Uh-huh.” Jingjing tilted her head to look at Ruofei with a smile.\n“Next, I’ll agree to deliver a speech at the opening ceremony of the Olympics+, though I should act as though I came to this decision reluctantly, after much psychological struggle.”\n“Very good. Continue.”\n“After my memory-manager reconnects to the network, encrypted data hidden in memories categorized as ‘dreams’ will take over and substitute the Three-Legged Crow’s declaration for the official text of the address. And then . . . ”\n“And then, your speech, livecast to every corner of the new world, will serve as a signal flare. Three-Legged Crow recruits across the globe, until now dormant, will rip off their disguises and show their wildness. Together, they’ll overthrow the tyrants in the space station. At that moment, you, Du Ruofei, will be celebrated as the hero from the wilderness . . . ”\n“And you’ll be careful, right?”\nJingjing nodded. “Nothing will happen to me.”\nThings did not go as planned.\nAt the border control station, Jingjing pressed her hand against Ruofei’s chest. Before a single heartbeat, she had been dragged away, and the two of them were shoved into two separate hover cars and sent on their way to the security center. Through the narrow windows on the hover cars, they could only see each other’s eyes. Jingjing’s eyes, lit by the golden fireworks that exploded overhead, were fearless and calm.\nThe hover cars became stuck among the parade floats celebrating the opening of the Olympics+. The enforcement agents had no choice but to take the two out of the cars, unshackle their feet, and bring them on foot through the jubilant crowd.\nRuofei knew that agents of the Three-Legged Crow had spread the news through the media that the Man Out of Fashion had returned and was about to deliver a speech. This was what had forced the authorities to act so quickly.\nRuofei and Jingjing made their way through the crowd slowly. Their tattered clothes and grimy faces made them seem like mendicant monks of old, but the crowd treated their unexpected costumes as a new trend in fashion. High on drugs and simulhol, the euphoric mob knelt down to worship them, and some even lifted them onto their shoulders.\nSurfing the crowd face-up, Ruofei turned to look at Jingjing, similarly adrift above a sea of people. The drumroll began, and they smiled at each other. Under the starry sky, they glided over this liquid humanity, passing parade float after parade float, each an island with its own distinct scenery. Dancers on the islands wriggled and twirled passionately, leaping through forests of rainbow-hued beams, scattering fluorescent confetti into the air.\nAbruptly, Jingjing sank out of sight and disappeared under the surging sea of bobbing heads. Ruofei rolled down from the crest of his own wave, but enforcement agents caught him and held him to the ground.\n“Don’t struggle if you want to see her again,” growled a low, rumbling voice.\nThey frog-marched him into the arena where the opening ceremony was being held. After a long, dark tunnel, he was pushed into the security center, lit bright as day. A group of elegantly dressed men and women waited for him as he was scanned from head to toe. He sat down, and a beautiful man sat across from him.\n“We’ve received orders to have you deliver the speech,” said the man. “However—”\nHe shoved a transparent slate into Ruofei’s hands.\n“—you must read exactly what’s written here. Otherwise, your wild companion will be—”\nThe wall facing Ruofei turned transparent, revealing Jingjing lying on an operating chair, a thick cable plugged into the base of her skull. Her expression was as empty as a puppet’s.\nRuofei tried to get up, but was held down.\n“Don’t worry. We’re all civilized people here. This isn’t your age.”\nAnother wave of cheers swept through the arena outside. It was almost time.\nRuofei glared at the beautiful man, his eyes spitting fire. In the end, he looked away. “I’ll do as you say.”\nThe beautiful man smiled and got up. As he was about to walk out the door, he turned around. “Remember to fix yourself before you get up there. This will be livecast to the whole world.”\nRuofei stared into the blurry mirror, trying to remember how many faces he had gone through. He failed, but he knew that the face he wore now would be the penultimate one, one worth remembering. He smiled at himself in the mirror, perfect and fake.\nMemories from centuries ago swept back in a wave. Is all this worth it?\nJingjing’s eyes flashed through the mirror.\nHe rubbed the special ointment over his face until his face from three hundred years earlier returned.\nAmidst thunderous applause, Ruofei slowly climbed onto the dais. Spotlights followed him as his pale, asymmetrical face was projected onto the giant screen. He smiled, and the crowd exploded into cheers. The media had been crafting the narrative that Ruofei was a hero who had escaped from the kidnapping attempt by the Three-Legged Crow. On the other hand, Jingjing, the sleeper agent, had been completely wiped from the story, as though she had never even existed.\nAfter his eyes had adjusted to the bright lights, Ruofei saw the VIP seats filled with elegant, beautiful men and women dressed in the clothes of a bygone age. The beautiful man who had threatened him sat among them. He smiled at Ruofei, revealing shell-like teeth.\nHe experienced a sense of déjà vu. Everything was as he had dreamed during his coma, except backwards.\nHe nodded, and the crowd quieted. The slate in his hand glowed, revealing scrolling text.\nPeople of the new world, fortune’s favorites! he read. His amplified voice sounded like the booming voice of the gods revealing an oracle. Camera flashes flickered in the dark seats, as though the twinkling stars had formed a ring around him.\n. . . Three hundred years ago, we used to have games like these. Back then, our motto was “faster, higher, stronger,” because we were slow, base, and weak. All pain came from physical deprivation and our imperfect bodies. Humans fought and oppressed one another for a place closer to the narrow apex of the pyramid. For so little, so many sold their bodies and souls, suffered unbearable horrors. We saw no way out—at least I couldn’t . . .\nHe waited for the encrypted data in his memory-manager to come alive.\n. . . Three hundred years later, you’re free from that old nightmare. You can change your home, your job, your mate, and even your body without a second thought. Your philosophy is to derive pleasure from each coming second. Your motto is, “newer, newer, newer!” On your faces, I observe joy and satisfaction that I’ve never seen. So when some of you tell me that you yearn for the past, I confess that I’m utterly baffled. Maybe I’m simply too old to understand. After all, a three-hundred-year-old brain is not the latest model . . .\nHe paused and surveyed the millions in the darkness who hung on his every word, as though he had rehearsed for this moment. Letters and words coalesced out of the darkness and floated in front of his eyes.\n. . . I can think of only one possibility. Ruofei read from the speech crafted for him by the Three-Legged Crow. Quickly, he glanced down at the thin slate and his face froze.\nThe slate was showing the exact same speech.\n. . . Your bodies, pulled by an irresistible tide, are surging toward the future, but your souls are anchored to the same place . . . you’re tired; you want to slow down, to take a break . . .\nStruggling to suppress his panic, Ruofei’s eyes darted between the two speeches, comparing and finding no contrast. His speech slowed and grew hesitant. Sweat beaded on his brow. Was this a joke or had he been deceived?\n. . . but always, a voice reminds you, faster, faster! Something new is ahead of you, and you don’t want to fall behind, to be out of fashion, to be forgotten . . . the voice never stops, because the force that propels you toward destruction is also the source of the voice’s . . .\nLife.\nRuofei stopped, staring into the darkness without expression, as though finally in possession of the secret of this world.\nA wave of noise, like the bursting of foamy bubbles when the tide recedes, gently swept across the arena. It was the sound made by all the electronics in the arena being destroyed by an EMP strike. All the lights went dark, and the audience turned into a panicked mob, pushing, shoving, climbing, scrambling over one another. Silver beams from emergency lights came to life outside the arena and swept across the clouds, illuminating the broken seats, the simulhol dispensers, quick-mold masks, aphrodisiac sticks, and used injectors glinting everywhere like seashells on a beach.\nSeveral people dressed in black dragged the stunned Ruofei off the dais and rushed through the emergency evacuation tunnel. A silver hover car was already in place. They pushed him into the car, and the car sped away at an incredible speed, through streets and alleyways, highway recharge stations, tunnels, valleys, and mountains.\nThe black-clothed people injected Ruofei with something. Gradually, he could no longer feel his body. He felt his consciousness stretching, expanding and extending in every direction until it was so thin and so diffuse, like fog or wind, formless, ungatherable, adrift.\nHe saw himself preaching from an altar. The faithful of the new world, draped in black capes, kept their heads lowered. A monotonous, cold electronic music swelled and ebbed like the tides—upon closer examination, it was the sound of millions chanting sacred scriptures. He felt himself growing smaller and smaller as the faithful in the congregation grew larger and larger until they were like a forest of statues, falling toward him. Their faces emerged from the shadows, and Ruofei found himself struggling to breathe—teachers, classmates, relatives, neighbors, convenience store clerks, garage mechanics, doctors, nurses, passers-by who looked at him oddly . . .\nAnd they smiled at him, all at once. That trademark, frozen, fake smile.\nIn despair, he curled up. There was no escape.\nA rumbling came from behind the faithful, followed by crisp or subdued crashing noises. The statues, like bowling pins, fell and broke into pieces. The smiles broke up into torn flesh and torrents of blood. His salvation screeched to a stop: a gigantic, silver hover car, its wings and windshield bloody and covered by scraps of flesh. The wipers came to life, clearing out a view of the inside of the vehicle.\nIt was his mother.\nHe wanted to hug her, but he found himself stuck in place, unable to take a single step. Two trails of bloody tears ran down her face. Slowly, oh so slowly, his mother swung a spade covered in wet sand. The metallic blade swept through the air, sloughing off tiny sand grains like clouds and birds, suspended in midair, their motion only detectable by the glint of the sun.\nThe spade struck the left side of Ruofei’s face, the sand ground against his skin, and his body was propelled into the air by that enormous force.\nEverything faded to black. He seemed to hear voices murmur.\nWake up, now. Wake up.\nRuofei came to a view of pure white. He found himself inside the communication chamber of the data tower. The room was completely empty except for him.\nHe tried to stand up. The effects of the drug hadn’t completely dissipated, and he felt dizzy, weak. He leaned against the wall like a fly about to drown in a sea of milk.\nHow do you feel? The booming voice seemed to pierce straight through his chest.\n“Why . . . why am I here?”\nYou’re actually dead. This is Heaven, or maybe Hell. It all depends on whether you cheated on your taxes.\n. . .\nYou’re not amused? I thought this joke was from your time.\n“I’m not in the mood. Did you bring me back here for the surgery?”\nOh, there’s no need for that. You’ve already served your historic purpose.\n“I don’t understand.”\nWhich part, exactly, don’t you understand?\n“The speech you forced me to make and the speech the Three-Legged Crow wanted me to make were exactly the same. Why?”\nThe Three-Legged Crow believe that everything in the universe is connected, don’t they? We all exist together in one large system. You, at this time, in this place, served the system. It mattered not who you chose to represent.\n“If the ultimate result would be the same regardless of who I chose, then why did you go to so much trouble?”\nThat’s part of the compact.\n“What compact?”\nA long silence.\n“What compact?” Ruofei shouted.\nA gigantic face loomed out of the ceiling, an unfamiliar, refined, but tired-looking face. The image broke up into countless smaller faces, all with the same expression. The faces swirled like a kaleidoscope, coalescing into different scenes: streets, dance parties, intimate lovers, predators seizing prey, wild deserts . . . it was impossible to tell how the scenes were connected with one another, but the colors grew ever darker over time, as though indicating different eras, until everything turned black; yet, in that darkness, bits of light flickered: hover cars at midnight, a lighthouse beyond the sea, the gaze of a lover . . .\nSuddenly, all the scenes swirled into a single spot, vanished, and the room returned to empty white.\nThe compact between me and humankind.\n“Who are you?”\nI’m the manager, the data center, the algorithm. I’m the god who can predict the future.\n“Predict the future?”\nThe probability it will rain, the employment rate, the popularity of a new face, the fashion trends next season, demographic projections, behavior patterns of individuals or groups given certain conditions . . .\n“You use these to . . . control humanity?”\nI prefer the term “guide.” Humanity is too sensitive, too weak, like reeds in the wind.\n“Then why does the Three-Legged Crow exist?”\nA chess game requires two players. Civilization, like life itself, requires endless stimuli. Otherwise, it will age and die.\n“Then I’m nothing more than another stimulus? Out of all the hibernauts, why did you pick me?”\nYour companions were largely the elites of the old world, those who had achieved much success. They would not be content to follow the path laid down by another, even if it were newer and better. They possessed too much ambition, too strong a desire to lead, to conquer fate, to take arms against a sea of troubles. Ultimately, their trajectories bent toward destruction. We tried, but the stimuli they gave this world were too strong. But you . . .\nThe androgynous voices seemed to tremble with laughter.\nRuofei’s face flushed with heat and his heart pounded. He knew the answer. He felt like a defendant waiting for the verdict.\n. . . you are nothing like the rest of them. You’re an unfortunate wretch, passive, gentle, content, patient. You’re like a mirror that brings attention to the diseases of this new world. You allow everyone to reflect on their own life, but not so much that they begin to doubt the foundation of the system. To be honest, you were slightly too passive. That’s why we had to give you a mate—\n“Jingjing was also a part of your plan?”\nOh, please don’t misunderstand. Everything she did was out of her own free will. She wanted to study how people in the past built emotional relationships; she analyzed your character. In her mind, everything she did was for the compact. We simply allowed her to go where she was already heading.\nRuofei felt utterly ashamed. He thought his fate had been transformed with the lottery, but in fact nothing had changed at all. He was still a failure—even worse, he has been failing for three centuries.\n“You’re all frauds!” He pounded the wall. He felt such anguish, but tears would not come out.\nOnce again, scenes appeared on the empty ceiling. They were shots from all over the globe: elegant, earnest young people held signs and gathered to protest in front of landmark buildings in every city. They were orderly and calm, their hands raised and their eyes full of doubt. Their shadows fell across the clear glass walls like ranks of angels waiting to take flight. Suddenly, a burning meteor flew over the crowd and struck the wall, breaking apart the perfect reflections.\nThe cameras closed in on a single youthful face. Rage, confusion, and anxiety warred across those perfect features. Then, the face smiled.\nThe reckless smile spread everywhere, like a plague.\nLike we said, a certain amount of wildness is good for health.\nRuofei stared at these new humans, at their fascination with this new fashion. He began to understand.\n“What’s going to happen to Jingjing?”\nShe has a choice to make. Like many other former members of the Three-Legged Crow, she could choose to become one of us, and enjoy the privileges of the new world. She could also choose to become an idol of wildness. But, as you know very well, idols are mere symbols. They exist solely in stories.\nJingjing’s eyes flashed before Ruofei’s eyes. His heart clenched hard.\n“What about me? What choice do I have?”\nThe communication chamber returned to its pure white state. The voices sank into silence, as though absorbed by some complicated computation.\nA confused Ruofei stood in the streets of Shanghai.\nSkyscrapers, elevated highways, narrow alleys, streets lined with Chinese parasol trees. Everything was as he remembered.\nA man brushed by his shoulder, his face at once strange and familiar, as though they had met once. In fact, everyone on the crowded sidewalk was astonishingly beautiful. They looked at Ruofei, and behind their gazes there lurked some hidden meaning that he couldn’t decipher.\nHe had long become used to the odd looks others gave him due to his condition, but this was different.\nA young woman approached him from afar, seemingly surrounded by a golden haze.\nThe sun suddenly dimmed, as though a giant cloud had drifted overhead. Everyone stopped in the street to stare at him.\nHe squinted, waiting for the woman to come closer.\nHer face gradually emerged from the haze, growing clearer. Compared to the beautiful faces all around him, hers was plain and imperfect.\nThe woman stopped on the other side of the street and smiled at him. Instantly, the cloud overhead seemed to move away, the world brightened, and everyone resumed their own course.\nRuofei used every ounce of strength he had to return the woman’s smile.\nA light came on in the darkness, illuminating the stiff smile in the hibernation capsule.\nA few white tentacles fell away from the glass and retracted into the octopus-like machine. A woman dressed in black swept the data shown on a thin membrane onto the giant ceiling-screen.\nName: Du Ruofei\nGender: Male\nAge: 25\nInitial hibernation period: 2018.06.26-2322.07.01\nTime awake: 281 days\nSuggested course:\nThe blue cursor blinked for a few moments, and then:\nResume hibernation\nA droning filled the room, as though many voices were arguing. Gradually, the voices grew quieter, stopped. The woman in black approached the hibernation capsule and, slightly curious, glanced at the face that belonged to a bygone age. A moment later, she pressed a button. The capsule retracted into the hibernation tank, and the cover whorled close.\nBehind her stood a row of identical circular hibernation tanks.\nThe light went out, and darkness poured in.\nWhat has been will be again, what has been done will be done again.\nOriginally published in Chinese in Science Fiction World, October 2014. This translation is based on a version of the Chinese text that has been substantially revised by the author.\nTranslated and published in partnership with Storycom.\nChen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts."}