{"fingerprint": "SqBrlPAsR5H0irwWYvxQhkZP2AM=", "sitename": "Clarkesworld Magazine", "title": "Catching the K Beast by Chen Qian, translated by Carmen Yiling Yan", "author": "Chen Qian; Carmen Yiling Yan", "date": "2011-12-13", "source": "https://clarkesworldmagazine.com/chen_04_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Catching the K Beast by Chen Qian, translated by Carmen Yiling Yan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3990 words, short story\nCatching the K Beast\nJuly 9th, 2089\nThe beast-catching mission was off to a rocky start.\nOnce our spaceship cut into Lamo’s planetary orbit, Old Liu and I sent down atmospheric sensors and language-recording equipment. The data they beamed back informed us that the atmosphere was breathable without mechanical assistance, that the locals were one hundred percent vegetarian, and that their society had just recently developed matrilineal clan-based tribes. So we put on our extraterrestrial language hypnosis-learning headsets, climbed into our sleeping bags, and let autopilot complete our descent.\nWhich resulted in the spaceship crashing nose-first into the central square of a Lamoan village in a billow of black smoke. It was a group of locals who untangled us from our parachute brake, led by someone named Kaka, whose position in Earth terms would be chief of his clan. They even invited us to eat with them, to settle our nerves, once again proving the universal law that vegetarians were on the side of good; Old Liu’s face had gone white with terror, and I wasn’t much better.\nThe issue had been with the spaceship’s thrust vector nozzle. Fortunately, all of Haier’s products were made with standardized interchangeable parts, so repair wasn’t too difficult.\nBut the impact of the landing damaged quite a few of the smaller electronics. The translator device was totaled; the hypnosis headsets gave out on us. Worst of all, the shock of the “abnormal landing” cost us the Lamoan language we’d learned through the hypnosis headsets—a severe enough emotional shock to the learner would cause subliminal impartation to lose effect. We had to relearn from scratch, like the human anthropologists of old.\nI hadn’t tried learning a foreign language since I’d left school; the effort gave me a huge headache. Old Liu, on the other hand, seemed to have much more of a knack for languages than I did. These days, he was already able to communicate with the locals through a combination of words and gestures.\nI hoped we could catch some K Beasts soon and return home to Earth. People said that a journey that started badly, ended badly. I believed a little in superstition.\nJuly 19th, 2089\nAs expected, things were going badly.\nThe buyer had told us that K Beasts had the ability to predict events up to twelve minutes into the future. As an interstellar beast-catcher with a couple years of experience, I’d seen plenty of bizarre alien creatures, so I didn’t think much of it at the time. But I hadn’t realized, this meant the K Beasts could predict our capture attempts.\n“What do you think they want K Beasts for? To put them in a zoo? Do they look like Marilyn Monroe or something?” Old Liu complained, after turning over the hundredth empty cage trap.\n“An animal that can predict twelve minutes into the future. Lots of uses for those.” I waded into the underbrush to collect another trap. Huge swarms of Lamoan mosquitoes stirred at my approach; looking at their bodies shaped like little bomber planes, I was glad my blood wasn’t to the taste of these extraterrestrial vampires. “For example, you can bring one with you as a bodyguard. If someone’s going to snipe you from the shadows, it’ll call out a warning. Or, you can train one like Pavlov’s dogs, so that it’ll drool if it senses that stocks are going to go down.”\n“We should secretly keep one behind for ourselves, then. We’d be rich.”\n“First we’ll have to catch any K Beasts at all, pal. Use your brain, and come up with something. It’s not long until the delivery date.”\nOur original plan was simple. We just needed to lay out a feast laced with sleeping pills that took more than twelve minutes to take effect, and we’d be able to catch some easy. But once they ate the bait, they grew unusually wary, and all of them hid away in concealed locations to snooze. K Beasts regarded ploys, traps, and tranquilizer darts with equal contempt. As professional interstellar beast-catchers, we’d captured mammoths from Planet Tai and burrowing wolves nearly as intelligent as humans; we’d successfully carried away an entire nest of Venusian wasps, with venom to rival a cobra’s. But in front of K Beasts, capable of sensing any future threat, all our schemes came to nothing.\nI was really starting to feel at my wit’s end.\nWe lugged our traps through a forest of blue fernlike plants with long bunches of translucent fruits hanging down from the frond tips. A small team of Lamoans carrying baskets was approaching, led by Kaka. We were already on familiar terms.\n“Diligent laborers are admirable. Would you like one?” Kaka handed me the largest fern-fruit in his basket.\n“Thanks, thanks. God protects those who labor all day,” I answered clumsily. As per Lamoan custom, I bowed, chomped the fern-fruit in big bites, and presented the clean, bare pit to Kaka. He twitched his antennae in satisfaction and bade us farewell.\nThe harvesting team disappeared into the fern forest. We could dimly hear their singing.\n“Hurry. I need to get back to the ship for antidiarrheals. Next time it’s your turn.” I gritted my teeth and quickened my steps.\nOld Liu followed, enjoying my misfortune. “We have to respect the cultural customs of other planets. We must not hurt the feelings of the native inhabitants—”\n“Shut up.”\nI felt a chill on my neck. It was raining again.\nMeanwhile, Old Liu quickly learned the locals’ language. All day, he happily planted himself in the Lamoan village square, joining in on their religious ceremonies, recording dialogues that sounded like birds chirping. Every day when he came back onto the ship, he’d sneeze like crazy; Lamoans considered getting rained on an exquisite pleasure and carrying a personal umbrella a breach of manners, while it was raining more and more frequently of late.\nI was starting to suspect that his interest in the Lamoans was far exceeding his interest in finishing our job. He used to be a researcher of interstellar folk customs, and when his scholarly passion surfaced, there was no stopping him.\nOf course, when I advised him to join me more often in the forests and increase our odds of capturing some K Beasts, he had a great excuse at the ready.\n“What’s the point of learning Lamoan? We’re supposed to be catching K Beasts,” I said. “Are you hoping some company will offer you a cushy translating job once Lamo’s developed enough to trade with Earth? By that time, your grandchildren’s grandchildren will be collecting pensions.”\n“Locals generally understand the native fauna better than anyone else,” Old Liu informed me. “I’m hoping they can tell me more about the kasiyedos, their dietary habits, their role in the ecosystem . . . ”\n“Kasiyedos?”\n“The K Beasts that we were talking about. Their Lamoan name means ‘beast that comprehends the future.’ Hey, did you know, every animal noun in Lamoan has a different prefix to distinguish between herbivores and carnivores, just like how French distinguishes between masculine and feminine—”\nI sighed. “What I want to know is, do I or do I not need to put on bite-proof gloves to capture one?”\nOld Liu laughed. “Don’t worry, animals with names starting with ka- are all vegetarians.”\nI, on the other hand, knew only three sentences’ worth of Lamoan: “God protects those who labor all day.” “The land accepts every drop of rain.” “Never meet.” They were the equivalent of “Hello,” “Thanks,” and “Best wishes” on Earth.\nOld Liu had to force me to memorize these, so that I could give the impression of a gentlemanly Earthling when I ran into a Lamoan.\n“The first one makes sense, hard work is glorious. The other one is probably because rain helps plants grow, which means bigger harvests. But don’t you think the last one is strange? Never meet. It’s like something you say when you break off contact with someone. But it’s a fancy way to give your regards,” Old Liu commented, after helping me correct my pronunciation.\nSigh, it looked like catching those K Beasts was going to take a while.\nAugust 1st, 2089\nIt was a sunny day, for once. I got out the tools to repair the ship. Old Liu leaned on the tail of the ship and passed me tools, but as before, he couldn’t tell the difference between slotted and Phillips screwdrivers.\n“The key is figuring out how a K Beast predicts the future.” He was trying to light a smoke in the thin, damp atmosphere of Lamo.\n“Predicting is predicting. What does it matter?” I’d half climbed into the front hood of the spaceship. “Hey, hand me that triode, the red one.”\n“No, there’s a huge difference. Do they go to bed each night and dream about what happens the next day, or is it an instinctive response to impending danger? Maybe a series of images of the future flash in front of their eyes?”\nI was getting a headache.\n“Think about it: a K Beast can’t have more than a hundred milliliters of brain volume. If the future contains infinite possibilities, it can’t handle all of them, right?”\n“Mm.” I angled the flashlight left and right. Where had the fourth screw gone?\n“In that case, would man’s free will not be merely an illusion—because the future is fixed? Or—” Old Liu sucked hard enough on his cigarette to make his eyes bulge, but the ember died anyway—“The future has infinite branches, but the K Beast simply knows which path has been decided upon twelve minutes in advance?”\nI ducked out of the spaceship repair hatch. “Ease up, Professor. They didn’t put up a down payment for you to philosophize.”\nOld Liu stuffed the cigarette back into his shirt pocket. “Remember the timed traps we made before? I have an idea.”\nThe timed traps were simple. You set an electronic timer, and once it hit zero, the cage would automatically lock. K Beasts were about the size of a Netherland Dwarf rabbit; when you weren’t harboring dastardly intentions toward them, you could trip over one while walking in the forest. So we’d filled the forest with these low-cost little traps. The Lamoans were neither curious nor opposed to our capture mission; their attitude toward K Beasts was something like Earthlings’ attitude toward flies: annoying if there’s too many of them, but if there’s just a few, let them be.\nThe next day, when we checked the traps, we saw that none of the traps with the electronic timers set to less than twelve minutes had been touched. The K Beasts had curiously explored the insides of the cages set to longer than twelve minutes, casually depositing their blue droppings as they went.\nTo confirm this point, I reset the traps, with sneaky miniature cameras pointed straight at the cage doors. As expected, all the K Beasts who’d ventured into the traps suddenly shot out of the cages twelve minutes before the exit would close, turning and emitting enraged I’ve-seen-through-your-ploy squeaks before departing.\nThat was the only progress we’d made after two weeks’ work. With other capture methods, we couldn’t even see the shadow of a K Beast. The Lamoans were happy to help, but when Old Liu asked about the K Beasts’ behavior and eating habits, they’d droop their antennae and walk away—the equivalent of an Earthling shaking their head and shrugging.\nBack on the spaceship, I tested the launch procedure. Everything worked as normal.\n“What’s your idea?”\n“Yesterday, when you entered the forest with the tranquilizer gun, how did the K Beasts hide themselves away in time? They didn’t really see themselves shot and captured. If the future is fixed, it wouldn’t benefit the K Beasts to know their future ahead of time. So they only know about a possibility—note, a possibility—of danger. K Beasts avoid Future A and steer toward Future B.”\n“How’s that different from a normal organism’s ability to plan ahead? We’re all animals pursuing benefit and avoiding harm.”\n“But K Beasts know. We just need to create a lot of uncertainty about the future, so they have no way to know. Let me think . . . have you practiced qigong before?”\n“Geez, what year is it? No wonder they call you Old Liu,” I laughed, although in truth he was in his early thirties like me.\n“The most fundamental skill in learning qigong is to maintain a mind free of extraneous purpose. Like, a mind without any plans. If even we don’t know when the cage door will shut, the future the K Beasts see will be a blur too.”\n“And with a mind free of extraneous purpose, a sudden flash of inspiration emerges, shutting the trap?” I laughed so hard I nearly fell over.\nMaybe that could work.\nA random number generator took the place of the venerable monk that Old Liu had in mind. I watched the image relayed by the camera and explained, “When the K Beast enters the cage—it doesn’t have any reason to be afraid, there’s no time limit on the traps right now—I’ll activate the random number generator. When it generates a number that’s odd and greater than one thousand, the cage door closes. How about that?”\nOld Liu nodded. “Great. Every decision to open or close the trap is an independent event produced in less than a millisecond. I don’t believe a K Beast can react that quickly.”\nAll that remained was the wait.\nAugust 3rd, 2089\nLamo was a less massive planet than Earth, which made for especially big raindrops. They pinged and clattered against the ship’s hull like a spray of bullets.\n“What have you been discussing with the Lamoans lately?” I propped my feet up on the control panel. On nine display screens, the fern fronds waved, the river rose, and the hymns of praise carried from the Lamoan village.\n“They’re preparing for the arrival of the rainy season.”\n“Storing food?”\n“And making the next generation.” Old Liu winked at me. “The rainy season is when the Lamoans reproduce. Haven’t you felt the love in the air in the village lately?”\nI vaguely remembered seeing several pairs of Lamoan youths beating each other bloody. Duels for affection?\n“Oh right, fun fact, you know what they thought of our spaceship landing that day?” Old Liu laughed. “Black smoke is associated with demons. That’s why they have you eat fern-fruit every time we meet. It’s taken from the altar and used to dispel demons.”\n“You spend all day in the village. How many of those have they stuffed you with?”\n“Strangely, they never invite me to eat them.” Old Liu grew even more smug. “Maybe it’s because I regularly attend their sacred ceremonies.”\nI grunted. “Strange? I just think it’s unfair.”\nRain dripped. The display screens still weren’t showing any sign of activity. My head grew heavier and heavier . . .\n“Hey, we caught them!” Old Liu gave me a sudden shove and charged outside. I looked up. Almost every trap held a loudly squeaking K Beast. It worked!\nAugust 4th, 2089\n“They still won’t eat,” I told Old Liu.\nBut he didn’t seem interested in listening to me. He dove straight for the bathroom.\nYesterday’s activities had brought fourteen new tenants to the holding kennels. When we’d inspected the traps, we’d found that some of them held more than one K Beast. It was practically a miracle. For food, we’d gotten heaps of fern-fruits—in our secret nature recordings, fern-fruits definitely made up the main part of their diet. But so far, not a single K Beast had touched their food.\n“Today they made me eat a whole pile of those things,” Old Liu said mournfully, pulling up his pants as he emerged from the bathroom.\nI feigned sympathy. “That’s how the Lamoans are sending off their Earthling friend? Did you all hug and cry?”\n“Don’t bring it up. But you’ve got to admit, they’re really lovely aliens, generous and kind.” He walked up to the kennels. “It’s normal enough for wild animals to not eat at first. They’re very spirited.”\n“More like aggravated,” I said, shaking my bitten fingertips. “We’re about to head back. If they refuse to eat in zero gravity, I’m afraid they’ll starve to death.”\nOld Liu thought for a moment. “Can you induce artificial hibernation?”\nI shook my head. “Too risky. We don’t know the specifics of K Beast physiology. How about we wait a few days, until the K Beasts are eating properly, before we leave?”\n“We have to head out today. The Lamoans told me that the rainy season proper starts tomorrow. Hurricane winds will blow for the next four months straight.”\nI boggled. “Even worse than the storms we’ve already been having?”\n“When the real rainy season hits, even the Lamoans hide indoors.” Old Liu sneezed. “They normally consider getting rained on to be like a sauna bath.”\nI looked at the rare sunlight outside. “Okay. Pack things up, and we’ll head out today.”\n“Entering level two launch countdown, 1200, 1119, 1118 . . . ”\n“I really don’t get why they have to start the countdown twenty minutes in advance,” Old Liu complained. Safety belts bound us to the seats like two mummies.\n“If you’re bored, you can listen to the hypnosis headsets. I fixed them yesterday,” I said.\n“What edifying entertainment.” He flailed an arm free to reach for the earphones. “Can you bring up the original recordings we gathered through the language-collection equipment, from before we landed?”\n“Press the blue key.”\nHe closed his eyes and fell silent.\n“720, 719, 718 . . . ”\nThe K Beasts suddenly started to shriek frantically. The squeal of claws scraping against the metal cage made my head hurt. Twelve minutes left. Looked like they weren’t a fan of takeoff.\n“385, 384, 383 . . . ”\nI yanked over some earphones and put them on too. The K Beasts were driving themselves into a worse and worse frenzy. Hard to think that their little bodies could make so much noise.\nA Beach Boys song drowned out the K Beasts’ screeching.\n“21, 20, 19, 18 . . . ”\n“Cancel the launch! Hurry!” Someone yanked out my earphones. The almost berserk cries of the K Beasts reverberated amid the computer’s calm counting.\n“13, 12, 11 . . . ”\nOld Liu shook me violently. “There’s no time, hurry and abort the launch sequence!”\n“What happened?” I tried to struggle free of the safety belts.\nHe turned to the control panel. “Which key?”\n“9, 8, 7 . . . ”\n“Which key?!” He was close to tears.\n“Right side, the long green one,” I answered. “Just what is—”\n“4, 3, 2—launch sequence emergency aborted. Repeat, launch sequence emergency aborted.”\nOld Liu plopped butt-first onto the floor, looking dazed. Then he started to laugh. “God, we were one second away. You have no idea, we were one second away.”\nI’d finally wormed free of the safety belts. Confused, I said, “Just what was going on?”\n“We dodged death.” He was laughing so hard he was crying.\n“Lord in heaven,” I sighed, after digging out a dozen or so fern-fruits from the spaceship exhaust pipes. “Jam-packed in there. Do you still think they’re generous and kind?”\n“Maybe too kind,” said Old Liu, shaking his head. “I realized when I heard them calling the K Beasts mausiyedos in the recording.”\n“Sorry, can you please explain in human language?” I said, rolling my eyes.\n“When we landed, Lamo was still in the tail end of the first rainy season. Their conversations were full of gendered words. But in the two weeks I talked with them, those prefixes had all disappeared, leaving only the bare root words.”\n“You said earlier that the rainy season is when the Lamoans reproduce?” I was starting to understand.\n“Not just the Lamoans. The K Beasts too. And the K Beasts’ rainy season name is mausiyedos, mau- representing a scavenger.”\n“Scavenger?” I felt a wave of disgust. “They eat corpses?”\n“It’s common for animals to change their eating habits during their reproductive season.” Old Liu found half a cigarette from his shirt pocket. “But they also have powers of precognition. I reconsidered the question of the twelve-minute time limit. K Beasts know what they’ll know twelve minutes in the future. That means there’s no range on the limit of their precognition. It’s just that the future they see will grow more and more uncertain.”\nI wasn’t sure what “knowing what they’ll know twelve minutes in the future” meant.\n“Imagine, you’ve aimed a spyglass at a mountaintop twelve kilometers away and can clearly see everything. And that mountain has another spyglass atop it, so through it you can see the view twenty-four kilometers away. So on and so forth. It’s just that the quality of the image will steadily decrease.” He snapped off the front end of the cigarette. “What happened, it’s all wet. Or you can use a game of telephone as an example.”\n“No need, no need, the analogy might be terrible, but I get it,” I said hurriedly.\n“Now I know the meaning behind that phrase, ‘never meet.’ If a Lamoan meets a K Beast in the rainy season, it means they’ll die soon. To them, a K Beast is the ultimate inauspicious animal, a harbinger of death, so normally they don’t even want to bring them up in conversation.” Old Liu grinned. “And we were spending all day trying to catch these critters. To them, we must have seemed possessed.”\n“So stuffing the exhaust pipes is a form of exorcism?” I didn’t know whether to laugh or cry.\nHe shrugged. “It’s our fault for spewing that much black smoke when we landed. The Lamoans must have thought the demons lived in the exhaust pipe.”\nI walked in a circuit around the ship. “There shouldn’t be any more problems, right? They couldn’t have drawn magic spells on the circuit boards.”\n“Let the computer run the countdown again. If the K Beasts don’t go nuts at seven hundred and twenty seconds, we’re safe.”\nOld Liu gazed out the porthole. I followed his gaze. Dark clouds were gathering on the horizon.\n“723, 722, 721, 720, 719 . . . ”\nThe K Beasts were silent, as if sleeping.\nI let go of a breath. Suddenly a thought struck me. “Old Liu!”\n“What?”\n“The random number generator wasn’t how we caught the K Beasts! They let themselves be caught, because they knew we were going to die!”\n“So you just realized.”\nEven though I couldn’t move in the straps, I could still sense the smug expression on his face.\n“The Lamoans plugged the exhaust pipes because we’d caught the K Beasts, which nearly caused us to die. But the K Beasts let themselves be trapped because we were going to die. Hey, but which is the cause and which is the effect?”\n“Ease up, Professor. They didn’t put up a down payment for you to philosophize.” This time, I’d handed Old Liu a great opportunity to make fun of me.\n“78, 77, 76 . . . 3, 2, 1, takeoff.”\nOutside the porthole, Planet Lamo receded, becoming one speck amid the stars.\n“Hang on.” I had a new question. “If the K Beasts knew the spaceship was going to explode, why would they let themselves be trapped aboard it?”\n“You might as well ask why salmon migrate back upstream.” Old Liu unbuckled his straps and floated up. He found some artificial chicken in the fridge and tossed it into the kennel, where the K Beasts immediately attacked it. “For the sake of propagating their offspring, these K Beasts risked everything to get close to a food source—you and me.” He gave me a wink. “Magnificent maternal love in action.”\nOriginally published in Chinese in Science Fiction King, December 2017.\nTranslated and published in partnership with Storycom.\nBorn in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest."}