{"fingerprint": "nZk32i9Rka/jZhi4b9FH6bElpbc=", "sitename": "Clarkesworld Magazine", "title": "The Calculations of Artificials by Chi Hui, translated by John Chu", "author": "Chi Hui; John Chu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chi_10_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Calculations of Artificials by Chi Hui, translated by John Chu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8210 words, novelette\nThe Calculations of Artificials\nIntroduction: Some numbers\nIn the year 2042, 2248 Actual people but 11.26 million Artificial people lived in the city of Mian on the continent of Asia. Meanwhile, 7.2 billion Artificials lived in the world as opposed to only 1.44 million Actuals. Out of those, only 127 people knew the truth about the world.\n1 - The solitary monitor of calculated behavior\nWhenever the city suddenly got noisy, Aixia knew an Actual was nearby.\nThrough the special behavior monitor spectacles, he saw a somewhat stout middle aged man lead his wife and daughter across the street. A fluorescent green halo surrounded the man’s body. It indicated that he was an Actual and his wife was an Artificial. His daughter was also an Artificial.\nWithout thinking about it, Aixia tapped his spectacles. A diagram of the city streets immediately superimposed itself onto his field of vision. It showed that one hundred twenty-seven Artificials on this block had close ties to him, their behavior driven by advanced algorithms, as well as nine Artificials whose behavior was driven by the most advanced algorithms. The difference was his friends versus his family. Furthermore, there were over a thousand strongly interactive Artificials and over four thousand weakly interactive ones. They formed the entire world of this man’s life.\nOne solitary Actual. He, naturally, knows nothing of his solitary existence. Lucky bastard.\nOf course, around here, their calculations had already started to falter. The man could easily see a blank face, hear dull, halting syllables. It’d gotten to the point where some Artificials moved mechanically in non-human ways. The truth of the world was like a flimsy piece of window film, easily pierced by a few careless slips.\nThis was why Aixia came here.\nHe crossed the block, entered the neighborhood’s public central square, then touched an old woman there. A stream of data danced in the air. The functions that had to do with her were revised. Her odd expression was restored again to a harmonious smile. It wasn’t as easy, however, to make her stiff fingers nimble again. All in all, this Artificial had already been in service for too long.\nAfter a moment of thought, he adjusted the “gossip function” to explain away the old woman’s clumsiness as the result of a stroke. The internal harmony index for this block’s behavior returned to normal.\nThe behavior monitor turned around. He slowly walked out of the man’s scope of interaction. The surrounding city became silent again. Under the streetlights, a stream of people passed by as before but their manner became stiff and mechanical. They weren’t speaking or laughing anymore. Cars drove slowly down the street. The drivers’ hands weren’t even on the steering wheels. The algorithms for weakly interactive behavior had several hundred bugs, but in the name of conserving resources, no one had bothered to fix them. Since these areas didn’t have any Actuals, no Actuals would ever discover these abnormal places. Only in those places that Actuals could observe did the world approach perfect behavior.\nThe behavior of Artificials was never intended to be one hundred percent perfect. What it sought was to be highly efficient and strongly interactive to give the world’s one million four hundred forty thousand Actuals a stable world, a stable life.\nHe walked down the street. Dim lights and a stream of clumsy people stretched across the silent block. Through his behavior monitor spectacles, he examined the behavior of Artificials everywhere in the world, their mistuned functions, misassigned values, not to mention some simply unfortunate accidents. As the behavior monitor, he fixed those faulty data and calculations to make the façade of this world even more realistic.\nAixia didn’t remember how long he’d been wandering around like this. Artificials were installed here as though they had sprung up out of ground. By the time the first batch of Actual children arrived, he had already come to this city. His work was to monitor the Artificials’ behavior, a job he could do from anywhere. He still decided, however, to settle down in an Artificial city. Day and night, he wandered aimlessly deceiving himself, looking at the behavior of Artificials as though it were real life.\nHe had an apartment, a quiet, deserted apartment. He rarely returned there unless he was physically and emotionally exhausted and desperately needed sleep. Because the solitude there cocooned him, reality could take him by surprise . . . make him face the ice cold world alone.\nHe crossed a block of the weakly interactive, who used a minimum of resources and computational power. Painstakingly, he searched for those places where the strongly interactive congregated, like supermarkets, food stalls, bars, night markets . . . the sorts of places where Actuals always went to. As a result, the Artificials there would improve their behavior, work with high efficiency. For a short while, the world would seem truly alive, as though every passing encounter with someone were real. In times like those, he let himself forget about the existence of Artificials and just tried his best to live.\nHe walked into the night market. A stall was selling small pets. He stopped in front of it for a moment and tried to buy a pair of hamsters, but the hamster cage was much too expensive. After he failed to haggle down the price, Aixia had no choice but to leave the two hamsters, whose small black eyes had filled with anticipation.\n“Was the peddler who haggled with me an Artificial?” he thought. His fingers felt for the behavior monitor spectacles in his bag. Finally, he gave up trying to tell the difference.\nHe walked aimlessly. As he did, he guessed at who were Actuals, but he was in a strongly interactive block. With only the naked eye, he had practically no way to distinguish between the Actuals and the Artificials here. They had the same smile and the same attentive gaze. They spoke the same way and had the same demeanor. From time to time, they’d burst into laughter, argue at the top of their lungs, whisper in confidence . . .\nIt was now two in the morning at the night market and Aixia felt somewhat tired and sleepy. In his line of sight, many Artificials had dropped their behavior level, becoming the dull and slow of the weakly interactive. Some had even stopped moving completely. This meant, maybe, that all the Actuals in the vicinity had left, Aixia thought.\nNo, he corrected himself. There was still one Actual. The behavior monitor didn’t factor into the behavior of Artificials per se. This made him able to glimpse the actual state of the world and grab it as it spun.\nA smile spilled across his thin lips. He got on a sputtering bus. The driver was a cross-eyed Artificial. Right now, one eye always stared right, one eye stared at the ground. As always, his hands gripped the steering wheel steadily. He drove the bus in the direction of Aixia’s apartment.\nThe night swept past the bus’s windows. The city beyond it was occasionally sharp and clever, occasionally dull and calm. Very few Actuals moved about the streets at night. The city was divided into tiny pieces by each and every highly interactive district. Most of the weakly interactive districts between them had already settled down completely. Aixia placidly looked out a bus window. By his side, an old Artificial woman sat perfectly straight, as stiff as a wax dummy.\nOne stop before his apartment, the bus erupted with a terrifying creaking noise. It rocked back and forth before finally stopping by the side of the road.\n“It’s broken. Get out.” The driver mumbled stiffly. No computational resources were wasted to give this voice any intonation. Aixia forced a laugh. A slow stream of dull people got off the bus.\nWhere he lived wasn’t too far from here if he cut through a sparsely lit park. Aixia hesitated for a moment before he decided to walk straight through. Although the city wasn’t very safe at night, he was too tired and sleepy to care whether he’d be robbed. Artificials wouldn’t engage with a behavior monitor. As for Actuals . . . He glanced at his map. There were no Actuals here for now.\nHe cut through the park. Streetlamps dimly lit the path. A pair of lovers sat mechanically, one stacked on top of the other, on a long bench to the side. They looked exactly like department store mannequins.\nSuddenly, the two Artificials started to move. They emitted hushed murmurs, whispered sweet nothings. On another path, an Artificial standing dumbly with a dog on a leash started to jog and, at the same time, shout the dog’s name. Within a millisecond, the entire park shifted from weakly interactive to strongly interactive behavior.\nAn Actual has shown up.\nAixia put on his monitoring spectacles, but all around he saw only the yellow haloes of Artificials, not even one green halo of an Actual.\nWhere is he?\nHe heard, in the distance, shouting and the sounds of kicking and punching. Even more disconcerting, he heard sounds of Artificials fleeing. On the monitoring spectacle’s map, the words “Grade A retribution” in red caught his eye.\nOh, no.\nAixia began to run. A hedge, as tall as man, separated the two paths that he and that green dot were on. He simply crashed through, not feeling the pain as twigs lashed his face.\nGrade A retribution meant one or more Artificials were attacking an Actual. Moreover, they’d already acquired permission from the algorithms that drove them to kill the Actual.\nHe crossed the path then turned the corner to see three young people beating a scrawny figure.\n“Stop!” he shouted.\nArtificial Behavior Restriction 424: the monitor’s order overrides a retribution directive.\nThe three Artificials halted. Their algorithms quickly decided on the flight reaction. The three glanced at each other then with an unusually realistic look of panic, they turned around to rush out of the dark alley. In the blink of an eye, they disappeared out the other end.\nThe scrawny figure on the ground didn’t move. Viewed through the monitor spectacles, a weak green halo surrounded him.\nAixia crouched next to the body. He reached for a hot, trembling arm, trying to support the person up to a stand. The figure stirred, lifting his young, smudged face to look at him. Black eyes revealed a stubbornness and alertness. His cheeks were bruised but there were no traces of tears.\nAn Actual child, not yet fully grown, fourteen years old? Maybe fifteen? But, through the monitor spectacles, a red halo surrounded the child’s immature face. Next to it, a row of text read: Monitor for violence, grade A danger.\n2 - Senile and willful twins\n“Why don’t I take you home?” Aixia asked.\nThe youngster stared at him warily.\n“You can have a bath, eat something. Change your clothes.” Aixia said.\n“Go away!”\n“If I go away, those three bastards will find you then beat you to death.” Aixia stated calmly. This was one hundred percent fact. The boy was already branded “Monitor for violence, grade A danger.” This meant any Artificial whose calculated behavior qualified could kill him. He could have died at the hands of those three thugs just now, been caught by the police, or died from some car suddenly rounding the corner.\nHe knew that every Actual was precious, but death, murder, and accidents were woven into the calculations of Artificials as indispensable parts of a “real world.”\nThe youngster glanced at Aixia then looked at the head of the alley. The three thugs’ shadows had disappeared, but they could be hiding somewhere waiting for Aixia to leave. The monitor knew these Artificials were “locked into retribution.” In other words, they wouldn’t leave because they’d become stupid when they got too far away from him. Instead, they’d follow the youngster until he became an ice cold corpse.\n“They won’t give up on you, but you can hide for a while at my place,” Aixia said.\nThis time, the youngster’s expression wasn’t defiant. “Is your place far away?”\n“It’s right nearby,” Aixia said.\n“I can’t walk. My leg might be broken.” The youngster’s brow furrowed.\nAixia felt the youngster’s ankle. It was swollen but it didn’t seem broken. “Do you want to go to the hospital?”\n“No!” the youngster blurted. His tone couldn’t contain his panic.\nAixia studied the youngster’s face. He couldn’t make out the expression in the dim streetlamp light. A moment later, he sighed. “I’ll carry you home.”\nAs soon they got home, Aixia put the youngster on the sofa. He ran to the refrigerator and got out some ham sausage. The cupboard had two packs of instant noodles. He and the youngster had a late night snack. Afterward, he carried the youngster into the bathroom—with the result that he wrestled with the youngster’s tangled hair and the dirt on his body for an hour.\n“Why don’t you get some sleep?” he said to the youngster. “The bedroom’s all prepared for you. You take the bed.”\n“What about you?”\n“I have to work tonight.”\n“Are you leaving?”\n“No. SOHO, I work from home.”\nThe youngster didn’t respond at first. Black eyes stared deeply into him. “Why are you being so kind to me?”\nFor a moment, Aixia was dumbfounded.\n“I don’t know either,” he replied. “Perhaps it’s because I’ve been alone for too long.”\nHe waited for an hour, until he was sure the youngster was asleep, before he turned on his computer. A complicated pattern of light and shadow filled his study. A rotating image of a starry sky covered a wall. He placed himself among the mirage of myriad constellations.\n“Aixia here. Calling Rui An,” he said. The computer responded to his voice. Right away, the image of a highly capable woman wearing a short jacket, combing her short hair appeared in his field of view.\n“Rui An here.” A cold, female voice sounded. It seemed to carry the faint hint of fury. “I’ve been waiting for you to call me, Aixia. You’ve recently interfered with a retribution operation?”\n“With the Artificials as my witnesses, I have the right,” he answered.\n“Do you know—” Rui An’s image rippled. It settled into a face of rage. “Do you know what sort of person the kid you have laid up in your bedroom is?”\n“Please, I beseech you to allow humble me to know the details.”\n“You’re fucking trying to piss me off, aren’t you . . . ” Rui An curled her lips and bared her teeth, forming an expression that was absolutely not a smile. Her eyes, though, held the hint of one. “Fine, every night I want to give my Artificial servant a sound beating. It’s rare to see an Actual face. I might as well waste my precious time explaining things to you, Aixia.” She dragged out a chair he couldn’t see then sat down. Graceful crossed legs swung back and forth. “The kid is a grade A danger. He has four counts of burglary, one count of looting, not to mention one charge of murder.”\n“Murder of an Actual?”\n“Murder of an Artificial.”\n“That doesn’t justify retribution. As far as I’m concerned, only the murder of an Actual justifies retribution.”\n“The examination committee thinks he’s a disruptive influence on society. Aixia, the youngster’s parents are Actuals.”\nAixia whistled lightly. “The Actual socialization plan.”\n“Exactly, that failed plan. Twelve couples. We let Actuals form households with Actuals then let them bear children, rather than form families with Artificials—as you can imagine, good heavens, Actuals with Actuals . . . out-of-control violent impulses, obsessions, lust for power, desire for control. They all clashed with each other in their cramped families to the point where not even an Artificial child could ease their pain. All of the frenzy landed onto the Actual children of those couples . . . ” Rui An paused for a moment. “As for this kid, his father abused his mother for ten years, then killed her. He witnessed the entire chain of events. When his father tried to kill him, he ran out the door . . . where, by chance, his father was killed by a car rounding the corner. Unfortunately, he witnessed that, too.”\n“You all think he’s become a destructive factor.” Aixia’s voice lowered. “That car was no coincidence, wasn’t it . . . ”\n“No, it wasn’t. Artificial Behavior Edict 799: Retaliate against the murder of an Actual at the first opportunity. After this incident, we rewrote this edict to add the restriction ‘within the vicinity of an under-aged Actual, permission to carry out retribution is not granted.’ But for this kid . . . ” Rui An shook her head, “it was too late. We marked him, followed him, and tried to arrange for an Artificial to take care of him, but after he murdered the Artificial, we decided . . . ” The administrator’s voice revealed a bitterness and hardship. “We decided to eliminate him.”\n“Can I keep him for the time being?”\n“You’re mad!” Rui An betrayed an extreme astonishment and deep dread. “You . . . You are an Actual, Aixia. So is that kid. An Actual and an Actual living under the same roof. Artificials be damned, do you understand what you’re saying?”\n“The households you’re talking about are all extreme cases, Rui An. Aren’t you and I good friends?” As Aixia said this, he wasn’t so sure.\nShe shook her head forcefully. The image of competence and determination disappeared. She now looked worried and restless. “That’s not the same, Aixia. It’s really not the same. Damn it. How many times do we get in touch a year? Three? Four? What you’re suggesting is to keep the kid with you. He’s not even fully . . . How many years has it been since someone did that? Artificials be damned, at first, we had a reason for filling the world with Artificials. Have you forgotten?”\n“I haven’t forgotten,” Aixia said softly. “I can never forget. We are the first generation, Rui An. It’s been one hundred twenty years . . . We’ve worked together for one hundred twenty years. Now, I’m asking you to allow me one tiny indulgence. Can I?”\nThe corners of her mouth twitched a little, betraying an aged expression ill-matched to her youthful face.\n“Very well,” she said in a low voice. “In the end, you have a right to an indulgence. But, the area around you is a behavior vacuum. You don’t draw the attention of Artificials. That kid does. The conflict must be resolved before everything will be all right.”\n“Their interest in him swamping their lack in me is just fine.” Aixia started to laugh. He’d never felt so happy. “I’ve been forgotten by the world for too long. Why not have some excitement around me every once in a while?”\n“That may not be a good excitement. The interactivity algorithms for the kid contains lots of negative functions, including police, riot, theft, gang, not to mention fighting,” Rui An warned.\n“I can handle it.”\nRui An shrugged. “You’d better be able to, Aixia.”\n3 - They contained fire with paper to survive\nHe was the youngest survivor of the settlement.\nOn this piece of desolate wasteland, underneath the cold, gray sky, the crowd gathered to try to rebuild a new world on this land after nuclear war. They still had the knowledge. They still had the technology and the ability. It was nothing like post-apocalyptic fiction where people pushed rough-hewn carts in ragged clothes as they pioneered farming and industry from first principles to reestablish human civilization.\nAs a matter of fact, within thirty short years they’d recovered everything, all that the world before nuclear war had had as well as technology, knowledge, wisdom, and power that that world had never had.\nThey quickly grew powerful and arrogant. They exploded into quarrels. They fell into indescribable rage. They grew stubborn beyond reasoning. They split into distinct, walled-off factions. Their impulses couldn’t be controlled . . .\nThen there was a second nuclear war.\nThey’d always believed that the first nuclear war broke out because of overpopulation, shortage of natural resources, as well as competing ideologies. It never occurred to them that the world they rebuilt, this world that had already conquered age and death, that could already build lifelike anthropomorphic robots, that had already pressed onward into space . . . would still erupt into the second nuclear war.\nTwo nuclear wars within thirty brief years almost destroyed everything, but they still had the ability to rebuild the world from its ruins. They also feared endlessly their own abilities.\n“We are too powerful. Even just one person can destroy the world,” Rui An said.\n“We are too impulsive. Even just one quarrel can spark a war,” Kyoko Yamashita said.\n“We have no way to restrain the violent tendencies in our souls. We pour violence on each other, so it’s best if we stay far apart from each other,” Aixia said.\nBut a woman raised questions they had no way to avoid.\n“What about families? What about children? We are so powerful, one person can destroy the world. The jealousies of one couple can destroy the world, destroy each other, destroy their children. What about us as a species? How will we reproduce?”\n“Weaken them,” Will Senna said.\n“But raise our descendants on this piece of land? Let them continue to multiply without end? Let them rapidly grow old and die and not do anything for them?”\n“Weaken them. Deceive them. Soften them. Deploy Artificials. A lion brought up around a hundred sheep will not grow into a lion. We have to engrain peace into the depth of their souls and, after that, awaken them into our midst.”\n“You’re talking about raising them, raising our progeny! Is this something people are capable of?”\n“But . . . are we . . . still human?”\nAixia opened his eyes. The motley pattern of light and dark on the apartment’s ceiling reflected into his eyes. It was already ten in the morning. Unexpectedly, he’d over-slept . . .\nRecently, memories of the past had barged uninvited into his dreams. The doctor on the Star Trail had said that this was an inevitable side-effect of being over two hundred years old. Memories calcified and yet the body stayed young. He worried that, after some time, he’d need surgery to implant memory crystals to get by.\nHe shrugged, got up from the sofa then washed his face in the bathroom. There were no sounds coming from the bedroom. Perhaps the boy hadn’t gotten out of bed yet. As he brushed his teeth, he thought about the question he recalled about humanity.\nAt the time, no one had answered him.\nEven afterwards, after the plan of Artificial behavior and the Artificial world had been completely carried out, still no one answered the question.\nChildren these days grew into adulthood in safety brought up by Artificial parents. They married Artificials and grew old in the company of Artificials. With the exception of Actuals with violent tendencies, who are retaliated against, the rest of the Actuals live safely until the appropriate age, after which they are received on the Star Trail.\nBut . . .\nHe shook his head lightly, cast off the chaotic thoughts from his mind.\n“Thank you.” The youngster’s voice rang. Startled, he jumped.\n“Ah? Oh, no problem. Are you awake? Can you walk?”\n“I only twisted it.” He rotated his foot a little. “ . . . thank you. I want to go.”\n“You want to go home?”\nThe youngster’s body swayed a little. He ignored the question of “home.”\n“Staying here will just bring you trouble.”\n“Trouble?” Aixia knew the youngster had killed an Artificial. The police would certainly order his arrest. This was part of the retribution sequence. But, on purpose, he pretended he didn’t know.\n“No big deal . . . those thugs.” His voice grew tense. His body grew tense as well.\n“They’ll never find their way here,” Aixia said with an intentional casualness. “This neighborhood is extremely secure. If they actually come to harass you, you can dial 110 for emergencies. You don’t need to be afraid. Do you intend to go home?”\nThe youngster’s lips trembled. “I don’t want to go home.”\n“Then stay a while.” Aixia patted the youngster’s shoulder. “Be my roommate.”\nThis time, the youngster didn’t refuse. Soon, the two sat on the sofa next to the tea table sharing what little milk and bread was left in the refrigerator as an early lunch.\n“Oh, right, what’s your name?” Aixia asked.\n“ . . . I’m Farrell.”\n“Hmm . . . OK, Farrell, I have to go out this afternoon. It might be late before I get back. There are instant noodles in the cupboard. You should be able to make them yourself. I’ll bring home KFC when I come back tonight.”\n“I want to have McDonald’s.”\nAixia stood dumbfounded for a moment, then started to laugh. “McDonald’s it is, then,” he said.\nHe wandered around as he always did, but his mood today seemed to change somewhat. Memories of the past appeared and vanished in the recesses of his thinking. He remembered the past, yes, before the second nuclear war erupted. Once, he had a huge cabin on the Star Trail, as well as many companions. They chatted with each other, had fun together, made all sorts of trinkets together, and craved the tons of trouble that got their parents involved.\nThat was a long time ago. One hundred years? One hundred fifty years? Afterward, everything was destroyed. People hid behind Artificials, hid between flickering façades of the world. They forgot each other, kept far away from each other. Him deciding not to let the youngster go was completely on impulse. It wasn’t that he didn’t realize the danger of an Actual coming into contact with another Actual . . .\nBut he couldn’t contain himself, the soft touch of the youngster’s hair awakened a speck of something that had survived in the depths of his soul. It was only by depending on that tiny bit of memory that he felt that he, himself, was someone truly alive, that he could remove himself from this world filled with the calculated behavior of Artificials.\nA forced smile spilled across Aixia’s thin lips as he laughed at himself. This was crazy. In this world filled with façades, the truth was cruel and dangerous.\nSuddenly, the monitor spectacles in his pocket started to vibrate.\nHe put on the spectacles and skimmed the projected map. Red dots twinkled in a few places on the map of the world. They were all marked “Actual murders” and “Grade A retribution.”\nAixia raised his eyebrows in puzzlement.\nThis was not normal. Actual murders took place, on average, once a month, and Artificial murders did not cause Grade A retribution.\nHe tapped the map a few times, zooming in on the nearest red dot. One, no, a pair of red dots were in this city, 17 Nanhang Road.\nHe hailed a taxi and hurried there just in time to see a policeman cordon the area off with yellow tape and a body bag being carried out.\n“What happened here?” he asked an old, Artificial woman next to him.\n“Murder. A delivery person and the resident—I don’t know why—started to argue, so he killed the resident!” The old woman waved her hands wildly.\nAixia hid the uneasiness deep in his heart. The old woman lamented for a while about the degradation of public morals then walked away.\nAnother red dot appeared on the map of this city on Qingzhao East Lane.\nHe took a half an hour to rush there by taxi. The police had already cordoned off the area. He didn’t find anything out from the crowd of Artificials watching, but he saw a trail of blood at the head of the lane.\nAccording to the behavior monitor display, this was yet another case of Actual-on-Actual violence, one person dead, one person seriously injured.\nThere was a problem somewhere. Aixia knit his brows. As he walked towards home, he examined the behavior code function by function.\nThe problem was in the primary function that broke up crowds.\nThis function originally kept Actuals apart. It used every sort of stochastic and every sort of rational, non-stochastic events to divide their work, lives, entertainment . . . so that they wouldn’t meet one another. The violent tendencies of Actuals would only hurt Artificials or, in a very few circumstances, they’d be hurt by the retribution of Artificials—but now, this function was being perverted by someone.\nFor a long time, the calculation of Artificials had always been to use Artificials to cocoon Actuals. Prudent and cautious, it was like using paper to contain a fire. As long as there wasn’t permission for retribution, Artificials were essentially gentle and well-mannered. They effectively eased the tendency of Actuals to violence. But once the function was perverted, those stochastic events once used to separate Actuals were turned around to promote Actuals approaching each other, to the extent that they meet . . .\nOnly people on the Star Trail could modify a primary function. Aixia anxiously picked up his pace. He called Rui An—but no one answered.\nA harsh car horn blared behind him. A car struck the sidewalk. It missed Aixia by only a few centimeters. Quickly, it rushed away.\nHe was scared into a cold sweat. Indescribable fury welled in his chest. He gave the car the middle finger.\nThe car suddenly stopped.\nThen, abruptly, it turned around.\nAixia absolutely could not hide in time. Dealing with a person was one thing, dealing with a recklessly driven car was another. He leapt hastily to the side, but his left arm was swiped by the car. The world spun. His body flew, crashing into a dumpster on the sidewalk.\nHe tried to get up, but his left arm hurt so much that he couldn’t prop himself up. The car stopped. A burly man howled as he kicked the car door open and then jumped out. Through the spectacles, Aixia saw a green halo.\nAn Actual.\nAixia tried to stand. The brute kicked him to the ground. Futilely, he raised his right arm to block the brute’s blows. Disgusting curses mixed with the sound of fists hitting a body in his buzzing ears.\nAn Actual came across an Actual. One calculated behavior affected another calculated behavior . . . This might originally have been what the kid had run into, but the calculations had been perverted. The Actual brought his violent desire, and was drawn together with Aixia.\nOh, fuck. I thought I could handle this.\nHe felt nauseous. He wanted to vomit. Out of sheer pain, he tried to escape from the brute’s punches, but he was caught in the corner between the dumpster and a wall.\nA weird rumbling sound.\nThe brute stopped all of a sudden. Then he fell over like a log.\nFarrell. The youngster’s figure emerged from behind the brute. A bloodstained brick was in his hand.\nHe was crying. Tears flowed down his young face. He gritted his teeth, as though he was ready to hit the brute’s head again.\n“This beating hasn’t made me cry yet. You cried first.” Aixia laughed. Slowly, he got up. The youngster ran to support him. He gratefully accepted the help. “What are you doing here?”\n“I was following you,” the youngster mumbled.\n“You were afraid that I’d go to the police?” Aixia thought. What he said, though, was “You were afraid I wouldn’t buy you McDonald’s?”\nThe youngster started to laugh.\nAixia looked at the brute. The latter’s eyes had rolled back in his head. His breath was even though.\n“Farrell, can you support me as we go home?” he asked.\nThe youngster nodded.\n4 - Destiny is some sort of inverted calculation\nAll night, police sirens whistled through the entire city of Mian. A series of Actual altercations broke out one after another. They included fights, murders, brutal slayings of entire families.\nThat night, only 1924 Actuals remained in the city of Mian. Over two hundred died from every manner of murder. Functions were still guiding Actuals towards each other. When an Actual came across an Actual, catastrophes and violence increased geometrically. Death seemed like a time bomb lit then finally going boom.\nAixia spent all night trying to contact Rui An, but never got an answer until three in morning, when he received a brief dispatch on his terminal.\n“Come to the Star Trail.” Rui An looked pale and exhausted. “Come immediately, as fast as possible.”\n“What?” Aixia raised his voice.\n“I don’t have time to explain, Aixia, just come quickly.”\nHaving finished, Rui An broke off communications.\nThere were lots of ways to get to the Star Trail but Aixia chose to pilot his own spacecraft. It was easy, fast, and convenient. Also, it could carry an additional passenger. He considered over and over again whether to bring Farrell with him. Although it would have been easy to leave without him knowing, he didn’t want to leave the youngster in a suddenly chaotic city.\nWhen he saw the spacecraft, the youngster’s jaw dropped.\n“Are you an alien?” he asked.\n“No. I’ll explain later. This is my spacecraft. Get on board.”\nThe youngster hesitated for a moment then quickly caught up with Aixia.\nAs they flew to the Star Trail, he explained to the youngster the entire history of what had happened as well as the calculations of Artificials that kept the modern world turning.\n“So everything is fake?” The youngster kept looking at his own thin fingers. “Am I an Artificial?”\n“No, you are an Actual.”\n“Really? How do I know you’re not lying?”\n“I have no way to prove it.” Aixia started to laugh. “I wonder, myself, sometimes, whether I’m an Artificial.”\n“Oh.”\nThey were silent for a while, then the youngster asked another question.\n“Were my parents Actuals?”\n“Yes.”\n“Both of them?”\n“Both of them.”\n“But you just said that you worked hard to prevent people from coming into contact with each other.”\n“Yes.”\n“They never faced each other?”\n“Never. Even my doctor gives me my physical exams through telepresence.”\n“What about my parents then? And what about all the things happening today?”\n“Inverted calculations.”\n“I don’t understand.”\n“ . . . about fifteen years ago, we conducted an experiment. We wanted to see whether Actuals could truly get along with each other. So, we inverted the calculations in the Artificials’ crowd separation function. That function was originally used for separating Actuals, but we perverted it to use all sorts of excuses to bring men and women together, to facilitate their marriages. But the results . . . they were simply catastrophic.”\nThis time, the silence was even longer.\n“They were unhappy,” the youngster finally said softly. “They were truly unhappy, Aixia. You don’t understand. They fought. They were miserable, but they didn’t know whose fault it was. All sorts of people pushed them into marriage. All sorts of people praised their marriage. Everyone. It got to the point where if you were unhappy, you must be guilty of something. But they knew . . . even if they didn’t know about Artificials, they still knew the marriage wasn’t something they actually wanted, still knew each wasn’t the one the other one wanted. Just like I knew they weren’t the parents I wanted. I didn’t know who I could hate. They were my parents. That is . . . I had no way to choose. It’s like fate. You didn’t know who to yell at. You didn’t know who to complain to. You just knew the situation had become like this and it wasn’t anyone’s fault. So then you can only hate yourself, hate everything . . . just like nothing that was decided for you could really bring happiness. They simply had no other choice. Neither did I. I knew that feeling, the feeling of being reared and having things being decided for you . . . ” He suddenly raised his head, and said hoarsely through gritted teeth, “I hate you! I hate you all!”\nAixia didn’t say anything. He just docked his spacecraft in the Star Trail.\nThe interior of the Star Trail was just as empty as Aixia’s apartment. The Artificial servants passing by didn’t bother to simulate the appearance of humanity, each and every one walking back and forth crowned with a round metal head. He led the youngster through long corridors. Flickering lamps lit the way in front of them.\n“Are there Actuals here?” the youngster couldn’t help asking.\n“We live scattered through the Star Trail. This place is huge. There are only just over a hundred of us. So we are extremely scattered,” Aixia explained.\n“What about those people on the world below who die of old age? You said that they are all received on the Star Trail.”\n“Hmm.” Aixia nodded. “This is the problem. They’ve all been frozen. Not even one has been thawed.”\n“Why?”\n“We don’t dare.”\nWith that, the two reached the control room. Aixia pushed open the door, then entered. He ordered the Artificial servants to repair the communication system. For a long time, no one could reach him. It’d made him feel odd and restless. And the message Rui An left behind had an ominous tone.\nHe breathed deeply, sat down, then turned on the communication system.\nIn an instant, a virtual image filled the entire room.\n5 - The fruits of humanity\n“What is that?” Farrell clutched Aixia’s hand. Right before their eyes, the control room transformed in an instant into a spacious virtual conference room. The one hundred twenty seven who first established the Artificial world all gathered here to meet. And one solitary figure stood at the lectern. His youthful eyes, filled with passion, studied everyone below.\nThat was Aixia, himself, when he was young. Yes, young. That didn’t just refer to the leather bag people call the human body. At the time, he actually was a young man, 26 years old, the youngest of the survivors.\nHe remembered this meeting. He could never forget this meeting. Because afterwards, he exiled himself semi-permanently from the Star Trail to the Artificial world and took a different path than the other Actuals. Except for Rui An, he’d severed tied with practically everyone.\nThat image began to speak. “I am Aixia Ross,” he said.\n“I am Aixia, Aixia Ross. I am the youngest of the survivors, but I ask for the floor.\n“Standing here, I can only see your likenesses. We all live so incredibly far from each other. On the Star Trail, we are, on average, one hundred twenty kilometers away from each other. Some even live alone like hermits in orbit at the outer reaches of the solar system.\n“I understand your fear. You’re afraid of yourselves, afraid of Actuals, afraid that even speaking to each other could spark violence. We exile ourselves, cocoon ourselves with Artificial servants, deny ourselves any connection with the rest of the Actuals.\n“But, today, I must speak with you, and I beg that you listen.\n“I know the Artificial world has already been built, but I continue to think that the calculations of Artificials won’t actually be useful in controlling our violent tendencies and the situation could get even more disastrous. A person, of course, should be responsible for their own behavior, including violent behavior. We use the Artificial world to take care of everything for our descendants from freedom to their surroundings, and they rob them of the chance for individual responsibility.\n“We were, at first, so afraid of our violent impulses, but we forgot to ask whether these impulses are innate within us as well as whether we can really remove them from others.\n“I beg you to abandon the Artificial world. I beg you that we raise our offspring by our side. I beg you to face yourselves, to face your own violent impulses and desires. Honestly confront yourselves, confront your family, confront your children.\n“I beg you give everyone the truth, including yourselves.\n“There will be death, heroic death and sorrowful death. But there will also be hope. We need fresh blood, new thought, and new vigor. It’s already been dozens of years without any new inventions and improvements. We need to walk together, gather together, awaken the Star Trail. We must establish for ourselves new cities on each major planet. We must replenish our colonies, cultivate our successors. We must continue forward, toss our violent shadow behind us.\n“There will be war.\n“There will be death, war, famine, pestilence, and catastrophe.\n“But if we evade them blindly, and not meet them head on to defeat them, then we will not deserve to be known as humanity.\n“I beg you respond to me.\n“I beg you respond to me.\n“I beg you respond to me . . . ”\nThat solitary figure begged again and again. Such a large conference room, however, held only silence, as though it’d been thus since ancient times and continued to be so for hundreds of millions of years.\n“Everyone, please vote now on the proposal.” A mechanical female voice reverberated through the meeting room.\nOne bulb, two bulb, many bulbs behind the young man lit red indicating “No.” Only the bulb representing Aixia, himself, eventually flickered green among the one hundred twenty-six red lights, as though it were a weak but stubborn seedling among a prairie fire.\nThe young man turned around, then walked away from the lectern. In an instant, he seemed a feeble hundred years old, at last looking as he did now.\n“That was you,” the youngster said softly. His small, sweaty hand, clutched Aixia’s large one.\n“Yes.” Aixia stared at the unreal image of the past. “That was me.”\n“Aixia, perhaps we should have listened to you in the first place.”\nThe two turned their heads. Rui An’s tall and slender figure appeared at the door like a ghost.\n“What is the meaning of this, Rui An? Who rewrote the function? What is showing me this recording of the past supposed to do?” Aixia stared coldly at the woman before him.\n“We rewrote the function. Aixia, I just wanted to you tell you that you were right and we had no choice but to correct these mistakes,” she said softly. “You two, follow me.”\nThey passed through an endless corridor, passing by residential district after residential district. Many districts were covered by a thin layer of dust. Other districts also looked like they’d been vacant for a long time.\n“Where did everyone else go?” Aixia asked. The uneasy youngster gripped his hand tight.\nRui An didn’t answer.\nFinally, she stopped before a huge cabin door. About ten meters tall and twenty meters wide, that was enough to estimate the size of the cabin behind it.\nThe door slowly slid open.\nSeparated from them by a transparent glass wall, they could see in the dull blue light every single sparkling container. Inside were brains, smooth, round, and white as though they were full and ripe fruit. Huge and yet numerous, countless numbers of brains were submerged in a culture solution. They were crammed into the cabin in tidy rows. One side was reserved as a passageway, waiting to be filled by new brains. It was as though they were the rich fruit human civilization bore.\n“They are all here. The earliest and most recent. Our ancestors and our descendants,” Rui An said softly. “It included those people we gathered from the Artificial world as well as also those who first established that world.”\n“ . . . why?” Aixia finally choked out the question.\n“Because of fear,” Rui An answered. “If they have no limbs, they can’t injure others. If feelings can be controlled through a culture solution, then there can’t be any anger. If all of their thoughts are linked together so they can’t tell whose thoughts are whose, then they won’t hate.”\n“All of their thoughts?”\n“All of their thoughts.”\n“Why hide this from me?” He grabbed Rui An’s collar.\n“We are all afraid of you, just like we fear how we once were. You were the only dissenter. You were . . . the only Actual.”\nHe suddenly realized Rui An used that word.\n“All of you,” Aixia said softly.\n“All of us.” Rui An nodded. Her face gradually transformed into an Artificial’s emotionless face. “All of us.”\nAixia wanted to say something, but nothing would come out.\n“What you asked for over one hundred years ago, we’ll now give you. We were the ones who rewrote the separation function. It was so rewritten that the kid,” Rui An nodded at Farrell, “was someone we led to you. What has happened over the past few days . . . was just a test, like the test with his family many years ago. The test results shows that the Actuals’ violent tendencies increased drastically within the Artificial world. You were absolutely right. So, we chose to leave the solar system.” Rui An recounted calmly. “We’ve already mastered the technology to nurture the young mind from the embryo stage. Thus, we don’t need Actuals any more, only Artificials. See you, Aixia. No, we’ll never meet again. We leave you the Star Trail. We leave you the whole of the solar system as well as some Artificial servants. You’ll become the emperor of an empty world. You’ll control everyone’s behavior. Whatever you intend to give the people of the world, they’ll follow you . . . Freedom is fine. Being Artificial is fine. They’ll follow you . . . but it’s your choice, your responsibility.”\nAs she spoke, that large cabin receded into the distance and Rui An’s voice also gradually faded into indistinct noise. Finally, she transformed into an expressionless Artificial statue.\nWeakly interactive calculated behavior. What crossed his mind was: he was powerless to kneel, his face buried in both hands.\nNo, this isn’t of my choosing. Why do they want me to take on the burden now? If the calculations of Artificials had not gone into effect in the first place, then the world wouldn’t have become like this.\nIn his monitor spectacles, the calculations were still ongoing. Death and violence were still being incited constantly. Yes, he was absolutely right. He still remembered, before Artificial behavior was first established, the violent tendencies of Actuals approached ten percent. But nowadays . . . it already approached sixty percent.\nWhen someone is lost inside an illusion and he doesn’t know whom to hate, he’ll hate everyone. When his freedom is destroyed by his circumstances, he’ll want to destroy everything . . . just like Farrell’s parents. The calculations of Artificials never truly eliminated the violent tendencies of Actuals. On the contrary, it intensified how their impetuousness manifested.\nCan I give them the truth? After Actuals themselves have been distorted? Or, should I continue to deceive them, continue the deception to maintain the peace?\nFutilely, he sought some solace from the descendants on Earth, from those free people about to sink into violence, murder, destruction, war, and death. Or, perhaps, he’d find some from those oblivious people manipulated by calculated behavior living peacefully among Artificials.\nNo, he couldn’t find any. He closed his eyes. An abyss lay both ahead and behind him. Freedom and deception were both in his grasp, but any choice was a weight he couldn’t bear.\nThe world became some sort of gigantic, spacious thing. It quickly disappeared into the distance, surrounding him in cold and silence.\n“Aixia?”\nThe youngster’s bony hand fell lightly onto his trembling shoulder.\nPostscript\nIt all started in a QQ group. We laughed at the mention of the latest idea: suppose there was only one real person in the world and the entire world had been established just for him. This would be quite extravagant, right?\nMikoyan Salabaji（I have to conceal the young person’s real name) came out of nowhere to say, no, it actually wouldn’t consume so many natural resources because the actions of one person are extremely limited.\nBlack Cat suddenly remembered a novel by Wesley. In this novel, Wesley compared humanity to insects in an unbounded world forever walking a closed loop.\nIt really wouldn’t require very many computational resources, Mikoyan said. In so many games, it’s blurry when you look in the distance, but you never feel uncomfortable because in real life, we also can’t see things that are extremely far away. So simulating the world only as far as one person can see was enough. The behavior of everyone else can be economized.\nThus, Black Cat and Mikoyan as well as friends in the “Eight Cooper Coins Inn” QQ group began to discuss it further, thinking about whether it was possible to be frugal with environment resources. What about the “Artificials” surrounding the “Actual?” These androids who converse with him and live their daily lives with him ought to require lots of simulation resources to sustain, right? However, how many people can one person stay in contact with at once? Get together with three? Chat with a group? Shoot the breeze with fifty in a QQ group?\nIt doesn’t need to be fifty. An active QQ group doesn’t have more than twenty.\nSo we suddenly realized it really wasn’t all that extravagant to counterfeit a world. And the Actual would have no way to realize any of this because everything he perceives around him was extremely normal and true to life.\nActually, this is an old paradox: you’ll never know. In the world outside the limits of your perception, in a given moment, what has actually happened?\nOriginally published in Chinese in Science Fiction World, May 2010.\nTranslated and published in partnership with Storycom.\nJohn Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story."}