{"fingerprint": "IEM2JY6n3rTCbl2JWrsvyLTtUQQ=", "sitename": "Clarkesworld Magazine", "title": "Rain Ship by Chi Hui, translated by Andy Dudak", "author": "Chi Hui; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chi_02_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Rain Ship by Chi Hui, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14280 words, novelette\nRain Ship\n0\nThe funeral was as simple as I expected.\nVisitors passed by the coffin one by one. The cold moss-light was centered on the coffin’s translucent lid. Under the dim lighting, Abani’s face seemed once more full and round. Her final hours had been painful, but fortunately—for all of us—she hadn’t held out too long. I heard crying, and saw it was Laila. She was supposed to become a sister in our family this year, but now it looked like that would have to wait. Mourning rituals were necessary. They were for the living, not the dead.\nMy maternal aunts walked by the coffin. I supported my weeping mother. Grief had shortened her, curled her up, bowed her back. I let the tears slide down her cheeks, not wiping them away.\nBehind the aunts were the girls born in this home, and then the boys. The boys look puzzled and sad, but they didn’t keen like the girls. They had, after all, grown up elsewhere, in various fathers’ households. They probably had only vague recollections of Abani.\nBlood had summoned us together. That’s what the funeral said. Blood kept us in this world, and now we’d returned to those who’d given it to us. They had been waiting at the other end of the world for a long time, extending a welcoming hand.\nSing for her. She is finally at peace.\nThe children sang first, starting the dirge. Then the sisters joined in, followed by their respective families. And then the boys. It was an old lament, praising sisters and brothers, fathers and mothers, children living and children sacrificed1. Mother clutched my hand, my fingers going numb. She sobbed as if there was no end to her tears.\nWhen she finally stopped crying, we had buried Abani. We were sitting on our home’s old fashioned iron pipe.\nShe still clutched my hand.\n“How long will you stay?” she asked hopefully.\n“I’ll leave tomorrow.”\n“Tomorrow?” Her voice was tense, her sad, moist eyes watching me. She wanted me to stay. She always wanted that.\n“I’ve booked a ticket. Hill Four has excavated a big site. They want me back as soon as possible.”\n“You’re not an archaeologist.”\nTrue, I wasn’t an archaeologist. I’d been a soldier. Now I was a mercenary. Excavations of ancient human sites made people rich, and interstellar pirates sometimes caught wind of the spoils. My work was protecting such sites. My boss paid me to use my head and risk my ass. Some thought it wasn’t suitable work for a woman, but I’d been at it for years.\n“They need me.”\n“Your family needs you.”\nI looked at her, knowing my expression was blank. Every time she reached out to me, I retreated into my shell, aloof. That was how I resisted my family.\n“I’ll go tomorrow,” I repeated.\n“You should find a family and settle down. Or else come back here to stay. A girl can always return to live among her sisters.”\nI studied my mother.\nShe’d aged a lot in the past fifteen months2. And I had grown up. I knew this, but it was difficult to process. I still felt like that dazed child, staring blankly, watching mother’s pleading face. I still remembered a long winding path, on either side the flowers of small succulent plants blooming in profusion. They had been dark red, like blood, or the evening sun.\n“I’ll go tomorrow,” I said. “Otherwise they’ll hire someone else. Out on the frontier there’s no shortage of mercs willing to hazard their lives.”\nShe began to cry again. After a while she wiped away her tears, sighing. “You’re a rough, thick-skinned girl. I wasn’t a good mother, I know. I’m sorry, Jin. I’m sorry.”\nShe was always like that, apologizing endlessly. She was like that before the incident, and she hadn’t changed since.\nI don’t need apologies, Mother.\nI turned to the window, trying to imagine the planet I was about to visit. I recalled the space station, its translucent dome, people looking up at a sky full of bright, cold stars. Whenever I was there I liked to watch the heavenly vault spin slowly. I imagined it reversing direction, and everything starting over.\nWhat I wanted was to have never been born.\n1\nHill Four is 3,000 light-years from Earth. From there, the Milky Way is not the pale white band you see from Earth, but a massive disk crowning the heavens. Hill Four’s sun hangs alone in the sky, giving its meager heat. It was flung off the galactic plane with its planetary children in tow. From an altitude of 3000 light-years it looks down upon the Milky Way’s spiral arms.\nDespite its bleak and deadly surface, Hill Four was suitable for colonization. Underground, the vast Underhill Sea covers almost three-quarters of the planet’s inner surface. Life thrives on geothermal energy down in the darkness. Humans came here first. We Ruderans followed in their footsteps much later.\nAs my ship entered the spaceport, I saw the transport carrying the relief merc team had arrived before me. They were busy unloading an arms shipment.\n“Well if it isn’t the lone she-paladin. Long time no see.” It was Old Mortar hailing me, without malice. All of his mercs were men. There were many female mercenaries out here, but lone operators like me were scarce. Old Mortar and I had rubbed each other the wrong way for many years, quarreling frequently. Now we reluctantly tolerated each other, maybe even respected each other a bit.\n“Been a long time. How was your holiday?”\n“Went from bad to worse. The boys have been drunk this quarter3, the shit-stains. I had to knock some sense into them. Keep that to yourself. The Doc wants you to get over there to the Rain Ship ASAP, and bring your kit. My people will hold down the fort here. They need at least one person with law enforcement powers over there.”\n“Rain Ship?”\n“You haven’t heard? They found a portal of the old gods on the bottom level of the station. On the far side they found . . . well, it’s a spacecraft for sure, but it’s damn frightening. Honestly, I’m glad me and the boys don’t have to go over. I don’t wanna see any more of it.”\n“How big is it?”\n“How big?” Old Mortar grew uneasy. “Too big to see in one glance. There are clouds inside of the thing, child. And rain!”\nOld Mortar and his boys had enough weapons and equipment to fill a ship, but I had only a small backpack. After putting my gear in order, I received a message from Dr. Hort on my terminal, confirming everything Old Mortar had said.\nI passed through the shipyard, then took a hundred-million-year-old human elevator down to the lower levels.\nWe used to call these wise prehistoric beings gods4, as Old Mortar still did. But I’d always preferred to call them giants. They’d built this spaceport, and it was like a city. This elevator was the size of an apartment building. I raised my head to behold the vast space, imagining a creature sixteen times my size standing here. They’d come from Earth, their footprints covering many worlds, and at some point they had mysteriously vanished. And then we had tracked them, cutting their sign, only to find these great, mysterious, indescribable constructions.\nAn archaeologist had showed me a rubbing of one of their footprints. It was big enough for an adult Ruderan to comfortably lie in. Later I saw an ad for beds shaped like that—the lengths boring people go for a little spice in their lives.\nAbout nine standard months ago, Hill Four orbital sites had been discovered. Then the ruins on the Underhill seabed were found and excavated. Suddenly this desolate frontier became a hot spot. Operating on the principle that development and exploitation should advance in tandem with archaeological research, archaeological teams blazed trails, studied ruins, certified safe zones, and finally left them to developers. These builders brought rope and tents and building materials, and the human station quickly became a Ruderan city. Two mercenary teams were on duty here, and a few wandering loners like myself.\nBut I couldn’t get used to this human architecture. The station was huge and strange, built into a spherical space vast enough to contain a Ruderan capital city, and one or two artificial lakes.\nOld Mortar’s mercs were already in place. Those who’d just been relieved came down the wall on rope ladders, expressions eager, hankering for a quick return to the city. They would get drunk and sleep, then seek out girls.\nDr. Hort had sent my itinerary. I was summoned to the portal Old Mortar had mentioned, but I decided to visit the bar first. Hort might get angry, and she might not.\nSometimes I have premonitions. These feelings usually presage something terrible.\nThe bar was practically empty. It was seven, a work stretch5, so most people were on duty. I sat down, ordered a cup of corn juice, and put a roll of money on the bar. The barkeep’s eyes lit up, but almost immediately he seemed to lose interest. For the past month, this bar had been my intelligence purchasing hub, and that roll of bills included the barkeep’s fee.\n“Anything interesting lately?” I whispered.\n“Can you be more specific?”\n“The new site, the discovery. Since I sat down I’ve already spotted three relic hunters in this dump.”\n“You’re worried about relic hunters?”\n“They’re for Old Mortar to worry about. I’m headed to the other side. Any pirate activity lately?”\nBefore answering me, the young man looked around for a moment. He and the owner belonged to the same family. In fact the bar was their family business6. I liked these people. They were careful and smart. They knew what to do and when to do it.\n“About a stretch ago there were five people here, armed. Strangers. I didn’t like the look of them. They drank a lot, then took two sober-up pills each. They just left, actually.”\n“Where’d they go?”\n“Up. Probably back to the shipyard.”\nFrowning, I used my terminal to access the shipyard and make inquiries. There was no one there. The monitors should have spotted these five eye-catching fellows.\nIf I’d been a pirate, I might have found it difficult to dress up and infiltrate a space station, although a bribe would have gotten me into the navigation tower. I would have looted one of those freighters, when it was loaded with human relics and awaiting take-off clearance. The next one was due to launch at eight. Freighters had only one stretch of vulnerable down time between landing and launching. If those five strangers were raiding a freighter, they must have been real alcoholics to need a bar-run during the operation.\nUnless they—\nThe mercs were changing shifts now. The last shift was leaving, and Old Mortar’s boys had just arrived. Now was precisely when the station’s guard was most lax. What if the five weren’t after a freighter? If they wanted something the archaeologists had discovered on the other side of the portal, their only option was to capture the portal—\nI slammed a bill down on the bar as I rushed out. I placed a call as I ran.\n“Old Mortar!” I exclaimed, “put your guys on alert. We may have a situation—”\nThe deafening explosion roared through our connection. I stood in the corridor, holding onto some netting and peering down: a rushing plume of smoke and dust rose from the lower levels. Such massive destruction, but in the context of the vast spherical space containing it, it was miniscule.\n2\nAfter an endless moment watching the explosion balloon, I terminated my call, shouldered my pack, and used my tail to retrieve two gleaming bullets7. Drawing my gun, I rushed against the flow of the crowd toward the lower levels.\nThe portal was at the very bottom of the station’s vast spherical space. I felt like I was rushing down the side of a titanic bowl, my duty carrying me along like a whirlpool, as the panicking crowd charged upward. At least they were staying out of my way, in deference to my weapon.\nHalfway down, I spotted Lana Guer and her family sisters. These women were relic hunters8. I had arrested them for smuggling before. They had numbered six, but now they were only four, dejected and covered in dust. Lana’s eyes were bright with horror.\n“What’s the situation down there?” I demanded.\nShe glared at me, even now summoning up her old arrogance.\n“I’m not looking to arrest you! Whoever dared to set off bombs on my turf is getting disemboweled! Now where are your other two sisters? Down there?”\nHer twitching tail-tip confirmed my guess.\n“I’m going down. Maybe I can help you, if you hurry up and help me. What can I expect down there?”\nHer expression softened. “I’m not sure . . . ten, maybe fifteen people. Heavy guns and explosives. They blocked off two corridors, the two where Old Mortar’s guys are quartered. Nini and Jilin are in there too. We couldn’t get through. I couldn’t help them . . . ” She shook her head in torment. “They’re wearing masks. I heard them shouting. Sounded like Northern An9.”\n“Thanks, Lana.”\nShe nodded, then ran on, but suddenly stopped and turned around.\n“Jin?”\n“Yeah?”\n“You’re a cruel little bitch. But don’t let those fuckers kill you.”\nShe thrusted her middle finger at me, then ran up the corridor.\nAfter passing through two winding tunnels, I heard my first mark10. He was about three tunnels away, speaking loudly. I understand a little Northern An. At first I thought they’d already neutralized Old Mortar’s mercs—but no. The raiders hadn’t taken the portal yet. Old Mortar’s fierce troops had been hiding in the portal corridor, lying in wait.\nI grinned silently.\nStepping lightly, I drew my dagger. I took a roundabout route and eventually spotted my mark hanging in a look-out net11. I crept up, gathered a support line in my hand, then another, and a third. My dagger struck. The raider tumbled down from his post, net piling around him on the floor. I pounced and buried my blade in his heart.\nHe looked at me in shock, and then his eyes dimmed.\nI pulled out the dagger, wiped it on the netting, sheathed it, and moved on. These people were real professionals. First they’d bombed the merc barracks, dividing the enemy, creating panic—objective clear, actions quick and decisive. I’d have been the one dying on the floor now if I hadn’t been so ruthless.\nRacing against discovery, I advanced down the ground level passage, taking out another pirate along the way. I came to the door leading to Old Mortar’s holdfast. Unfortunately, I made a bit of noise while disposing of the raider guarding the door: Just before my rounds opened his head, he turned and squirted a whole clip into the tunnel wall. The report was deafening in the confined space of the tunnel.\nThe massive door was dead-bolted from the inside. I frantically pounded out a merc passcode, then began to repeat it, knowing more pirates would soon arrive. The door opened a crack, and I squirmed my way in. Then I was on the other side, helping someone—I didn’t know who—shut and bolt the gargantuan door.\nI turned around to find Old Mortar glaring at me. His tail was bleeding and his head was bandaged. Behind him stood two of his mercs, also in a sorry state.\n“What the fuck are you doing here, Jin?”\n“Trying to rescue your asses.”\n“Seventeen,” I amended. “Seventeen fucking raiders out there. I killed three.”\n“So each of us just needs to ice two and three-quarters pirates. Our prospects have improved.”\nI chose to pardon the old fucker’s sarcasm. He’d started with thirty men, six of whom belonged to his family.\n“What about civvies?” I asked.\nOld Mortar shook his head. “The two Guer girls, three researchers . . . I let them go through the portal. Any ideas on how to proceed?”\nI shrugged. “We all go through the portal and shut it from the far side. Safest bet.”\nOld Mortar shook his head. “I still have people stuck in the barracks,” he said. “I’ve signaled the Hill system fleet for help. You take this ansible and go through, then shut the portal.”\n“And you?”\nHe shrugged gloomily. “I can’t leave my people behind.”\nI glanced at the weary mercenaries. “Seems a few of your men might not agree.”\n“Those who wish can follow you,” Old Mortar said.\nTwo young mercenaries glanced at each other, then got up and moved to my side. They were not Old Mortar’s relatives, and clearly didn’t want to follow him on his reckless path. They apparently did not believe that the Northern An pirates would treat their captives well.\n“You sure?” I asked Old Mortar.\nHe flicked his tail impatiently. “Go through, and close the portal.”\nI nodded and turned, leading my two mercs toward the strange artifact. Made and used by giants long ago, it was as high as a ten-story building to us. We created ripples on its mirror-like surface as we stepped through. I felt I was falling in every direction at once. My body didn’t seem to exist, while my soul seemed dragged through multicolored light. Then my feet were touching ground. The two young mercs were kneeling beside me, one trembling, the other crying.\nThis was not the first time I’d crossed a human portal, but no matter how many times I did it, the sensation was unnerving.\nI spit bile, and looked up.\nAnd I saw.\n3\nWe were inside a titanic spacecraft, if that’s what it was. ‘Rain Ship’ was shuttle-shaped, and in terms of our apparent gravitational orientation, it was standing erect. The long axis was at least a kilometer high13. I could only vaguely discern the summit. The horizontal axis was at least 400 meters long. At the ship’s center, enclosing most of the long axis, crystalline walls formed a suspended space like a six-sided prism.\nThe outer shell of the spacecraft was built around this floating space. The ancient humans had built cabins and facilities on the inner surface of this shell, simple yet solid, which remained intact after one hundred million years. A walkway spiraled up the shell, connecting the cabins. Bridges and tunnels extending from this walkway—and various cabins—connecting to the floating, crystalline space.\nWhich was a great tower of ecological habitats.\nFor some reason my eye was drawn to one facet of this dazzling jewel: a small path winding through thick grass, only the flagstones of the trailhead visible, ancient stones cracked and pierced by tenacious green growth.\nEcological spaces filled almost the entire spacecraft, divided by panels of polarized light into self-sustaining ecosystems. Thick clouds filled the upper spaces. Mists curled and rose on grasslands, on leaves of grass twice my height. Fine rains descended on gardens, inaudible. The ship was silent, but I saw raindrops gleaming on leaves.\nBig, titanic, colossal, beyond description—I quickly spent my ammo, adjective-wise. I just stood there, looking up in awe. The giants that had built this ship, this great hall, had vanished a hundred million years ago. But rain fell continuously down this great pillar of ecologies.\nNow we Ruderans were here, trespassing, feeling small and insignificant, and compelled to silence.\nI stared dazedly until a sound on the walkway below caught my attention. The two Guer girls had emerged, holding archaeological grinding lasers like guns. They looked nervous, eyeing me and my two mercs.\nI didn’t bother asking how they got down there, but immediately straddled the railing, hung from it, and slid down to their level. I appraised the two unarmed girls, wondering what could have been going on in Lana’s head.\n“Catch.” I took two pistols out of my pack and tossed them to the girls. “Better than those lasers. Nini, yours is pointed the wrong way. Try not to decapitate yourself, okay?”\nShe hastened to put down the implement, as though it had grown hot in her hand. Jilin eyed me doubtfully. She was brainier than her sisters. “Since when are you helping us?”\n“Since I met Lana on the other side. She asked me to find you. I’m happy to let the Guer family owe me a favor, or two.” I waved my gun at the mercs, summoning them down. “Where’s Dr. Hort? I need her to help me close the portal ASAP.”\n“Close the portal?” Jilin seemed incredulous.\n“How long do you think Old Mortar can hold out over there?”\nJilin said nothing.\n“Dr. Hort is in there,” Nini said, gesturing to a massive ancient human door that was open a crack. “We have our own situation on this side. The doctor sent us to have a look.”\n“Situation?”\n“Someone else is in here with us.”\n“You’re fucking joking.”\n“My mother likes to joke. I do not.”\nDr. Lee Hort and her assistants had occupied a small corner of the ancient human control center. They huddled together, panic-stricken. Various instruments and equipment lay piled to one side. A small moss lamp hung over a portable lab table14. Starlight pierced the command center’s vast transparent screen, weakly lighting the area. A small spacecraft was vaguely discernible, hanging in the ancient ship’s docking bay like a moth.\nMy entrance surprised the researchers.\n“Jin?” Dr. Hort stood. “When did you get back? I thought you were due in next quarter. How did it go back home? Everything okay?”\nI raised a hand and interrupted her. “There’s no time for all that, Doctor.”\n“I’m sorry.” She lowered her head. “I just . . . you know, these things, I’m nervous.”\n“Never mind.” I glanced at the ship. “When did that arrive?”\n“Just now,” a young lab tech said. She was a sister in the Hort family. “We heard an explosion and ran over to see it.”\n“Explosion?”\n“They couldn’t open the hangar door, so they blasted their way in.”\n“They? How many?”\n“We’ve seen just one.”\n“Do you know where he’s going?”\nThe girl shook her head.\nI studied the ship more carefully: a two-seater shuttle, fast, suitable for carrying light firepower, a popular model among relic hunters and loner pirates. I had a similar one. No matter what this explosive visitor was after, he was not a novice. Directional detonation, choosing the weakest point in the meter-thick, airtight bay door, and afterwards using his own ship to plug the hole and prevent depressurization of the bay—\nI tried to clear my head. “Dr. Hort, for the moment let’s set aside the question of this lone gun. We have three mercs and at least five weapons. We need to go up right now and close the portal from this side.”\nThe good doctor seemed shocked. “You’re proposing we trap ourselves in this ship with that desperate rogue?”\n“You need to understand the situation on the other side,” I said, growing impatient. “If we don’t close the portal, then we’re dealing with a gang of desperate rogues, not just one.”\nStill reluctant, she finally nodded her assent.\n“Get your techies together. We need to use the ansible I brought to contact Hill system security management. Nini, Jilin, you stay here. You two . . . ” I glanced at my mercs. “ . . . you’re with me.”\nThe two young mercenaries exchanged a glance, but surprised me by not objecting.\nWe climbed up the research team’s rope ladder, ascending 40 ta15. Sliding down a rope ladder is easy, but climbing is hard work. Behind me I heard the two women breathing. They didn’t complain—yet another surprise.\nThe portal’s control console was a massive, complicated thing. Fortunately, Dr. Hort had already interfaced it with her team’s smaller, portable version. She entered a series of commands, and the mirror-face of the portal dimmed. At last it seemed to break apart inside its frame, dissolving in particulate light. I felt relieved.\nI just hoped Old Mortar’s luck would hold.\n“Contact!” cried the young researcher, who’d been fiddling with my ansible.\nThe gunfire was faint. It sounded like cracking nut shells. At first I barely reacted, thinking it was coming through the link. Then the communicator went mute, smoke issuing from a bullet hole in its power unit. The researchers stared blankly, unable to process what had happened.\nI turned in the direction of fire, spotting someone almost two hundred meters away on our level. He’d hit our ansible from quite a distance. With that kind of accuracy, why not hit me or the mercs first?\nI had no time to think about it. I motioned for the researchers to hurry back down the ladder. I drew my gun and moved to the corner of the portal chamber. The outer wall also had a rope ladder, but using it would surely give the shooter an easy target, so I decided to climb up a human-era pipe16.\nThis turned out to be a mistake. I should have returned to camp with the others, where we had the advantage of numbers. I was tired and frantic after a twenty-four hour subspace jump, and non-stop action since landing. All these exigencies had worn down my intellect. I’d thought the shooter was one of the pirates. Since I’d already killed three of them, I thought I could take this one alone.\nAt least, I thought so before his gun was against my forehead.\n“Hi there beautiful.” His voice was happy, self-satisfied. “Climb up the rest of the way. I’ve been waiting long enough.”\n4\nI slowly lifted my head to face him, and the muzzle of his weapon, striving to keep my movements non-threatening. The intruder was about my age. He sported a head full of spiky brown hair, and wore a simple combat model pressure suit. His battle-pack was the same brand as mine.\nBut the gun in his hand was a Uran-571, large caliber, strong firepower, strong recoil, capable of ripping large holes in bodies. Not my weapon of choice.\n“Slowly. Up you come.”\nGrinning, he reached for the two guns holstered on my waist. Then he patted down my ankles, checking for back-up weapons. He nodded, indicating I could stand. Face to face, he was a bit taller than me, ordinary-looking except for the garish scar tissue on his forehead: a white line spanning hairline to brows, probably a knife wound.\n“Turn around,” he ordered.\nI couldn’t place his accent. His Common Tongue was pure, not colored by Northern An or any other dialect. As I slowly turned around, I caught him in my peripheral vision pulling tri-cuffs out of a pocket17.\nHis model of pressure suit has a shortcoming: it slows you down a bit.\nI lashed out my tail and seized his wrist. The tri-cuffs rang against his pistol as they went flying. Before he could retrieve his weapon, I dove to one side, rolled through the gigantic half-closed door, and rushed out of the room. I fled down the seemingly endless walkway. I came to a rope leading down to lower levels of the spiral, and my pursuer emerged behind me, gun raised.\nI grabbed the rope and jumped. My feet slammed against the wall. I pushed off, rappelling, traveling swiftly downward. Suddenly he was above me, peering over the edge. Contemplating the rope. My blood froze in my veins. If he cut the rope I would fall a hundred meters and end up a splatter of fine red paste on the ground floor.\nBut he didn’t cut the rope. He just grinned, as if at some cosmic joke. Fucking hilarious. Especially when I failed to grab a safety net, for the second time, and like a fucking novice continued to plunge. His eyes flashed a strange dark green, reflecting the polarized light of the great pillar of ecologies.\nRappelling, I landed on the next floor down. When I looked up, the intruder had vanished.\nA good mercenary should always have spare weapons. I cannot be considered a bad merc, and this was not the first time I’d lost weapons to an opponent. My tail opened my pack as I ran, and retrieved the small-bore pistol within. Its stopping power was weak, but just then it was all I had.\nThe Rain Ship was quiet. I gripped my pistol, moving slowly, keeping an ear close to the wall. I heard the intruder’s footsteps, could barely distinguish that he was moving downward. I guessed he was headed to the researcher’s camp, the ship’s control center. Besides the portal, the control center was the most strategically important part of the ship.\nLuckily, it sounded like he was taking the main staircase. I knew a shortcut.\nOnce again I got on the rope and started rappelling down, slowly and carefully this time. I couldn’t hear his footsteps anymore.\nAs I neared the bottom, a gunshot pierced the silence, then a second and a third.\nI let go of the rope and hit the floor. In a flash I was up and sprinting in the direction of the gun reports.\n5\nI ran to the corner separating me from the action, adjust my breathing, gripping my weapon, finger on the trigger. I leaped around the corner, ready to—\nFuck.\nI blinked.\nThe intruder was on the ground, unmoving. I didn’t know if he was alive or dead. Dr. Hort held a small lady’s pistol, trembling, finger still squeezing the trigger, seemingly unaware that the weapon was spent.\nI walked lightly toward her. “Doctor . . . ” Her shoulder trembled, and I reached out and held it. “Dr. Hort, it’s me. Don’t be afraid. It’s over. You got him.”\nSoftly consoling her, I removed the gun from her stiff hands.\nThe intruder groaned something unintelligible. Lee Hort flinched like a rabbit, and I quickly moved past her, aiming my gun at the intruder’s head. I noticed there was no blood. There were three small craters in his pressure suit, which was designed to withstand vacuum and micro-meteor impacts. Hort’s three bullets had been no problem, but I reckoned this man’s ribs weren’t comfortable just now.\nI nudged his backpack with my foot until the tri-cuffs fell out. Soon he was firmly shackled.\n“It’s all right, Doctor,” I said to Lee Hort.\nOthers who had heard the gunshots soon arrived. The corridor became a noisy, crowded place. The intruder struggled, trying to rise, and I shoved him back down. Everyone was perplexed, except for Lee Hort. She stared at the intruder with a mix of fear, hatred, and deep shock.\n6\n“What is your name?”\n“ . . . ”\n“Which mercenary group are you with?”\n“ . . . ”\n“What are you doing here? Why did you shoot our ansible?”\n“ . . . ”\n“How about I just dispose of you right now?”\n“ . . . ”\nNo matter what I asked, the bastard remained tightlipped.\nHe was tri-cuffed to a pipe—Nini’s idea—just near enough to our camp to keep an eye on him.\nDr. Hort seemed better than before, striving to appear calm, but every few minutes she glared at our prisoner, her shock returning.\n“Okay,” I whispered, “one last question. What is your relationship with the doctor?”\nHis shoulder twitched, but he remained silent.\nI sighed and returned to the heart of the archaeologists’ camp. The researchers talked quietly amongst themselves, while my two mercs sat apart from the rest. Jilin and Nini were studying the broken ansible.\n“I think I can fix her,” Jilin Guer said, sitting amid scattered parts. Proudly she added, “I can’t fight, but I can do this.”\n“Her?”\n“All ansibles are girls,” Jilin said gravely. “They’re the best at sending messages.”\nSome of the archaeologists laughed. Jilin proudly cocked her head.\nLee Hort sat alone, apparently deep in thought. Her fingers were interlaced before her, still trembling slightly.\nI walked over.\n“Doctor, can we talk alone?”\n“Okay.” She got up, clearly nervous, and I took her further from the group, hoping that no one would overhear our conversation. “Thank you for saving me,” she whispered.\n“As far as I can see, your marksmanship was fine. You didn’t need saving. But I think you know him.”\nHearing this, she jerked back, as if ready to flee. But she stood rooted, hands clenched together, glancing back at her archaeologists—her family.\n“I did not . . . expect him to find this place.”\n“Who is he?”\n“Dar,” she said, taking a deep breath, as if she’d come to a momentous decision. “Yes, that Dar.”\n“Oh,” I said. “Fuck.”\nAlong the galactic edge, Lee Hort was legendary, not only because of the large number of ancient human sites she’d unearthed, but also due to her unique past. She’d grown up in a sect of the extreme Darwinian Church18. These people were totally insane. Eschewing the standard Ruderan practice of choosing one child per litter at birth, these Darwinians raised the whole litter to age ten, then forced them to fight each other to the death19. The last child standing entered the family.\nBut they made a mistake when raising Lee and her litter-mates. They underestimated the boy named Dar, who decided to put an end to the sect and its horrific child abuse. After the adults had entered their temple to hear their priest evangelize, Dar locked the tunnel doors and lit a fire. The adults died of smoke inhalation. Then Dar returned to the dormitory and killed his litter-mates.\nLee Hort escaped calamity because she’d gone out to fetch water. Dar also fled, and later discovered that firefighters had rescued Lee. The massacre had shocked all of Orchid Autonomous Sector. The details of the incident were still well-known years later.\nDar had never been found. Some people said he was dead, others that he became a mercenary, or a pirate—one of those professions that meant killing for money, at any rate. Every now and then, someone claimed to have encountered Dar, and the stories were usually horrific. It was said he killed a space station’s entire population of extreme Darwinists, and that he sent a ship full of pilgrims to its doom in a star.\nThese stories also disturbed Lee. After she was taken in by the Hort family, she enjoyed a normal and happy upbringing. But no matter how much she achieved, how many ancient human sites she discovered or how many honors she was awarded, people still thought of her as that escaped litter-mate, someone not meant to survive. They couldn’t help associating her with her litter-mates, who died so unnaturally. I heard she donated a fortune to an organization that helped children. She had pushed the Alliance Parliament to pass a law declaring all extreme Darwinism churches illegal. For someone bearing such a tragic past, she was doing remarkably well.\nBut . . .\n“We can’t escape our pasts, Doctor,” I whispered.\nShe smiled bitterly, nodding.\n7\nAfter an hour or so, a frustrated Jilin announced she needed to rest. I told my two young mercs to do likewise. I didn’t know when we’d be leaving this place. If we couldn’t fix the ansible, we’d have to wait for a rescue ship from the Hill system capital to find us.\n“Shift change,” I explained to Dr. Hort.\nShe nodded wearily, and divided her people into two teams. Then she went to sleep.\nNini Guer was wide awake, sitting on a mat and seemingly bored to death. She fiddled with the pistol I’d given her.\n“Careful with that,” I said.\n“I unloaded it.” She shrugged. “I’ll be better with this than that damn laser grinder. Jilin can’t fight. I have to look after her.”\nI laughed. Sometimes I envied those with close blood ties: men or women, familiar with each other, caring for each other. You could trust your sisters or brothers. You shared everything, including pain.\n“What are you laughing about, Jin?” Nini watched me curiously.\n“Nothing, I just . . . you’re lucky, having family, you know.”\n“Why don’t you find one? What about a female mercenary family?”\nI reached out and rubbed Nini’s head. She regarded me, head askew, but didn’t stop me. She was only fourteen years old. Under the Guer family’s wing she’d traveled all over the stars, undaunted, never alone. I was already twenty-six, and still alone, traveling from star to star, battlefield to battlefield. When my last partner and I had dissolved our partnership, he said my fearlessness in battle was down to a death-wish. He said I was in a hurry to die.\n“I’m used to being alone,” I said. “The reason is complicated.”\n“Do you want to talk about it?”\n“Sorry, no.”\nNini made a face. She didn’t understand, and explanations probably wouldn’t help. Moreover, she did not seem terribly interested.\n“Okay,” she said, “change of subject. I don’t like that doctor.”\n“Dr. Hort? She’s got her baggage, but she pays my salary.”\n“But do you like her?”\n“Why, Nini? What is it about her?”\n“I hate her.” This Nini was straightforward. “Lana never put herself first. She always let us rest before she did. And she never would’ve done what Hort did . . . put grinding lasers in our hands and push us out into danger, like cannon fodder, while she and her relatives hid.”\n“But Lana would send you into battle, right?”\n“She’d be there with us, to protect us. Not hiding in the rear like your doctor, a coward and a thief.”\n“Thief?”\n“Lana discovered the portal. Hort snatched the archaeological evidence from our hands.”\nI raised a brow.\nGenerally speaking, relic hunters were not qualified archaeologists—but Lana was a veteran in this game. It was not hard for me to believe Nini. “Didn’t Hort compensate the Guers?”\n“Not really.”\n“Come on. Are you sure?”\n“I’m not lying, Jin. You got some way to make this right?”\n“No.”\n“No?”\n“She pays my salary, remember?”\n“Wow. How predictable.”\nNini pouted. I laughed and rubbed her head. “Where’s the water and biscuits?”\nThe water was bottled, and the biscuits damp, not very appetizing. I carried both to the man in tri-cuffs. He seemed to be napping, but heard my approach and raised his head. His eyes widened when he saw the food in my hands. He pretended indifference, and his face was suddenly like Lee Hort’s. I was surprised I hadn’t seen the resemblance before—surely they were litter-mates.\n“Would you like something to eat, Dar?” Was that a micro-expression of surprise? If so he quickly hid it with a sneer, and shook the tri-cuffs. “I’ll unlock a hand for you. Don’t try anything funny.” He acted tough, but when I unlocked his right hand, he breathed in relief. He had a broken rib, or two, I remembered. Although the bullets hadn’t penetrated his suit, they’d hit him hard. “Let me see.”\n“Fuck off.” These were his first words in captivity.\nWe glared at each other a moment, neither of us looking away. I pulled on his pressure suit’s front zipper. “What are you hiding?”\nObviously injured, he grimaced in pain, but he wouldn’t let me open the suit. Then I remembered something embarrassing from my time in pressure suits. His suit seemed quite old. “Need the bathroom?” I asked.\nIf looks could kill—but he nodded.\nI un-cuffed him from the pipe and escorted him to the portable toilet set up by the archaeological team. He impatiently rushed inside.\nA few minutes passed, then another few.\nI knocked on the door. “Listen pal, finish up and get your pants on. I’m about to put a bullet through this door.”\nI heard a muffled curse.\n“What was that?”\n“Do you have anything I can wear?”\nI turned to see Nini rolling on the floor and stifling laughter. She managed to point to a heap of white lab uniforms. I went over and found something approximately Dar’s size. I gripped my pistol tightly. This guy might be planning an escape attempt, but it didn’t seem so. Fifteen minutes after I pushed the uniform through the barely open door, he emerged clothed, carrying the ragged pressure suit and looking embarrassed, but considerably less dejected.\n“Hand and tail.” I shook the cuffs at him.\nHe glanced around, perhaps reckoning his odds, escape-wise. Nini had stopped laughing. She played with her gun. I didn’t know if she’d reloaded it.\nFinally, Dar let me cuff his left hand and tail, and return him to the pipe. He grabbed the water and gulped down as much as he could. I checked his ribs: they were bruised but didn’t seem broken.\n“You’ll live, for the time being,” I announced.\n“That’s a pity,” he said through a mouthful of biscuit.\nThe prisoner was less hostile on a full belly—but he answered my questions with yawns.\n“You’re not likely to believe anything I say,” he finally explained. “Why not just let me sleep?”\nI sighed and played out the chain of his cuffs a bit, so he could lie down.\nI turned to leave, and suddenly Dar said, “By the way, don’t let your girl repair the ansible. If she gets it working, you’ll regret it.”\n“Why?” I asked, puzzled.\nBut he was already snoring.\n8\nI carried the basket, walking along the narrow path among the blooming, crimson flowers. The leaves of the short, fleshy plants were a warm purple. They gleamed under a light drizzle. Carrying the basket was a labor—it contained six sleeping infants, too heavy a load for a ten-year-old.\nI returned via the same path. Headed out, the basket had contained six babies. Returning, it held only one.\nI took the child through a long underground tunnel, attracting curious looks.\nI can picture that underground Temple of the Five like it was yesterday20. I went through the gate, around the massive inverted bell21. It was said that in the past, priests would ring the chime during times of war or plague, times when the population had shrunk. The chime summoned people for an announcement: the population control law was temporarily suspended. You could raise every child in your litter, rather than killing all of them but one. But the last time it was sounded, Abani’s Abani was still a child22.\nThe priest greeted me as I entered the temple. I was a child holding a smaller one: he seemed to guess what had happened. “What about your mother?” he asked kindly.\n“I want to leave her here,” I said, ignoring his question.\nHe looked at me sadly. “Will you stay as well?”\n“I’m going.”\n“What is her name?”\nShe didn’t have one yet. My father had left us, and my mother did not want his children, not even one. She’d refused to name them, and she’d lacked the courage to kill them. So she’d asked me, begged me to . . .\n“Her name is—”\n“Jin . . . Jin!”\nI was shaken awake. My anger flared, and I reached for my gun, but it was only the familiar face of Lee Hort—an irritant, to be sure, but perhaps meriting continued life. Besides, if she died, that would be the end of my salary. I withdrew my hand from the gun. “What the hell? Can’t I just get a few winks?”\nShe looked nervously at Dar. “I have something to tell you, Jin.”\nI bared my teeth and got up, muttering curses. My voice was low, but the performance was enough to make Lee Hort blanche. She said nothing as she guided me down an empty corridor. Passing Nini and Jilin’s sleeping mat, I saw that the ansible was nearly repaired.\n“What is it already?” I asked.\n“It’s Dar,” Lee said, biting her lip. “I remembered you have law enforcement powers.”\n“Correct.”\nAfter ten years of frontier chaos, Orchid Autonomous Sector officials had decided they might as well delegate frontier law enforcement to mercenary groups, and assessment to independent mercs. We had the right to arrest, incarcerate, and in extreme cases, execute offenders. Frontier prosecutors (usually merc agency men, or arms dealers) reviewed our handling of cases. Most of the time, the Law Enforcement Proxy Act protected our freedom. Only rarely did one of us overstep, prompting the sector’s government fleet to interfere.\nIn two short years, money, blood, and power had woven a unique network of frontier order. I was a link in the chain. Independent mercs and mercenary captains had the same level of law enforcement power. We were meant to check and balance each other.\n“Dar is category A wanted. You have the right to execute him, don’t you?”\n“Only in extreme cases, Doc. For example, if he threatened someone with a gun, or tried to escape. But I can’t execute a prisoner that has been arrested. That requires prosecutor level power.”\n“But . . . if an extreme situation unfolded . . . ”\nMy eyes narrowed. Her implication was clear. “Extreme situations happen. But that wouldn’t be to my advantage. I don’t like killing, Doc.”\n“I heard your family is in debt. I mean your mother’s family.”\nOf course we were in debt. When Abani was dying, we’d spent a lot trying to save her. All of that money was borrowed.\n“A lot of debt,” I admitted.\n“Maybe I could help with that.”\nI studied her eyes, failing to read her.\n“Are you worried he’ll escape?”\n“I don’t fancy a lifetime of looking over my shoulder.” Lee spoke softly. Every word seemed bitten off and spit out. “He will find a way to my door, eventually. We were born together. Six children, and two have survived. He will find me, to correct this . . . error.”\n“Living is not a mistake.”\n“Being alive at the same time as your litter-mate . . . that’s the mistake. He will kill me. As long as there’s a chance of him escaping, my life is in danger. If I could pray to the Five, I would beg them to . . . ”\n“Let him die,” I said.\n“Please don’t say it like that. It’s so . . . ” She turned away and seemed to cry, but she said dry-eyed: “I know you’re worried about that debt. I can help, Jin.”\nThe proposition was clear: blood money. I find a reason to kill Dar, and she pays off the debt. “It’s a lot of money. Close to six hundred thousand, Doc.”\n“It doesn’t matter.”\nI had few compunctions regarding murder. I’d been a soldier. I’d complied with orders to kill. Later I became a mercenary, and took money for murder. I’d killed for hatred, and simply for fun. I’d probably tried every kind of murder. Death was death. Such a stark outlook would never earn me priestly dispensation, or legal pardon—but here on the frontier, this point of view was the most conducive to survival.\n“Then draft an IOU, Doc.”\nShe raised her brows. “Do you mean to borrow money from me?”\n“No, you’ll borrow from me.” This was an old way of paying blood money. You needed a pretext, namely a document claiming you had borrowed from the assassin. Then you were just settling accounts.\nLee Hort was wise. She thought for a moment, then showed her understanding with an uneasy smile.\n9\nI didn’t sleep much, contemplating this new deal with Lee. I walked around camp and saw Dar was awake. Hands cuffed with tail behind his back, facing away from the others, he looked uncomfortable and dazed.\nI sat down beside him.\n“No biscuits this time?” I was surprised he’d spoken first.\nI took out a pack of compressed biscuits for him, unlocked a hand. He devoured the meal. I sat there and did not speak.\nAfter a while he couldn’t help himself: “What’s your name?”\n“Jin.”\n“Just Jin?”\n“Yep.”\n“You don’t have a family?”\n“Nope.”\n“So, you like to fight alone?”\n“You bet.”\n“Relic hunter?”\n“Merc, bodyguard, killer . . . I do it all. And what are you?”\n“You could call me a relic hunter. I also work alone. No one’s brave enough to let me join their family.” He smiled. “I’m notorious, you understand. I’m sure Lee has told you the story.”\n“I didn’t need her to tell me. You’re a household name. Now tell me, really . . . what are you doing here?”\n“You wouldn’t believe me.”\n“Lee thinks you’re here to kill her.”\nDar chewed some biscuit. For a moment his expression was blank. “She really thinks I’d do that?”\n“Wouldn’t you? Never mind what I might or might not believe. This stubbornness gets you nowhere. We’re waiting for a rescue team, and you’re cuffed. Ten years ago you were convicted of murder. How long until you’re shot dead, do you think? You must’ve sought out Lee for a reason. Do you plan on taking it to the grave?”\nHe finally answered with a bitter laugh. “I’ll be shot regardless. Back then I really did light up that fucking temple. But I didn’t kill those children. Not a one.”\nI stared at him.\nAs if an old taboo had finally lifted, he began to talk, voice low and urgent: “They wanted us to kill each other. I didn’t want to, so I lit a fucking fire. I knew I’d become a wanted criminal, so I fled. I learned about the other children from the news. I burned that temple to save them. Of course I didn’t want them dead. I’ve always wanted to find Lee and tell her what happened, but I never had the chance. I was hunted. I had to run to the edge of the galaxy. Then she graduated from university, and came out here for her research. I thought I finally had my chance. So I watched her, and waited. I came close twice, but both times she found out, and fled. This time wasn’t planned, but I heard about a group of pirates planning a raid here, at Lee’s excavation. I was worried about her, so I came. I wanted to warn her of the danger, tell her I didn’t kill our litter-mates, tell her she needn’t fear me. But she was too afraid.” He laughed. “Before I could tell her anything, she shot me.”\n“How did you get hold of the ship’s coordinates?” I asked. It is difficult to find a ship in space, unless there’s a beacon and you know the frequency. Or do what we did: jump right to it through a human portal.\n“The pirates had your signal data.” He shook his head. “Their original plan was a pincer attack, blow up the portal, then board the ship from this side and fly off in it. But I asked about their plan, after getting one of them drunk, and got the signal data. I wanted to keep them from getting here, so I shut off your archaeologists’ shipboard signal. Then I shot that ansible. So they can’t find us.”\n“But now the rescue team can’t find us.”\nHe shrugged. “Better that than eventually finding corpses.”\n“Well, yeah . . . ”\nDar smiled. “You don’t believe me.”\n“Without some proof, it’s difficult.”\n“As you please.” He turned to gaze at the great pillar of ecologies. It had been raining in there for days. It seemed it would never stop.\n“I admire the ancient humans,” he said.\n“Why?”\n“Don’t you know about them?”\n“I’m a mercenary, not an archaeologist. Not even a relic hunter.”\n“They had one child per birth.”\n“Really?”\n“A human woman could give birth many times, but each time it was just one child.”\n“So they didn’t have to choose?”\n“They didn’t have to choose.”\n“That’s . . . well, I envy them.”\n“Me too.”\n“So you really know about them.”\n“Does that surprise you? Relic hunting is the best archaeological university.”\n“Lee would certainly disagree.”\nHe gently laughed. “Some say it is precisely because of their lower fertility that they went extinct. After war or famine, they couldn’t replenish their populations.”\n“Do you believe that?”\n“The species that made the Rain Ship? Destroyed by low fertility?” He studied the rain pillar in wonderment. “What do you think?”\nWe sat in silence, watched slanting rain lash leaves of grass.\nIt was raining that day. I remember the rain washed the leaves of the fleshy plants clean. They were translucent. When I took the infants out of the basket one by one, raindrops fell on their little closed eyelids. My hands were damp from the mist. Abani once told me an ancient story: she said every raindrop is the soul of a dead child. Those that we abandon at birth, their souls have no names, so after they fly to the heavens, they fall back down and permeate the earth.\nI shook my head, driving away these thoughts. But as I’d tried to tell Lee Hort, we can’t run from our ghosts.\nThe camp was asleep, for the most part. Lee Hort sat with her back to us. The time was right.\n“Up,” I said, unlocking Dar from the pipe. “We’re going for a walk.”\nHe looked confused but said nothing, following me down a long spiral stair. At the bottom there was a human lift. I turned it on and it seemed to be powering up normally. We descended to the bottom of the spacecraft and looked up from there. At least thirty meters above hung the earthen base of the ecological pillar. The soil was permeated by rainwater, by gurgling veins of it.\nThere must be bones buried in there, I thought. I still remembered digging in the soil with my hands, excavating shallow pits, and one by one placing the little bodies, already silent and unmoving, in the earth.\nI shook my head. I released Dar and shoved him forward. He staggered a few steps, chuckling.\n“She paid you, didn’t she?”\nI squeezed the trigger.\n10\nBack above, the camp had been awakened by my gun shots. They crowded around and asked what happened.\n“He picked the lock, and I caught up,” I said. “I fired two shots. He jumped into a tunnel.”\n“What kind of tunnel?” Lee asked.\n“I don’t know. About two meters high, no lights, pitch black. I didn’t follow.”\nLee exchanged a look with her team. I suddenly realized that her relatives knew about the blood money. Of course they did: the vast majority of families pool income. A large expenditure can’t be hidden.\n“That’s a garbage processor,” said one researcher. “The humans used it to treat rubbish . . . which gets squeezed, frozen, crushed, and finally airlocked, or put into the pillar as fertilizer.”\n“Do you think it’s still working?” I asked, shivering.\n“The lift is still in operation, and we’re convinced the spacecraft is getting inexhaustible energy from space folding, so . . . ” The researcher grimaced. “We probably don’t have to worry about that guy. I’m glad you didn’t go in, Jin. “\n“By the Five,” I muttered.\nWhen I’d reassured everyone and they’d returned to their own affairs, I pulled Lee aside and showed her a blood-stained handkerchief. Inside was a crushed bullet.\n“What is this?”\n“I killed him. Shot him in the back of the head. The first bullet is still in there. This one came out through his mouth. This is his blood. Evidence. You can test it.”\nShe looked pale, ready to vomit.\n“I’m sorry,” I said, “but it’s better this way. I’ll have to make the body disappear, of course, but you need some DNA, so you know you haven’t wasted your money.”\n“I know . . . by the Five . . . ” Lee took a deep breath. She put the bullet and handkerchief in her archaeological bag. “When we get out of here, I’ll pay you in installments.”\nI watched her. Dar had said he didn’t kill his litter-mates. If that was the truth, then who did it? As I watched her leave, I secretly prayed that I hadn’t made an irreversible mistake.\n11\nObeying Lee’s summons, I arrived in the portal chamber. She looked nervous. “We’re going to start the portal to see if the pirates are gone. They generally don’t linger after a raid, but . . . ”\nThe portal was silent. There was no mirror-glimmer on the surface inside the frame. “System checks are normal,” she said. “But it’s possible they blew up the other side.”\n“Trapping us here,” muttered a young researcher.\n“There’s an observation ship in the hangar below,” Lee revealed. “We could take it back to Hill Four. But it only accommodates six people.”\nThere were more than six of us, of course: Lee Hort and her four team members, myself, Nini and Jilin Guer, and my two mercs. Even if we could access Dar’s two-seater, we couldn’t all leave. I frowned, looking around. “Where are the Guer girls?”\n“I don’t know. Last I saw they were below, working on the ansible.”\nWe searched all over both levels of our home turf, but there was no sign of Nini or Jilin. The repaired ansible was on their rest mat, next to a piece of paper, a nearly illegible note: ‘Rescue coming in twelve stretches.’\nBut this line had been messily crossed out.\nI squatted to adjust the ansible. This instrument could also monitor spacecraft within the solar system. Most were still concentrated near the Hill Four orbital station. They seemed to be mobilizing for an assist, but Rain Ship was a considerable distance away. Although coming through the portal only took one step, Rain Ship was actually located in Hill system’s encompassing asteroid belt, far from planets and gravity wells, deep in the darkness.\nTo make long-range leaps, ships required boosts from gravity wells. The quickest way to reach us was a jump from Hill Eleven’s well. A twelve-stretch run from Hill Four to us would be quite a rush, but it was possible, barring exigencies.\nBut there were already several spacecraft nearby.\nI brought them up on the holographic display and uttered a curse: three small spacecraft, and a massive barge. No official registration codes. Dar had said these pirates intended to take the Rain Ship. Looked like they wanted to tow it away. A human ship containing ecosystems: I wondered what it would go for on the black market. The pirates were halfway here from Hill Eleven. They’d be upon us in two stretches.\nThe archaeologists crowded around me. My two mercs silently watched the ansible’s light show.\n“Do you intend to surrender, or fight?” I asked.\n“Fight,” said one of the mercs, a small fellow with short, black hair. He seemed totally sincere. “I’d rather die than be captured by Northern An barbarians.”\nAs we prepared to resist the pirates, we finally learned what had become of the Guer girls: they’d flown off in Dar’s ship. Lee had been planning to use it as intercepting firepower, so she was furious, unleashing a torrent of curses. The speed and variety of this foul language put my own veteran abilities to shame. I felt I could learn a thing or two from the good Doctor.\n“Hey,” I interrupted, “at least they sealed off the bay before they left.”\n“They didn’t know if their seal would hold. They left us here to find out, the shit-digging little bitches!”\nI rolled my eyes and left Dr. Hort cursing endlessly. I traveled to the uppermost cabin on the ship’s hull. After studying Rain Ship’s schematics, I had a plan in mind. I was dealing with three small spaceships, which meant at least twelve people and up to eighteen—not counting the pilots. We were only three mercs and six guns—no, seven. But Dr. Hort’s gun only fired three rounds. Basically useless.\nI explained my plan to the two young mercs. They listened gravely. I didn’t doubt they would implement my plans and follow orders. Although I wasn’t their captain, I had followed some very good senior mercs in my time who, like me, stepped up to fill a leadership vacuum.\nHad they felt like I did now? I was nervous, worried, not knowing if my plan, which would gamble everyone’s lives, would end in victory or disaster.\nBut we had no choice. Which actually made things very simple.\nOn my orders, the two mercs vanished down a corridor. I stayed on the top floor, tossing white coveralls here and there, littering the corridor with archaeological instrument parts and damaged ansible components, so it looked like the area had been evacuated quickly. Looking down from my high vantage, I saw Dr. Hort creating the same effect down near the portal chamber.\nAfter a while, she nervously gestured up at me, signaling that our guests had arrived. Then she disappeared into the shadows. We’d found a massive cabinet in one of the ancient human rooms, big enough to conceal the archaeological team. If we mercs were killed, they might still escape unharmed.\nI slowed my steps, adjusted my breathing, and hid in an adjoining cabin. There were many strange things strewn about in here. Most I couldn’t name, but they were generally solid, suitable for a makeshift bunker.\nNot that I intended to fight in here.\nI was separated from Rain Ship’s airtight fore-compartment by one wall. These pirates’ strategy was clearly superior to Dar’s. They didn’t use explosives, but somehow managed to open this small compartment’s access panel. So, I had been right about their ingress point. We were off to a good start. And now I knew they had at least one expert relic hunter among them—not your run-of-the-mill plunderer, but someone with a high level of ancient human technological knowledge.\nI put my ear to the wall, heard landing gear touch the floor of the compartment. The space was large enough to be used as a docking bay by a Ruderan ship. For the first time I was grateful for ancient human size.\nOne, two, three . . . at five, the sound of their footsteps got too confusing to reckon their number. I waited patiently. Through gaps in my makeshift fort, I watched the armed pirates pass one by one through the airlock.\nThey soon found the junk I’d scattered about. One suggested, in his husky Northern An dialect, that they take the staircase—but at that moment my short black-haired merc ran up quickly from below. He was unarmed, hair disheveled, dressed in the white lab coat of a female lab tech.\nThe pirates pointed at the lower stretch of walkway, shouting excitedly. Rather than taking the stairs, many opted for the more direct route of several archaeologists’ ropes, one by one getting on and sliding down.\nMy luck was simply too good to be true: they left just one man on guard.\nWhen the rest of them had vanished down the walkway, I moved fast and silent. Before the sentry knew what was happening, I had him choke-held, squeezed, quietly dying.\nI didn’t waste time looking down to see how many were still on the taught ropes. I just started cutting. Blood-curdling screams issued from below, one after another, drawn out syllables of terror that ended abruptly. I hurried back to my redoubt, counting fading echoes of screams.\nTruly an auspicious number, thank the Five.\nBelow, the other pirates were shouting curses. I heard several rushing back up the walkway—and exposing themselves in the process.\nI didn’t hear the gunshots, but I heard the thud of heavy objects hitting the walkway deck. No screams meant good marksmanship, headshots. One, two, three—the footfalls grew confused. I caught sight of a figure in white, high up in his hide site, packing away a sniper rifle, then vanishing.\nI didn’t know if the two young mercs could kill the rest of the pirates, but I didn’t waste time thinking about it—gunfire rang out sporadically, mingling with cries and footfalls. A pilot finally emerged from one of the ships, unable to bear what he was hearing, needing to see.\nThis pirate looked frail. I pistol-whipped him in the back of the head. Two minutes later he was tri-cuffed to a shelf frame. Crouching low, I ran through the airlock into the fore compartment.\nLee had suggested we emergency-fuse the airlock, to keep the pirates out, but I’d told her it wouldn’t work. These fellows weren’t stupid. Pirating for long enough teaches you a few tricks, not to mention ruthlessness. They would have blown open the lock, then waited for decompression to kill us all. Besides, we needed their ships to escape.\nThe pilot of the second ship ran down his boarding ramp, gun leveled. I was far away, and my first shot missed. He ducked behind the ramp and started taking pot shots. Then the clever fellow in the third ship decided to be very fucking clever: he initiated the hatch opening sequence, intending to take off.\nI turned and fled, bent low and weaving to avoid any parting shots, but the trigger-happy pilot was also running for it. I made it through the airlock and plunged into the corridor, chasing my breath. My enemy was not so lucky. He was rushing back up his boarding ramp when the hatch opened. Gale-force decompression sucked him into the void.\nI didn’t hear his screams, of course.\nThe third ship lifted off, then came about to face me and the transparent airlock. I stared into its muzzle cannons, wondering how long I had.\nA little moth appeared in the void beyond the hatch.\nIt was Nini and Jilin. I knew it was them—I’d let them take Dar’s ship, after all. And I knew it was Nini who opened fire, and Jilin piloting. They flashed by the open compartment, pouring torrents of plasma into the pirate craft.\nI didn’t bother to watch the outcome.\nBecause a gun was pressed into the back of my neck.\n12\n“Bitch.”\nHe had a rough Northern An accent. Just hearing it made me nauseous. I smelled strong sweat and alcohol, and the familiar bouquet of unwashed pirate in old pressure suit. He reached out and took my weapon.\nSlowly I turned around.\nSeeing him for the first time, I knew he was the leader. I couldn’t say why. Maybe it was something in his cloudy eyes, or the crude decorative patterns on his pressure suit—or the frightened sound that issued from the pilot cuffed to the shelf.\n“Your men are dead, bitch.”\nMy gorge rose again.\nI didn’t even know the names of my two mercenaries, but I didn’t think they were dead. Their orders weren’t to fight to the death. If the tide turned, they were supposed to run. Rain Ship was huge, a world unto itself. There were many places to hide, from which to launch guerilla warfare, if necessary. But if they were alive, this bastard was fast and clever.\nI looked around, sizing things up. Quiet. No sign of other pirates.\n“Your people are dead,” I boldly guessed.\nHis lips twisted to reveal his ratty teeth. His fist came out of nowhere, knocking me to the floor. My head buzzed and the world spun. When I could think clearly, I found that he’d dragged me to the topmost bridge leading to the pillar of ecologies.\n“You’re goin’ down.” He was clearly insane, foaming at the mouth. “I want to see you splatter like mud.”\n“Your family members really made a fuss as they fell.” I was deliberately provoking him. Not a sensible move, but I had no sensible move left. He kicked me hard. I rolled, nearly falling through a gap in the railing and into the abyss.\nBefore I could get up, he rushed over and initiated the beating proper. I tried to protect my head and face, crawling, rolling, gradually approaching the end of the bridge—where it met the pillar of ecologies, and its outer shell of polarized light.\nPunches and kicks rained down on me. Protecting my head, curling up, I gradually left the pain behind and went to a strange place.\nWhy did those ancient giants build these high, perilous bridges? Had they deliberately set up a dramatic venue for suicides? You could jump from the bridge, or you could enter the beauty of the column and then jump. I would have made a morbid archaeological theorist.\n“Get up you wretch.” The pirate leader kicked me again. “Time to die.”\nI laughed hoarsely.\nA second later there was a gun report—a clean shot, the pirate got it in the back of the head. Clearly Lee Hort had learned from experience, not wasting rounds on the pressure suit. Her marksmanship was surprisingly accurate.\nI looked at her, wiping blood from my eye. That bastard had kicked my forehead. I might end up with a scar like Dar’s.\n“Nice to see you, Lee,” I said.\nShe did not move, but stared at me with a disturbing focus. She leveled her gun, with a hint of hesitation in this movement.\nWell, I should have guessed. Even with Dar, her three shots had landed near his heart. Only the pressure suit saved him. And the pirates couldn’t have gotten the archaeologists’ beacon data without someone on the inside.\nUnbelievable. How much did you sell to them, Lee? And why did they finally decide to kill you? Did you get too greedy?\nI didn’t say any of that. No, my words had to strike a fatal blow. “Your litter-mates, Lee. Those you murdered, they all have names.”\nShe clenched her jaw, her lady’s gun trembling.\n“Do you know why we don’t name the doomed litter-mates? Because infants with names are tied to earth after they die. They stay with the people who killed them, Lee. They’ve stayed with you.”\nHer face twitched into something like a smile, hideous and sad.\n“Dar is still alive,” she said, “I saw him.”\n“So I have to die?”\n“What do you think, Jin?”\n“Dar,” I said, raising my voice, “kill her.”\nLee reacted instinctively, turning to look, and I leapt at her, knocking her to the ground. The gun flew out into the abyss. The two of us wrestled, rolled, tearing and biting, and I took another beating. I hadn’t expected such ferocity and strength.\nWhen I realized we’d rolled to the end of the bridge, an impulse seized me. The gloomy sky above descended, mist and rain like a shroud—\nI grabbed Lee Hort and pulled her with me into the void.\nAnd then I was rolling in wet grass, and I felt rain on my cheeks.\nMy gamble had paid off. No matter how high your entrance into the pillar of ecologies, you will be safely transported to the ground floor. I knew the ancient humans wouldn’t let me down.\nLee Hort was struggling to get up. She was in better shape than me, after all—she hadn’t been beaten by a pirate leader.\n“I’ll . . . kill . . . ”\nShe didn’t get to finish this sentiment. She pitched forward, her eyes suddenly wide, then softly closing. Dar was behind her.\n“Good of you to show up,” I managed.\n“One of your boys was in trouble. I had to help him, so I’m running a little late. You alright?”\n“About to fall apart, but I think I can be reassembled.”\nI knew this joke wouldn’t land, but that’s not why he didn’t laugh. He was contemplating the semi-conscious Lee, gripping his gun.\n“No Dar,” I said, my voice a mere rasp now. “That’s not you.”\n“I’m not so sure.”\n“It wasn’t you back then.”\n“Maybe I’ve changed.”\n“Really?”\nHe was silent for a moment, his cold glare softening. He looked up, taking in his surroundings. “We’re inside the pillar?”\n“I think so.”\n“But how—”\nI joined him in looking around.\nThe pillar of ecologies was big enough from the outside, but the space we were in now was clearly larger. It was like a crystal honeycomb, a space divided into countless six-sided, prismatic worlds. I couldn’t see the limit of the sky, or the edge of the earth.\nFrom where I sat in the grass gazing up, I saw no trace of anything like a spaceship interior—only the small glowing portal by my side. Beyond that was endless space. The edges of polarization plates were visible as dim lines against a far void, each habitat thus vaguely delineated, but somehow I sensed they were permeable. You could walk through them, traveling between ecologies in the pillar—if we were still in a pillar. I put my hand through the nearest plane, and rain continued to fall on my palm.\nAnd then my imagination grew by an order of magnitude. Maybe there were many pillars, comprising their own pillar-space or matrix. Perhaps each pillar contained portals leading to other Rain Ships.\n“Those polarizers . . . ” Dar’s voice was hoarse.\n“Subspace partitions,” I amended.\nHe nodded.\nI didn’t really understand this ancient human technology. I knew they had divided subspace, like our scientists do in the lab—though our primitive subspace divisions are no bigger than your finger.\nBut here were countless pillars of subspace, linked by portals, forming a limitless paradise.\n“How many Rain Ships do you think we’re seeing here?” I asked.\n“Do we have to count?”\nWe were laughing together, and I felt somehow reborn.\nStanding up, I ignored the pain in my back and skull. I walked slowly through the tall grass. I wanted to see more.\nDar stayed with me. “What do you want to do?”\n“Visit other Rain Ships.”\nWe approached the portal. It flickered with a weak gray light—but on the far side a very different light was visible: a brilliant white radiance. We couldn’t know what the situation was over there. A vacuum maybe? Or bitter cold, or scorching heat.\nDar supported me, and I didn’t shake off his hand. We entered the portal together.\nThe new ship was about the same size as the last one. The structure was also similar. Some of the instruments were still running, and corridors lit up for us as we entered them. But there was still no sign of the ancient humans. Only their machines remained, ancient, stubborn, and powerful, still running long after their creators’ extinction. We passed through cabins and halls, and finally climbed a windowsill. We stood under the huge porthole, staring in awe at an unfamiliar star-scape.\nI’d never seen such a star: fiery red, blazing, immense. Dazzling, yet dim compared to the blinding, white-hot star behind it. We were in or near the galactic core. The sun-crammed fields were almost too bright to look at.\n“What’s that?” Dar was pointing at a protrusion on the side of the spacecraft.\nI tried to identify the bulge, which resembled a smaller Rain Ship. The hull was translucent, and within there seemed to be an embryonic pillar of ecologies. It clung to the larger ship—no. More like it was gradually breaking away from, growing out of, the larger vessel.\nA birth.\nI touched the ice-cold hull of this Rain Ship, feeling the rough-hewn wall. Everywhere on this ship it was the same dull gray-brown. It had grown up without people, and so hadn’t been painted or finished. Walls and pipes reverberated with circulating machines and liquids, and buzzed with electrical currents. The new Rain Ship was being made in accordance with the parental model, a new life that would not be sacrificed.\nI imagined the primordial epoch when the ancient humans had created these ships, giving them the ability to reproduce, and sending them to every corner of the universe. And yet, their internal subspace ecological pillars were networked. As the ships multiplied, their shared ecological space grew, eventually becoming a vast promised land. Even after the demise of their creators, the Rain Ships continued to grow, waiting endlessly. Cleaving to their original purpose, they continued to fly.\nNo matter how far you go—across star fields, across the universe—the part of the world you love, the part you create, is always with you. If you take one step into a Rain Ship, you can go home.\n0\nA quarter later, we were in the capital of the Orchid Autonomous Sector.\nThe touring prosecutor announced the end of the hearing. In the court’s exit hall, he privately embraced me. Lee Hort and her family had lost their archaeological licenses. They were now in prison.\nDar was there to pick me up. He was using a pseudonym, and he’d grown a beard. No one recognized him. The story of Hort was, like all miserable stories, remembered by everyone.\n“I thought you’d have your law enforcement license revoked,” he quipped.\n“The prosecutor owes me.”\n“It must be a great debt.”\n“Yeah, pretty big.”\nI didn’t get into the details, and Dar didn’t press me. We stopped in a square, bought two desserts, and ate as we strolled.\n“Old Mortar has returned to work.”\n“He took two shots in the stomach. I thought he’d rest at least half a month.”\n“From a long bitter life we’re on the run, right?” Dar said, smiling.\n“So you didn’t get your blood money,” he observed.\n“My financial backer is squatting in prison. And my target is very much alive.”\n“I took a job.”\n“Oh?”\nI wanted to tell him that he resembled his sister when he was pretending nonchalance. But I didn’t. Some things you can’t say, no matter how evident they are.\n“I’ll be working in Rain Ship space. A city has been discovered, an ancient human city. Everyone’s rushing there. There’s a fellow who’s willing to pay us. Would you come with me? I’m not much of a bodyguard on my own.”\n“All right.”\n“We’d leave tomorrow.”\n“Sure.”\n“You seem a bit preoccupied.”\nI smiled, licking the ice cream off my hands, and waiting.\nWhen she came by, it was like the whole world lit up. Of course she didn’t notice me. And I didn’t watch her too obviously. We were from different worlds. I wore an old brown military uniform, hair cropped like a man’s. Two guns were stuffed in my jacket. She wore a bright skirt, and she smiled brightly, in high spirits.\nShe approached, passed close by me, and then she was walking away.\n“Who’s that?” Dar asked.\nI said a name.\n“I thought that was the name on your ID.”\n“I haven’t used it for a long time. I gave it to her.”\n“Is this a story I should know?”\n“Maybe.”\nI got up and walked on, not looking back. In my memory, rain permeated the earth, never ceasing.\nI gave my name to that child. After my father ran away and my mother refused to fulfill her duties, I picked her up and chose her to live. I killed and buried her litter-mates, and sent her to the temple. A good person eventually adopted her, and she had my name. She lived the life I might have.\nThat’s okay, I reckon. In that rain, we all died. She became me, and I became a nameless infant, and ultimately flew away to the stars. I left myself, then discovered the secret of the Rain Ships. I met Dar. This is good—a new sense of meaning, a new destiny.\nDar did not ask about her again. He put his hand on my shoulder, and I felt peace and warmth.\n“Tell me about the new job,” I said. “How much are we getting?”\nHe looked at me and laughed.\nThere’s something about his dark green eyes, but that is another matter entirely.\nEchoes\nI have been watching them grow and develop.\nA young, impulsive, curious, short-lived species, I watch them mature generation by generation, as waves erode the banks of time. Individuals are not significant, and history is transient as a fleeting cloud.\nBut you can still marvel at everything they’ve created, everything they excavate—because their footsteps extend far, because of what they discover, what they believe in, and what they persist in.\nThere are times when you can’t help wanting to write down their stories and record their voices—their loves, hopes, bewilderments, sacrifices, and agonies. I choose to record their most dazzling lifetimes.\nJin died shortly after the end of this story, in a rebellion at the new Rain Ship colony. Dar died with her. They had no time to fall in love. When they died they were still mere acquaintances.\nI got hold of her diary, and I’ve speculated on her thoughts. I’ve written her story from both a human and a Ruderan point of view.\nAt times like this, watching young lives burn out so quickly, I have an impulse. I want to reach out and make contact—gently push one of them this way or that—\nTime can seem to ripple. History can leave vestiges. I know watchmen have made such contact before. Species more ancient than humans, they who watched us before we became the watchers, have done this before.\nThe universe cannot afford such contact. The ancients have warned me.\nBut in the end you will do it anyway, they have prophesied.\nOriginally published in Chinese in Science Fiction World, January 2014.\nTranslated and published in partnership with Storycom.\nFootnotes:\n1 - Due to their high birthrates, the Rudera have from the beginning of their civilization enforced strict birth control, allowing just one child per litter to survive. Parents or priests choose the lucky child, and kill the rest. The sacrificed infants are not named, but are generally referred to as “litter-mates” or “link births.”\n2 - Ruderans, intelligent descendants of rats, live at most eight years. They reckon their lives by months. A 100-month lifespan is common and respectable.\n4 - The Gods referred to here are ancient humans. Times change. Nothing lasts forever, including civilizations.\n5 - The Rudera divide a standard day into eight parts or ‘stretches’, each stretch equal to three hours of human time. Like most rodents, the Rudera sleep in frequent short spells. Their work and leisure are also divided into small pieces. During odd stretches they work. During even stretches they rest, drink, shop, or spend time with their families. As a result, Ruderan work and leisure are closely intertwined.\n6 - Ruderan families are quite different from human families. Men and women do not live together, except during periods of fertility. Families are generally composed of three to five members of the same sex. Male families only accept male members, and female families only take females. Most families carry out joint undertakings, working together. When they move, they move together. When it comes to Ruderans, marriage means entering a family of brothers or sisters, not uniting with someone of the opposite sex.\n7 - Ruderans have only four fingers on each hand, but the tip of a Ruderan tail is divided into three small, dexterous appendages.\n8 - Relic hunters are those who, legally or illegally, take relics from human ruins. Most are armed. There is not much division of labor along gender lines among the Rudera. Women do most things that men do.\n9 - In the Ruderan era, Earth has two major continents: An continent and Mu continent. Northern An refers to a dialect spoken in the Northern part of An, where the inhabitants are known for their ferocity. The Ruderans have become star-faring, but most haven’t joined the Ruderan Galactic Alliance, preferring to raid and rob, drifting between solar systems.\n11 - A net hung from the ceiling and walls of a tunnel for Ruderans to climb. They can’t climb like their ancestors, but are still much better at it than humans.\n12 - Ruderan counting is based on eight. Twenty people in their language is “sixteen-four,” but in order to facilitate understanding, the human system is used here.\n14 - A Ruderan is about one-sixteenth the height of a human. This makes harnessing fire difficult. Their custom is to use cold light or bioluminescent moss for illumination. Even now, during their space age, they maintain this tradition.\n15 - A Ruderan unit of length. Ten ta are about 1.03 meters. For ease of understanding, meters are used in subsequent descriptions.\n17 - The first Ruderan handcuffs weren’t much different from the human model. But field tests quickly revealed that upgrading to a three-ring design was necessary. For Ruderans and their dexterous tails, human-style handcuffs aren’t a sensible way to deal with criminals.\n18 - Originally named Church of Biological Truth and Survival of the Fittest, this sect advocates following the survival principle of natural selection. It is rendered “Extreme Darwinism” for ease of understanding.\n19 - The Ruderan lifespan is short. Growth and development are fast. Age ten here means ten months old.\n21 - Compared to the common bell used by humans, an inverted bell placed on the ground is better for propagating sound in an underground city.\n22 - ‘Abani’ is the title of the eldest female in a family. Similar to the human ‘great-grandmother.’\n23 - A ‘binary’ is simply two Ruderan stretches, a work stretch plus a leisure stretch considered as one unit.\n24 - The Rudera believe that five is a holy number, and good luck. This is because five is the first number a Ruderan needs both hands to count to. (Ruderans have only four fingers per hand.)\n25 - This is a limerick handed down among mercenaries. It goes, “From a long bitter life we’re on the run! Fuck the enemy’s mom with your big gun! What good is wealth to a diseased old fart? Let’s die young tearing enemies apart!” As a female, Jin obviously doesn’t like the second line.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}