{"fingerprint": "/trYATnovT9m1iCMA9GJELjvr4s=", "sitename": "Clarkesworld Magazine", "title": "Further North by Kay Chronister", "author": "Kay Chronister", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/chronister_07_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Further North by Kay Chronister", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4260 words, short story\n Further North\n In Turkey, we loved the animals we tended; in Alaska, we hope they won’t wake when we ride past them. Asleep, with their bodies buried in the snow and their eyes frozen shut, the helminths look more like landforms than hookworms. But if temperatures rise too much, if they wake up—\n We siphon a lot of blood from their bodies, trying to cure the disease they spread. They wake up hungry and anemic and furious.\n Halfway between Juneau and Circlet, the route I take home, there’s this pile of stones stacked up beside the road. A graveyard for mammoths, according to local legend. In truth, a graveyard for Russian trappers who froze trying to push further north than anyone had before. The monument spooks Alaskans, the descendants of those few Russians who survived the tundra, but I am not Alaskan and I am cold wherever I go and I’m always relieved to see the stones. Up in Circlet, where we built the homestead, the helminths almost never thaw out.\n When I come home, untack my pony, and stomp the snow from my boots, my sister Aliye has a hot bath and a pot of spiced coffee waiting for me: her way of saying sorry that I have to ride out and check the enclosures alone. The first thing she does when I come inside, after she shoves a towel into the crack beneath the doorframe, is check all of my fingertips for frostbite. “Remember that blood-buyer in Anchorage with six-and-a-half fingers?” she says if I argue.\n “I remember,” I say, and spread my tingling fingertips out to the heat of the stove.\n “If you ever feel like you need me with you,” she says, “tell me, and I’ll go.”\n We both know that Aliye will never go. Before we left Turkey, when we lived among our goats like they were family, the hook stole her legs and half of the muscles in her face. Now she tends the homestead and I look after the animals. We have no other choice. But she has to say it, and I have to act like I believe her.\n “I know,” I say. “I promise.”\n While we tuck into our coffee, a rich dark brew that Aliye makes with cinnamon and cardamom, she tells me, “We had a letter this morning.”\n “From Baba?”\n “No.”\n “Mom?”\n “Of course not.” In three years, Mom’s never written to us once. “From a doctor in Anchorage. I read about him, how he cured all these paralytics on the continent, and then I wrote him. He says he can fix me.”\n I try not to say anything insensitive, like what first comes to my mind: desperation has made you stupid, abla. “You didn’t tell him, did you?”\n “I wouldn’t do that,” she says. “Don’t worry. He won’t have to know it was the hook.”\n “What if he finds out?”\n “He won’t,” Aliye says fiercely. “I won’t let him.”\n She can’t make a promise like that, not really. For all she knows, the symptoms of her disease are easily recognizable to a trained physician. No doctor has tended Aliye since Baba first suspected that the hook had passed from our goats to his oldest daughter. The first human host to a parasite like the helminths wouldn’t be treated and released; they’d be quarantined, isolated, possibly put down. Before Aliye, the hook only happened to sheep and goats and cattle. Everyone thought humans were immune.\n Everyone still believes that, but now we know they’re wrong.\n “I heard a story in Juneau today,” I tell her. “About a farm family who got some Canadian elk, imported, supposedly better for riding across tundra than horses.”\n “Don’t tell me.” Aliye already knows the ending to this story; it’s the same ending that most of my Juneau stories have.\n Anything becomes ordinary when it happens enough times in a row.\n “The helminths destroyed them. Twelve elk, eight thousand rubles a head, dead in a matter of hours.”\n “Like always,” she says. “Sometimes I can’t believe it. It doesn’t seem real.”\n I don’t know how she can form those words with her half-paralyzed mouth. If the hook is real to anyone, it should be real to Aliye.\n Aliye’s physician is a glossy-looking man who comes in a dogsled, not on a pony. He introduces himself as Mikhail Akudaan, explaining that he is half-Ukranian and half-Aleut. His family’s been here forever, he says. Through the days of whales and the days of salmon, now the days of worms. He winks at me midway through each sentence. Beside my sister, with her crutches and half-frozen features, I always end up looking good by comparison.\n While we talk, Aliye makes herself busy at the hotplate, seasoning three ounces of dehydrated meat-stuff with everything on our spice rack. The stuff is more or less irredeemable, but her sense of hospitality keeps her from serving it plain. She’s anxious, her fingers clumsy on the saucepan and the spoon, but probably not for the reasons she should be. She fears the doctor won’t want to help her. I’m afraid he will help her, and the Center for Disease Control will wrest her away from me.\n Dr. Akudaan—“Call me Mikhail, don’t be so formal,” he insists—says the treatment will be a month-long process, two weeks at his facility in Anchorage, where Aliye will have braces of elk-bone grafted to her legs, and then two weeks of rehabilitation here.\n I ask more questions than Aliye does. She’s made up her mind already, but I’m unsure. When Dr. Akudaan has choked down the last piece of his meat-stuff, he pulls a nylon medical gown from his bag and asks if Aliye would mind stripping down for a brief examination. I make my excuses and leave the room. She deserves her privacy. Besides, I hate seeing Aliye’s bare legs. Her face is bad enough; her legs, stick-thin and shriveled, covered in the protective down that every Arctic animal must grow, make me sick.\n Akudaan stays the night; the homestead is too remote for a dinner guest to safely reach any destination before nightfall. While I prepare the couch for him, tucking a spare sheet under the cushions, he watches me, maybe comparing my saddle-sore movements to Aliye’s stilted, jerky ones.\n “Your sister is very eager to move ahead with the procedure,” he tells me.\n “Life is difficult for her, with the palsy,” I say, watching his face to see if he’s guessed what I warned Aliye not to tell him.\n “Yes,” he says. “The palsy.” And smiles a little. “Is that what the doctors in Turkey believed she had?”\n I swallow my dismay. We shouldn’t have believed we could fool a doctor. “Dr. Akudaan, you understand,” I say, “how few choices we had. With the news reports everywhere, and people so scared . . . if they knew she had the hook, they would have killed her.”\n His laughter startles me. “Your sister didn’t have the hook, Hafsa. That’s impossible. The haemonchus contortus only infects ruminants.”\n So we were told, but she still had all the symptoms. Baba frowned over a stack of medical texts written in Arabic, a language he could only read half-passably, and said the worms must have mutated.\n “What else explains it then?” I say.\n “Aliye had polio. The signs are clear and distinct. Untreated, it often leads to partial or complete paralysis.”\n I don’t tell him that she could have been treated, if we hadn’t hid her, if we hadn’t believed we were saving her life by denying her a doctor. I’m too surprised to feel guilty yet. “Does she know?”\n “Yes. She knows. I told her.” He motions for me to sit down on the couch beside him. I suspect that he’s preparing me for bad news. “The procedure I do has been proven effective in patients with cerebral palsy, but polio . . . is a different matter. It’s a virus, not a disorder.”\n “I understand.”\n “I’m not sure you do. The polio virus still lives inside your sister. This procedure will put Aliye at extremely high risk for reinfection.”\n “So she can’t be fixed?”\n Akudaan purses his lips. “It’s not that she can’t. In fact, she’s still determined to go ahead with the procedure. But I told her, and I’m telling you, it’s medically irresponsible for me to let her do it. Grafting the bones onto her legs means opening her up, doing spinal work—it’s intense, invasive. It will probably kill her.”\n “And she knows that?” I say. But even if she does know, I’m guessing she doesn’t care. I’ve seen the way Aliye looks at the frontier, flat and frozen but desirable all the same because to her it is forbidden. The loss of what she should have had—what we both should have had—in Turkey, marriage and sunshine and a string of goats for our children to tend, must hurt a hundred times more.\n “She says she’d rather take the risk than live like this,” the doctor says. “Are you Aliye’s legal guardian, Hafsa?”\n I laugh. “She’s older than me. I’ve never been her guardian. Just her jailer.”\n “Is that how she sees it?”\n That’s how we both see it, when I’m feeling sympathetic; when I’m not feeling sympathetic, she’s mine. “Neither of us dreamed of becoming worm-farmers, that’s all I’ll say,” I tell him. “We do what we can with what we have. If I had known that what she had was curable, things would be different.”\n Akudaan is quiet for a minute, then says, “So you can’t do anything to stop her from going forward with this?”\n I’m not sure I would stop Aliye if I could. “How fast would she degenerate, if she was infected?” I ask.\n “A few months? Probably not more. Possibly less.”\n helminths sleep at every bend along the road I take home; even if she were infected, Aliye’s life expectancy might still be longer than mine. “Let her do it,” I say. “Let her try to get herself back.”\n “And the cost won’t be a problem? I understand that helminth-blood is quite valuable, but I don’t know about your family’s particular situation . . . ”\n We send more than half of our profits home, like most worm-farmers, but I suspect that Baba won’t mind the loss of his monthly stipend if it means having his oldest daughter restored. “We’ll make it work,” I tell Dr. Akudaan.\n I’m right, Baba doesn’t mind at all, but across a static-coated phone connection he mentions casually that he has one condition. “If things go well, Hafsa,” he says, “if she gets her legs back, bring her home.”\n In Anchorage, while Aliye has slices of elk-bone fitted to her calves, I load our sleigh with bulk goods. We won’t need forty pounds of flour or a hundred yards of twine if the procedure succeeds, but Dr. Akudaan warned me that the elk bones might not graft onto Aliye’s bones at all. That outcome would keep Aliye safe from reinfection, but it makes me sick to imagine returning to the homestead for another season of breeding hookworms. I make my shopping list half-heartedly, trying not to think too long about using any of the supplies I purchase.\n Back in her hospital room, giddy with nervousness and half-drunk on painkillers, Aliye can only talk about her legs. “I think I’ll want a pony,” she says, “even if we’re only here for a few more weeks, it might be worth it. The way you look when you ride, like you can turn all that snow to nothing beneath you. We’ve lived here three years and I still don’t know the countryside, not like I did in Turkey.”\n “There’s nothing to know,” I say, trying to keep her realistic. “It’s a wasteland, abla. A flat hell full of frozen parasites. You forget because you don’t have to look at it.”\n “Do you envy me that?” She frowns with a little quirk to the mobile side of her mouth. She’s close to tears, angry ones, and I have to choose my next words with care.\n “I don’t envy you,” I say. And looking at my sister, her frail knobby legs swollen with bone grafts, her face half-frozen, her spine stuffed full of dormant polio virus, how could I ever be jealous? But I wish Aliye wouldn’t envy me when I left the same things she did, for her sake instead of my own. “Just remember that legs won’t take care of everything. They won’t bring back our goats, and they won’t get us good marriages.”\n “I wish those were the things I wanted,” Aliye says. “But I don’t dream like that anymore. I dream smaller, Hafsa. I dream of getting up in the morning and setting my feet flat on the floor.”\n The bone grafts succeed; two weeks later, Aliye walks on shaky new elk-bone legs across the kitchen floor, half of her face stretched wide with smiling. Dr. Akudaan says it’s too early to tell whether she’s at risk of reinfection, not while he’s still prodding at the grafts, integrating them fully into Aliye’s system. She refuses to register his uncertainty, focusing instead on what is certain: she can walk, if a little unsteadily, and she can ride.\n “I want to go with you,” she tells me one morning at the front door. I’m halfway through sliding my chaps over my thighs. If I’d been up a little earlier, even a minute earlier, I could have avoided this. Her coat, stiff with newness, hangs over her thin shoulders. As if she is too little to do it for herself, I reach over and zip it up to her chin.\n “I don’t know, abla, aren’t your bones too exposed to the cold?”\n “Mikhail says it’s safe.”\n I reach down to lace my boots so my facial expression won’t betray me. I don’t want Aliye with me on the road. I want her safe and bored at home, coating meat-stuff in cumin and wishing we were still in Turkey until the sheer force of her will brought us home. I want her healthy.\n Or, if not healthy, dead enough to let me abandon the farm and go home.\n “Do you really want to?” I say. “The worms aren’t like our goats. There’s no pleasure in the work. They lay there and breathe or they wake up and try to eat you.”\n “Don’t you remember when our rams got loose and fell in the ravine that year? In the hillsides outside Karaman, so far south that the wind sweated. We held a contest to see who could heave the most out of the ditch, roped them like Hollywood cowboys and carried them on our shoulders. You know I’m not weak, Hafsa. Don’t be so unfair.”\n I remember as well as she does. Five years ago, Aliye could tell me to do anything and I’d do it because she was brilliant, she was fearless, to me she mattered more than anyone. I wanted her to approve of me.\n Five years ago I couldn’t find Alaska on a map, didn’t know one species of hookworm from another, certainly couldn’t have taken a syringe to the segments of a helminth’s body and drawn out enough blood to pay the mortgage on a farmstead.\n “If you want to,” I say.\n “That’s all I want,” she says, so we go, leaving the remains of breakfast on the stove for Akudaan. Aliye’s new pony is light on his feet, faster than my own horse, who is bored with the road from Circlet. I expect to be bored too, but I’m not. The same landmarks take on new dimensions with Aliye here, admiring chunks of ice and trading posts as if they’re wonders. At the halfway mark, at the mammoth graveyard, Aliye pulls up on her pony’s reins and dismounts.\n I slide down from my pony’s back in a hurry, seeing how shaky she is on her elk-bone legs, and let her grab my shoulder for support. We stand side-by-side, breath fogging the air, as she stares at the pile of stones and the signpost behind them.\n “It’s a memorial for the Russian trappers,” I tell her. “They froze to death here.”\n “I know,” she says. “I forgot about it.”\n I let her stand there for a while. Then I say, “I’m always glad to be past it. Knowing I’ve made it when they didn’t.”\n She smiles, her half-smile that is the fullest one she has, and threads her gloved fingers through mine. “You did, didn’t you? Strong girl, brave girl, outsmarting the Arctic all by yourself and protecting your invalid sister. I don’t know what I’d do without you.”\n “I don’t know what you’d do either,” I say, laughing. My throat feels swollen with wanting to cry, and I don’t really know why.\n A week later, Dr. Akudaan tells me that Aliye’s procedure has been a success, her legs will heal completely, she is free to go anywhere she desires. “If you want to sell the farm, please do,” he urges me. “I can see you’re not happy here.”\n I won’t admit it, not to him and not even to myself, but for a few days, with Aliye mounted up beside me, I was almost happy. “My father wants me to come home,” I say. “He wants to see if he can find us decent marriages, now that Aliye is mostly well.”\n The doctor nods a few times too many and looks everywhere but at me. “Of course,” he says. “That’s reasonable.”\n “I know what you see in the news, about Turkey,” I say. “And things are difficult, but all the worm blood being imported is starting to make a difference. They say in five to ten years, we might be able to begin keeping animals again. There’s a species of goat that responds so well to the blood, they almost always survive.”\n “It’s not that,” he says.\n “What, then?”\n “Ask your sister,” is all he’ll tell me. “Please, ask your sister.”\n Now that they have no goats to drive across the countryside, my parents have opened a shoe shop in Ankara. They live a ways down the road from the market where they set up shop, in a stucco house with a roof of red ceramic tile. I paid for that house, I think when I see how fine it is. I would never say that aloud, of course. Baba has to have his pride. We have to feign belief that a shoemaker can afford a home with two balconies and a spacious courtyard.\n When Baba opens the door for us, tears shine in his eyes. The rest of the family crowds him out before he can say much, but I’m glad that our return affects him as much as it does me. In the doorway, looking me over, my sisters remark on how pale and thin I am. I can’t tell if they mean to compliment or insult me with the words. While they scrutinize my earrings, my hair, the way I’ve belted the dress I’m wearing, Aliye lingers at the door behind me, as if she isn’t sure whether she’s welcome. Impatient, I reach for her hand and tug her along. Her elk-bone legs tremble as she follows me into the living room, where Mom pours coffee from a carafe that my worms’ blood paid for.\n “I missed you, Hafsa,” she says, then stares past me at my sister. “Aliye.”\n “Mama,” Aliye says. She grins with half of her face. I see Baba and Mom simultaneously notice her paralysis. I wonder how they ever forgot. Now they look at her with all the familial warmth of health inspectors, letting their gazes rest too long on her elk-bones before their eyes move to her face.\n “We’ll have dinner with your aunts tonight,” Baba says, after a while.\n “Do they know why we went to Alaska?” I say. I don’t want to let Baba pretend we left Turkey of our own accord, but I don’t think he knows he can stop lying. He and the rest of the family still believe that the hook is what paralyzed Aliye. They’re still worried that she’ll be hunted and killed if anyone finds out that she’s the first human vector. I haven’t found the right time to tell them, figured that should be Aliye’s decision anyway. And Aliye isn’t, so far, saying much of anything.\n “They know you needed to go,” Mom says. She puts a cup in my hands and nods at the divan, inviting me to sit. Despite her weak legs, Aliye receives no such invitation. I motion for her to sit beside me, equally mortified and confused by our reception here. Baba asked me to take Aliye home. He wanted her back.\n At dinner we eat lamb and beef dishes made with tofu or top-shelf meat-stuff, pretending that nothing has changed when really, we would never be eating together in an Ankara dining room if the world was the same. Whenever the conversation steers too close to the animals that used to be our livelihoods, someone awkwardly maneuvers back to a safer subject. The hook comes up only once.\n “Does everyone here pretend that it didn’t happen?” I say to Baba later. “Does Mom?”\n “There is a difference between not discussing something and not thinking about it,” is all Baba will say. He’s sitting cross-legged on the divan, oiling his loafers, a bottle of shoe polish open on the teak coffee table.\n “But people must suspect,” I say. “With the timing, with the symptoms she showed.”\n “Still not dinner conversation,” Baba says, sniffing as he does when he feels he’s being more reasonable than whoever he’s talking to. “Hafsa, why did you not mention that your sister is still sick?”\n “What do you mean?”\n “Her face.” He whispers the words like he might get in trouble if he’s too loud.\n I sit down beside him. The conversation seems to demand lowered voices. “The disease is gone, Baba. It’s left marks, but they’re just that: marks. And the worst of the damage, the paralysis to the legs, is gone. She can live normally now.”\n He looks doubtful. “How normally do you think she will ever live like that? She won’t find a husband with her face all scowling and crooked.”\n The words aren’t even for me and they still sting. Maybe Aliye was right to hesitate in the doorway of the house. “Does it matter? What does she stand to inherit if she does marry?”\n “A happy life, an untarnished reputation.”\n “Reputation? Is that what Mom cares about?”\n Baba shook his head. “Your maman never wished for Aliye to go. I insisted on it. Losing all your goats in an outbreak like we did, that draws enough eyes, but if your daughter dies of the same symptoms then people ask questions, they suspect you of something.”\n Hearing him talk like that, I can’t keep myself from saying, with something like frustration, “She didn’t have the hook, Baba.”\n The frown lines on his wind-chapped face deepen. “What was it, then?”\n “She had polio.”\n Baba repeats the English word, polio, then tries in Turkic. “Not a worm?” he says.\n “Not a worm.”\n “How can you be sure?”\n “A doctor from Anchorage examined her.”\n “Oh God,” he whispers. “God, how could we—”\n “We’re home now,” I say, reaching across Baba’s lap to shut the bottle of shoe polish. The concept of heirloom furniture is entirely lost on my goatherd father. “I’m selling the farm, I don’t think I’ll ever go back besides to get things in order. So you don’t have to be sorry.”\n “Three years,” he says. “Three years we were without you.”\n “Do you still want us here? With worm’s blood on our hands, with faces unmarriageable and halfway frozen?”\n “Hafsa, it doesn’t matter if they want me,” Aliye says. I turn around and see she’s standing in the doorway. I don’t know how much she heard, or how much she’s hurt by Baba’s bleak view on her future, but she looks determined.\n “What are you saying?”\n “I’m saying,” she tells me, “that I’m going home.”\n Home meaning Alaska, I realize, not Turkey. Home meaning the enormous snow-coated bodies of sleeping helminths, home meaning frozen trappers commemorated by piles of stone.\n “I won’t go with you,” I tell her.\n “I know,” she says. “You don’t need to. It’s my home, not yours. Like you said. A place for parasites.”\n Three months after Aliye returns to Circlet, Dr. Akudaan sends a letter telling me that she’s gone. She was a good farmer, he says, like he’s trying to eulogize my own sister for me; she wasn’t killed by the cold or starvation or helminths. He wanted to tell me before we left Alaska that she was dying of reinfection, but Aliye wouldn’t let him.\n Folded into his letter is a check, signed by Aliye. Almost enough to rent my own stucco house in the city, almost enough to import a pair of freshly-immunized goats. On the back of the check, Aliye wrote: I hope this covers three years.\n I don’t feel sorry like she wanted me to, I don’t feel guilty. But I wish I could have laid a stone on the pile for her on the day we rode out to the mammoth graveyard, when she knew already that she would fall while I rode on, that her road ended before mine did, and she would be an elegy, then a story, then forgotten while I recovered from what her tragedy had done to me."}