{"fingerprint": "13VTWOx4GwqGykfj1XfI4tmuggw=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: And the Winners are . . . by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: And the Winners are . . . by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: And the Winners are . . .\n As February came to an end, so did the second round of our annual reader’s poll. In the first round, our readers chose five finalists from our 2017 issues in two categories: best cover art and best short story. To recap, these were the finalists:\n Best Story\n \n “A Series of Steaks” by Vina Jie-Min Prasad (January)\n “Waiting Out the End of the World in Patty’s Place Cafe” by Naomi Kritzer (March)\n “An Account of the Sky Whales” by A Que (June)\n “The Secret Life of Bots” by Suzanne Palmer (September)\n “Who Won the Battle of Arsia Mons?” by Sue Burke (November)\n \n Best Cover Art\n \n Waste Pickers by Gabriel Bjork Stiernstrom (January)\n Jungle Deep by Sergei Sarichev (March)\n Sea Change by Matt Dixon (June)\n Homecoming 2 by Jonas De Ro (November)\n Eistibus, Angel of Divination by Peter Mohrbacher (December)\n \n Right out of the gate, the two winning works took the lead, holding it all the way to the end. By no means was this a runaway victory, however. The other finalists ran neck-in-neck, often only a few votes behind the leaders. While there can only be one winner, the other finalists should be quite proud of the support they received.\n Winner - Best Cover Art - Sea Change by Matt Dixon\n Matt says:\n \n “It’s delightful to learn that ‘Sea Change’ has been chosen at the favourite Clarkesworld cover of 2017. What makes a Reader’s Poll result special is the readers. Trying to build a narrative into my robot pieces is part of what brings me back to the work again and again, for that image to attract the approval of people who love stories is very rewarding indeed. Thank you!”\n \n Those of you who like Matt’s work might be interested to know that he is currently running a Kickstarter campaign for his latest robot art book, Transmissions 4. I have the first three volumes and have already made a pledge to get the fourth one. Highly recommended. You can check out the campaign here: https://www.kickstarter.com/projects/1619265419/transmissions-4-robot-art-book-by-matt-dixon\n Vina says:\n \n “Thank you to everyone who voted for ‘A Series of Steaks’ in the poll—this was my first submission to a speculative fiction magazine, and I'm very happy to see that it's got so much love!”\n \n Last month, it was also revealed that Vina’s story is a finalist for the Nebula Award for Best Short Story. That’s on top of three year’s best anthology appearances and making the Locus Recommended Reading List. Congratulations Vina!\n While we’re celebrating, there’s one other 2017 story that has received an award nomination. “The Stone Weta” by Octavia Cade is 2018 Finalist Sir Julius Vogel Award for Best Short Story. Well done!\n The nomination phase for the Hugo Awards has opened, so I’d like to remind everyone that we are still not eligible for Best Semiprozine. While we graduated from that category several years ago, there are still some people who think we’re eligible and nominate anyway. Instead, I strongly urge you to check semiprozine.org to find other qualified publications to nominate in that category.\n Since there isn’t a best professional magazine category, your next best alternative is in the Best Editor (short form) category. I’ve been a finalist in that category on five previous occasions and each time has meant something special to me. I might be 0-5, but damn, I’ve been in some amazing company. Quite the honor.\n Also, if you’d like to nominate any of our stories or artists, we’ve put together a handy list of our 2017 stories sorted by the appropriate categories at: http://neil-clarke.com/clarkesworld-in-2017-hugo-award-eligibility/. (The novella, novelette, and short story categories are determined by word count, so figuring that out can be a hassle for readers sometimes.)\n Thank you to everyone who participated in our reader’s poll and/or nominated stories or art for any honor. The short fiction community is stronger for those efforts and it means so much to those of us working in this field. There’s no shortage of negativity these days, so even the smallest sign of appreciation goes a long way!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}