{"fingerprint": "tCMK8BT95mTc9cbl2P6IAvpYilA=", "sitename": "Clarkesworld Magazine", "title": "All the Painted Stars by Gwendolyn Clare", "author": "Gwendolyn Clare", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clare_01_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: All the Painted Stars by Gwendolyn Clare", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6490 words, short story\nAll the Painted Stars\nThey are not the Brights, and so I hesitate to save them. Part of me is eager, and part of me ashamed.\nEven through the haze of plasma blasts dispersing over their shields, I recognize the ship as a Bright construct—too much glass, arranged in sharp geometric panels so the entire upper surface glitters with reflected starlight. Still, I know the pilots must not be Brights. First, because they fly clumsily and appear not to know how to fire the main cannon. Second, because the Brights went extinct some twelve hundred solar cycles ago.\nI decide to take a closer look at their attackers, and the fibers in my flesh tauten with anticipation—though I tell myself I will just look, not engage. Intent ripples down my middle tentacles to the interface between flesh and machine, and my little stellate-class fighter zips nearer. The attackers have seven mid-size cruisers, nothing so cumbersome as the Bright ship nor so whimsical—boxy and compact, and decked with weapons. I do not recognize the design. Some backwater species, no doubt. I am patrolling near the edge of protected space, so it is to be expected.\nI choose a wide selection of frequencies and broadcast an audial message to all the ships in the vicinity. “Hostile vessels, please be informed you have entered protected space. Under the laws of the Sheekah, acts of genocide are punishable by death. Power down your plasma weapons.”\nThe attackers do not respond. But then, if they do not know our laws, what is the chance they know our language?\nI broadcast the same message in the Bright language, and then add, “You must provide evidence of personal grievance to a Sheekah enforcer prior to engaging in interspecies violence.”\nI wish I did not feel a surge of excitement at their silence, at the continued barrage of plasma fire.\nI spin the fighter nervously, considering my options. The aggressor may hold a legitimate grievance and simply suffer from an onboard system too crude to translate the transmissions. Or they may have chosen to ignore me, assuming my tiny fighter poses no threat. A compromise then: I will destroy one ship at a time until they relent.\nMy neurochemical balance adjusts, heightening awareness and reducing reaction time, and I cannot help but enjoy the feel of neurons singing for battle. I trigger the thrusters and slice through the void toward the nearest ship, my body fibers tensing against the heavy acceleration. My fighter is a difficult target to hit—shaped like an eight-pointed geometric star, with just enough room for my core mass in the middle and a tentacle stretching down each ray of the star for interfacing. Stellate-class fighters are highly maneuverable, but I am still outnumbered six to one. This is why I am an enforcer: I am one of the few Sheekah violent enough to accept such odds with glee.\nI fire my own weapons in quick, precise bursts, and the reactors of the first cruiser explode in a glorious ultraviolet light-show. Now I have the attention of the rest; two of the remaining cruisers break off from their engagement with the Bright ship to pursue me. I dance away like a comet on an eccentric orbit, there and gone again before they can look twice.\nWhen I repeat the transmission, I should be saddened that they still do not cease fire, though in truth the challenge thrills me. I dart through their fleet and destroy two more cruisers, pausing between each explosion, but the remaining cruisers seem if anything incensed to further violence.\nI am closing in on the fourth cruiser when my fighter is hit.\nStellate-class fighters are much too small to carry shield generators, relying instead on maneuverability to avoid getting hit. Ironically, it is not a plasma blast that finds my little fighter, but a shred of shrapnel from one of the cruisers I destroyed. Through the interface, I feel the shrapnel impact as if it were slicing my own flesh, and then one of my tentacles goes numb, a safety precaution against excess stimulation. I run diagnostics and discover that one ray of the star is badly damaged, the thrusters useless.\nWell. This changes things.\nMy fighter has a Stillness Bomb installed, though I have never before activated it. Use of the Stillness is tightly regulated under Sheekah law—it is considered a last resort. But here I am, damaged and outnumbered, and the Brights were never formally removed from our list of treatised allies so I am justified in using the Stillness to defend the Bright ship. A technicality, of course, since I know the inhabitants aren’t Brights, but it allows me to use the weapon nonetheless.\nTo save them, I need to maneuver into contact with their hull, a task I struggle to accomplish without my full array of thrusters. After long seconds of angling, I pass through the Bright shields and stab into the ship, one of the rays of my fighter penetrating the hull. The ray unfolds, sealing the two vessels together and leaving one of my tentacles dangling down through an open aperture into a hallway in the Bright ship. This fusion complete, I can now calibrate the Stillness Bomb to avoid the Bright ship and its occupants. When I am certain the weapon identifies the Bright ship as an extension of my fighter, I meticulously disengage three levels of safeties and activate the Stillness.\nMy fighter shudders, straining to stay attached to the Bright ship, then goes still. For a moment, nothing seems to have changed, and I wonder if perhaps the weapon was damaged in the firefight. Then the attackers’ plasma weapons sputter and die out, and the four remaining cruisers start to drift very slowly out of formation. The motion is barely perceptible, but it fills me with a cold, sick dread. All those lives snuffed out, and what if my judgment was wrong? What a wretched Sheekah am I, who would choose this life of killing.\nI do not have long to think on it, though, because the stress of activating the weapon has exacerbated the damage, and my fighter’s systems are failing. I must abandon it or die with it. I consider the second option—after all, what am I without my fighter?—but the automated preferences are set for survival, so the fighter disconnects me without waiting for my decision.\nAs soon as the emergency disconnect triggers, I am blind and suffocating. I fall through the aperture of my fighter into the Bright ship, bits of metal interface still clinging to my tentacles, and I land hard. I flop helplessly on the deck, unadapted for artificial gravity, and without my fighter I sense nothing. My circulatory fluid is slowly turning toxic, and even if the atmospheric composition were appropriate, I have no organs designed for interfacing with air.\nI need lungs or I will die. I need visual and auditory organs, too. Immobile as I am, I must wait for the telltale vibration of feet upon the deck, heralding the arrival of the aliens. I think I feel it now, I can’t be sure—even my ability to feel the shudder of metal against my flesh is dulled without the electronic stimulus of my fighter.\nI flail my tentacles, panicking, and find nothing but empty air. To calm myself, I focus on the task of slowing all nonessential bodily functions. This will buy me a little time, I hope. I cannot quite think rationally with all my neurochemical feedbacks screaming at me to adapt, to survive.\nAgain, I flail desperately, but this time one tentacle lands on bare flesh. Yes! I eagerly wrap my tentacle around the limb and begin probing for genetic information. Stem cells are ideal—they retain the broadest memory of how the organism as a whole works—though gametes provide a useful perspective, too. I do not dare to hope for embryonic cells, because that would require an incredible stroke of luck and my luck has not been good today.\nThe stem cells of this species have disappointingly limited potency, but I explore enough to start appropriating their genetic design. The toxin buildup in my circulatory system clouds my thoughts and slows my progress. I hope what I can glean from this individual will be sufficient.\nI begin to understand this species as my body begins to integrate their design. They are bilaterally symmetric, endoskeletal, bipedal, endothermic, sexually dimorphic. (Definitely not Brights—if I had any doubts about that, they are gone now.) They have sensory organs for electromagnetic radiation, compression waves, and chemicals. I grow the lung tissue first, so I will be able to breathe as soon as my cellular respiration has altered, then I focus on retinas and cochleae.\nAs my new senses sharpen and stabilize, I gain awareness of the aliens. There are several of them encircling me, black handheld weapons cradled in their arms. They raise their weapons menacingly, and raise their voices as well; the one I am touching emits a shrill warning call. I begin to realize how very dire my situation is. Have I violated a taboo against physical contact? Perhaps they are a race of clinical xenophobes? I do not know what I have done to agitate them so quickly after I saved their lives.\nI was never meant to be an ambassador—I do not have the training, and I am too violent besides. I have spent the last thirty-six solar cycles alone inside my fighter, engaging with other species only in my capacity as an enforcer of Sheekah law. And now I find myself in contact with a new species, trying to remember how to mimic physiology, to become one of them. I fear I have already ruined any chance of rapport.\nWhen I am sure I have collected sufficient genetic data to survive in their atmosphere, I unwrap my tentacle, releasing the gene donor. I suck down my first lungfuls of oxygen through newly formed facial orifices.\nAnd the difficult part begins.\nThey do not kill me right away. I take this as a good sign. They lift me onto a mobile platform and move me to a room with other platforms, some of them occupied by members of their own species. These ones do little in the way of moving or vocalizing, but they also leave me with two males holding weapons. I do not try to ask the killers for more gene donation.\nTime passes. Other aliens—ones who do not carry weapons—are often present, watching me, waving diagnostic equipment over me, trying to communicate. I have no translating abilities without my fighter, so I must learn their language the slow way. I grow legs and arms, I learn to metabolize their sugars, I grow vocal chords and lips and a tongue to shape their words. I wonder if my fighter is irreparably damaged, which would mean all this effort to survive is a waste.\nI am learning names. Mosby, Rosenberg, Liu; Ahmed, Levitt, Jones. But I do not know what to tell them when they ask for mine. I pause, they think I do not understand and gesture more vigorously towards me. Mosby Rosenberg Liu Ahmed Levitt Jones, they repeat, touching themselves with their hands, then they aim their digits at me and wait for an answer. What can I tell them? Sheekah are named when they choose their lifepath—as a pilot, my name is the name of my stellate fighter. Or at least it was. My fighter is damaged, I am no longer interfaced, and I have taken a new form, yet I am hardly in a position to ask them to name me as a true ambassador would. I cannot even communicate what the problem is.\n“Ohree,” I eventually say. It was my childhood nickname long ago. Fitting, because I am so like a child now—awkward and unplaced.\n“Ohree,” they repeat, and the name sounds distorted even though we share a vocal anatomy now.\nI cannot explain anything, I cannot ask for anything. I can only point to an object and earn a garble of syllables for an answer. Does “medbay” describe the platform, the material it is made of, the function it serves, or the person lying prone upon it? Is “door” the word for an egress, or the object that blocks the egress? For the first time since I was a child, fumbling to find my lifepath, I feel hopelessly frustrated.\nLiu and Rosenberg are in the room with me when I decide I no longer care about upsetting them. If they tell the killers to shoot me, then I will be shot, and at least that will be a change from what I am now. I slide off the platform, balancing uncertainly with my new bipedal body, and take careful steps toward one wall where there appears to be some kind of interface terminal. Rosenberg makes loud vocalizations, and I ignore her.\nThe terminal has a manual interface—buttons to be depressed by fingers, unthinkably primitive—which I rip out of the wall. I press one palm to the exposed circuitry and close my eyelids, concentrating on the task of growing a direct electronic interface of my own.\nThey still haven’t shot me yet.\nI learn this terminal was designed for accessing the medical portion of the ship’s database, which is unfortunately not the portion that I need. I mentally slip behind the front-end processes and gain access to the database in its entirety. It is very large, and organized with the dubious logic of Bright minds, information twisting and twining back on itself like a jumble of vines grown together. Eventually, I access the language files for these aliens and use what little I know to identify “English” as the dialect I need to download.\nWhen the task is done, I disengage from the terminal and resorb the interface into the flesh of my hand. “Now,” I say, “this will be easier.”\n“Incredible,” says Liu, shaking his head. The gesture makes me wonder if I should have looked for a file on nonverbal communication among humans.\nRosenberg stares at me, and then says, “Someone better get Mosby.”\nUpon my life, I do not know why it was so important to fetch Mosby. He asks the most inane questions, while Rosenberg holds her lips tight together and Liu backs away as if ceding the whole room.\nOnce I prove to Mosby that I am now conversant in his language, the first thing he says to me is, “We need to know about that weapon you fired.” Mosby is the most important of their trained killers and holds the title of “colonel.” He tells the other killers what to do.\nI don’t see the relevance, but I answer his question anyway. “It produces a sort of space-time whiplash that disrupts neurological functioning. Fatally so, in all organisms we’ve encountered so far.”\n“Is it still usable?”\nI stare at him for a moment. “No, that’s unlikely. The damage to my fighter is too extensive. Were you planning to commit genocide in the near future?”\nMosby’s face scrunches up in an expression I do not understand. Rosenberg takes a step forward, places a hand on his arm, and says to me, “Of course not. The Colonel’s just worried about defending the ship against another attack.”\n“That is no longer my concern,” I say.\n“What do you mean ‘not your concern’?” Mosby says, his volume and pitch rising. “Aren’t you supposed to be some sort of interstellar policeman?”\n“I am no longer interfaced with my fighter.”\nMosby says, “Listen, you—” but Rosenberg drags him by the arm out into the hallway.\nThey talk. I cannot quite hear, but I believe I have displeased one or both of them. I am not sure how—it was not my intention.\nLiu, who seems to avoid standing in proximity to Mosby, comes closer again now that Mosby is elsewhere. “Don’t judge all of us based on the likes of Mosby,” he says. “There’s a reason they put a civilian in charge of the expedition.”\nI don’t know who “they” refers to, but I doubt it matters. “I am not here to judge you. The only judgment I am authorized to make is to determine the legitimacy of grievance in interspecies conflict.”\nLiu does something with the muscles in his lips. “I’m sorry, it’s easy to forget you learned our language less than an hour ago. I meant that you must be forming impressions of what our species is like, and Mosby isn’t representative. Not of all of us, anyway.”\n“I will take that under consideration.”\nRosenberg returns alone. She apologizes for Mosby’s behavior, though I would not have known he behaved inappropriately if she and Liu had not told me. Rosenberg is a leader, but not a killer, and seems to have incomplete authority over Mosby.\n“So,” Rosenberg says as she leans against the exam table next to mine. “You saved our butts out there, and now you’re stuck with us. First of all: thank you. Second, if we could impose upon you further, we could use some help navigating this region of space.”\nNow I am truly confused. “You do not know where you are going?”\nRosenberg lets out a breath noisily. “The Brights left this ship in our home system a little over thirteen thousand years ago. When we discovered it, their recorded instructions were . . . cryptic, but the nav system came pre-programmed. We’ve been following the course they set for us, but obviously we’re having some trouble with the locals along the way.”\nHer lengthy reply does not actually answer my question. I try to rephrase it to be clearer. “What is the purpose of your journey?”\n“We’re going to Bright space. It’s not clear why they want us to come, but we couldn’t pass up an invitation like this.” She raised a hand as if to indicate the room, or perhaps the ship at large. “I’ve done some poking around in the database to learn about your species, so I know the Sheekah were allies of the Brights once. Would you consider helping them now, even if they’re not here to ask for it?”\nThis surprises me. “You do not know?”\n“Know what?”\n“They are gone.”\n“Gone,” Liu interjects loudly, before Rosenberg can answer. I do not understand why he repeats the word—perhaps I misused it.\n“The Brights went extinct,” I clarify. “They developed a genetic anomaly that spread from cell to cell throughout the body, causing widespread genomic degradation, and was, like a pathogen, highly transmissible between individuals. Many Sheekah were infected trying to help them before the Ambassadorial High Council declared quarantine.”\n“Gone,” Rosenberg says and goes silent for a minute. (Does everyone need to say this word?) Something appears to be wrong with her, but I do not know what to do. Eventually, she says, “Did they know they were dying off when they left us the ship?”\nI do a little quick math, converting unfamiliar units of time based on what I gleaned from the ship’s database. “Given the age of the ship, that seems probable.”\n“I guess now we know why they named the ship Legacy.” She puts her hand over her mouth, as if to hold in the words, but I can still hear her clearly. “We have to figure out where we’re going, and why. Would you consider helping Ahmed with the database?”\nI stare, not knowing how to respond. What happens to those I protect after I enforce the law has never been my concern. I wonder what it would feel like to be invested in their fate, but all I can feel is the absence of metal against my skin, the ghost-memory of tentacles I no longer possess.\n“I am here,” I say dispassionately. “I will help with what I can.”\nDays pass. I interface again with the Legacy database and develop a rudimentary understanding of the systems architecture. This helps, a little, to alleviate the ache of losing my fighter and my lifepath with it. At least when my mind is occupied, I am not dwelling on how wrong everything feels. I try and fail to explain the database to the technologists, who cannot grasp the Bright way of thinking. Whole sections of the ship are offline and locked down, and I am surprised they made it this far with such limited control.\nI also learn more from the database about these humans; they live short lives, for instance, the equivalent of only nine or ten Sheekah solar cycles. I must seem ancient to them, though among the Sheekah I am considered young. They have so little time—this helps me understand why they seem so desperate to accomplish something, even if they do not know the nature of their task.\nI grow irritated with the technologists. They are always near, bothering me with questions, even though they do not generally understand the answers. After the long cycles of solitude in my fighter, I am unused to tolerating so many individuals in such close proximity. I look for something else to do.\nInstead I help the botanist, Keene, revive some of the plant species, the ones whose genomes indicate they will be harmless to humans. It is tiring but not particularly difficult work; I must grow a temporary interface with which to access the genomic database, and my body requires extra sustenance to provide the molecules with which to shape the seeds. Keene seems very pleased with the results. I care little for reviving extinct species from the Bright homeworld, but it also costs me little, so what does it matter either way? The Brights loved their botany and would not have wanted Legacy to fly with empty solaria. Indeed, from what I learned of the systems architecture, I suspect healthy solaria will prove important for restoring and optimizing certain functions elsewhere on the ship. Not that this matters to me.\nI miss my old self. I think about fixing my fighter, but I can find only some of the tools and none of the spare parts I would need for the task aboard Legacy.\nI consider ending my existence.\nI sit on a bench in the aft solarium, which remains dark and unused and skeletal. In the central solarium Keene’s seeds have begun to sprout, so I come here instead to avoid the curious visitors drawn in by the promise of green growth. Back here, if I hold very still, I can feel the subsonic hum of the main engines vibrating the hull.\nThrough the geometric panes of the ceiling and walls, the stars look strangely close, as if the hull were not clear at all but rather painted with the likeness of stars. I stare into space, remembering how this view used to belong to me every hour of every cycle. It’s not the same, of course—these human eyes see such a narrow spectrum—but at least it feels familiar.\nThe aft solarium doors breeze open and Liu, the psychologist, enters. I do not look away from the stars but I can tell it is him from the way his soft gait whispers on the deck. He takes a seat next to me on the bench. Humans are highly social and require near-constant interaction and stimulation when conscious.\n“How are you adjusting?” he says.\nI think my habit of sitting here alone disturbs Liu. He does not understand me at all. “I do not know if I wish to adjust.”\n“Look—I know this isn’t where you want to be, but the truth is, we could use your help here. The Legacy database is thirteen thousand years out of date and so huge we can’t find what we’re looking for most of the time anyway. We could use a guide who knows what they’re doing.”\nI lower my gaze to look at him. Humans seem to desire a quite specific quantity of eye contact while communicating—not too much, not too little—though I have not yet mastered the exact proportion. “I am not an ambassador,” I say. “I was trained to be an enforcer of the law. I cannot perform another life.”\nLiu’s brows tighten and draw together. “Life?”\n“Job,” I say, to clarify. I have not yet discerned why they have two words for this concept.\nLiu exhales forcefully and leans back against the bench, stretching his legs. If the gesture means something, it is lost on me. Humans rely heavily on nonverbal communication, much of it subconscious, and it frustrates my efforts to understand them. Or rather, it would frustrate me, if it were important for me to understand them. Which it is not. Because I think I will kill myself today.\nAfter a while, Liu speaks again. “In the ship’s logs, the Brights say they left us Legacy because they knew we would someday build conservatories.”\nI do not know the word. “Conservatories?”\n“Places where we cultivate plants for aesthetic value.” He points at the solarium ceiling. “The architecture usually looks something like this. Anyway, at the time when they left us the ship, humans had barely started getting a handle on agriculture. We didn’t build conservatories until thousands of years later.”\n“Are plants of great cultural significance to you now?”\n“They’re not central to our society, no. Well—Keene might argue otherwise, but most people don’t think twice about the cultural value of plants.” He lifts his shoulders in an unfamiliar gesture. “I don’t know. Maybe the Brights saw what they wanted to see in us.”\n“As you see what you want to see in me.”\n“The point is,” Liu says, “you hardly ever get the ideal situation you’re hoping for. But if you’re lucky, you find something that will suffice.”\n“I am not an ambassador,” I say again.\n“No, but you’re close enough for us.”\nMaybe I will wait until tomorrow to kill myself.\nTomorrow comes, but the humans distract me. Over the comm, they say they have desperate need of me in the systems control room. And what does it matter if I delay another hour, another day? So I go to them.\nThe systems control room lies buried deep in the ship, in one of the few areas with no view of the stars. The room itself is dimly lit and decagonal, a display and a crude manual interface affixed to each of the walls. Rosenberg and Mosby are there with Ahmed, the chief technologist, and a subordinate technologist whose name I do not recall.\nI move too quietly for them to notice my arrival. (Always, these details I cannot seem to get right. I wear human skin, but it will never fit exactly.) To announce myself, I say, “What has happened?”\nFour pairs of eyes look in my direction. As soon as they register my presence, everyone tries talking at once. Rosenberg and Mosby quickly turn on each other. These humans spend so much time arguing about what to do, it’s amazing they ever get anything done.\nFinally, the rest of them agree to quiet down so Ahmed can speak. “We’re getting power fluctuations all over the ship. Life support keeps trying to shut down—we’ve had to force a restart three times in the past fifteen minutes. No idea what’s causing it.”\nThis does not surprise me. The Brights did not design their systems architecture to be solid and immutable, but rather flexible and adaptive. “I will look,” I say.\nI place my palm on an exposed patch of hardware, grow an interface, and begin sifting through the diagnostic reports. Bright diagnostics are so literal they are almost evasive—always describing what is happening, but never hinting at why. I skip past the reports and prod gently at the underlying systems, doing the command equivalent of poking life support with a stick to see if it twitches.\nLife support seems raw and hypersensitive, overreacting to stimulus. The shields seem lethargic, the main engines argumentative.\nI mentally pull back to give my analysis to the waiting humans. “Legacy is experiencing some sort of systems destabilization, possibly triggered by the introduction of plant life in the central solarium. The ship is attempting to re-evaluate resource allocation and re-integrate, but systems integration seems to require guidance.” For clarity, I add, “Guidance from a Bright engineer.”\nPredictably, Mosby wants to know if the power to the main cannon can be restored, and Rosenberg starts arguing about prioritization. Humans are a confrontational and violent people, whatever Liu might say to the contrary. Perhaps I understand this better than any trained ambassador could. Sometimes I even see a little of myself in them. Were I still an enforcer, would I not take great care to restore my weapons systems? Of course I would.\nBut I tell him, “Systems integration is a very complicated process. I most likely will not be able to complete it at all, let alone to your desired specifications.”\nThis silences them. They all stare at me, wide-eyed. Have I somehow misspoken? In a situation like this, am I supposed to ply them with false hope instead of giving an honest status report?\nI do not know the Brights the way an ambassador would; I am too young to even have spoken to anyone with first-hand knowledge of the Brights. I have only a superficial understanding of their thought patterns, and this is a task best reserved for someone who truly knew them. If not for a Bright itself.\nI cannot do what the humans expect of me. And yet, I must try.\nI close my eyes to block the stimulus so I can delve deeper. Soon, I can visualize the interconnected web of the ship’s systems, each hub enmeshed among the others as if held in place with thick, pulsing vines. The offline sectors and systems appear marooned and dark, disconnected from the vital flow of the web.\nConcentrating, I examine the systems more closely. Here: movement, change. And here, and here. Everywhere I scrutinize, the deep structural connections are unraveling, senescing, peeling away like flower petals destined to be supplanted with fruit. It is a process I understand only with academic distance—from my examination of plant genomes, not from personal experience. Still, I recognize the patterns as organic design, organic thinking. Only the Brights would build a ship as convoluted and self-referential as a genome.\nBack in the control room, the humans are getting restless. “What is going on?” demands Mosby.\nI retreat from the depths enough to answer him. “The architecture you have now was never meant to last. It is . . . ” I do not know why I pick the word: “juvenile.”\nMosby opens his mouth but Ahmed looks at him says, “Less talk, more work.”\nI must agree with Ahmed.\nIgnoring the sounds of the control room, I return my focus to the Legacy’s architecture. I pull myself deeper, down into the disordered conglomeration of systems, losing awareness of my physical body. I focus all my mental acuity to study the ship.\nIt wants to grow, to metamorphose, to mature. I can tell this much: growth could be good, but it also could be cancerous. The old connections run dry and slough off, and the systems sprout wild new vine stubs that quest in every direction. Left to their own devices, the systems will strangle themselves with malformed, overgrown connective structure. But how am I to guide this process, rife with botanical zeal only a Bright could comprehend?\nI pause, thinking. Metamorphosis is an animal concept. They are not vines, they are tentacles—and tentacles I understand. I think of my stellate fighter, how cleanly designed it was, with its eight rays each encapsulating a tentacle, and all the neatly arranged interfaces. And at the center, my brain to process and control.\nSo, me—and by extension, the control room—at the nexus of the web. The strongest connections, thick and steady, direct from each system to the nexus. Lesser connections, flexible and mutable, exchanging information among the systems themselves. I weave the ship the way I would weave my own flesh, easing the nascent tentacles over a new growth template as if it were a foreign genome to be integrated.\nWhen the connections have been laid, the most delicate part still remains to be done: I carefully extract myself from the center of the web, leaving behind the shell of the control room, not so much a vacancy as a resting state. I pull away, leaving all the connections intact, the hollow space waiting patiently for its next command.\nIt is done. And, if all is right, it will even be receptive to the humans’ control.\nI rise slowly, like floating up to the surface from the depths of an ocean, the lights and sounds of the control room wavering and resolving. I blink, eyes slow to focus as the ciliary muscles reawaken to their duties.\nOn every wall of the room, the display screens shine with dazzling varicolored light. My tear ducts water, my pupils hasten to contract. I see the humans shading their faces with their hands, so I know my body’s reaction is not an oversensitive after-effect of deep interfacing. The screens are very bright.\nYes, I realize. The screens are Bright.\n“They’re beautiful,” says Rosenberg, “even if it hurts to look at them.”\nAhmed is still bent over a console. “There’s an audio recording, too, but the frequencies are all ultrasonic.”\nRosenberg asks, “What are they saying?”\n“It’ll take a while for the translators to work it out,” says Ahmed.\n“Unnecessary,” I say. I force some crude adjustments to the anatomy of my ears, expanding the range of my hearing. The recording is part-way through the message, but I wait until the end and it loops back to the beginning. “Roughly translated: the Legacy’s destination is a research base on a dwarf planet in the outskirts of the Brights’ home system. They hope that, in the time it has taken your primitive species to develop interplanetary travel and discover Legacy, the pathogen will have gone extinct. The research base contains preserved samples of healthy Bright genomes. If you have the technology to restore plant biota from the genomic database and shepherd Legacy through the transition to maturity, you will be able to restore the Brights.”\nEveryone goes quiet. What have I done, meddling in the fate of these humans? An ambassador would have known better than to do for them what they cannot do themselves; I was a fool to think I could help without entangling myself. I feel nauseated, an unfamiliar physiological response to this upwelling of emotions inside me.\nAhmed is the one who says what they all must be thinking. “But it wasn’t us who brought back the plants and guided the ship, it was you.”\nWhich means the task of restoring the Brights falls on my shoulders, not theirs. “I know,” I say, and rush from the room.\nHiding in the aft solarium, I stare out at the painted starscape. By human means of reckoning, this region of space was my home for three lifetimes: cold empty death punctuated with tiny oases of energy and life. They all belonged to me, once. I felt at home in the void, satisfied with what I was, and now I am trapped behind this glass and can only yearn for that silent solitary existence.\nAt my core I am a fighter pilot—a thug, a killer. I was made to do what the rest of the Sheekah, with their delicate dispositions, could not. How can anyone expect me to resurrect a whole sentient species when all my training and experience has been in dealing death, not life?\nI am no one’s savior. It is too heavy a burden to bear.\nLiu comes in: shuffle, shuffle, soft steps on the deck. He approaches hesitantly, hanging back as if he doesn’t wish to intrude on my thoughts.\n“Rosenberg sent you?” I say. I am learning how their hierarchy works.\nLiu takes the words for an invitation and joins me on the bench. “She wants me to try talking with you.”\n“We have now spoken.” I look at him. “You may report success.”\n“Why, Ohree, that was almost a joke. Are you growing a sense of humor to go with the mammalian physique?”\n“Doubtful,” I say, looking away again. Though maybe I am.\nLiu lets out a loud breath. His vocal pitch drops lower. “You know what I’m here to ask you about.”\n“Rosenberg wants me to continue with you to your destination. Rosenberg wants me to revive the Brights.”\n“We can’t do it without you, obviously.”\n“You do not understand. The process will not be a simple one, like with the seeds. Brights are very complex organisms. I will have to adapt my whole physiology, I will have to gestate the embryos inside me.”\nLiu is silent for so long that I give up my view of the stars and turn to face him. He is staring at me. “What exactly do you have on your to-do list that ranks more important than this?”\nI pause. “If they made the smallest mistake, if even one gene region is tainted with pathogenic code, I will die.”\n“Since when were you more afraid of dying than of not having a purpose?” Liu’s lips curl in an expression I now know to indicate amusement. “How human of you.”\nThe words fall on me like a blow. He is right—only two days ago I was contemplating suicide. I fall back on an older argument. “An ambassador would be properly trained for such a task, which I am not.”\n“You thought you couldn’t guide the Legacy through her transition, but you could,” he said. “It doesn’t matter that your own society marked you a castaway. It doesn’t matter what life you had before. You are capable of things you haven’t even dreamt of yet, and it would honor us to be the ones who help you discover those things.”\nI go very still. I do not dare to hope this could be true. It violates a paradigm so deep-seated in my psyche that I did not even suspect its existence until now.\nLiu says, “Humans aren’t in the habit of changing their given names. Surnames, though, were originally descriptive—you were named for your profession, or the village you came from, or your parentage.” He pauses, the silence almost livid in the air. “You don’t have a surname.”\nIf I was frozen before, now I am a comet lost between the stars—even my molecules feel stuck. I am sure I could not look away if I tried. I know Liu knows how Sheekah naming works.\nLiu smiles, though somehow the expression seems grave, as if he understands exactly what it is he’s doing. “I think we’ll call you Ohree Brightbearer, if the sound of it suits you.”\n“Yes,” I say, hardly able to breathe. “Yes, it suits me fine.”\nI am named, and there is work ahead of me.\nGwendolyn Clare resides in North Carolina, where she tends a vegetable garden and a flock of backyard ducks and wonders why she ever lived in the frozen northlands. She has a PhD in mycology, which is useful for identifying wild mushrooms but not for much else. Her short fiction has appeared or is forthcoming in Analog, Asimov's, and Beneath Ceaseless Skies, among others."}