{"fingerprint": "CDyxBSBTRMGYXO+XMmfsIw2uxuQ=", "sitename": "Clarkesworld Magazine", "title": "Indelible by Gwendolyn Clare", "author": "Gwendolyn Clare", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clare_02_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Indelible by Gwendolyn Clare", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2460 words, short story\nIndelible\n“You’re not Shurkar.”\nWith confusion or doubt, with a hint of disdain, dismissively, or amused. They say it with pity, with soft genuine concern for my mental health. Sometimes they sound deeply offended. Or they say nothing at all, and keep walking.\n“Have you seen these marks before?” I say, lifting hair off the back of my neck and turning to show them.\n“Sir, Ma’am, Sir, Sir, Mx,” I say all afternoon. “Do you know a family with marks like this?”\nThey give the same non-answer, each one lacing the words with their own subtle meaning. What is she doing here? Is this a joke? Unfathomable human. What mockery is this?\nYou’re not Shurkar.\nThe needle burned across my vertebrae. A relief when the artist migrated away from the spine and onto the shoulder. He paused, adjusted his hold on the machine’s grip, grumbled about the difficulty of matching the pattern exactly—I only brought the one photo for him to copy from. We had always been so careful to keep my sister’s marks hidden.\nA single photo. All I had left of her marks. All I had left of the real her, the core of her, the only part that wasn’t a mimicry of my human phenotype.\nThe part another Shurkar might recognize.\nPhaakoh practices growing tentacles.\nWe’re up on the wall. The overcast night sky glows a washed-out blue, clouds like old bruises in the light from Shurkar City. Phaakoh makes a suctiony wet sound every time ze unfurls a tentacle. Still seems strange how freely Phaakoh morphs, how insignificant an action it is for zer, the way a bored human might fiddle with a pen. So unlike how it was with my sister.\nI flip open my knife, gather up my hair in the other hand, saw at the strands with the blade. Would be easier if I had a pair of scissors. One more on a long list of hard-to-come-by things, now I’m in the City.\n“Cheng.” Phaakoh calls me by my surname. Just likes the sound better. Or maybe ze’s trying to tell me something, in that indirect way the Shurkar have. A sly, sideways shuffle closer to the truth. When I don’t reply, ze says again, “Cheng. Whatcha doing?”\n“It’s always in the way,” I say.\nZe harrumphs. “Dunno if the hair’s the problem.”\n“Well it sure isn’t yours,” I quip. Ze doesn’t have any hair today.\nPhaakoh laughs and wraps a tentacle around my ankle, gives a playful tug. The suction’s surprisingly strong. I slide along the concrete and almost drop my knife over the edge of the wall. Severed strands of hair rain down, like wisps of black descending shadow. “Stop, stop it!”—but now I’m grinning too.\nWe made a tent of her bed sheets, flashlights in hands. I sucked in my cheeks and puckered my lips like a fish. My sister grew her fingers spidery long and wiggled them in front of my nose. I clapped a hand over my mouth to hold in the oncoming wave of giggles. If we’d been caught, Mom would’ve been furious.\nNot about us staying up past bedtime. About the other thing.\nHumans don’t morph.\n“What are you going to say?” Phaakoh asks.\n“Huh?” My mind is elsewhere. Nighttime always reminds me of her, the time when she could truly be herself with me. In the day we looked alike, but it was when we were alone in the dark that we were closest.\n“If you find your sister’s bloodkin, what do you plan to tell them?” Ze slowly nictitates zer inner membranes over shiny inkwell eyes. “You must have thought about it.”\nI shrug. “That she died.”\nPhaakoh makes a soft noise in zer throat. Keeps staring at me. I might fall into those bottomless pupils and never find my way out. Of course that’s not all I’d say—not all I need to say—and ze knows it. I would tell them I tried to protect her. Too hard, or not hard enough, I’m not sure. But what else? How do I sum up a life, even one so short? She was happy. She wasn’t alone. She was loved.\nFor a time, she was my sister.\nThe Shurkar came seeking asylum. An ethnic minority persecuted among their own species for their inappropriately strong familial bonds. After coming so far, their reward was four square miles of dirt, with walls and guards to surround it. Rusted shipping crates and scrap metal grudgingly offered up as construction materials. A power grid built from cannibalized engines, rendering their ships useless and departure impossible.\nThey had hoped we would understand them. Welcome them. If they’d been more like the rest of their species—born and bred for interspecies interaction, ambivalent to their own kind—perhaps they would have foreseen it.\nHumans aren’t very understanding.\nThere’s smoke in the air, redolent of oil and spices, wafting down the rows of marketplace stalls. A pair of singers perform for a crowd down at the other end. Sounds like an out-of-tune viola married to a melancholy bagpipe. After years of my mother’s classical flute, the dissonance makes me wince. I try not to let it show. No need to telegraph my humanness any more than I already am.\nPhaakoh’s with me today, perching on an empty crate while I show the tattoo to passersby. The music meanders slowly into a new key, and ze laughs at my expression.\n“So glad my auditory pain amuses you,” I say, stifling a smile. “Don’t you have work to go to?”\n“Not today,” Phaakoh says, adjusting zer position to lounge with a comfort that borders on insouciance.\nPhaakoh works—though not with any regularity—in one of the biotech sweatshops that produce the City’s only approved exports. The Shurkar tend to choose their work shifts in accordance with some ambiguous sense of social responsibility, a sort of voluntary communism. Still not sure how it actually works.\nI stop a trio of shoppers as they walk by. “Excuse me, sirs. Have you seen marks like these on anyone?”\nSeeing Phaakoh behind me, and that we’re evidently here together, they respond politely. Though all that really matters is they respond in the negative.\nThe cool air is turning breezy, and I’ve been out here for over an hour in a tank top to leave the marks visible. Gooseflesh prickles along my arms, but I ignore it.\n“Mx, sorry to bother you. I’m looking for kin with these marks.”\nShaken heads, quizzical raised eyebrows, soft apologies. Don’t know anymore if I expect to ever get a different answer.\nSuddenly there’s a shawl draped over my shoulders, and Phaakoh’s slender knuckly fingers tucking it close. I have no idea where ze got it from. “You’re cold.”\n“Not everyone can just crank up the endotherm gene expression,” I say with a scowl.\n“It wasn’t a criticism.”\nI pat zer hand, regretting my defensiveness. “I know.” I don’t need to tell zer I’m just frustrated. Ze’s been here with me before.\n“And when it’s done?” ze says softly. “What will you do then?”\n“Done’s an odd word for it.” As if grief had an expiration date.\nPhaakoh gives me a look that says, you’re avoiding the question, but ze lets it slide. Shurkars aren’t wont to press.\n“I’m not going back,” I say. “Even if I found her bloodkin today, I wouldn’t go back.”\nZe presses zer lips together in drawn out mm-hmmm, the tone rising and falling with exaggerated musicality.\n“I mean it. There’s no ‘back’ to go to. This is who I am now.”\nZe fusses with a fold of the shawl, for once looking worried. “Too tainted for your own kind, not tainted enough for mine? That’s how you want to spend your life?”\nI don’t know how to think about my life. Don’t want to think about it at all—decades upon decades yet to come, every day with the hole my sister used to fill. I don’t know what I will do, but I’m sure of what I won’t: return to my own species.\nI never found who ratted us out. A neighbor, probably. Certainly made enough fodder to keep the gossip mill grinding for months.\nCan you believe the Chengs were harboring a Shurkar this whole time? They seemed so nice. They seemed so normal. I let my little Suzie play at their house once. Well I went to their Fourth of July barbecue. So shocking. I guess you just never really know people, do you?\nThe marketplace is slow today. Or maybe it only seems that way with Phaakoh off at work and no one to provide distraction. The singers have gone, and the low, repetitive chugging sound of the closest power nexus carries in their absence. There’s a hint of dry, chemical smell in the air, from a ceramics kiln I think, and though it doesn’t bother me I wonder if the food vendors are cursing it. Shurkar can have such sensitive palates.\nA couple passes me by without answering, though they stare as if watching a sideshow attraction. An androgyne points out, for the hundredth time this week, that I am not Shurkar. Takes a monumental effort not to reply with really? I hadn’t noticed.\nPhaakoh is right—I’m trapped between what I was born and what I chose. I rub the back of my neck with one hand. Can’t feel the marks, but it’s comforting to touch them all the same.\nA peacekeeper, doing his rounds, waves his reader near my badge, scowling when the display reports me to be a licensed vendor. Was hoping for some action, I guess—unlicensed humans can be thrown out of the City. I have nothing to sell, just the marks and my have you seen routine, but I paid good money for a valid license to get me inside, so the peacekeeper can’t do worse than scowling.\nPart of me savors every moment of the peacekeeper’s frustration. None of them approve of civilians mixing with the Shurkar. But I’m not a child anymore, I came prepared, I can resist. Doesn’t mean that grain of terror in my gut will ever leave me alone.\nWhen the peacekeeper moves on, the Shurkar weaver with the stall on the corner offers me a sympathetic smile. “Don’t let them rattle you, dear,” she says knowingly. “If you seem confident, they’ll leave you alone. Nervous, and they’ll come back to bother you again. Bad for business.”\nI thank her, and we get to talking. Turns out the shawl I have, the one Phaakoh gave me, is her handiwork. Small world.\nNothing brings people together like weathering the perpetual onslaught of the peacekeepers’ harassment. Ironic. They want to keep humans apart from the corruptive Shurkar influence, but it’s them who drive me ever closer.\nWhen they came to take my sister away, Mom screamed. Understandable. The swarm of men with assault rifles, body armor, gas masks. The shattered door jamb, the shattered silence. After years of fear slowly receding from the shoreline of everyday life, we met the sudden impossible end of it all—a storm surge of militant segregation.\nI had a more practical response. I grabbed my sister and hung on with every ounce of strength I had.\nI knew they wouldn’t take me, so I yelled at her, don’t let go. And she didn’t. She morphed in my arms, clinging to me with everything she could think of, understanding the urgent need to become literally inseparable. My ribs creaked under the strength of half a dozen limbs. Her hair snaked around both our necks. She oozed around my skinny wrists and hardened there like armor.\nDespite the circumstances—or because of them?—my sister’s transformation seemed a thing of glory. All that raw potential, hidden for so long, now finally unleashed. My heart swelled with pride, and in that moment, I glimpsed my beautiful sister’s true face.\nPhaakoh lounges on the corrugated metal of a shallow rooftop. It’s sunny, for once, and ze has zer skin toned dark purple against the radiation. A good look for zer, though looks don’t carry the same weight among the Shurkar. Too easily changed.\n“You want to head down to the marketplace?” Phaakoh says.\n“Not yet.” Ze’s not the only one enjoying the warmth of the sun. The metal roofing is almost hot beneath my palms.\n“Slacker,” ze teases.\nI give zer a sideways look. “Learned from the best, didn’t I?”\nPhaakoh taps zer chest with one finger. “Zen master of doing nothing.”\nI laugh. No idea where ze picked up that reference—not from me, I don’t think. It’s odd, the bits of human culture that trickle through the City. And the bits that don’t.\nEnmeshed in my sister’s embrace, I felt an odd blurring sensation, as if I could not quite be certain where I ended and she began. She filled my field of view, so I could only imagine the soldiers must step back at the awesome sight of her. How could they not? How could anyone not pause to stare at such a wonder? For that moment, I thought it would work. I thought we’d won.\nThey couldn’t pry us apart, while she was alive. So they killed her.\nThe doctors had to cut the pieces of her corpse off of me.\nI stare as Phaakoh’s purple skin gradually darkens across zer angular cheeks, chromatophores responding to the intensity of light as the sun rises toward noon. Zer inner eyelids are closed, making it impossible to guess whether or not ze knows I’m looking.\nI have to shift my weight off my left wrist. The usual pain has settled in for a visit—a dull constant ache that comes and goes ever since the doctors’ aggressive “decontamination” procedure. One section of my sister’s corpse was so difficult to remove they dislocated the joint in the process. I rotate the wrist, trying to relieve the ache, and the tendons make a none too pleasant popping sound. As if I need another reminder.\nAnd suddenly, I realize I can’t bear to hear those oft-repeated words even one more time: you’re not Shurkar.\n“Phaakoh . . . ” I say, hesitant. “To morph into new shapes, you have to build up a genetic repertoire, right? By absorbing genomic information from other organisms?”\nZe nods. Zer inner lids slick back to reveal those fathomless inkwell eyes.\n“So . . . could you also donate genetic information? Shurkar genes,” I say, “into a different species.”\nZe sits up and watches me for a moment before replying, “It’s possible.”\nI take a breath, let it out slowly. “Do it.”\nPhaakoh gives me a knowing smile, a took you long enough smile.\nZe takes my left hand, laces our fingers together. A tingling sensation crawls up my arm, like the reawakening of nerves.\nGwendolyn Clare resides in North Carolina, where she tends a vegetable garden and a flock of backyard ducks and wonders why she ever lived in the frozen northlands. She has a PhD in mycology, which is useful for identifying wild mushrooms but not for much else. Her short fiction has appeared or is forthcoming in Analog, Asimov's, and Beneath Ceaseless Skies, among others."}