{"fingerprint": "VeydUIzUlUuGqPHsAN7PQoAmqGU=", "sitename": "Clarkesworld Magazine", "title": "Hugo Season by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_05_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Hugo Season by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Hugo Season\n It’s hard to believe that it’s Hugo Award season once again. I am very proud to say that we’ve been nominated for Best Semiprozine again this year. I’d like to thank everyone who voted for us and hope that we continue to earn your support. It’s a huge honor and I’m looking forward to attending the ceremony this year, particularly after having to miss last year’s.\n I’m very pleased to see several friends and Clarkesworld veterans on the 2011 ballot, but none pleases me more that the success Peter Watts has had with “The Things” from our January 2010 issue. In addition to a Hugo nomination for Best Short Story, “The Things” has also wracked up the following honors:\n \n 2010 Finalist: Parsec Award for Best Speculative Fiction Story (Short Form) as read by Kate Baker\n 2010 Nominee: BSFA Award for Best Short Fiction\n 2010 Nominee: Shirley Jackson Award for Short Fiction\n \n and has been selected to appear in the following year’s best anthologies:\n \n The Year’s Best Science Fiction: Twenty-Eighth Annual Collection, Gardner Dozois ed.\n The Best Science Fiction and Fantasy of the Year: Volume 5, Jonathan Strahan ed.\n The Year’s Best Science Fiction and Fantasy, 2011 Edition, Rich Horton ed.\n The Year’s Best Dark Fantasy and Horror, 2011 Edition, Paula Guran ed.\n The Year’s Top Ten Tales of Science Fiction 3, Allan Kaster ed.\n \n In celebration of Peter’s success, we dropped the price on the ebook edition featuring his story to 99 cents. Copies are available at the through the following retailers:\n \n Amazon (mobi/kindle formats)\n B&N (epub format)\n Wyrm Publishing - Direct from us (epub, mobi/kindle)\n Wizard’s Tower\n Weightless Books\n \n Ebooks have become an increasingly important source of revenue for Clarkesworld. Leveraging free content against multiple revenue streams like advertising, affiliate programs and donations alone in these tougher economic times is a challenge. Ebooks are filling the gap and offer us an opportunity to expand our readership at the same time. It’s an exciting time to be publishing a magazine and I’m working on another editorial that will further expand on this topic.\n One of the magazines that I see making excellent use of the ebook model to supplement traditional publishing is Asimov’s. While I’m talking about the Hugos, I would be remiss if I didn’t point out the five different nominations for fiction they picked up this year and editor Sheila Williams’ nomination for Best Editor Short Form. It’s hard to believe she’s never won a Hugo for her work, but with the showing they’ve had this year, this could be her year.\n On the “not a Hugo” side of the fence, we have the John W. Campbell Award for Best New Writer. Once again, it’s a very talented ballot of writers and by total coincidence, one of them, Lauren Beukes, is interviewed in this issue. Since the time of our interview, Lauren also received the Arthur C. Clarke Award for her novel, Zoo City, so congratulations are in order.\n Best of luck to all of this year’s nominees and don’t forget, if you are attending Worldcon in Reno this year, you can and should vote.\n PS. It looks like Clarkesworld has the honor of being the publication with the most Hugo nominees currently banned from entering the United States. Peter Watts and non-fiction editor Cheryl Morgan are both currently “locked out.” I find this very disturbing and ultimately depressing. Hmmm . . . Isn’t our President supposedly a science fiction fan?\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}