{"fingerprint": "4d37zJnAlot9MDzVJBKbHLucggo=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Stress Relief by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_05_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Stress Relief by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Stress Relief\n One of the things I do to get some downtime is play video games and for almost two years I have spent a lot of time playing Bungie’s Destiny on the Xbox One with Sean and Kate. The game’s latest update came out last month and it was particularly well-timed. We’ve spent a lot of hours trying out the new features and fighting our way towards higher light levels. As we battle aliens, rescue Russian AIs, and run over one another with sparrows—they are like the speeder bikes in Return of the Jedi—we often talk about Clarkesworld stuff. Even when I’m trying to relax, this place comes with me . . . that’s not a complaint, though!\n We’ve had all sorts of things to talk about last month:\n \n 2015 BSFA Award for Best Short Story went to “Three Cups of Grief, By Starlight” by Aliette de Bodard (Clarkesworld #100, January 2015)\n The 2015 Theodore A. Sturgeon Memorial Award Finalists were announced and included, “The Three Resurrections of Jessica Churchill” by Kelly Robson (Clarkesworld #101, February 2015)\n The Nebula Award Weekend is this month—Kate and I will be there—and three Clarkesworld stories are in the running for Best Short Story: “Cat Pictures Please” by Naomi Kritzer (Clarkesworld #100, January 2015), “When Your Child Strays From God” by Sam J. Miller (Clarkesworld #106, July 2015), “Today I Am Paul” by Martin L. Shoemaker (Clarkesworld #107, August 2015)\n Disney: pro, con, or cruise?\n How a Destiny anthology is becoming a mini dream project\n And my stressing out over editing the Nebula Award issue of The SFWA Bulletin.\n \n We also spent a lot of time talking about the Hugo Awards. That said, I have no desire to fuel the fires of controversy that once again swirl around the process and some of the nominees. I’ve seen more than enough to last me. However I do want to say that I’m thrilled to be a finalist for Best Editor Short Form for the fourth time. It means a lot to me that I accomplished this without the real or imagined assistance of a special list or slate. It leaves me with no doubt that my readers put me on this ballot for nothing more than the work I’ve done here and at Forever Magazine. And for that, and your nomination, I thank you. I am proud to represent the stories we published last year.\n A special thank you also goes to Bungie for providing me with a valuable stress-relieving tool. It’s been particularly handy this month, as perhaps my kill volume and 335 light level can readily attest to.\n So, do any of you play?\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}