{"fingerprint": "SwdTksaU/3J+4y7Uxgb+e+FHpN8=", "sitename": "Clarkesworld Magazine", "title": "Editors Desk: The Sad Truth About Short Fiction Reviews by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_09_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editors Desk: The Sad Truth About Short Fiction Reviews by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The Sad Truth About Short Fiction Reviews\n I’m often asked why we don’t have a review column in Clarkesworld, particularly one with a focus on short fiction. The answer has always flowed pretty quickly: “There’s no shortage of people writing reviews. I’d rather dedicate our time and effort towards something else.” What I don’t say is that with rare exception, they don’t have much value.\n The sad truth about short fiction reviews is that the overwhelming majority of them have little-to-no impact on readership. After monitoring the incoming traffic for the online version of this magazine for nine years, I can say that the typical review has a statistically insignificant impact on the readership of a story or issue. The only notable exception to this has been reviews on high traffic sites, like io9 or Tor.com, that focus specifically on a single story. As the number of stories in a review increases, there’s a dramatic drop-off in story readership.\n “Oh, but that’s not the purpose of a review.” Yes, reviews have many purposes and sometimes their impact on readership can be secondary. For example, a good review in Locus may indicate good chances at being on their recommended reading list. That might have an influence on other award nominations as well. If a story happens to make one of those ballots, it definitely has an impact, but that’s a very small percentage of the stories reviewed in a year.\n Shouldn’t reviews of good stories have the effect of encouraging people to read the story? At this point, the average variation on “you should read this” with a link on Twitter is significantly more effective than the majority of reviews.\n Could it be that most people are looking for “read this,” rather than “here’s a bunch of stories I read?” It’s beginning to feel like that’s the case. Are reviewers trying to cover too much territory in their reviews and thus diluting their influence?\n As an aside, there’s one more place reviews have an impact: Amazon. Yes, it’s disconnected from this editorial’s comments on online readership, but it’s pretty clear that Amazon reviews have a significant impact on the sales of print and digital books and magazines. Buying a book after looking at the reviews is not all that unlike following a link to (or Googling) an online story after reading it’s review. It’s timely and influencial.\n The last decade has been a time of significant change for publishing and perhaps even moreso for short fiction. There’s no shortage of outlets for short fiction. Very few of us have the time to read all of it, so having help finding the best stories is more important than ever. In some ways the same can be said of reviews. There’s no shortage. Perhaps that’s hurting their influence?\n Social media levels the playing field and allows everyone to help fill the gap. The Twitter mentions and Amazon reviews are still largely the domain of the regular reader and even now, we need more people, reviewer and reader alike, adding their valuable perspectives. If we want short fiction reviews to have influence again, we have to work together on it . . . and go where the readers are.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}