{"fingerprint": "paavfEGk17DjTnnN1woffW3wDds=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: And into Year Fourteen We Go by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_10_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: And into Year Fourteen We Go by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: And into Year Fourteen We Go\nOctober marks our thirteenth anniversary! To celebrate, we have a larger-than-normal issue this month, highlighted in part by a novella and an extra translation. Both works were made possible by a grant from LTI Korea. That funding has allowed us to substitute original Korean translations in place of nine reprints in our 2019 schedule. We’re two-thirds of the way through completing that grant and it’s been a nice addition to this year’s line-up. I’m hoping to continue to do things like this in the future, but naturally, that can only happen with additional funding through grants or increased reader support.\nAs we embark on our fourteenth year of publishing, I’m happy to report that we’ve made some progress on our backlog of annual anthologies. Clarkesworld Year Ten: Volumes 1 & 2 will be published this month, followed by Clarkesworld Year Eleven: Volumes 1 & 2 in November. That leaves the Year Twelve and Thirteen sets on the table. I had hoped to complete Year Twelve before the end of the year, but between my travel schedule and work on the Best Science Fiction of the Year: Volume 5, I thought it best to pace myself. Both are currently scheduled for the first half of 2020. At that point, we’ll be caught up for the first time in over a decade. I’m looking forward to that day.\nIt’s always bugged me that those books were constantly behind schedule. The stories are edited, the files are in hand, so what gives? Well, it’s entirely on me. Some of it is just being too busy, but the big obstacle is writing the introductions. It’s not like they are complicated or an in-depth analysis or something, but I freeze up every time I sit down to do them. It became worse for me when the stories would no longer fit in a single book and had to be split in two, doubling the number I’d have to write. Sometimes a six-month window isn’t particularly interesting, so what to write? Recently, I’ve started making more notes throughout the year, a habit I developed working on the Best Science Fiction of the Year annual summaries. That might help, but I figure someone out there might have some thoughts on the matter. What would you like to see in those introductions? Or is short and sweet the way to go?\nSo aside from anthologies, what does year fourteen hold in store for you? Well, more stories from home and abroad, of course. I have some plans in the works for updates to our website, perhaps holding some livestream Q&As, looking for ways to add value to our Patreon and Clarkesworld Citizen’s pages, and maybe even some workshops. You might have noticed that the Another Word column has been absent from several issues. We’re retooling some of the non-fiction side of the house. It could be that we continue to run extra interviews, but if so, the idea there will be to push beyond just covering authors and doing more with artists, musicians, and other people connected with or influenced by science fiction. You’ll probably see us doing some of that while we look through our other options.\nWe also need to do some work on our marketing and addressing some of those financial issues I’ve brought up in previous editorials. We’ll be looking at ways of bringing in new readers, how to increase the supporting rate among those who already read the magazine, and evaluating our current subscription and per-issue rates. All are necessary if we want to start improving the rate of pay for the staff here and compensating us adequately for our time. It’s not the stuff that will make you ooh and ahh, but it will make sure that we can continue doing this for another decade and more. I’d like to think you’re at least on-board with that.\nOn behalf of everyone at Clarkesworld, thanks for your time, attention, and support over the last thirteen years. It’s been a wonderful experience and a pleasure having you with us!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}