{"fingerprint": "4+9mVHTBu9RhntRPRVLyc/41PhE=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Your 9AM Wakeup Call by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_11_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Your 9AM Wakeup Call by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Your 9AM Wakeup Call\nFor almost seven years now, I’ve been living with a mechanical friend who lives in my chest and monitors my heart for any abnormal activity and who is prepared to zap me if necessary. Boxy, as my kids dubbed it, while reassuring, is a single-minded cyborg enhancement. When it was first discussed, I had asked the doctors to include a USB port and headphone jack, but apparently my mods were being installed by people who had medical ethics. When I mentioned this to the tech who ran the post-op diagnostics, she laughed and told me the device had a built-in speaker. Despite the intense pain, I chuckled, thinking she was playing along. A second later, beeping noises began to emanate from within my chest.\n“That’s the warning tone. If you hear that, call us immediately.”\nBoxy apparently has more than one tone that they didn’t tell me about. A few weeks after surgery, I discovered the tone used to inform me that I’m too close to a magnetic field, placing both of us at risk. Then, at my most recent diagnostic session, they warned me about another alarm that will activate soon. Apparently, I’m about to face the classic cyborg low-battery problem. Any day now, it could start blasting a British police siren sound for one minute at 9AM EST every day until I return to the factory/hospital. There’s still plenty of charge, should I need it, but they don’t want to take any chances. I can appreciate that and I suppose I really should look out for Boxy as much as they have looked out for me.\nStill, I can’t help but look at this technology and feel like they could make some improvements when it comes to the tones. Boxy should be capable of something more. I can almost hear my doctors talking now, “Oh no, the science fiction guy is back.” If you want to annoy me into going back to the hospital for a battery replacement why stop at an alarm? I’d probably just smack my chest looking for the snooze button. Why not raise my incentive by giving Boxy an annoying personality and voice? Have them taunt me with bad puns and jokes about their impending demise and diminishing reserves. Every day, make the situation more desperate and dire. Pleading, if it becomes necessary. If I go near a magnetic field, have it complain to me sarcastically about how stupid I was to do so and if I don’t listen, escalate it to painful screams. If I don’t back away, I’m sure those around me will see to it that I do.\nUltimately, I know this is just the story-oriented part of my brain trying to distract me from the impending battery-replacement surgery. It’s routine surgery done on a daily basis, but this time it’s me on the table and I’m bad enough having my blood drawn. I know I’m living a tiny bit of a science fictional life as a cyborg, so it’s only natural that my brain would drift towards an even more fictional approach. It’s probably not the weirdest defense mechanism my doctors will have encountered. Maybe I’ll have them tell me some stories.\nFor now, however, I will continue the daily vigil, waiting for Boxy to tell me: “Call the hospital. It’s time.”\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}