{"fingerprint": "OnejNN7uWqG8eQpDg0XMDHY/KPY=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Next Chapter Begins by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_02_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Next Chapter Begins by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The Next Chapter Begins\n For twenty-eight years, I’ve worked in higher education and K-12 as a technology professional. It was a career I loved, but over time, the profession and in particular, the institutional approach to the profession, has made it a less pleasant place to be. Almost five years ago, after my heart attack, I realized that my passion for it had faded, so I began making plans to jump ship.\n The last six months have been difficult. I have had some nice milestones in there—turning fifty and Clarkesworld celebrating its tenth anniversary—but it was all overshadowed by events at my day job. I won’t go into specifics, but by Christmas, six people—representing over one hundred combined years of institutional knowledge—resigned. The harm being done to my fellow colleagues and a department that was the legacy of a dear friend became too much for me, so I used a few vacation days before the holidays to get more time to distance myself from the situation and recover.\n My mood brightened as I used the vacation to catch up on Clarkesworld and other editing-related tasks. Then, as if the universe was trying to tell me something, Lisa found a new job. The plan all along had been that when Lisa went back to work, we’d both work for a while and then I would resign. After some discussion about healthcare—we’ll have to be on the ACA—and having someone here when the kids come home school, we decided that I should resign now.\n The day this issue is published will be my first day as a full-time editor, which isn’t to say I’ve reached the point where I’m making a full-time salary. That’s going to take time, which I finally have. The first order of business is to close the salary gap between Lisa’s job and my old one and to cover the cost of our new health plan. I’ve agreed to do some consulting and knowledge transfer sessions with my former employer, so that should help create a bit more of a buffer before our savings account has to come into play.\n As for the impact all this new-found time and energy will have on Clarkesworld, give me a couple of months to work that out. I still have some backlogged tasks that need to be completed and then I can start hammering out a long-range plan. In the meantime, each new subscription, Patreon supporter, or advertiser takes a little bit of the financial pressure away, so this will be one of my immediate areas of focus.The other will probably be targeting more anthology projects, both original and new, including catching up on the remaining Clarkesworld annuals. I’ll probably take on a few more ebook clients as well.\n If you are already a subscriber or supporter, thank you. You’ve made this leap possible. If you aren’t a subscriber, there’s no better time than now. I know money is tight for many of our readers and listeners, so if you can’t afford to, you can always help by amplifying the calls for new subscribers/supporters on social media or perhaps adding a review on one of the many sites that sell our digital subscriptions—you’d be really surprised by how much of an impact that sometimes makes.\n And while part of me will miss my old career, I’m eager to get started on this new chapter in my life and look forward to the new opportunities it presents. Now, back to work . . . !\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}