{"fingerprint": "VxdDL+ex8BIGkBbH0hxxlQMNCXg=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Supporting our Favorites by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_04_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Supporting our Favorites by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Supporting our Favorites\nThe nomination period for the Hugo Awards came to a close at the end of March. As has become tradition in recent years, many fans and professionals took to blogs and social media to either direct attention to their eligible works, make a case for their favorites, or remind you to vote. Yes, I am among those guilty of doing so.\nWe at Clarkesworld have been fortunate enough to win three Hugo Awards and I’ve been nominated twice for Best Editor Short Form. Last year’s nominations and win were a very personal victory after a year highlighted by a heart attack and other medical issues. I can't possibly describe how much the show of support meant to me and I continue to hope the authors, artists and editors behind all of my favorite works are similarly celebrated someday. Unfortunately, that isn’t likely. There will always be someone or something that you fell should have been recognized, but wasn’t. It’s the nature of awards.\nThat’s where my mind went as I selected my nominations. In several cases, I agonized over who would get my top five votes. It simply wasn’t possible to nominate everyone I thought deserved recognition. And yes, sometimes there isn't even a category (like anthology or magazine) to provide an opportunity to draw attention to a worthy project, but that’s a discussion for another day.\nI’m not sure why it took me so long to realize that I already have a reasonable way to recognize everyone I want to, even those without a category. It’s even something that will help sales of their work, which sadly, isn’t always true of awards. I’m a bit embarrassed, because it’s an alternative I’ve suggested to people who wanted to support Clarkesworld: writing reviews at Amazon, Apple, B&N, etc. Your reviews of us have proved to me that they have value.\nThere are people for which this activity comes naturally. They can write up paragraphs and paragraphs about any book or story they have read. Fearless, they toss their words into the ether for all to see. Then there are people like me. I agonize over every word and have trouble clicking that save button. I think those of us in my group have been making things too difficult for ourselves. Why shouldn’t we be satisfied writing “I read a lot of anthologies and this was the best one I read in 2013” and leaving it at that?\nShort and sweet reviews have their value. They open the door to discussion and give weight to the reviews of our more eloquent friends. They boost the profile of the author and their work, and when these reviews are on retailers’ site (Amazon, Apple, B&N, etc.), they have an actual impact on sales. Even adding to a pile of tens, hundreds, thousands, or more reviews has value because it isn’t just about quantity, but also how recently they’ve been reviewed.\nI know why I haven’t been following my own advice. I was physically and verbally bullied as a child. I was also mocked for my taste in music and books for many years. We put up walls to protect ourselves and mine keep a lot of stuff private. I like to think that I’m doing much better these days. I blog, have a decent social media presence, participate on panels of give talks, but that’s pretty much a construct I call “Work Neil” or “Con Neil.” I’m never entirely relaxed, except among family or a handful of friends.\nSince the heart attack, I've tried to take more of a “life is too short” attitude towards things. I’m forty-seven. I think it’s long past time to get over this particular ingrained fear from my childhood. (It was either this one or fear of needles, which is a bit more complicated and painful.) Besides, this has the added benefit of helping people I respect.\nThis month, I will start posting reviews. I will take baby steps, starting with one-sentence reviews and working my way towards a whole paragraph. Since I want them to have successful careers where they actually make a living from their work (hey, it’s my goal, so I should be supporting others in their efforts to do the same), I will emphasize reviewing on retail sites over my own blog. I might even be brave enough to post something on Goodreads.\nSo, who will join me on this adventure?\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}