{"fingerprint": "a5bKKdU68nd1IuHT6OdkBfK+sIM=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Seven and Counting by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_10_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Seven and Counting by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Seven and Counting\nThis issue marks the seventh anniversary of Clarkesworld Magazine. When we began publishing Clarkesworld in 2006, we started small—publishing two stories (each under four thousand words long) and a cover in each issue. Over the years we’ve gradually expanded, offering non-fiction, additional original stories, and most recently, reprints. We owe a debt of gratitude to the many people who supported us along the way and made our growth and continued existence possible. Quite a bit of credit goes to our staff, and, certainly to the authors and artists that entrusted us with their work. We also count on the various vendors that provide web and distribution services. Most of all we are thankful to our many readers, subscribers, and donors who make this all possible. Thank you all.\nThis month we’ll be increasing the number of devices that Clarkesworld subscriptions are available on. We’ve partnered with Maz Digital to produce apps for the iPad, iPhone and Android devices. That means Clarkesworld will be available through the Apple and Google Play newsstands. This project has been in the works for months, so it’s very satisfying to see it come to fruition. One of the more exciting things about this project is that we can work the podcasts into these editions. As the audio versions of stories become available, play buttons will activate within the issue!\nSpeaking of the podcast, this is also Kate Baker’s fourth anniversary as Podcast Director. I have to go on record as saying that bringing Kate on-board was probably the smartest hire I’ve made in my life. Under her supervision, the podcast has developed a loyal (and growing) following. She is the voice of Clarkesworld and never ceases to impress me with the level of professionalism and sheer talent that she brings to each episode. If you’ve never listened to one of our podcasts, do yourself a favor and try one. I was particularly impressed by her recent episode with Jim Kelly, where the two of them teamed up to read “The Promise of Space” from our September issue. It would make a great place to start. The live reading they did at Worldcon moved the audience to tears.\nOh, and Worldcon! I have to at least talk briefly about that. I think that was most fun I’ve had at a convention in ages. It was great meeting and chatting with so many of our readers. It was also uplifting to know so many people were pulling for us in the Hugos this year. (I’m looking at you, mystery people who yelled from the back of packed elevators, as they stopped and passed our floor.) As to the Hugos, to win the award for Best Semiprozine after everything that happened in 2012, (heart attack, kidney stones, losing my day job, hurricane, etc.), well, there aren’t words to describe it. I was simply overwhelmed and to be able to accept the award with Sean, Kate and Jason up there beside me . . . it just doesn’t get better. We will endeavor to live up to the honor.\nLeft to right: Neil Clarke, Sean Wallace, Jason Heller, Kate Baker.\nPhoto by James J. Seals.\nThe Chesley Award Ceremony was also held at Worldcon and I was invited to hand out the award for Best Magazine Cover. Three of the six nominees were from Clarkesworld: Ken Barthelmey, Julie Dillon, and Martin Faragasso. The ASFA (Association of Science Fiction & Fantasy Artists) members awarded the Chesley to Ken for his November 2012 cover! This is the second time a Clarkesworld cover has been so honored. Congratulations, Ken! Here’s his winning cover:\nIn addition to our new subscription tools, we have more improvements coming in the year ahead. The next item on the to-do list is the addition of the fourth original story, which will happen when we reach our next subscription milestone. After that, I’m hoping to add an art feature to our non-fiction offerings. I’ve been consulting with some of our artists to help shape that one. And of course, there is another secret project. Sorry, can't talk about that one until contracts are signed.\nThe long-term goal remains to make this my full-time job, which probably isn’t as interesting to you as it is to me, but it will provide me time to dedicate to further improvements. There is only so far nights and weekends can take you. Later this month, Sean, Kate, and I will get together at Capclave, where I hope we’ll have time to do some brainstorming about our future. If you were there, what would you toss on the table?\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}