{"fingerprint": "drn5raI40pBaNQVi1pR6ZzZeyCk=", "sitename": "Clarkesworld Magazine", "title": "A Rocket to Clarkesworld and Other Tales by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_10_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Rocket to Clarkesworld and Other Tales by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nA Rocket to Clarkesworld and Other Tales\nLast month, Clarkesworld Magazine won the Hugo Award for Best Semiprozine. Like many people, I had to watch the Hugo ceremony from the comfort of my home. Worldcon was in Australia this year, and while I would have loved to have been there, my day job and the sheer expense of traveling halfway around the world kept me home. The time difference meant having to get up at 6AM on a weekend, sneaking downstairs and trying, in vain, to keep from waking my family when I eventually heard that we had won. The rest is a blur. Cheryl was there to accept and read a speech I emailed her the day before. Emails and IMs started pouring in... and I was stunned. Sadly, neither of our nominated short stories took home a win, but that doesn't stop me from being damn proud of both.\nThrough all of this, Sean was silent. His AIM account was logged in, but inactive. No comments. No cheers. No snark. A few hours later, I found out that he slept through the whole thing. He didn't even believe me when I told him that we had won. It took a link from the Hugo Awards website to prove it.\nAll of us here at Clarkesworld are very honored to have received this award and I can't even begin to say how much it means to me. The silver rocket hasn't landed at my house yet (the pictures are of Cheryl's award), but knowing that I'll have one soon is very cool. This is something my science fiction idols and gods of my youth have on their shelves. Ok, so they received them in other categories, but wow... the kid in me is bouncing all over the place. Seriously, I'm going to be riding this high for some time.\nOf course, none of this could have happened without the excellent team of people that work with me, the authors and artists that entrust their work to us and our readers, who make this all worthwhile. Thank you!\nWinning a Hugo wasn't the biggest thing that happened to Sean Wallace in September. Not long after the Hugos, Sean's wife, Jennifer, gave birth to twin girls. Cordelia Anne and Natalie Rose are now home doing what babies do best: making parents happy and keeping them awake. As a father myself, I couldn't be happier for them. Kids have a way of changing everything, typically for the better. A gain for Sean, however, is resulting in a loss for us. It is with great sadness that I must announce that Sean will be stepping down as editor after issue 50. Sean is a founding editor at Clarkesworld and his presence will be missed. Of course, he has the best of reasons and I can be nothing but happy for him. Just look at those faces and tell me he made the wrong decision.\nAs Sean prepares to leave, Jeremy L. C. Jones and Daniel Robichaud join the staff. For some time now, we've been working with Jeremy as a freelance interviewer. I should have added him to the staff a long time ago and have now corrected that oversight. He has some great ideas and I look forward to working with him on them. Daniel just recently finished his trial by fire and become an official member of our slush team. One of this month's stories is something he passed up to me, so he's off to a great start.\nAfter nearly a year, ebook back issues of Clarkesworld are finally available in Barnes & Noble. Unfortunately, we haven't been able to make any progress in offering ebook subscriptions at Amazon, B&N or Apple, but we'll keep trying to get an answer from them. For now, you can buy individual ebook issues and volumes of Realms at B&N, Amazon and directly from us. I have a little over half our back catalog converted and hope to have every issue available sometime in earlier 2011.\nOne thing that is important to me is that Clarkesworld continue to grow. Naturally, any additional content increases our budget and I've been considering supplementing our ebook sales, book sales and our citizenship program with advertising opportunities. For four years, I've kept this magazine relatively ad-free. In fact, until now, all our advertising has been for books I publish. I have a very specific aesthetic in mind for Clarkesworld, so it's going to be a challenge to find a balance I can live with, but, if a small alteration allows us to increase the number of stories we publish, add new features or do more with art and podcasting, it could be quite worthwhile. The one constant here is change. It keeps things fun and in doing so, we hope to live up to the standard of the bright shiny rocket that people saw fit to award us this year.\nWhat do you think? Would increasing our fiction content be worth including a few extra ads on the site? Is there something else that we should consider adding or a current feature that should be expanded? What about adding art and music columns or non-fiction episodes to our podcasts? Here's your chance. Tell us what you want!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}