{"fingerprint": "XLNvr1HOh3gR+OPEltbAOYbk+LM=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: No Solicitations by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_08_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: No Solicitations by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: No Solicitations\n A month doesn’t pass where I don’t field a question or see a comment about whether or not magazines, Clarkesworld included, are welcoming to new authors. A lot of this stems from a belief that magazines prioritize “name” authors over newcomers in the submissions process. Of major concern is the practice of solicited submissions, works commissioned from authors by publishers with a guarantee of publication.\n Clarkesworld does not solicit submissions. We have encouraged authors to submit—particularly if we’re fond of their work and meeting them in person—but they are never given any advantage over other submitted works. I’ve also encouraged writers from other parts of the world to submit their work, simply because that’s been necessary to break their perception that the US market is not open to them. Gathering and reviewing submissions is part of the job and I want it to be as open as possible. I believe in casting the widest net to find the best stories we can. Hence, no solicitation or backroom dealing, even with authors we’ve previously published.\n Soliciting stories doesn’t guarantee you’ll get the best work. The authors typically solicited are certainly capable, but it’s a gamble. So why do editors take that approach? Well, actually, it’s much more common to encounter the practice in anthologies than magazines. Magazines tend to be reliant on subscriptions as a revenue source. Unlike a preorder for a book, subscribers have no idea who the magazine will be publishing. It has more to do with their faith in the editor and the body of work they’ve previously selected. That reputation and trust also extends to writers, who, in turn, want to be published in those magazines. This is why you still see some name authors in publications that don’t solicit works.\n That said, not every magazine or short fiction outlet operates in the same way, so you will occasionally find some variety in attitudes towards using solicitation as a tool. Tor.com, for example, doesn’t take submissions or offer subscriptions. They are part of a much bigger publishing enterprise that benefits from its existence, primarily as marketing. Some, like Future Science Fiction, occasionally solicit to fill gaps left in the makeup of their open submissions, in this case, translations. Uncanny and others have solicited some stories to use in the marketing of the annual Kickstarter campaigns. New magazines sometimes start by soliciting stories to highlight the type of work they want to be publishing. (We did this way back at the dawn of the magazine.) It’s a useful tool to highlight the kind of work you want to publish, much like the back catalog is later in a publication’s life.\n Each serves a purpose, but these examples are still the exception, not the norm. The overwhelming majority of magazines don’t solicit fiction and even when you look at those that do, it’s only a few that don’t accept any from open submissions.\n Much like the Kickstarter example, anthologies are a one-and-done sort of project. This changes the equation significantly. Where a magazine may only see a short-term benefit from a name author, an anthology doesn’t have to look to the future. It’s all about selling that one book. If an author can attract a certain quantity of readers who might not have otherwise bought or heard about the book, they enhance the marketing opportunities for the project. Of course, they have to be a good fit for the project and when the editor is smart, they usually are.\n Whether there are any open submissions, however, is much more variable. It’s fairly unusual to find open-call anthologies at the bigger publishing houses, but the small press is still responsible for the majority of the anthologies published each year. They may not be as visible, but they’re still vital.\n It’s easy to see why there would be some frustration with the practice of soliciting stories, but it’s considerably less widespread than some corners of the Internet would have you believe. Yes, it does block some authors from a few higher profile opportunities. You should keep in mind, however, that the writers currently benefiting from solicitation suffered the same fate earlier in their careers. It didn’t hold them back and if anything, there are more opportunities for new authors now than most of them had. It’s not ideal, but there has been some progress. The real problem is that publishing has always had a supply-and-demand problem. If you take all the slots at markets publishing short fiction and all the works written the overlap is quite small. It’s a daunting situation for new authors and can be quite frustrating.\n All I can say to those people is: don’t give up. Publishing a new author is one of the greatest joys of being an editor and we’re always looking for new talent. Like other editors I know, please keep writing and submitting your work. Do not self-reject. I will say that the one thing I’ve seen in common among all the new writers we’ve published is that they kept submitting and improving. (I actually look back at previous submissions to make sure I didn’t screw up and reject an earlier work I shouldn’t have.) It’s rare to land your first (or second, or third, or . . .) submission and we’re not going to hold anything you’ve previously sent us against you. Clean slate. Every time.\n And if you are not a writer (congratulations on making it to the end of this editorial), make sure you’re subscribing to the markets you enjoy so they can keep finding you those new stories and authors!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}