{"fingerprint": "g8a1ogKlFl3QPdg53bxRf5p1s6c=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Return of the Reader's Poll by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_02_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Return of the Reader's Poll by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The Return of the Reader's Poll\n It’s time to pick your favorite Clarkesworld story and cover art from 2017 in our reader’s poll. This year, we’re doing it a bit differently and running it more like a traditional two-round genre award.\n Phase 1 - Nominations (completed)\n At the end of January, we opened and held the twenty-four hour flash nomination period to identify the top five candidates in each category: story and art. The announcement was sent out via Twitter, Facebook, Patreon, and my blog. The brevity of this phase was an experiment. In theory, it would create a sense of urgency and reduce the opportunities for a coordinated ballot-stuffing campaign. It worked. The nomination phase generated more responses than the majority of our full surveys from years past and a significant reduction in stuffing—though there were some very clumsy attempts to do so, of course.\n In any case, after tallying the votes, I’m pleased to announce this year’s finalists.\n Best Story\n \n “A Series of Steaks” by Vina Jie-Min Prasad (January)\n “Waiting Out the End of the World in Patty’s Place Cafe” by Naomi Kritzer (March)\n “An Account of the Sky Whales” by A Que (June)\n “The Secret Life of Bots” by Suzanne Palmer (September)\n “Who Won the Battle of Arsia Mons?” by Sue Burke (November)\n \n Best Cover Art\n \n Waste Pickers by Gabriel Bjork Stiernstrom (January)\n Jungle Deep by Sergei Sarichev (March)\n Sea Change by Matt Dixon (June)\n Homecoming 2 by Jonas De Ro (November)\n Eistibus, Angel of Divination by Peter Mohrbacher (December)\n \n Phase 2 - Final Voting (open now through 11:59pm EST, February 24, 2018)\n This month, you will pick the winners from the top five finalists. Everyone is welcome to participate regardless of whether or not they nominated in Phase 1, though.\n Voting is open now at:\n Thank you for participating. The winners will be announced in our March issue!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}