{"fingerprint": "9PqOiwNeDMlfCpqYF9Y36NgGlOY=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: A Celebration of Many Things by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Celebration of Many Things by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: A Celebration of Many Things\n Our annual Reader’s Poll came to a close last month as six finalists for our best cover and story of 2018 competed against one another in a second round of voting. Each and every one of these works would have been a worthy winner.\n Finalists for Best Story\n \n “Dandelion” by Elly Bangs (September)\n “The Anchorite Wakes” by R.S.A. Garcia (August)\n “Umbernight” by Carolyn Ives Gilman (February)\n “When We Were Starless” by Simone Heller (October)\n “Octo-Heist in Progress” by Rich Larson (November)\n “Sour Milk Girls” by Erin Roberts (January)\n \n Finalists for Best Cover Art\n \n “Islamic Universe 2” by Luis Carlos Barragán (July)\n “Belt 71” by Pascal Blanché (December)\n “New Life” by Helen Ilnytska (November)\n “The Storkfriars” by Sean Murray (June)\n “Postcards from Asia: The Floodplain” by Pat Presley (October)\n “Vukileyo!” by Artur Sadlos (January)\n \n Our 2018 winners are:\n and\n Congratulations to Simone, Sean, and all our finalists!\n Last month was also the Kickstarter campaign for Xia Jia’s first English language collection. I am pleased to announce that not only will Clarkesworld Books be publishing A Summer Beyond Your Reach: Stories by Xia Jia, but it also unlocked three stretch goals:\n \n An original story by Xia Jia written specifically for her collection.\n An US edition of Touchable Unreality Volume One, a bilingual anthology I edited which has only previously been available in China.\n New Voices in Chinese Science Fiction, a mini-anthology featuring up-and-coming Chinese writers that have never been previously published in English.\n \n That last goal was originally supposed to be 25,000 words, but we’ve dedicated everything earned over the target of that stretch goal to making it even larger. I’m writing this editorial just ahead of the campaign closing, but it looks like it will be at least 36,000 words thanks to the amazing support we’ve received from so many backers.\n I have to say that I have been very pleasantly surprised by how well this campaign has gone. I wasn’t entirely sure how people would react to an imprint that would be entirely focused on translated works and I’ve been completely blown away by the results we’ve seen. Now the hard work of putting these three projects together begins, but it will be so worth it.\n In related news, in last month’s editorial I mentioned that the magazine has received a grant to publish more translations. I couldn’t go into details at the time, but just in case you haven’t seen the updates on my blog, the grant is from LTI Korea to publish nine Korean science fiction stories in our 2019 line-up. These stories will replace reprints in future issues and it’s entirely possible that this will connect to a 2020 Clarkesworld Books project.\n So one last thank you for supporting our authors with your votes, by backing the campaign, and your subscriptions too (how else would we pay them for all those amazing tales?) over the last year and into the future.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}