{"fingerprint": "DKhOroKzcwFGha0J8aSZZfog3sA=", "sitename": "Clarkesworld Magazine", "title": "To Catch All Sorts of Flying Things by M. L. Clark", "author": "M L Clark", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clark_09_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Catch All Sorts of Flying Things by M. L. Clark", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14660 words, novelette\nTo Catch All Sorts of Flying Things\n1\nIn the giant arachnid’s shadow, her silken face mask—Uranian-blue, luminescent, and vaguely human in countenance—was always a welcome focal point. With my first mate at my side, I spoke slowly in the direction of that glow to compensate for the wobble in my voice—a wobble for which the Spinners of Drasti Prime, for once, were not entirely responsible.\n“Kurrick, a terrible crime has been committed on your makers’ land.”\nTic-tic-tic-tic came the answering sound of her legs: four massive pairs shifting to the species’ private calculus. Kurrick’s servant-nest had served my colony since the Partnership’s first contact, two generations before I became security liaison, but I never could get her name right, with the right roll of the r’s and a full guttural component on the ick. Kurrick didn’t seem to mind, though. Spinners were patient. I suppose any biocomputer had to be.\n“Explain,” she said.\nI glanced at Jinx, whose orange-glossed lips hadn’t so much as twitched since the Spinner’s shadow fell over us. In my first mate’s visor I could still see a reflection of Kurrick’s mask, but we both knew what lay behind it: that gaping maw, those salivating mandibles, a wide array of bright-red eyes. I know, I know, so much for the Partnership’s anti-xenophobia training—but there wasn’t so much as a slug or feline sentient on our local crew, and the tug of primal human fear came easily when not routinely challenged. And then . . .\n“Genocide,” I replied, with a polite cough at the pungency of Kurrick’s breath: a sweet-sour mix of vinegar and recent-victim decomp. “You let the Obys lay down his egg, the last of his kind, in the honeycomb caves beyond our perimeter two moons ago—but someone’s just obliterated it, which is a crime for which . . . well, to be honest, the Partnership’s never seen a genocide so complete before. In the past, there’s always been survivors to speak for their dead. So I need to know—do you even have laws for this sort of thing? If we find the perpetrator, did your makers leave any formal protocols we could enact against them?”\nTic-tic-tic-tic went her legs again: the joints visibly bending even under heavy robes.\nProbably, too, Kurrick’s calculations weren’t as loud as I thought—but I couldn’t help but listen for them, and not just because all my senses were tingling from the revelation of this murder. My first week on site, our team watched local Spinners spring high from nearby cliffs on those shrouded legs, shrieking in midair to further startle prey along the canyon floor. And sure, their prey was mostly insectoid—but some species not far enough from human-sized for my liking. Plenty big enough, too, that you could hear even from the summit when their exoskeletons split. After that incident, it hardly mattered that the Spinners wore masks spun after first contact, as per their makers’ ancient protocols for showing courtesy to guests. That shrieking . . . those blurs of shadow overhead . . . that crunch could never be unheard or unseen. Not for anyone on our harvest team, at least.\n“Atypical circumstance,” said Kurrick, at length. “Convention necessary.”\n“Convention?”\n“We must spin on this.”\nJinx and I exchanged glances in Kurrick’s steady shadow. Finally, a twitch of intrigue on her lips—followed by a resolute shake of her head. I allowed myself a second’s sulk, but she was right, of course; I’d never seen the tunnels either, where the Spinners housed the vast bulk of their species’ algorithmic outputs, but this was hardly the time to pry.\n“Understood,” I said. “But do we have permission to seek out the culprit beyond our borders, while you consider the legal consequences?”\nI thought I saw movement behind the blue mask’s holes—three in total, with a tear from age and constant use running from one of two eyes to the wide, shocked “O” of the mouth. (The shape of the first human’s, I’d wager, at first contact.) Jinx certainly jumped as if she’d seen eye movement behind them, too.\n“State your investment in such an action,” said Kurrick.\nI hesitated. It was easy to forget that the Spinners were, at heart, constructed beings—fusions of natural DNA with specific computational imperatives, capable of accepting inputs and processing them in-line with their ancient operator-gods’ first protocols. The Spinners also had names, after all, and personalities that revealed themselves the longer they walked among us—so where did the personal end and the purely mechanical begin? After two human generations on the planet, the Partnership still had no good answer—but then, we’d been busy setting up energy converters and farming operations. Adapting to the arrival of other foreign species. Taking the Spinners, more or less, for granted.\n“Well, ah . . . ” I tried to choose my inputs with care, wondering which half of Kurrick had really asked this question. “The Partnership has generally found the other arrivals here to be peaceful. The Feru. The Saludons. The Esh. The Obys, too, before he detached his egg sac and died. We wish to continue together on your world in that spirit, but I’m afraid we cannot until we’ve understood this latest tragedy and its causes.”\n“So you will . . . war with them . . . until you have made your determination of fault?”\nA misstep on my part: the perils of decisive language.\n“No, Kurrick. We will not war. But we will act in all future negotiations from a place of distrust more conducive to escalating violence, until we know who is safe again. Because the Obys’ egg was without defense, its destruction suggests a dishonorable party on the surface of your world. We seek to prevent that party from doing further harm.”\nTic-tic-tic-tic.\nDid Kurrick believe me? The pause felt much longer than reasonable, but in the end . . .\n“Acknowledged. You may proceed.”\nSo I should’ve felt relieved, I know. But after Kurrick scuttled off with the rest of her cluster, their bodies together blotting out the setting sun, I felt the squeeze of my first mate’s gloved hand on my shoulder and simply shuddered, then kicked up dirt.\n“Stars above, Jinx,” I ground out. “We just gave the Obys his death rites—”\n“Yeah, we did.”\n“—last red moon rising. Two moons ago, we heard him sing his egg survival songs!”\n“I know, love. I know.”\n“Two generations here and the only suspicious death was, what—”\n“The silo-keeper’s daughter.”\n“—the silo-keeper’s daughter, and even that was just—”\n“An accident.”\n“—a horrible accident in the end. Stars, Jinx, this is—it’s just—”\nShe touched her visor to mine. Gloved hand inching up my neck, that sweeter human stench rising in the Spinners’ wake. “I’m sure we’ll get the bastards,” she said.\n“Oh, you’re sure, are you?”\nAnd just like that, she stepped away—never one to tolerate trespass. Understandable: the edge in my tone also left me feeling cold and embarrassed. But then, perimeter patrol didn’t usually have us parsing the implications of smoldering wreckage, let alone the attendant grief and horror of having failed a death-oath to a friend maybe as old as the owners of this world had been gone. Who could break a promise to any such monolith of constancy?\nBefore I could amend things, though, Jinx nodded to the honeycomb caves, the brutish damage to one of their cells visible even from our border.\n“I’m sure of your stubbornness, Greysl,” she said. “For one.”\nAnd then she passed from the safety of our perimeter net to the territory beyond it—the uncolonized land of the Spinners’ makers, beings who’d built massive energy drives around the local sun before departing, leaving not even their name or record of their faces behind. Even the spider-servants left to mind their empire never called them more than the obvious.\nOur makers, the Spinners had told the Partnership’s first ambassadors. The Makers.\nI thought I heard Jinx say something else from beyond the net, but she only looked baffled at my sorry, I didn’t get that last bit once I’d caught up. Perhaps I’d misread the silence—but then, all sorts of things were known to flit about this planet’s wilder air. Surely some, like that of the eradicated Obys, were bound in time to take another form.\n“Oh for the love of—”\nHalf an hour on, while picking through the rubble of the thoroughly blasted honeycomb cell that had once contained the Obys’ egg, I laughed to see Jinx slip and fall while swatting at her leg, and land thigh-high in the cave’s gold-crimson dust. My laugh turned to a yelp, though, as I too felt the pinch of another of Drasti Prime’s native nanobots. In the shoulder, of all the nuisance places—and after all our success in dodging the first Chigger swarm to greet us when we came upon the remains of the Obys’ ill-fated nest.\nJinx pointed and laughed in turn—but then, you had to, didn’t you? Because there was no sure protection from these little rotters outside Partnership territory. None of the suit materials we’d yet tested guaranteed immunity from another of the ancient operator-gods’ major works of biotech: flea-like nanobots with automatic routines for seeding native genetic material into any non-native organisms they came across.\nSpinners giveth, Jinx liked to say, and Chiggers giveth too much. If their makers were still here, you gotta wonder if their giving would be the end of us!\nThe Obys had managed to ward them off during his dying stint here, but only thanks to the radioactive parasite deep within: killer of his species one lone star space-worm at a time. Talk about your silver linings, right? And even then, the moment he’d breathed his ragged last, a more aggressive decomp protocol kicked in among the local biotech. Our weary old friend was turned to mulch in minutes, his egg’s protection maintained only by an equally irradiated shell—not something the Partnership was entirely keen on emulating in our own suits’ design.\nOur human solution wasn’t bad, though. My alliance of species might be faulted for establishing a farming colony on such a dangerous world to begin with, but at least we had the tech to recover from Chigger bites—just, not beyond the perimeter net, where its use risked triggering a widespread adaptive response. If we got back to base before the transformation took full hold, though, all would be well, and since most of us wanted to return to being human after tasting life, say, as a giant millipede or six-winged beetle from the waist down, few ever pushed the genetic countdown.\nSo after we got the nervous laughter out of our systems, I stood and stretched and nodded at Jinx’s forearm touchpad, its display still active. “You got everything you need?”\n“Sure as hell hope so.” She switched her visor to full—another nervous tick; a futile effort to try to prevent what had already come to pass—and dusted herself off. For a breath, the stillness of the honeycombs seemed to swell between us. Difficult to imagine, wasn’t it? That an already fragile voice in the universe’s chorus, a species with but one egg through which to stage a full recovery, had been so violently silenced mere meters from where we stood. And only, what—three hours ago, maybe four?\nMy first mate cleared the air: “So what’re we wagering this time, that you’re the less human by the time we get back? I could go for a proper foot massage, I think.”\nAnother path to atonement for my earlier, brusque tone—and one I’d readily take her up on either way. But for now I thumped my chest with a baiting smirk.\n“Please. You and your theory that my genetic code’s easier to crack.”\nWe hopped together out of the crater formed by the impact blast. “47% last time,” she countered. “38% the time before. What can I say? Those little critters love you, and they’re getting better at their lovin’, too.”\n“You jealous?”\nJinx snorted as we fell into step beyond the ring of rubble. “Of what? You’ve always had an affinity for the tough cases.”\n“Oh, so Dirk’s just too tough for you, is that it?”\nNo, too far. And again I’d heard my misstep the moment I spoke. Nice one, old man.\nWith Jinx’s visor on full, I couldn’t see the usual shift in her features whenever I mentioned his difficulties, but it was there. I knew it was there. I could feel that careful, patient smile of hers forming as clearly as I did the crawl of transformation algorithms all up one shoulder to the neck, not far from where she’d set a reassuring hand on me less than an hour past. By the time we’d returned to base my smile would surely be arthropodal at the edges, while Jinx’s leg was already turning clawlike, maybe crustacean, and causing her to limp enough that she didn’t resist my offer of aid on the last stretch.\nStill, neither of us would ever be as easily consumed as the human waiting at the gate, and that, at its essence, was the crux of her judiciously quiet response: the sheer fact of Dirk—my second mate, colony medic, and undisputed champion of the internal wound.\n2\n“You realize, don’t you, that we lost another this week?”\nDirk fumed in the main lab while our regeneration treatment ran its course in the iso-chamber. You could tell his mood from the furious re-sanitizing of already-sanitized medical equipment. The relentless opening and shutting of storage lockers to check their contents against the med-bay manifest while he waited for our human parts to return in-full. But I didn’t comment. I wasn’t the sort to acknowledge tantrums, which was what this was, especially when something so much more devastating had just occurred on Drasti Prime—though I recognized, too, that this was also how Dirk processed his fears for me. And for Jinx, though all three of us knew his concern for her was less intense.\nBut even as Jinx employed tacit correctives with me, she took a more direct and redirecting approach to Dirk’s poorly-managed concern. There was less on the line, perhaps, when love in the deepest sense was not involved.\n“Hoover from the drill squad, right?” she said. “He became, what, a scorpion?”\nDirk looked up from his workstation, fleetingly animated by the taxonomical question, then remembering to scowl once he caught sight of us through the glass. The wayward twosome, One-Grey-Cell and Trouble, he liked to call us when scared of his own helplessness—which, from his post in med-bay while we patrolled the farm sites, was often, granted, but we were working on it. At least, the three of us had twice-lunar talks with a nice kid well-read in Partnership counseling protocol, and Dirk was taking solo sessions, too.\n“Scorpioid,” he corrected. “In the botanical sense. Hoover didn’t end up with just a tail unfurling like a flower—all his limbs do that now. He’s like a starfish, except with bones and a scuttle. And near the end, when he refused treatment, he got himself some religion, too. Said Chiggers offered gifts from their makers. Chances to be one with the ecosystem of this world.”\n“Not entirely wrong, though, was he?”\nI stifled a smile. Jinx spoke while studying her newly reformed leg with satisfaction—and relief, I’d learned the fun way, made her playful. Baiting, too. But Dirk only rolled his eyes.\n“They’re rogue algorithms, nothing more. Maybe leftovers from a terraforming project set up millennia ago—or maybe from a warehouse of lost species, like a living record of the dead, that opened after the ancients left. Either way, their tech is directionless now, but the Spinners’ll never consent to clearing them out. It’s just not in them to move past first protocols—so we’re left with the bio-debris of a vanished civilization . . . at least, until we stop indulging the whims of a leaderless, pseudo-sentient servant fleet.”\nI also ignored Dirk’s suggestion that the Partnership break some of its most fundamental rules for relations with non-allied species. With him, that sort of bluster was all smoke, no fire—unless you challenged him on it, and then he had a tendency to hold his ground just for the sake of saving face. Another item on our trio’s “needs-work” list.\n“That aimlessness, you know,” I said instead, “is probably why some of our people revere the Spinners’ makers as gods in the first place.” I nodded to Jinx, testing the flex of my rehumanized neckline. Much better. I did miss the sensory depth, though, of the exoskeletal hairs that had been growing there. “It’s weird as hell to me, but some of us need to believe there’s something deeper going on, so they’re always spinning theories about how ancient civilizations are secretly pulling the strings, just because they desperately want to believe that someone, somewhere, is orchestrating all of this—for better or for worse.”\n“Well, yeah,” added Jinx. “Because what’s the alternative? No grand journey. No epic purpose. Just random losses, setbacks, and decay. More hard evidence of nature’s indifference to anything even approximating ideal design, especially where sentience is concerned.”\nDirk, I knew, didn’t disagree—but neither did he reply all at once, and when he did he kept his head bowed, eyes hidden. Classic fear of vulnerability. Yeah . . . our group sessions were packed with works-in-progress, and I could tell that the restless heat of my current, angry grief over the Obys wasn’t going to help us reach the end of that list any time soon.\n“Hoover was a good man,” my second mate said at last. “Helped everyone around him without question, without complaint. Everyone liked him. Everyone always wanted to . . . ”\nDirk worked his jaw, unable to finish that sentence, but it clicked for me anyway: Hoover was a friend. And something pinched then, harder than the native nanotech, at all that human muck still lurking in my rib cage. Dirk never talked much about his own community here—or maybe I never asked. Too busy, lately, watching the Obys’ egg while on patrol. And look how much good that had done any of us, in the end.\n“Where is he now?”\nDid I sound gentle enough? Too gentle? Patronizing?\nDirk shrugged. “Creeping and crawling somewhere in the canyon. Happy, I hope.”\n“Oh ho! So maybe we’ll see him on our way to the Feru, eh?” I turned to Jinx through the glass in our pods, trying to keep the tone lively, but she just shot me the eye-roll equivalent of easy there, bucko.\nToo much?\nToo much.\n“I mean, that’d be the place to start, right?” I regrouped aloud. “Since they were the last to talk to the Obys before he passed?”\n“Agreed on the Feru, love, but there’s no ‘we’ about it.” Jinx yawned and rapped knuckles on the glass of her regeneration pod. Tac-tac-tac-tac. “I’ve still got data to crunch from scans of the debris. It was a pretty thorough hit, but who knows? With any luck, someone left their grubby fingerprints—or spore-prints—in the dust.”\n“Oh. Okay, fair enough.” I missed her company already, though, and made a mental note to tell her as much after I’d returned.\nOr maybe my tone conveyed the sentiment already, because at once her expression softened, and after studying me intently, she turned to Dirk with a greater generosity of spirit.\n“Hey . . . look, buddy,” she said, propping herself on an elbow in her regeneration pod. “You know the Chiggers aren’t psychologically manipulative, right? Hell, you’ve treated the junkies we sometimes get. You know they’re getting bitten just for the thrill of transformation, but that it’s never as glamourous as they think it’ll be, and eventually they all change back—because it’s not at all like gaining superpowers, is it? So if Hoover chose to ride that particular set of blueprints to its end, then . . . that wasn’t by force, you know? That was his choice, and he must’ve been happy with it. Or happier, at least.”\n“Yeah, but that’s just it . . . ”\nAnd Dirk looked up with such urgency then that I wanted to be on the other side of the iso-chamber; to press a hand to what I knew was probably the knot between his shoulder blades, the shudder held high in his back, as Jinx had been there for me with mine.\nAh, but there it was again—the messy problem of Dirk that made me such a sucker for him even in his lesser moods. It was a shame that Jinx and Dirk had never shown much interest in sharing a bed, because Jinx was way better at the whole reassurance gig—but since she’d first shot down the suggestion, telling me she tried to limit the number of fixer-uppers in her life, I was left to my fantasies of everything automatically being easier for all three of us if those two could only soothe each other, too.\n“I thought that Hoover was happy,” my second mate continued. “I mean, we all did, but I’m the bloody medic. So if I missed all the signals with him, then . . . then maybe . . . ”\nOh Dirk, you can’t be there for everyone, I wanted to say.\nBut that would’ve been some rich counsel, coming from someone still hot with the shame and fury over their own failure to keep a promise to the dead.\n“I didn’t realize that Hoover’s transformation had hit you so hard,” I said instead. “I’m sorry, love. I’ll be back soon. We can talk about it more then, if you’d like.”\nDirk threw up a hand in his classic no, it’s fine—I’m fine. Which meant it wasn’t, of course, but our regeneration pods were now flashing green and releasing us into the iso-chamber at large, so we all knew it was time for me to return to the field, to avenge the Obys if I could. You can keep a whole damned outpost running smoothly, Greysl, I could just hear our mission coordinator bark at me, but by god, man, would it kill you to set your own house in order, too?\nJinx and Dirk were decent friends, though, at least—so maybe their measured camaraderie would be enough to ease his grief until I returned. Only one last parting look from Jinx, joined with another reassuring squeeze as she bolted past me for the comp-lab, seemed to signal that I was missing something deeper. Something more.\n3\nThe canyon floor was thick with an afternoon mist that parted around every footfall, but held no sign of Hoover in his new form—or anything else, really, in the way of local fauna. Still, I surveyed every distant crevice and shadow through max-enhanced specs as I crossed from Partnership territory into the outskirts of the Feru. Not just Feru territory, but the Feru itself, its fungal fronds extending to the absolute limit of claimed land, while its more intricate components dug into and exulted in the richness of the planet’s soil.\nI tried not to envy the Feru its efficiency, but up close the emotion proved as difficult to suppress as primal dread around the Spinners. Though all the planet was home to raw ores, minerals, and other pertinent deposits, the Spinners only permitted foreign extraction in one sector, where representatives for four major alliances tried to harvest as much as they could from Drasti Prime’s microbial engine: an energy source that simple specimen-transfer could not yet replicate off-world. And yet, against the brute force of Saludon laborers and Partnership machinery, the Feru and the nebulous Esh made extraction look like child’s play . . . which invariably reminded me of how many worker deaths might’ve been spared on our end, at the outset of our efforts here, if either species had subcontracted with the Partnership instead.\nThe presence of a local Spinner cluster, at least, made for decent distraction from the added grief of such thoughts. The Partnership knew of five face mask variants in total, each spun on a new species’ first contact with the Spinners, and never replaced thereafter. Plenty speculated that the fifth might have been for the ancient operator-gods—and good for them, I guess . . . but I preferred to study the other three whenever the opportunity came along. The behavioral psychology wound up in each relationship for which they stood.\nThe face masks for the Feru’s servants, for instance, looked like spore bundles: a sign of how little the Feru must have valued their presence on first contact. When the Feru wanted to speak to an entity of interest, it did so by entwining numerous protrusions into a body sized to match its guest—unless seeking to intimidate, in which case it made itself far larger; or bored, in which case it dispersed into a field of unresponsive stalks. So did the Spinners have egos? Could their egos be wounded by realizing their unimportance to the Feru?\nBut also—no wonder, then, that the Obys had befriended the Feru with such intensity in his last days on Drasti Prime (wounding my own ego, a touch, in the process). By that late hour, heavy with the radioactive ailment that had already taken all his distant cousins in the stars, he’d been alone among his kind, and so spoke for a whole people. What better company than another monolithic species that did the same?\nAs I entered its domain, the Feru rose up before me in triplicate, a spore-form emulating three humanoids joined at the torso. Well, then. This signaled I was of interest, sure, but possibly as no more than a joke. For all I knew, its more advanced sensory array had picked up traces of both Jinx and Dirk on me once, and was now reacting to my presence with all the amusement of a species that propagated with far more abandon and inclusivity.\nOnly three? its mock-up seemed to say. Ha ha ha! How droll!\nIf a joke, though, its notion of what Jinx, Dirk, and I had together lacked finesse. But our relationship, I reminded myself, was not just then a relevant matter for interspecies debate.\n“What—cause?” the Feru asked from those three benignly smiling mouths: the words half-greeting, half-demand. I knew better than to waste the time of a being whose essence surrounded me, and whose growth rate stymied even the Chiggers’ invasive native blueprints: another defense mechanism, sadly, that Partnership suits could not easily replicate.\n“I’m here about the death of the Obys’ egg.” I said. “The end of its line. A genocide.”\n“Aaaaaah.” The Feru’s mock-form visibly shrank from—was that grief? Confusion? Shame? Jinx had more xenobiological savvy, or at least more confidence in her hunches. I had the strategic planning, but always more on systemic levels than one-on-one.\n“Did the Obys speak of threats?” I continued. “To you, his greatest friend?”\n“‘Friend!’ Human.” The Feru pantomimed a laugh in triplicate: further amusement at my use of alien concepts in its domain. Okay, fair enough.\n“Reliable communicator,” I amended. “You shared the tastes, sounds, and signs from your respective terrains. Did the Obys’ convey fear? Perhaps of imminent danger, or death?”\nWas that bristling I saw along the whole of the Feru’s communicative construct?\n“The Obys did not fear death.”\nNot surprising, really. I considered the raggedly breathing leviathan I’d met three moons past: its core physiology ill-suited to being planet-bound for long. The Obys had sailed the stars with a fanning solar tail for centuries, and always with a sense of every other member of its species on the cosmic map: a whole array of brilliant quantum-signatures lost point by point as the species eroded from parasites within. Little did those passengers know, of course, that their own success would be their downfall, with the last of the Obys spelling the last of their carriers, too. The parasite never having quite mastered the feat of zoonotic transfer.\n(Not that I had any intention, mind you, of calling its eradication a genocide in turn.)\nSo, okay, the Feru was right: of course the Obys wouldn’t fear death the way so many humans did—not with its tremendous life span, and all it had witnessed on its journey through the cosmos. Not after living so long with the knowledge of his species’ impending doom, and a slow, steady march towards that lonely end. It took the Obys’ kind centuries just to reach mating maturity, and then to find a mate so far across the stars? Another lifetime, surely. Who was any human—who was I?—to talk to the Obys with any gravitas about death?\nBut still, when he had found his obet, his truest counterpart, the Obys I knew reported that he’d gained in that instant a world of novel feeling. And after their courtship of mimicry, after a decades-long coupling that unfolded over a distant galaxy; after months of nursing her clutch of fertilized eggs between their clinging folds . . . the papa-to-be had proudly taken their half-formed offspring to finish the job alone: to weather the arduous descent to a planet secure enough to serve as a nest. And no other feeling, he’d told me between the agony of his dying breaths, had ever felt so right to him. He’d almost burned to a crisp on landing, but land he had, to lay upon Drasti Prime the single survivor of his species’ final brood . . . And then, quite unexpectedly, to grieve with full intensity for the first time in his ancient life span. To feel, for the first time on his people’s cosmic grid, the absence of a being he had truly loved. His obet’s quantum-signature giving out at such a distance from the parasite inside.\n“Not fear, then,” I tried again for the Feru, while grieving anew the memory of the Obys’ living loss. “But did he sense death coming?”\n“Of course.” The Feru rippled, a shiver extending to fronds all around me.\nI hesitated at the reminder of the Feru’s fearful reach. Its swiftness, and its power.\n“ . . . Do you?”\n“Always.”\nRight, that was silly: fungal species thrived on the intersection between life and death.\n“Just—in general?” I pressed. “Or from something specific? Or someone?”\nBut the humanoid form before me maintained three neutral smiles while swaying in a gentle breeze. I couldn’t tell if it understood human physiology well enough to replicate our emotions accurately, but before I could try again my communicator beeped, and Jinx’s head bloomed neon-yellow over my forearm-touchpad.\n“Hey love. Good news and bad,” she said. “Saludon equipment definitely took the shot against the Obys’ nest, and you’ve got a call waiting to patch in. It’s HQ.”\n“Wait, which part’s the good news?”\nBut Jinx only winked before the screen switched to INCOMING CALL. Always damnably efficient, that one—with work and so much else.\n“You see, I can’t always tell what’s worse,” I explained to the Feru, while tapping in ACCEPT. “Talking to Saludons or my boss. You’re lucky you move in unity, you know.”\n“We are,” the Feru agreed. “Ask the Saludons about the ancients in the honeycombs.”\n“The—what?” I started, but when I looked up from my touchpad the Feru’s representative form had dispersed into a field of nonresponsive fronds. Apparently neither genocide nor my relationship dynamics had been enough to hold its interest for long. Well, so be it. I watched four local Spinners darting along the canyon ridge, at the hard border where the Feru ended and the Esh began. This servant-cluster, at least, seemed to be in a hurry—called, perhaps, to join the grand convention Kurrick had mentioned? Meanwhile, beyond both the Feru and the Esh, at the end of the boxed-in canyon and bordering the other side of the honeycomb caves, sat the heavily scorched territory of the Saludons. Waiting.\n“All right,” I muttered, when the patch signaled READY. “Let’s get this over with.”\nNot exactly a ringing endorsement, but, well . . . you had to know my mission coordinator, Essen. Not every ex was easy.\n4\nEssen’s bright, bald head loomed over my communicator, and gave my surroundings a thorough 360-degree scan before settling on me.\n“So! Jinx tells me you got itchy for something new again.”\n“I highly doubt that’s how she put it, Commander.”\nEssen shrugged. “All the same in the end, isn’t it? The hell were you doing babysitting the egg in the first place? That’s not Partnership jurisdiction. We’d no treaty with the Obys.”\n“Professional courtesy. Plus, we were nearing the end of its incubation period.”\n“Curiosity, huh? What, you couldn’t observe it hatching from a safe distance?”\nI chose not to point out that, even at a distance, we would still have noticed the impact crater and investigated. “Now you sound like Dirk,” I said.\n“Yeah? There’s a shocker. You do have a type, Greysl.”\n“Willing to waste my time with lectures instead of just saying ‘I was worried for you’?”\n“Like you’d do anything but dismiss us even if we did.” Essen hesitated before adding, “But I am worried, Grey. Jinx tells me the Saludons have a hand in this, but why would they care about the Obys? If their tech obliterated the egg I wouldn’t even bet it was personal—just an aggressive attempt to claim new territory. And you know we can’t let them do that.”\n“The Spinners wouldn’t let them do that, either. They’ve been quite firm about keeping us all near the honeycombs and within our designated zones. But also, trust me, Commander, we didn’t see signs of invasion in the rubble. Jinx just pinned some of their equipment to the act, and you know how they travel—in massive military brigades. If this murder was actually a Saludon-led initiative, there should’ve been way more indications of them in the surroundings. No, this sounds more like someone borrowed or stole their tech.”\n“Or maybe they collaborated with someone else to throw off suspicion, just as it’s working right now for you. Maybe the Esh?”\nI caught myself about to disagree with Essen out of habit, but he was right: I did tend to dismiss him—and Dirk—more often than perhaps was kind. So instead I tilted my head in a show of consideration. “You know, I do remember some of the Esh being fascinated with Saludon body armor. It’s not impossible that they made a trade.”\nEssen looked surprised, plainly having braced for a dispute. Was that part of the appeal—treating my seconds like emotional fools, then rushing in after to soothe and offer aid when they were injured by it? If so, maybe a solo session was in order for me, too.\n“All right, great,” he said. “So you’ll look into it, but . . . carefully, yeah? Because we can’t afford to have any other players allying here without us. Either we all collaborate or—”\n“Trust me, Commander, no one wants another resource war like Yura Six.”\nEssen grimaced in agreement. I took the opportunity to push.\n“But you know, boss . . . even if they’re not involved, and that’s not what’s going on . . . I’m still going to find out what really happened with the Obys’ egg. You know I have to. There’s an ethical component that doesn’t disappear just because the investors are appeased.”\nAnd now it was my turn to be surprised, having also expected more pushback—but evidently my concession had earned me a touch of charity in turn. “Wouldn’t expect any less,” said my mission coordinator. “Just . . . try not to lose yourself in the process.”\n“Figuratively, or literally?”\nEssen smiled—and it was a warm smile, too. How curiously generous of the cosmos.\n“I’ll be sure to keep a lookout for snarky butterflies,” he said.\nThat very tenderness undid me, though, in the end. When my ex’s projection switched off, I surveyed the field of Feru, feeling at once alone and pointedly surrounded.\n“Did you hear any of that?” I said to the stalks still swaying in a light breeze. “Is this all a cover? Are you in fact always listening in?”\nBut the Feru gave no response—consciously, or otherwise—and with a twist of disappointment, plus a keen and sudden longing to be in the vicinity of Jinx’s touch, and laugh, and smarm again . . . I started for the frontiers of the Esh. It figured, too, that I’d be descending next into the nebulous, when that was precisely how I felt inside.\n5\nApparently I wasn’t the only one having a tough time with my feelings, though. On the border between the Feru and the Esh, I found a local Spinner cluster restlessly dipping in and out of Esh territory, swapping face masks as they moved from one territory to the next. The Esh, having no faces to speak of and not even emulating such forms for company, had proven a serious aesthetic challenge for the local servant-species. Each sentient nebulosity ranged in size and intensity—whole relentlessly churning clouds of sparkling purples, greys, and pinks—so if the Spinners’ Esh-mask looked more like a star map, a perfect disc of Uranian blue riddled with holes of varying shapes and diameters . . . well, I doubt the Spinners’ algorithms could have done much better.\nThat pinprick design didn’t hold up well to wear after three Drasti Prime decades, though, so I took deeper, slower breaths when the cluster-leader approached me: her mask no more than a few dangling fragments after its extensive use among the Esh, and all her bright red eyes giving way to an acrid and heavily salivating lower maw.\n“Accounting,” she said. “Are you here to make accounting, too?”\nThere was a surprising sense of urgency in her voice, so I didn’t answer so much as I introduced myself, and listened for her name in turn. Urrig. The “g” with an aspirated ending, closer to a “k,” that I definitely didn’t land on my first attempt.\n“Urrig,” I said. “My primary Spinner’s name is Kurrick. Has Kurrick not informed your cluster of my permission to investigate a crime committed outside Partnership terrain?”\nTic-tic-tic-tic.\n“Affirmative, but we are still spinning on this question of a crime.”\n“Well, there’s no question of the crime,” I laughed, half out of nervousness and half from surprise. “It’s obvious. The caves were obliterated. The Obys’ egg has been destroyed, and everything around it for good measure. But once I find the perpetrator, or perpetrators, I hope your fellow Spinners will have reached a verdict regarding fitting punishment?”\nTic-tic-tic-tic.\n“Yes,” said Urrig. But she did not move, and did not offer further comment, and I was hesitant to tread any deeper into this terrain without it.\n“So—may I see them? The Esh?”\n“Unclear.”\n“My query, or the answer?”\n“The answer. The Esh are . . . restructuring. Accounting is difficult.”\nTwo revelations in one go. Restructuring—yes, I’d heard of this behavior from the Esh. Every now and then the species, having drifted into increasingly divided nebulous forms, sought to reconstitute itself as a whole. The idea was to gather together all the distinct insights the species had developed during dispersion—but it wasn’t an easy affair. Many of the Esh’s divided forms had gained personalities antithetical to cohesion, and those forms regarded reunification as violence: a sacrifice of the emergent individual to a tyrannical majority. It was a striking sight to behold, I’d been told by others in the Partnership—the mass subsuming its dissidents and, over time, reconciling even their righteous indignation with the whole.\nBut also, accounting . . . Was that what the Spinners did when they moved about us? Account? I’d always thought of them more as user-interfaces, readily available if ever we had queries about the planet and our permissions as guests upon it. But of course there would be background processes for the Spinners as well—security functions, at least, in anticipation of future threats. Accounting for us, though . . . Was that mere census-taking, or something more?\n“Well, I’d like to try to speak to the Esh, then,” I said. “If still permitted?”\nUrrig’s bright eyes darted from side to side, and I could hear the restless shift of her eight legs under those massive robes. Tic-tic-tic-tic.\n“Still permitted,” she said—but before I could thank her, she was already returning to her plainly agitated servant-cluster, chittering together in what seemed an argumentative cadence. Could a biocomputer grow frustrated? Was there an algorithm for that complexity of emotion, too? Or for grief? Maybe the Spinners had also been unsettled by the violent loss already of one guest in their collective care, and feared further with the Esh. But then again—\nFeared? Human! I could imagine the Feru’s amused rejoinder.\nAnd I agreed—though even among fellow humans, I often felt I was missing something far more important when I ascribed certain emotions to the surface of their speech.\nBut—there were better times for such doubts, perhaps.\nAs the Partnership’s security liaison for Drasti Prime, my most critical discovery just then was the Esh, transformed: a writhing electrical storm near the center of their terrain. The Spinners had given them a patch of sheer rock absent even sand, let alone flora and fauna—an untenable plot for us or the Saludons, whose long-term crews did best with greater environmental variety. But the Esh’s nature had made it easy for them to adapt, and more importantly, to extract: slipping through the slightest fissure to feast on the planet’s internal ecosystem without damaging the surface. In theory, then, I understood Essen’s suspicions, because how easily so much else seemed to come to the Esh . . . but all his conspiracy talk seemed far less plausible the closer I came to the actual spectacle of that reunification storm. The colony of Esh seemed far too busy with internal affairs to be colluding with anyone else.\nStill, I tried to maintain a healthy level of suspicion. Maybe this chaos was merely for show—or maybe the chaos itself gave them stronger motive for the murder. Maybe a few Esh dissidents had destroyed the egg on the Saludons’ behalf, for a chance to occupy body armor that might in turn protect them from their species’ reunification pressures.\nWould such a tactic even work, though? As I walked the perimeter of the furious storm of the Esh, letting my specs record and upload as much of it as possible, I considered each species’ relative strengths. Saludon craftsmanship was second-to-none for military attire, but then again, I’d seen the Esh apply enough pressure to crush combat suits before—and on those occasions, I’d only been watching small Esh-forms at work. What were the Esh like—in temperament, in physical capacity—as a reunified whole? An internal boom like thunder gave me to suspect that, if the Esh wanted its dissidents badly enough . . . it would get them, in time.\nAnd yet, that one hard fact didn’t entirely preclude the possibility of collusion, because an entity desperate not to lose its independence might take the risk anyway, no matter what the odds of success. So there was no point to rejecting Essen’s hypothesis just yet.\nHaving toured the whole of the massive storm without seeing anyone, more distinctly primary-side than the rest, though, I finally gave up and used my touchpad to whistle a traditional greeting at the giant cloud of gas and lightning in general. Behind me, the towering shadows of the Esh’s Spinner cluster continued to pace restlessly, and I could see now why they were having such a hard time accounting for the charges. Was this storm an act of species-wide addition, or subtraction? A positive, or a negative? I couldn’t get a lock on it, myself: human notions of autonomy as irrelevant here as our relational values were among the Feru.\n“Greetings, ah . . . Esh? I’m sorry, I do not know your reunification name.”\nInstantly, the writhing mass thrummed with bright energy from which sound emerged, like the buzz off a damaged light panel back on base.\n“NO. NAME.”\n“Right, right—you’re all about the absence of distinction just now, sorry. Do you remember mine? Greysl, of the Partnership?”\n“REMEMBERED.”\n“Good. Good. Well, I’m . . . I’m seeking answers about a murder. You might have heard? The Obys’ last egg was recently destroyed in the honeycomb caves.”\n“DESTROYED. OR. REUNIFIED?”\nI laughed despite myself. The Esh would debate the term in its present context.\n“The Obys aren’t like you. Each Obys maintains its distinction.”\n“NOT. IN. DEATH.”\nIt took me a beat to grok the storm-cloud’s meaning. “Well, okay, sure, when the last Obys died, his corpse was consumed by local nanotech, but that’s a different kind of reunification. His sentience wasn’t perpetuated. Those were just his nutrients and other base materials, absorbed by the native ecosystem. Conversely, his egg was blasted to bits before the Obys inside it even had a chance to begin its more interactive life cycle.”\nThe shape of the Esh-cloud changed—shrank, sharpened, then expanded and softened again. A sign of emotion? Damn, but I missed Jinx’s stronger hunches. Plus, the quirk of her smile would’ve helped to alleviate the pressingly human smallness I felt while standing between so many giants—the one before me sparking wildly; the ones behind me skittering rapidly along the nearest border. A quick glance at my touchpad, though, and I could see that Jinx’s life-sign was no longer within Partnership territory, but returning to the honeycombs. No doubt looking for traces of more recent Saludon presence. Attagirl.\n“WAS. THE EGG. AWARE?”\nWell, at least the Esh’s curiosity hadn’t flagged amid its internal struggle. Nothing seemed to be watching me from within that cloud, exactly, but after booming these words the Esh seemed to wait attentively on my answer.\n“Honestly? No idea. But generally the young in such species are dormant until they need to transition to life outside the shell. So if you’re asking if the Obys’ offspring was conscious of its impending death . . . hopefully not?”\nThe mass flickered and shrank again, but said nothing.\n“Look,” I went on, “I also don’t know why anyone would do such a thing. I just hope it was accidental, because the alternative is that one among us here on Drasti Prime intentionally brought another species to its end. And I don’t know about you, but that worries me—that worries the Partnership. So I know you’re busy, but if you know anything that—”\n“IN. THE. CAVES.”\nI waited for further pulses of light and sound, but none followed. “Is that—are you asking for clarification, or telling me? Did you see something in the honeycomb caves?”\n“EVERY. THING.”\nIt wears on a body, really, to have to fill in the blanks in every conversation—but the Feru’s equally cryptic remark gave me an idea. When in doubt, Jinx liked to say, bullshit.\n“Oh, you mean the ancients?” I toed the sheer rock of the Esh’s territory. “Yeah, they’re something, aren’t they? No wonder the Spinners never allocated that land to any of us. I mean, don’t want to piss those guys off, am I right?”\nThe Esh, still silent, deepened internally to a bruise-purple—lightning strikes still bolting pinkly along its warring periphery. Well. This was a stupid time to remember that I had no idea if the Esh was one of those species that considered bullshit an executable offense.\n“THE INSECT,” the storm-cloud said at last. “SEALS IN. ITS GREATEST. TREASURE.”\nNow, some people don’t do well with cryptic remarks, but how does that saying go? One species’ mud is another’s water? And so my preceding discomfort in Esh territory turned instantly to envy, with a touch of laughing petulance. Where was my flash of lightning, I wanted to know, to boast the feat of my epiphany?\n“You’re kidding,” I said, grinning widely beneath my visor. “And here we thought the caves were, like, used for mines or something by the ancients.”\n“EXTRACTION. YES. BUT ALSO. REBIRTH.”\n“So that’s why they let the Obys set his egg down there? To help his kind recover?”\nBut apparently the Spinners had finally had enough of the Esh’s disorienting transformation, irrespective of its obvious coherence when addressing me—and in a rush the whole cluster appeared suddenly around me, chattering with input requests: Urrig’s fragmentary mask and vicious mandibles foremost among them, gnashing at storm-cloud air.\nMeanwhile, there I still stood between these giants: so tiny a relative specimen that either none heard me or none were interested in paying me further mind.\nOn the not-so-distant horizon, Saludon territory now looked temptingly quiet by comparison, ominous cave readings be damned. With an uncertain heart, then, and a quick touchpad request for Dirk to pick up, I set out towards another sort of silence. Not the first, perhaps, that the Saludons had created on Drasti Prime today . . . and maybe, if I wasn’t smart about my words and footfalls there, also not the last.\n6\n“If you’re looking for Jinx, she’s gone back to the honeycombs.”\nMy second mate’s head bloomed above my touchpad in the same bright, neon-yellow lines as Essen’s and Jinx’s, but Dirk’s was half-turned from me, an etching of an ear and a ragged slash of his hair all I could make out through his slice of viewscreen.\n“I know,” I said. “I’ve got her lifeline on my tracker.”\n“Right, of course you do.”\nI smiled. “Just like you’ve got mine on yours.”\nDirk faced the screen directly. He seemed more distracted than annoyed, though, and at once I regretted the teasing remark.\n“Hey. Everything okay?”\nHe ran a hand through thinning, grey-black coils. “Trying to figure that out, to be honest. Spinners showed up after you left. Kurrick gave me a package and asked if I could analyze the contents.”\nWell that was new. I tried to remember the last time the Spinners had asked anyone in the Partnership for a favor. “Is this part of their spinning on the crime?”\n“No idea, but—maybe? I mean, I’ve got . . . DNA samples, but also ancient tech, not something I’ve seen before.”\n“Did Kurrick give you any other instructions? Guidelines? Anything?”\nDirk shrugged, and from the creases around his eyes, I could tell that he’d been furiously in thought over this when I called.\n“The DNA—that’s easy,” he went on. “Even a quick glance tells me it’s from the Obys’ species. I’ve got it in processing now, while waiting for Essen to deliver Partnership files on any other Obys we’ve encountered. But the rest of this stuff . . . ”\nDefinitely related to the spinning, then. I’d declared the matter a complete genocide, but if viable DNA remained, and the Chiggers could reconstitute lifeforms from basic blueprints . . . well, yet again I knew I should’ve been relieved, but there seemed a world of difference between witnessing a last egg flourish or falter at nature’s hands alone, and choosing to bring a sentient species back from the dead. Did we even have the right? On whose authority? Had Kurrick solved one problem just to pose, for us, another?\nEven so, the matter of the egg’s destruction remained tantamount. You might not think an ancient space-worm’s singing could have much range to it, especially during its land-bound final days, but the Obys I knew . . . he’d sung out for his egg every note of wistful hope I knew, including plenty I’d never even known I knew, until I’d heard them issued from him, too.\n“Did Kurrick say where these contents came from? Was it the honeycomb caves?”\n“Yeah, but how did you—”\nI hurried my second mate through a quick debrief of my conversation with the Esh, up to their remark about where an insect buried its treasures.\nDirk quirked his lips in what looked like pride for the first time all day.\n“Kind of a big leap,” he said. “I thought Jinx was the master of following hunches.”\n“Hah. Yeah. She’s rubbing off, I guess.” I quickly changed tacks, though, before her mere mention complicated his mood. “Hey, but Dirk—could you also look into the records from our first conversations with the Spinners about the honeycombs? I can’t tell if we were misinformed from the start, or simply misreading whatever the servant-fleet was saying.”\nDirk nodded. “Our first conversations, or—”\n“The Partnership’s, if you can. It’s funny, isn’t it? After all our own time in counseling, it never occurred to me that even bigger relationships might need checking in on, too.”\nWell, that earned me the mother of all puzzled frowns.\n“Not the same thing, though, is it?” he said slowly. “Unspoken contracts between partners, unspoken contracts between whole species and alliances . . . ?”\n“But not so different, either. Sure, one has more text involved, but why shouldn’t we check in even on the fundamentals for our primary alliances? You know the old theory that you have to choose love every day—that you can’t just stick to having promised it once and ride on that goodwill for the rest of your life?”\nBut Dirk didn’t look entirely convinced. “We don’t really get to choose the bigger social contracts, though, do we? Not as individual members of a species, at least. It’s not like we ever get to opt out of being human, for instance—except by dying.”\n“Well, yeah, traditionally, that’s true. Although here, with the Chiggers . . . ”\nBut I didn’t need to finish my counterpoint. From the look on Dirk’s face, I knew that Hoover’s example now hung painfully in the air between us. And . . . there was that damned pinching beneath my ribs again, to see him plainly hurting over it. Hold on, kiddo. Not long now.\n“Look, love, all I’m saying is, we have a history of struggling with society-sized contracts, even if we maybe don’t treat them the same as we do our implicit contracts with direct partners. But maybe we should. Maybe it’s worth making a habit of revisiting our baseline beliefs—starting with what we assumed about this world when we first landed here.”\n“Okay, fine.” Oh, but Dirk looked tired now. Was he taking this as an argument? It wasn’t meant as an argument, but there it was . . . his defeated “I’ll add it to the list, chief.”\nEesh. I especially didn’t like it when he put extra distance between us.\n“Love,” I said, firmly.\n“Hm?”\n“I’ve got you on my tracker, too, you know.”\nDirk didn’t look up, but his expression softened. “Yeah, sure,” he said. “Lots of excitement there—food dispensary, bunk, exercise room, commons . . . ”\n“Life-saving med-bay runs, emergency search-and-rescue at the harvest sites, brilliant resuscitations of idiot thrill-seeking staff members in the landing bay . . . ”\nThe tacit praise pleased him, I could tell—but also plainly jarred, so he waved a dismissive hand before I could go on. “Anyway,” he said, loudly. “Jinx is in the honeycombs and probably wants a word with you. I’ll message after I’ve run the searches you asked for, but—in return—no more bites in the wilderness. Understood?”\n“Understood. We’ll save a few of those for when I get home.”\nI winked, but Dirk’s screen cut out just at the beginning of an eye roll.\n“Ah yeah, old man,” I said into the ensuing silence—flexing my fingers after so much time holding up the touchpad. “You still got it.”\n7\nAfter the land of the Feru—filled to its limits with interconnected constituents—and the land of the Esh—where the Esh had gathered more or less into one massive whole—the land of the Saludons seemed downright disordered, even as the people upon it moved in rigid formations from one work site to the next. Doubtless, though, they, the Feru, and the Esh would all have called the Partnership’s the messiest of all foreign-owned territories on Drasti Prime—and they wouldn’t have been wrong in their assessment, either. We humans went where we pleased, by and large, as I was doing just now. Hell, even the Spinners consistently moved in packs, so only the Chiggers’ wandering flight paths even approximated our individual movements across the landscapes. And the Chiggers were technically classified as pests, so . . .\nI waved with affected confidence all the same, once I’d reached the Spinner cluster on the Saludons’ border. Here, the servant-species’ Uranian-blue masks resembled the soldier’s helmet that every Saludon, regardless of her species of origin, wore while on duty in its ranks. But these Spinners also made no sign of recognition—so caught up were they in what looked like a display of species mimicry, a matching of their behavior to that of nearby troops. Did the Spinners do that for us in the Partnership, too? Copying, emulating, trying to fit in with human life through more than the mere wearing of those masks?\nIt would certainly explain why the Spinners for the Esh had been so agitated by the act of reunification, for how in blazes was an invertebrate species supposed to emulate that? Meanwhile, the Feru seemed not to give them much in the way of behavior to replicate in the first place, so swaying in the fields of those unresponsive fronds would surely suffice.\nBut as I considered how the Spinners might be trying to mimic what they knew of the Partnership, a squad of five Saludons approached, their visors open in a preliminary show of trust. And I admit, it was a relief to talk to beings more or less my size again, even if I currently had more reason to fear them than all the rest. First, though, we went through the usual rigamarole between our peoples: I saluted, they saluted. I sent clearance codes to their touchpads, they sent clearance codes to my touchpad. I reaffirmed my commitment to speak in peace, under the conditions laid out by Partnership-Saludon treaty. They reaffirmed the same.\nTedious crap—but reassuring, too, in its familiarity. Maybe there was something to a more algorithmic approach to life after all.\n“Greysl,” said the squad leader, Da’l, when we had finished. Da’l had been Restuvian—I could tell from the yellow-brown mottling under his cheekbones—before the Saludons had conquered his species’ wide-ranging fishing colonies across the stars. Now, though, to mention his ancestry would be as much an insult as a pain: Da’l was Saludon now, nothing more. Did an alliance like the Saludons’ even recognize genocide as a crime the way we did—or was it simply another tool in their quest to assimilate all the cosmos’ most useful forms? The Obys certainly couldn’t be put into service as foot soldiers if captured in battle . . . but maybe as vessels? Cavalry for further conquest in the vacuum of space?\n“Thank you for speaking with me,” I said. “It seems like the work goes well with you.”\n“Affirmative,” said Da’l. “Quite well. Our replication experiments have succeeded off-world, so we should complete our mission ahead of schedule. Saludons—FOREVER!”\nHe beat the crest of his body armor, and the rest of the squad echoed the cry. How did the full saying go, that the Saludons used to rally their captured peoples? “Grieve not the fall of your line, for Saludons choose combat only with the very best. Our pride is your pride. Our victory, your victory. Saludons—a unity of strength—FOREVER!”\nA pang of envy cinched in my chest, though, at the rest of Da’l’s comment. Replication experiments meant the ability to reproduce Drasti Prime’s microbial engine elsewhere. If the Saludons had already mastered it, then they stood to benefit greatly from its use in their stellar fleets, while the Partnership would continue to use the microbes only for on-site materials processing and energy conversion. I tried not to think of the long-term implications, too, for such a technologically emboldened Saludon military; our peace, I had to hope, was still secure if the Saludons felt confident sharing their latest achievements with me. (Or maybe, for now, the Partnership’s myriad of alien members simply remained “unworthy” of Saludon attack.) But also, as I chewed over the ramifications of their triumph, there went Essen’s idea, didn’t it? So much for expansion pressures possibly motivating Saludon involvement in the Obys’ destruction. If their peoples were planning instead to leave, they’d no reason to bother.\nWell, that at least left me feeling a touch safer on their turf.\n“Praise be to your triumph,” I said to Da’l. “As for me, I’m investigating the destruction of the Obys’ last egg—what the Partnership would consider a significant crime.”\n“Ah yes, that. Or, you know, a mercy,” Da’l shrugged. “Can you imagine the life awaiting a single, radioactively decaying organism compelled to exist as the last of its kind?”\nI don’t know if my expression conveyed surprise or judgment. Either way, Da’l continued with all the confidence of someone who’d hashed this out a dozen times before, perhaps with others in his crew complement over the last three moons:\n“Hey, no offense intended. We suspect that the Obys had no other choice, limited sentient being that he was. When he and his mate created their last brood, they were driven by propagation pressures without thinking about the larger consequences. But still . . . from our more evolved perspectives, you have to admit that it was a cruel and selfish act, conceiving another sentient being under such awful circumstances. Saludons would never be so wasteful—never take a people we couldn’t use; never leave a dying breed to suffer further. And yet, what could we do here? It wasn’t our territory, or our responsibility.”\nI parted my lips to respond, all instinctive defense of the Obys giving way to a surprising level of agreement with the horror story the Da’l was suggesting would’ve taken place either way. Still, Da’l’s eagerness to talk—or boast—was only mounting.\n“We were honored, though—right, squad?—truly honored by the Spinners’ request for aid with this affair.” Da’l glanced at his team, which answered with a rousing HOO-AH! that left Da’l practically beaming. “So we gave them what they needed. What a world this is, huh? Filled with bioweaponry, brilliant nanotech we’re also hoping to crack soon . . . but not a single projectile weapon in all the Spinners’ arsenal. And sure, they could’ve leapt upon the egg the old-fashioned way, with those brilliant legs and those mighty mandibles of theirs—have you seen them in feeding frenzy? It’s inspiring. We have them down for consideration, you know, for future combat. But they insisted that the Obys’ code needed to be eradicated, not even a scrap remaining, and who were we, as guests here, to dispute our hosts’ accounting?”\nIf Jinx could’ve seen the look on my face . . .\n“Thank you,” I managed, working the words through a mouth gone painfully dry. “We did note the presence of Saludon tech on site, but without all the troop movement that usually accompanies its presence. The Partnership was . . . concerned that your tech might have been the victim of theft, or perhaps that some among your number had broken from the—”\nBut Da’l snorted, and the rest of the squad burst into resonant laughter, before I could finish. I offered a weak smile that conceded the foolishness of such speculation.\n“But of course not,” I conceded. “The Saludons are strong and unified in all things. There would never be a dissident faction running rogue among you.”\nDa’l tipped his head in acknowledgement. “We thank you, though, for your concern. A worthy sentiment from an ally, especially delivered by hand so as to maximize discretion, in case something more serious had been in play. And, yes, we realize what an atypical spectacle a piece of our tech might have seemed to you. Rest assured, though, that when your Partnership finally proves its worthiness for combat, you’ll be met with the sight of far, far more.”\nStars above, this job sometimes.\n“And for that . . . courtesy,” I said through gritted teeth. “We thank you.”\nDa’l and I then formalized the end of our communications with another affirmation of our peace, and an uploading, on the Saludons’ end, of a recording of our exchange. I gave a wary salute to the Spinners at the border, but still they gave no answer. Good. I just hoped that I could reach Jinx before I had to talk to—or rather, confront—the dishonesty of my own.\n8\nI scanned the canyon before making my descent: a far more efficient beeline to the Partnership’s border with the honeycomb caves. The earlier mist had parted, and in the cool evening air, with Drasti Prime’s brown moon rising, floral life was at last beginning to glow and feed in-full. Insect activity followed suit, and soon I froze at the sight of a large scorpioid perched atop a cactus. Too many limbs to be Hoover, I thought, and I didn’t think there’d be any Hooverness left in the real one anyway, but I gave it a friendly howdy just in case.\nA bigger doubt arose, though, as I neared the center of the canyon, and looked up at signs of life from all the surrounding colonies: frond fields swaying in the wind; flickers off an electrical storm briefly illuminating plateau flora in adjacent territories; troop movements marking increased activity around specific dig sites behind me. We four species essentially surrounded a giant, oblong pit—the Partnership, then the Feru, then the Esh, then the Saludons, and finally the honeycomb caves, which shared another border with the Partnership to complete the circle. But no one had been given the canyon itself. To create a buffer? That was one possibility, but the thought of the Spinners taking aim at the Obys’ egg and blasting a hole clean through surrounding structures presented another: perhaps we weren’t the first here after all. Perhaps there’d been another foreign species—right here, right in this gap turned lush over time and with the Chiggers’ help—and maybe its end had also been delivered by a Spinner cluster. Perhaps that was the species that explained the servant-fleet’s fifth mask.\nBut even if so, what did I have to fear from the Spinners, really? Apparently they’d been honest with the Saludons about everything. Why not with me? What had I done, my kid-counselor might have encouraged me to think upon, to limit the amount of genuine openness possible in my interactions with their fleet? I replayed my initial conversation with Kurrick about the Obys’ egg—first in my thoughts, and then on my touchpad, for confirmation.\nGenocide. You let the Obys lay his egg, the last of his kind, in the honeycomb caves beyond our territory two moons ago—but someone’s just obliterated it, which is a crime for which . . . well, to be honest, the Partnership’s never seen a genocide so complete before. In the past, there’s always been survivors to speak for their dead. So I need to know—do you even have laws for this sort of thing? If we find the perpetrator, did your makers leave any formal protocols we could enact against them?\nAtypical circumstance. Convention necessary. We must spin on this.\nWell, that sure as hell sounded declarative on my part: imposing a given narrative from the outset, without giving Kurrick any opportunity to contribute to the framing of the problem itself. But if I’d instead asked her directly if she knew anything about this matter, or had had any part in it, would she have told me the full story right away?\nUnderstood. But do we have permission to seek out the perpetrators beyond our borders, while you consider the legal consequences?\nState your investment in such an action.\nWe’d never know. Instead, Kurrick reacted to the questions I’d asked, and no more. But what else was a biocomputer expected to do? Offer unsolicited information? Under what parameters? And if they were emulating us as other Spinner clusters sought to emulate the rest, then their algorithms for mimicry might even have required them to go along with the narratives we imposed—to learn from our ways, not dispute them, so as to serve us better.\nBecause the Obys’ egg was without defense, its destruction attests to a dishonorable party on the surface of your world. We seek to prevent that party from doing further harm.\nAcknowledged. You may proceed.\nAnd, okay, maybe my wording had been in error—but in more ways than I’d realized at the time. The Spinners had their own diagnostics tests—their accounting, as it were—so maybe, as far as Kurrick was concerned, I’d simply been proposing a similar test of my own. If so, what risk could I have posed for her species, if “harm” was all I was looking for—and if the Spinners surely didn’t view what they’d done to the Obys’ egg as that?\nI admit, then, that as I reconsidered this whole conversation, I was also congratulating myself for willingly accepting so much potential blame for our communications failures . . . which was all well and charitably good, until I heard the light but significant thump of a Spinner on the canyon floor behind me—no midair screech in forewarning. Nervous tension gathered in my arms, my fists, as Drasti Prime’s night-sky light went out—or so it seemed, at least—and I turned to greet Kurrick, her face mask glowing in the brown moon’s stead.\n“Checking up on me?” I said, as cheerfully as I could manage in the wide sweep of her shadow. “Or have you finished spinning on the matter of genocide?”\n“In process,” said Kurrick. “Awaiting the outcome of a request.”\n“That’s two requests in the last few days, huh? First to the Saludons, then to us.”\nEye movement behind her mask. “Atypical circumstance,” she replied.\n“Look,” I tried again, swallowing hard. “The Saludons told me they gave you a weapon. And Jinx—my partner—she knows a Saludon weapon was used to the destroy the Obys’ egg. What I don’t understand, Kurrick, is why you invited the Obys to lay his egg in the honeycomb caves at all, if you were just going to destroy it anyway. Why give him hope?”\nTic-tic-tic-tic.\n“At the time, we did not know.”\n“Didn’t know? What, that you were going to destroy it? That doesn’t even . . . ”\nBut oh yes, now I really heard it. Now I heard how I was complicating the Spinners’ ability to answer clearly and precisely, computers that they still were—no matter how many roving red eyes they had; no matter how wet their hungry, arachnoid maws. I breathed out and started over—slowly. Simply. One input at a time.\n“Kurrick, did you destroy the Obys’ egg?”\n“Yes.”\nI felt at once chilled by the confirmation and calmed by how readily it had been given, once I could keep my damned questions to the point. “Why?”\n“To protect our accounts.”\n“Your—accounts?” But her meaning dawned on me so suddenly I laughed. “Us. We’re the accounts. Is that it?”\n“Yes. The Partnership and the Saludons.”\nI frowned—feeling the pinch of something on my leg and swatting uselessly at it. Not now, Chigger. “Just the Saludons and us? Why not the Feru and the Esh?”\n“Neither the Feru nor the Esh were at risk.”\nBut . . . the Saludons and the Partnership were on opposite sides of the canyon. Yes, technically we both shared a border with the honeycomb caves, but by raw distance within those territories, the Feru were closer to the targeted cell site than the Saludons. What could have threatened both of us and not them?\n“It was an egg, Kurrick. How could it have harmed us?”\nTic-tic-tic-tic.\n“The egg alone could not.”\nI whistled low and slow, a sharp ache under my knee letting me know that another bot had, in fact, delivered its reprogramming protocols to my system. Dirk would not be pleased.\n“Buddy. Kurrick. You’re not making this very—”\nBut a beep on my touchpad signaled another incoming call. Well, speak of the devil.\n“Oh, right—and that reminds me,” I said to Kurrick’s luminous blue mask, before raising my forearm to answer my second mate. “We’ve gotta talk about this favor you asked of Dirk, my partner. There are safety protocols you bypassed. We have rules, too, you know.”\n“Acknowledged,” said Kurrick. “Apologies.”\nAnd the Spinner stepped back a touch—just enough that I could feel, again, the warm, muted light of Drasti Prime’s night sky while I took my call and tried not to scratch the latest infection site with the heel of my other boot. Now, what in blazes was I supposed to do with such a polite, if occasionally murderous, biocomputer like Kurrick?\n9\n“I was wrong,” said my second mate, the moment I answered.\n“Good evening to you, too,” I laughed—half out of relief just to be out of Kurrick’s shadow; half because of how much I enjoyed the sight of Dirk when he was this intense without being petulant or grumpy. “You got something for me?”\n“Lots. We were wrong, too—the Partnership, I mean. But first, okay, I know I said the Spinners had given me the Obys’ DNA, but that wasn’t quite right. The Obys’ corpse was completely devoured by nanobots, right? Too soon, maybe—but then, how could the decomp team have known to wait? They’re just simple machines following pretty basic algorithms for automatic reprocessing of organic materials. Meanwhile, what’s in this kit the Spinners wanted me to analyze? DNA from the egg.”\n“Well, okay, but that could just be—”\nDirk impatiently waved me off. “Greysl, look—the Obys’ egg was nonviable. I mean seriously unsuited for life, probably from the radioactive parasite that took out mom and dad. So, sure, maybe it would’ve gasped a few awful breaths after hatching—but in days, at most, it too would’ve given out.”\n“Oh, the poor thing.” And thank goodness, I realized, that its father hadn’t lived to see it suffer so. Better that he went to his end with even a flicker of hope for his kind on whole.\n“Worse, though,” Dirk went on, with a renewed confidence I was invigorated to see in him. “I went through the early recordings, and, well—listen. This is from one of our first conversations with the Spinners. Two of ours talking, one of theirs.”\nI nodded into the viewscreen, and Dirk started the audio.\n—but the name. There’s got to be . . . everything has a name.\nYes. The makers.\nAn exasperated sigh. No, that’s not what I—\nAnd then the second human voice: Ah, they can’t help it, Silv—they’re just computers. Big, kinda scary-looking computers. And whoever made them, they’re like their gods. So of course they’re going to—\nIt’s just so frustrating that there’s nothing else here, no imprint of them anywhere. Hell, there isn’t even a handle or limb-hold on any of their buildings or equipment to give a sense of how big they were, how they moved, whether they were insectoid, too. Look, can you describe them at all? Is there anything you can give us?\nAnd even the recorder caught the answering tic-tic-tic-tic with perfect clarity. Maybe their legs were just that damned loud, and not just a trick of my primal instincts after all.\nYes, said the Spinner. We are permitted to bestow land upon our guests. There are units near the makers’ caves where we can best give account and ensure your safe continuation for many generations.\nWell all right! said the second human voice. Now that’s more like it, eh, Silv? We can—\nBut at this last Dirk stopped the audio, a great big smile daring me to make the same leaps he already clearly had.\nI decided to let him have . . . well, half of them, at least. I grinned back.\n“The Spinners answered the questions they were given. The problem was the questions themselves. Could they describe the ancients? Yes, the Spinners could. And was there anything else they could give the Partnership—in general? Land. Oh, love, you realize this means—”\n“Yeah, yeah, all true—but even more importantly, listen Grey: that means the Spinners also answered our first question honestly, too. ‘The Makers.’ Not, like, deities . . . but literally, a species that specialized in making life. It was their name because that’s what they did here. Not just with the Spinners, but with everything. That’s what the honeycomb caves are for. That’s what the tech’s for, that the Spinners gave me when it dropped off the egg’s DNA.”\n“What do you mean they—”\n“The Makers rebooted species to restore natural balance.” Dirk shook his head in obvious professional admiration, and damned if I didn’t enjoy seeing him this passionate again; not just helplessly awaiting another opportunity to react to a medical emergency. Speaking of the latter, though—I had to set one leg against the other to suppress my latest transformation’s itch. Something slippery this time . . . Mollusca? But Dirk was still going on: “The Spinners kept their accounts by actively monitoring local species, and The Makers produced blueprints for the Chiggers to distribute in the ecosystem, targeting anything that seemed out of balance with the rest. So Grey, Grey—don’t you see? The Makers’ way was always to transform life, not destroy it. So if they were still here, I’m sure that’s what they would’ve done with the Obys, too . . . except they aren’t, and that’s the real imbalance now. Only their brainless replication tech remains, which just works with whatever it’s given—good quality source material or not.”\nI inhaled sharply at this last, his eager speech almost as infectious now as the native blueprints along my leg. “So there were blank-template bots in the honeycomb caves, and they were already trying to save the Obys’ species by mass-replicating the egg’s DNA.”\nDirk snapped his fingers, head bouncing temporarily out of sight in his excitement. “Exactly. But remember—the egg was nonviable. So the Chiggers’ programming, running essentially on autopilot, would’ve released massively deformed DNA into the wild.”\n“And since the Feru have excellent defenses and the Esh can’t be infected the same way . . . that means only the Saludons and our people could’ve been transformed by it.”\n“A severely deleterious bit of code, released by another bit of code that’s just responding to initial inputs established by creators who abandoned it eons ago.”\nI almost didn’t recognize my answering, triumphant cry. “One-Grey-Cell,” my second mate was still going to call me, once I told him I needed to regenerate a second time in one day . . . but hell if I didn’t make that one grey cell earn its bloody keep.\n“Which also means, love—don’t you realize? Dirk, this means that the Spinners did something outside their first protocols. I mean, not much outside, but still, a little. A start. Because they were just supposed to keep the accounts in balance, right? And the Obys was one of those accounts. Nevertheless, they chose to prioritize our own. They understood the danger of the Obys egg’s DNA, and put greater value on the actual viability of a given lifeform, rather than a simple maintenance of raw numbers for each species on their roster. Kurrick destroyed anything that could’ve had defective DNA on it . . . to save the rest of us.”\nAnd from the look on Dirk’s face, I knew he didn’t disagree—but still, I was a little deflated by his immediate response.\n“Well, maybe,” he said, bringing the whole register of our conversation down a notch. “To a point. I mean, we don’t know the exact nature of their original orders—but also, even if you’re right, it might not have been as big a deviation from protocol as you’re making it out to be. Because, sure, Kurrick eliminated the egg, but she also left these materials with me, yeah? And, fine, she can’t order me to do anything with them . . . but maybe what she was trying to say—what the Spinners haven’t quite got the means to say—was . . . ‘Can you fix it?’”\nMy breath hitched. “You mean the Obys’ DNA?”\nDirk nodded, barely containing his own burst of excitement. Aha. So no wonder his mood had deflated slightly at my connecting of a few other dots; this was his professional baby now. But—fine, fine. Pick your battles, old man. Focus, Greysl.\n“You mean there’s a chance that you can . . . ?”\n“Well, I mean . . . ” Dirk scratched his temple as if to deliberate, but there was no ignoring the spark in his eyes, already at least three steps into the bioprocess in his thoughts. “It’ll be a hell of a challenge tracing all the damage the radiation has done, but yeah, the Partnership has enough on file that I should be able to reset this specific DNA sample without losing our Obys’ contribution. Or the contribution of his obet.”\nI smiled at that final addition. Not entirely a lost cause, this one.\n“I’m sure they’d both have appreciated that very much.”\n“Yeah . . . ” said Dirk. “Only thing is, who’s going to be the carrier for the blueprints if I do pull it off? Or carriers, since it wouldn’t be fair to just make one.”\n“Oof. For sure. Stars, if only Hoover had known before he’d—”\nBut my second mate’s eyes grew pained before I could stop myself.\n“Hey,” I tried again, wishing I could more concretely make amends through the viewscreen. “This is awesome, love. You’ve done a great job, and you’re going to continue to do a great job. Just—take care of your side of things, okay? I’ll find you volunteers.”\nKurrick’s shadow fell upon me again, though, before I could so much as say goodbye.\n“I have received word from the tunnels,” she said. “We have reached a verdict.”\nWas it the whirlwind thrill of my conversation with Dirk, or the irritating crawl of my latest infection all down my left leg? Either way, my one grey cell had apparently given out.\n“A verdict on what?” I said in perfect ignorance.\n“Our crime,” the giant arachnid before me replied.\n10\nA few weeks on, as sixteen adolescent Obys prepared to launch into the stars, Jinx was finishing up diplomatic rounds with the attending Feru, Esh, and Saludon representatives, while I listened to Dirk go on for the umpteenth time about the enhancements he’d made to protect our first joint offspring from further radioactive parasites, as well as . . .\n“—‘a whole host of other infectious diseases, the likes of which they probably can’t even imagine yet.’ Yes, love, I heard you the first twelve times.” But I smiled and patted his arm, and, well, Dirk was too much in his element to be offended by my impatience anyway.\n“Next up,” he said, positively glowing as he surveyed the canyon floor, which had been converted for the last two moons into an Obys nursery. “I’m going to start tackling the native nanotech. Kurrick walking me through the honeycombs’ controls was all I needed to start to figure out how the Chiggers can be hacked, and maybe made a touch more refined in their transformation protocols for any species out of balance with the local ecosystem.”\nI clapped a hand on his shoulder and shook my head. “Stars, the strides our colony might’ve made together earlier, huh? If only we’d bothered to ask the Spinners directly, and with more patience, about their needs in relation to our own.” But I was shaking my head more in wonder than in lament—because it wasn’t just the first generation of Partnership staff that had taken their interactions with the servant-species for granted. It was our generation of colonists, too. Me. And I, of all people—considering what Jinx, Dirk, and I had so painstakingly built together over the years—should’ve known better than to assume. Right?\nBut, ah, always room to grow, as our counselor had warmly suggested during our first group session after I’d recovered from becoming part slug, and been ready at last to start talking out my grief over the old Obys and his struggles here on Drasti Prime. Smart kid, that one. Sometimes the future seemed in remarkably good hands.\nThe memory did twinge a bit, though, as I scanned the canyon floor and tried to make out which of the sixteen creatures below had once been Kurrick. It wasn’t easy, because in place of the stately and self-controlled Spinners’ bodies, you had a bunch of floppy, awkward beginners attempting minor takeoffs that had them gliding meters high, at least, before crashing to the ground anew. According to Jinx, one among their number had apparently crashed so theatrically just the other day that a whole host of local fauna—one massive scorpioid among them—hadn’t had time to escape the descending space-worm’s shadow. Wincing at each other in the retelling, we’d made a solemn vow not to mention it to Dirk—and now I realized I’d miss my Kurrick at least a little like he still clearly missed his Hoover.\nI mean, obviously, these sixteen Obys were far less unsettling than the local Spinners’ forms had been—and for this reason alone I know I should’ve been happier, at least on some deeper and more primal level, about the whole transformative affair. But when Kurrick had first come to me with her species’ verdict, the result of careful spinning on how best to handle her kind’s complicity in another species’ complete destruction, “aesthetics” had funnily enough not even warranted a mention in their final deliberations.\n“We are—out of balance,” she had explained instead. “As such, members of our own account will provide the necessary adjustment.”\n“But—you’ll lose yourselves in the process,” I’d countered. “You’ll become Obys completely. One life sacrificed for another—that can’t possibly be a fair accounting either.”\nTic-tic-tic-tic. The last of those damned spooky calculations I’d ever hear her make.\n“It is—no less than The Makers did, when they too erred in their accounting.”\nAnd with that . . . well, whew, talk about your offhand remarks containing multitudes. But even without pressing further on this accord—even without accidentally losing myself again to my species’ relentless need to impose narratives on everyone around them—I understood at once the gist of what she must have meant. The canyon. The Spinners’ fifth face mask. A whole other species lost to some ancient error on The Makers’ part—either of a moral nature or purely accidental. A whole other slice of alien history on Drasti Prime.\n“Your makers—The Makers—they’d have been proud of you, you know,” I said instead, though I hardly knew if Kurrick even needed encouragement for what she was willing to undergo. Did the Spinners have functional algorithms for fear? So much still for me to learn, that now I’d never have the chance to learn from her. But so it went with every ex, I guess.\n“Even after all this time—all this emulation of other guests,” I continued, just in case it might have mattered after all, “you’re still attending to their needs and wishes above all else.”\nAnd even if fear was off the table, maybe Spinners could still feel puzzled, because—\n“But of course,” Kurrick instantly replied, eyes darting curiously behind her mask. “The Makers are—primary. Our first account to attend to, as the rest of my kind always will.”\nWeeks and a whole whirlwind of species transformations later, I looked across the canyon ridge at the small dark dot of Jinx’s uniform, and felt the weight of those words even more acutely. Jinx had clearly just finished up with the Saludons—who after extensive and tediously ritualistic bargaining had finally confirmed a solemn vow not to consider the Obys worthy of combat for at least another millennium—and now my first mate was making her way back to our territory by way of the honeycomb caves.\nSoon one of the Obys under all our watchful eyes (and cloud-forms, and spores) would manage the trick of it, I knew. Soon one of the sixteen converted Spinners—each not too long ago a frightful, shrieking sight when it descended upon its prey—would launch successfully into Drasti Prime’s sky, rising higher and higher until it broke clean through the planet’s upper atmosphere, and set off on new adventures in galaxies maybe centuries away.\nMeanwhile, Jinx had been right, of course, to avoid taking on too many fixer-uppers in her own day-to-day practice. One clingy security liaison, forever deflecting from personal needs and anxieties by fixating on the supposed problems of another mate’s behavior, was more than enough for even the most open-minded first mate to handle. But hey, maybe she got off on the difficult cases, too. Maybe Essen would’ve teased her about having a consistent “type” as well. Either way, I watched her stride towards me with her visor only half down: the twist of an orange-glossed smile, along with a confident pop of her hip, revealing even at a distance her growing sense of relief that all this nonsense was finally at its end.\nAnd relief made her playful.\nRelief made her baiting.\nSo I smiled and held up Kurrick’s old mask—that brilliant Uranian-blue glow, that shocked human countenance, that thin crack from eyehole to gaping mouth—over my own.\nHow best can I serve you, madame?\nCanadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021."}