{"fingerprint": "5iN9i7hw0PIkC+t0Ohkz9S5iqV0=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Reader's Poll Winners, Nebulas, and Forever by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Reader's Poll Winners, Nebulas, and Forever by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Reader's Poll Winners, Nebulas, and Forever\nOur annual reader’s poll wrapped up late February and I am pleased to announce our 2014 winners!\nBest 2014 Clarkesworld Story\nWe’ve had some close races in the past, but this year only ten points separated the top third of the ballot. Throughout the month, several stories temporarily held the top spot, but when we closed the winners revealed themselves to be:\n2nd Place (tie)\n“Passage of Earth” by Michael Swanwick\n“The Eleven Holy Numbers of the Mechanical Soul” by Natalia Theodoridou\n3rd Place (tie)\n“Tortoiseshell Cats Are Not Refundable” by Cat Rambo\n“Patterns of a Murmuration, In Billions of Data Points” by JY Yang\nBest 2014 Clarkesworld Cover Art\nWhile almost every piece of cover art found praise from some segment of our community, the top three places established themselves very early and held their place through the entire month. The winners are:\nCongratulations to all our winners and a big thank you to everyone that participated in this year’s poll.\nWhile we’re recognizing the accomplishments of some of our authors, I’d like to toss a few more congratulations to this year’s Nebula Award nominees. SFWA announced the final slate in February and I’m very happy to see two Clarkesworld stories and one from Upgraded on the ballot.\nShort Story Nominee\n“The Meeker and the All-Seeing Eye” by Matthew Kressel\nNovelette Nominee\n“The Magician and Laplace’s Demon” by Tom Crosshill\nNovella Nominee\n“The Regular” by Ken Liu (from Upgraded)\nSpeaking of “The Regular,” you can also read this novella in the debut issue of Forever, a new all-reprint science fiction magazine that will feature a novella and two short stories in each monthly issue. You won’t find Forever online or in print, but you can get the ebook editions of the first issue available for free on my blog. Please download and give our first issue a try. If you enjoy it, I hope you’ll consider subscribing at Amazon, Weightless, or direct from our website.\nIn last month’s editorial, I outlined several of our goals for the next six months. All of these things were tied to being able to increase subscriptions, Patreon and Joyride support, and advertising. None of these things are easy, but I’m pleased to say that last month we reached a new Patreon goal, unlocking three more original stories for the 2015 calendar. With luck, we can build upon that success and continue to move this publication forward.\nThank you and have a great month!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}