{"fingerprint": "mG/YtSw/waaadbsaPkhqg3Yz3bk=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Come One, Come All by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_05_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Come One, Come All by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Come One, Come All\n I once again took to Twitter to find a source of inspiration for this month’s editorial and received several interesting suggestions. I could think of quick responses to several of them, but when I came across this one, it spoke to me.\n For as long as I can remember, I’ve been a science fiction fan: early on through TV—Lost in Space and yes, I’m enjoying the reboot—and later through books, film, and games. Overall, it’s been a very positive force in my life and an escape when I needed it the most, everything from being bullied for years as a child to dealing with a brush with death as an adult. The community surrounding it all, well, that’s been a more complicated relationship.\n I didn’t even know fandom existed until college. Before then, I only knew one or two people that even admitted to reading the same things I did. The more aware among my college friends organized a group trip to a local convention. I think there were seven or eight of us crammed into that hotel room—a situation that would normally have put me on edge—but I had a great time. I saw some of my favorite authors, found books I had been searching for for years, and was impressed that there were so many of us. I continued to go for a while after graduation, but it wasn’t the same without my friends and I didn’t feel particularly welcome without them. Disillusioned, I stopped going to conventions for nearly ten years.\n Despite this, my enjoyment of SF/F was never undermined. I had the advantage of feeling included in SF/F works from the very beginning. I could completely relate to Lost in Space’s Will Robinson and wanted very much to have a robot friend like he did. The characters in stories, books, games, etc. that shaped my connection to the genre for the first fifteen years mostly looked like me: white, male, with similar values and cultural references—even if those values and cultures were challenged. I even have the same last name—but not even a distant relation—to one of the biggest names in history of the genre. I can see how it might be different for someone who didn’t often, or ever, see themselves in the works they were exposed to.\n I then graduated from college with a degree in computer science and ultimately ended up working in higher education, where I had to play at being a futurist. It’s easy for me to connect the dots between my science fiction reading and the way I embraced that career. On the side, I started a small online science fiction bookstore and inadvertently began making new friends in the community from all over the country and even beyond. Eventually, I was convinced to give conventions another try. It seemed better than before, so I stuck around, but that uneasiness has always remained in the back of my mind. As the bookstore faded and the magazine rose, I earned something of a standing in the community, which means that people treat me differently than before. That uneasiness, however, has led to an awareness.\n But what does all this have to do with the original tweet?\n Science fiction has been very good to me on so many different levels. Why wouldn’t I want that for everyone else? This sentiment and the awareness I mentioned come with a responsibility to not be like those that made me feel unwelcome. It might be as simple as opening a circle—it’s common for a circle of people to form at conventions—and making room for a stranger to join in the conversation or holding the elevator door. The more socially-outgoing might even notice the stragglers at the edge of a party and engaging with them. (Admittedly, this has never been a strong suit of mine.) Casting the net beyond the local, it might mean writing an editorial about your own history or answering a question (politely) on social media, email, or a forum. It might even be as simple as supporting something like John Picacio’s MexicanX initiative to help bring MexicanX authors/artists/fans to the 2018 Worldcon. Little things add up.\n As an editor, the responsibility extends to making sure that people know they are more than welcome to submit stories and that they will always have a fair shot at being published here. It’s not always obvious how to do that or even when that work is needed, but as that tweet indicates, it is. Cover letters and submissions don’t often include demographic information, so sometimes you have to count on some common sense or the nudge from a third party. Some editors don’t take kindly to being nudged and some people don’t know how to nudge gently, but I have no control over those people. I need to focus on keeping my own house in order and if I end up with the best stories by keeping that door open, you can be sure that others will follow.\n And from experience, I can say that a lot of people feel left out or underrepresented, particularly in what gets published. There are benefits to breaking that pattern though. Our efforts in translation, for example, have always been met with a sustained increase in readers and submissions from regions represented by a story we’ve published. I’m sure the same goes for other communities as well, it’s just harder to confirm. It does say that they feel a bit more welcome, which is a good thing.\n A sad truth, however, in all this is that one cannot simply say they are open to everyone and expect that to be sufficient to change things. You can’t even say, “hey we’d love more submissions from LatinX and/or queer authors” (and this is very much true) and not have to follow it up with “and everyone else is still welcome too” because some will wrongly assume your statement indicates favoritism. I’ve heard this one a lot as I’ve targeted increasing our international submissions, which has, I’ll point out, resulted in an increase in the number of foreign writers in our pages. No special treatment for the stories, just an encouragement to submit. In the end, they earned their place against all the rest. Oh and I know some will say, “but that is not enough.” Maybe it isn’t, but it is progress. At times, it can feel like no one is allowed to have nice things, so I’ll gladly take each small victory and keep moving forward.\n Simply put, to find the best stories, you have to cast the widest possible net and sometimes that requires outreach—behind the scenes or from a soapbox. The job is never done. You never know where the next great story or writer will come from. No one group has a monopoly on quality. Why would I want to limit my options to people just like me? Why wouldn’t I want those writers, stories, and readers to not have a home in Clarkesworld or even in the broader community? And why wouldn’t I want everyone to have the same opportunities and enjoyment I’ve had?\n Or, as my trusted robot friend says, “Does not compute!”\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}