{"fingerprint": "J3wDQTzCdk+/rv55NT2ehq20fYs=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Focus Neil, Focus by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_05_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Focus Neil, Focus by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Focus Neil, Focus\n Maintaining any semblance of motivation during this time period has been hard, certainly, and dealing with an unidentified uneasiness/anxiety has not been fun. Deadlines particularly have been difficult. I know I’m not alone in feeling this way. When I find the strength to tackle the slush pile, I can’t help but notice a few things: pandemic stories, a complete change in normal submission patterns, and a larger number of authors submitting their first story.\n Pandemic Stories\n This isn’t in the least bit shocking to anyone who knows anything about slush piles. They always fill up with a hot topic when one exists. Well, we all saw this one coming and I’d say that we’re probably at peak right now. I’m not ready to say, don’t send us these, but you’ll really have to break the mold to get through to us with a pandemic story right now. Happily, I can report that some authors are pushing beyond our current situation and portraying a path forward that isn’t political or dystopian. Oddly enough, some have even made it, for lack of a better word, fun. It doesn’t surprise me to see a quirky sense of humor being used as a coping mechanism, but seeing it used well, does.\n Submission Patterns\n I pay a lot of attention to the volume of submissions we’re receiving and where they are coming from and I’ve never seen it quite like this. There’s rarely what I would consider a “normal” day lately. The volume is usually way up or way down on any given day. No pattern, though there might be one if I paid closer attention to the news. I’m hearing from a lot of authors who are having problems getting words on the page. I’m pretty sure the distraction I’ve been suffering from is the same culprit feeding those lows.\n First Story Submissions\n This observation is solely based on reading cover letters. With so many people working from home or having lost their jobs, a lot of people are finding the time to pursue that dream of writing that has been on the backburner under normal conditions. Some are providing detailed information about their situation and while I normally like brief cover letters, I’m finding their passion for following a dream—or distracting themselves—in “these uncertain times” uplifting.\n By the way, any time I talk about first time submissions, I feel the need to say a few things about them. It’s not uncommon for people to believe that editors only want stories from “name” authors, but that’s not something I’ve observed with the magazine editors I’ve known over the years. By and large, we all love to be the editor who published someone’s first sale. It’s probably the most rewarding part of our job. I’ll even go one step further and say that it’s an editor’s responsibility to the field, and their own publication, to find new voices and publish them. After all, embedded in the spirit of science fiction is a need to move forward. New authors are an important part of that process and short fiction leads that wave.\n If you are one of those first time authors that has sent us your stories in the last couple of months or have pen to paper right now, please know you are welcome and we’re excited to hear from you. Statistically speaking, sadly, most of you probably won’t sell us a story, but we admire and respect the attempt and encourage you to keep trying and hope to work with you in the future!\n And with that, I think I’ve said all that I’m capable of for the moment, beyond a special shout out to our twitter followers who provided some suggestions for this editorial. I didn’t take one in particular, but a few ended up shaping things as I wrote. Thank you and stay safe!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}