{"fingerprint": "xvn9PrdWRNplfKoAQFtvI/VC+VQ=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Staring at the Ceiling by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_11_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Staring at the Ceiling by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Staring at the Ceiling\n I started off the year with uncertainty. I knew I was heading into risky surgery that would result in weeks of recovery, so I decided that we’d start 2020 simple at Clarkesworld. No extra work. No new projects. Maintain the status quo. I decided that I wouldn’t need the extra stress and despite that, I still ended up with more than I could handle.\n By the time I was feeling like myself again, we could already see the early signs of the COVID-19’s arrival here in the US. Several overseas friends—located in places that were further along the curve—gave me plenty of reason to be concerned. It seemed wise to continue keeping Clarkesworld on its present course under we had a better handle on how this would shake out. As we all know, things got worse, so in retrospect, the caution was well-placed.\n Nothing has been business-as-usual. Readership, listenership, subscriptions, and story submission numbers have been up, down, and sideways from week-to-week. The whole industry has been disrupted in myriad ways. While mainly worried about staying healthy, there was real concern for how this could impact Clarkesworld in the short- and long-term. The waters aren’t calm yet, but I think I’ve found my sea legs.\n The year has left me exhausted and most nights I find myself having difficulty sleeping. I’ve taken to using some of that ceiling-staring time to drift back into brainstorming and dreaming about the things we could or should be doing here. If I’m not moving forward, I feel like I’m falling behind. Standing still isn’t my style, so off I go . . .\n Historically, magazine publishing has always been very regional. They’d publish, print, and sell your issues domestically. Some issues might be sent a bit further away, but those readers represented a very small fraction of your audience. That reality was a defining characteristic that consciously or subconsciously shaped publishers’ priorities and direction. They are, after all, in the business of pleasing their customers, and in that context, how you identify them matters. With the arrival of online and digital publishing, the cart was turned over, but nothing really changed. For many, there’s comfort in the status quo.\n I’m not alone in advocating that the field, particularly here in the US, needs to adapt. I can’t make it change, but I am, however, in a position to practice what I preach or make it part of who we are. I’d like to think that we’ve made progress in that direction. I made a conscious decision several years ago to start framing our planning around being an international or global—yes, yes, English-language—publication. It’s me acknowledging the entirety of our audience and potential audience.\n Audience not only includes readers, but also writers seeking homes for their work. The two are closely interlinked. We accept that good stories can come from anyone anywhere, domestically or abroad, in English or other languages. No country, state, town, or individual owns science fiction. None should.\n That said, lying there staring at the ceiling, I mostly see the long road ahead. There’s one point that I keep circling back around to as a problem and that’s the “English language only” in our submissions guidelines. As a monolingual editor with a limited budget, it’s not shocking that this is present in the guidelines, but uncompromisingly expecting others to speak your language—or that they find someone to translate for them—isn’t exactly compatible with our goals. It turns language into a barrier.\n Despite that barrier, we’ve managed to publish many more translations than most of our English language colleagues. Some of that is thanks to creating a welcoming environment for translations and the translators who have submitted those works in English. A larger portion of that, however, is the result of some significant help from organizations, like Storycom, and a process we’ve spent several years developing and refining. That has allowed us to accept and translate over fifty works originally written in Chinese, and in 2019, we applied a similar method to publish nine stories from South Korea.\n I’ve learned a lot from these experiences and they have contributed bits and pieces to a possible next step in dealing with the barrier problem. I’ve been bouncing various ideas off people for months now and sometime in the second half of 2021, we’re going to try something new to us: an open submission period for stories written in Spanish, a language I cannot read.\n Why Spanish? It’s a very widely spoken language and it’s also easier for us to quickly recruit the people we’ll need for the team. I’m pushing the date out that far because I need to do a few things first:\n \n Assemble a team of Spanish-language slush readers and train them\n Translate submission guidelines, contracts, letters, and the submission system interface\n Recruit translators\n Provide ample time to spread the word within Spanish-language communities around the world\n Select an interpreter (communications)\n \n The submission window for this trial will be one month, maybe two. That should be sufficient time for us to evaluate and make any changes for future iterations of the project. If successful, the goal is to build teams for several languages and cycle through them as our workload and finances permit.\n While there will be a separate interface for Spanish-language submissions, Spanish- and English-language submissions will be effectively part of one submissions pile held to equal standards. There are no quotas, maximum or minimum, for the number of stories we accept from the slush pile. In a sense, it’s best to just think of this as an increase in the volume of submissions for a period of time. Stories accepted in either language will be added to our general inventory, scheduled, and published throughout the year.\n The only significant difference for authors submitting work in Spanish will be that we anticipate a slightly longer response time due to problems inherent in working in two languages with editors that can only read one.\n This whole project is still very much in the preliminary stages, but I’m happy to talk with anyone who is interested in the project or even helping out in some way. It’s also important to note that we’re clearly not out of the woods with COVID here. We’ll do what we can and adjust if it becomes necessary.\n I should also mention that there’s a financial component in a project like this. Starting small allows us to better determine the potential impact. We don’t have plans to run a Kickstarter or anything like that, but we will be looking at all our options. I figure they’ll be occupying a portion of my insomnia-based planning sessions for the next couple of months. Let’s just say that if you aren’t a current subscriber and a project like this excites you, that now would be a really good time to subscribe!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}