{"fingerprint": "c/b7LegD/hzOvLjqCy24G1syulM=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: On the Road to One Hundred by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_01_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: On the Road to One Hundred by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: On the Road to One Hundred\n As 2014 has come to a close, I wanted to take a moment to thank you for a wonderful year.\n We started the year by making the announcement that we were no longer eligible for the Hugo Award for Best Semiprozine. We crossed that magical twenty-five percent income line in the sand and became “professional” in Hugo terms. We went out on top (as 2013 winners) and I was once again nominated in the Best Editor Short Form category, where I eventually lost to Ellen Datlow.\n Clarkesworld, however, is still in that grey area of what makes one professional. 2014 saw us pick up our fourth World Fantasy Award nomination in the Special Award Non-Professional category. In simple terms, we land there because none of us work on Clarkesworld full-time. That remains an elusive goal, but I refuse to give up. In the end, four turned out to be our lucky number. In November, we won our first World Fantasy Award.\n As we put together a wish-list of authors we’d like to see return for our one hundredth issue, there was one we desparately wanted, but seemed unlikely. Jay Lake was one of the first authors to write for us and was a regular for several years. His support meant a great deal to me and his stories were always something special. Sadly, Jay passed away in June, much too young, and at the hands of cancer. Some months later, we discovered he left behind some unpublished stories and that it still might be possible for him to be with us one last time. “An Exile of the Heart” is one of those stories. Thanks Jay. You are missed.\n In September, I published my first non-Clarkesworld anthology, Upgraded, and it almost immediately went into a second-printing. Tying my medical adventures to a cyborg theme was fun and a great learning experience. In retrospect, there are a few things I would have done differently, but I remain proud of the book. Now I just need to come up with an idea for the next anthology. Any thoughts?\n I also spent several months last year working on secret projects. One was eventually revealed as a partnership with Storycom in China and resulted in a Kickstarter campaign to add Chinese translations to each issue of Clarkesworld. The campaign was very well received and surpassed expectations by unlocking a stretch goal that will help us include stories from other languages as well. This issue features the first of our Chinese translations, “Ether” by Zhang Ran. A special thank you goes to our Kickstarter supporters and Storycom for making this possible.\n In December, Clarkesworld became a launch partner with the Joyride podcast app. Joyride has created another way for our listeners to help us work towards goals by supporting us with a monthly pledge. Joyride has big plans and they will be one of the featured apps in the Android Auto Platform currently rolling out to nearly thirty car brands. This increased visibility for our podcast and the opportunity to bring in some extra revenue will be very important to us in the years ahead. We’re very grateful to have been invited and thank everyone at Joyride for their faith in us. Check out our Joyride page and let us know what you think.\n Speaking of revenue, there’s someone else I should thank for their support in 2014: our subscribers, patrons, advertisers, and donors. Throughout the year your support made it possible for me to continue doing a job I love, work towards that goal of being full-time, and even set aside a little extra to make sure this issue was special. Thank you.\n Last, but certainly not least, a huge thank you to everyone that works on Clarkesworld. One hundred issues is a huge accomplishment and it took all of us to get here.\n Happy New Year and I’m happy to welcome you to our one hundredth issue!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}