{"fingerprint": "i3A+NyIkR0WBPXhKAae8SFnqrVc=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Year Seven by the Numbers by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_11_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Year Seven by the Numbers by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor’s Desk: Year Seven by the Numbers\nIn June 2012, I wrote an editorial for the data junkies and people who wanted to get a snapshot of the data we have about Clarkesworld. Since then, I’ve received numerous requests to reprise the research as an annual “year in review.” As we’ve just finished up our seventh year of publication, I thought this would be a good time to look back at that year. Unless otherwise specified, all of the information below is based on data collected between October 2012 and September 2013.\nWhere the Stories Come From\nUnlike our early days, the majority of the stories we publish are unsolicited and submitted to us via an online form. This is commonly referred to as the slush pile. In year seven, we received 9241 stories and of those, we purchased thirty-two, an acceptance rate of 0.35%. On average, authors received a response from us in less than three days.\nDespite the slush pile favoring men 71% to 29%, 65% of the purchased stories were written by women. In our seventh year, we published thirty-six stories—some were purchased outside this window or solicited directly from an author—and 68% of those were written by women.\nHistorically, it stands up to prior years as follows:\nWe’ve always been off the norm for science fiction magazines, but last time the balance shifted like this, we took some flack. You have to keep in mind that slush pile data is quantitative, so it doesn’t cleanly map to a qualitative process like selecting stories for publication. This data suggests that women were better at sending us the type of stories we were looking for this year.\nOne thing I noticed was that about half of our female contributors had sold stories to us before and most of the male authors were new to Clarkesworld. While it would be nice if our male regulars were more active, overall I can’t complain about the quality of the stories we are receiving.\nThis year, we bought:\n22 Science Fiction stories (of 3619 submitted)\n5 Science Fiction + Fantasy stories (of 698 submitted)\n3 Fantasy + Horror stories (of 893 submitted)\n3 Fantasy stories (of 2464 submitted)\n1 “Other” stories (of 274 submitted)\n0 Horror stories (of 836 submitted)\n0 Science Fiction + Horror stories (of 457 submitted)\nNote: Genre identification was done by the author at the time of submission. I’m not going to get into the “what is real SF?” fight.\nOverall, men were more likely to write science fiction, women were more likely to write fantasy and horror was extremely male-dominated. There wasn’t anything unusual when compared to other years.\nSome other miscellaneous slush pile nuggets:\n- Men favor submitting stories on Monday/Tuesday\n- Women favor Tuesday/Wednesday\n- Saturday is everyone’s least favorite day to submit a story\n- We received 929 submissions in August 2013 (new record)\n- We rejected 920 submissions in July 2013 (new record)\nSocial Media\nMost of our marketing efforts are centered on social media. At the moment we have 6603 likes on our Facebook Page and 9872 followers on Twitter. While Twitter doesn’t share data with us, Facebook does provide some demographic information about the people that like our page:\nIn June 2012, we had 3500 likes and women made up 33.5% of that population. We’ve picked up more than 3000 new likes in the last year and it appears that our male Facebook audience is growing faster than our female Facebook audience. Facebook claims that 55% of their users are male, so that doesn’t seem unreasonable. The current numbers line up nicely with our submissions data as well.\nAs you can see in the above chart, the majority of Facebook audience falls between the ages of 25 and 54, with the largest concentration between 35 and 44. Overall, there doesn’t appear to be a connection between gender and age. Given that Facebook’s largest community of users are between the ages of 18 and 24, it would appear that we aren’t connecting as well with that group. Without further research, we have no way of determining whether or not this indicates a lack of interest on their part or a marketing problem on ours. It is certainly worth looking into.\nAround the World\nOne of the advantages of publishing a digital magazine is international distribution. People from all over the world read or listen to our stories, but where are they? Facebook claims our top five countries are: USA, UK, Canada, Australia, and Ireland. Our website statistics indicate that our web-based readers are from USA, UK, Canada, Australia, Germany, China and 191 other countries, 9% of which use browsers with languages set to something other than English. Libsyn, the service that hosts our podcast files, claims that our top five countries USA, UK, Canada, Australia, and China. The big surprise in this year’s data was discovering Iran in sixth place among podcast downloads.\nReading\n- According to a very conservative interpretation of our web statistics, Clarkesworld has an average online readership of approximately thirty-three thousand.\n- Our podcast has between six and seven thousand listeners per month and each story picks up at least another two-to-three thousand listeners over the next eleven months.\n- Two thousand seven hundred readers are paid subscribers to our ebook editions at Weightless Books and Amazon. Our iPad, iPhone and Android apps just launched in October, so they’ll count into next year’s data.\nAll of these groups are likely to have some overlap with one another, so I use the thirty-three thousand number as the safe estimate of our overall readership. Some other quick facts about our readers and their habits are:\n- December is the month with the lowest average daily readership.\n- September was the highest.\n- 60% of the visitors to our website are using Windows, 20% Mac, 11% IOS, and 7% Android.\n- Chrome is the browser of choice for most of you, taking a 35% share with Firefox (24%), Safari (19%), and IE (10%) following behind.\n- For podcasts—iTunes dominates with over 50%. Nothing else is even close to competing.\nBusiness Data\n- Only about 8% of our readers have paid subscriptions.\n- 0.5% donate any amount.\nDespite those low numbers, these are the people that keep Clarkesworld afloat. Our other revenue streams—advertising, the annual anthologies, print issues, etc.—contribute to the bottom line, but in-total, they only covered the expense of a single issue.\nI’ve mentioned a few of our goals in past editorials. This is what it would take to accomplish them:\n- To add that long-awaited fourth story in each issue, we need to convince another 1% of our online readership to subscribe.\n- When 15% of our current readers have subscribed, our staff pay will reach the level where Clarkesworld will become my full-time job.\nI don’t doubt that some people will try to use these numbers to demonstrate how awful giving away free content is for business, but that ignores the inherent marketing value it provides to Clarkesworld and our authors. I won’t pretend that it isn’t just the tiniest bit frustrating, but it isn’t unexpected and I continue to have faith in this business model.\nSo that’s a quick look at the numbers for last year. If people are interested in getting more details or discussing what I’ve shared, I’d be happy to have that discussion in the comments area on our website. Next month, I plan to continue talking about what it takes to produce an issue of Clarkesworld. Numbers alone will never give you the whole picture.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}