{"fingerprint": "gIB5O26TO+psSF0UxKFXoVvK6HE=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Post-Apocalyptic Publishing by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_09_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Post-Apocalyptic Publishing by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Post-Apocalyptic Publishing\n In anticipation of our seventh anniversary issue next month, I’ve been trying to compile my thoughts on what we’ve done and where we’ll be going. It’s been a fairly chaotic time for magazines and publishing in general. I suppose that’s one of the reasons I’ve enjoyed it as much as I have. In the grand scheme of things, Clarkesworld is still a child, but digitally speaking we’re older than most.\n My mind wanders sometimes when I think of these things. It can be dangerous when your imagination runs wild and casts digital publishers in a post-apocalyptic series as a rag-tag group of kids adapting to a new world in which no one thinks they can survive . . .\n Episode 0: A New World – Pilot, Unreleased\n Only available as a bonus feature on the Director’s Cut DVD. This episode was considered too harsh by executives due to its gritty portrayal of the high mortality rate amongst the children in the early years. Some footage from this episode was later retooled for use in flashbacks throughout the series.\n Episode 1: The Elders\n Originally scheduled as episode two, “The Elders” was moved because network executives felt that this would make a more accessible entry point in the absence of the pilot. The story centered on the children’s discovery of a bunker in the ruins of a city. Upon exploration, they are captured by “elders” and introduced to a shadowy corporate-type figurehead that was supposed to become the big baddy of the series arc. Several minutes are spent on his Paper Empire monologue. This speech provided many fan favorite quotes, including “Bow down, you pixel-stained technopeasant wretches!” and “Webscabs! Each and every one of you!” With the help of a few sympathetic elders that had been waiting for someone to show them the way, the gang escapes, but only after a lengthy chase scene.\n Episode 2: Exposure\n Since this episode was originally scheduled to be before “Elders of Publishing,” none of the characters introduced in that episode are featured in this one. Instead, the gang crosses paths with a Love Cult that keeps its followers in check by addicting them to a blue and glowy drug called “Exposure.” The gang spends most of the episode trying to corner various members and convince them that there is more to life than exposure. Originally, this episode was to feature a cameo by Harlan Ellison as the owner of a rehab clinic, but his deprogramming scenes were considered controversial and inevitably cut. Fans of the show have developed complex conspiracy theories about this still lost footage.\n Episode 3: To Serve for an Eternity\n The first episode shown in intended order, “To Serve for an Eternity” features the kids coming across one of the Elder camps and discovering the evils of contractual slavery. Network executives uncomfortable with the portrayal of the conditions insisted on edits that would eventually lead the director to resign. What results is a mish-mash of corporate propaganda and pontificating on the rights of others, but no real resolution. Universally disliked by fans.\n Episode 4: Utopia\n Mercifully, “Utopia” was the last episode of the series to be filmed. By this point in the series, most of the writing staff had resigned over professional differences caused by network micromanaging. The inclusion of a performance of “Pixels of Sunshine” by failed boy band Digitally Speaking, was the direct result of a five-minute air time shortage and network nepotism. The band’s vacant lip-synching had the unanticipated effect of making their portrayal of the Shangri-La society a bit creepy and uncomfortable. As the show’s original Director said, “Like a gift from the gods, the show’s executives screwed up so badly that the fans finally got to see what we had originally intended for this series.”\n As you can see, I’m having some focus issues today.\n Where was I? Oh yes. Let’s just leave that for next month, when we can celebrate Clarkesworld’s seventh anniversary, reminisce about where we’ve been, and speculate on where we’re going.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}