{"fingerprint": "eQrK2m3DeZxsKxfScQOk3PcmX74=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Professionally Speaking by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_09_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Professionally Speaking by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Professionally Speaking\n I’m quite happy to report that since the last issue, I have not seen the inside of an emergency room. I’m still on the mend from my heart attack, but doing well enough to keep my doctors pleased.\n I had hoped to spend the first weekend in September in Chicago, the site of this year’s Worldcon and the Hugo Award Ceremony. Instead, I’m spending the weekend at home. It would have been nice to meet with friends and participate on panels, but given my current situation, several people expressed concern about attending the Hugo ceremony. They are most likely correct.\n I’m very grateful to be a nominee this year and would have loved to have participated. Award ceremonies can be stressful, even when you don’t expect to win. Should I win, I’ve asked Kate Baker to attend on my behalf. It’s not fair to ask someone to do that unless you are prepared to give them an acceptance speech to read. My first draft simply read, “If anyone out there is watching the ceremony in NJ, please have them send an ambulance to my house.” The final version was more appropriate.\n Speaking of awards, the World Fantasy Award nominees were announced a few weeks ago and we received some great news (that I obviously survived):\n \n Best Short Story Nominee: “The Anarchist Wasps and the Cartographer Bees” by E. Lily Yu, Clarkesworld issue #55\n Best Novella: “Silently and Very Fast” by Catherynne M. Valente, Clarkesworld issues #61-63 and WFSA Press\n Special Award, Non-Professional: Kate Baker, Neil Clarke, Cheryl Morgan & Sean Wallace, for Clarkesworld\n \n This is the third time we’ve been nominated for a Special Award and, as usual, the competition is pretty tough. What makes us eligible for non-professional status? The easiest way to put it is that none of us do this for a living. After any significant life-threatening event, like a heart attack, you’ll end up spending a lot of time reevaluating your priorities in life.\n I’ve always dreamed that someday Clarkesworld would reach the point where the staff and I would get paid a reasonable wage. That dream has evolved into something more concrete. Becoming “professional” is now a goal.\n To my knowledge, there hasn’t been an independent online magazine that has successfully made the jump to paying authors and staff professional rates without dipping into the publisher’s pockets or becoming a patron of some other organization. This doesn’t mean it can’t be done.\n In fact, with our current infrastructure for esubscriptions via Amazon and Weightless Books, it’s within the realm of possibility. Increasing our subscriber base, improving the stability of our advertising revenue, and restoring our annual anthology series are all important steps towards achieving our goal and I believe they can be accomplished without sacrificing what we value in this magazine.\n So now you know what I’ll be doing in the background for months to come. If you’d like to help, here are a few things you could do:\n \n Tell friends about our subscription options on your blog, Facebook, Pinterest, Twitter, Goodreads, etc. Let’s try to hit two thousand subscribers by the new year!\n Write a nice review over on our Amazon subscriptions page (more important than you might think)\n Recommend potential advertisers to us\n Subscribe or purchase our books, if you don’t already\n Offer to deliver promotional materials to conventions\n Send us your marketing ideas\n Comment on a story you enjoyed\n \n If you’d rather just read and enjoy, that’s great too! Thanks for your continued support and I hope that we continue to earn it in the future.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}