{"fingerprint": "A8zP+9OZ2JJArSXdgWr47iaftJg=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: 2021 Reader's Poll Finalists by Neil Clarke", "author": "Neil Clarke", "date": "2021-01-01", "source": "https://clarkesworldmagazine.com/clarke_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: 2021 Reader's Poll Finalists by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: 2021 Reader's Poll Finalists\n In late January, we held the first phase of our annual Clarkesworld Magazine Reader’s Poll for best story and cover art. Maintaining the model we’ve used in recent years, the nomination phase took place online and lasted just under two days. The narrow window has proven an effective tool in our efforts to minimize the effects of ballot-stuffing and campaigning. We did observe a slight increase in efforts this year, but even removing those, this year’s poll had our highest participation levels ever.\n This year, it was never apparent which works were destined to become finalists. Everything was in flux right down to the final hours. In the end, ties in the fiction category yielded eight finalists. As in the past, we’ve chosen not to implement a tie-breaker and have passed all eight stories into the final round. We missed having a similar situation happen in the art category by one vote, placed in the final minutes of voting.\n Without further ado, here are this year’s finalists presented in alphabetical order:\n Best Story\n \n “Philia, Eros, Storge, Agápe, Pragma” by R.S.A. Garcia (Novella, 1/2021)\n “Homecoming is Just Another Word for the Sublimation of the Self” by Isabel J. Kim (Short Story, 3/2021)\n “The Failed Dianas” by Monique Laban (Short Story, 2/2021)\n “You Are Born Exploding” by Rich Larson (Novelette, 12/2021)\n “Sarcophagus” by Ray Nayler (Novelette, 4/2021)\n “Yesterday’s Wolf” by Ray Nayler (Short Story, 9/2021)\n “The Cold Calculations” by Aimee Ogden (Short Story, 12/2021)\n “Bots of the Lost Ark” by Suzanne Palmer (Novelette, 6/2021)\n \n Best Cover Art\n Congratulations to all our finalists!\n Now it’s up to you to pick the winner in each category. Go to:\n And rank the stories by your order of preference. Voting will close on February 15th at 8PM EST and the winners will be announced in our March issue.\n Speaking of awards, Chicon 8—the 80th World Science Fiction Convention—has opened the nomination period for this year’s Hugo Awards. Since there are still a few people who continue to nominate Clarkesworld for Best Semiprozine, I’d like to once again remind you that we haven’t been eligible for that award for a long time. Give your nomination to one of the many fine semiprozines out there instead. You can find a list at semiprozine.org.\n Beyond that, at present, there isn’t a category for professional magazines, but you can always nominate me for Best Editor Short Form if you are so moved, and of course, all our original fiction is eligible in their respective categories. The list of those works and the appropriate category for each story was included in last month’s editorial at clarkesworldmagazine.com/clarke_01_22. Our 2021 cover artists are also eligible in the Best Professional Artist category.\n Speaking from experience, I can tell you that each little nod you give means a lot. Recognition doesn’t pay the bills, but it has value, particularly after the rough couple of years we’ve all had.\n Thank you and happy voting!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}