{"fingerprint": "A20qZ+g7MBeA+Dv7CV97hpVJD6U=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Next Hundred by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_02_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Next Hundred by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: The Next Hundred\nLast month, we published our milestone one hundredth issue. Today, we start on the path to the next hundred. Unlike last time, I can start this journey knowing Clarkesworld can make it there, but I’d be foolish if I claimed I knew what it will look like when we arrive. Our first hundred happened during a time of immense change for both print and digital publishing and it doesn’t look like that turmoil is over. I’ll put money on that continuing to be a good thing. Coming from a technology background, I’ve always viewed change as an opportunity.\nWhen we just focus on the next year or so, it becomes easier to describe what we’d like to see happening. If you’ve paid attention to our Patreon, Joyride, or Kickstarter campaigns, you’ve already caught a glimpse of that agenda, but let me break it down here for you.\nInclude Four Original Stories in Each Issue\nAt present, we’re alternating between three and four original stories per issue. The fourth story has been funded by our Patreon supporters, who, at this moment, are within fifty dollars per month of funding three more stories per year and three hundred short of achieving the complete goal.\nInclude a Translated Story in Every Issue\nI’ve already made my position on the importance of translation clear in a previous editorial. Last year’s Kickstarter campaign helped us secure our first-year funding for a translation slot, but we want this to continue. To ensure the future of this program, we need to make a focused push to increase our subscriber base.\nOther Fiction Changes\nAt this time, I don’t have plans to increase our original fiction content past the five mentioned above, but when the budget can sustain it, the length cap will be raised. Over the last year, several of our reprints have crossed into the ten thousand word territory. Call it an experiment or a taste of things to come.\nChanges and Improvements to Our Podcast\nSince Joyride is podcast-oriented, we’ve mentioned a few of our plans for this area over there. Our first goal there is to build a budget to allow us to make improvements to the quality of our audio. That covers everything from better equipment and software to hosting costs for higher quality audio files. There is always room for improvement and we want to make sure we can provide the best we can for our listeners.\nAfter reaching that first goal, we’re going to work on content-related projects like making sure the audio budget for the translations is in place and bringing some of our non-fiction content over to the podcast.\nThe Future of Our Non-fiction\nDue to time considerations, Daniel Abraham has stepped down from his every-other-issue commitment to our Another Word column. We’re sad to see him go and wish him all the best, but his absence will have an impact on the future of the column. We are currently evaluating what direction we should take next and you may notice some experimentation over the next year.\nYou might have noticed that we have two interviews this month. Expect this to happen a bit more often in the future. The focus on these will be foreign authors and artists. I’m particularly interested in featuring them in some way and think this is a good way to spotlight them.\nAs I mentioned, we’d also like to produce non-fiction content in the podcast. Just reading the article from our issue might be ok, but when we go in that direction, I’d like to see something that embraces the medium and discusses the article. Maybe we could do a live Q&A that is released later as a podcast. There are a lot of opportunities to do something different and some of those will likely bleed back into the way we publishing the material in text form.\nSubscriptions & Anthologies & Print Issues\nThis month, we started offering people the opportunity to subscribe (or give gift subscriptions) directly through us. We’re employing the infrastructure that we created to provide our Kickstarter rewards, but have plans to expand upon it as more people use it. If you have an existing subscription elsewhere, we don’t want you to drop those and switch. That would impact our sales rankings at those sites and maintaining or improving those values is important to attracting new subscribers. We’re aiming this system towards the first-time subscriber.\nOur annual anthologies are going to continue to be published in print and ebook formats. Starting with Year Nine, the volumes will be split into two books due to size. Year Seven (February 2015) and Year Eight (July 2015) will be single volume books.\nDiscussions about print subscriptions are ongoing. We will offer them in a more convenient way, but shipping costs remain a concern and will have an impact on pricing. Some of our readers have made it clear that we should aim for the best we can do and then let them decide how much is too much, so that’s what we plan to do. It could be another month or two before we have this nailed down.\nStaffing\nWith the exception of some changes or additions to our regular slate of interviewers or narrators, I don’t foresee any changes to our staffing. The long-term goal for this category remains pay increases. I made this a top priority after my heart attack and while we’ve made gains in this area, we still have a long way to go. As I’ve said before, if we convert just ten percent of our non-subscribing readers, we can achieve this and many of the goals mentioned above.\nFunding\nEvery now and then a concerted push is needed to move an organization forward. To that end, here are our six-month goals for funding:\n- Increase subscriptions by five hundred (less than 1.5% of our readership, securing translations and minor pay increases for staff)\n- Reach the $1000 goal at Patreon (securing our fourth fiction slot)\n- Reach our $250 goal at Joyride (establishing our podcast improvements budget)\n- Fill all advertising slots on website (staff budget)\nYou’ve been on this road with us and I thank you for your support and feedback. If you would like to help us or just give some thoughts on our plans, please drop me a line at neil@clarkesworldmagazine.com.\nSpeaking of feedback, our annual Reader’s Poll and Survey is up! Please vote for your favorite 2014 Clarkesworld story and cover art. Results will be published in our March issue and a few lucky voters will be given copies of Clarkesworld: Year Seven!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}