{"fingerprint": "UvaFU8V0+MELWlGlsEBxgxj5mhg=", "sitename": "Clarkesworld Magazine", "title": "Helping Hands: Fairylands, Boneshops and More by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_07_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Helping Hands: Fairylands, Boneshops and More by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Helping Hands: Fairylands, Boneshops and More\n It seems that times are tough right now. I know several people who have found themselves without a job, less work than normal, or forced to take pay cuts. I’ve heard from colleagues, at the school I work for, that charitable donations are down and I can say with authority that we’ve seen fewer donations to Clarkesworld in recent months. I could focus on that, but I’d rather draw your attention to something else for a moment.\n I have a great affection for the people I’ve had the pleasure to work with through Clarkesworld, and in recent months, that little family has seen its share of trouble. If you haven’t already heard, these tough times have hit two of our own particularly hard. I’m talking about Catherynne M. Valente and Tim Pratt, two very talented authors whose short fiction and articles have graced our pages. Layoffs have taken their toll on both.\n Catherynne details her situation on her blog:\n So we sat down last night and did numbers. And the raw fact is, we don’t have enough for rent next month, we are behind on all our bills, and in a couple of days, we won’t have any money for food.As bad as things have been at times, in my adult life, I’ve never been in this situation. I don’t know what to do that I haven’t done, I’ve been working constantly trying to make enough money to survive. The depression level in this house of late has been truly epic.I hate doing this. I hate asking for help. I don’t want you all to think that I’m selfish—there are people so much more worse off than me—or that I’m lazy or entitled.\n Instead of putting a hand out and asking for your money with nothing in return, she decided to take an approach similar to what Clarkesworld and many other webzines have done . . .\n \n Starting Monday, I will start posting chapters of a full-length novel version of The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making. I will be writing it in real time, posting every Monday. It will be free to read—but please know that the sheer calories to make my brain create it require funding, and I would very much appreciate your support. Pay whatever you like for it, whatever you think it’s worth. It’s kind of like an old-fashioned rent party. There’s a button at the bottom of the post to start things out.\n This is a book about a little girl named September who gets herself a ticket to Fairyland on the back of The Green Wind and a somewhat cranky Leopard. There she discovers the realm of the capricious Marquess and the dangers of the Perverse and Perilous Sea. It is going to be something else.\n And yes, you can read it to your kids. This is my first available YA novel, and everyone can read it for free.\n \n Sound familiar? Just like us, she’s adopting free online fiction as a business model. Unlike working with a publisher however, she has no guaranteed minimum payment. On the upside, every penny that comes in (minus the cut taken by Paypal) will go to her.\n A short while later, Tim Pratt and his family also ran into trouble:\n \n My wife was laid off from her job yesterday. She’s looking for a new one, and for freelance work. She’s been a catalog and website copywriter, and a buyer, for the past eight years; she also has office manager/admin experience, and can write pretty much any kind of copy. If anybody knows of good paying gigs, drop me a note. Ideally in the SF Bay Area, for go-into-an-office jobs, though we’d be willing to entertain suitably juicy options farther afield. We have enough savings to get us through a couple of months, but if something doesn’t turn up by then, things will get extremely difficult.\n . . .\n Keeping a roof over our heads is priority #1. Keeping up with our 19-month-old son’s medical bills is priority #2, since he has an ongoing chronic medical condition that requires examinations under anesthesia by a specialist, and occasionally surgery, at least a couple of times a year. Not to mention the constellation of pre- and post-operation visits. So I’m exploring my financial options.\n \n Once again, a reader-supported fiction model arises as a potential supplemental income stream:\n \n I could have just straight-out asked for financial help—and for those who’ve offered that, thanks, it’s appreciated—but I’m a writer, and if there’s one thing I have in ample quantity, it’s stories to tell.\n Specifically a story I’ve been wanting to write for a while, but couldn’t find the right market for: a longish piece about the early adventures of my series character Marla Mason.\n Bone Shop is a serialized, donation-funded urban fantasy novella, available for anyone to read for free. New chapters will go up every Monday. The Bone Shop website is here, though there’s not a lot there at the moment. I’ll post the first chapter on June 29.\n \n The tip jars are out. They are out for Catherynne and Tim. They are out for Clarkesworld, Strange Horizons, Beneath Ceaseless Skies, and other publications that derive some or all of their income from donors. They are out for PBS and your alma mater. They are everywhere and there is no way you can help everyone, or in some cases, anyone. Giving, even small amounts, means a lot to the people who receive them. It adds up and becomes significant numbers.\n However, when you can’t give or have given all you can, you can still help by spreading the world. Spreading the word about user-supported fiction is easy and requires only a little of your time. So, aside from telling you to go read Catherynne’s and Tim’s wonderful new stories and asking you to consider tossing a coin in the hat, I’m going to ask you to pick three or four online fiction ventures and (if you can):\n \n Write a review or tell people about them on your blog. Pretend it’s a meme if it makes it easier. Pretend it isn’t if memes make you ill.\n Link to a story or the main site on Facebook and Twitter.\n Get an account on Stumbleupon and give “thumbs up” recommendations to your favorite works. (Honestly, this one is huge. A single recommendation can trigger a storm of new visitors.)\n If you are already doing these things, thank you, now go encourage others to do the same.\n Use your imagination and try something else I haven’t mentioned.\n \n Give it a try. Sometimes, tough times can be eased by the simple measures of a group of individuals. When you’re done, come back here and tell us of your accomplishments in the comments. I look forward to hearing your experiences . . . and to better days for us all.\n Thanks.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}