{"fingerprint": "xhjkuCRMloNOpTLlLzgy4aF4DQ8=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: I, Cyborg by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_11_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: I, Cyborg by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: I, Cyborg\nSometime in the next month, I will become a cyborg. My “upgrade” won’t be anything cool like a bionic eye or cranial jack and it won’t be as painful as becoming a Cyberman. I never expected to become a cyborg at forty-six, but thanks to my July heart attack, my heart has sustained enough damage to require the installation of a defibrillator in my chest. As far as mods go, it’s pretty mundane, but it will provide some peace of mind and may even save my life someday.\nNow that I’m taking the first step, maybe I should start considering other potential upgrades. Given my health over the last year, a nanobot-based immune and healing system would be particularly useful. I wouldn’t complain about a system that would allow me to learn new skills or languages via software updates. The old cyborg staples of strength and speed wouldn’t be high on my priority list, but are certainly worth considering. Still, the fictional cyborgs we read about often pay a high price for their improvements. Would I really want to be part of the collective, lose my emotions or memories, or become beholden to some secret government organization? What if your new parts can be taken over or subverted? The what-ifs make for a good story. (And now, I brace myself for the flood of cyborg stories.)\nNovember is when many of us celebrate Thanksgiving. I have a significant list of reasons to be thankful this year. Obviously, surviving a major heart attack is up there, but I also have to appreciate the good fortune to be surrounded by good people, access to excellent medical care and the opportunity to become a cyborg. While my story has contained its fair share of bad things, I’m still here, and as Elizabeth Bear pointed out in her column a few months ago, good stories don’t have to be dark. I join the cyborg nation happy to have the opportunity to live. Whirr. Beep.\nCyborgification isn’t the only change this month at Clarkesworld. I am pleased to announce that Kate Baker has agreed to add Non-Fiction Editor to her list of responsibilities. Kate has been our Podcast Director for over three years (a job she intends to continue) and I look forward to having the opportunity to work with her on this aspect of the magazine. We’re carpooling to World Fantasy Convention this month, so we should have plenty to talk about on the long drive.\nIf you’ll be at World Fantasy, please stop by and say hi to Sean, Kate and I. We love to hear from our readers and authors. I’m also pleased to say that the Clarkesworld single issue chapbooks I mentioned last month will be available at the Prime Books table. I was able to get the January-October 2012 issues completed in time, so we’ll have a limited quantity of each available there.\nFinally, I’d like to welcome our new subscribers. We appreciate your support and hope you’ll consider encouraging friends to do the same. It’s been encouraging to see those numbers go up a bit each month and provide the financial stability we need to grow this magazine. Welcome. You have been assimilated.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}