{"fingerprint": "gNX+fHxs1P2DM0o+HvW87ehUGCM=", "sitename": "Clarkesworld Magazine", "title": "And Now for a Few Short Words from our Editor by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: And Now for a Few Short Words from our Editor by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n And Now for a Few Short Words from our Editor\n It wouldn’t be appropriate to end this issue without sending congratulations to E. Lily Yu and Catherynne M. Valente for their respective Nebula Award nominations for Best Short Story and Best Novella. We’re quite pleased to see “The Cartographer Wasps and the Anarchist Bees” and “Silently and Very Fast” on the ballot. Good luck! We’ll be rooting for both of you!\n A word of advice to our book collector friends: the signed limited edition of “Silently and Very Fast” that was published by WSFA Press is nearly out of print. You might want to grab one while you can.\n In other good news, thanks to the continued growth of our Kindle and Weightless Books e-subscriptions, we will be rolling out some more non-fiction features over the next few months. The first of these is scheduled to debut in our April issue. If you’d like to see Clarkesworld continue to grow, please help us spread the word about our subscription options. Details can be found at clarkesworldmagazine.com/subscribe/.\n Thanks, as always, for your continued support!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}