{"fingerprint": "WhAi/zq2La3ZrzXVE4uOlwv1hnw=", "sitename": "Clarkesworld Magazine", "title": "Short Fiction: One Year Later by Neil Clarke", "author": "Neil Clarke", "date": "2009-06-17", "source": "https://clarkesworldmagazine.com/clarke_06_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Short Fiction: One Year Later by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nShort Fiction: One Year Later\nLast year, I wrote an editorial on the state of the short fiction market and given all that has happened in the last year, I thought this would be a good time to revisit the topic. It’s been an interesting year for genre fiction magazines and definitely worth talking about.\nI’ve previously spoken about how the subscription and newsstand sales for the “big three” genre magazines had been in decline for several years. This year, that trend continued, though not as steeply. Postal increases continue to hammer at their bottom-lines and all three magazines made significant cost-saving changes this year. Analog and Asimov’s, which share the same publisher, changed their page size, reduced page count and cut about 4k worth of content. F&SF switched to a bi-monthly format and cut about 10% of its annual content. Neither increased the cost of a subscription, but you are receiving less for it.\nThe number four print magazine (one could reasonably argue number two using the above data), Realms of Fantasy was nearly lost. Their owner, Sovereign Media, shut them down without warning earlier this year. According to Sovereign, the magazine had been profitable. Fans rallied and Warren Lapine, best known as the man behind DNA Publications, stepped forward to purchase RoF. Warren has wisely retained most of the staff and seems to be taking the time to relaunch the magazine properly. A lot of people are watching this one from the sidelines and wondering if RoF will reclaim its place or suffer the same fate that befell Warren’s prior ventures into magazine publishing. I wish them all the best of luck.\nSome magazines haven’t been as fortunate. Two casualties of note are Apex Magazine and Paradox Magazine. Apex, a print magazine that had moved online, has gone on indefinite hiatus, but hopes to return someday. Paradox came to an end with the recent publication of their 13th issue. According to their forum, they hope to continue their efforts through anthologies or perhaps a move to online format.\nNot all the news of the last year has been bad. Tor.com finally launched after months of speculation and appears to be attracting the attention a project with the Tor name attached should be receiving. Tor.com has the hope of funding their site through advertising and they may just have the numbers to do it. Although they share the Tor name with Tor Books, they are quite vocal about being a separate business with no financial ties to the well-known book publisher. They certainly did benefit from the extensive pre-launch (and continued) giveaway of free Tor Book’s e-books and association with Tor Book’s staff. No doubt this relationship will continue to confuse people. Tor.com is more an online community than a magazine, but it is definitely a short fiction market. This closed (doesn’t take uninvited submissions from authors) market is reportedly paying 20 cents a word for fiction. That makes them one of the best paying markets for genre fiction at the moment.\nTor.com isn’t the only new kid of note. Other professional-paying (5 cents a word) markets that have caught my attention are Beneath Ceaseless Skies, Brain Harvest and Thaumatrope. BCS publisher, Scott Andrews, started publishing his brand of literary adventure fantasy last October. His online magazine was picked as a runner-up for the storySouth's Million Writers Award for the Best New Online Magazine of 2008 and has been publishing on a bi-weekly schedule. Brain Harvest, the self-proclaimed almanac of bad-ass speculative fiction, is the product of three Clarion West 2008 graduates. BH publishes short online fiction between 100 and 750 words long and has an interest in spreading fiction via cellphone. Even shorter fiction can be found at Thaumatrope, perhaps the first genre twitter-based zine. The brain-child of Nathan Lilly (of SpaceWesterns.com), Thaumatrope is pushing the boundaries of what can be done in under 140 characters. Fiction so short, that no one can complain about the quality of the screen.\nI continue to hold the opinion that the short fiction market is moving in a positive direction. We will no doubt continue to see losses in the years to come, but new players come into the picture each year and with them, innovative ideas that make the field stronger for their efforts. It does appear that the distribution issues of print magazines will make their continued existence difficult, but it’s not a problem restricted to genre magazines. Newspapers and other magazines are scrambling to figure out how to survive the combined blows of the increased costs and the digital revolution. Maybe they’ll find something of value among the varied efforts of the online publishers and maybe not. The only thing that is certain is change.\nUpdate: June 17, 2009\nIn the two weeks since posting this editorial, Talebones and Lone Star Stories have announced that they have shut their doors. The Chicken Littles have once again started proclaiming the end of short fiction, so I did a little more research. A quick look through Ralan.com's list of dead markets reveals that we have lost roughly 637 venues since 2000. 40 of these have at least occasionally (some very rarely) paid professional rates. If we focus solely on magazines paying professional rates, the number drops to 12. Of those 12, one only produced a single issue. Most of the others were established between 2000 and 2009. During that same time period, 11 magazines that pay professional rates were launched and still exist... and that only counts the markets open to submissions.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}