{"fingerprint": "SnUdEKnGo3TpwsZXAqekvBNke8Y=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: 2020 in Review by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_01_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: 2020 in Review by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: 2020 in Review\n With the start of a new year comes the inevitable looking back at the previous one. Strictly by the numbers, here’s a quick snapshot of Clarkesworld’s 2020 output.\n \n 12 issues\n \n 69 authors\n \n 36 authors had never been published in Clarkesworld before\n 8 (possibly 10) had never been published before, 2 others were first professional sales\n \n \n \n 76 stories (classified by Hugo Award categories below)\n \n 44 short stories\n 30 novelettes\n 2 novellas\n \n \n 552,820 words total\n 0 solicited works (all works were published from open submissions, not by invitation)\n 24 interviews\n 12 articles\n 76 podcasts\n 12 works of art for our cover\n \n In preparation for our annual reader’s poll and awards season, here’s a detailed list of the stories we published:\n Short Stories\n \n “The Last to Die” by Rita Chang-Eppig\n “The Ancestral Temple in a Box” by Chen Qiufan, translated by Emily Jin\n “The AI That Looked at the Sun” by Filip Hajdar Drnovšek Zorko\n “Outer” by Hollis Joel Henry\n “Eyes of the Crocodile” by Malena Salazar Maciá, translated by Toshiya Kamei\n “Mandorla” by Cooper Shrivastava\n “Time Reveals the Heart” by Derek Künsken\n “Coffee Boom: Decoctions, Micronized” by D.A. Xiaolin Spires\n “The Whale Fall at the End of the Universe” by Cameron Van Sant\n “Distant Stars” by P H Lee\n “A System for Investigating Recapitulation and Evolutionary Novelty” by Kyle E Miller\n “AirBody” by Sameem Siddiqui\n “The ThoughtBox” by Tlotlo Tsamaase\n “The Translator, at Low Tide” by Vajra Chandrasekera\n “Albedo Season” by Ray Nayler\n “What Happens in Solarium Square 21” by Ashleigh Shears\n “Optimizing the Path to Enlightenment” by Priya Chand\n “Own Goal” by Dennard Dayle\n “The Oddish Gesture of Humans” by Gabriel Calácia\n “The House That Leapt into Forever” by Beth Goder\n “One Time, a Reluctant Traveler” by A. T. Greenblatt\n “Three Stories Conjured from Nothing” by ShakeSpace, translated by Andy Dudak\n “Artificial People” by Michael Swanwick\n “The Lori” by Fiona Moore\n “Drawing Lines Between the Stars” by Frank Smith\n “The Plague” by Yan Leisheng, translated by Andy Dudak\n “What Remains of Maya Sankovy” by G. D. Angier\n “Every Plumage, Every Beak” by Nin Harris\n “The Book Reader” by Keishi Kajifune, translated by Toshiya Kamei\n “Blue And Blue And Blue And Pink” by Lavie Tidhar\n “Callme and Mink” by Brenda Cooper\n “Ashes Under Uricon” by Adrastos Omissi\n “To Set at Twilight In a Land of Reeds” by Natalia Theodoridou\n “All Living Creation” by Xiu Xinyu, translated by Elizabeth Hanlon\n “Death Is for Those Who Die” by Jana Bianchi\n “The Land of Eternal Jackfruits” by Rupsa Dey\n “The Murders of Jason Hartman” by Brady Nelson and Jamie Wahls\n “The Love Life of John Doe” by K Raghasudhan\n “No Way Back” by Chi Hui, translated by John Chu\n “Forward Momentum and a Parallel Toss” by AnaMaria Curtis\n “Songs of Activation” by Andy Dudak\n “The Island of Misfit Toys” by Fiona Moore\n “Things That Happen When You Date Your Ex’s Accidentally Restored Backup from Before the Divorce” by Lisa Nohealani Morton\n “The Last Days of Old Night” by Michael Swanwick\n \n Novelettes\n \n “Helicopter Story” by Isabel Fall (This is the replacement title for the story published in our January 2020 issue and later withdrawn.)\n “The Perfect Sail” by I-Hyeong Yun, translated by Elisa Sinn and Justin Howe\n “Monster” by Naomi Kritzer\n “The Host” by Neal Asher\n “Jigsaw Children” by Grace Chan\n “Generation Gap” by Thoraiya Dyer\n “The Amusement Dark” by Mike Buckley\n “Leave-Taking” by M. L. Clark\n “Grayer Than Lead, Heavier Than Snow” by Yukimi Ogawa\n “Debtless” by Chen Qiufan, translated by Blake Stone-Banks\n “Angel Pattern” by Henry Szabranski\n “Quantum Fish” by Bo Balder\n “The Language Sheath” by Regina Kanyu Wang, translated by Emily Jin and Regina Kanyu Wang\n “A Stick of Clay, in the Hands of God, is Infinite Potential” by JY Neon Yang\n “The Iridescent Lake” by D.A. Xiaolin Spires\n “How Long the Shadows Cast” by Kenji Yanagawa\n “Strange Comfort” by Tegan Moore\n “The Immolation of Kev Magee” by L.X. Beckett\n “An Important Failure” by Rebecca Campbell\n “Nameless He” by Robert Reed\n “Certainty” by Isabel Lee\n “Lone Puppeteer of a Sleeping City” by Arula Ratnakar\n “Ask the Fireflies” by R. P. Sand\n “You and Whose Army?” by Greg Egan\n “Wandering Rocks” by Gregory Feeley\n “Last Wishes” by D.A. Xiaolin Spires\n “Niuniu” by Baoshu, translated by Andy Dudak\n “Lost in Darkness and Distance” by Clara Madrigano\n “To Sail the Black” by A.C. Wise\n “Conversations in the Dark” by Robert Reed\n \n Novellas\n \n “Nine Words for Loneliness in the Language of the Uma’u” by M. L. Clark\n “Power to Yield” by Bogi Takács\n \n Art\n \n Zarrio by Eduardo García\n cattleDrive by Colie Wertz\n Pitstop by Thomas Chamberlain-Keen\n Home Planet by Beeple\n From the Moon to Mars by Thomas Chamberlain-Keen\n Plains of Forgotten Hopes by Viko Menezes\n Family Portrait by Yigit Koroglu\n Monk’s Mirror by Joseph Diaz\n 51 by Rodion Shaldo\n Ancient Stones by Francesca Resta\n Alien Scout by Arjun Amky\n I Hear Them by Claudio Pilia\n \n For the purpose of the Hugo Awards, Clarkesworld is classified as a professional magazine. This has been the case for several years now, but there are still a few people who continue to nominate us for Best Semiprozine. While we appreciate the sentiment, we are NOT eligible for that award. Instead, if you want to recognize our work, please nominate our stories in the appropriate categories and/or nominate me (Neil Clarke) for Editor Short Form. (My other 2020 editing work includes The Best Science Fiction of the Year: Volume 5 anthology and twelve issues of Forever Magazine.)\n Our annual reader’s poll—where readers pick their favorite Clarkesworld story and cover art from 2020—is once again employing a two-phase process:\n Phase One: Nominations (mid-January)\n Later this month, we’ll open for a forty-eight hour flash nomination period to identify the top five candidates in each category: story and art. The announcement for this phase will be sent out via:\n \n Twitter (twitter.com/clarkesworld)\n Facebook (www.facebook.com/clarkesworld)\n Patreon (www.patreon.com/clarkesworld)\n My blog (neil-clarke.com)\n \n The purpose of the brevity of this phase is to create a sense of urgency and reduce the opportunities for a coordinated ballot-stuffing campaign. Previous efforts have proved this to be effective at meeting these goals.\n Phase 2: Final Voting (February)\n The five finalists in each category will be announced in my February editorial. Final voting will open on the 1st and continue through the 15th. The winners will be announced in our March issue.\n Happy New Year! May things only get better from here!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}