{"fingerprint": "bvy1KlfMV5DsMUrpmuer/ZT26AA=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Things I've Seen by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_12_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Things I've Seen by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The Things I've Seen\n Next month will mark the third anniversary of our Chinese translation project with Storycom. I hadn’t had many opportunities to meet with them or the authors we’ve worked with outside of the occasional Worldcon. Last month, I had the opportunity to visit China for the first time as a guest of Science Fiction World, the leading SF magazine in China, and Storycom. I spent nearly two weeks in Chengdu and Beijing attending a variety of conferences, events, and award ceremonies.\n The first leg of my trip was to attend the Fourth China International SF Conference hosted by SFW. I landed in Chengdu the night before the event and had to hit the ground running the next morning. The twelve hour time difference and nearly full day of travel I spent getting there made things a bit rough. I don’t think I fully adjusted to their time zone until the day before I came home.\n SFW provided the foreign guests with translators from a local university. Several events had simultaneous translation available via headsets, but some of the smaller panels I wanted to attend didn’t. Fortunately, Stephanie, my translator, was with me most of the time and was able to help me follow what was going on. Many people spoke English, but not everyone, so she made it much easier to interact with people. I think I would have missed a lot if it wasn’t for her.\n I had one panel scheduled for Sunday, so most days I followed the pack and attended panels, talks, and meals. The meals were fantastic. I wasn’t as adventurous as I could have been, but I did try many new things. I drew the line at organ meat and anything that I’d see running around my backyard. The panels and talks were very interesting and eye-opening. It’s one thing to read articles, this editorial, or talk to some people, it’s another to actually see a community in action. This trip left me convinced that there needs to be a Worldcon in China. It’s a young and energetic community that has much to offer. We could learn a few things from them and their enthusiasm is contagious.\n Sunday was capped with my panel--quite enjoyable even though my headset cut out in the final minutes--and an award ceremony. At this point I said goodbye to Stephanie and was joined by Emily, who would be my translator for the remainder of the trip. (Emily co-translated a story for us a couple of months ago.) A few of us were bussed out to Sichuan University, which turns out to be larger than the town I live in. We had a lovely dinner followed by a panel discussion led by Xia Jia. I was impressed by the number of students that came out on a Sunday night to hear us talk. Cynically, I assumed that there must have been some extra credit or assignment involved in getting them there, but no, it was entirely voluntary. After the panel ended, there was a Q&A, and then we were sent back to the hotel where I promptly fell asleep, exhausted.\n Monday was the first and only free day I had in Chengdu. I spent it with Emily doing typical tourist things like visiting pandas, a shrine, and some very photogenic shopping areas. There was no way I was going to be able to cover everything in one day, but what I saw left me wanting more and gives me one more excuse to go back.\n Tuesday, Emily and I departed for Beijing. The defibrillator implanted in my chest can be a challenge when traveling, however. Airports’ metal detectors and wands can short out the device and cause me considerable harm or even death. An unexpected part of Emily’s job became making sure airport security knew not to zap me. Very few security people spoke English, so her presence was actually a lifesaver.\n I thought Chengdu was a large city, but flying into Beijing, I couldn’t see where it ended. I live near New York and that’s the city I normally use for comparisons. Beijing is 6490 square miles and New York is 304. You can see why I had difficulty scaling this in my mind. I was scheduled for events scattered about the city, so I stayed closer to Storycom’s headquarters and shuttled about from there. Not having a central hotel or event location slowed the pace of this leg of the trip, which helped keep me on my feet. In the span of a few days, I had a day of meetings at Storycom, a press conference, a signing and interview at a bookstore, the Chinese Nebula Awards, and many meals out with new friends. In the middle, I managed to squeeze in a trip to the Great Wall of China. If you ever have the opportunity, go!\n You’ve probably noticed that I’ve glossed over specifics of many of the events I attended. A full trip report would involve many pages long that I just don’t feel up to doing. Instead, I thought it best to summarize some of the things that struck me the most about what I’ve seen and learned, using examples from both legs of this trip.\n I’m going to start with the Chinese film industry. I’ve never attended a literary event that was so well-attended by film industry professionals. I’m not talking actors or actresses. I’m talking about screenwriters, directors, vice presidents, and other executives. They participated in panels, had a passionate interest in science fiction, and an exciting vision for the future of science fiction movies in China. At the Storycom press conference, I had the opportunity to watch a short film they are involved in and talk with several people about their plans and projects. The whole thing left me very excited about the future of this market. I think we’re going to see some amazing work coming out of China in the next few years.\n Another thing that struck me was the involvement of politicians in the major events and award ceremonies. At the first event in Chengdu, I was surprised to see politicians stand before a room of science fiction fans and authors and proclaim that imagination is important and that science fiction is valued. I’m not entirely sure they actually read it, but support from that demographic was something I never expected to see. When I grew up, I was openly mocked for my interest in science fiction. Their words didn’t match my reality where athletes and soldiers are most likely to get that support and encouragement. I’m not blind to the fact that their attention comes with some baggage. I’m sure the novelty would wear off if I regularly had to listen to long speeches or run what I publish past them, but I’m still wrapping my mind around the importance they’ve placed on science fiction and the long-term impact that will have.\n While chatting with some people at the conference in Chengdu, I noticed a young boy, perhaps six or seven, looking at me. After some prompting by his mother, he worked up the courage to come over and say hello. I got down to his level and he showed me a mask that he had drawn some robots on. His mother translated as I told him I liked robots too and that I thought his work was great. After a few minutes they said goodbye and as they walked away, Stephanie told me the boy’s mother said “maybe when you grow up, you can be a science fiction writer.” This was just the first of many instances I observed where young fans and writers were given encouragement.\n At the Nebula Awards in Beijing, an award was given to a young author, only in fifth grade. He couldn’t attend, but he sent his teacher in his place. Who did they have give out that award? Cixin Liu, the extremely popular author of the Three Body Problem. Think about that for a second. A fifth grader receiving a writing award from China’s most successful science fiction author.\n During the Galaxy Awards, after an award went to a student club, the organizers did something I’ve never seen before--they invited every student group in attendance to the stage and they covered it.\n Picking up on a trend here? I often heard a lament that the pool of science fiction professionals in China is so much smaller than we have here in the US. I’d often respond that quantity is not the basis I use for comparison. Quality is more important and the stories I’ve read have demonstrated they have it. The support and energy within their community is higher than anything I’ve observed at home and will surely propel the growth they desire in the years to come. I can’t wait to see what the next five or ten years bring based on the foundation they are currently laying. Nothing is ever certain and there’s always the danger presented by less well-meaning parties, but I routinely saw writers looking out for one another, reaching down and helping. It makes me very optimistic about their future and glad to have a front row seat from which to watch.\n There is so much more I could say about my trip, but I want to end on this note and hope that we can learn something from our friends. I’d like to publicly thank Stephanie and Emily, Science Fiction World, all the fans and authors I met, and most of all, Storycom for making this trip possible. I wish you all the best and hope our paths cross again.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}