{"fingerprint": "tXQIz/9OxiGwD+QVIWzORbtMSxY=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Having an Adventure with Dad by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_08_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Having an Adventure with Dad by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Having an Adventure with Dad\nThis month, my father and I will embark on a little adventure. In a few days, we’ll pack up our bags and board a flight bound for Dublin, Ireland. We’ll be spending most of our time in Navan, the town in which my parents were born and grew up. My parents visited “home” just a few years ago, but it’s been almost thirty years since I’ve been back. Most of my aunts, uncles, and cousins are still in Ireland. In the time I’ve been gone, some of my cousins have had children and became grandparents. I’ve lost count of just how many of them there are, but I look forward to seeing everyone again. It’s been too long.\nI’m particularly looking forward to doing all this with Dad. I recall my childhood trips to Ireland quite fondly and remember him dragging us around, showing my brother and me the castle he used to play in, the school where the Jesuits used to beat the children, and all manner of other events. The difference this time is that I’m old enough to appreciate it and smart enough to write some of it down. It will be his time to show off and it will be followed by mine.\nAfter Ireland, we’re heading to London for Worldcon. He isn’t planning on attending, but I’m taking him anywhere I can. That Sunday is my birthday and I’m celebrating by bringing him to the Hugo Awards events with me: the reception for nominees, the ceremony, and the Hugo Loser’s Party. I’ve never had a member of my family at one of these ceremonies, so win or lose, I’ll be happy because he’s with me. As a child, he once told me that if there was ever a book I wanted, he’d buy it for me. I think it’s time he experiences the consequences of that action. I can only hope that my actions inspire my own children similarly someday.\nIf you’ll be at Worldcon, maybe I’ll see you there. Otherwise enjoy the rest of your summer!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}