{"fingerprint": "8J8gWh4yZBDkB//A/6CWrPZXwtY=", "sitename": "Clarkesworld Magazine", "title": "The Aftermath by Maggie Clark", "author": "Maggie Clark", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clark_11_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Aftermath by Maggie Clark", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2950 words, short story\nThe Aftermath\nOn impact you start to lose the details. The smell of the bright white room you were first held in. Its shape. Its size. The way that parasitic life suit slithered towards you, and from what shaft, what crevice, as you struggled with the air. The quiver in your stomach as the shape-shifter engulfed your skin, and how long immersion took. How long most of all.\nColt-like, you rise and find yourself in mostly working order, atop a great height overlooking a valley, its treetops varied red and gold and an implacable dark green. In the belly of the valley are all the marks of a pit-stop town—gas station, diner, weather-worn tourist hub—on a winding country road through heavy forest. You recognize at once that you were not left to die. This is key, of course, but why? What happens now?\nYou imagine walking into town as you are—limping slightly, wide-eyed, relearning Terran gravity and atmosphere. Naked, too. What possible excuse will keep the police at bay once you’ve settled on a barstool in this state? How can you assert that you’re still sane?\n(This is when you first ask yourself if you even are; if it happened after all. Even as you frame the question you realize this doubt will now never, not ever, go entirely away.)\n“Bears,” you explain to the first person you see—a hitchhiker a quarter mile outside of town. Your teeth are chattering around the old-new Terran word; you can just make out your breath in the early morning light. The hitchhiker squints behind a wild red mess of hair and beard and slowly nods in turn.\n“Bears, man,” he says. “Bears’ll mess you up for sure.”\nHe seems poised to offer more, but you press on. The soles of your feet favor pebbled asphalt to that tangle of stiff weeds in the nearby ditch. Sense memories come to you all out of order as you hobble toward gas station lights: of purple, pungent fields and a hundred gleaming domes; of giant red ferns with bulbous trunks and spindly leaves crosshatching a livid sky; of aurora borealis skittering day and night above, disrupting sleep.\nMostly, you recall, you were left in a garden of some kind—communal, or just large—and you could not tell the owners’ children from other pets allowed to roam within. Once, inside the nearest see-through dome, you watched a conversation persevere, it seemed, for hours—the norm in that land, or some darker sign of strife? You never learned how to interpret those violent, whipping gestures: anger, pleasure, or something wholly else? Maybe, like sharks, they needed constant movement just to stay alive.\nA car horn jolts you from such ruminations and you stumble off the road, crash into hard thistles and tall weeds blooming small white buds like lacework. You turn in time to see the driver and his buddies beating at the doors and roof with broad and callused hands. They grin and hoot and whistle at you, and one shouts something incomprehensible as the car blasts past. When you sit up you are grinning. Children. Yes. At last it’s coming back.\nBy the time a county constable joins you at the diner counter, a cup of coffee set before you and a musty blanket draped around your back, you’ve given up on bears—not enough wounds, you realize, to carry that tale for long. While waiting you had contemplated a story of roadside robbery, too, but found it needlessly complex, and liable to cast aspersions on all the locals, which even in your addled state you aren’t of a mind to do.\nSo instead you tell the friendly woman in her early thirties, divine threads of silver already winding through her hair, that you were camping (this, at least, is true) and that something must have spooked you in the night, made you tear out from your sleeping bag and wander out a ways. She listens while turning her black serge hat in hand.\n“Sleepwalking is a child’s game, I always thought,” you offer up to the next long silence, matching the words with a fragile smile. “Guess now I know it’s not.”\nIt’s the last response you’ll manage in that diner. You want to be of further use, but from the look upon her face—patient, but dissatisfied—you’ve jumped to future dates by the time she speaks again. You ask yourself, Must I explain myself to everyone I meet from here on out? At what point would any keeper deserve to know the truth? and all other questions lose their relevance, their sense of urgency in this revelatory wake. This moment, you’ve just realized, this precarious interrogation, is the beginning of the rest of your whole damn life. The constable is gently prodding your arm, asking you to go on, but you are already, you are.\nYou’re just addressing questions maybe decades down the road.\nAt the cop shop she finds you clothes—oversized in spots; tight in others. You’re puzzled when the material doesn’t lay active claim to your skin, or so much as pulse with a lifeforce all its own. No one else is about, so you dress slowly in her tiny office, a mishmash of new glass walls with white block lettering and benches and chairs from well into the last century. Under the circumstances, time travel almost seems a plausible excuse.\nOver the cluttered desk there’s a picture of the constable bass fishing, and when you study the grin on that face you wonder if she spent long nights lakeside with her parents as a child, roasting marshmallows and hot dogs and watching for shooting stars. You can almost see yourself telling her the truth now. Almost.\nSo listen, you’d say, elbows propped over the paper stacks. About the sleeping-walking . . .\nBut after that, in your mind’s eye, it never ceases to fall apart.\nWhen the constable returns she bears a print-out, and new creases for her frown. She sets the page before you; you read the missing person’s notice with what you hope seems like neutrality, a calmness between your brows. When you’ve finished you look up—blankly? blank enough?—and set the sheet between you. She taps just once upon the date.\n“Do you know what day it is?” she says, then hesitates. “What year?”\nYour attention shifts again to that mounted fishing shot, and you say nothing more of this—to her or anyone. There is simply nothing left to say.\nYou don’t go back. You can’t. To friends and family, two years might have been two days, for all their grief renews at the merest word you’re still alive, and all the questions life brings with it—questions you doubt you’ll ever have decent answers to. And yet for you how much time has it been, really? Surely only weeks, at best, but how distant that prior life seems now, and all the people who were dear within it. You listen to someone crying on the phone one night from your motel room, but it all seems light years—light years!—now away.\nSo you start over in a city where no one knows you—dishwashing, street sweeping, taking orders and derision at a juice bar in a run-down mall. Your managers are all big fish in small ponds and you observe their pettiness idly, at a distance, like the flicker of red giants in a clear night’s sky. Everything is new again—the sights, the tastes, the human interactions. Eventually you wake up next to a friendly stranger, who touches your cheek and asks after all the unusual words you were caught muttering in your sleep. You feign confusion, roll trembling aside, and stick notes to the bathroom mirror later, reading:\nIf it really happened, where? How?\nAnother planet? No such thing as faster-than-the-speed-of-light!!!\nWormholes?\nRegardless, where’s the PROOF?\nNext you work the language—as much as you can recall from sweeping, jagged lines in architecture, holographic projections, and something like printed, wriggling script. You have notebooks filled with sketches of all the creatures, all the plants, all the structures in and about that massive garden, but still it’s not enough to justify the claim. It never is. You take a stab at the skies next, but it’s too late to start invoking constellations. You never had a head for star maps even at the best of times.\nOn harder days you watch the news with guilt—another child recovered from years-long captivity; another political kidnapping brought to no good end. You’re alive, aren’t you? Unharmed? And to think what kind of technology you might have brought back with you, if you’d only had the wherewithal to look about—how you had a chance to change the world!\nIn time the fear abates that you’ll slip up in idle banter, be found out for a loon and locked or drugged away. Then and only then, you come to marvel less at your answer to the epic question, are we alone?, and start to scour the internet for some proof that you are not—not in this, at least; not here on wretched Earth. There are more than enough forums for you to skim through, even if most appear on sites not significantly modified since 1999. But even the newer ones are filled with abduction stories that make no sense. Bullshit, you mutter at other people’s drawings, their details, their grandiloquent erotica framed as trauma narrative. At nights you lie awake in the oblong box of your apartment, staring at cracks in the ceiling and wondering what kind of person makes this shit up.\nYou start to follow other made-up worlds yourself—’50s B-movies, ’80s trash, and sci-fi classics all alike—but when you start to cry at Rutger Hauer’s famous lines and find you cannot stop, you know you have to give them up. The fear of loss is just too strong. So you pore instead through golden era pulp, schlocky and sincere alike, for any sign of something even remotely like what you’ve seen, where you’ve been. Soon you’re tossing bargain books across the room—red-rimmed, yellowed pages piling up in bits and pieces behind the bedroom door. Even then it’s not enough. On a lark, one winter’s eve, you find a metal bin out back and light them up.\nWhen you go out now you start watching people more severely, and lose your temper often, too. It’s they who need to worry about slipping up, not you. Maybe everyone has been to these distant regions after all. Maybe they’re just too scared to confess it—or maybe their silence is one big joke the world keeps making at your expense. Either way, you become contrite only when you make a server burst into tears and run away; you say to yourself, okay, fine, it’s on me to get us talking—and I will.\nSo you start small—little jokes with future wait-staff, cashiers, people waiting for the bus. Some ignore you from the outset, but if ever someone nods, however vaguely, you lean in and up the ante to conjecture. Most smile politely then and turn aside. Some get agitated, swear and walk away. And once, on a date, you tried for something deeper and were met with laughter—incredulous at first, then mocking without end. All right, you said. Enough.\n“If you haven’t been taken yet,” you add savagely while rising, tossing bills for your half of the meal as your ears begin to burn. “You will. Just you wait—you’ll see—and soon!”\nAfter that night you don’t go out much. Nor do you invite any others home. There is a stray, though—one old mutt with a scar-pocked countenance you take to calling Silas, who asks no questions beyond his search for food. He can stay, and does. The jangle of his collar makes you feel almost normal by spring thaw. Even bordering on good.\nWith him by your feet, at the foot of your bed, you turn your energy next to writer forums, and try your hand at prose—sketches, mostly: long descriptive pieces about the ship, the entities, their world. Others praise your details, your inventiveness, then ask for plot and offer lead-ins—What if your protagonist were to meet someone there? What if they get tied up in some intergalactic intrigue? What if there’s a mystery to be solved and being human brings some special skill to the table, something these others (they should have a name, btw) just don’t have on their own?\nYou read this gentle feedback with clenched fists and gritted teeth, though you understand it’s well-intentioned. Yes, they should have a name, but you don’t know it—they never introduced themselves to you. And yes, you get that there should be some plot in this, but that’s not how it happened, you almost shout at the computer screen. Mostly you just wandered in that far-off garden with all the other, diverse creatures wearing parasitic suits, while your own ever hummed and flexed along your skin. Mostly you just tried to avoid the louder beasts among them, and to figure out what was and wasn’t safe as food.\nBut there was one incident, near the end of your strange sojourn there, that you have been careful to avoid reflecting on ever since your return. Are you frightened even now to think of it? Not quite—and yet, perhaps: for here and here alone do you wonder if you weren’t wrong to be braver from the outset, to seek out law enforcement and tell them all, consequences to your own life and livelihood be damned. Did they not deserve to know?\nIt is so slight a story, though: The One Time Something Happened. But still, one day—as days went on that world, at least, with the sky ever flickering with wicked lights in the absence of a clear bright sun—those large and whipping entities emerged from their domes and swept all the creatures of the garden up. (And how you trembled in that nest of long appendages—not cold exactly; more electric to the touch.) You did not travel long before your captor loosed its hold, though, and when you looked around you found yourself, with all the rest, at the center of a large arena: one long line of you put for hours through an exhausting run of obstacles, inspections, and . . . well, you’ll call them tests.\nThere were no ribbons, no prizes at the end, but as the crowd began to thin from surrounding stalls and tanks, you noticed one of your fellow creatures drawn from the pack and led quietly away. A tall and nervous thing—slender like a stickbug, with fur or fibrous feelers all at ends—it stood encircled at the last by your host species, and then was seen no more. For all the details you’ve since forgotten, you will never forget that crunch.\nYou were returned to Earth not long after—a few sleeps, maybe more—but just before one of those great entities threw you into the waiting ship, it made you pause before a small display, and for the first time since your capture you heard something resembling your native tongue—if tinny, a little coarse, and overwhelmed at times by clicks.\nGreat luck and good fortune to you! said the display, for by your prowess in the Games let it be known that you have spared your species from selection for the sweeps!\nJust that, no more, and then with another nudge you stood unsteadily inside the ship (another bright white room) with the outer door sliding shut, and your parasitic life suit letting out something of a parasitic sigh.\nYou recall this incident most clearly and calmly while washing dishes a year and a month after your return, dear old Sol sitting low on an overcast horizon when you spy a tiny insect trapped between the inner and outer glass. You freeze with a soapy plate in hand.\n“Well I’ll be damned,” you say unexpectedly aloud—at which Silas pricks his ears, then lifts and cocks his scruffy head. You turn to him wide-eyed and explain:\n“I bet they say that to all their abductees. I bet it doesn’t mean a thing.”\nWhen Silas lets his jowls rest on folded paws anew, you take his silence as agreement and return to the day’s late task, the setting sun, the insect slowly dying of exhaustion between your window panes. But it makes the difference, this possibility of deceit—an attempt, perhaps, to make your waste of time in the cosmic depths seem somehow meaningful; to give you the strength to manage on your return.\nAnd did it work? Aren’t you still here? Perhaps, but even then you shake your head. How foolish you’ve been to think any species wiser for all their intergalactic prowess: A theft is still a theft—unconscionable, and not on you—however much one among the thieves might have tried to set it right. So at last you shelve the whole damn incident with all the other selfish things you’ve seen thinking beings do—your tale no more a mystery than any epidemic of curable disease, or prison run for profit, or genocidal war where world leaders, when called to intervene, study their hands instead, or shoes.\nOf course, they might still be true—those grim last words before ejection. But what of them now? And what of you? All you’ve ever had for proof is your years-long absence, and for that there have always been so many other ways for the feds to give excuse.\nSo—Enough, you say, and this time you mean it, too: No more adding to one theft with another. No more playing jailor even with the parasite long gone.\nTomorrow comes and you’re still Earthbound. Brilliant. You toss the notebooks. Kiss the dog. Find the woods where it first happened and buy another tent.\nCanadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021."}