{"fingerprint": "jzXtJXBPIRUMV3wOPCKphwIi+c4=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The 2015 Reader's Poll and Contest by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_01_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The 2015 Reader's Poll and Contest by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The 2015 Reader's Poll and Contest\n It’s time for our annual reader’s poll! Each year, we ask you to pick your favorite Clarkesworld story and cover art. Here’s a complete list of the original fiction we published in 2015:\n \n “A Universal Elegy” by Tang Fei\n “All Original Brightness” by Mike Buckley\n “An Evolutionary Myth” by Bo-young Kim\n “An Exile of the Heart” by Jay Lake\n “And If the Body Were Not the Soul” by A.C. Wise\n “Android Whores Can’t Cry” by Natalia Theodoridou\n “Asymptotic” by Andy Dudak\n “Cassandra” by Ken Liu\n “Cat Pictures Please” by Naomi Kritzer\n “Coming of the Light” by Chen Qiufan\n “Cremulator” by Robert Reed\n “Egg Island” by Karen Heuler\n “Ether” by Zhang Ran\n “For the Love of Sylvia City” by Andrea M. Pawley\n “Forestspirit, Forestspirit” by Bogi Takács\n “Further North” by Kay Chronister\n “Ice” by Rich Larson\n “If on a Winter’s Night a Traveler” by Xia Jia\n “In the Queue for the Worldship Munawwer” by Sara Saab\n “Indelible” by Gwendolyn Clare\n “It Was Educational” by J.B. Park\n “Let Baser Things Devise” by Berrien C. Henderson\n “Loving Grace” by Erica L. Satifka\n “Meshed” by Rich Larson\n “Morrigan in Shadow” by Seth Dickinson\n “Mrs. Griffin Prepares to Suicide Tonight” by A Que\n “Ossuary” by Ian Muneshwar\n “Postcards from Monster Island” by Emily Devenport\n “Preserve Her Memory” by Baoshu\n “Security Check” by Han Song\n “Slowly Builds An Empire” by Naim Kabir\n “Snakes” by Yoon Ha Lee\n “So Much Cooking” by Naomi Kritzer\n “Somewhere I Have Never Traveled (Third Sound Remix)” by E. Catherine Tobler\n “Summer at Grandma’s House” by Hao Jingfang\n “The Algebra of Events” by Elizabeth Bourne\n “The Apartment Dweller’s Bestiary” by Kij Johnson\n “The Empress in Her Glory” by Robert Reed\n “The Father” by Kola Heyward-Rotimi\n “The Garden Beyond Her Infinite Skies” by Matthew Kressel\n “The Hexagonal Bolero of Honeybees” by Krista Hoeppner Leahy\n “The Hunger Tower” by Pan Haitian\n “The Last Surviving Gondola Widow” by Kristine Kathryn Rusch\n “The Long Goodnight of Violet Wild” by Catherynne M. Valente\n “The Occidental Bride” by Benjanun Sriduangkaew\n “The Petals Abide” by Benjanun Sriduangkaew\n “The Servant” by Emily Devenport\n “The Three Resurrections of Jessica Churchill” by Kelly Robson\n “This Wanderer, in the Dark of the Year” by Kris Millering\n “Three Cups of Grief, by Starlight” by Aliette de Bodard\n “Today I am Paul” by Martin Shoemaker\n “Union” by Tamsyn Muir\n “When We Die on Mars” by Cassandra Khaw\n “When Your Child Strays From God” by Sam J. Miller\n “Your Right Arm” by Nin Harris\n “Yuanyuan’s Bubbles” by Liu Cixin\n \n And here’s a quick round-up of our 2015 covers:\n As an added incentive for participating, we’re giving away copies of Clarkesworld: Year Eight (publishing this month) to three lucky voters!\n The survey will be online now through February 23rd, with the results being announced in our March issue. You can take the survey at http://clarkesworld2015.questionpro.com."}