{"fingerprint": "EBEzdPpuU6JNKW96Cqhn5TmOv+E=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: An International Journey by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_04_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: An International Journey by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: An International Journey\nOn more than a few occasions, I’ve been asked to explain my interest in international science fiction—and in particular—works in translation. With this month marking the publication of the first of nine translated South Korean stories in Clarkesworld, I thought it might be a good time to dig into that and explore our journey.\nTruth be told, my interest is simply a case of being a big fan of short fiction and understanding that the best stories can come from anywhere, be it down the street or on the other side of the world. I’m a self-admitted data junkie, so after I became an editor, I started paying attention to the numbers behind the story submissions. Among the most glaring gaps I noticed was how little was being sent to us from outside the US, UK, Canada, and Australia. That bothered me.\nOne of the things I love about short fiction is that it is more friendly in pushing boundaries and in trying something new. While our work may be influencing local authors, there are also a number of other things—like culture, politics, and history—shaping their stories. If you are someone who appreciates finding something a bit different, you can see how those different ingredients bring something of value to the table. Foreign markets dominated by our own work interfere with that process. Not having them as part of our own is just as bad.\nSo, let’s go back to 2011. I had been blogging about my submissions data and wondering what could be done to improve things. I knew there were various indicators of communities around the world—things like the world’s largest science fiction magazine, SF World in China—but I didn’t know how to reach them.\nThen Ken Liu sent me his translation of “The Fish of Lijiang” by Chen Qiufan—whose novel Waste Tide comes out from Tor this month—and it confirmed so many things. I published the story in our April 2011 issue and from there, things began to change. Over the next few years, both Ken and John Chu sold me several translated Chinese SF stories and eventually, these efforts started gaining attention in China and beyond.\nI want to pause here and point out something I was woefully ignorant of at the time: for right or wrong, the US/English language market has been placed on a pedestal internationally. In many cases, being published here is a major accomplishment and winning one of our awards more prestigious there than here. Years later, I would also discover just how much an attempt to hold open the door would be appreciated and valued by that community.\nIn the history of our field, many have tried to increase opportunities for international and translated works. For various reasons, they were largely unsuccessful. I have theories, but in the end, we have the significant advantage of being in the Internet age. Digital submissions eliminated the cost barrier for international submissions. Digital and online publishing meant greater international visibility for works published that way. It also made it easier for like-minded individuals and organizations to find and help one another. Combined, these changes have had a very positive impact and created a more compatible ecosystem for these projects.\nBut, decades of imbalance don’t go away overnight. Years of feeling unwelcome doesn’t suddenly go away because a few barriers vanished. The domestic publishing model often assumes a “build it and they will come” model in regards to story submissions. There are far more writers than can possibly be published and in a surplus condition like that, it’s easy to forget that there are some people you just aren’t hearing from, particularly when you are satisfied with what you’ve got. Even now, the number one question I receive from foreign authors is “do you publish authors from outside the US?” That’s depressing, but I only recently realized even that can be seen as progress. Unlike 2011 and before, they are asking and not assuming.\nWhen Storycom noticed what we were doing at Clarkesworld and reached out to me, they started with the question, “How would you like to make this a regular thing?” Obviously, the concept intrigued me, but the logistics were intimidating. Two major deterrents to translation remained for me:\n- Like many Americans, I can only speak or read English and would have a difficult time properly identifying which works should be translated.\n- Translation is expensive and often costs significantly more than the original work itself.\nOver the next few months, we addressed these (and other) issues before signing a one-year agreement. Despite the positive reaction to our occasional translations received, I was concerned about the reception a more regular project would receive. Translations haven’t always been treated nicely by our field, so when the Kickstarter to launch the project generated such an overwhelmingly positive outpouring of support and interest, it was both vindicating and energizing.\nFour years later, one of the best side effects of that particularly collaboration has been that it has made it easier to attract the amazing stories from around the world that I had always believed were out there. (Imagine that, publishing international works encourages more to be submitted.)\nThe balance between domestic and international works in Clarkesworld is now much more in line with where I think it should be, but there are still geographies we haven’t seen any or nearly enough works from. I’m eager to address that.\nOne of the big goals I had when we first started doing this was that someday, translations and international works wouldn’t be considered a novelty you see once in a while, they’d be a normal part of the ecosystem. And judging by the number of magazines and anthologies including them and a growing reader interest, I’d say the field is years ahead of where I hoped we’d be by now. And while there’s still a long way to go, particularly with novels, I continue to be optimistic that we can continue to embrace new works from around the globe.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}