{"fingerprint": "UHZa6RlBFMYwKhZIKHV+cGnpOqY=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Recognizing 2016 by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Recognizing 2016 by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Recognizing 2016\nCongratulations to Sam J. Miller! “Things with Beards” from our June 2016 issue has been nominated for the Nebula Award for Best Short Story. This is the second year in a row that Sam has had a Clarkesworld story on the ballot and we couldn’t be happier for him. You might be amused to find out that both stories were accepted for publication in person at the prior year’s SFWA Nebula Conference.\nMeanwhile, over in Australia, “Of Sight, of Mind, of Heart” by Samantha Murray has been nominated for a 2016 Aurealis Award for Best Science Fiction Short Story. If I recall correctly, this is only the second time a Clarkesworld story has been nominated for that award.\nWhile we’re celebrating success, most of the year’s best anthologies have announced their 2016 selections and we’re proud to see the following Clarkesworld stories represented:\nNovelettes\n- “Touring with the Alien” by Carolyn Ives Gilman (Dozois, Horton, Clarke)\n- “Everyone from Themis Sends Letters Home” by Genevieve Valentine (Horton, Strahan)\n- “Jonas and the Fox” by Rich Larson (Dozois)\n- “Checkerboard Planet” by Eleanor Arnason (Dozois)\n- “One Sister, Two Sisters, Three” by James Patrick Kelly (Dozois)\n- “The Bridge of Dreams” by Gregory Feeley (Horton)\nShort Stories\n- “Things with Beards” by Sam J. Miller, short story, (Dozois, Horton, Strahan, and Clarke)\n- “Extraction Request” by Rich Larson (Clarke)\n- “And Then, One Day, the Air was Full of Voices” by Margaret Ronald (Clarke)\nJust in case you don’t know the books by the editors’ names:\n- The Year's Best Science Fiction: Thirty-Fourth Annual Collection, Gardner Dozois ed.\n- The Year's Best Science Fiction and Fantasy, 2017 Edition, Rich Horton ed.\n- The Best Science Fiction and Fantasy of the Year: Volume Eleven, Jonathan Strahan ed.\n- The Best Science Fiction of the Year: Volume Two, Neil Clarke ed.\nWe’re also happy to report that the following stories have been selected for this year’s Locus Recommended Reading list:\nNovelettes\n- “Checkerboard Planet” by Eleanor Arnason\n- “Touring with the Alien” by Carolyn Ives Gilman\n- “Jonas and the Fox” by Rich Larson\n- “Everyone from Themis Sends Letters Home” by Genevieve Valentine\nShort Stories\n- “A Tower for the Coming World” by Maggie Clark\n- “Breathe” by Cassandra Khaw\n- “Things with Beards” by Sam J. Miller\n- “Between Dragons and Their Wrath” by An Owomoyela and Rachel Swirsky\n- “Left Behind” by Cat Rambo\n- “The Abduction of Europa” by E. Catherine Tobler\n- “First Light at Mistaken Point” by Kali Wallace\nI was hoping to have a more substantial editorial for you this time around. I’ve just finished my first month as a full-time editor and I’ve been enjoying the chance to catch up on languishing projects and begin exploring some new opportunities. There’s a few things coming together right now, but unfortunately, it’s too soon to share. That and I’ve been sick the last few days. Writing is hard enough for me under the best of conditions. Add a sleep-inducing head cold in the mix and that pretty much wrecks it for me.\nNow, if you don’t mind, I think I need to go back to sleep . . .\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}