{"fingerprint": "7ijup4ivbdGA51sS4fFoun3Wf2k=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: A Decade by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_10_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Decade by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor’s Desk: A Decade\nClarkesworld’s first issue was published ten years ago this month. It’s been a long and challenging road to get from that two-story-and-a-cover issue to what you see today. Back then, the state of online magazines could be best described as the Wild West. We had no role models to pattern ourselves after, just some crazy ideas and the willingness to experiment. Many magazines came and went during that time and we learned what we could from their experiences. Growing slowly helped us survive the tumultuous times that followed and provided us with the ability to quickly adapt to our own successes and failures. Looking back, I think it took us just over two years to find a comfortable stride.\nThis brings us to today’s environment which I would label our Awkward Teenage Years. The field is technically mature, but it’s still coming to terms with what it wants to be and the “right way” to get there, whatever there is. What I hope we don’t lose from the original phase is the willingness to ask ourselves the hard questions like “is there a better way we could be doing this” or even “why are we doing this?” And even though they carry risk, innovation and rebellion can be powerful forces for progress.\nIt might be obvious that I have strong feelings for this field in which I work. I’ve used my blog and these editorials to express opinions, theories, and advice based on my experiences and in hopes of offering a hand. The other teens have their own paths and can ignore or embrace what they want, just as I may do to them. I view the paths of others as learning opportunities and their choices are a healthy part of a development field. It might not always be pleasant, but it makes us stronger. In the end, we share a lot more in common than is often acknowledged. That’s how I know this phase will pass. Some will drop out. Some will graduate. Some will find some other options and opportunities we haven’t yet imagined.\nThis month, I could easily look backwards. We have plenty to celebrate and, yes, we’ll be doing some of that throughout the year, but eleven, twelve, thirteen, and beyond are calling to me. At five, I never imagined reaching this point. At ten, twenty-five seems ridiculous, but allowing myself to think in five-, ten-, and fifteen-year spans allows me to address things I would have considered impossible or unrealistic in the short term.\nFor the last few months, I’ve been shaking the trees, asking for feedback, conducting surveys, and questioning various approaches employed by ourselves and others. If you’ve participated, thank you. If you haven’t, I’m always open to hearing about what we could be doing better, so just drop me an email or flag me down at a convention.\nAnd while I wish I had some grand plans to share with you at this point, it’s still too early. If anything, I’ve discovered just how big some of the holes in our data are. It will take some time to gather what I need and then we can talk. For now though, I’d like to say thank you. Whether you were one of the three thousand that read our first issue ten years ago or you’re discovering us for the first time this month, thanks for reading and/or listening. Next time . . . bring a friend?\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}