{"fingerprint": "65awavzOhv7KA7+TLS67lPZCiMM=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Staring at the Hole by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_12_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Staring at the Hole by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Staring at the Hole\n This month’s editorial was supposed to be about my adventures at a pair of science fiction conventions in China, but it won’t be. I’m sitting on the floor of my house, blasting some music by Infected Mushroom, and trying to work out how to tell you the story of how none of that came to be, at least for me.\n The first convention, China SF Con, was set to take place at the start of November in Beijing. In addition to attending the conference, I was scheduled to do a few interviews, a signing, and a twenty-minute talk entitled “The Future of Science Fiction is International.” I had been looking forward to returning to China since I was there in 2017, but after over twelve hours at the airport—and a couple of hours sitting in the plane just outside our gate—we returned to the terminal. Due to mechanical problems they had known about all day (and from the previous flight) my flight was canceled. The next available flight was leaving two days later, on Saturday, so I’d arrive at the hotel as the convention was wrapping up. Much to my disappointment, I had them cancel the flight and issue a refund to the people hosting my trip. I was given a $500 travel voucher for my troubles and went home.\n This was the second international flight I’ve had canceled at Newark in the last six months, so I was a bit concerned about the viability of my trip to the 5th International Science Fiction Conference in Chengdu later in the month. It turns out that I had nothing to worry about there. That flight left on-time, just without me. Earlier in the month, my father-in-law, Donald Rodriguez, had ended up in the critical care unit. It wasn’t looking good, but the Friday before my trip he was in good form, cracking jokes, and talking with us. It seemed like progress, but things took a turn for the worse over the weekend. We were warned that he only had days left, so I canceled my flight. He passed away right around the time I would have arrived in Chengdu.\n Try as I might, I can’t really write much more about him or the rest of the month. There’s a hole in our family and looking into it is just too much right now. I’m just glad I was here.\n Oh and did I mention that, in all of this, the beeping I mentioned in the last issue started. I’m heading out the door to visit my electrocardiologist in a few minutes. They want to schedule my surgery, but I think I’ve seen enough hospitals for the moment. Maybe they’ll let me push this off to January . . . but then, I’m a slave to the battery and that might be beyond acceptable risk.\n Sorry if you were looking for a more upbeat editorial this month. From what I heard from my friends, the two conventions I missed were wonderful, so there’s that. (I was there in spirit, or rather, Flat Neil form.)\n “The Future of Science Fiction is International” talk I was supposed to give in Beijing—and later rescheduled for Chengdu—obviously never happened, but the slides are complete (in English and Chinese). I’m hoping to record a voiceover for the presentation and post it on our YouTube channel sometime soon. Given the chaos that remains, I’m not entirely sure when, but I’ll let you know when I do.\n This issue closes out 2019 for Clarkesworld, so I wanted to say thank you for all your support we’ve received for the magazine this year and my family this month. Should you celebrate, happy holidays, and I wish you all a wonderful 2020!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}