{"fingerprint": "YqiWsrUa4F3B3/xSSHLcOyVyHuE=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Making My Holiday Wish List by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_11_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Making My Holiday Wish List by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Making My Holiday Wish List\nI’m going to keep it brief this month. My last two editorials have been on the heavier side of things, exposing some sad truths about short fiction reviews and short fiction magazines. They’ve generated a fair bit of discussion and I hope it continues to do so. As expected, there were some who tried to twist my words to fit their own narrative or self-promote. The people that amused me most were those who tried to paint me as an old guard traditionalist. Admittedly, Clarkesworld being nine years old makes us positively ancient in internet years, but we’ve never given up on trying new things, even the “crazy” ones. If that’s become old guard, I was right to be concerned about the future of a field I love.\nIt’s easy to become distracted by the stray voices of discord on the internet. Most of the feedback from these two editorials was quite positive. Several people echoed my sentiments about supporting the publications you love before they need to be saved and some even mentioned that they had been inspired to do so. That’s uplifting, but what I’ve seen doesn’t change those darker predictions for a market compression. The numbers simply don’t line up with the volume of publications. In the end, it’s readership that determines the size of the pool.\nThat said, I can think of no better time than Thanksgiving—this month in the U.S.—to say thank you for being one of our readers. You mean the world to us. I hope you don’t mind that I’ve put more of you on my holiday wish list.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}