{"fingerprint": "uxpCOdfXFprdaraJW6bz9vbvtWs=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Listening to the Universe by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_07_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Listening to the Universe by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Listening to the Universe\n When the universe calls, you have no choice but to listen. Five years ago this month, it sent me a message in the form of a near-fatal heart attack. It was the sort of thing that not only caught me off guard, but my family, friends, and doctors as well. As I lay there in the critical care unit, the weight of what happened hit me hard, providing an odd sort of clarity and a revised outlook on life. I had some choices to make, a lot of alone time before visitors to think about it.\n Over the years, I’ve blogged and editorialized many of the details of that time, but today is about celebrating an anniversary and pushing forward. Not only did I survive, but I learned a lot of valuable lessons. It was a crappy way to get the message, but I’m very glad I did. At the end of the first year, I took back the anniversary by returning to Readercon—the scene of the crime—and successfully ending the Kickstarter campaign for Upgraded, my first anthology.\n Five years later, I have a year’s best series and several more anthologies, watched Clarkesworld turn ten, and made it to my fiftieth birthday. Earlier this year and thanks to my wife’s return to the workforce, I was able to quit the day job and have the time to pursue my dream of becoming a full-time editor. Technically, I am full-time now, but the goal was always to be making a full-time income—with healthcare covered—and I’m still working towards that. Like many Americans, particularly those of us with pre-existing conditions, I’m very concerned about the future of healthcare in this country. The dream could easily crumble on this single item, so if you’ve noticed me pushing the Clarkesworld and Forever Magazine subscriptions and our Patreon page a bit more, you now know what’s fueling that. Not the rosey-theme I was going for, but hey, it serves the future.\n As evidenced by some of my recent editorials, I’ve been thinking a lot about the path I’ve taken into this field, where I’m going, and how it connects to the best parts of my old career in education. Sometime last year, I decided that after ten years it was time to admit that perhaps I actually know what I’m doing and push myself a bit. The most passive way I was able to do this was to accept invitations to participate in professional activities that would normally intimidate me. Basically, let the universe spin the wheel. So far, that’s included being the sole industry professional at an academic conference; appearing on TV to talk about Chinese science fiction; and just last week, traveling across the country to participate in a writing workshop.\n Of the lot, the latter was the most intimidating. Milford-style critique groups are not at all like reading slush and I’ve never had to sit around a table with a bunch of authors to detail what I liked and disliked about their stories. My normal routine includes regularly rejecting the overwhelming majority of stories that authors send me, but explaining why is never part of the equation.\n I put on my best “everything is ok” face, dove into the workshop, and discovered everything was really was ok. I had a great group of talented and considerate authors, which I knew I would, but that little voice in the back of my head kept expecting some of those rare awful responses I get in email from some authors with a mere form rejection. Aside from providing me with an enjoyable experience and a chance to meet new people, it allowed me to discover another way I can incorporate some of the pluses of my academic life in my editorial career. I might not have the time to do this often, but it’s nice to have more options.\n My path won’t often be left to chance, but sometimes it’s nice to allow it to suggest I try something a little outside my comfort zone. It shouldn’t have taken a brush with death to open me to these possibilities, but I’m glad it set me on this course. In the year after my heart attack, I wasn’t sure if it was a good year or a bad year, but five years later, I’m convinced it was good.\n Happy anniversary to me. Five years still alive!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}