{"fingerprint": "aAs862YIIdAnIrgtqZq5pcHRrSE=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Publishing Turns Like a Battleship by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_06_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Publishing Turns Like a Battleship by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: Publishing Turns Like a Battleship\nThere was a time in my life when I frequented a lot of online message boards. These days, I still do occasional drive-bys to see what’s going one in that corner of the universe. One of the places I’ve been popping into lately is frequented by many self-published authors. While there, I stumbled across a discussion that resonated my experiences from the early years of Clarkesworld.\nThe central theme of the discussion was about respect. More specifically, whether or not self-published authors had felt welcome among their traditionally-published colleagues. The responses ranged from the militant “those people are so stupid for giving up all their money to NY publishers” to “some of my best friends are traditionally published” and back around to “they never take us seriously, but we’re just as professional as they are.”\nIf we hopped in our time machine and went back six or seven years, you’d find that the publishers of many online magazines made similar statements. To give you a taste of the climate:\n- We regularly encountered authors that told us they wouldn’t submit to an online magazine, despite the fact that we paid almost double that of the professional print markets they were being published in.\n- Several reviewers point-blank refused to consider our stories because they were published online.\n- We were accused of “killing” magazines by giving content away.\n- We weren’t real magazines because pixels are ephemeral and no one would be able to find our work in ten years.\n- When we applied to SFWA to be a qualifying market in 2007, we had to help them understand how to gauge online readership. Much to their credit, they actually listened to what we had to say, but we had to keep pressing them to get a decision.\nIt was a frustrating time to be publishing an online magazine, but those of us in the thick of things believed we were onto something promising. Unfortunately, we didn’t know how win over our critics or convince them that we weren't pixel-stained technopeasants. (That phase caused quite a response among writers in 2007 and may have been the first sign that the tide was changing.)\nIt was also an exciting time to be publishing an online magazine. It was a wild frontier with lots of ideas and new approaches. It was never dull and there were always new readers coming into the fold. From the outside, it probably looked like chaos and the traditional publishers (and many authors) simply didn't quite know what to make of it. Years later, a well-known publisher joked with me, “we’ve always been interested in the digital publishing, but were content to let other people take all the risk in discovering what worked.”\nBy 2008, the climate was already drastically different and over the next year, it began to feel like the industry was beginning to accept us. While we had always had the respect of our readers, crossing that line was a very validating experience. As much as we may not want to care what others think, it can have a significant impact on your outlook towards things.\nBetter yet, the traditional and online publishers started talking. Seriously talking. We had (and still have) a lot to learn from one another. In my humble opinion, collectively, we've made the state of genre magazines a much healthier one. It's somewhat incredible. You'd see us as competitors, but it feels more like a club. The medium we choose to publish in is no longer a factor in whether or not we are considered professional by our peers.\nToday, many indie authors are frustrated or upset with the way they feel shut out of the traditional writer's club, so I presented my little story thinking it might help provide some hope. From where I stand, I can clearly see the early signs of progress. If I had to guess, within two-to-three years, we won't be hearing much about respect based on the medium or method an author employs to publish their work.\nTraditional and indie publishing models both have value and the smart money is on those that embrace the best of both. Established authors like Mike Resnick have self-published portions of their back-catalog and well-known indie authors like Hugh Howey have signed book deals with NY publishers. It starts on the fringes and works its way in until it hits critical mass.\nThe next day, curious about what they thought of what I had to say, I checked back in at the forum. Sadly, my response was deleted without explanation.\nOn a happier note, it is with great pleasure that I inform you that “Immersion” by Aliette de Bodard has won the Nebula Award for Best Short Story. This is the second Clarkesworld story to win a Nebula and I can tell you that watching one of our authors win an award never gets old.\nAs if that wasn't enough, Locus Magazine has announced the finalists for the 2013 Locus Awards. In a repeat of the Hugo Award nominations, “Immersion” once again stands with “Mantis Wives” by Kij Johnson and Clarkesworld is a finalist for Best Magazine!\nI’d like to thank everyone that has nominated or voted for us in any of the awards this year. Reviews, recommendations, nominations, subscriptions, and comments show us just how much you appreciate what we do.\nThanks for your continued support!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}