{"fingerprint": "/jk9IxMieEec87Bzn5G6l0EG+ZI=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Ten+ Years of Translation by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_09_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Ten+ Years of Translation by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Ten+ Years of Translation\n August quietly marked the tenth anniversary of our first translation, “The Fish of Lijiang” by Chen Qiufan, translated by Ken Liu. So why am I talking about it a month later? Well, to be honest, it sort of snuck up on me.\n I am not the first editor to feel passionately about the importance of translated and international science fiction. Many editors before me have shared the sentiment, sometimes warning us of the hazards of isolation. One of my favorite quotes on this subject is by Lester Del Rey and was published in an editorial of International Science-Fiction in June 1968:\n \n “ . . . our stories are set to large numbers of fans and translators all over the world, while our own authors and fans seldom get even a hint of the work being done in our field by others. We’re in serious danger of becoming the most provincial science-fiction readers—and writers—on earth.”\n \n The magazine that published that editorial—which focused on translated works—folded after two issues. Just a few years later, in 1971, Donald Wollheim would write the following in the introduction to Science Fiction: What’s It All About (the book itself by Sam J. Lundwall translated from Swedish):\n \n “We science fiction readers whose native language happens to be English—tend to a curious sort of provincialism in our thinking regarding the boundaries of science fiction. We tend to think that all that is worth reading and all that is worth noticing is naturally written in English. In our conventions and our awards and our discussions we slip into the habit of referring to our favorites as the world’s best this and the ‘world’s best that.’”\n \n Two years later, Franz Rottensteiner wrote in the introduction to View from Another Shore: European Science Fiction:\n \n “I am afraid that European (or Japanese or Chinese) SF will be restricted, in English and most other translations, to special anthologies like this one, and they can only provide some hopefully interesting sidelights to the enormous corpus of science fiction, some tiny additional dots on the SF map. But it would be possible to put together, given good translators, some very good compilations of new stories from Europe.”\n \n Over the next few decades, those editors would see their fears come to pass. While some translated short stories continued to appear in English-language SF magazines, they remained extremely rare. Meanwhile English-language SF continued to be translated into an increasing number of languages, sometimes dominating those foreign markets. Here, translated works were often considered lesser works. When you could find them, they were, as Franz predicted, predominantly in anthologies that focused on filling that void and largely catering to a pre-existing, but small audience that was more curious or open-minded about translation.\n In 2007’s The SFWA European Hall of Fame, James Morrow states in his introduction:\n \n “Science fiction occupies a paradoxical place in the landscape of the narrative arts. One the one hand, SF writers attempt to address the human condition from the broadest possible perspective. The genre routinely invites us to regard ourselves as riders on a revolving planet, not simply as citizens of circumscribed communities. It implicitly insists that we periodically identify with the species Homo Sapiens, not merely with our ethnic heritages, religious upbringings, dysfunctional families, and personal neuroses.”\n \n The US became a regional community of readers who were perfectly willing to accept stories about beings on other worlds, but unwilling to read works from other parts of our own world.\n I’ve often remarked that English-language SF is something of an invasive species in foreign markets, often making up a significant percentage of the published works, choking opportunities for local writers. Others argue that these efforts planted seeds in places where science fiction didn’t have strong roots. That might even be true in some cases, but why then has there been such a lack of interest (here and sometimes even there) in reading the fruits of those plantings?\n Before Clarkesworld, I ran an online bookstore for almost eight years. One of the things that the bookstore was known for was for stocking a very wide assortment of English-language genre magazines from around the world. By the time the magazine was launched and James’ anthology was published, I was already among the curious. (Amusingly, it would be many years before I read his introduction, as I almost always skip them and head straight for the stories.)\n Clarkesworld has always accepted digital submissions. Right out of the gate, that provided more opportunities to have my curiosity satisfied, and occasionally it was. You might wonder why digital submissions make a difference. In the days of print submissions, authors would have to mail their stories to a publication and they would have to include a self addressed postage paid envelope for their response. That cost could be a significant deterrent for international submissions, regardless of language. Depending on how many markets a story was sent to, it was entirely possible for the author to walk away with a net loss even when published. Removing that financial hurdle created new opportunities for both editors and authors.\n Over time, it became clear that there were still some major obstacles left in the way. Significant damage had been done by decades of denying the existence of the rest of the world, whether or not I myself had participated. Authors from outside the US often felt unwelcome and still do. This is why you’ll see me encouraging them on social media or at events. It’s slow and tedious, but it’s become easier over time as our actions (what we publish) have spoken even louder than our words.\n The bigger problem, however, is the language barrier. I’m monolingual. That effectively places a burden on non-English speaking authors that want to be published in Clarkesworld. We’re a small shop, so I couldn’t come up with a viable alternative to get past this one. Finances were also a concern. Translators should be paid and that kind of work isn’t cheap. It became something I’d bring up at conventions in conversations and on panels. Though I’m not certain, I believe this is how our first translation ended up making its way to us. We had worked with Ken Liu previously and he thought we’d be interested based on things we had said.\n We were and immediately indicated our interest in considering more translations should he work on any. Over the next few years, Ken and John Chu translated several stories we went on to publish. Unbeknownst to us, what we considered a personal happy fortune was noticed by Storycom in China and they approached us with an offer, one we thought at first was simply too good to be true. Months later, we hammered out an agreement and I launched a Kickstarter campaign to cover our side of the costs. Much to our surprise, our curiosity was shared by enough people to both fund it quickly and boost subscriptions to the point of the new program becoming self-sufficient. (We had decided from the start that we would not return to Kickstarter for a second round of funding. It would live or die on the interest of our readers and their willingness to subscribe.)\n Ten years since the publication of “The Fish of Lijiang,” our Chinese translation program with Storycom continues. We’ve also published a number of translations from other languages, including a set of nine, grant-funded Korean stories.\n A few months ahead of launching our project with Storycom, I said the following in the November 2014 editorial:\n \n “I want translations to become something normal. They shouldn’t stand out or be special because of where they originate. Regularly publishing stories from other parts of the world is the best way to do that. If something is important, make it part of who you are.”\n \n It’s entirely possible that the reason I forgot such a big anniversary was because it’s become so “normal” that it didn’t even occur to me. It’s truly become part of who we are and something we continue to seek methods to improve upon, like the Spanish-language project we’ll undertake later this year. (We hope that one can become a replicable model for others to employ.)\n Thanks go to Ken Liu and Chen Qiufan for helping us take the first step, to Storycom, LTI Korea, and our subscribers/supporters for the financial support to feed the fire, and to our readers for being among the curious.\n The journey is far from complete. Together we’ll discover some amazing stories. I look forward to what the next ten years bring to the table and maybe I’ll even remember that anniversary.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}