{"fingerprint": "6Jc4B1TMH5K6YNotalsAYpdTj8g=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Five Percent by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_05_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Five Percent by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The Five Percent\n I find writing an editorial to be a difficult task. I think this one remained a blank document for the first two weeks I tried to write it. Then the Hugo Award nominees were announced and suddenly I had something I could focus on. If you’ve been following this year’s nominations and controversies surrounding some of the nominees, you already know that it has already provided countless blog fodder for people more eloquent than I. If you’re looking for some more of that, prepare to be disappointed. Life is too short for me to be bothered with that.\n What bothers me? As an editor and fan of short fiction, I’m bothered by the fact that we have less than five short story nominees for the third time in four years. This situation has been caused by a rule that requires nominees to have at least five percent of the nominations to make the final ballot. We won’t know this year’s nomination data until after the awards ceremony, but we have two other years that we can use to evaluate this rule.\n Top Five 2013 Short Story Nominations\n 107 – Immersion by Aliette de Bodard (16.6%)38 – Mono No Aware by Ken Liu (5.74%)34 – Mantis Wives by Kij Johnson (5.14%)30 – “No Place Like Home” by Seanan McGuire (4.53%)28 – “The Bookmaking Habits of Select Species” by Ken Liu (4.23%)28 – “Robot” by Helena Bell (4.23%)28 – “One Hell of a Ride” by Seanan McGuire (4.23%)28 – “We Will Not Be Undersold!” by Seanan McGuire (4.23%)\n Top Five 2011 Short Story Nominations\n 72 – The Things by Peter Watts (13.98%)42 – Ponies by Kij Johnson (8.16%)29 – Amaryllis by Carrie Vaughn (5.63%)29 – For Want of a Nail by Mary Robinette Kowal (5.63%)25 – Elegy for a Young Elk by Hannu Rajaniemi (4.85%)\n One of the effects of the five percent rule is that it helps prevent an over-abundance of nominees in a category when there is a flat pool of nominations. In 2011, the rule eliminated one story and did not prevent a tie, but in 2013, it prevented a four-way tie for fifth place that would have resulted in eight nominations.\n Some might argue that they should have allowed eight nominees, but I’m not among them. I think there is a value in trying to keep the number of nominations down. Looking at this data, however, I do see two people (Seanan McGuire for “No Place Like Home” and Hannu Rajaniemi for “Elegy for a Young Elk”) that I think were unfairly stripped of their nominations by this rule.\n When some people tried to first abolish and then fix the rules for Best Semiprozine, several of us stood up and got involved. That’s the way this award works. Any fan can come to a WSFS business meeting and have a say in the rules. You can find the procedure documented on the Hugo Award’s website at http://www.thehugoawards.org/changing-the-rules/.\n Now I think it’s time to fix the five percent rule so that we don’t continue to deny otherwise eligible nominees the recognition fans would like to give them.\n I’ve talked to a few people about possible work-arounds. A popular suggestion is to change the rule to use a “fixed number or five percent whichever is lower” instead of five percent. Unfortunately, that doesn’t solve the problem. For example, to get five nominees in 2011, the number would have to be twenty-five, which would also give us eight nominees in 2013. We might pick a good number for past years, but it could be just as broken for a future year. No, a model that considers a minimum number of nominations will always have the potential to backfire.\n The solution I’d like to put forward is to drop the five percent rule, place an upper cap of six nominees and instate a tie-breaker rule. In cases where there are seven or more, we simply eliminate works tied for the last available spot. For example, in 2013’s four-way tie for fifth place, all four would be eliminated. There would have been four nominees, instead of the three allowed under the current rules. In 2011, these rules would have provided us with five nominees.\n I believe this method of dealing with ties is closer to the spirit of the intent of the five percent rule than the actual rule has been in practice. If the number of people nominating for the Hugos continues to rise, I suspect the five percent rule will continue to go into effect and perhaps happen more often. I feel that we owe it to the nominees that have been (and will be) stripped of nominations to do something about this.\n I’d love to have some feedback on this before I make any formal proposals. What do you think?\n On a related note, I would like to congratulate this year’s nominees and say thank you to everyone that nominated me for Best Editor Short Form. This is the third time I’ve been nominated in this category and I am so honored that you still consider me worthy!\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}