{"fingerprint": "2ynWSMbinukKa7+5XMtReuBTKLg=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Best from 2021 by Neil Clarke", "author": "Neil Clarke", "date": "2021-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Best from 2021 by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: The Best from 2021\n Each year, we provide Clarkesworld readers with the opportunity to let us know which of our stories and cover art were their favorites from the prior year. Over two rounds of voting–in January and February–finalists were selected and voted on. Although participation rose by nearly ten percent over last year in round one, it was virtually unchanged from 2021 in round two. We’d like to thank everyone who participated this year and hope you’ll continue your involvement next year.\n And now for the fun part:\n Best Cover of 2021\n This year’s race was a tough one and may be the closest we’ve seen. The top three were one point apart and the others were within three of placing. In the end, our readers selected:\n 3rd Place“Space Cadet” by Pascal Blanché (11/2021)\n 2nd Place“Suspire” by Yuumei (1/2021)\n 2021 Winner\n “Forward” by Wenjuinn Png (2/2021)\n Best Story of 2021\n The final round of voting for best story was another nail-biter. The first and last few days of voting are often our most active and if averages held (and they did), any of our eight finalists could have taken the lead if the last day votes went a little differently. Given how they clustered in the first round of voting, I shouldn’t have been surprised. The last three votes established our final standings and yielded ties for 2nd, 3rd, and 4th place.\n 4th Place (TIE)\n 3rd Place (TIE)\n “Homecoming is Just Another Word for the Sublimation of the Self”by Isabel J. Kim (Short Story, 3/2021)\n 2nd: Place (TIE)\n 2021 Winner\n Congratulations to all of this year’s winners and finalists! The close races and strong support shown for each story and cover are something that this community can be proud of. We look forward to providing readers with much more to be excited about in the year ahead.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}