{"fingerprint": "2nzk3wTMzfj5DQcDWPLuXtjOvVw=", "sitename": "Clarkesworld Magazine", "title": "From the Editor's Desk by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_05_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: From the Editor's Desk by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n From the Editor's Desk\n I don’t enjoy writing editorials. I much prefer to be behind the scenes, picking stories or artwork, but this month I feel obligated to say something. As you may have heard, last month, I was nominated for a Hugo Award in the Best Editor Short Form category. It blew my mind. Since Clarkesworld is my only editing job, this nomination can only come from you, our readers. I’m very overwhelmed by your support. Thank you! The honor is even more special to me as it is the first time an editor has been nominated purely on the basis of work done in a digital medium. As someone remembers when online fiction was considered second-class, this means a lot to me.\n Clarkesworld is also represented in the Hugos by the fiction of E. Lily Yu (Best Short Story Nominee, “The Cartographer Wasps and the Anarchist Bees”, April 2011) and Catherynne M. Valente (Best Novella Nominee, “Silently and Very Fast”, Nov-Dec. 2011). Furthermore, two articles originally published in Clarkesworld appear in Daniel M. Kimmel’s Best Related Work-nominated book, Jar Jar Binks Must Die . . . and Other Observations about Science Fiction Movies. While not officially a Hugo, the Campbell Award for Best New Writer is part of the Hugo ceremony. This year, we are very pleased to see E. Lily Yu among the list of very talented Campbell nominees. Our congratulations and best wishes go to all of them.\n The Hugo’s weren’t the only good news for Catherynne M. Valente. She’s just sold two novels to Tor, one of which is based on “The Radiant Car Thy Sparrows Drew” from Clarkesworld #35. Can’t wait for that one!\n While I might not enjoy editorials, they are something I need to work on. Last month, I used our social networking presence on Twitter and Facebook to solicit some ideas for future editorials. The suggestions were all over the map, but a few homed in on the changes we’ve gone through over the years and data we’ve collected in regards to reading, writing and online fiction. That seems like a good theme to cover in our fifth anniversary year. Have you ever been curious about our readership, most popular stories, the slush pile or the trends we’ve observed? Now’s your chance to ask. Email me at neil@clarkesworldmagazine.com or leave a comment on our website and I’ll try to work those angles into next month’s issue.\n Until next time, thanks for reading!\n -Neil\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}