{"fingerprint": "6nU/Loy1GilXfSHEpPBNrcDwClE=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: The Little Things by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_08_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Little Things by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor's Desk: The Little Things\nI turn fifty this month. Normally I don’t make much of a fuss about my birthdays, but this year I’m letting my family throw a party. It’s not that I expect fifty to be any different than forty-nine, but it is a milestone year and since the heart attack, those milestones actually mean something to me. Little victories are important too.\nAs I mentioned in an editorial a few months ago, one of the presents I expected to have received by now was to be free of my day job so I could focus entirely on Clarkesworld and my other editing projects. Unfortunately, what appeared to be a solid job prospect for Lisa suddenly evaporated after some staff changes at that company. That set her back to square one and has left me in an increasingly frustrating position of being stuck where I am. I know she’ll find something, but it appears the little losses mean a lot to me now too.\nI recently blogged about having impostor syndrome. It’s that terrible little voice in your head that tells you that success was just luck, a fluke, and it will all evaporate when people figure out the truth. If you aren’t careful, the little losses in life can be magnified by this beast. Far too many of us in this field seem to feel like impostors and I’ve been at war with my personal monster for too long now. Lately though, I think I might be winning.\nI’m a big advocate of magazines starting small and growing. In my eagerness to see the magazine expand, I’ve allowed impostor syndrome to convince me that the value of my work was the enjoyment I received from it, so I took a smaller financial reward. Oddly enough, this is counter to the advice I give authors: make sure you get paid. I also told myself that reinvesting in the magazine would pay out in the long run. My vision demanded the magazine be “complete” before I could be justified drawing a proper wage.\nThere was a lot of theory in my madness. Fortunately, enough of it was correct and our revenue steadily increased over the years. Where I failed, however, was in identifying the relationship between readership and supporting readership. Over the last three years, our readership has increased, but the percentage of readers supporting us has steadily declined. This year, it dropped below seven percent for the first time. So much for little losses. That’s a real problem.\nOptimally, I would like to be at ten percent. Think about that for a second—one in ten people would be paying for our work. Insane, right? Yet, that’s the business model most online magazines are working towards. Each of us have some ridiculously low percentage as a goal. It’s no wonder that people have been trying to convince me to reconsider our approach to free content.\nI know the market is oversaturated and that’s probably a contributing factor, but I’ve been watching with interest as individual authors with similar social media footprints launch Patreon pages and related projects. I’ve seen them rapidly shoot past what we make in a month while offering considerably less than we do in return. Clearly this is more of a passionate show of support for their work than it is about getting something. Sadly, you don’t see this happening with magazines, so one has to ask, has the short fiction community lost its passion for magazines? And before you say anything, those “we’re going to close if . . . ” Kickstarters tend to work only by deliberately manipulating their supporters. It is not quite the same. I don’t see authors saying “I’ll never publish again unless . . . ”\nSo where’s this newly-minted cranky fifty-year-old man headed with all this? I’m not sure. I know we have to continue to grow the size of our audience, but this trend seems to indicate that it will only grow increasingly difficult to bring in supporting readers. We need to start thinking about what we can do about that ninety-three and change percent that don’t support our efforts. I have no doubt that some of you are reading this, so I’d love to hear from you and find out why you think things are the way they are.\nAnd hey, if anyone feels like giving me a fiftieth birthday present, subscribe at any of our vendors or make a pledge over at Patreon. Every step back towards seven percent—or dare I dream ten percent?—provides one of those positive little milestones I’ve learned to appreciate. Maybe we can even do this before our tenth anniversary this October!\nP.S. I didn’t want the six plus percent of you supporting us to think I’d forgotten you. You’re my favorite readers and listeners. Without you, none of this would be possible.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}