{"fingerprint": "/SjuzmQ1QimhhKTaDbZB9+2cTDQ=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Things are Always Worse in the Dark by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_10_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Things are Always Worse in the Dark by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: Things are Always Worse in the Dark\n Sometimes life gets complicated. For the last five years, I’ve been dealing with the fallout from my heart attack. In the end, it caused me to change my life for the better, but it does come with some baggage. It shouldn’t surprise anyone that fear drove a lot of those changes. Fear that I might not get a chance to accomplish certain things, like seeing my children grow up, made it incredibly easy to suddenly change my diet and accept that my old career was a major source of unnecessary stress in my life. Surviving also comes with a healthy dose of gratitude and appreciation for what you have and in the good times, that keeps everything in balance.\n September was a little off-balance. During my most recent visit to the cardiologist, they heard a bruit in my carotid artery. Typically, this is caused by an abnormal narrowing of an artery and given my history, it was something worth investigating. There was no need to rush, so it was scheduled for a few weeks later. The logical part of my mind knows that when a doctor schedules a test that far out, they don’t consider it immediately life-threatening. Relax. Meanwhile, the fear-driven monkey in my brain is bouncing around causing all sorts of commotion.\n I spent the rest of the month with those two halves slugging it out. I found it difficult to focus on projects that were due, emails that were piling up, or stories that needed to be read. It was like having a fly constantly buzzing around your head, annoying, but not seriously so. Heavier projects were put to the side, pleasant distractions were introduced, and I made it to my test earlier this week.\n Cardiac office waiting rooms can be like therapy centers. We’re all in the same boat and once someone starts talking, it just all pours out. Politics, race, religion . . . it doesn’t matter. We’re an odd family. This time, I was the veteran, with my five years being more than any of the others, but I was also, once again, the kid, the youngest in the room.\n The woman in the seat next to me was new to all this and a bit worried about a test I had taken several times before. I spent a few minutes chatting with her and providing some sense of what to expect from the next couple of hours. It then comes out that she’s just had the test I’m worried about, so it’s her turn to share. Others chime in about their tests and the collective blood pressure of the room goes down.\n Twenty minutes later, I head in for my test, more relaxed than I had been in days. The technician has me lie down and they ultrasound both sides of my neck. I have some idea of what I was seeing on her screen and was fascinated watching as the test progressed. When we were done, she looked at me like she expected a question and then said, “I can’t tell you anything about your results, but I am letting you go home, which means I saw nothing that requires the doctor’s immediate attention.”\n I still haven’t heard from my doctor, but the not knowing isn’t as bad. Maybe it’s because I’ll know soon. Maybe it was that I just needed to talk things through. Maybe being sent home was enough. Things always seem worse in the dark.\n Happy Halloween.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}