{"fingerprint": "gncQCMlfyUjpdEy83PcYwTEHNWs=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: In Mourning by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_10_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: In Mourning by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\n Editor's Desk: In Mourning\n I was all set to pen an editorial celebrating our fourteenth-anniversary issue and the plans we have for next year, but I’m not sure I have it in me right now. Mind you, I’m extremely grateful to see the magazine reach this milestone and proud of the accomplishment. There are ups and downs, certainly, but none of those are what have me off-kilter at the moment. It’s not even the pandemic or the host of other terrible things that 2020 has had to offer. No, today, I’m in mourning.\n I’ve been fortunate enough to have a few special people in my life, individuals who through their actions have influenced me in a positive way. When my parents immigrated from Ireland, they left most of their large families behind, meaning that I seldom had the opportunity to spend time with my aunts, uncles, and cousins. Johnny, my cousin, was an exception. He came to America and worked for my father in his upholstery shop. A bit more than fifteen years my senior, I don’t remember a time that he wasn’t in my life.\n Age ten was a difficult time for me. I was bullied mercilessly at school. I don’t think he knew, but his Christmas present that year—my first three science fiction books—provided me with life-saving escapes from that reality. Later, in college, he came with me to a few genre conventions and many more years down the road, his gift placed me on the path I’m on now. (For symmetry, I’ll add here that last Christmas, I gave him a first edition hardcover of the anthology he gave me all those years ago: Adventures in Time and Space by Healy and McComas. I had been searching for copies for the two of us for years and finally found them earlier that fall.)\n While others were bemused or even a little confused by my turn from a “good” job in academic technology to publishing, he always supported me. No one else is much of an SF fan in my family, but a few will read the occasional anthology or story I’ve edited. He read every new issue, every anthology, and listened to every podcast. Signed copies of my anthologies were a regular requirement and soon I was sending him extra copies for his friends. He was genuinely proud of the work I’ve done and when I tried to explain to him the importance of his role in that, he downplayed it, refusing to take any credit.\n He never had the chance to come with me to Worldcon or the Hugos. He desperately wanted to travel with the rest of our family to Dublin last year, but his health wouldn’t permit him to fly. DC in 2021 was to be the first local Worldcon he could have attended and if a finalist again, I would have loved to have brought him to the Hugos. In the eight times I’ve lost for Best Editor Short Form, I’ve had an unread speech that thanked him. This year, when he made his post-Hugo phone call, I told him what would have been said. I’m so glad I did.\n Early last month, Johnny was admitted to the hospital and diagnosed with cancer. For weeks, the doctors attempted to stabilize his health so they could operate on him, but his condition only worsened. I couldn’t visit him in the hospital, but we spoke several times, decreasingly as his ability to have a conversation faded. Our last chat was just to say hi. A few days later, the doctors informed us that the window for surgery had passed and moved him to hospice care.\n As you’ve probably figured out, there’s no happy ending to this story. Johnny passed away on the morning of September 25th. I am crushed, but he will always be with me in my mind and heart. Cherished.\n If you have people like Johnny in your life, tell them. Thank them.\n Thank you Johnny. Love you.\n Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}