{"fingerprint": "PnCQk58LuDCNtDbafTaCWNFOPCk=", "sitename": "Clarkesworld Magazine", "title": "Editor's Desk: Reader's Poll Results and Other Award News by Neil Clarke", "author": "Neil Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/clarke_03_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Reader's Poll Results and Other Award News by Neil Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Editorial\nEditor’s Desk: Reader’s Poll Results and Other Award News\nOur 2013 Reader’s Poll closed last month and I’ve been patiently awaiting the opportunity to share the results with you. With no further ado, I present this year’s winners:\nCover Art\nFirst Place:\n“Silent Oracle” by Matt Dixon\nSecond Place:\n“Rainforest God” by David Melvin\nThird Place:\n“Lost in Space” by Piotr Foksowicz\nNote: Matt took first place this year by a healthy margin, but over the month, five different works held the number two spot at least once.\nFiction\n- First Place: “The Urashima Effect” by E. Lily Yu\n- Second Place: “Effigy Nights” by Yoon Ha Lee\n- Third Place: “Silent Bridge, Pale Cascade” by Benjanun Sriduangkaew\n- Fourth Place: “The Promise of Space” by James Patrick Kelly\n- Fifth Place: “Cry of the Kharchal” by Vandana Singh\nNote: The top five stories were a total of ten points apart, with the gap between first and second being the only place where there was more than a three point difference.\nOther Awards and Recognition\nLocus Magazine released their recommended reading list and it included the following Clarkesworld stories:\n- “Soulcatcher” by James Patrick Kelly\n- “The Promise of Space” by James Patrick Kelly\n- “Effigy Nights” by Yoon Ha Lee\n- “Mystic Falls” by Robert Reed\n- “Cry of the Kharchal” by Vandana Singh\n- “No Portraits on the Sky” by Kali Wallace\nThe annual Locus Poll is now open to everyone. You can participate at:\nHugo Award nominations are open until the end of this month. Unlike prior years, Clarkesworld is not eligible for the Hugo Award for Best Semiprozine. I encourage you to check out semiprozine.org for a list of many eligible magazines you can nominate. Of course, our stories and editors are also eligible in the appropriate categories. (See: neil-clarke.com/2014-awards-eligibility-hugo-nebula/ for a handy by-category list.)\nI’d like to take this opportunity to thank our subscribers and everyone else that has supported us financially last year. Becoming ineligible for the Semiprozine Hugo is a milestone for us. It means that with your help we’re moving towards our goal of becoming a full-time business. With that comes the time and resources to maintain and improve on what we can offer. We still have many milestones to go—for example, we’re still non-professional in the eyes of the World Fantasy Award—but your support provides the confidence we need to believe we can get there.\nThank you!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons."}