{"fingerprint": "OyZwfHUvlcEUbkeUOZFFdX/Cy1U=", "sitename": "Clarkesworld Magazine", "title": "Flash Gordon, Cardboard Space Stations, and Zero Gravity Sex: Why Science Fiction Isn't Always to Blame by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_09_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Flash Gordon, Cardboard Space Stations, and Zero Gravity Sex: Why Science Fiction Isn't Always to Blame by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nFlash Gordon, Cardboard Space Stations, and Zero Gravity Sex: Why Science Fiction Isn't Always to Blame\nIt was early July of 1960 and Flash Gordon was in trouble.\nA deadly virus had Flash, Dale and Doctor Zarkov trapped on a space station as it killed one crewmember after another. However, on July 12, Zarkov and the team of doctors discovered the answer:\nInterferon.\nFor most people watching the victims’ rapid recovery, it was the first time they’d ever heard of the new miracle drug, which Alick Isaacs had discovered only three years before. However, it wouldn’t be the last: experts hailed it as “penicillin for viruses” and promised that it would cure the common cold and wipe out nearly every viral infection.\nBut it didn’t quite work out that way.\nThe discovery of interferon was one of those moments which beautifully illustrates how sudden intuitive insights spark new discoveries. At the time, biologists believed that the cell had no means of fighting a viral attack. If this attack slowed, it was because of some external factor—bits of the virus stuck in the cell membrane, perhaps—or the virus had exhausted the cell’s resources. Isaacs began to suspect, however, that there had to be something attacking the virus. He devised a simple but elegant experiment using fertile hen’s eggs and discovered a mysterious protein which “interfered” with the action of the virus.\nHowever, many of his fellow virologists sneered at his discovery (one of them dubbing it “misinterpreton”), claiming that his results were the result of a laboratory error. Isaacs began to believe he had accidentally contaminated his experiment, became depressed and was briefly institutionalized—and then someone else repeated his results.\nThe possibilities of such a discovery were obvious, and once it was accepted, the wild claims about interferon soon started. The problem was that Isaacs just didn’t have the methods he needed to isolate and study the elusive protein. Isaacs spent the rest of his life on his research (he died less than a decade later at age forty-five ) but never got to see it come to fruition.\nWe now know that there are ten different interferons (seven in our cells). They’ve been used to treat a wide range of illnesses from genital warts, to tumors, certain viral infections and MPN (blood cancer).\nBut we still don’t have the interferon nasal spray—the instant cure for the common cold—which Omni magazine confidently predicted in 1982 would be in every medicine cabinet by the end of the decade. It is actually available in Russia and parts of Europe, but it causes bleeding in ten percent of those who use it—and most experts do not believe that the doses are anywhere near high enough to work.\nThere is no question that interferon is an absolutely incredible breakthrough. It just doesn’t do everything people hoped it would.\nScience and science fiction have long had an uncomfortable relationship.\nAt times it seems like they just can’t stay together. Writers who strove mightily to keep their books accurate are today often held up to scorn. Their problem far too often was that the real discoveries and scientific ideas at the heart of their work ended up exaggerated almost beyond recognition.\nScience fiction gets blamed most of the time. After all, we all know that fiction is a work of imagination. But far too often—and despite all the familiar claims of scientific objectivity—it has been scientists who allow their imaginations to get caught up in visions of the incredible new future their efforts will bring about.\nOne of the worst “offenders” was Willy Ley.\nHis book, The Conquest of Space, ranks as one of the most successful works of popular science ever. Millions read its dazzling predictions of the step-by-step program which would take us into space. We would live there, work there, study the universe there, then move on past our world to explore others. Equally stunning were the illustrations by the great Chesley Bonestell, who gave incredible solidity and believability to Willy’s most extravagant claims.\nEven more extravagant was the series of children’s books the two produced, with titles like Space Station and Space Pilots (my ragged third-hand copies were among my greatest childhood treasures). Chesley’s stunning art takes over, in full color and often full page; full of incredible vehicles, men working in space, detailed views of the station and life inside it. The two were a true dream team, bringing their vision to life with a flair few science fiction writers of the age managed.\nNaturally, their work inspired a lot of science fiction: many writers borrowed heavily from Ley’s vision of life in space, and Bonestell’s art occasionally graced their stories. In the movies, Chesley created mattes and vehicle designs for Destination Moon, When Worlds Collide, and It! The Terror from Beyond Space. Perhaps his finest moment was his work for the movie “adaptation” of The Conquest of Space, which includes a space station and a winged Mars lander. It’s almost enough to make us ignore the grizzled, hard-headed military scientist leading the expedition suddenly developing religious mania.\nAlmost.\nEven those films Bonestell didn’t actually design often steal from him, with Hammer’s Spaceways, The Green Slime and Antonio Margheriti’s Spaghetti space operas among the most shameless. His wheel-shaped space stations have become a cultural icon, making appearances in everything from Doctor Who to Toho’s giant asteroid film, Gorath. Robot Bastard! even features one made out of corrugated cardboard.\nBehind all Ley’s predictions lay all the years he’d spent researching rocketry, first for the Germans, then for our space program. His research informed all the colorful Bonestell illustrations, and his books never shied away from discussing the hard science backing up his predictions. It was, in fact, a brilliant piece of work.\nWhich doesn’t mean he didn’t get things wrong.\nOr even very wrong.\nPolitics drove some of the biggest departures from Ley’s predictions. The X-15 was always meant to be a precursor to Ley’s reusable space planes (a few years ago we reclassified its pilots as astronauts). However, the X-15B, a radical re-engineering of the plane that would have made it the next best thing to a space ship, got cancelled when our space program’s goal became putting a man in space as soon as possible, even if it meant sticking him in a tin can with an oversized firecracker under it.\nBut when NASA finally returned to his dream of reusable space planes, with soaring promises of space stations and Mars expeditions, it didn’t work out as predicted.\nOne of his most visible mistakes is also the one that few people notice: He portrayed his astronauts putting the big wheel together piece by piece, welding girders and panels together in space (an image which makes a brief onscreen appearance in 2001: A Space Odyssey)\nHowever, when we built the ISS, we sent up individual pre-fab modules, like an overgrown Snap-Tite model. While there have been a few, somewhat more ambitious proposals—such as boosting the shuttle’s fuel tanks into orbit and refitting them—none of them have ever been adopted. Nor has anyone ever added rotating sections to the real space stations.\nThe harsh reality is that working in space proved far more difficult, dangerous and time-consuming than anyone had imagined. Even these simple assembly jobs sometimes require hours of effort.\nNor did Ley’s vision of space planes ferrying back and forth from orbit regularly prove to be realistic. While NASA originally announced an ambitious schedule for the new shuttle, which assumed that an orbiter could be refitted, refurbished and ready to launch again in a matter of weeks, it was quickly forgotten. Once again, reality was far harsher than anyone had realized.\nWhich is more than a little reminiscent of what happened in 1929 when film auteur Fritz Lang brought in one of the top rocket experts in the world, Hermann Oberth (who would later be one of the key members of Hitler’s missile program) as his scientific advisor for Frau im Mond—a job which also included the construction of a rocket as a publicity stunt. While Lang’s cinematic rocket ended up mostly accurate, (except for a curious decision to immerse the rocket in water for takeoff!) Oberth never finished the real rocket. He may have known more about rockets than anyone else in the world, but he still didn’t have any idea how to actually build one.\nLey’s spiritual heir was an American professor, Gerard K. O’Neill, whose book, The High Frontier offered an even wilder vision of man in space. While Ley’s space stations were filled with astronauts, scientists and explorers, O’Neill envisioned us sending up thousands of average people to live in space. He pictured lunar mining operations shooting raw material out into Earth orbit, with vastly lower energy costs than launching from Earth. There it would be turned into vast orbiting habitats, monstrous cylinders or spheres, with bands of farmlands and waterways—and, of course, zero-gravity sex hotels at the poles.\nHis habitats have shown up in almost as many places as Ley’s creations: perhaps the most familiar is Babylon 5 (although the show rarely ventured into the wide-open main habit areas of the station).\nHowever, they would require incredible amounts of spacewalking labor to construct, even if the materials arrived at L5 in some easily assembled form. With our space program currently in disarray, they look even more unlikely than Chesley Bonestell’s elegant wheels.\nAnd one has a sneaking suspicion that Larry Niven got it right in The Patchwork Girl when he portrayed low gravity sex as awkward and technically challenging rather than blissful.\nThere have even been moments when out-and-out pseudoscience in science fiction has its origins in claims made by real scientists.\nTake the curious case of psionics. Mental powers keep showing up in science fiction, even in the work of authors like Arthur C. Clarke whose visions of the universe were otherwise materialistic. Most of the blame for this seems to rest with famed editor John W. Campbell, who pressured his authors into working “psionics” into their stories for Astounding (which alienated many of his writers). He coined the term, combining “psi” (extrasensory abilities) with electronics. He believed that science would ultimately allow us to harness these powers as effectively as we could control the flow of electricity in a circuit, and even championed a supposed psionic amplifier, the “Hieronymus device.”\nBut Campbell’s obsession still had its basis in the work of a real scientist. He’d discovered the work of Duke University’s J. B. Rhine, the founder of parapsychology, in the 1930s and was impressed by Rhine’s attempts to bring scientific rigor to the study of ESP. Even the Hieronymus device had its roots in the claims (albeit highly dubious ones) made by an electrical engineer, although Campbell exaggerated them almost beyond recognition.\nWe now know that there were serious methodological flaws in Rhine’s work—and no one else has ever duplicated Rhine’s modest successes.\nThis did not dissuade large numbers of people from believing him at the time. Or today, for that matter. Whatever one may think of his work, Rhine’s greatest success was selling the idea of parapsychology to the general public.\nIt would be easy to dismiss much of the science fiction about nanotech as total fantasy. Books such as Neal Stephenson’s The Diamond Age and Greg Bear’s Slant paint dazzling portraits of worlds almost completely restructured by nanomachines: they steer flying machines without control surfaces; wars rage at the nanolevel; and almost anything can be made by nanofabrication methods. Others, like Michael Crichton’s Prey, feature “grey goo,” the monstrous runaway growth of self-replicating nanomachines. In Wil McCarthy’s Bloom the goo has not only overrun Earth, but most of the inner planets of the solar system.\nYet, once again, much of this—including the grey goo itself—came not from their overheated minds but from the scientist who first popularized the concept.\nWhile Richard Feynman first discussed the possibility of making such machines back in 1959, the concept burst out fully formed in 1987 with Eric Drexler’s book, The Engines of Creation.\nDrexler figured that man could do nature one better: instead of assembling his micromachines from unpromising materials that were little better than a soap bubble, Drexler conceived of nanoscale assemblers, capable of making his tiny machines atom by atom out of any material. He even coined the term “grey goo,” envisioning it as one of the major hazards of his brave new nanoworld.\nMore than anything else, it was his images of microscopic machines made from single atoms, as if they were tiny tennis balls, that caught the public’s eye.\nShortly after the book came out, Stanley Schmidt, the editor of Analog, encouraged his writers to read it, and then create stories using Drexler’s ideas. Because these stories came out so soon after The Engines of Creation, science fiction has been the lens through which the public has viewed nanotech (and one of the reasons so many people fear it).\nHowever, the scientific response was quite different: many challenged Drexler’s more sensational claims. Dr. Richard Smalley—a leading researcher in the field, discoverer of the “buckyball,” and an avowed “fan” of Drexler—has been among his most active critics and one of the first to offer an extensive critique of his claims. He found the nano assembler claims absurd and unworkable, noting scathingly in their 2003 open debate that “you cannot make precise chemistry occur as desired between two molecular objects with simple mechanical motion along a few degrees of freedom in the assembler-fixed frame of reference.”\nIn fact, Drexler’s machines face quite a number of unique challenges because of their scale: atoms are “sticky” at the quantum level, and reactions often require very precise amounts of energy at the right time and place. A nanosub trying to navigate our bloodstream would find surface tension, Brownian motion and the viscosity of fluids at that scale almost insuperable obstacles.\nInstead, most nanotech research focuses on more achievable goals like fabrication methods and nanomaterials. Ironically, they now realize that softer, more pliable materials—like the lipids Drexler sneered at—would do a far better job of handling the endless battering of Brownian motion. Rather than trying to outdo nature, they’ve found it easier to work “with the grain.” As a result, current applications include devices built with DNA and RNA, and fabrication methods similar to protein folding. Rather than nanotech “boxes” that make anything we need, we will get pants that shed stains or even a combination shampoo and conditioner.\nThere has been one rather sad development, however, thanks primarily to the exaggerated public image of nanotech. Companies have made a lot of money on products with the word “nano” on the package, even though they may have little or nothing to do with nanotechnology. Some researchers have done almost the same thing, using the word in their grant applications because they know it increases the likelihood their work will be funded (and one has a sneaking suspicion DARPA is probably spending millions on dubious defenses against “grey goo.”)\nSome intriguing nanomachines are already in use, such as the triggers used for airbags, but for now at least, Drexler’s most extreme claims seem unlikely, to say the least. Perhaps someday we will create the devices he imagined, even the fabled nanotech assembler. It just isn’t going to happen any time soon.\nNot too long ago, it was fashionable to picture scientific progress in purely deterministic terms. Our research programs would inevitably yield new discovery after new discovery, through an almost mechanical process of experimentation and observation based on the scientific method, until we unlocked every secret of the universe.\nHowever, a close examination of the history of science reveals something completely different. The great scientific discoveries have all been made by thinkers who could look at the known facts and suddenly imagine some new way in which they all fit together. Einstein went from the dark night sky to a four-dimensional manifold that was finite and yet unbounded. Kepler suddenly saw how the new data he and Tycho had painstakingly assembled could still be fit into a heliocentric universe—if the planets did not have perfect circular orbits. Two young men playing with wire and plasticine models in the back of their classroom suddenly realized that the seemingly random pattern of DNA bases must carry the information they believed the molecule contained. A dream of a snake biting its own tail revealed the true shape of the benzene molecule. The list goes on.\nUltimately, the engine of science has always been human imagination and intuition. True, it often took years of painstaking work and rigorous experimentation to translate an insight into a workable theory—and a great many of these ultimately fail. But without these bursts of insight—even the ones that proved wrong—there is no scientific progress. We may not think of scientists as wild-eyed romantics, dreaming of fantastic futures, but sometimes they are. Sometimes they can imagine fantastic—if fanciful—futures in which their ideas get carried to the furthest limits, visions as wild as anything ever conceived by science fiction.\nAnd that’s not such a bad thing.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}