{"fingerprint": "OtKOMI2sdCIUTl1UPPeJnWbDcYU=", "sitename": "Clarkesworld Magazine", "title": "The Military, Magic, and the Misery Ethic: A Conversation with Myke Cole by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Military, Magic, and the Misery Ethic: A Conversation with Myke Cole by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nThe Military, Magic, and the Misery Ethic: A Conversation with Myke Cole\nIn Shadow Ops: Control Point by Myke Cole, Oscar Britton is an officer attached to the Supernatural Operations Corps. He might doubt the system now and then, but he puts his life and the life of his men on the line to uphold it.\nAnd then he begins to manifest magical abilities. According to the post-Great Reawakening law, Britton should turn himself in. Instead he runs.\nIn Shadow Ops: Fortress Frontier, Alan Bookbinder works in the Pentagon. He’s a family man. An administrator. A paper-pushing patriot. He believes in the system. In fact, he makes the system work. When Bookbinder wakes from a nightmare, the strange current that runs through him is certainly not doubt in the system. Bookbinder thinks the “drowning” feeling might be a heart condition, but the doctor diagnosis it as a panic attack.\nWhen Bookbinder discovers that the “current” is magic and that he is, indeed, Latent, he follows the rules. He turns himself in, even though it may mean losing everything and everyone he loves.\nThe Shadow Ops universe crackles with wind, fire, and stone magic (to name but a few types). There are villains like the aeromancer, Harlequin. There are monsters and elementals. Cole dips generously from the genre well to produce novels that could be labeled grimdark, urban fantasy, military fantasy, or simply speculative fiction.\nReaders easily sense Cole’s love of comic books, adventure fiction, and late night games of Dungeons and Dragons.\nEqually obvious, is Cole’s experience in the military and as a civilian and government security contractor.\nAnd there are a lot of pretty cool places—the magic, the military jargon, the many forms of magic—in Coles novels where he could’ve lost sight of his mission or gotten bogged down. But he doesn’t. He stays focused on the characters—what’s going on inside them and what happens when they have to make hard decisions.\n“The only interesting thing in life, really, is people interacting with other people,” said Cole, “and that’s really what all stories are. If you boil down any story, no matter what it is . . . it’s always people interacting with people at its heart.”\nThe most interesting thing about Cole’s Shadow Ops novels is, indeed, “people interacting with people,” and that’s saying a whole lot.\nBelow, Cole and I talk about writing, PTSD, and the military. We talk about his characters, his books, and his Misery Ethic. And we have a whole lot of fun doing it.\nWhen I read a book I love, my first instinct is to not apply any critical thinking, but at the same time I’m trying to figure out, “Why do I love this so much?” You’re recent post about post-traumatic stress disorder answered some of that question for me.\nI think books work on a couple of levels. There’s a visceral, gut-punch reaction to how characters resonate with you. Sort of your own lens. I did another blog post on China Miéville and why I wanted to meet him, and one of the things I said in it is that every time I read a book I feel like it’s a book written just for me, that my experience with it is so unique that it’s almost like I’m reading a different version of the book than everyone else.\nBut I also think critical thinking can be applied, and there is a rational lens that can be looked at, and people can make arguments for why a story works or why it doesn’t and that those arguments are common, I think, to most readers.\nThe Shadow Ops books definitely aim for the gut. I nearly had a panic attack reading the early sequences of both books, when Britton and Bookbinder realize that they are magical [Latent].\nI’m so pleased to hear that you have that visceral reaction. That is the goal. I get different reactions from people. There are plenty of people that absolutely loathe my writing and plenty of people that love it, but the reaction I fear the most is people who go, “Eh,” and are somewhere in the middle. That’s death to a writer.\nDo you encounter many readers who have a “somewhere in the middle” feeling about these books?\nNot the first one [Shadow Ops: Control Point]. Most people seem to either really like it or really don’t like it. The second book [Shadow Ops: Fortress Frontier] . . . I don’t want to flatter myself, but it’s almost universally praised. I haven’t read a lot of bad reviews about it, but there have been a couple of people who have said that the book just didn’t rouse them in the way they had hoped it would. Luckily, those voices have been few enough.\nI think it was Charlie Stross who wrote that a polarized fan base is actually a really positive sign because it means that your writing is really affecting people, and a person that really hates you or hates your work is actually more likely to read it than someone who had a bland and banal experience with it.\nThe idea of forcing us—the readers—to change viewpoint characters with each novel in a series seems to be the very thing that you force your characters to go through: the world is the same, but now I’m having to see it differently.\nThat’s a great way to explain it. I never even thought of it that way. For me it was a much more bald approach.\nAce mass market originals, in particular, have been very successful with a long run of novels that deal with a single protagonist. [Jim Butcher’s] Harry Dresden is a great example of that. [Charlaine Harris’] Sookie Stackhouse is another great example. People love them, and it’s a really great way to run a series.\nThe thing for me is that all of the stories that have been most dear to me have had ensemble casts. I think that’s one of the reasons that Game of Thrones is so unspeakably resonant, so incredibly successful.\nMy intention was always to do an ensemble cast, and part of it was because those are the kinds of stories I like, but part of it was also that the world is interesting and the people in it are interesting, and maybe I’m ADD or easily distracted, but I want to see it through different lenses.\nI also think, frankly, it’s the best way to grow as a writer because it forces you to really, really immerse yourself in different character types with different goals and different experiences, and that’s really the only way to improve in my mind.\nIn Shadow Ops: Control Point, we get an image from the cover art that suggests one type of character, and then you show us that the person that we think of as powerful, the muscles, the tight t-shirt, the big gun, often feels powerless.\nThat’s exactly right.\nYou pull a cultural rug out from under us, and that’s a huge risk . . . with, of course, huge rewards, too.\nThe thing is: who knows if I’m reaping those rewards or not. Again, I was successful, but I just wish . . . it’s breaking the fourth wall, I guess, because the reality of it is that I’m an officer and I command about 50 people right now, and I have to make a lot of decisions, and a lot of decisions that there is no right answer to and I’m going to be in a lot of trouble if I get it wrong. I try very hard to come across as Alan Bookbinder does. He turns into Patton by the end of the book, right? But the truth is I agonize, and it’s hard. Sometimes I do waffle all over the place, and sometimes I make bad calls. That has been my experience as a military officer, and it’s been the experience, I guess, of the people I’ve seen around me as well.\nJohn Ringo writes those books with the big gun and all that stuff and has a huge audience of people that love it; but he’s doing that. I don’t want to do that. I want to do something else.\nSomewhere in the first few chapters of Fortress, Bookbinder is talks to a doctor about anxiety. I am told by doctors that this is one of the hardest things for men in this country to do, to acknowledge an anxiety disorder even with a doctor.\nI think two things hold back members of the United States military from seeking help for anxiety disorders, and the first is security clearances. Despite the Department of Defense and the intelligence community’s insistence that self-referring for mental health issues will not result in a loss of security clearance, most people don’t believe it, and there are always horror stories about it.\nI mentioned in my essay on PTSD that it kept me from getting help for a long time, and sure enough, it was fine; but I do think that it holds a lot of people back because the security clearance process is very opaque, it’s very protean, and you have no control over it. Clearance is a privilege, not a right, and they can take it away for any reason or no reason at any time. The loss of your clearance isn’t the loss of your job; it’s the loss of your career. You will never work in that field again, and that really scares the crap out of people who depend on this work for their livelihoods.\nThe other issue is the perception of leadership. In the military whether you’re a noncommissioned officer or a commissioned officer, you’re a leader, and people are looking at you all the time. You are the face of whatever your mission on and the face of your organization, and if you appear frightened or uncertain or weak, while that’s okay, that trickles into the morale of your people.\nNo one ever specifically says to you that you can’t do that, but when we admit to ourselves that we have challenges, anxiety or what have you, seeking that help, because we’ve been trained never to show it, it’s really, really tough.\nI think that the climate of leadership will eventually change and the action of seeking help will be seen someday as a position of strength and something that your people will admire you for, and also an example to them that, when they have these issues, there’s no problem with getting help, just like there’s no problem when you have high blood pressure going to get help.\nBut that climate doesn’t exist yet, and I think we have a long way to go to get there.\nAre you seeing improvements?\nSure, every day. I’m so proud of the military, how progressive we are.\nIt’s so funny. It’s almost an analog for . . . people think that Oscar Britton should be a badass, and I’m portraying him as I think he really is. I think people think the military is an incredibly conservative organization when the truth is we’re the most progressive organization in the country.\nWe integrated people before desegregation. The conversation about ending segregation started was because Eisenhower integrated military units. We abolished “don’t ask, don’t tell” long before the civilian legislature has permitted marriage equality, and that’s an argument we’re seeing before the Supreme Court right now.\nSo yes, I do think that we’re seeing a change, and I’m enormously proud of the fact that the United States military tends to be out front on these really important issues.\nWhere do you suppose that progressive vein comes from?\nI think it comes from two things. I think that the military is the most mission-driven organization in the United States. I mean, a lot of companies have different kinds of corporate cultures, and the military certainly has a culture, but the bottom line in the military is you get the job done, and whatever gets the job done and is good for the job is the thing that leads the way.\nThings like the repeal of “don’t ask, don’t tell” were better for good order and discipline, were better for efficiencies. We were losing thousands upon thousands of fantastic intelligence officers and linguists and technology specialists, and people in critical, critical positions, and so the brass realized that this wasn’t going to work, wasn’t going to help them accomplish the mission.\nThe second reason is that the military is such an incredibly diverse organization in that so many people from all walks of life. The military is an incredible incredibly diverse organization, and when you have that degree of diversity mixing, you have to be progressive on social issues because you have to create an environment that’s safe for everybody to do their jobs.\nI think the big hurdle . . . and we’re coming to it now with the admission of women into combat roles . . . we have a long way to go on sexual violence. That culture needs to changes, and it’s not changing as fast as command would like it to. But I am hopeful, because of all these other strides we’ve made, that we’ll lick that, too.\nThe public perception is that command covers up sexual violence.\nYes, and I think there’s some truth to that. Here. I’ll make an analogy. When Pearl Harbor was attacked, people said it was the Japanese, and it was, but it was a much more complex issue than that. There was a schism in the Japanese army between the Tosei-Ha and the Kodo-Ha, with the Kodo-Ha being young junior officers that were firebrands that wanted war with the United States, and the Tosei-Ha who were older senior officers who didn’t. The Kodo-Ha being more numerous and having access to an operational command and a few key senior officers in their sphere, were able to make that attack happen, knowing that the emperor and the Japanese army wouldn’t want to appear divided and would get behind it.\nI think the same thing is true in the United States military. You have a cadre of senior officers that are much, much older, that have a different perspective on what the culture of the military should be; but they’re retiring, and the people who are O3s right now are people like me, and we have a different perception of what the culture should be.\nI think, as that generational shift moves over, you’re going to see the change accelerate.\nIt seems like when there’s trauma involved and your world view has switched to, “It is an unsafe world,” you’re going to be less likely to request help. It perpetuates itself.\nI couldn’t agree more. I couldn’t agree more. I think that’s a very, very insightful look at it. I also think that . . . and this is one of the best things about the military, actually, but it’s also one of the worst things . . . is that we are a culture that celebrates misery. We love being miserable. We love this idea that we taken on the jobs that no one else will take on. We take on the risks that no one else will take on. We go down in the mud and work twenty times as hard as anyone else, and then when that misery produces results, it’s a sublime, sublime feeling.\nI’ll give you an example of what I mean. There was a night when we were doing man-overboard drills, and it was a night op, so we’re on one of these 25-foot defender-class patrol boats that I work on in the Guard, and we’re off Manhattan. We have a dummy we call Oscar, and we’re chucking him into the water as part of this man-overboard exercise.\nThe water is below a certain temperature so I have to wear my dry suit, and in order to create a watertight seal these dry suits have neck gaskets that basically choke you to death, and we’re underway for eight hours . . . your face is purple and it’s awful, it’s really uncomfortable, and here we are chucking Oscar in the water and pulling him out; and we’re also on standby for a search and rescue case.\nWe got to a point in the river where there was some kind of party going on the shore, and I could hear this pulsing dance beat and hear people laughing and enjoying the celebration; and here I am freezing because those dry suits don’t keep you as warm as you need to be, I’m choking to death. I’m exhausted. It’s like midnight. And I’m doing these drills out on the water. But I just had this moment of celebrating that misery where I thought of all those people partying and I just thought, “Go on and party, don’t worry about it. I’ve got this. Nothing’s going to happen to you on my watch. You enjoy your party and don’t worry about the things that go bump in the night. I won’t let anything hurt you.”\nThat’s one of the few moments of peace. By somehow sheltering others you make it a fraction more all right for yourself.\nI was thinking about all the stories my dad tells about his time in the Air Force. Every one’s a combination of misery and dark humor. We don’t talk about how much fun it was to travel around the country or anything like that. It’s all mud and misery.\nI’m telling you, we celebrate misery, but that is also translated into my life as a writer.\nLook, if I didn’t have that Misery Ethic, I don’t think I’d be as good a writer as I am, or at least a disciplined a writer as I am, and I don’t think I’d be in as good shape as I am. I think that so much of what I value in myself has come out of learning to love being miserable.\nI wonder how much writing is like therapy. How much does the writing keep you between the ditches, as Dave Drake would say?\nFor me it’s critical. The reality of it was that is that my commitment to the military is part time. I’m reserves. But I used to be full time in the security community, and when I realized that I didn’t want to do that, I began to look at writing as a way out.\nThe problem for me, and I think a lot of other vets and security personnel may say the same thing, is that for a lot of us security work, that’s what defines us. When you look in the mirror in the morning and ask, “Why am I alive and what am I doing to earn the air that I’m pushing past my teeth?” that’s the answer: “I’m protecting people. I’m saving lives. I’m taking on the rough tasks that no one else wants to do,” and that’s our way of putting love out into the world.\nYou can’t just slough that off, and that’s a big part of PTSD, I think, that isn’t addressed, is that that experience of fighting in a war or rescuing someone from a burning building—and this is not, by the way, to downplay other forms of PTSD like a death in the family or abusive relationships—when you have that incredible sense of resonance and significance in your life, and all of a sudden it goes away and now you’re working at a bank or a car dealership or whatever, life seems like it has no meaning. “Why the hell am I doing this?” You get bored and you get listless.\nI had that problem in spades when I came back from each tour, and it only got worse. The only thing I could ever find that made me feel like my life had meaning and that there was something that was worth being was writing. That’s why I say that it literally saved me. I think without it I would have gone right down the drain and eventually I would have died, but writing filled up that space.\nNow I have this wonderful experience where I can look in that mirror, and I have two things that make me worthwhile. Art can be a really, really great way to cope.\nWhich novel are you currently working on, three or four?\nI’m in the middle of number four. The story arc of the Shadow Ops series that you’re in now ends with book three [Shadow Ops: Breach Zone]. Book four is still in the same universe, but it’s a prequel going back to the very, very early days of the Great Reawakening with a complete new cast of characters, so I hope that it’s similar enough to the experience that people are having in [the current] story arc to draw those readers in but different enough to be a new entry point to the series for people who either weren’t into this story arc or who want to come to it fresh for the first time.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}