{"fingerprint": "zn4LVCyzcwuDqsESIoN4GUMRSb4=", "sitename": "Clarkesworld Magazine", "title": "Boxtops, Secret Rings, and Space Helmets: Those Brave Spacemen of the Videowaves by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_08_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Boxtops, Secret Rings, and Space Helmets: Those Brave Spacemen of the Videowaves by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Boxtops, Secret Rings, and Space Helmets: Those Brave Spacemen of the Videowaves\n It’s hard to imagine its impact.\n The image was grainy, fuzzy, more tones of gray than black or white. There would be static, constant hissing and popping, lines rolling across the screen or, if the weather, or sunspots, or who knows what else interfered, it would roll around or break up completely.\n But it was in the home, not a theater; instead of listening to your hero’s voice, you could see him, see his secret headquarters perched high atop a mountain. Perhaps the Video Rangers gathered around the set knew it was just a painted mountain with a painted tower clinging to it. Perhaps it didn’t matter.\n After all, Captain Video and His Video Rangers attracted vast numbers of children and surged as high in the ratings as Mr. Television himself, Milton Berle. Norton (Art Carney) even donned an official Captain Video helmet on the very first episode of The Honeymooners and blasted off into space with him.\n Originally, Captain Video was going to host Westerns.\n The DuMont network’s program director watched the Captain Marvel serial and asked his writers for a hero just like him. This was more challenging than it sounds: most early episodes took place within the Rangers’ secret headquarters—and it looks incredibly cramped, as if everything took place in a ten-by-ten space.\n While forgotten today, DuMont might easily have taken ABC’s place as the third network. It started out making TVs, then built some of the first experimental TV stations. Its biggest competitors had a major advantage as they had radio networks to draw on, but DuMont made up for this with innovative programming and ties to Broadway. It introduced such major stars as Ernie Kovacs, Jackie Gleason, and even Archbishop Fulton J. Sheen.\n And, on June 27, 1949, they launched the live adventures of TV’s first space opera hero.\n Each episode spent seven minutes with Video’s agents back on Earth—in the Old West!—taken from the movies DuMont bought for the Captain to host. Once he became the star, they didn’t want to waste the money and stuck them in whether they fit or not.\n Dave Barry claimed that the Captain’s ship “appeared to be made from materials that you might find around a TV studio.” Supposedly they had a twenty-five dollar prop budget, although they may not have used much of it: they broadcast from the same building as Wanamaker’s department store, and would raid the hardware department to find odds and ends for the Captain’s latest incredible invention. Like the “Opticon Scillometer,” crafted from a muffler, mirror, spark plug, and ashtray.\n Most of the time they did this mere minutes before the show went on the air!\n In keeping with the general cheapness, the Captain and his sidekick, the Video Ranger, wore war surplus uniforms with an added shoulder patch.\n Then there was I, TOBOR, a huge robot played by a seven-foot, eight-inch actor. It was supposed to be called “Robot 1,” but someone got the stencil wrong and they didn’t have time to fix it before broadcast. Only a few pictures survive, and a short special effects clip with a model that doesn’t match the suit.\n They did six live episodes a week, a grueling schedule for which the actors made more doing supermarket openings and live appearances. The original Captain, Richard Coogan, left the show in its first year because he wanted a share of the money from toys and premiums. Al Hodge, the voice of radio’s Green Hornet, replaced him. When Hal Conklin (the popular villain, Dr. Pauli) had a nervous breakdown from the strain, he was replaced with a brief comment about how Pauli had used plastic surgery to fool Captain Video. It was a trick Dr. Pauli would be forced to try again in 1954.\n Things improved in 1951 when Post Cereal sent Olga Druce to produce. “These scripts aren’t even written in English,” she complained, and hired new writers including a few young unknowns from the science fiction pulps: Isaac Asimov, Jack Vance, Arthur C. Clarke, Damon Knight, Robert Sheckley, C. M. Kornbluth, James Blish, and Walter M. Miller Jr. The show got a makeover as well, with a new spaceship; special effects on 16 mm film; new uniforms; better sets; and even a new intro, with a model replacing the painting on a piece of cardboard.\n But despite the show’s success, they never put much money into it. It remained basically shabby.\n Inevitably, other networks created their own space rangers.\n The first was ABC’s Buck Rogers. Unlike its six day a week rival, Buck offered a weekly half-hour episode. It lasted less than a year.\n Despite the short run, three different actors played Buck, while there were two Wilmas and two Dr. Huers. Nor did their two-month summer hiatus help build an audience.\n While it looks marginally better than Captain Video, it also suffered from low budgets, minimal sets, and the usual woes of live broadcasts.\n It is hard to assess the show today: Buck and his companions wear complex uniforms like those from the comic strip’s 1929 debut. Unfortunately, they look quite uncomfortable. The only available episode is an Earthbound mystery, with murders, an old mansion, and a séance. The mansion looks far better than one expects from a live kid’s show (and was probably repurposed from another program); we never get a glimpse of a spaceship; Buck speaks directly to the camera; and Wilma is the main character as Buck is missing for most of the show.\n ABC’s second attempt to copy Captain Video was far more successful.\n The show starts with an impressive montage of spaceships and rocket launches. While Space Patrol began on the West Coast in March 1950, with kinescopes (a copy filmed from a TV screen) of the quarter-hour daily episodes distributed locally, it caught ABC’s eye: a new half-hour Saturday show broadcast live nationwide began that December. While this is routine now, it was quite a feat to organize the connections and relay stations.\n The show was a huge hit.\n The first Commander Corry lasted twenty-five shows as they paid the cast eight dollars per episode. But ABC gave them an impressive $25,000 per show and moved them to Lon Chaney’s Phantom of the Opera soundstage. Now they could use two-story sets and hang actors on wires for space scenes. They also inherited the spacesuits from Destination Moon and added pre-filmed model sequences and live special effects: if you fired a gun, you had to point it at the right place and hope the technician set off the explosive charge.\n While still quite minimal, Space Patrol had impressive painted backdrops and complex sets, which felt larger and more expansive than they really were. A big reason for its success was Lyn Osborn’s Cadet Happy: children identified with his cheerful, mildly comic, and constantly curious character, who gave Corry an opportunity to explain the more complicated parts of the story.\n Like Captain Video, the show attracted lots of adults. Knowing this, the writers, led by Norman Jolley (who was also a running villain on the show) tried to make it as intelligent as possible—even though Ralston expected them to work in the latest premium (and the actors had to make those cheap bits of paper and plastic look impressive onscreen)!\n A twice-a-week radio show with the original cast and writers but different adventures and a two-issue comic book came later. The show produced vast numbers of toys and premiums, more than any of their competitors.\n And in April 1953, Space Patrol appeared on the first experimental 3D TV broadcast.\n Some claim Robert Heinlein’s Space Cadet inspired Tom Corbett, Space Cadet (and he did get residuals for the title), but it was Joseph Greene at Grosset and Dunlap who developed the character. He’d tried to sell “Tom Ranger” to radio, and then as a comic strip, before Tom landed at CBS with a new name in October 1950. The first episodes follow Greene’s newspaper scripts closely, as did the Tom Corbettcomic strip—and Greene appears to have written the Grosset and Dunlap novels as “Corey Rockwell.” Tom Corbettexpanded into other media as well, with a short-lived radio series with the original cast, records, children’s books, and even a Dell comic book.\n Tom is a Space Academy cadet. He and his crewmates aboard the Polaris—Astro, a human colonist from Venus, and Tom’s rival, Roger Manning—go on missions throughout the solar system. But rather than fight crime, they explore and learn about space travel.\n Unlike the other shows, Tom Corbett was more grounded in reality: rocket pioneer Willy Ley acted as scientific advisor. There were no aliens and they aimed for technical accuracy—even if Willy told them to assume we could travel faster than light!\n It also (at least in its better days) looked quite good, with excellent set decoration and nice, if primitive, effects\n It was one of six shows to run on all four networks (including DuMont’s Saturday morning version that alternated with Captain Video).\n The obvious inspiration for the space rangers came from the serials.\n These were twelve- to fifteen-part movies shown at matinees to bring the kids back next week to learn how Buck or Flash escaped. While you couldn’t do big fights or car chases on live TV, the heroes and stories are similar, and the daily shows often serialized their stories.\n Columbia Pictures had a knack for getting the rights to hot properties—like Batman, Superman, and The Shadow. Unfortunately their producer, Sam Katzman, made some of the worst serials ever: cheap, shoddy, and silly, openly declaring “this is good enough for kids.”\n But 1952’s Captain Video is probably his best serial. He obviously put some care into it. He even color tinted the sequences on alien worlds a different color for each planet.\n While it looks rather shabby today, it’s far better than the show. It has lots of what TV couldn’t do: fights, car chases, and outdoor scenes. The spaceships are cartoons, a trick they’d used earlier to make Superman fly. It’s surprisingly effective, with a fluidity of movement few model effects could match.\n Republic Pictures made the best serials, creating a feature film look on tiny budgets. They’d made a lot of science fiction, most with various iterations of their Rocketman character. To break into the TV market they created a kid’s show about the latest Rocketman: Commando Cody: Sky Marshal of the Universe. It starred Judd Holdren, Columbia’s Captain Video, and had plenty of effects and stunts thanks to footage recycled from past serials.\n But union rules forced them to release it theatrically in 1953, even though it has no cliffhangers. They would syndicate it, but not until 1955.\n The serial was nearly dead. A final Commando Cody serial was shot concurrently but renamed him “Larry Martin.” No further movie adventures of Captain Videofollowed. However, Columbia reused the sets, props—and most of the cast—for their final science fiction serial, The Lost Planet.\n The last of these live shows didn’t debut until 1953.\n CBS’s Rod Brown of the Rocket Rangers was very much like Tom Corbett, which is no surprise, as CBS hired George Gould, Tom Corbett’s director, to create it. He brought with him many of his writers and the “gizmo” that allowed him to superimpose actors on new backgrounds without losing image quality. Unfortunately, it was so close to Tom Corbett that they were sued and forced to settle out of court. The show ran for only a year, produced few premiums, and, unlike its competitors, never went into syndication.\n It did have one claim to fame: it starred Cliff Robertson.\n Other similar shows had shorter runs, like Atom Squad, which investigated super-scientific crimes out of their secret New York HQ for six months. While they mostly dealt with spies and mad scientists, they also fought a few aliens. NBC broadcasted the show from its Philadelphia affiliate, but it isn’t clear how extensively they marketed it. No kinescopes survive.\n The time-traveling Captain Z-Ro corrected historical errors for local California stations from ’51 to ’53. After a two-year hiatus, he returned with twenty-six filmed syndicated episodes. He would linger on the airwaves until 1960.\n Even the CBC joined the spaceman race with Space Command (1953), the first original dramatic show they produced. While distributed on kinescope across Canada only one episode survives. It features a spaceship set larger and more complex than any in the American space operas. James Doohan played the hero’s sidekick, and William Shatner appeared on the show.\n 1954 brought two final filmed entries into the genre.\n Of the two, Rocky Jones, Space Ranger is probably more familiar, as “featurized” episodes grace countless cheap DVDs and were mocked by Mystery Science Theater 3000. Like his competitors, Rocky was a space policeman, traveling the galaxy with a comic relief sidekick, Winky (who was replaced when the actor playing him ended up in a gun battle with the Mexican police after a hotel robbery). But his adventures weren’t on any network: instead they went directly to syndication.\n Thanks to being filmed on a higher budget, it had a little action, exterior scenes, better continuity, sets, costumes, and model work. Unfortunately, it was too expensive and only lasted two seasons.\n The other, Flash Gordon, was the DuMont network’s third and final space ranger show, but only on the East Coast: their network was falling apart and Flash was syndicated in the West.\n Despite using Dr. Zarkov and Dale Arden’s familiar names, they became Galactic Bureau of Investigation agents who resemble their competitors, not the comic strip originals.\n The budget was only $15,000 per episode. It was filmed in West Berlin, a city still scarred by the war, with an abandoned beer hall in Spandau as their main location (it would later move to Marseille). Most actors were German, some couldn’t speak English. It had limited effects, just a few glimpses of model spacecraft, but harsh, almost expressionistic cinematography with lots of shadows.\n By 1955, DuMont was falling apart.\n Between financial woes and struggles with the FCC, they lost affiliates and were forced to sell stations. Nor was Captain Video doing much better: he lost Olga Druce when Post left and had been reduced to quarter-hour shows. While the network would struggle on for another year, Captain Video ended in April. NBC tried to buy the show, but DuMont refused.\n There had been over 1,500 episodes. Most are lost: Allen DuMont kept copies of everything, but many were scrapped for the silver emulsion, and three truckloads were thrown in the East River during the seventies. Today, the UCLA film library has twenty-four episodes, but only five are available to the public.\n Al Hodge had been so thoroughly identified with the role that, when he testified at a senate hearing on TV violence, many senators called him “Captain.” He was so typecasted that he couldn’t find any new parts, left acting, and died in obscurity in 1979. The Video Ranger, Don Hastings, fared far better with a forty-year run on As the World Turns.\n Their biggest competitor, Space Patrol, would make over 1,100 shows (and 129 radio broadcasts) before it went off the air thanks to ABC’s attempt to seize ownership of the show. After Sputnik, the surviving daily episodes were syndicated as Satellite Police (1957). While Ed Kemmer, who’d played Buzz, went on to a long career on daytime TV, Lyn Osborn died of a brain tumor three years later. But the name lived on: Japanese toy makers used it for unlicensed toys long after the show ended.\n Tom Corbett made its final move in December 1954 to NBC, with a reduced budget and without fan favorite, Roger Manning. The season ended with the cadets ready to come back for another year at the Academy. They never made it.\n Tom starred in seventy-five TV adventures, fifty-two radio shows, and eight novels. As late as 1957, there were plans to revive him. Nothing came of them.\n But he outlasted Captain Video by two months.\n In the end, Davy Crockett laid the space rangers low.\n Some blame the minimal nature of these early shows, whose exciting bits happen off-screen and are merely described (as in many indie science fiction films today!), but the real answer is simpler:\n Tastes change.\n Coonskin caps replaced homemade space helmets, as countless children flocked to a new hero.\n Serious science fiction did appear live (Tales of Tomorrow), but the science fiction movie boom had little effect on TV, with or without the space rangers.\n By 1959, the closest thing to Captain Video was Men into Space, a sober, filmed children’s series that portrayed the future of space exploration realistically, with spacemen wearing Project Mercury suits.\n It is hard to miss, though, just how much the Rangers patrolling the spaceways, had in common with Star Trek.\n How many of Captain Video’s old fans, one wonders, traded in their Atomic Pistols and Space-o-phones for Phasers and Communicators?\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}