{"fingerprint": "QzXyqIcF3UrxT8HGlI1Fitdqdc8=", "sitename": "Clarkesworld Magazine", "title": "Spaceships, Time Paradoxes and Duct Tape: The Joys Of Independent SF Film by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_10_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Spaceships, Time Paradoxes and Duct Tape: The Joys Of Independent SF Film by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Spaceships, Time Paradoxes and Duct Tape: The Joys Of Independent SF Film\n To most movie buffs, the phrase “independent film” conjures up images of intensely personal low-budget films. While the term actually applies to any film outside the studio system, the Independent Film Movement has transformed the Indies into a fertile ground for nurturing new talent and exploring ideas that the mainstream film industry would never touch. Science fiction has long had a comfortable relationship with independent film, from the low budget wonders of Roger Corman and John Carpenter’s Dark Star, to true Indies, such as George Lucas’ THX-1138. Even one of the most prominent leaders of the Indie movement, John Sayles, has made an SF film, The Brother From Another Planet (1984). However, good SF is just as rare in the Independent world as it is in the local multiplex: finding it can take quite a bit of effort—and more than a little luck.\n You might start looking at the big festivals, but probably won’t find many SF films that way: the 2009 Sundance Festival went out of its way to advertise the unprecedented presence of three science fiction films among 118 competing features: Duncan Jones’ Moon; Sophie Barthes’ Cold Souls; and Kanji Nakajima’s Japanese entry, The Clone Returns Home. (For some reason they failed to add a fourth film to this list, Cory McAbee’s Stingray Sam, but considering the sheer absurdity of his warped combination of SF, westerns and music video, perhaps they just didn’t know where to file it!). While it is true that three SF films wasn’t quite as unprecedented as the press releases portrayed it—Sundance 2004 featured three SF films as well—this still isn’t what anyone would call overwhelming.\n A better bet might be those festivals dedicated to horror and SF films, although the largest ones often serve as the launching site of new studio films and offer only a few new feature-length independents. While the most intriguing American SF indies show up at Fantastic Fest, Sci-Fi London has the best selection of SF films from around the world. The first Sci-Fi London premiered The American Astronaut, while later offerings have included Avalon, Natural City, Proxima, Sandy Collora’s Hunter Prey and Monsters, a unique combination of the romance film with the giant monster movie (it’s been described as It Happened One Night with monsters), which follows a young man attempt to get his boss’s daughter across the lush, alien-infested jungles of Mexico. It’s hard to imagine any Kaiju Eiga film reaching its emotional highpoint with a sequence featuring two of the beasts mating, but it must have impressed Legendary Pictures as they picked its director, Gareth Edwards, to helm their upcoming American Godzilla movie.\n Unfortunately, most of us can’t attend these festivals and, even if we did, we might find it quite difficult to find out which of the many features offered are worth seeing. Even worse, the best independent films rarely stay on the festival circuit for very long. The most professional efforts (not necessarily the best) vanish quickly from the Festival circuit and reappear as direct to video films or, far worse, end up like the wacky time traveling crime thriller Slipstream, which debuted at Sci-Fi London only to become yet another SciFi Network “Original.”\n Occasionally, an indie film will escape the festival circuit for a mainstream theatrical release, as The Blair Witch Project did. But few (if any) SF films have made that transition—perhaps the best they can expect is what happened to Moon, one of the most remarkable SF films in years: while Sony bought the rights, they decided not to put it in the multiplexes, but instead to release it into the art theatres through their Sony Pictures division, which normally handles documentaries. Fortunately, outside the US it is often easier for these films to get a mainstream release. Monsters, for example, appears to have gone wide in the UK.\n Once they’ve left the festival circuit, it gets even harder to find some of these films. Film critics regularly include at least three recent independents—Primer (2004), Pi (1998) and Cube (1997)—on their lists of the best SF films, but that is definitely the exception. Most film critics won’t bother reviewing them—or, if they do, offer a few words, buried in the midst of a lengthy Festival article. Some films have enough admirers that one hears of them by word of mouth. The rest usually vanish with barely a ripple—often for very good reasons. At least, that’s the official version. Normally a good film does not stay on the Festival circuit for long, not with the studios and DVD companies ready to snap it up. But then there are films like Yesterday Was A Lie, a complex Jungian Film Noir reality bender, which spend years in limbo despite good reviews because the distributors find them too complex or confusing.\n You can actually find indie SF films at the video store, although many are on the bargain rental shelf, like Interplanetary (2010), a deconstructionist space satire with enough enthusiastic (if unrealistic) gore to sell it as yet another splatter epic. A few get marketed specifically as indie films, with vast herds of festival awards covering most of their artwork, while an even smaller number—such as Monsters and Hunter Prey—blend indistinguishably with the mainstream releases. Hunter Prey starts with a spaceship crash landing in an alien desert and quickly turns into a cat and mouse struggle between the surviving soldier and his escaped alien prisoner—but the situation is not as straightforward as it appears. It has the gritty feel of a seventies SF movie, stunning makeup effects, and, like Monsters, looks better than many mainstream films despite its minimal budget.\n Other films never make it to the video store, even if they are on DVD. If you aren’t afraid to spend a bit of money on Amazon, a little effort will probably turn up used copies of such gems as Tom Sawyer’s The Strange Case Of Senor Computer (2000), a sprightly black comedy with a classic Noir structure and a robot narrator, which somehow manages to find unexplored territory in the old Frankenstein theme (although you may have to settle for a VHS copy as it doesn’t seem to have come out in any other format). There is also Hilary Brougher’s The Sticky Fingers of Time (1997), an impressive snarl of temporal travel, fatalism and a hint of lesbianism. It has a few nicely ghoulish details along the way, like the charred human fingers the main character receives in the mail. Brougher accomplishes it all with editing, writing and a single visual effect. Other films may only be available through their creator’s website—or may be out of reach because they were released in pitiful numbers or by a DVD company no one ever heard of outside of Waxahatchie, Texas\n The most difficult part of finding Indie SF is almost always the problem of deciding which films are worth pursuing. Websites like Ain’t It Cool News and SyFy network’s Blastr provide updates on upcoming films, reviews and an opportunity to network with other fans. Unfortunately, Blastr isn’t quite as helpful as its predecessor, SciFi Wire, which used to run regular reviews of obscure SF films. It was one of the few places that noticed one particularly remarkable piece of “retro” SF horror, The Call Of Cthulhu (2005), one of the best horror films of recent years.\n Andrew Leman and the members of The H.P. Lovecraft Historical Society created their adaptation of one of Lovecraft’s most famous stories as a black and white silent, using the techniques which might have been used to film it back in the year of its first publication, 1926. The film is very faithful to the story, and what’s more, it works.\n The stark contrasts of black-and-white film and the unearthly silence of the silents make any horror film creepier—something today’s young filmmakers really need to learn. Leman catches at least a hint of the malignant and unhealthy atmosphere of Lovecraft’s stories, and his use of title cards somehow makes the story’s complex structure of nested flashbacks easier to follow. What is surprising is how effective some of his more primitive tricks are, such as the use of sheets to create a heaving sea. His stop-motion Cthulhu may not be perfectly smooth, but it is nicely malevolent—and it would be jarring, in such a deliberately old-school film, if it did look smooth. You can get a DVD of the film direct from the HPLHS website.\n Another good place to look are those online SF film review sites which attempt to cover the entire world of SF film. One of the best is The Science Fiction, Horror and Fantasy Film Review which offers an incredible number of reviews, covering a broad range of SF films from every place and era. It is one of the few places where you’ll find a review of The American Astronaut (2001), a movie which leaves one wondering whether even its writer and director, performance artist Cory McAbee, has the slightest idea what it is all about.\n Space pilot Samuel Curtis (McAbee) hopes to make a fortune on an incredible deal involving a cat, a small box containing a real live girl (in embryonic form), the Boy Who Once Saw A Woman’s Breast and the one man on the woman-ruled planet of Venus. Unfortunately, he may not be able to complete his deal if his old friend Professor Hess ever manages to forgive him . . .\n Most people should avoid this warped Sci Fi Western Musical the way they would an evening of pre-recorded telemarketing calls. And the rest of you? You know who you are. You’ve already added it to your Netflix queue.\n Ultimately, a little digging will uncover a dazzling array of shapes and colors of SF Indies, from Brad Anderson’s time traveling RomCom, Happy Accidents (2000) to the post-modern absurdities of Six String Samurai (1998), which combines lethal bowlers and Mariachi players, mutants, a garbage monster, a Dirty Harry lookalike, the world’s slowest car chase, a creepy Ward Cleaver-ish family of cannibals, the Russian Army, and (of course) Death himself, with the help of a lot of duct tape and the Russian-tinged Rockabilly Surf music of The Red Elvises. Some, like James Felix McKenney’s Automatons (2006) never quite manage to be as interesting as their liner notes or, like the Flaming Lips’ Christmas On Mars, try far too hard for mind-blowing profundity. However, they get balanced out by the human warmth of Greg Pak’s prize-winning Asian-themed anthology film, Robot Stories (2005), the sober ironies of the intense two-player drama, Final (2001), and the structural daring of John August’s mind-bender, The Nines (2007).\n Perhaps the most remarkable new development has been the emergence of full-length animated films created by a single artist with a home computer. Ladd Ehlinger Jr.’s dazzling adaptation of Edwin Abbot’s classic novel, Flatland (a.k.a., Flatland: The Film) (2007), was the first (unless you count Romel Gallamoza’s far cruder 41 minute video game-generated adaptation of Michael Resnick’s story Machines Don’t Cry (2006)). Chris Lackey Flash-animated another similar one man SF project, The Chosen One, in 2008.\n One of the great disappointments of the world of Indie SF is that it doesn’t seem to have attracted the attention of the mainstream SF community. Consider, for example, the Hugo awards, which in over fifty years of awards for Best Dramatic Presentation have only honored two Independent films, Moon (2009) and A Boy And His Dog (1976) (three, if you count Pan’s Labyrinth which, like most foreign films, was also made outside the studio system) and nominated few others. Some of the absences are remarkably difficult to explain: few movie buffs would chose Joss Whedon’s Serenity over Primer—and yet Shane Caruth’s brilliant time travel film failed even to win a nomination.\n For those wondering about where the future of independent SF lies, it might help to look at a particularly strange and wondrous film which debuted in July of 2009. Fissure tells the story of a troubled police officer, Sergeant Paul Grunning (James MacDonald) who finds that the routine disturbance the Chief asked him to investigate is far from routine. He finds the body of Roger Ulster, a famous physicist, but soon Grunning finds himself far more concerned with the increasingly bizarre events happening around him. Something is very wrong in the Ulster home and Paul must discover not merely the identity of the murderer, but the deadly truth about Roger’s secret project.\n Fissure is very much a product of the digital age. Its handful of well-executed effects are the most visible digital elements, but Dallas-based director Russ Pond also changed the look of the film inside the Ulster house, toning down the colors to give those sequences a subtle feeling of wrongness. While the members of the Ulster household remain somewhat undeveloped, the film gives us a sympathetic understanding of the demons haunting Grunning. Few better time paradox films exist.\n Fissure’s marketing strategy may offer a new path for future independent films. Rather than the usual, drawn-out process so many others have followed (which forces filmmakers to enter their work in festival after festival in the hope that they might attract a distributor) Pond gave a few free showings in Texas, then launched a website [fissurethemovie.com] that offered a nine-week series of podcasts, behind the scenes facts and videos, and a contest. This lead to the release of the entire film as an on-demand DVD. Hopefully, whether or not his strategy worked, we haven’t heard the last of Russ Pond.\n This article only hints at the wild selection of independent SF films out there—and it certainly does not include all the good ones. Nor will most viewers agree that all of these films deserve to be seen. One thing is certain, however, they definitely are not ordinary. What’s more, this sustained surge of uncontrolled creativity has given us something greater than a scattering of strange and unexpected new films: some of its unconventional spirit has oozed into mainstream films, often in ways that are far from obvious. The indies have served as a training ground for new filmmakers, who often carry what they’ve learned into their mainstream projects.\n They have also—directly or indirectly—made some exotic filmic elements—such as non-linear plot structures, radical editing techniques and stylized cinematography—far more acceptable to the general film-going public. Not long ago, an SF film like The Eternal Sunshine Of The Spotless Mind would have seemed incomprehensible to most viewers. Today it merely makes a lot of money.\n It is this often subtle influence that the studios need most. If the economic crisis continues its slow strangulation of the film industry, we can only expect the studios to take fewer risks, make blander films - and produce more horrible TV show remakes than you can throw a Sleestak at.\n These days low budget filmmakers can cut their costs drastically by using High-Def digital cameras and home computer film-editing software—and, of course, by releasing their films on one of several new websites. This has the potential to open the art of filmmaking to vast new numbers of people. Perhaps the next Christopher Nolan or Vincenzo Natali will post his first film on YouTube. You never know.\n One thing is certain: SF needs independent film. It needs creators who can tackle challenging SF ideas and fit them into entertaining—if eccentric—films. It needs people with new vision, new ideas, and the talent to put it all together. We can’t count on the studios to nurture any burgeoning new SF creators: it is up to us to find them ourselves, to seek out some of these little known films and support them, whether they are in the theaters, on the internet, or on DVD.\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}