{"fingerprint": "rATvdQe40Y+sQrnPHQRlwoVS/Zg=", "sitename": "Clarkesworld Magazine", "title": "Metallic Mayhem in the Movies: Giant Mecha, Then and Now by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_05_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Metallic Mayhem in the Movies: Giant Mecha, Then and Now by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Metallic Mayhem in the Movies: Giant Mecha, Then and Now\n It’s hard to explain that moment . . .\n Something moved in the hazy distance of a vast white plain, and an army of machines emerged from the mist. And for an instant, it was no longer The Last Jedi. It was 1981 and the Imperial Walkers had begun their assault on Hoth.\n It was—and years later, still is—an unforgettable moment. Like so much of Star Wars, it was something we had dreamed of for years but never seen: realistic giant walking machines.\n The heroes of Jules Verne’s The Steam House travel across India aboard carriages drawn by the first such machine, an oversized steam-powered elephant. More sinister machines appeared in The War of the Worlds. Later ones included Kimball Kinnison’s battle suit in E. E. “Doc” Smith's Galactic Patrol (1950), and Starship Troopers’ (1958) Mobile Infantry suits.\n Robots and giant machines appeared in book illustrations, pulp magazine covers, and especially the comics. The Blackhawks fought the Nazi “War Wheel,” twelve mystery men held the secret control key to Electro, and the Captain America copy “Flag Man” fought giant Nazi robots. But the robot superhero, Bozo the Iron Man (1939), was a true mecha, with Hugh Hazzard riding in its hollow chest.\n While “mecha” immediately brings Japan to mind—their first giant robot, Tetsujin 28-go, didn’t appear until 1956 and was remote controlled. They had to wait until 1972 and Go Nagai’s Mazinger Z, which, in his words, “you could drive, like a car.” It would spawn countless armies of mecha in manga, anime, and the toy stores; in both science fiction and fantasy; war-machines and construction vehicles; some as big as planets or even an entire galaxy; and in lots of subgenres, from the nearly magical “Super Robots” to the mass-produced and machine-like “Real Robots.”\n However, giant robots, piloted or not, have rarely appeared in the movies. This is largely because of the sheer technical difficulty. When Republic Pictures director William Witney asked for something better than the crude “Water Heater” robots from Undersea Kingdom for Mysterious Dr. Satan, his special effects crew offered to build one that was twenty feet tall, ran on treads, and could crash through walls. But it would have cost him twenty thousand dollars. Whitney replied, “Give me the damn water heater.”\n The oldest surviving robot film, 1921’s L’Uomo Meccanico, features a remote-controlled robot which, if we’re feeling generous, might be described as “giant.” Its size is hard to estimate but it is much taller than the actors, perhaps nine or ten feet tall. Like most early movie robots, it’s just a man in a suit. The movie ends with the first giant robot battle in film history, as a second inventor takes on the Mechanical Man with his own creation.\n Animation would seem the natural medium for a giant robot (particularly when we recall the endless stream of “robotto” anime) but even there they were rare, with the Superman Cartoon, The Mechanical Monsters, about the only example before the Fifties (although they are only about twelve feet tall).\n The truly giant robots wouldn’t appear on film until 1957.\n The actual nature of the first one is far from clear. Kronos is unquestionably a giant, big enough to smash its way through cities: literally Godzilla sized (and only a year behind its American release).\n However, it isn’t anthropomorphic: it is a stack of metal boxes. While obviously mechanical, with its huge pistons, metallic construction, and working components inside, it grows as it absorbs energy. Whether it is a machine or a mechanoid life-form is far from clear. Nor, while we learn aliens sent it to gather energy, are we told whether it is piloted, remote controlled—or intelligent. It is a model in most shots, but the piston legs are mostly cel animated.\n The other giant robot of 1957 came from Japan. A year after Tetsujin 28-go debuted, The Mysterians featured aliens trying to take over the Earth with the help of the monstrous M.O.G.U.E.R.A. As with most of the Toho monsters of the era, it is a man in a suit destroying miniature sets.\n Toho would not return to giant robots for a decade, when the mysterious villain, Dr. Who, would battle King Kong with his giant robot ape in King Kong Escapes (1967). In 1973, Jet Jaguar (who looks suspiciously like Ultraman) helps Godzilla, and in 1974, the big lizard fights a giant alien robot—and not just any robot, but his mechanical copy: Mechagodzilla. It would return the next year.\n For its 1993 revival, it became a mecha built on Earth (and a new M.O.G.U.E.R.A. would be built from its wreckage). However, in 2002 and 2003, it became more or less a cyborg, built on the bones of the 1954 Godzilla and somehow infected with his spirit.\n And that’s about where the giant robot stood in 1981. They had appeared in children’s cartoon shows (including imports like Gigantor), with Johnny Quest’s spider robots perhaps the best remembered. They came to Tokusatsu children’s shows in 1960 with a live action Tetsujin 28-go, although few of these made it to the West. The “robottu” subgenre of anime was flourishing but would not come to the US until Robotech in 1985. But on the big screen only a pile of boxes and a few men in suits stomping through miniatures had prepared us for The Empire Strikes Back.\n That first appearance remains iconic: they appear as tiny dots on the horizon, and then are gradually revealed, in a slow, close-up tracking shot. It is beautifully staged, suspenseful, and the Walkers have a tremendous feeling of mass and size—and just the right hint of awkwardness.\n Curiously, their inspiration came not from science fiction, but from an advertising art portfolio. According to Joe Johnston, “The snow walkers were from a brochure by Syd Mead for US Steel of these walking trucks going through the snow—we turned them into walking tanks.”\n Yet it wasn’t the first big screen appearance of a walking machine. Not quite. A young woman in a crab-like maintenance vehicle had battled a big security robot in 1978. Unfortunately, only a handful of Mormon dentists got to see it.\n They wanted to invest in a movie and a young truck driver convinced them to give him $20,000 to create a demo for his proposed film, Xenogenesis. Unfortunately, they didn’t think it was enough like Star Wars and refused to back him.\n It did, however, persuade Roger Corman to give James Cameron a job. The footage would remain unseen for years until Cameron released it as part of the Avatar plagiarism lawsuit, but eight years later, he created a startlingly similar sequence for Aliens.\n Once again, a young woman in a big machine battled a much larger adversary, although Ripley had a “Power Loader” exoskeleton rather than a crab machine, as Cameron didn’t want people to think he’d copied it from George Lucas. This time he filmed the battle with practical effects, with both the Loader and the Alien Queen full-sized “puppets.”\n The post-Star Wars special effects revolution gave new life to big robots. They didn’t have to be a man in a suit anymore, and more and more of them showed up in science fiction films: Robocop fought David Allen’s stop-motion animated ED-209 robot (1987); practical effects brought the vicious “Warbeast,” to life in the brutal killer robot movie Death Machine (1994); the alien invaders of Independence Day (1996) had organic exosuits; and even Stallone’s Judge Dredd (1995) fought a massive Warrior Robot.\n It was a good time for the truly giant ones as well, starting in 1989 with two movies crammed full of monster robots: Gunhed’s origins were decidedly strange: Toho Studios ran a contest to choose a story for a Godzilla 1985 sequel. While Jim Bannon’s script, in which the big G takes on a giant computer, attracted a lot of attention it ultimately lost to Godzilla vs. Biollante, and a fight with a giant rose.\n However, Toho liked the idea so much they turned the script over to Masato Harada. He hacked out the Godzilla references and Gunhed is what was left. The end result, while uneven, was a dense, atmospheric cyberpunk adventure film and one of James Cameron’s favorite B-Movies.\n The massive supercomputer Kyron-5 tried to wipe out the human race. It was stopped but remains dormant deep in its island fortress. A group of scavengers break in, in search of its extremely rare and valuable microchips. Unfortunately, Kyron-5 is alive and well and planning its revenge. It lets loose its arsenal of automatic defenses, leading to a brutal battle between its deadly Aerobot and an abandoned Gunhed mecha the survivors manage to get running. The film features intricate miniatures of the fortress and fighting machines. As in the Godzilla films, the vehicles are worked by offscreen operators or powered by motors—and years of experience give them an epic feel of mass and size.\n The other, Robot Jox, was actually made earlier, but got caught in the collapse of Charles Band’s Empire Pictures. Stuart Gordon, who directed Re-Animator, helmed one of the low budget company’s most extravagant features. It featured incredible miniatures and a series of massive robot-on-robot battles created by David Allen. The assembly room and huge elevators look as if they might have been used on the weekend for Mechagodzilla, while the robot battles feel ponderous and weighty.\n Based on a story by Joe Haldeman (who reportedly wasn’t happy with the film), it takes place in a future where war has been eliminated, and International disputes are resolved by gladiatorial battles in giant robots. Only the best, highly trained, genetically-engineered young men (and one woman) get to pilot the big machines, so, naturally, much of the film revolves around their traumas and training (which are much cheaper to film). Band would produce three more giant robot movies although none of them are as impressive.\n The first, Crash and Burn (Robot Jox 2 in Europe), is seriously strange, perhaps as much because of its tiny budget as the fact that it is ripping off an impressive collection of incompatible films. A group of strangers take shelter from a solar storm in an old television station. A murderous cyborg starts killing them one by one.\n A giant construction robot stands abandoned outside: for most of the film it just sits there but in one of the most lopsided giant robot battles ever, they get it running just in time to fight the terminator copy. It hardly looks fair when your moves include stomping on the enemy.\n Band must have found more money by the time he made the third, Robot Wars (1993), which is also known as Robot Jox 2. It features a scorpion war robot that doubles as a passenger bus, a giant robot bursting out of the ground, and a final robot-on-robot battle. However, it is far from clear that this is a sequel as its two major Blocs are at peace and the Mega Robots almost extinct.\n Unfortunately, while the robots are well done, most of the film takes place in tiny sets or a resort town “restored” to look as it did in the 1990s. The final film, Robo Warriors (1996, aka, Robot Jox 3) is an adventure thriller with a single robot battle at the end. What’s worse, the robots are just men in suits.\n Sadly, one of the more interesting giant mecha films of the era, Sentinel 2099, is virtually lost. In Michael McGee’s handcrafted film, walking tanks battle alien invaders. He built the miniatures himself, and filmed some 300 miniature shots, some with in-camera effects. While he released it to video in 1995, copies are nearly impossible to find.\n However, McGee has completed a Special Edition of the film, which is more of a remake—or sequel—to the original film, although it reuses some original effects footage. No release date has yet been announced.\n The problem is that models and practical effects are expensive. Despite the post-Robotech boom in Japanimation, giant robots had mostly vanished by the mid-Nineties. Traditional stop-motion effects became increasingly rare, and usually relegated to the direct-to-video market and dedicated craftsmen like B-Movie Maestro, Brett Piper. He created a big junkyard mecha for his 2005 anthology film, Shock-O-Rama, and scorpion-like walkers for his most recent film, Outpost Earth.\n CGI may have killed off traditional model work, but the first digital giant robots took a while to show up. Perhaps the Japanese were first with films like Returner (2002) which features alien walking machines and the surprise appearance of a transforming robot. Others included an adult reenvisioning of Casshern (2004); and a live action Tetsujin 28 (2005) with surprisingly crude animation.\n While the Attack of the Clones threw a few small walking vehicles on the screen in the middle of a confused battle, it took the Wachowskis to create a truly epic robot battle: dozens of heavily armed APUs (which the Japanese would call a wearable robot) fought vast swarms of squid-like Sentinels in The Matrix Revolutions (2003).\n But big robots quickly became more common. Steven Spielberg gave us a War of the Worlds with actual alien tripods (2005); the Transformers have starred in an endless series of films since 2007; and The Day the Earth Stood Still’s familiar alien robot, Gort, turned into a pile of CGI nanomachines the size of the Statue of Liberty for the 2008 remake. James Cameron revisited his past efforts when he created whole armies of combat mechs for Avatar (2009), while the secret weapons stash held by refugee aliens in District 9 included a heavily-armed battle suit.\n Even Direct-To-Video efforts could now afford digital robots, like the cartoony battle suits in 2008’s Starship Troopers 3: Marauder, or the countless big alien robots in the “Mockbusters” produced by The Asylum and others. At least one Hong Kong Chopsocky film—Metallic Attraction: Kungfu Cyborg (2009)—had a giant robot, while the Russian blockbuster Attraction (2017) featured an alien exosuit.\n They have also proved particularly popular in superhero movies where we find not only X-Men-hunting Sentinels and the magically animated Destroyer but characters with massive battle suits, including the Silver Samurai, the Rhino, and even Iron Man’s awesome Hulkbuster.\n A giant robot even found its way into a documentary, although admittedly a very strange, metafictional one: legendary director Mamoru Oshii created a Tetsujin 28 stage play, complete with twenty-foot practical robot, then filmed an odd quasi-documentary, 28 1/2 Mousou No Kyojin, about it. Somehow, though, seeing a real giant robot in a real field fire its rockets in a cloud of real flame is something CGI can never match.\n Casual viewers probably missed the significance of the giant machine attacking Tokyo in 20th Century Boys 1: Beginning of the End (2008). When the hero fights his way aboard past tank treads hidden by big phony “feet,” he is stunned to learn that it is a fake, with a cloth-covered framework like a big dirigible.\n But those who had read Naoki Urasawa’s original manga understood: the robotics expert kidnapped to create it told his captors that the traditional giant anime robot was physically impossible. Something that big wouldn’t be able to lift its feet. However, even Urasawa was unhappy with his fake robot, and introduced a more traditional one in the later chapters (and the final film, Redemption).\n Perhaps the giant robot’s finest moment came in 2013, when Pacific Rim gave countless fans what they’d been waiting for since the first metal giants strode across the comics pages. Guillermo del Toro’s stylish blockbuster pitted an awe-inspiring mecha army against an unstoppable horde of alien Kaiju, in a series of beautifully staged battles. In one absolutely unforgettable moment, a “Jaeger” picks up a freighter from the harbor and uses it as a club.\n Absurd? Yes. Physically impossible? Of course. And yet awe-inspiring at the same time. Which is exactly what we expect of a giant monsters vs. giant robots movie.\n One is left wondering, though, whether we have reached the saturation point of gee whiz excitement from these massive mechanical creations. Somehow, the arrival of the The Last Jedi’s gargantuan Heavy Assault Walkers was not a moment of awe, but of old moments relived. While bigger and more heavily armed, they could not top that unforgettable first moment. For that matter, has Pacific Rim: Uprising matched the absurd thrills of the first film? Or has it merely drowned us in excess after excess, as so many blockbuster films have?\n But, if it gives us the thrill of seeing monster machines wrestling with impossibly huge foes and maintains the sense of fun we expect from something that is inherently bigger than life (and basically impossible), then perhaps it will keep the giant robot alive a little longer.\n You never know.\n Visit rivetsontheposter.wordpress.com/category/movie-reviews/robots-really-really-big-ones for more information on many of these movies.\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}