{"fingerprint": "NOO6qlVbAjnNgbXq/MwddJmmroI=", "sitename": "Clarkesworld Magazine", "title": "Cut, Fold, and Conquer the Universe: The Best Models in the Galaxy by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_05_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cut, Fold, and Conquer the Universe: The Best Models in the Galaxy by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Cut, Fold, and Conquer the Universe: The Best Models in the Galaxy\n It wasn’t unbelievable.\n It was something more than that, something you could hardly wrap your mind around.\n If you’ve seen the Matrix sequels, you would recognize it instantly: the APU (Armored Personnel Unit), a huge, heavily-armed and intensely detailed battle exoskeleton.\n It wasn’t so much that someone had created a model of this complex machine: after all, McFarlane Toys, among others, had offered one. Nor was it that most of the incredible number of joints and linkages worked: the other versions all had moving parts. Nor was it that you could get it for free, although that made it far more attractive.\n Perhaps to fully understand this you have to go back to the Eighties and take a quick look in the hobby shops.\n For those of us who flocked to see Star Wars, the films didn’t just spark our love of science fiction: they also created the desire to build all that cool hardware.\n Unfortunately, that didn’t quite work out. True, AMT, Revell and MPC offered Star Wars, and Star Trek kits, as well as a scattered handful from Battlestar Galactica, The Black Hole and others. But when it came to adult science fiction—whether Blade Runner, 2001, or The Road Warrior—there was little to be found.\n Even when they did exist, the kits might not have made it to local stores—and sometimes not even the specialty catalogs. Fan magazines advertised exotic Resin or vacuformed models, but these were ridiculously expensive, often of poor quality, and required a tremendous amount of skill to build. At one point, the only available Babylon 5 Shadow Battlecrab was a five hundred dollar model the size of a kitchen table “manufactured” in the designer’s garage!\n Worse, creating the molds was expensive and time consuming. The big companies rarely took a risk on an upcoming film that didn’t look like a huge success, nor were there any guarantees that they would release models afterwards. Who knew, after all, whether anyone would still be interested come Christmas? Often, as with Back to the Future and Ghostbusters, they waited until the sequels came out.\n Nor has the situation really improved since then. Yes, far more is out there and it’s easier to find, thanks to online stores. Companies like Polar Lights have re-released (and often improved) the old kits. And a surge of pre-assembled figures and vehicles have flooded the market. But it still can be a challenge to find your favorites.\n Which is where cardmodeling has filled many of the gaps.\n The basic idea is quite old.\n While simple commercial cardmodels had been available since the fifteenth century, the invention of lithography transformed the hobby and led to a nineteenth century boom in detailed scale paper models. John Merrick—better known as the Elephant Man—was one of the many building them; he often sent them as gifts to people he wanted to meet.\n However, when kits in balsa wood, metal, and plastic arrived, interest in cardmodels waned, only to be revived during World War II when paper was one of the few materials not rationed. For example, Lionel offered an O scale paper train, although it proved too difficult for most people to build.\n Here in the U.S., they disappeared almost completely and are best remembered as premiums given away by cereal companies.\n In Europe, however, a number of publishers still sell them. Ironically, cardmodeling did best under the chronic shortages of Communist Eastern Europe, where plastic models were ridiculously poor (and expensive) and you could subscribe to what amounted to a magazine and regularly receive new kits.\n While we might expect simple, toy-like productions, some (particularly ship models) are incredibly detailed. A few publishers actually offer laser die-cut metal detailing parts like those in high-end plastic models. Or there’s one of the all-time bestsellers, the working paper clock, made entirely from paper except for the weights and axles.\n Unfortunately, for those few of us building in paper, the only way to find them was from specialty dealers like John Hathaway and later PMI (both long defunct), which sold the best European models and a few of their own.\n But, with a few rare exceptions—like JF Schreiber’s huge, fantasy spaceship, “Blue Star”—you couldn’t find any science fiction models.\n And certainly, not that Buckaroo Banzai Jet Car I couldn’t find anywhere in any medium.\n The situation was a little different in Japan. There, cardmodeling is part of what’s known as “papercraft,” which includes origami, kirigami and other related crafts. While it still goes mostly unnoticed, a loyal band of hobbyists have created just enough demand that you can find a few, impressive book-format models, such as the Thunderbirds’ secret base, complete with all five vehicles. Kodansha released an intricately detailed Terminator Endoskeleton, the massive Wani Magazine Space Battleship Yamato is still much sought after, and Mainabi’s new tech manual for the Macross SDF-1 includes a 400 piece model. Sankei’s Studio Ghibli line ranges from dioramas and miniature buildings to vehicles and robots.\n But most of these models went unseen in the West.\n Everything changed with the introduction of two new technologies: file sharing over the Internet and affordable color inkjet printers.\n Businesses in Europe used to give away free promotional models, so it’s no real surprise that printer manufacturers like Canon and Epson got into the game. Their websites offer downloads not of simple one page models, but large, complex, well-designed efforts that take lots of paper, like Epson’s forty-seven-page model of Godzilla’s nemesis, King Ghidorah.\n But, while it was challenging and required a few drafting skills, hobbyists had been creating and distributing their own models right from the start: the old catalogs were full of “companies” with only one or two kits on the market. While the technical demands and cost of even a modest printing run had posed serious limits in the past, a designer could now create a file which could be shared with friends and beta testers—or posted on the Internet.\n And those friends could repaint or redraw parts of that basic model. They could create obscure variants, or add interiors, landing gear, and other extras. Some of these are almost a team effort, with several designers on board; each tackling what he does best.\n Then there are the online forums, like papermodelers.com, where this small group of dedicated hobbyists exchange tips, share their work, and just hang out.\n The end result was incredible. Almost overnight, a stunning number of models became available, many of them for free. From reproductions of some of those toy-like premiums to scans of classic models; from promotional offerings from major corporations to free models from gifted amateurs; from simple children’s models to insanely complex scale models, there are literally thousands of models available, representing almost every imaginable subject.\n Even the process of creating models changed, thanks to CAD programs. Now a designer can download one of the many pre-existing 3D meshes, unfold it and translate its surfaces into paper parts. This is trickier than it sounds as paper only wants to bend in one direction at a time, but there are actually programs specifically engineered to do this, of which Pepakura is the best known (although serious designers sneer at it because it tends to reduce models to lots of little strips).\n And naturally, many of this small technically gifted group of people creating models for their own enjoyment loved science fiction.\n You can easily find most of the major vehicles from the Star Wars universe, as well as figures, props, and, yes, the Lars family homestead on Tatooine. You can even find a model of the U-Wing transport from Rogue One.\n And, of course, all the Star Trek series are well-represented, with multiple versions of the most familiar Trek ships, lots of obscure and minor vessels, the Deep Space Nine Station, and even several models of the 2009 reboot Enterprise.\n But, curiously, the Warhammer 40K models might outnumber either of them, as many war gamers (particularly in Russia) would rather spend a few bucks on printing than the thirty or forty they might pay for a miniature vehicle. Perhaps the best come from the incredibly prolific Ukrainian designer, Eli Patoroch, although the vk.com forum has many more.\n There are almost as many Doctor Who models, with a vast assortment of Tardises, including uncloaked, “siege” mode, and “steampunk” variants. It is hard to find a good Dalek, although there is an impressive mutant.\n Kits abound from both versions of Battlestar Galactica, and from the Aliens movies, as well as such familiar franchises as Stargate, Firefly, Back to the Future (with lots of Deloreans and even the Time Train), and Mad Max (including Fury Road and the first film’s Interceptor and MFP cars). Gerry Anderson’s many shows are well-represented as are Irwin Allen's.\n However, one finds models not only from major works, but from whatever inspires a dedicated designer, whether Warrior bugs from Starship Troopers, the Raiders of the Lost Ark, Flying Wing, the Eagle 5 from Spaceballs, a S.H.I.E.L.D Helicarrier, the titular jet from Firefox, or even Spaceman Spiff’s iconic little red saucer.\n Cult favorites like Cowboy Bebop, Blake’s 7, and the animated series Futurama; classic films; great fantasy and SF art ; Album covers; and popular video games are all represented, as are Galaxy Quest, The Last Starfighter, and even an obscure German TV series. Fans of classic SF literature will find models based on period Jules Verne and H.G. Wells illustrations and a bust of Verne.\n It is almost harder to explain the gaps. There are only a few scattered models for cult favorite Red Dwarf, even fewer for Dune (although the 1984 film spawned a cut-out activity book for children, as strange as that may sound), and apparently nothing at all from the much loved Farscape (perhaps because of the difficult organic curves of many of the ships). Another curious absence is Gene Roddenberry’s Andromeda, although it would be tricky to build the skinny booms of the series’ star, the Andromeda Ascendant.\n However, the sheer volume of science fiction models is almost overwhelming. Some of the most visible designers seemed to have churned out dozens. Anyone searching the web will soon find model after model by these dedicated few:\n There’s Mike Hungerford, who’s turned out a lot of simple, easy to build models, including classic movie spacecraft and Marvin the Martian’s rocket.\n Then there’s Dave Winfield, whose deceptively simple Koolwheelz models produce incredible, Hot-Wheels-sized cars. His StarCarz collection features vehicles from Bladerunner, The Fifth Element, The Prisoner, and many others (including that Buckaroo Banzai Jet Car I’ve wanted for years). He even has the Juggernaut from the 1936 serial, Undersea Kingdom—and an assortment of spacecraft on his Specialz page.\n Brian “Rocketman” Tan’s models frequently show up all over the web, and include the Dark Star and ships from Ender’s Game, Halo 4, and the obscure Bavarian film, Weltraumschiff 1 Startet.\n While Jan Rükr has claimed that he isn’t a particularly good designer, his models prove him wrong: he has an impressive collection on his Aliens Papercraft site. Most are from the Alien movies, although he’s tackled everything from Tron to Czech comics.\n At Ninjatoes’ website, you’ll find his Star Trek, Star Wars, and Battlestar Galactica models, revised versions by other designers, and even a Lego Luke Skywalker.\n Bill “Armorman” Perry deserves a special mention, not just because of his own models, but because of his efforts to find, publicize, and preserve the work of other modelers. He’s posted links and downloads on most of the papermodeler forums, created interesting upgrades of others’ models, and even reconstructed this “lost” Nausicaa gunship.\n If you want 1/25 scale models of automobiles from SF movies, the best place to find them is Cláudio Dias’ PaperInside.com. Martin Sänger’s Paper Aviation site offers many impressive efforts, including his stunning Lunar Rover from Moon. And Marcell von dem Berge (“Revell-Fan”)’s excellent BSG and Buck Roger’s models seem to be everywhere.\n Perhaps the best SF cardmodeling site out there is Julius Perdana’s Paper-Replika.com, which features both links to others’ work and his dizzying collection of detailed and well-designed models, from a giant mecha from Pacific Rim, to a shipload of Wall-E models and far more—more than most of us could build in a lifetime.\n But you’ll also find a lot of dead links to great models.\n Which leads us to the serpent in this particular Eden: bandwidth.\n Yes, it can be frustrating that the best sites are in Czech or Japanese. But then, that’s why we have Google. And it is a lot harder to sign up for the swmodel.ru forum when they expect you to do so in Cyrillic characters.\n The real problem, however, is that the best models come in formats that support vector graphics.\n While these make it easy to scale the models up and down, they also require far more data, particularly for models with a lot of detail. This isn’t necessarily a problem for someone who only has one or two simple models to post, but those who have more soon run out of space.\n Which means that an incredible model can vanish overnight. Or even a designer’s entire output. That happened when Rick “Webdude” Lytle’s much loved website went dark, although he has since posted it on Google Drive.\n Most of Gary Pillsworth’s excellent models disappeared when the “DiPileggi’s Picks” website closed down, as did Diego Cortez Pardoe’s Babylon 5 kits. Many of these are now hosted at Papermodelers.com but can only be accessed by members.\n The only other B5 models that seem to be available (including the Battlecrab) are on a Russian site, but downloading them pops up pornographic video ads. It does seem that many of the most popular filesharing services either bury you under ads or try to sell you “premium” subscriptions.\n The difficulties of dealing with downloads have led some designers to set so many hoops for modelers to jump through that they are almost unavailable (like “Jepi 12”s hako-style models from The Black Hole ) ordriven many models onto private forums.\n Far worse are those tantalizing links where the webpage still remains but the download links have long since ceased functioning.\n Most of these models are free. Getting them officially licensed is quite difficult, but they’re usually treated as fan art if you give them away (a few—like the moon rocket from the Tintin books—have been taken down for copyright reasons).\n So, keeping a model alive often depends on tips, or obnoxious ads, or selling other non-copyrighted models.\n Few creators actually make any money: most do it for the sheer love of modeling.\n Perhaps Cardmodeling’s greatest advantage is that it gives the designer the freedom to create almost any project he’d like, whether an absurd bit of fun or something truly epic.\n And some of the projects out there required such an unimaginable amount of skill and hard work that they seem almost impossible.\n True, a full-sized Star Wars battle droid or R2 D2 is impressive, but then one finds something like this huge version of Howl’s Moving Castle, with lots of moving parts, or the insanely detailed Matrix APU.\n Far more impressive, however, is Jan Rukr’s masterpiece, a nearly six-foot long version of the USS Sulaco from Aliens. He designed the ship over several years, using a modular system that allowed him to create one section at a time while making the whole model quite strong.\n But by far the most totally insane models out there—and the best, with a seemingly impossible level of detail and scale accuracy—are those of “Uhu02”, whose site features an incredible assortment of models, which rival plastic models in quality. He is the sort of modeler who thinks nothing of building the Tokyo tower—girders and all—and routinely adds interiors, cutaway displays and internal details.\n Unfortunately, you can’t download most of them. He gives new models away for a short time, and only occasionally makes the older ones available. One can only hope that he’ll offer his USSC Discovery again.\n While the new technologies have changed the hobby, the basics still remain the same.\n True, many computer-aided models look like someone dumped the parts all over the page, and only a few designers still produce model pages which are themselves works of art. True, there are now laser cutting machines that can pre-cut the parts, and Cosplay enthusiasts (who are heavily into Pepakura) frequently print theirs on foam board or cover the paper with layers of other materials. And, true, you often can go online and find build tutorials for the model you just downloaded.\n Yet the fact remains that with a few simple tools, and a few basic skills, you can build models of hundreds of different science fictional subjects, without having to spend a lot of money to do it.\n It’s enough to leave any discerning fan in a permanent state of “Nerdvana.”\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}