{"fingerprint": "sd1Z5bq3Xa/+nPNYuaWpvbrA5ZU=", "sitename": "Clarkesworld Magazine", "title": "Ray Guns, Robots and Spaceships, Oh My! The Birth of Science Fiction Toys by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_05_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ray Guns, Robots and Spaceships, Oh My! The Birth of Science Fiction Toys by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nRay Guns, Robots and Spaceships, Oh My! The Birth of Science Fiction Toys\nWhen we think of archaeological digs, most of us picture Indiana Jones in search of ancient civilizations, but just as often, they are conducted on far more modern sites to learn how people lived in the recent past.\nNot long ago they conducted a dig in the Shenandoah National Park. Back in the twenties and thirties, the federal government evicted over five thousand families to create the park. Despite the public perception that they were “hillbillies,” living in utter destitution and almost completely cut off from the modern world, on the researchers’ first day’s survey of Corbin Hollow they were shocked to discover that thy had all sorts of modern products—hair tonic, cologne, automobiles, Coca Cola, hot sauce, a Maxfield Parrish calendar, and most surprising of all . . .\nYou can blame Buck Rogers.\nBut then Buck was the one who dragged science fiction out of pulpwood obscurity and thrust it into the bright light of the American public. His story, about a modern-day man who woke up in the twenty-fifth century, ran daily in countless newspapers, and it wasn’t long before it spun off into radio and the movies. It was inevitable that someone would try to cash in on it.\nThese days we take them for granted. You can walk into any Walmart and find dozens of science fiction toys—some of them even made for children.\nBut it all got its start with the legendary Daisy XZ-31 Rocket Pistol.\nIn 1934, Daisy realized that the pistols, helmets, and holsters in the legendary comic strip were too complicated to be reproduced easily. So they convinced Lt. Dick Calkins and Phil Nowlan to completely redesign them, with the help of some of Daisy’s engineers, so they could create exact toy replicas.\nWhen cocked, it made a loud popping sound (Daisy would later turn the basic design into a popgun and dart gun) and created sparks visible through the “electronic compression view plate.”\nAfter a slow start (many of the retailers who saw them at a toy show thought Buck was a cowboy star!) Macy’s Department Store in New York agreed to sell the Rocket Pistol in exchange for a two week exclusive contract.\nIt was a hit! Over two thousand people stood in line outside the first day.\nAs soon as their biggest rival, Gimbels, got their supply, they slashed the price and set off a price war so fierce that prices changed hourly and the forty-nine cent price ultimately dropped to two for nineteen cents, well below cost. Meanwhile, Daisy surreptitiously bought them back from both stores and resold them!\nUltimately, both toy departments were left in shambles, toy stores all over the country demanded the XZ-31 and Daisy couldn’t get enough steel or cardboard for the boxes to keep up with the demand.\nWhich didn’t stop them from releasing Buck Rogers helmets, holsters, and even a new ray gun—Wilma Deering’s XZ-35—in time for Christmas, 1935.\nOther Buck Rogers pistols from Daisy followed: in 1935, the collector favorite XZ-38 Disintegrator; the XZ-44 Liquid Helium Water Pistol in 1936; and, after World War II, Daisy revamped the XZ-38 into the U-235 Atomic Pistol. Buck actually wore one of their toys in the 1939 serial.\nAnother major toy maker, Louis Marx, also made Buck Rogers toys in 1934, including a windup Rocket Police toy which could shoot across the floor, spraying sparks out of its engines. The next year, they would get into the ray gun game with a bulbous, brightly-painted pistol for Buck’s biggest competitor, Flash Gordon: the Signal Pistol. It had a loud siren and shot sparks. Flash would even use a signal pistol in the comics, although it didn’t look much like the toy. Later, they would add a slimmer, more elegant model known as the Radio Repeating Ray, although in the fifties it was relabeled the Arresting Ray Pistol.\nThere isn’t a lot of information available on the history of science fiction toys. No one paid much attention at the time and only now, thanks to collectors and antique dealers, is anyone trying to piece it together.\nWhile there had been Buck Rogers premiums before the XZ-31, including two paper ray guns (one made snapping sounds when waved, the other was a rubber band gun), Daisy’s pistol launched the toy craze. Before long, there were dozens of ray guns on the market, as other companies tried to get in on the act in an incredible assortment of new designs and types: guns that shot sparks, popguns, dart guns, water pistols, cap guns, flashlight guns, and whatever else anyone could dream up.\nSoon other toys came out as well: spaceships, costumes, playsets, and small lead figures like contemporary toy soldiers. Most of these were made of stamped metal, aluminum castings, Bakelite, or hard rubber, and frequently featured clockwork or friction motors. Typically, the toys of this era featured bright colors, lithographed artwork (including lots of printed rivets), and mechanical gimmicks of one sort or another.\nSadly, it all came to an end with the second world war, when wartime shortages made manufacturing toys almost impossible. Daisy switched to making wooden popguns, and many other manufacturers started using zinc which, while not as strong as aluminum, wasn’t needed for the war effort.\nBut when the war was finally over, a new toy arose, one that sold as well as the toy ray guns—if not better—a science fiction toy that is even more iconic:\nThe toy robot.\nThe first toy robot came about because of our occupation of Japan.\nThe image of the mechanical man was firmly in the public mind long before that—one need only look at Westinghouse’s Electro and his pet Sparko at the 1939 World’s Fair, or at serials like The Phantom Empire or The Mysterious Dr. Satan. The first toy robots kept to the basic pattern set by their more visible predecessors as they were stamped out of tin and had to be made from simple shapes.\nPart of General MacArthur’s mission was rebuilding Japan’s industries, and he decided that they should focus on the types of labor-intensive—but not very profitable—manufacturing of small items that American industry no longer wanted to do, using whatever materials were available in postwar Japan.\nWhich, naturally, included toy production—and what is believed to be the first toy robot ever—the bright yellow Robot Lilliput.\nIt was a boxy, clockwork-powered thing made from thin sheet metal. For a long time, toy collectors believed it had first been made in the thirties, although it is now fairly certain that it was from the mid-forties. The second toy robot, Atomic Robot Man, followed in 1949, packed in a box showing a mushroom cloud rising behind a looming robot. A few of these were actually handed out as souvenirs of the New York Science Fiction Convention in 1950, and may even have been given away to promote Isaac Asimov’s I, Robot.\nWhile the Japanese robots did come to the US thanks to American distributors (who sometimes marketed them as their own products), it wasn’t these first few tin men from Japan that made the biggest impact. It was an American-made toy that launched the robot revolution in 1954, a toy that was borne of a new manufacturing method: injection molded plastic.\nHe was called Robert the Robot. Not only did he speak when you turned a crank on his back, but he could move as well, thanks to a remote control with a crank that powered him and a trigger that controlled his rotation. His eyes even lit up, although they relied on battery power.\nHe was designed for the children’s film, Tobor the Great, but didn’t actually appear in it. However, even though no one remembers him today, he was so popular at the time that he appeared on T-shirts, flashlights, and other merchandise. Two songs were written about him and he made an appearance in There’s Always Tomorrow, a Douglas Sirk melodrama starring Fred MacMurray.\nRobert was forgotten quickly, but other American robots followed. One of the most interesting (and expensive, at eleven dollars and ninety-five cents in 1956 dollars) was the Zimmerman Z-Man, a red robot driving a black plastic car. It was one of the first programmable toys: while the selector on its underside could switch between driving in circles or a figure eight, it had a series of mechanical switches hidden under the robot’s helmet that could program new patterns.\nBig Max came with a battery-powered conveyor belt and an electromagnet at the end of its arm. It swiveled around, picked up metal slugs, and dropped them on the belt.\nThe battery powered Marx Electric robot was much-copied in Japan, and was even sold with his “son,” a second smaller robot.\nMarvelous Mike just drove a battery-powered tractor.\nThe Japanese toys were seen as cheap and second-rate (although they now command incredible prices from collectors) and were often made from recycled materials (some of them actually have labels for canned food printed on the inside as they were made from rejected tin from canning plants!) or assembled as piecework in workers’ homes. But they were also the first to introduce battery-powered motors.\nIt was another robot, though, that transformed the market and inspired vast floods of toy robots of the fifties and beyond, one that wasn’t from the world of toys or Japan but from Hollywood: Robby the Robot.\nRobby was the real star of the 1956 film Forbidden Planet and perhaps the most iconic robot ever created. He was immediately copied in both tin and plastic, with windup or battery power, not only by toy makers in Japan but in the US as well. There were perhaps as many as two hundred different versions of Robby sold at one point or another.\nNone of them, of course, were officially licensed.\nNot that it was that hard to tell, despite whatever minor variations the creators added to them, which robot they were really supposed to be. But then, Robby was a truly classic design: nicely proportioned, with elegant shapes and a lot of interesting innovations like the glass dome over his head that allowed you to see his inner workings. One of the most loved of these, Nomura’s Robby Space Patrol toy (one of the few depicting Robby in the wheeled vehicle he uses in the film), was so faithful to the original that MGM enjoined them to stop its production.\nFortunately for Nomura it didn’t sell enough to justify production.\nToy rocket ships of all descriptions were quite common, although it is hard to find much about them as they haven’t commanded as much interest among collectors. In the thirties a lot of them were vaguely V-2 shaped, with fins and wings and lots of pipes and other odd components (usually lithographed on). Others chose a more airplane-like design, and one suspects that there may have been a bit of an overlap, with airplane toys redecorated and sold as space toys.\nBy the fifties, lots of flying saucers showed up, some based on existing spinning top tin toys, others original designs in all shapes and sizes. Later, after the launch of Sputnik, toy rockets started resembling real space vehicles, although, like one classic Japanese toy Mercury capsule painted a bright red, they weren’t picky about getting the details right.\nThese sorts of toys often featured motors, flashing lights, or a wild variety of other gimmicks (like the 1960s Jupiter Jyro flying saucer, which did all sorts of tricks thanks to a battery-powered gyroscope). That seems to have been typical of most toys back then, which had lots of mechanical components worked by hand cranks, levers, or other mechanisms, like the large and very solid diecast missile truck we somehow acquired during my childhood with its complex, hand cranked lifts and gantries on the side of the truck and a missile with a rubber nose cap that shot off. Or a later find, a series of plastic space rovers and a flying saucer, which had no motors but were driven by the battery-powered motor hidden in the astronaut’s backpack. He could be plugged into their driver’s seat socket. There was also a motorized robot that fit the same vehicles.\nOr consider Louis Marx’s classic lithographed fort and command post sets, which featured metal walls which, depending on what they were supposed to be, might feature art identifying them as log stockades, or old-time Western towns, or a military base, and came with assorted vehicles and figures. One of the variations (another very old toy we were given) was decorated as a Space Patrol Rocket Port and came with astronauts, robots, aliens, and lots of rockets.\nBuck Rogers continued to produce new products during the fifties, including two plastic flashlight guns by Honer, the Sonic Ray and the Super Sonic Ray. While it’s said Flash Gordon had few spin-off toys beyond a costume set and a few other odds and ends until the seventies, there was a Flash Gordon version of that Buck Rogers Rocket Police Car. However, Marx (as was common at the time) frequently reused their toys, and other versions existed, including the super-rare, UK only, Rex Mars Rocket Fighter.\nAs science fiction franchises multiplied in the fifties, new toys appeared: Captain Video offered a wide range of spin-off products and a flood of on-air premiums: secret code guns, flying saucer rings, decoder badges, photoprinting rings, and Viking rockets complete with launchers (Dave Barry once claimed his Captain Video Rocket Ring “seemed to have a higher production value than the actual TV show.”). Most famous of all was the Captain Video Space Helmet, which Art Carney wore on an episode of The Honeymooners. The most impressive, though, was the multilevel Superior Space Port playset, which came complete with atomic cannons, landing strips, radar dishes, a windup siren, and a flying saucer launcher that shot plastic disks.\nFans of Space Patrol, however, had far more merchandise to choose from than any other spaceman show, including such goodies as a periscope, binoculars, walkie talkies, a variety of ray guns, a Ray-O-Vac Flashlight Rocket, and what is now perhaps the rarest plastic ray gun and a Holy Grail for collectors, the Autosonic Rifle. However, that official rocket port also appeared with minor differences as Tom Corbett, Rex Mars, and Captain Space playsets, for a total of thirteen variants!\nJapanese toy makers don’t seem to have missed any opportunities to cash in. They turned out lots of lovely space toys labeled “space patrol” well into the sixties and seventies with no official connection to the series, including a planetary rover, an assortment of cars (including a VW convertible) and even a plastic “Apollo Space Patrol” flying saucer!\nFor Tom Corbett, Space Cadet, Louis Marx created one of the most beautiful ray guns, the Atomic Rifle, as well as a windup sparking rifle and a redecorated version of the Flash Gordon Arresting Ray. They also sold a plaster casting set featuring rubber molds for Tom Corbett figures and other items. Perhaps this might not seem so strange when you remember that such kits used to be a fairly common toy.\nMeanwhile, in the United Kingdom, British fans of the Dan Dare comics could buy an impressive assortment of ray guns, a radio set (which was just a plastic version of the classic “tin cans on a string” phone), and even the Earth Mars Venus Express, sort of an interplanetary bus.\nToday, some of the most prized of these toys will sell at auction for as much as fifty thousand dollars! Which is even more impressive when you remember that most of them originally cost less than five. There is also a surprising aftermarket for replacement parts, particularly the more fragile and visible parts, like glass domes, or the detachable helmets for the spacemen in the old Louis Marx sets.\nIt would be easy to ignore the role these toys played in the growth of science fiction: they may have been cheap, simple, and childish, but they sparked the imagination of countless young children. The vast hordes of children who loved Captain Video may not have been as sophisticated or scientifically literate as the cult following that grew up around Star Trek (although it is interesting to note that, after 1952, the once absurd series improved dramatically as some of the top science fiction writers of the day, including Damon Knight, James Blish, Jack Vance, and Arthur C. Clarke, took over the writing chores!) but you have to wonder how many of the earlier Captain fans Kirk inherited. Not to mention that there are a number of interesting similarities between the two shows.\nBut even if we might argue about the connections between science fiction and these often weird and colorful toys (sold with artwork suspiciously reminiscent of old SF pulp covers and comic strips, or Chesley Bonestell’s space art), there is one thing we can say about them:\nThey were a lot of fun.\nPerhaps even more fun than most toys being made today.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}