{"fingerprint": "PHNbKIMR32PbFQfhV0QdcYdewLc=", "sitename": "Clarkesworld Magazine", "title": "Melon Farmers! Science Fiction Stumbles on the Way to the Theater by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_11_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Melon Farmers! Science Fiction Stumbles on the Way to the Theater by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Melon Farmers! Science Fiction Stumbles on the Way to the Theater\n There’s an old saying about five-star restaurants: you do not want to see the kitchen. Let’s face it: sometimes you are better off not knowing how things get made.\n That certainly applies to movies. Film is a big business, which devours vast quantities of money and talent—and too often, the talent finds itself at the mercy of those who foot the bills.\n Never was this clearer than the early Eighties when science fiction suddenly entered the mainstream. While an impressive number of films made it to the screen in record time, many suffered very public woes along the way.\n Star Wars and Close Encounters of the Third Kind showed that there was a market for science fiction. The problem was that neither bore much resemblance to the other. Unlike westerns, crime thrillers, or other genres, it wasn’t clear what a science fiction film should be.\n The first few were the films already in the pipeline, like Disney’s, The Black Hole. It started out as 20,000 Leagues Under the Sea in space, but, in the wake of Lucas’ epic, got a budget twice that of Star Wars. Unfortunately, what had been a space gothic complete with a dazzling Victorian Crystal Palace spaceship, suddenly acquired Star Wars-style robot pals and robot Stormtroopers.\n But the real problem was that it didn’t have an ending.\n It seems inconceivable that Disney would green light a twenty million dollar film without a scripted ending, but not only didn’t they have one, they had no idea how it should end. Peter Ellenshaw proposed a black hole journey ending with a long, slow zoom from Yvette Mimieux’s eye, revealing that she is staring at Michelangelo’s Sistine Chapel ceiling. It doesn’t make much sense, but then neither did the real ending.\n Endings have always been problematic. Sometimes, however, it was better that the studio intervened: in Ridley Scott’s original Alien script, the Xenomorph kills Ripley, calls the company in the Captain’s voice, and sets the controls for Earth.\n Other films suffered far more public meltdowns.\n Star Trek: The Motion Picture followed a singularly convoluted path to the screen: Gene Roddenberry tried to sell a movie to Paramount. They liked the idea because Star Trek was doing so well in syndication, but rejected his script, The God Thing, and one by Harlan Ellison. Star Trek: Planet Of The Titans did get into development, with a seven and a half million dollar budget and Philip Kaufman signed to direct, but fell apart before it got very far.\n Paramount then planned to launch a fourth network with Star Trek: Phase II as their main attraction (much as they did twenty years later with UPN and Star Trek: Voyager). The long and curiously leisurely development of the new show began in 1977, with a script turnaround time in months rather than weeks.\n Gene convinced most of his old cast to return (except Leonard Nimoy), created new characters, and even had a replacement Captain on hand in case they decided to kill off Kirk because of William Shatner’s salary demands.\n The original Art Director, Matt Jefferies, redesigned the Enterprise. They constructed the main sets, made new uniforms, and recycled what they could of the surviving props and costumes.\n And then Star Wars came out.\n When the producer pitched Alan Dean Foster’s pilot to Paramount, Michael Eisner said, “We’ve been looking for the feature for five years and this is it.” Phase II was dead, and Star Trek: The Motion Picture was born.\n Only it wasn’t quite that simple. Paramount had run the numbers and knew their proposed Network wouldn’t break even. Not that they told anyone working on the new show. By changing the production into a movie, they could write off their development costs—even the scripts which would never be filmed.\n It is easy to see why things went wrong: it was the classic movie made by committee. Roddenberry, the producers, and Paramount all had things they wanted, but no one had a clear vision for the film. Far worse, they still had no ending, and no one had the slightest idea what a satisfying one might look like.\n Robert Wise was brought in to direct, but he had no meaningful science fiction experience (despite making The Day the Earth Stood Still), and never managed to assert any real control. By all accounts, he seemed overwhelmed by a huge and essentially rudderless production.\n The job of creating the special effects fell on Robert Abel and Associates (RAA), a new but highly rated firm. Paramount gave them an eight million dollar budget, which soon ballooned to twelve.\n Paramount dumped RAA and brought in Douglas Trumbull to finish the job.\n It would be easy to blame RAA, but the endless script changes (so frequent at one point, that they had to not only date but time them!) forced them to scrap sequences they’d storyboarded and start over. Although they’d done all the design work, built most of the models, and storyboarded the entire film four times (only their V’ger sequence did not get used in the film), they ultimately received only a single screen credit.\n Paramount had collected thirty million in bookings for the December 7, 1979 release date and refused to change it. The execs and lawyers were told “Gentlemen, I don’t care if the story doesn’t make sense, I don’t care if it cuts together. We’re delivering this movie. Period.”\n With six months left, the new effects crew worked overtime at enormous cost, driving the total to a record forty-six million. The effects were slapped into blank spots left in a hurried cut (with the first reels going to the printer as the last ones were finished!), and the prints barely made it to the theaters on time.\n It was a slow and ponderous mess. Important plot points were missing, as well as some effects. Scenes were allowed to drag on. While it attracted large audiences, it pleased neither critics nor fans—and didn’t make enough to justify the vast sums spent on it.\n However, this isn’t the Star Trek: The Motion Picture most people have seen.\n In 1983, Paramount created a new version for television.\n It may seem odd that they didn’t do this when it came out on video. However, VHS tapes were still enormously expensive—as much as 100 dollars apiece—and had not turned into a major market yet. It was only when it made its lucrative network debut that Paramount found the money for a mild upgrade.\n They finished some of the effects and restored a few deleted scenes. Ten minutes longer than the theatrical cut, it was still rough and indulgent but generally an improvement. For many years, this “Special Longer Version” was the only version available, although the original has made a bit of a comeback.\n In 2001, Robert Wise created a “Director’s Edition” for DVD, which cut footage from both versions (and is only a few minutes longer than the original) and replaced many effects with digital ones based on the original art and storyboards.\n But Wise did not have access to the original negative elements and could not do the major recut the film needed. As the new sequences were rendered in DVD quality it seems unlikely that it will ever get a Blu-ray release—or return to the theaters.\n Even those productions with a clear vision ran into studio interference.\n While Blade Runner is now hailed as one of the most influential science fiction films ever made, it did poorly in the theater and was savaged by the critics.\n Ridley Scott’s public criticisms of his film probably didn’t help. The studio didn’t understand it so they took it out of his hands, reedited it, and added extensive narration (and a happy ending borrowed from unused footage for The Shining). Some claim that Harrison Ford deliberately gave a bad performance on his voice-over, hoping that the studio would discard it, but he denies it.\n The irony is that Scott’s original script had a lot of narration. Ford urged him to replace it with new scenes showing rather than telling. However, not all of it was removed: the work print which the studio later found and showed to a few audiences as a “Director’s Cut” still included Deckard’s narration for Roy Batty’s death (although it was quite different from the final version).\n The work print opened a strange new chapter in the movie’s life: it infuriated Ridley Scott that they called it a Director’s cut. It was very rough and had a temporary music track (from Planet of the Apes) instead of Vangelis’ “Tears in Rain.”\n Warner Brothers then created an official Director’s Cut, assembled from Ridley’s notes by film preservationist Mike Arick and gave it a theatrical release in 1992.\n Ridley Scott still wasn’t happy and began his own version. He not only located a treasure trove of original materials, but shot new scenes. After a few legal battles, the “Final Cut” debuted in time for the film’s 25th anniversary.\n Which, if you include the TV cut and more violent international version, brings the total to seven official cuts.\n Perhaps the strangest part is the three-second unicorn dream. While Ridley insisted on restoring it, he didn’t fight that hard to keep it in the original. It is strangely missing from the work print.\n The full dream does not appear in the Director’s Cut as Arick could not find a good copy, but was restored in 2007.\n But the most persistent myth surrounding the scene is that it was shot for Legend. There is some basis for the story: while the production was winding down, Scott took a crew to a nearby park. His producer, Ivor Powell, believed that he was shooting test footage for the new film they’d already started, but writing it off to Blade Runner’s budget. As he put it, “But Ridley maybe did have something else in his mind. It was something more than a test.”\n Terry Gilliam’s woes with Universal Studios over Brazil (1985) were far more dramatic, even if they never resulted in anything like Ridley Scott’s cottage industry of competing cuts.\n Universal didn’t like Brazil: it was too long and didn’t have a happy ending. While Terry trimmed it by twenty minutes he would not change his bleak ending.\n They refused to release it. Gilliam ran a full-page ad in Variety pleading with them: instead, studio head Sid Sheinberg bought an ad offering to sell the film! Gilliam then arranged a few decidedly unofficial private showings. As a result, the Los Angeles Film Critics Association gave it their awards for Best Picture, Screenplay, and Direction.\n Universal then set up a limited run to qualify for the Academy Awards.\n But they weren’t quite finished. During the dispute, Universal had a second team of editors create what is sarcastically called the Sid Sheinberg or “Love Conquers All” cut, which turns Sam’s dream of being rescued into reality.\n When the film debuted on TV this was the version that Universal chose to run. Unfortunately, the dream doesn’t seem at all real, and the bizarre decision to mix in an earlier dream in which a character is literally consumed by paperwork only made it worse.\n Fortunately, Sid’s edit vanished without a trace and few fans remember that it ever existed.\n Unless, of course, they bought the Criterion Box Set.\n Perhaps these controversies inspired the extended version of David Lynch’s Dune.\n The film had proved an epic disappointment, largely because of the gargantuan expectations: after all, not only was Dune a cult classic, but its young director’s strange films had already earned him a following. Few films could live up to that sort of hype—and Dune didn’t.\n Then the rumors started.\n A preview ran for four hours.\n Before long, there were claims that different versions existed, even a supposed six hour “Director’s Cut.”\n It is easy to see why so many believed this. After all, Dune had been described as the best trailer for a twelve-hour movie ever made. They’d tried very hard to pack a huge story into a tiny box. However, the preview was a preliminary assembly without effects and would have been much shorter in final form. No other finished cut ever existed—and the six-hour cut was impossible as they only shot five hours of film.\n Most of the narration so many objected to, including the interior monologues (and some of the cheesier bits of dialogue!), actually came straight from the book.\n Lynch’s final draft would have clocked in around three hours: however, as the De Laurentiis’ wanted a two-hour cut, many of these scenes were never shot. And some of the unseen footage had to be reshot to explain things they’d cut.\n But that didn’t stop people from believing in the “lost” version.\n When the film finally came to television, Universal’s TV department added forty minutes—and did such a poor job that David Lynch demanded that his name be taken off. Instead, he’s billed under the official Directors Guild pseudonym, Alan Smithee, and coined the name “Judas Booth” for his writing credit.\n Not only did Universal cram the deleted scenes in without editing them properly, they actually repeated some footage. They inserted parts of the battle scenes cut off by the pan-and-scan process as a separate element—and blew-up part of a scene to create a new shot of the Emperor’s ship landing.\n Far worse, the new introduction was even longer than the original—and includes material repeated in the next scene! It is set against an unimpressive set of drawings, which look suspiciously like unused production art (as did some added “effects”). Rumors suggest that the unknown voice may be Frank Herbert’s.\n Lynch has repeatedly turned down offers to create a Director’s Cut, and wants nothing more to do with the film.\n But then, without those unfilmed scenes, he could never turn it into the movie he wanted.\n While Alex Cox had his share of woes while making his classic punk science fiction film, Repo Man (1984), he ran into an even stranger problem with Universal’s television edit.\n They actually filmed new scenes including a rather bizarre revision: the Hopi symbol on the Arizona license plate of J. Frank Parnell’s ’64 Malibu morphs into the head of the devil.\n While Alex is probably wrong (and joking) when he suggests that the stories about the film industry being run by Satanists might be true, the results were so bad that they asked him for help.\n Cox then supervised the editing. He added deleted scenes to fill out the running time (including the one where Bud claims he is “I. G. Farben”) and found a lot of creative but television-friendly swear words to replace the nearly nonstop profanity. Perhaps the best loved by those who saw the film when it ran endlessly on TV was “Melon Farmers!”\n Fans have demanded a video release of the TV cut for years (making it one of the stranger “lost films”).\n It hasn’t happened.\n And the deleted scenes on the 2006 Collector’s Edition, still lack Bud’s attack on a phone booth with a baseball bat.\n Others problems were far less public.\n Casting Jean-Claude Van Damme as the Predator seems, in retrospect, to have been singularly misguided: no one bothered to tell him that his face would be unseen, that he would be invisible for most of the film, and that (as the original unused creature) he’d be expected to run through the jungle on stilts. Instead, he showed up for the first day of filming and found he was supposed to wear an absurd bright red suit (meant to be filtered out and replaced with a blur). What happened isn’t clear, but they fired him within days and hurriedly brought in Stan Winston to design a new creature.\n And then there are unconfirmed hints of even stranger things, the oddest being the persistent rumors that The Adventures of Buckaroo Banzai: Across the Eighth Dimension might have been a scam straight out of The Producers, as it looks more like it cost ten million dollars, not twenty.\n Considering how mainstream science fiction has become, it may be hard to grasp how difficult it was to make these films. The worst—the truly awe-inspiring misfires—reflected a failure to understand science fiction, or the market they wanted to reach, or even the film they were making. Star Trek: The Motion Picture wasn’t meant to be 2001: A Space Odyssey, Dune isn’t Star Wars, and Brazil isn’t a happy little comedy.\n The film industry is as messy as ever. Studio politics and committee-made movies are still with us. But at least the younger generation of filmmakers often has a better grasp of what science fiction is and how to film it.\n Unfortunately, the studios’ obsession with the bottom line means they’d rather back franchises and sequels than original science fiction.\n The struggles aren’t over, and will never be.\n But at least we have these pioneering works, good and bad, to help light the way.\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}