{"fingerprint": "T4LCgNBnv/xAbSrVOljDrPOHSlY=", "sitename": "Clarkesworld Magazine", "title": "Foundation and Reality: Asimov's Psychohistory and Its Real-World Parallels by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_11_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Foundation and Reality: Asimov's Psychohistory and Its Real-World Parallels by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Foundation and Reality: Asimov’s Psychohistory and Its Real-World Parallels\n \n “Psychohistory dealt not with man, but with man-masses. It was the science of mobs; mobs in their billions. It could forecast reactions to stimuli with something of the accuracy that a lesser science could bring to the forecast of a rebound of a billiard ball. The reaction of one man could be forecast by no known mathematics; the reaction of a billion is something else again.”\n —Isaac Asimov, Foundation and Empire\n \n Robots. That’s what most people think of first when they think of Isaac Asimov—and certainly, his stories about the Three Laws of Robotics are among the best he wrote. But he also came up with another unique and equally memorable science fiction concept: psychohistory.\n Psychohistory (originally hyphenated as “psycho-history”) first appeared in the short stories Asimov would later collect in his episodic novel Foundation. Set in a distant future, the book details a vast, galactic empire which has controlled thousands of inhabited worlds for 12,000 years. The empire is on the verge of breakdown. However, very few people have realized this, primarily those working with the great mathematician Hari Seldon. Seldon’s mathematical models have shown conclusively that the Empire will collapse within a few hundred years, followed by a 30,000 year dark age before civilization is rebuilt.\n Seldon’s great accomplishment was his reinvention of the discipline of psychohistory. What had been little more than a set of vague axioms became, under his leadership, a profound statistical science, capable of charting the rise and fall of civilizations—and even, Seldon argued, of guiding the course of civilization so that the 30,000 years of darkness could be reduced to a mere millennium.\n The underlying logic of psychohistory resembles Boyle’s gas law: The molecules in a gas move in a purely random way, and yet, collectively, that random behavior become predictable. So if you get enough people together (and Asimov very carefully avoided any suggestion of just how many), you could reduce the apparently random actions of billions of human beings to a set of physical laws describing the behavior of civilizations. That number, the Seldon constant, was extremely high—high enough that it could only be found in the vastness of the Galactic Empire.\n On the surface this sounds fairly plausible, even if the degree of accuracy Seldon claimed for his work doesn’t. Yet it is far from clear that Asimov believes in his own invention. As in his stories about the Three Laws of Robotics, Foundation works because of the tension between the turn of events in the plot and whether they will lead to the next scheduled “Seldon Crisis.” Will the plan succeed, or will it fail?\n In fact, the plan does fail by the end of the second novel, although this happens only because of an event which no one could have predicted: the rise of a mutant leader with enormous mental powers.\n Whether he believed in psychohistory or not, Asimov was not alone in suggesting that a scientific approach to history would allow us to predict future trends.\n Karl Marx’s notion of historical materialism was one of the first attempts at a scientific approach to history. In his view, the motor driving all of history was the means of production. As new technologies and methods changed how people produced the things they needed, he argued, this changed all of society. This historical progression would lead inevitably through a series of necessary steps towards the ultimate goal of history: socialism.\n While many socialist thinkers have tinkered with Marx’s basic formulation, most versions start with what is called “primitive communism” (in prehistoric tribal societies), followed by ancient society, feudalism, and finally capitalism. Each one of these stages represents a different way in which people produced the goods they needed to survive—and a different way of living.\n It should be noted, however, that, despite the term “scientific,” Marx’s system is not empirical but deduced from his own first principles.\n Many of Asimov’s readers have in fact suggested that Marx was one of the major influences on psychohistory. However, Marx’s historical materialism bears little resemblance to Asimov’s conception. Seldon’s system appears to include far more than the purely economic factors Marx would allow—with the second crisis leading to the establishment of what amounts to a religion. What is far more important, though, is that Marx pictures a clear, evolutionary progress, each stage representing a more advanced society than the last, whereas Hari Seldon’s science predicts not a progression, but the cyclic rise and fall of civilizations—both development and decay. Psychohistory more closely resembles the work of a handful of 20th-century thinkers who dared to reject the standard, evolutionary view of society: most notably, Oswald Spengler, Arnold Toynbee, and Pitirim Sorokin.\n Spengler was the first to propose a cyclic view of history in his 1918 book, The Decline Of The West (a second volume followed in 1923). He identified eight great world cultures—Babylonian, Egyptian, Chinese, Indian, Mexican, Classical (Greco-Roman), Arabian, and Western—and drew parallels between their development and decline. These parallels led him to believe that civilizations were organic, with a distinct life-cycle and a 1000-year lifespan. He divided this cycle into four stages: Spring, a period of cultural birth based largely on a new conception of God; Summer, marked by the rise of the earliest cities and the development of critical thought; Autumn, a time of rationalism, organization, and urban development; and Winter, when the civilization begins to break down, abstract reason falters, and people lose faith in their religious beliefs.\n But it was Spengler’s assertion that Western Civilization had begun to decay that made his book an enormous success in his native Germany. It came at a time when the country was in the midst of moral and economic chaos, and it offered an explanation for Germany’s failures in World War I. To Spengler, democracy was a decadent form of government, one typical of a society deep in the winter of its existence. His vision of a vibrant new society run by a strong leader caught the imagination of the burgeoning Nazi movement. Spengler himself, while he agreed with many Nazi ideals, found Hitler absurd and distanced himself from the movement before his death in 1936.\n While British historian Arnold Toynbee showed clear signs of Spengler’s influence in his massive work, A Study of History, he rejected the German historian’s organic vision of society in favor of a more complex model. His dozen volumes (published from 1934 to 1961) covered a far larger number of civilizations—21, although some of his divisions are debatable—in far greater detail. Rather than Spengler’s deterministic approach, with its rigid patterns every civilization had to follow, Toynbee believed that new challenges created a civilization, forcing its people to find new ways to overcome them and new ways to live their lives. Without these difficulties, a society would quickly stagnate, its creative impulses untapped—and yet, too great a series of disasters could easily destroy the fledging civilization.\n Once established, it was a small, “creative minority” that kept a new civilization running—and it was the breakdown of this minority that ultimately led to a civilization’s decline and death. While it predicted specific events within the lifespan of a civilization (such as a “time of troubles” and dark ages), his system saw these as the result of the actions taken by the people within that society. However, he also observed that these actions created similar results in one society after another and fell into predictable patterns.\n Although most historians ridiculed it, Toynbee’s work seized the popular imagination. One finds, for example, a society of Toynbeean scholars playing a sizable role in Charles L. Harness’ classic SF novel, The Paradox Men, and he plays a key role in Ray Bradbury’s story, “The Toynbee Convector.” Whatever its value as an actual theory of metahistory, Toynbee’s work defined the way in which many people viewed the past for the better part of a century. While his theories may not always match those of the fictional Hari Seldon, the resemblance is strong enough to suspect that, as he was for a great many others, Toynbee may have been one of Asimov’s more important inspirations.\n While not as widely known as either Spengler or Toynbee, Harvard sociologist Pitirim Sorokin offered a third similar theory best remembered for the categories he divided civilizations into: the ideational, in which the spiritual dominated society, and the sensate, which was concerned with purely material things. At rare intervals, a combination of these two impulses in society resulted in the integral or idealistic stage, which was a perfectly balanced combination of the two: He claimed this could be found in both Classical Greece and the High Middle Ages.\n However, unlike Spengler and Toynbee, Sorokin saw the shift from one stage to other as something that could happen at any time. While he identified patterns and trends in history, he hoped that with proper guidance from those aware of the nature of human civilizations, it would be possible to guide mankind to its next ideational stage, without the horrors he had witnessed during the Russian Revolution.\n After Harvard removed him from his position as the founding Chairman of the Sociology Department, he went on to found the Harvard Research Center for Creative Altruism in 1949, which had as its goal the elimination of future wars by using his historical insights to promote love and understanding. It sounds suspiciously like a real-world Seldon Institute—although the first of Asimov’s Foundation short stories actually appeared seven years earlier.\n Even with this widely-varied collection of theories, none of them match the most distinctive characteristic of Seldon’s theories: They do not make any mathematical predictions.\n For that, one has to move from history to modern economics, which insists that it is a mathematical science, capable of making precise predictions. The Nobel Prize in Economics routinely goes to the creators of sophisticated mathematical models of human behavior.\n Unfortunately the parallel ends there, as no one expects these models to predict actual economic behavior.\n While no economist would ever put it quite that way, they will blame any failure of real behavior to match their predictions on factors which are not part of their model. Human behavior is enormously complex, so there can be no shortage of possible explanations for any deviation from their predictions. Free market economics deliberately simplifies human behavior, focusing only on a few things which they argue are the main factors driving our economic interactions.\n Ironically, the Austrian School of Economics, while it still believes in the laws of free market economics, has rejected this precision, and refuses to make mathematical predictions. Instead, they claim that the results predicted by their theory always take place, even if the actual results—warped by things not covered by their theories—are radically different from their predictions, or even their exact opposite.\n In fact, some—like Hans-Hermann Hoppe, borrowing a page from Immanuel Kant—go so far as to argue that their conclusions can not be disproven by any awkward failure of reality to match their predictions. They are a logical conclusion of a logical system, and thus are true, whether they actually describe what happens or not. Hoppe goes so far as to argue that the same is true of socialism, and that both systems are immune from any empirical attempts to disprove them.\n Which is about as far from the mathematical certainties of psychohistory as it is possible to get.\n Looking closely at all these theories, one finds that they are controversial at best and bear little resemblance to Hari Seldon’s work.\n By the early part of the 20th century, for example, an important Marxist theorist like Antonio Gramsci could reject the notion that history led inevitably to the proletarian state. By then, it was obvious that capitalism wasn’t about to turn into socialism anytime soon. So, following Gramsci’s lead, Marxists became far more interested in cultural issues. One noted socialist scholar, Theodor Adorno, actually tried to fuse Marxism with some of Spengler’s insights, shorn of most of their determinism. It seems at best an unlikely combination, one that Marx would never have approved.\n It should also be noted that, despite the many similarities between the three cyclic theories, they are also enormously different, enough so that they can’t be seen as different approaches to the same basic “laws” of history. While it was inevitable that Spengler’s amateur status would lead other historians to reject his work, even Toynbee, who was a professor of modern Greek and Byzantine history, encountered a great deal of opposition from his fellow historians. All three men routinely faced accusations of poor scholarship, dubious conclusions, and even twisting the facts to fit neatly into their preconceived categories. Nor has time been kind to their reputations. All three have been largely forgotten, their work rarely cited by other historians, and the entire idea of comparative history ignored except by a few modern scholars like Harold Adams Innis and Samuel Huntington.\n There is even a real-world discipline that calls itself psychohistory, although it bears little resemblance to Hari Seldon’s version.\n In the real world, psychohistory is an attempt to apply psychology to history, to gain a greater understanding of what caused past events. It tends to focus on issues related to childhood—and most notably, questions of incest and other forms of sexual abuse. Some psychohistorians hope that by perfecting our methods of rearing children, we might eliminate war and international hatreds. This is about as close to Asimov as it gets.\n Psychohistory has never quite emerged from its academic shantytown and remains controversial. There are no departments of psychohistory, even if a few colleges do have courses in it. Many of their fellow historians have questioned their vast grab-bag of assorted methods and think that their reconstructions of past historical figures involve a lot of guesswork. Others question whether it should be considered a separate discipline at all, as mainstream historians have long attempted to explore psychological motivations.\n One aspect of the real psychohistory, however, points in a very different direction—towards a forgotten understanding of history that might have more bearing on Hari Seldon’s story than Marx, Spengler, Toynbee, or Sorokin. For it does not always look at mass psychology, and cultural analysis, but it also attempts to understand the psychological motivations of historic individuals.\n While the image of history as an ever upward, evolutionary process may have been the orthodox belief at the time of Spengler, it had itself replaced an even older view. Rather than seeing history in terms of sweeping trends, this older view held that it was the choices made by individuals which have shaped history. It is a view which has never quite died, finding support at the time from a number of mostly Catholic scholars, notably Christopher Dawson, Hilaire Belloc, and Sir Herbert Butterfield.\n Despite all of Hari Seldon’s talk of grand historical trends and mathematical predictions, the irony is that the new future he crafts is ultimately the result of the actions of a single man: Hari Seldon.\n It is his refinement of the science of psychohistory, his predictions, his establishment of the Seldon institute, and the shadowy Second Institute that reshape history. Even though he may have made his choices based on mathematical models, they are still his choices. Without them, the history of the galaxy would have looked quite different.\n Whether or not Isaac Asimov believed that psychohistory was possible, the story of Hari Seldon is not of one of randomness and blind forces, determinism, and the laws of science, but of a single remarkable man whose actions reshape the history of the galaxy.\n One does have to wonder, however, if Dr. Asimov ever noticed this.\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}