{"fingerprint": "IK2ulg6J/3Whusv7Gyx2JnR6dwI=", "sitename": "Clarkesworld Magazine", "title": "A Sympathy of Light and Shadow: Science Fiction, Gothic Horror and How They Met by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_03_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Sympathy of Light and Shadow: Science Fiction, Gothic Horror and How They Met by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nA Sympathy of Light and Shadow: Science Fiction, Gothic Horror and How They Met\nThe decade started well enough.\nWe boldly set out into the stars, confident we could conquer every peril. We faced unknown hazards, unexpected consequences of our own actions, beings vastly more powerful than us, and even the darkest corners of our own psyche. Yet we knew the universe would open all its secrets to us.\nBut then the darkness came. Evil creatures of the night fell upon us. Terrible things stirred in the depths of the earth. Graves burst open, releasing madness, plague and all the monsters of the dead past.\n. . . And then the audience bought their popcorn and watched Vincent Price and Christopher Lee, forgetting the aliens, spaceships and distant worlds they’d flocked to see only a few years earlier.\nPublic taste is notoriously fickle. Nor is it ever easy to explain why it changed. What is certain is that when Hammer films released The Curse of Frankenstein in 1957, it proved so successful that other studios rushed to get their own Gothics into the theaters. The fifties SF boom had already peaked—its audience had grown far more discerning, demanding better effects and writing. Many of those who had churned out low budget SF in the Fifties turned to Gothic horror in the Sixties.\nIt is also clear that these two competing cinematic visions were very different: one bright, clean and evenly-lit; the other shadowy and expressionistic with garish splashes of color: one looking towards the future; the other haunted by the past: one rational even in the face of the unknown; the other feverish and demon-haunted, with madness lurking in the dark.\nWhich makes it even stranger that a few filmmakers tried to combine the two.\nIt isn’t as if SF hadn’t appeared in Gothic fiction before.\nSome call Frankenstein science fiction, although a lot of people disagree: the novel spends little time on the creation of the monster, focusing instead on its consequences. A few versions put the SF into clearer focus—as in James Whale’s bravura 1931 creation scene (suspiciously similar to the demonstrations of real-life “mad scientist” Nicola Tesla) but even his sequel, The Bride of Frankenstein, mixes in the supernatural.\nEdward Bulwer-Lytton wrote about underground races living in the hollow earth; Jules Verne’s one Gothic story throws in a device that records and plays back images; and H.P. Lovecraft’s stories offer a more satisfying mix, with ancient aliens, brains in tanks and even fish-men.\nWhich doesn’t change the fact that the mere notion of Gothic SF suggests the mad jumble of clichés in Plan 9 from Outer Space.\nIt was probably inevitable that someone would try to film Lovecraft in an age of Gothic horror films. While he arrived far too late to qualify as Gothic, his stories are filled with enough ancient secrets, crumbling manors and irrational terrors for five Gothic authors. In 1963, Roger Corman made the first attempt with a version of The Case of Charles Dexter Ward.\nCorman convinced AIP to fund a series of color Edgar Allan Poe movies with higher budgets than they’d given him before (which admittedly wasn’t much). The final products, thanks to Corman’s gift for working within a tight budget, look very much like the Hammer films he is ripping off.\nAfter making the first five, though, he wanted a break. AIP disagreed: they’d turned their Poe films into a recognizable brand and didn‘t want to risk making a film by another, lesser-known author. They insisted that he borrow the title of a minor poem, The Haunted Palace, and bill it as yet another Poe film (Vincent Price reads a snatch of it at the end, which is Poe’s only contribution).\nCharles Dexter Ward returns to his ancestral home, Arkham, and finds the town haunted by the monstrous mutations caused by a curse left on it by his ancestor, Joseph Curwen (also Price). Curwen’s spirit takes over Ward’s body, and takes up where he left off with his experiments with the monstrous creature in a pit under the house. It is a decidedly Lovecraftian elder god, and there are the expected references to the Necronomicon, Yog-Sothoth and Cthulhu.\nUnfortunately, when we finally glimpse the creature, instead of an unspeakable alien monstrosity it looks like the Creature from the Black Lagoon with an extra pair of arms (one suspects a Paul Blaisdell creation leftover from one of Corman’s SF films).\nTwo years later, AIP made the first movie that openly admitted to being a Lovecraft film, Die, Monster, Die! Based on The Colour Out of Space—a rather slight story about a meteor that crashes to earth on a distant farm—it is far more SF than its predecessor. Unfortunately it also has little to do with the original. In the story, the meteor carries a “colour” not part of our spectrum, which corrupts the land around it in an unthinkable way. Here it becomes merely radioactive. An aging Boris Karloff plays a wheelchair-bound scientist who wants to use the power of the meteorite to grow better vegetables. Unfortunately, it has all the usual effects we associate with radiation (well, at least in the movies . . . ): killer plants, people reduced to dust, and glowing, axe-wielding maniacs.\nDespite its modern setting, the film does manage to create a Gothic mood. Unfortunately, it has little to do with Lovecraft.\nLovecraft has fared poorly in the theaters. The earliest attempts all tried to cram his stories into Corman’s Poe framework. Stuart Gordon’s 1985 splatter comedy Re-Animator, the most successful adaptation to date, broke the formula. It has little in common with his work, however, and was based on a series of short-shorts that Lovecraft himself disdained. Its success, unfortunately, meant that most Lovecraft films after it have been excuses for throwing gore at the screen.\nPerhaps the best Lovecraft films to date have been the HPLHS’s The Call of Cthulhu (2005) and The Whisperer in Darkness (2011). While remaining remarkably faithful to the original stories, they offer a heady mix of SF and horror: The Whisperer in Darkness even adds an aerial duel between a biplane and a swarm of mechanized alien creatures. However neither film much resembles Hammer’s Gothics. Instead they look to the Expressionist silent films, and to King Kong and Universal’s horror films from the Forties, respectively, for their inspirations.\nBy the late Sixties, the Gothic craze was already fading, with a wave of more realistic horrors (like Rosemary’s Baby) ready to take their place. Hammer responded with more blood and more bare flesh (and a number of oddities, like the first Kung Fu Dracula movie). For some reason, though, despite the great SF films they’d made in the fifties, Hammer never tried adding SF to their Gothic horrors. However, they did bring more than a touch of the Gothic to their version of Nigel Kneale’s SF classic, Quatermass and the Pit (1967).\nThe Seventies, however, brought a number of hybrid Gothics, although most of them would be classified as horror rather than true SF. In The Asphyx (1972), Sir Hugo Cunningham, a Victorian era scientist fascinated by the question of life after death, has uncovered something strange in the photos of people taken at the moments of their deaths. He believes it to be the Asphyx, a creature from Greek mythology, which carries away the souls of the dying. His experiments uncover a way to trap an Asphyx, which would allow him make people immortal. He then sets out on a series of gruesome experiments, intended to make himself and his family immortal. Of course the results prove catastrophic.\nIt is a beautifully mounted film that looks and feels like something Hammer might have made. At its heart, it is an inversion of the Frankenstein myth, with the scientific hero trying to unlock not the secrets of life but of death.\nIn 1973, a team of modern-day scientists and psychics led by physicist Lionel Barrett attempted to conquer the “Mount Everest of haunted houses” in The Legend of Hell House, a harrowing film with a script by Richard Mattheson. Barrett has built a machine to end the haunting by eliminating the unfocused electromagnetic force he believes to be the cause of ghostly activity. Not that it works, of course.\nIt is one of those films that successfully combines a lot of disparate elements, from its Gothic setting to the scientific effort to lay the ghosts, to the sexual tensions within the group. It is intriguing to note that while the preternatural succeeds where rationalism fails, science does seem to have the last word.\nHorror Express, a 1972 British/Spanish co-production offered a far more successful blend of Gothic and SF, one that could easily be classed as either. Despite its miniscule budget, poor sound engineering and grainy film, it catches a lot of the spirit of Hammer’s horror films, thanks in part to horror icons Christopher Lee and Peter Cushing (and to the set and models borrowed from a more expensive film).\nDespite the Victorian setting, the film borrowed heavily from Quatermass and the Pit: as in the Hammer classic it is an archaeological dig investigating man’s evolutionary origins that releases the alien menace, and the ending where those killed by the body-hopping alien rise up to attack the survivors parallels the madness that overwhelms London in the earlier film. As in any Quatermass film, it is science that discovers the truth and helps defeat the alien. The images they find floating in an apeman’s intraocular fluid are, however, mind-bogglingly absurd.\nOne might conclude from most of these that the two visions of speculative cinema can only be combined with indifferent results. And yet someone did produce a number of very successful hybrids.\nThe long running BBC TV series Doctor Who had borrowed from Hammer’s Quatermass films almost from its beginnings, so it doesn’t seem much of a leap for them to look to Hammer’s Gothic horror films for inspiration, as in 1971’s “The Daemons” which involves a cult and an ancient demonic alien hidden beneath an old church.\nBut, when Philip Hinchcliffe took over as producer in 1974, he and his script editor, legendary Who writer Robert Holmes, deliberately brought Tom Baker’s Doctor into the world of the Gothic, both here on Earth and out in the stars, creating some of the show’s best serials in the process: “Pyramids of Mars” bears a striking visual resemblance to Hammer’s version of The Mummy with a healthy dash of Erich von Däniken; “The Brain of Morbius,” while set on an alien planet, draws heavily from the more visceral Hammer Frankenstein films (with just a hint of She); and the Renaissance setting of “The Masque of Mandragora” calls to mind Corman’s Poe films.\nThe final serial of Hinchcliffe’s run, 1977’s “The Talons of Weng-Chiang” might best be described as the sort of film Hammer wanted to make, with its Victorian Gothic setting and phantasmorgical mixture of period references. It seamlessly combines Sherlock Holmes, Fu Manchu, the Phantom of the Opera, Victorian music halls, giant rats, a time traveling war criminal and a living ventriloquist dummy (leaving Robert Holmes exhausted by the time he finished writing it).\nThe Gothic still influenced the next season, with “The Horror of Fang Rock,” a haunted lighthouse story redolent of William Hope Hodgson’s sea stories; and “Image of the Fendahl,” which strongly resembles The Legend of Hell House, only with a Lovecraftian alien and yet another prehistoric human skull.\nHowever, an unproduced story from the Hinchcliffe era, “State of Decay,” resurfaced in 1980. On an alien planet that is a dead ringer for the eastern Europe of Hammer’s Dracula movies, the Doctor encounters the last of a monstrous race of space vampires beneath a castle which is really a spaceship.\nOne of the better efforts, however, marked Roger Corman’s return to directing after an absence of nearly 20 years.\nFrankenstein Unbound (1990), based on the novel by Brian Aldiss, starts in the near future, where Dr. Joe Buchanan has developed a weapon which completely obliterates its targets with (supposedly) no harmful effects to anything else. However, a routine test opens up a rift in the time space continuum and Buchanan gets sucked in along with his high-tech car.\nHe ends up in Switzerland in 1817 where he encounters Mary Shelly not long before she writes Frankenstein. But it turns out that Frankenstein is a real person, and his monster is real as well.\nFrankenstein Unbound didn’t do well at the box office, nor have the critics been kind to it. Which is a shame as it is one of those B-movies which delights in its “B” status, offering both pulpy thrills and a fairly serious exploration of the Frankenstein theme.\nBy the mid-Seventies Hammer Films was in ruins (although they would continue making TV shows into the Eighties). The Gothic craze died with them.\nDespite intermittent attempts to revive it, Gothic horror is still as dead as Frankenstein’s bride, with many recent attempts—like Van Helsing or I, Frankenstein—little more than action films with a little atmosphere.\nOne could argue that it left its mark on some of the darker SF films—certainly Alien (1979) has strong parallels to the Gothic, with the wrecked alien ship taking the place of a haunted castle and a more visceral notion of possession and contamination by evil. Don Coscarelli’s unclassifiable Phantasm (1979) has its share of both SF and Gothic horror but can hardly be said to be either. Or much of anything else anyone ever dreamed up before.\nCuriously, the Warhammer 40,000 RPG—and its cinematic spinoff, Ultramarines (2010)—is literally Gothic, with crumbling Gothic fortresses and even spaceships like Gothic cathedrals. One could even note other familiar elements, such as their demonic enemies and the danger of being corrupted by the “warp.” But at its heart, Ultramarines is a World War II movie writ large.\nPerhaps the most promising new film is Death (a.k.a., After Death) (2012), which has been described as a combination of Gothic horror and Steampunk, although the trailers suggest something rather odder than that.\nIn film, image is everything. A detailed, well-researched SF world can work well on screen, but it always remains tempting to cheat a little for one perfect image. The visual language a film uses has a great effect on our emotional reaction to what we see on screen, creating mood and atmosphere, and sometimes even acting as a “character” in the story. Most familiar film genres, such as Film Noir or Expressionism are primarily visual categories, whose typical storylines and plots both use and reinforce the genre’s visual moods.\nNowhere is this clearer than in some of the better attempts to fuse elements of the Gothic and SF.\nIt might be tempting to write them off as nothing more than a curiosity, an odd mixture of reason and madness, but the reality is that the Gothic can help explore some of the darker corners of SF. There are stories—often, yes, pulpy, B-movie stories—that cannot be told on screen any other way, dark musings on our own frustrating inability to understand what we still believe to be a rational universe. In particular, Lovecraft demands such treatment.\nWhether or not anyone will once again explore the possibilities of Gothic SF is uncertain. One can only hope. In an age when it is easier than ever before for independent film makers to create unique films, perhaps they will once again brave shadows and barely-repressed terrors, ancient curses and horrors from before time to offer us a vision of SF that could not be told any other way.\nAnd you never know: if they hurry, Christopher Lee might still be available.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}