{"fingerprint": "zp+me9l/4wUMem1Deiq4Cf2fYxw=", "sitename": "Clarkesworld Magazine", "title": "The Five Rules of Supernova Surfing or A For Real Solution to the Fermi Paradox, Bro by Geoffrey W. Cole", "author": "Geoffrey W Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_01_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Five Rules of Supernova Surfing or A For Real Solution to the Fermi Paradox, Bro by Geoffrey W. Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6160 words, short story\n The Five Rules of Supernova Surfing or A For Real Solution to the Fermi Paradox, Bro\n First rule of supernova surfing: timing is everything.\n A lightyear out from the dying red supergiant, Reef put on the music. Hundreds of semi-sentient AIs sprang to life at the back of the 2025 VW Microbus and began to strum, tickle, blow, and stomp the virtual instruments he had laid out for them. Metallic bossa nova with a thrumming beat flooded the cabin of the simulated camper van that Reef and his best pal Ka-10-8 called home on the jaunts between stars. Reef fiddled with the dial on the dash of the Microbus, adjusting their synced chronoperception, but before he had it quite right, Ka-10-8 jumped out the passenger door.\n “Hey!” he shouted, as Ka-10-8 accelerated ahead of him on their slick monoboard. “I get first ride. That’s the deal.”\n Reef dropped the Microbus simulation and hit the gas on his swallow tail surfboard. Both he and Ka-10-8 wore chrome versions of their original biological bodies upgraded with rad-shielding, antimatter rockets, enough computing power to run an interstellar economy, and killer sunglasses.\n “Nah, brah,” Ka-10-8 said. “I’m done with you riding first at every break.”\n Ka-10-8 waggled their head stalks in the bigoat equivalent of an upraised middle finger as they tried to drop in on Reef. Reflexes kicked him out of Ka-10-8’s exhaust plume. The musicians, now playing in a large corner of Reef’s mind, didn’t miss a beat. The maneuver cost Ka-10-8 some delta-v, and that was enough for Reef to blast past the bigoat. Now the old star was his.\n Their models figured the red supergiant would go boom in eleven years and fourteen days, real time, but real time was for suckers. Reef, Ka-10-8, and the orchestra had synced their internal chronoperception to run on a sliding scale averaging one second perceived to one million real. The eleven years and fourteen days until the boom would feel like little more than five adrenaline-soaked minutes.\n “Why so aggro, K?” Reef said. “If we can’t abide by the rules we set for ourselves, we’re no better than a barney.”\n Reef sucked up reaction mass as he dropped. They would dive in close to the dying star, pick up speed by slingshotting around her, then burn hard on the other side. If you want to catch the shockwave of a supernova, you have to haul ass.\n “You won on a technicality,” Ka-10-8 said. “I been cool about it long enough, but I’m done. Time I got a first ride.”\n “Hardly a technicality,” Reef said. His memory of the day of the wager was a little foggy, he would admit that, but he wasn’t about to enter into a parlay now. “Brah, we’ve got the most gnar of all tubulars ahead of us and a unique piece of aural perfection to ride it to. We can sort this out later.”\n “That’s just it,” Ka-10-8 said. “I don’t think we can sort this out later.”\n Before Reef had a chance to ask what they meant, the red supergiant imploded nine years and fourth months ahead of schedule. The orchestra quit their song as they semi-sentiently realized their fate. Even in real time it happened fast, and as Reef and Ka-10-8 dropped down to real time to try to deal with the explosion, time ended in a wall of incandescent plasma.\n Second rule of supernova surfing: back up before your drop.\n A real time year later, Reef and Ka-10-8’s minds booted from the backups they had left inside a rocky planetoid a few light hours out from the boom that went bust. Nano-assemblers worked hard to churn the native rock into the computronium and other advanced materials of which their bodies were made, so they sent a pair of avatars to the Après Lounge to chill until they were ready to hit the road.\n “Closed out early again, didn’t it?” Reef said.\n Ka-10-8 grunted as they walked over to the bar. Reef followed. The image of the supernova was the last thing beamed to his waiting backup, and it filled his mind now: a gilded wall of cosmic fury ready to devour him. So harsh. The semi-sentient waiter behind the tiki bar was already working on their standard post-supernova wipeout refreshments: a wafting bowl for Ka-10-8 and a mai tai for Reef. After a sip of the perfect beverage, Reef could tolerate the simulated view, where the gaseous filaments of the traitorous supernova remnant expanded above the palm-thatched lanai.\n “What’s that,” Reef said. “Three supernovers in a row that blew before we could hop on?”\n Ka-10-8 held the wafting bowl in the mouth of one head-lobe, while sniffing at the fumes it released with the other. “Nine,” they said. “If I’m counting right.”\n Ka-10-8 wasn’t counting right. Reef and Ka-10-8 had successfully surfed thousands of supernovae in their time, but in the past forty-four million years, they had attempted to surf twenty-five supernovae, and all but one of them exploded earlier than their models predicted.\n “I think we gotta recalibrate our models, broski,” Reef said.\n Ka-10-8 climbed into the salt-water hot tub.\n “Problem’s not with our models,” they said. “Problem’s with the universe. We been riding too long.”\n “It’s only been a few thousand years,” Reef said, climbing into the warm water beside his oldest pal. Though everything in the Après was virtual, the water soothed the artificial aches in his imaginary body.\n “Have a look out there,” Ka-10-8 said. “See any other galaxies?”\n Reef took off his sunglasses. The view from the Après showed what the sensors they’d left scattered across the surface of the planetoid were seeing: stars, mostly old red gals like the one that had recently annihilated them, and a few black holes, but beyond that, nothing. The ever-present billions of other galaxies that usually filled the night sky were gone. In particular, the Lateria, the super-galaxy that had once been the Milky Way that they both called home, was nowhere to be seen. The waters of the tub couldn’t do anything about the chill that shivered through him.\n “Brah, you’re fuckering with the Après simulation, right?”\n “Only fuckery around here is the fact that you’ve had first rides on false pretenses. The deal was whoever won the competition got first rides for life.”\n “And you bailed on every wave,” Reef said. “So I get first rides. I can’t believe we’re still arguing about this.”\n “Don’t quite know what you remember, but it doesn’t matter if you bail. I landed a Flynnstone Flip on a twenty-five footer. Judges robbed me is what happened. Basing a lifelong wager on crooked judges is a crime, especially for lives as long as ours.”\n “Think you’re missing the important part here: the galaxies are gonzo. Might that be why the supernovers are misbehaving?”\n Ka-10-8 bowed their head lobes in the bigoat approximation of a shrug. “All I know is, before we run out of supernovers, I want a first ride.”\n Reef sank into the hot tub, still staring up at the empty sky. “Run out? Brah, what are we gonna do?”\n “I think there’s only one thing we can do.”\n The two ancient artificial intelligences spoke in unison: “We gotta call Mom.”\n Third rule of supernova surfing: tell someone when you’ll be home.\n Last time Reef checked messages from Mom must have been a couple billion years earlier, because there sure were a lot of them. He’d been sending her updates, mostly memory-packs of their most bodacious rides, but hadn’t bothered checking her responses in ages. Usually she made little notes like “looks awesome, hon” or “be careful out there” but the messages that had accumulated recently had a decidedly different tone. The latest, from a couple million years ago, read: This is the end of the universe, kiddos. Boot me. The note came with a giant data packet that must have been a full copy of dear old Mom.\n Mom appeared in a long white robe over a body Reef always thought of as elephantish. She didn’t have tusks, but the trunk-like appendage that hung off the front of her massive head always made him expect her to trumpet.\n “It’s about damn time,” she said as she solidified. “I’ve been trying to get through to you two for billennia!”\n “Thank Jah you’re here, Mom,” Reef said. “There’s something wrong with the supernovers.”\n “Get in the tub,” Ka-10-8 said. “We need you to settle a dispute for us.”\n Mom climbed in, sending a torrent of hot brine sloshing across the polished wood floors. “Neither of you have any idea, do you?”\n “We haven’t caught a break in weeks,” Reef said. “And now the galaxies are gonzo.”\n “The day we upraised Reef, he and I made a bet,” Ka-10-8 said. “You gotta help us put this to bed, once and for all.”\n “That can wait,” Reef said. “The supernovers, Mom? Why they breaking early?”\n “Kids,” Mom said.\n “It can’t wait,” Ka-10-8 said. “I’m done riding your sloppy seconds.”\n “Kids.”\n “There aren’t gonna be any more breaks until we know what’s wrong with the stars.”\n “Kids!”\n Reef and Ka-10-8 shrank back before her intensity.\n “Sorry, Ma,” Ka-10-8 said. “We didn’t even ask you about your trip.”\n “Or offer you any refreshments.”\n Reef snapped his fingers and the waiter appeared with a tray of green powders.\n Mom snorted a line, closed her eyes, and settled back into the tub. “When I upraised you both, I gave you brains complex enough to simulate a planet. Now you’re telling me simple astrophysics and remembering the day we upraised Reef are beyond your capabilities?”\n “Wouldn’t call predicting supernovers simple,” Reef said into the bubbling brine.\n “Memory faults can happen to anyone,” Ka-10-8 said in the same petulant tone.\n “You’re both still running simulated organic states, aren’t you?”\n “Simulated what now?” Ka-10-8 said.\n Mom shook her trunk in dismay. “Years before you left what was then called the Milky Way, you both decided that digital cognition was, and I quote, ‘too heavy, Betty,’ and that you’d programmed your minds to work like your original biological brains. Does that ring a bell?”\n “In a chowdery way, yeah,” Reef said. He had vague memories of having perfect memory. “Living with a metal brain was a drag. Everything perfect and crystal clear and awful.”\n “The memory of surfing a wave shouldn’t be as good as the real thing.”\n “Totes!” Reef said. “So we like set our brains back to their original specs.”\n Mom pressed her trunk to the top of her head in a gesture of exasperation they both knew well. “How long have you two been out surfing?”\n “Couple thousand years?” Reef said.\n “Four billion,” Ka-10-8 said. “Max.”\n “It’s been over one hundred and forty-five billion years since you left the Milky Way,” Mom said.\n The hot tub burbled and splorked into the silence that followed Mom’s declaration.\n “That can’t be right,” Reef said.\n “You sure?” Ka-10-8 said.\n “Top up your refreshments,” Mom said. “You’re going to need them.”\n The waiter carried over a fresh mai tai and wafting bowl. While the two of them imbibed, Mom laid out their fate. They had been chasing supernovae around the universe for years, jumping from galaxy to galaxy to hunt the increasingly rare cosmic phenomenon. Though the trip from one galaxy to the next only felt like twenty minutes of cruising in the Microbus, those trips were getting longer and longer, with some journeys taking billions of years between more distant galaxies. Messing about in a galaxy as they traveled from one supernova site to another could take billions of years too, all of which they experienced as a diversion of only a few minutes.\n “The two of you have been eating time like ham sandwiches,” Mom said.\n “Easy on the ham-talk, Hodad,” Ka-10-8 said. “We’re vegans.”\n “The point is the universe is out of ham,” Mom said. “Whether you want to eat it or not.”\n “I’m confused,” Reef said. “Is ham a metaphor for supernovers?”\n Mom trumpeted in frustration. “The ham is everything. Time, stars, supernovae, you name it, the universe is running out of it. The universe has been expanding the whole time you’ve been traveling. That’s why you can’t see any other galaxies, they are just too far away.”\n “So the universe got so big,” Ka-10-8 said, “That it got smaller?”\n Mom took a calming snort. “The two of you have been surfing for so long that you can never travel back to the Lateria. You are on your own for the end of the universe.” She offered her powder tray to Reef and Ka-10-8. They both took a snort. “Thankfully, while you two were engaged in pleasant diversions, the best minds in the universe have been working on a solution.”\n “Sick!” Reef said. “So they’ve got what, a cosmological reset button we can push or something?”\n “Or Something,” Mom said. Her trunk flickered out of existence for a moment before resolidifying.\n “Woah,” Ka-10-8 said.\n “You okay, Mom?”\n Her avatar stabilized. “Sorry, kids. I didn’t send a full self with this message. I’m a little glitchy.”\n “The data pack was huge.” Ka-10-8 said.\n “That’s the Or Something. I’m a single-use Mom.”\n “Single use?” Reef said. He didn’t like the sound of that.\n “But you brought your memories, right?” Ka-10-8 said. “You can remember our bet?”\n “That was the day we adopted Reef,” she said. “I don’t go out for coffee without bringing it along. But before we get to that, we need to talk about the Or Something, and the two of you need to stop wasting time.” She summoned a new mai tai and wafting bowl. “As we are currently sitting in one, I assume you two understand the idea of fully immersive environmental simulation?” Reef and Ka-10-8 flashed shakas. “The Or Something simulates the entire universe. Once you have it up and running, the two of you can upload yourselves to it and continue surfing supernovae to your heart’s content.”\n Reef punched the air in joy, spilling his mai tai into the hot tub. Ka-10-8 swung their head lobes in lazy circles. But something Mom had said struck Reef mid-celebration, and he sank into the brine. “Back up, Ma. These supernovers, they aren’t going to be real?”\n “They’ll feel as real as your hot tub,” she said. “The Or Something runs at subfermion fidelity.”\n “And that’s good?” Ka-10-8 said.\n “Kiddos, it’s gnarls,” Mom said. “But before we get into just how gnarly it is, we need to talk about how to run it. The two of you need to find a young, stable red dwarf, park around it, build a ‘brane, and hang there for the next hundred trillion years. After that, things get sketchy. Please listen very carefully to this next bit.”\n That’s where Reef stopped listening. With the virtual mai tais warming up his mind, he dreamed of supernovae. That moment when they erupt behind you, the cloud of hot gas rushing up like the fist of a dying titan, laying on the last of the burn, the impact as the shockwave catches the board, those brief seconds when you’re either going to end up as atomized space junk or a golden god, then the ride. A whole new universe full of them.\n “So gnarly,” Reef said.\n “I take it that means you understand?” Mom said.\n Reef looked over at Ka-10-8, who also had that glassy look in their eyes. “It’s all in the ReadMe, right?”\n Mom eyed them from either side of her trunk. “So long as you promise to crack the ReadMe the moment you hit the road.”\n “We got it, Ma,” Ka-10-8 said. “Now enough of this simulation talk. You said you remember the details of our wager. I gotta know what went down that day.”\n Mom settled back into the tub. “Sure about that, Lazy K? Part of the heaviness you two wanted to dodge was the day we raised Reef.”\n “We’re one hundred and fifty billion years old,” Ka-10-8 said. “I think we can take it.”\n Mom took a long snort of fluorescing powder. “Let’s go for a ride.”\n Third and a half rule of supernova surfing: expect flashbacks.\n The sun wasn’t even close to exploding. Reef, Ka-10-8, and Mom floated above the rolling blue Pacific Ocean, invisible ghosts haunting their own past. On the water, surfers lined up for the massive waves rolling toward the crowded Ehukai Beach on the North Shore of Oahu.\n “Total blast from the past,” Reef said. “This is the Pipeline comp, isn’t it?”\n “2046,” Mom said. “We happened to be swinging by when Ka-10-8 heard about the competition. There they are.”\n The Ka-10-8 of one hundred and fifty billion years ago wore a human body that bobbed on their board in the lineup beside the original Reef.\n “Mom,” Ka-10-8 said. “How did you let me out looking like that?”\n “This was precontact,” Mom said. “You really wanted to enter the comp, so we made you something that would fit in. Now stick your POVs to those fine young bodies, see if this will jog a memory.”\n Mom pushed Reef and Ka-10-8 into their younger selves, and Reef’s perceptions shifted. He floated on the waves in his original body. White zinc sunscreen was smeared across the human Ka-10-8’s sunburnt cheeks, and they laughed at something he’d said.\n “You’re pretty cocky for a human,” Ka-10-8 said.\n “What you expecting, a shark?” As Reef’s young body said the words, he remembered saying them.\n “I’m expecting to win.”\n “Last set of the heat. Gotta give it all on this one.”\n The surfer ahead of Reef dropped onto a massive wave; he was next.\n “Tell you what,” Ka-10-8 said. “Whoever wins this thing gets first rides next time we ride together.”\n Memory flooded back across one hundred and fifty billion years. Reef had been so excited to think this rad new rider wanted to surf with him again. “Got yourself a deal, bro.”\n Ka-10-8 and Reef bumped fists, then Reef paddled into the next wave. He was a little late on the drop, and he remembered how disappointed he felt. He was shanking it. The surfer with the dorky zinc on their cheeks would never want to surf with him again.\n He rode out of the wave and sat down on his board to watch Ka-10-8 surf. Their wave was huge, at least twenty-seven feet, and they dropped no problem, cutting across the wall of ocean as if they’d been born to do it. Then they caught their nose and it all went wrong. Ka-10-8 fell, arms pinwheeling, and the wave thundered down on top of them.\n Reef paddled without thinking. He’d been hammered at Ehukai before. The reef was the ocean’s open mouth, full of coral teeth, and it could chew you to pieces. He ducked under the wash, saw Ka rolling unconscious above the coral, blood seeping from a gash on their head. He wrapped one arm around their chest and hauled them back to the surface.\n A rescue jet ski towed them back to the beach, where a tall woman in a long white sarong ran into the chop to help Reef with Ka.\n “Oh Lazy K,” Mom said. “Are you alright?”\n Ka-10-8 puked up half the Pacific, then seemed to feel better. “This mean I lost the bet?”\n “Let’s check the scores.”\n Forty-four surfers had come to Ehukai for the big wave event. Based on their performance that day, the judges had placed Reef forty-third and Ka-10-8 forty-fourth, separated only by a tenth of a point. Reef relived the outrage he’d forgotten long ago. Sure, they’d both had a few rough rides, but to place dead last? Even Mom agreed there had to be some mistake.\n “Tell you what,” Reef said. “Let’s go back to my van, hit the bong, and think this through. There’s gotta be something we can do.”\n Twelve hours later, Reef and Ka-10-8 were still sitting in his Microbus. Dozens of empty beer cans littered the footwells, and four pizza boxes, each delivered to “The Accessible Parking Space at Ehukai Beech” at various intervals throughout the night, sat empty on the dash. Mom snored on the mattress at the back of the bus\n “I don’t care what anyone says,” Reef said, trying to fill the bowl of the bong, but succeeding only in littering his bus with Big Island kush. “You are like one of the top four surfers I’ve ever ridden with.”\n “Listen Reef,” Ka-10-8 said. “I think you should have first ride next time.”\n Reef shook his head and tried to light the empty bowl. “Nah, brah. We both stank. We gotta admit it.”\n Ka-10-8 was trying to stand inside the cramped bus and failing. “Forget the comp. Listen. I’m not talking water waves.” They rammed their head on the ceiling, cursed, and said: “I’m done with this thing.”\n Ka-10-8 unfolded. Their body shimmered and separated and reformed and Reef remembered thinking that the guys in Wailea must have added something special to his ganja because there was an alien in the bus beside him. Ka-10-8 was a stout quadruped covered in fur the color and consistency of a golden doodle’s. Two lobes about the size and shape of a hind arm protruded from their top of their barrel-shaped body, each with a smear of zinc above a wide slit Reef supposed was a nose, each with a shiny black membrane that might have been an eye and each with a gummy toothed opening that was definitely a mouth. Four legs protruded straight out from the sides of their body, reminding Reef of a crab.\n “Awesome,” was all Reef could muster.\n “Feeling’s mutual, bro,” Ka-10-8 said. “That’s why I want you to come with me.”\n “Come with you where?”\n “To, like, the stars and such.” They extended one head lobe to Reef. “You in?”\n Fourth rule of supernova surfing: make a contingency plan.\n Reef toweled the hot brine off his simulated body. He didn’t need the heat of the hot tub, an old warmth filled him from the memory Mom shared. You in? Ka-10-8 said. Reef had forgotten how happy those words had made him.\n “I been thinking, bro,” he said, turning to Ka-10-8 who was sitting on the edge of the tub, head lobes rubbing together in thought. “The contest, the wager that is, it wasn’t fair. You weren’t in your true bod. The results shouldn’t stand.”\n Ka-10-8 stepped out of the tub and shook themselves dry. “No, I had it wrongzo. First rides should be yours. You saved my life.”\n “Any bro would have done the same.”\n “As much as I hate to interrupt this heartwarming reconciliation,” Mom said, sheets of brine sluicing off her onto the floor of the Après. “You two need to get moving. I took the liberty of accelerating our synced chronoperception while we were tripping, and your new bodies are now ready for interstellar travel. Can we please take this to the hangar?”\n In a blink, they appeared at the base of the shaft they had cut into the surface of the planetoid. Their chrome bodies gleamed lifeless and perfect in the darkness of the cavern. Reef and Ka-10-8 stepped into their respective selves, but Mom stayed behind, a simulated figment on the polished stone.\n “Sure you can’t ride with us, Mom?” Ka-10-8 said.\n She shook her trunk in dismay. “You’ll need all the processing power you can muster to run the Or Something.” She kissed them both with the tip of her trunk. “Now get moving, and don’t make any unnecessary stops. The Or Something will take some time to get up and running, and time is no longer an asset you can waste.”\n They blew kisses as they started their antimatter reactors.\n “Love you, Mom!” Reef said.\n “Thanks for everything.”\n They shot out of the planetoid, twin bullets fired from a world-sized gun.\n Once the planetoid was but a small speck in the rearview behind them, Reef and Ka-10-8 appeared in the simulated VW Microbus. Both pretended they hadn’t been crying. The stable red mega-giant Mom had pointed them to was only a few lightyears away. At their current delta-v, they’d be there in just over twenty-five thousand years, so Reef adjusted the chronoperception dial to 1,000,000,000:1, turning the transit into a cool thirteen minutes.\n Reef summoned another semi-sentient orchestra, but the music wasn’t working for him. All these years, he’d been shoving in front of Ka-10-8 at every ride, but only now did he realize he might have been shoving them away.\n As Reef watched the old and dying stars go by, one of the subroutines always running in the back of his vast yet dim mind drew a shining yellow pentagram around a nearby star. It wasn’t that far off course, and would only add a couple hundred kiloyears to their journey. He adjusted the chronoperception dial to bring them down to parity.\n “See what I’m seeing, Ka?” he said.\n “Seeing it, brah, but Mom said we gotta get the Or Something set up pronto.”\n Real seconds ticked away between them.\n “It makes me kind of sick to think how I’ve been hogging first rides for so long. I gotta make it right before we start this new thing.”\n “Bro, it’s okay. I owe it to you. I should have been happy every time you caught a break ahead of me.”\n Reef cut off the music. “You don’t owe me anything, Ka. You gave me this life, and through it all, you’ve been the best partner any dude could ever hope for. I lost sight of that. I want you to have the last real first ride of our lives.”\n “That’s, like, the super-raddest thing you’ve ever said to me, but I really think we should heed Mom’s advice, bro.”\n “Four hundo thouso real time years, that’s all we’re talking about. Come on, Ka. We’ll even simulate judges for it, like the Ehukai big wave comp. A proper do-over.”\n “Then we unfold the Or Something?”\n “It’s a deal, bro, let’s shred.”\n Reef changed course while Ka-10-8 spun the chronoperception dial and soon they were burning for the dying star. Two lightyears away, it exploded. Ka-10-8 wanted to burn for the next red mega-giant to set up the Or Something, but Reef found another star that was ready to go nova. This star was a little farther, almost two hundred thousand lightyears away on the other side of the galaxy, and they didn’t have the speed boost from the supe, so it would take a while to get there.\n “One last ride?” Reef said.\n “One last ride.”\n Reef summoned a digital bong and the two of them passed it back and forth as they made the transit. Halfway to their next target, it too went boom ahead of schedule, but Reef already had several more likely targets picked out, and Ka-10-8, a little bleary from the simulated dope, again agreed.\n The universe darkened as they cut across their terminal galaxy. Stars winked out without going nova, others exploded without warning. The distances between stars grew longer as the universe kept expanding, so Reef kept spinning the dial until they were cruising through a trillion years an hour. They got close enough to one supernova to climb out of the bus, but it blew a little late and barely accelerated them at one g. They dodged black holes and dim stellar remnants and discarded planets long-ago tossed away by their parent stars, the sensation like skiing slalom at the rate they perceived their transit. Reef kept packing the simulated bong with primo post-human kush along the way.\n One hundred trillion years later, Reef picked another target.\n “I have a good feeling about this one,” he said.\n “Bro,” Ka-10-8 said, staring at the few other distant and dim points of light. “There are only like nine other stars left. Think it’s time to get out the Or Something.”\n “This is for real the last one. Go with this good feeling, K. Please.”\n Ka-10-8 let out the whistling bigoat equivalent of a sigh. Reef pointed the bus toward the dying star and hit the gas. As they shot across the darkening void, the other nine stars winked out in the time it took Reef to open a bag of plantain chips. Ka-10-8 pressed their head lobes together in horror. Reef felt his simulated digestive tract turn to water. The only star left in the sky hung before them, a brilliant unstable giant, and before either of them could reach for the dial, it popped.\n “No, no, no,” Ka-10-8 said.\n “It’s okay, bro,” Reef said. “We’ll consult the ReadMe. Mom said everything we needed was in there.”\n “Mom said we had to set up the Or Something right away. We just ate one hundred trillion years for nothing.”\n “Hey, we both agreed it was a good idea.”\n Ka-10-8 threw the bong at Reef. Stinking water soaked his tank top and board shorts and dripped in grimy streaks down his sunglasses.\n “Good idea?” Ka-10-8 said. “Never mind supernovers, Reef. We’ve missed out on everything.”\n Ka-10-8 went rigid beside Reef. He tried to nudge them awake, then shouted in concern at their apparent comatoseness, and when they still didn’t answer, he dropped the Microbus simulation and stared across the cold dark vacuum to find this best friend floating chrome and unresponsive in the lightless universe.\n Fifth rule of supernova surfing: never surf alone.\n Every transmission Reef sent bounced off Ka-10-8’s chrome skin unanswered. He summoned a suite of diagnostic subroutines that confirmed his worst fears: Ka-10-8 was running on their own time, and they weren’t broadcasting a sync key. Ka-10-8 had shut him out.\n As Reef reeled from the realization, Ka-10-8 made a few course corrections. All he could do was follow, always a few beats behind. They flew away from the dimming supernova remnant. Black holes and brown dwarfs loomed where there had once been light. Here and there a flare of intense gamma lit up the darkness, but otherwise it was the ocean on a clouded night. A very old part of Reef’s brain couldn’t help thinking there might be sharks circling below.\n Ka-10-8 landed on a rocky planetoid that was cruising through the void. Reef had to circle back to make orbit around the cold rock, and by then Ka-10-8 was pushing the planetoid across the void toward a nearby black hole.\n During the transit, the planetoid began to change. Ka-10-8’s body spread across the surface, turning the dull rock into computronium. It took ages, but they had ages. Reef flipped through an old surf magazine while keeping an eye on the changes through the windshield of the Microbus.\n An hour and several million years later, the rock shed layers as it entered orbit around the black hole, like an abandoned wasp nest disintegrating in a hurricane. At first Reef thought the black hole was doing the ripping, but that wasn’t the case: Ka-10-8 was pushing all those little flecks of smart rock into a specific orbit.\n Soon the original rock was gone, dispersed into a great cloud around the black hole, and to Reef’s horror, so was Ka-10-8.\n “Ka,” Reef broadcast from his orbital position an AU further out. “Please. Don’t leave me all alone out here.”\n The answering signal was a life preserver. He clung to it, and accepted Ka-10-8’s request to join him in the simulated Microbus.\n “Jeeze, bro,” Ka-10-8 said as they materialized in the passenger seat. “It’s been seven hundred million years. Couldn’t you have cleaned up the place?”\n Empty bags of plantain chips and discarded beer cans filled the passenger footwell. Digital dope haze hung in the air so thick it could start raining THC at any moment.\n “I don’t do so well without you,” Reef said.\n “So summon a shrink. That’s what I did. And a yoga instructor. Did some sensory deprivation. A thousand-year silent retreat. Read the Big Bigoat Book of Living and Dying for Dummies a few times. A little self-improvement before moving to the new universe. How have you been using your last increments of this reality?”\n Reef held up a surf magazine. “I read about half of this.” Then he dropped it, and buried his head in his hands. “Who am I kidding? I only looked at the pictures.”\n The tears caught him off guard. He laid his head on the leather-tasseled steering wheel and bawled.\n “So you haven’t started work on your own Or Something?”\n Reef pointed to the surf magazine. “Just the pictures.” He tore open a bag of plantain chips, hesitated a moment, then offered them to Ka-10-8. “They’re the spicy kind.”\n They refused, so Reef left the open bag in the console.\n “Well if you had,” Ka-10-8 said. “You might be able to help figure out what to do with it.”\n “Could you, like, give me the laid man’s version?”\n Ka-10-8 tried to explain it to him. The Or Something was designed to be powered by the entire energetic output of a stable star. With that kind of power, it could run a snappy universe simulation down to what Mom had called subfermion resolution. But all they had to power the simulation was a black hole. Though the energetic output of the supermassive black hole at the center of their dying galaxy was significant, building a structure in its orbit would be too difficult, so they had to settle for a smaller, less energetic black hole. It still put out a good deal of energy in the form of X-rays, infrared light, and heat, but it didn’t compare to the energy output of a star.\n “It’s like trying to roast a veggie dog over a single match instead of a barbeque,” Ka-10-8 said.\n “That would take forever,” Reef said.\n “Exactly. Simulating one second of subfermion-resolution universe using a black hole as the power source will take years of real time processing power.” At Reef’s blank expression, Ka-10-8 said: “The point is we can’t go as high-resolution if we want the simulation to last for a good long time.”\n “So we gotta scale back?”\n “You gotta scale back,” Ka-10-8 said. “And so do I. When you get your Or Something up and running, you’ll have to decide what to leave and what to keep.”\n Reef reached across the Microbus and put a hand on each of Ka-10-8’s head lobes. “Ka, I don’t want another universe if it doesn’t have you in it.”\n They blinked in surprise at this, then shrugged him off. “Spent a lot of the last few millions years talking to my yoga instructor about you. About how we been living. I know we chose bio-brains because neither of us wanted to remember the fact that we came in last at Ehukai, but you ever think it was more than that?”\n Reef settled back into his seat. “I still don’t want to remember it. In fact, I kinda forgot again.”\n “We’ve been cruising through life, leaving all our troubles in the ashes of the last supernover, and getting high on the road to the next wave. That’s not really living, Reef.”\n “Says who?” Reef said. “Your semi-sentient yoga instructor? There’s nothing wrong with what we been doing. I should have let you ride first every now and then, I know that now, but that don’t mean we have to toss the baby out with the bathtub. I cherish every moment we’ve had together, whether in the van, the Après, or out there on the waves. All I ever wanted was the next moment, and deep down, I think that’s all you want too.”\n Ka-10-8 sat in stunned silence across from him. Reef offered them the bag of plantain chips again, and this time, Ka took a mouthful. “These are spicy. New universe might not have plantain chips this good.”\n “So ditch them,” Reef said. “Supernovers to shred. Some good liquid waves. Mountains with snow. Doesn’t have to be water snow, though I am partial to it. Gas giants for sailing. And you.”\n Ka-10-8 rubbed their head lobes together. “And the Après, I suppose, and maybe some place to get our boards waxed.”\n “Simulating all the life in the universe has gotta hog resources. Cut it too.”\n Ka-10-8 closed their eyes and seemed to be thinking. “Could work. But it will be awful lonely.”\n Reef knelt in the empty beer cans and crinkling plantain chip packages that filled the driver’s footwell. “Not if we’re together. You, me, and a universe to shred. That’s all we need.”\n “What about first rides?”\n “All yours.”\n They took another mouthful. “Nope. We do the contest again. But this time, I ride in my own body.”\n Reef crawled up out of the footwell. “So we simulate Earth. Show up for the 2046 pipeline comp. Winner gets first rides. We shut it down after if we need the bandwidth.”\n “Got yourself a deal, bro.”\n Ka-10-8 leaned in. Reef bumped their head lobe with his fist.\n Minutes and millions of years later, they surfed the wave front of a Big Bang as it defined their new universe.\n Geoffrey W. Cole’s award-winning short fiction has appeared in such publications as Apex, New Worlds, EscapePod, Reckoning, and Imaginarium 2012: The Year’s Best Canadian Speculative Writing. His stories have been translated into Catalan, French, Hungarian, Italian, Romanian, and Spanish. He is the 2016 winner of the Premis Ictineu for best story translated into Catalan. He lives with his wonderful wife, three sons, and giant hound outside Toronto, Canada."}