{"fingerprint": "yXyxb2tB8/Lfr2iTjf8XhV65I+8=", "sitename": "Clarkesworld Magazine", "title": "Life After Quatermass: Hammer Films' '60s Science Fiction by Mark Cole", "author": "Mark Cole", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cole_07_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Life After Quatermass: Hammer Films' '60s Science Fiction by Mark Cole", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Life After Quatermass: Hammer Films' '60s Science Fiction\n Hammer Films: The name conjures images of sinister images in garish color, of Frankenstein, Dracula, and a thousand other terrors of the night.\n Like some monstrous creature in one of its own films, Hammer has returned from the dead. After a 43-year absence, The Woman in Black recently hit American theaters, with the promise of further films to come.\n So far, however, Hammer has announced no plans to explore another important part of its legacy (although one unfamiliar to many of their fans): science fiction. Hammer's SF films of the '50s—inspired by the legendary Quatermass serials—were the company's first venture into horror. Not only did their success encourage Hammer to make its first Gothics, but they played a pivotal role in the development of British SF cinema over the next decade.\n While many critics have discussed the Quatermass films and their numerous copies, few have paid much attention to the SF films Hammer made in the decade that followed. They are a curious lot, ranging from true classics to classy exploitation films, from the deadly serious to the just plain goofy, from daring astronauts to topless cavegirls. They reflect the rapidly changing times and Hammer's own struggles to stay afloat in an uncertain market. But no matter how dark or absurd they can be, they remain eminently watchable, thanks to the care and professionalism that Hammer brought to all its films.\n According to Bill Warren's massive Keep Watching the Skies!: American Science Fiction Movies of the Fifties, it was the rise of Gothic horror that drove SF out of the theaters at the end of the '50s. For Hammer, 1957 marked both the end of its initial burst of Quatermass films and the beginning of its horror cycle. This is no accident: Quatermass' adventures featured strong doses of horror, something nearly unprecedented in SF film at the time they appeared on TV. It was Hammer's desire to make horror films that led the company first to Quatermass, then to Gothics. These proved so successful that it would be six years before Hammer returned to SF, in a sadly neglected classic.\n The Damned (aka These Are the Damned in the U.S.) remains one of Hammer's strangest and most elusive films. One look at the shocking images on its movie posters tells us that Hammer intended to cash in on the success of MGM's Village of the Damned. However, while lethal to those around them, the film's radioactive children are otherwise ordinary: They evoke not horror but pity.\n Nor does The Damned look anything like our conception of an SF film. Set in the English seaside town of Weymouth, its stunning widescreen cinematography contrasts the sharp cliffs and rocky seashore with the crowded Victorian streets. In fact, the film takes its time reaching its first SF elements.\n It starts like another sort of film altogether, introducing us to a gang of Teddy Boys led by the psychotic King (Oliver Reed) who uses his sister Joan (Shirley Anne Field) to trap wealthy tourists. By 1961 many people had become frightened of the growing number of youth gangs and the increase in juvenile delinquency; at first glance, The Damned could be yet another serious drama about violent teens. (It is also one the few elements taken from the film's source, H. L. Lawrence's Children of Light.)\n But the gang is not the only thing disturbing Weymouth. The army is there as well, and military helicopters buzz constantly over the peaceful town. On top of the cliffs is a high-security research facility run by a soft-spoken scientific bureaucrat (identified only by his first name, Bernard) played by Alexander Knox. As Joan attempts to escape her brother's control with the help of the gang's latest victim, retired American businessman, Simon Wells (MacDonald Carey), the two stumble on the underground complex hidden in the caves beneath. There they find a handful of seemingly ordinary children—only they don't feel the cave's chill and are themselves cold to the touch.\n One might expect to learn that the military created these children. Instead they are a natural mutation, born of mothers exposed to nuclear fallout. Like the Teddy Boy gang, they are the accidental products of our society. Bernard sees in the children the salvation of mankind. They alone will be able to survive in the smoking ruins of civilization after the inevitable nuclear holocaust. As several of them have already died of natural causes, his confidence seems misplaced.\n What many reviewers have missed about The Damned is that the film is very much an anti-Quatermass film. Here it is the scientific hero—attempting to save mankind from destruction—who has become the villain. It is not the children who are terrifying. It's Bernard's blasé acceptance of man's impending destruction; his obsessive secrecy and willingness to murder anyone who might reveal his secrets; the casual inhumanity of his project; and his bland insistence that he loves the children under his care. While we never learn Bernard's full name, it seems no coincidence that he shares Professor Quatermass' first name.\n The first Quatermass films reflected the Cold War paranoia of the age, setting us against an enemy who, while capable of absorbing us into itself, was ultimately from somewhere outside. In The Damned, the enemy we have to fear is our own selves and our own government. It reflects the growing Cold War nihilism of the '60s, as we began to question our own actions in what seemed an endless conflict that could only end in destruction. It is this dark political edge that led to The Damned's obscurity.\n While blacklisted American director Joseph Losey completed The Damned in 1961, it took two years and the removal of nine minutes to convince Hammer to release it in the UK. It would not reach U.S. for another two years, in a seriously truncated version shorn of another ten minutes—as well as most of its political and philosophical elements. Many critics dismissed this sad remnant of a film without paying much attention to it, and its dark ending did not help it find an audience. Only now that the full-length version is available has it gradually gained the critical recognition it deserves.\n And perhaps the film isn't quite as despairing as we think—not if, after the final credits, we watch Simon and Joan turn his boat around to make one more try at rescuing the children...\n It seems strange, but it's true: After four groundbreaking '50s SF films, the most typical of Hammer '60s SF output (and only marginal SF at that!) was its bikini-cavegirl films.\n The Curse of Frankenstein (1957) set the company's path for many years. One of the first color horror films, it shocked audiences with its garish splashes of gore. The films Hammer made in its wake threw even more blood at the screen and amped up the violence. But as Hammer's competition (in particular Roger Corman's Edgar Allen Poe films for American International Pictures) became fiercer, Hammer followed the latest trend in European film and turned to sex to distinguish itself from the herd. By the mid-'60s, Hammer films regularly featured pageant winners and Playboy Playmates. It's no coincidence that Raquel Welch appeared side by side with Bond girl Ursula Andress on a stunning dual poster for Hammer's first cavegirl movie, One Million Years B.C. (1965) and its new adaptation of H. Rider Haggard's She.\n Most of Hammer's best-known films seem to have been remakes, sequels, or adaptations, so it comes as no surprise that One Million Years B.C. is a remake of One Million B.C. (1940). In glorious color, the remake rejected the original's lizards with added fins in favor of some of Ray Harryhausen's best stop-motion dinosaur work. However, it did retain the curious conceit of rendering dialogue in an imaginary primitive language.\n Clearly, Hammer never had any illusion that One Million Years B.C.'s major attractions amounted to much more than Welch's fur bikini, and Harryhausen's dinosaurs. It's purely an exploitation film, albeit a vastly entertaining one, made with Hammer's usual panache, craftsmanship, and technical savvy.\n However, it was extremely expensive, at least by Hammer's standards. The company decided to get the most out of its investment in 1967 by making Prehistoric Women (aka Slave Girls), which recycles One Million Years B.C.'s sets and costumes (but had no dinosaurs). Supposedly based on a 1950 film of the same name (although the two have little in common), Prehistoric Women's magical time-travel elements make it fantasy rather than SF. It's also unique among these films for its English dialogue.\n In 1970 Hammer followed these with When Dinosaurs Ruled the Earth, returning to One Million Years B.C.'s successful formula of dinosaurs plus cave girls. Only this time, actor Victoria Vetri and animator Jim Danforth provided the film's major attractions; J. G. Ballard provided the story; and Hammer included a few nude sequences in the original British version of the film.\n The following year, Hammer produced its final cavegirl film, The Creatures the World Forgot—which, while dinosaur-free, offered one-time Miss Norway, Julie Ege. And even more nudity.\n The early '60s was not a good time for SF cinema. The number of new films fell dramatically. Audiences became more demanding, expecting far better effects and more coherent films. While some filmmakers responded by trying to make more intelligent movies, they failed to create new interest in the genre.\n Perhaps the best film of this era was Hammer's classic 1967 adaptation of Quatermass and the Pit (known in the U.S. as Five Million Years to Earth). It took Hammer nine years to turn Nigel Kneale's TV serial into a film. The company's first attempt in 1961 quickly stalled because it couldn't find American backers. This hiatus, however, allowed Hammer to replace lead Brian Donlevy, whom Kneale detested, with a new Quatermass: Andrew Keir.\n The differences between the new film and the two that precede it, though, it are far greater than a change of actors—or the switch from black-and-white to widescreen color. It's by far the least science-fictional of the three, dwelling instead on myth and legend. While the first two were SF with horror elements, Quatermass and the Pit is at heart a Lovecraftian horror film, centered around a supernatural menace with a science-fictional explanation. After Hammer's ten years of making horror films, however, the new emphasis makes sense.\n It's another change that's harder to understand: Quatermass' role is seriously reduced, so much so that Hammer stalwart James Donald, playing paleontologist Dr. Roney, gets top billing. In the U.S., the film's advertising campaign made no reference to either Quatermass or the previous installments. Perhaps this is a reflection of the movie's shift toward supernatural horror; after all, it is not Quatermass' science that finds the way to destroy the alien menace, but Roney's occult research.\n 1968 brought what is probably the strangest film Hammer ever made, and certainly its strangest '60s film—a movie that seems entirely out of sync with the times that produced it: The Lost Continent.\n Hammer had an enormous success with its adaptation of Dennis Wheatley's The Devil Rides Out and decided to follow it up with a version of another of his novels, Uncharted Seas. While he was one of the most popular adventure novelists of his day, Wheatley is mostly remembered today for the Hammer films based on his work. In fact, his career had already started to fade by the time Hammer made The Lost Continent.\n If one had to try to describe The Lost Continent, it might be simplest to compare it to a pulpy adventure novel written in 1926. Certainly, the one movie that it most strongly resembles is 1975's The Land That Time Forgot, which was also based on a pre-World War II adventure novel and offers a similar combination of thrills on the high sea, hidden worlds, and strange creatures.\n In fact, except for a brief opening tease, the so-called lost continent does not appear until the film is halfway over. It starts with Captain Jensen (Eric Porter) trying to outrun the harbor police. His ship is overdue at the scrap yard; he's smuggling a deadly cargo of white phosphorus, which explodes if it gets wet; and his passengers are all as desperate as he is. Before long, he finds himself dealing with a deadly storm, a hole in his hull, mutiny, and water rushing into a hold full of explosives.\n It's at this point, with Jensen, the surviving passengers and crew all adrift in a lifeboat, that the characters suddenly find themselves in an SF film. First they encounter carnivorous seaweed, then a strange lost world made of ships caught in the weed, then a girl crossing the seaweed wearing what looks like snowshoes and two big balloons on her shoulders. There are mutant monsters and even the Spanish Inquisition\n The Lost Continent is an odd and decidedly old-fashioned mixture of disparate elements. While it has not been well regarded over the years, it's gradually acquired a cult status of sorts—and a deserved one, as it manages to deliver its share of pulpy thrills, if only to those willing to wait for the lost continent's arrival.\n As the '60s progressed, Hammer grew increasingly desperate. The market shifted towards subtler contemporary horror films like Rosemary's Baby and The Haunting. Hammer responded with a series of increasingly bizarre offerings: from naked lesbian vampires to modern-dress Dracula films (one of which features gun-toting thugs dragging Dr. Helsing into a high-rise office building to confront Dracula!) to a kung-fu-Chinese-vampires-meet-Dracula movie.\n Moon Zero-Two, Hammer's answer to 2001: A Space Odyssey has more than a hint of desperation about it. Billed as “the first Moon Western,” it offers a heady mix of detailed and mostly accurate space flight with a very familiar story about claim-jumpers on the moon. It even has a heroine named Clementine, although actor Catherine Schell is far too elegant and European for a Western.\n The film's animated opening credits distance it from the Cold War concerns of Hammer's earlier SF, although they have little relationship to the rest of the film. In that opening, two astronauts, one American and one Russian, vie to see who gets to claim the moon—a long, comic sequence set to the film's psychedelic theme song. Only the astronauts wind up finding that businessmen have already landed and turned the moon into a big tourist trap, forcing them to flee together.\n Perhaps these animated figures are meant to represent the film's American hero and his Russian co-pilot, forced to fly an ancient salvage ship because no one is exploring space any more; everyone is too busy making money. Moon Zero-Two offers extravagant '60s design, dancing girls in the local saloon, colorful spacesuits, and a female sheriff. Oddly, despite the accuracy of the rest of the film, it also includes artificial gravity and ray guns.\n Long neglected, Moon Zero-Two has also assumed cult notoriety, largely thanks to its appearance on Mystery Science Theater 3000. It may be absurd, but it's also absurdly entertaining, thanks as always to Hammer's innate professionalism.\n Hammer's all-too-brief career of producing the classiest exploitation films ever made slowed to a halt over the next decade, ending finally on television in the '80s. The company left behind a legacy of great films: horror, suspense, mystery, adventure—and even SF.\n In an era when SF had lost its luster, Hammer deserves credit for bringing so many SF films to the screen, even if they do reflect the confusion that had overtaken the film genre. One can only wonder about the films Hammer couldn't get made: the fourth Quatermass film and its adaptation of 1961's British SF television serial, A for Andromeda.\n Despite the huge success of 2001 and the rush of films that tried to cash in on it, the film industry did no better than Hammer did in finding a new audience for SF film in the late '60s and early '70s. That would have to wait until the late '70s and Star Wars and Alien.\n But that's another story.\n Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction."}