{"fingerprint": "BymjCycjJsTjV0LvIrR8RM4Lu+0=", "sitename": "Clarkesworld Magazine", "title": "The Issue of Gender in Genre Fiction: The Math Behind it All by Susan E. Connolly", "author": "Susan E Connolly", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/connolly_06_14a/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Issue of Gender in Genre Fiction: The Math Behind it All by Susan E. Connolly", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nThe Issue of Gender in Genre Fiction: The Math Behind it All\nEditor’s Note: Knowing that some people will be curious about the math behind Susan’s piece, we asked her to provide something a bit more technical for those more mathematically inclined among us.\nKey Points for Understanding\n- Publications refers to prose fiction published by a market, including reprints and solicited stories.\n- Each publication is treated separately. Three publications by one market of stories by one author count as three separate data points for that category.\n- Dual-authored stories by a man-woman team are considered as half a data point for each category.\n- Serials are treated as follows:\n- Each installment is a separate data point for publications.\n- The series as a whole is one data point for acceptances.\n- Not all markets provided full data in all categories, which meant they had to be excluded from some analyses, or have their data transformed. This is not ideal, but such cases are marked.\n- No market in this study asks for authors to identify their gender when submitting. As such, this is not actually a study of science fiction publication and submission gender. Rather, it is a study of the apparent gender of submission authors based on:\n- Use of gender-associated first names\n- Use of gendered pronouns in public biographies\n- Public information about gender identity\n- The definition of “science fiction” is not easy. While some markets kept detailed data on science fiction vs. science fiction/fantasy vs. slipstream, most did not. As such, all such categories were considered as “science fiction.”\n- Specific notes on individual markets regarding publications:\n- Lightspeed operates a policy of gender parity in publications.\n- Buzzy Mag operates as a continuous publication, with publications here those with a published date of 2013.\n- The F&SF Special Issue has not yet been published.\n|Market||Time Period||Data Verified by Editor||Genre|\n|AE||Year 2013||Yes||Science fiction only|\n|Analog||June 2013—May 2014||Yes||Science fiction only|\n|Apex||Year 2013||No||Mixed genre|\n|Asimov’s||Year 2013||Yes||Mixed genre|\n|Bull Spec||Year 2013||Yes||Mixed genre|\n|Buzzy Mag||Year 2013||Yes||Mixed genre|\n|Clarkesworld||Year 7 (October 2012-September 2013)||Yes||Mixed genre|\n|Daily Science Fiction||Year 2013||Yes||Mixed genre|\n|Escape Pod||Year 2013||Yes||Science fiction-only|\n|F&SF||Year 2013||No||Mixed genre|\n|F&SF Special Issue||July/August Special Issue||Yes||Mixed genre|\n|Flash Fiction Online||Year 2013||Yes||Mixed genre|\n|IGMS||Year 2013||Yes||Mixed genre|\n|Lightspeed||Year 2013||Yes||Mixed genre|\n|Nature||Year 2013||Yes||Science fiction only|\n|Strange Horizons||Year 2013||Yes||Mixed genre|\n|Tor.com||Year 2013||No||Mixed genre|\nA1: Publications by Gender\nAcross seventeen markets, the total number of published stories was 996: 559.5 by men, 422.5 by women, 1 non-binary and 13 unknown.\nThe gender ratio was therefore 56.2% men, 42.4% women, 0.1% non-binary and 1.3% unknown.\nHypothesis: publications by men are equally likely as those by women to be above the median or not above the median.\nGiven a median of 50%, each market was assessed for whether its publications by men and publications by women were above or not above that median.\n|Median chi-square total publications|\n|Category||Authors who are men||Authors who are women||Total|\n|Above median||9||7||16|\n|not above median||8||10||18|\n|Total||17||17||34|\nResults:\n- chi square value: 0.472\n- With a probability of 0.05 (or 95%) I have a critical value of 3.84.\nTherefore I cannot reject our initial hypothesis.\nHypothesis: There are no significant differences in gender ratios relationship between markets.\nTo test this hypothesis, I performed a chi-square test between the variables of “market” and “gender ratio.”\nResults:\n- chi sq: 92.65\n- With a probability level of .001 (or 99.9%) our critical value is 39.25.\nTherefore I can with confidence reject the hypothesis.\nA2: Science Fiction Publications by Gender\nI performed the same tests for published science fiction stories.\nAcross seventeen markets, the total number of published science fiction stories was 639: 395 by men, 235 by women, 0 non-binary and 9 unknown.\nThe gender ratio was therefore 62.1% men, 36.5% women, 0% non-binary and 1.4% unknown.\n|Median chi-square science fiction publications|\n|Category||Authors who are men||Authors who are women||total|\n|Above median||9||6||15|\n|Not above median||8||11||15|\n|Total||15||15||30|\nResults:\n- Our median chi square result was 1.07.\nTherefore I cannot reject the null hypothesis.\nHypothesis: There are no significant differences in gender ratios relationship between markets for science fiction stories.\n- Our chi-square result was 46.82.\n- With a probability level of .001 (or 99.9%) our critical value is 39.25.\nTherefore I can with confidence reject the null hypothesis.\nA3: Science Fiction Story Publication Split by Genre of Market:\nAcross four markets that published only science fiction, the total number of published science fiction stories was 253: 182 by men and 71 by women. This gives a gender ratio of 71.9% men, 28.1% women, 0% unknown.\nAcross thirteen markets that published other genres in addition to science fiction, the total number of published science fiction stories was 386: 213 by men, 164 by women and 9 unknown. This gives a gender ratio of 55.2% men, 42.5% women and 2.3% unknown.\nHypothesis: there is no correlation between a market publishing only science fiction, and a greater proportion of science fiction stories by men.\nTo assess this hypothesis, I used a point-biserial correlation. Our result was 0.54 (considered moderate).\nIs this significant? I performed a T test for independent means to get a T-value of 2.46, with a P-value of 0.01. At the 95% probability for a one tailed t test the critical value is 1.753.\nTherefore I can reject the null hypothesis.\nA4: Non-Science_Fiction-Only Publications – Gender Split of Total Pubs vs. Gender Split of Science Fiction Pubs\nUsing a Pearson’s Correlation analysis I found an R value of 0.8863 (considered a strong positive correlation.)\nSo there is a tendency for markets which publish a high proportion of overall stories by men to publish a high proportion of science fiction stories by men (and vice-versa.)\nA5: Story Publication Split by Gender of Senior Editor\nNote: One senior editor identifies as a genderqueer woman for political purposes and was included in the “woman” category for these assessments.\nAcross eight publications with men only as senior editor total stories published was 434, with 280 by men and 154 by women.\nThe gender ratio was therefore 64.52% men, 35.48% women.\nAcross five publications with women only as senior editor total stories published was 210, with 108.5 by men, 99.5 by women, 1 non-binary and 1 unknown.\nThe gender ratio was therefore 51.67%% men, 47.38% women.\nAcross four publications with mixed-gender editorial total stories published was 352 stories, with 171 by men, 169 by women, and 12 by unknown.\nThe gender ratio was therefore 48.58% men, 48.01% women and 3.41% unknown.\nHypothesis: Men-only senior editorial teams are not more likely to publish authors who are men.\nI got a point-biserial correlation coefficient of 0.42, (considered moderate.)\nI ran a T test for independent means to get a value of 1.80.\nAt the 95% probability for a one tailed t test the critical value is 1.75.\nTherefore I can reject the null hypothesis.\nA6: Science Fiction Story Publication Split by Gender of Senior Editor\nI performed the same tests for science fiction stories.\nAcross eight publications with men only as senior editors, total science fiction stories published was 320, with 210.5 by men and 109.5 by women.\nThe gender ratio was therefore 65.78% men, 34.22% women.\nAcross five publications with women only as senior editors, total science fiction stories published was 110, with 70.5 by men, 39.5 by women.\nThe gender ratio was therefore 64.1% men, 35.9% women.\nAcross four publications with mixed-gender editorial teams, total science fiction stories published was 205, with 117 by men, 79 by women, and 9 by unknown.\nThe gender ratio was therefore 57.07% men, 38.54% women and 4.39% unknown.\nHypothesis: Men-only senior editorial teams are not more likely to publish science fiction stories by men.\n- Point biserial correlation coefficient – 0.30 (moderate).\n- Student t-test – 1.21.\n- At the 95% probability for a one tailed t test the critical value is 1.75.\nTherefore, I cannot reject the null hypothesis.\nGiven the percentage difference, there may be a correlation between mixed-gender editorial teams and a smaller proportion of authors who are men.\nHypothesis: Single-gender senior editorial teams are not more likely to publish science fiction stories by men.\n- Point biserial correlation coefficient – 0.34 (moderate).\n- Student t-test – 1.42.\n- At the 95% probability for a one tailed t test the critical value is 1.75.\nTherefore, I cannot reject the null hypothesis.\nA7: Story Publication Split by Average Age of Senior Editorial Team\nFour publications declined to provide age data: Apex, Nature, Buzzy Mag, Tor.com. This analysis used a Pearson’s correlation.\nMean Age vs. Total Publications by Men %\nThe value of R is 0.3198. This is technically a positive correlation, but the relationship is weak.\nThe value of R2, the coefficient of determination, is 0.1023.\nMean Age vs. Science Fiction Publications by Men %\nThe value of R is -0.0082. This is technically a negative correlation, but the relationship is weak.\nThe value of R2, the coefficient of determination, is 0.0001.\nMedian Age vs. Total Publications by Men %\nThe value of R is 0.3281. This is technically a positive correlation, but the relationship is weak.\nThe value of R2, the coefficient of determination, is 0.1076.\nMedian Age vs. Science Fiction Publications by Men %\nThe value of R is -0.0036. This is technically a positive correlation, but the relationship is weak.\nThe value of R2, the coefficient of determination, is 0.\nSusan E. Connolly's short fiction and non-fiction have appeared in Strange Horizons, Daily Science Fiction, The Center For Digital Ethics and the fanzine Journey Planet. She is the author of Damsel, a middle-grade fantasy from Mercier Press and Granuaile, an upcoming historical comic book from Atomic Diner. Her degree in Veterinary Medicine given her strong opinions about the accurate portrayal of animal sidekicks in fiction. Susan lives in Ireland, near the mountains. Also near the sea. Also near the forest (Ireland is a small country)."}