{"fingerprint": "NMOAXuOjMtnQ5PbchjJGA8i8fF4=", "sitename": "Clarkesworld Magazine", "title": "The Issue of Gender in Genre Fiction: The Math Behind the Slush by Susan E. Connolly", "author": "Susan E Connolly", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/connolly_07_14a/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Issue of Gender in Genre Fiction: The Math Behind the Slush by Susan E. Connolly", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n The Issue of Gender in Genre Fiction: The Math Behind the Slush\n Editor’s Note: Knowing that some people will be curious about the math behind Susan’s piece, we asked her to provide something a bit more technical for those more mathematically inclined among us.\n Submissions Variation Between Markets\n Hypothesis: There are no significant differences in gender ratios relationship between markets.\n All Submissions\n Chi Square: 248.94Critical value at 99.9%: 34.53\n I can reject the null hypothesis\n Science Fiction Submissions\n Chi Square: 89.6Critical value at 99.9%: 31.26\n I can reject the null hypothesis\n Science-Fiction Submissions by Genre of Market\n Hypothesis: Science fiction only markets are not more likely to receive submissions from men.\n Using a Pearson’s correlation I got an R value of 0.14 (considered weak), with a T-value of 0.46 and a p value of 0.33. For a one-tailed t-test the critical value is 1.81.\n Therefore I cannot reject the null hypothesis.\n Non-Science Fiction-Only Publications: Gender Split of Total Subs vs. Gender Split of Science Fiction Subs\n Hypothesis: There is no relationship between the gender ratio of all submissions and the gender ratio of science fiction submissions.\n R value: 0.7132 (Strong positive correlation)\n I can reject the null hypothesis.\n All-Men Senior Editorial Team Vs All-Women or Mixed-Gender Senior Editorial Team\n Hypothesis: Men-only senior editorial teams are not more likely to receive submissions from authors who are men.\n All Submissions\n R value: -0.16 (weak negative correlation)T value: -0.57Critical value at 95% probability: 1.78\n Based on the t-value this result is not significant.\n Science Fiction Submissions\n R value: 0.23 (weak positive correlation)T value: 0.76Critical value at 95% probability: 1.81\n Based on the t-value this result is not significant.\n All-Women Senior Editorial Team Vs All-Men or Mixed-Gender Senior Editorial Team\n Hypothesis: Women-only senior editorial teams are not more likely to receive submissions from authors who are women.\n All Submissions\n R value: 0.19 (weak positive correlation)T value: 0.66Critical value at 95% probability: 1.78\n Based on the t-value this result is not significant.\n Science Fiction Submissions\n R value: -0.23 (weak negative correlation)T value: 0.74Critical value at 95% probability: 1.81\n Based on the t-value this result is not significant.\n Age of Senior Editorial Team\n Hypothesis: Age of Senior Editorial Team Has No Relationship with the Percentage of Submissions by Authors Who Are Men\n Mean Age vs. Total Subs by Men %\n R value: 0.2395 (weak positive correlation)\n Mean Age vs. Science Fiction Subs by Men %\n R value: 0.1299 (weak positive correlation)\n Median Age vs. Total Subs by Men %\n R value: 0.2329 (weak positive correlation)\n Median Age vs. Science Fiction Subs by Men %\n R value: 0.1125 (weak positive correlation)\n While the results technically show a positive correlation, the relationship is extremely weak, and insufficient to reject the null hypothesis.\n Susan E. Connolly's short fiction and non-fiction have appeared in Strange Horizons, Daily Science Fiction, The Center For Digital Ethics and the fanzine Journey Planet. She is the author of Damsel, a middle-grade fantasy from Mercier Press and Granuaile, an upcoming historical comic book from Atomic Diner. Her degree in Veterinary Medicine given her strong opinions about the accurate portrayal of animal sidekicks in fiction. Susan lives in Ireland, near the mountains. Also near the sea. Also near the forest (Ireland is a small country)."}