{"fingerprint": "JG4l0ilbIx3kgQ4jbHC5bYm0lCk=", "sitename": "Clarkesworld Magazine", "title": "The Issue of Gender in Genre Fiction: Publications from Slush by Susan E. Connolly", "author": "Susan E Connolly", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/connolly_07_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Issue of Gender in Genre Fiction: Publications from Slush by Susan E. Connolly", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nThe Issue of Gender in Genre Fiction: Publications from Slush\nThe issue of representation of men and women in science fiction is one that has caused much discussion. There’s “The Count,” from Strange Horizons which looks at professional reviews of science fiction novels by gender, and a similar initiative by Lady Business for blog reviews. A common query when it comes to this issue of representation is the makeup of submissions. Are the differences we see simply reflections of the proportion of submissions received?\nThere has been some investigation of this question before, and by widening the data-gathering net, I hope to allow a more nuanced and informed discussion of the issue. I have also attempted to perform separate analyses of submissions as a whole, as well as science fiction submissions specifically.\nIn the previous article I looked at the gender ratios of published stories of all genres and published science fiction stories in seventeen SFWA short fiction markets. While looking at published fiction alone does give us some important information about the gender representation of authors both overall and between different markets, it’s not the end of things. In addition to gathering data on published stories, I asked editors for details of the source of those published stories.\nWith some editors receiving hundreds of submissions every week, the effort and time to categorize even a sample of those submissions for this study was substantial, and I am extremely grateful for that assistance.\nPublications from Slush\nSome markets draw all of their published stories from open submissions, while others draw from a combination of slush submissions, reprints, and stories solicited from authors. For the second group, it is useful to compare the published stories with those that came from slush, to see if this results in significantly different gender ratios. After all, it could be the case that reprints or solicited stories show a different kind of gender ratio than the stories that just come from slush.\nThose markets which drew published stories from outside the slush pile during the period studied were: Apex, Clarkesworld, Daily Science Fiction, Escape Pod, F&SF, F&SF Special Issue, Lightspeed, Strange Horizons, and Tor.com.\nTable 1: Reprints and Solicited Stories Status of Markets\nMarket\nSolicit Stories\nPublish Reprints\nNotes\nAE\nYes\nNo\nAll stories came from slush in 2013.\nAnalog\nNo\nNo\nApex\nYes\nYes\nOn investigation, the numbers for Apex in the previous article were slightly off. (17 Men, 28 Women, 1 Non-Binary, 1 Unknown.) This has been corrected for this piece to 18 Men, 27 Women, and 2 Non-Binary.)\nApex editors also did not assign genres to speculative fiction, so the division was based on my own assessment.\nReprints data for SF stories was available, but data for solicited stories was not.\nAsimov’s\nNo\nNo\nBull Spec\nYes\nYes\nAll stories came from slush in 2013.\nBuzzy Mag\nNo\nNo\nClarkesworld\nNo\nYes\nDaily Science Fiction\nYes\nNo\nEscape Pod\nYes\nYes\nF&SF\nYes\nYes\nF&SF Special Issue\nYes\nNo\nFlash Fiction Online\nNo\nNo\nIGMS\nNo\nNo\nLightspeed\nNo\nYes\nNature\nNo\nNo\nStrange Horizons\nNo\nYes\nTor.com\nYes\nNo\nTaking this subset of markets and graphing Publications from Slush vs Total Publications, we can see that reprints and solicited stories make up a large proportion of published fiction in some markets. When looking at the percentage share of each gender, there are some slight differences when comparing Publications from Slush with Total Publications for both all stories and science fiction stories.\nHowever, overall, the differences in ratios between All Published Stories and Stories from Slush are not significant.\nSubmissions: Samples and Variation\nAs mentioned in the previous article, please note that this is a study of apparent gender. Some editors used Google to obtain public bios of the authors for a more accurate categorization of author gender, and some were already aware of the gender identity of some authors, but in most cases the categorization by gender was based on first name. This inherently makes the gender split less accurate than it was in the previous article.\nAdditionally, when dealing with overall publications and comparing them to publications drawn from slush, I could look at the full data-set for the time period. However, with some publications receiving thousands of submissions per year, many markets were understandably unable to provide full breakdowns for a year’s worth of submissions. As such, I am dealing with samples from varying time periods. This means that the analysis will not be quite as comprehensive or accurate as would be ideal.\nDrawing conclusions about the yearly submissions from a smaller sample may lead to error. For example, Escape Pod provided data for the months of February 2014, April 2014, and May 2014. We can see a variation of 4.01% between the highest and lowest months in terms of gender ratios.\nTable 2: Escape Pod Submissions by Month\nTotal Submissions\nSubmissions from Men\nSubmissions from Women\nFebruary\n85\n65\n20\n76.47%\n23.53%\nApril\n69\n50\n19\n72.46%\n27.54%\nMay\n70\n53\n17\n75.71%\n24.29%\nAverage\n74.67\n56\n18.67\n75%\n25%\nLooking at a separate twelve month period of Clarkesworld Magazine’s submissions, we can see additional evidence of variation in gender ratios. This chart looks at both total submissions (including science fiction, fantasy, horror, science fiction/fantasy and science fiction/horror) and science fiction subs only (including science fiction, science fiction/fantasy and science fiction/horror.)\nWhile the overall breakdown for the year was 71.06% men and 28.94% women for all submissions, the highest month for representation of men came in at 73.19%, and the lowest at 69.62%. This gives us a 3.57% difference between the months with the highest and lowest representation of men. So, we can see that a one-month sample would not have accurately reflected the yearly ratios.\nTable 3: Clarkesworld Submissions Gender Ratio Variation\nOverall\nHigh\nLow\nHigh-Low Difference\nMen\nWomen\nMen\nWomen\nMen\nWomen\nTotal Subs\n71.06%\n28.94%\n73.19%\n26.81%\n69.62%\n30.38%\n3.57%\nScience Fiction Subs\n75.29%\n24.71%\n77.21%\n22.79%\n73.58%\n26.42%\n3.63%\nWe also see variation in overall volume of submissions, as detailed below. (In all cases but the highest volume of total subs by women, the highs/lows in volume by gender were also found in the same month as for overall submissions.) Again, we can see that while the average (mean) month had 776 submissions, with 551 by men and 224 by women, one month had 933 submissions total, while one had only 649.\nTable 4: Clarkesworld Submissions Volume Variation\nAverage\nHigh\nLow\nTotal\nMen\nWomen\nTotal\nMen\nWomen\nTotal\nMen\nWomen\nTotal Subs Volume\n776\n551\n224\n933\n657\n278\n649\n475\n174\nScience Fiction Subs Volume\n403\n303\n100\n517\n381\n136\n338\n259\n79\nGiven these variations, it is likely that the submission samples are not giving a completely accurate representation of the overall yearly ratios, so any kind of specific ranking of markets based on the ratios given here would not be a good idea. That said, we can likely still draw tentative generalized conclusions.\nOverall, I have data for fourteen of the seventeen markets when it comes to submissions for all genres, and twelve of the seventeen markets for science fiction submissions.\nTable 5: Submissions Data Provided By Markets\nMarket\nAll Stories Sample\nScience Fiction Stories Sample\nNotes\nAE\n150 submissions of the 503 total for 2013.\n150 submissions of the 503 total for 2013\nAnalog\nRead and replied for thirty days during the months of January and February 2014.\nRead and replied for thirty days during the months of January and February 2014.\nThis market did not look at the submissions that were received in a certain time period, but rather at the submissions which were replied to.\nApex\nRead and replied from January 1st 2014 - February 18th 2014.\n(Sample 1)\nRead and replied from January 1st 2014 - February 18th 2014.\n(Sample 2)\nThis market did not look at the submissions that were received in a certain time period, but rather at the submissions which were replied to.\nAsimov’s\nRead and replied for thirty days during the months of December and January 2014.\nNo submissions data available\nThis market did not look at the submissions that were received in a certain time period, but rather at the submissions which were replied to.\nThe number of submissions closed in this time period was unusually high, but the gender ratios are in accordance with the yearly total for closed submissions.\nBull Spec\na) Total number of submissions for last open subs.\nb) Submissions received October 1st - October 10th and November 1st - November 5th.\nSubmissions received October 1st - October 10th and November 1st - November 5th.\nLast open Subs were the months of October and November, 2011\nBuzzy Mag\nNo submissions data available.\nNo submissions data available.\nClarkesworld\nSubmissions received for year seven which ranged from October 2012 - October 2013.\nSubmissions received for year seven which ranged from October 2012 - October 2013.\nClarkesworld tracks submissions in the categories of Science Fiction, Fantasy, Horror, Science Fiction/Fantasy, and Science Fiction/Horror. Science Fiction, Science Fiction/Fantasy and Science Fiction/Horror were considered as Science Fiction for this study. (In general, editors divided submissions based on a broad definition of Science Fiction.)\nDaily Science Fiction\nThree weeks of submissions during February 2014.\nNo submissions data available.\nEscape Pod\nStories read in February, May, and April 2014.\nStories read in February, May, and April 2014.\nThis market did not look at the submissions that were received in a certain time period, but rather at the submissions which were read.\nF&SF\nNo submissions data available.\nNo submissions data available.\nF&SF Special Issue\nAll submissions in open period from January 1st - January 14th.\nAll submissions in open period from January 1st - January 14th 2014.\nFlash Fiction Online\na) Total number of submissions in 2013.\nb) Submissions received October 2013.\nSubmissions received October 2013.\nOctober 2013 was an unusually busy month.\nEditor based count on author’s submission tag, but estimates that another 7-10% of submissions could be considered science fiction.\nIGMS\na) Total submissions for year 2013.\nb) Submissions received January 2014 (Sample 2)\na) Submissions received April 2013. (Sample 1)\nb) Submissions received January 2014. (Sample 2)\nLightspeed\nTotal submissions for 2013.\nTotal submissions for 2013.\nLightspeed was open to submissions in June and July of 2013.\nWhile closed to slush, there was a “submissions backdoor” for authors Lightspeed had previously published/solicited.\nSubmissions data from that portal was incorporated into these results.\nThis doesn't include any data from the Women Destroy Science Fiction special issue, which opened to submissions December 15, 2013.\nNature\nTotal submissions for 2013.\nTotal submissions for 2013.\nStrange Horizons\nTwo weeks of 2013, six months apart.\nTwo weeks of 2013, six months apart.\nTor.com\nNo submissions data available.\nNo submissions data available.\nSubmissions Volume\nIn addition to looking at the proportions of submissions by gender, it is also interesting to look at the number of submissions received by each market. There is a wide disparity between the volume of submissions received by each market. In order to give an indication of this, markets that gave only a sample of submissions were brought to a one year volume for comparison. This is only a rough comparison; in addition to the variability between different time periods mentioned earlier, some of these markets may be closed to submissions at various points.\nThe deficiencies of this method of estimation can be seen by comparing the actual total submissions with the estimate from the sample, in the markets where we have both values: Flash Fiction Online, IGMS, and Bull Spec. This has some impact on certain statistical tests (e.g. chi-square) but does not necessarily invalidate most of the results found here.\nSubmissions Ratios\nOverall, we see a much smaller degree of variance between markets with Submissions than we saw with Publications.\nAll Submissions\nRange - Submissions by Men: 81.31% to 54.59% = 26.72%\nRange - Submissions by Women: 18.69% to 45.41% = 26.72%\nThe mean ratios are 67.94% men, 29.63% women, 0.02% non-binary and 2.43% unknown.\nThe median ratios are 68.40% men, 29.55% women, 0% non-binary and 0% unknown.\nScience Fiction Submissions\nRange - Submissions by Men: 81.31% to 58.67% = 22.64%\nRange - Submissions by Women: 18.69% to 41.27% = 22.58%\nThe mean ratios are 70.92% men, 27.52% women, and 1.61% unknown.\nThe median ratios are 72.65% men, 25.89% women, and 0% unknown.\nNote: For ease of comparison between All Subs and Science Fiction Subs (where possible), the source of the data is indicated in the label for each market.\nNo market received more submissions from women than from men.\nAs in the previous article, I tested to see if these differences were significant, and found:\nThe differences in submissions ratios between markets are significant, both for all submissions and science fiction submissions specifically.\nScience Fiction Submissions by Genre of Market\nI have no evidence to say that women make up a smaller proportion of submissions for science fiction only markets than for mixed-genre markets.\nMixed-Genre Publications: Gender Split of Total Subs vs. Gender Split of Science Fiction Subs\nI found a moderate-strong positive correlation, so there is a tendency for mixed genre-publications who receive a high proportion of total submissions from one gender to also receive a high proportion of science fiction submissions from that gender.\nSubmissions Ratios by Gender of Senior Editorial Team\nI found no significant relationships between gender of senior editorial team and gender ratios of submissions either for all stories or for science fiction stories.\nStory Submission Split by Average Age of Senior Editorial Team\nI found no significant relationships between age of senior editorial team and gender ratios of submissions either for all stories or for science fiction stories.\nSo, What Does This All Mean?\nThere are several interesting results from looking at the Submissions data. While there is significant variation between markets, the range is much smaller than we saw in Publications. In addition, while a significant number of markets published more women than men in the Publications data, no market received more submissions from women than from men, either overall or for science fiction. In mixed-genre markets, we see that a relatively high proportion of total submissions from one gender is correlated with a relatively high proportion of science fiction submissions from that gender.\nThe volume of submissions received shows dramatic variation. While these figures were estimated in some cases, it is fair to say that yearly submission volumes between markets range from a few hundred up to a few thousand. As such, the idea that gender ratios in submissions are due to the fact that women simply don’t write science fiction is patently untrue. While this might be the case for high-volume markets, the number of science fiction stories written by women in total is far greater than the number received by many markets. For example, if approximately 30% of the science fiction submissions by women received by Strange Horizons were instead submitted to Nature, we would see an equal gender representation in Nature’s submissions. (This is assuming that all stories submitted to Nature were also submitted to Strange Horizons. If we assume no overlap, the number is around 20%. The actual number is likely somewhere in the middle. Please note that I am aware that a suitable submissions for one market is not necessarily a good fit for another. This thought experiment serves as an illustration of the comparative volume of submissions and the effect that increased or diverted submissions from a small percentage of the women authors in the field could have on some markets.)\nHowever, there is no obvious smoking gun which shows us why submissions ratios vary between markets. I found no significant correlations between gender ratios of submissions and any of the categories that we tested. Based on our data, genre of market, age of senior editorial team, and gender of senior editorial team, are not factors that are related to the ratio of submissions by men and women.\nA Note on Comparing Submissions with Published Stories\nThis all begs the question—is there a relationship between submissions ratios and publications ratios? In the next installment, I will be looking at what further analysis can be carried out regarding this data. In the meantime, I would like to warn readers about the problems with attempting to carry out a simple analysis of the Submissions Ratios from samples, vs Publications From Slush for a whole year.\nConveniently, we have a good example of the pitfalls of this approach. Four markets provided data on the Stories Accepted from Slush during the time period of submissions data provided, which we can compare to Stories Published from Slush in the time period given in the previous article: Clarkesworld, Bull Spec, Flash Fiction Online, and Lightspeed.\nLooking at the differences between what was accepted from that specific slush sample, and what was published in a full year, we can see that a simple analysis of Submissions Ratios for the samples given vs Publications from Slush for an entire year would not give an accurate picture.\nTable 6: Acceptances from Submissions Sample Time Period vs Yearly Publications\nAcceptances from Slush\nPublications from Slush\nTotal\nMen\nWomen\nNon-Binary\nTotal\nMen\nWomen\nNon-Binary\nClarkesworld\n32\n11\n21\n0\n36\n11.5\n24.5\n0\n34.38%\n65.62%\n0%\n31.94%\n68.06%\n0%\nBull Spec\n3\n2\n0\n1\n6\n2\n4\n0\n66.67%\n33.33%\n33.33%\n66.67%\n0%\nFlash Fiction Online\n18\n8\n10\n0\n21\n8\n13\n0\n44.44%\n55.56%\n38.10%\n61.90%\n0%\nLightspeed\n35\n19\n15\n1\n48\n25\n23\n0\n54.29%\n42.86%\n2.86%\n52.08%\n47.92%\n0%\nNext Time on Adventures in Statistics: Our hero wraps things up with a pretty pink bow! Will she be able to avoid overdosing on graphs?\nSusan E. Connolly's short fiction and non-fiction have appeared in Strange Horizons, Daily Science Fiction, The Center For Digital Ethics and the fanzine Journey Planet. She is the author of Damsel, a middle-grade fantasy from Mercier Press and Granuaile, an upcoming historical comic book from Atomic Diner. Her degree in Veterinary Medicine given her strong opinions about the accurate portrayal of animal sidekicks in fiction. Susan lives in Ireland, near the mountains. Also near the sea. Also near the forest (Ireland is a small country)."}