{"fingerprint": "4wQKzcGtDs73XqKn6OT4Uej5KLs=", "sitename": "Clarkesworld Magazine", "title": "Paper of Elephants by Brenda Cooper", "author": "Brenda Cooper", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cooper_10_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Paper of Elephants by Brenda Cooper", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4020 words, short story\nPaper of Elephants\nEleanor watched the tourists’ faces as Siaal finished the last flourish on the painting in front of him, a bright blue streak simulating a sky. Three visitors watched the elephant hold his trunk straight up for a moment, the paintbrush clutched in his curled trunk. The small family spoke Italian but lived in America. The parents were old enough to have wrinkles around their eyes and the man hunched even though he couldn’t be over forty. His short wife had a wide torso and her mouth smiled easily but rested in a frown. The little girl might be ten. Her dark hair had been tamed into a high pony with a red ribbon that matched her jumpsuit, and dark curls dangled around her ears.\nSiaal carefully twisted his trunk to drop the paintbrush into the water-bucket on a stool beside the steel easel. She stood still while the video of his work streamed to Eleanor’s watch. She checked the quality carefully, quietly. A small bright square video of a big, mud-colored animal making a small blue line of sky. She nodded and pushed Siaal lightly in the chest to signal him to back up.\nThe elephant did, careful not to bump Eleanor’s hastily built tripod. It held her ring light, a phone, and a small solar panel that pulled just enough juice from the African sun to power both objects. She held her breath, silently urging Siaal not to get too close to the little family. Tourists were rare since COVID-19 and then SARS-22. He turned, carefully, following her finger signals, and she let her breath out when he stood facing the visitors. He knelt briefly, a stately bow.\nThe little girl gasped in wonder.\nEleanor smiled and said, “He likes you,” even though it was merely a trick Eleanor had taught the young bull across the last three long months. In her experience, elephants tolerated strange people; they didn’t like them. They responded far better to people they knew.\nShe’d been careful and positive for months on end, and he had learned. As he stood silently, waiting, her pride in him made her feel light on her feet. She took three plum-sized marula fruits from her pocket and encouraged the tourists to each toss one toward him. The girl’s high-pitched laugh as he scooped up the yellow globe with his trunk sent glee across the grasslands.\nSiaal held the fruit and lumbered toward his pen, a large enclosure made of posts and electrified metal fencing. The small family turned back to her, beaming their pleasure in the experience.\nThey would buy the painting; she was sure of that. And God knew, the money would help. But last night, her brother had been at her again, and she had promised to try his crazy scheme. Now might be her only chance for a while. She stood by the painting, a simple tree, a dab of yellow for the sun, and the single line of blue for sky. Remarkable only because it had been painted by an elephant. Well, and also because it had been painted by an elephant who wasn’t forced to paint. “It took three years to train him to paint,” she told her small audience. “He can do three different scenes, and he even varies them a little on his own.”\nThe girl’s deep brown eyes widened. “Do all elephants paint?”\nA smile warmed Eleanor. “No. But they play. They can be very creative creatures in their own way. We taught him to paint so people like you would come to see him without needing to ride on him.”\nThe girl looked in the direction Siaal had gone. “I would be afraid to ride on him.”\n“They can be gentle. I have ridden him. But it is cruel to put different riders on them every day or to make them ride in circles on ropes, which is what happens in some places that do not love their elephants.”\n“Does he like to paint?” she asked.\n“He seems to. He gets rewarded with the fruit and then a good back-scratch. That’s where he went. My brother David is waiting there to give it to him.”\nThe father glanced at his watch and leaned toward Eleanor. “Can we buy the painting?”\n“No.” She smiled. “And yes. We are selling each of Siaal’s paintings as limited-edition NFTs.” She paused, decided to clarify. “That stands for non-fungible token. It means, we sell the paintings only as digital art. If you are willing to pay the minimum price, you can have the number two painting.”\nHe gave her a little surprised look. Not unkind. But surprised. The look in his eyes told her he understood her offer, was maybe considering.\nShe fished in her pocket for a lighter, held the barely visible flame to the corner of the painting.\nThe mother put a hand over her mouth. “I want the real one.”\nEleanor held her hand still, the flame still two inches from the paper. A little wind might take the flame to the paper, but she stood still and unreactive. Her brother David had wanted her to burn it no matter what, had said each NFT should be purely digital. She had wanted to save the paper with equal fervor. He was crazy to think this would save the elephants, and so why give up the one sure thing? Even if the tourists who watched the painting didn’t buy it, she could sell it on their website.\nThe girl looked confused. She sidled toward her dad.\nEleanor pressed. “If you buy the NFT, I’ll also give you the paper copy. You can be the only person in the whole world who owns the physical and the digital experience. That’s the photo,” she added, nodding at the camera and the ring light. It held the video of Siaal painting the last line of sky, and if this man bought the NFT, she would use it to take a careful photo of the painting. “That goes with the NFT.”\nHe frowned down at the sere grass beneath his feet.\nEleanor crossed her fingers behind her back.\n“How much?”\n“A thousand dollars.” Eleanor held her breath.\nThe mother shook her head and turned to walk away.\nThe little girl took her father’s hand.\nThey didn’t seem rich. Well, they had to be some variety of rich to be here. But not super-rich. More like a middle-class family who had stretched for a very rare vacation. Was she asking too much?\nDavid’s voice in her head: you have to set the price high enough to attract the next buyer. The flame danced inches from her fingers; she felt the heat on her knuckle where she clutched the trigger tight, keeping the dancing flame engaged with the air and just out of reach of the painting.\nShe held her ground, feeling like a destructive, desperate angel. They had a month in expenses due. Maybe. A thousand dollars would cover almost another week. And if the NFT sold to anyone else, another week. Or more, if David knew anything at all. And if this family didn’t buy it? The next tourists wouldn’t be here for eight days.\nThe man looked down at his daughter, took her chin in his palm, whispered something she couldn’t hear. Then he straightened and returned his attention to Eleanor. “If I can have the number one.”\nA smart move. Another thing David had told her not to do. He had said the two of them should buy the number one. As if they had a thousand dollars. Crazy brother.\nHe’d left this to her. She could choose to bluff, but they couldn’t afford to lose. So she nodded in return, and he smiled, and so did she. Eleanor let go of the trigger on the lighter and moved her hand away.\nAfter their orange jeep drove away, she jogged to the elephant enclosures. The three elephants in the large enclosure had stripped most of the acacia trees. The sight filled Eleanor with a familiar sense of frustration and helplessness. Three elephants were all they could feed and care for by hand. Or protect, for that matter. She hadn’t had the heart to cut off their tusks, and that decision made them targets. Although she couldn’t see how anyone could stand to harm them. She adored every inch of their wrinkly faces and trunks.\nWhen she and David came here, she was just shy of twenty, and the preserve had hosted almost a thousand animals. But then, they received regular checks from governments, from rich people, from a handful of nonprofits. Now, she was thirty-one and David was thirty-three, and they only made enough to keep ten drones fueled to watch the poachers, and money to pay three locals to act as drone-runners. Ten drones against far more poachers. Not enough.\nAll three of the young elephants had lost their herds. Two cows, Emma and Angel, and Siaal. All three were African elephants, with large ears and gray bodies that shaded brown in the morning or evening light. They were friends, but not a herd. With no old elephants to guide them, she and David kept them safe by keeping them close. Siaal was as close to a pet as possible for an elephant. Eleanor had trained him to paint in hopes of drawing tourists. Elephant painting had been a fad in the early 2000s, but then it came out that the elephant artists were mistreated. She had carefully trained Siaal with kindness and marula fruit. She wrote poetry and read it to him, and oddly, she thought that helped. Not that he understood the poetry, but he liked her company enough to stay near when she perched on the enclosure wall and read to him. He was lonely enough—and young enough when she started—that it worked.\nHer brother came up to her from inside the pen, shadowed by Emma, who had taken to following him around and periodically tapping his shoulder with her trunk. The average male human being dwarfed David, and Emma made him look even shorter. “Well?” David asked.\n“I had to give him number one, but he paid our minimum.”\nHe shook his head. “You are too weak,” he said, his words serious but not unkind. “This is the very first elephant painting NFT. It could be worth a lot.”\nShe sighed. Her brother might have gone off a digital deep end. “If only Siaal was named Jack Dorsey.”\nDavid laughed. “Maybe we should have named him Tweet.”\nShe shrugged. “That’s almost a week of food for them.”\n“Two days. It cost money to set up the sale.”\nThe breath of hope that had been fluttering around her heart faded, but she said nothing. They’d have to sell an NFT to every visitor. She still felt amazed they’d sold one. “For all of them?”\nHe climbed up to sit next to her. “Just this once.”\n“I gave them the real thing, too.”\nHe returned to shaking his head. “You really don’t believe in NFTs, do you?”\n“The little girl wanted it.”\nHis voice had a little tease in it. “You’ll see, sister.” His eyes shone. “This will work!”\nShe gazed out across the dusky enclosure, picking out Siaal’s bulk by the pond. Her favorite elephant needed for her brother to be right.\n“You’ll see,” David whispered.\nThe next morning, she opened her mail while she nursed her first cup of bitter coffee. Three bills, two past due. One request for a visit. In three weeks. An older couple. Lastly, a note from the father. He thanked them for the visit, and closed the letter with, “Thank you for the NFT idea. We shared the video with Annalisa’s grandmother, and she bought the second NFT. We told her she didn’t need to because she could see ours any time. We even posted it on our FamilyOuting page. But she wanted to thank you for the visit. Support the elephants.”\nHer next sip of coffee tasted better.\nWhen she shared the note with David, his smile lit the whole kitchen. “I told you! I bet we will sell them all today.”\nShe wasn’t at all sure why anyone else would buy one. It was a miracle there was a grandmother willing to buy something she couldn’t possibly need just to say thank you. David had carefully explained to her all NFTs were on the digital galleries and that strangers could buy them, but why would a stranger care? But it felt so good to see him look happy that she didn’t even tell him about the bills.\nThe next day, the mail brought nothing but another bill. The days dragged, three hot and one unbearable. One, blessedly, with rain.\nNo one purchased the number three.\nThey went over the bills together the night before the next visitors came, guessing at how little they could get away with paying each of them to stay afloat. Well, she amended silently, to keep sinking slowly.\nThe anticipated tourists arrived in three jeeps, rumbling up the washboard road and sending the smell of disturbed dust high into the air. The jeeps looked battered, and the geriatric people in them creaked carefully out of the wide doors with David’s help. She had to help three of them across the uneven ground to the chairs. She did her usual morning lecture, telling the tale of how she and David, two college kids back then, came here and just couldn’t leave the elephants. Then they patiently assisted all eight tourists back into the jeeps. David sat in the lead jeep, directing them off through another dust cloud. While they were gone, Eleanor set up the easel and the ring light, fretting so much about Siaal backing up around the chairs that she rearranged them three times. It had to be perfect. She had to sell the paintings.\nWhen the jeeps rumbled back two hours later, David jumped out and the vehicles kept going, their wheels dusting the air with bits of road as they went. He flopped down on one of the plastic chairs. “They were too tired.”\nEight visitors paid for a few days of expenses. There were more than a few days before the next tourists would come. She glanced at David, mouthing the title to one of her poems. “Damn the Hard Sharpness of the World.”\nHe responded with another title. “Hope for the Elephants. Thin but Real.” Well, a title and a first line.\nThe older couple came. Just the two of them. They enjoyed the lecture and the tour, and she fed them each a glass of cold beer while Siaal painted his boat scene. A single sailboat on a river, a high bank, two trees, and the streak of blue that he always ended with. The woman drowsed against her husband’s shoulder, her gray hair sticking to her forehead even though David had erected one of the bright blue tarps as a sunshade.\nThey stayed seated while Siaal backed away. He bowed to them anyway, obedient and well trained. She tossed him an extra marula and turned to the couple. “Did you like that?”\nThe man smiled. “I suppose you’ll sell us the painting now.” His voice sounded flat.\nShe spoke carefully. “If you want it. We’re turning each piece of work Siaal does to NFTs. Do you know what they are?”\nThe man smiled again, his smile a pale pink line that just barely curved up the edges of his face. “A way to convince people to buy things that are freely available. Not me.” He stood, holding a hand out to help his wife stand. “But we’ll give you ten dollars for the real version.”\nTen dollars? She had already checked the recording of Siaal painting. It was good. “We burn them, so that the painting only exists in digital form.” Anger drove her to tug the lighter out of her pocket and clutch it tightly in her sweaty hand.\nThe wife stirred just enough to hold out a hand. “Thank you for your story. The elephants are lucky to have you.”\nEleanor bit back a retort and tears and walked them to their jeep. Everything about their slim tourist trade depended on reviews. “Thank you for coming. We hope to see you again.”\nAs she picked up the chairs and stacked them carefully in the animal-proof brick shed, every step felt heavy and slow. After she was done, she started walking. By herself. Not a good idea in Zimbabwe, but she carried a gun and circled near the house she and David shared, a half-mile circle she repeated over and over, her steps soft on the dry earth. How were they going to keep from losing this place? What would happen to Siaal, to Emma, to Angel? The whole goddamned world ought to care, dammit. Elephants were smart, and beautiful, and social, and they felt emotions as least as deep as humans. Maybe more.\nWhy didn’t everyone care?\nThe easel and the tripod with its cheery light still stood in the cleared field. In the dusk, it looked like a pathetic attempt to brighten up a four-year-old’s artwork. An early evening breeze curled one edge of the paper. She walked up to it, stared. She checked the phone she used as a camera, found the battery full and the device on.\nShe pushed record, turned toward the camera, and jerked the lighter out of her pocket. Her hand shook as she spoke to the camera. “We . . . ” Her voice stuck in her throat. “We wanted to save them.” She pictured Siaal the same way they had lost so many other elephants, dead with his tusks ripped free and his body left, utterly without value to humans as soon as it lost both ivory and the light of intelligence. Tears stung her eyes. “We wanted to save them.” She moved her hand and let the flame catch the edges of the paper. The simple little boat burned quickly, the blue line the last bit of color to succumb to the rush of flame. In spite of the fact that no spark caught on the grass, it felt like the sanctuary was on fire.\nEven though she probably didn’t need to, she sprayed everything down with water from a hand-sprayer they’d staged here. She felt like the sanctuary was burning all around her, but she wasn’t going to kill it herself. She lugged the easel and tripod in, tucking them safely out of the African night in a corner of the veranda.\nDavid came in ten minutes later. He washed his hands, and as he dried them, he asked her about the sale with a simple, “Well?”\n“They offered ten dollars for the paper copy. That was all.”\nHe pulled two pieces of bread out of the fridge and rummaged deep in its guts, emerging with a jar of peanut butter. The set of his jaw told her he felt like she did.\n“I burned it.”\nHis words were clipped. “Good for you.”\nShe pointed toward the old phone. “I recorded it.” She let out a long sigh. “I’m going to bed.”\n“You’re not hungry?” He opened the jar and waved it under her nose.\nShe stepped back. “I’m too tired to eat. I’ll see you at breakfast.”\nShe shut the door to her room, pulled out her journal and three colors of pens. The she spent two hours writing viciously horrid poetry before falling asleep in her clothes.\nEleanor woke empty and rumpled. She finished her first cup of coffee on the screened-in porch, watching the savannah wake up around her. The warm, dry heat of dawn was usually her favorite time, but this morning even the distinctive call of a hoopoe in the bush willow tree beside the house brought sadness instead of pleasure. Yet another piece of the savannah she would miss terribly.\nShe put off checking email by sweeping the porch and wiping the counters. Finally, with nothing left of her morning routine, she sat on the big wicker lounge with her tablet on her lap.\nEmail alerts scrolled down her screen so fast she couldn’t count them as they went. Tens? More.\nShe felt suddenly afraid. What if they’d been targeted by someone, or some fanatical organization? She knew of a rescue operation that shut down because a visitor accused them of profiting from misused animals. Which she knew for a fact that they hadn’t been. Emails kept scrolling in.\nShe put the tablet down as if it might bite her. Made another cup of coffee. Came back, her heart racing even before she took a sip.\nThe uneasy fast-scroll had stopped. Two thousand three hundred and seven new messages.\nThe top one said the NFT number twenty-three had just sold for twenty-two thousand dollars.\nShe just stared at it, uncomprehending. David had only made ten.\nShe wanted to get up and pound on David’s door. Instead, she started plowing through the alert emails. Another sale. A request for a visit. Three notifications of sales, ten social media shares, another request to come see Siaal.\nShe got up and found an old yellow pad and a workable pen, sorted the mail by topic, and started tallying. David would do something smart with spreadsheets later, but that wasn’t for her.\nThe numbers didn’t feel real. Enough money. More than enough. She would have to turn some visitors away, or rehire staff, or both.\nNear the bottom of the emails, she found a note from her brother. “I shared your poetry. I didn’t want to wake you. I thought it would be fine.”\nNot the crap she’d written last night? She’d been so angry. Surely it wasn’t ready to share yet! Her heart sped. Their website collected all of their social media feeds, so she opened it and found an entry from late last night titled, “Hope for Elephants.”\nThin but real, threaded like tails\nto trunks. How do you keep\nsomething too big to hide safe?\nMaybe you don’t\nHe’d put in all five stanzas. And at the bottom, a video of her burning Siaal’s picture. Not of Siaal painting. Her, full of angry words and destruction and tears. In the video, her hair looked like she’d slept in it. Her cheeks were red, one fist clenched.\nDavid found her stunned, twirling her empty coffee cup in her hands, staring at the squiggles on the page and no longer able to even understand them. Gray eyes full of worry, he sat beside her and scooped her into a side hug. He picked up the pad of paper and stared at her scrawled totals, eyes narrowing. He glanced at her, and she shook her head, unable to find words. Her eyes were full of water, and her hands shook as she rubbed a stray tear from her cheek.\nDavid plucked the tablet from her lap and scrolled through the messages. Then he went to his desk, silent.\nShe brought him coffee, knelt by his side. Her voice came out in a whisper. “Is it real?”\nHe smiled and nodded, his feet tapping on the wooden floor. “I think it was the poetry. And the look on your face as you burned the picture.”\nShe smiled back at him and burped, rubbed at her swollen eyes.\n“We told a story, and people bought the story. I put out a run on fifty NFTs and then I went to bed. Nothing had sold then. I had a shot of whisky and felt like you look.”\nShe fisted her hand and hit him in the chest. Lightly.\n“They all sold before midnight. Our time. Morning in other places.” He stood up and paced. “It had to have been the story.”\nShe swallowed. “How much money?”\nThe number he gave her made her knees weak. She stepped into him.\nHe held her. “It was all you, sis.”\n“No. No it was us. And Siaal.”\n“And poetry.”\nThey went, hand in hand, to check on their charges.\nBrenda Cooper writes SF, fantasy, poetry, and an occasional non-fiction essay. She is particularly interested in robotics, climate change, and the social change that must go hand in hand with fixing the human relationship to the natural world. She is the Director of Information Technology at Lease Crutcher Lewis, a premier Pacific Northwest builder. Her love of technology, science, and science fiction combines to drive her interest in the future.\nBrenda lives in Washington State with her wife, Toni, and their multiple border collies, some of whom actually get to herd sheep. She loves to exercise, garden, read, and talk with friends."}