{"fingerprint": "g3MTCGRgsqpbe8szOqcACgsOBJc=", "sitename": "Clarkesworld Magazine", "title": "Callme and Mink by Brenda Cooper", "author": "Brenda Cooper", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cooper_10_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Callme and Mink by Brenda Cooper", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4320 words, short story\n Callme and Mink\n Julie stepped outside into the first light of morning and opened the door of the chicken coop. She tossed leftover white rice onto the ground. The chickens scurried for breakfast, throwing thin and busy shadows across the grass. She scooped the nearest hen and took it to the side of the house, snapped its neck with a flick of her wrist, and plucked the colorful feathers into a bin by the garage door. Back inside, she gutted the bird and boiled the meat free of the bones.\n Julie prepared breakfast. This morning’s bottom layer was stale, dry cereal from a cupboard four houses away and a fist of last night’s rice. She added the heart and liver, and then white, soft meat from the chicken’s breast.\n Callme curled with her back to the corner and watched Julie’s every precise move. The old border collie often knew more about their surroundings than Julie, and so Julie trusted her to help guard. This morning, Callme’s ears pricked forward in benign interest as she focused on the younger dog, Mink, a two-year-old male golden retriever. Mink sat straight and pretty, his nose up, his ears alert to every flick of Julie’s knife.\n She ordered each dog to its food spot: Callme to the corner by the fireplace and Mink to the bottom of the stairs. It took two minutes for Mink to settle, tail thumping.\n Julie bent at the knees to set the dishes down so that each hit the stone floor at the same moment. While the dogs’ rough tongues and eager noses scraped the metal bowls lightly across the floor, Julie peered out the kitchen window at the chicken coop, and beyond it, toward the beach. Her weather app suggested ninety-two degrees with a soft wind, low tide in an hour and three minutes. A perfect day for the dogs.\n Ten minutes later, Julie set the dogs’ clean, dry dishes on the counter, ready for dinner.\n She closed her clothing over her joints to keep the sand out and braided her silky hair into two long braids to keep the wind from wrecking it. When she opened the door, Mink bounded out. Callme followed, then turned, swirling this way and that as she did her best to watch both Julie and Mink.\n Julie dropped to all fours. The three of them raced toward the waves. Mink plunged directly into the surge, but Julie went no further than the sea-foam at the edge. Callme pranced beside her while Mink bounded joyously into waves almost as tall as he was. Everything about him looked healthy—his fur bright with drops of salt spray that sparkled with midmorning light.\n Julie watched him duck in and out of the waves, throwing his head up, prancing. She and Callme circled each other, raced up and down the sand, and circled again. They glanced at Mink regularly, ready to go in if he faltered. But he knew the water now, no longer stumbling with excitement or turning his back to the sea.\n When Callme looked exhausted, Julie whistled Mink back. All three loped along the beach, disturbing raucous crowds of seabirds. Julie avoided empty glass bottles and bright green and blue shards of plastic and broken shells. They alone shared the vast expanse of warming sand until they reached the pier. There, a simple non-gendered carebot wheeled an old woman down the wooden boards, her face turned into the sun and breeze. Below the old woman, two repair bots scuttled along the sand, taking advantage of the low tide to scrape barnacles away from the pier’s supports.\n Julie stood, ordering the dogs to heel as she walked down the old main street toward Jack’s Ice Cream. The building sagged on one side, and two of the windows needed paint and fresh panes of glass. When Jack could get milk from one of the town’s fifteen cows, it opened. Yesterday, it had been closed. Today, the swinging half-door hung open. Jack stuck his head out and gestured her toward him. He was small, slightly hunched, an old man with wheeled prosthetics. His face had been splotched red from years of sun. His broad smile elicited a return smile from her, a casual note in her programming. If a human smiles at you, and is no threat, then smile back.\n The dogs raced to the side of the building and lapped water from the bowl he kept in there for them.\n “I found a family for you to consider.” Jack filled two tiny cups with ice cubes and frozen cream for the dogs. “They can use the help.”\n Julie took the cups from him, knelt, and placed them as carefully as she had the dog’s breakfast. “When will they come to me?”\n “This afternoon. After lunch. Only the mom knows the dogs exist.”\n “Thank you.” She had come to Jack’s every day the weather allowed the dogs out. During that time, Mink had grown into a stable, well-trained two year old. He had been ready for six months, but no one suitable had come to town. The gates and loops of logic inside Julie’s head should be settling into a pleased relief, and the beginnings of new programming designed to let him go should be gating open. She didn’t feel that yet. Instead, she watched her own reaction with something like puzzlement. Must it be time?\n As if he heard her, Jack said, “It’s time, you know.”\n Some humans seemed to react to her thoughts as well as her facial expressions. This was especially true when she saw humans often, and she had seen Jack one hundred and fifty-two times in the last three years and eighteen months. He had found good humans for her twice.\n Julie stood and watched Mink finish his treat while Callme’s pink tongue flicked around the edges of her half-empty cup. She knew Jack required a verbal response from her. “Yes.” It was time, but she still did not feel settled about the conclusion. Her programming learned. It had to. She would never have survived four decades since her release without adaptation. What made it stutter? “I don’t want to learn attachment.”\n Jack laughed. “Is there anything else I can help you with?”\n She turned around and lifted one of her braids. “Behind my ear.”\n Jack opened the bottom door and rolled out. He bent down to examine her neck. The tips of his fingers felt warm. He fished in his pockets for a multi-tool and then used the tweezers to pluck something from behind her ear. “How did you get a splinter there?”\n “Was that it? Maybe fixing the door on the chicken coop yesterday.” She swiveled her neck back and forth. “That’s better. I guess I’ll go home and wait.”\n Jack scooped up the dogs’ bowls, stopped, looking right at her.\n “What are you trying to say?”\n “I hope you don’t move on yet. You told me you might.”\n “It took four hours to forage yesterday.” Do not ally yourself with a single human. To do so is to weaken your gift to all mankind.\n He cocked his head at her. “I know your programming has nothing much to do with me, except that I’m a resource.” He reached down to pet Mink. “But I also know you won’t hurt me, and I like you in the neighborhood.” He hesitated. “I feel safer with you here.”\n She had long ago calculated that Jack was trustworthy. He had been here when she arrived, an old man with health problems and a store he’d owned for fifty-seven years. “You are a resource. Who else would have found that splinter?” When a human helps you, help them.\n He smiled, his eyes a little sad.\n Not lying to him meant she didn’t signal emotions she didn’t believe were appropriate. She could signal most feelings back to humans, but they were always a lie. She acted. She did not feel. She chose a patient configuration for her face. “I will do as I must.”\n There was only a little bitterness to his laugh.\n “Who am I watching for?”\n “A woman and two children. A boy and a girl. The girl is about seven.”\n “One adult?”\n He hesitated. “That was all I talked to. They came for ice cream three times before I spoke to them about what you do.”\n “Thank you.” She called the dogs to her, dropped back to all fours, and led them in a bouncing chase up the beach. Outside, she cleaned off the bench by the front door. She blew the sand from her feet and her clothes, making sure no small tear or puncture had let any of it inside of her. Then she blew the dogs clean, sand flying away from the air hose and losing itself in the grass. Satisfied, she led them all in. Each dog curled up for a post-play nap. Mink’s fur smelled of salt and ocean, Callme’s of sand and crabs.\n The chickens scratched contentedly in the yard. She had between one and two hours, by her estimate, before the people Jack had spoken of arrived. She started her daily code review, looking for mistakes, following branches and tidying up stray instruction strings that had created themselves overnight but went nowhere. She reviewed and snipped files that did not matter. The color of the plastic cap she had accidentally stepped on halfway between here and Jack’s. The creaky hinge on Jack’s top door. Then she reached back and removed more details from the previous week.\n She reviewed her interaction with Jack closely. He liked the family. He wanted them to succeed. Everything in his micro-expressions calculated as factual, truth in which he believed.\n Still, her algorithms flashed a fifteen percent risk. High. She had less information than usual.\n She had done this twelve times in twenty-two years. The first family had been brought to her by her trainers. She had found the rest on her own, except the three Jack had helped with. He had also told her where to find Mink, behind a broken tractor-trailer with three other puppies. She had chosen Mink and left the others; she could only raise and feed one. She hadn’t gone back to see if they lived.\n Julie moved to the front porch and watched. She spotted the three humans approaching before they found the house, but stayed completely still. Observation time was valuable.\n The woman was easily as tall as many men. She wore long green pants, black boots, and an orange tank top. Her skin glowed a burnished brown. A wide black pony band kept her hair from her dark eyes, allowing it to spill down to her broad shoulders. The boy, almost her height, still sported the skinny shoulders and awkward gait of a young teen. He was also some form of mixed-blood dark, but the girl he carried on his hip had fine red hair and freckles. Her long legs dangled down past his knees, her legs too long for her worn jeans. They spoke in low tones, peering at houses, but sensibly not approaching.\n They looked more confident than a group that size should, especially weighed down with the girl, but Julie’s analysis suggested competence rather than bravado. The boy whispered in the girl’s ear often, and twice she laughed.\n Julie stepped out into the middle of the street.\n The dogs woke at her movement, but the first thing she taught any of her dogs was silence. She could hear their toenails on the floor and Mink’s slight panting, but both would be inaudible to the family.\n The girl saw her first, stopping and pointing. She whispered at her brother. “She isn’t a robot.”\n He narrowed his eyes, peering at Julie. “She might be. See how straight she’s standing?”\n Before the girl could reply, the mother stopped them all with a wave of her hand.\n They obeyed, as silent as the dogs.\n Good. “I’m Julie.”\n “Jack sent me,” the woman said. “I’m Maria, and these are my children, Tom and Belinda.”\n Julie calculated the chances that Tom was her physical son as close to seventy percent, but the girl was not hers by birth. Older than Jack had reported, maybe ten. Old to be carried.\n Julie gestured toward the house she and dogs occupied. “Would you like to sit a moment and tell me about yourself?”\n Maria nodded. “Of course.”\n Julie waited as they splayed across her front steps, and then she leaned on the wall beside them, her posture calm and ready. If a human is new, then let them know you are strong and peaceful.\n “Why do you want a dog?” she asked.\n “For Belinda. She wants a dog more than anything, and she is wasting.”\n “I see that.”\n “She has a few years left. I would have her be happy.”\n Jack had decided not to tell her that the girl was sick. “How do you know her?”\n Maria raised an eyebrow. “I found her. Someone had left her by the road with a sign. Free.” She laughed. “Free like a puppy used to be.”\n Julie would not charge for Mink. If a human wants an animal, then find out if they can keep it safe. “Where are you going?”\n “South.”\n “North is reported to be safer.”\n Maria took a breath, and the boy clutched his sister. She snuggled in close to him, her eyes shining with her illness. “We came from New York,” Maria said. “I don’t know what ‘safer’ is, but it’s not safe.” She hesitated, her eyes drawn a little tight and mouth pursing. Signs of human thinking. “How long have you been here?” she asked Julie.\n “Two years and nine months and one day and three hours.”\n Maria laughed. “And not a minute more or a minute less.” The joy of her laughter left her face. “Your information is old. Many people have gone north, some with guns. We will keep heading south. I am a good forager, and Lou has enhanced hearing. This has kept us safe.”\n Julie glanced at the boy, clicking her teeth together very softly. “How many clicks did I just make?”\n “Seven,” he answered quickly, a sly but friendly smile on his face.\n She glanced at Maria. “Enhanced?”\n “As soon as he hit puberty. Some of the clinics still run, and we used to have resources. He can also see farther than me, but he can’t smell as well as a dog.” She blew out a breath, glancing at the girl. “Belinda wants one very, very much.”\n Belinda’s wide green eyes blinked up at her, but she said nothing. Another sign of competence.\n It was odd that Jack had not mentioned the competence or the illness. The enhancements. But humans often told robots things they would never tell another human. Jack probably did not know about the enhancement.\n Maria watched the front door, as if hoping that it would open and show a puppy waiting inside.\n Julie told her, “The south has been foraged almost empty. We have moved north every few years.”\n Maria cocked her head. “We?”\n “One of the dogs has been with me for eight years. She stays.”\n The woman nodded. “What do you need to know?”\n Julie’s algorithms decided Maria was sincere. When a human has told you all they want to, then watch how they act.\n Julie pushed herself away from the wall and opened the door. She went in first, checking that the dogs were in their places, Callme against the wall, and Mink in front of the wood stove. They were, each curled up, noses resting on paws.\n They watched her quietly.\n “Come in,” she called to Maria.\n Tom pushed through the door, his sister leaning on him but shuffling on her own feet. Good to know she could stand, even with help.\n Callme raised her head, ears pricked forward.\n Julie gestured a release to Mink, who stood, head lifted, tail flipping back and forth.\n The boy set Belinda to the ground beside him and sank to his knees.\n Maria’s bulk blocked some of the sun, her shadow covering her children.\n The two dogs stayed still.\n The only sound was the swishing tail and the slight excited breath of dogs and humans. Julie whispered, “His name is Mink. Call him.”\n Belinda whispered, “Mink.” The single word sounded like prayer.\n Mink glided over to Belinda, whining softly, and Belinda whispered, “You are beautiful.”\n Tom spoke over her head. “Gently.”\n “Yes!” Belinda buried both her hands in Mink’s fur.\n Julie stood and faced Maria. “I will have to teach you to care for him.”\n Maria nodded. “Someone told me that.”\n “Who?”\n “Jack. But before him . . . ” Her voice trailed off, her face lost in a memory. “One evening we met a man with a dog at his heels, and I had tea and a rabbit, and he had skillet cornbread. He told me that you existed, that you raised dogs to be companions. We could have found a stray, but Belinda . . . ” She shrugged. “Belinda will never be stronger than she is today. I can’t take the risk or time to tame a stray. This man’s dog was beautiful, and strong, and guarded our camp for a night before we parted.”\n “What dog?”\n “A black and white one. Big. Charlie.”\n Two dogs before Mink. “What was the man’s name?”\n “Joel.”\n She had liked Joel. A steady man, middle aged, stout, and afraid of most people. Verify your work when you can. Evaluate how well you do. “Thank you for telling me about Joel and Charlie.”\n Maria watched her children stroke Mink while he stretched out, relaxed, tail thumping. “Has anyone failed?”\n “Once. I had to take a dog back from a woman who couldn’t feed him.” When Marie said nothing in response, Julie asked, “Can you kill a chicken?”\n Maria’s eyes widened. “I suppose.”\n “Then we should start the dogs’ dinner.”\n “Where will we stay?”\n “There are four bedrooms here. Unless you want a neighboring house. The one next door has beds and linens.”\n Maria smiled. “Here will be fine. How long?”\n “Until you learn.” She glanced at the children, who clearly could not move very fast. “But I will exercise the dogs every day.”\n “Whatever you want.”\n “And you will have to feed yourselves. I do not eat.”\n “We will forage during the day.”\n “Come outside. I will introduce you to the chickens.” She glanced once more at the two dogs and two children. Callme watched, unperturbed, her ears relaxed. “They’ll be okay.”\n By the end of the third day, Maria was making the dogs’ food and both of the children had demonstrated success in giving Mink orders. More importantly, Mink had started to follow the children’s orders. Maria began to sing from time to time.\n Mink would make the family happy and bark if anyone neared them while they slept. He wouldn’t fight for them like Charlie might for Joel; it wasn’t his nature. But Charlie would never have allowed Belinda to brush him for hours.\n It would be time soon.\n Julie watched them all settle into bed and then took her place by the door, sorting through the synapses in her head. Five of ten evaluation flags had flipped to green. If two more flipped, she would watch the family walk away. It was likely.\n She didn’t like the direction they were going. If a human reaches a different conclusion than you do, find another opinion.\n A robot would be good, but the only three other robots she had seen in this town for months were low-level senior-care bots; they would provide her with no help. Very few mobile humans had settled here.\n No matter which direction they went, the girl would not survive. The woman and the boy might, and if so, Mink would love them and protect them. She slapped her thigh softly, signaling Callme to her, and then dropped to all fours, leading the border collie outside.\n The night air smelled of sea salt and overripe apples from a tree in the back yard of an empty house. No threats. Her eyes showed the heat of squirrels and rabbits, of a solitary and slow cat, and of birds roosting in the darkness. She and Callme walked side by side, slow, circling the block. Julie’s head ran through the routines of snipping what she didn’t need, what no one needed. She caught herself with an image of Mink that she had trouble deciding about. Mink as a puppy, two days after she found him. He looked round and soft and vulnerable. Maybe ten weeks old. The little sharp baby teeth had just been pushed free by his adult teeth, and his smile was still slightly lopsided. Do not become attached to more than one animal. Dogs are to help human hearts.\n What a strange phrase to be in her programming. She had always had it. One of the five mantras. Dogs are to help human hearts. Even though she was still far taller than Callme when moving on all fours, she could look the border in the eye far more easily than when she stood on two legs. Callme had learned over three hundred and seventy words. She said none of them. Here in the wild, Julie had no devices that allowed Callme to use human words. But she reacted to them, and Julie’s core programming knew how to read dogs.\n Dogs are to help human hearts.\n Julie had no human heart. Neither, by definition, did the dog beside her. But Callme had helped her raise three pups. She chose to save the image of Mink as a pup, but the next three she deleted. She had only saved a hundred images of Charlie, and a hundred of Grace, and a hundred of each of the others. Of Max, Gandalf, SusieQ, Sasha, Odin, Whisper, Buddy, Nixie, Thomas, and Pearl.\n Callme stopped in the middle of the road, so Julie stopped beside her. Two young ground squirrels raced across the road. The dark shadow of dark wings slid though a patch of moonlight. One of the squirrels gave a sharp cry as the hawk’s talons pierced its neck, and the other kept going until it reached a tree trunk. There, it stood on its haunches and screamed at the sky, then stilled and watched.\n Attachment. A futile gesture for the squirrel.\n She had to delete a hundred more memories of Mink before the red flag for attachment flipped to green.\n Julie led Callme home and quietly entered the house, where the dog curled into a ball and Julie sat and mentally flipped through pictures of the dogs she had sent to protect humans.\n In the morning, she took Callme and Mink to town while Maria and the children foraged for food. She allowed Mink his hour in the waves, which were low and soft, and she and Callme lay side by side on the warm sand.\n It was impossible to tell whether or not Callme knew she was saying goodbye to Mink. Likely. After all, some humans like Jack seemed to guess her thoughts. Callme was nearly as smart and spent every day with Julie. Familiarity bred knowledge.\n Jack’s Ice Cream was closed. A few old people and their minder-bots wandered down the main street with no apparent direction. No one unknown appeared to be in town. Her algorithms insisted on more about the difference between north and south, driving her to look for information all day before they petered out, the last of the looping calls to find more data stilled by the utter absence of information.\n She walked back fully wearing her human form, ambling on two legs. A woman and her dogs.\n Maria, Tom, and Belinda sat on the front stoop watching for them. Belinda brightened as they neared, and Tom carried her to meet them, setting her in the middle of the street so that Mink could nose her and lick her cheek. Belinda’s thin fingers stroked his side.\n Maria stood, keeping some distance, watching. When Julie, the children, and the dogs neared, she said, “I found three cans that are still good. Kidney beans. And dug up an onion from an old garden. There were more, but most were rotting. We need to leave soon.”\n Julie sat beside the woman, relaxing into a human-coded pose, her legs crossed and her spine soft. “I taught Mink to catch rabbits.”\n Tom brightened. “I’m a very good hunter.”\n Marie was silent a moment, her eyes on Belinda, who gazed at Mink as if nothing else mattered in the world. Maria’s eyes shone in the evening light, filling with tears she didn’t allow to run down her cheek. Her voice was soft. “Thank you.”\n “He will be a guard dog as well as a friend.”\n “You can come with us.”\n Do not ally yourself with a single human.\n “I cannot. But you can take a few chickens if you like. I will help you make a cage for them using a wagon. You can take it with you. I’ll have it ready by the morning.”\n “I’ll cook the beans.”\n Julie stood up and brushed the dirt from her pants. There was extra chicken wire in a garage four houses down. She signaled for Callme to join her and headed down the street.\n She and Callme reached Jack’s at noon the next day. The door hung open and he rolled out to greet them, carrying a single bowl of frozen cream.\n “Thank you,” she told him. “They took Mink.”\n He set the cream down for Callme and waited for her to start lapping at the white treat before he stood up and looked at her. “Will you be going?”\n “Can I help you fix the walls?”\n “Are you going?”\n “Not until spring. And not if you let me help you fix the walls.”\n He smiled.\n If a human smiles at you, and is no threat, then smile back.\n Brenda Cooper writes SF, fantasy, poetry, and an occasional non-fiction essay. She is particularly interested in robotics, climate change, and the social change that must go hand in hand with fixing the human relationship to the natural world. She is the Director of Information Technology at Lease Crutcher Lewis, a premier Pacific Northwest builder. Her love of technology, science, and science fiction combines to drive her interest in the future.\n Brenda lives in Washington State with her wife, Toni, and their multiple border collies, some of whom actually get to herd sheep. She loves to exercise, garden, read, and talk with friends."}