{"fingerprint": "gnr6dUgqqr/fRCYpf6VhcLdUc/M=", "sitename": "Clarkesworld Magazine", "title": "Community and Story: A Conversation with Zoraida Córdova by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/cordova_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Community and Story: A Conversation with Zoraida Córdova by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Community and Story: A Conversation with Zoraida Córdova\n Zoraida Córdova was born in Guayaquil, Ecuador. She immigrated to the US with her family on a family visa at age five or six, and grew up in Queens, New York. As a kid, farther back than she can remember, she watched X-Men, Gargoyles, Sailor Moon, and more, quickly discovering films such as Totoro, Merlin, Willow, and the Star Wars franchise. In other words, she has always been enamored with genre.\n In fact, at age ten she wrote in her diary, “Dear diary, I’m now a witch.” At age thirteen, Córdova read In the Forests of the Night by Amelia Atwater-Rhodes. Inspired by the fact that the author was fourteen when she’d published, Córdova decided she wanted to be a writer as well. Given a three-page short story assignment, she turned in a twenty-one-page story. At sixteen, she went to the National Book Foundation Writing Camp—ten days of workshops from professional writers. She wrote her first novel at seventeen, and at nineteen, she wrote what would become her debut novel: The Vicious Deep, published by Sourcebooks Fire in 2012.\n Driven by her passion for the fantastic, as well as a desire to create characters and settings that are otherwise underrepresented or altogether missing in genre, Córdova has produced an impressive body of published work.\n 2021 bestselling novel The Inheritance of Orquídea Divina, inspired by the idea of a woman turning into a tree and published by Simon & Schuster imprint Atria, comes after a string of creative projects. The Vicious Deep trilogy included The Savage Blue in 2013 and The Vast and Brutal Sea in 2014. Sourcebooks Fire began publishing her Brooklyn Brujas trilogy in 2014, which included Labyrinth Lost (2016), Bruja Born (2018), and Wayward Witch (2019). Disney imprint Lucasfilm Press published Star Wars: Galaxy’s Edge: A Crash of Fate (2019), and then Little, Brown published her Hollow Crown duology, with books Incendiary (2020) and Illusionary (2021).\n In 2020, Córdova also had The Way to Rio Luna with Scholastic, and she coedited anthology Vampires Never Get Old with Natalie C. Parker, published by Imprint (Macmillan). She also writes romance novels as Zoey Castile, serves on the board of We Need Diverse Books, and is the cohost of writing podcast Deadline City, with Dhonielle Clayton.\n Anthology Reclaim the Stars: 17 Tales Across Realms & Space is due from Macmillan imprint Wednesday Books on February 15, 2022.\n What were the books that were important to you when you first started getting into genre, and do you feel like people should read them, do they still hold up?\n The thing about formative books is that you always remember how they made you feel in the moment that you needed them. For instance, I remember reading The Catcher in the Rye in high school and thinking it was the book for me. In college, I had more questions about Holden and the things he complained about. The book didn’t change though. I had.\n My formative books were urban fantasy fiction coming out in the late nineties and early 2000s. In the Forests of the Night by Amelia Atwater-Rhodes is pretty much the reason I’m a writer. I found this book when I was in my senior year of junior high and discovered that the author was fourteen. It was at that moment that I realized that this teen girl, who took her author photo at a graveyard, was writing about witches and vampires and teen humans. I thought, “I can do that.” And so I read every book I could check out at the library in that genre. Vivian Vande Velde, Donna Jo Napoli, Holly Black, Libba Bray, Charles de Lint, Neil Gaiman.\n I recently reread Holly Black’s Modern Faerie Tales trilogy, which was super formative to me. It’s reissued as an omnibus with new cover art. I went right back to being a dreamy girl who loved her cityscapes peppered with magical beings. It held up for me. I would definitely recommend this one.\n How did Reclaim the Stars come about, how did it develop, and what were the biggest challenges to making it happen?\n It’s honestly a pandemic blur, but I think it was a series of events that compounded. End of year 2019 when the “listicles” and roundups for best SFF books came out, I searched for Latin authors, and they were few and far between. A publicist and writer at Tor put out a question on twitter: “Where are the Afro-Latinx authors writing SFF?” She got zero responses that applied to the question. Then, I had a conversation with another writer, and I posed the question, “If Latin America no longer exists in space or a secondary world, how do we code Latinos in SFF?”\n Just before the pandemic I went to my former agent and said, “I have this idea. I don’t know if anyone will want to publish it, but I’m doing it.” I emailed the authors who were already writing in the genre, and others who were writing contemporary but had expressed interest in fantasy, or it was already hinted at in their work but needed to be developed. Everyone I emailed said yes. The last condition with the submission to the publishers was that I wanted to have a contest for an emerging or unpublished Afro-Latinx author. We had so many great submissions that we chose two authors in the end—Circe Moskowitz and Linda Raquel Nieves Pérez.\n Reclaim the Stars is your second anthology, but your first as a solo editor, following Vampires Never Get Old (coedited with Natalie C. Parker). Are there important things you learned in putting together Vampires that you brought to Reclaim the Stars?\n I learned that organization is key! Natalie C. Parker is so organized, and I took all of that with me for this anthology. Keeping track of sixteen authors, their stories, paperwork, emails—it’s a lot to handle, but I love the challenge. And I love this collection, so going back to read these stories during the many editorial stages was great for me as a fan of these works.\n Reclaim the Stars is specifically centering authors and perspectives from the Latin American diaspora. This follows several major anthologies that focus on underrepresented or misrepresented communities, such as A Phoenix First Must Burn, A Universe of Wishes, Sword Stone Table, and more. When Reclaim the Stars came out with a major publisher, along with a handful of other titles, did it signal important changes in publishing?\n Reclaim the Stars is the first YA anthology centering on authors from the Latin American diaspora. I’ve been publishing since 2012 and it’s nice to no longer shout into the ether searching for community. But this is a difficult question to answer. The Latin American diaspora is so fraught, which is a conversation on its own. But when we call for representation, we have to really look at the marginalizations within our community that are often erased or left out of the representation conversation.\n Where are the Afro-Latinx SFF books? Nocturna by Maya Motayne is the only one in YA. The Sun and the Void by Gabriela Romero Lacruz will be the first one in adult. Who is publishing indigenous authors from Latin America? Can our community ever escape stories that center pain and immigration and still be successful? I can only ask these questions. Of course, I want more. But it’s publishers and agents who have the power to make this change.\n Fiction will only benefit when we have more points of view, and publishing needs to realize that.\n You are also an accomplished author, with several novels and short stories out. Your most recent novel, The Inheritance of Orquídea Divina, just came out in September of 2021 with Simon & Schuster imprint Atria. Does being an author who works in both short and long form inform your editorial process in certain ways?\n I started off writing short stories, actually. I do have a long list of rejections from literary magazines from college. Back then, I simply didn’t know there were SFF-specific magazines, and that Zoetrope probably wasn’t a right fit for my zombie short story. You don’t know what you don’t know, right? I think short stories contributed to the way I look at individual chapters, so they carry weight to the story on their own. Being a writer turned editor felt fairly natural to me because of the way I construct my fiction. I’m a hardcore outliner, plotter, mapper, whatever your preferred name for it is. I like breaking my work apart, and then putting it back together. I guess I like puzzles.\n Editing my own peers perhaps gives me the ability to empathize when they’re struggling with deadlines. (Maybe too much.) So, for me it’s a wonderful experience.\n On the other hand, has editing anthologies changed anything about your own writing?\n I don’t think it’s changed my writing, but when I read the work of my peers and it blows me away, the first thing I think is: I need to level up.\n Your first book, The Vicious Deep, was published in 2012 with Sourcebooks Fire. How did you get into doing anthologies—what was the draw, or what was the road that brought you to editing anthologies?\n For Vampires Never Get Old, I was in a pool on the Alabama coast with Natalie C. Parker and some of our contributors, Julie Murphy and Tessa Gratton. There was a lot of wine and writing (it was a retreat, after all). Natalie had already edited her share of anthologies. I had not. We were talking about vampires and how they’d never gone out of fashion, and I joked, “vampires never get old.” It went from there. Natalie and I work well together, and we might have more things in the pipeline.\n Were there stories that you really liked, but that didn’t end up in Reclaim the Stars for one reason or another?\n When I asked these authors to be in the anthology, they sent me story pitches of what they would write. I’d already read their books, or knew them personally, so I knew they could all deliver. And they did deliver!\n When you were making selections for the anthology, what were the most important things for you?\n The three sections are: To the Stars (Scifi), The Magical Now (contemporary fantasy), Other Times, Other Reams (high fantasy and historical fantasy).\n This actually came out last when I was trying to organize the stories. I realized I had inadvertently (mostly) grouped them because they paired well thematically. I moved more around, and it just came to me that I had three sections. So, when you’re reading, you can jump around!\n Which stories do you think may challenge readers more in some ways, and how so?\n All of the stories challenge readers in some ways because that’s what fiction should do. For some people, this might be their first entry into fiction by authors from the Latin American diaspora, and that’s great. Welcome! Others might already be in the know, or see their own families or experiences, because even when fiction is specific, we can see each other in our humanity.\n Daniel José Older’s “Flecha” looks at grief and what it feels like returning to a place when you never thought you would. In this case, a scifi story and a ravaged Earth. It made me think of so many people from Latin America who have had to flee their homes because of war, climate change, et cetera. What happens when you go home?\n In “White Water, Blue Ocean” by Linda Raquel Nieves Pérez, she digs deep into anti-Blackness in our community, and gender, all through a generational curse and Taino deities.\n If someone will read only two or three stories to see if the book is for them, which stories would you tell them to read, and why?\n I truly think there is something for everyone in this anthology. We have space princesses, magical markets inspired by Bolivia, farm boys with nature magic, paranormal romance, dystopia, monsters that need to be slayed, ghost stories, river pacts, and so much more.\n Is there anything else you’d really like readers to know about Reclaim the Stars, the authors and their stories, or yourself and your work?\n Reclaim the Stars is a labor of love and community. I hope that we can inspire readers to write their own stories, from their lens, and keep building the SFF canon.\n What else are you working on, what do you have coming up that you’d like folks to know about?\n I have a middle grade novel coming out called Valentina Salazar Is Not a Monster Hunter, and it’s my love letter to Supernatural. In my book, the Salazar siblings are monster protectors who steal the family van and road trip down the east coast to stop a magical egg from going viral. But a group of monster hunters are on their tail. It comes out June 28, 2022 from Scholastic.\n I’m working on my next books: an adult contemporary romance, a strange adult speculative book with no name yet, and my book for Phase II of Star Wars: The High Republic.\n I guess I’m keeping busy.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}