{"fingerprint": "sOAT4BYT7tLAEQfMDvMP+rjLzWw=", "sitename": "Clarkesworld Magazine", "title": "The Final Ascent by Ian Creasey", "author": "Ian Creasey", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/creasey_02_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Final Ascent by Ian Creasey", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9810 words, novelette\n The Final Ascent\n I’d seen a hologram of my withered lungs, and heard the doctors tell me I only had a few days left. So when Katherine arrived at my bedside, I couldn’t help reflecting that she was the last woman in my life. It had ended a year ago; she preferred the aliens’ company to mine. But still—\n “Kath, would you kiss me?”\n We had not parted on kissing terms. Nonetheless, she bent down and kissed me with an echo of our old passion. I savored the closeness, the taste of her, as her long dark hair tickled my neck. Now I had a chance to exorcise the resentment I’d hoarded since we split. Katherine was my last love, and I wanted to reconcile with her while I still could.\n She couldn’t hide her shock at seeing my shriveled body. Once I climbed mountains; now I could no longer climb out of bed.\n “Oh, Lucian,” she said. “This is awful. I’m sorry I couldn’t get here earlier. I’ve been working like a slave lately.”\n I suppressed a grimace at her alien idiom, and instead gestured at the hospice walls decorated with holos from family back on Earth and friends scattered across space. My mountaineering colleagues had sent pictures of the virgin peaks they’d conquered on frontier worlds. I’d added my own best ascents to create a collage of galactic summits in vast enigmatic skies, a climber’s vision of heaven. “This is how I’m dying. How do the Ardissans do it?” I asked, offering Katherine the olive branch of a chance to talk about her favorite subject.\n “They eat this.” She gave me a pot of green paste that looked like moldy guacamole. “Actually, they eat it every day anyway. But in your circumstances”—she winced as she alluded to my condition—“they would abandon all other food, and eat only this. It helps them prepare for the transition.”\n I accepted the sour-smelling paste with little enthusiasm. Yet for Katherine’s sake I ate a few spoonfuls. The green sludge had a peppery tang.\n Katherine said, “It’s called ‘wathrone,’ which means ‘spirit sight.’” She explained that the Ardissans constantly sought guidance from their ancestors’ ghosts. I struggled to concentrate as she described her research into the aliens’ religion. Her lecture reminded me of our field trips to their squalid villages, where funeral pyres so often billowed smoke over the stone huts.\n A faint blue wisp appeared high above my bed. Katherine noticed my gaze. “This is Orlind,” she said. “He’s one of the elders.”\n Like a fuzzy hologram resolving into focus, the figure imprinted itself on my vision. It was an Ardissan, a junior male: he had small stubs of antlers on his bearlike body. His fur was the deep blue of the sky at twilight.\n “How’d he get in here?” I asked. “And why is he floating?”\n “Because I’m dead,” said the alien. “That’s what your woman has been trying to tell you. We elders hover above to symbolize our higher wisdom.”\n “Higher wisdom?” I laughed. “You’re a bunch of Stone Age primitives.”\n Then the incongruity of the situation sank in, finally penetrating through the meds that wrapped my brain in cotton wool. “He’s really dead?” I asked Katherine. “And this wathrone stuff lets us talk to him?”\n She nodded. “The Ardissans kept telling me about their afterlife, but I didn’t understand until I ate the wathrone myself. It explains so much—”\n “Amazing,” I said. In my weakened state, my exclamation sounded feeble, an inadequate response to something so momentous. I wished I had more energy to congratulate Katherine, to drink a celebratory toast and dance with her. I tried to strengthen my voice as I said, “It’s a hell of a discovery—it’ll make your reputation.”\n “Oh, that’s just the first harvest.” From her hold-all, Katherine took out a gray box with mesh air vents. “I won’t show you what’s inside just yet, so as not to bias your expectations. But watch carefully.”\n She lifted the lid a fraction, and reached in. I couldn’t see what she did, but it only took a few moments. She closed the box with an air of finality.\n Soon I saw something emerge. A hazy four-legged shape floated up through the lid, and hovered in midair. The wispy form coalesced into tortoiseshell fur with a snarling feline face, and legs that scrabbled as though trying to catch purchase on something. It looked like a cat, like any of a million cats back on crowded old Earth—the world of my birth but not of my death.\n The cat yowled. I expected the hospice nurses to burst in, but no one came. The plaintive cry wasn’t a physical sound; I only sensed it through the wathrone, the same way I’d heard the alien. The cat screeched again, its legs still twitching. Then it hurtled away through the back wall.\n The sight made me shiver. It felt acutely wrong, far more so than the phantom Ardissan. Aliens were alien, after all, and might do anything. But the ghost cat violated my sense of the natural order.\n Katherine opened the box with the flourish of a magician concluding a showpiece trick. It contained a dead tortoiseshell cat with a bandaged head. A used syringe rolled beside the cat’s front legs.\n I didn’t know whether to applaud or vomit. “You killed that cat right in front of me?”\n “I gave an old, sick cat an afterlife, which otherwise it wouldn’t have had,” said Katherine. “I needed a demonstration, or you’d never have believed it.”\n “The cat’s ghost? I still don’t believe it! How did that happen?”\n “The aliens have a ghost-gland called an ‘akran.’ If they die with it intact, like Orlind”—she gestured to the alien, who was still watching us from the ceiling—“they become an elder. But the akran can be removed, to prevent someone entering the afterlife. It can also be transplanted. The Ardissans have long done this among themselves and their livestock. So I experimented with transplanting into animals from Earth.”\n I sank into the pillow, as if it would block out her next words.\n “I knew you were dying,” said Katherine. “That’s why I pushed the research so hard.” Her voice sounded almost as tired and weak as my own.\n Sweat prickled on my neck. I took deep shuddering breaths, and my frail chest stung with pain. “Just to be clear about this—you’re offering me the chance to be resurrected like that cat? Into an alien afterlife?”\n “Yes,” said Katherine, clasping my hand. “I know it’s a shock, and you’ll have lots of questions. Orlind will tell you what it’s like to become an elder.”\n Flummoxed by this bizarre offer, I wondered what the catch was. “You said the ghost-gland was transplanted. Does that mean I can only enter the afterlife if someone else misses out? And someone lost their resurrection so you could demonstrate it on a cat? That sounds . . . exploitative.”\n Katherine shook her head. “Don’t worry. When you see where the akranil come from, you’ll understand why it’s completely fair. Everything I do is vetted by an ethics review board, or I wouldn’t be able to publish.”\n She picked up the gray case with its grisly cargo. “Talk to Orlind, then think it over.”\n “You’re leaving already?” I said, hating how plaintive my voice sounded. But I might not see her again before I died.\n “I have to get some sleep before I collapse,” she said. “You don’t know how hard I’ve been working. I’ll come back, but is there anything else you need right now?”\n “It’s just . . . . ” I sighed. “I wanted to talk, that’s all. Go over old times, and sort some things out.”\n Katherine smiled. “There’ll be plenty of time for that. You’re not on a deadline anymore. When you’ve ascended, we can talk as much as you like.”\n “If I’ve ascended,” I said, but Katherine—already opening the door—didn’t hear me. She gave me a crossed-arms goodbye salute as she left.\n She’d adopted many of the Ardissans’ habits over the years. Would the same happen to me? If I entered their afterlife, would I stay human, or become alien?\n I’d never been religious, not even when the hospice chaplain tried to tempt me on my deathbed. It had all sounded so vague and insubstantial. Now the Ardissan version looked a lot more vivid and disturbing.\n “Give me the sales pitch,” I said to the patiently floating figure. “What’s it like being dead?”\n “There are many different roles,” said Orlind. “Warriors argue tactics and plan campaigns; oracles consult omens; storytellers create vast collective sagas. There are games of strategy and chance. The philosophers discuss morals, determining the correct action for every circumstance. Indeed, the favorite pastime of the elders is telling the groundlings what to do.”\n I detected an overtone of bitterness. “But you’re an elder yourself,” I said.\n “Only the eldest rule. More recent arrivals have lesser status.” Orlind pointed to his small stubs of antlers. “I have least of all, because when I walked the paths of the earth, I rebelled against my family spirits. I killed myself before they could remove my akran, but then I was ostracized in the higher realm. That’s why I’m here—I’ve long observed humans. When your woman ate the wathrone, I learned human speech and became her mentor.”\n “She’s called Katherine.”\n “Yes. It is an odd custom you have, letting your women have their own names and walk about by themselves.”\n The aliens’ own customs had sounded backward when Katherine described them. Their society was static, ruled by ancient elders; they had no notion of science or civilization. I’d often felt that the Ardissans seemed unworthy of Katherine’s attention.\n Orlind babbled on, talking of the benefits of the afterlife: the accumulation of wisdom, the bliss of advanced meditation. “No need to find food every day. No need to suffer pain with every illness and injury—”\n “We have painkillers for that,” I said, grateful not to have endured an Ardissan life so wretched that death perhaps came as a relief.\n “But you’re still dying,” Orlind said.\n Touché. Soon Orlind faded, his voice diminishing into scratchy subliminal whispers as my wathrone dose wore off.\n The next day, Katherine arrived carrying a med-kit emblazoned with the snowflake logo of chilled tissue-samples. I guessed what lay inside.\n “I may be in the anteroom, but I’m not at death’s door yet,” I said.\n “But why take the chance?” said Katherine. “You could suffer a relapse any minute.”\n “There’s a cheerful thought to brighten my last days . . . . ”\n “They’re not your last days.”\n “Oh, but they are,” I said. “I’ve thought about it, and I do appreciate your efforts, but I don’t want this afterlife.”\n Katherine looked nonplussed, as if I’d torn up a winning lottery ticket. “Why not?”\n “Because it doesn’t sound like somewhere I’d want to spend a wet weekend, never mind forever.”\n “Isn’t it better than the alternative?”\n I shook my head. “I keep thinking about that poor cat—you brought it back, but it’s never going to purr on anyone’s lap again. What can it possibly do now?”\n “You have more mental resources than a cat,” said Katherine. “You’ll find new interests. Orlind told you what the elders do.”\n “But I’m not an alien,” I said. “I know you mean well, yet you’re so close to the Ardissans, you don’t realize how most people think of them. To me they’re just a bunch of savages too stupid to develop technology and so backward they don’t even give women their own names.”\n “Eventually, other humans will join you.”\n “Are the aliens happy with that?” I asked. “Do they have enough spare glands for the whole human race?”\n Katherine waved this aside. “We can figure out how to synthesize the akranil. And we’ll agree something with the Ardissans. Surely the afterlife is bigger than just this planet. You can explore and find out!”\n “Sounds like a tough job. They’re pretty warlike, you always said. I bet they can make it hellish for their enemies.”\n She gave me a disappointed look. “The old Lucian had a more positive attitude—that’s what I loved about him. No mountain ever scared you.”\n “And death doesn’t scare me,” I said. “I’ve faced the end of my days, and come to terms with it. But you seem to think I should be so afraid of death as to chase any alternative.”\n “Are you sure you’re not just afraid of the alternative?”\n I opened my mouth to deny it, then paused. I’d invested a lot of effort in accepting mortality, in tying up the loose ends of my life. Had I tried so hard to face death that I embraced it unnecessarily?\n Katherine’s arguments swept down on me like an avalanche. “You were always so proud of being the first to climb a new summit. Now you can be the first human in the afterlife, the trailblazer for all those who follow. Think of the millions of people across the galaxy who are dying every day—don’t they deserve another option? They need an informed opinion, a guide who’s brave enough to meet the ancient spirits and confront whatever lies beyond.\n “If you find the best path for ascending the afterlife, you’ll be remembered forever. I’ve been working so hard on this because I wanted to save you, and give you the honor of being the eldest of all the human elders.”\n Eagerness shone on her face. I realized that if I rejected Katherine’s offer, I would be rejecting Katherine all over again. I’d longed to reconcile with her, but I’d foolishly imagined doing it on my terms. I had to give some ground, too. Otherwise I would die while stuck in the old mire of resentment and regret.\n “Kath, I’m sorry for doubting you. If you really think this is worthwhile, then go ahead.” I closed my eyes. “I’ll start one last climb into the unknown.”\n “King of diamonds and queen of clubs,” I said, after floating back through the test chamber’s layers of shielding.\n “King of diamonds and queen of clubs,” repeated Xavier for the benefit of the experiment’s recordings. Katherine’s research assistant had consumed wathrone to hear me; my ghostly form didn’t register on any mechanical sensors. “Okay, that’s enough for today.”\n “Did I pass?” I asked sardonically. “Do I exist?”\n “For me, sure,” he said. “What they’ll think back on Earth—who knows?”\n I was in no rush to persuade anyone. I’d agreed to the tests because I understood the importance of scientific verification; but having only just dipped my toe into the afterlife, I wasn’t yet ready to summon a press conference to say, “Come on in, the water’s fine!”\n Xavier closed up the lab, and left to take a shower before his evening gig at the Retro Lounge. Before I died, I’d never noticed just how many hours people spent on mundane activities such as washing and eating and sleeping. I needed none of those, and the empty time weighed me down.\n The nights were the worst. I had no bed, no rest, no dreams to pass the slow dark hours. I could watch TV, but not change the channel. I could watch the whole life of the town, but not take part. Another night loomed before me like an enormous, implacable glacier.\n I darted around the complex, knowing that somewhere Katherine would still be at work. I found her composing yet another paper for Xenology Review. “How’s it going?” I asked.\n “I’m on deadline,” she said, without pausing. “Just let me get this done.”\n I waited an hour, reading over her shoulder, until she broke off for a drink and a snack.\n “Remember our first trip out?” I said. “When the flitter broke down—”\n “I do, but we’ve already talked about all that,” said Katherine, gently dismissing my attempts at reminiscence.\n “I’ve only been dead a week,” I said. “Have you tired of me so quickly?”\n “No, but I can’t spend all day chatting,” she said. “I have work to do. We all do—even you.”\n “Xavier’s clocked off. And we’ve finished the tests.”\n “Then why are you still here?”\n “Where would I go?”\n “Anywhere. There’s a whole world outside—maybe a whole galaxy beyond.”\n “But . . . . ” I didn’t want to say it: The aliens are out there. I imagined them like yetis lurking on high slopes, waiting for unwary mountaineers to leave the safety of base camp.\n Katherine knew me well enough to guess my thoughts. “You’ll have to meet them eventually,” she said. “You can discover their customs, learn how they navigate the afterlife—”\n “Another project for you to write up,” I said. I had always come second to her work in life; why had I thought that things would change in death? I was just another research assistant, in convenient spirit form.\n Yet she was right. I couldn’t hide forever. I must meet the Ardissans eventually, and I’d need to understand them.\n That night I sought out Orlind and asked him to teach me his language.\n “Come close to me,” he said.\n I drifted nearer until our ghostly essences met, with the slightest of tingles on my nonexistent flesh. I began to hear his mind, at first as an indistinct mutter. Then his thoughts became clearer. I sensed his fascination with human technology, and his frank interest in me as a novelty. Underneath this lay weariness and ennui. I felt him delve for memories of when he learned to speak. He pushed them toward me.\n For an instant, a deluge of language poured into me, along with a torrent of childhood events and emotions. I recoiled. The connection was overwhelming, almost drowning my identity. I flinched with instinctive revulsion, and we broke apart. I was embarrassed at my reaction; he bore it phlegmatically.\n The language lessons continued with less intimate instruction. It took time, but we had plenty of that. Orlind took me on a long journey to show me where Katherine acquired her akranil. We floated through thunderstorms without a shiver. I drank in the sights of lakes and valleys, though the familiar vistas reminded me painfully of better times with Katherine. Our shared love of Ardissa’s vast hinterland—beyond the human huddle of Greenfall Station—had originally brought us together, and we’d often traveled for her fieldwork and my mountaineering. Katherine updated the planetary gazetteer with the natives’ place names and local lore, while I added my observations as an amateur scientist and professional adventurer. We bonded as we riffed off each other’s contributions, with remarks too frivolous for the official record.\n I’d always filmed my expeditions. On Ardissa, I compiled montages of Katherine and I traveling across the planet, talking about everything and nothing, exchanging banter and falling for each other. She encouraged me to film her, in case her research grants ran out and she had to reinvent herself as a celebrity xenologist. We joked about this, taking turns to impersonate TV announcers on sleazy shows. “Tonight on BizarroScape, out-of-this-world sex—do aliens have better orgasms?”\n The idyll didn’t last. I began to resent how she was always knee-deep in research, while Katherine complained that I treated her as just another conquest alongside the planet’s virgin summits. When we broke up, I channeled my anger into daredevil climbing feats—and pushed myself too far.\n Now I relived those memories: the heat of the volcano, the noxious smell of its fumes, the fall that punctured my lung, and the festering infection that finished me off. More painful still were recollections of Katherine, from fondly treasured moments to the final tense exchanges. I told her that she worked too hard and spent too much time with the aliens; she protested that I didn’t take her work seriously, that I looked down on the Ardissans and therefore on her. How I wanted to take back those words, and start again . . . .\n Orlind snapped me out of this stupefying daze with his regular language drills. But I knew I couldn’t always count on external rescue. I needed to find my own path through the fog of self-recrimination, and signpost the way for anyone who might follow.\n Afterlife Gazetteer—The Swamp of Regrets. Ghostly existence lacks the sensual immediacy of a living, breathing body. Your memories may become more vivid than the world around you. It’s tempting to wallow in recollections of life, but they can trap you, sucking you into the if-onlys and the remember-whens and the why-didn’t-I’s . . . . Wallowing in the past is dangerous because you’re retreating from the present, and it can’t change anything. You’re dead. Deal with it.\n I dealt with it by focusing on the language lessons while we traveled across the planet. Because the elders had ostracized Orlind, our route avoided populated areas. Nevertheless I caught glimpses of farms and villages, which looked just as primitive as I remembered from Katherine’s research trips. Orlind confirmed that the Ardissans didn’t practice crop rotation, fertilization with manure, or other such procedures commonplace on Earth. In a form of ancestor worship, the elders held the race’s entire store of wisdom, and directed every detail of the groundlings’ lives. They discouraged innovation; the most senior were the most conservative, those who’d lived in the remotest past and considered it a golden age. The living didn’t defy the elders, not if they wanted to reach the afterlife themselves. Rebels, criminals, and slaves were forbidden to ascend, while any warrior who let himself be captured was considered too cowardly to become an elder.\n At last we reached our destination, a group of stone buildings on a snowy plateau, far from any other habitation. It had the air of a remote monastery, albeit with the defensive walls and ditches of a castle, as though doctrine was fiercely contested.\n Orlind identified this stronghold as Mallarn. “There are no elders here, other than rare visitors like us, but you can meet the groundlings and learn why they sell their akranil.”\n He entered in search of someone who could see him, and returned to say, “Arnil has invited us to the banquet tonight, when they will eat wathrone and talk with us.”\n Mentally worn out after the long journey, I wished I could sleep for a while, but I’d left that behind along with my body. Instead I dropped into a trance until the shadows lengthened.\n Afterlife Gazetteer—The Abyss of Sleep. As a ghost it’s hard to rest at all, never mind rest in peace. If you try to sleep, you just sink slowly into a fathomless abyss without ever reaching the bottom. It’s better to meditate and empty your mind. Remember how you used to breathe, and imagine your form gently pulsing with each inhalation and exhalation . . . .\n In the evening I followed Orlind to the banquet hall, where I saw a spread laid out: roasted meat, dried fruit, a few spices. The feast was not especially impressive by human standards, but here it was surely a cornucopia.\n Indeed, some of the Ardissans were extremely fat. Others came into the hall staggering as if drunk or drugged; and yet others entered arm in arm, in pairs or threes or fours, pawing and nuzzling each other. Everyone had a scar on their neck: they’d shaved their fur to display it.\n “The scar is from removing the akran,” Orlind explained.\n I wondered which Ardissan had provided the akran that resurrected me, and if it made any difference. Katherine had surely kept records.\n “Welcome to our feast!” said the leader, Arnil. He had the biggest antlers and the fattest belly of them all.\n We could not, of course, partake. “Are they trying to make some kind of point?” I asked Orlind.\n “They often eat like this,” Orlind said. “Katherine pays them with food.”\n I’d finally convinced him to call Katherine by name. I remembered her saying that food was the least disruptive reward—the least colonialist intervention—she could give the natives in return for their help.\n Arnil led his followers in a toast. “To pleasure!” At this word, uttered with a suffix indicating holiness, the revelers raised their cups and downed the contents. Then the banquet began.\n “How are you finding the afterlife?” Arnil asked me, as he selected precise combinations of spiced meat and fruit.\n “Challenging,” I admitted. “Why have you renounced it?” If they were happy to sell the ghost-gland, was it really worth buying?\n “Because the sole satisfaction of the dead is to interfere with the living. There’s no other pleasure in the afterlife, is there?” Arnil sucked droplets of grease from the fur on his thick, fleshy arms. Where he couldn’t reach, his followers licked him clean.\n “It’s true that we don’t have the pleasures of the table or the bed,” Orlind said. “There are intellectual pursuits . . . . ”\n Arnil snorted. “More meat!” he called. “These insipid spirits make me hungry just looking at them.”\n Orlind told me, “The elders rarely come here: there’s no point, as these groundlings have made the ultimate rebellion. But Mallarn appreciates the occasional visit from renegades like myself, to confirm that the afterlife really is devoid of the pleasures they value. They love flaunting their diversions before those who can’t enjoy them.”\n “Are there lots of rebels?” I asked, wondering if I’d been suckered into an afterlife that most of the planet disdained.\n “No,” Orlind replied. “These are a few mavericks, despised by the rest of the world. Most decent folk won’t bring themselves down to the level of slaves and criminals.”\n As the evening progressed, the feasters indulged themselves to the point of uncontrolled excretion—the Ardissan equivalent of vomiting. The amorous rutted in the spaces between the tables, or on the tables in the remains of the food. And everyone drank and drank, though it took them a long time to get drunk. The crude clay vessels contained a weakly fermented fruit juice.\n “Don’t you have anything stronger than that?” I asked Arnil as he led yet another toast.\n “It’s traditional, from Ulbim’s clan.” Arnil pointed to one of his fellows.\n I approached Ulbim and suggested that the beverage could be made stronger. Since I owed my ghostly existence to Mallarn’s hedonists, I wanted to repay them by helping in some way, and I couldn’t give them food as Katherine had done.\n “It’s my ancestors’ recipe,” he said. “We have drunk it for as many generations as there are stars in the sky. And you suggest we change it? You have no rightful standing—you soil the afterlife with your presence.”\n “I’m only trying to help. And why do you care whether I pollute the afterlife? I thought you all despised it.” I pointed to the scar he bore.\n His muzzle wrinkled in disgust. “We’re not all the same. Everyone here has renounced the afterlife, but for different reasons. I was a sinner, unworthy to enter the higher realm, so I exiled myself. But how can you be worthy? Did you obey the elders and live by the precepts of honor?”\n “Probably not your idea of honor,” I said, thinking of the vast gulf between human and Ardissan lifestyles.\n “Then you should never have been allowed to ascend.” He stalked away, then turned to cry, “I shit on your grandfather’s bones!”\n “Never mind him,” said an Ardissan without antlers. “We love our pleasures—if there are stronger drinks, we want to hear about it. What do you suggest?”\n I appreciated this more receptive attitude. “Now that it’s winter,” I said, “you could try leaving fermented drinks outside overnight. That should give them more bite.”\n My interlocutor was Ranis-tra-Laru—a description roughly meaning “brewer.” Females lacked antlers and hence lacked status; she did not have a name, only a current task. Despite the mutiny against the elders, Mallarn still allocated labor by traditional gender roles.\n When the next frost arrived, I taught the brewer how to strengthen drinks by freezing them and discarding the water-ice, leaving the alcohol behind. The following feast grew wilder and drunker than ever before. The banqueters toasted Ranis-tra-Laru, while Ulbim brooded at the perversion of his ancestral recipes.\n Orlind took me aside. “Congratulations on your first harvest. Throwing away the ice! This whole world is ice-bound, frozen in the customs of generations past. Banishing that ice would be a grand project.”\n “Sounds like a lot of work,” I said.\n “Then how else will you spend your days? If you want more choices, you need more company. Now that you’ve had a longer taste of the afterlife, isn’t it time you told Katherine you’re doing fine? Every moment you delay, there are humans dying who might prefer another option.”\n I knew that, but I didn’t want to be pressured into a hasty decision. “Why do you care? Why are you so eager to see humans in the afterlife?”\n “Self-interest,” Orlind said. “Bringing humans will cause change—and from my lowly position, any change is more likely to be an improvement than not.”\n “Ah, yes.” I sympathized, remembering Orlind’s ostracism. “But it’s too soon for me to say that the afterlife’s fine. I’d hate to urge people in, only to regret it.”\n “Then take as long as you need,” said Orlind. “We’ll talk when I return.”\n “You’re leaving?” I said, horrified at the prospect of being the only ghost in Mallarn. “Why?”\n “I have things to do, places to go, messages to deliver,” he said.\n His evasiveness made me wonder what lay behind his departure. I realized that by teaching the Ardissans how to make stronger drinks, I was directing the groundlings from the afterlife. I had taken on the traditional role of the elders, the role denied cast-out Orlind. Perhaps he felt bitter.\n “You can help me,” I suggested.\n He made the throwing-away-trash gesture that was the Ardissan equivalent of a head-shake. “They only listen to you because you’re human, and have new things to tell them. I have no wisdom needed here.”\n “But I’ll be alone without you.” Already I felt the crushing weight of countless nights ahead, while the inhabitants of Mallarn slept, and I haunted the stone edifice with nothing to do and no one to talk to.\n “If you want human company, you have only to give the word.”\n Clearly Orlind felt that abandoning me would make me lonely, hence more likely to urge people into the afterlife. I resolved not to act from such selfishness. Casting about for other companionship, I remembered the tortoiseshell cat that Katherine had resurrected before my death. A pet would be something, at least. I asked Orlind if we could find the cat.\n “I expect it has already been found by the royal coursers,” he said. “There’s little enough hunting in the afterlife that every scrap of prey is soon seized and swallowed up.”\n This chilled me, and dissuaded me from seeking out other elders until I felt safer in my new form. After Orlind left, I threw myself into the affairs of Mallarn, talking to whoever would speak with me. While some of the residents had renounced the afterlife to the extent of refusing to eat wathrone, others had a more open attitude. Being human aided my acceptance, as I wasn’t part of the oppressive hierarchy of elders. Even so, I had to phrase any advice as a tactful suggestion rather than an order. Yet the groundlings began to welcome my input when they saw that I proposed better ways of doing things, whereas the elders always emphasized tradition.\n From Katherine I’d absorbed the core tenet of xenology: no colonialism. I wasn’t killing the aliens, or bringing disease, or stealing their land. I was only talking to them. And they wanted to hear what I had to say.\n The folk of Mallarn mainly sought new and pleasurable ways to fill their days. I helped them design musical instruments, and explained the principles behind octaves and scales. They already had some basic sports such as foot races and the javelin; I suggested other games, and soon they played football—albeit with the dried, leathery heads of former malefactors. The Ardissans had primitive ideas of justice, with wrongdoers quickly exiled or executed.\n I considered many of the aliens’ customs, such as the subjection of females into anonymous servitude, to be as backward as their farming and sewerage practices. But I couldn’t transform a whole culture overnight. Even the small changes I’d already instigated had caused a few of Mallarn’s inhabitants to leave in disgust.\n New recruits arrived, replacing the dead and departed. I attended the next commitment ceremony, at which the neophytes consumed wathrone, then looked into the afterlife to renounce it. After an elaborate convocation, each bared their neck. Arnil cut deep into their skin and removed a scrap of flesh, red with blood.\n When the neophytes had all surrendered their akranil, they consumed tonics that quenched pain and stoked euphoria. Most of them began a mass rut, celebrating their dedication to pleasure and their abandonment of anything beyond.\n I was about to withdraw—I’d already seen enough of that kind of thing—when I noticed Arnil carrying a pot full of harvested ghost-glands. I followed him outside, where I saw a flitter parked on the plateau, and a human figure unloading crates of food.\n “Katherine!” I exclaimed.\n She crossed her arms to return Arnil’s salute, then waved up at me. Arnil gave her the pot of akranil, which she stowed in the flitter’s cold store. He summoned servants to carry the crates inside.\n At the banquet, Katherine looked around with keen interest, noting every detail of the hedonistic abandon with her xenologist’s gaze. Her eyes widened in surprise when the musician struck up a tune on his crude guitar. And Ranis-tra-Laru’s new beverage made her splutter with its stronger kick.\n She looked at me grinning down from the ceiling. “Lucian! Is this your doing?”\n “Sure is,” I said. “I thought they could use some help. The Ardissans aren’t intrinsically primitive—they’re just held back by the dead hand of the elders. On Earth, we progressed by discarding the outmoded ideas of the past. We couldn’t have done that if we’d been ruled by our ancestors’ ghosts. Would we have abolished slavery if our slave-owning grandfathers still reigned? Would women have gained the vote under the patriarchs? Would science have ever advanced if the earliest, most prehistoric ideas were enforced from above?”\n Katherine said, “I usually disapprove of interfering with the natives—and so does the ethics review board. But I guess it’s impossible to bring humans into the afterlife and expect zero interaction. It’s such a big deal that it must have an impact.” She sounded as though she was rehearsing excuses to tell the editors of Xenology Review.\n “Don’t worry,” I said. “This is so huge, they can’t possibly not publish it. You just need to record what happens, for science.”\n “Yes. It’s interesting that the Ardissans here in Mallarn will take direction from you, even though they’ve rebelled against the elders.”\n “If they want an education,” I said, “how can we refuse? We can’t deny them knowledge. It’s more ethical to teach them than not.”\n As we talked, Ulbim entered the banquet hall and stormed toward Katherine. “Is this your doing?” he demanded, pointing at me.\n “I permitted Lucian to ascend,” she said, using the ritual formulation. “What else did you think I wanted the akranil for?”\n “I thought you were a fool, because surely humans could never ascend. Yet with some foul sorcery, you’ve tainted the higher realm.”\n I protested, but Ulbim ignored me.\n “No more witchcraft,” he said. “This stops right here!”\n Ulbim clutched Katherine’s hair, forcing her head back. Then he grabbed an obsidian knife from the table and slashed deep into her throat, sawing with the glass blade while Katherine flailed against him.\n Reflexively I rushed to intervene, but my incorporeal arm went straight through them both. And already it was far too late. As blood pumped out, Katherine gave a soft, wet, bubbling gasp. When Ulbim let go of her hair, she slumped to the ground.\n Her mouth kept moving, though she had no air or voice to speak with. After a moment I realized what she was trying to say.\n I shot over to interrupt Arnil’s remonstration with Ulbim. “Run to the flitter and get an akran!”\n They both turned to stare at me. Ulbim said, “You humans violate our sacred afterlife. I forbid it!”\n “I am master here,” said Arnil. “And the afterlife is nothing to any of us, as we’ve all renounced it. But the human female brought food in exchange for our unwanted akranil—”\n Ulbim bellowed defiance, then lowered his head and charged. Arnil dipped his own antlers to defend himself. With a great crash, their heads locked together. They both snarled, swiping at each other with their claws.\n I turned to the onlookers, begging them to go and get an akran for Katherine, whose life ebbed redly onto the floor. But everyone crowded round the fighters, waiting to see who won. No one would risk helping me, in case Ulbim triumphed.\n Frustrated to the core of my being, I impotently observed the combat. I could only watch and hope. I wished I had the authority to stop the fight and simply command the outcome. For the first time, I understood why the elders felt the need to control the lives of the living. I knew what was right—how dare Ulbim defy it? He’d stayed in Mallarn when others who resented me had left; clearly he’d been waiting for Katherine to return.\n The aliens fought using retractable claws, and antlers sharpened with flint scrapers. Their grunts and panting breath echoed around the stone hall. Ulbim screeched as Arnil clawed his ear, tearing it into a bloody flap hanging down his cheek. The antlers disengaged, then crashed together again. Arnil’s weight started to tell, and Ulbim slid backward. Ulbim lashed out in a desperate frenzy, catching Arnil’s neck and gouging clumps of blue fur. Arnil roared with rage. He struck back with powerful scything blows that raked Ulbim’s face and chest.\n The end came quickly. Ulbim, having been forced back and back, raised his head to expose his throat, signaling surrender. Arnil paused, and the onlookers cried out. “Kill!” “Mercy!” “Kill!”\n Arnil pointed to the doorway and said, “Begone! I banish you from my hearth, and from the hearths of my family and followers. I banish your descendants to the fourth generation. At dawn, let your shadow never stain my land again.”\n Ulbim scurried away, under a hail of stones and knives thrown by the crowd. Arnil sat down with a thump, and several followers rushed to lick the blood from his wounds.\n “Get an akran!” I cried.\n Wearily, Arnil waved permission. Ranis-tra-Laru hurried to the flitter, where I explained how to open the cold store. She grabbed the pot and carried it back into the hall.\n Katherine lay on the floor, silent and still. Arnil knelt, uttered the benediction permitting ascent, and carefully placed one of the glands within her wound. As he pressed it into her flesh, I saw Katherine flinch in pain. She lived!\n Blood pooled onto stone. Arnil tried to feed her one of the pain-quenching tonics, but she was beyond such help.\n He said, “She was our honored guest and deserves the proper rites. Build the funeral pyre! We shall remember her with a feast.” Servants hastened to fetch firewood.\n A spectral haze rose from the body, then coalesced into a recognizable shape: a younger, idealized version of Katherine.\n “Lucian,” she said, her newfound spirit voice tremulous with the shock of death and ascent.\n “Katherine.”\n We drifted toward each other. As I stretched my arms to embrace her, we melted together with just a faint tingle. In all the days of my death, I had never missed so much the simple pleasure of touch. We communed wordlessly for long timeless moments, mourning her life cut short. I sensed Katherine’s agonies of regret: she’d grown complacent about visiting Mallarn, neglecting self-defense precautions. I castigated myself for not warning her about Ulbim’s resentments.\n I offered as much comfort as I possessed. I projected a vision of the Afterlife Gazetteer as an old-fashioned book, a reassuringly hefty tome of practical advice—albeit with many blank pages to fill. I’d been lax, staying in Mallarn rather than exploring more of the afterlife, but how could I have known that Katherine would die so soon?\n Katherine’s presence evoked my memories of her, and likewise I perceived her own memories of me. Scenes sprang up, newly vivid through the dual perspective. I smiled to see how handsome and strong and loving I appeared—then cringed at the petulance that followed. At the same time I felt Katherine’s jolt as she saw how her behavior had seemed obsessive, how the drive that initially attracted me later repelled me.\n Just recalling that period broke our rapport. And if I’d anticipated some effortless reconciliation that would magically dissolve our differences, I soon realized it wouldn’t happen. Seeing each other’s viewpoint didn’t automatically make our views the same.\n Yet at least we had experienced each other’s perspectives. Now Katherine knew that I’d never intended to exploit her or demean her work; and I better understood how she’d felt when seemingly reduced to a decorative extra in my planet-hopping life. Perhaps this was a step toward bringing us closer.\n I refocused on our surroundings: the Ardissans stripping off Katherine’s clothes, slitting her belly to remove the guts, hacking off limbs, casting them onto the flames, squabbling for the best portions . . .\n “Is this one of the customs you’re so keen to record?” I asked.\n Katherine looked on, rapt, as Arnil and his followers consumed her flesh. “Of course,” she said. “This is an honor.”\n “I’m glad you feel that way about it,” I said. Although I found the spectacle upsetting, I felt sure that Katherine could provide all sorts of social, ritual, and nutritional justifications for it.\n She sensed my distaste. “Be careful what changes you suggest. That distillation process you’ve given them will probably create alcoholics. It’s not so easy to decide what’s really an advance.”\n “You could help me—your knowledge of their culture would show us the best ways to make progress.” I imagined the ideas spreading: practical improvements first, then social changes such as gender equality and the end of slavery.\n “Is this something you really care about?” asked Katherine. “Or are you just meddling to pass the time? I’m sure it boosts your ego to be the source of all human wisdom.”\n “Maybe there’s an element of that,” I conceded. “But what else can we do?”\n Katherine paused. “Well . . . do you want to talk?”\n “Sure. What about?”\n “Everything,” she said. “Now that I’m dead, I guess I have time to slow down.”\n Orlind returned with news. “The elders have called a crusade,” he told Arnil. “They’ve vowed to destroy Mallarn stone by stone. They say that after defying the elders, you now compound your dishonor by allowing humans to ascend.”\n I remembered the deserters who’d left in disgust at my arrival. No doubt they’d carried tales back home. Was I responsible for sparking a war that might destroy Mallarn? I felt guilty, yet also excited. Progress would do little good if confined here. The rest of the planet had to follow, or at least be given the chance. Was the crusade an opportunity?\n Katherine said, “Maybe we should leave, if our presence threatens Mallarn.”\n “No,” said Arnil, “you’re just an excuse. The elders have long hated us, and a crusade was inevitable. If the hour has arrived—so be it.” He waggled his antlers defiantly.\n Our conversations turned to war. The Ardissans were accustomed to conflict and already had a formidable array of tactics. But their weapons were crude. With my limited expertise, I tried to improve their arrows and catapults: not easy with only local materials.\n I’d imagined a “boot camp” scene like in the movies, with myself as the gruff instructor. It didn’t work out like that. Some hedonists refused to devote themselves to training, arguing that by abandoning their pleasures they would be betraying Mallarn’s ethos. And others were reluctant to submit to classic military principles such as the chain of command and fighting as a unit. Battle on Ardissa was a more individualistic affair, with honor the prime criterion.\n Nevertheless, we drilled and tested weapons and prepared as best we could. I almost looked forward to the battle, which would at least be some diversion from my dreary, bodiless existence. Reminiscing with Katherine had been bittersweet, emphasizing how pale and empty the afterlife felt in comparison to the happier times we’d had in life, in love.\n After returning from a reconnaissance mission, Orlind took me to one side and said, “You do know this is hopeless?”\n “Is it?” I said.\n “Their warriors outnumber ours. How many rebels live in Mallarn? Barely a dozen dozens, and half of them are too drunk to fight.”\n “But this is a fortress. The advantage lies with the defense.”\n “Yes, but the attackers don’t care whether they survive, because if they die bravely in battle, they ascend to the afterlife in glory. On the other arm, everyone in Mallarn has surrendered their akran. They don’t want to die, because they have nothing afterward. It makes them cowards, and cowards don’t fight well—if at all. You may recently have noticed fewer revelers at the feasts.”\n Indeed, as the crusade drew nearer, the inhabitants of Mallarn had begun slipping away in ones and twos.\n “That’s not necessarily bad,” I said. “Anyone who runs away has to go somewhere. And they’ll take my suggestions with them. Maybe progress will spread, even if Mallarn falls.”\n I tried to make myself believe it, but lately everything felt futile. The approaching army looked set to crush Mallarn. I couldn’t lift a finger to save it, because I had no fingers.\n “How do you stand it?” I burst out. “You’ve been dead for years, ostracized by the elders, and yet you still haven’t gone mad.”\n “It’s hard,” Orlind said with feeling. He paused, and I recalled the weariness I’d sensed in him. “There are ways of coping,” he said at last.\n “How?” I asked, eager to learn not only for myself but also for Katherine and anyone else who might follow me. In my role as trailblazer for humans in the afterlife, I was still searching for a path. Perhaps the search itself was the only way forward.\n Again Orlind hesitated. “I’d have to show you.”\n After what happened last time, I understood his reluctance. Yet now I’d been longer dead, and had spent far more time with the Ardissans. My previous revulsion wouldn’t recur. “Show me,” I demanded.\n “Are you sure you wish to end all the disquiet of this realm?” asked Orlind, using the declension of a ritual question.\n “Definitely.” I moved closer to him and opened up, ready to receive his thoughts.\n “Begone!”—“Slave vermin”—“Get away from decent folk”—“Dishonor and blasphemy”—“Banished forever.” A torrent of loneliness and rejection gushed into me. I reeled under the onslaught. Was this a coping technique? Surely not.\n I tried to break free, but Orlind held me fast. Again the poisonous emotions flooded in, and he followed them with painful memories of whippings and stonings.\n “Help!” I screamed into the ether. “Katherine!”\n I struggled to prevent Orlind from overwhelming me. As he attacked again, I let my sense of betrayal pour out. “Why?”\n My howl burned him, but he fought back. As he battered me with yet more isolation and despair, I felt a tinge of guilt among his anguish. He hadn’t wanted to turn against me, but he’d been promised an end to his ostracism. If he could purge the evil human presence from the afterlife, the elders would finally welcome him. They’d give him the antlers of a warrior hero.\n I tried to resist Orlind’s attack, retaliating with memories of the hospice, of my long slow slide into death. But I knew little of battle in the spirit world, and he had too much horror to scour me with. I could barely hold him off.\n Yet the onslaught stilled. Through our entangled minds, I felt Orlind shudder as Katherine flamed down like a starship incinerating natives with its landing jets. She imposed her own imagery on the conflict, cutting him with lasers and crushing him with skyscrapers. He retaliated with spears, which she vaporized with disdainful ease.\n While Orlind battled Katherine, I countered with all the ennui and frustration I’d pent up since my death. He shriveled under the double attack. I sensed Katherine coming closer to me as she ate into him, tearing his spirit apart.\n Orlind’s resistance vanished. Katherine and I found ourselves floating together in the air above Mallarn. Her personality had a different yet familiar flavor. She’d absorbed the remnants of Orlind’s mind.\n My relief and gratitude spilled forth in an outburst of emotion. “Thanks for getting to me in time,” I said. “I didn’t know you felt so superior.”\n “That was his feeling, not mine,” she replied. “That’s why it worked. He was so dazzled by our technology, I only had to present the conflict in those terms to defeat him.”\n “Poor Orlind,” I said. Yet I wondered whether he might have had this outcome in mind when he attacked. Whether he won or lost, either way his solitude would end. That was all he’d wanted.\n And I found it reassuring to think that ghostly existence didn’t have to last forever. Knowing I had an alternative—however drastic—reduced my fear of the stretching millennia ahead. Unwittingly, Orlind had given me a little comfort.\n Remembering his description of an invincible approaching army, I saw I had to stop deluding myself that I could single-handedly turn Mallarn’s hedonists into a force capable of fighting off the whole planet. This wasn’t a movie: a training montage wouldn’t be enough. I needed something more, and Katherine’s strategy had told me what it was.\n I drifted down to the flitter, which still stood on the plateau where Katherine had parked it before she died. Inside, I found the usual emergency kit, with rations, distress flares, and a blaster. Ranis-tra-Laru had returned the remaining akranil to the cold store.\n Soon we’d need to contact Katherine’s colleagues, before they became so concerned by her silence that they started searching for her. Katherine’s research team would surely be willing to trade for more ghost-glands, now that they were proven to work in humans. What price for life after death? We could ask for anything we wanted.\n Katherine had followed me into the flitter. “No,” she said.\n “What do you mean, no?”\n “I know what you’re thinking. You want to use human technology to defend Mallarn. But it’s not our place to take sides in their wars.”\n “We’re already on one side. We’ve brought this on Mallarn—we have a responsibility to get them out of it.”\n “And you think that would be the end? Do you really imagine you can give out guns before a battle, and afterward they’ll meekly hand them back?”\n I could see her point, but there were ways round it. “Blasters don’t have an infinite charge. They’re useless when it runs out.”\n “Until some black marketeer in Greenfall recharges them. Once you start giving out guns, you can’t stop. Is that the progress you want to bring?”\n “The elders despise humans and technology. Are you saying they’d suddenly change their tune?”\n “It only takes one, and the rest are forced to follow.”\n I stormed out of the flitter. “So we should just sit on our phantom backsides while we watch the armies tear this down?” I said, pointing to Mallarn looming from the snowy plateau in the moonlight. “If the crusaders win, you can say goodbye to getting any more akranil. No more humans in the afterlife!”\n And I realized that despite everything, despite the tedious hindrances of immortality, I was ready to report back from the lower slopes and say that the ascent was worth attempting. Yes, the afterlife had its trials and tribulations—like life, like anything worthwhile.\n “I suggest we speak to Arnil,” said Katherine. “He is the leader here, after all.”\n We had to wait till morning for Arnil to wake, then wait till midday before he ate wathrone. The delay reminded me anew that I had no power to act directly, that I could only whisper in Arnil’s ear and hope he liked what I said. I couldn’t afford to antagonize him. If he banned the consumption of wathrone, my influence in Mallarn would vanish.\n “The first thing we need to know,” said Arnil, “is how many crusaders we face.”\n Katherine said, “There are two groups, approaching from the south and west.” I wondered how she knew this; then I remembered that she’d swallowed Orlind’s memories. She went on, “Excluding slaves, the warriors are perhaps eighteen dozen.”\n Was that all? On this thinly populated planet, it probably counted as an army. And it comfortably exceeded the number of fighters in Mallarn.\n “We can show you how to use the flitter,” I said. “That will help.”\n Katherine shot me a disapproving look, but then said, “It can be used to evacuate Mallarn. If everyone left, there would be no one for the crusaders to attack.”\n “And they would have won without attacking,” said Arnil.\n “Evacuation would be a last resort,” I said. “Another option is to go out in the flitter and confront the army before it gets here.”\n Arnil’s muzzle twitched eagerly. “We can destroy them?”\n “We can frighten them off,” I said.\n If the enemy wasn’t scared of death, attempting to intimidate them with one flitter would be a long shot. Yet I thought it was worth a try.\n It didn’t take long to teach Arnil how to pilot the flitter. Soon we set off, Arnil flying slowly so that Katherine and I could keep up. She directed him southwest, until we saw the armies converging to attack Mallarn. Splotches of blue dotted the plateau, as if flakes had fallen off the sky.\n Elders hovered above the columns, occasionally darting ahead to scout the way. Some were small; others were huge with enormous fractal antlers. Those must be the most ancient, the ones who ruled Ardissa and smothered it in ignorance.\n Arnil set the flitter down at the convergence point, and we waited for the crusade to arrive. He stepped outside to meet the leaders. A group of elders approached, with a retinue of warriors and slaves. I drew back, wary of being attacked again. Consequently I heard little of Arnil’s address to the enemy, though Katherine explained the protocol for such encounters.\n The crusaders reacted to Arnil’s speech with shouts of “Never!” and “Human scum!” The elders tipped their antlers menacingly toward us, as Katherine and I hovered a prudent distance away from the scene.\n Arnil said a few final words, then returned to the flitter. He rose above the army, and began firing distress flares at them. Red and yellow explosions burst among the warriors. They fell back, scurrying away on all fours.\n But they rallied when they realized that the flares only burned rather than killed. They began throwing missiles—I heard dull clunks as stones and javelins bounced off the flitter—until Arnil flew up higher, out of their range. The horde waved their spears, tauntingly.\n Then Arnil descended again. I saw his furry arm sticking out of the window, clutching something. The crusaders fell like scythed corn as Arnil fired the blaster. He swooped low over the army, reaping a harvest of ghosts.\n “Lucian!”\n I jerked around at Katherine’s cry, and saw elders hurtling toward us. Katherine raced away, and I followed. I tried to imagine myself as a flitter, cutting effortlessly through the air. We fled across the sky while the elders pursued.\n Ahead, Katherine’s shape broke up. Blobs of spirit stuff flashed past me and fell behind. As I kept going, not daring to stop, I saw a slender figure still flying onward. What had happened to Katherine? I looked back to see the frontline of elders swoop on the stray fragments, gobbling them up. That delayed them just enough to give us a chance of getting away.\n I made a superhuman effort and caught up with Katherine, or whatever she had become. I shifted direction slightly, and she followed me toward a nearby range of hills.\n We crashed straight into it, then kept going within the rocks. For long minutes we dodged and weaved and trusted to the darkness underground. I saw no pursuers. After a while we stopped, exhausted.\n Huddled in the dark, we waited to see if they would find us again.\n “Are you all right? What happened to you?” I asked.\n Katherine said, “I dropped off Orlind, what was left of him. I figured it might distract them.”\n “Like a lizard shedding its tail,” I said.\n “I’m glad I did it. His mind was too alien to sit comfortably in mine, especially as he had so many more memories. I learned a lot, but I was worried that he might absorb me rather than vice versa.”\n We melted into each other in wordless comfort. I poured out my relief and joy that she’d chosen the human over the alien. Katherine clung to me as though she would never let go again.\n I sensed her annoyance that we’d had to flee before seeing the confrontation’s outcome. “I expect Arnil drove off the crusaders,” I said. “They can’t stand against human technology.”\n Remembering the sight of Arnil firing down into the helpless mob, I wished the victory had been won by the better argument, not the better weapon. Yet Arnil had only been defending himself and his way of life against enemies who’d vowed to crush him. Perhaps the deaths had averted a far bloodier battle.\n “What now?” asked Katherine. “Back to Mallarn?”\n “No. I’ve given them enough suggestions. The rest is up to them.”\n Katherine laughed. “Are you sure they can manage without you? Maybe you were just another type of elder. Instead of a dead hand holding them back, you were a dead hand pushing them forward.”\n “Give them some credit,” I said. “It wasn’t my specific input that mattered, but the idea of progress. Now that they’ve tasted it, I think they’ll want more.”\n But the only way to prove that would be to leave Mallarn alone, and let the hedonists advance—or not—at their own pace. Meanwhile we’d return to Greenfall Station, bringing news of the afterlife to the rest of humanity.\n “We’ll drop into Mallarn occasionally to trade for akranil, until we can work out how to make them synthetically,” Katherine said. “We’ll see how they’re managing.”\n I longed to know whether I’d inspired genuine progress. At last I understood Katherine’s curiosity, and shared it. But the Ardissans had their own path to walk.\n Katherine and I needed to find the best route for ourselves, and our future companions, as we climbed the endless mountain of eternity."}