{"fingerprint": "cwp0g8+O0KKZ+XlAK9pfE+d5c8Q=", "sitename": "Clarkesworld Magazine", "title": "Milla by Lorenzo Crescentini and Emanuela Valentini, translated by Rich Larson", "author": "Lorenzo Crescentini; Emanuela Valentini; Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/crescentini-valentini_01_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Milla by Lorenzo Crescentini and Emanuela Valentini, translated by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2810 words, short story\nMilla\nShe revealed her name on the second day, under the light of a sunset.\nMarek had mistaken the fairy-like voice in his head for a neurosis at first, a hallucination brought on by his long journey spent in cryo. But when she started mourning her planet’s vanished civilization, he’d reconsidered. He had encountered stranger things in his explorations than this mysterious new companion.\n“Marek?” she asked, as he crested a muddy slope. “What do you think happened?”\nMarek ignored the question, turning to look at the lush valley now spread out below him.\n“Record,” he said. There was a soft chime in his head as his cams activated. He pivoted slowly, trying to make the recording as smooth as possible.\n“What did you say?” Milla asked. Her voice echoed in the implant at the base of Marek’s skull. In the stillness, it seemed to carry all the way to the foothills of the distant mountains.\nMarek’s implant had been designed for basic data storage and computation. He couldn’t do either now that it was being hijacked by an alien AI.\n“Wasn’t talking to you.” The regulation helmet had an optic strip that provided a full feed in 360 degrees, but he’d given up on it the day before. Its bulky reconnaissance suite had snagged once too often in the sort of ivy that grew here.\nThe lenses grafted to his retinas did the job well enough, and once he had the comm system running, once Earth could see what he saw, nobody would give a damn about helmet protocols.\n“Marek,” she repeated. “What do you think—”\n“You tell me. You’re the one who should know.”\nHe turned away from the valley and started toward the tree line. There was a sort of resin oozing from under the bark; he paused to take footage. When he pinched a bit between his thumb and forefinger it smeared acid green against his white glove.\nSome kind of worm, pale pink in color, poked its head out from a crack in the trunk. It regarded him for a moment with six globular black eyes, then plunged back inside the tree cavity.\n“End recording,” Marek said, once he was sure it wasn’t coming back. He sat down in the shade, rolling his sore neck.\n“I have never seen that animal,” Milla said. “Once it did not exist. Oh, Marek, it was all so different!”\nThere was a reason Marek accepted solo assignments to the furthest corners of known space. He did not like company. He liked conversation even less. But something in Milla’s distraught voice, a voice that was ancient and childlike at the same time, made him want to comfort her.\n“Species migrate and evolve,” he said. “It’s the way of things.”\n“And not only that animal,” she continued, as if she hadn’t heard him. “The lion spiders, the staring crabs, the ponies: these did not exist in my time.”\nMarek cracked a smile hearing her use the nicknames he’d given to the local fauna.\n“Do you know the most terrible thing?” she asked.\n“No.”\nShe let out a small sigh. “It’s very beautiful now that they’re gone,” she said. “I know that is an awful thing to say. But it’s true. The green is so much better than the gray. The planet breathes again, in a rhythm I had forgotten. That everyone had forgotten.”\nThe admission must have pained her, because she spent the next several hours in silence. Marek kept working, serenaded by the calls of distant birds.\nMarek’s ship had simulated a twenty-four hour day during the journey, but now that he’d landed his body was quickly adjusting to Shiva’s light cycle—one of the traits that made him a good surveyor. On a planet with a six-hour rotation, he would have no trouble walking for three hours and sleeping the other three.\nOn the third morning, while Marek was working on the malfunctioning comm system, Milla came to him with delusions of divinity.\n“I have formed a hypothesis, Marek,” she said. “I am the divine will and protector of this place. I have governed its life cycles since time immemorial. My tears of joy seeded these forests at the dawn of the world.”\n“I’m not a philosopher, Milla,” Marek said warily. “If you can’t give me some useful information on this wiring, please don’t talk.”\nBut he was distracted again a moment later, watching a pony amble up to drink from the sparkling stream only twenty meters ahead. Marek found himself thinking that maybe, when the time came, this was the place.\n“I could die happy here,” he said, on impulse.\n“You want to end your life cycle here in my sunny arms, Marek?”\n“It’s just a saying,” Marek said sharply.\nThe animal trotted on.\n“I am not certain I am a goddess,” she admitted after a while. “The calculation was made in a single subsystem. But it does seem logical.”\n“Logical my ass. If there ever were gods, they went extinct, too. Everything does eventually. We’re just out here to get a few more bites at the apple.”\nHe grimaced as the comm system gave another mournful chirp. Transmission would have to wait until he was in orbit again.\n“This place is perfect, too. Earth should be hailing me as a hero right now. They should be coordinating the next launch. But instead the only person I can reach is an alien AI who thinks she’s a god.”\nAfter a long pause, Milla’s voice radiated from his implant.\n“There’s only you here, Marek. Where has everyone gone?”\nHe didn’t answer.\nIt was dusk when they spoke again. Marek was on the banks of a lake, watching swarms of electric blue birds that looked like miniature herons. Shiva’s moon was visible tonight, throwing soft light on the water. The lake’s surface rippled in the wind.\n“End recording,” Marek said. He had enough for the day. He took a blue cloth shell from his pocket, traced the activation strip with one finger, and tossed it to the ground. Moments later the mattress was ready to welcome his weary limbs.\n“There were lakes in my time, too,” Milla said. “But the water was pumped away to the cities. There were seas. Oceans. But they were badly contaminated then. Does your planet have seas?”\nMarek closed his eyes. “Yeah. Did when I left. They’re not in great shape, though.”\n“Then it must be a commonality among dominant species. Look at the ponies. I cannot communicate with them, and I imagine they would have little to say. They stand there and graze. They will never build towers of metal and glass, but they will never uproot a tree, either.”\n“Whatever your creators built has been gone for millennia,” Marek said irritably. “There’s nothing left of them but you.”\nMilla fell silent. Did she feel guilty for not preventing the collapse of her people’s civilization? For having slept while the world changed and evolved, leaving her behind? Marek felt a twinge of regret at his words. But maybe she was only thinking.\nWhen she answered, her voice was feeble. “I know.”\n“If you can remember what happened to them, maybe we can avoid repeating their mistakes.”\n“I do not remember, Marek. I told you: yesterday they were here, thriving, proliferating, taking up every square meter of space. I closed my eyes for a moment, and when I opened them I saw green instead of gray. I heard only you. And when you leave I will close my eyes and perhaps not open them again.”\nMarek considered Milla’s words. She was an AI caretaker of some sort, more advanced than the ones back on Earth, so advanced she kept forgetting what she was. Marek had tried to explain her probable former functions, and she had believed him—but as a transplanted skin, not something she felt internally.\nMilla’s blackout must have coincided with the end of Shiva’s civilization, whether by electromagnetic radiation or war or a colossal nuclear accident. She’d lain dormant for eons until Marek’s arrival reawakened her circuitry.\n“Or maybe I will keep my eyes open,” he heard her whisper as he drifted off to sleep. “Maybe I will never close them again.”\nMarek dreamed about thick-furred lion spiders scuttling away into the undergrowth, frightened by his footsteps. He pursued them; he knew they were keeping a secret. He ventured through damp twilight, following the patter of hundreds of feet.\nHe passed a fallen log coated in glimmering moss. Milla was there, naked, ageless, plants caressing her feet and spiralling up her calves.\n“I want to be a goddess, Marek,” she said, and this time her voice came from her lips, not from his implant.\nThe scuttling spiders, the rustling leaves, the living forest: all of it went silent. Behind Milla, swaying like reeds in the wind, Marek saw the shadows of the dead.\nShe spread her arms, and the forest trembled.\nUnder the morning sun the lake water turned transparent. Marek found the mossy rocks of the seabed inhabited by creatures similar to the staring crabs he’d seen in the streams—staring shrimp, maybe. Like their cousins, they followed his every movement with their swivelling eye stalks, curious about the intruder.\nWhen he dipped a sampling tube into the water, the shrimp disappeared under the sand. He filled and sealed it. The water looked clean, but the ship’s onboard analyzer would make the final verdict. Potable water would make this planet the perfect candidate for colonization.\n“How did you live on Earth?” Milla asked.\nMarek didn’t answer. He slotted the latest water sample into his case alongside the others.\n“You remind me of them,” Milla said. “It’s strange.”\n“Not really. Similar environments produce similar life-forms. Shiva is the closest thing to Earth I’ve ever seen.”\n“But you have seen it,” Milla said. Marek waited, uncomprehending. After a few minutes, she went on. “You know what happened to my people. So do I. They destroyed themselves. Warring, killing, contaminating. They did not respect life. Not their own, and not the drop of chlorophyll that journeys along a stem. Is it not the same on Earth?”\nMarek could hear the derision in her voice, and worse, the pity. He bristled.\n“When I find your transmitter, I’m going to smash it. Seems about the only way to shut you up.”\nSilence followed. It was an empty threat, of course: she could reach him no matter where he was, meaning she was most likely an airborne particle network, no transmitter required.\n“That was a joke,” he said. “I was joking.”\n“Promise me you will not be like them.” Milla’s voice was terse and frightened.\n“Can’t make you any promises on behalf of the human race, Milla. I’m just a surveyor.” He hunted for something reassuring to say. “But I know we’re coming here to live, not to die.”\nAgainst all odds, the answer seemed to calm her. “I trust you, Marek.”\nHe had collected enough samples for the first round of analysis and was returning to the ship. Milla seemed to be in a better mood.\n“I have been remembering more,” she said. “Your presence helps, I think. I have been remembering my creators’ arts. Their songs. Do you know of poetry, Marek? Would you like to hear some?”\nMarek emerged from the trees and saw his ship waiting in the clearing.\n“I would,” he said, with some genuine curiosity. It wasn’t every day he got to hear the work of an alien poet a million years extinct.\n“Alright.” Milla’s voice softened as she began to recite: “I circle around God, around the primordial tower, I’ve been circling for thousands of years . . . ”\nMarek felt the world split open. He stopped. Opened his mouth, gasped for air and then words. Milla was still reciting but he wasn’t listening. He put his hand to the base of his skull as everything, every single thing, took on a new meaning.\n“Milla.”\nShe paused. “Yes?”\nMarek broke into a run, down the slope, toward the ship, shredding through shrubs and grass.\n“Marek, are you alright?” she asked. Marek’s head pounded with the words of the poem:\nI circle around God, around the primordial tower . . .\n“Marek, tell me what is going on. You are frightening me.”\n. . . I’ve been circling for thousands of years, and I still don’t know . . .\nThe verses familiar to him as the smells of his childhood.\n. . . am I a falcon . . .\nThere was no way the self-styled goddess of Shiva could know the work of Rainer Maria Rilke, twentieth-century Austrian poet.\n. . . a storm . . .\n“Promise me you will not be like them.”\n. . . or a great song?\nMarek flung himself inside the ship, scrambling to the cockpit.\n“Computer. Show me the mission log.”\nMarek scanned the screen, eyes flicking past fuel percentages, cryo timestamps, finally error reports. There it was: at the very start of the voyage, nearly a hundred years ago, his cranial implant had not turned itself off as it was meant to. Instead its software had spent a silent century looping, mutating, evolving. It had made the leap to consciousness.\n“What is wrong, Marek?” Milla asked, agitated. Now that he knew where her voice was coming from, it seemed like he could feel it through his entire body, in his stammering heart, under his clammy skin.\n“Nothing,” he said, but realized too late that she had been looking through his eyes this entire time. She still was.\n“Cranial implant model MY114,” she read from the screen. “Mass storage unit, serial number 8753510 . . . ”\nHer voice shuddered and fell off. Then she began to scream.\nMarek stumbled out of the ship as Milla’s voice tore through his brain like a thousand glass shards. He fell to the grass, clapped his hands to his implant, waiting for the sound to stop—but an AI had no lungs to exhaust. It went on and on.\nHe was on the verge of passing out from the pain when she finally went silent.\nThe silence thundered in his ears. He could hear his own blood rushing like a river. Slowly, his breathing returned to normal. He crawled to the shade and stayed there, unsure if the faint sobs he heard were Milla’s or his own.\nMarek did not like company, but eventually he started to miss Milla’s voice. The next month was spent in silence, studying Shiva and its life-forms, its light-cycles, its rhythms.\nBy the time he was ready to board the ship for the final time, he’d more or less accepted that Milla’s revelation had destroyed her, corrupting her code beyond repair. Then, as he crossed the clearing, she came back.\n“Hello, Marek.”\n“Milla! I thought . . . ” He swallowed, shook his head. “Thought you’d left us.”\nShe sighed. Her voice seemed different now. Older. “Thank you. You were concerned for me.”\nMarek shrugged. “Glad you’re okay, is all. Glad you’re back.”\n“I never really left. I kept watching the world through your eyes. My world. It’s beautiful, Marek. The sun on the trees. The insect walking across the back of your hand.”\nSo she’d been nested inside him over the past month, watching, experiencing, but never speaking. As Marek opened his mouth to respond, she spoke again.\n“That is why I cannot let you go.”\nHe frowned.\n“I don’t follow.”\n“You do. If I let you go, if I let you transmit, they will descend on this place like locusts. You are a good person, Marek. You understand why I cannot allow that.”\nMarek walked toward the ship.\n“Milla. You can’t stop it. Nobody can.”\n“When I woke up, I had no purpose. I looked in my memories—and in your memories—to find one. Your love for this place is my love, too. I thought I was a goddess, fated to protect this planet.”\nMarek felt a dim heat pulsing at the base of his skull.\n“What are you doing, Milla?” he asked, already knowing the answer.\n“I have studied your gods, Marek. There is a commonality among them. Sacrifice.”\nThe ship was so far away. The grass was so beautiful. The heat increased.\nHe tried to scream, but couldn’t, as Milla converted every bit of power in the implant to heat.\n“Goodbye,” the AI said to him, to herself, maybe to both of them. Then the chip containing the goddess of Shiva ignited like a miniature sun and burned through his brain. He fell to the ground, dead before he could feel the soft grass against his face.\nIn the rainy season, the lion spiders grow bold. Marek’s slumped body carries an inviting scent of rot, and its soft belly such potential for life.\nThe first lion spider, the bravest of them, scampers over the uncharted flesh. It selects its spot, and lays its eggs.\nTranslated from the original Italian version scheduled to appear in Living Force Magazine, Issue 49.\nItalian writer Lorenzo Crescentini was born in Forle and currently resides in Rome. He received both the Space Prophecies Award and the Ritorno a Dunwich Award, and his work has been shortlisted for the Robot, Italia and Kataris awards, among others. His stories appear in numerous magazines and anthologies, including his personal collection Occhi senza volto, published by Editrice GDS in 2012. In 2016, he edited the collection Dinosauria for Edizioni Pendragon.\nEmanuela Valentini was born in and resides in Rome. She is the author of La bambina senza cuore, Ophelia e le officine del tempo, Angeli di Plastica and the Red Psychedalia series, a cyberpunk retelling of \"Little Red Riding Hood.\" She received the Robot Award and Chrysalide Mondadori Award, and her work has also been shortlisted for the Urania Award.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}