{"fingerprint": "LEfQxF3YuW55T2Yewvl509zsV6Y=", "sitename": "Clarkesworld Magazine", "title": "Fragmentation, or Ten Thousand Goodbyes by Tom Crosshill", "author": "Tom Crosshill", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/crosshill_04_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fragmentation, or Ten Thousand Goodbyes by Tom Crosshill", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3930 words, short story\n Fragmentation, or Ten Thousand Goodbyes\n 2012 Nebula Award Nominee for Best Short Story\n Every day, Mom says goodbye to me for the last time.\n I need to go to the office or meet Lisa at the airport or pop out for some milk. I’m lacing my shoes in the hallway when I hear the tap-tap-tap of her heels. I freeze for a moment, then rise to meet her.\n Mom stands in the door, elegant in a simple dress. No matter the silvery hair. No matter how her skin, once a smooth dark brown, wrinkles over her bones. You’d never guess she has lived a century. She has no titanium knees, no vat-grown veins, no concession to modernity inside her.\n If only her mind were as strong.\n “Mom.” I smile at her.\n “Rico.” She smiles too, uncertainly. “Must you go?”\n “Just for a minute.”\n Her breath catches. She reaches for me with one trembling hand. Halts when I wince. Her fingers linger mid-air, gnarled and stained with ink.\n She’s been drawing in her upstairs studio. She’s been drawing with the door locked, her work a secret to the world and her agent and me.\n I haven’t pried. What might I find, if I opened her sketchbook—scribbles, blotches, scrawls? Proof that her time is up?\n Ashamed of the thought, I take Mom’s hand—bony and warm and strong. “I’ll be right back.”\n She steps close and presses her face into my chest. Her shoulders tremble. I feel her tears soaking through my shirt.\n “Lo siento, Rico,” she whispers.\n Every time Mom says goodbye to someone, it’s for the last time. She thinks—no, she knows—that she’ll never see them again. Not the mailman. Not her best friend Abby. Not me.\n It’s no tumor, no disease—we’ve run all the tests. Her reasoning is strong as ever. She can tell you how the milkshakes tasted in Miramar, before Fidel came down from the mountains and she left on the Peter Pan airlift. But deep within her mind, something has begun to fail.\n And I can’t fix it.\n So I pat her back and murmur reassurances in her ear, and try not to think what she’s feeling. Try not to imagine how I would feel, if I knew that I’d never see her again in my life.\n This happens every day.\n Still I delay what I must do.\n “Just build the habitat. You’ll feel better.”\n Lisa packs shirt after lopsided shirt into her green Samsonite. After three decades of marriage, the sight is comforting. Lisa’s only happy when in motion. Even her business suit has a space age streamlined look, the collar chic-asymmetric.\n “It seems too . . . permanent,” I say. “Like I’m giving up on her.”\n “It’s hard, I know. But what if she strokes tomorrow?”\n Lisa’s right, of course. The habitat’s a contingency. I won’t have to use it until it’s that or the crematorium.\n But can I watch Mom suffer day after day, once there’s an alternative?\n “You’re giving her a gift,” Lisa says. “You of all people should know that.”\n Me of all people.\n I walk to the viewport in the north wall. It sits mounted in a steel band like a ship’s porthole. Below it, a brass plate reads “George Dieter—Captain, Husband, Father. 1960-2049.”\n Dust covers the screen. Has it been that long? I reach up to wipe it clean.\n Blackness flickers into life.\n A turquoise sea laps against a stretch of sand. The beach glares blinding white, studded with regal palms. Beautiful.\n I could grab my immersion headset, feel the heat of the sun, hear the breeze coming off the water. But then I’d have to face the man on the sand.\n He lies in the shade of a thatched beach umbrella. Perhaps thirty, his body lean and muscular, tanned bronze. Arms stretched out at his sides, eyes closed, face relaxed.\n George Dieter. First habitat upload in the world.\n “Hi, Dad,” I whisper.\n It’s been long since I said those words. Long since I descended into the world Lisa and I built two decades ago. I miss Dad—it’s not that. But every time I went to see him, I didn’t find the man I was looking for.\n “Mom’s drawing again,” I tell Lisa. “She won’t, after.”\n I offered to give Dad a ship, after he uploaded. I offered to give him virtual seas to sail, cargo to carry, battles to fight. He only told me, “I’m tired, son.”\n I learned that lesson well, those early years before our IPO. Maybe it’s the lack of biochemical stimuli, maybe it’s a shortcoming in the iterative neural matrices—uploads just don’t care.\n Lisa zips her suitcase and comes to me. She slides between me and the viewport, wraps her arms around me. “Come with me to LA. Emily and I, we’ve got miracles to show you. There are breakthroughs coming down the pipe that—”\n “Breakthroughs?” I pull back without meaning to. “Every month, heck, every week we get some breakthrough. We all rush to try it and blog it and show it off. Aren’t you scared we’re losing our humanity?”\n “Oh, but we’re not human anymore! We’ve fragmented into a thousand different species. With every new technology we choose to adopt—or not—there are more of us.”\n “You’re spouting Emily again.”\n Lisa turns away, goes back to her suitcase. “She’s a brilliant woman.”\n “She’s our competitor.”\n “Should we miss out on a chance to change the world again, just because Emily works for the wrong corporation?”\n On the screen, Dad gets up on his elbows and watches someone approach. A lithe figure and beautiful, strikingly dark against the white sand. A simulacrum of Mom as she once was. The thing can’t even hold a conversation, but Dad doesn’t seem to mind. He reaches out a lazy hand and grasps her, and draws her down atop him.\n The screen blurs.\n I turn away. “I never wanted to change the world. I wanted to preserve it.”\n Lisa seems not to have heard. “I’ll call you from LA.” She wheels her suitcase to the door.\n Before she can open it, a knock comes. We jump, both of us. “Come in,” I call.\n Mom enters. “Rico, I—” She sees Lisa. “I . . . I thought you left already, dear.”\n “Hello, Alina.” Lisa keeps her gaze on the floor. “I’m running late.”\n As Lisa walks past, Mom parts her lips in a silent cry. She reaches for Lisa’s shoulder. Pulls back as if scalded.\n Just like that, Mom lets Lisa go.\n I watch the tear that rolls down her cheek. I watch it, my eyes dry as they have ever been. I envy her.\n I’m a coward that night. But the next day I call Mom from work.\n “Mom.”\n A faint draw of breath in my cochlear. “Rico.” Pause. “I’m glad you called.”\n I wait for more, but nothing comes.\n “Mom, I’ve been thinking. Your house in Miramar. The one with the grand patio and those big old doors. What color were those doors?”\n Silence. “What’s this about?”\n “You showed me those photos a thousand times. I close my eyes, and I see that house. But I got to thinking I never knew the colors.” When Mom says nothing, I add, “That’s the place you were happiest, isn’t it?”\n “You’re building me one of your things.”\n Your things. That’s all she calls the habitats, ever since she saw what Lisa and I created for Dad.\n “Must you do that?” she asks me.\n I press my face against the window, look across Northwest Portland to home. The tiles of our roof shine red amidst the trees of Nob Hill. I imagine Mom on the veranda, the question in her eyes.\n “We need to prepare,” I tell her. “Before you . . . Before it’s too late.”\n “ . . . okay.”\n “Okay? Really, you’re fine with this?”\n “This has nothing to do with me,” she says.\n “I don’t want to lose you, Mom.” The words come out hard and fast. “Does that make me a bad person?”\n “The doors were green,” she says, after a while. “Green like bananas not yet ripe. We had the greenest doors in all of Miramar. They stood out from blocks away. On the last day, when my father drove me to the airport . . . I looked back at the end of the street and saw only a glimpse of green. I knew that I’d never see those doors again.”\n “You’ll see them again.”\n I stand there by the window, listening to Mom breathe. Waiting for some answer, question, request. Anything to let me believe this is an actual dialogue, a real conversation between two human beings.\n “Rico?” she asks at last.\n “Yes, Mom?”\n “Don’t hang up.” Her voice catches. “Stay on the line for a while, will you?”\n I do. For a while.\n I go home late—late enough to be sure Mom’s asleep. Lisa calls as I close the door behind me.\n “Rico!” she chirps in my cochlear. “Check the mail.”\n I scan the shelf by the door. A cardboard box. I recognize Lisa’s cursive on the label. “What’s this?”\n “Something Emily and I cooked up.”\n Emily again? I tear open the box and extract an immersion headset—a thin gray headband, with the initials LE etched on the outside. “Tonight’s a bad time for toys, Lisa.”\n “Put it on. Trust me, honey.” I can hear her smile. “Just get yourself comfortable first.”\n Perplexed, I move into the living room and sink into my reading chair. A heavy leather recliner, it’s the only piece of furniture in the whole house older than a decade. I had to fight Lisa to keep it when we moved up to Portland.\n I put on the headset. “Okay.”\n “Meet you there!”\n One by one my senses disconnect. The world quiets. I can’t feel the leather under my fingers. I notice the faint scent of Stumptown Organic—Mom’s favorite coffee—just as it evaporates. Black falls across my vision.\n Then, immersion.\n Warmth envelops me.\n My toes curl on cool glass.\n Nighttime. I look out over a golden city. Ten thousand towers lit up bright, far below. New York revolves stately around me.\n No, it’s not New York that revolves, but I. A glass box of a room surrounds me, suspended at the end of a lever from the top of the Chrysler Building. The lever turns, and the streets of Manhattan float past below.\n My breath comes fast. Dizzy, I brace myself against the glass wall.\n “It’s a Bocelli design.”\n Lisa stands behind me, at the side of a gigantic mahogany bed covered in white satin. She too wears white—sheer silk pajamas that cling to her skin. Her perfume caresses me delicately.\n I struggle to resist, but I feel myself stiffening inside my own pajamas. This place . . . I note the clear glass shower booth in the corner. The mirror centered in the ceiling.\n “Really, Lisa? You know I don’t go for this stuff.” We tried immersion sex, early in our marriage. It never felt any better than dream sex—than mental masturbation.\n “This is different,” Lisa says. “We’ve hit on something.”\n She gestures, a flick of her wrist. Her clothes melt away, as do mine. She stands before me naked and beautiful—and real, so very real. No glorified avatar, this. I see the stretch marks on her thighs, the slight flab of fat on her midriff, the wine-stain birthmark on her left breast.\n She smiles, a slight upturn of her lips.\n Blood pounds in my ears. I’m hard as I’ve ever been, the brush of cool air tantalizing against my skin.\n “So you got modeled for textures,” I manage to force out. “That doesn’t mean—”\n “It’s more than that.” Lisa steps forward, reaches for my cheek. “This is me, Rico. Genetically. Chemically. Truly.”\n Her fingers make contact.\n There’s no faking her touch. No faking the bolt of electricity down my spine.\n I embrace her. Pull her close, shivering at the wonder of her skin against mine.\n We fall onto the bed and cling tight to each other. My body recognizes the whole of her pressed against me—her heat, her scent, her strength, and so much more.\n With a hunger I’d forgotten I possessed, I slide into her. She arches against me. We gasp as one and slip into an urgent beat. I kiss her lips, kiss her nose, kiss her sweat-slick brow as we climb the slope to climax. She smiles at me and cries out my name.\n When the end comes, some wonderful minutes later, I convulse against her and think—this is better, this is better, this is better than the real thing . . .\n After, I lie on my back, her hand in mine, and listen to my heart calm its beat. “We’ve got to put this in our habitats.” What if Dad could feel this real? What if Mom could? Might it make a difference?\n “I’ve already started negotiations. Emily’s offering us a joint venture.”\n “Oh. That’s great.” I pause, uncertain. “Lisa? I’ve missed you.”\n She smiles. “Me too, Rico. I want to be there for you. With this new tech, we can see a lot more of each other.”\n “That’s not what I meant.”\n “You should hear what Emily’s got in mind,” she says. “Once you’re capturing genetic makeup, it’s a single step to information transfer. Immersion induced pregnancy.”\n “ . . . pregnancy?”\n “Procreation is the only limit to our fragmentation as a species,” Lisa says. “But procreation is just information exchange. Theoretically, I could mate with a piece of software.”\n I gape at her.\n Lisa pats my cheek. “Don’t worry, I won’t. Not with a stud like you around. Now I’ve got to go. Say hi to your mother from me, will you?”\n Before I can answer, she disappears.\n The living room snaps into reality around me as my teeth click together.\n Lisa’s voice reverberates inside my skull. Can you imagine . . . ?\n I sit there alone, covered in sweat. Somewhere in the house, a clock ticks the seconds away. Cold sperm dries on my leg.\n “ . . . it’s like she sees another person in me.” I pick at my omelet. “Like we disagree on who I am.”\n Mom sips coffee and draws in a sketch pad with her free hand. She glances up at me once in a while. Hers is an artist’s gaze, all-encompassing.\n She used to draw me every morning, while I ate before school. The price of my breakfast, she called it. I pretended to mind, but I kept all the drawings. A thousand penciled sketches of a teenager slurping down rice and beans.\n That was long ago. Today, it feels right that Mom should draw me. I need her to look at me. I need her to see me as I am and reassure me.\n She only says, “Your father gave me black soles.”\n “What are you talking about?”\n “I saw the home you built for him. The beach. The palms.”\n “That’s what he asked for.”\n “I saw the girl,” Mom says. “He asked for her too?”\n “Dad didn’t want to be without you. You can have a companion too, in your habitat.”\n Mom stops drawing. “Why would I want that?”\n “I thought . . . you loved Dad, didn’t you?”\n “I’ve said my goodbyes,” Mom says, “even if he hasn’t.”\n “What do you mean?”\n Mom sets her pen aside. “George was a good man. He loved me well. But understand, Rico—I was more than a woman to him.”\n “You were the love of his life.”\n “Yes. The black love of his life.”\n “Mom, I don’t think—”\n “I left Havana in ’62. Two hundred miles between Miramar and Miami. You know what else was two hundred miles? The distance between a Cuban and a nigger.”\n Mom speaks the word nonchalantly, without anger, but I flinch even so. “Dad . . . did he . . . I mean, he never called you . . . ?”\n “Of course not,” Mom says. “Your father gave up three jobs over me. He fought big men for me. Once he got stabbed for me. So what if he wanted me to meet all his Waspy friends? So what if he wanted the whole world to know I was his? I loved him, and thought he loved me.”\n “Didn’t he?”\n “So he told me. He always told me sweet things.” Mom smiles. “One day he said I was God’s only perfect creation.”\n “I’m sure he meant it.”\n “A few days later, we were messing around by the pool. He grabbed my foot and held it up. ‘Here!’ he shouted. ‘Proof that God screws up!’” Mom gestures grandly, the motion eerily evocative of Dad. “I was beautiful and perfect to him—except for the pale undersides of my feet. Like God poured a bucket of brown paint over my head, and forgot about my soles.”\n “He was joking.”\n “I’ve seen the girl he’s got, on the beach you gave him. The girl who looks like me. I’ve seen her soles.”\n Could it be? I rack my memory. Did Dad tell me what to do? I wouldn’t have made a mistake like that, would I?\n “Don’t glare like I’ve spit on his grave,” Mom says. “George loved me. I know that. Just as I know that Lisa loves you, even if she sees a man in you that you don’t always recognize. Our lovers are never the people we love, not exactly.”\n It happens a week later, as I’m leaving for a client dinner.\n Mom catches me in the hallway and wraps me in her embrace, and weeps on my shoulder. She clutches her sketchbook in one hand. Its edge digs sharply into my ribs.\n I pat her back and murmur assurances, thinking ahead to the evening’s negotiations. Then Mom twitches and gasps, and collapses.\n For some moments I stare at her. I’m shocked, and surprised that I’m shocked at this most expected of events. Then I start CPR and dial the office. Within minutes we’re in an ambulance, screaming across Portland. An oxygen mask on Mom’s face, her sketchbook still locked in her grasp.\n Severe heart attack, my team tells me. No repairing the damage.\n They rush her into OR One, and strand me in the marble-and-gray-leather waiting room. I watch through the wall as a dozen figures in scrubs fight to stabilize her for upload. With all my practice at saying goodbye, I should be calm, but I can’t breathe.\n At some point in the next hour, Lisa comes. She hugs me and kisses me and does her best to console me.\n I stare at her head. She has shaved it bald since this morning. It gleams in the sterile light from the OR.\n “I’m getting a port installed,” she explains. “It’s for this new crossfire app . . . ”\n I let her words drift past me. When she falls quiet for a moment, I speak into the silence—because speaking is easier than thinking.\n “What if every goodbye is really the last one we get?”\n “I don’t know what you mean.”\n “You talk about fragmentation. Every time you stuff a new gadget into your brain, you fragment away from the human race, right?”\n Lisa shrugs. “Sure.”\n “I don’t think you need a gadget. Every time you leave the room, you come back a different person. Ten times a day you fragment away from me. A hundred times. Every time you walk out the door, I’ll never see you again.”\n A thousand times I should have said goodbye to you. A thousand times, as I lost the woman that I loved.\n “That’s great, Rico.” Lisa chuckles. “We’re human fractals, huh?”\n “Yes.”\n Loosely coupled fractals—that’s what we are. We split and divide, hoping that the near-random walk of our fragmentation will bring us close enough to interact. To procreate. To love.\n Once Mom is conscious and ready for upload, I ask Lisa to leave me with her.\n “I’ll see you at home,” she tells me.\n I’m not sure she will.\n Mom lies entangled in wires and IV lines. She was never a small woman, but the operating table dwarfs her. She looks out of place and powerless and scared.\n But a faint smile curves her lips as I approach. “Today’s the day, huh?”\n I sit down by her side and take her hand and tell her the truth. “I’m not ready to let you go.”\n “I know.”\n “See what I built for you, Mom.” I press a few buttons, and the circular walls of the OR light up.\n A house with an elegant colonnade, its doors a rich green. An indoor patio lit by a soaring skylight, with dark wooden rocking chairs and a blinding white canvas stretched on an easel. A bedroom with tall windows that look out on the sea—they hold no glass, only wooden shutters to close against the evening chill.\n Wonder touches Mom’s eyes. “It’s beautiful, Rico. Just as I remember it.”\n I get to my feet, my heart pumping fast. “You want to go there, Mama?”\n “This house belongs to the girl I was.” Mom sighs. “That girl is gone.”\n “But Mom, you love this house—”\n “Don’t you give me black soles!”\n My hands drop to my sides. “I’ll do whatever you decide, Mom. I want you to be happy.”\n “I am happy. A little bit afraid, but happy. I’ve got no more goodbyes to say but one.” Mom smiles. “You can keep me in that house if you like. It won’t be me, not really—but you know that, don’t you?”\n “I need you.” I blurt out the words before I can stop myself. Then I stand there, my face flushed, as vulnerable as I have ever been.\n “Where’s my sketchbook?” Mom asks.\n “It’s outside. It’s not sterile.”\n “What does that matter?”\n So I bring it in. Mom gestures for me to open it. With trembling fingers, I flip the cover.\n I stare for long moments at the drawing that faces me. Then I turn the page. And another.\n I leaf through the sketchbook in a confused daze. This is what Mom’s been working on?\n “I draw what I see,” she says.\n What she saw was a hundred figures. A hundred middle-aged men. In t-shirts and business suits and bathrobes and beach shorts. Some tired, some eager, some angry, some sad.\n All of them me.\n I recognize none of them.\n That’s fragmentation too. It’s not just the people around you who change.\n I’m not the boy who loves Mom’s rice and beans.\n I’m not the guy who loves Lisa.\n I’m the man who can’t let go.\n “I loved every one of you,” Mom says to me.\n I cling to those words like a lifeline. Here’s one constant throughout all my splintering changes. It’s not fair that I must give that up.\n “I said goodbye to every one of you,” Mom says to me.\n I stare at her for moments. I stare at her for a long time, even as her breathing grows labored and her heartbeat uneven.\n The decision races at me full speed.\n Can I give her up?\n Can I keep her bound? Constant, unchanging from year to year in her virtual prison, while I fragment and break and splinter away?\n Will she love me if I do?\n Will I love her?\n Or will I let dust gather on the screen of her viewport?\n I only know this:\n In a while, Mom will take her final breath.\n In a while, I’ll make a decision.\n And then, whatever that decision, I’ll say goodbye to her for the last time.\n Tom Crosshill's fiction has been nominated for the Nebula Award, andhas appeared in venues such as Intergalactic Medicine Show, Beneath Ceaseless Skies and Lightspeed. In 2009, he won the Writers of the Future contest. After many years spent in Oregon and New York, he currently lives in his native Latvia. He's a satellite member of the writers' group Altered Fluid. In the past, he has operated a nuclear reactor, translated books and worked in a zinc mine, among other things."}