{"fingerprint": "1+bMIVqnhRNuNvcJR8o+oDhtlnk=", "sitename": "Clarkesworld Magazine", "title": "A Well-Worn Path by AnaMaria Curtis", "author": "AnaMaria Curtis", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/curtis_10_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Well-Worn Path by AnaMaria Curtis", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4420 words, short story\nA Well-Worn Path\nNorami still has a few veeberries in the fridge, but her sister wants fresh.\n“It’s been fifteen years since I’ve had them off the vine,” Leona says from across the kitchen counter, taller and far more persuasive than Norami remembers.\nNorami takes the ones she has out of the fridge, pops one in her mouth. The taste blooms sharp and familiar, tangy and sweet. “I picked these two days ago. They’re fresher than practically anyone can get.” She doesn’t know why she’s arguing; she wants Leona to come berry-picking with her, wants the forest to wrap its arms around her sister and tell her to stay.\nLeona leans over the counter, setting her chin on long arms. “Did I tell you about the one time I managed to get veeberries?” She doesn’t wait for Norami to shake her head; they both know she hasn’t. “I was on leave from Xunan at the time—a whole month off that fucking ice planet—and I went to Descan Station with a couple friends. We’d all been eating prepackaged food while we searched for plants with any nutritional value whatsoever, and all I could think about were veeberries.”\nLeona looks off to the side, eyes soft. “I dragged my friends all around the station looking for them and found them in a specialty tea shop, of all places. They had them freeze-dried, I guess to add them to tea as a kind of ridiculous expensive garnish. They cost thirty-five hundred kenels—can you believe that? Thirty-five hundred kenels for five hundred grams of dry berry mush. The texture of them wasn’t right, obviously. They just sort of melted away, but the taste . . . I don’t know, it brought me back a bit.” Leona rolls her eyes. “Cried the whole time I ate them, of course. Ridiculous.”\nNorami rolls another berry around on her tongue and smiles at her sister. “Of course we can pick fresh.” She doesn’t know how long Leona will stay—she seems destined for some city apartment or sparkling space station—but she wants to show her sister all the good things about this place, about home, while she’s here.\n“I have an extra suit,” she says. “But I just patched up a rip in one of the legs, so you’ll have to be careful.”\nLeona snorts. “We’re picking veeberries, Mi, of course we have to be careful.”\nAnd so it goes.\nNorami puts her jacket on over her overalls, thick plastic-lined canvas, and reaches for a scarf. For the first time in over a decade, her sister does the same thing next to her. Norami watches her for a moment, the tallness of her, the youth, the shock of her light hair. She wants to tell Leona to put it up or into braids, always the older sister, but she knows better than that.\nNorami tries to hold the moment in her mind, tells herself not to hope for an easy future here, where her sister shrugs into jackets and conversations like it’s nothing, like it’s all muscle memory and open doors.\nShe tells herself not to worry, too, but in the forest a little worry is a good thing.\nNorami’s back door opens almost directly into the forest, just a dozen meters between the steps and the first trees. The trees are tall, and the forest is dense and sparse by turns—still and quiet and almost uniformly dark. Norami once spent a quarter of a year trying to find and name all its colors that weren’t green and found mostly purples and blues, shadows on shadows. She wonders sometimes that the suns’ light ever reaches the forest floor.\nAs they reach the forest’s rambling edge, Norami can’t resist the impulse to reach for her sister’s hand. Gloved fingers gripping gloved fingers, she says it lightly, almost like a joke.\n“You remember the protocols, right?”\nLeona faces away from her, but Norami can sense her eyes rolling regardless. “Yes, I remember. V is for venom. No punctures, no marks, keep the antivenom close.” She reaches into her pocket and pulls out the blue injection pen.\nNorami pats her own pocket and feels a matching pen. She doesn’t tell Leona how much it hurts, even as the antivenom kicks in. The pain is searing bright, totally consuming, and the hallucinations that come with it so convincing that Norami still isn’t sure of some of her memories, nearly two decades later.\nWhen Norami stared down the Young Explorers application essay prompt—describe a challenge you faced and how you overcame it—a year after the veeberry sting, she couldn’t write about anything else. It was rolling admissions, open to anyone twelve to fifteen, and Leona had already gotten in, the first time she was doing something Norami hadn’t done first. Norami was balancing the lingering aches and weakness from the veeberry toxins with sisterly confusion at the shift. Leona was going out and away, to the stars, to planets unseen, and Norami echoed with anticipatory loneliness and thought maybe she wanted to go too.\nThe veeberry sting gave her context when the rejection came, just as Leona was packing to go to training—rejection hurt, but there was no pain like a veeberry sting.\nHer application is the only thing she ever really kept from Leona. Norami’s happy here, now, but she couldn’t face it at the time, her rejection slinking after her sister’s success.\nAlven is an old planet, settled early and quickly forgotten for newer ones with more to offer, but its depths hide all the extremes explorers abandoned it for. It’s a Level Nine planet, full oxygen after three generations, and its forests are the only place veeberries and melor mushrooms grow. Its fields grow round gantry fruits low to the ground, and the forests took well to apple seeds. Its generous atmosphere and the lack of known animals other than insects made it an easy bio-planet—low industry, high sustainability; low population, high yield.\nIn the town where Norami and Leona grew up, people mostly work at the processing factory, preparing food for long journeys to more populous planets or the school. Quite a few are foragers like Norami, but in the way it always is, they’re mostly older. The arrows of Alven all point up and away. Not everyone goes out like Leona—that is to say, triumphant, the whole town talking about their success—but a lot of them leave one way or another. It’s so easy. They just have to follow the food, follow the recruiters, follow all the well-trod trails out.\nAfter Leona shipped off, Norami left town and apprenticed for a forager for a few years. She was an ideal apprentice, eighth generation on Alven, lungs perfectly accustomed, feet spread wide and soft to accommodate the moss. The boots from off-planet don’t really fit her anymore, and her hands have gone long-fingered and tough. She has a mild acquired resistance to veeberry venom and a smooth, silent way of walking between vines. She sees perfectly well in the low light of a forest, relies on the softness of bark and the bright pop of mushrooms and berries. Her trails lead in, not out.\nNorami leads the way, her blue headlamp making gentle shadows between the trees. The tree trunks in this part of the forest, near the edge, are hung with light green vines always reaching for the light. She’s worn a branching trail to the patch over the years, and she follows the path mindlessly even where it’s not visible.\nBehind her, Leona seems to be finding every stone and log on the way.\n“This gear is heavy,” she says after she rams her toe into a softly rotting branch that hasn’t done anything to her. “There are much lighter, more durable materials you could use.”\nNorami doesn’t like to talk in the woods, but there’s no point trying to be silent now. “Back-planet foragers aren’t quite as high on the priority list for new materials as planet forces.” Perhaps she should feel bitter about it, but the words come out matter-of-fact. Norami hesitates, weighing her words against her wants. “We can always go back if you want. The berries will still be there another day.”\n“Don’t be ridiculous,” Leona says. “I’ll get used to it.”\nNorami doesn’t know what to do with the little blossom of hope that gives her. She hasn’t asked Leona how long she means to stay, and she finds in the moment that she doesn’t want to know, can’t bear to ask. She kicks a drying piece of moss lightly with the toe of her boot instead. It’s another twenty minutes to the berry patch, and that’s at her pace, not Leona’s.\nShe wants things to be good here for Leona, wants someone with the eyes of an outsider and the heart of a local to judge this place worthy and interesting the way Norami knows it is. The forest seems to curl in around them, soft lower branches curving upward toward them, leaves reaching toward the harsh plastic of their jackets, a caress and maybe also a warning. And Norami wants. To be judged worthy, a path worth following after all.\nBut not yet. She can’t push Leona yet. She has to give the forest a chance to speak for itself. Veeberries are a good first step. There’s nothing like them, not anywhere.\nAt the fork in the trail by the thick old droram tree, Norami turns to Leona to ask her what path she wants to take—through the forest or along the stream—but her sister is still several steps behind her. The soft beams of Norami’s blue light hit Leona’s face, and Norami sees tears on her cheeks, her fingers glistening as they curl around a dangling leaf.\n“You okay?” Norami asks.\nLeona straightens, wipes across her eyes with the back of her hand. “Of course.”\nNorami lets it go and takes her on the path through the forest.\nAs they walk, Norami asks Leona about Kabbel and Xunan. She wants to know what her forest is up against.\nLeona walks behind her, but Norami can hear her straightening up, her voice taking on the authoritative tone of someone who’s traded tales for drinks in plenty of space stations.\nLeona tells her about the caves and canyons on Kabbel, worn through centuries of water and acid, the first time they crossed the great chasm and burrowed through the caves, a team of just four of them. She describes the stark beauty of the planet with breathless phrases that tumble out of her mouth fully formed. Norami can just imagine a listener leaning forward, eyes wide, wanting more. The team got stuck in a series of caves that opened onto a cliff, and Leona had to lead them back out the way they’d come, rationing the food and water and oxygen they had, shivering in light plasticky blankets. She narrates a climb up an icy slope, the literal light at the end of the tunnel, and by the time she’s done telling the story, she’s side by side with Norami, ponytail swinging jauntily, face half-blue in the light.\nNorami is riveted despite herself. “That sounds horrifying.” Not that there aren’t worse fates in the forest they walk in, but she knows how to avoid those.\nLeona shoots her a sideways grin. “Oh, that’s not the worst thing that’s ever happened to me. The worst thing, the most painful, was before I ever left Alven. You know the one, the time I got stung by veeberries.”\nShe says it so casually, so practiced, so sure of herself, that for a moment Norami is frozen in confusion rather than disbelief. Leona continues.\n“You remember, Mi,” she says. “I was only twelve years old; you were fourteen. We were finally going berry-picking with Dad. We had metal buckets and thick gloves and coats, and I had just started my growth spurt. The berries were amazing picked off the vine, and I wasn’t paying as much attention to the vines as I should have been. My jacket rode up when I reached up to move a branch out of the way, and a vine snuck right into the gap in the side of my overalls and got me right in the stomach.\n“It hurt so much.” Leona closes her eyes, as if she is remembering. She’s pulled several steps ahead of Norami now.\n“I could have died,” she says. “I probably should have. Dad only barely got the injection pen to me in time, and I still screamed and screamed.”\nAnd then she stops talking, and the silence rises, slow and heavy. Norami barely breathes. Leona is well ahead of her now, leading the way, wandering onto and off of the path Norami made, guided a little by the angle of the light behind her, but now she stops.\n“What?”\nThe forest seems to lean in around Norami for a moment, and part of her wants to sink back into it, to not say anything, to let Leona carry her story forward. But she shrugs the trailing vines and branches off and steps back onto the path.\n“The thorn got me on my shoulder,” Norami says, “not my stomach. The doctors said that’s why I made it—took longer to get to my organs.”\nLeona takes a step toward her, and Norami can see that her eyes are wide, and her face is open. The story she’s just told is real to her, memorized through tellings. Leona would swear that she remembers the feeling of the branch on her hand, the moment the vine slipped beneath the hem of her jacket.\nHow long has she believed this? Is it a story she told her team members on planet surfaces, keeping them awake and alive throughout long, hostile nights? Did she bring it to the cafeteria at the Young Explorers program, her invitation to society there, her memorable hook? When Norami’s thoughts turn to the Young Explorers program, she sees it all at once. Norami’s rejection came with a note telling her not to apply again, something she didn’t think much about at the time, but now . . . There are people out there who think Norami’s a liar and a thief. Leona has been telling herself—and others—this story for a long, long time.\nNorami reaches out to her sister, but stops, hand hovering, as it all catches up to her in a slow, rolling crunch of betrayal. Leona couldn’t even let her have her own pain. That’s what strikes Norami as unfair about it. That she didn’t even have to live through it. That she has all her own stories now, but she still took Norami’s.\n“You only remember the screaming because that’s all you were there for,” she says. “If it had happened to you, you would remember the pain.” She swallows. “It would be the only thing you’d remember.”\n“I didn’t,” Leona says, her expression jumbled and changing. “I don’t . . . ”\nNorami’s arm is still half outstretched. She curls it back inward and holds her hand against her chest, the weight of it a comfort.\n“Don’t what? Don’t remember the one time you weren’t the center of everything?” Norami flinches as she says it, not because it’s too mean but because it’s too true. It reeks of desperation.\n“How dare you,” Norami says, and her voice cracks.\nLeona presses her lips into a flat line for a long, silent moment. Norami reaches out to touch a tree to one side of her, pressing her soft fingers into the rough, flaky bark. These tiny pinpricks of pain against her fingertips she is at least used to.\n“I wasn’t the center of things,” Leona says.\nNorami snorts. “After you left, everything revolved around the letters and videos you sent from training. Dad would read up on all the articles about the new planets you were going to. Even now, when I go into town, people ask me how you are.” She pauses, searching her sister’s face for something she can’t quite name—guilt, maybe, or understanding.\n“You really don’t remember?” she asks.\nLeona tilts her head. Her words are quiet. “I don’t know.” She looks around her, seeming to take in the darkness, the straightness of the trunks, and the bluish green of the leaves for the first time. “Every time I said it, it felt familiar.” She shakes her head, a soft, wondering motion. “I could swear I felt it.”\nIt’s not quite an acknowledgment, not quite an apology. It’s a half-extended hand. And Norami is tired of taking the extra step forward.\nShe nods at the path. “Just follow that to the berry patch. I’ve lost my appetite.” After a moment, she takes the light off her head and hands it to Leona. She can make her way well enough without it.\nLeona takes the light without looking at her. “Thanks.”\nNorami keeps her grip on the lamp for a second too long, makes Leona tug it away from her. “Be careful,” she says.\nNorami has a short string of postcards, clear pictures taken by Leona with three lines of message on the back of each, of every planet her sister has helped build. Kabbel, and Lenton, and Xunan, and Dahled, and Pormi, bright beads on a short necklace, worlds’ worth.\nTo think that Norami has spent most of her life in the same dozen square kilometers of Alven forest while her sister was exploring the stars. That’s the way everyone in town says it, anyway. Poor Norami, who couldn’t make it out, just burrowed herself deeper in instead.\nThat’s what Norami does after she leaves the path, turning away from Leona and her bright light, just walks farther into her own forest, her own small, unending adventure. The only sounds are the slow ripples of leaves and moss where she steps and the uncouth rustle of her plastic pants and jacket. She walks slowly, wraps her hand around branches, touches the edges of oval leaves with gentle fingers, lets her eyes adjust.\nOften Norami plays games with herself when she walks the silent woods. Sometimes she’s hunting for treasure, sometimes she’s a spy from one of the films they get on old transports, and sometimes she’s herself, a professional forager. But sometimes she’s an astronaut, exploring a new planet’s surface, taking notes on everything she notices, ready to return to her ship or call for her comrades at a moment’s notice.\nShe knows it’s not really like that. Leona has been very clear about that in her messages. “It’s hard work,” she says, and Norami believes it. But she knows, too, that Leona’s face lights up when she talks about the first year or so on a new planet; building shelters; monitoring oxygen levels; navigating uncertain new terrain; searching for intelligent, communicative life; helping decide what zoning a new planet will get.\nNorami reaches the bank of the small stream and stops to watch the water. She’s not really in a leaping mood. If she goes to the right, she can take a long loop back to the house. If she goes to the left, she’ll reach the veeberry patch and Leona.\nOf course, she could always turn back the way she came.\nLeona is always leaving, too. Learning and loving new places, processing overwhelming amounts of information and passing it on to the next team, the next phase. Going, going, going, giving up everything she’s worked for and starting over again.\nAnd that’s why Norami thinks she may have a chance at keeping Leona after all. Here, with the stream running clear and melodious at her feet, she doesn’t regret the suspiciously worded rejection letter from the Young Explorers program at all. She’s grateful for it, in a roundabout way. Norami has a favorite spot by the bank of this stream, under a weeping westoon tree, where she likes to look through the leaves, dappled purple and red, and listen to the forest. She has fresh fruit whenever she wants it and a cookbook expanding with note cards stuffed between pages. She has new mushroom patches to find, old vines to clear out, trails to break and maintain. Norami has her whole life to know her forest.\nAt the stream, Norami turns left.\n“Good picking?” Norami asks when she sees her sister, a cylinder of blue plastic.\nLeona nods and shows Norami her bucket, already half full, but doesn’t speak. She’s moving quickly and carelessly. Still upset, then. But after another moment she looks back at Norami and smiles a little, so maybe she’s glad Norami came back.\nNorami picks a spot a few meters away and starts picking herself. A few vines twist toward her curiously, but she stills and lets their interest fade. The berries are the size of her thumb, bright orange, fleshy, and very soft. Just looking at them creates an anticipatory pang in Norami’s mouth, the sensation of taste coming before the first yellow-green fruit.\nShe swallows three berries before she tries to speak again. “So,” she says, “did you know I applied to the Young Explorers program? I had to wait a year after you applied because I was still in and out of the hospital, recovering.”\nLeona stills, almost drops her bucket. “Oh,” she says faintly. “I never thought about recovering.”\n“Well, yeah, because you made it all up for your essay and forgot all the boring parts.”\nSilence. A few gentle thunks as Norami drops more berries into her bucket.\n“I’m not telling you because I wish I’d gotten in, you know.” Norami reaches down for another clump of berries. “I don’t. I’m glad I stayed. I’m telling you because I want us to be honest with each other.”\n“I’m glad you don’t regret it,” Leona says, pausing with a hand full of berries halfway to her bucket. Her mouth twists. “It wasn’t always great on my end either.” She sighs. “I still wish I hadn’t, though. I mean, I always wanted . . . ” She stops, lets the silence hang, stuffs a berry in her mouth.\nNorami turns away, to give her time to come up with whatever she’s thinking through, hoping she’ll get Leona’s honesty in return for her own. She picks another few berries, trailing a gloved finger over a rounded green leaf on her way down to her bucket.\nNorami feels the scream before she hears it. The hairs on her arms and the back of her neck stand straight up, and the shiver rushes through her before the sound does.\n“Leona!” she gasps, but her sister can’t answer because her sister is lying on the edge of the berry patch, screaming. It seems to be the only thing her body can do. Leona’s convulses in great bursts, her body’s only purpose to scream, and breathe, and scream again. The inside of her throat will be ribbons before all this is over.\nNorami scrambles for her injection pen, jams it into her sister’s side, falls to her knees. The bright purple thorn is still stuck in the outside of her sister’s thigh, just where the patched stitching of her overalls leaves a tiny gap. The green-yellow-orange of the berries, almost glowing, and the malevolent purple of the thorns seem to surround them. Norami pulls Leona back, drags her away from the berries, and undoes her overalls. She stares at the thorn, twice the length of a fingernail, curved and vicious.\nLeona has stopped screaming, a bad sign. Her fingers are starting to stiffen.\nQuickly, not decisive so much as choosing not to think, Norami plucks out the thorn and puts her mouth to the wound. She sucks and spits and does not swallow. She’s resistant, not immune. When her spit doesn’t glow slightly purple, she stops. She refastens Leona’s jacket.\nNorami’s body is shivering in recognition, the echoes of pain reverberating through her after decades. In Leona’s open, unseeing eyes, Norami recognizes it. The rushing pain, clarifying and destroying, a tidal wave of hurt. There’s a slight orange smear at the corner of Leona’s mouth.\nNorami drags her sister up so that Leona’s back is against hers and locks her arms around her sister’s shoulders. Leona’s head falls back onto Norami’s left shoulder, and Norami keeps count of the beat of her breaths, each exhale proof that her sister is alive in her slowly stiffening body. If she can reach the house fast enough, the nearest med-pod isn’t far.\nWhen Leona comes to, she will be changed by the pain. Things will seem clearer to her. She will wake in a hospital bed, her blood running purple-tinged red in the clear IV lines, and she will see Norami and smile. Or maybe she will turn away, remembering and ashamed.\nBut even then, she will come around. Her light hair will fan over the dark blue pillow, and she’ll lift her head and tell Norami that she wants to stay, that she’s sorry. She will probably cry, which means Norami will too.\nHer apology will be eloquent but unnecessary, Norami thinks, navigating around a log on the path, careful of her sister’s trailing legs. Norami will smooth her hair and say she’s glad she was there when it happened, that she understands. The pain, yes, but also the theft.\nNorami does understand. She makes herself understand, weaves words into the space her sister left after “I always wanted.” Leona lived life on perpetual adrenaline, and with danger and excitement close to hand at every moment, how else could she make something like home compete with her adventure? How else could she explain why the forest made her cry?\nMaybe Norami is delusional, trying to make herself the winner in a competition her sister moved past years ago. But maybe she’s right.\nIn the hospital room, the morning light on her face, Norami will tell Leona what she was going to say before she says it. That the story started out as a lie and turned into a truth, made Alven just as dangerous and interesting as the surface of every new world she landed on. That the fifteen-year Explorers term grew homesickness like an invasive sickle weed, and the story was her only defense. It was a tether to the tiny world she came from, an arrow curving back against the odds, a well-worn path heading home."}