{"fingerprint": "Ch+Tk7LySvhC6f3Ym6gf34MyDcM=", "sitename": "Clarkesworld Magazine", "title": "muo-ka's Child by Indrapramit Das", "author": "Indrapramit Das", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/das_09_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: muo-ka's Child by Indrapramit Das", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3390 words, short story\nmuo-ka's Child\nZiara watched her parent, muo-ka, curl up and die, like an insect might on Earth.\nmuo-ka was a giant of a thing, no insect. Ziara was the one who’d always felt like an insect around it. Its curled body pushed against the death shroud it had excreted in its dying hours, the membrane stretched taut against rigid limbs. She touched the shroud. It felt smooth but sticky. Her fingertips stuck lightly to it, leaving prints. It felt different from her clothes. muo-ka had excreted the ones she wore a month ago. They smelled softer than the death shroud, flowers from Earth on a distant, cosmic breeze. She raised her fingers to her face, touching them with her tongue. So salty and pungent it burned. She gagged instantly, coughing to stop herself retching.\n“muo-ka,” she said, throat thick. “You are my life.” Ziara thought about this. “You are my life, here.” She meant these words, but felt a hollow, aching relief that muo-ka’s presence was gone.\nShe closed her eyes to remember the blue rind of Earth, furred with clouds, receding behind the glass as she drifted into amniotic sleep. Orphan. Volunteer. Voyager. A mere twenty years on that planet. When she had opened her eyes after the primordial dream of that year of folding space, the first thing she saw and felt was muo-ka pulling her from the coma, breaking open the steaming pod with predatory lurches. Its threaded knot of limbs rippling like a shredded banner in the sweltering light, stuck on the leviathan swell of its dark shape. She had opened her mouth, spraying vomit into the air, lazy spurts that moved differently than on Earth. muo-ka had pulled her out of the pod and towards it, its limbs sometimes whiplashes, sometimes articulated arms, flickering between stiffness and liquid softness so quickly it hurt her eyes to see that tangled embrace. Stray barbed limbs tugged and snapped at the rubbery coil of her umbilicus, ripping it off so pale shreds clung to the valve above her navel.\nmuo-ka had grasped at Ziara’s strange, small, alien body, making her float in the singing air as she tried and tried to scream.\nZiara watched the shroud settle over muo-ka. Already the corpse had shrunk considerably as air and water left it. Its body whistled softly. A quiet song for coming evening. With a bone knife, she cut small slits into the shroud to let the gas escape more freely, even though the membrane was porous. The little rents fluttered. A breeze ruffled the flat waters of the eya-rith basin into undulations that lapped across muo-ka’s islet, washing Ziara’s bare feet and wetting the weedy edges of the stone deathbed. The water sloshed in the ruined shell of the pod at the edge of the islet, its sleek surfaces cracked and scabbed with mossy growth. Inside was a small surveying and recording kit. She had discovered the kit, sprung free of its wall compartment, shattered and drowned from the rough landing. Even if it had worked, it seemed a useless thing to her now.\nWhen the pod had once threatened to float away, Ziara had clung to it, trying to pull it back with her tiny human arms, heaving with frantic effort. muo-ka had lunged, sealed the wreck to the islet with secretions. Now it stood in a grassy thatch of fungal filaments, a relic from another planet.\nmuo-ka had no spoken words. Yet, its islet felt quieter than it had ever been. Ziara had learned its name, and some of its words, by becoming its mouth, speaking aloud the language that hummed in a part of its body that she had to touch. It had been shockingly easy to do this. What secret part of her had muo-ka unlocked, or taught to wake? muo-ka’s skin had always felt febrile when she touched it, and when it spoke through her she felt hot as well.\nThe first thing it had said through her mouth was “muo-ka,” and she had known that was its name. “Ziara,” she had said, still touching it. “Jih-ara,” it had said in her mouth, exuding a humid heat, a taste of blood and berries in her head. Ziara had disengaged her palm with a smack, making it shiver violently. Clammy with panic, she had walked away. It had felt too strange, too much like becoming a part of muo-ka, becoming an organ of its own.\nZiara rarely spoke to muo-ka in the time that followed. When she got an urge to communicate, she’d often stifle it. And she did get the urge, again and again. In those moments she’d hide in the broken pod on the islet’s shore. She’d curl into its clammy, broken womb and think of the grassy earth of the hostel playground, of playing catch with her friends until the trees darkened, of being reprimanded by the wardens, and smoking cigarettes by the barred moonlight of the cavernous bathrooms, stifling coughs into silent giggles when patrols came by. Daydreams of their passing footsteps would become apocalyptic with the siren wail of muo-ka’s cries. It never could smell or detect her in the strange machinery of the wrecked pod. She assumed the screams were ones of alarm.\n“You’ve fed me,” Ziara said to the corpse. “And clothed me. And taught me to leap across the sky.” Those stiffened limbs that its shroud now clung to had snatched her from the air if she leaped too high, almost twisting her shoulders out of their sockets once. She’d landed on the mud of the islet safe, alive. In the shadow of muo-ka she’d whispered “Fuck you. Just, fuck you. Fuck you, muo-ka.”\nShe had tasted the sourness of boiled fruit at the back of her throat. muo-ka covered the sky above her, and offered one of its orifices. Gushing with the steam of regurgitate cooked inside it. She’d reached inside and took the scorching gumbo in her hands. The protein from dredged sea and air animals tasted like spongy fish. It was spiced with what might have been fear.\nZiara didn’t have an exact idea of how long it had been since muo-ka had pulled her into the air of this world from the pod. She had marked weeks, months and years on a rock slick with colonies of luminescent bacteria. Left a calendar of glowing fingerprints that she had smeared clean and then restarted at the end of every twelve months, marking the passing years with long lines at the top. She had three lines now. They glowed strongest at dusk. If they were right, they told her she was twenty-four years old now. muo-ka had been her parent for three years.\nNot that the number mattered. Days and years were shorter here. muo-ka had always lingered by that rocky calendar of fingerprints, hovering over it in quiet observation when it thought she wasn’t looking, when she was off swimming in the shallows. Watching from afar in the water, she could always taste an ethanol bitterness at the back of her throat and sinuses. A taste she came to associate with sadness, or whatever muo-ka would call sadness.\nmuo-ka had never washed the calendar clean. It had never touched it. It had only ever looked at that glimmering imprint of time mapped according to a distant world invisible in the night sky. The dancing fingertips of its incredible child.\nThe evening began to cast shadows across the shallow seas. Across the horizon, uong-i was setting into mountains taller than Everest and Olympus Mons. uong-i at this time was the blue of a gas flame on a stove, though hot and bright. Sometimes the atmosphere would tint it green at dawn and dusk, and during the day it was the white of daylit snow. But now it was blue.\nZiara touched muo-ka’s shroud again. It was drier, slightly more tough as it wrapped around the contours of the moaning, rattling body. She lit the flares by scratching them on the mossed rocks. The two stalks arced hot across the water, sparks dancing across her skin. She plunged them into the soil by the deathbed.\nHer eyes ached with the new light. Again, she remembered her first moment with muo-ka, remembered her panic at the thing ensnaring her in blinding daylight. The savagery with which it severed her umbilicus, the painful spasming of its limbs around her. She remembered these things, and knew muo-ka had been in as much panic as she had. She had long since realized this, even if she hadn’t let it sink in.\nFrom her first moment here, muo-ka remained a giant, terrifying thing. The days of recovery in the chrysalid blanket it wove around her. She’d been trapped while it smothered her with boiling food from its belly, trying and failing to be gentle. Fevers raging from nanite vaccines recalibrating her system, to digest what her parent was feeding her and breathe the different air, the new soup of microbes. “Stop,” she would tell muo-ka. “Please stop. I can’t eat your food. I’m dying.” But it would only clutch her cocooned body and tilt her so she could vomit, the ends of its limbs sharp against her back. It would continue feeding her, keep letting her shit and piss and vomit in that cocoon, which only digested it all, preventing any infections.\nSure enough, the fevers faded away and one day the cocoon came off in gummy strips. Ziara could move again, could move like she had on Earth. At first it was an aching crawl, leaving troughs in the rich mud of the islet. But she’d balled that mud in her fists and growled, standing on shaking legs. She watched her human shadow unfurl long across the silty islet, right under the eclipsing shape of muo-ka above her, its limbs whipping around her, supporting her until she shrugged them off.\nZiara had laughed and laughed, to be able to stand again, until phlegm had gathered in her throat and she had to spit in joy. So she walked, walked over this human stain she had left on the ground, walked over the wet warmth of muo-ka’s land. She walked until she could run. She was so euphoric that she could only dance and leap across the basin, flexing her muscles, testing her augmented metal bones in this low gravity. Sick with adrenalin, she soared through the air, watching the horizon expand and expand, bounding from rock to rock, whipping past exoskeletal flying creatures that flashed in the sun. muo-ka watched, its leviathan darkness suddenly iridescent. Then Ziara stood in one place panting, and she screamed, emptied her lungs of that year of deep sleep through a pierced universe. She screamed goodbye to the planet of her first birth. As this unknown sound swept across the basin, muo-ka’s limbs glittered with barbs that it flung into itself.\nZiara nodded at this memory. “muo-ka. Leaping? You taught me to walk,” she said with a smile.\nShe had avoided muo-ka’s oppressive presence by hiding in the pod. She would shit and piss, too, under the shade of the tilted wreck, in its rain of re-leaked tidal water. When she didn’t want the smallness of the pod, she slipped into the basin’s seas, walked across the landbridges and glittering sandbars to swirling landscapes of rock and mud fronded with life-colonies that clung like oversized froth. But always her parent would be looming on the horizon, its hovering shape bobbing over the water, limbs alternating in a flicker over the surface as it dredged for food. Sometimes it would soar over her in the evening, its blinking night eyes flickering lights, stars or aircraft from the striated skies of Earthly dusks. With those guiding lights it would lead her back to the islet. Her throat would throb in anger and frustration, at the miles of watery, rocky, mountainous horizon she couldn’t escape, but she’d know that straying far would likely mean she’d be killed by something on land or sea that was deadlier than her.\nIt took her a while to have her first period on the planet, because of the nanite vaccine calibrations and the shock of acclimatisation. All things considered, it hadn’t been her worst. But she had recognized the leaden pain of cramps immediately, swallowed the salty spit of nausea and gone to the pod again. She’d squatted under it and bled into the unearthly sea.\nLooking at that, she’d wondered what she was doing. Whether she was seeding something, whether she was changing the ecosystem. She’d felt like an irresponsible teenager. But looking at those crimson blossoms in the waves, she’d also felt a sudden, overwhelming longing. She’d become breathless at the thought that there was nobody else in the world. Not a single human beyond that horizon of seas and mountains and mudflats. Only the unbelievably remote promise that the mission would continue if the unmanned ship that had ejected her pod managed to return to Earth, with the news that the visitation had been successful. Another human might be sent, years later, maybe two if they could manage, hurtling down somewhere on the world with no means of communicating with her. Or a robot probe sent to scour the planet until it found and recorded her impact, just like the first probes that had seeded messages and artifacts to indicate Ziara’s arrival.\nBut at that moment, she was as alone as any human could be. It was conceivable that she might never see a human again. Her eyelids had swollen with tears, and she’d watched her blood fall into the sea. She hadn’t been able to see muo-ka from under the pod then. But she’d heard it secreting something, with loud rattling coughs. She’d sat and waited until her legs ached, until the rising tide lapped at her thighs.\nLater she’d found fresh, coarse membranes strewn across the ground next to her rock calendar. They were waterproof.\nNew clothes.\nZiara had wrapped the membranes around herself like a saree, not knowing how else to wear them. She became light-headed when she caught the scent of flowers in them. It was a shocking sensation, a smell she’d never encountered on this world before.\nmuo-ka had been absent that whole day. When it returned, lights flickering in sunset, she held out her hand. It lurched gracelessly through the air as if caught in turbulence, before hovering down to her, curtaining her in softened limbs. Her palm fell against the familiar spot behind the limbs. She flinched at the heat.\n“Thank you,” Ziara said.\nIt said nothing through her, only unfurling, drowning the back of her throat in bloody sweetness.\nmuo-ka had been dying for months. It had told Ziara, in its sparse way, a cloying thick taste of both sweet berried blood and bitterness in her head.\n“Sick?” she had asked.\n“Sh-ikh,” it had said in her mouth. “Ii-sey-na,” it said, and when the word formed in her throat she knew it meant “death.”\n“Sorry,” she had whispered.\n“Euh-i,” it had said. No. Not sorry.\nZiara had let it talk for longer than ever before. For hours, her hand flushed red from its heat. It had told her several words, sentences, that made up an idea of what to do with its dead body. Then it went on, forming concepts, ideas, lengthier than ever before. muo-ka told her many things.\nZiara thought about her relief, now, looking at dead muo-ka. It disturbed her, but it was the truth. There was a clarity to her world now. To this world. She would move along the mudflats and sandbridges and mountains. She would make blades of her parent’s bones, as it had told her, and explore the world. She would finally go beyond that horizon, which now flared and dimmed with the setting of uong-i.\nShe was an alien, and the world would kill her, sooner rather than later. Even if by some miracle the second human arrived in the coming months, he’d be too weak to help. If one of the leviathans adopted him—and it would be a man that fell this time—it might even violently keep Ziara away from him as its own child, and she had no chance of fighting that. She knew nothing about the dynamics of this adoption. She was the first, after all. They had come into this without much knowledge, except their curiosity and gentle handling of the initial probes.\nUntil and unless Earth sent an actual colonization team that could touch down a vessel with equipment and tools on the surface, humans wouldn’t be able to survive here without the help of muo-ka’s kind. As muo-ka’s child, she wondered if she might be able to befriend one of them, or whether she’d be killed in an instant.\nZiara shook her head. It was no point overthinking. She would walk this world, and see what came. She had chosen this, after all. She hadn’t chosen her parent, but there it was, in front of her, dead as she was alive. And she was alive because of it.\nThe blue dome of the gas giant appeared over the horizon, filling the seas with reflections. In the sparking light of the flares, Ziara waited. The shroud had fossilized into a flexible papyrus, with an organic pattern that looked like writing, symbols. The shrunken behemoth finally vented its innards as the stars and far moons appeared in the night sky, behind streaks of radiant aurora. Ziara clenched her jaw and began to scoop the entrails up to give to the sea, as was dignified. For a moment, she wondered what the deaths of these solitary creatures were normally like. She had seen others on the horizons, but always so far they seemed mirages. They lived their lives alone on this world, severed from each other. It had to be the child that conducted the death rites, once it was ready to move on. Perhaps they induced death in themselves once their child was mature enough.\nShe stopped, recoiling from the mess.\nIn the reeking slop of its guts, she saw muo-ka replicated. A small muo-ka. But not muo-ka. A nameless one, budded in its leviathan body. It was dead. The child’s limbs were tangled in the oily foam of its parent’s death. The body was crushed. Her hands slid over its cold, broken form.\nmuo-ka had budded a child. A child that would have done muo-ka’s death rites once it had matured, ready to go on its own.\n“Oh,” she said, fingers squelching in the translucent mud seeping out of muo-ka’s child. “Oh, no. My muo-ka. My dear muo-ka,” she whispered, to both corpses.\nmuo-ka had budded a child, and finding a mature child already ready to venture out into the world, it had crushed the one growing inside it. Only ziara was muo-ka’s child.\n“You brought me to life,” ziara said, leaning in her parent’s guts, holding her dead sibling, wrapped in clothes her parent had made. Her face crumpled as she buried it in the remains of muo-ka’s life, her body shaking.\nziara left her sibling in the sea with muo-ka’s guts. Using the bone-knife, she cut away the death shroud carefully and wore it around her shoulders. One day, ziara swore to herself, she would translate the symbols it had excreted on it. Her parent’s death letter. She sliced off a part of the deflated hide, scrubbed it in the sea, and wore it as a cowl to keep her head warm during nights. The flares had smoked out. She looked at muo-ka curled dead. It had told her the creatures of the air would come and consume it, slowly, as it should be. She felt bad leaving it there on that stony deathbed, but that was what it had told her to do. She wiped her eyes and face. A bone knife and a whole world she didn’t belong in, except right here on this islet.\nA fiery line streaked across the sky. A human vessel. Or a shooting star. ziara gazed at its afterimage for a moment, and walked off the islet and across the shallows and mudflats of the basin. She had named that basin once, or muo-ka had, with her mouth.\neya-rith. Earth, so she would not be homesick.\nIndrapramit Das (aka Indra Das) is a writer and editor from Kolkata, India. He is a Lambda Literary Award-winner for his debut novel The Devourers (Penguin India / Del Rey), and has been a finalist for the Crawford, Otherwise and Shirley Jackson Awards. His short fiction has appeared in publications including Tor.com, Clarkesworld, and Asimov’s, and has been widely anthologized. He is an Octavia E. Butler Scholar and a grateful graduate of Clarion West 2012. He has lived in India, the United States, and Canada, where he completed his MFA at the University of British Columbia."}