{"fingerprint": "0xf5m3EZSg1ix1Tr21dySTVa92U=", "sitename": "Clarkesworld Magazine", "title": "Weep For Day by Indrapramit Das", "author": "Indrapramit Das", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/das_04_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Weep For Day by Indrapramit Das", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7880 words, novelette, REPRINT\n Weep For Day\n I was eight years old the first time I saw a real, living Nightmare. My parents took my brother and I on a trip from the City-of-Long-Shadows to the hills at Evening’s edge, where one of my father’s clients had a manse. Father was a railway contractor. He hired out labor and resources to the privateers extending the frontiers of civilization towards the frozen wilderness of the dark Behind-the-Sun. Aptly, we took a train up to the foothills of the great Penumbral Mountains.\n It was the first time my brother and I had been on a train, though we’d seen them tumble through the city with their cacophonic engines, cumulous tails of smoke and steam billowing like blood over the rooftops when the red light of our sun caught them. It was also the first time we had been anywhere close to Night—Behind-the-Sun—where the Nightmares lived. Just a decade before we took that trip, it would have been impossible to go as far into Evening as we were doing with such casual comfort and ease.\n Father had prodded the new glass of the train windows, pointing to the power-lines crisscrossing the sky in tandem with the gleaming lines of metal railroads silvering the hazy landscape of progress. He sat between my brother Velag and I, our heads propped against the bulk of his belly, which bulged against his rough crimson waistcoat. I clutched that coat and breathed in the sweet smell of chemlis gall that hung over him. Mother watched with a smile as she peeled indigos for us with her fingers, laying them in the lap of her skirt.\n “Look at that. We’ve got no more reason to be afraid of the dark, do we, my tykes?” said Father, his belly humming with the sound of his booming voice.\n Dutifully, Velag and I agreed there wasn’t.\n “Why not?” he asked us, expectant.\n “Because of the Industrialization, which brings the light of Day to the darkness of Night,” we chimed, a line learned both in school and home (inaccurate, as we’d never set foot in Night itself). Father laughed. I always slowed down on the word “industrialization,” which caused Velag and I to say it at different times. He was just over a year older than me, though.\n “And what is your father, children?” Mother asked.\n “A knight of Industry and Technology, bringer of light under Church and Monarchy.”\n I didn’t like reciting that part, because it was had more than one long “y” word, and felt like a struggle to say. Father was actually a knight, though not a knight-errant for a while. He had been too big by then to fit into a suit of plate-armor or heft a heavy sword around, and knights had stopped doing that for many years anyway. The Industrialization had swiftly made the pageantry of adventure obsolete.\n Father wheezed as we reminded him of his knighthood, as if ashamed. He put his hammy hands in our hair and rubbed. I winced through it, as usual, because he always forgot about the pins in my long hair, something my brother didn’t have to worry about. Mother gave us the peeled indigos, her hands perfumed with the citrus. She was the one who taught me how to place the pins in my hair, both of us in front of the mirror looking like different sized versions of each other.\n I looked out the windows of our cabin, fascinated by how everything outside slowly became bluer and darker as we moved away from the City-of-Long-Shadows, which lies between the two hemispheres of Day and Night. Condensation crawled across the corners of the double-glazed panes as the train took us further east. Being a studious girl even at that age, I deduced from school lessons that the air outside was becoming rapidly colder as we neared Night’s hemisphere, which has never seen a single ray of our sun and is theorized to be entirely frozen. The train, of course, was kept warm by the same steam and machinery that powered its tireless wheels and kept its lamps and twinkling chandeliers aglow.\n “Are you excited to see the Nightmare? It was one of the first to be captured and tamed. The gentleman we’re visiting is very proud to be its captor,” said Father.\n “Yes!” screamed Velag. “Does it still have teeth? And claws?” he asked, his eyes wide.\n “I would think so,” Father nodded.\n “Is it going to be in chains?”\n “I hope so, Velag. Otherwise it might get loose and—” he paused for dramatic effect. I froze in fear. Velag looked eagerly at him. “Eat you both up!” he bellowed, tickling us with his huge hands. It took all my willpower not to scream. I looked at Velag’s delighted expression to keep me calm, reminding myself that these were just Father’s hands jabbing my sides.\n “Careful!” Mother said sharply, to my relief. “They’ll get the fruit all over.” The indigo segments were still in our laps, on the napkins Mother had handed to us. Father stopped tickling us, still grinning.\n “Do you remember what they look like?” Velag asked, as if trying to see how many questions he could ask in as little time as possible. He had asked this one before, of course. Father had fought Nightmares, and even killed some, when he was a knight-errant.\n “We never really saw them, son,” said Father. He touched the window. “Out there, it’s so cold you can barely feel your own fingers, even in armor.”\n We could see the impenetrable walls of the forests pass us by—shaggy, snarled mare-pines, their leaves black as coals and branches supposedly twisted into knots by the Nightmares to tangle the path of intruders. The high, hoary tops of the trees shimmered ever so slightly in the scarce light sneaking over the horizon, which they sucked in so hungrily. The moon was brighter here than in the City, but at its jagged crescent, a broken gemstone behind the scudding clouds. We were still in Evening, but had encroached onto the Nightmares’ outer territories, marked by the forests that extended to the foothills. After the foothills, there was no more forest, because there was no more light. Inside our cabin, under bright electric lamps, sitting on velvet-lined bunks, it was hard to believe that we were actually in the land of Nightmares. I wondered if they were in the trees right now, watching our windows as we looked out.\n “It’s hard to see them, or anything, when you’re that cold, and,” Father breathed deeply, gazing at the windows. “They’re very hard to see.” It made me uneasy, hearing him say the same thing over and over. We were passing the very forests he traveled through as a knight-errant, escorting pioneers.\n “Father’s told you about this many times, dear,” Mother interjected, peering at Father with worried eyes. I watched. Father smiled at her and shook his head.\n “That’s alright, I like telling my little tykes about my adventures. I guess you’ll see what a Nightmare looks like tomorrow, eh? Out in the open. Are you excited?” he asked, perhaps forgetting that he’d already asked. Velag shouted in the affirmative again.\n Father looked down at me, raising his bushy eyebrows. “What about you, Valyzia?”\n I nodded and smiled.\n I wasn’t excited. Truth be told, I didn’t want to see it at all. The idea of capturing and keeping a Nightmare seemed somehow disrespectful in my heart, though I didn’t know the word then. It made me feel weak and confused, because I was and always had been so afraid of them, and had been taught to be.\n I wondered if Velag had noticed that Father had once again refused to actually describe a Nightmare. Even in his most excitable retellings of his brushes with them, he never described them as more than walking shadows. There was a grainy sepia-toned photograph of him during his younger vigils as a knight-errant above the mantle of our living-room fireplace. It showed him mounted on a horse, dressed in his plate-armor and fur-lined surcoat, raising his longsword to the skies (the blade was cropped from the picture by its white border). Clutched in his other plated hand was something that looked like a blot of black, as if the chemicals of the photograph had congealed into a spot, attracted by some mystery or heat. The shape appeared to bleed back into the black background.\n It was, I had been told, the head of a Nightmare Father had slain. It was too dark a thing to be properly caught by whatever early photographic engine had captured his victory. The blot had no distinguishing features apart from two vague points emerging from the rest of it, like horns or ears. That head earned him a large part of the fortune he later used to start up his contracting business. We never saw it, because Nightmares’ heads and bodies were burned or gibbeted by knights-errant, who didn’t want to bring them into the City for fear of attracting their horde. The photograph had been a source of dizzying pride for my young self, because it meant that my father was one of the bravest people I knew. At other times, it just made me wonder why he couldn’t describe something he had once beheaded, and held in his hand as a trophy.\n My indigo finished, Mother took the napkin and wiped my hands with it. My brother still picked at his. A waiter brought us a silver platter filled with sugar-dusted pastries, their centers soft with warm fudge and grünberry jam. We’d already finished off supper, brought under silver domes that gushed steam when the waiters raised them with their white-gloved hands, revealing chopped fungus, meat dumplings, sour cream and fermented salad. Mother told Velag to finish the indigo before he touched the pastries. Father ate them with as much gusto as I did. I watched him lick his powdered fingers, that had once held the severed head of a Nightmare.\n When it was time for respite, the cabin lights were shut off and the ones in the corridor were dimmed. I was relieved my parents left the curtains of the windows open as we retired, because I didn’t want it to be completely dark. It was dim enough outside that we could fall asleep. It felt unusual to go to bed with windows uncovered for once.\n I couldn’t help imagine, as I was wont to do, that as our train moved through Evening’s forested fringes, the Nightmares would find a way to get on board. I wondered if they were already on the train. But the presence of my family, all softly snoring in their bunks (Velag above me, my parents opposite us); the periodic, soothing flash of way-station lights passing by outside; the sigh of the sliding doors at the end of the carriage opening and closing as porters, waiters, and passengers moved through the corridors; the sweet smell of the fresh sheets and pillow on my bunk—these things lulled me into a sleep free of bad dreams, despite my fear of seeing the creature we’d named bad dreams after, face-to-face, the next vigil.\n When I was six I stopped sleeping in my parents’ room, and started sleeping in the same room as my brother. At the time of this change, I was abnormally scared of the dark (and consider, reader, that this was a time when fear of the dark was as normal and acceptable as the fear of falling from a great height). So scared that I couldn’t fall sleep after the maids came around and closed our sleep-shutters and drew the curtains, to block out the western light for respite.\n The heavy clatter of the wooden slats being closed every respite’s eve was like a note of foreboding for me. I hunkered under the blankets, rigid with anxiety as the maids filed out of the room with their lanterns drawing wild shadows on the walls. Then the last maid would close the door, and our room would be swallowed up by those shadows.\n In the chill darkness that followed, I would listen to the clicking of Nightmares’ claws as they walked up and down the corridors of our shuttered house. Our parents had often told me that it was just rats in the walls and ceiling, but I refused to believe it. Every respite I would imagine one of the Nightmare intruders slinking into our room, listening to its breathing as it came closer to my bed and pounced on me, not being able to scream as it sat on my chest and ran its reeking claws through my hair, winding it into knots around its long fingers and laughing softly.\n Enduring the silence for what seemed like hours, I would begin to wail and cry until Velag threw pillows at me and Mother came to my side to shush me with her kisses. To solve the problem, my parents tried keeping the sleep-shutters open through the hours of respite, and moved my brother to a room on the windowless east-facing side of the house when he complained. Unfortunately, we require the very dark we fear to fall asleep. The persistent burning line of the horizon beyond the windows, while a comforting sight, left me wide awake for most of respite.\n In the end Velag and I were reunited and the shutters closed once more, because Father demanded that I not be coddled when my brother had learned to sleep alone so bravely. I often heard my parents arguing about this, since Mother thought it was madness to try and force me not to be afraid. Most of my friends from school hadn’t and wouldn’t sleep without their parents until they were at least eleven or twelve. Father was adamant, demanding that we learn to be strong and brave in case the Nightmares ever found a way to overrun the city.\n It’s a strange thing, to be made to feel guilty for learning too well something that was ingrained in us from the moment we were born. Now nightmare is just a word, and it’s unusual to even think that the race that we gave that name might still be alive somewhere in the world. When Velag and I were growing up, Nightmares were the enemy.\n Our grandparents told us about them, as did our parents, as did our teachers, as did every book and textbook we had ever come across. Stories of a time when guns hadn’t been invented, when knights-errant roved the frigid forest paths beyond the City-of-Long-Shadows to prove their manhood and loyalty to the Monarchy and its Solar Church, and to extend the borders of the city and find new resources. A time coming to a close when I was born, even as the expansion continued onward faster than ever.\n I remember my school class-teacher drawing the curtains and holding a candle to a wooden globe of our planet to show us how the sun made Night and Day. She took a piece of chalk and tapped where the candlelight turned to shadow on the globe. “That’s us,” she said, and moved the chalk over to the shadowed side. “That’s them,” she said.\n Nightmares have defined who we are since we crawled out of the hot lakes at the edge of fiery Day, and wrapped the steaming bloody skins of slaughtered animals around us to walk upright, east into the cooler marches of our world’s Evening. We stopped at the alien darkness we had never seen before, not just because of the terrible cold that clung to the air the further we walked, but because of what we met at Evening’s end.\n A race of walking shadows, circling our firelight with glittering eyes, felling our explorers with barbed spears and arrows, snatching our dead as we fled from their ambushes. Silently, these unseen, lethal guardians of Night’s bitter frontier told us we could go no further. But we couldn’t go back towards Day, where the very air seems to burn under the sun’s perpetual gaze.\n So we built our villages where sun’s light still lingers and the shadows are longest before they dissolve into Evening. Our villages grew into towns, and our towns grew into the City-of-Long-Shadows, and our City grew along the Penumbra until it reached the Seas-of-Storms to the north and the impassable crags of World’s-Rim (named long before we knew this to be false) to the south. For all of history, we looked behind our shoulders at the gloaming of the eastern horizon, where the Nightmares watched our progress.\n So the story went, told over and over.\n We named bad dreams after them because we thought Nightmares were their source, that they sent spies into the city to infect our minds and keep us afraid of the dark, their domain. According to folklore, these spies could be glimpsed upon waking abruptly. Indeed, I’d seen them crouching malevolently in the corner of the bedroom, wreathed in the shadows that were their home, slinking away with impossible speed once I looked at them.\n There are no Nightmares left alive anywhere near the City-of-Long-Shadows, but we still have bad dreams and we still see their spies sometimes when we wake. Some say they are spirits of their race, or survivors. I’m not convinced. Even though we have killed all the Nightmares, our own half-dreaming minds continue to populate our bedrooms with their ghosts, so we may remember their legacy.\n To date, none of our City’s buildings have windows or doors on their east-facing walls.\n And so the train took us to the end of our civilization. There are many things I remember about Weep-for-Day, though in some respects those memories feel predictably like the shreds of a disturbing dream. Back then it was just an outpost, not a hill-station town like it is now. The most obvious thing to remember is how it sleeted or snowed all the time. I know now that it’s caused by moist convective winds in the atmosphere carrying the warmth of the sun from Day to Night, their loads of fat clouds scraping up against the mountains of the Penumbra for all eternity and washing the foothills in their frozen burden. But to my young self, the constant crying of that bruised sky was just another mystery in the world, a sorcery perpetrated by the Nightmares.\n I remember, of course, how dark it was. How the people of the outpost carried bobbing lanterns and acrid magenta flares that flamed even against the perpetual wind and precipitation. How everyone outside (including us) had to wear goggles and thick protective suits lined with the fur of animals to keep the numbing cold of outer Evening out. I had never seen such darkness outdoors, and it felt like being asleep while walking. To think that beyond the mountains lay an absence of light even deeper was unbelievable.\n I remember the tall poles that marked turns in the curving main road, linked by the ever-present electric and telegraph wires that made such an outpost possible. The bright gold-and-red pennants of the Monarchy fluttered from those poles, dulled by lack of light. They all showed a sun that was no longer visible from there.\n I remember the solar shrines—little huts by the road, with small windows that lit up every few hours as chimes rang out over the windy outpost. Through the doors you could see the altars inside; each with an electric globe, its filament flooded with enough voltage to make it look like a hot ball of fire. For a minute these shrines would burn with their tiny artificial suns, and the goggled and suited inhabitants of Weep-for-Day would huddle around them like giant flies, their shadows wavering lines on the streaks of light cast out on the muddy snow or ice. They would pray on their knees, some reaching out to rub the faded ivory crescents of sunwyrm fangs on the altars.\n Beyond the road and the slanted wet roofs of Weep-for-Day, there was so little light that the slope of the hill was barely visible. The forested plain beyond was nothing but a black void that ended in the faint glow of the horizon—the last weak embers in a soot-black fireplace just doused with water.\n I couldn’t see our City-of-Long-Shadows, which filled me with an irrational anxiety that it was gone forever, that if we took the train back we would find the whole world filled with darkness and only Night waiting on the other side.\n But these details are less than relevant. That trip changed me and changed the course of my life not because I saw what places beyond the City-of-Long-Shadows looked like, though seeing such no doubt planted the seeds of some future grit in me. It changed me because I, with my family by my side, witnessed a living Nightmare, as we were promised.\n The creature was a prisoner of Vorin Tylvur, who was at the time the Consul of Weep-for-Day, a knight like Father, and an appointed privateer and mining coordinator of the Penumbral territories. Of course, he is now well remembered for his study of Nightmares in captivity, and his campaigns to expand the Monarchy’s territories into Evening. The manse we stayed in was where he and his wife lived, governing the affairs of the outpost and coordinating expansion and exploration.\n I do not remember much of our hosts, except that they were adults in the way all adults who aren’t parents are, to little children. They were kind enough to me. I couldn’t comprehend the nature of condescension at that age, but I did find the cooing manner of most adults who talked to me boring, and they were no different. Though I’m grateful for their hospitality to my family, I cannot, in retrospect, look upon them with much returned kindness.\n They showed us the imprisoned Nightmare on the second vigil of our stay. It was in the deepest recesses of the manse, which was more an oversized, glorified bunker on the hill of Weep-for-Day than anything else. We went down into a dank, dim corridor in the chilly heart of that mound of crustal rock to see the prisoner.\n “I call it Shadow. A little nickname,” Sir Tylvur said with a toothy smile, his huge moustache hanging from his nostrils like the dead wings of some poor misbegotten bird trapped in his head. He proved himself right then to have not only a startling lack of imagination for a man of his intelligence and inquisitiveness, but also a grotesquely inappropriate sense of levity.\n It would be dramatic and untruthful to say that my fear of darkness receded the moment I set eyes on the creature. But something changed in me. There, looking at this hunched and shivering thing under the smoky blaze of the flares its armored gaolers held to reveal it to its captor’s guests, I saw that a phantom flayed was just another animal.\n Sir Tylvur had made sure that its light-absorbent skin would not hinder our viewing of the captured enemy. There is no doubt that I feared it, even though its skin was stripped from its back to reveal its glistening red muscles, even though it was clearly broken and defeated. But my mutable young mind understood then, looking into its shining black eyes—the only visible feature in the empty dark of its face—that it knew terror just as I or any human did. The Nightmare was scared. It was a heavy epiphany for a child to bear, and I vomited on the glass observation wall of its cramped holding cell.\n Velag didn’t make fun of me. He shrank into Mother’s arms, trying to back away from the humanoid silhouette scrabbling against the glass to escape the light it so feared; a void-like cut-out in reality but for that livid wet wound on its back revealing it to be as real as us. It couldn’t, or would not, scream or vocalize in any way. Instead, we just heard the squeal of its spider-like hands splayed on the glass, claws raking the surface.\n I looked at Father, standing rigid and pale, hands clutched into tight fists by his sides. The same fists that held up the severed head of one of this creature’s race in triumph so many years ago. Just as in the photograph, there were the horn-like protrusions from its head, though I still couldn’t tell what they were. I looked at Mother who, despite the horrific vision in front of us, despite her son clinging to her waist, reached down in concern to wipe the vomit from my mouth and chin with bare fingers, her gloves crumpled in her other hand.\n As Sir Tylvur wondered what to do about his spattered glass wall, he decided to blame the Nightmare for my reaction and rapped hard on the cell with the hilt of his sheathed ceremonial sword. He barked at the prisoner, wanting to frighten it away from the glass, I suppose. The only recognizable word in between his grunts was “Shadow.” But as he called it by that undignified, silly nickname, the thing stopped its frantic scrabbling. Startled, Sir Tylvur stepped back. The two armored gaolers stepped back as well, flares wavering in the gloom of the cell. I still don’t know why the Nightmare stopped thrashing, and I never will know for sure. But at that moment I thought it recognized the nickname its captor had given it, and recognize that it was being displayed like a trophy. Perhaps it wanted to retain some measure of its pride.\n The flarelight flickered on its eyes, which grew brighter as moisture gathered on them. It was clearly in pain from the light. I saw that it was as tall as a human, though it looked smaller because of how crouched into itself it was. It cast a shadow like any other animal, and that shadow looked like its paler twin, dancing behind its back. Chains rasped on the wet cell floor, shackled to its limbs. The illuminated wound on its back wept pus, but the rest of it remained that sucking, indescribable black that hurt the human eye.\n Except something in its face. It looked at us, and out of that darkness came a glittering of wet obsidian teeth as unseen lips peeled back. I will never forget that invisible smile, whether it was a grimace of pain or a taunting leer.\n “Kill it,” Velag whispered. And that was when Mother took both our hands tight in hers, and pulled us away from the cell. She marched us down that dank corridor, leaving the two former knights-errant, Father and Sir Tylvur, staring into that glimmering cell at the spectre of their past.\n That night, in the tiny room we’d been given as our quarters, I asked Velag if the Nightmare had scared him.\n “Why should it scare me,” he said, face pale in the dim glow of the small heating furnace in the corner of the chamber. “It’s in chains.”\n “You just looked scared. It’s okay to be scared. I was too. But I think it was as well.”\n “Shut up. You don’t know what you’re saying. I’m going to sleep,” he said, and turned away from me, his cot groaning. The furnace hissed and ticked.\n “I think papa was scared also. He didn’t want to see a Nightmare again,” I said to Velag’s back.\n That was when my brother pounced off his cot and on top of me. I was too shocked to scream. My ingrained submission to his power as an elder male authority figure took over. I gave no resistance. Sitting on my small body, Velag took my blanket and shoved it into my mouth. Then, he snatched my pillow and held it over my face. Choking on the taste of musty cloth, I realized I couldn’t breathe. I believed that my brother was about to kill me then. I truly believed it. I could feel the pressure of his hands through the pillow, and they were at that moment the hands of something inhuman. I was more terrified then than I’d ever been in my entire short life, plagued though I’d always been by fear.\n He held the pillow over my head for no more than four seconds, probably less. When he raised it off my face and pulled the blanket out of my mouth he looked as shaken as I was. His eyes were wet with tears, but in a second his face was twisted in a grimace.\n “Never call papa a coward. Never call papa a coward. Papa was never afraid. Do you hear me? You never had to sleep alone in the dark, you don’t know. I’m going to grow up and be like papa and kill them. I’ll kill them,” he hissed the words into my face like a litany. I started crying, unable and probably too scared to tell him I hadn’t called Father a coward. I could still barely breathe, so flooded was I with my own tears, so drunk on the air he had denied me. Velag went back to his cot and wrapped himself in his blanket, breathing heavily.\n As I shuddered with stifled sobs, I decided that I would never tell my parents about this, that I would never have Velag punished for this violence. I didn’t forgive him, not even close, but that is what I decided.\n I was seventeen the last time I saw Velag. I went to visit him at the Royal Military Academy’s boarding school. He had been there for four years already. We saw him every few moons when he came back to the City proper to visit. But I wanted to see the campus for myself. It was a lovely train ride, just a few hours from the central districts of the City-of-Long-Shadows to the scattered hamlets beyond it.\n It was warmer and brighter out where the Academy was. The campus was beautiful, sown with pruned but still wild looking trees and plants that only grew further out towards Day, their leaves a lighter shade of blue and their flowers huge, craning to the west on thick stems. The sun still peered safely behind the edge of the world, but its gaze was bright enough to wash the stately buildings of the boarding school with a fiery golden-red light, sparkling in the waxy leaves of vines winding their way around the arched windows. On every ornate, varnished door was a garish propaganda poster of the Dark Lord of Nightmares, with his cowled cloak of shadows and black sword, being struck down by our soldiers’ bayoneted guns.\n I sat with Velag in a cupola in the visitors’ garden, which was on a gentle bluff. In the fields adjacent, his fellow student-soldiers played tackleball, their rowdy calls and whistles ringing through the air. We could see heavy banks of glowing, sunlit storm-clouds to the west where the atmosphere boiled and churned in the heat of Day, beyond miles of shimmering swamp-forests and lakes. To the east, a faint moon hung over the campus, but no stars were visible so close to Day.\n Velag looked so different from the last time I saw him. His pimples were vanishing, the sallow softness of adolescence melting away to reveal the man he was to become. The military uniform, so forbidding in red and black, suited his tall form. He looked smart and handsome in it. It hurt me to see him shackled in it, but I could see that he wore it with great pride.\n He held my hand and asked about my life back home, about my plans to apply to the College of Archaeology at the University of St. Kataretz. He asked about our parents. He told me how gorgeous and grown-up I looked in my dress, and said he was proud of me for becoming a “prodigy.” I talked to him with a heavy ache in my chest, because I knew with such certainty that we hardly knew each other, and would get no chance to any time soon, as he would be dispatched to the frontlines of Penumbral Conquest.\n As if reading my thoughts, his cheek twitched with what I thought was guilt, and he looked at the stormy horizon. Perhaps he was remembering the night on which he told me he would grow up and kill Nightmares like Father—a promise he was keeping. He squeezed my hand.\n “I’ll be alright, Val. Don’t you worry.”\n I gave him a rueful smile. “It’s not too late. You can opt to become a civilian after graduation and come study with me at St. Kataretz. Ma and papa would think no less of you. You could do physics again, you loved it before. We can get an apartment in Pemluth Halls, share the cost. The University’s right in the middle of the City, we’d have so much fun together.”\n “I can’t. You know that. I want this for myself. I want to be a soldier, and a knight.”\n “Being a knight isn’t the same thing as it was in papa’s time. He was independent, a privateer. Things have changed. You’ll be a part of the military. Knighthoods belong to them now and they’re stingy with them. They mostly give them to soldiers who are wounded or dead, Velag.”\n “I’m in military school, by the saints, I know what a knighthood is or isn’t. Please don’t be melodramatic. You’re an intelligent girl.”\n “What’s that got to do with anything?”\n “I’m going. I have more faith in my abilities than you do.”\n “I have plenty of faith in you. But the Nightmares are angry now, Velag. We’re wiping them out. They’re scared and angry. They’re coming out in waves up in the hills. More of our soldiers are dying than ever before. How can I not worry?”\n His jaw knotted, he glared down at our intertwined hands. His grip was limp now. “Don’t start with your theories about the benevolence of Nightmares. I don’t want to hear it. They’re not scared, they are fear, and we’ll wipe them off the planet if need be so that you and everybody else can live without that fear.”\n “I’m quite happy with my life, thank you. I’d rather you be alive for ma and papa and me than have the terrible horde of the Nightmares gone forever.”\n He bit his lip and tightened his hand around mine again. “I know, little sister. You’re sweet to worry so. But the Monarchy needs me. I’ll be fine. I promise.”\n And that was the end of the discussion as far as he was concerned. I knew it was no point pushing him further, because it would upset him. This was his life, after all. The one he had chosen. I had no right to belittle it. I didn’t want to return to the City on bad terms with him. We made what little small talk was left to make, and then we stood and kissed each other on the cheek, and I hugged him tight and watched him walk away.\n What good are such promises as the one he made on our final farewell, even if one means them with all of one’s heart? He was dispatched right after his graduation a few moons later, without even a ceremony because it was wartime. After six moons of excited letters from the frontlines at the Penumbral Mountains, he died with a Nightmare’s spear in his chest, during a battle that earned the Monarchy yet another victory against the horde of darkness. Compared to the thousands of Nightmares slaughtered during the battle with our guns and cannons, the Monarchy’s casualties were small. And yet, my parents lost their son, and I my brother.\n In death, they did give Velag the knighthood he fought so hard for. Never have I hated myself so much for being right.\n When Velag was being helped out of Mother by doctors in the city, my father had been escorting pioneers in the foothills. I see him in his armor, the smell of heated steel and cold sweat cloying under his helm, almost blind because of the visor, sword in one hand, knotted reins and a flaming torch in the other, his mount about to bolt. A new metal coal-chamber filled with glowing embers strapped to his back to keep the suit warm, making his armor creak and pop as it heated up, keeping him off-balance with its weight and hissing vents but holding the freezing cold back a little. Specks of frozen water flying through the torch-lit air like dust, biting his eyes through the visor. His fingers numb in his gloves, despite the suit. The familiar glitter of inhuman eyes beyond the torchlight, nothing to go by but reflections of fire on his foes, who are invisible in the shadows, slinking alongside the caravan like bulges in the darkness. The only thing between the Nightmares and the pioneers with their mounts and carriages weighed down by machinery and thick coils of wire and cable that will bring the light of civilization to these wilds, is him and his contingent.\n How long must that journey have been to him? How long till he returned alive to see his wife and new son Velag in a warm hospital room, under the glow of a brand new electric light?\n By the time I was born, armorers had invented portable guns and integrated hollow cables in the suit lining to carry ember-heated water around armor, keeping it warmer and enabling mercenaries and knights-errant to go deeper into Evening. The pioneers followed, bringing their technology to the very tops of the foothills, infested with Nightmares. That was when Father stopped going, lest he never return. They had new tools, but the war had intensified. He had a son and daughter to think of, and a wife who wanted him home.\n When I watched Velag’s funeral pyre blaze against the light of the west on Barrow-of-Bones cremation hill, I wondered if the sparks sent up into the sky by his burning body would turn to stardust in the ether and migrate to the sun to extend its life, or whether this was his final and utter dissolution. The chanting priest from the Solar Church seemed to have no doubts on the matter. Standing there, surrounded by the fossilized stone ribs of Zhurgeith, last of the sunwyrms and heraldic angel of the Monarchy and Church (who also call it Dragon), I found myself truly unsure about what death brings for maybe the first time in my life, though I’d long practiced the cynicism that was becoming customary of my generation.\n I thought with some trepidation about the possibility that if the Church was right, the dust of Velag’s life might be consigned to the eternal dark of cosmic limbo instead of finding a place in the sun, because of what he’d done to me as a child. Because I’d never forgiven him, even though I told myself I had.\n How our world changes.\n The sun is a great sphere of burning gas, ash eventually falls down, and my dead brother remains in the universe because my family and I remember him, just as I remember my childhood, my life, the Nightmares we lived in fear of, the angel Dragon whose host was wiped out by a solar flare before we could ever witness it.\n Outside, the wind howls so loud that I can easily imagine it is the sound of trumpets from a frozen city, peopled by the horde of darkness. Even behind the insulated metal doors and heated tunnels of the cave bunkers that make up After-Day border camp, I can see my breath and need two thick coats to keep warm. My fingers are like icicles as I write. I would die very quickly if exposed to the atmosphere outside. And yet, here I am, in the land of Nightmares.\n Somewhere beyond these Penumbral Mountains, which we crossed in an airtight train, is the City-of-Long-Shadows. I have never been so far from it. Few people have. We are most indebted to those who mapped the shortest route through the mountains, built the rails through the lowest valleys, blasted new tunnels, laid the foundations for After-Day. But no one has gone beyond this point. We—I and the rest of the expeditionary team from St. Kataretz—will be the first to venture into Night. It will be a dangerous endeavor, but I have faith in us, in the brave men and women who have accompanied me here.\n My dear Velag, how would you have reacted to see these beautiful caves I sit in now, to see the secret culture of your enemy? I am surrounded by what can only be called their art, the lantern-light making pale tapestries of the rock walls on which Nightmares through the millennia scratched to life the dawn of their time, the history that followed, and its end, heralded by our arrival into their world.\n In this history we are the enemy, bringing the terror of blinding fire into Evening, bringing the advanced weapons that caused their genocide. On these walls we are drawn in pale white dyes, bioluminescent in the dark, a swarm of smeared light advancing on the Nightmares’ striking, jagged-angled representations of themselves, drawn in black dyes mixed from blood and minerals.\n In this history Nightmares were alive when the last of the sunwyrms flew into Evening to scourge the land for prey. Whether this is truth or myth we don’t know, but it might mean that Nightmares were around long before us. It might explain their adaptation to the darkness of outer Evening—their light-absorbent skin ancient camouflage to hide from sunwyrms under cover of the forests of Evening. We came into Evening with our fire (which they show sunwyrms breathing) and pale skins, our banners showing Dragon and the sun, and we were like a vengeful race of ghosts come to kill on behalf of those disappeared angels of Day, whom they worshipped to the end—perhaps praying for our retreat.\n In halls arched by the ribcages and spines of ancient sunwyrm skeletons I have seen burial chambers; the bones of Nightmares and their children (whom we called imps because we didn’t like to think of our enemy having young) piled high. Our bones lie here too, not so different from theirs. Tooth-marks show that they ate their dead, probably because of the scarcity of food in the fragile ecosystem of Evening. It is no wonder then that they ate our dead too—as we feared. It was not out of evil, but need.\n We have so much yet to learn.\n Perhaps it would have given you some measure of peace, Velag, to know that the Nightmares didn’t want to destroy us, only to drive us back from their home. Perhaps not.\n Ilydrin tells me it is time for us to head out. She is a member of our expedition—a biologist—and my partner. To hide the simple truth of our affection seems here, amidst the empty city of a race we destroyed, an obscenity. Confronted by the vast, killing beauty of our planet’s second half, the stagnant moralities of our city-state appear a trifle. I adore Ilydrin, and I am glad she is here with me.\n One team will stay here while ours heads out into Night. Ilydrin and I took a walk outside to test our armored environmental suits to protect us from the lethal cold. We trod down from the caves of After-Day and into the unknown beyond, breath blurring our glass faceplates, our head-lamps cutting broad swathes through the snow-swarmed dark. We saw nothing ahead but an endless plain of ice—perhaps a frozen sea.\n No spectral spires, no black banners of Night, no horde of Nightmares waiting to attack, no Dark Lord in his distant obsidian palace (an image Ilydrin and I righteously tore down many times in the form of those Army posters, during our early College vigils). We held each others’ gloved hands and returned to Camp, sweating in our cramped shells, heavy boots crunching on the snow. I thought of you, Father, bravely venturing into bitter Evening to support your family. I thought of you, Brother, nobly marching against the horde for your Monarchy. I thought of you, Mother, courageously carrying your first child alone in that empty house before it became our home. I thought of you, Shadow—broken, tortured prisoner, baring your teeth to your captors in silence.\n Out there, I was shaking—nervous, excited, queasy. I wasn’t afraid.\n I have Father’s old photograph with the Nightmare’s head (he took it down from above the mantelpiece after Velag died). I have a photograph of Mother, Father, Velag and I all dressed up before our trip to Weep-for-Day. And finally, a smiling portrait of Velag in uniform before he left for the Academy, his many pimples invisible because of the monochrome softness of the image. I keep these photographs with me, in the pockets of my overcoat, and take them out sometimes when I write.\n So it begins. I write from the claustrophobic confines of the Night-Crawler, a steam-powered vehicle our friends at the College of Engineering designed (our accompanying professors named it with them, no doubt while drunk in a bar on University-Street). It is our moving camp. We’ll sleep and eat and take shelter in it, and explore further and longer—at least a few vigils, we hope. If its engines fail, we’ll have to hike back in our shells and hope for the best. The portholes are frosted over, but the team is keeping warm by stoking the furnace and singing. Ilydrin comes and tells me, her lips against my hair: “Val. Stop writing and join us.” I tell her I will, in a minute. She smiles and walks back to the rest, her face flushed and soot-damp from the open furnace. I live for these moments.\n I will lay down this pen now. A minute.\n I don’t know what we’ll find out here. Maybe we will find the Dark Lord and his gathered horde of Nightmares. But at this point, even the military doesn’t believe that, or they would have opposed the funding for this expedition or tried to hijack it.\n Ilydrin says there’s unlikely to be life so deep into Night—even Nightmares didn’t venture beyond the mountains, despite our preconceptions. But she admits we’ve been wrong before. Many times. What matters is that we are somewhere new. Somewhere other than the City-of-Long-Shadows and the Penumbral territories, so marked by our history of fear. We need to see the rest of this world, to meet its other inhabitants—if there are others—with curiosity, not apprehension. And I know we will, eventually. This is our first, small step. I wish you were here with me to see it, Velag. You were but a child on this planet.\n We might die here. It won’t be because we ventured into evil. It will be because we sought new knowledge. And in that, I have no regrets, even if I’m dead when this is read. A new age is coming. Let this humble account be a preface to it.\n Originally published in Asimov’s Science Fiction, August 2012\n Indrapramit Das (aka Indra Das) is a writer and editor from Kolkata, India. He is a Lambda Literary Award-winner for his debut novel The Devourers (Penguin India / Del Rey), and has been a finalist for the Crawford, Otherwise and Shirley Jackson Awards. His short fiction has appeared in publications including Tor.com, Clarkesworld, and Asimov’s, and has been widely anthologized. He is an Octavia E. Butler Scholar and a grateful graduate of Clarion West 2012. He has lived in India, the United States, and Canada, where he completed his MFA at the University of British Columbia."}