{"fingerprint": "kUUoUwv111VQfoYPV/ehPGfK7Ao=", "sitename": "Clarkesworld Magazine", "title": "Three Cups of Grief, by Starlight by Aliette de Bodard", "author": "Aliette de Bodard", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_01_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Three Cups of Grief, by Starlight by Aliette de Bodard", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6810 words, short story\nThree Cups of Grief, by Starlight\n2015 BSFA Award Winner: Best Short Story\n2016 Locus Awards Finalist: Best Short Story\n2016 Finalist Eugie Foster Memorial Award for Short Fiction\nGreen tea: green tea is made from steamed or lightly dried tea leaves. The brew is light, with a pleasant, grassy taste. Do not over-steep it, lest it become bitter.\nAfter the funeral, Quang Tu walked back to his compartment, and sat down alone, staring sightlessly at the slow ballet of bots cleaning the small room—the metal walls pristine already, with every trace of Mother’s presence or of her numerous mourners scrubbed away. He’d shut down the communal network—couldn’t bear to see the potted summaries of Mother’s life, the endlessly looping vids of the funeral procession, the hundred thousand bystanders gathered at the gravesite to say goodbye, vultures feasting on the flesh of the grieving—they hadn’t known her, they hadn’t cared—and all their offerings of flowers were worth as much as the insurances of the Embroidered Guard.\n“Big brother, I know you’re here,” a voice said, on the other side of the door he’d locked. “Let me in, please?”\nOf course. Quang Tu didn’t move. “I said I wanted to be alone,” he said.\nA snort that might have been amusement. “Fine. If you insist on doing it that way . . . ”\nHis sister, The Tiger in the Banyan, materialized in the kitchen, hovering over the polished counter, near the remains of his morning tea. Of course, it wasn’t really her: she was a Mind encased in the heartroom of a spaceship, far too heavy to leave orbit; and what she projected down onto the planet was an avatar, a perfectly rendered, smaller version of herself—elegant and sharp, with a small, blackened spot on her hull which served as a mourning band. “Typical,” she said, hovering around the compartment. “You can’t just shut yourself away.”\n“I can if I want to,” Quang Tu said—feeling like he was eight years old again, trying to argue with her—as if it had ever made sense. She seldom got angry—mindships didn’t, mostly; he wasn’t sure if that was the overall design of the Imperial Workshops, or the simple fact that her lifespan was counted in centuries, and his (and Mother’s) in mere decades. He’d have thought she didn’t grieve, either; but she was changed—something in the slow, careful deliberation of her movements, as if anything and everything might break her . . .\nThe Tiger in the Banyan hovered near the kitchen table, watching the bots. She could hack them, easily; no security worth anything in the compartment. Who would steal bots, anyway?\nWhat he valued most had already been taken away.\n“Leave me alone,” he said. But he didn’t want to be alone; not really. He didn’t want to hear the silence in the compartment; the clicking sounds of the bots’ legs on metal, bereft of any warmth or humanity.\n“Do you want to talk about it?” The Tiger in the Banyan asked.\nShe didn’t need to say what; and he didn’t do her the insult of pretending she did. “What would be the point?”\n“To talk.” Her voice was uncannily shrewd. “It helps. At least, I’m told it does.”\nQuang Tu heard, again, the voice of the Embroidered Guard; the slow, measured tones commiserating on his loss; and then the frown, and the knife-thrust in his gut.\nYou must understand that your mother’s work was very valuable . . .\nThe circumstances are not ordinary . . .\nThe slow, pompous tones of the scholar; the convoluted official language he knew by heart—the only excuses the state would make to him, couched in the over-formality of memorials and edicts.\n“She—” he took a deep, trembling breath—was it grief, or anger? “I should have had her mem-implants.” Forty-nine days after the funeral; when there was time for the labs to have decanted and stabilized Mother’s personality and memories, and added her to the ranks of the ancestors on file. It wasn’t her, it would never be her, of course—just a simulation meant to share knowledge and advice. But it would have been something. It would have filled the awful emptiness in his life.\n“It was your right, as the eldest,” The Tiger in the Banyan said. Something in the tone of her voice . . .\n“You disapprove? You wanted them?” Families had fallen out before, on more trivial things.\n“Of course not.” A burst of careless, amused laughter. “Don’t be a fool. What use would I have, for them. It’s just—” She hesitated, banking left and right in uncertainty. “You need something more. Beyond Mother.”\n“There isn’t something more!”\n“You—”\n“You weren’t there,” Quang Tu said. She’d been away on her journeys, ferrying people back and forth between the planets that made up the Dai Viet Empire; leaping from world to world, with hardly a care for planet-bound humans. She—she hadn’t seen Mother’s unsteady hands, dropping the glass; heard the sound of its shattering like a gunshot; hadn’t carried her back to bed every evening, tracking the progress of the disease by the growing lightness in his arms—by the growing sharpness of ribs, protruding under taut skin.\nMother had remained herself until almost the end—sharp and lucid and utterly aware of what was happening, scribbling in the margins of her team’s reports and sending her instructions to the new space station’s building site, as if nothing untoward had ever happened to her. Had it been a blessing; or a curse? He didn’t have answers; and he wasn’t sure he wanted that awful certainty to shatter him.\n“I was here,” The Tiger in the Banyan said, gently, slowly. “At the end.”\nQuang Tu closed his eyes, again, smelling antiseptic and the sharp odor of painkillers; and the sour smell of a body finally breaking down, finally failing. “I’m sorry. You were. I didn’t mean to—”\n“I know you didn’t.” The Tiger in the Banyan moved closer to him; brushed against his shoulder—ghostly, almost intangible, the breath that had been beside him all his childhood. “But nevertheless. Your life got eaten up, taking care of Mother. And you can say you were only doing what a filial son ought to do; you can say it didn’t matter. But . . . it’s done now, big brother. It’s over.”\nIt’s not, he wanted to say, but the words rang hollow in his own ears. He moved, stared at the altar; at the holo of Mother—over the offering of tea and rice, the food to sustain her on her journey through Hell. It cycled through vids—Mother, heavily pregnant with his sister, moving with the characteristic arrested slowness of Mind-bearers; Mother standing behind Quang Tu and The Tiger in the Banyan in front of the ancestral altar for Grandfather’s death anniversary; Mother, accepting her Hoang Minh Medal from the then Minister of Investigation; and one before the diagnosis, when she’d already started to become frailer and thinner—insisting on going back to the lab; to her abandoned teams and research . . .\nHe thought, again, of the Embroidered Guard; of the words tightening around his neck like an executioner’s garrote. How dare he. How dare they all. “She came home,” he said, not sure how to voice the turmoil within him. “To us. To her family. In the end. It meant something, didn’t it?”\nThe Tiger in the Banyan’s voice was wry, amused. “It wasn’t the Empress that comforted her when she woke at night, coughing her lungs out, was it?” It was . . . treason to much as think this, let alone utter it; though the Embroidered Guard would make allowances for grief, and anger; and for Mother’s continued usefulness to the service of the Empress. The truth was, neither of them much cared, anyway. “It’s not the Empress that was by her side when she died.”\nShe’d clung to his hand, then, her eyes open wide, a network of blood within the whites, and the fear in her eyes. “I—please, child . . . ” He’d stood, frozen; until, behind him, The Tiger in the Banyan whispered, “The lights in Sai Gon are green and red, the lamps in My Tho are bright and dim . . . ”— an Old Earth lullaby, the words stretched into the familiar, slow, comforting rhythm that he’d unthinkingly taken up.\n“Go home to study,\nI shall wait nine months, I shall wait ten autumns . . . ”\nShe’d relaxed, then, against him; and they had gone on singing songs until—he didn’t know when she’d died; when the eyes lost their luster, the face its usual sharpness. But he’d risen from her deathbed with the song still in his mind; and an awful yawning gap in his world that nothing had closed.\nAnd then—after the scattering of votive papers, after the final handful of earth thrown over the grave—the Embroidered Guard.\nThe Embroidered Guard was young; baby-faced and callow, but he was already moving with the easy arrogance of the privileged. He’d approached Quang Tu at the grave site, ostensibly to offer his condolences—it had taken him all of two sentences to get to his true purpose; and to shatter Quang Tu’s world, all over again.\nYour mother’s mem-implants will go to Professor Tuyet Hoa, who will be best able to continue her research . . .\nOf course, the Empire required food; and crops of rice grown in space; and better, more reliable harvests to feed the masses. Of course he didn’t want anyone to starve. But . . .\nMem-implants always went from parent to child. They were a family’s riches and fortune; the continued advice of the ancestors, dispensed from beyond the grave. He’d—he’d had the comfort, as Mother lay dying, to know that he wouldn’t lose her. Not for real; not for long.\n“They took her away from us,” Quang Tu said. “Again and again and again. And now, at the very end, when she ought to be ours—when she should return to her family . . . ”\nThe Tiger in the Banyan didn’t move; but a vid of the funeral appeared on one of the walls, projected through the communal network. There hadn’t been enough space in the small compartment for people to pay their respects; the numerous callers had jammed into the corridors and alcoves, jostling each other in utter silence. “She’s theirs in death, too.”\n“And you don’t care?”\nA side-roll of the avatar, her equivalent of a shrug. “Not as much as you do. I remember her. None of them do.”\nExcept Tuyet Hoa.\nHe remembered Tuyet Hoa, too; coming to visit them on the third day after the New Year—a student paying respect to her teacher, year after year; turning from an unattainable grown-up to a woman not much older than either he or The Tiger in the Banyan; though she’d never lost her rigid awkwardness in dealing with them. No doubt, in Tuyet Hoa’s ideal world, Mother wouldn’t have had children; wouldn’t have let anything distract her from her work.\n“You have to move on,” The Tiger in the Banyan said, slowly, gently; coming by his side to stare at the memorial altar. Bots gathered in the kitchen space, started putting together fresh tea to replace the three cups laid there. “Accept that this is the way things are. They’ll compensate, you know—offer you higher-level promotions and make allowances. You’ll find your path through civil service is . . . smoother.”\nBribes or sops; payments for the loss of something that had no price. “Fair dealings,” he said, slowly, bitterly. They knew exactly the value of what Tuyet Hoa was getting.\n“Of course,” The Tiger in the Banyan said. “But you’ll only ruin your health and your career; and you know Mother wouldn’t have wanted it.”\nAs if . . . No, he was being unfair. Mother could be distant, and engrossed in her work; but she had always made time for them. She had raised them and played with them, telling them stories of princesses and fishermen and citadels vanished in one night; and, later on, going on long walks with Quang Tu in the gardens of Azure Dragons, delightedly pointing at a pine tree or at a crane flying overhead; and animatedly discussing Quang Tu’s fledging career in the Ministry of Works.\n“You can’t afford to let this go sour,” The Tiger in the Banyan said. Below her, the bots brought a small, perfect cup of tea: green, fragrant liquid in a cup, the cracks in the pale celadon like those in eggshells.\nQuang Tu lifted the cup; breathed in the grassy, pleasant smell—Mother would love it, even beyond the grave. “I know,” he said, laying the cup on the altar. The lie slipped out of him as softly, as easily as Mother’s last exhaled breath.\nWu Long tea: those teas are carefully prepared by the tea masters to create a range of tastes and appearances. The brew is sweet with a hint of strength, each subsequent steeping revealing new nuances.\nTuyet Hoa woke up—with a diffuse, growing sense of panic and fear, before she remembered the procedure.\nShe was alive. She was sane. At least . . .\nShe took in a deep, trembling breath; and realized she lay at home, in her bed. What had woken her up—above the stubborn, panicked rhythm of her heart—was a gentle nudge from the communal network, flashes of light relayed by the bots in the lightest phase of her sleep cycle. It wasn’t her alarm; but rather, a notification that a message classified as “urgent” had arrived for her.\nNot again.\nA nudge, at the back of her mind; a thread of thought that wasn’t her own; reminding her she should look at it; that it was her responsibility as the new head of department to pay proper attention to messages from her subordinates.\nProfessor Duy Uyen. Of course.\nShe was as forceful in life as she had been in death; and, because she had been merely Hoa’s head of department, and not a direct ancestor, she felt . . . wrong. Distant, as though she were speaking through a pane of glass.\nHoa was lucky, she knew—receiving mem-implants that weren’t your own family’s could irretrievably scramble your brain, as fifteen different strangers with no consideration or compassion fought for control of your thoughts. She could hear Professor Duy Uyen; and sometimes others of Duy Uyen’s ancestors, as remote ghosts; but that was it. It could have been so much worse.\nAnd it could have been so much better.\nShe got up, ignoring the insistent talk at the back of her mind, the constant urge to be dutiful; and padded into the kitchen.\nThe bots had already set aside Hoa’s first tea of the day. She’d used to take it at work, before the procedure; in the days of Professor Duy Uyen’s sickness, when Duy Uyen came in to work thinner and paler every day—and then became a succession of memorials and vid-calls, injecting her last, desperate instructions into the project before it slipped beyond her grasp. Hoa had enjoyed the quiet: it had kept the desperate knowledge of Professor Duy Uyen’s coming death at bay—the moment when they would all be adrift in the void of space, with no mindship to carry them onwards.\nNow Hoa enjoyed a different quiet. Now she drank her tea first thing in the morning—hoping that, at this early hour, the mem-implants had no motive to kick in.\nNot that it had worked, this particular morning.\nShe sat down to breathe in the flavor—the faint, nutty aroma poised perfectly between floral and sweet—her hand trembling above the surface of the cup—mentally blocking out Professor Duy Uyen for a few precious minutes; a few more stolen moments of tranquility before reality came crashing in.\nThen she gave in, and opened the message.\nIt was from Luong Ya Lan, the researcher who worked on the water’s acidity balance. On the vid relayed from the laboratory, she was pale, but perfectly composed. “Madam Hoa. I’m sorry to have to inform you that the samples in Paddy Four have developed a fungal disease . . . ”\nProfessor Duy Uyen stirred in the depths of Hoa’s brain, parsing the words as they came in—accessing the station’s private network and downloading the pertinent data—the only mercy was that she wasn’t faster than Hoa, and that it would take her fifteen to twenty minutes to parse all of it. The Professor had her suspicions, of course—something about the particular rice strain; perhaps the changes drafted onto the plant to allow it to thrive under starlight, changes taken from the nocturnal honeydreamer on the Sixteenth Planet; perhaps the conditions in the paddy itself . . .\nHoa poured herself another cup of tea; and stared at the bots for a while. There was silence, the voice of Duy Uyen slowly fading away to nothingness in her thoughts. Alone. At last, alone.\nPaddy Four had last been checked on by Ya Lan’s student, An Khang—Khang was a smart and dedicated man, but not a particularly careful one; and she would have to ask him if he’d checked himself, or through bots; and if he’d followed protocols when he’d done so.\nShe got up, and walked to the laboratory—still silence in her mind. It was a short trip: the station was still being built, and the only thing in existence were the laboratory and the living quarters for all ten researchers—a generous allocation of space, far grander than the compartments they would have been entitled to on any of their home stations.\nOutside, beyond the metal walls, the bots were hard at work—reinforcing the structure, gradually layering a floor and walls onto the skeletal structure mapped out by the Grand Master of Design Harmony. She had no need to call up a vid of the outside on her implants to know they were out there, doing their part; just as she was. They weren’t the only ones, of course: in the Imperial Workshops, alchemists were carefully poring over the design of the Mind that would one day watch over the entire station, making sure no flaws remained before they transferred him to the womb of his mother.\nIn the laboratory, Ya Lan was busying herself with the faulty paddy: she threw an apologetic glance at Hoa when Hoa walked in. “You got my message.”\nHoa grimaced. “Yes. Have you had time to analyze?”\nYa Lan flushed. “No.”\nHoa knew. A proper analysis would require more than twenty minutes. But still . . . “If you had to make a rough guess?”\n“Probably the humidity.”\n“Did Khang—”\nYa Lan shook her head. “I checked that too. No contaminants introduced in the paddy; and the last time he opened it was two weeks ago.” The paddies were encased in glass, to make sure they could control the environment; and monitored by bots and the occasional scientist.\n“Fungi can lie dormant for more than two weeks,” Hoa said, darkly.\nYa Lan sighed. “Of course. But I still think it’s the environment: it’s a bit tricky to get right.”\nHumid and dark; the perfect conditions for a host of other things to grow in the paddies—not just the crops the Empire so desperately needed. The named planets were few; and fewer still that could bear the cultivation of food. Professor Duy Uyen had had a vision—of a network of space stations like this one; of fish ponds and rice paddies grown directly under starlight, rather than on simulated Old Earth light; of staples that would not cost a fortune in resources to grow and maintain.\nAnd they had all believed in that vision, like a dying man offered a glimpse of a river. The Empress herself had believed it; so much that she had suspended the law for Professor Duy Uyen’s sake, and granted her mem-implants to Hoa instead of to Duy Uyen’s son: the quiet boy Hoa remembered from her New Year’s visits, now grown to become a scholar in his own right—he’d been angry at the funeral, and why wouldn’t he be? The mem-implants should have been his.\n“I know,” Hoa said. She knelt, calling up the data from the paddy onto her implants: her field of vision filled with a graph of the temperature throughout last month. The slight dips in the curve all corresponded to a check: a researcher opening the paddy.\n“Professor?” Ya Lan asked; hesitant.\nHoa did not move. “Yes?”\n“It’s the third paddy of that strain that fails in as many months . . . ”\nShe heard the question Ya Lan was not asking. The other strain—the one in paddies One to Three—had also failed some tests, but not at the same frequency.\nWithin her, Professor Duy Uyen stirred. It was the temperature, she pointed out, gently but firmly. The honeydreamer supported a very narrow range of temperatures; and the modified rice probably did, too.\nHoa bit back a savage answer. The changes might be flawed, but they were the best candidate they had.\nProfessor Duy Uyen shook her head. The strain in paddies One to Three was better: a graft from a lifeform of an unnumbered and unsettled planet, P Huong Van—luminescents, an insect flying in air too different to be breathable by human beings. They had been Professor Duy Uyen’s favored option.\nHoa didn’t like the luminescents. The air of P Huong Van had a different balance of khi-elements: it was rich in fire, and anything would set it ablaze—flame-storms were horrifically common, charring trees to cinders, and birds in flight to blackened skeletons. Aboard a space station, fire was too much of a danger. Professor Duy Uyen had argued that the Mind that would ultimately control the space station could be designed to accept an unbalance of khi-elements; could add water to the atmosphere to reduce the chances of a firestorm onboard.\nHoa had no faith in this. Modifying a Mind had a high cost, far above that of regulating temperature in a rice paddy. She pulled up the data from the paddies; though of course she knew Professor Duy Uyen would have reviewed it before her.\nProfessor Duy Uyen was polite enough not to chide Hoa; though Hoa could feel her disapproval like the weight of a blade—it was odd, in so many ways, how the refinement process had changed Professor Duy Uyen; how, with all the stabilization adjustments, all the paring down of the unnecessary emotions, the simulation in her mind was utterly, heartbreakingly different from the woman she had known: all the keenness of her mind, and the blade of her finely-honed knowledge, with none of the compassion that would have made her more bearable. Though perhaps it was as well that she had none of the weakness Duy Uyen had shown, in the end—the skin that barely hid the sharpness of bones; the eyes like bruises in the pale oval of her face; the voice, faltering on words or instructions . . .\nPaddies One to Three were thriving; the yield perhaps less than that of Old Earth; but nothing to be ashamed of. There had been a spot of infection in Paddy Three; but the bots had taken care of it.\nHoa watched, for a moment, the bots scuttling over the glass encasing the paddy; watched the shine of metal; the light trembling on the joints of their legs—waiting for the smallest of triggers to blossom into flame. The temperature data for all three paddies was fluctuating too much; and the rate of fire-khi was far above what she was comfortable with.\n“Professor?” Ya Lan was still waiting by Paddy Four.\nThere was only one paddy of that honeydreamer strain: it was new, and as yet unproved. Professor Duy Uyen stirred, within her mind; pointed out the painfully obvious. The strain wasn’t resistant enough—the Empire couldn’t afford to rely on something so fragile. She should do the reasonable thing, and consign it to the scrap bin. They should switch efforts to the other strain, the favored one; and what did it matter if the station’s Mind needed to enforce a slightly different balance of khi-elements?\nIt was what Professor Duy Uyen would have done.\nBut she wasn’t Professor Duy Uyen.\nMinds were made in balance; to deliberately unhinge one . . . would have larger consequences on the station than mere atmospheric control. The risk was too high. She knew this; as much as she knew and numbered all her ancestors—the ones that hadn’t been rich or privileged enough to bequeath her their own mem-implants—leaving her with only this pale, flawed approximation of an inheritance.\nYou’re a fool.\nHoa closed her eyes; closed her thoughts so that the voice in her mind sank to a whisper. She brought herself, with a slight effort, back to the tranquility of her mornings—breathing in the nutty aroma from her teacup, as she steeled herself for the day ahead.\nShe wasn’t Professor Duy Uyen.\nShe’d feared being left adrift when Professor Duy Uyen’s illness had taken a turn for the worse; she’d lain late at night wondering what would happen to Duy Uyen’s vision; of what she would do, bereft of guidance.\nBut now she knew.\n“Get three other tanks,” Hoa said. “Let’s see what that strain looks like with a tighter temperature regulation. And if you can get hold of Khang, ask him to look into the graft—there might be a better solution there.”\nThe Empress had thought Duy Uyen a critical asset; had made sure that her mem-implants went to Hoa—so that Hoa would have the advice and knowledge she needed to finish the station that the Empire so desperately needed. The Empress had been wrong; and who cared if that was treason?\nBecause the answer to Professor Duy Uyen’s death, like everything else, was deceptively, heartbreakingly simple: that no one was irreplaceable; that they would do what everyone always did—they would, somehow, forge on.\nDark tea: dark tea leaves are left to mature for years through a careful process of fermentation. The process can take anywhere from a few months to a century. The resulting brew has rich, thick texture with only a bare hint of sourness.\nThe Tiger in the Banyan doesn’t grieve as humans do.\nPartly, it’s because she’s been grieving for such a long time; because mindships don’t live the same way that humans do—because they’re built and anchored and stabilized.\nQuang Tu spoke of seeing Mother become frail and ill, and how it broke his heart; The Tiger in the Banyan’s heart broke, years and years ago; when she stood in the midst of the New Year’s Eve celebration—as the sound of crackers and bells and gongs filled in the corridors of the orbital, and everyone hugged and cried, she suddenly realized that she would still be there in a hundred years; but that no one else around the table—not Mother, not Quang Tu, none of the aunts and uncles or cousins—would still be alive.\nShe leaves Quang Tu in his compartment, staring at the memorial altar—and, shifting her consciousness from her projected avatar to her real body, climbs back among the stars.\nShe is a ship; and in the days and months that Quang Tu mourns, she carries people between planets and orbitals— private passengers and officials on their business: rough white silk, elaborate five panel dresses; parties of scholars arguing on the merit of poems; soldiers on leave from the most distant numbered planets, who go into the weirdness of deep spaces with nothing more than a raised eyebrow.\nMother is dead, but the world goes on—Professor Pham Thi Duy Uyen becomes yesterday’s news; fades into official biographies and re-creation vids—and her daughter goes on, too, doing her duty to the Empire.\nThe Tiger in the Banyan doesn’t grieve as humans do. Partly, it’s because she doesn’t remember as humans do.\nShe doesn’t remember the womb; or the shock of the birth; but in her earliest memories Mother is here—the first and only time she was carried in Mother’s arms—and Mother herself helped by the birth-master, walking forward on tottering legs—past the pain of the birth, past the bone-deep weariness that speaks only of rest and sleep. It’s Mother’s hands that lie her down into the cradle in the heartroom; Mother’s hands that close the clasps around her—so that she is held; wrapped as securely as she was in the womb—and Mother’s voice that sings to her a lullaby, the tune she will forever carry as she travels between the stars.\nThe lights in Sai Gon are green and red, the lamps in My Tho are bright and dim . . .\nAs she docks at an orbital near the Fifth Planet, The Tiger in the Banyan is hailed by another, older ship, The Dream of Millet: a friend she often meets on longer journeys. “I’ve been looking for you.”\n“Oh?” The Tiger in the Banyan asks. It’s not hard, to keep track of where ships go from their manifests; but The Dream of Millet is old, and rarely bothers to do so—she’s used to other ships coming to her, rather than the other way around.\n“I wanted to ask how you were. When I heard you were back into service—” The Dream of Millet pauses, then; and hesitates; sending a faint signal of cautious disapproval on the comms. “It’s early. Shouldn’t you be mourning? Officially—”\nOfficially, the hundred days of tears are not yet over. But ships are few; and she’s not an official like Quang Tu, beholden to present exemplary behavior. “I’m fine,” The Tiger in the Banyan says. She’s mourning; but it doesn’t interfere with her activities: after all, she’s been steeling herself for this since Father died. She didn’t expect it to come so painfully, so soon, but she was prepared for it—braced for it in a way that Quang Tu will never be.\nThe Dream of Millet is silent for a while—The Tiger in The Banyan can feel her, through the void that separates them—can feel the radio waves nudging her hull; the quick jab of probes dipping into her internal network and collating together information about her last travels. “You’re not ‘fine’,” The Dream of Millet says. “You’re slower, and you go into deep spaces further than you should. And—” she pauses, but it’s more for effect than anything else. “You’ve been avoiding it, haven’t you?”\nThey both know what she’s talking about: the space station Mother was putting together; the project to provide a steady, abundant food supply to the Empire.\n“I’ve had no orders that take me there,” The Tiger in the Banyan says. Not quite a lie; but dangerously close to one. She’s been . . . better off knowing the station doesn’t exist—unsure that she could face it at all. She doesn’t care about Tuyet Hoa, or the mem-implants; but the station was such a large part of Mother’s life that she’s not sure she could stand to be reminded of it.\nShe is a mindship: her memories never grow dim or faint; or corrupt. She remembers songs and fairytales whispered through her corridors; remembers walking with Mother on the First Planet, smiling as Mother pointed out the odder places of the Imperial City, from the menagerie to the temple where monks worship an Outsider clockmaker—remembers Mother frail and bowed in the last days, coming to rest in the heartroom, her labored breath filling The Tiger in the Banyan’s corridors until she, too, could hardly breathe.\nShe remembers everything about Mother; but the space station—the place where Mother worked away from her children; the project Mother could barely talk about without breaching confidentiality—is forever denied to her memories; forever impersonal, forever distant.\n“I see,” The Dream of Millet says. Again, faint disapproval; and another feeling The Tiger in the Banyan can’t quite place—reluctance? Fear of impropriety? “You cannot live like that, child.”\nLet me be, The Tiger in the Banyan says; but of course she can’t say that; not to a ship as old as The Dream of Millet. “It will pass,” she says. “In the meantime, I do what I was trained to do. No one has reproached me.” Her answer borders on impertinence, deliberately.\n“No. And I won’t,” The Dream of Millet says. “It would be inappropriate of me to tell you how to manage your grief.” She laughs, briefly. “You know there are people worshipping her? I saw a temple, on the Fifty-Second Planet.”\nAn easier, happier subject. “I’ve seen one too,” The Tiger in the Banyan says. “On the Thirtieth Planet.” It has a statue of Mother, smiling as serenely as a bodhisattva—people light incense to her to be helped in their difficulties. “She would have loved this.” Not for the fame or the worship, but merely because she would have found it heartbreakingly funny.\n“Hmmm. No doubt.” The Dream of Millet starts moving away; her comms growing slightly fainter. “I’ll see you again, then. Remember what I said.”\nThe Tiger in the Banyan will; but not with pleasure. And she doesn’t like the tone with which the other ship takes her leave; it suggests she is going to do something—something typical of the old, getting The Tiger in the Banyan into a position where she’ll have no choice but to acquiesce to whatever The Dream of Millet thinks of as necessary.\nStill . . . there is nothing that she can do. As The Tiger in the Banyan leaves the orbital onto her next journey, she sets a trace on The Dream of Millet; and monitors it from time to time. Nothing the other ship does seems untoward or suspicious; and after a while The Tiger in the Banyan lets the trace fade.\nAs she weaves her way between the stars, she remembers.\nMother, coming onboard a week before she died—walking by the walls with their endlessly scrolling texts, all the poems she taught The Tiger in the Banyan as a child. In the low gravity, Mother seemed almost at ease; striding once more onboard the ship until she reached the heartroom. She’d sat with a teacup cradled in her lap—dark tea, because she said she needed a strong taste to wash down the drugs they plied her with—the heartroom filled with a smell like churned earth, until The Tiger in the Banyan could almost taste the tea she couldn’t drink.\n“Child?” Mother asked.\n“Yes?”\n“Can we go away—for a while?”\nShe wasn’t supposed to, of course; she was a mindship, her travels strictly bounded and codified. But she did. She warned the space station; and plunged into deep spaces.\nMother said nothing. She’d stared ahead, listening to the odd sounds; to the echo of her own breath, watching the oily shapes spread on the walls—while The Tiger in the Banyan kept them on course; feeling stretched and scrunched, pulled in different directions as if she were swimming in rapids. Mother was mumbling under her breath; after a while, The Tiger in the Banyan realized it was the words of a song; and, to accompany it, she broadcast music on her loudspeakers.\n“Go home to study,\nI shall wait nine months, I shall wait ten autumns . . .”\nShe remembers Mother’s smile; the utter serenity on her face—the way she rose after they came back to normal spaces, fluid and utterly graceful; as if all pain and weakness had been set aside for this bare moment; subsumed in the music or the travel or both. She remembers Mother’s quiet words as she left the heartroom.\n“Thank you, child. You did well.”\n“It was nothing,” she’d said, and Mother had smiled, and disembarked—but The Tiger in the Banyan had heard the words Mother wasn’t speaking. Of course it wasn’t nothing. Of course it had meant something; to be away from it all, even for a bare moment; to hang, weightless and without responsibilities, in the vastness of space. Of course.\nA hundred and three days after Mother’s death, a message comes, from the Imperial Palace. It directs her to pick an Embroidered Guard from the First Planet; and the destination is . . .\nHad she a heart, this is the moment when it would stop.\nThe Embroidered Guard is going to Mother’s space station. It doesn’t matter why; or how long for—just that she’s meant to go with him. And she can’t. She can’t possibly . . .\nBelow the order is a note, and she knows, too, what it will say. That the ship originally meant for this mission was The Dream of Millet; and that she, unable to complete it, recommended that The Tiger in the Banyan take it up instead.\nAncestors . . .\nHow dare she?\nThe Tiger in the Banyan can’t refuse the order; or pass it on to someone else. Neither can she rail at a much older ship—but if she could—ancestors, if she could . . .\nIt doesn’t matter. It’s just a place—one with a little personal significance to her—but nothing she can’t weather. She has been to so many places, all over the Empire; and this is just one more.\nJust one more.\nThe Embroidered Guard is young, and callow; and not unkind. He boards her at the First Planet, as specified—she’s so busy steeling herself that she forgets to greet him, but he doesn’t appear to notice this.\nShe’s met him before, at the funeral: the one who apologetically approached Quang Tu; who let him know Mother’s mem-implants wouldn’t pass to him.\nOf course.\nShe finds refuge in protocol: it’s not her role to offer conversation to her passengers, especially not those of high rank or in imperial service, who would think it presumption. So she doesn’t speak; and he keeps busy in his cabin, reading reports and watching vids, the way other passengers do.\nJust before they emerge from deep spaces, she pauses; as if it would make a difference—as if there were a demon waiting for her; or perhaps something far older and far more terrible; something that will shatter her composure past any hope of recovery.\nWhat are you afraid of? A voice asks within her—she isn’t sure if it’s Mother or The Dream of Millet, and she isn’t sure of what answer she’d give, either.\nThe station isn’t what she expected. It’s a skeleton; a work in progress; a mass of cables and metal beams with bots crawling all over it; and the living quarters at the center, dwarfed by the incomplete structure. Almost deceptively ordinary; and yet it meant so much to Mother. Her vision for the future of the Empire; and neither Quang Tu nor The Tiger in the Banyan having a place within.\nAnd yet . . . and yet, the station has heft. It has meaning—that of a painting half-done; of a poem stopped mid-verse—of a spear-thrust stopped a handspan before it penetrates the heart. It begs—demands—to be finished.\nThe Embroidered Guard speaks, then. “I have business onboard. Wait for me, will you?”\nIt is a courtesy to ask; since she would wait, in any case. But he surprises her by looking back, as he disembarks. “Ship?”\n“Yes?”\n“I’m sorry for your loss.” His voice is toneless.\n“Don’t be,” The Tiger in the Banyan says.\nHe smiles then; a bare upturning of the lips. “I could give you the platitudes about your mother living on in her work, if I thought that would change something for her.”\nThe Tiger in the Banyan doesn’t say anything, for a while. She watches the station below her; listens to the faint drift of radio communications—scientists calling other scientists; reporting successes and failures and the ten thousand little things that make a project of this magnitude. Mother’s vision; Mother’s work—people call it her life work, but of course she and Quang Tu are also Mother’s life work, in a different way. And she understands, then, why The Dream of Millet sent her there.\n“It meant something to her,” she says, finally. “I don’t think she’d have begrudged its completion.”\nHe hesitates. Then, coming back inside the ship—and looking upwards, straight where the heartroom would be—his gaze level, driven by an emotion she can’t read: “They’ll finish it. The new variety of rice they’ve found—the environment will have to be strictly controlled to prevent it from dying of cold, but . . . ” He takes a deep, trembling breath. “There’ll be stations like this all over the Empire—and it’s all thanks to your mother. “\n“Of course,” The Tiger in the Banyan says. And the only words that come to her as the ones Mother spoke, once. “Thank you, child. You did well.”\nShe watches him leave; and thinks of Mother’s smile. Of Mother’s work; and of the things that happened between the work; the songs and the smiles and the stolen moments, all arrayed within her with the clarity and resilience of diamond. She thinks of the memories she carries within her—that she will carry within her for the centuries to come.\nThe Embroidered Guard was trying to apologize, for the mem-implants; for the inheritance neither she nor Quang Tu will ever have. Telling her it had all been worth it, in the end; that their sacrifice hadn’t been in vain.\nBut the truth is, it doesn’t matter. It mattered to Quang Tu; but she’s not her brother. She’s not bound by anger or rancor; and she doesn’t grieve as he does.\nWhat matters is this: she holds all of her memories of Mother; and Mother is here now, with her—forever unchanged, forever graceful and tireless; forever flying among the stars.\nAliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019)."}