{"fingerprint": "fUhOGDcGj6uzKjm+un1lhVCnLlE=", "sitename": "Clarkesworld Magazine", "title": "In Everlasting Wisdom by Aliette de Bodard", "author": "Aliette de Bodard", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_10_18_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In Everlasting Wisdom by Aliette de Bodard", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5680 words, short story, REPRINT\n In Everlasting Wisdom\n The path to enlightenment is through obedience to wisdom, and who is wiser than the Everlasting Emperor?\n It’s the words that keep Ai Thi going, day after day—the ceaseless flow of wisdom from the appeaser within her, reminders that the Everlasting Emperor loves her and her sacrifice—that she’s doing her duty, day after day, making sure that nothing discordant or dissident can mar the harmony that keeps the Empire together.\n Her daily rounds take her through the Inner Rings of Vermillion Crab Station: she sits on the train, head lolled back against the window, thinking of nothing in particular as the appeaser does their work, sending the Everlasting Emperor’s words into passengers’ subconscious minds. Ai Thi sees the words take root: the tension leaves the air, the tautness of people’s worries and anger drains out of them, and they relax, faces slack, eyes closed, all thoughts in perfect harmony. The appeaser shifts and twists within Ai Thi, a familiar rhythm of little bubbles in her gut, almost as if she were pregnant with her daughter Dieu Kiem again.\n The worst enemy is the enemy within, because it could wear the face of your brother or mother.\n Loyalty to the Everlasting Emperor should be stronger than the worship offered to ancestors, or the respect afforded to parents.\n The words aren’t meant for Ai Thi: they go through her like running water, from the appeaser to her to the passengers on the train. She’s the bridge—the appeaser is lodged within her, but they’re an alien being and need Ai Thi and her fellow harmonizers to speak the proper language, to teach them the proper words.\n Ai Thi knows all the words. Once, they were the only thing that kept her going.\n It is the duty of children to die for their parents, and the duty of all subjects to give their life for the Everlasting Emperor—though he never asks for more than what is necessary, and reasonably borne.\n Ai Thi has only confused, jumbled memories of her implantation—a white, sterilized room that smells of disinfectant; the smooth voice of doctors and nurses, telling her to lie down on the operating table, that everything will be fine. She woke up with her voice scraped raw, as if she’d screamed for hours; with memories of struggling against restraints—but when she looked at her wrists and ankles, there was no trace of anything, not a single abrasion. And, later, alone in her room, a single, horrifying recollection: asking about painkillers and the doctors shaking their heads, telling her she had to endure it all without help, because analgesics were poison to the appeaser’s metabolism.\n Her roommate Lan says that they do give drugs—something to make the harmonizers forget the pain, the hours spent raving and twisting and screaming while the appeasers burrow into their guts.\n It’s all absurd, of course. It must be false impressions brought on by the drugs and the procedure, for why would the Everlasting Emperor take such bad care of those that serve him?\n Ai Thi remembers waking up at night after the implantation, shivering and shaking with a terrible hunger—she was alone in the darkness, small and insignificant, and she could call for help but she didn’t matter—the doctors had gone home and no one would come, no one remembered she was there. Around her, the shadows of the room seemed to twist and come alive—if she turned and looked away, they would swallow her whole, crush her until nothing was left. She reached for the rice cakes on the table—and they slid into her stomach, as thin and as tasteless as paper, doing nothing to assuage the hunger. Empty, she was empty, and nothing would ever fill that hole within her . . .\n Not her hunger. Not her loneliness. The appeaser’s. Cut off from the communion of their own kind, they so desperately needed contact to live, so desperately craved warmth and love.\n You’re not alone, Ai Thi whispered. You are a subject of the Everlasting Emperor, and he loves you as a father loves his children.\n You’re not alone.\n Night after night, telling them the words from her training, the ones endlessly welling up out of her, like blood out of a wound. The Everlasting Emperor was human once, but he transcended that condition. He knows all our weaknesses, and he watches over us all. He asks only for respect and obedience in return for endless love.\n You—we are part of something so much greater than ourselves: an Empire that has always been, that will always be as timeless as the Heavens. Through us—through the work of hundreds, of thousands like us, it will endure into this generation, and into the next.\n Night after night, until the words became part of the appeaser—burrowed into them as they had burrowed within Ai Thi’s guts—until they ceaselessly spoke in her sleep, giving her back her own words with unwavering strength.\n Beware what you read. The Quynh Federation reaches everywhere, to disseminate their lies: you cannot trust news that hasn’t been vetted.\n Ai Thi gets down at her usual station: White Crane Monastery, close to the barracks. She has one last quadrant to go through on her rounds, Eggshell Celadon, making sure that the families there understand the cost of war fought beyond the Empire’s boundaries, and the necessity of the war effort.\n As she turns into a corridor decorated with a splash of stars, she hears the footsteps behind her. A menial, going to work—a kitchen hand, like Ai Thi used to be before she volunteered—or a sweeper, supervising bots as they clean the quadrant. But at the next corridor—one that holds the machinery of the station rather than cramped family compartments—the footsteps are still here.\n She turns, briefly, catching a glimpse of hempen clothes, torn sleeves, and the glint of metal. From the appeaser, a vague guess that whoever it is is determined: the appeaser can’t read human thoughts, can’t interpret them, or the harmonizers’ and enforcers’ work would be that much simpler. What they know from human behavior, they learned from Ai Thi.\n Captain Giang’s advice to her trainees: always choose the ground for a confrontation, rather than having choice forced on you.\n Ai Thi stops, at the middle of the corridor—no nooks or crannies, no alcoves where her pursuer can hide. Within her the appeaser is silent and still, trying to find the proper words of the Everlasting Emperor for the circumstances, gathering strength for a psychic onslaught.\n She’s expected a group of dissidents—Sergeant Bac said they were getting bolder in the daily briefing—but it’s just one person.\n A woman in shapeless bot-milled clothes, bottom of the range—face gaunt, eyes sunken deep, lips so thin they look like the slash of a knife. Her hands rests inside her sleeves, fingers bunched. She has a knife or a gun. “Harmonizer,” the woman whispers. “How can you—how can you—”\n Ai Thi spreads her hands, to show that she is unarmed; though it isn’t true. The appeaser is her best and surest weapon, but only used at the proper time. “I serve the Everlasting Emperor.”\n The woman doesn’t answer. She merely quickens her pace. Her hand swings out, and it’s a gun that she holds, the barrel glinting in the station’s light, running towards Ai Thi and struggling to aim.\n No time.\n Ai Thi picks one saying, one piece of wisdom, from all the ones swarming in her mind. The Everlasting Emperor loves all his subjects like children, and it is the duty of children to bow down to their parents.\n Bow down.\n And she lets the appeaser hurl it like a thrown stone, straight into the woman’s thoughts. No subtlety, not the usual quiet influence, the background to everyone’s daily lives—just a noise that overwhelms everything like a scream.\n Bow down.\n The woman falters, even as her gun locks into place: there’s a sound like thunder—Ai Thi throws herself to the side, momentarily deafened—comes up for breath, finding herself still alive, the appeaser within her driving her on.\n Bow down.\n She reaches the woman, twists a wrist that has gone limp. The gun clatters to the ground. That’s the only sound in the growing silence—that, and the woman’s ragged breath. The appeaser within Ai Thi relaxes, slightly. She can feel their disapproval, their fear. Cutting it too close. She could have died. They could have died.\n Ai Thi lifts the woman to her feet, effortlessly. “You shouldn’t have done this,” she says. “Who sent you?”\n She hasn’t expected an answer—the woman’s mind should still be filled with the single message the appeaser used to drown all cognitive function—but the thin, pale lips part. “I sent myself. You—you starve us, and expect us to smile.”\n “We all sacrifice things. It’s the price to pay for safety,” Ai Thi says, automatically, and then takes another look at the woman. All skin and bones—Ai Thi is strong from training, but the woman hardly weighs anything, and her cheeks are far gaunter than even those of menials—and, as she looks into the woman’s eyes, she sees nothing but raw, naked desperation, an expression she knows all too well.\n Who sent you?\n I sent myself.\n Two years ago, an eternity ago, Ai Thi looked at that same gaze in the mirror, working herself down to the bone for not enough money, not enough food, going to bed hungry every night and listening to Dieu Kiem’s hacking cough, and knowing that no doctor would tend to the poor and desperate. She made a choice, then: she volunteered for implantation, knowing she might not survive it—volunteered to serve the Everlasting Emperor in spite of her doubts. But, if she hadn’t made that choice—if she’d let fear and frustration and hunger whittle her down to red-hot rage—\n This might have been her, with a gun.\n Ai Thi is meant to call for the enforcers, to turn the woman over to them for questioning, so that they can track down and break the dissident cell or foreign agency that sent her. That would be the loyal, righteous thing to do. But . . .\n But she’s been here. She knows there’s no cell—merely the end of a road; a last, desperate gesture that, if it doesn’t succeed, will at least end everything.\n Ai Thi walks back to the barracks with the woman over her shoulder—by then she’s all spent, and lies in Ai Thi’s grip like wrung cloth. Ai Thi lays her down in an alcove before the entrance, a little out of sight. “Wait here,” she says.\n By the time Ai Thi comes back, she half expects the woman to be gone. But she’s still there, waiting—she sits on the floor with her legs drawn against her, huddling as though it might make her smaller.\n “Here,” Ai Thi says. She grabbed what she could from the refectory—couldn’t dally, or she’d be noticed: two small rice cakes, and a handful of cotton fish.\n The woman looks at her, warily; snatches all three things out of her hand.\n “Go gently, or you’ll just vomit it.” Ai Thi crouches, watching her. The appeaser within her is quiet. Curious. “It’s not poisoned.”\n The woman’s laugh is short, and unamused. “I didn’t think it was.” She nibbles, cautiously, at the rice cakes; eating half of one before she slips the rest inside her sleeves.\n “What’s your name?”\n A hesitation, then: “Hien Hoa. You’d find out, anyway.”\n “I don’t have supernatural powers,” Ai Thi says, mildly.\n “No, but you have the powers of the state.” Hoa stops, then; afraid she’s gone too far.\n Ai Thi shakes her head. “I’m not going to turn you in. I’d have done it already, if I was.”\n “Why—”\n Ai Thi shrugs, though she doesn’t quite know what to say. “Everyone deserves a second chance, I guess.” She rises, ignoring the twinges of pain in her muscles. “Stay out of trouble, will you? I’d hate to see someone else bring you in.”\n Straying from the Everlasting Emperor’s path is a grievous misconduct, but every misconduct can be atoned for—every fault can be forgiven, if the proper amends are made, the proper reeducation achieved.\n To Sergeant Bac, at her debriefing in the squad room, Ai Thi says nothing of Hoa. She heads next to Captain Giang’s office, for her weekly interview.\n The captain sits behind her desk, staring at the aggregated reports of her company, nodding, from time to time, at something that pleases or bothers her. On the desk before her is a simple am and duong logo, a half-black, half-white circle curved in the shape of an appeaser: the emblem of the harmonizers “I see your last checkup was three months ago,” she says.\n Ai Thi nods.\n “You’re well, I trust?” Captain Giang says—only half a question. “No stomach pains. No headaches that won’t go away. No blood in your urine.”\n The danger symptoms—the ones Ai Thi could recite by heart—a sign that the delicate symbiosis that links her and the appeaser is out of kilter, and that they could both die. “I . . . I don’t think so,” Ai Thi says.\n Giang looks at her, for a while. “You don’t look like yourself,” she says, frowning.\n She knows. No. There is no way she can know. Ai Thi draws a deep, ragged breath. “There’s much unease,” she says, finally, a half-truth. “People are . . . taut. Like a string about to snap.” And there is only so much slack the harmonizers can pick up, only so much wisdom they can dispense to people whose only thoughts and worries are what they’ll be eating come tomorrow.\n “I see. Why do you think that is?”\n Gaunt eyes, and Hoa’s thin, bruised lips, and the careful way she’s hoarded the food; for giving to someone else. Ai Thi says, finally, “May I speak freely?”\n “Always.” Giang frowns. “This isn’t a jail or a reeducation camp. We trust your loyalty.”\n Of course they do, and of course they can. Ai Thi would never do anything against the Everlasting Emperor: he keeps the fabric of society together. “The war effort against the Quynh Federation is costly. Food is more and more expensive, and this creates . . . anger. Jealousy. They think the soldiers favored.” And the harmonizers, and the enforcers, and the scholars that keep the machinery of the Empire going.\n Giang doesn’t speak, for a while. Her broad face is emotionless. “They would,” she says. “But the soldiers pay dearly for that food. People on the station aren’t at risk of losing limbs or pieces of their mind, or being tortured for information on the Empire.” Ai Thi can feel, distantly, Giang’s own appeaser, a thin thread at the back of her mind, whispering about love and need and duty, all the sayings she already knows by heart.\n She says, “I know this.”\n “And they don’t?” Giang sighs. “I’m not questioning your conclusions, private. But as you know, the war isn’t going well. The Everlasting Emperor is going to announce an increase of the war effort.”\n “You said the soldiers paid for the food because they were at greater risk. But we—” Ai Thi says.\n Giang raises an eyebrow. “Are we not?” Her gaze is sardonic, and Ai Thi remembers Hoa’s gun going off, the thunder filling her ears. “We’ll be the first against the wall, if things do break down.” It sounds like a warning, though Ai Thi isn’t sure who she means it for.\n Perhaps us, the appeaser whispers, but they barely sound worried. Only about Hoa, which surprises Ai Thi; but of course they would know all about hunger and need.\n “There’s much unrest,” Giang says. “I don’t want you to patrol in pairs—you cover less ground—but it might become necessary. Private Khanh was attacked by a group of three dissidents masquerading as beggars, and only barely escaped.”\n “Is he—” Ai Thi asks, but Giang shook her head.\n “He’s fine. We didn’t manage to catch them, though.” Giang sounds annoyed. “Cinnabar Mansions Quadrant reported two riots in as many weeks. As you said, people are wound taut.”\n “But we’ll be fine,” Ai Thi says, before she can think.\n “Of course we will. The Empire has weathered wars and fire and riots long before we were both born,” Giang says. She makes a gesture with her hands. “Dismissed, private. Enjoy your rest.”\n It’s only after Ai Thi has left the office, halfway to her room and the light comedy vid she was looking forward to, that she realizes that the warm feeling of utter certainty within her is from Giang’s appeaser.\n The foundations of the Everlasting Empire: the censors, rooting out disinformation from vids and newscasts. The scholars, making the laws everyone must abide by. The harmonizers and enforcers, keeping the fabric of the Empire clear of dissidence. And the soldiers, defending the borders against enemy incursions.\n “There’s someone at the gates asking after you, lil sis,” Lan says. She laughs, throwing her head back in a gesture so familiar it’s barely annoying anymore. “A menial. From your old life?”\n Lan comes from the Inner Rings, the wealthiest Station inhabitants. She caused some scandal at an examination, and her family gave her the choice of enlisting with the harmonizers, or with the soldiers on the front. She’s Ai Thi’s roommate, and she means well, but sometimes her assumptions about people grate. To wit: Ai Thi didn’t keep contact with anyone from her old workplaces—such attachments aren’t encouraged, in any case.\n It can’t be Second Aunt, because Ai Thi is currently in communication with home, and spoke to her not a minute past. “Can you ask them to wait?” Ai Thi says. Her time for outside calls is almost up, in any case. She turns back to Dieu Kiem. “Sorry. Duty calling.”\n Her daughter makes a grimace in her field of vision. She’s a ghostly overlay in Ai Thi’s implants, a tall and willowy girl who seems to have shot up three heads since Ai Thi was last given a permission home. “Captain Giang.” She looks as though she’s about to laugh. “Fine, but can you tell Great Aunt I want the network key?”\n Ai Thi purses her lips. “She told me you hacked it and had every wall display copies of Huong Trang’s poems. The more explicit ones.”\n “As practice,” Dieu Kiem snorts. “Too easy.”\n She’s growing up too fast, too strong. Ai Thi wants to tell her to be careful, but there’s nothing illegal or reprehensible in what she’s doing—just harmless pranks, the kind even the Everlasting Emperor would smile upon. But where does dissidence start?\n She has no answer. She logs off in spite of Dieu Kiem’s complaints, promising her that she’ll have a word with Second Aunt—wondering, once again, how time passes, how little she sees of her own daughter.\n Sacrifices aren’t necessary, but they are all the more valued when they do occur.\n The appeaser within her is . . . sad? There’s a peculiar tautness in her mind, as if the entire world were about to come apart. She understands that they’re sad, too, grieving for time lost.\n “Thank you,” she says, aloud, shaking her head. “But it’s nothing we can’t survive.”\n Warmth from within her; a sated need. The appeaser curls back to their usual, watchful self, chewing on sayings and wisdom they might need for their next patrol.\n Outside the gates, Hoa is waiting for her. Ai Thi fights off the urge to pinch herself. “I didn’t think—”\n “That I’d come back?” Hoa is still gaunt and pale, but there’s a light in her eyes that wasn’t there before. Ai Thi is afraid to ask where it comes from, but Hoa merely shakes her head. “I found a second job.” She grins, waving a basket towards Ai Thi. “And I owe you a meal.”\n They walk towards a nearby white space in silence. Ai Thi reaches out, deftly shaping a small corner of it into a lush green space, like the jungles in the stories of her childhood. Hoa sits down at the foot of a huge fig tree, setting down the basket between ghostly roots—Ai Thi hasn’t reshaped reality, merely added a layer of illusion that they share across their implants.\n Inside the basket are four puffed-up dough pieces, and grilled maize. Hoa hands them out, grimacing. “I wasn’t sure if—” she pauses, embarrassed—“if you ate more.”\n Ai Thi guesses the unsaid words. “Because of the appeaser? A little, but not much.” It’s not like being pregnant. The appeaser is small, and will never grow within her: they have already had their children, the next generation of appeasers raised in tanks for implantation in the next generation of trainees.\n They eat the first fried dough piece in silence, not quite sure what to say to each other. Ai Thi doesn’t know why Hoa came back. She says, finally, “I saw you take the rice cakes. You have a family?”\n Hoa looks at her for a while. “I thought you knew everything.”\n Ai Thi laughs. “I wish. But no. I’m not the Census Office.”\n “A toddler,” Hoa says. “Three years old.”\n “Mine is older,” Ai Thi says, with a sigh. “Thirteen years old and all opinions.” She’s not sure why she says, “I almost never see her. Duty.”\n Hoa laughs, a little sadly. It doesn’t sound strained or forced, though the atmosphere is still tense. “You’re different.”\n “From other harmonizers?” Ai Thi shrugs, and finally speaks the truth. “I was where you are, once. Working in a restaurant in the daytime, and cleaning the corridors at night. Starving myself to feed my child.”\n Hoa is staring at her. “That’s why you became a harmonizer? For money?” There is . . . an edge to her voice, a hint of disapproval that’s not meant to exist. Captain Giang is right. The fabric of society is fraying.\n “Because I had nowhere else to go,” Ai Thi says, simply. “Because . . . because I listened to the voice of the Everlasting Emperor, and he gave me a second chance.”\n “You’ve never seen him,” Hoa says. A question, a challenge.\n “Once,” Ai Thi says. She doesn’t need to close her eyes to remember. She was standing at the back of the harmonizers’ ranks, and even from there she felt the radiance of his presence, wave after wave of warmth filling her, the world wavering and bending until it was all she could do not to fall on her knees. “He was everything they say he was, and more.”\n Hoa is silent, for a while. “Faith,” she says, and her voice is full of wonder. “I thought—” she shakes her head. “I suppose it takes a lot, to get implanted. May I—” Her hand reaches out, resting close to Ai Thi’s torso.\n Ai Thi nods. Hoa’s fingers rest on her gut, pressing down, lightly. The appeaser gurgles within her—kicks towards Hoa, who withdraws as if burned. The appeaser’s disappointment burns in Ai Thi like acid, spreading outwards through the only channel they know how to use.\n Before the Everlasting Emperor, all citizens are weighed equally: the only thing that matters is their loyalty.\n Hoa takes one, two steps backwards, her face twisting as the full blast of emotions hits her. “What—”\n “They’re hurt,” Ai Thi says. “Because you think they’re less than human.”\n Hoa opens her mouth. She’s going to say that of course they’re not human, that they’re just an alien parasite, and all the insults Ai Thi has had hurled at her by dissidents. Ai Thi cuts her off before she can speak, “They’re lonely. Always lonely. That’s the price they pay for service to the Everlasting Emperor.”\n Hoa closes her mouth. Her face goes through contortions. “I’m sorry.” And she kneels, hand held out, making it clear that it’s not to Ai Thi she’s apologizing.\n Warmth spreading through Ai Thi—the appeaser. They like her.\n Hoa reaches out, holds out a piece of dough again. “Hungry?” she asks.\n Ai Thi eats it. It feels sweeter than honey as it slides down her throat, the appeaser’s approval a small sun within her, spreading to all her limbs—an odd, unsettling, but welcome feeling.\n At length, Hoa speaks, again. “So they’re starving you, too.”\n Ai Thi shakes her head. “I don’t understand—”\n “Of love and kin and warmth.” Hoa’s voice is sad. “Hollowing you out, and leaving nothing but words.”\n Ai Thi wants to say something about wisdom, about the Everlasting Emperor, about necessary sacrifices, but the words seem to shrivel in her mouth. Hoa’s burning eyes hold her—the same desperate need she saw in them, back when she almost arrested her, except that it’s . . . pity?\n “I’m sorry. You shouldn’t be doing this to yourself,” Hoa says again, and it is pity. Compassion. She doesn’t understand, she doesn’t see how much the Everlasting Emperor keeps Ai Thi going, doesn’t understand how much the words mean, how they keep the world together—except that Dieu Kiem is growing up without her, and all that Ai Thi can remember is the appeaser’s desperate, lonely hunger, a bottomless well that nothing can ever fill . . .\n She’s up, and running away from the park before she can think, heedless to Hoa’s calls. She only stops when she gets to her room, breathing hard and feeling as though the air she inhales never reaches her burning lungs.\n The Everlasting Emperor has always been, and will always be. The Empire is as long-lasting as the stars in the heavens. As long as the bonds between mother and daughter, between brother and brother endure, then it, too, shall.\n There’s a noise outside like the roar of the sea. Ai Thi wakes up, and the sound swells to fill her entire universe. “Mother? Mother?”\n Dieu Kiem, through her implants. “Child. How did you—”\n Her daughter’s voice is tight, on the verge of panic. “Hacked your coms. That’s not the point. Mother, you need to move. They say there are riots all over the station.”\n What—how? Ai Thi fumbles, trying to find something solid—she rubs a hand on her guts, feeling the reassuring mass of the appeaser within her. “Child? Child?”\n Dieu Kiem’s voice comes in fast, words jumbled together. “The Everlasting Emperor ordered the closure of half the granaries across all quadrants. An enforcer shot someone, and then—”\n “Closure. Why? For the war effort?” Ai Thi asks, but there’s no answer. Nothing but silence on the coms now, but the roar is still there, and she knows it’s that of a crowd massed at the gates. She could call up the outside cameras on her implants, but there’s no point.\n It’s night in the barracks. Lan is on patrol—should be, if she wasn’t caught in the riots. Ai Thi has known for a while that things are taut, but for riots to be this widespread, this fast? Things are bad. Very bad. Ai Thi hits the general alert on the network. She heads to the squad room first, but it’s deserted and silent—and shifts course, to get to Giang’s office.\n She finds the Captain putting on her jacket, straightening her official rank patch on her chest, the eyes of the tiger shining in the dim light. “Captain—”\n “I know.” Giang’s voice is curt.\n Mankind is but one step away from lawlessness. Only the word of Heaven and of the Everlasting Emperor keeps us from becoming monsters to one another.\n Barely contained panic within Ai Thi—Giang’s appeaser, not hers—hers is silent and watchful, but not surprised.\n “We have to hold,” Captain Giang says. “We need to reestablish harmony and order.” She shakes her head. Again that feeling of rising panic within Ai Thi, the edge of something so strong Giang can barely contain it.\n “Captain—”\n Giang is halfway to the door already. “There’s no time, private. Come.”\n Something is wrong. Not the riot, not the crowd, not what seems like a station-wide panic. Captain Giang wouldn’t lose her head over that. And she’s not currently broadcasting emotions at Ai Thi. Whatever causes that panic is so strong that it’s simply spilling outwards, like the hurt of Ai Thi’s appeaser when Hoa wouldn’t touch them.\n And why hasn’t she mentioned reinforcements? “Captain,” Ai Thi says, again. “We’ll hold, but what about Plum Blossom Company?”\n Giang turns then. For a moment, her composure breaks, and the face she shows to Ai Thi is the white, ashen one of a corpse, a bewildered, lost, and hungry ghost. “The dissidents have overwhelmed the Palace of Heaven and Earth, private. The Everlasting Emperor is dead.”\n Dead.\n No.\n The roar in Ai Thi’s ears isn’t the sound of the crowd—it’s a long, desperate scream that scrapes her throat raw, and she can’t tell if it’s coming from her or the appeaser.\n “How can he—” she starts, stops, unable to voice the enormity of it. “How—”\n Giang has pulled herself together again. “I don’t know,” she says. “But that’s not what matters. There are no reinforcements coming, private.”\n Outside, on Ai Thi’s implants, the crowd has trampled the two harmonizers guarding the gates. A press of people is battering at the gates, and it’s only a matter of time until the fragile metal gives way.\n Dead.\n The Empire is as long-lasting as the stars in the heavens, as the bonds of filial duty between parents and children.\n The Empire . . .\n They’ll die, holding the barracks. Die trying to impose harmony on a crowd that’s too large and too big for them to control.\n “Captain, we can’t—”\n “I know we can’t hold.” Giang is at the door: she doesn’t turn around anymore. Ai Thi calls up the inside of the gates on her implants, sees another press: Kim Cuc and Tuyet and Vu and half the harmonizers in the barracks in a loose formation that mixes all squads under the orders of Sergeant Bac and Sergeant Hong, sending wave after wave of appeaser thoughts towards the crowd, trying to calm them down. It’s like throwing stones and hoping to stop the ocean.\n Giang says, “We swore an oath to the Emperor, private. Loyalty unto death.”\n Giang’s appeaser: warmth and contentment within Ai Thi, the satisfaction of duty done to the bitter end. It is the duty of all subjects to give their life . . .\n Within Ai Thi, her appeaser stirs—brings up, not the Everlasting Emperor’s voice, but Hoa’s compassion-filled gaze, Hoa’s voice, a rock against which the other appeaser’s thoughts shatter.\n You shouldn’t be doing this to yourself.\n “It’s not . . . ” Ai Thi says. She’s surprised at how steady her voice sounds.\n “I beg your pardon?” Giang stops then.\n “It’s not our duty,” Ai Thi says. “That’s not how that saying ends, Captain.”\n He never asks for more than what is necessary, and reasonably borne.\n The Everlasting Emperor is dead. There is nothing that says they have to die, too.\n Ai Thi’s appeaser has fallen silent, knowing exactly what she wants. She feels the thoughts from Giang’s appeaser, dancing on the edge of her mind—duty, loyalty, death, a trembling wall she can barely hold at bay for long.\n Giang moves back into her office, comes to stand before her. “This isn’t a discussion, private. It’s an order.”\n Necessary. Reasonably borne. Ai Thi uncoils, then—even as, within her, the appeaser moves—a psychic onslaught centered around a single, pinpoint thought. Giang grunts, goes down on one knee, eyes rolling up in her face, and Ai Thi’s hand strikes her jugular, taking her down.\n Ai Thi stands, breathing hard, over Giang’s unconscious body—for a moment, at a loss at what she’s done, what she should do—but there is only one thing that she can do, after all. The rioters will come for their families next, and neither Second Aunt nor Dieu Kiem have had any training in combat or eluding pursuers. There’s a risk she’ll lead the crowd straight to them, but it’s offset by what she and the appeaser can bring them. She can help. She has to.\n Ai Thi thinks of the other harmonizers, lined against the doors and waiting for them to cave in. She heads towards the squad room. Within her, rising emptiness, a howling need—how will they survive, with the Everlasting Emperor dead—what does wisdom mean, anymore, if its incarnation is no more—nothing, there is nothing left . . .\n In the squad room, there’s only Lan, bloodied and out of breath, who smiles grimly at her. “It’s a war zone out there. Fortunately they haven’t found the back door yet, but I don’t know how long we can hold.”\n Ai Thi’s voice comes from very far away—a stranger’s, utterly emotionless—because the alternative would be an endless scream. “The Everlasting Emperor is dead. Captain Giang . . . says to run. To scatter back to our families. There’s no point in holding. We’ve already lost.”\n They’ve lost everything. They—\n For a long, agonizingly long moment, Lan stares at her—as if she knew, as if she could read straight into Ai Thi’s mind. She smiles again, almost with fondness. “Families. Of course.”\n Her hand rests, lightly, on Ai Thi’s shoulder, squeezes once, twice. “I’ll tell them, though not everyone will listen. But you run, lil sis.”\n And then she’s gone, and it’s just Ai Thi, walking through empty corridors towards the back of the barracks, the roar of the crowd receding into meaninglessness.\n It’s not too late. She can go out of the barracks—go back the way Lan came from—go get her aunt and daughter before the rioters find new targets—she can run, as fiercely, as far away as she can—to the heart of the Quynh Federation if need be. They can make a new life, one that’s no longer in service to the Everlasting Emperor.\n They can—\n The Emperor is dead, and nothing will ever be right again—the appeaser reaching, again and again, for words, remembering that they mean nothing now.\n “Ssh,” Ai Thi says, aloud, to the appeaser. “It’ll be all right. It’s nothing we can’t survive.” And, slowly, gently, sings the lullabies she used to sing to Dieu Kiem when she was a child—again and again as they both run from the shadow of the barracks—again and again until the songs fill the hollow, wordless silence within her.\n Originally published in Infinity Wars, edited by Jonathan Strahan.\n Aliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019)."}