{"fingerprint": "Pqnw2ouiT8+RlstvU53LSUsSHUI=", "sitename": "Clarkesworld Magazine", "title": "The Weight of a Blessing by Aliette de Bodard", "author": "Aliette de Bodard", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_03_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Weight of a Blessing by Aliette de Bodard", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5510 words, short story\nThe Weight of a Blessing\nOn her third visit to Sarah—on the last occasion that she sees her daughter, even if it is only in V-space—Minh Ha says nothing. There are no words left, no message of comfort that she could give her.\nInstead, she takes Sarah’s hand, holds it tight until the last of the warmth has leached from her body into her daughter’s; and braces herself for the future.\nEven in the visitors’ V-space, Sarah looked awful—thin and wasted and so ethereal that Minh Ha wanted to take her daughter home and ply her with rich dish after rich dish to bring some fat back on her bones. But, of course, it was too late for that; had been too late ever since the much publicized arrest and the even more publicized trial, all the grandstanding that had brought a taste of bile in Minh Ha’s throat.\nThe white prison garb and featureless holding room background were imposed by the Guardians, but Sarah had basic access permissions to the V-space, enough to manipulate her appearance—to fill in the hollows under her eyes, color the stretched skin until the shapes of the bones receded into invisibility, and smooth out her hair until it hung once again as lustrous as polished turtle scales. Minh Ha wasn’t sure if her daughter’s appearance was a statement of some sort, instructions given by the leaders of the Vermilion Seal to their recruits before the police sweep-up, or if it was simply that Sarah saw no need to hide the truth from her—or the depth of her contempt.\n“Hello, child,” she said to Sarah.\nSarah frowned. “Speak Rong.”\nMinh Ha shook her head. “There’s no point. They’ll understand Rong just as easily as Galactic.” The machines that ran V-space were notoriously bad at Rong, a language that relied on human instinct to separate the words—but interpreters were cheap, their services easily bought.\n“That’s not the problem, Mother.” But Sarah didn’t elaborate—merely pointed to the low table that was the only feature of the V-space, a pretense of normality in a situation so far from normal it was risible. Nor did Minh Ha probe further; after all, she already knew what the answer was going to be.\n“The verdict was upheld today in the State Council,” Minh Ha said, as she pulled out a chair, feeling the solidity of old wood under her fingers—an illusion, perfectly woven by the machines. She’d applied for an interview in physical space, but had been summarily rejected; told that the risk presented by her daughter was too great, and that they would rather have everything take place at a remove; that she could visit Sarah three times, one time for every day that separated them from the execution of the sentence. “But of course, you already knew that.”\nSarah’s face was perfectly still—caught by the warm light from the ceiling, reminding Minh Ha so much of Charles that her heart seemed to stutter in her chest. “Active Rehabilitation on Cygnus? All things considered, I got off rather light, didn’t I?” Her voice had the sharpness of a broken blade.\nThere was an awkward silence, only broken by Sarah’s even breaths. “You shouldn’t have come here,” Sarah said, at last.\n“Don’t be a fool. You’re my daughter. My only child.” And Minh Ha was about to lose her, and she still couldn’t express her own feelings in a way that Sarah would understand.\nIt had been publicized enough: the ship left for Cygnus, an outlying planet in Galactic space, in three days, carrying in its holds the sentenced Vermilion Seal members. Better cut out the infection at the root and expel it from society, rather than have it spread, undermining the foundations of Galactic society. It was a one-way trip—the passengers drugged and stuffed into hibernation cradles, locked tight until they finally could be released and herded into the holding facilities—staring at the mercilessly sharp horizon and the cracked fields that would be the boundary of their world until death.\nAt least it wasn’t an execution. At least it wasn’t Moc Tinh Hau—but of course the planet of Minh Ha’s birth had been sealed off from interstellar traffic, for fear that the war that had engulfed it would spread to other, more “ civilized” parts of the universe.\nSarah exhaled, noisily. “Fine time to show your support, isn’t it?”\nMinh Ha found her hands clenching in her lap. “I don’t stand by any of what you’ve done.”\nSarah smiled—sharp and bitter. “Of course not. I should have known.”\n“We taught you otherwise,” Minh Ha said, all the anger she’d hoarded during the trial irrepressibly bubbling up; all the smiling and keeping silent while Charles all but accused her of corrupting their daughter, of failing to teach her the proper Galactic values that would have prevented that needless tragedy. “How to care for a tree when you’ve eaten its fruit; how to remember the man who dug a well when you’ve drunk its water. Segundus is your home. Why did you need to—”\n“What did you want me to do? To keep my head down and accept it all? To lie to myself, over and over, until the lie became reality? I had to do it,” Sarah said. “Had to make the truth known.”\nThe truth. The absolute that the younger generation found and clung to like lifelines; as if it could protect them. The truth hadn’t prevented the Eastern continent’s war-kites from laying waste to the delta; hadn’t brought harvested rice into the besieged cities; hadn’t even been able to save Xuan Huong, in the end. “There is no truth,” Minh Ha said.\nSarah was silent for a while, staring at the wood of the table as if she saw something within, some mysterious message that Minh Ha couldn’t make sense of. At last, she said, raising her gaze, “You saw the war, didn’t you? I thought you’d understand—I thought you’d want our stories to be worth something, too—” And, in that moment, she was no longer the hardened criminal of the news feeds, or the angry young woman of Charles’ imagination, but simply the child Minh Ha had raised—the round-faced daughter who’d come home after being stung by a bee, and who’d looked up at her mother, confident that Minh Ha would know how to make the pain go away. In that moment, Minh Ha’s heart, patched and glued together from so many shards of childhood, broke yet again.\nThere’s a moment which comes every time Minh Ha enters the Hall of the Dead: a single, agonizing moment of hope when she sees the streets before the bombs extinguished the lanterns hanging in the trees—when she sees Mother and the aunts exactly as she remembers them, their faces creased like crumpled paper—when she hears them say, “Come to us, child,” in Rong, just as they once did, when handing her the red envelopes of the New Year celebration.\nIt never lasts.\nThe filters always kick in; always change and blur everything—always turn the V-space of the city into a labyrinth of featureless, drenched buildings, and the Dead into . . . something else, something alien and utterly incomprehensible. Mother and the aunts flicker and blur, too, and change—their skin taking on a metallic sheen, their words melding and merging until they become altogether meaningless.\nIt’s for her own safety, she knows—for her own sanity, so that she is not contaminated by the twisted and ineffable brain patterns that have been preserved by the Hall, a crazed and blurred memory of what it means to be alive. She knows; but it doesn’t make it any easier to bear.\nThere are eight of the Dead: Mother and three of her sisters, and four more distant cousins who escaped with them. They were all young when they died—too young. Like all of the generation that had fled the Western continent of Moc Tinh Hau before the fall of Xuan Huong, they dwindled away on Segundus. Perhaps it was the stress of living through the first, most bitterly intense years of the war, scraping themselves to the bone to help their families escape from the gathering storm; or perhaps merely the pain of exile, but for some reason their roots never dug deep into Galactic soil. Minh Ha was but seven when they fled, and Moc Tinh Hau is a confused jumble of memories— all of it quite forgotten as she grew up, papered over until Sarah’s acts dragged it out again, in all its exquisite pain.\nUntil she finds herself, here, now, standing before the Dead; and looking for comfort where there is none.\nOn her way home, Minh Ha’s shuttle passed by the Memorial.\nIt was open, though surrounded by a horde of Galactic policemen: the queue of visitors was dwarfed by the gleam of exoskeletons and battle armor, by the metallic sheen of huge cars which uncomfortably reminded Minh Ha of the Eastern continent’s linked-machines on Moc Tinh Hau, and the sharp thuds of bombs dropping over the river delta in the hours before New Year’s Eve—when the entire Western continent had been welcoming their families home for the feast.\n“See? I told you they’d have fixed it,” a woman said beside Minh Ha.\nMinh Ha, startled, turned away from her contemplation of the dome; but the woman had been talking to someone else: a small and slight redhead with freckles whose hands were wrapped around a small leather case. “I wasn’t sure—” the redhead paused then, nervously fidgeting.\n“You’d have stayed home,” the older woman said. She snorted. “On this day of all days—his thirty-year anniversary. Come on. Let’s go.” Her gaze lingered for a moment on Minh Ha, and her face twisted. “The Rong vermin won’t prevent us from honoring our war heroes.”\nMinh Ha, shocked,—it had been many years since anyone had made disparaging comments to her face—opened her mouth to say something, but the shuttle had already stopped, and the women had got off. She had no doubt they would join the queue of Galactics in front of the Memorial. The leather case the girl had been holding was familiar to Minh Ha: it held a V-space offerings chip, probably a wreath of flowers or a commemorative stele to lay in the streets of the reconstituted Xuan Huong—paying homage to a Galactic ancestor who’d died there, helping the Western continent fight for its freedom.\nMinh Ha could hear Sarah’s voice in her head as clearly as if her daughter were sitting by her side. What wonderful stories they tell themselves. What convincing lies.\nIt didn’t matter. That was what her daughter didn’t understand. There was no coming back to Moc Tinh Hau; no return home to the tombs of their ancestors. Segundus was their home and would be their final resting place; and they couldn’t afford to antagonize the people among whom they lived.\nToo late, Sarah’s voice whispered in Minh Ha’s mind; and Minh Ha turned her face back to the receding shape of the Memorial, trying to think about something other than her daughter and the Vermilion Seal—but the gleam of metal from the policemen’s armor didn’t recede from her field of vision for the longest time.\nThe Dead are to be broached with caution. Patterns saved on the edge of brain failure are no longer those of the living, but strangely corrupted things, belonging to one world and to the next; indistinct whispers, ghost images, and worse—self-replicating patterns that can utterly alter the shape of a mind.\nThe Dead, in other words, are a virus—skewed code that uses tactile contact in V-space to propagate itself; and to infect the brain patterns of the living. Those touched by the Dead become changed, unfit for Galactic society—speaking in barbaric tongues; sinking into despondence and instability; following visions all the way into mad fits, which render them dangerous to public safety.\nIn the past year, there have been 2319 instances of filters failing across the 79731 Halls of the Dead on Segundus, out of which 227 resulted in tactile contact—a tendency that is on the decrease thanks to better prevention at Preservation Office level. In most cases, contact is brief; and the afflicted are detected early enough to prevent further complications.\nSome, of course, are not so lucky; that is why every Hall of the Dead works in close tandem with appropriate institutions, where the hopelessly corrupted can be prevented from harming themselves and others.\nOn her second visit, Minh Ha found Sarah on the floor of the V-space room, which had subtly changed. A section of it, walled behind glass, now showed the inside of the Memorial: the wide streets of the reconstituted Xuan Huong, the sky dotted with the glimmer of orbitals, the women carrying shoulder yokes with two baskets of fruit balanced on either end, the Galactics walking side by side with the Rong, smiling and laughing.\nIt was very clearly the original Memorial, not the hack the Vermilion Seal had succeeded in imposing for a few hours before security kicked in: the Galactics were still prominently there, haggling in their own language with meat sellers at the market; and the heads of whole fish glared at them from the trestle tables. It was . . . all there, and still somehow not there, every detail papered over with the Galactic gaze, the shoulder yokes as exotic curiosities, the fish heads monstrous and vacant instead of promising a meal fresh from the sea, the Galactics blending in the population instead of behaving like condescending masters.\nSarah sat with her legs crossed, staring at it as though she could erase it from existence altogether. She didn’t rise when Minh Ha materialized within the V-space, didn’t turn her head. “Mother. Just in time for the daily education session.” You could have sawed bones with the edge in her voice.\n“Are you . . . always there?” It hadn’t occurred to Minh Ha that the V-space could be more than visitors’ quarters; that it would be used for other purposes. But of course every tool could be turned to several uses.\nSarah shrugged. She gestured for Minh Ha to sit by her side, which Minh Ha did, feeling the illusory coolness of the floor under her. “Sometimes, when it suits them. They’re preparing us for the journey, in many ways.” She had marks on her wrists and on her lower arms—little pricks like dozens of syringe injections.\n“You don’t sound as though it matters much to you one way or the other,” Minh Ha said, bitterly.\n“Should it?” Sarah looked up. Her eyes were dark pits in the awful paleness of her face. “I’ve done what matters.” She gestured to the Memorial in front of her. “They’ve fixed it, but everyone remembers that it could be another way.”\n“They don’t.” Minh Ha fought a rising wave of anger—remembering the two women on the shuttle. “You had a moment of fame on the feeds, and that was swiftly forgotten. The Memorial is still as it always was.” As it always had been—a thing which didn’t concern Rong, which wasn’t for them. It was the work of a Galactic man; it wept for the Galactic fallen; for the slaughter of innocents, but it knew nothing about the war. It acknowledged nothing about the Galactic domination and meddling that had exacerbated regional differences between the Western and Eastern continent—leading to a bloody civil war after independence; and to the desperate, last-ditch effort by the Galactics to maintain their foothold on Moc Tinh Hau with the Western continent as their puppet state. “How could you think this would be worth your life?”\n“Not my life, you forget.”\n“You’ll live and die on a forgotten planet—it’s the same as if they’d executed you!” Minh Ha couldn’t control the anger, the anguish anymore. Three interviews—enough to count them one by one, to know that each of them brought her closer to the final goodbye.\n“You forget.” Sarah’s smile was bright, cutting. “They’re merciful.”\n“You should have kept your head down,” Minh Ha said. “Now all the Rong are tarred with what the Vermilion Seal did.”\n“Keep my head down? As your generation have done all your life? I won’t be silenced, Mother.”\nHow could she—? “You tell me I’ve seen the war, that I ought to know. I know about grit being sold as rice in the markets, about bombs that shattered the lanterns in the streets—about the ancestral altar growing every few months with new pictures, about how you’d have done anything—anything, as long as it got you out of Moc Tinh Hau. We were on Segundus on sufferance—because they took pity on us. The last thing we wanted was to draw attention to us—to be sent back there!”\nSarah grimaced, but said nothing.\nThe view in front of them had shifted to a temple, lingering on the gong and the drum on either side of the entrance, and the flow of Rong coming to make their own offerings. The wooden statues in the darkness were smiling, enigmatic and distant, so distorted Minh Ha had to guess at their identities—was the woman in flowing robes Bodhisattva Quan Am, was the man armed with a Galactic axe general Quan Vu?\nTwo days left. One further interview; and then that was all. How could she—? Minh Ha took a deep breath, keeping her eyes away from the Memorial’s reconstitution. She forced herself to speak calmly, leisurely, as if nothing were wrong; even though the emptiness in her stomach gnawed at her. “Segundus is your home. It’s easy to criticize what the Galactic government has done, but don’t forget that they allowed you to grow up in peace—to be in a position to speak up now.” No one knew what was happening on Moc Tinh Hau now, but there was no reason to think life had gone better—that the Hell Minh Ha remembered from her childhood had vanished altogether.\n“You’d think speaking up would be less fraught.” Sarah’s voice was full of mordant amusement. “But there are truths that can’t be spoken out, apparently, or they become terrorism, eroding away at the foundation of the nation.”\n“I saw what you did in the Memorial,” Minh Ha said. “The city that you brought to life ‘from the point of view of the Rong.’ That’s not truth—none of you lived in Xuan Huong, or on the Western continent. None of you remember the war. Moc Tinh Hau is just a story to you, no different than it was to the Galactic who built the Memorial.” It wasn’t true, not quite—of course Moc Tinh Hau was the home of Sarah’s ancestors, of course it would remain a special place, more special to her than to Steven Carey, who had interviewed so many Rong yet failed to capture the essence of their lives in his Memorial. But she had to make her understand.\nSarah shrugged. “Do you think to make me recant, Mother?” She gestured at the Memorial behind its pane of glass. “As they do?”\n“I want you to understand that this is how we live together, child. The Galactics did what they did on Moc Tinh Hau—” she saw Sarah raise a hand in protest, and cut in before Sarah could say anything— “but if you never forget grievances, then they’ll choke you like ivy. The Memorial isn’t for us, no matter what they say; and it’s enough that we know that.” It was enough not to make waves; not to make themselves noticed; to live in harmony with the Galactics in their new home on Segundus.\n“Why are you here, Mother?”\n“Because you’re my child. Because I raised you.” Because I’ll lose you. Because, somehow, she wanted to give Sarah something to take to Cygnus, to remember her by; and she couldn’t articulate what.\nSarah turned, and looked at her full in the eye; as a Galactic would have done. Her face was set. “I’m sorry,” she said, and didn’t sound sorry in the least. “You’ve made your choices, Mother. I made mine.”\nThe Dead watch Minh Ha, impassive. Their faces shift, oddly, weirdly, into some expressions a human face can’t take—rippling between a smile and a grimace and tears. Second Aunt speaks—the words came through all garbled, even as Minh Ha’s filters flash a warning she can’t understand either, something about compromised communication protocols and infected messages.\n“I need advice.” She dares not look up, but she sees Mother drift closer to her. There is a smell in the air that is almost like Mother’s perfume, the faint mixture of cloves and sandalwood that followed her everywhere, even into the hospital where she breathed her last, hunched around her pain like a dragon wrapped around a pearl. “Please. I don’t know where to go, or who to turn to.” She would weep, if she still had tears.\nThe Dead are not the living.\n“She’s your only descendant,” Minh Ha says, watching the familiar faces bend and distort like thin sheets of metal. “And they’re taking her away from us. From all of us. Please.”\nMother speaks, but it is all nonsense that Minh Ha can’t interpret—no better than an unanswered prayer at the ancestral altar after all. Can she even sure that any of them understand her? Perhaps the filters distort her own speech to the Dead, just as they mangle what should have been familiar Rong words.\n“You’d know what to do, I’m sure. You’d know how to—” She isn’t sure what she wants—to convince Sarah of how wrong she’s been, to rescue her from her inevitable fate, from yet another kind of exile? “Mother. Revered aunts. I—Please tell me what to do.”\nThere is no answer. There never is any.\nGoing home, Minh Ha was stopped three times by police barricades; the last one erected just below her compound and staffed with what seemed like an entire army’s worth of policemen. The leader, a beefy woman with the reddened skin of blondes, examined Minh Ha from head to toe; no doubt seeing all there was to see from the failure of her marriage to Charles to Sarah’s arrest. “Where are you going, Mrs Tran?” Perhaps it was Sarah’s words, but today the mangling of Minh Ha’s last name grated—reminded her that she wasn’t home anymore, that her own home had been lost so long ago it only existed in her imagination—all in the past, unable to be ever truly recovered.\n“I’m going home,” Minh Ha said. And, because she didn’t care much, anymore, about Galactics or her complex relationship with the city she now lived in, “From the holding facility. I was visiting my daughter.”\nThe leader grimaced, but Minh Ha held her ground. “I have three visits.”\n“So you do.” She didn’t seem altogether happy.\nAt home, the feedswriters appeared to have got bored; there were but a few of them, loitering at the entrance of the building, and Minh Ha easily bypassed their frantic calls for interviews and information.\nIn the apartment, she found her sister Thuy busy in the kitchen, and her niece Hanh in front of the computer, watching the feeds. “How is she, aunt?” Hanh asked, but her mother Thuy cut her off.\n“There’s someone waiting for you in the living room.”\nMinh Ha had been expecting him, so it wasn’t entirely a surprise to find Charles standing before the chimney, looking at the holos on the ancestral altar with the practiced indifference of a man who had turned his back on this particular area of his life. “Good evening, Charles.” Her voice had never felt so formal in addressing him. “Come to see about Sarah, I guess.”\nHe turned around, slowly, his face a mask; a minute tremor in his hand masking the emotion underneath. “I came to see how you were. And yes, to ask about Sarah. Since it seems you’re the only one she’s speaking to.”\nMinh Ha shook her head. “She’s not telling me much.”\n“I need to see her,” Charles said. “But, of course, I can’t. It’s all that Vermilion Seal rubbish, telling her to reject all things Galactic. As if she weren’t Galactic herself, born and bred on Segundus . . . It’s all nonsense.” Charles kept his voice even, but Minh Ha could hear the frustrated anger; could feel that he was going to lash out at whoever stood in his way. He hadn’t always been so impatient; but years of bad financial luck had soured their relationship—hardening him, even as Minh Ha became quieter and less inclined to fight him for anything.\n“She’s always been headstrong,” Minh Ha said, unsure of what to say. She hadn’t spoken much to Charles in the years since the divorce—they’d gone their separate ways, he to his merchant spaceships, she to help manage the family restaurant’s finances. Only Sarah’s arrest and trial had brought them back into each other’s life; and even then, it had been briefly and painfully, all the old grievances flaring up to life again, biting and unbearable. “I’m not surprised she wouldn’t want to speak to you.”\nPreparing us for the journey, Sarah had said—how much of it was her, too, preparing herself, shedding all the attachments to Segundus, forging herself into metal hard enough that nothing on Cygnus would so much as scratch it?\n“How is she?” Charles asked.\nMinh Ha thought of Sarah; pale and thin and looking half out of this world, already gone ahead. “As well as can be,” she lied. “Convinced that she did the right thing.”\n“But you’re not.” Charles’ voice was uncertain; probing into her weaknesses, exposing all her doubts.\n“I don’t approve of what she’s done,” Minh Ha said, uncertain if that was the truth anymore.\nCharles watched her for a while, and then he said, “You do see that we can’t allow the Vermilion Seal to blackmail the Government into some nonsense about revising the history books. That hacking into public V-spaces and revealing ‘the truth’ is no way to run a society.”\n“I don’t know,” Minh Ha said, wearily. One day. One interview left before Sarah was gone forever. “Is this really what we should be arguing about?”\n“You have to see—” Charles paused. “You’re the one who gave her all those Moc Tinh Hau stories. The one who encouraged her.”\n“I take no responsibility for that,” Minh Ha said. How dare he accuse her? She’d never taught Sarah anything but how to respect the law, to be a good Galactic citizen—and how to best adapt herself to this society the Rong all found themselves living in.\n“Of course you do.” Charles said it without resentment or visible expression. “You’re her mother. You delude yourself if you think you have passed nothing on to her.”\nPrecious little—what kind of mother was she, that she couldn’t prevent her only child from leaving her? “I’m her mother, not her master. Are you threatening me with anything? Isn’t bad enough that I’m losing my only daughter?”\n“She’s my daughter too.” Charles voice was low, angry; Sarah had inherited that from him, that tendency to speak tonelessly and yet still exude a sense of menace. “We’re all losing her.”\nMinh Ha gestured to the ancestral altar behind him. “The entire family is losing her. You know what this means for us.”\n“Your old Rong superstitions?” Once, Charles’ jabs would have been more biting; but now he merely sounded weary—like her, wrung dry by the enormity of Sarah’s acts. “You forget. I left all that behind.” He turned to the ancestral altar, watching the holos. “Do you still go to the Hall of the Dead?”\nMinh Ha nodded. “I went yesterday. They had nothing to tell me.”\n“They never have.” Charles didn’t move. “You should leave the Dead well alone, Minh Ha—they just drag you down. Like they did with Sarah.”\n“Sarah never went to the Hall.”\n“You know what I mean.”\nYes, the weight of the past; those resentments he couldn’t understand—the Galactics declaring war on behalf of the Western Continent, hoping to maintain their presence on Moc Tinh Hau; the history holos proclaiming the fight for democracy, as if things were ever that simple or that pure. “The past made us what we are,” Minh Ha said, knowing it to be true.\n“But the past is gone.” Charles’ voice was almost gentle. “This is the true lesson of the Halls—the Dead might as well be on another planet. They no longer speak our language or understand our thoughts.”\nMinh Ha remembered being on her knees, staring at the cobbles of the V-space; remembered Mother’s agitation, the frantic gestures she couldn’t interpret. She said nothing—merely watched the holo of Mother as she’d been before old age caught up with her, strong and unbending and unlikely to give way to anyone. Why was she gone—why were they all alone, without the guiding influence of the older generation? “I guess not,” she said at last.\nCharles turned back to her; and forced a weak smile. “Thank you for the information. I’ll go back to the holding facility and apply for another interview with her. You never know.”\nMinh Ha, staring at him, was struck by the white scattered in his hair, by the bowed set of his shoulders, as if time itself had pressed down on him until his old arrogance disappeared—and she thought of the way that everything seemed to have been hollowed out by the arrest. “Do you want to stay for dinner?” she asked, in spite of herself.\nCharles shook his head. “I don’t think so. I’ve intruded enough on you for one night. Forgive me.”\nAfter he’d left, she remained where she was, staring at the altar. The Dead no longer speak our language, he had said, knowing full well the unbearable silence of the Hall: the chatter of the V-space, and all the familiar things, just frustratingly out of reach.\n“Is he gone?” Thuy asked from behind her; putting her hands on Minh Ha's shoulders, as she'd used to do when they'd been children in Xuan Huong.\nHer elder sister’s hands smelled of garlic and something sweet—perhaps dried jujubes? “Yes,” Minh Ha said, knowing Thuy had never approved of him. “And Sarah will be gone, too, soon.”\n“One more interview.” Thuy’s voice was oddly shrewd. “One last thing to give her before she goes ahead into the darkness of space.”\n“I don’t know what to give her,” Minh Ha said, frustrated. She thought of the book she’d brought on her first interview, left in a locker somewhere—Master Kong’s sayings, a physical gift she hadn’t been able to give to Sarah. “I don’t understand her anymore.”\n“I don’t think you’re meant to understand,” Thuy said, gently. “Just to support her.”\n“I can’t—” Minh Ha watched the holos; watched Mother’s face, forever frozen into a half-grimace; watched Second Aunt’s serene gaze, Third Aunt’s awkward smile at the camera. Mother was the one who’d found them safe passage—who had bargained and smiled and bribed Galactic officials until they found a berth on one of the last ships to leave. The aunts were the ones who had opened the Rong restaurant—it was the only non-menial work open to them—and sent the entire family through Applied Schooling. They had lived through a war and an entire life of exile, and surely they would know—surely they would—\nMinh Ha thought of everything that they no longer had; every way in which they had been diminished, and cut off from what mattered most.\n“You’re right,” she said, finally. “It’s time to accept what I can’t understand.”\nTime to give Sarah what she would most need on Cygnus.\nThere is no answer. There never is any.\nNone but the ones you make for yourself.\nTrembling, Minh Ha reaches out—in that suspended instant before the filters come online, before the Dead are rewritten into safer, saner— sanitized—code. Her hand touches Mother’s; and she feels warmth, travelling all the way from her palm into her madly beating heart.\nOn her third visit to Sarah, Minh Ha says nothing. There are no words left, no message of comfort that she could give her daughter.\nInstead, she takes Sarah’s hand, and holds it tight until the last of the warmth has leached from her body into her daughter’s; and braces herself for the future.\nShe ignores Sarah’s slight gasp of surprise; the widening of her daughter’s eyes as the patterns of the Dead slip into V-space—from her hand into Sarah’s hand; from her mind into her daughter’s own. It is, in any case, too late to turn back.\nAs she walks out of the visitors’ V-space, Minh Ha hears the whispers of the Dead in her mind; snatches of sentences that feel sharp enough to tear her mind apart; the bright, terrible sound of bombs over the city—the dark and biting history of her people that she’ll always carry with her, the memories and insights of the Dead that might destroy her, that might make her finally whole.\nAnd she knows that, wherever her daughter goes, she, too, will carry it all—the weight of her ancestors’ blessing, in her blood and in her mind.\nAliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019)."}