{"fingerprint": "GOnIJMyxuIWMTgbqFdiAbhcEjOI=", "sitename": "Clarkesworld Magazine", "title": "Fallen Angels and Water Dragons: A Conversation with Aliette de Bodard by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_interview_2017/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fallen Angels and Water Dragons: A Conversation with Aliette de Bodard by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Fallen Angels and Water Dragons: A Conversation with Aliette de Bodard\n When the apocalypse inevitably happens and the end times come, what will be left? Will nature retake the cities? Will there be mutants roaming the subways? Will humans turn on each other? We’ve all seen the familiar trappings of what happens after the end of days. But one author has imagined something a little different, a post-apocalypse where gangs struggle for power and angels fall from the heavens into a Paris shot through with magic.\n The House of Shattered Wings introduced readers to an early 1900’s Paris after a magical catastrophe. Gangs wander the streets while great Houses have carved out their own territories within the city. The House of Binding Thorns is a stand-alone sequel that dives right back into the heart of the dark and lush world Aliette de Bodard has created. Philippe is an immortal searching for redemption and the key to resurrection. Madeline, a former angel essence addict, is sent on a mission to an underwater Dragon Kingdom. The Dominion of the Fallen series weaves eastern and western mythology together into a post-apocalyptic brew of mystery and intrigue.\n Aliette de Bodard is the author of numerous novels and short stories. Her work has appeared in Clarkesworld Magazine, Interzone, Black Static, Asimov’s, Realms of Fantasy, and Apex Magazine, among others. She is the winner of the Nebula, Locus, and British Science Fiction Awards, and has been nominated for many other accolades. Her latest novel is The House of Binding Thorns, out from Ace May 10th.\n What inspired your short story “The Shipmaker” that was reprinted in a recent issue of Clarkesworld?\n Weirdly enough, Star Wars Episode III! I should probably unpack a bit: I was rather indignant that Amidala essentially died in childbirth at the end of Star Wars III—I thought a culture that had awesome spaceships and cool lightsabers, and which still didn’t manage to solve the maternal mortality issue, had some serious priority issues.\n Fast forward a couple of years, and I wanted to write a story about pregnancies that were commonly dangerous—except that I didn’t believe (for the aforementioned reasons) that a future society would still have these. At this point I thought, “oh, but what if it was a spaceship pregnancy?” And then, we, er . . . sort of went on from there.\n The House of Binding Thorns is a stand-alone sequel. What were some of the challenges you faced while writing a sequel while keeping it still accessible to new readers?\n I chose to focus The House of Binding Thorns on a different place than its predecessor, and on a mixed group of characters. There are four point-of-view characters, with only half of them from the previous novel. A lot of the issues I faced were making sure that new readers were caught up to speed, since the events from The House of Shattered Wings still resonated, especially for the characters who had been caught in it. I have an entire opening from the point of view of Philippe (the Vietnamese ex-Immortal anarchist who now works as a doctor in the poor areas of my post-magical-war Paris) that I ditched for a number of reasons, but the foremost one was that it was almost all exposition on how he’d got there. It’s a fine line to walk between making sure new readers can catch up, but without boring readers of book one!\n Sacrifice seems to be a common theme tackled in a number of your books and stories. What is it about sacrifice, in its many forms, that interests you?\n Sacrifice really covers a lot of things. To me it’s the idea that you often have to pay a price for getting something—I was always suspicious of stories where things were too easily earned—or the idea that you might end up paying and not getting much, as sacrifice isn’t necessarily a trade.\n The setting for The Dominion of the Fallen has some familiar trappings of the post-apocalypse, but there is a surprising infusion into the mix: La Belle Epoque. What was it about this era in Paris that inspired you to include it as part of your setting?\n I’ve long had a fascination for the 19th century, which is the time period of my favorite French novels (Alexandre Dumas’ Count of Monte Cristo, Victor Hugo’s Les Misérables): it’s actually not that farfetched to think of it as an apocalypse, as it was a time of unprecedented social and political upheaval.\n Even as technological advances were transforming everyday life, France was convulsing under two empires, a republic, two monarchies, and numerous coups and revolutions that ranged from successful to bloodily crushed. It was also a time of immense inequalities: the contrast between the glittering salons of the July Monarchy and the misery of workers who lived hand to mouth is just staggering. So, really, it’s not that far from that society and the one of Dominion of the Fallen—and the creeping horror and dread mostly come from my research into the time period.\n In both novels, the effects of colonialism are felt in subtle ways and add a layer of realism to the world you’ve built. Do you hope to see more SF/F novels include honest depictions of colonialism and its effects?\n Definitely! It’s an important theme to tackle. I’m especially hoping for novels that come from places and descendants of people that had colonialism inflicted on them—because they’ve been given the short end of the stick, and because we need to hear more voices from those backgrounds (and also because—without wanting to be all essentialist or prescriptivist—the stories they tell about colonialism tend to be different because they come from different places). I’m really happy we have people like Zen Cho, Tade Thompson, JY Yang, and Cassandra Khaw (and in poetry and art, Likhain) working in the field and am hoping to see more.\n The magical systems you’ve built for theses novels are complex and a little bit mysterious, but they still have structure to them. How important are limitations on magical systems?\n I actually like my magical systems to be fairly loosely structured: to me, magic should be a little numinous and a little scary, and that can’t really happen if you know exactly what’s going to happen when you cast a spell—if magic is like chemistry, and putting the right ingredients together yields a measurable, repeatable result. At the same time, giving no strictures whatsoever to magic is a problem for the reader, because they never quite know where to stand: there’s always the expectation the author might pull out a magic, ex machina to get characters out of trouble, which makes trouble meaningless. So, I try to strike a balance somewhere in the middle, hopefully getting the best of both approaches, at least from my point of view.\n Contrast is something I’ve noticed in your work. There are scenes of tenderness and some wrenching scenes of brutality. Do you think the juxtaposition heightens the impact of both?\n I love contrast. I think it’s a really effective tool: heart wrenching scenes are much more effective if they’ve been preceded by happy ones, and violence is all the more shocking if it happens out of the blue. And it does work both ways: the scenes of quiet are much more appreciated if they follow a violent scene, etc. I think it’s also quite hard to continuously raise the stakes in a novel.\n I try to go for a zigzag approach where the stakes are getting larger, or at any rate things are getting more out of control and the tension is getting higher, but which are interspersed with quieter moments where the characters take stock of what’s happening, get some rest, and try to figure out what they’re doing next. That way, when I remove the quieter moments in the lead-up to the climax, the pace quickens all on its own (if I just go for the high-tension scenes continuously, I’ve found this leaves the reader feeling breathless, in not a good way, like they’re unhappy because they’ve never been given space to work things out and get attached to the characters).\n Madeline stands out in The House of Binding Thorns and quickly became one of my favorite characters. Her addiction is tackled quite honestly in the book. What sort of research did you do in order to portray addiction accurately?\n I read a bunch of medical texts on drugs, addiction, and how addiction was currently treated. I was mostly looking for inspiration rather than straight science, as the addiction in question is to a magical drug, and medicine isn’t quite the same in my universe as in ours.\n The main thing I researched, was narratives of addiction: I was trying to avoid addiction being portrayed as a sign that the character is inherently weak and should be discarded (I have characters in the book who do think that way, but equally others who don’t). I was also trying to avoid magical cures narratives, both of the addiction and its consequences, which was a little harder to navigate (I wanted Madeleine to climb out, to some extent, of the pit she’d dug herself in, but I didn’t want this to be with a magic hand-wave. I hope that worked out!).\n What is the most fascinating piece of history you learned about while researching French colonial rule over Vietnam?\n There were so many things, but possibly the most bizarre one was the alcohol monopoly: basically, the French were pressuring their colony for money, and some bright soul hit upon the idea of the state having a monopoly on alcohol (which is always a pretty big thing, because celebrations, etc.). But they were cheap, so the alcohol they sold was made through a special chemical process that made it very affordable (affordable for the state: they sold it back at extortionate rate to villages and towns), with a higher alcohol content but mostly tasteless.\n Not surprisingly, the Vietnamese didn’t really like that: not only did they not like the new (supposedly scientifically improved) taste, but you couldn’t even get properly drunk because the alcohol was too concentrated! As a result, you had hundreds and thousands of little bootleg operations springing up, that the French valiantly tried to stamp down—discovering, in the process, what they should have known all along: that it’s really really hard to control a population that outnumbers you and is really determined to brew its own alcohol! It ended after a decade or so when they finally got the alcohol to be better quality, and to be mixed with traditionally brewed rice alcohol in order to taste better.\n What are some hidden secrets in the books? You’ve mentioned that the name Silverspires arose from its location in an area of Paris that had a large number of churches.\n Ha. Those books are full of terrible bilingual puns and references to areas of Paris. House Lazarus, of course, is named after the nearby train station of Paris (from which it copied the architecture of its lower floors), but also refers to the saint, who rose again after he died (the House almost died out during the war and kept itself alive through miracles and some very shrewd diplomacy).\n House Hawthorn is a twisted version of “Auteuil,” the area of Paris that it controls, but it’s also (of course) a thorn tree and a terribly invasive one at that, which is an apt description of its policies. House Aiguillon, one of the three that disappeared during the war (and which held the Latin Quarter), is named after the Aiguillon family, who renovated the Sorbonne—its most famous member being Cardinal de Richeulieu.\n There’s a lot of character stuff that didn’t make its way into the books, either: Iaris, Hawthorn’s head doctor, is older than she seems because she’s very friendly with Asmodeus (they worked together in the Court of Birth, and she was one of his first supporters when he decided to take the House), who’s been keeping her alive with an infusion of Fallen magic.\n How did Alexander Dumas, Victor Hugo, and Fullmetal Alchemist influence The House of Shattered Wings and The House of Binding Thorns?\n Well, I’ve already mentioned Dumas and Hugo; though one other thing Dumas does very well, especially in The Count of Monte Cristo, is the intrigue and backstabbing. He has this glittering high society where it becomes quickly clear that friendship is all relative, and that everyone has their own plans for getting to the top—and where fallen friends are never given more than a heartbeat’s consideration—a very particular highlighting of how fragile those people’s positions really are. I tried to channel some of this in The House of Shattered Wings and The House of Binding Thorns: they’re books about political and magical intrigues, and how people try to backstab each other, often with multiple schemes (that have a tendency to blow up in their faces, but that’s only normal!).\n Fullmetal Alchemist does, I think, so many things well that it’s hard to know where to start: the most obvious influence was that, like my books, it portrays a sort of indeterminate 19th century society rather than a medieval or Renaissance one. And it also does political and magical intrigue very well. But the one thing I love about it is the characters.\n There’s a huge cast, and they’re all memorable and never really fall into easy cliché: even the villains have their own stories and their own reasons for what they’re doing. I particularly glommed onto Greed, the homunculus who likes collecting people and things—it sounds like it’d be horrific, but he’s actually quite fascinating in that he genuinely cares for them, wants to see who he owns as happy, and gets really angry when they’re harmed or killed. It’s partly jealousy and partly caring, in a mixture I found really interesting; and I tried to recreate a similar character with Asmodeus, the Fallen leader of House Hawthorn, who has this same predator/protector dynamic to him (except he’s more sarcastic, partly because someone needed to be sarcastic in those novels, lest everyone sound too earnest and gloomy).\n Was there a particular piece of mythology that inspired the dragons that appear in the Dominion of the Fallen novels?\n They’re pretty standard Vietnamese dragons actually! (Well, for values of “standard” that include living in grand and decaying mansions). They’re serpentine, legless water creatures with antlers because they’re the ones I grew up with, and of course they live under the river, and of course time passes differently when you go into their kingdom, because that’s what happens in fairytales. The politics of the dragon kingdom I took from a mix of the politics of the Nguyen court in the 19th century, in the years of decline before Vietnam became a colony of France, and the opium wars (because it’s hard to avoid the opium wars if your book includes a traffic of magical drugs that is making ravages in a Confucian kingdom).\n I know you’re under contract for only two books, but can we expect more stories from this world?\n I have some short fiction set in this world: there’s a complete list at aliettedebodard.com/bibliography/novels/dominion-of-the-fallen. I also have a few stories that aren’t on the list and that I’m currently deciding what to do with: one is a Samariel/Asmodeus courtship story from before The House of Shattered Wings, which is basically “rescue mission with sarcastic, tall dark and ruthless stranger.” The other one is the novella Of Birthdays, Fungus and Kindness, which has House Silverspires’ archivist Emmanuelle throw a surprise party for her lover Selene’s birthday in the wake of the events of The House of Shattered Wings, and things subsequently snowballing out of hand.\n What are you working on next?\n A lot of short fiction, mostly! A lot of things got left behind with book promotion and the plague house (aka that moment when both your kids spent all their time being sick, thank you kindergarten), so I’m writing short fiction, mostly SF. I’m also laying preparatory groundwork for a novel set in my Xuya universe (aka “the Vietnamese galactic empire with mixed families of artificial intelligences and people”): shooting for a “Nirvana on Fire, in space!” vibe.\n How important is it that you give your characters “lunch breaks”?\n Well, personally I don’t mind, but my husband grouches a lot that the characters should be fainting by now because they haven’t had any food or sleep for the last 48 hours, and apparently, my characters get irritable too, so they get time off to eat now!\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}