{"fingerprint": "+xluVP74p3gd/JssDyqwTxDSitk=", "sitename": "Clarkesworld Magazine", "title": "Two Sisters in Exile by Aliette de Bodard", "author": "Aliette de Bodard", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_06_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Two Sisters in Exile by Aliette de Bodard", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4060 words, short story, REPRINT\n Two Sisters in Exile\n In spite of her name (an elegant, whimsical female name which meant Perfumed Winter, and a reference to a long-dead poet), Nguyen Dong Huong was a warrior, first and foremost. She’d spent her entire life in skirmishes against the pale men, the feathered clans, and the dream-skinners: her first ship, The Tiger Lashes with His Tail, had died at the battle of Bach Nhan, when the smoke-children had blown up Harmony Station and its satellites; her second had not lasted more than a year.\n The Tortoise in the Lake was her fourth ship, and they’d been together for five years, though neither of them expected to live for a further five. Men survived easier than ships—because they had armor, because the ships had been tasked to take care of them. Dong Huong remembered arguing with Lady Mieng’s Dreamer, begging the ship to spare itself instead of her; and running against a wall of obstinacy, a fundamental incomprehension that ships could be more important than humans.\n For the Northerners, however, everything would be different.\n “We’re here,” The Tortoise in the Lake said, cutting across Dong Huong’s gloomy thoughts.\n “I can see nothing.”\n There came a low rumble, which distorted the cabin around her, and cast an oily sheen on the walls. “Watch.”\n Outside, everything was dark. There was only the shadow of The Two Sisters in Exile, the dead ship that they’d been pulling since Longevity Station. It hung in space, forlorn and pathetic, like the corpse of an old woman; although Dong Huong knew that it was huge, and could have housed her entire lineage without a care.\n “I see nothing,” Dong Huong said, again. The ground rumbled beneath her, even as her ears popped with pressure—more laughter from The Tortoise in the Lake, even as the darkness of space focused and narrowed—became the shadow of wings, the curve on vast surfaces—the hulls of two huge ships flanking them; thin, sharp, like a stretch of endless walls—making The Tortoise in the Lake seem small and insignificant, just as much as Dong Huong herself was small and insignificant in comparison to her own ship.\n A voice echoed in the ship’s vast rooms, harsh and strong, tinged with the Northerners’ dialect, but still as melodious as declaimed poetry. “You wished to speak to us. We are here.”\n All Dong Huong knew about Northerners were dim, half-remembered snatches of family stories that were almost folktales: the greater, stronger part of the former Dai Viet Empire; the pale-skinned people of the outer planets, a civilization of graceful cities and huge habitats, of wild gardens on mist-filled hillsides, of courtly manners and polished songs.\n She was surprised, therefore, by the woman who disembarked onto The Tortoise in the Lake. Rong Anh was indeed paler than she was under her makeup, but otherwise ordinary looking: though very young, barely old enough to have bonded to a ship in Nam society, she bore herself with a poise any warrior would have envied. “You have something for us.”\n Dong Huong made a gesture, towards the walls of the room; the seething, ever-shifting mass of calligraphy; the fragments of poems, of books, of sutras, a perpetual reminder of the chaos underpinning the universe. “I . . . apologize,” she said at last. “I’ve come to bring one of your ships back to you.” To appease them, her commander had said. To avoid a declaration of war from a larger and more developed empire, a war which would utterly destroy the Nam.\n Anh did not move. “I saw it outside. Tell me what happened.”\n “It was an accident,” Dong Huong said. The Two Sisters in Exile—a merchant vessel from the Northerners’ vast fleet—had just happened to cross the line of fire at the wrong time. “A military exercise that went wrong. I’m sorry.”\n Anh hadn’t moved; but the ceruse on her face looked less and less like porcelain, and more and more like bleached bone. “Our ships don’t die,” she said, slowly.\n “I’m sorry,” Dong Huong said, again. “They’re as mortal as anyone, I fear.” The vast majority of attacks on a ship would do little but tear metal: a ship’s vulnerable point was the heartroom, where the Mind that animated it resided. Unlike Nam ships, Northerner ships were large and well shielded; and no pirate had ever managed to hack or pierce their way into a heartroom.\n But fate could be mocking, uncaring: as The Two Sisters in Exile passed by Dong Huong’s military exercise, a random lance of fire had gone all the way to the heartroom on an almost impossible trajectory—searing the Mind in its cradle of optics. They’d heard the ship’s Mind scream its pain in deep spaces long after the lance had struck; had stood in stunned silence, knowing that the Mind was dying and that nothing would stop that.\n Anh shook her head; looked up after a while, and her mask was back in place, her eyebrows perfectly arched, like moths. “An accident.”\n “The people responsible have been . . . dealt with.” Swiftly, and unpleasantly; and firmly enough to make it clear this would be not tolerated. “I have come to bring the body back, for a funeral. I’m told this is the custom of your people.”\n Nam ships and soldiers didn’t get a funeral, or at least not one that was near a planet. They lay frozen where they had fallen—stripped of all vital equipment, the cold of space forever preserving them from decay, a permanent monument; a warning to anyone who came; a memory of glory, which the spirits of the dead could bask into all the way from Heaven. It would be Dong Huong’s fate; The Tortoise in the Lake’s fate, in a few years or perhaps more if Quan Vu, God of War, saw fit to extend His benevolence to them both. Dong Huong had few expectations.\n “It is our custom.” Anh inclined her head. Her eyes blinked, minutely: it looked as if she was engaged elsewhere, perhaps communicating with her own ships. “We will bring her back where she was born, and bury her with the blessing of her descendants. You will come.”\n It wasn’t a question, or even an invitation; but an order. “Of course,” Dong Huong said. She hesitated, then said, “The military exercise was under my orders. If you want to clear my blood debt . . . ”\n Anh paused, halfway through one of the ship’s dilating doors. “Blood debt?” Her head moved up, a fraction, making her seem almost inhuman. “What would we do with your life?”\n Take it as a peace offering, Dong Huong thought, biting her tongue. She couldn’t say it; she’d been forbidden. Never admit what you’d come from; say just what was needed. Admit your guilt but say nothing about your hopes, lest they betray you as everything in life was bound to do.\n “Did you know her?” she asked.\n Anh did not move. At long last, still not looking at Dong Huong, she said, “She was of my lineage.”\n “Kin to you,” Dong Huong said, unsure of the implications. Minds were borne within a human womb before being implanted in their ships: this made them part of a lineage, as much as human children.\n “Yes,” Anh said. “I’ve known her since I was a child.” Her hand had clenched on the wall; but she walked away without saying anything more.\n After Anh was gone, Dong Huong opened her usual book of poetry, one of the only treasures she’d brought on board the ship. But the words blurred in her eyesight, slid away from her comprehension like raindrops on polished jade; and, rather than bringing her peace as they always did, the poems only frustrated her.\n Instead, she turned off the lights, and lay back in the darkness, thinking of Xuan and Hai—of their faces, frozen in the instant before she ordered The Tortoise in the Lake to fire, and transfixed them as surely as their ships had transfixed The Two Sisters in Exile—she saw them, falling, fading from her ship’s views—leaving nothing but the memory of their shocked gazes, weighing her, accusing her.\n She’d had to do it. Quickly, decisively, as she’d done everything in life; as she’d parted from her husband when he failed to uphold the family’s honor; as she’d forged her path in the military, never looking back, never regretting. And, as she’d told Anh, the matter had been closed: the perpetrators punished, order and law upheld, justice dealt out.\n But still . . .\n “You’re brooding,” The Tortoise in the Lake said.\n Dong Huong said nothing. She felt the weight of her armor on her body; the cold touch of metal on her skin; the solidity of everything around her, from the poetry on the wall to the folded clothes beside her bed. The present, which was the only thing that mattered. “I’m the officer whose crew shot the ship in the first place. By my presence here, I endanger everything,” she said.\n “Nonsense.” The room seemed to contract, become warmer and more welcoming, down to the words palpitating on the walls; the ship’s voice grew less distant. “Have you not seen their ships?”\n “I have. They’re huge.”\n “They’re weaponless.” There was a tinge of contempt in The Tortoise in the Lake’s voice. “Cargo transport, with a little reserve against pirates; but even less well-armed than the smoke-children.”\n Dong Huong shivered, in the darkness. “Did you have to pick that example?”\n “No,” the ship said, after a while. “You’re right, I didn’t think.”\n “I saw her face,” Dong Huong said at last. “She looks young, but doesn’t act like it.”\n “Rejuvenation treatments?”\n “Among other things.” Dong Huong shivered. The Nam were a small, fractured empire; beset on all sides by enemies. The Northerners, on the other hand . . . They were large; they hadn’t fought a large-scale war in centuries; and they had had time to develop everything from medical cures to advanced machinery. If they wanted war, the South, for all its warrior heritage, would be badly outgunned and outnumbered.\n “They love their peace,” the ship said. “Go to sleep, younger sister. There will be plenty of time in the morning.”\n Younger sister. Nothing more than convention by now; though the Mind of her first ship, The Tiger Lashes with His Tail, had shared blood with her: the mother that had borne it in her womb had been a cousin of Dong Huong’s own father.\n She did sleep, in the end. In her dreams, she walked in the lineage house again: on ochre ground, amidst cacti and shrunken bushes, and shrieking children playing rhyme-games in the courtyards. The smell of lemongrass and garlic rose from the kitchens like a balm to her soul, a reminder of the future she was fighting for; of what it meant to safeguard the Empire against its enemies. She saw her aunt, the mother of The Tiger Lashes with His Tail, standing tall and proud—her face unmoving as she learned of the ship’s fall at Bach Nhan, her eyes dark and dry; as if she’d already wept beforehand.\n Surely she had known, or suspected. Ships didn’t live long; but then, neither did human children. They both spread their wings like butterflies, like phoenixes, and ascended into the Heavens with the ancestors, watching over the Nam people. Dong Huong had tried to whisper such platitudes to her aunt; but nothing had come; and in her dreams—which were not real, not a true recollection—she stood looking into her aunt’s eyes, and saw the tears welling up, as black and opaque as ink from a broken brush.\n Dong Huong didn’t come from a family of warriors, but from a very old lineage of scholars, who had turned merchants rather than bond to ships and take up knives and guns. Fifth Uncle, her favorite when she was a child, regularly went to Northern planets; and he would speak to her of Northern wonders, always with the same misty, open-eyed sense of awe. He would remind her that the Northerners hadn’t fallen from grace, that they still remembered the original Dai Viet Empire and its culture that had stretched from one end of the galaxy to another; that they still had literature and poetry about beauty and dreams, and knew a life that wasn’t a succession of one battle after another.\n As a child, Dong Huong had drunk those words like tea or sugarcane juice. As an adult, within her combat unit, she had dismissed them. A civilization that barely knew war would be weak, a stunted, dying flower rather than the magnificent blossoming her relatives described.\n But the view beneath her now, as she and Anh descended in a shuttle towards the planet . . . As vast and as overwhelming as the two Northerner ships that had been her first contact—continents of chrome and verdant trees, sweeping away from her, seas glittering a vivid turquoise, with the glint of ten thousand boats on the waves—and, around them, in the atmosphere, a ballet of ships, as numerous as birds in the skies—a few huge spaceships like her own, carrying a Mind in their heartrooms; and myriad simple shuttle ships, manually driven, that nevertheless wove in and out of one another’s way, dancing like the rhythms of a song, the words of a poem—\n “You seem impressed,” Anh said. “Have you never seen a planet?”\n “Not—” Dong Huong swallowed, unable to dispel a memory of her own barren homeworld. “Not this kind, I’m afraid.”\n Anh smiled, indulgently. “Come. Let’s get you to the funeral.”\n After disembarking from the shuttle, Dong Huong felt . . . naked, a warrior without a sword. She had her gun at her hip, and her armor on her; Anh hadn’t even attempted to remove it from her, as if it all didn’t matter much. She also had the voice and video loop of The Tortoise in the Lake to carry in her thoughts, but still . . . the higher gravity was grinding her bones against one another; and unfamiliar people, each dressed in more elaborate clothes than the previous one, turned and stopped, staring at her with the same odd expression on their faces—appraisal, disapproval?\n Everything around her was freakish, different: buildings that were too tall, streets that were too wide, crisscrossed by alien vehicles. Everything was stately, orderly, so far from the chaotic traffic that marked Nam streets. Even the sky above was out of place; a deep, impossible blue with a thin, gleaming overlay: weather control, Anh said indulgently, as if it were the most natural thing in the world.\n Weather control. Dong Huong breathed in rain, and the distant smell of flowers; and thought of the gardens of her home planet—ochre ground, cacti breaking out in large, breathtaking flowers—but nowhere as rich, nowhere as pointlessly complicated.\n The funeral place was huge. Dong Huong had expected a funeral hall; a temple or a larger complex. But certainly not a city within the city, a whole area of tall buildings sprouting the white flags of mourning: every street filled with a stream of people in hempen garments, all wearing the strip of cloth that denoted the family of the dead.\n When Dong Huong fell in battle—as she must, for it was the fate of all warriors—her lineage would weep for her. Her husband and her husband’s brothers as well, perhaps, and that was all: two dozen people at the most, perhaps fifty if one included the more distant cousins. “Who are they?” she asked.\n Anh paused at the entrance to a slender, white spire, and smiled. “I told you. Her descendants.”\n “The—”\n “She was old,” Anh said. Her voice was low, hushed. “Her mother was born in the Hieu Phuc reign; and she bore a Mind and four human children; and the children in turn had children of their own; and the children had children, on and on through the generations . . . ”\n “How—” Dong Huong moistened her tongue, tried again. “How long had it lived?” The Tortoise in the Lake was ten years old, a veteran by Nam standards.\n “Four centuries. Our ships live long; so do our stations. How else shall we maintain our link to the past?”\n “The shuttles?” Dong Huong asked, at last, her voice wavering, breaking like a boat in a storm.\n Anh nodded, gravely. “Their pilots, yes. I told you that she had many descendants. And many friends.”\n Within Dong Huong’s thoughts, The Tortoise in the Lake recoiled, watching the ballet of the dozen largest ships in the skies. Every one of them had a Mind; every one of them was as old as The Two Sisters in Exile. Every one of them . . .\n “Is this her?” The speaker was a man, who, like Anh, didn’t look a day older than sixteen—a face Dong Huong ached to see older, more mature—less naïve about the realities of the war.\n “Minh. I see you were waiting for us.” Anh did not smile.\n Minh’s eyes were wide, almost shocked. “News gets around. Is it true?”\n Anh gestured upwards, to the ballet of ships in the sky. “Do you think we’d all gather, if it wasn’t true?”\n Dong Huong hadn’t said anything, waiting to be recognized. At last, Minh turned to her.\n “Dong Huong, this is Teacher Minh,” Anh said. “He leads our research programs.”\n Minh’s gaze was on her, scrutinizing her as one might look at a failed experiment. “Dong Huong. A beautiful name. It ill-suits you.”\n “It’s been said before,” Dong Huong said.\n Minh sighed. He looked at Anh, and back at her. “She’s so . . . hard, Anh. Too young to be that callous.”\n “Nam,” Anh said, with the same tinge of contempt to her voice. “You know how they are. Shaped by war.”\n Minh’s face darkened. “Yes. There is that.”\n “You disapprove?” Dong Huong felt a need, a compulsion to challenge him, to see him react in anger, in fear.\n “Life is sacred,” Minh said, leading her towards a double-panel door, with Anh in tow. “As we well know. Our bodies are a gift from our parents and our ancestors, and they shan’t be wasted.”\n “Wasted?” Dong Huong shook her head. “You mistake us. We give them back, in the most selfless fashion possible. We live for our families, for the Empire. We give our lives so that they might remain safe, unconquered.”\n Minh snorted. “You are such children,” he said. “Playing with forces you don’t understand. Which is what brings us here, isn’t it?”\n The spire led into a hall vaster than the Northern ships; the walls were decked with images of outside, of the two ships dragging the carcass of The Two Sisters in Exile. And it was full—of grave people in rich clothes, of mourners with tears streaming on their faces. She’d never seen so many people gathered together; and suspected that she would never see them again.\n Minh and Anh led Dong Huong to the front, ignoring her protestations, and introduced her to the principal mourner: an old, frail woman who looked more bewildered than sad. “It’s never happened before,” she said. “Ships don’t die. They never do . . . ”\n “No,” Minh said, slowly, gently. “They never do.” He wasn’t looking at Dong Huong. “I remember, the summer I came home from the Sixth Planet. She was docked in Azure Dragon Spaceport, looking so grand and beautiful—she’d used the trip to go in for repairs. She laughed on my comms, told me that now she looked as young as me, that she felt she could race anywhere in the universe. She . . . ” His voice broke; he raised a hand, rubbing at reddened eyes.\n “It’s our fault,” Dong Huong said. “That’s why I’ve come, to offer amends.”\n “Amends.” Minh didn’t blink. “Yes, of course. Amends.” He sounded as though he couldn’t understand any of the words, as though they were an entirely alien concept.\n Anh steered Dong Huong away from Minh, and towards her place in the front. “I don’t know anything about this,” Dong Huong protested.\n “You’ll watch. You said ‘amends,’, didn’t you? Consider this the start of what you owe the ship,” Anh said, firmly planting her at the front of the assembly.\n Dong Huong stood, feeling like a particularly exotic animal on display—with the weight of everyone’s gaze on her nape, the growing wave of shock, anger, incomprehension in the room. The ceremony was still going on in the background: monks had joined the mourners, their chanted mantras a continuous drone in the background, and the smell of incense was rising everywhere in the room. She clenched her hand on her gun, struggling to remember her composure.\n On the screens, the ship had been towed to what looked like its final destination; while a seething mass of smaller flyers gathered—not ships, not shuttles, but round spheres that looked like a cloud of insects compared to the The Two Sisters in Exile. The old woman took up her place at the lectern amidst the growing silence. “We’re all here,” she said at last. “Gathering from our planets, our orbitals, our shuttles, dancing in the skies to honor her. Her name was The Two Sisters in Exile, and she knew every one of our ancestors.”\n Dong Huong had expected anger; or grief; but not the stony, shocked silence of the assembly. “She was assembled in the yards of the Twenty-First Planet, in the last days of the Dai Viet Empire.” Her voice shivered, and became deeper and more resonant—no, it was a ship, speaking at the same time as her, its voice heavy with grief. “Her Grand Master of Design Harmony was Nguyen Van Lien; her Master of Wind and Water Khong Tu Khinh; and her beloved mother Phan Thi Quynh. She was born in the first year of the reign of Emperor Hieu Phuc, and died in the forty-second year of the Tu Minh reign. Dong Huong of the Nam brought her here.”\n The attention of the entire hall turned to Dong Huong, an intensity as heavy as stone. No hatred, no anger; but merely the same shock. This didn’t happen; not to them, not to their ships.\n “Today, we are gathered to honor her, and to fill the void that she lives in our lives. She’ll be—missed.” The voice broke; and the swarm of spheres that had gathered in space shuddered and broke, wrapping themselves around the corpse of The Two Sisters in Exile—growing smaller and smaller, slowly eating away at the corpse until nothing remained, just a cloud of dust that danced amongst starlight.\n “Missed.” The entire hall was silent now, transfixed by the ceremony. Someone, somewhere, was sobbing; and even if they hadn’t been, the spreading wave of shock and grief was palpable.\n Four centuries old. Her descendants, more numerous than the leaves of a tree, the birds in the sky, the grains of rice in a bowl. A life, held sacred; more valuable than jade or gold. Dong Huong watched the graceful ballet in the sky; the ceremony, perfectly poised, with its measured poetry and recitations from long-dead scholars; and, abruptly, she knew the answer she’d take back to her people.\n Graceful; scholarly; cultured. The Northerners had forgotten what war was; what death for ships was. They had forgotten that all it took was a lance or an accident to sear away four centuries of wisdom.\n They had forgotten how capricious, how arbitrary life was, how things could not be prolonged or controlled. And that, in turn, meant that this—this single death, this incident that would have had no meaning among the Nam—would have them rise up, outraged, bringing fire and wind to avenge their dead, scouring entire planets to avenge a single life.\n They would say no, of course. They would speak of peace, of the need for forgiveness. But something like this—a gap, a void this large in the fabric of society—would never be filled, never be forgiven. Minh’s research programs would be bent and turned towards enhancing the weapons on the merchant ships; and all those people in the hall, all those gathered descendants, would become an army on a sacred mission.\n In her mind, Dong Huong saw the desert plains of her home planet; the children playing in the ochre courtyard of her lineage house; the smell of lemongrass and garlic from the kitchens—saw it all shiver and crinkle, darkening like paper held to a flame.\n Quan Vu watch over us. They’re coming.\n Originally published in Solaris Rising 1.5, edited by Ian Whates.\n Aliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019)."}