{"fingerprint": "zsLfRDMPkcN8TIzlZvIV0wq3Lxg=", "sitename": "Clarkesworld Magazine", "title": "The Waiting Stars by Aliette de Bodard", "author": "Aliette de Bodard", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_06_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Waiting Stars by Aliette de Bodard", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9780 words, novelette, REPRINT\n The Waiting Stars\n The derelict ship ward was in an isolated section of Outsider space, one of the numerous spots left blank on interstellar maps, no more or no less tantalizing than its neighboring quadrants. To most people, it would be just that: a boring part of a long journey to be avoided—skipped over by Mind-ships as they cut through deep space, passed around at low speeds by Outsider ships while their passengers slept in their hibernation cradles.\n Only if anyone got closer would they see the hulking masses of ships: the glint of starlight on metal, the sharp, pristine beauty of their hulls, even though they all lay quiescent and crippled, forever unable to move—living corpses kept as a reminder of how far they had fallen; the Outsiders’ brash statement of their military might, a reminder that their weapons held the means to fell any Mind-ships they chose to hound.\n On the sensors of The Cinnabar Mansions, the ships all appeared small and diminished, like toy models or avatars—things Lan Nhen could have held in the palm of her hand and just as easily crushed. As the sensors’ line of sight moved—catching ship after ship in their field of view, wreck after wreck, indistinct masses of burned and twisted metal, of ripped-out engines, of shattered life pods and crushed shuttles—Lan Nhen felt as if an icy fist were squeezing her heart into shards. To think of the Minds within—dead or crippled, forever unable to move . . .\n “She’s not there,” she said, as more and more ships appeared on the screen in front of her, a mass of corpses that all threatened to overwhelm her with sorrow and grief and anger.\n “Be patient, child,” The Cinnabar Mansions said. The Mind’s voice was amused, as it always was—after all, she’d lived for five centuries, and would outlive Lan Nhen and Lan Nhen’s own children by so many years that the pronoun “child” seemed small and inappropriate to express the vast gulf of generations between them. “We already knew it was going to take time.”\n “She was supposed to be on the outskirts of the wards,” Lan Nhen said, biting her lip. She had to be, or the rescue mission was going to be infinitely more complicated. “According to Cuc . . . ”\n “Your cousin knows what she’s talking about,” The Cinnabar Mansions said.\n “I guess.” Lan Nhen wished Cuc was there with them, and not sleeping in her cabin as peacefully as a baby—but The Cinnabar Mansions had pointed out Cuc needed to be rested for what lay ahead; and Lan Nhen had given in, vastly outranked. Still, Cuc was reliable, for narrow definitions of the term—as long as anything didn’t involve social skills, or deft negotiation. For technical information, though, she didn’t have an equal within the family; and her network of contacts extended deep within Outsider space. That was how they’d found out about the ward in the first place . . .\n “There.” The sensors beeped, and the view on the screen pulled into enhanced mode on a ship on the edge of the yard which seemed even smaller than the hulking masses of her companions. The Turtle’s Citadel had been from the newer generation of ships, its body more compact and more agile than its predecessors’: designed for flight and maneuvers rather than for transport, more elegant and refined than anything to come out of the Imperial Workshops—unlike the other ships, its prow and hull were decorated, painted with numerous designs from old legends and myths, all the way to the Dai Viet of Old Earth. A single gunshot marred the outside of its hull—a burn mark that had transfixed the painted citadel through one of its towers, going all the way into the heartroom and crippling the Mind that animated the ship.\n “That’s her,” Lan Nhen said. “I would know her anywhere.”\n The Cinnabar Mansions had the grace not to say anything, though of course she could have matched the design to her vast databases in an eyeblink. “It’s time, then. Shall I extrude a pod?”\n Lan Nhen found that her hands had gone slippery with sweat, all of a sudden; and her heart was beating a frantic rhythm within her chest, like temple gongs gone mad. “I guess it’s time, yes.” By any standards, what they were planning was madness. To infiltrate Outsider space, no matter how isolated—to repair a ship, no matter how lightly damaged . . .\n Lan Nhen watched The Turtle’s Citadel for a while—watched the curve of the hull, the graceful tilt of the engines, away from the living quarters; the burn mark through the hull like a gunshot through a human chest. On the prow was a smaller painting, all but invisible unless one had good eyes: a single sprig of apricot flowers, signifying the New Year’s good luck—calligraphied on the ship more than thirty years ago by Lan Nhen’s own mother, a parting gift to her great-aunt before the ship left for her last, doomed mission.\n Of course, Lan Nhen already knew every detail of that shape by heart, every single bend of the corridors within, every little nook and cranny available outside—from the blueprints, and even before that, before the rescue plan had even been the seed of a thought in her mind—when she’d stood before her ancestral altar, watching the rotating holo of a ship who was also her great-aunt, and wondering how a Mind could ever be brought down, or given up for lost.\n Now she was older; old enough to have seen enough things to freeze her blood; old enough to plot her own foolishness, and drag her cousin and her great-great-aunt into it.\n Older, certainly. Wiser, perhaps; if they were blessed enough to survive.\n There were tales, at the Institution, of what they were—and, in any case, one only had to look at them, at their squatter, darker shapes, at the way their eyes crinkled when they laughed. There were other clues, too: the memories that made Catherine wake up breathless and disoriented, staring at the white walls of the dormitory until the pulsing, writhing images of something she couldn’t quite identify had gone, and the breath of dozens of her dorm-mates had lulled her back to sleep. The craving for odd food like fish sauce and fermented meat. The dim, distant feeling of not fitting in, of being compressed on all sides by a society that made little sense to her.\n It should have, though. She’d been taken as a child, like all her schoolmates—saved from the squalor and danger among the savages and brought forward into the light of civilization—of white sterile rooms and bland food, of awkward embraces that always felt too informal. Rescued, Matron always said, her entire face transfigured, the bones of her cheeks made sharply visible through the pallor of her skin. Made safe.\n Catherine had asked what she was safe from. They all did, in the beginning—all the girls in the Institution, Johanna and Catherine being the most vehement amongst them.\n That was until Matron showed them the vid.\n They all sat at their tables, watching the screen in the center of the amphitheater—silent, for once, not jostling or joking among themselves. Even Johanna, who was always first with a biting remark, had said nothing—had sat, transfixed, watching it.\n The first picture was a woman who looked like them—smaller and darker-skinned than the Galactics—except that her belly protruded in front of her, huge and swollen like a tumor from some disaster movie. There was a man next to her, his unfocused eyes suggesting that he was checking something on the network through his implants—until the woman grimaced, putting a hand to her belly and calling out to him. His eyes focused in a heartbeat, and fear replaced the blank expression on his face.\n There was a split second before the language overlays kicked in—a moment, frozen in time, when the words, the sounds of the syllables put together, sounded achingly familiar to Catherine, like a memory of the childhood she never could quite manage to piece together—there was a brief flash, of New Year’s Eve firecrackers going off in a confined space, of her fear that they would burn her, damage her body’s ability to heal . . . And then the moment was gone like a popped bubble, because the vid changed in the most horrific manner.\n The camera was wobbling, rushing along a pulsing corridor—they could all hear the heavy breath of the woman, the whimpering sounds she made like an animal in pain; the soft, encouraging patter of the physician’s words to her.\n “She’s coming,” the woman whispered, over and over, and the physician nodded—keeping one hand on her shoulder, squeezing it so hard his own knuckles had turned the color of a muddy moon.\n “You have to be strong,” he said. “Hanh, please. Be strong for me. It’s all for the good of the Empire, may it live ten thousand years. Be strong.”\n The vid cut away, then—and it was wobbling more and more crazily, its field of view showing erratic bits of a cramped room with scrolling letters on the wall, the host of other attendants with similar expressions of fear on their faces; the woman, lying on a flat surface, crying out in pain—blood splattering out of her with every thrust of her hips—the camera moving, shifting between her legs, the physician’s hands reaching into the darker opening—easing out a sleek, glinting shape, even as the woman screamed again—and blood, more blood running out, rivers of blood she couldn’t possibly have in her body, even as the thing within her pulled free, and it became all too clear that, though it had the bare shape of a baby with an oversized head, it had too many cables and sharp angles to be human . . .\n Then a quiet fade-to-black, and the same woman being cleaned up by the physician—the thing—the baby being nowhere to be seen. She stared up at the camera; but her gaze was unfocused, and drool was pearling at the corner of her lips, even as her hands spasmed uncontrollably.\n Fade to black again; and the lights came up again, on a room that seemed to have grown infinitely colder.\n “This,” Matron said in the growing silence, “is how the Dai Viet birth Minds for their spaceships: by incubating them within the wombs of their women. This is the fate that would have been reserved for all of you. For each of you within this room.” Her gaze raked them all, stopping longer than usual on Catherine and Johanna, the known troublemakers in the class. “This is why we had to take you away, so that you wouldn’t become broodmares for abominations.”\n “We,” of course, meant the Board—the religious nuts, as Johanna liked to call them, a redemptionist church with a fortune to throw around, financing the children’s rescues and their education—and who thought every life from humans to insects was sacred (they’d all wondered, of course, where they fitted into the scheme).\n After the class had dispersed like a flock of sparrows, Johanna held court in the yard, her eyes bright and feverish. “They faked it. They had to. They came up with some stupid explanation on how to keep us cooped here. I mean, why would anyone still use natural births and not artificial wombs?”\n Catherine, still seeing the splatters of blood on the floor, shivered. “Matron said that they wouldn’t. That they thought the birth created a special bond between the Mind and its mother—but that they had to be there, to be awake during the birth.”\n “Rubbish.” Johanna shook her head. “As if that’s even remotely plausible. I’m telling you, it has to be fake.”\n “It looked real.” Catherine remembered the woman’s screams; the wet sound as the Mind wriggled free from her womb; the fear in the face of all the physicians. “Artificial vids aren’t this . . . messy.” They’d seen the artificial vids: slick, smooth things where the actors were tall and muscular, the actresses pretty and graceful, with only a thin veneer of artificially generated defects to make the entire thing believable. They’d learned to tell them apart from the rest; because it was a survival skill in the Institution, to sort out the lies from the truth.\n “I bet they can fake that, too,” Johanna said. “They can fake everything if they feel like it.” But her face belied her words; even she had been shocked. Even she didn’t believe they would have gone that far.\n “I don’t think it’s a lie,” Catherine said, finally. “Not this time.”\n And she didn’t need to look at the other girls’ faces to know that they believed the same thing as her—even Johanna, for all her belligerence—and to feel in her gut that this changed everything.\n Cuc came online when the shuttle pod launched from The Cinnabar Mansions—in the heart-wrenching moment when the gravity of the ship fell away from Lan Nhen, and the cozy darkness of the pod’s cradle was replaced with the distant forms of the derelict ships. “Hey, cousin. Missed me?” Cuc asked.\n “As much as I missed a raging fire.” Lan Nhen checked her equipment a last time—the pod was basic and functional, with barely enough space for her to squeeze into the cockpit, and she’d had to stash her various cables and terminals into the nooks and crannies of a structure that hadn’t been meant for more than emergency evacuation. She could have asked The Cinnabar Mansions for a regular transport shuttle, but the pod was smaller and more controllable; and it stood more chances of evading the derelict ward’s defenses.\n “Hahaha,” Cuc said, though she didn’t sound amused. “The family found out what we were doing, by the way.”\n “And?” It would have devastated Lan Nhen, a few years ago; now she didn’t much care. She knew she was doing the right thing. No filial daughter would let a member of the family rust away in a foreign cemetery—if she couldn’t rescue her great-aunt, she’d at least bring the body back for a proper funeral.\n “They think we’re following one of Great-great-aunt’s crazy plans.”\n “Ha,” Lan Nhen snorted. Her hands were dancing on the controls, plotting a trajectory that would get her to The Turtle’s Citadel while leaving her the maximum thrust reserve in case of unexpected maneuvers.\n “I’m not the one coming up with crazy plans,” The Cinnabar Mansions pointed out on the comms channel, distractedly. “I leave that to the young. Hang on—” she dropped out of sight. “I have incoming drones, child.”\n Of course. It was unlikely the Outsiders would leave their precious war trophies unprotected. “Where?”\n A translucent overlay gradually fell over her field of vision through the pod’s windshield; and points lit up all over its surface—a host of fast-moving, small crafts with contextual arrows showing basic kinematics information as well as projected trajectory cones. Lan Nhen repressed a curse. “That many? They really like their wrecked spaceships, don’t they.”\n It wasn’t a question, and neither Cuc nor The Cinnabar Mansions bothered to answer. “They’re defense drones patrolling the perimeter. We’ll walk you through,” Cuc said. “Give me just a few moments to link up with Great-great-aunt’s systems . . . ”\n Lan Nhen could imagine her cousin, lying half-prone on her bed in the lower decks of The Cinnabar Mansions, her face furrowed in that half-puzzled, half-focused expression that was typical of her thought processes—she’d remain that way for entire minutes, or as long as it took to find a solution. On her windshield, the squad of drones was spreading—coming straight at her from all directions, a dazzling ballet of movement meant to overwhelm her. And they would, if she didn’t move fast enough.\n Her fingers hovered over the pod’s controls, before she made her decision and launched into a barrel maneuver away from the nearest incoming cluster. “Cousin, how about hurrying up?”\n There was no answer from Cuc. Demons take her, this wasn’t the moment to overthink the problem! Lan Nhen banked sharply, narrowly avoiding a squad of drones, who bypassed her—and then turned around, much quicker than she’d anticipated. Ancestors, they moved fast, much too fast for ion-thrust motors. Cuc was going to have to rethink her trajectory. “Cousin, did you see this?”\n “I saw.” Cuc’s voice was distant. “Already taken into account. Given the size of the craft, it was likely they were going to use helicoidal thrusters on those.”\n “This is all fascinating—” Lan Nhen wove her way through two more waves of drones, cursing wildly as shots made the pod rock around her—as long as her speed held, she’d be fine . . . She’d be fine . . . “—but you’ll have noticed I don’t really much care about technology, especially not now!”\n A thin thread of red appeared on her screen—a trajectory that wove and banked like a frightened fish’s trail—all the way to The Turtle’s Citadel and its clusters of pod-cradles. It looked as though it was headed straight into the heart of the cloud of drones, though that wasn’t the most worrying aspect of it. “Cousin,” Lan Nhen said. “I can’t possibly do this—” The margin of error was null—if she slipped in one of the curves, she’d never regain the kinematics necessary to take the next.\n “Only way.” Cuc’s voice was emotionless. “I’ll update as we go, if Great-great-aunt sees an opening. But for the moment . . . ”\n Lan Nhen closed her eyes, for a brief moment—turned them towards Heaven, though Heaven was all around her—and whispered a prayer to her ancestors, begging them to watch over her. Then she turned her gaze to the screen, and launched into flight—her hands flying and shifting over the controls, automatically adjusting the pod’s path—dancing into the heart of the drones’ swarm—into them, away from them, weaving an erratic path across the section of space that separated her from The Turtle’s Citadel. Her eyes, all the while, remained on the overlay—her fingers speeding across the controls, matching the slightest deviation of her course to the set trajectory—inflecting curves a fraction of a second before the error on her course became perceptible.\n “Almost there,” Cuc said—with a hint of encouragement in her voice. “Come on, cousin, you can do it—”\n Ahead of her, a few measures away, was The Turtle’s Citadel: its pod cradles had shriveled from long atrophy, but the hangar for docking the external shuttles and pods remained, its entrance a thin line of gray across the metallic surface of the ship’s lower half.\n “It’s closed,” Lan Nhen said, breathing hard—she was coming fast, much too fast, scattering drones out of her way like scared mice, and if the hangar wasn’t opened . . . “Cousin!”\n Cuc’s voice seemed to come from very far away; distant and muted somehow on the comms system. “We’ve discussed this. Normally, the ship went into emergency standby when it was hit, and it should open—”\n “But what if it doesn’t?” Lan Nhen asked—the ship was looming over her, spreading to cover her entire windshield, close enough so she could count the pod cradles, could see their pockmarked surfaces—could imagine how much of a messy impact she’d make, if her own pod crashed on an unyielding surface.\n Cuc didn’t answer. She didn’t need to; they both knew what would happen if that turned out to be true. Ancestors, watch over me, Lan Nhen thought, over and over, as the hangar doors rushed towards her, still closed—ancestors watch over me . . .\n She was close enough to see the fine layers of engravings on the doors when they opened—the expanse of metal flowing away from the center, to reveal a gaping hole just large enough to let a small craft through. Her own pod squeezed into the available space: darkness fell over her cockpit as the doors flowed shut, and the pod skidded to a halt, jerking her body like a disarticulated doll.\n It was a while before she could stop shaking for long enough to unstrap herself from the pod; and to take her first, tentative steps on the ship.\n The small lamp in her suit lit nothing but a vast, roiling mass of shadows: the hangar was huge enough to hold much larger ships. Thirty years ago, it had no doubt been full, but the Outsiders must have removed them all as they dragged the wreck out there.\n “I’m in,” she whispered; and set out through the darkness, to find the heartroom and the Mind that was her great-aunt.\n “I’m sorry,” Jason said to Catherine. “Your first choice of posting was declined by the Board.”\n Catherine sat very straight in her chair, trying to ignore how uncomfortable she felt in her suit—it gaped too large over her chest, flared too much at her hips, and she’d had to hastily readjust the trouser-legs after she and Johanna discovered the seamstress had got the length wrong. “I see,” she said, because there was nothing else she could say, really.\n Jason looked at his desk, his gaze boring into the metal as if he could summon an assignment out of nothing—she knew he meant well, that he had probably volunteered to tell her this himself, instead of leaving it for some stranger who wouldn’t care a jot for her—but in that moment, she didn’t want to be reminded that he worked for the Board for the Protection of Dai Viet Refugees; that he’d had a hand, no matter how small, in denying her wishes for the future.\n At length Jason said, slowly, carefully, reciting a speech he’d no doubt given a dozen times that day, “The government puts the greatest care into choosing postings for the refugees. It was felt that that putting you on board a space station would be—unproductive.”\n Unproductive. Catherine kept smiling; kept her mask plastered on, even though it hurt to turn the corners of her mouth upwards, to crinkle her eyes as if she were pleased. “I see,” she said, again, knowing anything else was useless. “Thanks, Jason.”\n Jason colored. “I tried arguing your case, but . . . ”\n “I know,” Catherine said. He was a clerk; that was all; a young civil servant at the bottom of the Board’s hierarchy, and he couldn’t possibly get her what she wanted, even if he’d been willing to favor her. And it hadn’t been such a surprise, anyway. After Mary and Olivia and Johanna . . .\n “Look,” Jason said. “Let’s see each other tonight, right? I’ll take you someplace you can forget all about this.”\n “You know it’s not that simple,” Catherine said. As if a restaurant, or a wild waterfall ride, or whatever delight Jason had in mind could make her forget this.\n “No, but I can’t do anything about the Board.” Jason’s voice was firm. “I can, however, make sure that you have a good time tonight.”\n Catherine forced a smile she didn’t feel. “I’ll keep it in mind. Thanks.”\n As she exited the building, passing under the wide arches, the sun sparkled on the glass windows—and for a brief moment she wasn’t herself—she was staring at starlight reflected in a glass panel, watching an older woman running hands on a wall and smiling at her with gut-wrenching sadness . . . She blinked, and the moment was gone; though the sense of sadness, of unease remained, as if she were missing something essential.\n Johanna was waiting for her on the steps, her arms crossed in front of her, and a gaze that looked as though it would bore holes into the lawn.\n “What did they tell you?”\n Catherine shrugged, wondering how a simple gesture could cost so much. “The same they told you, I’d imagine. Unproductive.”\n They’d all applied to the same postings—all asked for something related to space, whether it was one of the observatories, a space station; or, in Johanna’s case, outright asking to board a slow-ship as crew. They’d all been denied, for variations of the same reason.\n “What did you get?” Johanna asked. Her own rumpled slip of paper had already been recycled at the nearest terminal; she was heading north, to Steele, where she’d join an archaeological dig.\n Catherine shrugged, with a casualness she didn’t feel. They’d always felt at ease under the stars—had always yearned to take to space, felt the same craving to be closer to their home planets—to hang, weightless and without ties, in a place where they wouldn’t be weighed, wouldn’t be judged for falling short of values that ultimately didn’t belong to them. “I got newswriter.”\n “At least you’re not moving very far, ” Johanna said, a tad resentfully.\n “No.” The offices of the network company were a mere two streets away from the Institution.\n “I bet Jason had a hand in your posting,” Johanna said.\n “He didn’t say anything about that—”\n “Of course he wouldn’t.” Johanna snorted, gently. She didn’t much care for Jason; but she knew how much his company meant to Catherine—how much more it would come to mean, if the weight of an entire continent separated Catherine and her. “Jason broadcasts his failures because they bother him; you’ll hardly ever hear him talk of his successes. He’d feel too much like he was boasting.” Her face changed, softened. “He cares for you, you know—truly. You have the best luck in the world.”\n “I know,” Catherine said—thinking of the touch of his lips on hers; of his arms, holding her close until she felt whole, fulfilled. “I know.”\n The best luck in the world—she and Jason and her new flat, and her old haunts, not far away from the Institution—though she wasn’t sure, really, if that last was a blessing—if she wanted to remember the years Matron had spent hammering proper behavior into them: the deprivations whenever they spoke anything less than perfect Galactic, the hours spent cleaning the dormitory’s toilets for expressing mild revulsion at the food; or the night they’d spent shut outside, naked, in the growing cold, because they couldn’t remember which Galactic president had colonized Longevity Station—how Matron had found them all huddled against each other, in an effort to keep warm and awake, and had sent them to Discipline for a further five hours, scolding them for behaving like wild animals.\n Catherine dug her nails into the palms of her hands—letting the pain anchor her back to the present; to where she sat on the steps of the Board’s central offices, away from the Institution and all it meant to them.\n “We’re free,” she said, at last. “That’s all that matters.”\n “We’ll never be free.” Johanna’s tone was dark, intense. “Your records have a mark that says ‘Institution’. And even if it didn’t—do you honestly believe we would blend right in?”\n There was no one quite like them on Prime, where Dai Viet were unwelcome; not with those eyes, not with that skin color—not with that demeanor, which even years of Institution hadn’t been enough to erase.\n “Do you ever wonder . . . ” Johanna’s voice trailed off into silence, as if she were contemplating something too large to put into words.\n “Wonder what?” Catherine asked.\n Johanna bit her lip. “Do you ever wonder what it would have been like, with our parents? Our real parents.”\n The parents they couldn’t remember. They’d done the math, too—no children at the Institution could remember anything before coming there. Matron had said it was because they were really young when they were taken away—that it had been for the best. Johanna, of course, had blamed something more sinister, some fix-up done by the Institution to its wards to keep them docile.\n Catherine thought, for a moment, of a life among the Dai Viet—an idyllic image of a harmonious family like in the holo-movies—a mirage that dashed itself to pieces against the inescapable reality of the birth vid. “They’d have used us like broodmares,” Catherine said. “You saw—”\n “I know what I saw,” Johanna snapped. “But maybe . . . ” Her face was pale. “Maybe it wouldn’t have been so bad, in return for the rest.”\n For being loved; for being made worthy; for fitting in, being able to stare at the stars without wondering which was their home—without dreaming of when they might go back to their families.\n Catherine rubbed her belly, thinking of the vid—and the thing crawling out of the woman’s belly, all metal edges and shining crystal, coated in the blood of its mother—and, for a moment she felt as though she were the woman—floating above her body, detached from her cloak of flesh, watching herself give birth in pain. And then the sensation ended, but she was still feeling spread out, larger than she ought to have been—looking at herself from a distance and watching her own life pass her by, petty and meaningless, and utterly bounded from end to end.\n Maybe Johanna was right. Maybe it wouldn’t have been so bad, after all.\n The ship was smaller than Lan Nhen had expected—she’d been going by her experience with The Cinnabar Mansions, which was an older generation, but The Turtle’s Citadel was much smaller for the same functionalities.\n Lan Nhen went up from the hangar to the living quarters, her equipment slung over her shoulders. She’d expected a sophisticated defense system like the drones, but there was nothing. Just the familiar slimy feeling of a quickened ship on the walls, a sign that the Mind that it hosted was still alive—albeit barely. The walls were bare, instead of the elaborate decoration Lan Nhen was used to from The Cinnabar Mansions—no scrolling calligraphy, no flowing paintings of starscapes or flowers; no ambient sound of zither or anything to enliven the silence.\n She didn’t have much time to waste—Cuc had said they had two hours between the moment the perimeter defenses kicked in and the moment more hefty safeguards were manually activated—but she couldn’t help herself: she looked into one of the living quarters. It was empty as well, its walls scored with gunfire. The only color in the room was a few splatters of dried blood on a chair, a reminder of the tragedy of the ship’s fall—the execution of its occupants, the dragging of its wreck to the derelict ward—dried blood, and a single holo of a woman on a table, a beloved mother or grandmother: a bare, abandoned picture with no offerings or incense, all that remained from a wrecked ancestral altar. Lan Nhen spat on the ground, to ward off evil ghosts, and went back to the corridors.\n She truly felt as though she were within a mausoleum—like that one time her elder sister had dared her and Cuc to spend the night within the family’s ancestral shrine, and they’d barely slept—not because of monsters or anything, but because of the vast silence that permeated the whole place amidst the smell of incense and funeral offerings, reminding them that they, too, were mortal.\n That Minds, too, could die—that rescues were useless—no, she couldn’t afford to think like that. She had Cuc with her, and together they would . . .\n She hadn’t heard Cuc for a while.\n She stopped, when she realized—that it wasn’t only the silence on the ship, but also the deathly quiet of her own comms system. Since—since she’d entered The Turtle’s Citadel—that was the last time she’d heard her cousin, calmly pointing out emergency standby and hangar doors and how everything was going to work out, in the end . . .\n She checked her comms. There appeared to be nothing wrong; but whichever frequency she selected, she could hear nothing but static. At last, she managed to find one slot that seemed less crowded than others. “Cousin? Can you hear me?”\n Noise on the line. “Very—badly.” Cuc’s voice was barely recognizable. “There—is—something—interference—”\n “I know,” Lan Nhen said. “Every channel is filled with noise.”\n Cuc didn’t answer for a while; and when she did, her voice seemed to have become more distant—a problem had her interest again. “Not—noise. They’re broadcasting—data. Need—to . . . ” And then the comms cut. Lan Nhen tried all frequencies, trying to find one that would be less noisy; but there was nothing. She bit down a curse—she had no doubt Cuc would find a way around whatever blockage the Outsiders had put on the ship, but this was downright bizarre. Why broadcast data? Cutting down the comms of prospective attackers somehow didn’t seem significant enough—at least not compared to defense drones or similar mechanisms.\n She walked through the corridors, following the spiral path to the heartroom—nothing but the static in her ears, a throbbing song that erased every coherent thought from her mind—at least it was better than the silence, than that feeling of moving underwater in an abandoned city—that feeling that she was too late, that her great-aunt was already dead and past recovery, that all she could do here was kill her once and for all, end her misery . . .\n She thought, incongruously, of a vid she’d seen, which showed her great-grandmother ensconced in the heartroom—in the first few years of The Turtle’s Citadel’s life, those crucial moments of childhood when the ship’s mother remained on board to guide the Mind to adulthood. Great-grandmother was telling stories to the ship—and The Turtle’s Citadel was struggling to mimic the spoken words in scrolling texts on her walls, laughing delightedly whenever she succeeded—all sweet and young, unaware of what her existence would come to, in the end.\n Unlike the rest of the ship, the heartroom was crowded—packed with Outsider equipment that crawled over the Mind’s resting place in the center, covering her from end to end until Lan Nhen could barely see the glint of metal underneath. She gave the entire contraption a wide berth—the spikes and protrusions from the original ship poked at odd angles, glistening with a dark liquid she couldn’t quite identify—and the Outsider equipment piled atop the Mind, a mass of cables and unfamiliar machines, looked as though it was going to take a while to sort out.\n There were screens all around, showing dozens of graphs and diagrams, shifting as they tracked variables that Lan Nhen couldn’t guess at—vital signs, it looked like, though she wouldn’t have been able to tell what.\n Lan Nhen bowed in the direction of the Mind, from younger to elder—perfunctorily, since she was unsure whether the Mind could see her at all. There was no acknowledgement, either verbal or otherwise.\n Her great-aunt was in there. She had to be.\n “Cousin.” Cuc’s voice was back in her ears—crisp and clear and uncommonly worried.\n “How come I can hear you?” Lan Nhen asked. “Because I’m in the heartroom?”\n Cuc snorted. “Hardly. The heartroom is where all the data is streaming from. I’ve merely found a way to filter the transmissions on both ends. Fascinating problem . . . ”\n “Is this really the moment?” Lan Nhen asked. “I need you to walk me through the reanimation—”\n “No you don’t,” Cuc said. “First you need to hear what I have to say.”\n The call came during the night: a man in the uniform of the Board asked for Catherine George—as if he couldn’t tell that it was her, that she was standing disheveled and pale in front of her screen at three in the morning. “Yes, it’s me,” Catherine said. She fought off the weight of nightmares—more and more, she was waking in the night with memories of blood splattered across her entire body; of stars collapsing while she watched, powerless—of a crunch, and a moment where she hung alone in darkness, knowing that she had been struck a death blow—\n The man’s voice was quiet, emotionless. There had been an accident in Steele; a regrettable occurrence that hadn’t been meant to happen, and the Board would have liked to extend its condolences to her—they apologized for calling so late, but they thought she should know . . .\n “I see,” Catherine said. She kept herself uncomfortably straight—aware of the last time she’d faced the board—when Jason had told her her desire for space would have been unproductive. When they’d told Johanna . . .\n Johanna.\n After a while, the man’s words slid past her like water on glass—hollow reassurances, empty condolences, whereas she stood as if her heart had been torn away from her, fighting a desire to weep, to retch—she wanted to turn back time, to go back to the previous week and the sprigs of apricot flowers Jason had given her with a shy smile—to breathe in the sharp, tangy flavor of the lemon cake he’d baked for her, see again the carefully blank expression on his face as he waited to see if she’d like it—she wanted to be held tight in his arms and told that it was fine, that everything was going to be fine, that Johanna was going to be fine.\n “We’re calling her other friends,” the man was saying, “but since you were close to each other . . . ”\n “I see,” Catherine said—of course he didn’t understand the irony, that it was the answer she’d given the Board—Jason—the last time.\n The man cut off the communication; and she was left alone, standing in her living room and fighting back the feeling that threatened to overwhelm her—a not-entirely unfamiliar sensation of dislocation in her belly, the awareness that she didn’t belong here among the Galactics; that she wasn’t there by choice, and couldn’t leave; that her own life should have been larger, more fulfilling than this slow death by inches, writing copy for feeds without any acknowledgement of her contributions—that Johanna’s life should have been larger . . .\n Her screen was still blinking—an earlier message from the Board that she hadn’t seen? But why—\n Her hands, fumbling away in the darkness, made the command to retrieve the message—the screen faded briefly to black while the message was decompressed, and then she was staring at Johanna’s face.\n For a moment—a timeless, painful moment—Catherine thought with relief that it had been a mistake, that Johanna was alive after all; and then she realized how foolish she’d been—that it wasn’t a call, but merely a message from beyond the grave.\n Johanna’s face was pale, so pale Catherine wanted to hug her, to tell her the old lie that things were going to be fine—but she’d never get to say those words now, not ever.\n “I’m sorry, Catherine,” she said. Her voice was shaking; and the circles under her eyes took up half of her face, turning her into some pale nightmare from horror movies—a ghost, a restless soul, a ghoul hungry for human flesh. “I can’t do this, not anymore. The Institution was fine; but it’s got worse. I wake up at night, and feel sick—as if everything good has been leached from the world—as if the food had no taste, as if I drifted like a ghost through my days, as if my entire life held no meaning or truth. Whatever they did to our memories in the Institution—it’s breaking down now. It’s tearing me apart. I’m sorry, but I can’t take any more of this. I—” she looked away from the camera for a brief moment, and then back at Catherine. “I have to go.”\n “No,” Catherine whispered, but she couldn’t change it. She couldn’t do anything.\n “You were always the strongest of us,” Johanna said. “Please remember this. Please. Catherine.” And then the camera cut, and silence spread through the room, heavy and unbearable, and Catherine felt like weeping, though she had no tears left.\n “Catherine?” Jason called in a sleepy voice from the bedroom. “It’s too early to check your work inbox . . . ”\n Work. Love. Meaningless, Johanna had said. Catherine walked to the huge window pane, and stared at the city spread out below her—the mighty Prime, center of the Galactic Federation, its buildings shrouded in light, its streets crisscrossed by floaters; with the bulky shape of the Parliament at the center, a proud statement that the Galactic Federation still controlled most of their home galaxy.\n Too many lights to see the stars; but she could still guess; could still feel their pull—could still remember that one of them was her home.\n A lie, Johanna had said. A construction to keep us here.\n “Catherine?” Jason stood behind her, one hand wrapped around her shoulder—awkwardly tender as always, like that day when he’d offered to share a flat, standing balanced on one foot and not looking at her.\n “Johanna is dead. She killed herself.”\n She felt rather than saw him freeze—and, after a while, he said in a changed voice, “I’m so sorry. I know how much she meant . . . ” His voice trailed off, and he too, fell silent, watching the city underneath.\n There was a feeling—the same feeling she’d had when waking up as a child, a diffuse sense that something was not quite right with the world; that the shadows held men watching, waiting for the best time to snatch her; that she was not wholly back in her body—that Jason’s hand on her shoulder was just the touch of a ghost, that even his love wasn’t enough to keep her safe. That the world was fracturing around her, time and time again—she breathed in, hoping to dispel the sensation. Surely it was nothing more than grief, than fatigue—but the sensation wouldn’t go away, leaving her on the verge of nausea.\n “You should have killed us,” Catherine said. “It would have been kinder.”\n “Killed you?” Jason sounded genuinely shocked.\n “When you took us from our parents.”\n Jason was silent for a while. Then: “We don’t kill. What do you think we are, monsters from the fairytales, killing and burning everyone who looks different? Of course we’re not like that.” Jason no longer sounded uncertain or awkward; it was as if she’d touched some wellspring, scratched some skin to find only primal reflexes underneath.\n “You erased our memories.” She didn’t make any effort to keep the bitterness from her voice.\n “We had to.” Jason shook his head. “They’d have killed you, otherwise. You know this.”\n “How can I trust you?” Look at Johanna, she wanted to say. Look at me. How can you say it was all worth it?\n “Catherine . . . ” Jason’s voice was weary. “We’ve been over this before. You’ve seen the vids from the early days. We didn’t set out to steal your childhood, or anyone’s childhood. But when you were left—intact . . . accidents happened. Carelessness. Like Johanna.”\n “Like Johanna.” Her voice was shaking now; but he didn’t move, didn’t do anything to comfort her or hold her close. She turned at last, to stare into his face; and saw him transfixed by light, by faith, his gaze turned away from her and every pore of his being permeated by the utter conviction that he was right, that they were all right and that a stolen childhood was a small price to pay to be a Galactic.\n “Anything would do.” Jason’s voice was slow, quiet—explaining life to a child, a script they’d gone over and over in their years together, always coming back to the same enormous, inexcusable choice that had been made for them. “Scissors, knives, broken bottles. You sliced your veins, hanged yourselves, pumped yourselves full of drugs . . . We had to . . . we had to block your memories, to make you blank slates.”\n “Had to.” She was shaking now; and still he didn’t see. Still she couldn’t make him see.\n “I swear to you, Catherine. It was the only way.”\n And she knew, she’d always known he was telling the truth—not because he was right, but because he genuinely could not envision any other future for them.\n “I see,” she said. The nausea, the sense of dislocation, wouldn’t leave her—disgust for him, for this life that trapped her, for everything she’d turned into or been turned into. “I see.”\n “Do you think I like it?” His voice was bitter. “Do you think it makes me sleep better at night? Every day I hate that choice, even though I wasn’t the one who made it. Every day I wonder if there was something else the Board could have done, some other solution that wouldn’t have robbed you of everything you were.”\n “Not everything,” Catherine said—slowly, carefully. “We still look Dai Viet.”\n Jason grimaced, looking ill at ease. “That’s your body, Catherine. Of course they weren’t going to steal that.”\n Of course; and suddenly, seeing how uneasy he was, it occurred to Catherine that they could have changed that, too, just as easily as they’d tampered with her memories; made her skin clearer, her eyes less distinctive; could have helped her fit into Galactic society. But they hadn’t. Holding the strings to the last, Johanna would have said. “You draw the line at my body, but stealing my memories is fine?”\n Jason sighed; he turned towards the window, looking at the streets. “No, it’s not, and I’m sorry. But how else were we supposed to keep you alive?”\n “Perhaps we didn’t want to be alive.”\n “Don’t say that, please.” His voice had changed, had become fearful, protective. “Catherine. Everyone deserves to live. You especially.”\n Perhaps I don’t, she thought, but he was holding her close to him, not letting her go—her anchor to the flat—to the living room, to life. “You’re not Johanna,” he said. “You know that.”\n The strongest of us, Johanna had said. She didn’t feel strong; just frail and adrift. “No,” she said, at last. “Of course I’m not.”\n “Come on,” Jason said. “Let me make you a tisane. We’ll talk in the kitchen—you look as though you need it.”\n “No.” And she looked up—sought out his lips in the darkness, drinking in his breath and his warmth to fill the emptiness within her. “That’s not what I need.”\n “Are you sure?” Jason looked uncertain—sweet and innocent and naïve, everything that had drawn her to him. “You’re not in a state to—”\n “Ssh,” she said, and laid a hand on his lips, where she’d kissed him. “Ssh.”\n Later, after they’d made love, she lay her head in the hollow of his arm, listening to the slow beat of his heart like a lifeline; and wondered how long she’d be able to keep the emptiness at bay.\n “It goes to Prime,” Cuc said. “All the data is beamed to Prime, and it’s coming from almost every ship in the ward.”\n “I don’t understand,” Lan Nhen said. She’d plugged her own equipment into the ship, carefully shifting the terminals she couldn’t make sense of—hadn’t dared to go closer to the center, where Outsider technology had crawled all over her great-aunt’s resting place, obscuring the Mind and the mass of connectors that linked her to the ship.\n On one of the screens, a screensaver had launched: night on a planet Lan Nhen couldn’t recognize—an Outsider one, with their sleek floaters and their swarms of helper bots, their wide, impersonal streets planted with trees that were too tall and too perfect to be anything but the product of years of breeding.\n “She’s not here,” Cuc said.\n “I—” Lan Nhen was about to say she didn’t understand, and then the true import of Cuc’s words hit her. “Not here? She’s alive, Cuc. I can see the ship; I can hear her all around me . . . ”\n “Yes, yes,” Cuc said, a tad impatiently. “But that’s . . . the equivalent of unconscious processes, like breathing in your sleep.”\n “She’s dreaming?”\n “No,” Cuc said. A pause, then, very carefully: “I think she’s on Prime, Cousin. The data that’s being broadcast—it looks like Mind thought-processes, compressed with a high rate and all mixed together. There’s probably something on the other end that decompresses the data and sends it to . . . Arg, I don’t know! Wherever they think is appropriate.”\n Lan Nhen bit back another admission of ignorance, and fell back on the commonplace. “On Prime.” The enormity of the thing; that you could take a Mind—a beloved ship with a family of her own—that you could put her to sleep and cause her to wake up somewhere else, on an unfamiliar planet and an alien culture—that you could just transplant her like a flower or a tree . . . “She’s on Prime.”\n “In a terminal or as the power source for something,” Cuc said, darkly.\n “Why would they bother?” Lan Nhen asked. “It’s a lot of power expenditure just to get an extra computer.”\n “Do I look as though I have insight into Outsiders?” Lan Nhen could imagine Cuc throwing her hands up in the air, in that oft-practiced gesture. “I’m just telling you what I have, Cousin.”\n Outsiders—the Galactic Federation of United Planets—were barely comprehensible in any case. They were the descendants of an Exodus fleet that had hit an isolated galaxy: left to themselves and isolated for decades, they had turned on each other in huge ethnic cleansings before emerging from their home planets as relentless competitors for resources and inhabitable planets.\n “Fine. Fine.” Lan Nhen breathed in, slowly; tried to focus on the problem at hand. “Can you walk me through cutting the radio broadcast?”\n Cuc snorted. “I’d fix the ship, first, if I were you.”\n Lan Nhen knelt by the equipment, and stared at a cable that had curled around one of the ship’s spines. “Fine, let’s start with what we came for. Can you see?”\n Silence; and then a life-sized holo of Cuc hovered in front of her—even though the avatar was little more than broad strokes, Great-great-aunt had still managed to render it in enough details to make it unmistakably Cuc. “Cute,” Lan Nhen said.\n “Hahaha,” Cuc said. “No bandwidth for trivialities—gotta save for detail on your end.” She raised a hand, pointed to one of the outermost screens on the edge of the room. “Disconnect this one first.”\n It was slow, and painful. Cuc pointed; and Lan Nhen checked before disconnecting and moving. Twice, she jammed her fingers very close to a cable, and felt electricity crackle near her—entirely too close for comfort.\n They moved from the outskirts of the room to the center—tackling the huge mount of equipment last. Cuc’s first attempts resulted in a cable coming loose with an ominous sound; they waited, but nothing happened. “We might have fried something,” Lan Nhen said.\n “Too bad. There’s no time for being cautious, as you well know. There’s . . . maybe half an hour left before the other defenses go live.” Cuc moved again, pointed to another squat terminal. “This goes off.”\n When they were finished, Lan Nhen stepped back, to look at their handiwork.\n The heartroom was back to its former glory: instead of Outsider equipment, the familiar protrusions and sharp organic needles of the Mind’s resting place; and they could see the Mind herself—resting snug in her cradle, wrapped around the controls of the ship—her myriad arms each seizing one rack of connectors; her huge head glinting in the light—a vague globe shape covered with glistening cables and veins. The burn mark from the Outsider attack was clearly visible, a dark, elongated shape on the edge of her head that had bruised a couple of veins—it had hit one of the connectors as well, burned it right down to the color of ink.\n Lan Nhen let out a breath she hadn’t been aware of holding. “It scrambled the connector.”\n “And scarred her, but didn’t kill her,” Cuc said. “Just like you said.”\n “Yes, but—” But it was one thing to run simulations of the attack over and over, always getting the same prognosis; and quite another to see that the simulations held true, and that the damage was repairable.\n “There should be another connector rack in your bag,” Cuc said. “I’ll walk you through slotting it in.”\n After she was done, Lan Nhen took a step back; and stared at her great-aunt—feeling, in some odd way, as though she were violating the Mind’s privacy. A Mind’s heartroom was their stronghold, a place where they could twist reality as they wished, and appear as they wished to. To see her great-aunt like this, without any kind of appearance change or pretense, was . . . more disturbing than she’d thought.\n “And now?” she asked Cuc.\n Even without details, Lan Nhen knew her cousin was smiling. “Now we pray to our ancestors that cutting the broadcast is going to be enough to get her back.”\n Another night on Prime, and Catherine wakes up breathless, in the grip of another nightmare—images of red lights, and scrolling texts, and a feeling of growing cold in her bones, a cold so deep she cannot believe she will ever feel warm no matter how many layers she’s put on.\n Johanna is not there; beside her, Jason sleeps, snoring softly; and she’s suddenly seized by nausea, remembering what he said to her—how casually he spoke of blocking her memories, of giving a home to her after stealing her original one from her. She waits for it to pass; waits to settle into her old life as usual. But it doesn’t.\n Instead, she rises, walks towards the window, and stands watching Prime—the clean wide streets, the perfect trees, the ballet of floaters at night—the myriad dances that make up the society that constrains her from dawn to dusk and beyond—she wonders what Johanna would say, but of course Johanna won’t ever say anything anymore. Johanna has gone ahead, into the dark.\n The feeling of nausea in her belly will not go away: instead it spreads, until her body feels like a cage—at first, she thinks the sensation is in her belly, but it moves upwards, until her limbs, too, feel too heavy and too small—until it’s an effort to move any part of her. She raises her hands, struggling against a feeling of moving appendages that don’t belong to her—and traces the contours of her face, looking for familiar shapes, for anything that will anchor her to reality. The heaviness spreads, compresses her chest until she can hardly breathe—cracks her ribs and pins her legs to the ground. Her head spins, as if she were about to faint; but the mercy of blackness does not come to her.\n “Catherine,” she whispers. “My name is Catherine.”\n Another name, unbidden, rises to her lips. Mi Chau. A name she gave to herself in the Viet language—in the split instant before the lasers took her apart, before she sank into darkness: Mi Chau, the princess who unwittingly betrayed her father and her people, and whose blood became the pearls at the bottom of the sea. She tastes it on her tongue, and it’s the only thing that seems to belong to her anymore.\n She remembers that first time—waking up on Prime in a strange body, struggling to breathe, struggling to make sense of being so small, so far away from the stars that had guided her through space—remembers walking like a ghost through the corridors of the Institution, until the knowledge of what the Galactics had done broke her, and she cut her veins in a bathroom, watching blood lazily pool at her feet and thinking only of escape. She remembers the second time she woke up; the second, oblivious life as Catherine.\n Johanna. Johanna didn’t survive her second life; and even now is starting her third, somewhere in the bowels of the Institution—a dark-skinned child indistinguishable from other dark-skinned children, with no memories of anything beyond a confused jumble . . .\n Outside, the lights haven’t dimmed, but there are stars—brash and alien, hovering above Prime, in configurations that look wrong; and she remembers, suddenly, how they lay around her, how they showed her the way from planet to planet—how the cold of the deep spaces seized her just as she entered them to travel faster, just like it’s holding her now, seizing her bones—remembers how much larger, how much wider she ought to be . . .\n There are stars everywhere; and superimposed on them, the faces of two Dai Viet women, calling her over and over. Calling her back, into the body that belonged to her all along; into the arms of her family.\n “Come on, come on,” the women whisper, and their voices are stronger than any other noise; than Jason’s breath in the bedroom; than the motors of the floaters or the vague smell of garlic from the kitchen. “Come on, Great-aunt!”\n She is more than this body; more than this constrained life—her thoughts spread out, encompassing hangars and living quarters; and the liquid weight of pods held in their cradles—she remembers family reunions, entire generations of children putting their hands on her corridors, remembers the touch of their skin on her metal walls; the sound of their laughter as they raced each other; the quiet chatter of their mothers in the heartroom, keeping her company as the New Year began; and the touch of a brush on her outer hull, drawing the shape of an apricot flower, for good luck . . .\n “Catherine?” Jason calls behind her.\n She turns, through sheer effort of will; finding, somehow, the strength to maintain her consciousness in a small and crammed body alongside her other, vaster one. He’s standing with one hand on the doorjamb, staring at her—his face pale, leached of colors in the starlight.\n “I remember,” she whispers.\n His hands stretch, beseeching. “Catherine, please. Don’t leave.”\n He means well, she knows. All the things that he hid from her, he hid out of love; to keep her alive and happy, to hold her close in spite of all that should have separated them; and even now, the thought of his love is a barb in her heart, a last lingering regret, slight and pitiful against the flood of her memories—but not wholly insignificant.\n Where she goes, she’ll never be alone—not in the way she was with Jason, feeling that nothing else but her mattered in the entire world. She’ll have a family; a gaggle of children and aunts and uncles waiting on her, but nothing like the sweet, unspoiled privacy where Jason and she could share anything and everything. She won’t have another lover like him—naïve and frank and so terribly sure of what he wants and what he’s ready to do to get it. Dai Viet society has no place for people like Jason—who do not know their place, who do not know how to be humble, how to accept failure or how to bow down to expediency.\n Where she goes, she’ll never be alone; and yet she’ll be so terribly lonely.\n “Please,” Jason says.\n “I’m sorry,” she says. “I’ll come back—” a promise made to him; to Johanna, who cannot hear or recognize her anymore. Her entire being spreads out, thins like water thrown on the fire—and, in that last moment, she finds herself reaching out for him, trying to touch him one last time, to catch one last glimpse of his face, even as a heart she didn’t know she had breaks.\n “Catherine.”\n He whispers her name, weeping, over and over; and it’s that name, that lie that still clings to her with its bittersweet memories, that she takes with her as her entire being unfolds—as she flies away, towards the waiting stars.\n Originally published in The Other Half of the Sky, edited by Athena Andreadis and Kay Holt.\n Aliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019)."}