{"fingerprint": "zMhm/LBO9SON2DawCLTCKMZ/Whc=", "sitename": "Clarkesworld Magazine", "title": "Ship's Brother by Aliette de Bodard", "author": "Aliette de Bodard", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/debodard_01_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ship's Brother by Aliette de Bodard", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5290 words, short story, REPRINT\nShip’s Brother\nYou never liked your sister.\nI know you tried your best; that you would stay awake at night thinking on filial piety and family duty; praying to your ancestors and the bodhisattva Quan Am to find strength; but that it would always come back to that core of dark thoughts within you, that fundamental fright you carried with you like a yin shadow in your heart.\nI know, of course, where it started. I took you to the mind-ship—because I had no choice, because Khi Phach was away on some merchant trip to the Twenty-Third Planet—because you were a quiet and well-behaved son, and the birth-master would have attendants to take care of you. You had just turned eight—had stayed up all night for Tet, and shaken your head at the red envelopes, telling me you were no longer a child and didn’t need money for toys and sweets.\nWhen we disembarked from the shuttle, I had to pause—it was almost time for your sister to be born, and I felt my entire body had grown still—my lungs afire, my muscles seized up, and your sister in my womb stopping her incessant thrashing for a brief, agonizing moment. And I felt, as I always did during a contraction, my thoughts slipping away, down the birth canal to follow your sister; felt myself die, little by little, my self extinguishing itself like a flame.\nLike all Minds, she was hungry for the touch of a human soul; entwined around my thoughts, and in her eagerness to be born, she was pushing outwards, dragging me with her—I remembered pictures and holos of post-birth bearers, their faces slack, their eyes empty, their thought-nets as pale as the waning moon, and for a moment—before my lips curled around the mantras of the birth-masters—I felt a sliver of ice in my heart, a hollow of fear within my belly—the thought that it could be me, that it would be me, that I wasn’t strong enough . . .\nAnd then it passed; and I stood, breathing hard, in the center of the mind-ship they had laid out for my daughter.\n“Mommy?” you asked.\n“I’m fine, child,” I said, slowly—breathing in the miracle of air, struggling to string together words that made sense. “I’m fine.”\nWe walked together to the heartroom, where the birth-master would be waiting for us. Within me, your sister was tossing and turning—throbbing incessantly, a beating heart, a pulsing machine, the weight of metal and optics within my womb. I ran my hands on the metal walls of the curving corridors, feeling oily warmth under my fingers—and your sister pulsed and throbbed and spoke within me, as if she were already eager to fly within the deep spaces.\nYou were by my side, watching everything with growing awe—silenced, for once, by the myriad red lanterns hung on rafters; by the holos in the corridors depicting scenes from The Tale of Kieu and The Two Sisters in Exile; by the characters gleaming on doors and walls—you ran everywhere, touched everything, laughing; and my heart seemed full of the sound of your voice.\nThe contractions were closer together, and the pain in my back never seemed to go away; from time to time, it would rack my entire body, and I bit my tongue not to cry out. The mantras were in my mind now; part of the incessant litany I kept whispering, over and over, to keep myself whole, to hold to the center of my being.\nI had never prayed so hard in my entire life.\nIn the heartroom, the birth-master was waiting for us, with a cup of freshly brewed tea. I breathed in the flowery smell, watched the leaves dance within the shivering water—trying to remember what it felt to be light on my feet, to be free of pain and fatigue and nausea. “She’s coming,” I said, at last. I might have said something else, in other circumstances; made a comment from the Classic of Tea, quoted some poet like Nguyen Trai or Xuan Dieu; but my mind seemed to have deserted me.\n“She is,” the birth-master said, gravely. “It’s almost over now, older aunt. You have to be strong.”\nI was; I tried; but it all slid like tears on polished jade. I was strong, but so was the Mind in my belly. And I could see other things in the room, too—the charms against death, and the bundle at the back of the room, which would hold the injector—they’d asked me what to do, should the birth go wrong, should I lose my mind, and I had told them I would rather die. It had seemed easy, at the time; but now that I stood facing a very real possibility it seemed very different.\nI hadn’t heard you for a while. When I looked up, you were still; watching the center of the room, utterly silent, utterly unmoving. “Mommy . . . ”\nIt looked like a throne; if thrones could have protrusions and metal parts; and a geometry that seemed to continually reshape itself—like the spikes of a durian fruit, I’d thought earlier on, when they hadn’t yet implanted your sister in my womb, but now it didn’t feel quite so funny or innocuous. Now it was real.\n“This is where the Mind comes to rest,” the birth-master said. He laid a hand in the midst of the thing, into a hollow that seemed no bigger than a child’s body. “As you see, all the proper connections are already in place.” A mass of cables and fibres and sockets, and other things I couldn’t recognize—all tangled together like a nest of snakes. “Your mommy will have to be very brave.”\nAnother contraction racked through me, a wave that went from my womb to my back, stilling the world around us. I no longer felt huge or heavy; but merely detached, watching myself with growing anger and fear. This, now; this was real. Your sister would be born and plugged into the ship, and make it come alive; and I would have done my duty to the Emperor and to my ancestors. Else . . .\nI vaguely heard the birth-master speak of courage again, and how I was the strongest woman he knew; and then the pain was back, and I doubled over, crying out.\n“Mommy!”\n“I’m—fine—” I whispered, trying to hold my belly—trying to keep myself still, to gather my thoughts together—she was strong and determined, your sister, hungry for life, hungry for her mother’s touch.\n“You’re not fine,” you said, and your voice suddenly sounded like that of an adult—grave and composed, and tinged with so much fear it brought me back to the world, for a brief moment.\nI saw on the floor a puddle of blood that shone with the sheen of machine oil—how odd, I thought, before realizing that I was the one bleeding, the one dying piece by piece; and I was on the floor though I didn’t remember kneeling, and the pain was flaring in my womb and in my back—and someone was screaming—I thought it was the birth-master, but it was me, it had always been me . . .\n“Mommy,” you said, from somewhere far away. “Mommy!” Your hands were wet with blood; and the birth-master’s attendants were dragging you away, thank the ancestors. There were strong hands on me, whispering that I should hold, ride the crest of the pain, wait before I pushed, lest I lose myself altogether, scatter my own thoughts as your sister made her way out of my womb. My tongue was heavy with the repeated mantras, my lips bloodied where I had bit them; and I struggled to hold myself together, when all I longed for was to open up like a lotus flower; to scatter my thoughts like seeds upon the wind.\nBut through the haze of pain I saw you—saw, in the moment before the door closed upon you, the expression on your face; and I knew then that you’d never forget this, no matter how it all ended.\nOf course, you never forgot, or forgave. Your sister was born safely; though I remained weak ever after, moving slowly through my own home, with bones that felt made of glass; and my thoughts always seemed to move sluggishly, as if part of me had really followed her out of the birth canal. But it all paled when they finally let me stand in the ship; when I felt it come to life under my feet; when I saw colors shift on the wall, and metal take on the sheen of oil; when the paintings slowly faded away, to be replaced by the lines of poetry I’d read to your sister in the womb—and when I heard a voice deeper than the emptiness of space whisper to me, “Mother.”\nThe mind-ship was called The Fisherman’s Song; and that became your sister’s name; but in my heart she was always Mi Nuong, after the princess in the fairytale, the one who fell in love with her unseen fisherman.\nBut to you, she was the enemy.\nYou put away the Classics and the poets, and stole my books and holos about pregnancies and Minds—reading late at night, and asking me a thousand questions that I didn’t always have the answer to. I thought you sought to understand your sister; but of course I was wrong.\nI remember a day seven years after the birth—Khi Phach was away again to discuss shipments with some large suppliers, and you’d convinced me to have a banquet. You’d come to me in my office and told me that I shouldn’t be so preoccupied with my husband and children. I almost laughed; but you looked so much in earnest, so concerned about me, that my whole body suddenly felt light, infused with warmth. “Of course, child,” I said; and saw you smile, an expression that illuminated your entire being.\nIt was a huge banquet: in addition to our relatives, I’d invited my scholar classmates, and some of your friends so you wouldn’t get bored. I’d expected you to wander off during the preparations, to find your friends or some assignment you absolutely had to study; but you didn’t. You stood in the kitchen, fetching bits and pieces, and helping me make salad rolls and shrimp toasts—and mixed dipping sauces with such concentration, as if they were all that mattered in the world.\nYour sister was there too—not physically present, but she’d linked herself to the house’s com systems, and her translucent avatar stood in the kitchen: a smaller model of The Fisherman’s Song that floated around the room, giving us instructions about the various recipes, and laughing when we tore rice papers or dashed across the room for a missing ingredient. For once, you seemed not to mind her presence; and everything in the household seemed . . . harmonious and ideal, the dream put forth by the Classics.\nAt the banquet, I was surprised to find you sitting at my table—it wasn’t so much the breach of etiquette, I had never been over-concerned with such strictures, as something else. “Shouldn’t you be with your friends?” I asked.\nYou glanced, carelessly, to the end of the room, where the younger people sat: candidates to the mandarin exams, like you; and a group of pale-skinned outsiders, who looked a bit dazed, doing their best to follow the conversations by their side. “I can be with them later,” you said, making a dismissive gesture with your hands. “There’s plenty of time.”\n“There’s also plenty of time to be with me,” I pointed out.\nYou pulled your chair, and sat down with a grimace. “Time passes,” you said at last. “Mother . . . ”\nI laughed. “I’m not that frail.” Though I felt weak that particular night, my bones and womb aching, as if in memory of giving birth to your sister; but I didn’t tell you that.\n“Of course you’re not.” You looked awkward, staring at your bowl as if you didn’t know what to say anymore. Of course, you were fifteen—no adult yet, and ancestors know even Khi Phach had never mastered the art of small conversation.\nI glanced at Mi Nuong. Your sister didn’t eat; and so she spent the banquet at the back of the room, at a table with the avatars of other ships—knowing her, she’d be steering the conversation at the table to literature, and then disengage and listen to everyone’s ideas. It seemed as though everything was going well; and I turned back to the people around my table.\nAfter a while, I found myself deep in talk with Scholar Soi, one of my oldest friends from the Academy; and paying less attention to you, though you intervened from time to time in the discussion, bringing up a reference or a quotation you thought apt—you’d learnt your lessons well.\nSoi beamed at you. “Wonderful boy. Ready to sit for your mandarin exams, I’d say.”\nYou looked pale, then, as if you’d swallowed something that had got stuck in your throat. “I’m not sure, elder aunt.”\n“Modesty becomes you. Of course you’re ready. The fear will go away once you’re sitting in your exam cell, facing the dissertation subject.” She smiled fondly at that. You still looked ill; and I resolved to speak to you afterwards, to tell you that you had nothing to fear.\n“In fact,” Soi said, “we should have something right here, right now. A poetry competition, to give everyone a chance to shine. What do you think, child?”\nI’d expected you to say no; but you actually looked interested. If there was one thing you shared with your sister and with me, it was your love of words. “I’d be honored, elder aunt.”\n“Younger sister?” Soi asked me, but I shook my head.\nI don’t know how Soi did it, but she soon got most of the guests gathered around a table laden with wine cups—making florid gestures with her arms as she explained the rules. The outsiders, who didn’t speak the language very well, had all declined, except for one; but it was still a sizeable audience. You stood at the forefront of it, eagerly hanging on to Soi’s every word.\nAs Soi handed out turns for composing poetry, I found Mi Nuong hovering by my side. “I thought you’d be with them,” I said.\n“What about you, Mother?”\nI sighed. “He’s fifteen, and proud of his learning. He doesn’t need to compete with his forty-year-old mother.”\n“Or with his sister.” Mi Nuong’s voice was uncannily serene; but of course, navigating the deep spaces, the odd dimensions that folded space back upon itself, she saw things we didn’t.\n“No,” I said at last. I wasn’t blind; and had seen the way you avoided her.\n“It doesn’t matter, Mother,” Mi Nuong said, still in the same serene tones. “He’ll come around.”\n“You sound like you can see the future.”\n“Of course not.” She sounded amused. “It would be nice, though.” She fell silent, then; and I knew what she was thinking: that she didn’t need to see the future to know that she’d outlive us all. Minds lived for centuries.\n“Don’t—” I started, but she cut me off.\n“Don’t worry about me. It’s not that bad. I have so many more things to worry about, it doesn’t really loom large.” She sighed—I knew she was lying to reassure me, but I didn’t press the point. “Look at him. He’s still such a child.”\nAnd she wasn’t, not anymore—Minds didn’t age or mature at the same rate as humans. Perhaps it was her physiology, perhaps it was the mere act of crossing deep spaces so often, but she sounded disturbingly adult; even older than I sometimes. “You can’t hold him to your standards.”\nShe laughed—girlish, carefree. “Of course not. He’s human.”\n“But still your brother?” I asked.\n“Don’t be silly, Mother. Of course he’s my brother. He’s such an idiot sometimes, but then so am I. It’s what ties us together.” Her voice was brimming with fond amusement; and her avatar nudged slightly closer to me, to get a better view of the contest. Everyone was laughing now, as a very tipsy scholar attempted to compose a poem about autumn and wine, and mangled words. The lone outsider stood by your side, and didn’t laugh: his eyes were dark and intent, and he had a hand on your shoulder as he spoke to you—it looked as if he was trying to reassure you, which I couldn’t fault him for.\n“He worries for nothing,” Mi Nuong said. “He’ll win with ease.”\nAnd, indeed, when your turn came, you got up, gently setting aside the outsider’s hand—and made up a poem about crab-flowers, making puns and references to other poems effortlessly, as if it was all part of some inner flow you could dip into. People stood, silent, as if struck with awe; and then Soi bowed to you, as younger to elder, and everyone else started to crowd around you in order to give you congratulations.\n“See? I told you. He’ll fly through his examinations, get a mandarin posting wherever he wants,” Mi Nuong said.\n“Of course he will,” I said. I’d never doubted it; never questioned that you had my talent for literature, and Khi Phach’s cunning and practical intelligence.\nI looked at you—at the way you stood with your arms splayed out, basking in the praise of scholars; at your face still flushed with the declaiming of poetry—and you looked back at me, and saw me sitting with your sister by my side; and your face darkened in that moment, became as brittle as thin ice.\nI felt a shiver go down my spine—as if some dark spirit had touched me and cast a shadow over all the paths of my future.\nBut the shadow never seemed to materialize: you passed your mandarin exams with ease—and awaited a posting from the government, though you closeted yourself with your friends and wouldn’t confide any of your plans to us.\nThe summer after your exams, we went to see Mi Nuong—you and me and Khi Phach, who had just returned from his latest expedition. We took a lift to the orbital that held the spaceport—watching the fractured continents of the Eighteenth planet recede to a string of pearls in the middle of the ocean.\nYou sat away from us, reading a book a friend had given you—the outsiders’ Planet of Danger and Desire, which was the latest rage that summer—while Khi Phach and I watched the receding continents, and talked about the future and what it held in store for us.\nAt the docks, the screens blinked above us, showing that your sister had just arrived from the First Planet. We stood outside the gate, waiting for her passengers to disembark—a stream of Viets and Xuyans, wearing silk robes and shirts, their faces still tense from the journey—from the odd sounds and sights, and the queer distortions of metal and flesh and bones one experienced aboard a mind-ship in deep spaces.\nThere were dignitaries from the Court itself, in five-panel brocade, their topknots adorned with exquisite jade and gold, talking amongst themselves in quiet tones—and a group of saffron-cloaked monks carrying nothing but the clothes on their back, their faces calm and ageless, making me ache for their serenity. Last of all came a vacant-eyed mother who hadn’t survived the birth of her Mind, being led by her husband like a small child. My hands must have tensed without my realizing it, because Khi Phach grabbed me so hard I felt bruised, and forced me to look away.\n“It’s over,” he said. “You’ll never need to carry another Mind again.”\nI looked at my hands, tracing the shape of my bones through translucent skin—it had never been the same since Mi Nuong’s birth. “Yes. I guess it is.”\nWhen we turned back, you weren’t with us. I glanced at Khi Phach, fighting rising panic: you were an adult after all, hardly likely to be defenseless or lost. “He must have gone to another dock,” Khi Phach said.\nWe searched the docks; the shops; the entire concourse, even the pagodas set away from the confusion of the spaceport’s crowd, before we finally found you.\nYou were at the back of the spaceport, where the outsider hibernation ships berthed—watching another stream of travelers, their pale skins glistening from the fluid in the hibernation cradles, their eyes still faraway, reeling from the shock of waking up—the knowledge that the thin thread of ansible communications was their only link to a home planet where everyone they had ever held dear had aged and died during the long journey.\nKhi Phach called out your name. “Anh!”\nYou didn’t turn; your eyes remained on the outsiders.\n“You gave us quite a fright,” I said, laying a hand on your shoulder, feeling the tension in every one of your muscles. I thought it was stress; worry at the new life that opened up for you as a mandarin. “Come, let’s see your sister.”\nYou were silent and sullen the entire way; watching Khi Phach introduce himself to the crewmember that guarded the access to the ship, telling him we were family—her face lit up, and she congratulated him on such a beautiful child. I’d expected you to grimace in jealousy, as you always did when your sister was mentioned; but you didn’t even speak.\n“Child?” I asked.\nI felt you tense as we walked into the tunnel leading to your sister’s body; as the walls became organic, as faint traceries of poetry started appearing, and a persistent hum rose into the background: your sister’s heartbeat, reverberating through the entire ship.\n“This is stupid,” you said, as we entered.\n“What is?” Khi Phach asked.\n“Mind-ships.” You shook your head. “It’s not meant to be that way.”\nKhi Phach glanced at me, inquisitively; for once, I was stuck for words. “Outsiders do it better,” you said, your hands shut into fists.\nWe stopped, in the middle of the entrance hall—rafters adorned with red lanterns, poetry about family reunions, your sister’s way of welcoming us home—I knew she was listening, that she might be hurt, but it was too late to take this outside, as you’d no doubt intended all along. “Better?” I said, arching an eyebrow. “Leaving for years in hibernation, leaving everything they own behind?”\n“They don’t take mind-ships!” You weren’t looking at me or Khi Phach; but at the walls, your sister’s body wrapped all around you. “They don’t go plunging into deep spaces where we were never meant to go, don’t go gazing into things that make them insane—they don’t—don’t birth those monstrosities just to navigate space faster!”\nThere was silence, in the wake of your words. All I could think of was all that I’d ignored; the priests’ books that you’d brought home, your trips to the nearby Sleeper Church, and your pale-skinned outsider friends—like the one who had spoken to you so intently at the banquet.\n“Apologize to your sister,” Khi Phach said.\n“I won’t.”\nHis voice was cold. “You just called her an abomination.”\n“I don’t care.”\nI let go of you, then; moved away with one hand over my heart, as if I could make the words go away. “Child. Apologize Please,” I said, in the tone that I’d used when you were little.\n“No.” You laid a hand on the walls, feeling their warmth; and pulled back, as if burnt. “Look at you, Mother. All wasted up, for her sake. All our women, subjugated just so they can birth those things.”\nYou sounded like Father Paul; like an outsider yourself, full of that same desperate rage and aggressiveness—though, unlike them, you had a home to come back to.\n“I don’t need you to defend me, child,” I said. “And we can resume that discussion elsewhere—” I waved a hand, forestalling Khi Phach’s objections— “but not here, not in your sister’s hearing.”\nA wind rose through the ship, picking up sound as it whistled through empty rooms. “Abomination . . . ” Mi Nuong whispered. “Come tell me what you think—to my face. In my heartroom.”\nYou stared upwards; as if you could see her; guess at the mass of optics and flesh plugged into the ship—and before either of us could stop you, you spun and ran out of the ship, making small, convulsive noises that I knew were tears.\nChild . . .\nI would have run, too; but Khi Phach laid a hand on my shoulder. “Let him cool off first. You know you can’t argue with him in that state.”\n“I’m sorry,” I said to Mi Nuong.\nThe lights flickered; and the ship seemed to contract a little. “He’s frightened,” Mi Nuong said.\n“Which is no excuse.” Khi Phach’s face was stern.\nBut he hadn’t been there at the birth; he didn’t remember what I remembered; the shadow that had lodged like a shard within your heart, that colored everything. “I should have seen it,” I said. Because it was all my fault; because I should have never brought you to the ship that day. What had I been thinking, trusting in strangers to protect my own child?\n“You shouldn’t torment yourself,” Mi Nuong said.\nI laid a hand on a wall—watching lines of poetry scroll by, songs about fishermen flying cormorants over the river, about wars dashing beloved sons like strings of pearls—about the beauty of hibiscuses doomed to pass and become nothing, just as we, too, passed away and became nothing—and I thought about how small, how insignificant we were within the world—about letting go of grief and guilt. “I can’t stop,” I said. “He’s my son, just as you are my daughter.”\n“I told you before. He’ll see it.”\n“I guess,” I said. “Tell me about your trip. How was it?”\nShe laughed; giggled like a teenage girl. “Wonderful. You should see the First Planet, it’s so huge—it has all those palaces and gardens, covering it from end to end; and pagodas that go all the way through the atmosphere, joined to orbitals, so that prayers genuinely go out into the void . . . ”\nI remember it all; remember it vividly, every word, every nuance that happened that day. For, when we came home, you weren’t there anymore.\nYou’d packed your things, and left a message. I guess you were a scholar in spite of everything, because you didn’t send a mail through the terminal, but wrote it with pen and paper: crossed words over and over until they hardly made sense.\nI can’t live here anymore. I apologize for being an unfilial son; but I have to seek my fortune elsewhere.\nKhi Phach started moving Heaven and Earth to find you; but I didn’t have to look very far. Your name, barely disguised, was on the manifest for an outsider hibernation ship headed out of the Dai Viet Empire, to an isolated planet on the edge of a red sun—a trip sponsored by the Sleeper Church. The hibernation ship had left while we were still searching for you; and there was no calling it back, not without starting a war with the outsiders. And what pretext could we have given? You were an adult; sixteen already, with the mandarin exams behind you; old enough to do what you wanted with your life.\nYou wouldn’t age in your hibernation pod; but by the time you arrived, twenty years would have elapsed for us, making the distance between us all but insurmountable.\nKhi Phach fumed against the Church, speaking of retribution and judgment, making plans to bring this before the local magistrate. I merely stood still, watching the screen that showed the hibernation ship going further and further away from us—feeling as though someone had ripped my heart out of my chest.\nMany years have passed, and you still haven’t come back. Khi Phach took his anger and bitterness into his grave; and I stare at his holo every morning when I rise—wondering when I, too, will join him on the ancestral altar.\nYour sister, of course, has hardly aged: Minds don’t live like humans, and she’ll survive us all. She’s with me now—back from another trip into space, telling me about all the wonders she’s seen. I ask about you; and feel the ship contracting around me—in sadness, in anger?\n“I don’t know, Mother. The outsider planets are closed to mind-ships.”\nI know it already, but I still ask.\n“Have you—” I bite my lips, pull out the treacherous words one by one—”have you forgiven him?”\n“Mother!” Mi Nuong laughs, gentle, carefree. “He was just a child when it happened. Why should I keep grudges that long? Besides . . . ” Her voice is sadder, now.\n“Yes,” I say. “I’ve seen the holos, too.” Gently, carefully, I pull your latest disk—finger it before triggering the ansible record it contains. An image of you hovers in the midst of the ship, transparent and leeched of colors.\n“Mother. I hope this finds you well. I have started work for a newscast—this would please you, wouldn’t it, my being a scholar after all?” You smile, but it doesn’t reach all the way to your eyes; and your face is pale, as if you hadn’t seen the sun in a long time. “I am well, though I think of you often.”\nThe messages all come through ansible; so do money transfers—as if money could reduce the emptiness of space between us, as if it could repay me for your absence. “I was sorry to hear about Father. I miss you both terribly.” You pause then, turn to look at something beyond the camera—I catch a glimpse of slim arms, wrapped around you—a quick hug, to give you strength, but even that doesn’t light up your eyes or your face—before you look at the camera again. “I’m sorry. I—I wish I were home again.”\nI turn off the disk, let it lie on the floor—it becomes ringed with scrolling words, with poems of sorrow and loss.\n“He’s happy,” Mi Nuong says, in a tone that makes clear she believes none of it. “Among the outsiders.”\nWalking on a strange land, in a strange world—learning new customs in an unfamiliar language—away from us, away from your family. “Happy,” I say.\nI finger the disk again. I know that if I turn it on again, I’ll hear your final words, the ones that come at the end of the recording, spoken barely loud enough to be heard.\nI miss you all terribly.\nUs all. Father and Mother—and sister. This is the first time you’ve ever admitted this aloud. And I’ve seen the other, earlier holos; seen how your eyes become ringed with shadows as time passes; how unhappiness eats you alive, year after year, even as you tell me how good life is, among the outsiders.\nI’ll be long gone when your pain becomes heavier than your fear, heavier than your shame; when you turn away from your exile and return to the only place that was ever home to you. By the time you come back, I’ll be dust, ashes spread in the void of space; one more portrait on the ancestral altar, to be honored and worshipped—I’ll have passed on to another life, with the Buddha’s blessing.\nBut I know, still, what will happen.\nYou’ll walk out of the outsiders’ docks, pale with the lack of sun, covered in the slime of your hibernation pod—shaking with the shock of awakening, your eyes filled with the same burning emptiness I remember so well, the same rage and grief that all you’ve ever held dear has been lost while you traveled.\nAnd, like an answer to your most secret prayer, you’ll find your sister waiting for you.\nOriginally published in Interzone, issue #241.\nAliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019)."}