{"fingerprint": "I70uwYhwd1IJlzxl+vcwm7cbtcw=", "sitename": "Clarkesworld Magazine", "title": "Augmentations, Assassins, and Soundtracks: A Conversation with Emily Devenport by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/devenport_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Augmentations, Assassins, and Soundtracks: A Conversation with Emily Devenport by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAugmentations, Assassins, and Soundtracks: A Conversation with Emily Devenport\nAs we continue to receive images from exploration vehicles launched years ago from deep within our own solar system, our imaginations look farther into the black abyss of space. Once we’ve finished pillaging this planet, or this planet is finished with us, will there be another home floating out there? How will we get there when the distances between inhabitable planets are too far to hold in the mind? What will happen to people on that long journey? Will they be kind, or will they kill?\nEmily Devenport tackles the “Generation Ship” sub-genre of science fiction from a whole new direction. Medusa Uploaded cleverly infuses this framework with sprinklings of other genres. On board two generation ships divided by class, many secrets lie waiting to be uncovered. Oichi, suspected of insurgency, is spaced out of an airlock and is discovered by one such secret. But Oichi has some secrets of her own, and some murderous ambitions to shift the balance of power.\nEmily Devenport is the author of numerous novels and short stories. She was a finalist for the Philip K. Dick Award. Her latest novel Medusa Uploaded is available from Tor Books.\nWhen did you know you wanted to be a writer? When did you know that you could actually do it?\nI knew I wanted to be a writer by the time I was twelve. I was able to write coherently by the time I was about twenty-one, but it took another six years to teach myself how to write anything people would like to read. (Those lessons are still in progress.)\nMusic plays a specific and integral role in your novel. Why did you choose to include specific songs or composers?\nI chose the composers and the pieces that popped into my head while I was writing the scenes. I’ve always loved TV and movies, and I have lived through the heyday of film composers, so I had a lot of good stuff to choose from. One of the peculiar side effects of being exposed to all of that musical drama is that I tend to imagine soundtracks for stories I’m telling. I’m not sure how much people like it, and I’m a little surprised I’ve gotten away with it, but I can’t seem to help it.\nDo you listen to music while you write? If so, what have you been listening to lately?\nI have done so for other novels—but I don’t currently have a good sound system (I hope to remedy that, soon). For Medusa Uploaded and Medusa in the Graveyard I visited YouTube quite a lot. Classical music and jazz are readily available there, and so are a lot of the movie/TV scores.\nI have old favorites that I listen to—they’re well-represented in Medusa Uploaded. Some other things I’ve been listening to lately are Mahavishnu’s Apocalypse, an album called Harps of the Ancient Temples, and songs by Nick Drake.\nWhat inspired the design of Medusa?\nI think I can blame Tentacle Envy. It first began to stir in my soul when Doctor Octopus showed up in that 2004 movie, Spider-Man 2. I loved the prosthesis he wore, and the fact that it had an interactive AI element to it. I seriously wish I had one of those gizmos.\nA Medusa Unit would be a more serious commitment. That would be a full-blown relationship, and I may be too selfish to maintain that kind of bond.\nStories that take place on generation ships are an exciting sub-genre of science fiction. Did any other authors or stories inspire you to tackle this particular kind of story?\nA. E. van Vogt is the first science fiction author who immediately comes to my mind, though I’m not even sure he wrote about generation ships. I’m thinking of Voyage of the Space Beagle. Another possibility is Zenna Henderson, who wrote a series of short stories about aliens she called The People. They came to Earth because their sun was dying, and it took generations for them to do that.\nOddly enough, my other inspiration was Jeff Lindsay’s Dexter series, in which a serial killer targets other serial killers. I thought that idea had interesting possibilities when applied to people on a generation ship.\nWhat are some of the challenges of designing a generation ship?\nThat depends on how technical you want to get. I think the first challenge is gravity. If your people aren’t living in near-earth gravity conditions, their bone density is going to change. The other physical effects of long exposure to zero-gravity conditions are still being studied. I used spin to simulate gravity on Olympia, though it’s still an unproven theory (at least, on a scale that large). Despite the lack of test data, I prefer spin-gravity as a concept, because the idea of generating a gravitational field opens quite another can of worms. The power required would be immense. That seems like an irrational expenditure, to me.\nOne of the interesting things I researched was exposure to void conditions. In a lot of movies, special effects have included people’s eyes blowing up, their tongues swelling, etc. I was surprised to learn that some astronauts had survived exposure to void conditions during training (and some did not). Their accounts of what happened were quite different from popular depictions. I decided that sort of death would be more merciful (and less traumatic) than drowning, because you pass out so quickly.\nI didn’t nail down too many specific details about Olympia because I wanted to preserve a sense of mystery about that setting. I did try to figure out what my parameters were concerning her technical details, and then stay inside them.\nWhich came first, the characters or the story concept?\nThe story concept came first. I used to get together with some writer buddies and shoot the breeze. We discussed the idea that a serial killer on a generation ship would be interesting, but none of us could come up with a plot and characters that jelled. That didn’t happen for another twenty years, when I finally had a dream about Medusa and Oichi. I dreamed that opening sequence in Lock 212. Once I knew about them, I could start asking the questions that made the story possible.\nThe genesis of this story was a novelette published right here in Clarkesworld Magazine. When did you know the story was actually much larger?\nI knew it before I wrote the novelette. I got halfway through “The Servant” (about 20 pages in), thinking it was a novel, and I stalled out (again). I couldn’t see the way forward until I realized it could be a shorter piece. About a year after it was published in Clarkesworld, I began to see how the longer story should unfold.\nOichi is a fascinating character. Is there anyone or anything that inspired her?\nI mentioned Dexter Morgan, from Jeff Lindsay’s books. I loved how he managed to get the reader to root for a killer. I also felt enthralled with the idea of someone who could be emotionally shallow, yet also have admirable qualities. We tend to be so black-and-white in our judgments of people, and I’m fascinated with the gray areas.\nMedusa Uploaded takes place in the far future, but a lot of the tech and systems feel like completely plausible extrapolations of modern day technology. Where do you see communication technology heading? Is it implants or more complex tablet computers or something entirely different?\nImplants are one possibility, and I have to admit I stole the concept from Vernor Vinge. I loved the idea of being able to speak almost immediately to anyone (who is open to accept your call), and I especially loved the idea of having instant access to information. In a way, that did happen—we’ve got the Internet, Google, etc.\nOther things drive technology besides what we want. Profit is a big consideration—sometimes it’s about what they give you rather than what you want (think about CDs and LPs). I also think there would be a huge variety of tech usage based on availability and income level. I suppose young people could surprise us and decide they want nothing to do with any of that and go back to older ways of communicating and entertaining themselves. Cultural revolutions are always possible (even if they’re not always desirable).\nI understand there’s a sequel in the works. Can you give us a little teaser?\nI’m working on the edits for the sequel. I can tell you that Oichi and Medusa both get pushed out of their comfort zones, and their relationship isn’t as solid as they thought it was. Some new characters show up, some old characters have surprises in store, and everyone has to improvise like crazy.\nDo you have any other projects you’re working on?\nI’ve got a bunch of short stories I need to finish. I’ve also neglected my blog. I plan to remedy that.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}