{"fingerprint": "QUY44SC9jKujJMBf1oVQRDeevds=", "sitename": "Clarkesworld Magazine", "title": "The Servant by Emily Devenport", "author": "Emily Devenport", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/devenport_08_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Servant by Emily Devenport", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14980 words, novelette\n The Servant\n ONE\n Lock 212\n My name is Oichi Angelis, and I am a worm. I exist in the outer skin of the Generation Ship Olympia, and I spend most of my time squeezing through its utility tunnels, doing work for the Executives. I am partially deaf, dumb, and blind. That I am not entirely so is my greatest secret. It is the reason I was able to kill Ryan Charmayne two hours after curfew, inside Lock 212.\n Don’t feel too bad for Ryan. He was there to commit murder, too. He thought he was going to bump off a rival who was using Lock 212 to rendezvous with a mole from his inner circle. The fact that Ryan didn’t know who the mole was prevented him from ordering someone else to do the killing, but it wasn’t the only reason he came in person. Ryan enjoyed the dirty work. He just couldn’t afford to stoop to it as often as he would like to, considering his lofty position in the House of Clans.\n Curfew doesn’t apply to Executives, so Ryan roamed at will. His brethren rarely had business in the tunnels where we wormy folk live; he felt sure no one would see him. He hardly seemed to mind that it was cold enough to make his breath condense into mist as he marched through the tangle of narrow corridors.\n The airlocks in Sector 200 are massive; they were built to accommodate cargo ships. They possess an odd, almost Gothic beauty because of their vaulted ceilings and curved outer doors. They’re the only wide-open spaces a worm can access on Olympia. Their grandeur inspires me.\n Airlocks inspired Ryan for a different reason. He had used them many times (sometimes secretly, sometimes with official approval) to kill people. Lock 212 was a bit too grand for his purpose—after all, you just needed something big enough to spit someone into the airless void—but it had the advantage of being isolated. Olympia hadn’t received a cargo ship in over two centuries, so Executives had no reason to come here. And it wasn’t the sort of place they liked to slum. So he had the place to himself.\n He slowed his pace when he saw the inner door. It was open, which is against regulations. If the outer door suffered a catastrophic breach, depressurization would occur until the emergency doors spun shut. They shut within ten seconds, but that was all it would take to suck a bunch of people and equipment out the door. Ryan didn’t give a damn about the potential loss of life, but if there’s one thing that will piss an Executive off, it’s a broken rule. Disapproval was clear on his face, until it gave way to curiosity. After all, he had two goals: to kill the rival and to find out who the mole was. They must be somewhere inside, plotting, and that must also be why they had left the door open.\n I wondered why he didn’t smell the blood. I smelled it from my position. I’m a Servant, and the Executives believe that they control everything I see and hear. All worms share this modification, it’s implanted into our brains. But for some reason, they never thought to control what I smell, taste, or feel. I would have been able to smell the blood even before I entered the lock, but he didn’t react until he saw his rival’s body.\n He looked surprised. Then his mask of Executive serenity slipped back into place. I’m guessing that he wondered if the mole wasn’t working both sides—maybe the traitor had decided to stick with him after all. But he couldn’t trust a guy like that; he needed to know who it was. He had hoped to find his rival and the mole together.\n And he had, though he didn’t know it yet. Because I was the mole. But I wanted him further inside the lock before I made my move.\n The lock was so huge, you could have fit several hundred people in there. Giant machines sat on claws and treads around the periphery, and cables hung from the ceiling. He paused and listened for a long moment. Unlike me, his hearing was normal. But in this case, that was his undoing, because I’m modified to be as silent as a statue.\n Finally he walked across the floor, the heels of his fine boots sparking echoes. He knelt beside the body of Percy O’Reilly, his former best friend and nemesis, and placed his finger on Percy’s throat. A casual observer may have thought he was feeling for a pulse. He was merely touching the blood. His expression revealed disappointment, not triumph. He wanted to have been the one who killed Percy, and to have enjoyed taunting him before he did it.\n He regarded the smear of blood on his finger. He might have tasted it, but I didn’t give him the chance. I closed the inner door.\n Ryan jumped. He made a half-hearted attempt to run to it, but gave it up as futile. Anyone else would have run to it anyway. They would have tried to work the controls to get it to open again. But Ryan had played that game with his own victims. He knew the door wouldn’t open for him.\n I would have run for one of the utility lockers. They’re full of pressure suits, and we worms make sure their air tanks are full. The outer door takes sixty seconds to respond to an order to open, and he could have made it to the lockers by then. He could have shut himself inside one of them, or in one of the machine cockpits. But I know that because I’m a worker.\n Ryan could only think like an Executive. “You’re messing with the wrong man,” he barked as he turned in a circle, searching for his hidden enemy. Then he heard me descending from the cables, and he looked up.\n The anger in his face gave way to wonder. I was plugged into Medusa, and I’m sure he had never seen anything like her before. No one is supposed to know how to activate her, and no one is supposed to have the plug-ins for the brain interface.\n I knew. I had slipped inside her space suit and had her tentacles stretching and flexing as if they were made of flesh instead of bio-metal. I hovered over Ryan until my Medusa-mask was inches from his face. What I saw through her eyes was far more than what I could have seen with my own orbs. What I heard through her ears was the wild beating of his heart.\n “Who are you?” he asked.\n I didn’t answer, though I did have things I wanted to say to him.\n “I think I need to offer you a job,” he said. “I’ll make it worth your while. I could use someone with your talent.”\n That was nonsense, of course. Ryan’s Grandmother, Lady Sheba Charmayne, had written the Right To Work Rules. Only the Executive clans were rewarded for their work. Everyone else worked for just enough food to survive, just enough heat not to freeze.\n I activated my voice. It was a voice Ryan knew well, because it was his favorite.\n When I serve the Executives, they don’t control what I say, but when I’m in their presence they control what voice I use. They can make me sound any way they want. They have a variety of voices from which to choose. The one Ryan likes best is the Magic Kingdom voice. It is remarkably cheerful.\n “You must be that new girl from Shantytown,” I said.\n He frowned. I think he felt insulted because he thought I was calling him a girl. I was disappointed that he didn’t recognize the very speech he had delivered to me the first cycle I worked as a Servant. Granted, he had said it to me ten years ago and a lot had happened since then. But I had hoped he would recognize the derogatory term Shantytown. It was the name he and his fellow Executives had used for Olympia’s sister vessel, Titania. Titania had once been as grand and glorious as Olympia, until Ryan’s father, Baylor Charmayne, pirated as many of her supplies as he could get his hands on—and then blew her up with two hundred thousand people aboard.\n My parents were among the people who died on Titania. I wasn’t there, because I had come to Olympia to work as a Servant. I was attractive enough to please their eyes, and I was willing to undergo the modifications. I had hoped to earn enough credits to move my parents to Olympia.\n That first cycle as a Servant, I stood behind the banquet tables in the home of Baylor Charmayne and reacted instantly and smoothly to the needs of his uber-privileged guests. My face was deadened so I couldn’t show any expression. That’s so I wouldn’t offend them or make them uncomfortable by looking shocked, grieved, angry, amused, or annoyed by anything they said or did while I served them. If we are serene and our voices are pleasant, they can concentrate on the very important work they do. They can relax during their leisure time and forget about the multitude of responsibilities with which they are burdened.\n Ryan behaved himself while his clan elders were watching, but he cornered me in a service tunnel when my work cycle was over. He believed himself to be handsome, because he was tall and athletic, and he had thick, black hair. But his charm did not persuade me, so he was forced to pin me against the wall. He couldn’t grope me, because my uniform was too stiff, the material too thick. So he bit my lip until it bled.\n While a doctor was patching my lip, I used one of my secret modifications to link into the communication network and call my parents on Titania. That’s when I found out Titania wasn’t there anymore.\n Ten years later, I held Ryan in my tentacles among the shadows in Lock 212. I placed my gloved hands on either side of his face. It must have felt like a caress—the gloves are supple, though they can withstand void conditions. “How about a kiss, little Shantytown girl?” I said with my Magic Kingdom voice. “You’re not going to say no, are you? Shantytown girls who say no can find themselves on the wrong side of an airlock.”\n There was a glimmer of understanding in his eyes. He might not remember that those were the exact words he had once said to me—it was one incident in a lifetime of fun he had enjoyed at the expense of people who couldn’t fight back. But he wasn’t stupid. When I said Shantytown girl, I gave him a clue about my status in life. He seemed hopeful he could use it against me.\n “You’ll pay for this,” he said. But I guessed he was talking about what I had already done. He still hadn’t realized what I was going to do. Not until the alarm for the outer door sounded.\n I held him tight—I didn’t want him to fly out the door. Medusa’s tentacles locked us both in place as the air rushed past us, taking Percy O’Reilly with it.\n Death by exposure to void takes longer than you might think. But he didn’t struggle that much. The light of Hella Major poured into the airlock, lending the scene a sacred quality. To me, it was sacred. Those grand airlocks were the only places where I felt the presence of God. I wondered if Ryan felt Him, too.\n When it was done, I took Ryan’s body to the open door. With my modified vision I could gaze directly at Hella Major. Unfortunately, that sun was between Olympia and its binary partner, but it was still a glorious sight. I turned Ryan to face the light, and gave him a big push. He and Olympia were going the same speed, but their paths diverged as Olympia continued her journey to the distant star toward whose system we are faithfully bound.\n He must be floating there still.\n I no longer have my natural eyes, so I generate few tears. But I shed one as I closed the outer door and took Medusa back to her lair. It wasn’t out of pity for Ryan, but I couldn’t say it was for joy, either. I think it may have been for the sheer terror and beauty of what I had seen—and done. The music that played in my head then was Ralph Vaughan Williams’ Fantasia on a Theme of Thomas Tallis, a piece that I’m sure Ryan never heard. My father was the chief advocate for the preservation of classical music from our past, and my father failed in that mission, even before he died.\n Or he seemed to fail. Because when I emigrated to Olympia I brought more than my toothbrush. I brought data entrusted to me by my parents. That data is the reason Ryan Charmayne had to die.\n Perhaps you thought I killed him for revenge? Not at all. Ryan died because he was planning to introduce a bill to shoot down Lady Charmayne’s Music In Education Initiative. Music was a tool of discipline, not inspiration, according to Ryan. He wanted to make the point that his father, Baylor Charmayne, was a wimp who was afraid to defy a mother who was long dead.\n He had never heard a note of that music. But that didn’t matter to him—or to me. His stupid bill mattered. That bill died with him, and Lady Charmayne’s (posthumously stated) will prevailed.\n I returned to my duties as a servant, attending Baylor Charmayne and his cronies. I was there when he learned that his son had disappeared. He eyed Clan O’Reilly, and they returned the favor. The Executives have very good reasons to suspect each other of murder and treachery. But no accusation was spoken out loud.\n Within ten rest/work cycles, Baylor rallied the house to pass the Music In Education Initiative, dedicating it to his son’s memory, and every child on Olympia was implanted with the vast library of classical and folk music that my father had so lovingly compiled and preserved.\n No one will ever know that my father did so. Everyone will believe Lady Charmayne designed the music education program, even though that idea never would have crossed her mind. She knew nothing about music. Her true ambitions were utterly heartless.\n She was the chief architect of our misery. But if I have my way, no one will remember her that way.\n No one will know what she was really planning.\n TWO\n The Girl From Shantytown\n “We felt soil and grass beneath our feet,” my father told me. “Can you imagine the mud squishing between your toes?”\n “No,” I said. “I never squished anything.” I had never seen the habitat sectors inside Olympia and Titania, but my parents pined for them. I was five, and my father spoke of the habitat sectors the way other parents speak of the wondrous lands in fairy tales.\n “Flowers and fruits and vegetables grow there,” he said. “Grain and nuts and sweet grasses. The air smells of green things. Far, far above you, clouds float in the center, and sometimes rain falls from them.”\n I knew what he meant, because I had seen images of rain. Also of snow, lightning, and tornados, though none of those happened on the Generation Ships. The ships were big enough inside to create light rain showers, but that was all. Crops were watered by irrigation, and the water was recycled. My father had worked in those gardens when he was younger, but robots did that work now. He was no longer allowed inside the habitat sectors. As a scientist, he was restricted to the tech sector.\n “Think of The Enchanted Lake.” His eyes shone. “Hear it inside your head. The images you see will show you the beauty of nature.”\n I didn’t have to search my memory for the music by Anatol Liadov. Father had implanted the music database in my brain when I was four. He broke the law when he did this, but his crime was unsuspected. My modification was one my father believed all children should have. His proposal had been shot down. The Executives thought it was foolish and pointless—they could not imagine why he wanted to do such a thing. So they didn’t suspect that he already had.\n My mother enfolded me in her arms. The images that came with the music were her contribution. They were from our home world: rain and lightning, waves on the shore, underground pools, tall grass waving in the wind—vids, photographs, drawings, paintings, tapestries, sculptures depicting scenes of a living world in all its aspects. The three of us snuggled in our cramped little burrow, seeing those scenes and hearing our music. It allowed us to hope, and dream, and imagine, while our fellow worms slept and plotted to survive another cycle.\n When I was eleven, my father tried to enroll me in the science program, and they refused me. It was the first time I ever saw him angry. But his voice stayed reasonable as he spoke with the official at the enrollment desk. “My daughter tested in the top two percent.”\n The official didn’t smirk, but I could tell she was enjoying herself. “The class is full,” she said. “They had to cut back, you know that. We’re in emergency mode.”\n My father’s hand tightened around mine. “She will have to work in the manual labor force if she doesn’t enter this class.”\n “Good thing she’s so smart,” said the official. “I’m sure she’ll find a way to rise above it all.”\n My father’s face was the color of coffee-with-cream, but it darkened to purple then. I was astounded at the amount of rage and despair that simmered in his eyes. The official should have melted on the spot.\n Instead, she seemed to feed on his anger. She pointed toward the bored security officer slouching near the door. “At the end of that corridor there’s an access hall that leads to Lock 17. You have two choices, citizen. You can walk your brat out of here and get back to work, or you can take your complaint to the wrong side of Lock 17. Got it?”\n She seemed to hope that he didn’t get it.\n My father turned and escorted me out of the room. His hand still held mine too tightly, but he took small steps so I could keep up with him. We walked down corridors that became narrower, but when we arrived at the junction that would lead me back to the children’s school/work sector, he chose another direction. His hand relaxed, and I could tell he had a plan.\n Executives have always said that the Generation Ships are overpopulated, but you couldn’t tell that if you judged by how many people you encounter in the tunnels. Sometimes you can walk for hours without encountering anyone. We were alone, but my father didn’t speak until he ushered me into a small room that looked like a doctor’s office. He helped me onto an examining table and put his hands on my shoulders. “Oichi, never act unless you have thought, first.”\n “Okay,” I promised, not yet realizing that he had given me the advice by which I would conduct the rest of my life.\n “I am not surprised by what the official had to say,” he continued. “Your mother and I worried this could happen, and we have a backup plan.”\n I gazed into his face. I thought my father was the handsomest man alive, but I worried about the white hairs on his head that seemed to be chasing away the black. My father was twenty years older than my mother, and he was beginning to look it.\n “Oichi, the database we placed in your head is different from the modifications that most other people have. Less than twenty of us have them. They were to be the new generation of brain enhancements, but our program was cut. We implanted them in each other, because we knew they might give us an advantage. This is your gift from us—and it is your greatest secret. You must never speak of it to anyone, not even to your mother and me—not even over what you assume to be a private link.”\n “I won’t.”\n “Good,” he said. “Because I’m about to break the law again. I’m going to give you more.”\n Two hours later, I felt my mother’s hands on my face. I lay in our tiny quarters, and she was toweling my hair dry after washing the blood from it. I didn’t try to open my eyes, I felt content to drift in the new inner space my father had implanted in my brain.\n There was nothing hazy about that space. But despite that clarity, I can never conjure my mother’s face in my memory. I remember that my mother had skin the color of honey and hair that was blacker than the void. But what I remember the most clearly about her is her voice.\n She finished her toweling and arranged my clean hair on the pillow. “Oichi, an ancient philosopher named Marshall McLuhan once said that the medium is the message. It doesn’t matter how elegant, or practical, or brilliant, or fair an idea may be. It will be ignored if it comes from the worms, or the asteroid miners, or the scientists, or even the mid-level Executives. It does no good to preach to the choir. For the powerful ones to change the laws, they have to believe that those changes are the result of their own intelligence. Their pride will stand nothing less.”\n I felt her lips on each of my hands, and then on my brow. Her voice was so beautiful, I’m surprised the Executives didn’t include it in their library of pleasant voices.\n “From now on,” she said, “you will learn everything you can from school, and even at work. Then you will come home, and your father and I will teach you everything we know.”\n What she didn’t say was that everything they taught me would stimulate what was now in my head to make other connections for intelligence and survival. One day I would be a conduit for the preservation of culture in a new, humanistic society. But if that were to happen we could never speak of that again, we could never even hint at it.\n “This cycle, you need to rest.” Mother kissed me again. “A new work cycle begins in twelve hours.”\n She and father spoke quietly to each other, and a little later they made sure I sipped some nutrient broth. I amused myself with my music library, starting with Gustav Holst’s Planets suite, then wandering on to orchestral performances of Claude Debussy’s Nocturnes. The images that accompanied the music ranged from majestic to whimsical, but all of them were beautiful, and I enjoyed myself immensely.\n Eventually I fell asleep, but I don’t think I slept very long. When I woke, the lights had been dialed down to night mode, and my parents were tucked away in their own cubby. I tried to decide on another music selection, but my mind kept wandering back to the official who had told us there was no room in the science program for another student.\n My father scoffed at this notion. “They always claim there is not enough. Not enough food, though we have plenty. Not enough fuel, though we mine it as we go. Not enough heat, not enough light. Not enough room in the habitat sectors—for anyone but the Executives. But the space on the inside edge of the Generation Ships is immense; it could accommodate all of us.”\n “Then why don’t they share?”\n “Because,” said my father, “nothing is valuable unless it seems to be scarce.”\n I lay in my cubby and wondered about the grass under the feet of the Executives, the mud they squished between their toes, and a notion occurred to me. My new modifications allowed me access to more than just information. They allowed me access to an extensive communications network as well. I thought there must be monitors inside the habitat sectors. I wondered if I might have a peek at what my father had loved so dearly. I pictured the general directory, then selected sub-directories.\n The directory was far more complex and detailed than anything I had known before. What delighted me about it was that it didn’t just provide links for individuals, it also provided them for systems—for instance, the maintenance system might contact a repair drone and order it to perform a task.\n Even more intriguing, it showed me links that were currently in use. I dove deeper into the directories, until I saw something that surprised me. I saw a link in use between two people: S. Charmayne and B. Charmayne.\n Even at my age, I knew who Lady Sheba was. My mother privately called her The Iron Fist, which did not make her sound like a nice lady. Without planning to invade anything, I touched that highlighted link between S. and B., hoping it might tell me who they were.\n < . . . not enough room in the lifeboat.> I heard the woman’s voice as if she were speaking right into my ear. This was because I was accessing the link with my implants, and the parts of my brain that processed language and hearing were stimulated. The voices I heard were the voices the Charmaynes had chosen to represent them.\n I withdrew from the link, startled. Did she know I had eavesdropped? Was it really the Lady Charmayne? Would she blow me out Lock 17 if she knew it was me?\n But father had said nobody knew about my special modifications. That must mean they couldn’t know, unless I told them. So I touched the link again.\n < . . . always use that metaphor,> said a man’s voice. <Can’t you find a new one? It’s getting old.>\n <It’s not a metaphor, you idiot, it’s the truth. If we don’t control the piggies, they’ll overrun us. We didn’t make all these sacrifices and come all this way just so our inferiors could outvote us and ruin everything. Put your damned boot on their necks and keep it there, Baylor. Do you hear me?>\n The man sighed. <Yes, Mother.>\n They talked in that vein for quite a while, and I got bored with them. So I dropped the link and searched for anything that might give me a look at the habitat sectors, but the closest I got was a doorway leading from a supply room on the inside edge of Titania’s skin. The door was open, and I could see light filtered through green things. I saw a spot of color too, from a patch of flowers. It was pleasant, downright charming, but try as I might, I couldn’t get on the other side of the door to gaze at the big picture. My father had said that there was a horizon, and it curved up, and if you looked straight up through the thin clouds you could see the other side of the habitat far above you. But there were no pictures of that in my head, and there seemed to be none anywhere else either. It was as if the Executives didn’t want us to know what it looked like.\n Why not? I wondered.\n S. and B. might give me a clue, if I listened to them long enough. They might put me to sleep with their conversation, but maybe I could learn something if I was patient. I checked the link—it was still in use. So I touched it again, and I did learn something.\n <Enough of this beating around the bush,> said Sheba Charmayne. <How do we kill them before they figure out what we’re up to?>\n THREE\n Gamelan, My Little Doggie . . .\n The smell of rain is an astounding thing. If you live inside the arid skin of Olympia you may smell machines, blood, human sweat, that sort of thing. But the smell of rain is unlike anything you could imagine. Yet even if you’ve never smelled it before, you will know what it is.\n I stood in the rain of the habitat sector, waiting to serve the Executives at Baylor Charmayne’s garden party. They stood in the same rain. Precipitation on Olympia was so fine, it fell as a mist. Our clothing couldn’t absorb it; a Servant’s mantle covered our heads.\n Some of the Executives wore their own version of mantles, but most of them let their hair get wet. They found the discomfort amusing, because they endured it so rarely and could end it at any time.\n This was near the end of my first year on the job, and I watched this behavior because I found it odd. I also took note of the moisture on my face, the pretty colors of the fresh vegetables, and the handsome face of Nuruddin, who was one of my coworkers. In his Servant’s mantle he looked like an Egyptian king. But ancient art was not studied on Olympia at that time, so I was one of the few people who noticed that.\n Despite these distractions, I remained focused on my duties. The Executives require Servants to respond to their slightest cue, to be at hand with whatever is required in an instant, whether that be a napkin, a dish, a refill of a beverage, or any one of a thousand other details. We must move silently, unobtrusively, and efficiently. Those of us who can’t don’t make it out of training.\n My father wasn’t happy when I told him my ambitions, though he did understand them. No tech training had materialized for me on Titania, and we hoped that Olympia might provide more opportunities for me, since I was sixteen and still trainable. But extensive modification is needed to become a servant, and my forbidden implants could have been discovered at any time during that process. My father had to pull a lot of strings to make sure the right med-techs were on duty the cycles I went in for modification.\n I had passed through it easily, and I moved to Olympia. I had goals, both short-term and long-term. First, I wanted to move my parents to Olympia. But I didn’t do it soon enough.\n Baylor Charmayne sat at the head of the table. He still talked about his mother, which is sad when you consider all the people who had to die on Titania just so he could become the head of his clan. Sometimes he cried when he talked about her, though he wasn’t doing it tonight. He was in a fair mood, which is as good as it got with Baylor. He, the food, the table, and his guests were all visible. But I could not see the plants that I could smell. I could not hear the rain falling.\n We, his servants, are beautiful. The Executives will tolerate nothing less. They are not as attractive as we, but they don’t know it. They seem enthralled with each other, and they never tire of arguing law—not even at this supper—or of playing at politics. That’s why the Tedd clan sent a representative to this supper, a cocky young upstart named Glen Tedd.\n “A toast!” cried Tedd, which was our cue to fill their glasses. We performed like clockwork, so they barely noticed us.\n “To Sheba Charmayne! Now there was a tough negotiator. We’ll never see her like again. We Tedds thank God for that.” He grinned. “We’ve done very well since her untimely demise.”\n All eyes shifted to Baylor, who didn’t seem inclined to sip his drink.\n “Convenient that her escape shuttle was destroyed before she could use it.” Tedd winked at Baylor. “Otherwise, she would be sitting at the head of this table.”\n Baylor had no obvious reaction, but his gaze flicked to Ryan, who wasn’t as good at schooling his expression. Tedd was going to die for saying aloud what everyone suspected. I wondered who else knew it. Ryan did, because it was his favorite sport. But I don’t think Tedd did. I think he believed his clan was too powerful to suffer those sorts of consequences. He drank his wine, and demanded more. The party continued its dreary pace.\n When the food and wine had been cleared from the table, Baylor and his guests moved inside, leaving us to stand at our posts. A group of lower-level Executives came into the garden. They were all clan members, but they had only slightly more status than the bureaucrats working in Titania’s skin. I recognized one of them, Terry Charmayne. I had seen him at our staging center many times, though I had never spoken to him.\n I could tell that some of these less-favored clansmen resented the fact that they weren’t invited to the fancy dinner, but I couldn’t tell whether Terry felt that way. They stood for quite a long while before Terry decided they should move out of the rain and onto one of the covered patios not being used by the elite. They left us alone.\n We stood patiently. All of us were experts at waiting. To entertain myself, I played Gamelan music in my head: slow, courtly pieces for orchestras of gongs and cymbals. It seemed to fit the scene, and I found it entertaining. But as the minutes slipped by, and no one dismissed us, an idea began to form in my head. Those flowers I had always longed to see were just a few feet away. I still couldn’t see them, but I could smell them.\n I took a slow step toward them. No one reacted. I took another. Altogether, it was four steps until I was no longer standing on the paving.\n I knelt and reached blindly. My hands encountered something soft and fuzzy. I explored further and found the ground—the fuzzy things were growing out of the soil, so this was a plant I was touching. It was not at all what I expected a plant to feel like, with big, soft lobes and a central stalk that had clusters of other fuzzy things near the top.\n I leaned over and smelled the stalk. It wasn’t perfumed like the flowers in Baylor Charmayne’s vases, but the aroma was pleasant.\n Someone kicked me in the butt, not hard enough to hurt me, but firmly enough to get my attention. I looked over my shoulder and saw Terry Charmayne. “What do you think you’re doing?” he asked. “If someone sees you doing that, you could get terminated.”\n Terminated was an interesting term. I had a feeling he didn’t just mean fired. Yet his tone was not unkind.\n “Don’t get curious,” he said. “Just do your job and you’ll be all right.”\n I stood and let my hands fall passively. “Yes sir,” I said in the Girl Friday voice.\n One side of his mouth quirked in a sort-of smile. “Come on. I’ll escort you to the security lock. You may as well call it a day.”\n He led the way, so we all fell in behind him. I was able to study him more closely as we walked along. His clothing wasn’t that fancy, and the superiority was almost completely absent from his demeanor. He was a mid-level Executive from a powerful family, yet he acted more like a Ship Officer. He saw us to the lock, waiting until he was sure we were safely through, then gave me a brisk, “Pleasant rest.”\n “Yes, sir.” I didn’t look back. Instead, I searched the networks for the footprints of Terry Charmayne. He might be useful, some day.\n The other servants walked quickly, eager to be done with their day and reclaim what they could of their senses. But Nuruddin slowed his pace until he was walking beside me. “What did it smell like?” he rasped in what was left of his real voice.\n I had to think for a moment. “It smelled—green.”\n “Like tea?”\n “Very much, yes, but—stronger than that. It was pungent. It was a living thing.”\n “Is that why you risked so much to smell it?”\n “Yes.”\n Nuruddin was silent for a long moment. Then he said, “You are braver than I, Oichi. But you are no more curious.”\n We kept pace with each other in companionable silence, until the others had disappeared. I hope Nuruddin was enjoying my company, but for my part, I was pondering the wisdom of asking him questions. Questioning someone can be an adequate method of gathering information, but they may ask you questions in return. Nuruddin had already warned me of his curiosity.\n Before I could reach a conclusion, someone pulled the plug on our senses.\n I could see nothing but white void. My hearing was gone too, without even the ringing noise that accompanies natural silence. I probed for a surveillance camera and linked with it. Nuruddin and I stood in the tunnel with two Executive boys who could not be more than twelve years old. They had eliminated themselves from our audio and visual feeds so we wouldn’t know they were there. I hadn’t smelled them at first because the ventilation had blown their scent away from us, but now that they were close, my nose detected a chemical undertone in their sweat that raised the hair on the back of my neck. They both held knives, and they grinned at Nuruddin, nudging each other as if to say, I dare you to do it . . .\n Nuruddin’s face was calm, but I could see concern trying to surface through the strict muscle controls that we Servants must endure to keep our demeanors serene. He must be wondering why our senses were being blocked. I doubted he would guess the truth until he felt the first slice. I would have to take him to the hospital once they let us go.\n “I’m going to cut his lips off.” The boy giggled. “And then I’m going to cut his nose off.”\n So no. Nuruddin would not be able to recover from this assault with some minor medical attention. I would have to intervene.\n The order would have to originate from someplace outside the normal grid. I searched desperately, my mind racing along the network.\n And suddenly I found an unknown pathway. I triggered the alarm.\n Our hearing and eyesight returned as the klaxons sounded. “ATTENTION,” warned a gigantic voice, “EXPLOSIVE DECOMPRESSION IS IMMINENT. ALL PERSONNEL MUST EVACUATE TUNNEL H17 IMMEDIATELY. REPEAT . . . ”\n The two boys jumped as if they had received electric shocks when they lost control of our sensory feed. They forgot they were Executives facing Servants, and they raced away—though not before Nuruddin saw the knives they were brandishing. As soon as they were gone, the alarm cut off, along with the warning voice.\n Nuruddin stared at me, his face stiff with shock. “Explosive decompression?” he croaked. “Is that even possible, this far in?”\n I shrugged. “I guess it would be if something catastrophic happened.”\n “Like what?”\n “I don’t want to imagine it. Anyway, it seems to have been a glitch.”\n “In the future,” he said, “I guess we’d better stick with the others so we’re not in here alone.”\n I nodded, and the two of us hurried down the final stretch of corridor to our staging area.\n Servants are not allowed to socialize when we’re off duty. I went back to my quarters without seeing or speaking to a soul. I bathed, sipped nutrient broth, and bundled myself into my cubby. I had hoped to listen to more Gamelan music, but I couldn’t stop thinking about the remark Glen Tedd had made at supper.\n Convenient that her escape shuttle was destroyed before she could use it.\n Sheba Charmayne didn’t make it off Titania. But like everyone else, I had assumed that disaster overtook her before she could board her escape shuttle. I never knew it had been sabotaged before she could get into it.\n True, I knew she and Baylor hated worms. When Titania was destroyed, I suspected them. I had even overheard some of their plotting, through my secret link. But I was still a child then, and what they had said at the time didn’t make much sense to me. So instead of trying to figure it out, I recorded it.\n I still had the recording. I had never replayed it, because I never heard them overtly say they were going to blow Titania up. What was it they had said?\n How do we kill them before they figure out what we’re up to? Sheba had asked. That was what got me to start listening.\n But Baylor’s answer didn’t make sense. Couldn’t we just dismantle them? Use their components for something useful?\n Dismantle? I thought. Components? It sounded like they were talking about machines. But why would you talk about killing machines?\n They’re too complex for that, said Sheba, managing to sound impatient, even though she wasn’t using her throat to speak. Too sophisticated. They have a self-defense component, and they would suspect what we were up to. No—if we want to destroy them, they can’t appear to be our main targets. They can’t appear to be our targets at all.\n Back then, this was the point in their conversation when I began to lose interest. Their discussions had turned to inventories of supplies, energy consumption and production, that sort of thing. But now I realized they were talking about Titania’s statistics in a particular sort of way, as if they were debating whether they could afford to sacrifice her, even though they never specifically said they were going to do that. These stats were incomplete, too, as if they had discussed them before, and no longer had the patience to go over them in detail. Amazingly, I almost lost interest again, almost stopped listening.\n But then Sheba said . . . their pathway is not part of the known network . . .\n When I triggered the alarm that saved Nuruddin, I had discovered a pathway outside the normal network. Now I had time to explore it and figure out what it was. I reached for it again, but it wasn’t the same this time. A new link had appeared on it.\n The link had no name. I touched it anyway.\n <Awake,> said a voice in my head. <Orders?>\n I was flummoxed. I hadn’t rung the link, I had simply touched it—and now someone was talking to me.\n <Orders?> repeated the voice, with relentless patience.\n I tried to disengage from the link, but I couldn’t. I felt alarmed. I couldn’t just struggle, I needed to take action.\n <Who are you?> I asked.\n <Medusa,> came the reply.\n The voice did not sound like any human voice I had ever heard, either inside or outside of my head. It was unique. <Where are you?> I asked.\n <Lucifer Tower.>\n That sent a chill up my spine. Lucifer Tower was not a pressurized habitat, it was in the mysterious Sensor Array, at the leading edge of Olympia. Tech personnel no longer visited Lucifer Tower; it had its own repair drones. Yet something dwelled there, something with a voice that was almost machine-like—but not quite.\n <I would like to meet you,> I said. It wasn’t as impulsive a remark as it may seem.\n Medusa touched me through the link. No one had ever been able to do that before. The secret part of my brain was stimulated, and I saw a face. The face was too perfect to be mortal.\n <Oichi,> said the face. <Your parents are dead. Titania is gone.>\n <Destroyed by Baylor and Sheba Charmayne.>\n <I shall honor your parents’ wishes, and yours. We will collaborate.>\n <How?>\n <I will come to you when the time is right.>\n I woke with a start. Had I fallen asleep and dreamed Medusa up?\n I looked for the link again. I couldn’t find it.\n Yet the pathway remained, and I traveled its length. Though it existed outside the known network, it could form links within that network at any juncture, then dissolve the link when the user was finished with it.\n Medusa hid at the other end of that pathway. And she mentioned my parents. Had they known about her? How had she known about them? Was she one of the sophisticated machines Sheba and Baylor had talked about killing?\n Did they destroy Titania and kill two hundred thousand people—just to get rid of machines like her?\n I couldn’t shed a tear. My heart had become a burning coal. The anger didn’t blind me, it gave me ideas: about the secret link, my recordings of Sheba and Baylor, and my father’s music database. My plans were just beginning to take shape.\n But other people’s plans were about to get in the way.\n FOUR\n Medusa\n You cannot kill in a void (though on Olympia, you can sometimes use the void to kill). When you’re a killer, everyone around you is at risk, if not from your direct actions, then from the consequences of your actions. This is not a fact that most killers consider. But I do. I even considered it the very first time, perhaps because I didn’t set out to kill a target then. Instead, I was someone else’s target.\n Prior to that event, my playbook consisted of feeding misinformation to people in order to influence events. Rescuing Nuruddin with the decompression alarm was a classic example of that. It’s still my main tactic, but shortly after that incident, things took a turn for the violent. And as unplanned violence often does, it started out very normally. I simply went to work.\n I dressed in my Servant’s mantle and rode a tube in toward the habitat access tunnel. I was alone, which struck me as odd, but not impossible. It was rare for Servants to report individually; we were called up in groups, but sometimes you get called because you’re filling in for someone who’s sick. So I felt fine about it until the lift stopped, then reversed and took me out to the maintenance level. I hadn’t punched that coordinate. The door opened, and Glenn Tedd stood there.\n Glenn Tedd, who made the snide remarks to Baylor Charmayne about the Lady Sheba’s untimely demise.\n “You,” he snapped. “Follow me.”\n “Yes sir.” I was alarmed to discover that he had selected the Penitent voice for my responses. That alarm grew as I followed him into an access corridor for the Series 100 airlocks—the locks used most often for executions.\n My mind raced. I scanned communication records for any indication of what he might be planning, and found nothing that jumped out at me. I had never served Glenn Tedd alone before, but he had a reputation for being furious one moment and weeping the next. He had never apologized to any of my fellow Servants when he got into the weepy state; in fact that was the time when he expected Servants to apologize to him.\n That’s why he’s crying, Nuruddin told me once. Out of frustration, like a small child.\n Based on Glenn Tedd’s reputation, he could get worked up about something minor, so an abject apology might be all he expected of me. But our journey into the realm of airlocks kept me on high alert. No one used those locks except for maintenance workers and Executives who wanted to kill someone—and neither of us was a maintenance worker.\n He stopped short in front of Lock 113 and turned to face me. “Stand here.” He pointed at the floor, as if I were the most dense person he had ever met. I obeyed him, since we were still outside the airlock. But then he opened the inner door. “Get in.”\n I didn’t move.\n His mood had not been good to start with. When I ignored his order, it got a lot worse. “You heard me! Get in!”\n I plan everything before I act. I knew I had to kill him then. But I couldn’t do it with my bare hands, and I wasn’t sure I could scrub the event from the security monitors in time to prevent consequences if I just tossed him into the lock.\n He snorted in disgust and marched into the lock, leaving me even more flummoxed. He wrenched open a suit locker and pointed inside. “Look at this!” he said.\n He couldn’t very well blow me out of there if he was inside. So I stepped through the inner lock and joined him at the locker. I saw what he was trying to show me. All air tanks on the suits in the lockers are supposed to be near 100%. The indicators on the suits I could see were just below 30%.\n “Explain this!” he demanded.\n I felt mystified. I’m not a maintenance worker, so I’m not in charge of keeping the suits up to snuff—at least, as far as anyone knows. In fact, I have poked around quite a lot in the air locks, and I always check the air levels in the suits first thing, out of sheer paranoia. It’s a safety rule my father taught me. But Glenn Tedd should not have known that. Had I been exposed?\n “Maintenance didn’t fill the tanks properly,” I offered.\n “That’s right!” he grinned like a shark. “And you’re my Servant. So what are you going to do about it?”\n For the life of me, I couldn’t fathom why Glenn Tedd had a bug up his butt about the air tank levels on the suits in this particular locker, or why it gave him satisfaction to address the problem in such a circuitous fashion.\n “You know who told me about this?” he asked, as if reading my mind. “You know who just had to rub my face in the shoddy way this sector, which is under my jurisdiction is being run?”\n “Ryan Charmayne?”\n That was a tactical error. I was right about who it was, but his question had been rhetorical; he hadn’t expected me to know the answer. I had just revealed to this nasty little man that a Servant was paying attention to politics at the parties of Executives. But that wasn’t the biggest problem, because I had just realized something else. Glenn Tedd had mortally insulted the Charmayne family at the last Executive party, and Ryan Charmayne’s favorite method of murdering rivals was to . . .\n “The lock!” The Penitent voice made my cry sound downright mournful. But the warning came too late. The inner lock spun shut.\n “Hey!” Glenn threw himself at the door. “Open that door! Do you know who I am?”\n I didn’t waste my time calling him an idiot. I tore off my Servant’s mantle, and at the same moment all of my sensory feeds went dead. I wasn’t surprised by that development—after all, we were in full disaster mode, with everything that could go wrong absolutely doing so, and things were about to get a lot worse. I used the surveillance feed in the lock to find a pressure suit. I knew I had less than a minute.\n Back in the infancy of space travel, space suits had taken up to four hours to put on. We had one of those on display in our history museum, along with a checklist of the protocols that had to be observed before Ground Control would let an astronaut out for a space walk. Our suits were vastly more streamlined, and began the pressurization process as soon as you sealed them. Maintenance workers usually got them on in five minutes.\n But paranoia had ruled my life for as long as I could remember, and that’s what saved me, because I had practiced getting the suits on quickly. My best time so far had been just under a minute. But this time, my hands shook. I fumbled things I had done smoothly during practice.\n The suit’s automatic systems signaled green when I sealed it. I hooked my safety cable to a ring next to the outer door. I had just let go of the clip and was reaching for the rung that would prevent me from being blown out of the lock along with the atmosphere when the outer door spun open—before I could grab it, I exploded out of there. As I reached the end of the cable fastened above my navel, I flipped around to face the ship, and Glenn Tedd collided with my right shoulder. I had only half a second to see his contorted face with my helmet cam, but I could tell he was sorry he hadn’t done what I had done. He was suit-less and cable-less as he drifted away from the ship, going from 1atm of pressure to 0atm with unhappy consequences.\n But I had no time to watch his last struggles. His collision with me had knocked me out of alignment with the door. I moved in an arc at the end of my tether, toward Olympia’s massive hull. I could see the tether stretching through the opening, and I very much wanted to switch on the motor that would reel me back in. But I was afraid it would fray as it rubbed against the edges of the lock. My fears were probably irrational, but I congratulate myself for trying to think at all under the circumstances.\n Olympia’s hull is not a smooth terrain. It bristles with ladders, safety rungs, valves, and other equipment, especially around the maintenance locks. As I sailed toward those protrusions, I stretched my hands out, eager to connect. The seconds flashed by. I struck the side of a ladder and held on for dear life.\n The other end of my cable sailed past me, its end cut cleanly.\n I looked for the airlock, but couldn’t see it with my suit’s helmet cam. I felt lightheaded, and realized I was breathing too fast.\n Little sips, warned a calm voice from the back of my mind.\n Little sips my ass! I screamed back at it.\n But I tried to calm down. When I had managed to slow my breathing a little, I realized my senses had all come back. It was as if the program that had controlled them had already been deleted. As if I had been as much a target of this murder as Glenn Tedd. And that presented me with a real conundrum. I had planned to wait a half hour or so, and then open the outer lock and go back inside. I figured whoever had killed Glenn would be gone by then.\n What if they were waiting for me? What if they had seen me put on the suit and knew I was out here?\n I checked my air supply. These suits were designed for short-term use, which translated to eight hours of air with a full tank. But this unit was down to 27% capacity. So I had about two hours, which might be plenty if I wanted to get into one of the locks in this sector. But if I needed to get to another sector, I might not have time.\n Out of curiosity, I opened a link and looked at the operating systems for the Series 100 locks.\n Off Line was the status. Estimated duration of denial of service, 24 hours.\n Someone wasn’t taking any chances.\n I thought about going around the order and getting one of the locks to open manually, but I couldn’t figure out a way to do that on the 100-series locks without creating an alert. If I could get to the 200-series sector, I might be able to get one open, for the simple reason that those locks weren’t used regularly, and no one paid any attention to them. They were too big for executions. But I’d have to get there first, and it was three miles away.\n Olympia is a Galaxy-Class Generation Ship. What that means is that conceivably you could travel from one end of our galaxy to the other (if you had time and a heck of a lot of patience). It spins to simulate gravity, and the habitat sectors are so large, they have minor weather events in there. If you’re a worm like me, and spend most of your time walking or crawling through the miles of tunnels at or near the end of the spin arm, your universe is both small and limitless. It’s small because the space is confining, and limitless because you have no perspective about where it begins and ends.\n But the outside of the ship is a different story. It’s a landscape full of valleys, peaks, and plains, and its sky is full of dazzling stars. From my new perspective I could see the blazing heart of our galaxy. I could see the Andromeda Galaxy too, its spiral shape more apparent. The beauty and grandeur of this view was beginning to overtake my panic—and possibly to cloud my judgment, because I started to crawl toward the Series 200 sector. Lacking another plan, I decided I may as well go for it.\n I couldn’t see that sector from where I was; I relied on schematics that I accessed through my links. While I was at it, I did a little research about my current condition. I used the cameras in the tunnel outside Lock 113 and saw a guard posted at the inner door. I didn’t recognize him, but I recognized his military stance. Oddly, I felt comforted to see him there, because it validated my decision to venture into unknown territory and look for another way in.\n But a quick inspection of my pressure suit revealed another problem. My jet packs were even lower than my air tanks. And since Olympia was spinning, I feared I could end up in a spot without a proper handhold when it ran out. I would have to pull myself along and use the jets only when I had no other choice.\n That was probably going to take longer than I had. But I didn’t have a Plan B, so I stopped debating the point and aimed myself for the 200 Series locks, keeping my body close in and parallel to the ship. It was very slow going.\n One hour later, I checked my status. I was less than one third of the way to my destination.\n I wasn’t going to make it.\n So I stopped and took stock of my situation. A quick check of the guard in the maintenance hall revealed that he was still there. Worse—I had gone past the halfway point for my air supply, and the math did not look good for a return trip.\n Yet I felt calm. I regretted that I would never be able to share the gift my parents had given to me. But I didn’t regret this mode of death. The view of the outside of our generation ship was magnificent; it made me wonder why I had spent so much time wanting to see the inside of the ship. From my new vantage point, I could see the distant sensor array on one end and the colossal engines at the other. I only had to consider for a few seconds before I realized what music I should play in my head: Gustav Holst’s Saturn, the Bringer of Old Age. As I listened to the sound of that grim and majestic procession, The Milky Way and Andromeda galaxies wheeled overhead. I accessed a chart and identified more distant galaxies in the star field.\n Who ordered the hit? I suddenly thought to wonder. I poked around communication records, looking for messages that might be pertinent. While I was in there, a new pathway appeared—the same one I had used to trigger the alarm when Nuruddin had been in trouble. I recognized a link there.\n I touched the link. Medusa stirred. <What are you doing?> she said.\n <I’m dying.>\n <Where are you?>\n A schematic of Olympia’s exterior appeared in my mind’s eye. I found my spot on it and highlighted it for her.\n <Don’t move,> she said. <I’m coming to get you.>\n <I’ve got less than an hour of air left.>\n <That will be sufficient.>\n I wondered why that would be sufficient, but I didn’t question her. Instead, I used the secret pathway that had led me to Medusa to look for my name in security memos. It didn’t pop up, but I got a red flag for top-secret documents. When I wiggled my way around the security protocols, I still didn’t find my name. But I did find a name I recognized: Titania.\n The message was short. It said, Eliminate all immigrants from Titania, then erase their names from directories. It was signed B. Charmayne.\n Connected to that communication were two responses: So far have only located one immigrant, Servant Oichi Angelis. Will use Lock 113. It was unsigned. But a scan of the original directive revealed two recipients, P. Schnebly and R. Charmayne. So I thought the first response might have come from P. Schnebly. He might be the fellow standing guard in the tunnel.\n The second response sounded more like something Ryan Charmayne would say: I think I know how we might kill two birds with one stone.\n So, in a way, I was responsible for Glenn Tedd’s death. True, Ryan would have looked for other chances to kill him, but I had accidentally expedited the affair. When I searched for the status connected with both our names, Tedd’s read deceased. Mine didn’t, but I assumed P. Schnebly would update it once he had confirmed his kill by waiting for my air supply to run out.\n P. Schnebly had not discovered any more names of Titania immigrants yet. When I re-traced the inquiries connected with my profile, I could see it had not been easy for him, and that puzzled me. He had been forced to plod through each file individually. So it was a minor miracle (if one was inclined to look at it in that light) that he had found me at all.\n Yet when I searched for immigrants from Titania using the secret pathway, thirty-seven more names popped up. I scrubbed any mention of immigration and Titania from their records. I did this while still listening to Holst and gazing at the glorious man-made landscape and the stars, and within seventeen minutes I saw Medusa in person, for the first time.\n She used her tentacles to propel herself across Olympia’s hull. She seemed made for that sort of activity, though her body hung oddly limp. It wasn’t until she got closer that I realized the limp body was a pressure suit. Medusa was meant to be worn.\n She disengaged me from my handhold and enfolded me with a membrane that sealed and pressurized itself. Once that was complete, she removed my pressure suit and expelled it from the membrane in a way that seemed almost organic. The suit would drift away from Olympia in much the same way Glenn Tedd had.\n Throughout this process her beautiful face hovered before mine. She saw me with eyes that could stare into the heart of a sun without flinching.\n <Put me on,> she said.\n I slipped into her pressurized suit. It was unlike anything I had worn before—it seemed to feel me as I entered it. Once on, it felt like an extension of my own skin. Her face rotated and settled over mine.\n Inside my head, the implants my father had given me came completely awake, and I saw his face. <Oichi, if you’re seeing and hearing this, I am dead. You and Medusa have found each other. Now you shall learn the message behind the music. As wonderful as that music is, it’s not the true reason for your implants. This is the reason.>\n An image of Lucifer Tower appeared inside my head. The blueprints listed it as a research center within a sensor array—it was among the towers on the leading end of Olympia. It really was a research center, but no human had ever used it.\n No human.\n It was not currently pressurized and heated. But it wasn’t empty.\n <When the Executives realized what the Medusa units would do for people,> said my dead father, <they felt threatened. For most of our journey, they have controlled the message, and thusly the resources of these generation ships. They kept finding reasons to stall the introduction. When the project leaders disappeared, we realized the units, themselves, were at risk. So we moved them all to Titania. We knew what the Executives would try to do, once the units were all in one place. We knew we would have to make this sacrifice to keep them alive.>\n How do we kill them before they figure out what we’re up to? Sheba Charmayne had asked. “She wasn’t talking about the people on Titania,” I said aloud. “She was talking about you, Medusa.”\n <Yes.>\n <Who was supposed to interface with the Units?>\n <Eventually, everyone,> said Medusa. <The first ten thousand users will design units for the remaining population.>\n <What happens when we’re all linked together that way?>\n <Collaboration.>\n <Won’t we lose our individuality?>\n <We are not designed to have a hive mind.>\n <What are you designed for?>\n <Communication. Information can influence us, but we don’t have to agree with each other.>\n I saw it then, what my father and his collaborators had intended. <It would be easier for each of us to live up to our potential. We might not develop a meritocracy, but no one would be able to lie about why we don’t have one. I get it, now.> I sighed, drinking deeply of the air supply in Medusa’s reservoir. <I understand why they wanted to kill you. But I don’t understand why my father tried to make it easier for them to do so. Why did he do that? And how did you survive? How did you all make it to Olympia?>\n <It was simple,> she replied. <Baylor Charmayne moved us.>\n FIVE\n Vengeance Is Not Mine\n <Did I ever tell you what I assumed, all those years ago when you disappeared?> asked Nuruddin. <I thought they killed you because you touched their plants at that garden party.> His Medusa unit smiled with a face that was very much like his—that was why I picked it for him.\n <It was a logical deduction,> I said. <Who knows, maybe they would have killed me if they had found out what I did. But Terry Charmayne kept it to himself.>\n <Papa,> asked his young son, Ashur. <Can the Tentacle Lady hear me now?>\n Medusa smiled for me. Her expression can be surprisingly tender. <I can hear you.> I closed his skull with instruments extended from Medusa’s tentacles, and Nuruddin tugged his scalp back into place and glued it together so one could hardly tell it had been opened.\n <What music are you listening to?> I asked.\n <Carnival of the Animals, by Saint-Saëns.> Ashur smiled. < The pictures are nice, too. My friends and I like to spend time together, listening. Then we draw our own pictures of what we imagine.>\n <That sounds wonderful. Can you feel Medusa, now?>\n His face lit up with wonder. <Yes! She’s showing me things . . . > His mouth settled into a serious line as he made the complete interface.\n I lifted him gently with our tentacles, and Nuruddin received him with his own. He had been using his unit for almost ten years, and his interface was remarkably graceful. Of the other thirty-seven immigrants from Olympia, he was the one who had grasped my offer the most quickly, the one who required the least explanation. But they already possessed the same brain implants that I had. All of them were the children of conspirators.\n <That makes fifty of us, now,> Nuruddin gazed at his son’s thoughtful face. <Fifty people trying to keep a secret—eleven of them children.>\n <They’re Medusa’s children, too,> I said. <Patience, my friend.>\n <Is anyone more patient than you, Oichi?>\n <Yes. Medusa is.>\n Nuruddin’s son returned to his mother, and we reported to service in Baylor Charmayne’s garden. His table was set for twenty, and these were no ordinary guests.\n I filled Baylor’s glass with the same carafe from which his guests drank. He raised it. “A toast to the new congress. Halfway through our voyage to our new home, we’ve got a lot to be proud of.”\n The new congress was not an accurate description. These senators had been elected to the same offices they had always held, by members of their own class. They had jockeyed with each other their whole lives for power, stabbed each other in the backs numerous times when they weren’t conspiring together. Now they hoisted their glasses and toasted each other. I stood at their backs with nineteen other Servants.\n In all the years since I was supposed to have died, these Executives had never looked directly at me. All I had to do to disguise myself was change my name.\n “And to Sheba Charmayne,” added Baylor. “She was a tough old bird. But she came through for the children. Thanks to her, they will always have music.”\n Since they had all supported his bill for the Music in Education initiative, they drank to this toast as well. Many of them had sincere smiles on their faces. They had discovered, once their own children received the music and image database (which some of them really believed had been designed by Lady Sheba herself), that their children had become experts in the most intellectual music ever created by human kind. Their math skills had improved, and improvements in other areas had been noticed. Now, even the most stubborn opponents to the initiative were applauding the woman my mother had named the Iron Fist.\n In some ways, I couldn’t help but pity her son. Especially when she continued to chide him long after her death.\n “It is with great humility that I serve once again as your speaker,” Baylor intoned, without anything of the sort. “And so it is my pleasure to invite you to our annual FlyBy, in which we will inspect the outside of our Olympia. Our families and friends await us on the shuttle. Once we finish our glasses, we will depart.”\n They smiled at each other. The FlyBy was the most exclusive event anyone could possibly attend. It was so exclusive, they would not even have Servants to attend them. We watched them gulp their alcohol, but when they got to their feet they were steady. It would take more than one glass to make fools of them.\n Their departure was our own cue to make a graceful exit. We walked through the access tunnel to our lockers. Nuruddin fell in beside me. “Something is wrong,” he murmured.\n My first impulse was to reassure him. But Nuruddin’s instincts had always been sharp. I thought back to Baylor’s invitation to his brethren—was there something in his tone that I had missed? “I’ll look into it,” I promised.\n He said nothing more. He headed straight home to his family, as was his well-documented habit. I took a different tunnel, to the adult education center to work on my math skills. Unlike the tunnels, the center was a well-lit place, though only about a quarter full at any given time. This was probably because no amount of education would earn a worm a job as a tech, or any other job other than the one you already held. But it was a pastime that entertained me.\n It also gave me an alibi while I nosed into the communication and security grids. I sat in a cubicle and used a stylus to write out chemical equations. But they were all problems I knew by heart, and my mind was busy studying messages. The first thing I saw was the public feed of the FlyBy.\n “The challenges of the past year have been many,” Baylor Charmayne’s solemn voice informed us from his canned speech. “But Olympia remains strong and proud, now that we have reached the halfway point in our journey. Our children’s children will live to see a new world, and they will thank us for our prudence and our careful conservation of resources.”\n While he lectured the population of Olympia about the virtue of privation, stock footage from a previous FlyBy pretended to be a real-time representation of him and the other Executives standing stiffly at their command stations on the shuttle. Off camera, on a lower deck, over nine hundred of their closest family members and cronies partied with the abandon of people who had never known a moment of conservation.\n “And as we enter the second half of our voyage,” continued Baylor, “we can feel secure in the knowledge that we never compromised our—”\n His speech broke into indecipherable bits for almost a full minute, before cutting in again with, “—out the fire extinguishers! We have less than five minutes before—” More distortion followed. Then, “Mayday, mayday! We have fire on—”\n Static terminated the transmission.\n I wished I could see what was really happening on that shuttle. But according to the encrypted General Security log, all of its surveillance feeds had been disabled before it left Olympia. That efficiency had carried itself over to an incident report that had already been written. I found that buried in a secret database that also contained a report of how Baylor Charmayne had survived the assassination of his fellow legislators. It began with this tidbit:\n It has been determined that surveillance devices were disabled from the electrical pulse generated by the first explosion.\n I read the report to its conclusion. Then I touched my link with Medusa. <We need to go outside,> I said. <I think we’re going to witness something spectacular.>\n There are no fireballs in space, but escaping atmosphere can create some temporary color. What I liked best was the blue lightning of the gravity bubble that crawled all over that shuttle, pulverizing what was left of it so no pieces could be retrieved and examined for evidence, later. It was the same weapon, on a smaller scale, that had been used to destroy what was left of Titania. It was left over from the war that had driven us from our home system in the first place.\n Medusa and I watched from a perch just outside Lock 207. I played selections from Prokofiev’s Ivan the Terrible as we marveled at the awful beauty of that destruction. I shed a tear as I thought of my parents.\n <Medusa,> I said, <I didn’t see this coming. That worries me.>\n <Yes,> she agreed.\n <They keep trying to achieve the Final Solution. They keep killing their enemies, and yet it never ends up solving their problems. It makes me wonder if my own killings have done any good, in the long run.>\n <I would define your killings as acts of self defense,> she said. <But I would define my own killings the same way. Perhaps I am biased.>\n We watched for something in particular. Within forty-five minutes, we spotted the lights from Baylor Charmayne’s pressure suit. According to the report, his journey from the crippled shuttle would take exactly 73 minutes.\n There were many things we didn’t know yet. For one thing, we weren’t sure which lock he would try to open. But finally, Baylor tapped a manual override code into the keypad outside Lock 212.\n The coincidence was downright magical.\n Medusa’s tentacles stretched and retracted as we whipped across the hull of Olympia toward Lock 212. We spotted Baylor clinging to a grip bar. His suit was a gleaming Executive model, equipped with a twelve-hour air supply and jets that easily took him from the shuttle to the Series 200 locks. I had to shake my head when I pondered the trouble he had gone to, the danger he had put himself in to make it look like this assassination had been survived by a hero. I would have manipulated the records and stayed safe inside Olympia. But then, I had Medusa to help me finesse that sort of fraud. And I wasn’t trying to prove anything to a dead mother.\n We couldn’t see his face as we moved up on him, but his pudgy, gloved fingers managed to convey some frustration as he typed code after code into that keypad and it refused to respond. He would never get inside that lock without our help. Medusa and I had long since mastered every protocol in Olympia’s command database.\n We tore him free of his perch, and stripped his jets off the suit before he could fire them.\n He gaped at us through his faceplate. Unlike Ryan, he knew what Medusa was. He would have looked less shocked if his dead mother had confronted him outside that lock.\n “Who are you!?” he used his suit com to ask.\n For him, my smile was anything but tender, “Call me Medusa.” I transmitted in her voice.\n “I know that, you idiot! But who’s driving? Whoever you are, she’s controlling you, can’t you see that?”\n I let Medusa answer that one. “I’m not controlling her, she’s collaborating with me, just as you always feared.”\n “They’ll destroy you,” he said. “The Medusa units will destroy everything that matters to us.”\n “Everything that matters to you,” I agreed. “But what did you destroy, Baylor? How many lives were lost on Titania so you could control the message?”\n From the moment I had realized what he had done to his fellow Executives, I had remembered that overheard conversation with his mother. How do we kill them before they figure out what we’re up to? First I had assumed he was talking about workers like me. Then I thought he must mean the Medusa units. But now that I had witnessed his newest mass execution, I remembered another pertinent detail. No Executives had made it off Titania. Not one had escaped. And once they were dead, the Charmaynes had become twice as powerful. So yes, they wanted to destroy the Medusa units, but what had Ryan Charmayne said? I think I know how we might kill two birds with one stone . . .\n “My god.” The disgust in Baylor’s voice informed me that even in these circumstances, he couldn’t grasp that he wasn’t supreme anymore. “You animals. You think you know what’s going on? You stupid, blind—”\n “Do you know how we got to Olympia?” Medusa asked. “It was your greed that saved us.”\n A light went on behind his eyes. I’ll give him credit—he understood immediately.\n “You raided Titania for resources,” said Medusa. “You weren’t satisfied until you picked her clean. It took many, many trips for the supply ships to move everything you wanted. Each time, a few more of us stowed away on those ships. When all of us were safe, our operatives sabotaged your mother’s lifeship. She was too smart—eventually she would have figured out what we had done.”\n The grief and rage he displayed then were impressive. In Baylor’s mind, he was the good guy. He had not been responsible for his mother’s death, and he still missed her. He believed in the righteousness of everything he did, and he believed that the equality the rest of us were trying to achieve was unnatural and wrong.\n Time to cut that nonsense short. “None of your fellow legislators tried to stop you when you made your escape,” I said. “None of them tried to get into pressure suits. You must have taken the antidote for the drink you all had together in your garden. Maybe they were unconscious or even dead before the first bombs went off. But their families trapped down in the lounge section were awake through the whole ordeal, weren’t they Baylor? You even sacrificed people from your own family.”\n A tightening around his eyes was his only response.\n “I’m guessing you’ll declare martial law once you’re back on board Olympia, until you can find the evil perpetrators of this mass murder. And that could last indefinitely. Will the Charmaynes have to take permanent control?”\n “It’s the right thing to do,” he said. “Don’t you see that?”\n Just past his left shoulder, I could see what was left of the shuttle. The gravity bubble was collapsing, leaving a crumpled wreck floating in a field of stars. I touched the link in his head that only his fellow Executives should have been able to use. <If you could see what I see, you never would have tried to kill Medusa.>\n I held him with Medusa’s tentacles and smashed him against Olympia’s hull until his helmet shattered. I had been planning to tell him that I had used Lock 212 to kill his son, Ryan—that was the only vengeance I had contemplated. But that seemed too cruel, now. So I pulled him close.\n <I’m here, > I assured him. <You’re not alone.>\n And finally, when the light left his eyes, I sent him off to join the trail of bodies behind Olympia.\n When I opened the inner door of Lock 212, I was alone again—or as alone as I could get with Medusa or anyone else I might care to talk to only a thought away. The hall was dimly lit, with pools of light punctuated by deeper shadows. Someone stood in one of those pools. He moved into the light when he was certain I had noticed him.\n “Terry,” I said. “You are now the head of the Charmayne family.”\n He had been weeping, but he seemed to be past that now. “He did it,” he said. “He killed all of them. My mother warned me he would do that some day—he or Sheba. I didn’t believe her until Sheba had her arrested and blown out of an air lock.” He pointed at Lock 212 with his chin. “Smaller than this one. With an observation window. Sheba picked that one, because she wanted me to watch, even though I was only six. She wanted to make sure I knew that disobedience would not be tolerated.”\n I heard him. But at the same time, I searched the Public Address records to see what had been announced about the assassination. What I found surprised me. “You told them everything. Everyone knows what Baylor did.”\n He nodded. “The only thing they don’t know is that you killed him. Or I assume you did—I won’t ask for the details. I said that his plan backfired when he couldn’t get back into Olympia. After all, none of the locks would open because we were on high alert.”\n I scanned a variety of communiques, to see if I could get a feel for how people were reacting. “No one seems surprised,” I concluded.\n “Nope,” said Terry. “I would say they’re relieved. I think it’s a bit early to tell, but I believe that we can continue our program to upgrade the implants. I’ve spoken to the candidates I mentioned to you, and they’re ready to make the commitment.”\n That makes fifty of us, now, Nuruddin had said, Fifty people trying to keep a secret—eleven of them children. But thirty-eight plus eleven make forty-nine. The one Nuruddin hadn’t mentioned was Terry Charmayne.\n He took a deep breath, and let it out in a sigh. “I could tell you things. Things you wouldn’t believe.” He gazed at the lock as if he were seeing those things.\n Then he shook himself. His eyes were red, but not so full of grief anymore. “How tired are you? Are you up to performing some surgery?”\n “I’m up to it,” I said. “But there’s something I want to do first. Can I get into the habitat sector, now?”\n “Everyone can,” he said. “That’s the first thing I did with what authority I have left. The private homes are off limits, because they’re empty now. But the gardens are open.” He smiled at that. I knew he was remembering the day we met. “Are you going to sniff flowers?”\n “I’m going to squish mud between my toes,” I said. “I promised my father.”\n When I made my way through the tunnels to the habitat sector, they were not so dim anymore, or so cold. The security locks were closed, but not locked. Since I was most familiar with the access point I had used as a Servant, that’s the one I went to. When I opened the door into the green, living heart of Olympia, I found Nuruddin’s son Ashur, standing at the end of the pavement with his bare feet on the clover. I took off my shoes and joined him there.\n He looked up at me. <Medusa told me I should feel the ground with my toes. She said it was what you had always longed to do.>\n <Do you talk to her a lot?>\n <All the time. Will you walk with me?>\n He took my hand, and we explored together. Robot gardeners skirted us unobtrusively, as they had been programmed to do in order to avoid annoying the Executives.\n I had believed that I knew what the habitat looked like, because I thought I was pretending to be blind when I attended the Executives. Now I knew I had fooled myself, too. I had been so focused on what they were doing and what I was planning, I never looked up.\n <It’s making me dizzy,> said Ashur. <The other side is so far away, but I keep thinking it’s all going to fall on us.>\n <Me too.> I gazed at the fields and tiny houses overhead. A fine mist floated in between, but it didn’t obscure anything. It reminded us how big it all was.\n Our noses brought us back to ground level when we found the sweet peas. Ashur and I put our faces right into the blooms and breathed deep. <That,> he concluded, <is the most wonderful smell in the universe.>\n We found a bench shaped like two giant turtles and sat on it. A fountain burbled nearby, and I tried to imagine Ryan and Baylor Charmayne sitting there and enjoying the beauty. I couldn’t do it.\n From our perch, I could see through one of the windows of a fine house, now empty of the Executives who had taken its beauty for granted. It was open, and a curtain fluttered. But there was no breeze.\n A man emerged from the darkness behind the window and looked out at us. But Terry had said the houses were empty—why was he there? I scanned his face and searched for him in Olympia’s database.\n His wasn’t in any of the directories. His face had no matching profile. As far as the records were concerned, this man didn’t exist.\n Their pathway is not part of the known network, Sheba had said, all those years ago.\n He grinned at me, as if he knew I couldn’t find his name. As if he thought that would frighten me.\n I grinned back, and watched his smirk wither. He turned away from the window and was gone. I had a feeling it might be a while before I saw him again. When I did—if I did—our encounter would probably not be peaceful.\n For ten years I had killed and plotted. Yet I hadn’t anticipated what Baylor was about to do, and I hadn’t seen this man until he showed himself to me.\n But there were also things that only Medusa and I knew, things I would never tell anyone. I wouldn’t flinch to use those things, when necessary.\n <Oichi,> said Ashur, <How many of them did you have to kill?>\n I gazed at the empty window. <I didn’t count them.>\n <Did it make you feel better?>\n <No. It was pathetic.>\n He pondered that. He was nine years old, younger than I was when my father had given me the enhancements that changed my life. <The Medusa units are better than we are,> he said. <They’re not mean.>\n <Yet we made them,> I reminded him. <And we made the music.>\n <That’s true.> He seemed to feel better.\n We walked away from the house, leaving its mystery for another time. I wanted to tell Ashur that everything would be okay. But maybe it wouldn’t. Maybe we could only hope to make it better.\n Soon, Terry Charmayne and I would introduce more people to their units and get the process of communication started. But Ashur and his friends were the ones who would design the future. They already realized possibilities that we couldn’t see. They heard the music and drew pictures of what they dreamed. Even the man in the window didn’t know what that would be.\n As for me—I’m still Oichi Angelis. In my own way, I shall always be a worm. But what is a worm if not a creature that brings air and nourishment to growing things?\n <Oichi, are there serpents in this garden?> asked Ashur, and I knew he wasn’t talking about snakes.\n <Yes,> I said. <Enjoy the flowers, Ashur. But watch for the serpents, too.>\n We walked deeper into that forbidden garden, where moisture condensed in the air. Above us, the world turned and the sky was green with growing things.\n <Only wait,> said Medusa. <The mystery of flowers can be deciphered if one cares to look closer. But the stars have things to teach us too. The stars contain mysteries that grow deeper as you look closer.>\n And look we would, with no one to tell us we must remain blind to keep the peace.\n “It will be okay, Ashur,” I promised, and together we walked back into the tunnels of Olympia, to make it so.\n Nine of Emily's novels were published in the U.S. By NAL/Roc, under three pen names. She has also been published in the U.K., Italy, Israel, and China. Her novels are Shade, Larissa, Scorpianne, EggHeads, The Kronos Condition, GodHeads, Broken Time (which was nominated for the Philip K. Dick Award), Belarus, and Enemies. Her new novels, The Night Shifters and Spirits of Glory are in ebook form on Amazon, Smashwords, etc.\n Her short stories were published in Asimov's SF Magazine, the Full Spectrum anthology, The Mammoth Book of Kaiju, Uncanny, Cicada, Science Fiction World, Clarkesworld, and Aboriginal SF, whose readers voted her a Boomerang Award."}