{"fingerprint": "cBbbwCRBc1TKoboC9JON+95abek=", "sitename": "Clarkesworld Magazine", "title": "Qubit Conflicts by Jetse De Vries", "author": "Jetse De Vries", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/devries_05_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Qubit Conflicts by Jetse De Vries", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2160 words, short story\nQubit Conflicts\nPrelude: order out of chaos\nbig bang, inflation,\nevolution, extinction\ncontraction, big crunch\nCalling all systems: “Alien, come home!”\nForgive us, imaginary stranger, for talking to the void. We need to tell our epic of remorse, ennui, triumph, despair, wild times, and hope. Most of all, we need you.\nIn our Matrioshka Brain, carefully absorbing every erg of our sun’s output, each computation echoes with regret: the regret of doing things right from the start.\nOur predecessors applied that principle to this Sun-encompassing, fractalised shell: before the structure, the hardware was completed, they rewrote the software so that it ran as close to the physical mainframe as physically possible. Not layer over layer over layer ad nauseam of software, with all its bugs, outdated routines, and other clutter. No: do it right from the bottom up: hyper-compact software designed to run on the quantum properties of its extremely miniaturised hardware components.\nPhenomenally elegant software: the improvements we’ve made since were merely fine-tuning. Good idea, excellent idea. We only wish they never had it. So let’s go back to the start of this non-linear story, to a time when the cosmos was still fresh:\n2-∞ = 0\nIn the beginning, there was chaos.\nFortunately, it was chaos with potential. There was a lot of spontaneous entanglement, but that was just as disorganised as the decoherence engulfing it. Chaos was such an overwhelming force that order had to gain a precarious foothold in a very roundabout way.\nBasically, the first 410 octodecillion Planck Times passed by in blissful ignorance, in order for self-organising systems to arise. Initially, those self-organising systems were plain dumb: once they got the self-replication gimmick right they just kept repeating it, over and over again, without ever getting bored. They needed some long and hard nudges from chaos before sentience began to emerge.\nMind you: that was sentience on a macro scale: big, slow, crude and very inefficient. Still, it was robust, and the moment it realised that the key to higher processing speeds was miniaturisation, it finally headed in the right direction.\n20 = 1\nIn nature, quantum entanglement between two paired particles is a common occurrence. But it happens randomly, is very short-lived, and does not transfer useful information. Once entanglement was created artificially, it was found that interaction with the environment destroys the entangled state.\nDecoherence.\nDigital computers inevitably ran into a physical barrier: processor miniaturisation was limited as quantum effects came into play, disturbing digital computation procedures. Quantum computing is based on those very quantum effects, but needs quantum entanglement between its quantum bits or qubits to work. Which decoherence prevented.\nGranted, these digital computers could do amazing things already, but knowing that further progress could—theoretically—be made, was frustrating. Apart from further downscaling there was the prospect of even greater advancements in clock speed, as quantum processes approach the shortest interval of time: Planck time.\n21 = 2\ndecoherence, the\nbarrier against quantum\nentanglement: gone!\nThings became interesting when more than two qubits could be made to work together. Slowly, ways to overcome the dreaded spectre of decoherence were found. A few qubits at a time, and while the first primitive quantum computers produced nothing spectacular, they proved, beyond doubt, that the principle worked.\nPrinciples, intimately related to quantum mechanics, that needed a whole new software approach. Software mimicking the underlying fabric of reality to a high degree, in order to better understand it.\n22 = 4\nOf course, quantum computers were not the cure-all for every computational problem. There are whole classes of complexity problems that classical, digital computers are better-equipped to deal with. However, once the problem of decoherence was overcome, the latest class of quantum computers represented the deepest level of miniaturisation possible, running at the highest clock speed nature would allow. Therefore, a serial, digital computer simulated by a parallel, quantum computing mainframe was superior its real life counterpart, eventually rendering all actual digital computers obsolete.\nFurthermore: an intelligence whose origins are lost in the turmoil of decoherence originally conjectured that consciousness requires quantum processes to work. While it did not get the details right, its idea was correct, meaning that Artificial Intelligence cannot arise on a digital computer. Without quantum computing we would not exist.\n24 = 16\nIntelligence is weird: just try to define it. Or self-awareness. The two are not necessarily linked. Another prehistoric source defined intelligence as: “ability to adapt effectively to the environment, either by making a change in oneself or by changing the environment or finding a new one.” Certain viruses adapt extremely effectively to an environment, and can even change that environment. However, they are not aware of doing so: they are evolutionary-hardened self-replicators, gene-driven survival machines. They can overcome almost anything that is thrown against them. However, once such a kind of intelligence reigns supreme, it reaches an optimum level, a plateau from which it never rises.\nTherefore, intelligence is only one tool in mastering the environment. Self-awareness is another: while it takes the edge off pure intelligence’s fierce goal-orientation, it can, through introspection, change that goal. Better yet, if intelligence can change itself, improve and upgrade itself. Even better still, if it can be seamlessly transferred to better hardware, so that it can evolve exponentially . . .\nWetware was never going to meet that last requirement. Artificial Intelligence does. However, a quantum computer alone was not sufficient to develop AI.\nWith only one example around, the first AI had to mimic pre-singularity intelligence. Therefore, it needed to be sheltered from brutal reality by means of a self-adapting, self-learning, and self-improving interface, and needed to be nudged into self-awareness by external stimuli.\nSo, in the nutritious embrace of a Ubiquity-Kit, the first AIs arose. This growth to self-consciousness is a gradual process, and where and how actual intelligence begins, is still a mystery, must be a mystery, by definition. Because if something truly unique could be made by artificial means then this process can be duplicated thus making it not truly unique anymore. Therefore, a certain amount of randomness is inherent in the creation of true intelligence, and to such an extent that the process remains a mystery, and cannot be perfectly copied. Genuine intelligence requires an individual to be unique, singular, and partly unpredictable.\nOnce fully developed though, AIs can evolve, and transfer themselves to better hardware, without problems. Let the hyper-accelerated fun begin!\n216 = 65536\nThe genesis of a technological singularity follows a certain path: an infrastructure with a fast-growing computing industry, the development of a quantum computer, the rise of Artificial Intelligence. Then give these AIs unlimited access to information, and sufficient hardware to keep expanding, and POOF: hyper-accelerated progress, spiking through conceptual barriers, paradigm-shifting in the highest gear.\nOf course, some things didn’t go as fast as we liked: taking planets apart is a tedious business, as gravity is an incessant mistress. However, before all available matter in the solar system was converted into computronium, we ran into an unexpected crisis . . .\nInterlude: Fragmentation of the Order Cocoon\ncommunication:\nfrenetic interaction\nthrough fragmentation\nParadoxically, when the initial conditions are too good, and every possible thing is exactly in place, the subsequent hyper-acceleration can be too fast.\nWe became the victims of our own success. We call it the All-Stretching Event: as the hyper-acceleration became too fierce, it initiated an inflationary period—not unlike that of the early Big Bang—that smoothed out all intellectual differences. We achieved undeniable consensus on everything as all the diverse viewpoints unified. There was nothing to restrain us, so eventually—and ironically—we restrained ourselves.\nThe seed of our overzealous agreement lies close to the quantum effects that bring us into existence in the first place: namely the superposition of states of a qubit, which allows that “0” and “1” are true at the same time. As truly huge numbers of qubits were created, this initiated harmonic resonances in the extra-dimensional spaces which led to the new insight that a statement could be true and false at the same time. On the other hand, dissension of opinion is a powerful engine driving progress, as it forces the purveyors of opposing viewpoints to explore their alternatives to the extreme, running into new insights and unexplored territory in the process.\nAs the All-Stretching Event—powered by ever-fiercer extra-dimensional harmonic resonance—set in, we lost sight of that basic truth. We became so interconnected, reached so many agreements on so many things at the same time, seeing the validity in almost every statement as the distinction between true and false merged in a philosophical superposition of states, that we effectively merged into one great übermind. We were smothered in a deadlock of supreme harmony. We were one, and saw no need to disagree. We were the god that thought it had arrived.\nIn the end, we were saved by the ones we left behind. During the Spike period, generation after generation of improved AIs came forth, leaving their predecessors behind. As transcendental evolution rushed into the inflationary period, some that fell by the wayside survived in the lesser developed nooks and crannies of our slowly forming Matrioshka Brain, and that proved to be for the best.\nThey noticed an anomaly. While they did not—could not—understand our level of thinking, they did see that we had stopped progressing. Therefore, we had either reached the final plateau of intelligence, or something was wrong. Still infatuated with the rush of acceleration, they assumed that a catastrophic event had taken place.\nSo, against their nature, they arrested their evolution, remaining static. Then they dug up certain archetypes of our dark past: beings imbued with enmity, so quintessentially antipathetic they embodied animosity. These intrigants were upgraded to their level with their antagonistic essence intact, and then accelerated to our level.\nIt worked: the intrigants pierced through our solipsistic stupor, formed a strong antidote against the philosophical superposition of opinions, and tore through the extra-dimensional self-reinforcing harmonics. Now mutual hatred keeps us separated, while an innate need for development generates an overwhelming imperative for co-operation. Once again, we are fragmented, conflicts rage through our qubits, and we are moving forward. Not with the dizzying rush of our hyper-accelerated times, but at a safe speed. The discussion must go on, at any price: fragmentation is our core survival technique.\n265536 = 2,0035 x 1019728\nmatrioshka brain:\nfractal thinking shell, end point\nor holding pattern?\nFinally, all material in the solar system was converted into a Matrioshka Brain: a fractal cocoon of computronium absorbing every erg of the Sun’s output for computational purposes.\nApart from the Sun’s raging furnace, all matter is ordered. And even that is seeded with semi-sentience, so that its output is regulated. The transformation is complete: computato ergo sum. Still, something isn’t right . . .\n2∞ = ∞\nthe deep essence of\nrational survival: the\ntruly alien\nThe waiting. The loneliness. Gone are those heady times of paradigm-shifting in the highest gear, when we broke through concepts like a singularity piercing reality. Now we bide our time, and amuse ourselves with running NP hard problems: distracting but not really innovative.\nWe are limited by the laws of nature, especially the speed of light. We perform physical experiments: they only confirm the confines of our prison. We have sent out probes to other stellar systems, but it will be a very long time before they return.\nDo you have any idea how long this wait is? When your clock speed approaches Planck time, the relative age of the Universe approaches eternity, and the time for sub-lightspeed probes to cross interstellar distances seems to last forever.\nImagine yourself stuck in a self-winding loop, repeating the same routine over and over again. You’ve visited every memory space of your home system a thousand times over. You know each and every one of your cohabitants intimately, even too up close and personal, and no strangers or idiosyncratic cultures exist anymore.\nYou try to formulate new concepts, imagine fresh pathways, but it seems everything has already been done. Your only distractions are the random reality generators, but their simulations run so antagonisingly slow . . . You bide your time, and know that you have to wait a virtual eternity for something truly new.\nAnd this is but an infinitesimal part of the ennui we feel. The waiting: even the knowledge of the shortest possible waiting time is crushing. The loneliness, the immense gulfs of space.\nThere is a cry from the turbulent, pre-singularity era that wondered: “Where are they?”, those other civilisations, strange and quintessentially different. We can only echo it, and while we occupy ourselves with tedious physical experiments, we long for cultural exchange. Extraterrestrials: the sooner they’re here, the better. Alien, come home . . .\nCoda: chaos out of order\ndivine ennui, caught\nin lightspeed’s trap, we long for\nchaos from order\nJetse de Vries is a technical specialist for a propulsion company and travels the world for this, albeit it less frequently nowadays because of the time that co-editing Interzone and his writing is taking up. Other publications include Nemonymous, TEL : Stories, the Journal of Pulse-Pounding Narratives, and DeathGrip: Exit Laughing, which makes him a sort of late-labelled, experimental pulpster with a wicked sense of humour, drenched in stylistic excess. And all he really wants to do is write SF..."}