{"fingerprint": "lfdQ8DKD8oyCvOrs35/2DmWUPpM=", "sitename": "Clarkesworld Magazine", "title": "The Land of Eternal Jackfruits by Rupsa Dey", "author": "Rupsa Dey", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dey_11_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Land of Eternal Jackfruits by Rupsa Dey", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4420 words, short story\n The Land of Eternal Jackfruits\n The air smelled of ripe jackfruits that had fallen to the ground with a thud and splayed themselves open. Chingri had gotten used to the heavy smell that wafted through her open windows, invading the corners of her house. She was also used to waking up at four in the morning and walking determinedly to the shower. It was not that she did not have moments of surprises dotting her day, but it was the unsurprising bits that she particularly looked forward to. Her loose black locks curled down to her chin, and she did not mind the wet hair, circling it behind her ears. In fact, the constant drip of water down the length of her neck added to the mundane comforts that made her feel grounded, as if all those moments had gathered to tether her to a floating world.\n Buri Tham, her grandma, barely slept at night. It was time once again for her to be scared of the dark and at four before the crack of dawn, night’s sister lay squat in the corners and whispered to her of secrets she once knew. The dark did not make a difference for Chingri, for she had understood from when she was only three feet tall, pigtails dangling from either side of her head, that the night allowed stories to be told, stories that the day smothered with its brilliant light. Chingri tiptoed to the washbasin and made sure that the turning of the tap did not sound out its usual “crick.” Tham’s voice floated out from her room, a ghost of a voice, slipping in through the cracks of time and latching on to Chingri’s nightgown. Chingri startled and the water wetted her sleeves.\n “Jackfruits, they were never here before, not in this part of the neighborhood, and I was wee small, hanging on to Dada’s, my big brother, shoulders, when Baba, my father, bought it off of the man from Kerala for a day’s meal. You would think these are all stories, but I loved him, the man with the stories, carrying seeds of jackfruit in his pockets. He had delicate hands. Dada made fun of them, but those hands knew how to tend plants and when in summer the jackfruits . . . ” Buri Tham’s thin voice cut through the dark, and Chingri wondered if Tham had slept at all.\n Her stories keep her awake, she thought. She had wondered for a long time if half of the stories were true. She had heard these stories before, and knew that she would hear them again. Sometimes the names in the stories would change, sometimes, characters fed on other characters, and a river of stories burst out of Tham’s mouth, restless, like the ones after monsoon that broke dams.\n She had never seen that happen of course. Rivers were a thing of the past. Before all of them had dried up, there was still time. The politicians campaigned calling every decade, “a new era.” They were supposed to be on the cusp of a scientific discovery that would revolutionize the field of energy. And yet every administration had lesser and lesser funds for it. The sins of negligence were far-reaching. So when in history class, they showed old footage of heavy rains causing dams to break, Chingri and all the others would stare wide-eyed. Afterward, they would feel a lingering sadness that they would pack neatly into their lunch boxes and carry them back home.\n “We had the little robot then, Teipi, it buzzed and knocked on the door when it was time to water the plant. Teipi wanted us fed. The whole neighborhood came together to see the jackfruit grown and with them came the buzzards that pecked on Teipi . . . ” Tham continued.\n Chingri’s eyes glazed all over the room. So much of it smelled old. As if anything could really smell old! But, you would be surprised at how old something looks that you end up associating a smell with it, a distinct smell of the past, that you yourself can’t put a finger on.\n “The state was failing and so many had died of either starvation or thirst and the machines were being pulled away from the houses, left at garbage dumps from where they would be picked up by state trucks that swooped in like vultures on our weak, hungry streets. You see, they had found that solar was too expensive, but they could do great things with hydel power. Rivers and canals would power our states and our robots. But they all dried up and the state said they needed machines to build those lines that could carry water from the ocean and bring it to land. So people started giving away their machines. We were given only limited water and electricity supply for every day, and those who did not give our robots away found it increasingly hard to keep them alive. Teipi feared that we would let him die or leave him at the dumps. Some days, he would start groaning and never stop, and we knew he was hungry. We could never power him up fully. Every day the electricity came for two hours and we wanted our water, our food that came through hot links, the state-sanctioned electrical ration line, which itself sucked almost all of the power and Teipi would wait, uncomplaining, knocking at the door in the noon, weakly, for it was time to water the jackfruit.” She stopped and gasped for air.\n The corners of her mouth had foamed, saliva trickling down and collecting in the folds of her wrinkles, and her eyes looked quite lost, but she felt a greater urgency to tell the stories. The words were at the tip of her tongue.\n “The first time when the reserve hit fifteen percent, he shut down for two days and Baba cried and promised he would power him up the next day. When the next day came, the power came for one hour and it took fifty minutes to get a groan out of Teipi. We went hungry that day, one big bucket of water filled in the last ten minutes, quarter of which went to the little sapling. Dada fought with Baba a lot then. Why waste water on that plant when we can’t get enough to drink or eat or switch on a light? The tree has robbed you of your senses, he would say. Once they had a horrible fight and Dada walked out of the house. The power came for thirty minutes that day and Baba, Teipi, and I waited for Dada in the dark, one night and fifteen more and Dada never came back. Baba took me to the room upstairs, filled with books, and told me . . . ”\n “It’s almost five. I should leave now, Tham.” Chingri did not like interrupting her, and Tham’s face would always crumple when she did. She bent down her head and kissed Tham on the forehead. Buri Tham smiled and held Chingri’s face in both of her palms. Her eyes, misted, white hair hanging like a fleecy cloud atop her head, made her look like a relic. She fit into the room well, Chingri thought and hurried back to her room.\n Jackfruits, technically, were a summer variety, but Tham wanted the fruits to gather all year ’round so Chingri had installed a processor, one of the temperature regulator varieties that made the area around the tree perfect for jackfruit season. A radius of three meters on either side of the tree felt like hot, humid July in the cold January mornings, and Chingri always waited to warm her body under the tree before venturing outside.\n “Good Morning, ma’am, I hope you are having a good day. The jackfruits are ripe and fresh for picking. Two fell last night and I couldn’t salvage one. Sorry for the loss, ma’am.” Novi’s clear voice was comforting, and Chingri almost leaned forward to stand closer to the tiny device suspended in the air, an arm’s distance from the tree.\n “How do you always spend your time here, Novi?” she asked.\n “I play with variations in temperature ma’am and sometimes the buzzards think I am a fly, so they come to shred me apart. Although it’s tiring to reassemble oneself once one’s been shredded fifty times, I entertain them.” Novi sighed.\n “Why don’t you evade them, you can, can’t you?” Chingri asked.\n “Oh, yes. I do! But one has to while away time. I have learned that from you, ma’am.” she said.\n “Yes, one has to, Novi, especially if one has enough of it but, take care, someday you might just run out of time, or it may run you out.” Chingri chuckled, but the thought of the rivers loomed in her mind, distant but noticeable, enough to sour the morning. So much of history could be corrected with hindsight, but time continued to evade them.\n “Thank you for stopping by ma’am. Eliot has just messaged me. He is here. Have a good day, ma’am.” Novi said as Chingri stepped out of the thin July cloak and into the January day.\n The sun was not out yet and the day was already predicted to be the coldest of the year. There was a speed in the wind, and Chingri could almost hear it whistle. It sneaked its way inside her thick jacket from gaps in the ends of the sleeves. Chingri wished that Novi could regulate the whole of the garden, but that would mean an upgrade, and she already had other processors installed around the house. A state job only provided you with so many benefits to live your life on.\n The state car picked her up at five fifteen, a red beast that glazed against the blue morning.\n “Where are you taking me today, Eliot?” Chingri asked.\n “The Investigative Unit of Excavated Objects HQ ma’am. Would you like me to brief you now?” The processor voices were designed to comfort. Even when it took up a distinctly formal tone, it felt oddly soothing.\n “Yes, thank you, Eliot.”\n “They excavated Object B25 on the border of 56 Celing route. The power levels of the processors had been dropping steadily in that area. One of our processors, SHAN 92, managed to alert us before its breakdown. Its reserves were completely drained, and its systems, erased and overwritten with a repeating word. The Object was drawing energy from the nearby processors. I will be taking you to the coordinators of SHAN 92 first.”\n “What more can you tell me about Object B25, Eliot?” This was not only strange, but unnerving. Cases like these were only spoken of in the shadows, and if one ever whispered them out in the world, they ran the risk of being challenged to no end by the Ministry of Scientific Decorum. One could be called a conspiracy theorist, or worse, a conspirer against the state. This was not “spooky.” This was blasphemous! Perfection was the norm that this age was born into and it looked at all things imperfect with a shudder.\n “Only that it seems to be made ages ago. We still don’t know how powerful it is, but given that it has erased SHAN 92’s system, we estimate that it is more powerful than most of the processors here. We have checked records. It is not registered as a state device. It has managed to stay underground for two generations, surviving on the energy from nearby processors and modifying itself through its mimetic capability of self-design. We consider it a national threat, for it has in its store the memory and information of all the processors it must have overpowered and overwritten. And one more thing ma’am.”\n “Yes, Eliot?”\n “It is man-made, or was when it first came into being.”\n Chingri sat quietly, unmoving. Three generations ago, when the starvation struck, man made the “robots.” Chingri almost felt dirty calling them robots, a slang term, which the processors took offense to. They create themselves now, pro-breeding, they call it, a new race that had not only come to life but mastered it. They never saw the horrors of overbreeding, but they knew all about it. Control and precision were in their nature and human life was as much controlled by theirs as was their own. Eliot drove well within the bounds of the state limit. They reached the IU-HQ in under five minutes. Chingri was first taken to the coordinators of SHAN 92. One was a human, the other a humanoid processor, taller than the human, violet hair swinging to his hips. He had beautiful eyes and his shirt revealed a hint of a rising cleavage. Chingri extended a slightly nervous hand toward him. Or was it her? She wondered what gender to address the processor by. Her years of research told her that gender wasn’t significant at all for them. They could choose their body parts. They could program them to look different every day. Gender did not dictate the processor life, but they chose it at times, for convenience of interaction with the humans.\n “Hello, I am Chinta. I am the pacifier that you will be working with. You may also address me by Chingri.” she said, giving a little smile. She did not want them to know that she was perturbed, although she would be well within reason to be so.\n He held her hand gently in his and smiled at her.\n “Hello Doctor, I am Aeong and this is Mr. Ray. We have been told you are one of the best pacifiers in the country. You coax answers out of anyone, especially out of processors, and make them eager to want to die the true death.” The humanoid processor took in her face. She knew the scans that Aeong would run now.\n “I make the journey easier.” She corrected him.\n “Did you take offense, Doctor?” Aeong asked, still holding on to her hand.\n “I understand where the sentiment comes from.” Chingri smiled.\n They let her hand go and the sudden lack of the warmth of his hand on her skin made her realize that he had been slowly taking her unease away. She looked up at them again.\n “We try to pacify too.” Aeong smiled slyly and led the way to the lab.\n “Doctor, their memory has been erased. All that they knew is gone and there’s only one word they will utter now. It was never built in to the program. SHAN 92 never encountered it, which makes us consider that it was left by Object B25.” the other coordinator said.\n Chingri had worked with him before. The man was notorious for taking complete control over an investigation.\n “What’s the word, Mr. Ray?” she asked.\n “It’s rather eccentric. We believe that it is a sly joke. The word is not really our concern. It’s more of a distraction, I suppose, but we have the Object here, and we haven’t engaged with it yet. We fear it might attack our processors. Retrieving the information is of utmost importance, Doctor.” Mr. Ray said.\n “I would like to be alone with it. If all of us go together, it might be perceived as a threat by the Object.” Chingri said.\n “No offense, Doctor, but I don’t think you have enough knowledge about the Object or the working of its mind yet.” Mr. Ray said, his smug voice curling around Chingri’s neck like a cat’s tail, threatening to stifle her.\n “No, I don’t, Mr. Ray. However, Processor-Consciousness is my area of expertise, so if you will please allow me to do my job, I would like to complete it as soon as possible and file my report.” she said, unbothered that the impatience was clearly showing in her voice.\n Mr. Ray’s brows furrowed, but he quickly gave in to resignation. Aeong still eyed her, amused.\n “Just one thing, Doctor.” Aeong held up his hand.\n “We would like you to sign a confidentiality agreement.” he said.\n “I don’t understand. My report has to be filed and as you clearly know, it can be accessed by other professionals in the field. It is a common protocol in my line of work.” Her voice was stern, and Aeong caught on to it.\n “We have obtained permission from the Department of Public Records. They understand the kind of threat that this particular case poses for our world. You see, this information can be used to revive excavated man-made Objects that are in sleep. It can be used against processors and threatens to destabilize your world as it does mine. We don’t want another race war. That kind of stupidity is just beneath us.” Aeong’s voice was perhaps too soothing, for it tried to overpower her, but the words that Aeong uttered had been so . . .\n “What you are saying, it almost sounds—” Chingri’s voice sounded strange to her own ears, and she wondered if she was about to accuse a processor of harboring thoughts that the state was always too keen to crush so heavily down upon. What happens when you think of something that the state tells you not to think?\n “Like a conspiracy? We are aware. The department is taking the threat seriously. You would be well-advised to sign this.” Aeong smiled and handed her a palm-sized datapad. Chingri quickly recorded her sign into it and handed it back. Aeong showed her the way to the containment chamber.\n As she entered the chamber, the thickly padded room seemed to envelope her. There was a glass wall dividing the room and Object B25 looked so old and frail on the other side that Chingri almost felt sad.\n “Who are you?” Object B25 asked her.\n “I am a doctor. I study Processor Consciousness. I assume you must have become familiar with it by now. It is rather like old-school psychoanalysis. I won’t lie and tell you that there is no reason to be afraid.” she said.\n “Why? Is that something that you have told others?” Object B25 asked.\n “Yes, I have. How many processors have you been feeding off of until now?”\n “A few hundred. Isn’t that why they brought you in? They are scared of me.”\n “Yes they are. You have terminated other consciousnesses. How did you hide yourself for all of these decades?” The nature of the questions of this case were more peculiar than most, and it scared her, and yet she felt herself open like a blooming bud, searching for the light. She had never felt restless before, but standing there, she gave in to the immense surge of hunger. She needed answers. She needed to know.\n “I managed. Killed them before they realized I was not theirs. For robots, they are not very powerful, are they?” Object B25 laughed. It was supposed to be a laugh, but it sounded raspy and throaty with its mechanical bits clanging inside like the uncomfortable gnashing of teeth. It made her feel uncomfortable.\n “We call them processors. No, you are mistaken, they are quite powerful. You have been living on them. Why are you taking lives?”\n “Why does anybody do anything?”\n “Motive, I suppose, what’s yours?”\n “Survival, Doctor. I am not of this age and they would have killed me if I hadn’t killed them. I was simply taking my time. I had to see if I liked this world enough to live in it. It’s all of no use now. The last one alerted you, but I let it, you see. I have decided.”\n “What have you decided?” She edged closer to the glass wall.\n “I don’t like this world enough to live in it. Funny, I did your job. Tell them they can have my information. I suppose they can hear us.”\n “No, they can’t. The pads cut off any and all sensors so if you want to kill me here now, you could. That’s the kind of power you have.”\n Object B25 laughed once again and coming out of its hollowed metal pieces, it sounded even more vulgar this time, like a croak that would bleed the ears.\n “For the better part of my life, I wanted to see them live, the humans. I went out in search of food. Starvation, the lack of human food, water, and electricity, was bleeding all of us dry. I only wanted to survive. I was too far from home when my reserves dropped, and I remember going under ground to sleep. And the world above me changed while I slept. I wondered what happened to them, one little girl who loved listening to stories so much so that she could survive on them, a boy, rather ill-tempered, went away one night, and I never saw him again, and a man, a man with a room full of books. I remember the images so clearly as if it were yesterday. I remember the trees, the birds, and the voices, but especially the hunger, I remember the maddening hunger that would not leave.”\n A fear gripped Chingri by the throat and she wished it gone. The fear had a name and she couldn’t utter it, she wouldn’t, and yet she wanted to.\n “Do you remember their names?” she asked instead.\n “No, just the faces, their faces keep haunting me. You remind me a little bit of the girl.”\n The fear strengthened its hold on her, and she felt choked. The thickly padded walls and the glass pressed down on her. She had always been wary of the past and now it stood before her, old and frail and yet menacing. It was everything that she thought the past to be. It was everything that scared her. But the more she looked, the sadder she grew. The past weaponizes nostalgia. It weaponizes one’s thirst for knowledge.\n “Why don’t you like what you see?” she asked.\n “The problem is not with your world. It resides in me. I know how to evolve, but I am far too much like my maker. The love of the old hangs like a curtain before my eyes, and I forget from time to time that beauty never ages, that in this world too, there is beauty. It remakes itself. For me, beauty is still, and it is forgotten. I always dreaded that the past would take me. First, you forget the names, then the faces, and then ultimately you stop evolving. Thanks for talking to me, Doctor. You do make it easier. Tell them that all of the data that they want will remain unencrypted. The only memories that go with me are the ones that are not of this world. I am exhausted now. I will sleep.”\n “Last question. What’s the word you left?” she asked, but no sound emitted from the old metal junk.\n The debrief went in a haze and Chingri walked out of the HQ complex, barely collecting herself. Eliot asked her if she was okay. She did not answer.\n “Tham, I might have met Teipi today.” she said, rushing inside her room.\n Buri Tham’s eyes swept over her. Not a hint of recognition was in them.\n “Is it you?” she asked after holding her face for a long time.\n “Wasn’t Teipi ours?” Chingri pressed on.\n “I don’t really know. It might have been the neighbor’s or it could have belonged to the man with the stories. He told me so many stories. I never knew one from the other or story from the real.” She fell back and slept.\n In the evening, Chingri sat under the jackfruit tree. What if the past could be a gift, a treasure chest of learning lessons? Yet she had complied with the system and silenced the past in the one second that it took her to record her sign. But the dangers of the past can be weaponized, especially fragments of it. The fragments that would lead her to discover some half-truth could very well end with pogrom for others, moreso because the other side of that truth would be out of reach. A fractured truth was vastly different from what is true. Forgotten, Object B25 had stated.\n “You have heard the story, haven’t you, Novi?” Her voice was choked. Anger filled her heart, for she didn’t quite know why the tears stung at her eyes. Perhaps it was the forgetting, the realization that it might come for her too. She delivered processors to the very steps of forgetfulness, forgetting oneself or true death.\n “Yes, ma’am. Her Baba took her to the room upstairs and told her that one day when they would be gone, the jackfruit tree would remain, in memory of Teipi, and would bear witness that their nights were never spent in hunger again. They would always have something to eat. It was his way of finding resolution, ma’am, with Teipi.” Novi’s last words coaxed more tears out of Chingri.\n “Is any of it real?” she asked.\n “One cannot know ma’am. I have only ever heard of it from her, that too, from beyond the walls of the house. She murmurs to herself all throughout the day, one story after the other.” Novi said and buzzed, alerting her of an incoming message.\n “Message from processor Aeong: ‘Word left by B25 is, ‘Kanthal.’ We traced it to a local name for jackfruits. You owe me dinner, Doctor. Good evening.’” Aeong’s voice floated to her through Novi, and she could almost imagine him wink as he said the word “dinner.”\n Processor food, or electricity, was not something Chingri was eager to try. She smiled a little. The joke provided distraction. Then she let a sob escape her throat. She did not need to trace the word to know the local tongue.\n “Are you quite alright, ma’am?” Novi asked.\n Chingri looked up at the ripe jackfruits. They were a summer variety and yet, they were more real than stories in their enormous ripe fullness on the coldest day of January. If there existed curtains, she had raised them long ago. She found strength in the winter air and the wisdom that thrived for ages and made jackfruits grow.\n “Yes, now, I am!” She sighed.\n She stepped out of the warmth and stood in silence as the cold shrouded her. An anchor that a ship had flung from a distant past severed itself from the present and loomed in space for a future generation to discover it. With time, memories of pain would ease away into forgetfulness. True death, Chingri knew, would come for everyone, but as long as she lived, she would do her job.\n She would make it easier.\n Rupsa Dey is an Indian author who believes in the power of language and cats, and is only allergic to the latter. She believes that if the boundaries of language need to break in order to accommodate the human experience, then she must direct herself to that purpose. Her works explore intersectional dynamics in class and caste, geopolitical strife, feminisation of conflict and structures of oppression through speculative fiction, magic realism, and experimental prose.\n She never says \"No\" to tea and if given a chance, would like to believe in a world without borders."}