{"fingerprint": "QAamicywTnPh8P/J8z4NG36ezE0=", "sitename": "Clarkesworld Magazine", "title": "Never Dreaming (In Four Burns) by Seth Dickinson", "author": "Seth Dickinson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dickinson_11_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Never Dreaming (In Four Burns) by Seth Dickinson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5230 words, short story\nNever Dreaming (In Four Burns)\ntrans-mortal injection: t+1 day\n“I’m going to lose the ability to dream,” Nur Zaleha tells her best friend. “Then I’m going to die.”\nIn the vacuum of the test chamber, the plasma thruster ignites, a brilliant violet arc, silent, steady. Her beloved engine, her daughter. Alight.\n“What? That’s insane,” Siv says, pale antishadow in the engine glare, a slim tall shard of brighter light. “That can’t be right.”\n“It’s called sporadic familial insomnia. There’s nothing they can do.”\nSiv shakes her head, backlit, frowning. “I don’t believe it. Get a second opinion.”\nZaleha’s been imagining this conversation for hours, now. Siv will try to figure out a way to fix her—she’ll write to some gene therapy clinic in Stanford or Minnesota or Boston, volunteering Zaleha as a subject. Or she’ll try to get Zaleha into an induced coma, clinical substitute for the sleep she’s about to lose forever. Siv, a zealous futurist, keeps track of all these biotech dreams, cures and augments and embryos with two mothers.\nBut none of it will help.\nSiv’s always been ghoulishly agentic. She can never let the world have its way.\n“I’m the ninth case ever diagnosed,” Zaleha says, smiling bravely. “Isn’t that cool? Double methionine at codon 129. Incredibly rare.”\nSiv stares at her, plasma flare mirrored, starlike, in her goggles, like she’s just thought of something so brilliant it’s burning out her skull. “Oh, Z,” she says. “Oh, no.” And then, as the computer recites specific impulse and exhaust velocity, nominal at seven zero point seven two kilometers per second, “Is it a secret?”\nZaleha nods, her own goggles abruptly ineffective—her eyes have started to prickle. “I want to keep working,” she says, and then, horribly choked up, please, she has to get a hold of herself, here where the whole test crew’s watching, “keep trying to fix the symmetry fault and get the thruster flight-ready, until—uh—until it’s not, you know, practical any more—”\nSiv holds her, even though it’s unprofessional, even though the crew will notice and she doesn’t have an excuse. Zaleha hugs her back, and stands on her toes to stare over Siv’s shoulder, into the plasma shine, into the glare of the engine she built, searching—\nAnd there he is, the visitor, the malak, the angel, her childhood haunt, her other secret.\nTariune.\nHe looks out at her through the exhaust spike, the cloak of fairy fire. And even through the vacuum, she hears him ask: will you come now? Has this made you ready?\nOf course he’s in there. Mom and Dad, trying to raise a good Muslim daughter, always told Zaleha that the malaa’ikah were made of light.\nGo away, she thinks, and then, regretting it instantly, please help me—\nHe’s already gone.\n“Field azimuth symmetry fault,” the control officer calls. “Abort test. Abort test.”\nThe plasma thruster shuts down. The light goes out.\npost-burn systems check\nSiv telemetry:\nLater Siv asks her: “Why tell me then? Right in the middle of a test fire?”\nBecause I was surrounded by everything important to me, Zaleha wants to say. But if she did, Siv would tease her for being maudlin. Siv Ahlstrom, a rocket scientist through and through, doesn’t like feelings that can’t be immediately converted into action.\n“We’ll fix that symmetry fault,” Siv says. She squeezes Zaleha’s shoulder reassuringly. “It’s going to work.”\nThey’ve had four test fires now, and three of them have aborted on that damn fault—active magnetics trying to enforce symmetry. Slipping.\nTariune telemetry:\nShe’s never believed that he’s really malak, an angel. (If she believed, she wouldn’t have pissed him off five years ago.) He came to a young Zaleha, pre-empirical, practically pre-conscious, and so she understood him as a piece of the world, natural by definition. To a little kid, absent any metafaculties, perception is reality. Take her rattle out of sight, hide it behind Bapa’s back, and it ceases to exist. Put a man with golden eyes and golden skin in her nursery, a smoke-smell man who can, in the space between his circled thumb and forefinger, open windows into a world of amber and blood and myth, a world of true names—put him there, and young Zaleha accepts him.\nShe grew up into an engineer, a scientist, steeped in skepticism, armed with instruments of rationality and phenomenology. But even post-diagnosis, she’s never doubted her own sanity. Tariune is real. His world is real. He can step between Aura and her world, the place he calls Coldworld, by his own logic, wholly separate from the unity and symmetry of physics. There are patterns, sure—he likes to arrive in dreams, because dreams are the parts of her closest to Aura, the closest thing she has to an Auran soul. But these patterns do not yield to the same analysis.\n(As a teenager she tried to work out Aura’s magic system, the rules of Tariune’s appearances and capabilities. Eventually she understood the futility of the project. Systems didn’t really function in Aura. It was nuministic, narrative, driven by an alternative causality. Dreams, though—very big. Very central.)\nIn the darkest passages of her childhood, Tariune told her exactly what she wanted to hear:\n“I know your destiny,” he’d whisper, his voice a better class of sound, his words a language she’d never had to learn, pressed, somehow, straight into her brain, meanings rather than signifiers. He could speak raw truth. The Knowing.\n“You’re going to cross over. You’re going to learn, and struggle, and grow mighty. You’re going to save us all.”\nOnce, curious, her skepticism waxing, she asked: “Why me, though?”\nTariune frowned in thought, regal mantle slipping away from the weary earnest man beneath, the salt and leather behind the prince’s silk. “I don’t know how to explain it. The Rhexics heard your dreams in the cold and they told me—” He shook his head. “They said look on her, and I knew you were the right one. I knew.”\nShe liked the man behind the silk and portent. “And do they tell you what to say to me, too?” she teased.\n“No.” A memory of pain in his smile, offered in solidarity. “I just remember what I wanted to hear, when my world started to break.”\nSelf telemetry:\nThe double-methionine mutation at codon 129 of the PRNP prion gene causes cells to produce a faulty copy of the cellular prion protein PRPC. The glycoprotein folds wrong, creating an isoform—well, the biochemistry gets complicated, but the effects are simple.\nWithin the year, she’s going to lose the ability to enter REM sleep. Unable to regenerate or reintegrate or whatever the hell it’s supposed to do during REM, her brain will start to break down. Over the next few months, she will become paranoid and anxious, then begin to hallucinate, then lose the ability to sleep entirely. If she doesn’t kill herself first, she’ll enter terminal dementia, withdraw from all outside stimulation, and die.\nEvery time she wakes up from a dream she thinks: it hasn’t started yet. And: that could have been the last one.\nShe’s never going to see her engine fly. NASA wants to test it on a JPL comet-rendezvous mission. A private spaceflight company wants to buy it to drive their metallic asteroid prospectors. If these missions succeed, Nur Zaleha’s engine may give humanity (or its robots, at least) the solar system. But she’ll be dead first.\nHer engine, her engine. The finest actively stabilized pulse-resonant plasma thruster ever invented, a nearly ideal system. It’s not particularly large or powerful—a petite, lightweight drive that exerts barely more force than the weight of a few pennies. But it’s preposterously fuel-efficient. It can send tiny robotic spacecraft across the solar system with speed and grace and enviable reliability. Amateurs care about thrust. Professionals want specific impulse.\nIt’s elegant. She made something beautiful out of lithium and current. She’s so proud of it—or she will be, once she fixes this damn field malfunction, the persistent symmetry fault that keeps scuttling their tests.\nTariune probably hates it.\nmid-course corrections: t+3 days\nShe has to tell her mom, her dad, her whole topologically baffling network of aunts, snarled up across continents and languages. It’s the hardest fucking thing she’s ever done. Her grief makes her brittle and when they ask stupid questions—“Can’t you just take sleeping pills?”—she goes off like a, well, yeah, like a rocket, a big noisy chemical rocket, the kind that explodes on the pad. Not the kind she designs.\nIt’s too much. Afterwards, she calls Siv, who, having split with her girlfriend and joined Zaleha in the solitary hell-covenant of Total Engineering Life, has replaced Zaleha’s family as her great pillar of solace. “Hey. Want to come over and watch—” She kicks her stack of DVDs and allows the collapse to present a title. “Cosmos?”\n“Can’t sleep?”\nIt’s an ordinary question, delivered casually, but it gives Zaleha chills. “It’s still early,” she says.\n“I’ll stay as long as you want.” Siv’s voice hushes conspiratorially. “Hey. Is weed haram?”\n“Probably.” She doesn’t keep haram, exactly, but she doesn’t drink either. She’s an unbeliever now, but still a complete square. The lamest apostate.\n“You’re dying, dude. You should smoke weed.”\nZaleha laughs, a really good, genuine laugh, and then sits in silence, thinking: I don’t want to change because I’m dying. I want to stay the same.\nBut they get high on the apartment balcony, cursing the light pollution, the piss-yellow wash of sodium lamplight that drowns out all the stars. After a little while Siv gets quiet, her lips pursed, and starts looking around in a random walk that touches on everything except Zaleha’s face.\n“Hey,” Zaleha says. “Hey. I want to tell you something.”\nSiv starts, her pale Scandinavian features somehow paler still. “Okay,” she says.\nRight now she trusts Siv with the chemical totality of a compromised system. “I have a really weird secret,” she says, and then tells Siv everything about Tariune, about Aura, about being chosen.\n“I know you,” Siv says, at the end of the story. “So I know you’ve already checked out all the ordinary possibilities. Not a brain tumor. Not a psychosis. It’s real.”\n“Yeah.” Zaleha puts her head on Siv’s bony shoulder. “There’s no way to prove his existence to anyone else, but he’s established it to my satisfaction. Thanks. I thought you might . . . ”\nSiv knows the disease will lead to hallucination.\n“Well, I’m pretty high,” Siv says, examining her hands with wide-eyed equanimity. “And you said you hadn’t seen him for a while?”\n“Before the test fire? Almost five years.” Zaleha frowns up at the drowned sky. She wants to see the stars. “We had a couple of fights. He hates Coldworld—you know, Earth, the universe. He said I was ready to cross over.”\n“Why didn’t you go? It sounds amazing.” Real envy in Siv’s voice, in her wide blue eyes. “You said magic? Actual magic?”\n“Whole new kinds of causality, I think. It’s a place about—stories, you know? About people. Instead of particles and laws.” She shivers and draws up her knees, tucking herself closer to her friend. Siv stiffens a little, but doesn’t draw away. “Which was why we fought. I got so tired of him going on about how cold and soulless and meaningless Earth seemed to him. ‘An empty machine,’ blah blah.” She points up, not so much indicating a particular star as an axis, a vector written in her soul. “I wanted to go—out there, you know? Send people to another world. See trinary stars, baryons shattering into light on domain walls, wonders undreamt . . . he just saw dead rock and empty math.”\nNo beauty in the color charge or the cataclysmic variable’s polar jet, not to Tariune of Aura, not to the prince who climbed the steel ruin of armored mountains and listened at the peak for prophecy wind.\nThere’s magic here, he’d said once, in an adjunct to your Coldworld physics. But it’s vestigial. Nothing ever turned it on. Maybe whatever process built your world didn’t care.\n“I can’t believe you. You had the golden ticket, dude. You got the Hogwarts letter.” Siv tugs her earlobe like it might contain some missing insight. “And you wanted to stay here? You were that eager to watch Congress slash more funding, cancel a few more projects, a few hundred more careers?”\n“It’s magic to you. I grew up with it. Harder to be reverent, I guess?” Zaleha, giggling, thinks: boy, I am pretty high. “He’s really gorgeous. I tried to sleep with him when I was nineteen. No one to judge, no consequences, I hated all the noble virgin shit. But he has some kind of tragic romance over in Aura, like a mortal enemy . . . it’s part of this whole trouble we’re going to fight . . . ”\nSilence from Siv. She has to crane her neck painfully to look into her friend’s face. “Siv?”\nShe’s crying. “Oh, Siv.” Zaleha tries to squirm around to hug her.\n“I don’t want you to die,” Siv chokes. “I really don’t want you to die.”\nA long bottomless interval of grief, exhilarating in its raw truth—the kind of thing you don’t talk about afterwards, because words would lessen it. Like free fall. Like the way Tariune speaks about Aura.\nShe offers to let Siv crash on her couch, although she’s a bit too much of a giraffe to really fit. But Siv, reeling, refuses. She has to get home, yes, it’ll be okay, she’ll take the bus. “We’re going to fix that symmetry fault,” she says fiercely, wiping at her ashen cheeks. “We’ll make it work. Before—”\nShe screws up her face and stumbles away, towards the bus stop.\nThe next time they see each other Siv says: “Man. Wow. We were really gone.”\nShe finds Tariune in the simulations, knotted in the flux of the engine’s electromagnets, racing electrons around the circulating current of the exit plane. A defiant spark, obedient to no law.\n“Hey,” she says, whispering to the computer, unselfconscious, accustomed to this.\n“I’m sorry,” he says. That voice, that thrill of a voice, like a punch in the temporal lobe, a religious truth, every word a dogma. “I’m sorry I wasn’t here. Oh, Nur Zaleha, what has your world done to you?”\n“I thought it might be you, you know.” That maybe he was trying to force her over with some curse of dreams. “I’m glad to be wrong.” Because he can’t lie to her. No one in Aura can lie in the Knowing, the un-language.\n“Never.” He flickers out of the engine like a heavy ion, a perfect trajectory, pulling a crown of electrons. Zaleha can’t help but smile: that’s how it’s supposed to work. “But your time’s running short now.”\n“I told you last time.” She can’t lie to him either. Can’t even hide her pain. “I have to finish this, Tariune. I want to change things before I go.”\n“What can you change?” The simulation chases him along unwritten paths, into domains it can’t have been programmed to handle, places modern physics itself might not understand: frothing subatomic seascapes, the quantum vacuum roiling with virtual particles, and Tariune the Prince in Aura racing through like a needle of un-rule, an anarch of physics. “Look at yourself. Struggling to make a new machine for those hunting new kinds of wealth. Fighting for a distant goal in a world that only cares for now. You are a dreamer in a world of prisons, Nur Zaleha, a chain of chains, and even if you fight through in time to make your mark, Coldworld will erase it. Death will take all your efforts. Even the stars will go out.”\nShe watches in wonder and terror as the arrow of Tariune’s passage pierces space and time, into an emptiness past the end of history, past the death of singularities and the decay of the proton and the Big Rip.\n“This is not your world,” he says. “This is a clockwork husk, winding down. Come to a place with meaning. Come and live forever. Come tonight, or tomorrow, or some day soon. Before it’s too late.”\n“Too late?” she asks, already understanding. Oh, no—“I have months, don’t I?”\nThe simulation withers away. Tariune stands before her, golden, majestic, not so much part of the room around her as a lamina over it, superliminal, more real than real. The man who stood when the Bane of Kings made his world kneel.\n“You have to cross in a dream,” he says. “Where you’re closest to Aura.”\n“But if I can’t dream . . . ”\n“You’ll be lost forever.” He closes his eyes. She notices, in the absence of some diffuse luminance, a light that casts no shadows, that he has grown small weary lines around his eyes. “Lost to Aura. To me.”\nShe swallows against fear: sometimes it’s easier not to know the answer. “If I go . . . can you cure me?”\n“If you come,” he says, eyes still closed, palms half-raised, the Rings of Rhexis dark on the first finger of each hand, “you will live the truth of your name. I promise.”\nNur Zaleha binti Abdul Samad. Self-sufficient. Eternal.\n“I missed you,” she admits. “I was afraid you’d given up on me.”\nThey’d been friends. Real friends. It hadn’t all been proclamation and prophecy. They’d stayed up late, reading and complaining about how elf always meant super-white. Sort of the opposite of how she’d met Siv, super-white Swede, who’d told Zaleha (Malaysian, thanks) that she looked like the Iranian actress, Golshifteh Farahani, and pissed Zaleha off.\n“You’ll still be afraid, I suspect.” Tariune smiles, at first one of those formal I-am-a-kind-Prince smiles, and then a real genuine toothy grin, relieved, spontaneous. “Aura needs the brave. You can only be brave when you’re afraid.”\n“What do I lose?”\nBecause she knows there’s a price. There’s always a price. That’s how these things work. You go to the world more real than real, the shining hard-edged place where you can fight and bleed and grieve and know it all means something. You’ll be healed. But to go you’ve got to sacrifice . . .\n“You can’t return, of course. In body or in mind.” He hesitates, the only kind of prevarication or indirection the Knowing allows. “You will become a creature of Aura when you are healed.”\n“What does that mean?”\n“I come to Coldworld.” He opens a hand and tiny quanta carom and merge in his palm. “But I’m only a visitor. I don’t become clockwork. I don’t become monist, closed, causal. When you become part of Aura, not just a visitor, but a mighty soul . . . ”\n“Then I’ll think like you do. Good and evil. Destiny. Magic.” Zaleha looks through him for a moment, to the diagrams pinned to her office walls, her desktop background, the currents of ion and electron she has tattooed onto her brain. The bones of her engine. “No more causal closure. No more materialism.”\nNot a rocket scientist any more.\nIt’s not that she’ll lose anything really important, right? Science is just a tool. Just a way to select between beliefs. To test utility. She won’t need it any more. In Aura she’ll be able to learn the truth from grinning spirits and speak it to the wind. She’ll never have to do an experiment again.\n“This machine,” Tariune says, speaking carefully, looking at the plasma thruster diagrams, “is every reason you should come. A tiny little force, trying to gradually move something very big. They’ll never put it on anything but a robot probe. And it doesn’t even work.”\nMaybe he’s always been right. Maybe she’s just pissing her time away in an empty world, an indifferent mechanism iterating itself towards an empty future, doomed down to the last proton. She could be over there, armored in alabaster and the steel of vows, hunting salvation.\nShe lies awake that night, thinking about it, and passes into a terrible dream of Aura’s end: eschaton kraken drowning the stars in a liquid-helium sea, the Bane of Kings triumphant on her throne of abrogated oaths. Zaleha wakes in terrified, anxious sweat, tangled in her sheets, flails for a moment, and then, the joy so sudden it seems like it must have broken something inside her, begins to sob in relief.\nmortal insertion: t+9 days\nSiv’s been avoiding her. Zaleha hasn’t pressed it, because she doesn’t want to make Siv confront her own grief. But they end up standing side by side for the next test burn, in their usual places, like nothing’s changed and nothing will.\nIn the hollow airless chamber, the thruster flickers to life. Ring electromagnets stripping lithium and hurling it as thrust. Light in the void.\nI made that, Zaleha thinks. It’s going to work. It’s going to fly.\nAnd then what? It gets put on somebody’s spaceship, and then the ship gets cancelled? The company folds? Global warming eats civilization? What difference does it make?\nAs much difference as anything makes. The world doesn’t stop when she does. Every word and crop and law and thruster keeps the adventure moving. Maybe the thrusters in particular.\n“Hey,” she says.\n“Hey.” Siv stares into the light, her goggles violet-black. “They stripped and rebuilt the whole Child-Langmuir feedback system. It’s going to work this time.”\n“What if it doesn’t?” Zaleha tries to look her in the eyes, and finds herself almost hypnotized by the starfire reflections moving in the goggles as Siv looks back. “What if we can’t make it work before—my deadline?”\nThey both know what happens to most experimental propulsion projects. The guillotine’s been there the whole time, just waiting for momentum to falter, for an obstacle that requires too much time or money to surmount. 2014 has not been a kind year to the field.\nSiv draws a long breath. “Z,” she says, “it’s your engine. But I’ve been building simulations of it for two years. Wick, Jeb, Sobel, the rest of the crew—they’re brilliant.” She adjusts her goggles. “Nearly as brilliant as you, if you get them all together. We can keep working the problem. It’s not so big, compared to everything you solved already. Just a little glitch.”\nShe looks away, as if the engine flare offers a more comfortable view. The computer says: nominal at one one zero point two two kilometers per second.\nThis isn’t Aura. Zaleha’s not special. Not the one chosen to make a difference. The team can go on without her.\nThat’s what Tariune’s always hated. What she’s always loved.\n“There may be an experimental treatment,” she says, and then, in spite of the unalloyed joy on Siv’s face, the bounce of glee that curls right up from her calves and tries to hide itself behind sober it’s-only-experimental qualification in those goggled supergiant-blue eyes, Zaleha finishes the sentence: “But if I go through with it, I’m never going to be able to come back. You’ll never see me again. There’s, uh, an induced coma . . . a really long time.”\n“Go for it,” Siv says, without any hesitation at all. “Whatever it takes.”\n“Field azimuth symmetry fault,” the control officer calls. “Abort test. Abort test.”\nThey groan together, and then laugh. “Better get to work,” Zaleha says.\npost burn systems check\nTariune telemetry:\n“Am I going to leave a body?” she asks.\n“No.” He looks affronted. “You’re coming to Aura. Why would you leave a part of yourself behind? How could we cure you without the whole of you?”\n“I better come up with a convincing excuse for my family, then.”\n“Whatever you please.” He doesn’t look impatient, though. His eyes glow with an incredible relief. “I’m so glad, Nur Zaleha. We need you. Such a tale waits to be written.”\nSiv telemetry:\nThe last time they ever see each other, they talk philosophy.\n“I’m at peace now,” Zaleha says. “I used to want to be the one. All over the history books: ‘invented the Nur Zaleha Drive.’ But I’m content with my little contribution. Nobody needs to remember me.”\nSiv covers her mouth with her hand and her eyes seem to tremble. “What?” Zaleha says, ready to comfort her.\n“Yawning,” Siv says thickly. They look at each other for a long time, and although they don’t say anything, Zaleha wonders if they’ve both come to speak the Knowing.\nAt the door, Zaleha, trying to be funny, says: “You could say something really flattering now. You’re never going to see me again.”\n“I’m afraid I’d convince you to stay,” Siv says. And then, with a sudden resolve that seals across her whole mien like a bulkhead, a tourniquet: “I’m going to see that fucking thruster fly. Every damn probe in the sky is going to ride it. Okay?”\nSelf telemetry:\nShe lies down, closes her eyes, and waits. Feels Tariune’s hand closing warm around hers, drawing her down, or up—in any case, away. A sense of journey, an invisible kinetic truth.\nSiv, she thinks. Oh.\nOh, Siv.\nThe world, the whole universe, collapses beneath her into a small violet spark, into the dimming flicker of a plasma thruster throttling down.\ncircularization: new coordinate system\nThey race north by nimbus ship, desperate to complete the ritual before her dreams rot away.\nLightning snaps between the Lode Peaks, and for a brilliant instant, the whole cloudscape beneath them burns in afterimage. It takes Zaleha’s breath away.\nNight sky above. A billion billion stars behind a thunderously red gas giant, million-kilometer auroras a veil for two dozen moons. Arches and parapets of light.\nAura circles a parent world that could challenge Jupiter for size and beauty.\nIt hasn’t been an easy journey. Tariune’s kingdom has fallen to ruin, throne usurped by a queen he won’t speak of, and in the bone-ash West a terrible darkness kindles in the light of cremated moons. She has much to learn and many loyalties to win. First, though—she has to be cured, her dreams made part of Aura.\nThe nimbus ship’s deck pitches in turbulence. She holds to the railing. “They’re coming,” Tariune says. He looks down at the clouds, and she catches her breath at the fear in his eyes.\nBut the dragons, majestic, naval, bone mast and tendon rigging, escort them between the Lode Peaks. Their wings snap and shine with induced current. Below, Zaleha sees rivers of mercury and shining lakes that reek of kerosene even from this height. “Deadly land,” Tariune murmurs in her ear. “The Method War brought poison up from the earth. The springs yield frozen fire.”\nShe’s come to Aura, but she is not yet of it. With an empiricist’s reflex she imagines the chemistry of the land below. All its possible uses.\nThey come to the standing stones at the Third Pole. Lightning crashes down again and again, a dwindling ring around them. “Hurry!” Tariune calls to the dragons. “To the altar, before she dreams no more!”\nZaleha lies on her back in the ritual circle, and the Singers, the last of the ancient Rhexic Method who ruptured the walls of existence, begin to make her part of Aura, part of the song of the world and all it will become.\nShe looks up into the sky, at the vast planet above, at its twenty-four moons. Thinks of magnetospheres, of lithium, of kerosene rivers. “The Eye of Anaxis,” Tariune says, following her gaze. “We dreamed of reaching it long ago, before the Method War. Dreamed of finding some way to leap into the sky . . . ”\nAnd she feels all the things she is about to forget kindle within her, a rising light, a starfire torch.\nNur Zaleha, daughter of Abdul Samad, stands and raises her hands to stop the Rhexic sorcerers. “I will not go,” she says. “I can’t be part of Aura yet.”\n“Zaleha. No. Please.” Tariune cannot, does not, hide his horror. “If you refuse the ritual, your disease will rot your mind. You will go mad. You will die. And you are our only hope.”\n“There are other hopes I can offer.” She smiles. Bravely, she hopes. All she ever wanted was to change something. “Hopes from another world, worth my madness, worth my death. Hopes I carry in the part of me that you would leave behind.”\n“What of the darkness in the West?” the Rhexic Master protests. “What of the Bane of Kings, the usurper?”\n“When I’m done,” she promises the ancient woman, “you will have stars enough to light any darkness. Worlds enough to make any kingdom small.”\n“Nur Zaleha,” Tariune begins, and stumbles, and stops. She hears the break in his voice, the salt-and-leather man struggling to be the Prince again. “I promised you—I promised I would make your name true.”\nShe clasps his wrist. Smiles through the tears, grief and fear and joy and most of all gratitude to her friend. Her friends.\n“It means servant of the eternal,” she says. “Let me serve.”\nAnd with Prince Tariune, the Dragons of the Lode, and the last of the Rhexic as her witness, she begins to teach.\nSystems work differently on Aura.\nBut she loves these systems enough to make a story out of them, apoapsis to zenith and everything between.\nThey try to cure her later, when she feels she’s done enough. But she’s made her choice, written her own story, and the PRPC protein isoform is loose in her mind. She’s not dreaming anymore. There’s nothing left in her to put into Aura’s song. Nothing she hasn’t already written there.\nMore than two seasons later, on the last day of her sanity, she comes to lucidity long enough to feel Tariune drawing her through the kerosene stink. Hears him say, as if from a great distance: “She will bear your name. She and all her descendants.”\nShe dies in madness. But it’s a death she chose.\nmission outcomes: t + 1.4x10^14 years\nThe stars have gone out. The universe freezes in half-light. Even the singularities have started to evaporate.\nThe marathon is over. Existence has run its course.\nIn the isotropic night, defiant life gathers to escape: dark, cautious, vast. The machines at the end of time. A lineage so ancient and so fiercely intelligent it still remembers its birth around a blue world lost to ash.\nThe portal opens. A rift born of the same quintessence that will soon shred all matter, a wormhole designed by the highest savantries of machine computation. A gate to salvation.\nThe first probes make transit, plasma jets sparking in old robust shades of violet.\nA garden, they send. Matter, energy, strange new laws. Worlds of bone and gossamer, swan-winged ships out of ancient dream—\nFamiliar—\nThe apex mind of the gathered machines watches the probes greet a swift white starship. Recognizes the violet pulse of its attitude jets, stuttering with finesse.\n“This is Nur Zaleha,” the ship sends, the language ancient. “Welcome to Aura, the great crossroads.”\nA name. The specific form is obsolete—a word might as well be a pheromone, a protein on a cell wall. But the machines remember how to be polite. They search the vault of memory for something linked to Nur Zaleha.\nAnd to their genuine surprise, they find an ancient name, a progenitor, pivotal to the birth of higher machine life.\nThey make it theirs with a certain reverence. Lend it to the ambassador mind they’ve bootstrapped, a link to their new hosts.\n“Greetings, Nur Zaleha,” the emissary sends, and feels her first joy. “We are the Siv.”\nSeth Dickinson is the author of The Traitor Baru Cormorant and a lot of short stories, including \"Morrigan in the Sunglare\", this story's antecedent. He studied racial bias in police shootings, wrote much of the lore for Bungie Studios' Destiny, and threw a paper airplane at the Vatican. He teaches at the Alpha Workshop for Young Writers. If he were an animal, he would be a cockatoo."}