{"fingerprint": "8oyZYatfm2+HOncz/kWQ5y4RXV4=", "sitename": "Clarkesworld Magazine", "title": "Morrigan in the Sunglare by Seth Dickinson", "author": "Seth Dickinson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dickinson_03_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Morrigan in the Sunglare by Seth Dickinson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6290 words, short story\nMorrigan in the Sunglare\nThings Laporte says, during the war—\nThe big thing, at the end:\nThe navigators tell Laporte that Indus is falling into the sun.\nThink about the difficulty of it. On Earth, Mars, the moons of Jupiter, the sun wants you but it cannot have you: you slip sideways fast enough to miss. This is the truth of orbit, a hand-me-down birthright of velocity between your world and the fire. You never think about it.\nUnless you want to fall. Then you need to strip all that speed away. Navigators call it killing your velocity (killing again: Laporte’s not sure whether this is any kind of funny). It takes more thrust to fall into the sun than to escape out to the stars.\nIndus made a blind jump, fleeing the carnage, exit velocity uncertain.\nAnd here they are. Falling.\nThey are the last of Indus’ pilots and there is nothing left to fly, so Laporte and Simms sit in the empty briefing room and play caps. The ship groans around them, ruined hull protesting the efforts of the damage control crews—racing to revive engines and jump drive before CME radiation sleets through tattered armor and kills everyone on board.\n“What do you think our dosage is?” Laporte asks.\n“I don’t know. Left my badge in my bunk.” Simms rakes her sweat-soaked hair, selects a cap, and antes. Red emergency light on her collarbone, on the delta of muscle there. “Saw a whole damage control party asleep in the number two causeway. Radiation fatigue.”\n“So fast? That’s bad, boss.” Laporte watches her Captain, pale lanky daughter of Marineris sprawled across three seats in the half-shed tangle of her flight suit, and makes a fearful search for damage. Radiation poisoning, or worse. A deeper sort of wound.\nIn the beginning Simms was broken and Laporte saved her, a truth Simms has never acknowledged but must must know. And she saved Laporte in turn, by ferocity, by hate, by being the avatar of everything Laporte didn’t know.\nAnd here in the sunglare Laporte is afraid that the saving’s been undone. Not that it should matter, this concern of hearts, when they’ll all be dead so soon—but—\n“Hey,” Laporte says, catching on. “You sneak, boss. I call bullshit.”\n“Got me.” Simms pushes the bottlecap (ARD/AE-002 ANTI RADIATION, it says) across. A little tremble in her fingers. Not so severe. “They’re all too busy to sleep.”\nThe caps game is an Ubuntu game, a children’s game, a kill-time game, an I’m-afraid game. Say something, truth or lie. See if your friends call it right.\nIt teaches you to see other people. Martin Mandho, during a childhood visit, told her that. This is why it’s so popular in the military. Discipline and killing require dehumanization. The caps game lets soldiers reclaim shared subjectivity.\n“Your go, Morrigan,” Simms says, shuffling her pile of ARD/AE-002 caps. The callsign might be a habit, might be a reminder: we’re still soldiers.\n“I was in CIC. Think I saw Captain Sorensen tearing up over a picture of Captain Kyrematen.” Yangtze’s skipper, Sorensen’s comrade. Lost.\nSimms’ face armors up. “I don’t want to talk about anything that just happened.”\n“Is that a call?”\n“No. Of course it’s true.”\nLaporte wants to stand up and say: fuck this. Fuck this stupid game, fuck the rank insignia, fuck the rules. We’re falling into the sun, there’s no rescue coming. Boss, I—\nBut what would she say? It’s not as simple as the obvious thing (and boy, it’s obvious), not about lust or discipline or loyalty. Bigger than that, truer than that, full of guilt and fire and salvation, because what she really wants to say is something about—\nAbout how Simms is—important, right, but that’s not it. That’s not big enough.\nLaporte can’t get her tongue around it. She doesn’t know how to say it.\nSimms closes her eyes for a moment. In the near distance, another radiation alarm joins the threnody.\nThings Laporte already knows how to say—\nI’m going to kill that one, yes, I killed him. Say it like this:\nMorrigan, tally bandit. Knife advantage, have pure, pressing now.\nGuns guns guns.\nAnd the ship in her sights, silver-dart Atalanta built under some other star by hands not unlike her own, the fighter and its avionics and torch and weapons and its desperate skew as it tries to break clear, the pilot too—they all come apart under the coilgun hammer. The pilot too.\nBlossoming shrapnel. Spill of fusion fire. Behold Laporte, starmaker. (Some of the color in the flame is human tissue, atomizing.)\nShe made her first kill during the fall of Jupiter, covering Third Fleet’s retreat. Sometimes rookies fall apart after their first, eaten up by guilt. Laporte’s seen this. But the cry-scream-puke cycle never hits her, even though she’s been afraid of her own compassion, even though her callsign was almost Flower Girl.\nInstead she feels high.\nThere’s an Ubuntu counselor waiting on the Solaris, prepared to debrief and support pilots with post-kill trauma. She waves him away. Twenty years of Ubuntu education, cherish all life hammered into the metal of her. All meaningless, all wasted.\nThat high says: born killer.\nShe was still flying off the Solaris here, Kassim on her wing. Still hadn’t met Simms yet.\nWho is Lorna Simms? Noemi Laporte thinks about this, puzzles and probes, and sometimes it’s a joy, and sometimes it hurts. Sometimes she doesn’t think about it at all—mostly when she’s with Simms, flying, killing.\nMaybe that’s who Simms is. The moment. A place where Laporte never has to think, never has a chance to reflect, never has to be anything other than laughter and kill-joy. But that’s a selfish way to go at it, isn’t it? Simms is her own woman, impatient, profane, ferocious, and Laporte shouldn’t make an icon of her. She’s not a lion, not a war-god, not some kind of oblivion Laporte can curl up inside.\nA conversation they have, after a sortie, long after they saved each other:\n“You flew like shit today, Morrigan.”\n“That so, boss?”\nSquared off in the shower queue, breathing the fear stink of pilots and Indus crew all waiting for cold water. Simms a pylon in the crowd and dark little Laporte feels like the raven roosting on her.\n“You got sloppy on your e-poles,” Simms says. “Slipped into the threat envelope twice.”\n“I went in to finish the kill, sir. Calculated risk.”\n“Not much good if you don’t live to brag about it.”\n“Yet here I am, sir.”\n“You’ll spend two hours in the helmet running poles and drags before I let you fly again.” Simms puts a little crack of authority on the end of the reprimand, and then grimaces like she’s just noticed the smell. “Flight Lieutenant Levi assures me that they were good kills, though.”\nLaporte is pretty sure Simms hasn’t spoken to Levi since preflight. She grins toothsomely at her Captain, and Simms, exasperated, grinning back though (!), shakes her head and sighs.\n“You love it, don’t you,” she says. “You’re happy out there.”\nLaporte puts her hands on the back of her head, an improper attitude towards a superior officer, and holds the grin. “I’m coming for you, sir.”\nShe’s racing Simms for the top of the Second Fleet kill board. They both know who’s going to win.\nI’m in trouble. Say it like this:\nBoss, Morrigan, engaged defensive, bandit my six on plane, has pure.\nAnd Simms’ voice flat and clear on the tactical channel, so unburdened by tone or technology that it just comes off like clean truth, an easy promise on a calm day, impossible not to trust:\nBreak high, Morrigan. I’ve got you.\nThere’s a little spark deep down there under the calm, an ember of rage or glee. It’s the first thing Laporte ever knew about Simms, even before her name.\nLaporte had a friend and wingman, Kassim. He killed a few people, clean ship-to-ship kills, and afterwards he’d come back to the Solaris with Laporte and they’d drink and shout and chase women until the next mission.\nBut he broke. Sectioned out. A psychological casualty: cry-scream-puke.\nWhy? Why Kassim, why not Laporte? She’s got a theory. Kassim used to talk about why the war started, how it would end, who was right, who was wrong. And, fuck, who can blame him? Ubuntu was supposed to breed a better class of human, meticulously empathic, selflessly rational.\nCare for those you kill. Mourn them. They are human too, and no less afraid.\nHow could you think like that and then pull the trigger, ride the burst, guns guns guns and boom, scratch bandit, good kill? So Laporte gave up on empathy and let herself ride the murder-kick. She hated herself for it. But at least she didn’t break.\nToo many people are breaking. The whole Federation is getting its ass kicked.\nAfter Kassim sectioned out, Laporte put in for a transfer to the frigate Indus, right out on the bleeding edge. She’d barely met Captain Simms, barely knew her. But she’d heard Simms on FLEETTAC, heard the exultation and the fury in her voice as she led her squadron during the Meridian ambush and the defense of Rheza Station.\n“It’s a suicide posting,” Captain Telfer warned her. “The Indus eats new pilots and shits ash.”\nBut Simms’ voice said: I know how to live with this. I know how to love it.\nI’m with you, Captain Simms. I’ll watch over you while you go ahead and make the kill. Say it like this:\nBoss, Morrigan, tally, visual. Press!\nThat’s all it takes. A fighter pilot’s brevity code is a strict, demanding form: say as much as you can with as few words as possible, while you’re terrified and angry and you weigh nine times as much as you should.\nLike weaponized poetry, except that deep down your poem always says we have to live. They have to die.\nFor all their time together on the Indus, Laporte has probably spoken more brevity code to Simms than anything else.\nPeople from Earth aren’t supposed to be very good at killing.\nNoemi Laporte, callsign Morrigan, grew up in a sealed peace. The firewall defense that saved the solar system from alien annihilation fifty years ago also collapsed the Sol-Serpentis wormhole, leaving the interstellar colonies out in the cold—a fistful of sparks scattered to catch fire or gutter out. Weary, walled in, the people of Sol abandoned starflight and built a cozy nest out of the wreckage: the eudaimonic Federation, democracy underpinned by gentle, simulation-guided Ubuntu philosophy. We have weathered enough strife, Laporte remembers—Martin Mandho, at the podium in Hellas Planitia for the 40th anniversary speech. In the decades to come, we hope to build a community of compassion and pluralism here in Sol, a new model for the state and for the human mind.\nAnd then they came back.\nNot the aliens, oh no no, that’s the heart of it—they’re still out there, enigmatic, vast, xenocidal. And the colonist Alliance, galvanized by imminent annihilation, has to be ready for them.\nReady at any price.\nThese are our terms. An older Laporte, listening to another broadcast: the colonists’ Orestes at the reopened wormhole, when negotiations finally broke down. We must have Sol’s wealth and infrastructure to meet the coming storm. We appealed to your leaders in the spirit of common humanity, but no agreement could be reached.\nThis is a matter of survival. We cannot accept the Federation’s policy of isolation. Necessity demands that we resort to force.\nThat was eighteen months ago.\nA lot of people believe that the whole war’s a problem of communication, fundamentally solvable. Officers in the Solaris’ off-duty salon argue that if only the Federation and the Alliance could just figure out what to say, how to save face and stand down, they could find a joint solution. A way to give the Alliance resources and manpower while preserving the Federation from socioeconomic collapse and the threat of alien extermination. It’s the Ubuntu dream, the human solution.\nCaptain Simms doesn’t hold to that, though.\nA conversation they had, on the Indus’ observation deck:\n“But,” Laporte says (she doesn’t remember her words exactly, or what she’s responding to; and anyway, she’s ashamed to remember). “The Alliance pilots are people too.”\n“Stow that shit.” Simms’ voice a thundercrack, unexpected: she’d been across the compartment, speaking to Levi. “I won’t have poison on my ship.”\nThe habit of a lifetime and the hurt of a moment conspire against military discipline and Laporte almost makes a protest—Ubuntu says, Martin Mandho said—\nBut Simms is already on her, circling, waiting for the outspoken new transfer to make one more mistake. “What’s the least reliable weapons system on your ship, Morrigan?”\nA whole catalogue of options, a bestiary of the Federation’s reluctant innovations—least reliable? Must be the Mulberry GES-2.\n“Wrong. It’s you. Pilots introduce milliseconds of unaffordable latency. In a lethal combat environment, hesitation kills.” Simms is talking to everyone now, making an example of Laporte. She sits there stiff and burning waiting for it to be over. “If the Admiralty had its way, they’d put machines in these cockpits. But until that day, your job is to come as close as you can. Your job is to keep your humanity out of the gears. How do you do that?”\n“Hate, sir,” Levi says.\n“Hate.” Simms lifts her hands to an invisible throat. Bears down, for emphasis, as her voice drops to a purr. She’s got milspec features, aerodyne chin, surgical cheekbones, and Laporte feels like she’s going to get cut if she stares, but she does. “There are no people in those ships you kill. They have no lovers, no parents, no home. They were never children and they will never grow old. They invaded your home, and you are going to stop them by killing them all. Is that clear, Laporte?”\nWillful, proud, stupid, maybe thinking that Simms would give her slack on account of that first time they flew together, Laporte says: “That’s monstrous.”\nSimms puts the ice on her: full-bore all-aspect derision. “It’s a war. Monsters win.”\nThe Alliance flagship, feared by Federation pilot and admiral alike, is Atreus. Her missile batteries fire GTM-36 Block 2 Eos munitions (memorize that name, pilot. Memorize these capabilities). The Atreus’ dawn-bringers have a fearsome gift: given targeting data, they can perform their own jumps. Strike targets far across the solar system. The euphemism is ‘over the horizon.’\nLaporte used to wonder about the gun crews who run the Eos batteries. Do they know what they’re shooting at, when they launch a salvo? Do they invent stories to assure each other that the missiles are intended for Vital Military Targets? When they hear about collateral damage, a civilian platform shattered and smashed into Europa’s ice in the name of ‘shipping denial,’ do they speculate in a guilty hush: was that us?\nMaybe that’s the difference between the Alliance and the Federation, the reason the Alliance is winning. The colonists can live with it.\nShe doesn’t wonder about these things any more, though.\nOne night in the gym the squadron gets to sparring in a round robin and then Laporte’s in the ring with Simms, nervous and half-fixed on quitting until they get into it and slam to the mat, grappling for the arm-bar or the joint lock, and Laporte feels it click: it’s just like the dogfight, like the merge, pacing your strength exactly like riding a turn, waiting for the moment to cut in and shoot.\nShe gets Simms in guard, flips her, puts an elbow in her throat. Feels herself grinning down with the pressure while everyone else circles and hoots: Morrrrrrigan—look at her, she’s on it—\nSimms looks back up at her and there’s this question in her wary wonderful eyes, a little annoyed, a little curious, a little scared: what are you?\nShe rolls her shoulders, lashes her hips, throws Laporte sideways. Laporte’s got no breath and no strength left to spend but she thinks Simms’ just as tapped and the rush feeds her, sends her clawing back for the finish.\nSimms puts her finger up, thumb cocked, before Laporte can reach her. “Bang,” she says.\nLaporte falls on her belly. “Oof. Aargh.”\nIt’s important that Simms not laugh too hard. She’s got to maintain command presence. She’s been careful about that, since their first sortie.\nYou need help, Captain Simms. Say it like this:\nThis is the first time they flew together, when Laporte saved Simms. It happened because of a letter Laporte received, after her transfer to Indus was approved but before she actually shuttled out to her new post.\nFLEETNET PERSONAL—TAIGA/TARN/NODIS\nFLIGHT LIEUTENANT KAREN NG [YANGTZE]\n//ENSIGN NOEMI LAPORTE [INDUS]\nLaporte:\nJust got word of your transfer. You may remember me from the Nauticus incident. I’m de facto squadron leader aboard Yangtze. Lorna Simms and I go way back.\nAdmiral Netreba is about to select ships for a big joint operation against the Alliance. Two months ago the Indus would have been top of the list, and Simms with it. But they’ve been on the front too long, and the scars are starting to show.\nI hear reports of a 200% casualty rate. Simms and Ehud Levi are the only survivors of the original squadron. I hear that Simms doesn’t give new pilots callsigns, that she won’t let the deck crew paint names on their ships. If she’s going to lose her people, she’d rather not allow them to be people.\nIt’s killing morale. Simms won’t open up to her replacements until they stop dying, and they won’t stop dying until she opens up.\nI want the Indus with us when we make our move, but Netreba won’t pick a sick ship. See if you can get through to Simms.\nRegards,\nKaren Ng\nLaporte takes this shit seriously. When Simms takes her out for a training sortie, a jaunt around the Martian sensor perimeter, she’s got notes slipped into the plastic map pockets on her flightsuit thighs, gleaned from gossip and snippy FLEETNET posts: responds well to confidence and plain talk, rejects overt empathy, accepts professional criticism but will enforce a semblance of military discipline. No pictures, though.\nShe knows she’s overthinking it, but fuck, man, it’s hard not to be nervous. Simms is her new boss, her wartime idol, the woman who might get her killed. Simms is supposed to teach her how to live with—with all this crazy shit. And now it turns out she’s broken too? Is there anyone out here who hasn’t cracked?\nMaybe a little of that disappointment gets into Laporte’s voice. Afterwards, because of the thing that happens next, she can’t remember exactly how she broached it—professional inquiry, officer to superior? Flirtatious breach of discipline? Oafishly direct? But she remembers it going bad, remembers Simms curling around from bemusement to disappointment, probably thinking: great, Solaris is shipping me its discipline cases so I can get them killed.\nThen the Alliance jumps them. Four Nyx, a wolfpack out hunting stragglers. Bone-white metal cast in shark shapes. Shadows on the light of their own fusion stars.\nSimms, her voice a cutting edge, a wing unpinioned, shedding all the weight of death she carries: “Morrigan, Lead, knock it off, knock it off, I see jump flash, bandits two by two.” And then, realizing as Laporte does that they’re not getting clear, that help’s going to be too long coming: “On my lead, Morrigan, we’re going in. Get your fangs out.”\nAnd Laporte puts it all away. Seals it up, like she’s never been able to before. Just her and the thirty-ton Kentauroi beneath her and the woman on her wing.\nThey hit the merge in a snarl of missile and countermeasure and everything after that blurs in memory, just spills together in a whirl of acceleration daze and coilgun fire until it’s pointless to recall, and what would it mean, anyway? You don’t remember love as a series of acts. You just know: I love her. So it is here. They fought, and it was good. (And damn, yes, she loves Simms, that much has been apparent for a while, but it’s maybe not the kind of love that anyone does anything about, maybe not the kind it’s wise to voice or touch.) She remembers a few calls back and forth, grunted out through the pressure of acceleration. All brevity code, though, and what does that mean outside the moment?\nTwo gunships off Yangtze arrive to save them and the Alliance fighters bug out, down a ship. Laporte comes back to the surface, shaking off the narcosis of the combat trance, and finds herself talking to Simms, Simms talking back.\nSimms is laughing. “That was good,” she says. “That was good, Morrigan. Damn!”\nIndus comes off the line less than twelve hours later, yielding her patrol slot to another frigate. Captain Simms takes the chance to drill her new pilots to exhaustion and they begin to loathe her so profoundly they’d all eat a knife just to hear one word of her approval. Admiral Netreba, impressed by Indus’ quick recovery, taps the frigate for his special task force.\nLaporte knows her intervention made a difference. Knows Simms felt the same exhilaration, flying side by side, and maybe she thought: I’ve got to keep this woman alive.\nSimms just needed to believe she could save someone.\nAlliance forces in the Sol theater fall under the command of Admiral Steele, a man with Kinshasa haute-couture looks and winter-still eyes. Sometimes he gives interviews, and sometimes they leak across the divide.\n“Overwhelming violence,” he answers, asked about his methods. “The strategic application of shock. They’re gentle people, humane, compassionate. Force them into violent retaliation, and they’ll break. The Ubuntu philosophy that shapes their society cannot endure open war.”\n“Some of your critics accuse you of atrocity,” the interviewer says. “Indiscriminate strategic bombing. Targeted killings against members of the civilian government in Sol.”\nSteele puts his hands together, palm to palm, fingers laced, and Laporte would absolutely bet a bottle cap that the sorrow on his face is genuine. “The faster I end the war,” he says, “the faster we can stop the killing. My conscience asks me to use every tool available.”\n“So you believe this is a war worth winning? That the Security Council is right to pursue a military solution to this crisis?”\nSteele’s face gives nothing any human being could read, but Laporte, she senses determination. “That’s not my call to make,” he says.\nThis happens after the intervention, after Simms teaches Laporte to be a monster (or lets her realize she already was), after they manage the biggest coup of the war—the capture of the Agincourt. Before they fall into the sun, though.\nThey take some leave time, Simms and Laporte and the rest of the Indus pilots, and the Yangtze’s air wing too. Karen Ng has a cabin in Tharsis National Park, on the edge of Mars’ terraformed valleys. Olympus Mons fills the horizon like the lip of a battered pugilist, six-kilometer peak scraping the edge of atmosphere. Like a bridge between where they are and where they fight.\nBarbeque on the shore of Marineris Reservoir. The lake is meltwater from impacted comets, crystalline and still, and Levi won’t swim in it because he swears up and down it’s full of cyanide. They’re out of uniform and Laporte should really not take that as an excuse but, well, discipline issues: she finds Simms, walking the shore.\n“Boss,” she says.\n“Laporte.” No callsign. Simms winds up and hurls a stone. It doesn’t even skip once: hits, pierces, vanishes. The glass of their reflections shatters and reforms. Simms chuckles, a guarded sound, like she’s expecting Laporte to do something worth reprimand, like she’s not sure what she’ll do about it. “Been on Mars before?”\n“Uh, pretty much,” Laporte mumbles, hoping to avoid this conversation: she was at Hellas for Martin Mandho’s speech ten years ago, but she was a snotty teenager, Earthsick, and single-handedly ruined Mom’s plan to see more of the world. “Never with a native guide, though.”\n“Tourist girl.” Simms tries skipping again. “Fuck!”\n“Boss, you’re killing me.” Laporte finds a flat stone chip, barely weathered, and throws it—but Mars gravity, hey, Mars gravity is a good excuse for that. “Mars gravity!” she pleads, while Simms laughs, while Laporte thinks about what a bad idea this is, to let herself listen to that laugh and get drunk. Fleet says: no fraternization.\nThey walk a while.\n“You really hate them?” Laporte asks, forgetting whatever wit she had planned the instant it hits her tongue.\n“The colonists? The Alliance?” Simms squints up Olympus-ways, one boot up on a rock. The archetypical laconic pioneer, minus only that awful Mongolian chew everyone here adores. “What’s the alternative?”\n“Didn’t you go to school?” Ubuntu never found so many ears on hardscrabble Mars. “They gave it to us every day on Solaris: love them, understand them, regret the killing.”\n“Ah, right. ‘He has a husband,’ I remember, shooting him. ‘May you find peace,’ I pray, uncaging the seekers.” Simms rolls the rock with her boot, flipping it, spinning it on its axis. “And you had this in your head, the first time you made a kill? You cut into the merge and lined up the shot thinking about your shared humanity?”\n“I guess so,” Laporte says. A good person would have thought about that, so she’d thought about it. “But it didn’t stop me.”\nSimms lets the rock fall. It makes a flinty clap. She eyes Laporte. “No? You weren’t angry? You didn’t hate?”\n“No.” She thinks of Kassim. “It was so easy for me. I thought I was sick.”\n“Huh,” Simms says, chewing on that. “Well, can’t speak for you, then. But it helps me to hate them.”\n“Hate’s inhumane, though.” Words from a conscience she’s kept buried all these months. “It perpetuates the cycle.”\n“I wish the universe gave power to the decent. Protection to the humane.” Simms shrugs, in her shoulders, in her lips. “But I’ve only seen one power stop the violent, and it’s a closer friend to hate.”\nShe’s less coltish down here, like she’s got more time for every motion, like she’s set aside her haste. “Hey,” Laporte says, pressing her luck. “When I transferred in. You were—in a tough place.”\nSimms holds up a hand to ward her off. “You can see the ships,” she says.\nMars is a little world with a close horizon and when she looks up Laporte feels like she’s going to lose her balance and fall right off, out past Phobos, into a waiting wolfpack, into the Eos dawnbringers from over the horizon. She takes a step closer to Simms, towards the stanchion that keeps her down.\nHigh up there some warship’s drive flickers.\n“I was pretty sure,” Simms says, “that everyone I knew was going to die, and that I couldn’t stop it. That’s where I was, when you transferred in.”\n“And now?” Laporte asks, still watching the star. It’s a lot further away, a lot safer.\n“Jury’s out,” Simms says. Laporte’s too skittish to check whether she’s joking. “Look. Moonsrise. You’ve got to tell me a secret.”\n“Are you fucking with me?”\n“Native guide,” Simms says, rather smugly.\n“When I was a kid,” Laporte says, “I had an invisible friend named Ken. He told me I had to watch the ants in the yard go to war, the red ants and the black ones, and that I had to choose one side to win. He said it was the way of things. I got a garden hose and I—I took him really seriously—”\nSimms starts cracking up. “You’re a loon,” she chokes. “I’m glad you’re on my side.”\n“I wonder what we’ll do after this,” Laporte says.\nSimms sobers up. “Don’t think about that. It’ll kill you.”\nLaporte listens to the flight data record of that training sortie, the tangle with the Nyx wolfpack, just to warm her hands on that fire, to tremble at the inarticulate beauty of the fight:\n“—am spiked, am spiked, music up. Bandit my seven high, fifteen hundred, aspect attack.”\n“Lead supporting.” The record is full of warbling alarms, the voices of a ship trying to articulate every kind of danger. “Anchor your turn at, uh—fuck it, just break low, break low. Padlocking—”\n“Kill him, boss—”\n“Guns.” A low, smooth exhalation, Simms breathing out on the trigger. “Guns.”\n“Nice. Good kill. Bandit your nine low—break left—”\nEverything’s so clear. So true. Flying with Simms, there’s no confusion.\nThey respond to a distress call from a civilian vessel suffering catastrophic reactor failure. Indus jumps on-scene to find an Alliance corvette, Arethusa, already providing aid to the civilian. Both sides launch fighters, slam down curtains of jamming over long-range communications, and prepare to attack.\nBut neither of them have enough gear to save the civilian ship—the colonists don’t have the medical suite for all her casualties; Indus can’t provide enough gear to stabilize her reactor. Captain Sorensen negotiates a truce with the Arethusa’s commander.\nLaporte circles Indus, flying wary patrol, her fingers on the master arm switch. Some of the other pilots talk to the colonists on GUARD. They talk back, their accents skewed by fifty years of linguistic drift, their humanity still plain. One of the enemy pilots, callsign Anansi, asks for her by name: there’s a bounty on her head, an Enemy Ace Incentive, and smartass Anansi wants to talk to her and live to tell. She mutes the channel.\nWhen she stops and thinks about it, she doesn’t really believe this war is necessary. So it’s quit, or—don’t think about it. That’s what Simms taught her: you go in light. You throw away everything about yourself that doesn’t help you kill. Strip down, sharpen up. Weaponize your soul.\nAnother Federation frigate, Hesperia, picks up the distress signal, picks up the jamming, assumes the worst. She has no way to know about the truce. When she jumps in she opens Arethusa’s belly with her first salvo and everything goes back to being simple.\nLaporte gets Anansi, she’s pretty sure.\nFresh off the Agincourt coup, they make a play for the Carthage—Indus, Yangtze, Altan Orde, Katana, and Simms riding herd on three full squadrons. It’s a trap. Steele’s been keeping his favorite piece, the hunter-killer Imperieuse, in the back row. She makes a shock jump, spinal guns hungry.\nEveryone dies.\nThe last thing Laporte hears before she makes a crash-landing on Indus’ deck is Captain Simms, calling out to Karen Ng, begging her to abandon Yangtze, begging her to live. But Karen won’t leave her ship.\nIndus jumps blind, destination unplotted, exit vector unknown. The crash transition wrecks her hangar deck, shatters her escape pods in their mounts.\nShe falls into light.\nSo Laporte was wrong, in the end. The death of everyone Simms knew was inevitable.\nMonsters win.\nLaporte stacks her bottlecaps and waits for Simms to offer her a word.\nThe game is just a way to pass the time. Not real speech, not like the chatter, like the brevity code. Out there they could talk. And is that why they’re alive, just the two of them? Even Levi, old hand Levi, came apart at the end, first in his head when he saw the bodies spilling out of Altan Orde and then in his cockpit when the guns found him. But Simms and Laporte, they flew each other home. Home to die in this empty searing room with the bolted-down frame chairs and the bottle caps and their cells rotting inside them.\nOr maybe it’s just that Simms hated harder than anyone else, hesitated the least. And Laporte, well—she’s never hesitated at all.\n“It’s my fault we’re here,” Laporte says, even though it’s not her turn.\n“Yeah?” Simms, she’s got red in her eyes, a tremor in her frame.\n“If I hadn’t listened to Karen’s note, if I hadn’t done whatever I did to wake you up.” If they’d never met. “Netreba never would’ve picked Indus for the task force. We wouldn’t have been at the ambush. Wouldn’t have watched Imperieuse kill our friends.”\n“All you did was fly my wing,” Simms says. “It’s not your fault.” But she knows exactly what Laporte’s talking about.\nSimms picks up a bottle cap and puts it between them. “I’m transferring you to Eris,” she says. “Netreba’s flagship. On track for a squadron command.”\n“Bullshit.” Because they’re not going to live long enough to transfer anywhere.\nSimms wraps the cap up in her shaking hand and draws it back. “I already put the order in,” she says. “Just in case.”\nA dosage alarm shrieks and stops: someone from damage control, silencing the obvious. Beams of ionizing radiation piercing the torn armor, arcing through the crew spaces as Indus tumbles and falls.\nIs this the time to just give up on protocol? To get her boss by the wrists and beg: wait, stop, please, let me explain, let me stay? We’ll make it, rescue will come, we’ll fly again? But she gets it. She’s got that Ubuntu empathy bug. She can feel it in Simms, the old break splintering again: I can’t watch these people die.\nLaporte’s the only people she’s got left. So Simms has to send her away.\n“Boss,” she says. “You taught me—without you I wouldn’t—”\nKilling, it’s like falling into the sun: you’ve got all this compassion, all this goodwill, keeping you in the human orbit. All that civilization that everyone before you worked to build. And somehow you’ve got to lose it all.\nOnly Laporte never—\n“Without me,” Simms says, and she’s got no mercy left in her tongue, “you’d be fine. You’ll be fine. You’re a killer. That’s all you need—no reasons, no hate. It’s just you.”\nShe lets her head loll back and exhales hard. The lines of her arched throat kink and smooth.\n“Fuck,” she says. “It’s hot.”\nLaporte opens her hand. Asking for the cap. She doesn’t have the spit to say: true.\nCaptain Simms makes herself comfortable, flat on her back across three chairs. “Your turn,” she says.\n“Boss,” Laporte rasps. “Fuck. Excuse me.” She clears her throat. Might as well go for it: it begs to be said. “Boss, I . . . ”\nBut Simms has gone. She’s asleep, breathing hard. It’s lethargy, the radiation pulling her down. Giving her some peace.\nLaporte calls a medical team. While she waits she tries to find a blanket, but Simms seems to prefer an uneasy rest. She breathes a little easier when Laporte touches her shoulder, though, and Laporte thinks about clasping her hand.\nBut, no, that’s too much.\nFederation ships find them. A black ops frigate, running signals intelligence in deep orbit, picks Indus’ distress cries from the solar background. Salvage teams scramble to make her ready for one last jump to salvation.\nLaporte’s waiting by her Captain’s side when they come for her. The medical team, and the woman with the steel eyes.\n“Laporte,” the new woman says. “The Indus ace. Came looking for you.”\nBy instinct and inclination Laporte stands to shield her Captain from the grey-clad woman, from her absent insignia and hidden rank. She can’t figure out a graceful way to drop the bottle cap so she just holds it like a switch for some hidden explosive, for the grief that wants to get out any way it can. “I need to stay with my squadron leader,” she says.\n“If I’m reading this order right,” Steel Eyes says, though she’s got no paper or tablet and the light on her iris makes little crawling signs, “she’s shipping you out.” She opens a glove in invitation. “I’m with Federation wetwork. Elite of the elite. I’m recruiting pilots for ugly jobs.”\nLaporte hesitates. She wants to stay, wants it like nothing she knows how to tell. But Steel Eyes stares her down and her gaze cuts deep. “I know you like you wouldn’t begin to believe,” she says. “I watched you learn what you are. We don’t have many of your kind left here in Sol. We made ourselves too good. And it’s killing us.”\n“Please,” Laporte croaks. “I can’t leave her.”\nThe woman from the eclipse depths of Federation intelligence extends her open hand. A gesture of compassion, though she’s wearing tactical gloves. “What do you think happens if you stay? You’re not going to stop changing, Noemi. You’re never going back to humanity.”\nShe sighs a little, not a hesitation, maybe an apology. “This woman, here, this loyalty you have. You’re going to be an alien to her.”\nLaporte doesn’t know how to argue with that. Doesn’t know how to speak her defiance. Maybe because Steel Eyes is right.\n“Ubuntu,” the woman says, “is a philosophy of human development. We have a use for everyone. Even, in times like these, for us monsters.”\nWhat’s she got left? What the fuck else is there? She gave it all up to become a better killer. Humanity’s just dead weight on her trigger.\nNothing but Simms and wreckage in the poison sunlight.\n“You know we’re losing,” Steel Eyes says. “You know we need you.”\nAh. That’s it. The thing she’s been trying to say:\nMonsters kill because they like it, and that’s all Laporte had. Until this new thing, this fragile human thing, until Simms.\nSomething worth fighting for. A small, stupid, precious reason.\nLaporte gets down on her knees. Puts herself as close to the salt sand cap of Simms’ hair as she’s ever been. Says it, the best way she knows, promising her, promising herself:\n“Boss,” she whispers. “Hey. I’ll see you when we win.”\nFor Darius and the Blue Planet crew.\nSeth Dickinson is the author of The Traitor Baru Cormorant and a lot of short stories, including \"Morrigan in the Sunglare\", this story's antecedent. He studied racial bias in police shootings, wrote much of the lore for Bungie Studios' Destiny, and threw a paper airplane at the Vatican. He teaches at the Alpha Workshop for Young Writers. If he were an animal, he would be a cockatoo."}