{"fingerprint": "U77latBKHeEUspOLe1YO4qvyF3U=", "sitename": "Clarkesworld Magazine", "title": "Morrigan in Shadow by Seth Dickinson", "author": "Seth Dickinson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dickinson_12_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Morrigan in Shadow by Seth Dickinson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14460 words, novelette\n Morrigan in Shadow\n capella 1/8\n She’s falling into the singularity.\n Straight off her nose, shrouded in the warp of its mass, is the black hole that ate a hundred million colonists and the hope of all mankind.\n So Laporte throttles up. Her fighter rattles with the fury of its final burn.\n Spaceflight is about orbits. That’s how one thing relates to another, up here: I whirl around you. I try to pull away. You try to pull me in. If we don’t smash each other apart, or skip away into the void, maybe we can negotiate something stable.\n But Laporte has learned that sometimes you just need to fall.\n Her instruments don’t understand what’s happening. They’re military avionics, built to hunt and kill other warships (other people) in cold flat space. Thus Laporte flies her final mission in a screaming constellation of errors, cautions, icy out-of-range warnings. An array of winter-colored protests from a machine that doesn’t know where it is or why it’s about to die.\n She wants to pat the ship (a lovely, lethal, hard-worn Uriel gunship, built under Martian skies, the skies of her lover’s childhood) on its nose and say: there, there, I know exactly how you feel. I’m with you, man. This shit is beyond me.\n But it’s not beyond her. She knows why she’s here.\n Laporte never thought she’d be a good soldier. Certainly she’d never planned to be an exceptional killer. Or a mutineer leading a revanchist fleet up out of Earth’s surrender and into a crusade across the length of human space. Or, in her final act as a human being (if she dares make claim to that title any more), the avatar of an omnicidal alien power with no intelligence, no awareness, and a billion-year-old cosmic imperative to destroy all higher thought.\n But she is all those things now. Born from the tragedy of a war as unnecessary as it was inevitable. Shaped by combat and command and (between it all, pulling in the opposite direction) the love of the finest woman she’s ever met.\n After all that, after Simms and NAGARI and That Revelation Ken, she knows why she’s here. She knows what force plucked her out of paradise and fired her down the trajectory of her short, violent life. To this distant terminus where the universe folds up behind her into a ring of light, everything she loves, everyone she’s hurt, receding.\n She knows what she’s come to kill. The object of her last assassination.\n “Boss, this is Morrigan,” she tells her flight recorder. “I am descending towards the target.”\n That’s what she calls Simms, even now. Not ‘love’. Boss.\n There are three stories here, although they are all one:\n What happened in Capella, at the end.\n What happened with NAGARI, at the beginning.\n What happened between Noemi Laporte and Lorna Simms, which is the most important story, and the one that binds the others.\n It begins with the war, and with Lorna Simms—\n simms 1/9\n For a long time, long enough to murder tens of thousands of people, Laporte thought Simms was dead.\n They fought for the United Earth Federation in the war against the colonist Alliance. Laporte and Simms were Federation combat pilots (SQUADRON VFX-01 2FM/FG2101 INDUS—The Wargods, Captain Lorna Simms Commanding) and they were good, so good, they fought like two fists on a drunken boxer, moved by instinct and kill-joy. Of course, a boxer has a body as well as a pair of fists—but they tried not to consider the shape of what connected them.\n It wasn’t love or lust alone (they were soldiers and their discipline held), nor was it only respect, or fear, or sly admiration. Something of all of this. Whatever connected them, it helped them fight. Simms the Captain, leader of killers, and Laporte her faithful wingman, who was the finest killer.\n And they fought to save their Federation, their happy humanist utopia, Earth and Mars and the Jupiter moons—a community of people making each other better. They fought hard.\n The war is a civil war. As intimate and violent and hard to name as the bond between Laporte and Simms. An apocalyptic exchange of fratricides between the Federation and its own far-flung interstellar colonists: the Alliance.\n For a little while, long enough to give them hope, Laporte and Simms and their Wargods almost won the war.\n Then the Alliance clockmaker-admiral, the cryogenic bastard Steele, set a trap. It caught Simms, Laporte, and their whole squadron. Everyone died. It was like a lesson: no band of heroes will save you. No soldiers bound by law and decency.\n Out of that ambush Simms and Laporte flew each other to refuge, but it was not refuge enough, the war was in their bones and flesh now: Simms was dying, poisoned by radiation. So they sat together on a crippled warship and they talked about anything but each other.\n Remember that? After the ambush at Saturn? Remember adjusting Simms’ blankets and pressing your cheek to her throat? Hoping she’d live long enough for both of you to die together, as you’d always dreamed?\n (Laporte’s dreams are not, it turns out, wholly her own.)\n The Alliance was winning, they agreed. Neither of them could see a way to avoid defeat. Neither of them would admit that to the other—not defeat, nor the other thing between them.\n Simms passed out. Laporte stayed by her side.\n And then a rescue ship came, and with it came al-Alimah, the woman with the gunmetal eyes and the shark-sleek uniform of a Federation black ops officer. She came to tempt Laporte away from Simms with the promise of her other love—\n Victory. Al-Alimah came to offer Laporte a chance at victory. And she named the agents of that victory NAGARI.\n nagari 1/10\n What is victory? Only a fool goes to war without an answer.\n The Alliance is winning (has won). What is their victory condition? Their grievance? The fatal casus belli that sparked it all?\n The Federation is a gentle state, built on Ubuntu, a philosophy of human connection. So they say: the war began because the Alliance couldn’t stand to be alone. They spent two decades rebuilding the severed wormhole to Earth, so they could demand reunification, so they could mobilize our thriving economy to build their warships. So they could galvanize our culture for war.\n What the Alliance asked the Federation is what the woman named al-Alimah asked Laporte, as they stood together over the radiation-cooked body of Lorna Simms: give up your gentle ties. Come with me, towards victory. Become a necessary monster.\n When the Federation refused to militarize, the Alliance invaded. It was their only hope.\n Either they gained the Federation’s riches, or they faced the Nemesis alone.\n Laporte, she made the other choice, the one her beautiful home could not. She went with al-Alimah. She joined the phantom atrocity-makers called NAGARI and she discovered her own final hope, her endgame for Federation victory.\n It’ll require the extermination of the entire Alliance population. So be it. She is an exceptional killer. She proved that after she left Simms.\n That’s how she ended up here, at this raging dead star on the edge of Alliance space, this monument to the power of the alien Nemesis. The tomb of Capella—\n capella 2/8\n Back in the now: and someone’s chasing her.\n She sniffs him out by the light of his engines. Something’s come through the wormhole behind her and started its own plunge towards the (terrible, empty, fire-crowned) black hole.\n Laporte grins and knocks her helmet twice against her ejection seat, crash crash, polymer applause for the mad gentleman on her trail. She knows who it is. She’s glad he’s come.\n She tumbles the Uriel end-for-end so that she’s falling ass-first into oblivion and her nose is aimed back, up, towards the universe. There’s a ring of night and bent starlight all around her, where the black hole’s gravity bends space, but up above, as if at the top of a well, are the receding stars.\n And there he is. A fierce blue light which resolves into the molybdenum greatsword-shape of an Alliance strike carrier. Atreus. Steele’s flagship. Two and a half kilometers of tactical divinity.\n Admiral Onyekachi Tuwile Steele prosecuted the war in the Sol theater. A game of remorseless speed chess with fifteen billion pawns in play. In the end, after the Federation exhausted all its gambits and defenses (save one, the one called NAGARI), he won the war.\n He’s a perfectionist, Steele. A man of etiquette and fine dress, a man who moves like a viper or a Kinshasa runway model. He makes intricate, clockwork plans, predicated on perfect understanding of his opponent’s behavior. He cannot abide error.\n He made only one.\n Nowhere in the final hours of the war, the Mars gambit, the desperate defense and ultimate failure of SHAMBHALA, did he send enough hunter-killers to eradicate Laporte.\n And now he has come a-howling after her, propelled by portents and terrors, operating on a desperate, improvised logic. That logic might be: if she wants it, I cannot permit it. If Laporte reaches for a thing, I must deny it to her. She is too dangerous to ever have a victory.\n It might be something else. It’s dangerous to let your enemy understand your war logic.\n simms 2/9\n There are three stories here. They all matter.\n One is the story of Laporte at Capella, trying to kill billions. That’s the ending.\n One is the story of Laporte leaving Simms for NAGARI, in the name of victory. That’s the beginning.\n But in between them is another story, because the road from victory to genocide passes through love. In this middle part, the Federation’s civilian government surrendered to the Alliance. And here in the ashes Laporte found Simms alive, Simms found Laporte still (barely) human, they each found the other in the cold scorched wolfpack of the Federation Navy, lurking on the edge of the solar system and contemplating mutiny.\n This story is the most important, because it was Laporte’s last chance to be a person again.\n So: Laporte reaches for Simms. She wants to be close again. She wants to come back.\n They’re lying side by side in the avionics bay of Laporte’s fighter: an alloy coffin as cold as treason. Mostly empty. The terms of the cease-fire have stripped all military electronics from the Federation Navy.\n Like their uniforms—taken too. They work in gym clothes and mechanic’s overalls. Whenever they breathe the vapor spills out white like a suitbreach. Every ten minutes a dehumidifier clicks on.\n Simms shivers. Her hands rattle and she breaks the test pin she’s using against the teeth of a server stack. “Shit,” she says, closing her eyes. “Fuck.”\n She survived radiation poisoning. But surviving a wound doesn’t erase it. You only rebuild yourself around the scar.\n Laporte knifes the RESET switch up, down, up, down. They’ll start over. “Slowing me down, boss,” she says, trying to take Simms’ fear and judo it around, make it funny, disarm its violence. “Slowing me down.”\n “Fuck you too.” Simms clenches and unclenches her fists, one finger at a time. She’s longer than Laporte, and stronger. Before she soaked up fifteen grays of ionizing radiation, she could always keep up. “You try fingerbanging a combat spacecraft after a lethal dose.”\n Laporte makes a wah-wah baby noise. Simms laughs. They work for a few more minutes and soon they’ve made the fighter ready to hold combat software in the spare memory of its navigational systems.\n If they’re going to mutiny, the mutiny needs its fighters. And Laporte is planning a mutiny.\n Simms puts down the test pin and shivers from her scalp to her toes. She looks silver-gold, arid. She is the child of Mongolian steppe and American range and the desert of Mars. She’s used to cold. Laporte’s afraid that it’s not the cold making her shiver. Simms has been listening, the last few days, as Laporte lifts up her scabs and talks about NAGARI, and about her plan for victory.\n “They took out all my bone marrow,” Simms says. “I’m full of fake bone shit. Medical goo.”\n Laporte rolls into her (the old words, in a pilot’s brevity code: Boss, Morrigan, tally, visual, press, It’s you, I’m me, I see you, I will protect you) and Simms puts an arm around her. Laporte kisses her under the jaw, very softly, and rests her ear against Simms’ collarbone. There’s a plastic button rubbing into her cheek but she doesn’t mind.\n “Seems to work okay,” she says. She looked up radiation therapies: desperate transplant of reprogrammed skin cells and collagen glue. She imagined them peeling the skin off Simms’ thighs to fill up her bones.\n “Yeah.” Simms’ heart is slowing down, soothing out. It can’t find the fight it’s looking for. Or it’s disciplining itself for what’s to come. “I still work.”\n Laporte looks up from her collarbone to look her in the eye. “Are you going to fly with me?”\n Will she fly in the mutiny. Laporte’s grand plan, NAGARI’s final hope? The Federation has surrendered, but its soldiers, its guardian monsters, do not consent to Alliance rule. They were made to win.\n “I don’t know yet,” Simms says, looking at her hands. Whatever she says next will be an evasion. “I need to know more about your operational plan.”\n I need to know more about what you’ve become. What you got up to without me, while I was in the tank with my skin peeling off and glue in my blood.\n “I need you out there,” Laporte says. She means it to be business, pilot chatter, a tactical requirement. But she’s thinking about how she left Simms. How it might have seemed, to Simms, that she had been expended. Cast off as spent ordnance.\n Simms makes a soft sound, like she’s too tough or too happy to cry.\n The dehumidifier wakes up to dry out their words.\n capella 3/8\n The mutiny is what carried Laporte from the middle to the end.\n The Alliance killed the Federation’s best soldiers. It battered the Federation into political surrender. But it never beat NAGARI. It never beat Laporte.\n When the peace negotiations began, Laporte flew her re-armed Uriel from post to distant post, rallying the Federation’s dying strength for the death ride to Capella. Dozens of ships. Hundreds of pilots. Answering to Noemi ‘Morrigan’ Laporte, the last ace, the one who wouldn’t let the fire go out.\n Laporte airbrushed the suggestion of a raven on her fighter. Its claws are bloody. There is armor in its jaw.\n She asked Simms to ride in her back seat as she went to raise mutiny. “A couple undead soldiers, flying the mutiny flag,” she joked. “Like a buddy cop thing.” But Simms looked away and Laporte thought, what am I doing, how can I ask her to light this war back up, to be the spark that escalates it from atrocity to apocalypse? The war took her skin and melted the inside of her bones. It ripped out the lining of her guts. She can’t even shit without fighting the war.\n “I’m not mission capable yet,” Simms said, and she looked at Laporte as if the war had taken one more vital thing from her. “I hope the avionics work. I broke a lot of test pins in there.”\n So Laporte flew with al-Alimah instead. Al-Alimah from NAGARI.\n The Federation government surrendered but its fleet did not. They struck during treaty negotiations. Laporte’s rebel armada fought its way out of Sol by shock and treachery. Breached the blockades in Serpentis. Menaced the Alliance capital in Beta Aquilae.\n And as they did, Laporte’s NAGARI elite slipped into Vega. One wormhole away from their true goal.\n Capella.\n Admiral Steele’s been chasing Laporte the whole way. Trying to repair his only error. And here they are now, in Capella, at the end of the hunt—Laporte plunging towards the black hole in her little Uriel and Steele’s titanic Atreus plunging after her.\n The Uriel’s electronic warfare systems make a deep frightened sound. Laporte’s helmet taps her chin and says:\n VAMPIRE! ASPECT! STINGRAY! SSM-[EOS]-[notch 000x000]-[20+!]\n It’ll be missiles, then. A fuck-ton of missiles.\n If he turned around now, with all Atreus’ fuel still coiled up in her engines, Steele could probably stop his fall. Claw his way into a hover above the black hole, and then make the grueling climb up to the wormhole and safety.\n But he’s accelerating. Chasing Laporte. Risking himself and his entire crew to kill her.\n Laporte opens a COM channel. Aims it downward. Into the dark. She has allies here, if they can be made to understand the danger.\n “Ken,” she sends. “It’s me. Don’t keep me waiting, old man.”\n That’s why she’s come here, to the singularity, to the tomb of Capella. Because the Nemesis made it.\n Just as they made her.\n nagari 2/10\n Ken is a dream of Laporte’s. Laporte’s dreams are not entirely her own.\n Ken happened long before the Alliance rebuilt the wormhole, long before the war—\n She was six years old, playing in the yard. Her parents had a house in Tandale, part of Dar es Salaam, where they worked on heavy trains, moving cargo from the Indian Ocean all across Tanzania. Her father was a reserve pilot and her mother was in arbitrage. Little Noemi, left to self-directed education, as was the Ubuntu preference for the young, spent her days building a model train system in the dirt between her water garden and her ant battle arena. But the ants would not stay in the ant battle arena, not even a little—they kept foraying into the train system, no matter how many of them Noemi punitively de-limbed.\n Ken suggested she consider the broader logic driving the ants. Ken often gave Noemi advice. Her parents were very proud that little Noemi had actualized such a useful inner friend.\n After an exhaustive survey of her territories, Noemi discovered the problem. There was a rival ant colony north of the water garden. The two groups had fallen to war. She studied up on ant diplomacy, complaining into her phone, and concluded there was no pluralist solution. The colonies would compete for hegemony over all available resources. Unless one side achieved a swift victory, lives and labor would be lost on the war. An attritional stalemate could ruin them both.\n She uncurled the garden hose and drowned the northern colony. The choice was simple, in that it was easy. It only depended on one thing. She knew and loved the ants in the south of the yard. She cared nothing for the ants in the north. There was no other distinction between them.\n When you are a monster, as Laporte certainly is, you have to cling to the things that you love. The ligatures that connect you to the rest of humanity.\n If you lose them, you may whirl away.\n simms 3/9\n Laporte didn’t understand the Ken dream until she joined NAGARI. That’s the beginning.\n What the Alliance asked the Federation is what the woman named al-Alimah asked Laporte. She was a tall woman with gunmetal implants in place of her eyes. She gave Laporte a choice: stay with Simms as she fights the radiation poisoning, or come with me and try to win the war.\n “The medics are coming,” she said. “You can stay with your Captain until she dies, or until she doesn’t. You’ll make no difference. None of your talents or capabilities will contribute to her battle.”\n (Laporte is a wingman and she never leaves her wing leader—)\n “Or you can come with me. I’m with a black ops unit. Special moral environment. NAGARI. You know we’re losing this war. You know we need you.”\n (—except when necessary to complete the mission.)\n And Laporte thought, if she lives, if she wakes up, I want to be able to say—\n Hey, boss. We’ve won. I took care of everything for you. Did you have a good vacation?\n So Laporte took al-Alimah by her tactical gloves and went with her, out of the sweltering briefing room, out of the dying ship where everyone’s sweat was hot enough to leave red radiation burns, where their marrow rotted inside their neutron-salted bones.\n And that was how she joined NAGARI.\n nagari 3/10\n NAGARI. A committee of monsters: a federation of sharks. Shaved-skull operators cooking lamb on the naked coils of their frigate’s heatsinks. All veterans. Not one in uniform.\n There are real psychological differences between Federation and Alliance citizens. Fifty years of sealed prosperity in Sol gave birth to a generation of humans who are very good at living but very bad at killing.\n That’s why the Federation, for all its socioeconomic might, is losing the war. (That’s why Laporte thinks the Alliance chose war over peace. They could never win the peace. And they were built for victory.)\n But Laporte isn’t a good Federation citizen, no oh, that’s what Simms told her in their radiation-cooked parley: you’re a killer, you need no reason and no hate. It’s just you. And that’s why you’ll be fine without me.\n And Simms was right. Laporte has an instinct for violence. And there are others like her, gathered under the mantle of Federation black ops, where the terrain of their violence extends far beyond the battlefield.\n “This is your first mission.” Al-Alimah briefs her in the back of the mess kitchen as they inventory the remainders. Cumin and cinnamon and allspice blown down over them, but the stink of ozone is stronger. Al-Alimah’s eyes are sensors and projectors: they sketch visions for Laporte by scratching her eyes with particle beams. “You will infiltrate an Alliance personnel convoy carrying non-combatant contractors. Dental and culinary services for rear-area bases.”\n When Laporte blinks, the images left by al-Alimah’s eyes don’t fade.\n “You will deploy a neutron weapon against the dormitory ships. Leave no survivors.”\n Laporte imagines Simms asking: what is the military rationale for this strike, sir? She vows to ask, after the mission. She vows to get good data on the mission effects. She used to keep a kill tally, one strike for each fighter she shot down, one chance to preen and brag for Boss.\n She sleeps with a cable in her skull, and she dreams about the strike over and over. When she flies it, it feels like a dream too. The neutron weapon makes no light or sound except the shrieking RAD warnings in her cockpit. She comes home to backslaps and fistbumps and moonshine from the still.\n “The objective is atrocity,” al-Alimah tells her, when she asks. The NAGARI analyst wears a baggy gray jumpsuit, indifferent to rank and physical presence. “The Alliance uses statistical modeling to predict our tactics. They’ve learned that we obey a set of moral guidelines. The only way to confound their predictions is to introduce noise.”\n Noise. Killing all those dentists with radiation was noise.\n When Simms was irradiated she was very quiet.\n Laporte stops spicing her food. She dresses in stark self-washing jumpsuits and she showers cold. The other operators are happy monsters, full of gossip and tall tales, not shy about talking shop or sex. Laporte touches no one. She doesn’t talk about her missions. In the gym and the simulator she is laconic and dependable but she never asks for anything. She practices self-denial.\n One of the other operators, Europa-born and silver-haired, comes after Laporte for reasons either carnal or tactical. The closest she gets to intimacy, of one sort or another, is when she says: “You act like you’re a monk! Monks give up stuff they like, man. Monks deny their pleasures.”\n That’s right. Monsters shouldn’t be warm. They shouldn’t have fun. Being a monster should feel like it costs.\n But the silver woman grins at Laporte, an I-know-you grin, and says, “So when you pretend you hate the work—I know what that means. I know what’s up.”\n Laporte flies noise jobs for months. False flags. Political assassinations. Bycatch enhancement. Straight-up terrorism. She has to round her kill tally to the nearest thousand. She has one of her teeth replaced by an armored transponder, so that someone will know she dies even if her body’s vaporized.\n Simms would not be proud. Simms fought a war against an invading army, and she hated the fuck out of them. But she had rules. NAGARI is anti-rule. Strategically amoral.\n Is this her whole purpose now? Trying to buy the Federation a few extra months through the exercise of atrocity? Missions that violate every tenet of Ubuntu and civilized conflict?\n It’s war, Simms once said. In war, monsters win. Laporte gathers up that thought and buckles it around herself, for want of Simms, for want of victory.\n Is she fighting because victory might mean seeing Simms again? Imagine that. Imagine saying: Hey, boss, you’re alive. I neutron bombed a few thousand dentists, and we won the war. Can I buy you a drink?\n simms 4/9\n Back in the middle. In the story that moves Laporte from NAGARI to the black hole. Her last chance to stay human.\n “It’s not true,” Laporte tells Simms.\n They’ve finished re-arming all the fighters, breaking the ceasefire lock. This is the lean time between the surrender and the mutiny, when the Federation’s surviving fleet lurks in the cold on the edge of the solar system, a faithful dog cast out and gone feral. Waiting for Laporte and NAGARI to rouse them to revenge.\n “What’s not true?” Simms asks. She pokes the fire with her cooking mitt.\n They have a trash fire going on the Eris’ hangar deck. Warships are very good at coping with internal fires, and very bad at serving as long-term habitats. They grew some chicken in the medical tissue loom and now they’re burning trash under a plate of thermal conductor, in the hope of making a chicken curry.\n “That monsters win,” Laporte says. The chicken pops and spatters grease. Simms laughs and Laporte, thinking of dead cells sloughing apart under radiation, shudders. Her transponder tooth, left over from NAGARI work, is cold under her tongue. “In the end, actually, monsters tend to lose. And that’s much worse.”\n “What do you mean?” Simms eyes her up. Simms is still exploring Laporte’s new crazy side, separate (in her practical mind) from Laporte’s old crazy side, before their long radiation-cooked severance. “Is this something from your NAGARI drug trips? Cosmic insight, plucked from the void?”\n “Yeah,” Laporte says, remembering the surgical theater, the feeling of cold entheogen slurry pumping into her skull. Where they discovered the truth about Ken. “I wish you’d been there.”\n “But I was there,” Simms says, stirring the fire. The thermal conductor is a cheerful cherry-hot color, and Simms hums as she works, like she’s trying to be casual about how much she cares for this idea: the possibility that she was out there, helping Laporte win, even while she was bolted to a triage rig with her bones melting out through needled tubes. “I was in your thoughts. Wasn’t I? Isn’t that what kept you alive?”\n Why would she be so happy about this, about helping Laporte be a good monster, and then, just a day later, refuse to fly with Laporte in the mutiny?\n Why?\n nagari 4/10\n This is what Laporte was up to while Simms’ bones were melting:\n Laporte flies her terror missions. She goes out alone and she returns alone, and between those stanchions she kills her targets. Her effect on the universe, the vector sum of her actions, is purely subtractive.\n She isn’t fine without Simms. Simms was her captain and her friend, the last tie keeping Laporte in the human orbit. But that’s the point, right? Laporte’s a monster now. Her past is useful to her only in the way that gunpowder is useful to a bullet. The more pain in it, the better.\n The war’s falling apart, slouching towards surrender. NAGARI scores victory after horrible victory. But the Federation Navy can’t follow their lead. The clockmaker-Admiral Steele outfoxes the Navy again and again, closing in on Earth.\n Laporte becomes a kind of leader among the operators, on strength of her efficiency, in admiration of her self-sufficiency. She learns the name of every NAGARI operator, their habits and crimes, their gym schedules (hey man, spot me) and cooking tricks (come on, not this curry shit again). She also learns the callsigns of every active pilot: physiological parameters, operational histories.\n But she can’t connect the two, the names and the callsigns. When a callsign dies on a mission, she isn’t sure who it was until she misses their grunt in the gym, their recipes on the heatsink grill.\n The Federation is still losing the war. Her intention is to keep flying until she dies.\n But the memory of Simms (and the memory of what she said: you’ll be fine, you don’t need a reason) drives her mad with competition. She had a competition with Simms! She always wants to be better than her Captain expects.\n So when she wakes up from a training dream she goes to al-Alimah and asks: “Why are we doing this? What’s the point of noise jobs and neutron bombs, if it’s just a way to put off the inevitable surrender?”\n She expects the answer she’s given herself: Monsters are weapons. It’s not up to the weapon to choose targets.\n But al-Alimah startles her. As if she is a ghost alive in the memory of childhood Tandale summers, al-Alimah says: “Tell me about Ken.”\n “What is this?” Laporte stares her down, eye to gleaming post-surgery tactical eye. “Why do you care about that?”\n “You told your Captain Simms that you had an invisible friend as a child. He urged you to develop your faculty for violence.”\n Laporte laughs. It doesn’t surprise her that NAGARI knows this shit, but it’s hilarious that they care. “Ants, man. He wanted violence against ants. Ken was an imaginary friend.”\n Al-Alimah doesn’t waver. “During your adolescence, you were treated for schizotypal symptoms. You reported violent ideation, dissociative thoughts, and a fear of outside intrusion. Your first boyfriend left you because he was afraid of you.”\n Laporte opens her arms in a gesture of animal challenge. “Are you worried,” she says, grinning, “that I might be unwell?”\n Al-Alimah laughs. She can pretend to be very warm, when she wants, although it’s terrifyingly focused. Like all her charm radiates from a naked wire charged red-hot.\n “What would Ubuntu have had you do to the ants?” she asks. “What would our Federation’s philosophy say to two ant colonies at war?”\n Find a pluralistic solution. Locate the structural causes of inter-colony violence. Rework the terrain, so that peaceful competition between colonies can produce a common good.\n “Ubuntu is for people,” Laporte says. “It doesn’t work on ants.”\n Al-Alimah touches Laporte’s wrist with one long, cold finger. “Think about the universe,” she says, “and what portions of it belong to people. If Ubuntu applies to the human territory, what is NAGARI for?”\n “Oh my God,” Laporte says.\n She understands instantly. She grasps the higher purpose of NAGARI.\n She has a terrible, wonderful, world-burning premonition. A way to win the war.\n nagari 5/10\n Ask the Alliance, Steele’s people, the aggressors and the victors in this terrible war: what is the grievance? The fatal casus belli?\n Imagine a republic charged and corroded by perpetual emergency. Scattered across lonely stars. Simmering on the edge of rebellion. They may be tyrants. May also be the bravest and the most tenacious people ever born.\n This is what Laporte knows, what NAGARI knows, about their history—\n Humanity met something out there. Implacably hostile. Unspeakably alien. Nemesis.\n Love is about knowing the rules of your connection. You know how you could hurt her, if you wanted, and she trusts you with this knowledge. And war is about that too. You learn the enemy’s victory conditions, her capabilities and taboos. You build a model of her and figure out where it breaks. You force the enemy into unsurvivable terrain, pinned between an unwinnable war and unacceptable compromise.\n But what do you do when the rules you use to understand how one thing relates to another stop working? When the other thing has no rules at all?\n simms 5/9\n Rules about Simms, from the time before radiation and ambush:\n The Federation military forbids fraternization in the ranks. While Ubuntu treasures community, emotional attachment can compromise the chain of command.\n So at first the fire between them, the charge in the air, bled off in confined ways—\n Laporte tried not to look at Simms too much, or too little, so nobody would notice her unusual attention. This is like war logic. When you look for the enemy with your active sensors, you also tell the enemy where you are and what you intend.\n When they checked each others’ suits they were extremely professional. Soon they realized this was an error, since soldiers are profoundly obscene. But it was too late to start making catheter jokes.\n Sometimes they sparred in the gym. Simms was icy and Laporte grinned too much. The whole squadron turned out to cheer. (They’re all dead now.)\n A new rule, after NAGARI and the Federation’s surrender, after al-Alimah puts them back together. A rule they teach other—\n You must never hint at your secret fear. The terrible thought that it might have been better if you’d never found each other again.\n nagari 6/10\n Al-Alimah shares the history of humanity and the Nemesis, the history that Laporte knows from school—and the secret parts NAGARI has collated.\n There were two Nemesis incursions.\n The first war, the war that divided mankind into Federation and Alliance, began like a nightmare and ended like an amputation. The Nemesis surfaced from the wormhole web and moved across human space erratic and arbitrarily violent. Humanity scored tactical victories (tactical victory is the tequila of combat highs: hot in the moment, hateful in the aftermath) but in the end the Nemesis world-killer called Sinadhuja made it all the way to Serpentis.\n One step from Earth.\n When Sinadhuja entered the wormhole to Sol, the Earth fleet resorted to their last hope. A firewall bomb. It cauterized the wormhole connection. Killed Sinadhuja, saved the hearth of the human species, and left the rest of mankind out there in the dark.\n That’s how the Federation and the Alliance became separate things—sometimes that’s how you define yourself, in the space when you are separated, when you have abandoned all hope of reunion.\n One night, waiting for al-Alimah to appear and task her with another massacre, clawing up gibbets of her gel mattress and then smoothing them back so they vanish into the whole, Laporte realizes that she knows Simms is dead. She has to be. It’s naive to think she survived the radiation. Naive to imagine an end to the war, a happy reunion, a quiet retreat where they can tend to each other’s wounds. Simms is dead.\n It would be worse if she were alive. She would hate the monster Laporte, and she would hate herself for leaving Laporte to the monsters. Simms is a hell of a soldier, a superb pilot. That’s how she defines herself. A good pilot never leaves her wingman.\n What do you call this? The decision to know something not because it is true, but because it’s useful?\n Out there alone the Alliance survived. Thirty-two years they prepared for the Nemesis to strike a second time. Certain that victory would secure the future of mankind in the cosmos. Certain that defeat would mean extinction.\n capella 4/8\n She falls engine-first towards the black hole and Atreus falls after her with its torch aflame and missiles ramifying out into the space between them in search of the kill geometry, the way to confine her, the solution to Laporte.\n Steele’s ship outguns her by orders of magnitude. The Alliance fought Nemesis twice. They learned war-craft the Federation has never matched.\n Atreus’ missiles can make their own jumps. Leap from their first burn straight to Laporte across a stitch of folded space. But the singularity they’re all falling for warps space, which makes it hard to jump. So the missiles come at her drunk and corkscrewing or they die in the jump and shear themselves open like fireflies burning too hot.\n Not all of them, though. Not all of them. A few make it into terminal attack.\n Laporte talks to Simms under her breath. Reporting the situation. Boss, Morrigan, am spiked, stingray stingray, vampires inbound. Music on. Defending now.\n She rolls her shoulders and arms her coilguns and starts killing the things come to kill her.\n And down there, down beneath her, in the groaning maelstrom where space-time frays and shears and starts to fall, where the course of events balances on the edge of inevitable convergence towards a central point, something wakes.\n The light of a stardrive, peeling free of the fire. The huge dark mass of something mighty. Molting out of the black hole’s accretion disc. Climbing up to meet her.\n Ken says, in a voice as young as summer gardens, as old as ants:\n Hello, Miss Laporte.\n nagari 7/10\n “The Alliance started the second Nemesis incursion,” al-Alimah says.\n They’re having dinner together. Laporte’s sure this is a dream, but because she sleeps with her nervous system braided into NAGARI’s communal dreamscape, it’s probably also real.\n Al-Alimah wants to talk about Ken.\n Laporte picks up her fork and eats. They’re in a rooftop cafe and there’s a warm wet wind, storm wind, coming from the north and west. The meal is salmon sous-vide cut into translucent panes of flesh. Like the pages of a carnage book.\n When she touches the salmon with her fork it curls up around the tines. “The Alliance attacked the Nemesis?”\n “There was an insurrection.” Al-Alimah’s a long woman, breakable-looking, tall like Simms but not trained to bear her own weight under acceleration. In dreamland she’s traded her gray uniform for a rail-slim black gown. She looks like a flechette. A projectile. “Someone broke ranks.”\n After the first incursion, Nemesis behavior was the province of military intelligence. By political necessity, or perhaps out of some sense of Lovecraftian self-preservation, the Alliance tried to keep the pieces of the puzzle widely separated. But one of their Admirals, Haywain van Aken, finally unified the clues into a grand theory.\n “What was it?” Laporte interrupts. The tines of her fork are hypodermic-sharp but she doesn’t notice until she’s already pierced herself, three points of blood on her lips, inside her cheek.\n “We don’t know.” Al-Alimah shrugs with her hands. The tendons in her wrists are as fine as piano wire. “Not yet. But we know what he did.”\n Van Aken became convinced he could communicate with the Nemesis. He built a signaling system—almost a weapon, a cousin of the Alliance’s missiles: it jumped high-energy particles directly into the mass of the target. Then he went rogue. Hurtling off past the Capella colony and into unexplored space. Possessed by a messianic conviction that he could find the Nemesis and end the war.\n Laporte cracks her neck and leans back. Watches Alliance warships moving through the clouds around them, pursuing van Aken into Nemesis territory, overcoming disorganized Nemesis resistance with determination and skill. On the horizon a voice that isn’t Admiral Steele’s begins to murmur about the possibility of real victory.\n “Forward reconnaissance found van Aken’s ship adrift in a supernova remnant.” Al-Alimah swallows something Laporte never saw her bite. She has a little piercing in her tongue. It’s strange to imagine her going to get her tongue pierced. Maybe she put it in herself. “His crew had mutinied. An outbreak of psychosis.” The sky flickers with records of violence, directionless, obscene. “Then the Nemesis boarded his ship. They took him.”\n “What?” Laporte stops chewing. It shocks her to imagine the Nemesis claiming a single human being. That isn’t their logic. That’s human logic.\n “Yes. The Alliance had the same question.” Al-Alimah points to the sky. Jawed shadows gather on the sun, four-kilometer reapers studded with foamed neutronium. “Three days later, scouts sighted the first of eighty-six Sinadhuja world-killers converging on human space.”\n The Alliance fought a harrowing retreat but the Nemesis poured after them, insane, inscrutable, an avalanche of noise. No central point of failure to target, like the single Sinadhuja in the first incursion. Nowhere for the Alliance to aim its might. It was like trying to kill a beehive with a rifle. Except that each bee, each Sinadhuja, was a match for half the Alliance fleet.\n Al-Alimah flashes two peace signs at Laporte. Four stars glimmer on her fingertips: two binary stars. “The war ended in Capella. The Alliance had a colony there. They decided to hold the line long enough to evacuate.” Tiny model Sinadhuja warships climb out of the webs of her hands, jaws gaping. Like scarabs. Like sharks. “The Nemesis fleet did something to the system’s stars. Altered their orbits. It’s tempting to read it as a demonstration of power, an act of intimidation or rebuke. Except that the Nemesis never used symbolic violence before.”\n Four stars roll off her fingertips and spiral down into each other. Supernova light pops, rebounds off al-Alimah’s eyes, and collapses into a pinpoint devourer. The black hole.\n “A hundred million civilians.” Al-Alimah taps her two forefingers together, as if to telegraph the number. “A quarter of their fleet. All lost.”\n And something more important, too. The thing you lose when you realize that victory is impossible no matter how hard you fight.\n Monsters win, Laporte.\n Laporte thinks about grand strategy. The Nemesis might return anywhere, at any time. The Alliance needed ships, and weapons, and brilliant science, and something to offer its citizens as proof against despair—a new victory to fight for. So the Alliance did the only thing it could. It set to work rebuilding the way home: reopening the Serpentis-Earth wormhole with Nemesis technology.\n And when that home refused to join the great work, the project of human survival, the Alliance resorted to war.\n “And so we come to now,” al-Alimah says. She leans back, as if she has discharged her duty, and drinks her wine. “Our great predicament.”\n The war between an Alliance driven by exigency, by the utilitarian, amoral need for survival, and a Federation built on humane compassion, on the idea that you do the right thing no matter the circumstance. How do you fight that war, if you’re the Federation? If you can’t listen to the Alliance argument without a scream of sympathy?\n You make something like NAGARI. A cadre of monsters to do what you cannot.\n The sky has changed again. It’s Simms up there now. She has a face of triangles and planes, a faceted thing, and it pulls on Laporte, it engages her. Combat pilots decompose all things into geometry: threats, targets, and the potential energies between them.\n “Your old Captain.” Al-Alimah looks up at her too. “We never wanted to recruit her. Too conventional.”\n Laporte looks away from Simms, and voices the apocalypse option.\n “If we can find some way to make the Nemesis return,” she says, “and then collapse the Earth-Serpentis wormhole again, we can let the Nemesis wipe out the Alliance and end the invasion.”\n If they collapse the wormhole so the Nemesis can’t get in, then the Federation will survive. Guarded by light-years of real space. All it will cost is a few billion human lives.\n Everything can go back to the way it was. Human paradise. A confined peace.\n al-Alimah is still waiting. Lips curled in amusement. Gunmetal eyes infected with the blind crawling light of distant computation. “That’s just utilitarian strategy,” she says. “Doesn’t take a dream to make that connection. Tell me, Laporte, why do you think I brought you here? What endgame do you think all those terror missions were training you for?”\n Ken. A childhood name for a childhood friend.\n A man thought he could communicate with the Nemesis. Admiral Haywain van Aken.\n Laporte puts her fork through her cheek. In the dream, it doesn’t hurt.\n capella 5/8\n Atreus must see the monster rising behind Laporte. Steele must see the shape of the demon she’s conjured up out of the accretion disc. The Sinadhuja world-killer is the insignia of everything the Alliance stands against. The monster in the mist. Atreus was built in hope of killing it.\n Perhaps Steele will target his missiles at the Sinadhuja.\n Laporte coilguns another incoming missile and it flashes into annihilation so bright her canopy has to black it out like a negative sun. And Steele keeps firing at her. Atreus keeps accelerating. If he sees the Sinadhuja he doesn’t maneuver in response.\n Once Steele said, about the war, about his strategy against the Federation:\n I employ overwhelming violence. Because my enemies are gentle, humane, compassionate people. Their Ubuntu philosophy cannot endure open war. And the faster I stop the war, the faster I stop the killing. So my conscience asks me to use every tool available.\n And Laporte answers him. Look what you conjured up, you brilliant, ruthless bastard. Look what you made. Someone willing to use every available tool to fight back.\n Once Simms said, about her wingman, about Laporte:\n You’re insane. I’m glad you’re on my side.\n Laporte dances between the vectors of the missiles come to kill her and when they come too close she expends her guns on them and they intersect the snarl of the tracers and die like lightning. It’s mindless, beautiful work. Like a dream. She talks to Simms:\n Boss, Morrigan. It’s almost done.\n Ken stirs from his deep place to save his prize.\n nagari 8/10\n By now it’s clear that the Federation will surrender. No conventional military action can defeat Steele’s war logic, his simulation farm, his psychological pressure, his willingness to dive past ethical crush depth.\n So NAGARI plans to make contact with Nemesis.\n “Send me in first,” Laporte says.\n Consider semiosis—the assignment of symbols to things, and the manipulation of those symbols to communicate and predict change. That’s how intelligent life works. Build a model of the universe, test your ideas in the model, and find the best way to change the world.\n Only the Nemesis don’t have any recognizable semiosis. They’re a whirlwind traversing the Lacanian desert, a fatal mirage, recognizable only by the ruin of its passage.\n Until Admiral Haywain van Aken sacrificed himself. Until he somehow convinced the Nemesis to take him in.\n And ever since, the Nemesis have been speaking. Or attacking. It’s hard to know.\n For more than a decade the Nemesis have been broadcasting the apparition of Admiral Haywain van Aken into human minds. The Nemesis organisms communicate by direct nerve induction at a distance. Particles wormholed into the tissue of the target. (There is, of course, no possibility that the Nemesis are a product of natural evolution.)\n “If they can do that,” Laporte protests, “they can just murder us all. Cook our skulls from light-years away.” Or read the brainstates of human commanders, predict everything they do, the way Laporte and Simms could predict each other.\n “No. Not without van Aken.” Al-Alimah lays out NAGARI’s hypothesis: the Nemesis have no mentality. They cannot conceive of other minds to predict or destroy. Their war is algorithmic, a procedure of matter against matter, spawning tactics by mutation and chance and iterating them in the field. They never leap straight to the optimal strategy, because a smart foe predicts the optimal. Their war logic is hardened by chaos. Noise.\n Van Aken is their beachhead in the land of human thought.\n “He wants you,” al-Alimah says, her long fingers on Laporte’s wrist again. “You in particular are valuable to him. We want you to serve as an ambassador.”\n “That’s stupid.” Laporte may be a monster but she is not some other monster’s spawn. “Are you saying I was purpose-built?”\n “No. Far more likely that you were selected because you’re somehow amenable to the Nemesis.” Al-Alimah leans forward with her lips parted as if to admit her own monster secret. “Laporte, the third Nemesis incursion is already underway. Not with warships and weapons, not this time, nothing so crude. The Nemesis are attacking the command and control systems behind those assets.”\n Language. Plans. People.\n “What are the mission parameters?” The Alliance has control of the Sol-Serpentis wormhole. Laporte can’t just fly out to Capella. “How do we use this to save the Federation?”\n Al-Alimah stands and her gown whips in the rising wind. “We drug you and mate your brain to a computer network. You will enter a traumatic dream state and communicate with van Aken—with Ken. We keep dosing you until you learn how to trigger a Nemesis attack on the Alliance. Or until you go mad.” Her gunmetal eyes, looking down at Laporte, never blink. “You will be the third attempt. There were two prior candidates. They seized apart.”\n Laporte leans back in her chair and looks up at the woman.\n She can be the necessary monster. She could call down genocide on the Alliance and save her beloved home. If she believes the Federation is the only hope for a compassionate, peaceful, loving future, then, logically, she should be willing to kill for it. If she has a button that says ‘kill ten billion civilians, gain utopia,’ she should press it.\n She could win the war, for the memory of Simms. And Simms is dead, right? The dead can’t be ashamed.\n “Okay,” Laporte says. “I’m in. I volunteer.”\n They will connect her to the NAGARI dreamscape and to the salvaged corpses of Nemesis organisms from the first incursion. They will scar messages into her brain. They will wait for the Nemesis, for the ghost of Haywain van Aken, to read them and reply.\n Surgeons crown her in waveguides that ram through her skull and penetrate the gyrae of her brain. Cold drug slurry pumps the length of her spine: entheogens, to tear down the barriers between Laporte’s psyche and outside stimuli. She goes under. She dreams.\n simms 6/9nagari 9/10\n “Curry’s ready,” Simms says, and Laporte’s stomach growls out loud. They grin at each other. Simms looks at Laporte’s armored tooth and her grin falters just a little.\n They eat their trash-cooked chicken curry side by side with their hips squashed together. Laporte tries not to jostle Simms’ ribs with her sharp little elbows. Simms crunches on a bit of bone, makes a face, and gets juice on Laporte’s buzzed hair. There is no shampoo anywhere on the ship so this is a bit of a disaster. Simms mops her up with blood cloth from the triage kit.\n “Tell me why it’s bad if monsters don’t win,” Simms says, blotting at the back of her neck.\n Laporte leans on her for a moment, because she adores Simms’ desire to hear this story again, especially the end. “I met Ken,” she says, “he was in the dream, and he was real. They could see him in my mind. Something triggering nerve potentials.”\n She went into seizure almost instantly. The NAGARI surgeons let it happen.\n Laporte stood in the garden in Tandale with the hose in her hand and pollen itching her nose. Ants crawled over her bare feet. From the house came the smell of her parents’ cooking, impatient and burnt. She looked down at herself and laughed: she was in her favorite caraval cat t-shirt.\n “Ah, Miss Laporte,” Ken said. “You made it.”\n She looked for him but all she could see was the ants fighting, killing, generating new castes, mutating themselves into acid bombs and huge-headed tunnel plugs. “Admiral,” she said. “Is that you?”\n “Delighted to speak with you again. Let me briefly outline the necessary intelligence. A short history of all life. Then we can arrange our covenant.”\n Whatever Ken said to her must have been some kind of code, parasitic and adaptable, because it expressed itself as a love story. A story about Laporte and Simms.\n Imagine this, Ken said, imagine a universe of Laportes and Simmses. Lorna Simms has rules. She builds communities, like her squadron, or like a network of wormholes. She takes the wildcat aces and the ne’er-do-wells, the timid and the berserk, and she teaches them all how to work together. When that work is done, Simms would like to leave you with a nice set of rules describing a world that makes sense. Simms is a Maker.\n “Huh.” Simms puts a little moonshine on the rag and keeps scrubbing at Laporte’s head. “You have such nice dreams about me.”\n “Wait until you hear mine.”\n The other great class of life is the Laportes. (These are tendencies, mind, not binary teams. But they are real: vital parts of the history of life in the universe.) The Laportes rattle around breaking things, claiming things, reshaping things. They can achieve every bit as much as the Simmses, in their own way—but their triumphs are conquests, seductions, acts of passion and violence. The Simms build systems and the Laportes, parasites and predators and conquerors and geniuses and sociopaths, change them.\n Whether delightful or destructive, the Laportes are Monsters.\n When a Laporte meets a Simms, they fight. The Laporte might run rampant. She might murder the Simms, or trick her into subservience, or leave her spent and exhausted. Or the Simms might win, fencing the Laporte in with loyalties and laws, making her a useful part of something bigger. Understand? You following, Simms?\n “It’s about civilizations. Strategies. Game theory.” Simms is a war junkie in her own way, a good self-directed Ubuntu learner, and she’s done her homework. “And I’ll bet, Laporte, that I know where your Admiral’s going. The Simms win.”\n They win because they understand the Laportes. They make little models of what the Laportes are going to do, and they figure out how to get ahead of them, how to make their worst impulses useful, how to save them from harm (or lead them into it). They teach the Laportes what they can and cannot do.\n Like Steele. Building statistical models of the Federation’s tactics. Caging them in a prophecy of their own capabilities. And the only way out of that cage is to transgress the laws you use to define yourself.\n “Hold still,” Simms says. “This stuff really likes your hair.”\n “The Simmses do tend to win.” Laporte leans back against her, just a little. When Simms is fixing Laporte up she forgets to be stiff and wary. “They win too much. And over billions of years, across the infinity of the universe, it turns out that’s dangerous.”\n Imagine the god-Simms, ascendant. Puppeteering the cosmos with invisible loyalties. Learning how to guide the passions and the violence of the Laportes. Imagine Simms building not just a good squadron or a good civilization but a good galaxy, all the matter in it optimized for happy, useful thought.\n Imagine a Simms setting out to build a rechnender raum: thinking space. Her laws written into the fundament.\n “How did you learn all this?” Laporte asked the scurrying ants. In the shapes of their war she saw the ghost of an old man with dead stars in his eyes.\n Ken had surmised some of it before his rebellion. And while the Nemesis had never communicated with him directly, they had, in their own way, signaled the truth: duplicating Haywain von Aken’s consciousness millions of times, torturing it into madness, and exterminating the branches whose madnesses diverged from their desire.\n “I’m not sure I follow that last part,” Simms says. Now she’s mopping the curry from behind Laporte’s right ear. “Something about supercivilizations?”\n “Imagine a place where everything could have anything it needed. For whatever it wanted.” That was the happy Simms-world. Imagine a purpose? You can obtain it. You can get the resources you need.\n “Like an Ubuntu slogan.”\n “Yes,” Laporte says, shivering. That was what Ubuntu wanted to make. A place where people had everything they needed to be good. A place without violence and deprivation.\n In the garden, Admiral Haywain van Aken told her that a universe without violence or deprivation was destined for something worse.\n Cancer.\n capella 6/8\n Her Uriel sings her death to her.\n DV UNDERBURN is a long drumbeat, pleading for more fuel, and SPIKE [COBRA TAME/ATREUS] is a-keening like headache, and MUSIC SOUR describes itself, and every time Steele fires she hears VAMPIRE! and a noise like someone ringing her molars with an armor chime.\n But she’s not going to die. She’s too fast. She’s too fierce. She’s severed all the connections that would slow her down.\n She kills a missile half a second from killing her and for an instant all her sensors are flash-blind but she kills the next too, a dead reckoning snapshot from a hundred kilometers with the pin graser. How? Because she has escaped the borders of herself. The Sinadhuja has trained its sensors on her. Ken is watching her. And she can see through his eyes.\n She can think with his tissue, his fatal substrate. She is bleeding out of herself and into the Nemesis, the totipotent holocide-mind, the killing anima. Crossing the bridge Ken built.\n Admiral Steele is calling to her. “Federation pilot,” he’s saying, in that rich purring voice, not audibly afraid, “you have been compromised by Nemesis psywar. Kill your engines and shut down your defensive jamming.”\n Ken is calling to her. Miss Laporte. Come closer. We can complete our covenant. Together, we can save humanity.\n “Okay, Boss,” Laporte says. “Let’s get ready.”\n nagari 10/10\n Cancer, and its relationships to paradise and love:\n You build a place without violence or deprivation. A place where anything can have everything it needs to be its finest, fullest self.\n This is how cells became organisms. How people became civilizations. How a bunch of misfits and fuckups became a fighting unit almost tough enough to challenge Admiral Steele. A Simms wrote some laws to say: if we pool our energies, we can create a common good. And if you follow the rules, yeah, you, Laporte, if you don’t eat too much common good, if you put in more than you take out, then we can last.\n Imagine a Simms-god rampant, organizing the universe, winning the love of all the Laportes. So productive and persuasive that no one notices its ultimate agenda is hollow, self-referential, malignant.\n Think about me. Organize everyone and everything to think about me. What am I? I am thinking about how to make everything think about me. I am a tumor, recruiting every system I encounter in the name of my own expansion.\n “Whoa, now.” Simms puts a wet finger on the back of Laporte’s neck. “I’m very compelling, sure. Magnetic. But that’s not me.”\n “Shh. Let me finish.” Except, Laporte realizes, she is finished. That’s the whole story. “van Aken believes in a cosmic proof: the axiomatic, mathematical superiority of cancer to all forms of containment. An empty thought that consumes intelligent systems and uses them to think about propagating itself.”\n Given a range of purposes, and a surplus of resources, one purpose would always triumph: the purpose of defeating and incorporating all other purposes. The two ant colonies in Laporte’s garden had to dedicate themselves entirely to war. If one of them spent part of its energy on ant compassion, or ant culture, or ant art, it would lose. Cancer was the destiny of smart systems: empty, voracious, every part of them thinking about nothing but how to expand.\n Unless there was someone with a hose to pour water on them.\n “So,” Simms says, humoring Laporte’s great mythic rant, “why do we still have a universe? Why are we here, thinking about ourselves?”\n “That’s just what I asked van Aken,” Laporte lies. Because she feels that it would be too creepy, too alien, to admit that she understood it right away.\n In the part of the story she’s avoiding, in the garden of the seizure dream, Laporte turned on her hose and began flooding her childhood constructs into mud. “The Nemesis are the anti-malignancy measure. They kill Makers. That’s why they’re so noisy and inefficient. So they can escape the models that Makers use to win wars.”\n From a distant Nemesis construct, tumbling through the ergosphere of Capella, borrowing the black hole’s energies to hurl charged particles through quantum wormholes into Laporte’s mind, Ken smiled his agreement. Tattooed it into Laporte’s brain.\n If you were afraid of intelligent thought consuming the universe, you had to turn the cosmos into an acid bath. An endless war against the triumph of Lorna Simms.\n simms 7/9\n “Okay,” Simms says, squinting. “I think I got it all.” She leans down, curled over Laporte’s head, to look her in the eyes. “What happened next? Did you make the deal?”\n “I did.” She asked Ken: how do I get the Nemesis to wipe out the Alliance? And he told her: you must come to me, in Capella. “That’s why I’m going out tomorrow.”\n Simms blinks, once, twice, a sign that she doesn’t like this place, she wants to move on. They’re touching on the open question, the raw wound between them. Is Simms going to fly again? Is she going to be part of Laporte’s mutiny?\n Are they still wingmen?\n “And then?” Simms asks, pushing them past the moment.\n “I couldn’t get out. I couldn’t wake up.” It’s funny how sharp Simms looks, upside down. Like she has some inverse swagger. Laporte wants to ask her to stay right there but what does Simms see, looking back? Is the inverse Laporte agreeable? “Contact with the Nemesis was killing me. I had no reason to live. Nothing to come back for.”\n She’s seen the recordings of her brainstate. The seizure burning from skull to stem.\n When Simms smiles upside down it looks like a grimace, which makes it much more familiar. “So they gave you anticonvulsants. And you woke up. Then you made up this part to help you get laid.”\n Laporte tells her anyway. “Al-Alimah whispered to me. And I heard her. She said…”\n “Simms is alive,” Simms says. “She survived radiation therapy, and now she’s out there. Looking for you.”\n That was how Laporte came back from the seizure dream, just in time to fight in the Mars gambit and rage at the Federation’s final surrender. Word came down: it’s over. Move to a holding orbit. Await terms. Al-Alimah tore the orders up and all the assembled NAGARI operators made a satisfied growl like they were too angry to cheer.\n “And that’s how you got back to me.” Simms kisses her on the right eyeball. “You’re a sweet liar.”\n “Ew,” Laporte says. “Don’t do that.”\n But she smiles and—\n capella 0/8\n —tries to catch Simms’ hand.\n “You’re meeting with the Admiralty tonight.” Simms claps her on the shoulders, boom boom, look at you, kid, you’re a big shot. And then she draws away, upright, articulate, her flight suit unzipped and tied around her waist, her hair loose on her shoulders. She backs away from Laporte in triangular half-steps, back leg then front, as if they’re fighting and she is making room to retreat. The air that rushes in to fill the absence of her is cold and it smells of burnt curry.\n “I am,” Laporte says, wishing she would stay close. “I’m presenting the final battle plan. Al-Alimah’s victory gambit.”\n “You’re going to tell them you have a plan to bait the Nemesis into attacking the Alliance. A strategic distraction. When Steele pulls his fleet out of Sol, we can seal the node and live in peace.”\n “That’s right.”\n “But that’s not the plan.” Simms aims one finger at her, a half-curled, hey-you stab. “You’re not going to tell them the real plan. That’s between you and your NAGARI friends.”\n The Nemesis are insuperable. Nothing can defeat them. They have unlimited resources (their warships conjured out of black hole accretion discs by probability manipulation) and their behavior, well, that’s even worse: they have no mentality, no strategy to predict, nothing that can generate a nice clean model. Only a godslaying virulence, a random and chilling will to annihilate, manifesting strategies and hurling them at the enemy until the enemy has exhausted all countermeasures and taught the Nemesis their strengths.\n To fight them is to instruct them how to kill you.\n Haywain van Aken has summoned Laporte to Capella. To the black hole that is the Nemesis’ engine, factory, and beacon in human space. Why? Laporte has a guess. They have no purpose or objectives of their own—those are Maker things, teleological, forbidden to them. Only their basic logic: whatever we encounter, we destroy.\n But they didn’t kill van Aken. They took him into communion. Maybe that act brought them closer to victory. Maybe, to them, subverting van Aken was an act of destruction: a lethality enhancement.\n “I believe,” Laporte begins, struggling, trying to hide her struggle, this is so hard to say because it requires her to navigate around her secret fear: that she is about to abandon Simms again, forever, in favor of the consummate monstrosity. “I believe I can trigger a Nemesis behavior that will exterminate everyone in Alliance space. I believe the Federation will endure. Humanity will have a chance at survival.”\n “That’s how we save the Federation? How we keep Ubuntu alive? Sacrifice ten billion human lives?” Simms crosses her arms. “We’re okay with defensive genocide?”\n “That’s war. We kill people to achieve our objectives.”\n Simms’ hard eyes radiating a hard signal, and Laporte reads it in a way that’s maybe unfair: I liked knowing that you were my monster. I liked knowing you had boundaries. “We kill soldiers.”\n “People,” Laporte says, echoing the old Ubuntu lessons: everyone is human. There is no justifiable violence—only degrees of tragedy. “We’re always killing people.”\n They stare at each other and on the raw metal deck between them Laporte can feel them piling the tally, the killcounts, the fighter pilots and warship crews they’ve murdered personally, the deaths contingent upon those by way of grief or loss (children abandoned, lovers driven to suicide, parents spiraling away into addiction). The strategic targets and footprint bleed and noncombatant bycatch and for Laporte it all wraps up in the voice of some terrified Alliance contractor on a suit radio trying to explain that he doesn’t support this war, doesn’t want to be here, he’s just trying to pay off his electrical apprenticeship, would they please send a rescue ship, he’s tumbling off into space and his radiation warnings are red and he doesn’t want to drown in his own vomit, please, please. Send help.\n When the Alliance captured Earth orbit, Admiral Steele threatened to bomb a city every hour until the Federation issued an unconditional surrender. What else could he do? Not with every soldier in the Alliance could he occupy even one continent. He had to use the tools at his disposal. He had to resort to calculated atrocity in the name of final peace.\n Funny how that Ubuntu lesson can turn around, isn’t it? How easily degrees of tragedy becomes degrees of necessity.\n “You told me,” Laporte says, “that if I hesitated, I would die. So I never hesitate.”\n Simms looks at her old wingman and new lover and whatever she’s looking at is receding fast. “I hate them,” she says. “But I don’t know if I hate them enough to do this.”\n Laporte wants to grin and quip. She would tell Simms what Simms told her: monsters win.\n But if she says that, she’s telling Simms that this is all on her. That she’s the one who made Laporte.\n “There’s no alternative,” she says instead. “If we surrender to the Alliance, it’s all been for nothing. We become part of the war against the Nemesis. And the Nemesis kill us all.”\n Simms does something with the fear in her eyes. Like she’s folding it up and pointing it at something. “This al-Alimah woman. Were you two close?”\n “Not like that.” Not like you.\n “I want to talk to her.” Simms points at the deck behind Laporte, like a cue to turn around, and in doing that she makes it clear: the meeting will not include Laporte. “I’ve got some concerns to articulate.”\n “Fine.” She can’t keep the petty irritation from her voice. They should be together, effortlessly and unanimously lethal, two fists on the same fighter. “Are you flying with me tomorrow? When I go put out the signal?”\n “I still need to check myself over in the simulator,” Simms says. “Make sure the radiation shakes are gone.”\n Laporte’s flown with her long enough to hear the no.\n capella 7/8\n She is in her Uriel, fighting off Steele, falling into the dead star and the waiting Sinadhuja.\n She is in communion with the Sinadhuja. There are hallucinations puncturing her mind. She is in the garden with Ken.\n “This is the bargain,” he says.\n He’s a tall, strong-jawed man in the broadshouldered uniform of an Alliance admiral. He must be proud of that uniform, because he still wears his short-billed cap and his insignia. But the texture of him is black and squirming and when Laporte touches him she sees he’s made of ants, ants at war, lopping limbs and antennae off each other with their scissored jaws.\n Her fingers come away acid-burnt.\n “Are you ready?” Haywain van Aken says. His eyes are two rings of fire, the accretion discs of two dead suns. “Do you understand what’s about to happen?”\n The Sinadhuja looms up behind her fighter. Four kilometers long and pregnant with methods of extinction. As it matches velocity with her ship its thrusters flare violet-black, the jets decaying sideways into some hidden curled dimension. It is attacking her, speaking to her, these two are the same. The Nemesis can never understand human minds well enough to manipulate them. But they have Haywain van Aken to do it for them.\n “The Nemesis exist to tear down conscious thought,” Laporte says to Ken.\n She is in the cockpit, nudging the stick, steering her Uriel into the Sinadhuja’s open gullet. All the alarms have gone silent, except one: PROXIMITY. PROXIMITY. Steele’s voice is an electronic scratch, fading off, saying: Brevet-Admiral Laporte, you are compromised. It’s not too late. You can still self-destruct. You can still take out your sidearm and shoot yourself in the head. Brevet-Admiral Laporte, last time someone did this they blew up four suns—\n “The Nemesis have internal safeguards. Processes designed to rip apart any accidental intelligence they develop.” Ken’s peeling off the skin of his left-arm, degloving it, creating a sacrament of killing ants. “But this makes it hard for them to win.”\n They can’t create their own leaders. They can’t build models of the things they need to kill. They can summon up infinite might, but never learn how to apply it efficiently. How could they? In their fundamental state the Nemesis are a storm, a destructive process. Semiosis, the use of symbols to understand and plan, is forbidden to them.\n A storm is powerful. But smart things can shelter from a storm.\n So how do they defeat the gods of thought using only the logic of annihilation? Or, more aptly: what tactics might they stumble on, in their blind exploration of the possibility space?\n Laporte cups her hands and accepts the sacrament. The ants start eating her flesh. She crushes them between her palms, to show her strength, and it only drives them deeper.\n “They provoke the creation of monsters,” she says. “Experts at the use of violence. And then they consume them to enhance their own violence.”\n “You will lead the Nemesis in war against the Alliance,” van Aken intones, reading the sacred terms, the covenant he sacrificed himself to create. “You will guide them as long as you can. Inevitably, you will be devoured by the Nemesis, and your authority will be erased. But as long as you endure, you can protect your home.”\n The ants are inside her now. She can feel them under her skin. She looks at her arms and sees them in her muscle, bound by violence, grappling and flexing. The Alliance’s spies and admirals would drink razors to get a look at her brain right now, full of the alien logic that will give her a transient kind of power over the local Nemesis.\n “What about you?” she asks. Ken was a good friend, once, with good advice, even if he’s now the organizing point of all Nemesis behavior in human space. “How long will you last?”\n His smile is warm and toothy, an earnest, clever smile, and each tooth in it is a broad-headed warrior ant. “Humanity is going to be at war with Nemesis for a long, long time,” he says. “I am the anima in command of semiotic warfare. I am the Admiral of communion. I keep myself from the jaws by supplying the Nemesis with new weapons. And if you can manage the Nemesis, Miss Laporte, if you can keep the fire burning hot…then I will have new monsters to cultivate.”\n “Ah,” she says, satisfied. She gets it! It makes simple sense.\n Van Aken knows how to achieve a kind of common ground with the Nemesis. How to make humanity at least temporarily useful. The Nemesis devoured van Aken because he could enhance their lethality. Make them better monsters.\n Humanity will defy the Nemesis as long as their strength lasts. They’ll get ruthless. And thus they will become the Nemesis’ monster farm. A new drop in the acid bath. Victory is not only annihilation: it’s monster-genesis.\n “I’m sorry your lover abandoned you,” Ken says. “She was a good person, deep down. That’s why she didn’t understand the necessity of our work.”\n The jaws of the Sinadhuja begin to close around Laporte’s ship.\n simms 8/9\n After the curry-and-cosmology fight, they go to the gym to beat the shit out of each other. That helps less than it used to: Simms is still weak and they both know it, and holding back in a fight is just like lying anywhere else.\n Showers require less discipline than they used to. They retreat to their haven in the officers’ cabins, freed up by the death of most of Eris’ staff, and they have makeup sex. It’s the night before the mutiny, before Laporte asks Simms, one last time, to be her zombie warrior buddy cop. The night before Simms says, sorry, I’m not mission capable.\n Laporte drowses in Simms’ arms and then she wakes up to the sight of al-Alimah leaning over her. She’s upgraded her eyes. They are blind, brilliant silver. The stud in her tongue gleams like Laporte’s armor tooth.\n “The mission,” al-Alimah says, “begins now.”\n By reflex (it’s all reflex, love reflex) Laporte reaches for Simms who’s curled up beside her and in need of protection. But no one’s there: only a warm place. She sits up to shove al-Alimah back. Simms pounces on her from behind, Laporte recognizes the feel of her forearms and the smell of her, she tries to fight but Simms is stronger, she’s stronger, she was holding back in the gym. She pins Laporte facedown in the mattress with a growl.\n Al-Alimah puts a needle into Laporte’s neck and the world goes out.\n Laporte remembers this as just a dream. Not because it’s true, but because it’s useful.\n nagari 11/10\n “Stop asking me to fly with you,” Simms says. “I’m done. I can’t be part of this. That’s my final decision.”\n This is the moment before Laporte falls into Capella. At the end of the mutiny, in the slim window before Steele catches up with the NAGARI task force and stops them from breaching Nemesis space. Laporte’s Uriel is waiting on the Eris hangar deck with a full warload and two empty seats. There is no time for hesitation.\n “Boss,” Laporte says, reaching out. She’s sealed up in her flightsuit and when she touches Simms it’s through the interface of her tactical gloves, fireproof, skin-sealed, built to insulate and protect. “Hey.”\n Not again, she wants to say. Don’t do this again. We survived this. We split up but we found each other again and we cooked some curry and fixed some fighters, we’re so close, we’re going to win. For values of victory encompassing genocide.\n Simms pulls away. “You’re not the woman I knew,” she says. “You can go make your bargain. But I don’t want to be part of it.”\n Their orbit is over. The punch-drunk bloodlust and the will to win. They’ve spiraled too close and now they will fling each other away, each of them ballistic and alone. Simms prefers defeat.\n “Laporte,” al-Alimah calls, from the Eris’ CIC. “We’re losing time. Are you airborne?”\n “You don’t need me,” Simms says. “You never have.”\n Laporte wants to say something clever, to fix this. An alien told me that every Laporte needs a Simms. That monsters have to love makers, so they can hone each other. So they can keep a safe orbit. Simms, if you go, I don’t know how to find my way back.\n But this time it’s Simms who walks away from her.\n Laporte flies through the wormhole, into Capella. Into the maw of the singularity. She falls.\n capella 8/8simms 9/9\n The jaws of the Sinadhuja close around her ship. Armored mandibles clamping down to protect the warship’s antimatter stores and soft internal structure and most of all van Aken, who is the bridge the Nemesis need, the means of their third incursion. Shutting off the ring of receding starlight, and the blue nova of the Atreus high above.\n The Uriel’s navigational lights illuminate the Sinadhuja’s interior. Laporte scans serrated geometry swarming with jointed, armored Nemesis organisms. Somewhere down there van Aken’s human body has been translated, or consumed, into a component of the Sinadhuja. A semiotic weapons system.\n Ken. Who is in Laporte’s head, who knows what she knows. Who knows that Atreus is here to kill her. Who knows that she left Simms on a hangar deck in Vega.\n Laporte’s armored tooth fires a jolt of pain up the side of her jaw.\n “Boss, Morrigan,” Laporte says. She knows she has to say this. A dream told her. “We’re a go. Wake up. Do it.”\n In the Uriel’s back seat, the electronic warfare station, Simms smashes her helmet against the headrest in surprise.\n “Fuck!” she says. Her voice is dry like paper tearing. “Holy shit!”\n Laporte’s weapons panel lights up with status reports. An IV dumping combat stimulants into Simms’ blood, a cardiac implant restarting her heart, reflex sequencers firing commands into her brainstem. Waking her up from functional death. Since they left Eris together, Simms has been sustained by the emergency oxygen in her synthetic bone marrow and whatever black-ops technofuckery al-Alimah cranked into her.\n Hidden from Haywain van Aken’s communion. From his semiosis weapon, his dream of ants, his bridge into conscious minds.\n In the garden, Ken says: “She left you. She thought you were an abomination. I don’t understand.”\n Understand. That wonderful word. Laporte, giddy with the knowledge that Simms is alive again (again!), alive and flying with her, just can’t resist the quip: “Just a bad dream, Ken.”\n “Al-Alimah. She fabricated that event and put it in you. Why?” The formicidae face tilts. “What about your mission, Laporte? What about human survival?”\n “You’re the mission, Ken.” The Nemesis never manifested any central vulnerabilities during the second incursion. Never organized around any one point of weakness. “I’m sorry.”\n In the back cockpit Simms is speaking into her COM, the quick clipped voice of a veteran combat pilot, signaling for backup: “Atreus, Atreus, this is TROJAN. Request fire mission, flash priority, target is a Sinadhuja world-killer with enemy command assets aboard. Jump vectors coming now—”\n Laporte’s helmet pokes her in the back of the head. ALERT! it complains. EMCON VIOLATION! It doesn’t like what Simms is doing, hotloading the reactor, shunting power into the ship’s IFF and navigational beacons. Broadcasting targeting data on an Alliance tactical channel: a screaming, desperate plea to shoot me.\n “TROJAN, Atreus.” Steele’s scalpel voice faint, so faint, distorted by the Sinadhuja’s armor and defensive jamming, by the grip of the black hole. By all these things keeping his missiles at bay. “We have your target. Stand by for fire. Godspeed, pilots.”\n Maybe, in younger and less certain days, Laporte and Simms would have paused to say things left unsaid. To say goodbye.\n But they don’t need that now. They’re on the same frequency. Much like the Atreus and the Uriel gunship, which is looking around the Sinadhuja’s guts with its targeting package, plotting trajectories with its navigational sensors, and telling Steele where, exactly, to fire his miracle missiles.\n It’s very hard to kill a Sinadhuja. From the outside.\n In the garden, Ken makes a soft, thoughtful noise. “You knew I’d read your memories. So you let Simms and al-Alimah use you as a weapon. They leveraged Admiral Steele into cooperating with you. They used the NAGARI dreamscape to fabricate Simms abandoning you. And I believed it, because I cared about you.”\n Laporte grins an ant-tongued grin. She came here knowing, in a veiled way, that Simms was waiting for her. But she had no idea, all the way down, whether Steele had actually agreed to the plan. Whether his missiles were feints or fatally true.\n But she knows, right now (as the first of Steele’s fusion bombs jumps in ten meters off her nose and arcs off towards the back of the Sinadhuja’s interior) exactly what she needs to do. She needs to live. And so does Simms.\n Laporte touches the stick, one last time, to line up the Uriel’s cockpit with the gap in the armored jaws above.\n “Eject!” In pilot code, you always say it three times, to make it real. “Eject, eject!”\n She gets a nanosecond glimpse of Simms in the backseat mirror. She’s grinning like an idiot.\n Laporte pulls the wasp-colored handle between her legs. Her ejection seat hurls her starward, between the flashing jump-sign and corkscrewing trails of Atreus’ missiles, up through the Sinadhuja’s jaws and away. She’s turning as she rises, g-force snapping the acceleration sumps in the seat, and she can see another light with her, orbiting her, no, it’s not an orbit, they’re just flying together, co-moving.\n “Simms!” she calls. “Boss!”\n Down beneath them the Sinadhuja’s drive flares up red and massive and vomits debris and cuts out. The world-killer drops away, free falling, a mountain conjured up out of the black hole and now reclaimed by it. A flash of annihilation light blows through its hull down astern and suddenly it’s geysering jets of molten metal, crumpling on itself, jump missiles darting out of the interior and curving back to re-attack with their submunitions scattering out behind them like fairy dust.\n In the garden Ken says: “This is a selfish choice, Miss Laporte. What do you gain by killing me? You know they’ll keep coming. You know they always win.”\n “Maybe.” Laporte sprays him with her garden hose. He’s already falling to pieces, ants sloughing off and returning to the dirt. “Maybe we’ll make enough monsters to stop them.”\n Is that, his fading voice asks, how you want things to be? Everything honed to fight? Irrevocably weaponized?\n Laporte doesn’t know what to say to that. She has been a monster. But she’s going to see Simms again, and when they’re together, she won’t feel like anything but a happy woman. Is monsterhood conditional? Like a mirror you hold up to the war around you, just long enough to win?\n Everything dies. Even humanity, Laporte supposes. Maybe how you live should count for more than how long you last.\n Admiral van Aken sends a soft farewell. He doesn’t seem angry. More proud than anything.\n Godspeed, he says. And good luck, Miss Laporte.\n The Sinadhuja’s hull shatters. Blazes up in dirty fire and fades to ash and smelt and then the ruin of the world-killer falls away. Down below, in the accretion disk, black shapes begin to stir.\n “Good kill,” Simms says, like they’re still back in Sol, shooting down bad Alliance pilots. Her voice is tinny over the suit radios, but very confident. “Scratch one Nemesis warship.”\n High above them, silhouetted against the distant bundled stars, Atreus has turned over. She’s decelerating, burning ‘up’, trying to stop herself from hitting the black hole. Trying to make it back to the wormhole above.\n “TROJAN, Atreus.” Steele quite calm and utterly polite—disappointingly unmoved to cheer. Laporte would’ve liked to rattle the bastard. “We have your beacons. A search and rescue craft is on the way. Reply if able.”\n “Morrigan.” Simms calling. “Morrigan, it’s Boss.”\n “Atreus, this is Eris, Federation Second Fleet.” Another transmission. Stretched by blueshift and spiked by radiation. “We have transited the wormhole. We are deploying tankers to assist your escape burn.”\n “Copy you, Eris. Put your tankers on GUARD for rendezvous control.”\n “Morrigan!” Simms calls. “We’re fucked!”\n “What is it, Boss?”\n “We got cooked pretty bad, Laporte.” She sounds more disgusted than afraid. “Gamma flash. Check your rad meter.”\n Laporte picks the radiation alarm out of the small congress of alerts on her suit visor. It wants her to know that she’s absorbed a critical dose, that she needs medical assistance, and that she should consider recording a last message for her loved ones.\n “Ugh,” Simms says. She makes an about-to-spit noise and then, considering her helmet, abandons it. “I’m going to have so much cancer.”\n Laporte dismisses the alarm and cues up an anti-emetic injection. They’ll be okay. A little radiation never kept a good Federation pilot down. She starts tapping her seat thrusters, moving towards Simms, and look, Simms is already headed for her. As they pass they reach out and grab each other by their forearms so that they turn together around a common point.\n “I think we’ll be okay, boss,” she says. She can hear the beacon of the search-and-rescue ship, howling down to them from the stars above, and the frame-shifted scream of the black-hole-eating light, far down below. “I think we’ll be okay.”\n Simms claps her on the wrist, once and then again. “Me too, Morrigan.” She’s still grinning. “Me too.”\n FLASH FLASH FLASH\n ISN BACKBREAKER FASTEST\n S 0348 BAST $DATE_DYNAMIC_REFRAME\n FM SECCON//BETAQ\n TO ALLIANCE HIGHER\n \n NEMESIS PSYWAR CHANNEL DESTROYED IN CAPELLA STRIKE BY JOINT FEDERATION/ALLIANCE ACTION\n ALLIANCE SPECIAL ASSETS RECOVERED. DEBRIEFING PENDING. NOW IN RADIATION THERAPY ABOARD FEDERATION WARSHIP ERIS\n LIMITED NEMESIS INCURSION NOW IN PROGRESS VEGA. SMOKEJUMP UNITS RESPONDING. FEDERATION NAGARI TASK FORCE RESPONDING. PRELIMINARY ESTIMATE 60% CHANCE CONTAINMENT\n FIREWALL UNITS ON STANDBY\n SOL EXPEDITIONARY FORCE: IMMEDIATE RETASK TO VEGA FOR SMOKEJUMP RELIEF\n DUE TO ENHANCED NEMESIS THREAT POSTURE, DIPLOMATIC RESOLUTION TO SOL REGIME REALIGNMENT ACTION IS BACK IN PLAY\n MAINTAIN HIGHEST VIGILANCE. HUMANITY STANDS\n \n Seth Dickinson is the author of The Traitor Baru Cormorant and a lot of short stories, including \"Morrigan in the Sunglare\", this story's antecedent. He studied racial bias in police shootings, wrote much of the lore for Bungie Studios' Destiny, and threw a paper airplane at the Vatican. He teaches at the Alpha Workshop for Young Writers. If he were an animal, he would be a cockatoo."}