{"fingerprint": "fCWqRiiC6hu2mcwki9Sf22kXi6E=", "sitename": "Clarkesworld Magazine", "title": "Painterly Cyborgs and Distant Horizons: A Conversation with Julie Dillon by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dillon_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Painterly Cyborgs and Distant Horizons: A Conversation with Julie Dillon by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Painterly Cyborgs and Distant Horizons: A Conversation with Julie Dillon\n I first came across the beautiful artwork of Julie Dillon right here at Clarkesworld. Since the September 2010 Issue, her illustrations have graced the cover of this magazine fifteen times. Her style is unique and instantly recognizable for its engaging use of color and naturally flowing shapes. From elemental giants to cyborgs in need of an upgrade, Dillon’s work treats us to gorgeous visions of the future and otherworldly lands.\n Julie Dillon is a freelance illustrator from Northern California who has done art for trading cards, book covers, magazine illustrations, and perfume labels. In addition to contributing covers to Clarkesworld, she has also worked with Simon & Schuster, Tor Books, Penguin Books, Oxford University Press, Wizards of the Coast, and more. She’s been nominated twice for a World Fantasy Award, won two Chesley Awards, and was recently awarded the 2015 Hugo Award for Best Professional Artist.\n When did you realize you had a knack for art?\n I always enjoyed drawing and just did it all the time for fun, but I didn’t think what I did was anything particularly special or different until high school when people seemed to start taking note of what I was doing. It wasn’t very good work, all things considered, but it was pretty good for a high school level (not because I had a natural talent, but just because I’d already been drawing for quite a while just for fun), and it was enough that my art teachers were very enthusiastic about what I did. Some people were even willing to pay me for my work, which was a very exciting development for me.\n I’ve noticed a few motifs or themes in your artwork, such as glowing orbs at the center of giant humanoid beings. Have you noticed any other themes or patterns in your work?\n I’ve noticed that I tend to use a lot of circular shapes, both as framing elements and to draw the eye to focal points. It’s an easy way to move the eye around a piece, and I just like the way it looks. I also have noticed that a lot of the figures in my work are looking upwards and/or to the right of the image; I’m not sure why, but I feel like it makes it seem more positive, like they are moving forward towards the future or distant horizon.\n Some science fiction art tends to have an artificial feel to it, but your work is more natural, flowing, and elemental. What is it about organic shapes and subjects that interests you?\n I think it’s just that it comes easier to me. Doing clean crisp sharp lines and rigid shapes has always been difficult for me, and I think what people call my more “painterly” look is a result of struggling with that. I feel like there is more freedom and leeway with more flowing organic shapes, more ways that they can be utilized in a composition. I just don’t have the patience for what it takes to do really tight clean scifi work. I admire artists who can do it, though, it’s a skill I wish I had in my toolkit.\n You have a very distinct style and work with wonderfully varied colors. How do you go about choosing a color palette for a piece?\n Often it’s intuitive. I usually have a clear idea from the beginning what I want the color palette to be, and I just go with what feels right. But if I don’t know for certain how to approach something, I will look through a folder I have of art and photos that have inspirational color schemes to help give me ideas. When in doubt, look at color combinations that other artists have utilized, and see what works and what doesn’t, and what resonates most with you.\n How is creating artwork for something like American McGee’s Alice different from creating a book or magazine cover?\n American McGee’s Alice was my first and only concept art gig, and it was pretty short lived. It was more about generating ideas quickly for the purpose of illustrating potential gameplay mechanics, and it was incredibly open-ended. It was a challenge since it was different from how I usually worked, and I ended up only doing a few pieces. With a book or magazine cover, the intent is to make a polished finished piece that best represents the story or concept—you are making the final product rather than running through a ton of illustrated ideas that might not lead anywhere.\n What does your workflow for a piece look like? Do you start with sketches on paper or do you do everything on a computer?\n I used to do sketches on paper, but over time I found that I personally worked a lot faster by doing the entire process on the computer, from the thumbnail sketches to the finals. I don’t have to take the time out to scan things, and if I need to adjust a sketch, I can do it quickly in Photoshop instead of having to redo the whole thing. Plus, it lets me get work done when I’m traveling and all I have is a laptop but no scanner.\n What do you find most challenging about creating a piece of artwork?\n I think the early decision-making is the most difficult part of it. Trying to figure out what exactly I want to create, how to best go about illustrating the concept I have in mind, and whether or not the approach and/or concept are worth developing, reworking, or scrapping. Once I know what it is I want to do, it usually is much smoother sailing. The main thing that slows me down on any given piece is not being able to decide what approach is best, and I end up wasting time repainting things over and over sometimes.\n Do you ever doodle on restaurant napkins?\n If an idea jumps into my mind for a picture, I will try to scribble a thumbnail down on whatever scrap of paper is handy, but I don’t really casually doodle very much. I probably should, though! I spend so much of my time working on my art that when I have free time I usually try to give my brain a break by doing other things.\n You’ve successfully Kickstarted two art books, designed covers for various publishers, and created striking artwork for Clarkesworld. What’s next?\n I just signed on to illustrate a tarot deck, which is something that I’ve been wanting to do for a while and that I’m really excited about, although it will take a long time to complete. I’m working on lots of book covers, as well, and have plans for maybe doing bigger illustrated books of my own in the future.\n Do you have any advice for aspiring artists?\n Be both stubborn and patient. A career doesn’t happen overnight, and it’s going to take a lot of hard work to get there. The only real reason I’ve made my career work is because I wanted to succeed and I was too stubborn to give up when things got tough. Learning to be patient is still a challenge; I have to keep reminding myself that just because I’m not as good as I’d like to be with a certain skill, or just because I have a slow year, it doesn’t mean I’m not still making progress. You have to be patient with yourself while you learn and build up a portfolio, because it takes time. And it’s normal and okay that it takes time. Just do your best and don’t give up, if it’s something that you really want to do.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}