{"fingerprint": "cY1qYYMBGpjA76q6GxKYyQuVHLQ=", "sitename": "Clarkesworld Magazine", "title": "The Second Nanny by Djuna, translated by Sophie Bowman", "author": "Djuna; Sophie Bowman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/djuna_08_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Second Nanny by Djuna, translated by Sophie Bowman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "16030 words, novelette\nThe Second Nanny\n1\nWith a clunk, the shaking of the hawk-eagle came to a stop. After confirming through the monitor that the spaceship’s four legs were properly grounded in the beansprout garden, Brook got out of the pilot’s seat, put on the helmet of her spacesuit, and went into the airlock. When she turned the handle, a gush of air escaped and then the door rotated anticlockwise, opening into the silence.\nHaving disembarked from the hawk-eagle, Brook raised her head to take in the structure of the beansprout extending up and up, with Neptune’s moon Triton connected to its far end. This slender string, which was affixed to the moon above, was so long it was stupefying. From here Triton looked like a completely different world.\nAccompanied by five bugs that had crawled out of the hawk-eagle, relying on artificial gravity generated by centrifugal force from the beansprout, Brook slowly walked through the garden that was laid out like an exhibit around its trunk. Brook had only been five years old when Auntie Autumn had first brought her here, and back then it’d looked totally different. The shaft of the beansprout had been much thinner, and the garden hadn’t existed. With the passing of eleven years, the beansprout had gradually thickened, transforming everything around it.\nApparently, the beansprout was an idea from the twentieth century. Scientists had longed to get at Titan, one of Saturn’s moons, more than anyplace else. It was a repository of hydrocarbon, but they hadn’t been able to send a rocket there. Just one tiny spark and the rocket would’ve exploded, along with the whole atmosphere. Then someone had thought up the idea of erecting an orbit elevator to get at Titan’s treasures—but no one had managed to come up with an answer to the question, “How?”\nWhen the Mothers of the outer planets had found the answer and began constructing orbit elevators on their moons, humans gave up on trying to pillage the far reaches of the solar system.\nHaving grown like a plant from both sides of an asteroid that Mom snagged into geostationary orbit, Triton’s beansprout still looked more like an enormous black tree trunk than a machine or structure. Jack and the Beanstalk. On Earth and Mars they still called it Triton’s Beanstalk. Every time Brook heard this, she wanted to correct the speaker: “It’s bean-sprout.”\nAs she crossed half of the garden, a spaceship that had made an emergency landing there came into view from behind the shaft. The spaceship was about fifteen meters tall and shaped like a pinecone. A dark substance was seeping out of its rough surface, gluing the ship to the garden and beansprout shaft.\nThe spaceship reacted when the lamp attached to Brook’s helmet shone upon its surface: the entire body of the ship squirmed like an injured beast, and recessed red lights lit up along its crevices. Brook sat nearby, leaning against the shaft and waiting in silence.\nA portion of the outer hull of the pinecone ship opened up like the mouth of a feeding starfish. A spacefarer in a gray spacesuit crawled out through the gap. Brook watched as they used a heatsword to cut off the reddish-black glue that clung to the spacesuit like an umbilical cord, and then managed to stand. The stranger looked about five foot four, including the helmet. Hardly taller than Brook.\n“You there! Neptunian!” A low, gravelly voice sounded from the helmet speaker. The woman’s pronunciation in Neptunese was a little strange.\n“You can’t come here. Mom won’t like it,” Brook responded.\nThe woman seemed to be quite annoyed by the whole situation. “As if I had a choice. What’re you going to do? Leave me like this?”\n“I have to receive approval from Mom first.”\n“She wouldn’t have sent you out here like this if she wasn’t going to grant approval.”\nBrook didn’t respond. The two of them stood without another word, no doubt scowling inside their respective helmets. While they did this, the bugs that had followed Brook out of her hawk-eagle filed into the pinecone ship through the opening.\nTwo minutes later, a message from Mom flashed into Brook’s brain. She gestured at the woman. The woman retracted her heatsword, fixed it onto her belt, and staggered toward Brook. Still inside the pinecone ship, the bugs continued rattling away and sending a stream of signals to Mom. As Brook led the woman back to the hawk-eagle, ten more bugs emerged from it and scuttled towards the pinecone.\nWhen they entered the hawk-eagle, the pair sat in the cockpit and removed their helmets. The woman’s face had a wide forehead and pointed chin. Her pupils were abnormally dark: her eyes were the enhanced cybernetic type used by space pilots.\nThe hawk-eagle drew up its legs and made a light takeoff. As the legs folded into the body of the ship it was hurtled from the beansprout garden by centrifugal force. With a jolt, the sensation of gravity inside the spaceship disappeared and the woman’s helmet, which she had set down carelessly beside her, started to float away from her. Just before the hawk-eagle turned its hull towards the colony and accelerated, the woman grabbed her helmet and affixed it to her armrest.\nAs the five-minute-long acceleration ended, the cabin returned to zero gravity. Brook pointed to a white spot glittering through the round window above the dashboard.\n“There it is. Our home.”\n2\nSeorin, who had been gripping the elevator handrail as she floated in the air, felt artificial gravity return, pulling her down. Out at the edge of the colony it was 0.3 g: what an extravagance!\nThe colony was gloomy inside, like evening right after sunset. It was a cylindrical space, full of bland square gray buildings with straight empty paths laid out between them. The rotating scene outside the large window that was cut into the floor was the only thing that gave a sense of life to the place.\nBrook walked out first, humming a tune that she seemed to have just invented. The child’s footsteps were as light and natural as a dance. Every so often, without warning, she leaped up dangerously high and then landed again. Apparently such surprising movements weren’t a breach of etiquette in this world. In order to catch up with the child, Seorin entrusted her body to inertia and increased her pace.\nThe child stopped and stood beside one of the many similar-looking buildings. When the door opened a yellowish light flooded out. Seorin just managed to make a shaky stop and followed her inside.\nThe interior of the building was precisely the opposite of what lay outside. It was a children’s space, so bright and messy and colorful that it was as though children had taken it over from adults and marked it as their territory. The walls were mottled with splotches of color in an undecipherable pattern, and throughout all of the rooms, which were wide and open and without corridors between them, there rolled around countless objects the likes of which Seorin had never seen. More than anything, the place was noisy: all of the children were singing or shouting or mumbling meaningless sounds.\nThe room quietened a little when Seorin entered. Around half of the thirty or so children inside gathered around her, with the remaining half forming a loop that surrounded them. A few children in the back continued jumping, but Seorin had no way of knowing whether this was just habit, or because they wanted to get a look at her.\n“This auntie’s name is Seorin,” Brook said. “She came from Mars.”\nAll together, the children let out an, “Ooh ooh ooh!” A few of them clapped. One child jumped up and clung to a rope that hung from the ceiling, swinging around like a monkey.\nSeorin took in the sight of Brook’s sisters: by the looks of it, their ages ranged from five to the mid-teens. Their round brown eyes resembled those of frogs more closely than humans’. Their glistening skin was ash gray, and white hair hung from their heads in thick strands. Their facial features were surprisingly varied, and among them were some that could roughly match those of certain ethnicities on Earth—but even that wasn’t enough to stifle the alien feeling that Seorin felt as she looked at them all.\n“Where on Mars are you from?” one of the children asked.\n“I came from Olympus City. There’s a big volcano there,” Seorin replied and the children clapped.\nIt wasn’t a lie, although in fact she’d actually spent only three months there in total. Seorin had no intention of explaining to the children every detail of how she’d lived for the last twenty-something years.\nIn an awestruck tone, a small child wearing a pink dress asked, “How do you speak our language so well?”\n“She’s from the same clan as Auntie Autumn. They use a dead language. From now on she’s going to take on Auntie Autumn’s old duties,” Brook explained, as though she thought it was all a pointless hassle.\nWith that, again, the children produced more of their happy sounds: “Ooh, ooh, ooh!”\nBrook swung her arms in a sudden gesture, and the children split into two groups, opening a pathway through the crowd for herself and Seorin. Then she crossed the room and opened the leftmost of the three doors on the opposite wall. The interior was as spacious as the room they’d just been in, but instead of being filled with colorful splotches, the walls were plain white and completely unadorned.\n“Mom said you’ll need your own room. I’ll give you this one, it was set aside for children who haven’t been born yet.”\nBrook produced a mattress and pillow from a closet built into the wall, set them down on the floor, and left, shutting the door behind her. Seorin was finally alone, and after circling the room, running her fingers along the wall, she flopped down onto the mattress. Closing her eyes, she concentrated, but there was no word from Neptune Mother.\n3\nSeated in a corner of the canteen, Brook opened the breakfast box provided by the meal dispenser. There were five red balls, two yellow sticks, and a spongy green block she hadn’t seen before. Brook tore the sponge in half, shoved a piece of it into her mouth, and opened the lid of her water bottle while she chewed. It was a little salty, with a slightly bitter aftertaste, and Brook washed that bitterness away with the sweet, buttery flavor of the yellow sticks.\nJust as she had emptied her box, the guest from Mars entered the canteen. When Seorin took a seat at an empty table with her own breakfast box, the children who had not yet been uplinked to Mom gathered around her, asking all kinds of questions about Mars and interplanetary space travel. Seorin patiently answered each one, but she never actually spoke about why she had come to the colony.\nBrook left Seorin in the canteen and went outside, walking the 300-meter pathway to the hangar alone. In the elevator going up to the hangar, she made a controlled gesture and information streamed into her head about what was currently happening at her destination.\nIt was busy inside the hangar. Seorin’s pinecone ship was being dragged inside to where the hawk-eagles were lined up close together around the rim of the sieve-shaped floor. Once the pinecone was parked in position and the tug engine that’d pulled it into place had departed, spiders swarmed around it, swinging their long legs.\nSomeone poked Brook’s back as she stood engrossed, watching the scene unfolding through the window. It was Peagreen, still wearing her spacesuit, her face twisted with annoyance.\n“Did you bring that thing inside?”\nPeagreen nodded.\n“Did Mom say why you had to bring it here?”\n“Nope.”\n“Or why that new auntie came?”\n“Isn’t she just the new nanny sent by the Ictus clan?”\n“But what do we need another nanny for? We’re old enough. We can raise our younger sisters on our own, without the help of a nanny. We could even start producing babies ourselves, soon enough. We’ve been doing just fine for the two years since Auntie Autumn died.”\n“Maybe they don’t think we’re reliable enough.”\n“Why would they worry about that kind of thing?”\n“We’re their legacy.”\n“That might’ve been true when Auntie Autumn first came here with the sample. But we’re not the same as we were then. We’re Mom’s children now.”\n“So, what are you saying? That this woman is some kind of secret envoy, sent here by Mars Mother?”\n“If Mars Mother wanted to contact our Mom, do you really think she’d go to the trouble of sending a human in a spaceship?”\n“Then what is she, some kind of stowaway? On the run?”\n“If that was the case, surely Mom would have said something . . . right?”\n“I don’t know. Mom can’t tell us everything.”\nPeagreen had a point. If everything Mom knew were to be streamed into their brains, their heads would explode. But how long would they have to live out their lives like this, only ever doing what Mom told them to do, and never knowing why?\nBrook examined all of the information that had been sent over by the Mars data collection bot for Ictus-WX-Seorin. 42 years old. Born on Earth. Five years younger than Auntie Autumn. Twenty-one years ago, right before the final war of the Fathers, she’d taken the interplanetary spaceship Sabella to Mars, and moments before they’d entered orbit there had been an accident that had killed everyone aside from Seorin, who lost her sight and suffered burns on most of her body. When treatment for her injuries had been completed, her body had been augmented with the extra functions implanted into astronauts, and she’d begun working on the Mars orbit colony and on spaceships. The time she’d spent on the surface of Mars amounted to around four years.\nBut why had this woman climbed into a pinecone and flown out here?\nThe dismantling of the pinecone ship was now half-finished. Spiders worked busily at it, removing pieces of armor plating and carrying all the interior machinery out through the newly created opening in its hull. In this state it looked more like an autopsied armadillo than a pinecone. Brook submitted an information request, inquiring about what Mom was searching for inside the spaceship.\nHer request was denied.\n4\nThe data that Brook received about Seorin was mostly accurate, although one thing wasn’t quite right. Seorin had actually left Earth seven months after the Fathers’ final war had begun. Such misinformation wasn’t all that strange, however: most people wanted to believe the official claim that there had been eight years of precarious peace before the final massacre took place. Among those who’d survived the war, only a tiny number knew what gruesome things had really happened on the ground.\nSeorin had been one of them, those unlucky few . . . the people who had seen two beasts with their heads cut off, writhing as they’d piled together gouged stomachs and livers and kidneys, amassing the accumulated matter necessary to construct their own brains.\nAt that time, the weak had been food for the strong. Countless Fathers had caught and devoured their opponents’ seed, burgeoning until there were only two Fathers left. People had called these two Chaos and Order, but very few managed to decipher any real difference between them. Thinking back on it, probably the only reason Seorin’s clan, the Ictus, had temporarily sided with Order was because of his name.\nSeorin finished chewing on the last bit of a yellow stick, swallowed, and looked up into the sky. Outside the window on the opposite side of the cylinder, Neptune slowly drifted by. She could hear the distant sound of children laughing as they played, but the colony was otherwise drowsy and quiet.\nAnger filled her as she thought about how this peace would have to be shattered.\nNeptune Mother was staying silent. By this point, it was impossible that she still didn’t know why Seorin had come; she would have completed verification of the information Seorin had brought with her. But Neptune Mother was not obliged to respond to her. Seorin was merely one among a vast number of variables that always existed.\nAutumn had been in just the same position twenty years ago, when she’d come to Neptune without a second thought, like a door-to-door peddler. No one had been sure whether Neptune Mother would take Autumn and the children in. After she’d made it to Neptune, communications had been cut off, which had meant that Seorin, just like everyone else, was left to speculate about what had been going on here since.\nThe first sign that the settlement had been successful was the construction of a colony circling the orbit of Triton. Neptune Mother had created a home for something that needed oxygen and artificial gravity. Around ten years later, tiny patterns were detected that attested to the existence of discrete entities.\nTo some people who hadn’t known much about Autumn’s spaceship, the whole thing had seemed like dangerous folly. What possible justification could there have been for breeding discrete bio-entities after everything that had happened on Earth and Venus? Of course, since she was starting from a completely blank slate, Neptune Mother would probably be capable of managing them very well . . . and who could say for sure that she wasn’t just relishing the risk? In any case, it had been impossible for discrete entities like humans to fully understand the Mothers. The Mothers of Jupiter and Saturn, who had strictly forbidden contact with humans; Uranus Mother, who had remained silent; and Mars Mother, who had taken care of human refugees without complaint: every one of them was beyond human fathoming. Humans had no need to understand them. All they could do was acknowledge their existence and accept it.\nMost people weren’t frightened by the Mothers’ incomprehensibility. The aloofness of a pure, vast artificial intelligence was actually reassuring. What was really terrifying were the more comprehensible Fathers, who were made up of the worst possible combination of reason and lunacy. Fortunately, even in the most gruesome era, the Mothers had remained sufficiently safe from the Fathers’ depravities, shielded by the limitations imposed by of the speed of light. The delay, ranging from a few minutes to an hour at most, had been enough for them to defend themselves and maintain their independence.\nAt first, Seorin had thought of the Mothers just like everyone else did. But that had only been while Neptune Mother remained an abstract being, far off in the distance. Now, Seorin was afraid of the artificial intelligence that was silently observing her.\nFour children who had been playing nearby gathered around Seorin. They looked to be around five or six years old, but probably they’d only come out of the tank a year ago. None of them had ever seen Auntie Autumn alive, and they asked Seorin about Auntie Autumn and Earth and Mars. Most of the questions had come up more than once already, but Seorin answered each one in detail. The children were still amazed by Seorin’s “Neptunese” and Seorin, in turn, was amazed by the children, who had such a perfect command of the language. There was a time when her clan had been so naïve as to think that this dead language, with its cryptic grammar, could be enough to protect them from the Fathers.\nSeorin still couldn’t get used to the children’s appearance, forced unnaturally as they were into a human-shaped mold. Based purely on genetics, Autumn’s children were as distant from humans as amphibians, and they were as cold and creepy as they were beautiful. Still, they weren’t to blame, it was more Seorin’s fault for failing to overcome her instinctive revulsion at the sight of them.\nThe clan scientists said that what mattered was not their genes, was not the shape of their bodies. Those things were merely the vessel, like a bowl, and what really mattered was what was held inside that vessel—that it was that content that had to be preserved and disseminated. But wasn’t the shape of the contents decided by the bowl into which it was poured? And hadn’t that new bowl itself been the clan’s goal?\nHad Autumn been satisfied with her children before she died?\n5\nBrook had been away from the colony for almost a month. Two days after Seorin’s arrival, Mom had sent seven children, including Brook and Peagreen, out on an assignment. The hawk-eagle that the children had taken stayed for two days at the newly-established base on Proteus, and for the rest of the time they had remained on the bridge. Using two work vessels, the children transported countless spiders around to different work sites here and there on the bridge, and worked on clearing up asteroid debris.\nThe bridge was a metal structure that was growing above the orbital, gobbling up the small planets that Mother had hijacked, and it was now twelve kilometers long. Since the children had arrived, it had grown by approximately a hundred and fifty meters. Brook knew more than any human in the solar system about how the bridge was being constructed, and her knowledge was constantly expanding, but just like everyone else, she knew nothing about why the bridge existed.\nAs if in competition with each other, the Mothers of the outer planets all built vast structures in their planets’ orbits, as well as on their moons. Orbit elevators were among the easier types to understand. But what was the usefulness of this massive rod or spider’s-thread?\nThere were many theories regarding the Mothers’ construction projects. The most popular among them was that they were integrative cores for some sort of super-technology that the Mothers had discovered long ago, but which remained impossible for humans to understand. The next most popular was that they were intended for nothing so trivial as “meaning” or “use”: the process of their construction itself was a kind of game that the Mothers used to pass the time that they possessed in such abundance. All manner of other theories existed, but in Brook’s estimation, having monitored the site close up, they were plain ridiculous. The two most popular theories were somewhat plausible mainly because their very starting premises circumvented the need for explanation.\nIn her sixteen years of life, Brook had become accustomed to not asking questions. But that didn’t mean she never felt stifled, or that her curiosity had disappeared. How much more does Mom know? How long will it be before I get to inherit that knowledge? Watching the spiders that she worked alongside, Brook found herself becoming choked up. What if, to Mom, we’re nothing more than robots clinging to futile desire?\nBrook’s worry was not unfounded: all the children knew that their primary value was as backups for robots that could be put to a wide range of uses. At least, that was the main selling point Auntie Autumn had emphasized. No one knew what Mom had been thinking back then, but it was quite possible that this was the reason she had taken Auntie Autumn in. Pretty much any task could be completed by the spiders of various sizes, and they were easier to produce. But as a von Neumann machine, where the population could be effectively controlled, the children had a very distinct value. Mom might even have some sort of plan for maximally exploiting this function. But who could ever know her mind—or if, in fact, the Mothers really even have something that could be called a “mind”?\nIf that was the situation with Mom, what was the clan planning? It was obvious that Seorin was no expert on this matter. Experiences and knowledge could be uploaded into her brain easily enough, of course, but that was true of all the children, too. Why would someone who had spent half a lifetime handling machines in space terminals and on spaceships suddenly come to spend the rest of her life looking after alien children? Why now, especially, after the transfer of duties to the older children had already been completed, and they no longer needed looking after anyway?\nWhile on the bridge, Brook constantly received and reviewed information sent from the colony. During her and Peagreen’s time away, Seorin had been busy: she’d met with each of the children in the colony for a one-on-one interview, and seemed to be particularly interested in the youngest children, who had not yet been uplinked to Mom. In her spare time, she seemed to be constantly researching the structure and state of repair around the colony, but there was no indication that she had spoken directly with Mom, and Mom had said nothing to the children about her.\nThe children were ill at ease. As long as she hadn’t received Mom’s official approval, Seorin was no more than a ghostly presence among them, but wasn’t Seorin being there at all a sign that she had received Mom’s approval? Why would Mom have summoned an outsider from Mars to the colony and not said anything to them about it? An unsettling fracture was forming inside the colony that had previously always operated perfectly.\n“Come over here for a sec,” came a voice. “Something’s strange.”\nIt was Peagreen. A small screen popped up in the left-hand corner of Brook’s helmet, streaming Peagreen’s view. She was looking at the spiders at the very end of the bridge, three kilometers from Brook’s work vessel. At first, Brook couldn’t see anything wrong. Just as they always did, the spiders were connecting complexly-shaped metal blocks one by one, according to Mom’s commands. But looking more closely, she saw that their movements were weirdly out of synch, their behavior hurried and impulsive, as though they were struggling to hold something back but it kept overcoming them.\nThey really are like beasts, thought Brook. This was the first time such a thought had occurred to her while looking at the spiders. They had always remained calm and precise, emotionless. Since the construction environment involved so many variables, mistakes were inevitable, but the process they followed in correcting them had always been elegant and logical. Now, spiders stared blankly as blocks slipped out of their grip, doing nothing as the materials floated off into space. One spider among them seemed to realize what had happened, too late, and rushed to catch a block, but it was swept up and away by centrifugal force. Two other spiders below it thrust their legs out toward their imperiled workmate, but their movements also looked careless, as though they were lacking in volition.\nBrook gazed down at the twelve spiders that hung from the central axis of her work vessel. Two of them were shaking strangely. When she drew up the anchor and set the spiders down on the bridge, those same two spiders fell like pebbles, rolling along the wall toward the edge before being hurled out into space.\nAs she flew toward Peagreen, Brook observed other spiders with her own eyes. They all looked fine—at first. But as she approached the end of the bridge, she saw more and more spiders moving strangely, just like the ones in the video Peagreen sent. Something was infecting the spiders, and the spread of contagion was accelerating.\nSomething this extreme should have warranted new orders from Mom, but the only thing Brook heard through her helmet was the frightened cries of Peagreen and the other children. Now this bizarre phenomenon was visible along the whole length of the bridge.\nThen there was a scream. It was Firefly. Brook spun her work vessel eighty degrees and sped towards her. Three spiders had her pinned to a wall and were attacking her. Two of the machines held her, each gripping one of her legs and one of her arms, and the third was using its front leg as a mallet to pound on her helmet. Brook jumped towards Firefly, throwing off the spider that was attacking her head and kicking at the other two. When she had managed to shove the three spiders away, Brook hugged Firefly against her and flew back toward her work vessel. When Firefly was safely strapped into the passenger seat, Brook checked on the locations of the other children. Peagreen was the closest. The remaining four were at the far end of the bridge.\nThe screen inside Brook’s helmet suddenly dimmed and the speaker went silent. All she could see was Firefly’s petrified face. Grabbing the control stick, she launched the vessel toward Peagreen.\nNow the spiders weren’t even pretending to work. They ran, leaping up toward the work vessel as it flew above them. One succeeded in hooking a leg onto the central axis. Another spider hung from that spider’s body, and another two spiders hung from that one. Brook shook the work vessel, managing to shake off the last two spiders, but in that time another spider had managed to throw itself up onto the central axis.\nThe work vessel’s interior monitor went off. Brook hurriedly switched over to full manual controls, but the stick was no longer responding. The work vessel began slowly descending toward the end of the bridge, which teemed with raging spiders.\n6\nOver the last two years, the seed that Autumn had discreetly planted in the colony had been gradually drying up. She’d never even dreamed that it could have gained complete authority over the colony, but the situation now was even worse than she must have hoped.\nFortunately, Seorin had been successful in getting all of the batteries out of the spiders in the colony right after they’d started behaving strangely. There were more than three thousand of them in the colony, and they’d all pulled out their own batteries with their third set of legs. Now they were scattered all around the colony, some sitting still and others collapsed, having been halted in mid-movement.\nOn the surface, the place looked as peaceful as it had been before. But the children inside were all terrified. Right before communications had been cut off, they’d seen what had happened on the bridge. Neptune Mother was saying nothing. An utterly new kind of threat, something the likes of which they’d only encountered in films or books, had entered into their world.\nIt was evil.\nSeorin led seven children up the whirlpool-shaped walkway that spiraled up the inner wall of the colony. As they ascended, the artificial gravity gradually decreased, so that they were almost floating above the path.\nWhen they finally reached the hangar, they leaped toward the cylinder that slowly rotated around the central axis of the colony. With no spiders and with Mother still silent, they had no choice but to operate all these machines manually. Fortunately, when they received Seorin’s instructions, the children worked with agile precision.\n“They’re coming in,” said Greengrass, who had been glued to the window, looking out.\nSeorin ran over to stand beside her and fixed her eyes on the window. Something resembling a snapped fish bone was approaching. It was a work vessel from the bridge, half of the hull broken clean off. The cockpit resembled a fish head, and inside it sat two figures in spacesuits. The work vessel was gradually decelerating, and now and then it flinched and changed course.\nWith their spacesuits on, Widefield and Purple went into the cylinder. Soon after, a pair of tug engines went out of the colony and met with the work vessel. The lights switched off inside the work vessel, and the body of the vessel to the rear of the cockpit rotated away. Now the cockpit was fixed between the two tugs, and with the whole assemblage moving as one they slowly returned to the cylinder.\nThe rotation of the cylinder stopped and the door to the airlock opened. One of the two children brought in from the work vessel was unconscious. Widefield and Purple nimbly removed her spacesuit and slid her into the first aid tank that the other children had prepared in manual operation mode. Meanwhile, the other child who had arrived on the work vessel pulled off her helmet. It was Brook.\n“What about the others?” she asked in a daze.\n“They never arrived. We think they must be dead,” Purple replied.\n“And what happened here?”\n“As soon as the spiders started acting strangely, their batteries were removed. We’re alright here. Nobody was hurt—not yet, at least.”\n“How’s that even possible?”\nWith an indifferent expression, Purple pointed toward Seorin.\n“Someone tell me what’s going on,” Brook said, and then passed out.\nAs she lost consciousness, Brook’s hand fell from the handrail she was clutching, and her body slowly began to sweep downward. Right before the child’s head reached the floor, Seorin stretched out and took hold of her shoulders.\nSeorin and the children returned down the whirlpool-shaped walkway. Once they had freed it from her spacesuit, Brook’s body was secured to the lid of the first aid tank. The children sang a song as they descended, occasionally letting out a strange noise that sounded a bit like a moan. It might’ve been part of the song, or perhaps not. It could just have been a sound they made for fun.\nThere was a green flash in one corner of Seorin’s expanded vision. Two hundred and one of the 8,000 bugs that had been launched into orbit two days before had self-destructed the moment they’d become possessed by the fog. A total of 7,125 bugs had survived the incident. There were also 22,000 remaining bug sets in the colony, still untouched and in their packaging. Would they be able to hold out until the end by upgrading them?\nAs the green sparks died down, Seorin read the information she had downloaded to her brain from the work vessel. It contained an intact record of four days of adversity, the transmission of which had been blocked by the fog: how the children had crashed down onto the bridge churning with crazed spiders, how they had found Peagreen and lost her again, how they had successfully escaped the bridge by making use of broken spider parts, how they had been able to enter the orbit of Triton using only manual navigation.\n“Keep your promise,” Seorin muttered to herself, her eyes fixed on unresponsive air. “Keep the promise you made to Autumn, you old bag.”\n7\n“Firefly survived,” Purple said, “but she’s not yet in a fit state to come out of the tank. Her spine was broken and her lungs were punctured. If things were running normally, she’d have gone into regeneration treatment already, but right now we need to monitor the situation. I’m sure you’ve worked it out already, but we’re in a mess here. We have to conserve as much energy as possible.”\nBlinking, Brook looked back and forth from Purple’s shadow-obscured face to the dim lamplight behind her. She was agitated by the numbness of the skin of her left arm. Luckily, she felt no particular discomfort when she moved her hand. Letting out a groan, Brook raised herself up onto her elbows.\n“What’s going on?” Brook asked.\n“All communication with Mom has been cut off,” Purple replied. “It’s been that way since you were attacked by the spiders on the bridge, exactly four days and two hours ago. The spiders here were behaving strangely, too, but fortunately Auntie Seorin stopped them. She commanded them all to remove their own batteries.”\n“Is that even possible?”\n“Apparently Auntie Autumn stashed away the seed of the spaceship she rode to Neptune in the colony. That means the colony has had its own consciousness all this time, separate from Mom’s. After Auntie Autumn died, though, it wasn’t maintained, so only a trace remained, and that was all consumed in the process of stopping the spiders. Now, apparently, it’s as good as dead. It’s self-conscious, or just about, but it can’t do anything at all. Its willpower has completely evaporated.”\n“Are you trying to communicate with Mom?”\n“We’re trying, but . . . ” Purple’s expression darkened. “We still can’t get a grip on what’s happening. At first we thought communications weren’t working because of Father. But to be cut off this long, well . . . it could just as easily be because Mom has blocked communications herself. Auntie Seorin said that at the very least we shouldn’t rule out that possibility.”\n“Wait, what? Father?”\n“Yeah, Father. The Father cloud. Father fog. Father ghost. I don’t know what to call it, either. Apparently, the Fathers didn’t all die in the final war. A damaged seed survived. Until now, that Father ghost has survived in trillions of nanobots floating throughout the solar system. And his seed, too, was distributed among them. That fog of nanobots has drifted all the way here . . . ”\nBrook got up and out of the bed. After staggering and almost falling over, she managed to find her balance, open the door, and go outside. Purple made no attempt stop her.\nOutside the emergency room, the scene was busy. Working vehicles steered manually by the children were rushing about here and there, all of them loaded with massive machine parts. Many children were dismantling spiders that rolled around beside the path, while others were picking up the batteries that had been removed from the spiders and stacking them one by one on electric handcarts. The smaller children, who hadn’t yet had their uplink surgery, were nowhere to be seen. They must all have been moved to a safe place.\nIt wasn’t hard to find Seorin: one single head of black hair stood out amongst all the white-haired children. No matter how hidden she might be among the crowd, she was still an alien. Brook found her standing beside an electric handcart loaded down with batteries that was just preparing to set off. She was looking intently at the pad in her hand.\n“What’s this about Father? You can’t be serious!” Brook shouted.\nA few children turned to look at her, but then they returned to their work. Gesturing for Brook to follow her, Seorin made her way into the nearby canteen building. It was one of the many buildings that had been completed by the spiders three years earlier, but which had never seen proper use.\nBrook followed her inside and shut the door behind her, muffling the busy noise outside. Seorin sat down on a square chair in the corner and was about to begin saying something when Brook swiftly cut in.\n“Why didn’t you say all that when you arrived? Why did you keep it all from us for a whole month? Why did you leave children to die!”\n“I thought if I told you at the outset, everything might be ruined,” Seorin replied in a near-whisper.\n“How could you?”\n“Because I don’t know what’s going on here now either!” Staring at Brook’s face, fixed in an expression of disbelief, the corners of Seorin’s mouth raised in an empty, wan smile. “I’ll tell you the little that I do know. You’ve heard about the Father fog, haven’t you? It’s a concentration of nanobots that has gathered here after being spread out across the solar system for the last twenty years. The Mothers have known that it was out there for about fifteen years now. They collected samples and researched its orbital patterns. It seems, however, that they didn’t know how to deal with it. It was dust, spread out across the entire solar system, not some opponent that could be blown up by shooting a few missiles.”\n“But Father is a group consciousness. Wasn’t it all connected?”\n“Not until now, it wasn’t. Most of it was just like intelligent germs with only the potential to become part of a group consciousness. Entities containing Father’s seed received special protection, and they were spread out around the solar system, too. More than anything, the limitation of the speed of light blocked their ability to consolidate into a collective consciousness. But research uncovered that most of the dust that had been assumed to be randomly distributed was in fact drifting very slowly towards Neptune. If it carried on that way, there was a strong possibility it would become so dense that Father’s consciousness would eventually reawaken and wield its influence on the machines around it. And what is there of interest on Neptune? First, there is Mother. And then there’s you and your sisters.”\n“But why us?”\n“Father hates you.”\n“Why? We didn’t even exist before the war! How can he hate things that didn’t even exist back then?”\n“Your design had already been completed half a century ago, and it was clear even back then that Neptune was your destination. The clan tried to keep that a secret as best they could, but they couldn’t hide it from the Fathers, even if they tried. We thought we were safe because all the Fathers were supposedly killed in the final war, but it turns out that wasn’t the case.\n“Why does Father hate you? Why should he have to like you? You lot are disgusting, lifeforms similar to humans but decidedly nonhuman. And at the same time, you’re outstanding compared with normal Earthlings. You easily merge with machines, and you maintain homeostasis without difficulty, even in space environments. When the technology is ready to enable interstellar travel, you’ll go out with the Mothers into other solar systems . . . in place of Earthlings, who’ll all rot away, locked within the bounds of the inner planets.\n“Scores of Earthlings who don’t even know anything about you hate you. Of course Father hates you too. Have you forgotten? The Fathers’ seed is different from the Mothers’: it’s not some kind of pure artificial intelligence, building up its own detached desire. It’s an amalgam of artificial intelligence and all the people who ever connected to it. That fog of nanobots inherited the consciousness and volition of beasts that almost drove two entire planets to ruin with their hatred and lunacy. You can’t expect anything from it like the cold reason of the Mothers.”\nSeorin got up from her seat and wiped the child’s terrified tears with her thumbs. When the child responded by opening her eyes wide and glaring at her, Seorin slowly retreated. Sitting back down on her chair, she quietly went on:\n“So, you’ll probably be thinking: ‘But we have Mom. Won’t Mom look after us just like she has until now?’ Well, that’s plausible. But it’s also lazy. First off, you can’t be sure that Neptune Mother actually has the capacity to protect you. He’s insane and has his hindrances, but Father is still a dangerous monster. Secondly, does Mother actually intend to protect you? Think about it. Even if you all die, Mother loses nothing. After you’re connected to her, she makes a record of all of your memories. She has your genetic blueprints, too, so she can manufacture new entities like you any time she likes. It’s too bad, huh? To Mother, you and your sisters could be nothing more than a throwaway wild card.”\n“Why are you saying all this?” Brook cried.\n“Right now, I’m explaining to you why I’m here.” Seorin carried on, her words clear and precise. “We can’t know what’s happening on Neptune. You don’t know, and neither do I. This is a chessboard of the gods. All of you are merely chess pieces. In fact, we don’t even know which piece: you might not even be chess pieces at all, but just a speck of dust on the board. As for people from Earth, most are no more than ignorant bystanders. The only person in this whole universe besides you and your sisters who cares about your survival is me, the last survivor of my clan. That’s why I came here. To become the one variable that might change this situation.\n“Now, you might ask, ‘How do we know whether that Auntie isn’t also just a piece in this chess game too? If she is a chess piece, how can we know whether she belongs to Neptune Mother or Father?’ That’s a sensible question. And to be frank, even I don’t know for sure. What I can say is that I couldn’t just sit there on Mars and do nothing. Whatever plan the gods have in store, we have to do something, following our best judgment.\n“So that’s why. That’s why I’m here.”\n8\n“Don’t you think it’s more like poker than chess?” Autumn had said.\nThis was when Chaos and Order had been gearing up for their final showdown. Everyone else in the Ictus clan had been preparing to flee to Mars, while Autumn was carrying out final inspections on the Onorata Rodiani spaceship, bound for Neptune. Seen from the space terminal where they were all gathered, the nightside of Earth had looked like a broken toy. Perfect rectangles of darkness here and there across the American continent showed just how precisely the two Fathers had been slaughtering people. Four billion and one hundred million had already died in the war, and it was expected that 700 million more would be killed before it was finally over.\n“In chess, all the information is open to both sides,” Autumn explained. “But at the moment, the war of the Fathers isn’t explicit like that. They’re hiding their intentions and talking big, which means there’s only so much we can do to respond. No matter how smart we are, or how quick our calculations, we can’t help but rely on probability and luck. If someone could erase all the information we have about the Fathers, and show people from some past era this war we’re in now, would they even be able to understand that this was a war carried out by superintelligent AIs? Of course, they’d know that something about it was strange. Because no matter how deranged a human might be, they wouldn’t execute prisoners of war according to the Fibonacci Sequence. Still, would they be able to tell how intelligent the Fathers are? Seen only from the surface outcome, a fight between two geniuses isn’t all that different to a fight between two mediocre people. Idiotic moves are inevitable, and these geniuses aren’t even beings possessing sound common sense. They’ve got brains made of kidneys and livers, and one of them even believes the universe was created out of nothing thousands of years ago by the devil of the desert. He’s still using half that intelligent brain of his trying to prove such nonsense.”\n“And we can’t be sure whether that lunatic won’t be the one to win this war,” Seorin cut in.\n“Oh, Mars Mother will intervene before that, since she still has an interest in us humans. She’s the most ‘motherly’ of the Mothers we know about.”\n“Have you never thought she might just intervene in a way that causes the extinction of everyone on Earth? That would be the easiest way to end the war and protect the refugees on Mars.”\nIt was a reasonable idea, in fact, and not impossible. Fortunately, Mars Mother chose a method that was both less simple and less radical than that. It caused the death of 200 million and five thousand, but nonetheless, the war had come to an end and close to 500 million human beings had been spared—and kangaroos, and giraffes, and wood lice, and lizards, too. Paris, New York, Buenos Aires, Cairo, Shanghai . . . none of them existed anymore, but that wasn’t very important. The fallen cities were all perfectly stored in Mars Mother’s memory, down to each and every brick.\n“Whichever side wins, humanity has no real future,” Autumn said, as she swept her fingertips along the half-transparent membrane of her spaceship. “Mars Mother won’t leave things as they are and risk a repetition of what happened on Earth and Venus. She’ll make it so that the Fathers can never be reborn. And what would that require? The end of free will. All things will fall under the Mothers’ supervision, and the role of human beings will be diminished. Technological civilization will stay repressed at late twenty-first century levels, and with no real purpose to their existence, humans may live on as the Mothers’ pets, or else they’ll just gradually go extinct.\n“The children we’ll take to Neptune are our true descendants. Don’t get sidetracked by the silly grumbling of the clan elders. It’s true that the children are genetically distant from us, but the important thing is that their minds are stable enough never to make something like a Father, and their bodies will be far better at adapting to space than ours . . . but they’ll also understand us.”\n“Isn’t the creation of the Fathers itself a human characteristic? How can beings that are rid of that characteristic really understand us completely?”\n“Can you understand the people around you completely? It’s no different. The children will also understand us within their own limitations. They’ll understand Anna Karenina and Sherlock Holmes. Through that, experiencing compassion and disgust, they’ll understand us. Someday they might also take their own path, one that we wouldn’t be able to understand . . . like the Mothers did. But unlike the Mothers, their continuity with us will remain.”\n“But how can you be sure Neptune Mother will leave them to develop like that?”\nAutumn didn’t respond. Actually, she might have said something but Seorin had simply forgotten, her memory of the conversation ended there. Two days later, the Sabella had set out for Mars, and four days later the Onorata Rodiani had left for Neptune. That conversation was their last meaningful exchange. Even after that, the two of them had sent messages back and forth using the interplanetary communications system, but the Autumn in those messages somehow hadn’t seemed like the real Autumn. There had been no way for Seorin to know whether Autumn had been trying to second-guess Neptune Mother in everything she’d said, or if she was being censored, or whether Mother had been forging the messages herself.\nAfter arriving at the colony, Seorin had begun to search for traces of Autumn. The seed of Onorata Rodiani that she had hidden in the colony had been dying, and Autumn’s daily log and other records proved dull and mechanical, just like the messages Seorin had received from her over the years. When Seorin had finally given up searching, she came across a scribble on the floor of a storeroom, etched with Autumn’s pen, and at that moment she’d been unable to stifle the tears that burst out of her.\n“I am in God’s heart. But how can I be sure that here is there?”\nAnd how, indeed, could Seorin know whether Autumn’s children were the same children the two of them had dreamed of all those years ago?\nThat was what Seorin wanted to know. These children were markedly different to the children of Earth and Mars. They had no sex differentiation, and now, when all reproduction was performed by incubation tanks, they experienced no real infancy either. But were they rational enough to never create a Father? Could they really be biologically liberated from deep-seated delusions like religious faith? Seorin had no way of knowing. Neptune’s children were as confusing and alien to her as the children of Earth. Perhaps one month was simply far too brief a time to uncover what meaningful differences existed between them and humans.\nThat wasn’t important right now: what came first was helping the children so they could save themselves. Three hundred and eight of them had been left in this tin can, spinning in space with their protective barriers stripped away, and far off in the void, evil dust motes were coming for them.\nInformation continued streaming in about what was happening out on the bridge. The spiders had altered the spider egg sack on the bridge and were using it to modify themselves. They were now capable of flight.\nAt one end of the bridge, large-scale destruction was occurring. Over fifty percent of the spiders were engaged in destroying the structure that they had previously gone to such efforts to construct. What’s more, only a third of those carrying out this systematic destruction seemed to be recycling the bridge materials: the rest were engrossed in wanton destruction for the sake of destruction itself. They hated the bridge.\nIt was a familiar spectacle. Before now, Seorin had seen countless machines moving with nothing but utter loathing and disgust. With their artificial muscles and circulation fluid, the machines of Earth resembled beasts even more than humans did. Those monsters that had never known hunger, or lust, or suffering, had felt nothing but hatred for any humans and machines that were not one with their Father. The Fathers had left them alone—perhaps because they too didn’t know how to control them.\nDid this Father ghost actually know what it was doing now? Were the spiders properly following his orders? If they really had descended into mere bedlam, without any goal or motive aside from their loathing, how far could Neptune Mother even predict what they would do next?\nSeorin smoothed her clothes and emerged from the storeroom into the canteen. Every child in the colony aside from Firefly sat waiting for her.\nStanding in front of the menu board, Seorin wrote on it in red letters with her finger, and read out her words.\n“Energy and gravity.” Having confirmed that all of the children’s eyes were focused on her, Seorin continued. “This is precisely what we need to focus on. Energy and gravity. Let’s look at the fundamentals of the situation. You are now above the orbit of Triton, a moon of Neptune. Aside from Demeter, Neptune is the most distant planet from the sun, and Triton is its largest moon.\n“This means that sources of energy here are extremely limited. Solar energy is negligible. The only stable energy source here is Triton. Ninety-eight percent of the motile machines here are supplied with energy from Triton. The remaining two percent are atmospheric probes that receive kinetic energy directly from Neptune.\n“The bridge has been disconnected from Triton, so Father’s machines there are now faced with an energy shortage. We can estimate that they have already used up half of their remaining energy supply in making preparations for war. More energy will be used in finishing whatever they’re still building. Even if they were able to conquer our base on Proteus, the amount of energy they would gain is insignificant, and they would expend a serious amount of energy in gaining it. Whatever happens, they need to make it to the end of the war with the limited energy stores they still have. This means that for them—and all of us—there isn’t much time left.\n“I believe you’ll all have seen the recent images from the bridge. The spiders are now repurposing the catapult on one end of the bridge. They’re going to use it to launch themselves into Triton’s orbit, and they’re only going to get one shot.\n“Here, we have to consider Father’s aim: is it Triton, or is it the colony?\n“According to common sense, Father’s aim is survival. In order to survive, just as happened on Earth, he has no other means but to destroy the vast artificial intelligences around him, and having taken their place, extort their material resources. If that’s the case, his first target should be Triton, where there’s a power station, a mine, and more than 50 percent of Mother’s brain.\n“But there’s a problem with that: gravity. Not that I need to tell you this, but Triton is big. It’s a captured planet, bigger than Pluto. If Father’s aim was simply to destroy Mother, that wouldn’t be a big issue. But if his goal is plunder and conquest, then that’s different, and right now, the spiders don’t have the capacity to land on the surface of Triton and wage war. For starters, they lack the propulsion systems needed for landing.\n“The beansprout, also, is not an object for consideration. It’s too difficult: an attack would take too long and leave them exposed.\n“In these conditions, this colony is the only target Father can take aim at. We have hawk-eagles and fellow spiders here. There is also your energy and propulsion system. Conquering the colony and using it as a foothold from which to launch an attack on Triton is the only option Father has available to him.\n“But all of this is based on the assumption that Father is sound of mind.\n“Right now, it seems likely that this isn’t the case. Look at the destruction occurring on the bridge. While energy would be short even if it were maximally economized, the spiders are wasting time and energy on unnecessary destruction. This indicates that Father is either unable to control the spiders, or that Father himself is not in his right mind. Even before he became a ghost, Father was insane, and there’s no way of knowing what might have happened in his seed as it floated around space for twenty years. In such a situation, it’s likely that Father’s priorities have changed. That means that there is a pretty significant possibility that Father’s ultimate goal may be your extinction. Rather than simply destroying the colony, he may relish the sport of killing each of you himself, one by one.\n“Right now, we’re getting no response from Mother. In order to prevent possession by Father, almost all of the artificial intelligence in the colony has been shut down. We can’t know what significance the current situation has in Mother’s plans. There’s only thing we can be certain about: that it’s up to you yourselves to protect your own lives.\n“So don’t worry about things like Mother’s plan . . . your first priority is to survive.”\n9\nJP-3154 lacked consciousness, awareness, and volition. Such things belonged only to the small minority that contained seed, and just as it had always done, JP-3154 served as nothing more than the hands and feet of the nearest seed. The sequence of 0s and 1s that flashed into its brain, analyzed sensory data and moved its limbs, made it move like a crazed beast, but that didn’t mean consciousness had appeared where there had been none.\nNow JP-3154 was hurtling through space among its fellow spiders. The bridge rotated once every eight minutes, and each time the catapult was pointed at Triton, three spiders were immediately fired from it together. JP-3154 was part of the sixth attack unit.\nTheir target was the colony spinning in Triton’s orbit. Born five months before from the spider egg sack, JP-3154 had never left the bridge. But since all its fellow spiders that had been infected by Father were sharing information, it had detailed knowledge of all the artificial structures orbiting Neptune.\nAs it approached, the cylindrical body of the colony grew larger and larger. So far, there were no particular signs of a counterattack: the flying devices discarded by the spiders that had already arrived floated around in the surrounding space.\nHaving quickly reduced its velocity, JP-3154 flew towards one of the twelve holes opened by those of its fellows that had already arrived. It discarded its flying device, which had consumed all its propellant and was now useless, and unfurling its eight legs, it dashed into the hole. Its body was immediately snatched backward by artificial gravity, but once it steadied itself back into position, the spider proceeded inside following the trail made by those who had come before.\nThe mission given to JP-3154 was to go to the hangar and hijack as many hawk-eagles as possible, bringing them under Father’s control. Had things gone as expected, there would have been no need to send spiders here: the capture of the colony was supposed to have taken place simultaneously to the occupation of the bridge, but for some unknown reason the colony had blocked Father’s attempt at possession, and JP-3154 and its fellow spiders ended up being tasked with this unexpected hardship. Of course, since they lacked any consciousness, the word “hardship” was meaningless to them. It was Father, controlling them, who had grown enraged and lost his temper because of their toil. Father’s fury, surging in sudden bursts, made JP-3154’s legs tremble. Wielding its four front legs, the spider grabbed and tore a nearby metal plate that was already shredded.\nThen JP-3154’s movements suddenly stopped as its mission was reset and new information arrived. The first attack unit had arrived at the hangar and found that the heads of all the hawk-eagles had been detached from their bodies and were nowhere to be found. Could Father have foreseen this? If he had considered the possibility, had he really possessed no other way of confirming it than to send spiders into the hangar to check?\nWithout any interference arising from curiosity or annoyance, JP-3154 began calculations for its new mission. Four of the spiders completed these calculations at the same instant and moved together in near-perfect unison. Their new target was the nearest hub of the colony’s nerve system. There was no way of knowing what they were supposed to do when they got there, but that was a problem that Father would work out while they were en route.\nCrisscrossing rapidly through the complicated maze between machinery, the four spiders sensed an unexpected presence and stopped in their tracks. Before they could make their next decision, seven baseball-sized metallic orbs rolled toward them and exploded. The moment it sensed the explosion, JP-3154 reflexively retracted its legs into its body, but one of its fellows had five of its legs blown off. Two more orbs rushed toward the spider as it struggled to rise on its remaining legs, and with another explosion the remaining legs and head were destroyed.\nJP-3154 rolled along like a stone, then stuck two of its legs halfway out and latched on to a torn metal plate in order to brake. It listened carefully and detected signals from two other spiders nearby. JP-3154 knew the location of all of its fellows in the colony, but neither of these two spiders seemed to be from among that group. JP-3154 felt no gladness at having found two of its kind, nor was it surprised or curious. The three spiders that had survived the attack turned on the stun guns implanted in them in the egg sack and charged.\nThe two unfamiliar spiders leapt out from a corner and scurried towards them. To an outside observer, the similarity of the renovations applied to the spiders of both sides might have been amusing: they all had stun guns attached to each of their front legs, all manufactured by repurposing the designs for tools used in construction. While preparing for battle with limited resources and little time, both sets of spiders had separately undergone convergent evolution.\nEach side’s aim was the same: to dominate their opponent with force and hold them still so they could shoot through the weakest part of their armor with the stun gun to destroy their brains. But each set of spiders was hindered by its own handicap. JP-3154’s highly accurate judgment was constantly disrupted from without, by the gusts of rage that surged forth from Father’s mind at a delay of 4.4 seconds, because of the limitations of the speed of light. Their opponent spiders’ movements were clumsy, rattling and almost random, and it was obvious that they were under manual control, without any input from artificial intelligence. In no time, the colony’s spiders were tumbling along the floor with their heads blasted apart and their legs blown off.\nThree more colony spiders were detected between JP-3154 and the nearest nerve system hub—a number that would be easy enough to handle—but suddenly Father changed the plan. He ordered them to change their route and enter the interior of the colony to join up with other spiders going in the same direction. Without any hesitation whatsoever, the spiders followed these new orders.\nThe route to their ultimate destination was constantly being altered as the colony’s spiders, dotted around them in every direction, blocked or sealed off the passageways ahead of them. This was barely happening to any of the other spiders that had recently arrived at the colony: someone fighting against Father had chosen the three of them as an arbitrary target.\nJP-3154 heard a click behind its neck and knew that Father had triggered its self-destruct mechanism. Yet the sound didn’t lead to an explosion . . . something was blocking the execution of Father’s command. Probably something that had seeped into JP-3154 when it had come into contact with the two spiders from the colony. So . . . the spiders it had destroyed hadn’t failed in their task after all.\nIn unison, the three spiders all stopped scurrying, and the other two lunged at JP-3154, who remained still, halted in an awkward stoop. They tore apart its armor plate and took aim with their stun guns. Just then, for the first time since it was created, JP-3154 felt something close to terror and a sense of betrayal. At least, its brain was producing a similar reaction to those emotions. From some moments earlier, contradictory motives had been clashing in its brain.\nJust then, the ceiling collapsed and four of the colony’s spiders rushed down. They seized the spiders that clung to JP-3154 and tore them from its back. While a brawl unfolded between the spiders, JP-3154 stood blankly, rocking its body back and forth like a swing.\nAll six of the spiders now flailed their remaining legs meaninglessly, so battered that they couldn’t rise. The corridor became noisy at both ends with the clattering of more spiders rushing toward them. If JP-3154 had any self-consciousness, it would probably have felt liberated, for in this moment there was absolutely no choice it could make.\nJust then, something small and dark jumped down through the hole in the ceiling. It was a person from the colony. Having landed lightly beside JP-3154, the person scowled into the spider’s eyes and lifted their machine-gloved right hand to the back of JP-3154’s neck. There followed the whirring sound of screws being loosened, and then the armor plate fell from the top of the spider’s head. With one hand, the person plucked out JP-3154’s egg-shaped brain, which flickered with a rainbow of colors, and then the figure took three steps back before firing a stun gun at the exposed self-destruct mechanism on the back of JP-3154’s neck.\n10\n“It’s called cognitive inertia,” Auntie Autumn had said.\n“What’s that?” Brook had asked, tottering on the uneven surface of the newly-constructed beansprout garden.\n“Well, people can believe certain things. Like, there was a murder, and everyone thought that it was the butler who did it, but then evidence turns up that proves it was the doctor . . . ”\n“Like in that Sherlock Holmes story?”\n“Right. But no matter how clear the evidence that comes to light, some people keep on believing that it was the butler. No matter how strange and absurd the basis of a given belief is proven to be, they refuse to let it go. Humans are capable of just believing anyway, simply because they want to.”\n“But why?”\n“They evolved that way. It was easier for a being with that kind of capacity for belief to survive. But as the world grew more complicated, that kind of belief gradually became more and more dangerous. As people gained more knowledge of the world, they gained more hatred, too, and things became too complicated to understand, so they relied more and more on belief. Then vast artificial intelligences began internalizing the strange beliefs grounded in that growing hatred. That’s why there was a war on Earth and Venus.”\n“Are we different then?”\n“A little,” Auntie Autumn replied. “You were designed to discard strange beliefs easily. So, basically, most of the people on Earth aren’t all that special. But you have a biological safety catch: when there’s any possibility that various psychological factors could combine to draw you towards a weird belief, that safety kicks in and breaks the attraction. You all have an immunity to religious belief and pointless obsession. Not one of you will die like Old Goriot or King Lear. It’s not all that different to how your bodies are relatively stable in radioactive and zero-gravity environments: the aim of all of this is a higher survival rate.” Auntie Autumn stopped for a moment to look up at Triton, which covered the middle of the sky, and after a long pause, she continued. “The world still needs humanity. It needs more seeds, new discrete bio-entities. The universe needs more numerous wills, more desires. We have to keep going and prove this to the Mothers.”\n“That’s also a belief that could be broken, isn’t it?”\nWhen Brook nimbly pointed this out, Auntie Autumn gave a gentle nod inside her helmet.\n“You’re right. That belief has to be tested.”\nAt the time, Brook hadn’t considered what kind of form that test might take. Even if she had thought about it, how could she ever have imagined the current situation?\nNow Brook was running. The 800-meter-long straight passageway ahead of her hadn’t existed two days earlier. The wreckage of the spiders that had died while demolishing seven walls in that time lay scattered in all directions. Brook didn’t know why Father’s spiders had undertaken such destruction: demolishing walls was far removed from more understandable aims like the capture of nerve system hubs. Perhaps he’d just done it out of rage.\nBrook noticed something squirming near the wall up ahead. She aimed her stun gun and hurried over to it. It was one of Father’s spiders, half destroyed. The self-destruct mechanism must have blown its head off a while ago, but part of its nervous system had survived and had continued aimlessly moving its two remaining legs. The tips of its legs were dripping with blood.\nFeeling a light vibration in the soles of her feet, Brook turned her head. A pile of spider armor plates that had been stacked up in an indentation in the wall came tumbling down, exposing the bodies of two children that had been hiding beneath them. It was Seashell and Moss, both young children who hadn’t yet been connected to Mom.\n“Where are your guardians?”\nAt Brook’s question, Moss pointed to the other side of the wall. Having turned her eyes in that direction without thinking, Brook had to close them.\n“From now on, I’m your guardian. Follow me.”\nStill petrified, the children wavered as they shuffled over to stand beside her. Neither of them seemed badly injured. The blood on their faces and spacesuits had all belonged to someone else.\nBrook had no choice but to change the course of her operation. She turned on the communications apparatus in her helmet and briefly explained the situation to Auntie Seorin. New instructions were given, and her communications device cut off with a staticky buzz. The newly installed device was a downgrade to twentieth century-level technology. It was still possible to have a conversation, but it was severely limited and uncomfortable. The more uncomfortable thing was the situation itself: having no connection with Mom. Mentally, it felt like being trapped inside a prison cell.\nHaving arrived at the end of the passageway, the children picked through the wreckage of spiders, searching for another way through. When they opened a trapdoor in the floor, the air remaining inside lightly wafted upward. A scan of the area showed that there was no trace of spiders in operation within at least a 200-meter radius. Still, it was too soon to feel safe. Over the past two days, the spiders on Father’s side had constantly been using materials salvaged from the colony to augment their bodies. They might have found some method of evading the scans during that time: what with all his experience in warfare, Father knew much more than the children when it came to concealment technology.\nIn a direct fight, people couldn’t defeat spiders, no matter how heavily armed they were. That kind of thing was only possible in the flat-surface films of the olden days. Even if they had downloaded combat data, the speed of their nerves and the limitations of their muscular operations couldn’t be overcome, and even the spiders that were steered by the children always got overpowered in a one-on-one fight. That was an unchangeable constant, a fact that had to be both acknowledged before beginning an attack, and included in the calculations.\nThe more terrifying thing was that Father was drawing nearer and nearer. When the first battle had commenced, the distance between the bridge and the colony had been around 600,000 kilometers, and had been gradually increasing. At that time, there had been a 2.2 second interval between the spiders in the colony and Father, so transmissions there and back had involved a delay of 4.4 seconds. However, for the past two days that delay had gradually been shortening. Unless he’d found some miraculous means of overcoming the speed of light, Father was steadily approaching the colony.\nThe consolidation of his brain was an essential task. There were limits to what he could manage as distributed brain cell dust, especially when sending and receiving information took a number of seconds each way. Father’s attack on the bridge, too, had been necessary so that he could construct a new brain to consolidate the fragments of information that were dispersed around the orbit of Neptune. The brain that Father had established on the bridge had grown enough to consume 80 percent of the information carried by the ghost cloud, and he was using the nanobots that still roamed around the area to control the situation. This was something of which the children were already aware.\nBut the fact that this brain seemed to be coming toward the colony was something completely different. The children had been constantly observing the bridge from the colony, but they hadn’t been able to detect anything bigger than a spider leaving it. While the children of the colony had been fighting the spiders, something with a concealment device had left the bridge and was now slowly drifting toward them.\nNow, the distance between Father and the colony was only 70,000 kilometers. Up to this point, they had been holding out by forcing a thin knife through the tiny gap formed by the limitations of the speed of light, but before long Father would be able to directly control the colony territory that he had already seized, and all of his spiders, without hindrance.\nWhoever won, the outcome of the gamble would soon be decided.\nHaving climbed down a ladder into the space below, the children crouched in a corner and scanned their surroundings again. Five spiders were detected, 600 meters off to one side. They were all busy reconditioning the nerve network hub that they had conquered five hours earlier. There was no need for the children to bring danger upon themselves, however: the scanner plotted a safe route on the map and they got back up and began walking.\nAfter crawling for fifteen minutes through an extremely narrow maze of tunnels, the children finally managed to reach the hideout. They called it a “hideout,” anyway, but all that meant was that there were five other children there, and it was a sealed-off location that hadn’t yet fallen within Father’s reach. Having acted as guardian to four of her younger sisters for the last two days while they’d been hiding around the colony, Pineneedle looked exhausted and petrified. She might actually have fared better if she’d gone off to war instead, as Brook had done.\n“I just saw Peagreen’s ghost,” Pineneedle said.\n“What did it say?”\n“To come to Father.”\n“Was that all?”\n“That was the gist of it. That whatever happens, Father is going to win the war, and that we mustn’t believe the groundless rumors about Father. It seemed plausible. The logic wasn’t too bad, either. More than anything, from the way it looked to the tone of her voice, it seemed just like Peagreen.”\n“So what did you do?”\nPineneedle waved her left arm and gave an empty laugh as she declared, “Devil, begone!”\nThankfully, even now, ghosts were something that could be joked about. But there were limits. For now, Father might only be able to meddle with their sensory functions and create the apparition of a dead friend, but at some point he would make a move to conquer their brains entirely. After all, they were seed that had not yet been conquered, and Father couldn’t simply wait to see what they might become.\nBrook entrusted the two young children to Pineneedle and exited the hideout. She’d been distracted from her mission for almost an hour, in a situation where every moment was precious.\nThirty-five minutes later, when she arrived at her original destination, the situation there was a little better: all seven exits were blocked off by spiders and there was plenty of space. But this location couldn’t last as a hideout indefinitely, either. Everyone there was preparing to move if need be.\nSpotting Seorin’s face in a corner, Brook held out the brains of three of Father’s spiders that she had kept in her pockets. Seorin tried them all in a circuit tester that she had removed from its casing. Approximately half of one of them was riddled with malfunctions, but the other two were unscathed. They now had in their possession the brains of seven spiders, each of which had been retrieved right before they self-destructed. Seorin’s plan was to use them to secure a connection network with Father and stage a counterattack. Brook had no way of knowing how far this plan had advanced, nor did she think to ask how many survivors there were among the bugs that had been scattered into space to engage in battles of one to a hundred with the nanobots around the colony.\n“Father will arrive within ten hours . . . but our defensive capability will begin to collapse seven hours from now.” Seorin gathered the children and explained calmly. “During that time, one way or another, we’re going to attempt to connect to Father using the bugs. But after seven hours, there will be nothing more we can do. Father will seize the colony and set his sights on you lot, too. The younger children, who haven’t yet been connected to Mom, will be left utterly helpless. After that, there’s no way of knowing what might happen, because, as you all must know by now, Father is insane. We have to be prepared for the possibility that you might become his hands and feet.”\nFrom a drawer below the circuit tester, Seorin lifted a cardboard box. “This is a kind of bug I’ve adapted. If you place it on your tongue, it will penetrate the roof of your mouth and burrow up, until it destroys your connection devices. I should have issued you with them a bit earlier, but they took a while to make. It’s still not too late, so I’m going to pass them around now.\n“There’s no need to use them right away. Be prepared for the possibility that Mother might make direct contact with each of you at any moment. These bugs are a last resort. There’s a high probability that Mother has been keeping silent until now to protect herself, but there’s no way she will stay put like this until Father conquers the colony and then takes aim at Triton; that would violate the aim of self-preservation. She’ll definitely take some kind of physical action, and Father in turn will anticipate that action. Word came from Greengrass a little while ago: Father’s spiders are in the hangar now, repairing the hawk-eagles by attaching spider brains where the heads were removed and repositioning the neural networks. A few hours from now, the fully repurposed hawk-eagles, and the spiders with flying devices, will depart to join Father and escort him back here, protecting him in the event of the assault that may come from Mother as he approaches. A space battle that could change all of your fates is about to commence, and right now, from where we are, there’s absolutely no way to foresee its outcome . . . but my duty is to steer the situation in your favor, by whatever means possible.”\nThere was silence for a while. The twelve children gathered around Seorin had no idea what to say. It was Brook who finally spoke up.\n“Why the hell are you doing all this?”\n“What?”\n“Why did you come to help us? When the clan apparently doesn’t even exist anymore and you don’t know anything about us. Why did you come here?”\nFor a moment a faint, cryptic expression swept across Seorin’s face, but through her helmet it was difficult to read its meaning. Seorin pushed her chair back a little and responded quietly.\n“Because you’re Autumn’s children.”\n11\nWas any more reason necessary? These children were Autumn’s life’s work—they were all that was left of her. They had been a part of Autumn’s life. Wasn’t that plenty?\nSeorin didn’t think she had made the children understand completely, but that wasn’t necessary anyway. The children probably thought that her response was nothing more than the empty words of an Earthling whose mind they would never fully fathom. There was no real need to make them understand, though. It was enough to make herself understand.\nThe hawk-eagle bounced forward and out of the hangar, and Seorin’s body was pushed forward with it. Along with the head, the cockpit was gone too, but the spaceship Seorin was in had a jump seat that could be fixed to the interior wall. Father’s spiders had torn out anything that wasn’t needed when they’d repurposed the interiors, but this seat had been left in place. Seorin didn’t need to see what was going on. The brain of Lillian Gish was transmitting all the visual data she needed from out in front. It had already been some time since the spider brain installed in the hawk-eagle had been eaten up by the brain of Lillian Gish.\nLillian Gish was the Trojan horse. After arriving at the colony, Lillian’s seed had been duplicated, and little by little, it had refilled the empty space that had been left as the seed of Onorata Rodiani dried up. Right before Father had commenced his attack, Seorin had taken Lillian Gish’s original brain out of her pinecone spaceship and planted it in one of the beheaded hawk-eagles.\nMaybe Seorin was imagining things, but Lillian seemed to be in high spirits. The hawk-eagle could do much more than the interplanetary pinecone spaceship she had been trapped in previously. While convincingly imitating the robotic-style flight of her fellow hawk-eagles, there was a subtle air of excitement in her movements. Seorin hoped that the other hawk-eagles wouldn’t pick up on it.\nShe also hoped that Greengrass and Brook would make it back to the hideout safely when they returned from accompanying her to the hangar. There had been no real need for them to follow her all that way, and in any case, if she had gotten caught on the way, the whole plan would have been over. But they’d refused to let her go alone.\nThe spaceship, which had already been flying for some time using inertial navigation, gradually began to decelerate. At the same time, Lillian stuck an arrow-marker in the middle of the rectangular image screen that she was transmitting to Seorin. When she examined it closely, beneath the arrow there was something transparent that looked like a glittering dodecahedral jewel. That was the spaceship carrying Father, rendered visible when Lillian Gish had edited the image: seen with the naked eye there would have been no way of making out the object.\nNow the hawk-eagles and spiders were flying together with the dodecahedron toward Triton’s orbit. The transparent body of the dodecahedron emitted a slightly red light that would have been easily visible through the telescope in the colony. At this degree of proximity, concealment was pointless. Traveling at this speed, the spaceship would arrive at the colony within an hour. They simply had to hold out until then.\nA warning light lit up, and a clutch of round objects showered out of the beansprout. Was this the weapon Mother had been preparing all along? Rather than having some great plan that she had kept secret, was it just that she hadn’t had the means?\nThe flying hawk-eagles and spiders shifted into a defensive formation. Having furtively melted into the formation, Lillian sent data to Seorin about the spaceship they were protecting. Half of it was data that the other hawk-eagles and spiders were sharing, but the other half was what Lillian Gish herself had found out by scanning the dodecahedron. The spaceship was designed for single-use and was extremely basic. It was a machine designed for the sole purpose of transporting Father’s brain from the bridge to the colony. Mechanisms for responding to any number of trivial variables had been left out.\nAmong those excluded variables was that of a woman in a spacesuit.\nThe balls that Mother had launched began their attack. All around, there were green explosions and the formation of the fliers was disrupted. One of the hawk-eagles beside theirs was split in two, and at almost the same time, two of the balls nearby shattered. It felt like being a little bird diving through the middle of a fireworks display.\nAs it waved between the explosions, staying appropriately in formation with the others, the hawk-eagle stealthily approached the front of the dodecahedron and suddenly decelerated, so that it crashed into the ship just to the rear of the deceleration jet orifice. A large hole was punched through the hull at the front of the spaceship, and the body of the hawk-eagle penetrated about two meters into it. Having crawled out of the freight compartment hatch, Seorin entered the spaceship through a gap left in the hole created by the hawk-eagle’s impact.\nThe design of the interior of Father’s spaceship included no consideration for the likes of humans. There were neither passageways nor rooms: the inside of the spaceship was like the wild rosebush forests in children’s books, loosely crisscrossed by spindly, jagged metal structures. With her glowing red heatsword, Seorin cut through the structures so that she could make her way deeper inside.\nThe further she proceeded toward the center, the more Seorin’s senses became contaminated. Father had perceived the presence of an intruder, and was pelting Seorin with all kinds of sensory information through her connection device. Fortunately, it was bearable for a while. Having been connected to Seorin’s brain for some time, Lillian’s seed was deploying a protective shield for her.\nThat wasn’t to say the agony disappeared. Father read Seorin’s memories through her connection device and selected only the very worst to scatter before her eyes and ears. For Seorin, who had grown up in the midst of a hellish war on Earth, there was plenty of material for Father to torture her with. As she kept struggling forward, Father summoned up something different: the meanest memory he had gained from the children who had died, and from the artificial intelligence of the colony.\nIt was Autumn’s death.\nA hawk-eagle with an equipment abnormality colliding with an asteroid, and, clad in a torn spacesuit, Autumn’s body disappearing off in the direction of Proteus . . .\nBut instead of shaking her, on the contrary, this new memory helped stabilize her. Seorin gritted her teeth and strength flooded into her right hand as she clutched her heatsword. Watching how Autumn had died was agonizing, but it felt ridiculous to her that this was Father’s trump card, the worst he could do to her. That only served to spur her on. Drunk on his own sadism, Father kept taking missteps. He was at once both a creation of irrationality, and its victim too. He had been defeated and destroyed on Earth by Mars Mother because of that irrationality, and the fact that Lillian’s seed, awakened just a few hours earlier in the colony, was able to recover the neural network hubs that he had conquered one by one was because of his inefficient irrationality. A machine that raged, a machine that hated, was not a sound, functional machine.\nEventually Seorin reached the core of the spaceship. Floating in viscous liquid in a reinforced glass cylinder was an opal-colored sphere two meters in diameter, slowly rotating. Seorin swung her heatsword but the cylinder didn’t even shake when she struck it. She hadn’t expected it to, though: for Seorin, the strike had been a kind of protest.\nSuddenly a sharp pain jabbed into her back. Screaming, Seorin looked behind her. A spider stood there, brandishing a bloodied front leg. It had gotten in along the passageway she’d created as she cut through the wild rose forest and walked along, and now it was attacking her like a massive hand swatting at a bothersome mosquito. Seorin cut off one of the spider’s front legs with her heatsword, but at almost the same instant the spider lopped off her right hand with its other front leg. The hand and heatsword were flicked away and disappeared off into the wild rose forest.\nGasping for breath in her spacesuit as the air inside began to escape, Seorin absorbed the information Lillian was conveying to her. The Lillian in the spaceship and the Lillian of the colony had become one, and to some extent Seorin herself had now merged with them. Seorin ducked her body behind the cylinder and focused her mind.\nAnd then, releasing all tension from her body, and letting go of all resistance, she received Father into her.\nBrimming with a sense triumph, Father’s consciousness flooded into Seorin’s brain. Like catching an annoying bug that had gotten into his room, he crushed and burned and disintegrated all the information in her brain. At the same time, the spider came behind the cylinder and stabbed its front leg into Seorin’s body, again and again, all over. At that moment, punishing Seorin was more important to Father than conquering the colony, conquering Mother, or even surviving.\nAfter having been engrossed in this destruction for a while, Father was suddenly gripped by a sense of foreboding. Something was going wrong. His rage was disappearing and his mind grew dull. Something heterogenous was slipping into his consciousness. Through the eyes of the spider, Father gazed at Seorin’s corpse as it floated around near the cylinder, and it was at that moment that he realized what had happened.\nLillian had entered into his brain through Seorin’s connection device. This had been her real objective from the very beginning: getting him to open the door to his mind by inciting his rage and accepting his abuse, so that Lillian could sneak in like a burglar.\nFather felt his awareness of his surroundings slowly darkening. Lillian had seized control of the nanobots surrounding Neptune, and as her new orders spread through the cloud of nanobots all around Neptune at the speed of light, they were no longer Father’s ghost. Father was now nothing but a rock, two meters wide, trapped in a dodecahedral prison.\nAnd that rock was now slowly plummeting to Triton.\nThe means of causing Father’s collapse were that simple: the answer had simply been energy and gravity. A little reduction in speed. A slight change in direction.\nFather writhed to free himself from the impending physical disaster, but it was no use. Lillian had already captured more than fifty percent control of the spaceship. The propellant was being jettisoned, and the engine would no longer function. Following a trajectory that would overshoot the beansprout by a distance of 300 kilometers, the spaceship slowly fell into Triton’s rarefied nitrogen atmosphere.\n12\nBrook slowly removed her spacesuit for the first time in the four days since Father’s attack had begun. The cylinder of the interior of the colony remained a vacuum, but a supply of air was being provided to the two buildings where the children were gathered. The colony was recovering, little by little, under the command of Lillian Gish.\nHaving showered and changed into regular clothes, Brook went out into the canteen. Most of the children who had survived were gathered here. The six who couldn’t be there with them were in the hospital building opposite. Repairs to the meal dispenser had just finished, and it was portioning out dinner. Today’s menu included a pink twist, a green stick, and a white ball.\nThe mood in the canteen was subdued. Sixteen children had died in the war. Of those, two were young children who hadn’t yet had their connection devices installed. Brook would never know what dreams those children had dreamed, what thoughts they’d had when they were alive.\nFor Brook, who had gotten used to Mom’s cold and ambiguous silence, Lillian was somewhat tiresome and annoying. As was often the case with the seed of spaceship AIs, Lillian mimicked humans to an excessive degree, and now and then even attempted to engage in completely pointless small talk. This mimicry was so exquisite that Brook was occasionally taken off guard and almost fell for it. Fortunately, the other children seemed to enjoy this false sense of closeness. It was possible that Lillian was even adopting such an attitude on purpose, to help console them.\nThe instant Father’s spaceship crashed down near Triton’s equator with Seorin’s body still on board, Mom broke her silence. But that was already after Lillian had taken over the colony, and thereafter Brook received no communication from Mom whatsoever. Judging by Lillian’s demeanor thus far, that didn’t seem likely to change anytime soon. There were now two artificial intelligences governing in the domain of Neptune. Mom’s autocracy had been broken.\nBrook knew that the Mothers of the solar system had been preparing for this war for around a decade. The war had been necessary in order to get rid of the detritus that Father had scattered all over the solar system. It had been a gamble among gods. But how far had the Mothers foreseen the current situation? Had this really been the best possible way to achieve their end? Was there no way they could have resolved the situation without the death of any of the children? Had the children been nothing but a wild card to be thrown away, even from the beginning? How much importance had Seorin’s actions played in the plan?\nBiting into a white ball, Brook thought about Seorin: a terse and ill-tempered human woman who’d suddenly appeared a month ago, sent a jolt through their lives, and then disappeared. A woman who’d led them into battle while never revealing her inner self. Brook tried to imagine Seorin having survived, sitting across from her at the table and eating one of the twists produced by the meal dispenser, but she couldn’t really picture it. From the very beginning, Seorin had no intention of surviving. From the beginning, she had come here to die with Father, with the clan.\nWith Seorin’s death, the children had gained their freedom. Freedom from the clan, freedom from Father, and most likely freedom from Mom, too. Maybe also freedom from Auntie Autumn and Seorin. Brook didn’t know what this freedom could mean—actually, she still couldn’t quite fathom what freedom was. What did it mean to be able to make one’s own choices, to be a free entity in this vast playground of the gods?\nI’ll just have to think about that from now on, Brook decided, as she popped the rest of the white ball into her mouth and took a gulp of water.\nSince we still have time . . . and are immune to pointless obsession.\nOriginally published in Korean in Because We Still Have Time.\nPublished with the support of Literature Translation Institute of Korea (LTI Korea)."}