{"fingerprint": "uoozdfX8Ly7l2JPoFKjLpPmpRC4=", "sitename": "Clarkesworld Magazine", "title": "COVID-19 and the Mental Health Crisis by Douglas F. Dluzen", "author": "Douglas F Dluzen", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dluzen_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: COVID-19 and the Mental Health Crisis by Douglas F. Dluzen", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nCOVID-19 and the Mental Health Crisis\nFor many people, the COVID-19 pandemic changed perceptions about mental health, including my own. Suddenly, during lockdown, I was extremely restless at night, dreaming up worst-case scenarios for my family and community: What if my two-year-old son developed long COVID What if I lost my job? What if society completely fell apart?\nThese worries have become realities for many around the world. Thankfully, most of the rolodex of scenarios I played through in my head every night didn’t come to pass. So, I buried my anxieties deeper inside. I was healthy, my job was stable, and I felt I didn’t have the right to be this upset and stressed. I continued to ignore my mental health.\nMuch of my story is hardly unique. The stressors on life related to the spread of SARS-CoV-2 have pushed many people and communities to the brink of exhaustion, both mentally and physically. In the first half of 2019, just over ten percent of surveyed adults in the United States reported symptoms of depressive disorder or anxiety disorder.\nIn the beginning of 2021, during the heart of the first winter COVID-19 surge and just before widespread availability of the vaccines, that number topped forty percent. For US adults eighteen to twenty-nine years of age, it was an astounding fifty-seven percent. And while we won’t know the effects of the current Omicron surge until later in 2022 or early 2023, there is little doubt the pandemic has significantly worsened mental health in the United States.\nGlobally, the numbers are just as staggering. The best estimates (and very likely an undercount) of the global burden of those with depressive disorder or anxiety disorder are two hundred and forty-six and three hundred and seventy-four million people, respectively. These totals represent a twenty-five percent increase when compared with pre-pandemic estimates. Regionally, the increase in prevalence for both disorders due to the pandemic has been highest for those living in North Africa, the Middle East, and South Asia, and lowest in Southeast Asia, East Asia, and Oceania.\nThe pandemic, stress, and mental health are intricately tied together. For those conducting research to improve our understanding of how the social determinants of health influence life span and health span, it was predicted (even before the lockdown) that COVID-19 would exacerbate health inequities, including those related to mental health care. The data is now validating these initial forecasts.\nSurvey participants who reported having lower income, little in savings, and/or a greater number of COVID-19-related stressors (such as knowing someone who died from the virus or job loss) were much more likely to report symptoms of depressive disorder. Since March 2020, over half of US adults with symptoms of depressive and/or anxiety disorder reported the loss of a job by someone in the household. The economic well-being of individuals, families, and communities during COVID-19 is tied together with mental health. That, in and of itself, is not surprising given how important work is in our lives. But the ties between COVID-19, economic strain, and mental health run deeper and can be very nuanced.\nWell before the pandemic began, it had already been established that many economically related social determinants of health (SDOH) are closely linked with physical and mental health and well-being. This includes SDOH such as institutional and governmental policies, structural racism and discrimination, neighborhood segregation and redlining, job security, access to transportation and educational opportunity, among others. These determinants of health can also interact with or influence other health determinants, such as access to good nutrition or healthcare.\nWhile overcoming even just one or two of these problems at any given time is extremely taxing for affected individuals and communities, the pandemic has amplified their impact. Structural and societal barriers have put people at risk for COVID-19 exposure, influenced their ability to recover, and impacted overall physical and mental health. The result is a global mental health crisis that will have lasting implications for daily life around the planet.\nThe challenge now is how to help so many people understand, manage, and treat their symptoms . . . all at the same time. This is especially important for essential workers, who are not only at greater risk of exposure to COVID-19, but more likely to report symptoms of depression or anxiety compared with nonessential workers.\nThe strain on the US healthcare system is also significant. As of January 2021, nearly one out of four surveyed US adults had received counseling or therapy or had taken medication for their mental health. It’s very encouraging that people are seeking help. But even when conservatively extrapolated to the entire US population (and also factoring in adolescents and children), this represents millions of people who require the help of a trained professional. Globally, the scale of the challenge is immense.\nThe same survey also revealed that nearly twelve percent of the US population needed, but didn’t receive, counseling or therapy. That percentage is even higher among those who are eighteen to twenty-nine years of age, responded as being female, or reported experiencing symptoms of depressive or anxiety disorder in the last seven days (from when the survey was taken). The fact that so many people haven’t received any type of intervention will need to be a policy priority in both the immediate and long-term futures.\nTwo other populations—children and adolescents—have also been severely impacted by the pandemic. Children across the nation and world are continually dealing with constant interruptions to their learning, social development, and general stability. One-fifth of surveyed parents at the end of 2020 reported worsening mental or emotional health in their children between the ages of five and twelve.\nFrom the beginning of lockdown to May of 2021, there have been 24% fewer mental health services for children under nineteen who were enrolled in Medicaid and/or the Children’s Health Insurance Program. These two programs cover almost three out of four children in the U.S. living in poverty and this service loss accounts for over seventeen million fewer service benefits during this time frame. The rates of service for mental health for children have been the slowest to recover compared with other services that these programs provide (e.g., primary or preventative). Importantly, these services process claims in which there is a diagnosis of a mental health condition. This means thatCOVID-19 has worsened already difficult situations for children and adolescents and limited their ability to obtain help for their mental health needs.\nA survey of youth between the ages of thirteen and twenty-four, conducted by the Trevor Project, found that among those who identify with the LGBTQ community, more than half reported symptoms of depression or anxiety. Those numbers increased to over two-thirds for those youth who identify as either trans or nonbinary, and all of this compares with just thirty percent of those identifying as straight and cisgendered. Additionally, a quarter of LGBTQ youth reported they would like to receive mental health care but were unable to. How to provide additional support for these and other communities remains a topic of great discussion in the mental health community.\nSubstance use and abuse have also increased during the pandemic. In June 2020, there was a thirteen percent increase in US adults either starting or continuing to use a substance to cope with their emotions or stress related to COVID-19. In the US and around the world, lockdowns have spurred the increase in use of cocaine, heroin, fentanyl, and other drugs. Fortunately, this may not necessarily be the case for children and adolescents.\nDuring the beginning of the pandemic, the overall rates of substance use among US youths remained similar six months after the initial lockdown compared with before. However, substance use was more likely in youths with parents who used alcohol or drugs, in those experiencing depression or anxiety, or in those living in households experiencing material hardships. Surveyed youths also reported using more nicotine-based products or misusing prescription drugs. This suggests these substances may have been more readily available during the lockdown than other substances such as alcohol, which declined in use during the same time frame.\nThe long-term use of substances to cope with the stress of the pandemic, whether in adults or youth, is still being evaluated. Collecting this data will be essential to develop new strategies to best help those looking for ways to successfully manage their mental health. It will be important to not only identify all of the pandemic-related risk factors that may predispose individuals to worsening mental health, but also the positive coping strategies to help stem this tide.\nThe pandemic has influenced so many people in such different ways, it makes it very hard to identify workable, scalable solutions. There’s a balance needed to understand the pandemic’s effect on mental health that requires consideration of the needs of the individual and the greater community. In the US, solutions are also contingent upon local and state infrastructure and policies.\nFor example, within rural areas, and even suburban or urban locations with limited infrastructure, a variety of factors may inhibit the ability of someone to find or reach the mental health help they need. This could be due to access to reliable broadband Internet for telehealth appointments, access to reliable public transportation, or even access to trusted health information to guide individuals to the type of care they require.\nAmong those surveyed, the top reason people didn’t get needed mental health support is because they couldn’t find a provider. The relationship between patient and provider can influence the outcome of the treatment and overall long-term success. With limited availability of professional services, the importance of the patient taking time to establish trusting and productive partnerships with care providers can get sacrificed. Moving forward, this should be taken into consideration as new strategies and resources are implemented to improve access to mental health services.\nIt’s estimated that there are nearly six thousand mental health care health profession shortage areas (HPSAs) across the United States. Nearly a third of all Americans live in a HPSA. HPSAs are designated by the number of available psychiatrists for a given population, and an additional six thousand five hundred psychiatrists need to be trained to meet this gap. These gaps in mental health care providers were known before the pandemic and are now more stressed. Training more psychiatrists and other mental health care providers is essential to helping the growing number of people requiring help. This is also critical in that psychiatrists can prescribe medications to those who need them.\nThus, a shortage in trained mental health care providers adds additional strain to communities that may already be at-risk for not receiving mental health care when it’s needed. Other major reasons that people can’t get help for their mental health include affordability of care, the ability to take time off work or from busy personal schedules, insurance coverage, or they are too afraid or embarrassed to seek care.\nI understand this last barrier all too well. During the winter surge, I was still struggling with my symptoms, and my prior experiences in therapy hadn’t solved any problems. I was hesitant to seek professional help. In the earliest days of lockdown, I confided in a small group of family and friends about my depression and anxiety, and even though what I revealed was surface level at times, I did find it helpful just talking about it. Eventually, with the encouragement of my partner, I sought help again.\nUnderstanding how we cope with the stress of the pandemic will also help us overcome this ongoing mental health crisis. When we employ important and essential safeguards against the spread of COVID-19, such as social distancing or stay-at-home isolation, this may influence the mental health of those unable to distance, or who rely on community engagement as part of their symptom management and personal care.\nTalking about mental health is not easy for most of us. Yet, COVID-19 has made mental health conditions and illness much more prevalent. We have to talk about it. We have to better understand the nuanced pressures on communities and individuals. Millions of people now face worsening mental health in ever-stressed healthcare systems, and finding treatment continues to be an uphill battle. Navigating these complex issues while the pandemic continues will require significant resources and time as well as input from all of us. In the end, it will be worth it.\nDouglas Dluzen, PhD, is a senior science writer and editor at the NIMHD. He is a geneticist and has previously studied the genetic contributors to aging, cancer, hypertension, and other age-related diseases. He loves to write science and science fiction while sitting on the couch with his wife Julia (who has immeasurably helped him fact-check and edit his work), son Parker, and daughter Cedar."}