{"fingerprint": "0LV4kN3Jo+oxu9vSnqLhpNxD0X4=", "sitename": "Clarkesworld Magazine", "title": "Models and Clay and Plaster, Oh My! Creating the Cover Art for Tides From The New Worlds by Brian W. Dow", "author": "Brian W Dow", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dow_05_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Models and Clay and Plaster, Oh My! Creating the Cover Art for Tides From The New Worlds by Brian W. Dow", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Models and Clay and Plaster, Oh My! Creating the Cover Art for Tides From The New Worlds\n Every cover project has its own challenges and creative dilemmas. Tobias Buckell's collection, Tides From The New Worlds, offered some wonderful scenic opportunities which made it incredibly difficult to choose only one. In the end I decided on his story, “Tides”, and chose to go for a montage kind of approach rather than a specific scene. The story centers on a young girl named Siana. She lives in the village with her parents. Her older sister, Miasia, supposedly died in the coastal wars but shows up unexpectedly in Siana's home. There are some great characterizations here: magic, tech and danger; lots of great stuff to draw from.\n I assembled some sketches for my editor to look at and then went on to finished sketches for the various individual components. I needed to find some elements to draw from the text. Since I love the tech aspect of science fiction art, I felt that I wanted to have something to reflect that. I also wanted to include the society that Toby so richly described. Lastly, I wanted to have a character to anchor the image. Sometimes I'll skip having the character and go directly with the thematic approach, but I chose not to do that here.\n There was some descriptive text to draw from but Toby leaves much to the imagination regarding the fine detail of what the people look like, and what the village and tech look like. This left it open for my imagination to run wild. In my college years I was an actor of sorts and some actor friends would occasionally create a back-story to fill out the character. I decided that it might be of benefit to do that here, and began thinking about the world of the story.\n Without giving too much away, there is a mention of a war. It has been going on for a while. Presumably, I thought, resources are scarce. Landmasses are scarce in the world of the story, so therefore wood is scarce. It took Siana's father years to save money to acquire enough wood to add on a room for her to their meager home in the village...\n The Village\n The village... hmm... that was a challenge. Challenging, but fun. In the story the village is described as being in the middle of the ocean, and on stilts to keep it safe from the rising tides. That demanded an aquatic theme, so I decided to model the village around found items that may have been discovered in the ocean. I used shells, round glass forms that may have been creature-eyes for windows, and warped tree stalks for the supports of the village.\n There would be no straight lines in the construction of the village. I wanted to make as strong a break from contemporary architecture as possible. I looked to Rodney Matthews for inspiration. He did some wonderful building designs in the early 70's that were a strong influence on my designs: really organic and exotic. Here is my test of one stalk, and a more refined version of the village itself.\n The story also talks about airships visiting the village. It would be reasonable to assume that they'd need a platform to land on. Keeping with the ocean theme, I based the landing platforms on sand dollars.\n I live on the edge of a marsh and found that the bamboo that grows wild there is a great form to base the supports on. I'd also found some old reference photos of crystals during my picture search and had come across a spiral crystal. This, added to an internet story I'd seen about forty foot quartz crystals found in a deep cave, started my brain going again. Perhaps the village might utilize crystal forms in the construction as well. I did some sketch tests of the spiral crystals intertwining around and through the wood and it looked really interesting. It just seemed to add something more to the mix.\n The Ship\n The ship, I theorized, might have been built from the bones of a whale like creature, but with a swordfish-like protrusion from the front.\n I wanted the main structure to be bone-colored with bits of tech added on. It needed to appear aerodynamic in design but have balloons for its lift mechanism. I thought about the world again. As the war progressed, fuel would be at a minimum and very, very expensive; probably prohibitively expensive. Private yachts would presumably need to make adjustments. This could be why they needed to add balloons to the ship.\n In keeping with the maritime theme, the balloons may have been harvested from the sea. Whale bladders or giant blowfish came to mind. So in my mind the balloons took on a texture of having blotches and veins with a translucent greenish color. It was quite a challenge to find just the right look. I knew that I wanted them to be oval and translucent. I tried shooting balloons with lights behind them. That didn't work. They just looked like balloons; no texture to speak of. Then I tried covering the balloons with a loose knit sweater for a netting effect. That was not what I wanted either.\n I kept coming back to the organic look and decided to try coating a balloon with plaster of Paris.\n I fastened string to the balloons to give them a more interesting look, as if they were secured to the ship with thick lines. The texture was okay but the balloons came off as being heavy and not as organic as I'd wanted.\n Lastly, I fell back on painting a balloon with simple acrylic paint. In ordinary light it just looked like a painted balloon, but when I backlit it with the LED it just came to life! It had the look of a frog throat when it's puffed up. I had assembled references on frogs as one of my inspirations in the look I wanted. The balloon looked like the throat of a frog that had swallowed a light bulb, and it was just what I was looking for.\n I have created several tech pieces for other cover projects and usually I pick some found item to use as the base to build on: mouthwash bottle, salad bowl or whatever. This time I needed something that was more unusual. I had devised a design that was not based on something I had found in my collection of weird shaped items.\n I began with a clay maquette to test out the design. When I was happy with that I moved to Styrofoam and began shaping it. Eventually I got it to a shape that worked and covered it with plaster cloth and then plaster (goop).\n Lots of sanding and reshaping needed to be done. Not to mention mending when I'd forgotten that it was fairly fragile and was prone to breaking very easily. I added some model tech elements and there you have it.\n I did a photoshop colored version to test the color combination and sent that to my editor for approval. With that in hand, I was off and running to the final product. I mounted the ship on my camera tripod. I'd built the ship so that I could remove the wings. This enabled me to try different angles and detail shots.\n There was lots of testing of the lighting required to get it just right. Too much light or too little and it just didn't look believable. The unfortunate part is that the ship is so small on the cover that you never really get to see the little details in there. I remember the special effects guys on the Lord of the Rings movies saying the same thing about their pieces, but it was the fact that they were there that made the difference to the piece, even if you couldn't see them.\n Siana\n The young lady I'd chosen to play Siana was unfortunately unavailable to pose, and my stand in for sketches had been my daughter Gracie. Talk about the answer staring you right in the face. Gracie stepped right up and told me she was ready for her close-up.\n I'd seen a technique in Photoshop about 10 years ago where only the highlights of an object are captured, and are then layered onto another reference. They would be superimposed over the background and would be somewhat translucent; almost a ghost image. This idea intrigued me. I was looking for a way of incorporating a portrait into the piece but I didn't want to have just a pasted head. Siana and Miasia have this internal power in them that makes them special. It also demands a price. This technique drained the color from the character and gave her a 'thin-ness' (if that's a word). While none of this is evident in the art, it was there for me when I was creating it.\n The Energy Spheres\n In the story Siana is just beginning to learn how to work her own personal magic. She can make spheres of protective energy. I thought this was a great image to work with. Since there was so much in the story already that leaned towards the organic, I decided that the shields she creates might be organic also. But what structure would they assume?\n Crystals kept appearing in my mind when I was working on this piece. I had this idea that water, when it freezes, creates weird, unusual crystal forms. I froze some water balloons to try to get the crystal formation, but they just looked like frozen balls of ice...\n What I wanted was a hollow sphere, so what I came up with was hanging water balloons of various sizes and only partially freezing them. They'd still be water in the center. It took a few experiments to get the thickness right but eventually I found that about three hours worked well. I'd take the balloons out of the freezer after three hours and carefully carry them to my kitchen sink. There I would drip warm water on them, drain the water out, and then shape the edges.\n I'd then drill a small hole in the base and thread string though it with a toothpick to hold it, and then re-hang it in my freezer for another hour to harden up. This also gave me a way to shoot them without melting them. Adding an LED handheld light to the ice gave it that weird internal glow I was looking for.\n Some might think this is a lot of work for one cover, but that's just the way I work sometimes. There are moments when the ideas just flow quickly and easily and there are times when it's like pulling teeth. This time was the latter. It's like that Frost poem, 'The Road Less Traveled'. It really did, at least for me, make all the difference. I hope you enjoyed this insight into the creation of the cover art for Tides From The New Worlds.\n I was born in the small, unsung hamlet of Bristol, Conn. in 1961. I always enjoyed science fiction, adventure and fantasy. I suppose many of us remember tying a towel around our necks and racing around the yard. While this practice has, for the most part, not carried over into adulthood, I have always clung to the imagination that those days engendered. Daydreaming was a constant occupation, much to my second and third grade teachers' agitation. The dullness of everyday life just made it too difficult to concentrate on math and history. Where I truly found myself was in art class. Oh yeah, now this was something I could work with. Art became my passion. I attended Salem State College in Massachusetts and then The Art Institute of Boston as an illustration major. My invisible towel still firmly in tow. Upon graduating I spent a number of years in advertising, editorial and the random design firms doing layout and design to pay the bills, but I always dreamed of pursuing my passion. Illustration. I was so influenced by authors like Tolkien and Burroughs and illustrators like Rockwell, Parrish, Mucha, Wyeth, Maitz and Whelan. Their work just gave more fuel to my already overactive imagination.\n My instructors at the Art Institute always used Chris Van Allsburg as an example of what to strive for with our art. They would tell us to use a vantage point that was unusual. Create interesting characters and illustrate the subtext as well as the main text.\n 'The magic lives in the details', they would tell us. I learned to love the details.\n My recent projects include cover art for Tobias Buckell's \"Tides From The New Worlds\" (Wyrm Publishing, April 2009), Charles Coleman Finlay's \"The Prodigal Troll\" (Pyr, May 2005), Scott Mackay's \"Tides\" (Pyr, November 2005), Keith Brooke's \"Genetopia\" (Pyr, February 2006), and Alexis Glynn Latner's \"Hurricane Moon\" (Pyr, July 2007)\n I currently live outside of Boston with my wife Karen, also an artist, our daughter Gracie, a budding artist herself, and our 3 cats, who are presently writing a screenplay for a major studio."}