{"fingerprint": "rj57gUIiGFGmN5ACsHULXviUIwg=", "sitename": "Clarkesworld Magazine", "title": "A Craftsman of No Small Skill: A Conversation with David Drake by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/drake_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Craftsman of No Small Skill: A Conversation with David Drake by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n A Craftsman of No Small Skill: A Conversation with David Drake\n I first met David Drake a little over ten years ago. At the time, I’d read more of his science fiction than his fantasy; I preferred his Hammers Slammers and military SF to his Republic of Cinnabar Navy (RCN) series and other space opera fiction.\n What I’d read had moved me deeply and answered many questions I’d had about my grandfather’s and my father’s experiences in the military. I’ve long admired Drake’s ability to talk and write openly about his experiences in Vietnam and Cambodia and to reveal the horrors of war through powerful storytelling—to shed light on the unlightable darkness.\n If more of our combat veterans could write with clarity and effectiveness, maybe—just maybe—there’d be fewer wars.\n Over the years, I’ve continued to gravitate toward his grimmer fiction, with a special fondness for the stories in Grimmer than Hell and the novel Redliners, and for the oddball novel-in-stories and homage to Manly Wade Wellman, Old Nathan.\n But, honestly, I love all his books. These books go past mere entertainment for me. They move me. They get under my skin. They become a part of me.\n Drake and I have spoken and corresponded, on and off the record, since we first met and we’ve agreed to disagree on one fundamental point. I believe that he is an important science fiction and fantasy writer—and important writer, regardless of genre. He doesn’t.\n It is not false modesty.\n “I think I am a first-rate craftsman,” said Drake, “and that is not a small thing. My dad was a first-rate electrician. His father was possibly the best sheet-metal smith in the United States. I’m a craftsman also and I am damn proud of it, but nobody’s ever heard of my father or my grandfather and there’s no particular reason they should’ve heard of me. But I’m proud of the craft.”\n Below, Drake and I talk about the craft and the work. We talk about plotting, plodding, and language. He opts for lean prose and weighty ideas.\n Language shouldn’t be there to show what a fine writer the storyteller is, according to Drake. Language shouldn’t clothe ideas is fancy garb. Language should, as Drake says below, describe a scene “clearly and simply to the reader.”\n In the 70s and 80s, Drake took “show and don’t tell” to heart and was, as he put it, “pilloried by the critics as being pro-war because I didn’t say I was anti-war. I described things that any sane person would find horrific. God knows, I found them horrific. But I didn’t say so. Of course, I opposed these things. Any idiot would know that. But, of course, they didn’t.”\n It’s hard to imagine anyone reading a pro-war agenda into Drake’s fiction, but part of the power of well-crafted fiction is, I suppose, that it invites multiple interpretations.\n As a follow-up to a visit to Drake’s home this past summer, we spoke on the telephone this fall. I caught him “trying to get into plotting the next one” and he wasn’t “there yet.” The “next one” was the fourth and final book in the Books of the Elements series for Tor. “Plotting” will ultimately result in a 10- or 15,000 words plot outline.\n Is it hard to go from summarizing what happens to dramatizing what happens?\n No. I had dinner years ago with Stephen King and I mentioned how I plotted. He looked at me and said, “Don’t you get really bored when you’re writing it?” I said, “No.” But obviously, he would’ve. [Laughing] Obviously, his way works, too. His way works for him.\n What’s holding you up with this one?\n I’m just starting it. It always takes me a couple of months to get started. It’s an exhausting job to write a novel and when I finish I am just totally wrung out. Mentally, I want to dive right into the next novel, but frankly I can’t. I don’t know that anybody could. Oh, that’s not true. Some people definitely could. But I’m not them.\n Right now I am reading the Dionysiaca of Nonnos, the conquest of India. I’m gathering. I’m jotting down little bits. I’ve gone through a book of Indian folklore. I’m going over past notes and excerpting. It’s just a matter of getting a mass of stuff. I know where this one is going, but with 150,000 words, there’s a lot of business and it’s just a matter of getting that business down.\n So when you say you’re “trying to get into plotting the next one,” it’s more about recovering from the previous one, than something unique about this one.\n Yeah. It’s always like this. There’s nothing particularly difficult about this one. I did a novelette after I finished the previous novel but that doesn’t really count. That was sort of a break. Now I am trying to focus on the novel.\n I did the third of the Elements series, then I did the plot outline for the second of the Hinterlands series that John [Lambshead] is writing called Into the Maelstrom—he’s working on that now—then I did the next RCN novel. You know, bang, bang, without a lot of rest. It was really pretty hard doing the RCN novel like that. It was just a lot of work. But, you know, that’s what they pay me for.\n I don’t especially like to do plot outlines for other people, but in this case I’d done the Into the Hinterlands outline quite a long time ago, mid-90s, I guess, and [the contracted writer] didn’t get around to writing it, so Toni [Weisskopf] wound up giving it to John Lambshead to execute and she was pleased with the result, but [laughing] that meant that I had to plot the other two novels in the series. I’m not planning to do more plot outlines for other people but I do have one more to do for John just because it’s sort of grandfathered in.\n I wonder if going from RCN, which is filled with characters that you’ve spent years with, to this fourth book in a series which is, intellectually, one of your most challenging—\n I keep trying to push.\n You come off an uphill climb and now you’re at an even steeper climb—straight up a cliff. What’ve you gotten yourself into, here?\n The thing is, it’s all volunteer. And that’s an important thing. Nobody is doing this to me. If it fails, I screwed up. And that’s okay. I mean, I’m okay with the thought that if I screw up and fail, I should fail. That pushes me to try and do it right. Now, I don’t need a lot of push in that direction. But my friend Mark [Van Name] pointed out something to me years ago—he pointed out that when I did Northworld, it really tore me apart. I was having back spasms so serious just out of tension that my left leg was numb for a few weeks after I’d gotten the book done. I was really doing something new. He said, “Now you’re doing the Isles series. Each of those books is more complex than Northworld was and you just take it in stride.” I thought about that, and yeah, you do, you learn new stuff by doing it.\n I think I’m probably best known for my action writing and I certainly try to do good action and I think I do good action. But I have a history and Latin background and I graduated from a first class law school. If I didn’t like intellectual puzzles, I wouldn’t have that background.\n It almost seems like you have two identities with the two different publishers. There’s the Baen writer—science fiction, action—and the Tor writer—fantasy, more intellectual—and those two writers aren’t always thought of as being the same person.\n I am writing very simple, clear, direct prose. No matter what I am writing. That’s not the perception of me, certainly not in Fantasy but even in SF. I like to think that all my work is done at a high intellectual level, because it’s no fun if it isn’t. That doesn’t mean I have to show people that I am smart. The work ought to do that. I don’t need to throw in long words. Because I know long words. I don’t have to throw in Latin because I know Latin. As a matter of fact, I make a point of always translating any Latin that I’m using.\n The simplicity of the language goes straight to the ideas. The ideas are not simple, not easily digested, which may contribute to the . . . complexity of the perception of your work. It’s not easy to say what your work is or what your work isn’t, because you’ve tapped into the truth and the truth is not easily simplified. It is complicated. Show me a simple sentence in a Hammer’s Slammers short story and it will probably tell me something that I can’t discuss simply.\n [Laughing] Probably tell you something you didn’t want to know. People shouldn’t read a book and say, “This is beautifully written.” They ought to say, “Wow, was that a story!” Same thing with a speech, by the way. This is something I was taught long, long ago in speech class. If people leave the auditorium saying, “Oh, that was a wonderful speech,” you’ve failed. You want them to say, “By God, we’ve got to do something about this problem!” It’s a whole different thing. Critics will be more positively impressed by fine language than they will be by simple language that communicates thoughts. They will. It’s just a reality.\n You’ve said before that what Baen Books does well is find and publish stories, and that a good story is a good story. But, uh . . . what makes a good story?\n A good story has a beginning, a middle, and an end. Honestly, that implies an arc that implies things are happening and that’s as close as I can come to it. My friend Mark says, arguing that Baen focuses on story—he says that there isn’t an editor in the business who will say, “I’m not interested in story” or even “I’m not primarily interested in a good story.” Baen Books isn’t different in that way, but the result is different. I think in many cases if you come out of a literary background you will focus on literary values—language, vocabulary, complexity of sentence structure—all of which are marks of fine writing and fine writing is seriously the enemy describing a scene clearly and simply to the reader and I really think it’s important to if you’re telling a story to tell it in a simple direct fashion rather than to worry abut the beauty of your prose. I’m not against beautiful prose. But clarity of expression is a mark of good storytelling.\n Backing up, once you have the plot outline, how does your life change for the next how many ever months?\n I get up in the morning. I read the portion I did yesterday and make quick edits on it. This is partially reading myself into the process. Then I sit with the outline beside me and I write the next portion. I have it broken out into scenes in the outline and I write the next scene. Some days I finish a scene or start a scene or sometimes it feels like I’ve been battering on this forever and it may be five days before I finish the damn scene. That’s usually because it’s long and because it’s difficult for some reason that doesn’t involve the work itself. It’s where my head is and other stuff going on and all that.\n Mark has said that once I get started I’m just a machine and that’s kind of true and I want it to be that way. I’ve done all the hard part. I’ve got all the cute little bits. Sure, I break scenes up, I change stuff, and I move stuff around. Going from 15,000 words to 150,000 words obviously there’s a lot of addition going on, but it’s mechanical. The writing can be a slog.\n Do you ever just put a title at the top of the page and go.\n I used to do it all the time in the 60s and 70s. And I didn’t finish stories. I tried it with novels. I spent 12 years after I sold my first story trying to write a novel. And I couldn’t. I’d poop out. I’d get into the middle of it and I’d be convinced it was crap and I wouldn’t finish it. Nowadays when I’m in the middle of a novel, I’m convinced it’s crap but I finish it, because it’s just a matter of plodding forward and I want to hang myself and I’m convinced that “I was able to do this before but I’ve completely just lost it and they’d be better off reading the phone book” but I keep on going. I’m very depressed, but you know, frankly, on a good day I’m pretty depressed anyway [laughing].\n So there’s a lot of sunshine in this process?\n There are various ways of dealing with the situation [of writing a novel], but any one that works for you is okay . . . My way works for me. I haven’t hanged myself thus far.\n Is the plotting part linear?\n The first portion of it is to gather a huge amount of data, not infrequently saying, “This will work!” When I say that, I’m not really sure where it will work or how it will work but “oh, that’s a good bit, I need to use that” and when I get a huge amount of data then I start putting it together into either a plot outline or a series of individual sequences; that is, if I have multiple viewpoints and I generally do if I’m writing a long novel. I may start out trying to run a sequence of one character, one viewpoint, and then do another or I may try to do a chapter from all two or four viewpoints or a combination of these. It tends to be slightly different every time which puzzles me. I’m not consciously doing it in different fashions but it always is and I don’t know what that means.\n Is there a visual element. Do you map or draw things out?\n In the sense you mean, I’ll choreograph battles and I’ll choreograph dinner tables. I need to know where all these people are sitting.\n But I will also have a picture of an 18th century dining room beside me or a picture of this hotel in Boise, Idaho in front of me. I have lots and lots of things with pictures in them and I’ll think, “I want something of this sort of tone,” and I’ll grab a volume out and start paging through until I find “oh, that’ll do for it” or “this isn’t what I was thinking of, but I can use it very well for this purpose and it will make it different in this fashion.”\n You do a good bit of writing outdoors, too, don’t you?\n All of it. I do my work on two laptops and then I save my work to a base unit, which is a desktop. Then I’ll call it up for the next burst. I sit in different places according to what the weather is and where the sun is. Either I want to be in the sun or out of the sun. I am never in exactly the same place at any two periods of work.\n Was the Northworld series the last of the landmark, stressful books?\n Nothing else has been as physically stressful. There was one I did—ARC Riders—which was a collaboration but I wrote, I think, all but six sections. It was the editor’s idea and she thought it would be a good idea to start this alternate history book in a world in which the Vietnam War hadn’t ended. I said, “Okay, I can do that.” And I could do it. It made me very, very, very depressed. And I decided I would never go directly back—that wasn’t really direct, but you know what I mean—into Vietnam, again.\n There were also the Tom Kelly books, Skyripper and Fortress. Those were an idea of Tom Doherty’s. They were stressful in a different way because there is a lot of similarity between me and the viewpoint character Tom Kelly. That’s me on a really bad day, the mindset. The hell of it is, it’s a way I could’ve gone and I didn’t. By great determination, I did not go that way. He’s a man who’s really consumed with anger, and I’m not that man but I wasn’t making it up either and I think that was difficult for the people around me and I would not have done another one except Tom really, really pushed me for one. He said later when I sent him the intro for the combined edition, Loose Cannon, “Gee, Dave, if I’d known you hated it that much I wouldn’t have made you do it.” [Laughing] I said, “Tom, I told you I didn’t want to do it!”\n That’s one of those cases where I’m staying calm and people aren’t listening to what I’m saying they’re listening to how I’m saying it. Oh, well!\n Two things with those books: they very directly approach things that are difficult to deal with—Vietnam and your anger there was someone else involved in the conception of the idea. Those two things say, “Move out, Dave’s going to be difficult to live with.”\n [Laughing] He was. But I’m a saintly human being now. [More laughter.]\n No college writing colleges or MFA programs for you, eh?\n It’s a completely different mindset. It’s fine for the people who want it, but it isn’t what I wanted. Some of them it’s worked out well for. I think in some cases it’s been very seriously damaging. [A science fiction writer] can be taught to loathe the thing he does well [in a workshop].\n I wonder, when you write non-fiction about Vietnam, is that as stressful?\n No. I’ve always told the truth. As the years go on, I’m even more willing to tell the truth. I’ve never lied. I wasn’t any kind of hero, and I’ve never claimed that. Considered clinically, nothing happened to me. Then Mark [Van Name] sat me down and said, “Did you see this? Did this happen to you? Did you do this?” “Yeah. Yeah. Yeah.” Mark said, “You realize any of the things I just mentioned would be five years of therapy for a civilian.”\n Stories you told me ten years ago about your experiences in Vietnam still haunt me, and I’m very removed from them.\n Be glad.\n So, I guess there’s no point in even asking if you’d want to write a mainstream novel with no fantastical elements.\n Not only “no,” but “hell no.” I write what I do for a reason. And it’s not because I’m too dumb to figure out there’s another thing to do.\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}