{"fingerprint": "HA6S31YkuEkk2k2PRoJmpCLH5gA=", "sitename": "Clarkesworld Magazine", "title": "For Whom the Psychopomp Calls by Filip Hajdar Drnovšek Zorko", "author": "Filip Hajdar Drnovšek Zorko", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/drnovsek-zorko_01_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: For Whom the Psychopomp Calls by Filip Hajdar Drnovšek Zorko", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2430 words, short story\nFor Whom the Psychopomp Calls\nWe picked the psychopomp up on Svetove. That’s the far end of the arc, far from Earth as anyone ever been. Little station, off the ecliptic, automated most times save when there were deep space haulers like us in residence. Raw material goes in, antimatter fuel comes out, and if the conversion goes bad, least there’s no one and nothing around when it blows. Hazardous business, manufacturing fuel, but it keeps the solar system rolling.\nThat’s how we knew it was a pomp, see—I was the only human there and Sevens, my copilot, they were the only android, and that don’t leave too many options. In truth we were both a bit put out. Oh, we’re used to death shepherds, but they make you wonder at the best of times, don’t they? And when there’s only two of you around and odds are one of you’s the sheep, things get a little awkward.\nStill, we invited the pomp aboard. When death comes knocking, you take it where it wants to go, and that’s just good manners. Plus there was only two of us rattling around in a hauler built for thirty, back before corporate set the hounds of automation loose, and even spectral company’s company.\n“Good evening,” the pomp said when it came aboard, all dinner party-like.\nMost psychopomps, you can tell who they’ve come for by the way they look. Humans for humans, androids for androids. The occasional animal, though it takes a hell of an animal for us to see its death coming. This one was weirder. It didn’t have a form really, or better said, it had too many. Its whole body was constantly flickering, like the blades of a fan melting together, the overall effect being of ten thousand things averaging out into a sphere.\nI didn’t read too much into it because, hell, you see ’em weird sometimes, and why shouldn’t death be weird. And besides, sometimes there’d be a silhouette against the face of that sphere, like roughly humanoid, and I was pretty sure that was the pomp relating to us, body language and that. Rude to criticize a person trying, ain’t it, and I got used to speaking to a sphere quick enough.\nThe pomp was a model passenger on the two-month journey back to Earth Depot. It accepted the cabin we offered it, which—death don’t sleep, do they? Wouldn’t that be convenient. Pomps are asleep, anything goes! No, but it had no complaints, settled in easy as, haunted the cockpit by day and retired at night. Kept itself to itself, responded when spoken to. Like I said: model passenger.\nFirst time it started a conversation itself, we were three weeks in, just coming out of a burn, me unstrapping myself, the pomp unaffected by trifles like physics.\n“Where is Sevens?” the pomp asked.\nIts voice, unprompted, startled me, made me fumble the belt clasp. It extruded two appendages, raised them like reassuring. It had been doing that more and more often, mimicking humanoid anatomy, human gestures.\n“Down in containment,” I said. “Used to be we had a dedicated payload specialist keep an eye on the cargo, but now copilot’s gotta double up. Acceleration couches’re still there, though.”\n“They have been gone some time.”\nI don’t know if it’s true your past flashes in front of you before you die, but if there’s a corollary, it’s that the present does when a pomp draws your attention to it. Routine throws weird shadows when death’s around. Was Sevens taking a while to verify the fuel cylinders were intact? Sure, but we were two people in a big ship. Tight schedules weren’t our thing. We were meditative and all. That’s why you sign on for the deep space gig, yeah? In an emergency, that’s what the alarms were for.\nUnless Sevens wasn’t able to trigger an alarm.\nI avoided the pomp’s gaze, or what passed for it, the smudge of face its circular silhouette had taken to extruding.\n“You know what, I’ll head down and see if they need a hand. You stay here. Someone’s gotta keep an eye on the controls, eh?”\nI kept an eye on the pomp, and then an ear, listening for the sound of hatches opening behind me. Nothing. Didn’t mean anything. Pomp probably only used hatches out of politeness. I sped up, arm-over-arm down the bridge that linked the cargo with the rest of the ship, like speed would make a difference when death was in town.\nThe containment chamber was open, safeguards disabled, which was totally normal given Sevens was maybe inside, but damn if the pomp hadn’t gotten in my head, made me see everything sinister-like. The chamber was only the fourth line of defense, anyway. Antimatter fuel cylinders were compact things on their own, but they were wrapped in a triple-layer of safety measures, and I’d wager each one weighed a hundred kilos. There were maybe two thousand of them in the containment chamber, all of them suspended in racks, ten-by-ten.\nAll but one. The corner of the nearest rack was empty. I could see the socket where the fuel cylinder had sat, warped, and rusted. The burn had put stress on the socket, weakened it to breaking, sent the cylinder plummeting down. Someone should have noticed before it came to that, but there’s two of us and thousands of sockets.\nI stood motionless for several minutes, because there’s a kind of reluctance that grabs me at times like this. Sure, my brain had put it together. Sevens, missing. The cylinder, fallen. The pomp in the cockpit—or on its way down? Who knew. It made for an obvious mental image, but I was struggling to take those few more steps, to enter the chamber proper and see the nonmental version.\nA hundred kilos to the chest at over two Gs—what would something like that do to a human rib cage? There’d be nothing left but pulp. Android skeletons were stronger. Sevens’ was mostly intact. Just the side of their chest cracked open. Ha, just. Half their face was frozen in alarm; the other had gone slack. Milky-gray fluid made a line like drool from the hole in their chest.\nI mean, fuck.\nI felt a shard of relief, the sharp kind that digs in ’til it’s guilt. This was it, the reason the pomp was here, and it wasn’t here for me. It wasn’t here for me.\nAnd sure, what happened next is maybe more exciting—me remembering Sevens wasn’t human, how the backup power supply in their head could hold out for at least an hour before its neural framework collapsed, and wouldn’t it be nice if humans had a backup heart while someone rummaged around in the infirmary cupboards for a fresh one—but I think, doing right by Sevens, I gotta own up to that guilt-relief, the way it soured things.\nIf I’d been thinking right, I’d have realized Sevens would pull through right away. The pomp was nowhere to be found. No way it wouldn’t’ve been drawn to a dying person. Which was good, for Sevens.\nFor me, death had come at Sevens and missed, and I had an idea who was next in line.\nIt’s exhausting, being on edge all the time. For a while I stuck to my cabin, like it was the one safe place. But you can’t be paranoid indefinitely. It’s like that moment when you’re a kid, and you first realize that people sometimes end, and it’s the worst week of your life, and then you get over it. Expecting death is no way to live.\nSo that was a choice I made. Not to be paranoid—not to imagine the whispered conversations passing between Sevens and the pomp, but to be there for them.\n“What’s it like?” Sevens asked one day. “Being a psychopomp.”\n“Quiet,” the pomp said. “Melancholy. Enormous.”\nAnd I sat in the pilot’s seat next to Sevens, subdued but present, and I thought about the fact that pomps felt emotions, and maybe they took no more pleasure in their work than employees at a funeral home, and that made me feel better, would have carried me blunted all the way to Earth Depot if it weren’t for the Tsukuyomi.\n“Distress signal,” Sevens reported. “Automated. Aluminum freighter Tsukuyomi. Lunar registration.”\n“Out of our way?”\n“Approximately ten days.”\nTen days—a quick hop when you have two months of voyage to look forward to, an eternity when you’re days from home. Funny how that works.\n“Will you answer it?” the pomp asked, and in hindsight that was the first red flag, ’cause look what happened last time it asked a question.\nBeing in foresight, all I said was, “Nah,” and I coulda left it at that, but how often do you get the chance to learn a psychopomp some space law? “Regulations would say we gotta, ’cept we’re a high-priority hauler. Corporate got the law changed—what was it, two years ago?”\n“Three years,” said Sevens.\n“Three, right. Turns out, answering a distress call only helps the poor buggers one time in ten, and listen, getting fuel shipments in on time ain’t worth more than whoever’s out there, but maybe it’s worth more than one tenth of them, yeah? Also, you ever see a space horror film? We go out there, who knows”—I clasped my hands, blew them up like one small choice chain-reactioning out of control—“maybe it goes bad.”\nDeep space haulers, we’re superstitious as they come—exhibit A, one extra-creepy pomp on board ’cause better to feel unnerved for a couple months than leave its luck behind—but I had horror especially on my mind ’cause of Sevens’ near miss. And I wouldn’t say it out loud, but sure, the pomp wasn’t helping. The refrain in my head sharpened once again: if it hadn’t come for Sevens, maybe it come for me, and maybe it was staring out toward that derelict freighter ’cause it knew that was where our paths converged.\n“And yet you could still choose to respond,” the pomp said, which being honest didn’t do much to settle my doubts.\n“The psychopomp is right,” Sevens said. “We are not obligated by law to help, but if we wish we may help nonetheless.”\nRed flags two and three, the two-pronged maneuver, the pomp and the android united. These ones I could see. What if Sevens had made a deal with death? You heard stranger things, from people decades on the Svetove run, who knew deep space better than they knew any living thing.\n“A ten-day delay,” the pomp said, like they’d planned it this way, alternating. “We are still a long way from Earth. Anything can occur in ten days.”\nI edged away from them, toward the exit to the cockpit.\n“Or be averted,” the pomp added.\nI ran—deniably, babbling about checks I’d forgotten to run in the engine room, that Sevens knew full well weren’t due for another month, but neither of them stopped me. Past my cabin, down the bridge, all the way to the containment chamber, fingers fumbling the unsealing, the lowering of safeguards, and only when I was inside, the wards back up, did it occur to me I was overreacting.\nI stayed down there an hour all the same. Not something I’m proud of—but sometimes the key turning in a lock is enough on its own, even when you know someone could come in through a window. I was sure the pomp could get to me if it wanted—no, not wanted, if it had to, it was performing a task, same as me—but you keep the door locked for an hour, you keep the containment fields up, and you come out thinking maybe there was no reason to close yourself off in the first place, and if you’re lucky you only have to believe it another couple of days.\nI undid the containment, made my way out quick as I could, entered the cockpit again like I’d only been down in engineering, like I said. Sevens muttered an idle greeting.\nThe pomp watched me settle into my seat. Its face was almost something. I looked away before I could trip over that almost.\nOn approach to Earth Depot, the planet itself a super-moon in our viewport, the station lights not quite visible yet, the pomp initiated a conversation for the third time.\n“I think I have caused undue anxiety. I guide neither humans nor androids into death.”\nNeither it nor Sevens had brought up my episode in the containment chamber, which was nice of them, but whatever gratitude the pomp had bought with its silence was now wiped out by irritation.\n“You coulda mentioned that in the first place.”\n“You didn’t ask.”\nWhich—of course I didn’t, it’s bad manners. Dunno where I heard that. Maybe nowhere. Maybe we living things have instincts for dealing with death. Make sense, wouldn’t it? The one guarantee in life, you wanna be sure you treat it right. Otherwise it would crush us, I reckon. One death after another, all slow like that. Relentless. No, of course we learned how to feel our way through all of that.\nIrritation bled away, leaving curiosity.\nThe pomp was facing the viewport, one hand raised, cradling newborn Earth’s head. I was loathe to interrupt, but it looked at me quick enough when I cleared my throat. Its extrusion looked more human than ever, like a cadaver preserved beneath the thinnest of sheets.\n“You mind my asking what kind of people you do guide?”\nI shoulda wondered then if I’d resealed the containment chamber behind me. I shoulda remembered the news stories you get once in a while, about how the fuel transport procedures were flawed, that corporate called alarmist. Maybe all this time I shoulda been more worried about hauling around enough antimatter to take a bite out of the solar system.\nMaybe then I would have wished I was days away, docking with the Tsukuyomi, heedless of the jaws about to snap shut on empty space.\nBut I did none of that, ’cause I was morbid curious, and for the first time I was looking at the psychopomp and its indistinct outline, like it wanted to be ten thousand things at once, and thinking maybe I was only one of them.\nThe psychopomp said nothing. Before I could repeat the question, it faded through the viewport and receded, a sphere of quiet gray, toward the Earth.\nFilip Hajdar Drnovšek Zorko is a Slovenian-born writer and translator. He grew up in Slovenia, Ireland, Australia, and the UK, and currently resides just outside Portland, Maine. He understands that his name is a bit confusing, and would like you to know that “Drnovšek Zorko” is the surname. He attended Clarion West in 2019 and his work has previously appeared in Clarkesworld, Lightspeed, Beneath Ceaseless Skies, and elsewhere. In his spare time he is a keen quizzer—British readers may recognize him from that one time he was on University Challenge."}