{"fingerprint": "wX3LejM/O7hlf//F9GZlZbKglWU=", "sitename": "Clarkesworld Magazine", "title": "Songs of Activation by Andy Dudak", "author": "Andy Dudak", "date": "2020-01-01", "source": "https://clarkesworldmagazine.com/dudak_12_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Songs of Activation by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5830 words, short story\nSongs of Activation\n1\nPinander has been reciting “Song of Manifold Suns”all morning, in overgrown, forgotten garden nooks or neglected library aisles, far from the mutterings of other desperate students. Ancient knowledge comes to life within him. By lunch, he understands complex marvels:\nThe finer ethical justifications of the empire, as worked out by the ancients.\nThe properties of quantized space-time, which make it the ultimate data storage medium, and allow it to be manipulated, colonized, and settled.\nIn moments like these, the looming exam holds no fear for him.\nThe Grand Arcade is full of other black-robed students by the time he arrives. The usual hubbub is subdued with the exam so close. Students quietly read or recite, fueling their brains with broth.\nPinander’s mind expands with activated Lore. He sits with Jain and Philo.\n“Alright?”\nA penitent Jain hunches over her steaming bowl.\nPhilo studies a scroll. “I’m not going to make it,” he says.\n“Where are you?” Pinander says.\n“The Temple Odes.”\nPinander explains the Temple Odes were songs. “Some verse lends itself to silent reading, but not the Odes. You should be reciting or singing.”\nJain giggles in her soup steam.\nPinander reckons Philo is doomed. Intelligence goes a long way in the imperial service exam, but shyness can hobble you. There are soundproofed study rooms for students like Philo, but to pass the exams you must study constantly: at meals, in showers, in the loo, to and from study groups, as you drift off to sleep. There’s a lot of verse like the Odes. If you don’t recite or sing, Lore will go un-activated, remaining useless noise in your skull.\nThe years in upload aestivation will be for nothing.\n“We’re dropping fast now,” Jain says. Her face is nearly in the porridge, her shoulders heaving with silent laughter.\n2\nPinander hurries along the colonnade, whispering “Quantum Pioneers” as he goes. Each verse internalized means more activated Lore. The brutalist cliff face of the aestivation facility—dubbed “The Crypt” by students—looms over campus. Pinander recalls emerging from a seven-year dream-time in that place, the profound sense of loss. He was still ignorant when the nurses wheeled him into daylight. There was a peculiar weight on his thoughts, strange expectations and voids. He couldn’t access the years of data in his skull.\n3\nThey hear Philo has killed himself. He’s one of four across campus that night.\n“We’re dropping fast now,” Jain reiterates, high on study enhancement, rolling in the glowing fungi of the faculty garden.\n“Let’s go!” Pinander hisses.\nShe told him where she was going. He tried to talk her out of it. “Come with me or don’t,” she said, and of course he followed her, as always.\n“We learn the classics,” she says, “poetry, philosophy, for what?”\nHe can’t get her out of here by force. He’ll have to argue well: “Our educations.”\n“You mean activated Lore. Uploads activated by Odes, and Epics and Songs.”\n“Lore given context.”\n“It’s a scam.” She props herself on an elbow, glowing, staring up at him. “It’s a scam, Pin, and I can’t take it anymore.”\n“Please. You’ll be the last of us to wash out.”\n“Philo was the best of us, and he’s gone.”\n“He’s gone because he was a selfish git!”\nThey were the Mercenary Three. They swore oaths to each other, and now the covenant is broken. Jain is right. Philo was the best of them. Pinander kneels and plucks a luminous fruiting body from the garden. It disintegrates between his fingers, spore illuminating the faculty square.\nProfessors open windows and shriek obscenities.\n“Fuck the lot of you!” Jain screams. “You’re all complicit! And you know what I’m talking about!” She turns to Pinander. The bio-gloaming renders her demonic. “I think they’ll take me away now. There’s something you should know.”\n“I love you too!”\n“No . . . what? Listen. There’s a poet they don’t want us to know about. A different context for the Lore.”\nThere has only ever been one context. Pinander struggles to digest this. “How’s that possible?”\n“She was on the council that coded the Lore. They eventually deemed her a counterrevolutionary. They executed her, but not before she could . . . ”\nThe campus police are inside the compound, blaring commands amid rolling submission gas.\n“There’s a scroll floating around campus,” Jain says. “A selection of her verse. I think that’s what got to Philo in the end. Her poetry.”\n“You both knew about this?” Pinander says, hurt.\n“We didn’t want to distract you. We thought you had the best chance of passing. One of the Three had to. But we were wrong. You might be the only one of us who can handle it.”\n“Handle what?”\n“The dichotomy, the dual mind . . . having both contexts in your skull at once. Maybe it was meant to be you all along. Fuck graduating, anyway. No one should graduate from this place.”\nThe police close in, dispelling the garden-glow with floodlight. Pinander drops to his knees. Jain stares into the nearest police torch, her pupils shrinking to pinpoints. “I don’t regret it. The physics kept me going. The grand mystery of it all. She puts it in a new light.”\n“The physics too? Not just the philosophy?”\n“Yes, her name is Sinecure.”\nHe’s heard the name on the lips of classmates. He assumed it was a new pop idol, one of many things he doesn’t have time for that his rich classmates do.\n“There’s just one copy of the scroll?”\n“As far as I know. Philo gave it to me. I read it and passed it along to Ivier.”\n“And Ivier offed himself . . . two days ago?”\n“You could try his girlfriend Raff.”\n“Since when were they together?” Gossip, another strange pastime of moneyed students.\n“Submit!” an officer shouts.\n4\nIn interface audit you see what you really are. You hide nothing from them or yourself. Pinander has always found it cathartic, unfashionable as that is.\n“You’re a fascist,” Jain once said, “or at least a fucking sheep.”\n“I’m a pragmatist.”\n“You have no moral compass,” Philo observed.\nThey were on the Grand Arcade, the Mercenary Three together again. But this is the past, dredged up by audit.\n“I’m just trying to get ahead,” Pinander replied, as he often did. “I can’t afford your ideals.” That always shut them up.\n5\nHe stumbles across the quad in post-audit daze, wondering if Jain made it all up. She said all kinds of things recently. He assumed it was standard pre-exam washout, but maybe it was her new context for the empire and physics. It’s hard for him imagine such perspectives, on physics of course, but more so on the empire, on its revolution and great Emanation.\n“Space-time,” she said in amazement, “is quantized. There are particles of space-time. Our empire has that much right.”\nPinander wonders why they let him go. He must have been audit-confirmed as nonthreatening. He’s relieved to be walking free, but also a tad insulted. He loves Jain. Aren’t they worried he’ll raise trouble over her arrest? Is he really such a benign creature? They say audits can’t lie.\n“You’re looking out of sorts, Pin.”\nProfessor Wigh looms before him in her scandalously tattered robe. Her eyes are severe behind a screen of unkempt gray hair. “Don’t tell me you’re washing out.”\n“I’m on a constitutional.”\n“Then march back to the gardens and sing Odes. They’re important to foundational physics as well as political theory. You’re hardly a model pupil.”\n“I do what I can, under financial pressure most students here couldn’t imagine.”\n“Precisely why I think you can beat them, in the end. Stop loitering and get to it.”\nPinander looks up at stacked worlds of orange-glowing cloud. Wigh follows his gaze and asks, “What do you see?”\n“A poisonous atmosphere . . . an invisible shield keeping it bay.”\n“Epic thirty-seven, verse fourteen, would activate Lore on that. And you’ll need more for an exam essay. That invisible shield, for instance, is a spin foam hack. How about the Darkling Sea?”\nShe means the body of methane surrounding the university’s island. Pinander looks down at the lichenous tundra turf of the quad, then toward The Crypt and Arcade and dormitories, his little universe. “If you’re so concerned about my academic performance, how about a tip?”\n“I think I just gave you one.”\n“I mean insider stuff. Aren’t you on the exam committee?”\n“I’ve never had a student ask me to help them cheat before.” Wigh chuckles. “I’m sorry, Pin. I haven’t been surprised by anything in quite a while. I could expel you of course.”\nPinander flicks open the utility scroll on his belt and touches his bank account.\n“So it’s to be bribery?” Wigh smirks. “I think you’re losing your grip.”\n“I’m a pragmatist.”\n“And that may be your undoing. To activate Lore, merely studying scrolls won’t suffice, though it’s essential.”\n“I just want to pass, Wigh.”\n“Then you’re lost and the exam will catch you up. Nobody cheats the exam, even with insider tips. It’s not just a test of knowledge. Otherwise we’d simply audit . . . what need of exams? Audit is passive. The exam requires your initiative and that’s when things can get . . . emergent.”\nCryptic doggerel, Professor Wigh’s specialty. But this tidbit finds purchase in Pinander’s activated mind and plants roots.\n6\nRaff shares a dorm room with seven other students, all home and embunked, muttering incantations, rocking obsessively back and forth, scribbling verse on walls, or unconscious. Pinander climbs onto Raff’s bunk and finds her huddled in a nest of blinking, formatted scrolls. After staring a moment she recognizes her visitor.\n“I hope you didn’t come to express your condolences, Pinander. I can’t handle one more condolence.”\n“Jain’s in Detention.”\nDetention, aestivation, lost in a second dream-time, possibly indefinite. Pinander can’t imagine where else they would put her now, and it’s a kind of death.\n“Sorry,” Raff says, all her bluster deflated.\n“And I’m sorry about Ivier. He seemed solid to me. Not the sort to fold under exam pressure.”\n“He wasn’t.” Raff frowns, studying her guest with realization. “What are you doing here? Shouldn’t you be studying?”\n“Just before they took her, she told me about Ivier’s extracurricular reading?”\nRaff’s gaze darkens.\n“Did you read it too?” Pinander says, glancing at Raff’s mess of formatted scrolls.\n“I was tempted. I wanted to understand what had done that to him . . . ” She inhales, stifling a half-sob. “I couldn’t take the plunge. He was always braver than me. And more curious about everything. Before it really messed him up, he was railing against the empire. He told me one line of this Sinecure . . . ‘Extinguish the Emanation.’ Real counterrevolutionary stuff.”\n“With Jain it was physics.”\nHe’s already thinking of her in the past tense. Philo and Ivier, and who knows who else, committed straightforward suicide because of their new knowledge, or dual mind or whatever it is, but Jain also killed herself, in a way.\n“I’m happy to commiserate all you want. I’m completely fucked, exam-wise, so I’m done studying. But you . . . ” She follows Pinander’s gaze to the blinking scrolls. “ . . . you really want to read it? What about your scholarship? You’re on a full ride from . . . where was it?”\n“Broken Pearl?”\n“And didn’t you just come out of audit? They know you know about Sinecure. If she’s really such a dangerous revelation, why would they let you go?”\nMaybe it was a faulty audit. Maybe they didn’t find his love of Jain wanting. Maybe they didn’t find it at all, and maybe they missed other things as well. Maybe he’s dangerous.\n“I didn’t delete it,” Raff says. “These scrolls were my study notes. I’m washing out, that’s all. I didn’t read Sinecure, but Ivier’s distillations have scrambled me anyway. Even if I could stand singing another fucking Ode, I wouldn’t want to graduate from this place. I’ll go home and my parents will resent me, and I’ll be just another trust-funded wastrel until the whole system comes crashing down, or I’m rich. But I didn’t delete it. I didn’t read her, after all. What if she’s as important as Ivier said? So, I just passed her along . . . to someone I thought could handle it.”\n7\nBroken Pearl, in the Mother-of-Pearl system, is twenty lightyears away, but thanks to Emanation technology—some of which Pinander came to understand just hours ago—the conversation lag is nonexistent.\n“We trust you’re doing us proud, kid.”\nDa’s seemingly benign catchphrase resonates with its usual menace. Cue Ma’s more insidious addendum:\n“You won’t forget the sacrifices we made to get you there. We know that.”\nThey look so old. In addition to the seven lost aestivation years, there had been dilation getting here from Broken Pearl.\n“And the exam is . . . ”\n“In three days, Da. Like I said.”\n“Alright kid, check your tone.”\n“Go easy on him, darling, he’s under pressure.”\n“Doesn’t give him call to act high-handed with his own father.”\n“Sorry Da.”\nTheir backdrop is the old familiar bulkhead, encrusted with archaeological layers of his childhood, video prints of Pinander, age zero to eleven. From twelve to the present there was no family life. They consigned him to aestivation without a second thought. In his darker moments, he thinks that was no better than selling him into prostitution or soldiery, but he can’t afford to indulge such thinking.\n“So what are your plans tonight?” Ma asks. A loaded question of course.\n“Studying.”\n“Good lad,” Da says.\nPinander takes a subversive delight in the lie. He really should study, but instead he’s going to crash his first student party.\n8\n“Ethics are laws written on our hearts.\nLaws are ethics written on space-time.\nNever forget the beginner’s mind.”\nIt’s verse ninety-five of the Ninth Epic, but shrieked over a decadent soundtrack that pulses through the compound. The revelers sway drunkenly, heads hanging, amid rolling storm-fronts of smart vapor. Here in the compounds this is possible, where obscene wealth keeps campus law at bay. Compared to these students, dorm denizens, still fabulously wealthy by empire standards, might as well be paupers.\nPinander wonders what that makes him.\nWandering through ornate gardens in his black student robe, he draws looks from fashionably and scantily clad partygoers. There is commotion ahead, a crowd psychedelically blurred by smart vapor. He gives it wide berth—a fight, from what he can hear. Someone stole someone’s meds. This contributes to Pinander’s sense of being an alien here. It is usually the most privileged students who engage in theft, violence, and drugs. He remembers Philo lobbing a cannister of vandalism nano at the façade of The Crypt. Pinander couldn’t fathom this. Philo’s clan paid a fortune to send him here, and he was an adult choosing to stay. And there were Jain’s countless transgressions, up to and including her novel suicide.\nHe wonders if he can raise her from the dead.\n“Our great dream is the Inevitable Peace.\nEntangled colonies, instantaneous,\nCivilization their inheritance.”\nVerse thirty-four of the Twentieth Temple Ode. Pinander recalls it activating a fine blend of dark energy and political theory. That was just a few weeks ago, but it seems like centuries. He marvels at how the ancients subtly weaved physical and social science, making them only actionable together. In the face of that sorcery, this setting of Odes to hedonist beats seems juvenile.\n“Pinander, isn’t it?”\nThe haze clears. He tried to hold his breath, but smart vapor must’ve gotten in.\nBefore him sits an antlered figure on a phantasmagoric throne, a heap of mutated idolatry printed for the occasion. This person seems to be holding court. A modded menagerie is arrayed on either side of the throne, students become mythic animal people, chimeras, and strange gods.\nPinander struggles to focus on their lord.\n“You’re that scholar-shipper Philo mentioned.”\nShe wears a student robe artfully shredded to showcase her powerful—and no doubt expensive—musculature. The crystalline antlers erupting from her temples are not a mod, but the side effect of a perilous drug. Pinander can’t remember the name of that particular moneyed pastime, but it strikes him as germane.\nSomething to do with why he’s here.\n“He called you a pragmatist. So not to be inhospitable, but why are you here?”\n“Not winning the masque at any rate!”\nThis barb from a translucent, many-limbed demigod gets the menagerie giggling. Pinander becomes self-conscious. His head clears.\n“That’s enough, there will be decorum in the court. Pinander the Pragmatic, you are welcome here and shall enjoy my protection. I was sorry to hear about Jain and Philo.”\n“Thank you, Decima.”\nFor it is she, Decima the Decimated, Queen of Campus Hedonists, consumer of more drugs and brain mods than anyone in university lore.\n“If you seek safe harbor from the storm of thy grief, we of the happy hunting grounds can aid you.”\nSurrounded by her tittering followers, Decima locks gazes with Pinander. She seems bored with her pantomime. Pinander guesses his presence ruins the mood. In contact with anything beyond her world of privilege, the bubble of her legendary status threatens to burst. The menagerie quiets down.\nThe translucent demigod steps toward Pinander. “I don’t think you were invited.”\nThis one’s eyes are yellow, and not from some reptilian mod. He twitches and glares, his varied arms spasming with potential.\n“He’s looking for this, I guess.”\nDecima holds up a scroll.\nThe demigod glares with keyed up paranoia. “What is it?”\n“What I don’t get is why Raff handed it to me. We’re not particularly close.”\n“She thought . . . ” Pinander hesitates. “Given your hobby? That is . . . ”\n“I see. My mind is already so expanded and abused, why couldn’t I endure two Lore contexts at once?”\n“It’s the reputation you’ve cultivated.”\nShe holds the scroll up to blood-red methane moonglow.\n“Ours is the unremitting struggle,\nThe emperor-less empire,\nThe dynasty without a sire!”\nVerse forty-six, growled pretentiously over the quickening beat. Pinander recalls the Lore it activated. He wonders if Sinecure has new contexts for accelerated expansion and manifest destiny.\n“I guess you haven’t read her yet?” he says.\n“She was going to top off my evening.”\n“I’ve heard about it,” the demigod says, his agitation mounting.\n“And what have you heard? Please do enlighten the court.”\n“Just . . . that it could turn everything upside down.”\n“That doesn’t intrigue you? Why do you think I convoked this court?”\n“To expand our minds . . . ”\n“And Sinecure might be the ultimate psychedelic.”\n“She could tear down everything we have.”\nSmart vapor makes flickering palaces of the suites bordering the gardens. The stupefied menagerie watches their queen. She flicks open the scroll.\n“Don’t!”\nA demigod arm lashes out, unrolling like a tentacle. Pinander stares in amazement. He had no idea the seemingly ornamental limb was that functional. He wonders how much it cost. At least the full value of his scholarship.\nThe tentacle withdraws and dangles the scroll over the demigod’s head.\n“Give it back.” Decima rises from her throne.\n“Forget everything else,” the demigod says, “but I can’t lose you.”\nPinander finds himself in headlong motion, sprinting toward the translucent devil, even after he sees the scroll strobing, formatting. He knows it’s too late but he’s charging. Maybe he “has the vapors” as these elite students say. He’s never felt this violent in his life.\nDecima, rushing from the other direction, looks how he feels.\n9\nThe statue in the Hall Paramount towers over rows of holding seats, all currently empty except for Decima and Pinander. They slouch beside each other in their constraints, bruised and groggy. Decima twitches and sweats with a variety of withdrawals.\n“I can’t believe this is happening,” Pinander says, his voice low in this templelike space of The Crypt. He has failed Jain, Sinecure, his parents.\n“Then it isn’t happening,” Decima says. “Nothing is, but belief makes it so.”\n“Elitist twaddle.”\nThe statue, an imperial factor in flowing robes, glares down at them in judgment. Weald was a paragon of ancient officialdom: grave and cultured, fair-minded and sober, able to summon verse for any occasion. The curriculum council needed a model mind when designing their uploads. Now every sitter of the exam must strive to be Weald.\n“Where’s Gnomic?” Decima says.\n“That fuckwit we beat to a pulp? In the infirmary I guess. You need a certain level of health to aestivate. You and I barely made the grade, I think.”\nThis seems to increase her confusion. “Where are we?”\n“The Crypt, mush-head! Slated for punitive aestivation!”\n“But . . . ”\n“But you’re rich and you live in the suites. But one of your own summoned campus police and let them in. Because a lowly scholar-shipper laid hands on elite flesh, I guess.”\n“You shouldn’t have done that.”\n“You shouldn’t have spiked your vapor with . . . whatever that was.”\nVault doors hiss open somewhere. Footsteps echo through the hall. This is it. He’ll be joining Jain in perpetual twilight, not that he’ll see her there. So much time already lost, now more. Maybe this time he won’t wake up.\n“Unbind her.”\nTwo smartly suited people come around the statue, followed by a chastened-looking monk in gray habit. The monk hurries over to barely conscious Decima and incants to her seat in his crypt monk speech. The off-campus suits stare at Pinander impassively. He guesses they’re functionaries of some kind from Decima’s powerful clan, lawyers maybe, or glorified enforcers warranted to throw money around.\nThe chair releases Decima and the suits get her up. One of them puts an infuser to her neck. She twitches to life as they escort her away, and she glances back at him.\n“I’m sorry.”\n10\nThe leaking, overcrowded estates hung from the ice ceiling of Broken Pearl’s crust. The inky void of the interior sea yawned below, a living metaphor reminding denizens of their precarious economic position. Pinander spent his childhood harvesting exotic proteins from the water filters. It could be traded at the bazaars and processed into all manner of black-market commodities. Many of his fellow filter raiders—children all, only they could fit in the filters—succumbed to prion exposure, but somehow Pinander survived. Da took this for evidence of his son’s special destiny. Da always thanked his abyssal gods that the Mother-of-Pearl system was entangled with the empire. He prayed for the empire at their home shrine. He prayed his son would sit the exam and become an Imperial Factor. Pinander never prayed, but he studied the shrine’s myriad figurines. Among the abyssal gods were imperial figures, including a miniature Paragon Weald, more crudely represented than in The Crypt.\n“Abyssal Lord.” Da’s eyes squeezed shut, voice low. “Queen of the Vents, Sireless, Paragon Weald, I petition for my only son . . . ”\nThe gods seem to hear him. Pinander feels the universe subtly shift. He is no longer in Broken Pearl.\n“Can you hear me?” A familiar voice in a radiant void.\n“Yes . . . ”\n“You were aestivating.”\nHis thoughts rally. “Yes.”\n“You’re still in the casket, but I’ve quickened you into semiconsciousness.”\nHe can feel the casket around him. “How long was I under?”\n“A day.”\n“Who are you?”\n“Your long-suffering professor.”\n“Wigh . . . what is this? Get me out of here!”\n“I will, but I wanted to give you a choice first. Concerning Sinecure. You could still read her if you wish.”\n“The scroll got formatted. There’s another? Explain yourself, Wigh. No more obfuscation!”\n“There was good reason for that. I couldn’t be specific, in case you got audited again.”\n“Ethics are laws written on our hearts.\nLaws are ethics written on space-time.\nNever forget the beginner’s mind.”\nThat verse activated much Lore. A core verse of Paragon Weald’s own writing, it was foundational when his mind was modeled. One of the secrets it unlocked was the composition of the atmosphere held at bay by the university shield. This shield was an invisible mystery called a “spin foam hack.” The lethal brew of the atmosphere was revealed to him: nitrogen, methane, a dash of hydrogen, ethane, propane, cyanoacetylene, helium, argon, hydrogen cyanide . . .\n“Pin!”\n“Yes . . . ”"}