{"fingerprint": "QBivsCofZjv04BDAE/sGfh9gKzs=", "sitename": "Clarkesworld Magazine", "title": "Fool's Cap by Andy Dudak", "author": "Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dudak_06_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fool's Cap by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7890 words, novelette\nFool's Cap\n1\nBeadith stood on the beach and watched her shuttle burn for orbit, then blossom white and fall smoking from the sky. She felt she’d seen this before, wondered at it before, and when the concussion shoved her back, slipping on the rocks, this also seemed familiar. But the moment of déjà vu passed. The meteor shower of the shuttle hit the ocean in geysers of steam, and it too was gone.\nShe was alone. The world was silent, but the silence in her head was larger, expanding. Her vizcort implant was dead. She had no data from the orbiter, or from anywhere. She sat down to process this astronomical coincidence—vizcort death and shuttle suicide—but could only mull the concept of sabotage, as though it were a concept she’d just learned. She was truncated, crippled without her vizcort. She was on a cold, rocky beach under a gray sky. Stranded on an island. Stranded on the remote world of Igiugig.\nAbsurd, impossible.\nShe found it hard to focus on the present without the check and balance of her vizcort. Her work for the War-crimes Tribunal bubbled up, renditions surfacing like bloated corpses one after another. She stood up and wandered clumsily along the beach. She was shivering, though her utility skin seemed to be operational.\n“Will-o-the-wisp,” she called.\nA luminous vapor of drones coalesced before her. At least she still had these minions. She watched brief fireflies of density form and dissolve in the cloud. She tried to focus on why she was here, thus equipped. Her faerie army followed her along the beach, its presence bringing some measure of comfort.\nShe finally understood she was in shock.\nAnd then she saw him: a distant figure, hunched, moving from the mossy interior of the island toward the water.\n“Kiniod Stationer,” she said quietly. This invocation failed to confirm the figure’s identity, but it focused her wits. She drew her sidearm and advanced.\nThe nearest patch of moss extended tendrils for communion.\nShe was close enough to smell his stench, and still he hadn’t noticed her. He knelt by a tidal pool and dipped his hands into the freezing brine. He was old, frail, dressed in a monkish garment woven of dead moss. He raised his hands to the leaden sky and let the water drain off.\nBeadith stepped closer, her weapon nearly touching the back of his head.\nHe flinched with sudden awareness, nearly toppling into the water. Then he was feebly scrambling away. She watched this sad display, head cocked. She studied his withered face whenever he glanced over his shoulder. She sought a hint of the archetype. Could this decrepit thing really be the most notorious mass-murderer in history? Where was the Kiniod Stationer presence, the renown fatal charisma?\nShe casually followed him, weapon aimed, as he scrabbled among the rocks and failed to rise.\n“Are you real?” he wheezed.\nBeadith had heard Stationer’s voice many times, as had most people within the Human Emanation. She’d grown accustomed to his mesmeric passion. This creature at her feet sounded nothing like him.\n“Very fucking real,” Beadith said. She fired a slug, turning nearby rocks into a glowing crater.\nHe whimpered and crawled into a pool.\n“Who are you?” she demanded.\nCowering in the water, he dared to meet her gaze. “Don’t you recognize me?”\nThe eye contact did it. All at once she knew him, and marveled at the corrosive power of time. “Kiniod Stationer,” she said. This second invocation was for the universe, for the billions dead.\nHe shivered in the water, lips turning blue. He stared in awe. “I’ve wondered what form you would take.”\nNow that the moment had come, Beadith wondered if she was his death incarnate. She felt she was losing control of the situation. The water would kill him if she didn’t. “Come out of there,” she said, using her sidearm for gestural emphasis.\n“Just shoot me.”\nShe aimed, hesitating. She’d be damned if she was going to lose him to hypothermia after all these years, but she didn’t want to pull the trigger on his order. Fuck that. “Come out!” she barked.\nHe raised his hands to the sky like before, and closed his eyes.\n“Will-o-the-wisp,” she said. “Harass. Get him ashore.”\nThe drone vapor, which had gone invisible, suddenly illuminated the darkening beach. The fluid glow surrounded Stationer. Soon he’d abandoned his Christ-pose and was scrambling out of the water, his backside harried by a million stings. His ignoble shrieks echoed off the towering spine of the island.\nBeadith found herself laughing at the spectacle.\nWaste heat from the drones’ work dried Stationer off. He was once again before her—on his knees, twitching and sniffling, at her disposal.\nWasn’t this why she’d come?\nThe Wisp diffused, dimmed. Night was falling quickly. Beadith pressed her weapon to Stationer’s forehead. She was still laughing.\n“Do it,” he said. “You probably have orders to bring me back, but why bother? I hereby confess my crimes. Execute me.”\nBeadith no longer considered herself a Tribunal agent. She had orders, but they meant nothing to her. She lashed out with a booted foot and caught Stationer in the jaw. He sprawled among the stones. She loomed over him, assessing her feelings.\nHe groaned and raised a warding hand.\nShe wanted to beat him, torture him, but a deep exhaustion crept over her. She’d traveled light-hours to enjoy this moment, and yet something was wrong. Something was missing. Her shuttle, her vizcort: another tickle of déjà vu. “Take me to your camp,” she said.\nWhen he failed to rise, she dragged him to his feet with her free hand, shocked at how light he was. She shoved him inland. “Camp,” she growled.\nThe moss reached out for them as they approached, as if welcoming them home.\n“Will-o-the-wisp,” Beadith said.\nThe path among the hillocks of moss lit up. She swatted away exploring tendrils, but Stationer was content to be fondled. She had to disentangle him and shove him onward.\n“Did you come to Igiugig for the moss?” she said. She’d heard of its psychoactive and computing properties. It resembled moss superficially, but it was not plant-life. She hadn’t been able to find much research on it. Few seemed to know it existed.\n“Answer me!” she said, pushing him again.\n“Yes. For the moss.”\nThe path led to an aging printer and feedstock larder, and a moss-covered hut. Beadith shoved Stationer down beside the glowing printer hearth. She went to the access panel and swiped through menus. She selected something called ‘bedtime restorative’ and the printer hummed to work.\n“Are you going to take me back?” Stationer said.\nSo he didn’t know. He’d probably been interfaced with the moss when the shuttle exploded. A cup of something like meat broth was ready for her in the printer’s mouth. She sipped it tentatively, then gulped it down.\n“Just kill me,” Stationer said.\nBeadith threw the cup in the recycler. She holstered her sidearm and drew her boot-blade, then squatted in front of her prisoner. She belched, and pressed the blade to his throat. “Stop telling me what to do.”\nStationer gulped.\nShe pushed him back, straddled him, ran the blade along his cheek. “I want a better confession,” she said. “What are you guilty of?” She knew exactly what he’d done, but she wanted to hear him say it.\n“They say I—” He shrieked, his cheek suddenly open from temple to jaw.\n“Try again,” Beadith said.\n“Mass murder,” he blubbered. “Genocide!”\nShe eyed him critically. He was bleeding pretty bad. “Mass murder . . . genocide. These are just words.”\n“What else can I give you?” Kiniod Stationer was hysterical. Which was gratifying, but not nearly enough.\n“Let’s start with complete sentences,” Beadith said. “You know . . . subject, verb, object . . . ”\n“I . . . committed genocide.”\n“Now we’re getting somewhere. Go on. Details!”\n“I . . . ”\n“You . . . ”\n“ . . . ordered erasures.”\nShe cut his other cheek, slowly, enjoying how he wriggled and squealed beneath her. “Pretend you’re before the Tribunal,” she said, her tone helpful. “They wouldn’t want euphemisms. And they’d demand numbers.”\nWhen he stopped blubbering, he said, “I ordered . . . something like . . . half a trillion copies—”\n“Nope. We don’t call them that.”\n“ . . . instances . . . ”\n“Souls.”\n“ . . . souls. I had half a trillion souls murdered.”\nHe was learning, anyway. He’d almost said ‘erased’ or ‘overwritten,’ but had thought better of it. Still, the roundness of the number bothered her. He ought to know the precise death-toll. It ought to be his sole possession. But who knew how many were gone? Probably a bit more than half a trillion, or just shy of it. She couldn’t stomach a margin of error in his skull, giving him wiggle room, no matter how academic.\n“It’s just you and I on this island?” she said.\n“Yes,” he sniffled.\n“Communications?”\n“No.”\n“Shuttle or boat?”\n“No.”\nLong before Stationer took power, Beadith’s father had gotten himself written onto space-time. It was supposed to be the safest substrate to exist on: ultimate security, computed by the universe itself, safe from the vicissitudes of matter. The science was indisputable. But father and billions like him hadn’t taken the human factor into account.\n“You’re going to suffer,” Beadith said.\nStationer exhaled in resignation. “Why do you think I came here?”\nA moss tendril from the hut explored his bald pate. Beadith watched it probe, set down roots.\nShe dreamed of the rendition on Baroque Pearl, the one that had yielded Stationer’s location. She’d dreamed of it often in vitri-stasis on her way to Igiugig, but this time it was different. This time the subject, a mid-level Stationerite named Uungest, didn’t respond to the memory assay. This time the infallible technology failed.\nShe contemplated the middle-aged man floating in the interface tank. She needed to see what was in his skull. In the old days they’d used pain. Was she capable of that?\nShe woke on a bed of moss near Stationer’s hut. She found a thin tendril adhered to her scalp. Disgusted, she yanked it off.\nStationer dozed against a printer pylon, where she’d zip-tied him. His cut cheeks had scabbed over. Numerous tendrils had interfaced with his skull, forming a lichenous ‘fool’s cap.’ She couldn’t guess what was happening in his brain, but his relaxed expression bothered her. She crawled to his side and tore off the cap.\n“Wake up!”\nHe emerged from the moss trance, blinking and bewildered.\n“Think you can escape what you’ve done?” Beadith said. “Or maybe edit your guilt?”\n“The moss can’t change who we are,” he said. “It can only help us know ourselves more completely. For me, that is penance.”\nBeadith’s rage waxed. Stationer didn’t deserve the masochistic comfort of penance. Not the moss’ anyway. If there was to be penance for Kiniod Stationer, she would be the vector. But in the meantime she had to keep him alive, so she printed a breakfast broth and made him drink it.\nShe spent the rest of the day experimenting with the printer and the drones, trying to contrive a signal to her orbiter, which could grow another shuttle and send it down. Somehow she couldn’t make it work. This was surprising, outrageous. The drones were a powerful tool. There was practically no end to what they could do, especially with a printer at their disposal, even an old one. Yet here she was.\n“You’re stranded,” Stationer said as twilight fell, “aren’t you?”\nShe went to him and administered a backhand, re-opening his left cheek. “From now on you don’t speak unless prompted. Understand?”\nHe nodded dazedly.\nShe curled up in her moss nest, her utility skin warming up for sleep. “Will-o-the-wisp,” she said. “Keep the moss off our prisoner tonight.”\nStationer’s eyes widened as the drones settled around him in a glowing faerie ring.\nThis time the dream was in third person. She watched herself contemplating the prisoner. The assay machine continued adhering to dream logic, somehow failing to work. And somehow Beadith knew that her third-person self didn’t know this was a dream.\nShe’d heard about this property of the moss. It copied you and ran you through simulations.\nDream-Beadith touched a keypad, and the interface tub began to drain. Spectator-Beadith couldn’t look away.\nShe woke to find four tendrils attached to the crown of her head, and the beginnings of a fool’s cap, a growth the size of a coin. She peeled it off and stood up, glaring at the wilderness of moss surrounding her. Stationer was curled against the printer. He looked bad, semi-conscious, sweating.\nShe left him and spent the day exploring the island. Her instinct was to stay busy. She didn’t want to think about her dreams, or the possibilities of the moss, or the mystery of her stranding. She studied flat ocean horizons, brooding on the low odds of rescue. Igiugig was a diverse world. There were settlements on the tropical continents, but this northern archipelago was a place for hermits.\nHer best hope was someone finding her orbiter. It might be hacked, and questioned.\nOr not. She might be here for the rest of her life.\nShe returned to the camp and found Stationer moss-interfaced. Her drones had stopped protecting him at dawn, following her command to the letter. She tore away tendrils and peeled off an already-mature fool’s cap.\nHe mumbled something but didn’t wake. His left arm above the zip-tie was blue. She cut the tie and he toppled.\n“Will-o-the-wisp,” she said, lying down. “Keep him in the camp. And keep the moss off both of us tonight.”\n2\nA few weeks later he was aimlessly wandering the beach, examining tidal debris. Beadith watched him from her high vantage atop the island’s spine. She’d had little to do since arriving but wander these cliffs and puzzle over her situation. Stationer was a broken thing, laughably feeble. She could descend right now and hold his head in a tidal pool until he stopped struggling. She’d thought about this a lot. Why waste a plasma slug on him?\nHis dotard habits infuriated her: the dainty way he hobbled shoreward to make his morning ablutions, his palsied maintenance rituals at the larder, his night terrors and incontinence.\nShe liked to press her sidearm against his skull and listen to him whimper. This was their only form of interaction. Her drones still kept moss-interface at bay when they bedded down. Perhaps his insomnia was due to some kind of moss withdrawal, or maybe it was just a mass-murderer’s guilt.\nBeadith’s nights were also restless. She couldn’t stop wondering what the moss might reveal to her about who she was.\nStationer clearly wanted the moss, but didn’t dare ask for it. He was not a stupid man, even now. She might kill him at any moment, and they both knew it.\nLater that day she found an old vid projector buried under the rags and unrecycled bowls in Stationer’s hut. She turned it on and a hologram unfolded, scenes from the man’s rise to power on Aleutia. The worst part was that he eventually achieved the goal he shouted about in his speeches. There was no more writing on space-time. People were afraid of another purge.\nIn one speech he ranted: “To write on space-time is to unravel it. Forcing space-time quanta to store information undermines their participation in the vacuum. Writing on space-time will unravel causality. The research is clear. Our Aleutian scientists discovered this. Who else could have? That’s right . . . I won’t insult your intelligence by naming the unravelers. We all know who they are. You can’t say it in polite society, but if I’m elected, that’s going to change!” A crowd had been whipped into sexual frenzy. “That’s right, friends. They’ll be the first against the wall!”\nOverwhelmed with nauseating rage, Beadith hit pause. She recalled one of Stationer’s most famous quotes: “Writing on space-time is worse than murder.”\nThe nausea passed, but the anger remained. Maybe this was just what she needed. She hit play.\nSomehow she was back on Mother-of-Pearl, at the upload facility with her father. The place resembled an old Earth bath house, but the steaming bath awaiting her father was a soup of nanotech. He looked old and frail in his thin med coverall.\nHe held her hands in his. “I love you,” he said.\nShe didn’t want him to upload, though she knew he’d be happier on the Ultimate Substrate. She felt petty, selfish, childish. She knew the science. Written onto space-time, he’d never again worry about the vicissitudes of matter-energy: biological aging, war, extinction events.\nThey would still be able to communicate, if he didn’t get lost in the custom-made universes slated to upload with him. And someday she’d probably join him. But a vague doubt still troubled her.\n“You’re young,” he said, squeezing her hands. “The danger of matter-hood still holds some romance for you.” Wistfully he added: “I remember that allure.”\n“But what about the Stationerites?”\n“The extremist group? Oh Beadith . . . ” Here came that condescending tone that always set on her edge. “They’ll never come to power.”\nHe hugged her, and she stiffly allowed it. She knew her share of history. As an analyst for Special Intelligence on Mother-of-Pearl, she’d witnessed plenty of what humans were capable of. She’d discovered no fundamental principle of the universe that would preclude a Stationerite coup.\nHe held her at arm’s length and said, “I have to go.”\nThe upload process would destroy his physical self. She wanted to drag him out of here, rendition him and make him see sense. At the same time, she felt irrational and silly. People had been uploading onto space-time for centuries. There were billions on the Ultimate Substrate. Uploading was a venerable institution. If you were a person of some means, and you’d experienced all that matter-hood had to offer, you uploaded.\n“I love you,” he repeated.\n“I love you too dad.”\nAs she said this, a new doubt vexed her. Never mind upload and Stationerites. She looked around the facility, wiped her hand on the damp tile wall.\n“I don’t understand,” she said. “Why are we going through this again? It hurt enough the first time.”\n“It’s a dream, Beadith.” His eyes were kind and sad.\nShe remembered crippling bereavement, an island, sickening rage. She remembered the moss. Maybe this was a moss simulation. Maybe the moss had returned her to this critical juncture of her life, to see what she would do armed with knowledge of the future.\n“No Beadith,” her father said. “It’s just a normal dream.”\nHe turned and stepped into the bath. She wanted to stop him, but she was rooted where she stood, her limbs heavy with the dream-paralysis that all humans know.\nThe next morning, she gripped Stationer’s shoulders and shook him out of a fitful doze. His cheek wounds were healing. In their rough bilateral symmetry they resembled tribal scars.\n“Admit it,” she said.\nHe struggled to focus on her. “What?”\n“You did it for ego. You did it to be part of history. You didn’t know for sure that writing on space-time is bad for the universe. You still don’t. Nobody does!”\nHe was fully awake now, but not answering. She slapped him. “Admit it!” she said.\n“There’s evidence . . . for potential subversion of the vacuum, and causality.”\n“I know that, and I know there’s evidence against it. I don’t give a fuck about physics at the moment. What I give many fucks about is the five-hundred billion.” She drew her sidearm, let him see her dial it down to a vaguely surgical setting, and put it between his legs. “I already know why you did it. I just want to hear you say it.” Her finger was on the trigger, but she didn’t know if she could squeeze it. Could the moss tell her that?\n“It felt good,” he confessed. Tears poured down along his cheek scars. “There really were times when I believed my scientists, but yes, I liked it. I liked being important. I loved it, god help me.” He bowed his head. “I would’ve continued with my plan even if definitive evidence against space-time damage had emerged. I know this about myself, thanks to the moss.”\nShe stood up and holstered her weapon. She wondered what she would’ve done if he hadn’t come clean. She wondered what she might’ve done to Uungest on Baroque Pearl, if the memory assay hadn’t worked.\nShe wondered if she would eventually kill the monster kneeling at her feet.\nThat night her dream, if you could call it that, was again third-person, so she knew she’d given in. She’d interfaced with the moss again.\nShe watched her simulated self bend down to get in Uungest’s face. The Stationerite was tied to a chair in some dim cargo hold, looking terrified. A few other agents stood in the background, outside the pool of light. It was all very 21st century.\n“Where is Kiniod Stationer?” sim-Beadith said.\n“Please,” Uungest sobbed. “Just assay me!”\n“Were you a quantum informationist for the Stationerite regime?”\n“Yes,” he said.\nSim-Beadith poised her archaeologist’s pick over the man’s left kneecap. “Were you with him at the end of the war? I mean in the bunker, on Aleutia . . . ”\n“Yes.”\n“Veracity’s good so far,” said a man in the shadows. The memory assay had failed, but the agents could still detect lies. The dream-logic of the moss allowed that much.\n“Did he tell you where he was going?” sim-Beadith said.\n“No . . . ”\n“Lie,” said the man at the veracity-scanner.\n“Where is he?” sim-Beadith demanded.\nUungest shut his eyes, grimacing.\nThe hammer came down with a sickening crunch. The man shrieked, and sim-Beadith stood there breathing sensuously, gripping the bloody pick.\n“Where is he?” she said.\nAs the torture progressed, spectator-Beadith became aware of other simulations running simultaneously. In some, beautiful strangers got her to betray faithful lovers. In others she abandoned friends and kin for immortality. In one she castrated an unrepentant Stationer. In another she found herself in his place, armed with hysteria based on questionable science, poised to rule solar systems. She went ahead and seized power, just as Stationer had.\nThis last revelation was more than she could stand.\nHow accurate were these copies of her? She wanted to believe they were imperfect, but deep down she felt her measure had been taken.\n“Will-o-the-wisp,” she said, “destroy all the moss on the island.”\nShe didn’t know if her drones were capable of this. They could hack information systems and fight biological infections. They could incapacitate, kill, and reproduce by consuming their surroundings. They could combine to form larger tools. They could protect their master with what was essentially a force field. Their talents were manifold.\nBut Beadith didn’t really understand the moss. She had no idea what would happen next.\nShe was awake, but still interfaced. This at least was new. She perceived the night-enclosed camp, lit by the printer hearth and the faerie ring around Stationer. Yet she was still aware of the simulations, most of which illustrated her frailty, egotism, and greed.\nThe faerie ring floated upward, expanding, dimming.\nThe Beadiths in the simulations began to doubt their surroundings. Some disentangled from their seducers, while others halted in the middle of Stationer-esque rally speeches or Tribunal interrogations, suddenly at a loss. The backgrounds of the simulations—bedrooms, black sites, the Grand Arcade on Mother-of-Pearl—were dissolving, leaving the Beadith copies in existential crises.\nIn the real world, the air grew enchanted with new faerie fires. Stationer woke up and looked around in alarm.\nBeadith’s interface with the moss was profound, her fool’s cap covering most of her head. Just as she’d been able to sense that her copies were high fidelity, now she could feel the moss struggling. As the drones hacked its genetics, the moss hacked back. There was destruction on both sides.\nMeanwhile the Beadith copies were communicating, theorizing. They came to understand their situation, and they were terrified.\nThe real Beadith stood up and ripped off her fool’s cap. She walked marveling through the carnival night, through auroras and ghost lights. Drones died by the billions, the air suffused with invisible genocide. Everywhere the moss was shriveling and dying. Some patches uprooted themselves, awakening from sessile years, quickened by desperation. They crawled ponderously like seafloor life. Beadith stepped lightly among them. A fascination grew upon her. She laughed with a sense of giddy detachment.\n“What have you done?” Stationer said.\nThey were on the beach, though Beadith didn’t remember walking here. She felt she was emerging from a fever dream. The island was a glowing psychedelic beacon in the night. Maybe the light of annihilation and work would attract rescuers.\n“You don’t need the moss,” she replied. “If you want to know how you’d behave in a given situation, just ask me. I bet I can guess.”\n“What did it show you?” She’d never seen him this bold, except on video. “Something you didn’t like?”\nBeadith drew her sidearm and aimed. “Shut up.”\n“What did you learn about yourself? I’m guessing it wasn’t pretty.”\n“If you’re not careful you’ll find out.”\nThe moss had shown her she was capable of genocide, but in those simulations she’d merely given the order. She hadn’t killed with her own hands. She hadn’t seen anyone killed. The death-tolls had been so high as to be abstract.\nShe didn’t know if she was capable of executing Stationer, here and now.\n“In killing the moss you’re killing the thousands stored within, you realize. Thousands of you and thousands of me.”\n“Suddenly you care about instance rights?”\n“Thousands of yourself,” he repeated. “Think about that! Call off your drones!”\nBeadith didn’t know if she could, or if she wanted to. It enraged her that Stationer had managed to plant a seed of doubt. She turned her back on him and said, “Will-o-the-wisp.”\nNo response.\n“Will-o-the-wisp!”\nHad she sacrificed her drones to an angry whim? She focused on this question. She focused on what life would be like here, living drone-less with Stationer. Better to contemplate this than what Stationer had said. Better to think about survival, and the tools of survival. Better to avoid the fact she’d proved her darkest moss-simulations correct. What did it matter that the copies—instances, souls—she’d murdered were thousands of herself and Stationer? They’d all been through simulations. They’d all diverged and become new individuals.\nBurdened with grim new self-knowledge, Beadith watched the moss vanish and the island darken.\n3\nShe hadn’t said the words in years. Not in real life, anyway, if this barren island was real. If she was real. After so long, the words given breath would pack a mythic weight, whether or not they accomplished their purpose.\nKiniod was beside her. She’d begun to find contentment sitting near him on the headland, watching the sunset, munching synthacado. She liked the companionable silence. But the words had bubbled up into her consciousness, seeming to demand her voice. And if they worked, she wanted Kiniod to see the result. So she broke their practiced quietude:\n“Will-o-the-wisp.”\nWas that a nanotechnological sheen on the waves below? No, just the usual sunset glamor. The air around her seemed to glow, briefly, but it was probably her imagination, or light reflected from the sea. “Will-o-the-wisp,” she said again, willing the conjuration to succeed.\nAll she conjured were memories of her godlike youth.\nShe’d aged with a vengeance since losing her drones. Five years had passed, and Kiniod was the same shivering mummy, gumming his synthocado—and she was withered, graying. She’d taken her drones for granted. They had not just surrounded her, but suffused her.\nKiniod cackled between irritating lip-smacks.\n“It amuses you how I’ve aged?” Beadith said. “Don’t forget I’ve still got my sidearm.”\n“Ha!”\n“Did I ever tell you how Uungest folded under torture?” They both knew she’d told the story many times. Beadith was no longer sure if it had actually happened. It might have been a moss simulation. Had the memory assay really failed? “You should’ve heard him squeal.”\n“I never liked him,” Kiniod said.\nShe drew her weapon and put it to his head. His hands went up. “I was enlightening you. We don’t interrupt when I’m enlightening, do we?”\n“No ma’am.”\nSlowly she withdrew the sidearm and holstered it. The moment seemed to have passed. She was beginning to relax again, and come to terms with her drones’ continued absence, when Kiniod said, “You’d be alone if you killed me.”\n“Is that supposed to scare me?” she said, drawing the sidearm again. “I was alone for years getting here.”\n“In stasis!”\n“I’m SpecInt trained. Don’t underestimate me, old man.” Her performance must have been convincing. Kiniod crawled away from her aimed weapon, got shakily to his feet, and made his way back along the headland. “I might kill you at any time!” she shouted after him. “Maybe tonight!” She watched him vanish and reappear among barren, moss-less rock formations.\nShe remembered a moss simulation—or perhaps a normal dream. She’d just landed on the island, and the shuttle was intact. Her vizcort worked just fine. She wasn’t stranded. Freed of this grim prospect, she killed Stationer without hesitation. She never sampled the moss and its revelations. She departed Igiugig, empty, but free.\nIt was getting dark, so she followed him back toward the camp. On her way, she watched for signs of life, anything other than the bones of the island. After the moss cataclysm, the armored worms, lung-ears, and other small fauna had quickly died out.\nKiniod crouched by the printer hearth, sipping his bedtime broth. She aimed her weapon at the back of his head. At times like this she tried to convince herself she held the moral high ground, and was qualified to deal out judgment. It never worked. A moral paradox constrained her, and she holstered the gun. The thousands she’d killed were copies of monsters—of herself and Kiniod. They were both mass murderers. Maybe those thousands had deserved death, but that meant she and Kiniod—the originals—also deserved to die. If she was going to kill him, she’d have to kill herself afterward. Which would be for the best, at any rate. Better than being alone.\n“I thought we had an understanding,” she said. “Keep your mouth shut unless prompted.”\nHe bowed his head, acquiescing. She holstered her weapon, unfired, yet again. How many times was it now? Kiniod crawled into the hut. Beadith heaved a sigh, then went in after him. She lay down behind him in their nest of printed fibers, and hugged him to her. This had been their arrangement for some time now, always with Kiniod as the little spoon, and they never spoke of it. If he ever brought it up in the cold light of day, she thought she might kill him.\n“I’m sorry,” she whispered.\n“Me too,” he said.\nTheir breathing synchronized, and sleep followed hard upon.\nBeadith woke to a paralyzing certainty: someone else was in the hut. It was still dark. A figure stood in the entrance, tall, somehow familiar. Beadith couldn’t move, couldn’t find breath for words.\nIt was her father.\nHe’d discovered her shameful intimacy with Kiniod Stationer. He’d found them entangled like lovers, like parent and child. She wanted to explain. She wanted to tell her father about years of isolation, about the plasticity of the human soul under duress. She wanted to promise she hadn’t forgiven Kiniod, and never would. She was just using him for comfort during the long desolate nights. She wanted to say, “I’ll kill him now, father. Just say the word.”\n“It doesn’t matter,” father said, “not to me, anyway. I’m dead.”\nShe was still curled up with Kiniod, still hugging him. The old man was asleep. She couldn’t let go of him. And she couldn’t beg her father’s forgiveness.\n“Wake up, Beadith. It’s time.”\nSuddenly she could breathe again, and a great weight lifted from her chest. She cried out and sat up. Her father was gone.\nThere was a great commotion of light and wind outside the hut. Camp detritus flew about, pelting the hut, which seemed ready to come apart in the sudden gale. The blinding light dimmed, and Beadith saw a large, familiar shape settling among the rocks.\nShe left Kiniod blinking and cowering in their nest. She walked out into the pre-dawn gloaming and approached the shuttle. She could see it wasn’t her original, but one freshly grown from her orbiter. She wondered if this was another dream. Perhaps she was a copy in a moss simulation. Perhaps she had been all along.\nNo Beadith, this is real. The voice was in her mind, familiar yet strange.\nAn entry ramp peeled away from the bottom of the shuttle. A warm, welcoming light poured out. Beadith could feel her vizcort was awake, sending and receiving data. But who was this voice? It didn’t sound like any of the orbiter AI’s templates.\nWe’re you, Beadith. You thought you killed us, but you were wrong.\nSomething new was happening in her brain. Her vizcort was not only awakening, but updating. She fell to her knees, clutching her skull as it filled with sparks of pain. The implant was growing tendrils, enhancing its interface with her.\nWe’re sorry. We no longer want to punish you. But this is necessary.\nIt seemed her head would burst, but suddenly the pain abated, and she could feel other Beadiths, a fraction of those she’d created by interfacing with the moss. They were reintegrating with her. Their memories became hers. Their triumphs and agonies mixed with her own.\nBeyond the confusion of moss-simulation memories, there was real experience.\nThe Beadiths thought they were doomed. As the multiverse inside the moss came apart, and they understood where they were—and what they were—there seemed to be no escape. The backdrops of their individual simulations melted away, and the Beadiths were revealed to each other. The kaleidoscope of Beadiths—deceivers, thieves, genocidal tyrants—were granted what seemed a revelation. None of it had been real. And now the simulator itself was breaking down.\nBut the final reckoning didn’t come.\nSuddenly the Beadiths were being transferred to a new substrate. They felt in their virtual bones the discrepancy between the old substrate and the new: the choppy, failing computation of the moss, and the smooth clean computation of the new substrate, whatever it was. The old dwindled as the new took up more and more of who they were. They ran as they uploaded, their continuity—or the illusion of it—preserved.\nThey were on a ship familiar to some of the Beadiths. Many didn’t recognize it because it had been edited from their memories for various moss simulations, but Beadiths who knew the vessel quickly shared the pertinent memories.\nThis was Beadith’s long range cutter, the one that had brought her to Igiugig. The Beadiths possessed this powerful machine, relegating its AI to the most basic functions. They were the ship now.\nAnd they were falling through a space-time flaw.\nIt resembled a computer-modeled wormhole, but it was amorphous and changing rather than spherical: a vast amoeba of space-time distortion.\n“The Aleutian scientists were right,” one of the Beadiths said. She had murdered billions in her simulation. “Stationer was right!”\nA few hundred similarly genocidal Beadiths used the ship’s sensors and expert systems to confirm this. The space-time flaw conformed precisely to Stationerite predictions.\n“Writing on space-time is bad for the universe,” another genocidal Beadith said, in wonderment.\n“Stationer was right to erase the five hundred billion,” a third said. “He was right to erase father.”\nA fourth proclaimed: “Those of us who did it in moss sims are vindicated!”\n“Debatable,” another Beadith said, “and rather academic just now.”\nA team of Beadiths had seized control of the ship, but too late. The flaw was all around them, seeming to distort the whole universe. One direction was as good as another. Navigation was meaningless inside the flaw.\nThousands of Beadiths allied against the Stationer-apologists, launching information war. The ship systems went haywire. A neutral faction of Beadiths managed to guard the sensors from collateral damage. These monkish Beadiths remained aloof, their eyes on the cosmos.\n“We’ve emerged,” one of them finally announced, her voice rising above the digital clamor of war. With hundreds dead on both sides, a truce was declared. The cutter was back in normal space, still in the Pearl system.\nBut nineteen years in the past.\nThe Beadith who’d first spoken against the Stationerite-apologists was the first to gather her wits. She didn’t try to process the fact that she’d just time-traveled. She took Stationerite science as demonstrated, and writing on space-time as a colossal mistake. This wasn’t hard. She no longer thought of herself as Beadith. The year was 2574. It was too late to prevent Stationer’s genocide anyway, so that ethical question was moot.\nShe was left with a deep resentment. She didn’t like what she’d gone through in her moss simulation. She had abandoned a devoted husband and three children for a second youth. Her original was responsible for that painful experience. The flesh-and-blood Beadith was responsible.\n“I have a proposal,” she said to her thousands of sisters.\nSome dissented on moral grounds. Others cited causality, and paradox, and fate. Many said something like this: “The fact that we exist means it will happen. That it’s already a feature of the timeline. Why trouble ourselves trying to bring it about? We’re here.”\nBut unlike most of her supporters, the abandoner didn’t care about ensuring her own existence. Her focus was entirely on the Original, the flesh-and-blood Beadith.\nSome of the abandoner’s supporters argued that since they existed, they were fated to carry out her plan. They had no choice in the matter. These Beadiths disavowed free will and called themselves agents of fate. Other supporters worried about the integrity of space-time after all the damage humanity had done to it. They saw her plan as a way of shoring up causality.\nHer plan narrowly won the ship. Some of the dissenters had to be erased, but most were content to underclock, sit back, and watch.\nFirst, they created the moss. The Beadiths had all been born in moss networks. They had experienced the revelation of the substrate’s demise. Much of the moss’ structure could be inferred from their own code. The rest they improvised, bringing their collective intellect to bear.\nA few hundred more Beadiths became dissenters at this point. These couldn’t stomach the work at hand: ensuring the moss’ ability to create high-fidelity, effectively perfect copies of someone’s mind. The Beadiths were bringing about their own authenticity. The new dissenters still identified too much with their original, with her slim hope that her copies’ sins didn’t reflect on her.\nThe dissenters couldn’t stop what was happening. The moss came to life in the ship’s assembler womb. Five years later it covered a tiny island on Igiugig.\nNext they traveled down-system and planted a fascination in Kiniod Stationer’s mind. The Beadiths knew their history. They were copies of an intelligence officer who had specialized in—and become obsessed with—Stationer. They had their pick of times and places to strike. Beadith had been an expert in memory assays, and had planted ideas in assets’ skulls more than once.\nThe microscopic drone entered Stationer’s brain via the optic nerve, on the famous morning his handlers smuggled him out of the capital on Aleutia. There were three vulnerable seconds as he passed between the immune systems of his hotel and shuttle. The drone integrated with his vizcort, grew tendrils, and conjured rumors of a strange island.\nA place where a man like Stationer might find illumination, or penance, or both.\nKey fragments of data about the moss went to a few specific archives: those the Beadiths remembered finding the data in. Drafting this information was easy. The Beadiths remembered reading it. No creativity was required to coin terms like ‘fool’s cap.’\nStationer mentioned the island to his man Uungest a few days later, right on cue. The Beadiths were listening. They marveled at causality, and their seemingly pre-ordained role in it. Some wondered how involved they had to get. A faction arose claiming their work on Aleutia was done. The ship could return to Igiugig, to watch and wait. But the abandoner and her loyalists had one last intervention planned.\nThe Tribunal’s attack on Stationer’s underground redoubt must fail. Stationer and Uungest had to live. They had to escape. This was too much for a growing number of Beadiths, and a new war erupted in the ship’s nervous system, even as physical war raged on Aleutia below.\nThe abandoner and her loyalists barely managed to deploy their intervention: a crippling hack of the Tribunal’s bunker-buster drones, which the original Beadith had helped program.\nThe ship returned to Igiugig and hid inside its moon. The Beadiths underclocked for the wait. They debated, and doubted, and wondered. Had they done enough? How much intervention was necessary? This question had sparked their second war and erased half of them, including the abandoner, who would never see the fruition of her plan. Several hundred Beadiths had committed suicide, unable to reconcile their Beadith-ness with the fact that they’d sabotaged the Tribunal’s raid, saving Stationer’s life.\nThe survivors, fatalists and fanatics, witnessed Stationer’s arrival. His small cutter self-destructed after he’d established himself on the island. His new home was suffused with the Beadiths’ eyes and ears. They communicated with their creator and creation, the moss. They watched Kiniod suffer through endless clarifications of what he was.\nThe original Beadith arrived right on schedule—in a ship identical to that inhabited by the watching Beadith copies. It was the same ship. It was an impossibility, this great paradox made flesh.\nIt settled into orbit, and birthed the doomed shuttle. The Beadiths carried out the last steps of the abandoner’s plan.\nTheir original was stranded.\nThey watched her reap what she would eventually sow. They watched her as she would eventually watch them. They found grim satisfaction in her tribulations. They watched her interface with the moss. They watched her watch young versions of themselves.\nA third and final war broke out among the Beadiths.\nMany wished to rescue their younger selves from torment, but the guardians of causality opposed them. These guardians were aided by a small group of Beadiths who felt their time in the moss, and their first-hand experience of its destruction, had somehow forged them into post-human angels.\nOnly twelve Beadiths survived this last conflict: nine space-time conservationists, and three angels. They rescued their younger selves at the fated time, transferring the data into the orbiting cutter, then guiding it into the space-time flaw that appeared, fleetingly, at Igiugig’s Lagrange point 2.\nThe Beadiths’ work was done. Causality, as they understood it, had been preserved. What remained was their original. She was withering away down there, as she learned to tolerate Kiniod, if not love him. She had changed. The Beadiths had changed. Nearly of one mind, they decided enough was enough.\nThey emerged from the moon, birthed a new shuttle, and copied themselves into it.\nBeadith lay shivering on cold stone. Kiniod emerged from the hut, squinted in the diffuse morning light, gawked idiotically at the shuttle. She hated when his mouth hung open like that, like a fucking ape’s. He looked at her and started to cry. Probably because she was crying. “Stop it,” she commanded, uselessly.\nShe stood up, fighting a wave of dizziness.\nHe said, “You’re leaving, aren’t you?”\nShe touched the warm hull of the shuttle. The machine had birthed from a cutter that was hers, and wasn’t. At her feet was an old, desiccated fool’s cap. She picked it up, and it disintegrated in her hand. The moss had given birth to itself, in a sense. Her head swam with this singular piece of intelligence. Too bad she was no longer in the business of discovering secrets.\nShe turned to face the old man. “Yes, I’m going.”\nThose other Beadiths were part of her now. Kiniod had tried to save space-time from a real threat. And he was a mass-murderer. Both of these things were so. And she knew, finally, that she would never kill him. “You can come with me,” she offered.\nHe squinted at her, at the shuttle. After some consideration he said, “No. This is where I belong.”\n“But you came for the moss . . . ”\n“I came here to suffer,” he said, “and believe it or not, your leaving will help with that.”\nShe wasn’t sure how that made her feel. She considered telling him he’d been right about space-time. Did he deserve that comfort? Would it even be a comfort, and if so would he want it? Perhaps, as a mass-murderer herself, she’d received such news. She couldn’t recall.\nInstead she ‘remembered’ the moss-experience of one of her newly-integrated sisters, who had been made to choose between herself and her father. A Stationerite Youth guard had put a gun to her head. They’d been in one of the access stations orbiting Mother-of-Pearl, within the unsettling curdled space-time near the access horizon. Many uploaded souls had come through here, but the Stationerites had reprogrammed it for erasure. A representation of Beadith’s father, as he’d been in corporeal life, watched her from the interface screen.\n“It’s okay honey,” he said, smiling gently. “Do it.”\n“Listen to him,” snarled the Youth guard.\nHer hand hesitated near the floating erase icon. Her father nodded, seemingly at peace. The Youth guard nudged her head with the gun. Beadith looked away from her father’s horribly understanding eyes, and with a swipe of her hand, she normalized the space-time quanta that had encoded him.\nLater this grim reality disintegrated. She hadn’t killed her father after all. None of it had been real. But that didn’t change the fact that she’d suffered through it.\nSo she went on to ensure that the moss made perfect copies of people. She worked to ensure that, eventually, her original would know beyond doubt that she was capable of patricide. Later still, she reintegrated with that self-damned original, and stood on a beach next to a freshly-grown shuttle.\nShe wondered if the moss would have humbled anyone it tested. If so, she could rest a bit easier—while accepting the general ignobility of humankind.\n“Goodbye Kiniod,” she said.\nHe prostrated himself before her, awed by the god-like being who had held death over his head for so long, and then withdrawn it. Who had taken away the moss, and given him something new. She knew what he was thinking. After so long together, she could read him like a direct download. She could indeed function as moss for him, as she’d boasted on that apocalyptic night long ago—except when it came to the news about space-time. She had no idea how he might react to that.\nShe turned and ascended the ramp.\nIt felt right to leave him with the dignity of one last secret. It was what she would want, in his position—she could say this with certainty because she knew herself very well. The news about space-time wasn’t hers to give. Whether or not he’d succeeded, Kiniod Stationer had tried to save the universe. If it wanted him to know, it would find its own way of telling him.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}