{"fingerprint": "GvL6PyqmW62uC9MD6p0xWc5Y+a0=", "sitename": "Clarkesworld Magazine", "title": "Generation Gap by Thoraiya Dyer", "author": "Thoraiya Dyer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dyer_02_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Generation Gap by Thoraiya Dyer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9990 words, novelette\n Generation Gap\n Finalist: 2020 Aurealis Award for Best Science Fiction NovellaFinalist: 2020 Aurealis Award for Best Fantasy Novella\n It’s not reaching my forever-height that frightens me.\n It’s the decisions I’ll have to make when I’m Tower.\n Did I stop growing at the right height? Is the timing right for the new generation?\n Am I doing what’s best for the family, or are we all going to die when the Kɜkaveə swarm up Greenhill with their oyster-shucking knives to cut the throats of our dogs?\n Being Child is easy.\n But as the current Tower keeps telling me, that’s not a good enough reason to stay Child. It has to be because my family, the Hapkui, needs me to be taller.\n I slouch beside the entrance to Greenhill, pulling on my wading boots. They’re made from foodbeast leather and even in the dim glow of the smallest moons, you can see where the annoying puppies have chewed the sinew stitching.\n Luckily, the pups are locked in the den and can’t betray me with their yipping.\n I’m sneaking out to meet my best friend, Feə, the Kɜkaveə Child.\n The Kɜkaveə might be the mortal enemies of the Hapkui, but their territory includes Oyster Flats.\n And, God’s Eye in Her Head, I cannot resist oysters.\n All I want to do is eat oysters and forget about childhood maybe being over.\n Feə will understand. She’s the same age as me. I know because when I was eight years old, and my digging claws were slow to grow, Tower took me to see the grave of her favorite dog, Mouther.\n Tower told me the story of Mouther.\n Tower, who never talks to me, or at least not kindly.\n Mouther, Tower said, had been a smart, loyal dog who was strict with the foodbeasts. But on the morning of my birth, while the whole family had been busy in the birthing room, some of the foodbeasts escaped from their pens. They trespassed on Kɜkaveə land.\n Mouther and the other dogs tried to herd the foodbeasts back to Greenhill, but the Kɜkaveə killed both dogs and foodbeasts. They threw the dogs’ corpses over the border, but kept the meat from the beasts. That’s why I had a slow start in life. That’s why my claws were yet to grow.\n Tower admitted the Kɜkaveə were being paranoid and overprotective because their new Child was due, too.\n I wondered if the Kɜkaveə Child had her claws yet. I wanted to see what she looked like. In my imagination, she was doglike, with fangs and hair. I didn’t have wading boots, then, so I ran barefoot through the razor grass at the edge of the swamp and cut my soles to shreds. Before I could find the entrance to any tunnels, she found me swearing and crying in the fork of a tree, trying to keep flies from sucking my blood.\n Feə had been shocked to see my hairless face and lack of fangs.\n We looked almost identical.\n After that first meeting, Feə asked her Tower careful questions about what other families looked like. I didn’t dare ask mine. She relayed to me that in the cities, people give birth to litters, like dogs and foodbeasts. Not like in the territories, where Tower gives birth to Child, Child gives birth to new Child, old Child becomes Tower, and so on.\n Feə said both of our lineages had come from the Foothill City, Kashwhɜr.\n If we went there, she whispered, we might discover we were both the same family, once.\n Her digging claws had grown in, though, and mine hadn’t.\n They looked funny, Feə’s huge Tower-sized claws on her tiny Child hands. So, instead of feeling jealous, I laughed cruelly at them. She threw mud at me. Then, when the mud went in my eye and I cried, she washed it out with stinging, salty water. She brought me oysters to eat and sent me back to the border before our families found out we’d spoken.\n Now I’m twelve. I’ve got big hands to match my big claws, and my boots have foodbeast hooves glued onto the bottom so if anyone sees the prints, they won’t know it was me.\n It wasn’t me, stealing the puppy with one black ear to show Feə.\n It wasn’t Feə, stealing oysters for me.\n It wasn’t me, eavesdropping on the Kɜkaveə Storyteller, drinking in her words, imagining the crowded streets of Kashwhɜr and memorizing stolen rhymes.\n It wasn’t Feə, ruining my furs with her mud flinging, convincing me against my better judgment to learn to swim, showing me how much easier it was to float in saltwater than fresh.\n Running, imagining the taste of oysters, I almost crash into Ancient, who squats with her skirts up at the edge of Greenhill’s manure pit. Her white hair shines in the moonlight and she grunts like a birthing foodbeast.\n Will I grunt like that, when I give birth?\n Ancient gave birth more years ago than I can count. Once you have your Child, you can’t have another, and you can’t grow any taller. Ancient probably can’t even remember what giving birth was like. Everything seems harder when you’re Ancient, poop included.\n I hide behind a bush until she finishes her squat. She wanders, skirts still gathered, to the path of the spring where its waters flow down Greenhill. I stay silent until she’s finished slapping cold water at her bum. I wait until she lets her skirts fall and starts her slow amble back up the slope.\n There’s no need to ask if I’ll look like that when I’m Ancient. Feə might be almost identical to me, but my ancestors and I are completely identical. By the time I’m Ancient, my name will be forgotten, just as this Ancient’s name is forgotten. The family’s Child will know me only as Ancient.\n Feə calls me by my name.\n “Wipwai,” she says gloomily from the shadow of the meeting tree. “Look at this.”\n It’s too dark. “Feə,” I say, “all I see are silver puddles.”\n She steps out, standing side-on to me, and her shape is all wrong. Instead of going straight down from her chest to her feet, there’s a bulge.\n “What is that? Are you sick?”\n “It’s a belly.” She tugs at my layers of fur and leather. “You have one, too.”\n It’s colder on Greenhill than at Oyster Flats, and the Hapkui wear foodbeast skins as a mark of wealth and pride. Not like the Kɜkaveə, who wear strings of pearls and cockleshells. I was taught this was nakedness and ignorance, before Feə insisted it was fearlessness and invulnerability.\n Even before she finishes stripping me down, I feel the queasy realization that my balance has been off for weeks because of this thickening. Wearing only my boots, I stand self conscious in the mud in the moonlight with razor grass all around.\n “Foodbeasts get bellies,” I say, on the verge of tears. “Dogs get bellies. Are we Towers already? Did we choose without knowing? Why doesn’t my Tower have a belly?”\n “Because she gave birth to you,” Feə says. “My Tower doesn’t have one either. It just means we can be Towers if we want, Wipwai. After we give birth, our bellies go away.”\n “I want it to go away right now,” I say fiercely, but I haven’t thought it through. Before I can, Feə grips my palms and says, beaming,\n “Yes, I am going to stop growing, too. It’s the best thing for my family. We don’t need to be tall. There’s no foodbeast herd to protect, no predators to watch for, only oysters.”\n “Oysters,” I repeat forlornly. I need them. I came here to forget my responsibilities but she’s talking too fast.\n “Oysters don’t run away,” she continues. “The Kɜkaveə don’t need long legs, we just need as many hands as possible, on account of our lands being so large. Fitting ten generations into a lifetime makes more sense for us than five, and this way you and I will rule as Towers together, we can speak openly—”\n “I’m not ready to be Tower,” I interrupt, pulling my hands away from hers. “I’m still a Child!”\n My blood bounds.\n Children talking together is transgression enough. Towers talking together? Unheard of. And there’s no escaping the brutal facts.\n She’s the next Kɜkaveə Tower. The next ruler over my enemies.\n A Kɜkaveə Tower gave the command to kill Hapkui foodbeasts and dogs, the morning I was born. A Kɜkaveə Tower left us defenseless against predators on the day of our greatest vulnerability.\n Because a Tower births only once.\n A family has one Child.\n If Child dies, the lineage is ended. The survivors, or the victors if there are no survivors, send news to officials of Kashwhɜr. Those officials send a new family to care for the vacant territory.\n Feə looks confused.\n “But you just said—”\n “Feə, don’t you understand? Once we become Towers, we can’t talk anymore. Hapkui cut throats as punishment for betraying the family. They can’t cut the throat of their Child, that would be the lineage’s end, but they can kill a Tower for treason. Especially one who isn’t very good with a knife.”\n “Don’t be ashamed about not liking to bleed foodbeasts!” Feə exclaims.\n “I’m not ashamed!” I bleat, giving the lie to it.\n “But you should be,” comes a sinister whisper from the shadows.\n I recognize my Tower’s cold sibilance.\n “Run, Feə!” I shout, first, before remembering the Hapkui Tower has almost double Feə’s length in stride. “To the water, and swim!” Feə splashes into a wide pond, somewhere a few steps distant, my furs and leathers heaped behind her like shed skin left by a viper.\n Tower cannot swim.\n She cuts. She commands.\n I can’t let her kill my best friend, even though Feə’s death will become my aim, when I am Tower.\n Tower cuffs me and I fall in the razor grass.\n “Put your clothes on, fool,” she hisses. “You could have ended us!”\n My clammy tunic and cloak are on backward when Tower throws me over her shoulder and begins loping for home. She’s tireless. I lie limp and let the tears fall. I should have been more loyal to my family. I should have been more loyal to Feə. I should have eaten oysters, but now I’ll never get any.\n When we reach the border, Tower’s new favorite dogs, Biter and Fighter, fall in at her side.\n “The dogs stay with you, now and forever,” she commands. “If you try to leave Greenhill, they will bring you back, the same way they bring the foodbeasts back. Do you hear me, Child?”\n “Yes, Tower,” I snivel, even as I inwardly rebel. I’ll get good with a knife. So good, no mangy dogs will be able to stop me! Or, I’ll start growing a Child. Before the year’s out, I’ll become Tower, and Tower will become Worker, and I’ll boss her around, and make dogs guard her, too!\n But I don’t know how to train dogs.\n I’m not good with a knife.\n I’m Child, and my family needs me to be taller. They need me to be as tall as Tower, who was a threat to Feə.\n They need me to be taller than Feə.\n So she can never be a threat to me.\n Before the year’s out, Feə gives birth to Child, and becomes Tower.\n I know, because Tower and Worker unveil a secret dog pack Worker has been training to sniff out Feə and rip her to shreds. Our Worker can’t speak. She accidentally bit off her tongue in a Kɜkaveə attack when she was Child. But Worker survived, and the dogs will be her revenge.\n The dog pack pours out of the underground training ring, thirty strong. The smell of dog milk, moldy soil, and old blood follows. Worker must have butchered many, many foodbeasts to feed a pack this size.\n They are thin.\n Scarred.\n Hungry.\n “How can you be sure they’ll only savage Kɜkaveə’s Child?” Ancient asks nervously, kicking at any dogs that come too close to her.\n “Thirty dogs,” Tower says, cutting her eyes at me. “Thirty meetings between our disobedient Child and theirs before I had enough scent to be sure.”\n “These dogs will turn on us,” Ancient insists. It’s the role of the oldest in the family to always make the worst suggestion. To follow the darkest threads.\n “They’re beautiful,” says Sun, letting the dogs lick crumbs from her fingers. Second oldest, it’s her role to point out the positives. To brighten the home with optimism and warmth. “We should sell them at Prominence, before making them killers.”\n “I am sure,” Tower tells Ancient. “They won’t attack us.”\n She whistles to the dogs, then opens the door.\n One by one, tufted tails streaming behind them, the dogs vanish into darkness.\n Normally, I’m too afraid of Tower to question her to her face, but the thought of Feə and her Child being pulled to pieces by dogs is too terrible for me to stay silent.\n “Why do we have to kill each other?” I shout. “Why can’t we be friends?”\n “You don’t know why?” Sun asks gently as Tower looms over me, ready to strike.\n “No,” I answer Sun, cringing back from Tower. “If you kill Feə and her Child, Kɜkaveə lands will go to a new family. A new enemy. So what?”\n “It’s true a new family will come to Oyster Flats if the Kɜkaveə Child dies tonight,” Tower says. “But how do you think that new family will know where the borders are, between Greenhill and Oyster Flats?”\n “It’s on a map?” I guess.\n “There’s no map!” Tower snaps.\n “The borders move,” Sun says.\n “They move?” I repeat foolishly.\n “The borders will be where I say,” Tower commands, brandishing a handful of razor grass stained with blood. My blood, from the first time I ran through razor grass and ended up crying in the meeting tree. “The tree where you met our Kɜkaveə enemy used to be part of our lands, not theirs. Sweetgrass grew there, not razor grass, and foodbeasts grazed it. Dogs guarded it.”\n “Impossible,” I say, gaping. “You can’t even see that tree from Greenhill. That’s too large a country, impossible to protect!”\n I snap my teeth shut when I realize what I’m saying.\n “Exactly.” Now Tower holds something else. The skin of a puppy with one black ear. She throws it at my feet. “You can learn, after all. That’s good.”\n It’s the puppy I took to show Feə, who loves puppies. I don’t love puppies, but I know you shouldn’t kill them and skin them, just to have a scent to train your hunting dogs with. Hatred for Tower fills me, but I’m helpless.\n In the morning, only one of Worker’s thirty secret dogs comes back.\n It’s blue around the muzzle, and its mouth is full of foam and rotten fish.\n “Poison,” Sun whispers. “They anticipated this.”\n “You should’ve sent knives in intelligent hands instead of easily tricked teeth,” Ancient says.\n Tower stands tall, like a lightning-struck tree, throwing a long morning shadow over Greenhill, and says nothing. But I know what to say.\n “You can’t send five knives against ten.”\n The Kɜkaveə temporarily number eleven, if Feə’s Child is born safe.\n If Feə is the new Tower of the Kɜkaveə.\n And I’m ashamed, and relieved, to think of her, safe, outnumbering us.\n There’s a revolution in Kashwhɜr two years later, though I don’t know what that means.\n I hear about it in the Prominence marketplace, where families trade in the shade of awnings over pens for the foodbeasts and cages for the dogs. Other cages hold hens and hawks. Baskets hold oysters, fish, and eels. Gold changes hands, and foodbeasts are killed and cut on the spot, or pushed into wagons to be taken on the long road to Kashwhɜr, somewhere at the western horizon where tiny purple peaks meet the plain.\n Children aren’t allowed at Prominence on trade days. It’s too dangerous.\n But Tower’s dogs, Biter and Fighter, haven’t been trained to keep me away from the market. They only know to keep me away from Oyster Flat.\n I sit cross-legged under an overturned basket, peeping out the handle-holes, proud of my deviousness, until a person’s bottom sits on the basket, trapping me.\n God’s Eye in Her Head, it must be Tower. I’m in big trouble.\n But the legs dangling over the edge of the basket are too short. Tower’s muscular tree-legs would reach the ground and more.\n “Stop, Feə,” I hiss. “Get off my basket!”\n She doesn’t answer, and for a long, terrifying moment I think she has trapped me to put an end to my lineage. Tower was right. I’m a fool, and the final Hapkui to prove it.\n “Your dogs,” she hisses. “They’re so obvious!”\n “Why don’t you kill them?” I ask hopefully.\n “I should! They tried to kill me!”\n “Not these ones,” I say, but I’m cringing in shame. “I told them not to send the dogs, Feə, but I’m not Tower.”\n “I am.”\n “What’s it like?” I can’t be Tower yet, but maybe Feə has some good hints.\n “Hard work. There’s so much to learn, Wipwai. So many tiny details make a wall between me and what I have to know. I have to know the fresh water and the salt as intimately as if they’re family. I’m afraid my Instructor and my Storyteller will die before I learn all I need to be a good Tower.”\n I grimace where Feə can’t see. My family doesn’t have an Instructor, or a Storyteller. Those roles are a luxury a small family can’t afford.\n “Did your Instructor or your Storyteller tell you about the revolution?”\n “Oh, yes,” Feə gushes. “Can you believe it?”\n I hesitate.\n “I don’t understand it,” I say in a small voice. “What does it mean?”\n It’s Feə’s turn to hesitate.\n “It means we can’t attack other families,” she says at last. “Not until we know what the new rulers in Kashwhɜr are like. What if they aren’t like the old rulers? What if the rules have changed?”\n “What were the old rulers like?” I ask, but daylight abruptly streams through the holes in the basket.\n Feə is gone.\n Maybe she’s telling the truth because she wants me to know I’m safe from her.\n Maybe she wants me to let down my guard.\n I hate that she’s Tower.\n And I think of her Child, growing up alone on Oyster Flat, with no other Child to talk to. I pat my belly but it’s too soon. Yes, Feə is allowed to walk around Prominence, trading, without having to hide under a stupid basket. Yes, she has a Storyteller and an Instructor to teach her. But I can learn from my Sun and my Ancient, and I’ll do it before I become Tower, not after, so my decisions will be better than Feə’s.\n God’s Eye in Her Head, whether Feə is trying to trick me or not, I will know Greenhill, its spring, the foodbeasts, and the dogs as intimately as if they are family, and I will be prepared for whatever the Kɜkaveə are planning, revolution or not.\n Biter and Fighter almost tip the basket over. Any second now, I really will get caught by Tower.\n Dogs are so annoying.\n At the next trade day, I watch the muddy road from the bushes, but Feə doesn’t come. Oyster Flat is flooded. Later, Sun speculates that all hands are needed to dig drainage, to save homes. To save the Kɜkaveə Child.\n Ancient guesses the Child is on a boat, floating out in the salt, safe from Hapkui dogs, but not safe from swimmers.\n Tower murmurs that the Kɜkaveə Tower once foolishly taught the Hapkui Child to swim.\n But as much as Tower wants Feə’s lineage ended, she can’t risk me on such a mission, because I am still Child myself.\n I hope fervently that Feə and her Child aren’t drowned. Not just because I miss the taste of oysters. Feə’s Child will be too old to be friends with my Child, by the time my Child is born.\n Feə’s grandchild, though, will be just the right age.\n “Our people were diggers,” Tower says, “before they were farmers.”\n We stand, eye to eye, our naked feet bathed by frigid spring waters. The stream pops and squeaks down the rocks, carrying earth and ritual oils from my freshly washed head toward the sea.\n Carrying the news of my ceremony to the Kɜkaveə, if they only had the noses to scent it in the swamp. In the razor grass. On Oyster Flat.\n I can keep growing. Legends tell of childless giants, taller than trees.\n I can be taller than Tower, my nemesis. Though she says it’s time for me to leave childhood behind, this is the one thing she can’t command me to do.\n I’ve waited so long I’ve lost all urgency. Feə’s elevation to Tower is twelve years gone. Her survival of the floods a whole decade past. I haven’t seen Feə since the day she sat on my basket in the market.\n Sun’s my best friend, now, for her subtle kindnesses and her bright outlook despite seizing hips and aching teeth, but soon Ancient will die and Sun will become Ancient, forced to whisper poison and suggest horror by centuries of immutable tradition.\n This morning, my crown brushed the keystone of the entrance to the dog training tunnel. At its end, a dry moat of clay, caked with the blood of forgotten generations, surrounds an island of stone.\n I’ve been training the biggest, blackest, wildest dog of all. Not the kind that has progeny, but a kind of dead end to life called male. He was named Darkness by the Kashwhɜr miners who bred him.\n Tower couldn’t train Darkness. Neither whipping him nor starving him earned his respect. Tower doesn’t know how I tamed him, and I’ll never tell.\n The dog’s secret is he pines for oysters just as much as I do.\n I told Worker I needed oysters to train Darkness to kill the Kɜkaveə, so she traded for a string bag of them without telling Tower. The freshwater oysters were inferior in flavor and went rotten quickly, but Darkness liked them even better that way, and then we were friends. I’ve never whipped him.\n I’m not training him to kill Kɜkaveə. Nor am I training him to kill Biter and Fighter; those senile sentries died of old age years ago. He’s a miner’s dog, with claws almost as big as mine, bred to rescue their Workers when earthquakes collapse the tunnels around them.\n Darkness is trained to sniff out oyster beds. To dig them out, break them up, and bring them to me. The moment I’m Tower, I’ll let him loose, and my family will think he’s going to bring me back Kɜkaveə heads, and when he brings back a mouthful of oysters instead, I’ll laugh ’til I cry. They’ll be powerless to reprimand me, and I won’t share the oysters with anyone except my dog.\n I’m not as resigned to being responsible as I thought.\n That moment of transformation is coming.\n When I hit my head in the tunnel, disturbed soil rained on Mouther’s grave, exposing the rootlets of the ring of fruit trees lightly crowning Greenhill.\n Now the dirt’s washed away, dawn sunlight gilds the stream, and Tower lowers a heavy, eyeless stone helmet onto my head and shoulders.\n I can barely manage its weight. The darkness is terrifying. Soon, the air inside grows close and hot.\n “I’m dying!” I gasp, putting my claws to the edges of it, but Tower slaps my hands away.\n “We’ve all worn it,” Sun says, rubbing my back between my shoulder blades. “We all lived.”\n “Cast your mind back,” Tower says, “to a time when the trigger for the next generation was a Child too tall to fit in the tunnels. A bruised head and neck signaled the body to change. Bruises and stale air. Too many relatives crowded together, until they could barely breathe.”\n “My head does touch the roof of the tunnel,” I say. “Can’t we do it the old-fashioned way?”\n “This is quicker,” Tower says. I hear her footsteps splashing away, echoing inside the God-blinking helmet. I try to follow, but I’m scared I’ll fall face-first into the spring and be drowned by the life’s blood of my family’s lands.\n Sun takes my hand. Her breath is on my shoulder.\n “You’ve been a good Child, Wipwai,” she whispers, leading me from the stream one shaky step at a time. “You’ll be a better Tower than our last two. Listen carefully. When my own precious Child was born, I sacrificed a hundred foodbeasts to hire Kashwhɜr hands with knives to protect her from the Kɜkaveə. She grew up spoiled and pampered, and when her childhood ended, she blamed her own Child for usurping her. In a rage, she threw that Child into the tunnels with the dogs. She endangered the family, leaving her Child to suckle from bitches and fight for raw foodbeast offal.”\n My grip on Sun’s hand tightens. I’m shaking, and not from the weight of the cursed helmet. How can my trusted Sun be telling the truth about poor, silent Worker and cruel, cold Tower? I’d like to exclaim, or question, but to be heard I’d have to shout, and Tower might hear.\n “What could we do?” Sun continued. “She was Tower. Her commands were law. We could have killed her, but I’d squandered the family’s wealth on the guards and we would have been only four. Three, really, with a helpless newborn.” She sighed deeply. “More, I had to hide the pain in my hips, which meant I could hardly walk. I was Worker, and I could barely work. If my offspring knew, she would have ordered me killed, and then who would have done the work? And if we killed her, who would have been Tower? I couldn’t have walked to Prominence to trade. In the end, the jealous, neglectful mother had her tongue torn out by her own offspring, as soon as today’s Tower ascended. Now Worker’s half mad, and only takes pleasure in cutting foodbeast throats. Soon she’ll take my place as Sun, but how will she speak sweetness with no tongue? And it’s the Sun’s task to prepare food for the family.”\n My feet find the solid bank. I grope with my free hand toward the shade. The sunlight’s too hot. I want the coolness of the tunnels, with the horrible helmet cooking me in my own sweat. Or is it the truth of Worker’s silence making me sweat?\n “These words are a warning,” Sun whispers. “I haven’t spoken before, because it was my honorable task to surround you with light, but you were Child. You were safe. As Tower, you mustn’t trust her. But you must already know that. Why else send Worker to buy the oysters for you? You wanted to remind her what kind of hell-beast you were training. Darkness will slay your enemies, guard your sleep, and sniff your food for poison.”\n Darkness is no hell-beast and he’s terrible at guarding. He looks fearsome but he falls asleep as soon as he’s tired. All he can sniff for are oysters.\n I’m starting to think I should have followed Worker’s example and trained a pack of bloodthirsty killers, not a useless, dopey monster to feed my un-Hapkui-like appetites. Feə told me the revolution meant the families had to treat one another peacefully, and since then we had, but what would the new government care about families fighting within themselves?\n No rulers would object to a family’s Sun killing its Tower.\n That’s when I realize I can attack the Kɜkaveə Child, if I want to. Sun’s story about Worker leaving her Child to the dogs is key.\n All I’d have to do is make it seem like neglect from within the Kɜkaveə.\n Dogs couldn’t enter into the equation.\n Drowning, however, always threatens those who live between freshwater and salt.\n “How long do I have to wear the helmet?” I ask Sun, sprawling on my back on the hillside, giving up on finding the tunnels. If I cook to death, Tower will only have herself to blame.\n “You’ll feel it,” Sun says, her voice receding, “before sunset.”\n “Feel what?”\n There’s no answer.\n God’s Eye in Her Head.\n I wait a few hours before trying to get the helmet off, just for a break and maybe a sip of water, but Tower’s dog-whip cuts my hand. Like a dog, I yelp and desist.\n Then, before sunset, I feel it. Heaviness in my belly. Fluid building there, as if I’ve taken a thousand sips from the spring. Itchy thickness in my skin. Like it’s solidifying.\n I’m a stone statue, now.\n I’ll never get any taller.\n My bones hurt.\n All of them.\n I shed enough tears inside my stupid heavy helmet that they run down my neck. A soft cloth wipes them away.\n “That’s enough,” Sun murmurs. All together, they lift my helmet off. Tower, Worker, Sun, and Ancient. All my family, singing softly together, as they did when I entered this world from between Tower’s thighs. Worker can’t sing, but she hums.\n In the den beneath Greenhill, Darkness and the other dogs start howling.\n When Child is born, there’s no grunting.\n No effort.\n One evening, I’m standing by the fire, accepting a bowl of grilled foodbeast and spiced greens from Sun. Ancient sits on the floor, already eating, and Worker washes blood and dirt from her face over a bucket in the corner.\n In a split second, I feel something inside like a bubble bursting in a bath, and Child slides out of me onto the straw-covered floor, slick as a fresh fish.\n “God’s Eye in Her Head!” I shriek.\n Sun scoops up the Child and pops her in the serving bowl on top of the greens.\n “Blessings,” she says, laughing.\n “Wasn’t that supposed to be difficult?” I’m incredulous. All the stories about births I eavesdropped on in the Kɜkaveə tunnels spoke of blood and pain. Just like foodbeasts, who shudder and bellow. “Is there something wrong with her?”\n “There’s nothing wrong with her,” Sun coos, not even looking at me. “Small people struggle with birth. Not the Hapkui.”\n I take Child and marvel at everything in miniature. No hair, no teeth, and a head disproportionate to her arms and legs, yet Child is unmistakably me.\n She is us. Warmth surges up into my face. Giddiness follows.\n I am smitten.\n “She needs a name,” Sun says.\n “A foolish custom,” Tower says darkly, but I don’t think her eyes are really seeing Child; instead, perhaps, she sees the end of her reign. Now that Child’s arrived, all of us will move one link further along the chain.\n One step closer to death.\n Ancient will take her turn wearing the terrible helmet, and this time it really will kill. What must Ancient have thought while I wailed and flailed under the helmet? I take Child over to her.\n “Ancient,” I say, ashamed, “what is your name?”\n “My name is Nayr,” Ancient says, touching Child’s tiny mouth with a gnarled knuckle, careful to keep her cracked claw from the smooth new skin. Child’s eyes will not open for a month, but she squirms.\n “May I have your name for this Child?” I ask.\n “Yes, Wipwai. You may.”\n We all sing as Child suckles for the first time. Except for Worker, who hums. The song turns mournful while we lower the crushing stone helmet over Ancient’s head, shutting out the last light of her life.\n I had planned to send Darkness to fetch oysters for me, as my first act as Tower, but instead I command him to sit and stay beside the salad bowl where baby Nayr sleeps, sated.\n Worker watches the monstrous black dog warily.\n “I need to wash,” I say. “I’m going to the spring. Stay here with Nayr.”\n I leave the tunnels alone.\n The moons are as cold and distant as Tower.\n No. I am Tower.\n God’s Eye in Her Head, I am commander of the Hapkui.\n Pulling my boots on, panicked, I begin to run, birth fluid flecking away with every step. My stride is enormous, my boot prints impossibly far apart. Sweetgrass-covered hillside, stream and razor grass fly past in a blur of bleating foodbeasts, swaying stalks, silver ripples and moon shadow.\n I run for hours. I’m not tired.\n I’m faster than a dog. I’m as tall as Tower was, that day she tried to kill Feə.\n My boots leave wide-spaced prints, terrifying to the Kɜkaveə, if they could see them, across the pale sand of Oyster Flat.\n If my Child is born, so is the Child of Feə’s Child. Which means Feə is no longer Tower, but Worker, and in a household with plenty of extra hands to care for the newborn, Worker will have been tending the oysters since the low tide of early evening, when the small moons are in the sky but the biggest moon stays below the horizon.\n My long strides begin to sink into the moonlit silt of the Flat. I smell rotten seaweed beneath the freshness of an approaching storm. White crabs scuttle away as I come to a halt at the edge of the water.\n The smiling curve of a reed boat is anchored to a sandbar offshore. It’s too far for me to see the boat’s occupant. I make a pile of my furs on top of my boots, and slide, naked and shivering, into the stinging surf.\n My swimming stroke is longer than it was.\n I’m uncoordinated at first, and choke on the wavelets lapping at my face, but before long the rhythm returns to me.\n When I stand up on the cold sand of the bar, Feə flinches from her crouch behind the boat. She’s the same as she always was, except for the fresh oyster cuts on her hands.\n So tiny.\n Still a child.\n No. Only Worker must labor with the tides, ignoring such trivial matters as light and dark. Change is terrible and irresistible.\n “Wipwai?” she whispers, straightening with a small bronze hatchet in her hands. “Is it you? You’re a giant. From the stories.”\n “The tide’s so low,” I say, grinning. “I’ve never seen this part exposed. Are there many good ones?”\n Feə pulls a huge chunk of oysters out of the sand. They’re cemented together, the large living ones with the shells of the broken and dead. She hits the dead ones off with her hatchet and hands me the rest.\n “Congratulations,” she says, “on the birth of your Child.”\n I’m strong enough to break them open with my bare hands.\n God’s Eye in Her Head. Nothing has ever tasted so sweet.\n “I want them to be friends,” I say loudly, moved by passion to raise the oysters over Feə’s head, and she shrinks back slightly before she comprehends what I’ve said. “My Child, whom I have named Nayr, must befriend your grandchild, Feə. I don’t want my Child to be lonely, like I soon will be. Is it possible? Since I lost you, I’ve had my Sun to be my friend, but she becomes Ancient tonight and the new Sun is mute.”\n Feə sighs.\n “I’m not the Tower now, Wipwai. It’s for my Child, I mean the Kɜkaveə Tower, to decide.”\n “Did we ask our own Towers for permission, when we first met? Besides, I am Tower. I give permission to Nayr to have a friend. I give permission for your grandchild to have a puppy. You always liked dogs more than I did, Feə, but now I’ve got a digging dog called Darkness. He’d never harm a gnat, but he can find oysters. I want you to meet him at the next trade day.”\n She sighs again.\n “Help me get the oysters picked. You’ll be twice as fast as me. And Tower or not, the government’s mandated peace is holding. I’ll do as you ask. Listen, we met when we were eight. In eight years, let’s agree to bring our families’ respective Children to the tree.”\n She turns back to the task, but I hesitate.\n “What else, Feə? What else do I need to know, to keep Nayr safe from the world?”\n The lines deepen in Feə’s little face. Her eyes shine.\n They’re wise. Not a child’s eyes.\n “Be kind to her, Wipwai. Be gentle. For what use is keeping the world from breaking her if you break her yourself?”\n By the time I finish helping with the oysters, swim back to the shore, and run back to Greenhill, it’s almost sunrise.\n I discover I’m anxious about Child.\n Child is fine. Child is sleeping.\n But in my absence, mute Worker, who is now supposed to be Sun, has killed my dog, Darkness, and laid his corpse out for me like a carpet for my feet.\n “He was aggressive toward Child,” Tower explains indifferently. “Worker had no choice but to cut his throat. He was ill-trained.”\n I glance at the container where Nayr slumbers. There are no dog footprints in the dirt. I feel empty, as though Darkness was an ember in my chest, now grown cold.\n Ancient’s body, too, has grown cold.\n I hide my distress.\n The new Ancient, who was my friend Sun, crouches in a corner, pale-faced, saying nothing.\n “She’s not Worker anymore,” I say, pointing at the mad-eyed mute. “She’s Sun. You are Worker. Come with me now, both of you. I have work for you.”\n I lead the conspirators to the dog training tunnel, where the black stone stands in the middle of the dry moat.\n They can’t kill me yet. They need me to feed Child for six months at least. We don’t have any freshly whelped dog to give suckle. Only me.\n They can’t kill me at all, ever. I won’t let them.\n “I hoped you had gone to kill the Kɜkaveə Child,” newly-named Worker says, “but I should have known you would come back empty-handed.”\n “Peace,” I answer, abruptly furious. “The city insists on peace. It’s too late for killing. The borders are fixed.”\n “They are not fixed,” Worker shouts, but before she can argue more, I push her between the shoulder blades so she sprawls in the clay of the dry moat. The new power of being able to lay a hand on her surges through me, intoxicating. Is this why she bullied me for so long?\n I’m sobered by the idea that I, or anyone, might lay a hand on Child.\n Be gentle, Feə advised.\n “Dig through to the underground portion of the spring. You know where it lies. It’s close by. Isn’t that why our ancestors lined this room with clay?”\n Sun draws her lips back from her teeth, as though a dog’s spirit has possessed her.\n “The moat will flood,” Worker objects, crawling to her feet to face me. “We’ll never be able to train dogs here in secret again. Mouther’s grave will be flooded.”\n “I want the moat to flood,” I insist. “That is my command. Get started. I’m going to feed Child.”\n When I return, water from the spring enters the moat from the north. It’s shallow. Barely ankle deep.\n “Dig the outflow here,” I instruct, holding Child in the crook of my left elbow, marking the south cave wall with a slash of my right hand.\n “The moat will be deep,” Worker observes sourly. “The water will be over our heads.”\n Exactly.\n The black rock will be my safe sleeping place.\n Only I will be able to swim to it.\n “If it rains heavily,” Ancient grumbles from the tunnel entrance, “the water level might rise higher than expected. Our new Tower might drown in her sleep. Child must not sleep in this dangerous room.”\n I lock eyes with her, bereaved by this testing of her new role.\n The sun always sets, or so the Kɜkaveə Storyteller used to say.\n I force a smile.\n “Ancient is correct. Nayr will not sleep here. She’ll stay with you, Ancient. Guard our future well.”\n But the future never goes as planned.\n As Nayr approaches the final evening of her eighth year, our spring runs dry.\n There’s nothing so horrifying as water one day, nothing the next.\n At first, I assume it’s a plot by Worker and Sun, stopping up the inflow to see if I’ll notice the water level’s gone down.\n I notice.\n Everybody notices, with varying degrees of panic. Except for Child.\n Not wanting to look at the emptying moat, to think about what it means, I stride out of the tunnels and stand in the shade of the fruit trees on Greenhill, staring down the slope at the grazing foodbeasts and their long, odd, morning shadows.\n “Lift me up,” Child says, reaching for the trees. “I want fruit.”\n She loves fruit as much as I ever loved oysters. I lift her, one-handed, above my head, and ignore the twigs and leaves that rain down with her harvest. Her claws haven’t grown in yet, so there’s no risk of impaling the fuzzy globes. When I lower her to the grass, she sits with her legs in a circle, corralling the fruit as if they were foodbeasts that might stray. Watching her eat with messy relish is soothing.\n But not for long.\n “We have days at best,” Worker says crisply. “Our sweetgrass will die without water. New sweetgrass must be planted at the edge of the swamp to keep the foodbeasts alive. You cannot delay. The Kɜkaveə Child must die today.”\n Sometimes, I imagine the ghost of Sun speaking, before she became Ancient. I try to think of what positive thing she could possibly interject with in this instance.\n Perhaps she would have suggested carrying water from the river. It’s polluted with excrement from Kashwhɜr. Yet even if it were clean, how could four people with buckets carry enough to keep all our wide grasslands watered?\n Impossible.\n Foodbeasts can’t graze close to the river for fear of crocodiles. Crocodiles are the reason most Hapkui can’t swim.\n I taught Child to swim, in secret. In our moat. I counted the sunrises, anticipating the moment when Hapkui Child and Kɜkaveə Child would meet, and now God has blinked, the spring is dry, and I must have the Kɜkaveə razor grass fields at the edge of the swamp, or else Child will perish with the rest of us.\n “You’ve tried to kill me half a hundred times,” I say, not even looking at Worker. “You and Sun. You’ve both tried. I could have put you to death at any time, but I didn’t, because we’re too few. Four can’t survive if the Kɜkaveə have ten. Yet you’d have me plunge into their midst. One against ten, with no dogs, and only you two to protect Child should I fail.”\n “If you fail,” Worker snaps, “Child won’t need protection. Starvation will claim her!”\n “What about the peace?” I demand. “The Kɜkaveə haven’t attacked, even in reprisal, during my lifetime. It must be true, the ban on families feuding.”\n “And why should the Kɜkaveə feud? They have everything. We have nothing. Barely our own Greenhill, our own spring, and it’s dried up. God’s Eye is closed to us.”\n Sun stands there, saying nothing.\n There should be brightness, but there’s none, because Sun’s own Child ordered her tongue torn out.\n And here comes Ancient at last, a wooden staff in each hand, using them both to walk because her hips can’t hold her up. Dripping with blood and drool, because of her rotting teeth. If we had our old wealth, she could have gone to the city for a cure.\n “Ancient,” I ask desperately, “is there anything in our family stories about the spring running dry?”\n “Nothing,” she says. But how would she know? Our family has no Storyteller to carry its memories and myths. All we have is our terrible height, from which to see danger coming, but this danger was unforeseen. Ancient comes close to me, gripping my arm tightly, and Worker and Sun move away, because Ancient stinks, but her foul breath carries whispers. “You’re not safe, Wipwai. You’ll never be safe, and you can only eradicate the internal threat to your person after you have eradicated the external threat to Child, do you understand?”\n I understand.\n No cutting Sun’s throat until I’ve cut the throat of the Kɜkaveə Child.\n But I’ve always hated throat cutting. There must be another way.\n “I’ll go,” I say grimly.\n “To Prominence?” Worker insinuates I’m off to buy oysters. I resist the urge to cuff her. I don’t want Child to see family members hurting one another.\n “After dark, I’ll go. Pick these fruit and build a fire to dry them. Then cut as much of the grass as you can, to make hay for the foodbeasts while it’s still green. Then slaughter the oldest or most unfit of the foodbeasts. One in three.”\n “As you say, Tower.”\n Feə waits by the meeting tree with a Child achingly similar to mine.\n Although, the Kɜkaveə Child’s head is a little flat on one side.\n “It’s because of the long, crushing childbirth,” Feə explains. “You can bring your Child out of the shadows now. I’ve told Aiə the Hapkui Child’s name is Nayr, and that she doesn’t have horns. Or a tail.”\n I laugh, remembering.\n “Nayr has a round head,” I say. “Childbirth was easy. She just came out.”\n “Because you’re so big.”\n Aiə looks up at me, silent and wide-eyed.\n “Yes,” I say. “Because I’m big.”\n “There’s no way our Tower would have agreed to this, so I had to sneak Aiə out of the tunnels by an entrance I made when we were Children. Where’s Nayr? Is she terrified? What horrific stories have your family told her about the Kɜkaveə?”\n I sigh.\n “Feə, I haven’t brought Nayr. I have to talk to you.”\n Feə’s oyster-scarred hand twitches, as if she’d like to gather Aiə closer to her. Instead, she waits for me to speak again.\n “Listen. Has the Kɜkaveə Storyteller ever told any stories about the spring on Greenhill going dry? Your memories are longer than ours, I know. You’ve lived on Oyster Flat for much longer than we’ve lived in Greenhill.”\n I think, but don’t say: You lied, and told us where the false boundary is found.\n “Oh, Wipwai. God’s Eye in Her Head. Is your spring truly failing?”\n I can’t bear for her to pity me.\n “The stories, Feə,” I say impatiently. “Have you heard any stories?”\n “No.”\n All the air leaves my chest and I collapse against the tree.\n When my own family failed me, Feə always had the answers.\n Now I don’t know what to do.\n My claws sink into the soggy earth all around me. I clench my fingers, making fists of fertile soil.\n “I need this land then,” I say hoarsely. “I need it to plant sweetgrass. It’s the only way for our foodbeasts to survive.”\n One moment, Feə is by my side, soothingly tracing my brow. The next, she’s several steps back from me, and I hear the sound of the Child, Aiə, running through the razor grass and plunging into the same seeping freshwater pond that Feə used to escape from Tower, twenty years ago.\n “You can’t have it,” Feə says.\n “No?” I don’t understand why she’s sent Aiə fleeing to safety. I am not like Tower. I’m here to talk.\n “This swamp is a nursery for tiny fish,” Feə says. “The fish grow up to join the shoals in the sea that the Kɜkaveə catch to eat when there are no oysters. Don’t you remember the floods, my first year as Tower?”\n “I remember,” I say stupidly.\n “Without those fish, we wouldn’t have survived. We need this land.”\n “But we’ll starve, Feə.”\n “Better the Hapkui starve than the Kɜkaveə.” I can’t believe what I’m hearing. My childhood friend couldn’t have uttered such a thing. She shared oysters with me.\n “Is that right?” Somehow, I’m looking down at her. Looming. “You’re so tiny. How much food could you possibly need?”\n “You’re so big,” Feə says softly. “You eat so much. We can’t share our oysters with you anymore, Wipwai.”\n My pulse races, but my muscles feel hard. It’s as though I’m wearing the stone helmet all over again. This time, though, it’s not my skin turning to armor.\n It’s my heart.\n I can’t let my Child go hungry.\n And Feə taught me how to find oysters for myself.\n Water.\n I’m wet.\n I swim after the enemy Kɜkaveə, my stroke longer and more powerful.\n “Come back,” I shout. “I’m not here to hurt you. I’m here to talk.”\n But the Kɜkaveə Tower might be more inclined to listen if I’ve got their Child in hand. I can’t take Feə’s grandchild to Greenhill. I can’t trust our Sun and Worker not to cut her throat. They like throat cutting.\n But not me.\n I’d never do it.\n I have to hope the Kɜkaveə Tower doesn’t know that. We’ll strike a bargain between the two families. Child for food. Nobody has to die.\n But I’m standing on the muddy bottom of the pond and there’s no sign of the Child. How can I be angry at a Child for not knowing not to run? Nevertheless, I am.\n “Leave her!” Feə cries, launching herself from the razor grass shore. “She’s scared, she’s hiding under the water. She won’t surface while you’re standing there. Get out!”\n I feel around with my feet; there are fallen trees and branches on the floor of the pond. The Child must be clinging onto them. I begin clawing them out of the mud, until I feel other claws. Feə grabs and pulls at me, but she can’t move me; she can’t reach any higher than my arms, and her feet can’t touch the bottom; she has to tread water.\n “Come back to the shore,” she shouts.\n And I have no choice but to do as she says, bowing my head. What was I thinking? I wasn’t made to take hostages.\n It’s over.\n I’ve failed Nayr.\n I couldn’t stand to be like my mother, so I went to find her enemies, and although my friendship, my difference, the use of my very name, gave me my own identity, this isn’t a land where the lone giant survives against the smaller swarm of the tightly bound family.\n The Kɜkaveə, who have everything, will have Greenhill, too.\n “Peace,” I say bitterly, pulling my boots out of the suctioning mud and standing on the razor grass. “Peace has betrayed the Hapkui. My friendship with you has ended us.”\n Feə doesn’t even hear me.\n “Aiə, where are you? Aiə, come, now!”\n And then a small, limp form floats to the surface of the pond. I think: For a Kɜkaveə Child, she’s a poor swimmer. She isn’t moving.\n Then I’m aghast to realize she’s drowned.\n She stayed under the roots too long.\n Frightened to death.\n “No!” Feə screams, splashing back into the muck, rolling the body over, cradling it.\n The moons bathe the face of the dead Child in light.\n And my heart turns soft again, and breaks, because Aiə’s face is my Child’s face.\n “God’s Eye in Her Head,” I gasp.\n Feə cradles the beloved face in both hands.\n “Feə,” I shout across to her, “I didn’t kill her. It’s her own fault, for staying down too long.”\n “You’re a giant—”\n “I never touched—”\n “A monster!”\n “Am I a dog? Do I have fangs? Am I hairy—”\n “You’re the Hapkui Tower, Wipwai,” she cries. “If you hadn’t chased her, she would have lived. You can’t avoid responsibility for this. The government will know you’re a killer. I’ll tell them. Your family will lose their land. To conceal the crime, you’ll have to kill me as well. Go on!”\n Yes. I am Tower. My stride is long and I can run forever.\n But I can’t outrun this disaster. My land is worthless. I should have left it long ago, or else learned the lessons my family tried to teach me.\n “I can’t kill you.” Tower isn’t here, but she is here. She’s in me. Rebellion or no rebellion, the old Tower trained me, as surely as she trained Biter and Fighter. All the times she punished me for hesitating to kill, all those times I held foodbeasts over the butchering stone. Her shadow is over me, goading me, hating me.\n But even she couldn’t train me to kill my best friend.\n Even though my best friend has killed me.\n “No? Why not?” Feə cries and laughs. She looks at me and she looks at the moons. She sobs and curses.\n She pulls Aiə’s body into the razor grass and collapses over it, weeping.\n I can’t run. I can’t leave Nayr in the hands of Worker and Sun, for whatever time we have left before we starve, or the government representatives come. Even though it’s only hours since I left her, I ache to see her.\n What a terrible Tower I’ve been.\n It wasn’t reaching my forever-height that was the worst.\n It was second-guessing the decisions I’d have to make when I became Tower.\n Did I stop growing at the right height? Was the timing right for the new generation?\n Did I do what was best for the family, or are we all going to die when the government representatives come to banish us from Greenhill, to send us to slave or beg for food in Kashwhɜr?\n Perhaps no new family will come. Perhaps, without the spring, Greenhill is untenable as a family holding, and my beautiful, innocent Child will die in the mines when earthquakes collapse the tunnels around her.\n But I know one thing for sure. She won’t be killed by the Kɜkaveə, swarming up Greenhill with their oyster-shucking knives to cut the throats of our dogs.\n We have no dogs. The Kɜkaveə are no more. And, accident or not, it’s because of me.\n Both lineages are finished. Two moons will set.\n With hindsight, I could have stayed Child until I was tall enough for my fingertips to brush the stars.\n The moat isn’t deep enough to protect me anymore.\n So, on my return to Greenhill, I cut the throat of our tongueless Sun as she’s sleeping.\n She wakes, bleeds, shudders, but I don’t stay to see her die.\n I greet Worker, who stands guard deeper inside the tunnel system, outside the sleeping place of Ancient and Child. Worker smiles at the smell of copper death.\n Then I greet her a second time with a swift thrust of my bloody claws under her chin. She can’t form any words after that, and she dies slower than Sun did, striving to reach and murder me, but I step back easily.\n And again.\n I step back again.\n Eventually, her cruel strength bleeds out. Her opening and closing lips fall finally slack.\n “I killed the Kɜkaveə Child,” I tell her sprawled corpse.\n Triumph shines in her eyes even as the light leaves them.\n I don’t clean up, and I don’t wake Ancient. I’m too tired.\n I fall asleep beside Worker’s body, and if predators or the Kɜkaveə come after us, so be it.\n Ancient wakes me some time later.\n “Who will do the work, now?” she exclaims. “We need extra hands to carry water from the river.”\n “What work is there?” I ask. “The foodbeasts have hay and won’t need to be moved. The fruit is gathered. We eat. We wait to see if the water returns. And you’re free to say what you truly feel, hopeless or hopeful. You’re Sun and Ancient, now, as I am both Worker and Tower.”\n I go into the sleeping room and gather Child in my bloody arms. On my knees, I crawl with her out into the open. Though I’m wrung of feeling, a smile forms on my wretched face as sunrise paints her cheeks. When she wakes, she blinks rapidly and giggles.\n “Outside?” she asks. “Tower, you haven’t sneaked me outside since I was a baby.”\n I think of Feə sneaking the Kɜkaveə Child outside, and choke.\n “We live outside now,” I say. I’m not going back into Greenhill again. Let time and crumbling tunnels bury Sun and Worker where they fell.\n “What if it rains?” Child gathers herself, yawning, and sits cross-legged beside me.\n “If it rains, the Hapkui are saved,” I say, but it doesn’t rain.\n The sweetgrass dies.\n Flesh falls rapidly off the foodbeasts until a dog wouldn’t look at them twice. I slaughter the last of them and smoke the flesh.\n Yet my three-member family is genial and peaceful. I should have killed Sun and Worker years ago.\n Thirty-three days after the drowning of the Kɜkaveə Child, three government officials and thirteen soldiers arrive at Greenhill.\n Oblivious to their purpose, Nayr offers them dried fruit. She exclaims at the muscular soldiers’ filmy violet robes, feathered masks, and gilded boots.\n Ancient, propped on her paired sticks, proclaims the formal welcome from her raw, painful mouth. As Tower, I bow my head for the official’s spokesperson to pour bottled rainwater from Kashwhɜr on my crown. She doesn’t need to bend for me to pour stagnant spring water from Greenhill over hers.\n “Is Greenhill forfeit?” I hear myself ask, as coldly as my mother ever could, the formalities concluded.\n The hostilities opened.\n “No,” the official says, giving hope that is dashed in her next sentence. “Your Child is to go to the Kɜkaveə. To be adopted by them.”\n “Adopted?” I turn the word over between my teeth. “What is that?”\n “Their Child is dead. Yours will replace it. According to our archives, the Hapkui and the Kɜkaveə were sisters, once.”\n “Sisters?”\n “Forty generations ago, your forebears both belonged to a single Kashwhɜr family. The lineages are barely distinguishable to this day. Rather than call for your extinction, the Kɜkaveə Tower is willing to accept this compromise.”\n “No.” The word emerges unthinkingly. Ancient gasps. The official’s lips curl.\n Because I haven’t thought it through.\n “I see. You prefer your Child to be put to death also.”\n Thirteen soldiers slant thirteen gilded spears in unison.\n “No!” Ancient begs, crumpling before me. She who was my friend, my Sun, my only safe harbor, now begging, blubbering through her bloodied maw. “You must let them take Nayr to the Kɜkaveə. Wipwai, most wise and noble Tower, please, let her live.”\n Nayr starts crying, finally cognizant of what’s occurring.\n But of course she must go to Oyster Flat, the playground of my childhood. As Kɜkaveə Child, Nayr will have a Storyteller. An Instructor. A Worker who knows far too much of the Hapkui lineage. Feə will love Nayr as she loved Aiə.\n All the oysters she can eat.\n God’s Eye in Her Head.\n If no family comes to replace the Hapkui, Nayr will also have her own heritage. Greenhill. The fruit trees may survive, if enough of the spring’s stagnant seep remains to water them, and without foodbeasts to drink from it, it surely will.\n “Child, dry your eyes,” I say gently. “Go with these people. I’m not your Tower anymore. The Kɜkaveə Tower is your Tower. From this moment, you are the Kɜkaveə Child.”\n Nayr’s brow furrows in fury, deepening to hurt, and I turn away, taking first Ancient’s arm and then her weight across my shoulders, before I can see any more.\n “Put on your boots,” I call back over my shoulder. “They’ll protect your feet from the razor grass.”\n She won’t be Child for long. The Kɜkaveə are a short-statured family. Nayr will struggle to give birth. There’s nothing I can give her to equip her for that.\n “Come along, Ancient,” I murmur. “Without water, Greenhill might as well go to the Kɜkaveə. I’ll work in the mines, even though I’m too tall. It’s time for us to adventure to Kashwhɜr at last.”\n As one, we make our way down Greenhill. The sun, behind us, stretches our already-too-tall shadows, showing us the way.\n Thoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe."}