{"fingerprint": "5NyM9ELZ3jQSYpJJ19NYIF3omkA=", "sitename": "Clarkesworld Magazine", "title": "Human Strandings and the Role of the Xenobiologist by Thoraiya Dyer", "author": "Thoraiya Dyer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dyer_03_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Human Strandings and the Role of the Xenobiologist by Thoraiya Dyer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5340 words, short story\n Human Strandings and the Role of the Xenobiologist\n \n Very few comprehensive texts have been produced on the wider topic of human strandings. Earthlings Ashore: A Field Guide For Shuttle Crashes (2nd ed.) by Icareg and Yrubsnoul, and the relevant section of the University of Yendys’ Sound Wave Communication In Breathers, Proceedings 335 are probably the most useful.\n \n Kelly shrank from the rotten-egg smell and the falling ash.\n She tried to shelter in Mama’s shadow, trailing behind her family across the clanking steel walkway. The ash was the awfulest. She’d worn her best dress with shiny pink beads, and her pale pink tights, even though they hurt her bottom where Mama had hit her. Once they reached the office, she shook the dress frantically, trying to get the gray flecks off, trying to get the smell out. She stomped her glittery ballet flats on the dusty carpet, the shoes her mother had told her not to wear because they’d only get wrecked at the spaceport.\n Her head level with the desk top, she examined its electronic undersides while the grown-ups talked.\n “You’ve gotten yourself into some real trouble, haven’t you?” the fat man behind the desk said jovially to Kelly’s father. “I can help you, but I only help people once. You get in this deep again and you’re on your own.”\n Kelly’s father murmured something in reply but Kelly didn’t catch it. She thought she’d seen a mouse whisk behind the components and she bent to peer between the blinking LEDs in the hope of sighting its whiskery face.\n “Well, the freight costs will depend on weight.”\n “We’re not freight,” Mama said coldly.\n “Yes, you are, darling. Just these two kids? Let me have a look at them. And what do you want to be when you grow up, young man?”\n Kelly’s big brother, Chris, puffed up his chest.\n “Salvage pilot,” he said.\n The fat man leaned over the desk and smiled at Kelly. Immediately, she forgot about the mouse. The man had a handsome face and minty breath. Kelly bounced on her toes, waiting for the chance to tell him that she wanted to be a ballerina.\n “Hey, beautiful,” he said. “Have you got a boyfriend yet?”\n \n Our modest aim is to provide xenobiologists, particularly those less familiar with human anatomy and physiology, with a brief guide to diagnosis, treatment, sample-collection and follow-up for common stranding scenarios.\n \n Kelly listened to the scream of air being split by the fins and remembered how her mother had screamed at her father, in a fury, when he’d said that Kelly would have to be hidden in a shipment of HIV vaccine.\n She’ll freeze to death.\n She’ll be sleeping, love. Cryo temperature and viral storage temperatures are comparable. You heard what the man said.\n What he said. Why should he tell us the truth? He has our money, now. I don’t see why we can’t all stay together.\n You know why. Splitting us up reduces the risk of getting caught.\n Kelly’s teeth chattered, an echo of the crackling, rattling, defrosting Petri dishes in racks all around her. She gripped the mesh that trapped her in her open capsule. It was too hot. Something was wrong. She was supposed to stay sleeping until her mother woke her.\n “Mama,” she cried. Chris wanted to be a salvage pilot. He’d shown her hundreds of vids of gruesome crashes. She wasn’t supposed to crash. Mama had promised. The Unity would control and correct her ship’s path, steering her to Centauri station, not into a planet with air and heat and fire.\n She wanted to go back to sleep but tapping at the console did nothing.\n ERROR, the Unity told her.\n She pushed all of the buttons at once.\n ERROR. ERROR.\n Kelly screamed and clawed at the mesh. She was burning, cooking in her pee and sweat. She was a tadpole in a puddle being baked dry by the sun.\n Before she could cook to death, she crashed. Her body hit the mesh so hard that a crisscross of blood printed itself into her like grill patterns on chicken. Chunks of silver shell spun away into whiteness. Shattered Petri dishes and their dangerous, diseased contents rained down on her. The Unity console display that had been near her arm now hung near her face.\n BILATERAL TIBIAL FRACTURES, it said.\n Fresh snow fell through the mesh, onto Kelly’s face from a featureless sky.\n She struggled to stop crying long enough to breathe. Breathe. Breathe. There was air outside. The flakes were cool on her skin. She was alive but the white sky was turning to gray fuzz.\n Don’t suck in your stomach, her mother had instructed as they stood at the family’s beloved barre. It was worn smooth by generations of women’s hands. You won’t be able to breathe.\n Kelly poked her tummy out and giggled. Her mother tsked.\n First position.\n Easy, Kelly said, not quite daring to poke out her tongue. She put her heels together and toes out in opposite directions. She was six years old and so flexible she could cross her feet behind her head, if she wanted, but she got told off for doing it school because boys could see her underpants.\n Put your hand on your middle, like this. It should move when you breathe in and out. See? No, you’re breathing too shallow. Breathe in through your nose, then all the way out. Empty out more. More!\n Kelly made choking sounds.\n I am empty!\n Her mother pressed impatiently on her diaphragm. Too hard. It hurt.\n Now you’re empty. Now you can breathe in again.\n Breathe. Breathe. Breathe.\n \n Although single stranded humans are much more common, the prognosis for a human stranded alone is generally poor. Mass strandings require greater commitment and involvement.\n \n –Is it smashed like all the others?\n –Yes. But unlike the others, the computer survived. Jid, you won’t believe this. It has no artificial intelligence in it at all. The shuttle is just a metal body. Its brain is somewhere else; somewhere in space. No wonder they keep crashing here. It’s as if the entity that controlled this shuttle, that fired this human into space, didn’t care enough about where it landed to waste time growing an independent mind for the module.\n –Maybe it thought the human mind would suffice.\n –This is important. We have to send it back. This is a bungled migration. We have to warn the entity that without proper guidance these modules don’t constitute a successful genetic dispersal but, instead, deliver death.\n –How? By sending it in one of our own modules? Who will give up their birth-share of resources for a half-dead human?\n –I will.\n –Sil, you are still young. Consider that this may be a natural process. Maybe only the fittest specimens, the ones whose minds are capable of guiding a module, are intended to survive.\n –But I like this one. Look at its funny round head. Look how it angles its photoreceptors and auditory canals. It wants to understand us. It’s trying to understand.\n –It hasn’t receptors for the proper spectrum. It can’t differentiate us from the snow or the transport or the sky.\n –It can hear us, though. And it’s only got two legs. Like a—\n –Like a child. Yes, I know. Look, I want you to get back to the work that you are being paid to do. After you’ve done all that, if you clean the containment area out the back of the surgery, I’ll let you keep the human there until the snowstorm quiets down enough for a qualified assessor to get through.\n \n Inexperienced xenobiologists should be encouraged, once they have made an initial assessment of a stranded animal, to contact an experienced xenobiologist for advice on how to proceed.\n \n Kelly watched the whispering whiteness when she could; when she couldn’t stand it any longer, she closed her eyes and watched the branching red rivers in the skin of her eyelids.\n They were the only colorful things on this whole white world. She was the only colorful thing. As she lay in invisibly soft, comfortably warm whiteness, with whiteness covering her from the waist down, having traveled for days in invisible hands away from her crashed ship, she wished for the flickering ruby and emerald lights under the man’s desk at the spaceport. She wished for her mother’s melted chocolate eyes and her pet kitten’s amber stare. Even Chris’s calculating blue ones would have been welcome.\n Months might have passed, or years. She slept and woke. Often, invisible hands put white stuff in her mouth that she chewed and swallowed. Sometimes, she reached around her invisible bed until she touched coldness, and ate snow. If she pooped or peed, she didn’t know it. She couldn’t feel her legs.\n Sometimes, she cried.\n One time, when she’d been crying inconsolably, the invisible hands brought her the console display from the ship.\n UNABLE TO CONNECT TO UNITY, it said. RETRY?\n Kelly picked it up and threw it as hard as she could at the whiteness. The invisible hands didn’t bring it to her again.\n \n Most local agencies have stranding policies and procedures. These can contribute to a more rapid and benevolent outcome.\n \n –It’s frightened.\n –Of course it’s frightened. It can’t see you and you’re stuffing it inside one of our modules; for all it knows, that is a burial chamber and you’re putting it inside to die. I should never have let you convince me not to call the assessor.\n –I’m not putting it inside to die. I’m returning it to its point of origin.\n –Oh, that’s what you’re doing! Hurry up, and do it, then, before I change my mind about covering for you. I could be expelled from my aggregate if anybody finds out.\n –It’s much heavier since we rescued it. Twice as long. It holds twice as much water and organic stone as it did before.\n –My research findings, if you had bothered to assimilate them, show that time is experienced differently by these short-lived creatures. It has simply reached maturity while in captivity.\n –Jid, look! I plugged the computer into our module to get the coordinates of the point of origin, and it’s connecting to the brain that controlled its original flight! This is great! I can communicate directly with the artificial intelligence. I can tell it about—\n –I’m not sure that is a good—\n –UNITY ADVISES. THIS HUMAN CANNOT RETURN TO EARTH.\n –What? Why not? We healed her body. We removed all traces of the virus. She is safe to reintroduce into the wild.\n –UNITY ADVISES. HUMANS CANNOT BE REINTRODUCED TO ANY SOCIETY GREATER THAN 300 YEARS DISTANT TO THE BIRTH SOCIETY.\n –What kind of monster do you think I am?\n –UNITY ADVISES. UNKNOWN. POTENTIAL TRANSLATION ERROR: MONSTER.\n –I am not sending her to a hostile future version of her home. I’m sending her home.\n –UPLOADED FLIGHT PLAN INDICATES EARTH ON ARRIVAL WILL BE 1337 YEARS DISTANT TO EARTH AT DEPARTURE.\n –That’s only if she travels at the maximum speed of the original module, which was less than the speed of light. In this module, our module, she will exceed the speed of light and arrive simultaneous to her departure. See?\n –UNITY ADVISES. TIME PARADOX DISTRESSING TO HUMAN PSYCHE.\n –So I’ll set it to, what, a distance, as you call it, of ten earth years? That’s about how long she’s been here, so there won’t be any incongruity, right?\n –Don’t waste time arguing with that thing, Sil. You’ve got the coordinates. Disconnect it.\n –No, Jid, it’s interesting! If this version of the intelligence has been traveling so slowly that—\n –UNITY ADVISES. AT LIGHT SPEED, MASS IS INFINITE. INFINITE ENERGY IS REQUIRED TO MOVE INFINITE MASS.\n –She will have no mass outside the Higgs field. Please, stop deleting the flight plan. Stop deleting those other things; what are you doing? I’m trying to send the information you need to stop your shuttles from crashing here. The beings that gave you life are being killed. Don’t you care about that?\n –Sil. Sil. Sil! I’m going to be missed at work. You’re never going to convince it of things that aren’t in its database, and who can blame an AI for that? If you don’t unplug it right now, I’m going to leave you here to do a two-person launch by yourself.\n \n It is the xenobiologist’s moral imperative to relieve the distress of animals but in attempts to relieve distress it must not inadvertently be perpetuated.\n \n Kelly woke, too early, for a second time.\n At first, she thought she was reliving the cooking-alive nightmare, but then she saw the whiteness. It was the alien ship that was white, not the human ship, and there were no Petri dishes.\n There was no mesh, either. She was cushioned in the white unknown she’d grown to hate and fear, but it was melting; it was turning gray.\n For a second time, she was burning.\n Then, black-gloved human hands were pulling her from half-submerged wreckage. She saw a sky that was blue, not white. She saw a face, and moving lips, and bleeding scratches on the face.\n She had made the scratches.\n She knew that face.\n “Kelly?” it said with disbelief. Chris’s calculating blue eyes were unmistakable. His voice was deeper and his head was shaved. His fluorescent orange SALVO helmet, which should have been on his head, was in his other hand.\n She couldn’t apologize for the scratches. She’d forgotten how to speak.\n “She’s wild, like an animal,” one of the other men said. The black silhouettes of burned trees made a stick-forest around the edge of a small lake. A six-man, orange-suited salvage crew looked on. Their boots made wavy imprints in deep ash. Kelly fought the urge to shake her dress clean.\n “Shut up,” Chris exclaimed. “I know her.”\n A second man whistled. “That’s no animal. That’s the most perfect woman I’ve ever seen.”\n “Let me get to know her,” a third man suggested. “Share and share alike.”\n “We should ditch her,” said a nervous-sounding fourth. “We’re not supposed to bring back no bitch. Just the alien shit.”\n “She’s a present from the aliens. A pretty present for us. Like a peace offering.”\n “They won’t be sending no more of those, then, will they? Not after we shot this one out of the sky!”\n “Shut up,” Chris said again. He felt her for broken bones. She realized she had sensation in her body again, but the body was unfamiliar; she felt like she was dressed in her mother’s clothes, except that she wasn’t wearing any clothes. “She’s my sister, got it?”\n “Hell, Jamie,” said the man who had called her a wild animal. “You don’t have a sister.”\n Chris made a growling sound in his throat, pulled something that looked like a sewing needle out of his pocket and plunged it into Kelly’s thigh muscle. She whimpered and jerked her too-long legs.\n “Ask Unity if we share DNA,” he said to his team-mate, defiant. “Ask Unity if we’re brother and sister.”\n The man’s eyes unfocused for a fraction of second. His ugly expression went slack. When he spoke again, his voice was soft; apologetic.\n “Like you said, Jamie. She’s your sister. I’m asking no questions about her. Why don’t you put her in the cab while we grunts tag and bag all the bits of this busted-up beast that we can find.”\n Chris, or Jamie, or whatever he was called now, tried to lift her carefully in his skinny arms, but after a couple of staggering steps, it was obvious she was too heavy for him. He put her down in the ash, bent over her and tucked back a lock of her long hair. It was white; it had turned white while she was on the white planet. His scored cheeks were so thin. His eyes were sunken.\n How come you haven’t had enough to eat, Chris? she wanted to ask him sadly, but the words wouldn’t come.\n “Kelly,” he whispered. “What happened? I thought you made it to Centauri station with Mom and Dad. I thought I was the only one that got caught before the ship even took off. Did you get captured by those aliens? What did they do to you?”\n She shook her head. Tried to put her hand to her mouth, to tell him that she couldn’t speak, but her hands trembled and there was blood under her fingernails.\n “Never mind. You can tell Unity. There’s a port in the cab of the flier. You know?”\n Kelly shook her head again.\n “Kelly, it’s so good. We don’t have to talk to Unity now, we can just think things and Unity understands. And if we want to see something, or learn something, Unity puts it straight in our heads for us. For a price. I’ve got a bit of money saved from salvage work. I’ll buy you everything that’s happened in the last ten years. Then you’ll understand. Then you’ll see that you don’t have to be scared. Things are better now.”\n This time, he slung her over his shoulder before he resumed his unsteady stumble towards a helicopter-looking thing with stubby wings and four rotors. The place where it had landed wasn’t burned. Green grass and yellow buttercups were crushed beneath its skids.\n Kelly wanted to touch them, badly. But Chris was putting her in a seat and lowering a blue goldfish-bowl over her head.\n “Just relax,” he said. “Everything will go white for a second. Then you’ll go into transfer mode. It’ll seem like days or weeks go by, but it’ll only be a few seconds. I’ll port up, too, from the pilot’s seat.”\n She didn’t want everything to go white. She didn’t want time to speed up or slow down. Kelly’s nails scrabbled frantically, at the goldfish-bowl this time, but she couldn’t get it off.\n Then she was back on the white planet.\n ERROR, said the Unity console, beside her in the crashed ship. Snowflakes fell through the mesh onto her face.\n Breathe. Breathe. Breathe.\n \n The release of an off-world animal back into its habitat must always be in the interests of the animal and the world. The animal must have re-attained its former faculty to compete, survive and reproduce.\n \n Kelly paced while the Unity Therapist looked on, hands clasped patiently.\n “Why do we have to go in and out? It’s the whiteness I can’t stand, the plugging in or unplugging. Why can’t I live fully in the flesh world or fully in Unity’s virtual world?”\n The wallpaper was bright yellow and green. Bright colors reassured her.\n “We carry out the motions of life in the flesh world,” the Unity Therapist said. It did not get bored with repeating the same things to her. Kelly could pick up the chair she was supposed to be sitting in and smash it over the thing’s head, and all it would do was ask her how she felt. “We work in the virtual world. Everybody must work, if they want their flesh body maintained.”\n “My brother doesn’t work in the virtual world. I want a job like his job.”\n “Jamie works off-grid. There are no jobs for women out there. It is too dangerous. Too physically demanding.”\n “I used to dance,” Kelly said petulantly.\n The Unity Therapist spread its hands silently; eloquently. The office was gone, replaced by a gleaming ebony floor, high ceilings painted cherry red, mirrors and a virtual woman in a black leotard that smiled at Kelly with a tenderness her mother had rarely shown.\n “So dance. You can begin where you left off, as a six-year-old child, or you can own the great grace and skill of your grandmother at the height of her career.”\n Kelly’s grandmother was dead. Her surviving family had refused permission for an assemblage—an approximation of the dead person based on digital records—to be generated. Kelly’s mother was officially a Missing Person. Miscreants who had fled the Unity could not legally be recreated as assemblages.\n “It’s not real grace and skill,” Kelly said, wringing her hands. “None of this is real. You’re not real. My own body doesn’t even feel real to me. I want to see Jamie.”\n She had to brace herself for the disconnect. Every time she broke away from Unity, she thought she’d woken from a dream and was back on the white planet. Every time, she cried, curled up in her port chair, for a full five minutes, until the darkness of her maintenance cell soothed her.\n The cells were underground. They were ventilated. Water and food were delivered via a chute. A narrow bed and a port chair were the only furniture. The shower cubicle had a pull-out toilet seat built into its wall. Nothing encouraged excursions into the flesh world.\n Law enforcement could not promise to protect anyone who left the safety of their assigned cell.\n Kelly didn’t care. She’d never seen another human soul in this part of the complex. The corridors were narrow and dimly lit. She had painted the walls for three hundred meters between her cell and her brother’s, and nobody had stopped her. Possibly nobody had even noticed the twirling pink ribbons, rainbows or splotched poppies running in garish acrylic over their doors.\n She put her hand on the wall as she walked. It was rough. It was real. She had the keys to Jamie’s cell. All she had to do was push the door-needle into her shoulder to confirm her identity by blood analysis, and the door, emblazoned with a bright purple flier, slid open.\n Jamie’s daughter, Minnie, was in her chair, her eyes closed, lost in Unity. Kelly didn’t try to wake her. She walked over to her and stroked her hair, as Jamie had stroked her hair when he’d first found her.\n Minnie was six, the same age that Kelly had been when she was separated from her family. Jamie had gotten his older girlfriend pregnant while he was still a teenager, while it was still legal to have flesh babies.\n The girlfriend had not wanted to care for a newborn in the flesh world. Jamie, who was accustomed to the horrors of piss and shit, vomit and mess that could not be cleared away with a thought, had agreed to take Minnie to live with him.\n “I could teach you to dance,” Kelly said, knowing that Minnie couldn’t hear her. “We could dance, out here in the real world.”\n But Minnie’s limbs were thin. Jamie bought her enough quality calories for her to grow optimally and he made her do the mandatory exercises, but there was no joy of movement evident in the girl. She would stay in Unity, always, if she could.\n Jamie arrived home from work smelling of crushed clover and machine oil. He held up his hand, forestalling her, as her mouth opened. He always wanted to have a shower, first. The walls of the cubicle were transparent, but he was careless about what she or Minnie saw.\n When he was clean, and his filthy orange suit had been squashed into the laundry chute, he sat down, cross-legged, on the concrete floor, since she was in his port-chair, looked up at her and nodded for her to go on.\n “I don’t ever want to go into Unity again.”\n “That’s what you said last time.”\n “There’s no point in being there. Nobody that I talk to, there, wants to meet in real life. They think it’s disgusting. I’m so lonely. I wish I had a daughter like Minnie.”\n Jamie shrugged.\n “Those Body-Only people, that’s what they say, too, but it’s not all they make it out to be. Since she turned five and ported in, she hasn’t asked me a single question. She doesn’t want to know what I think about anything. Her friends show her how to hack the learning programs so she can get information she shouldn’t have, yet. She’s not like a kid. She’s a miniature big person.”\n “People have kids and don’t let them port, ever,” Kelly said in a rush. “People have kids off-grid.”\n Jamie raised an eyebrow.\n “Women get raped off-grid, is what you mean. I’ve seen skeletons of off-grid mothers with the skeletons of their unborn babies mixed in, like. You want to end up like that? You would have, if I hadn’t been the one to find you. Why do you think Mom and Dad went to the station instead of the wild?”\n “That’s if they ever made it there,” Kelly whispered, the blood draining from her face. “If they did, do you think they had more children, when we never arrived?”\n “I dunno.” He rubbed his face with both hands. “Look, Kelly, I’m sorry I’m not in Unity often enough for us to hang out. I’m sorry Minnie doesn’t drag her sorry miniature self out of that chair any more than she absolutely has to. If you want a daughter, you should have a virtual one, you know?”\n She shook her head immediately, but he held up his hand again.\n “I don’t mean a virtual kid, a copy of someone. I mean like what the Scandinavians do. Unity mixes your genome with the father’s genome, and you get the randomized result, same as if sperm was mixing with eggs. You don’t get to argue and you don’t get to change anything. You just raise what you get.”\n “But it’s not real, Jamie.”\n “Of course it’s real. It’s a real artificial intelligence that never existed before. Unity models the interaction between genes and environment. It’s exactly the same as if you had a kid in the flesh world, except it doesn’t need air, or water, or food, or any of those things that we’re so short of.”\n Kelly looked at his starved, hollow face. She thought of how fat she had been on her return from the white world. The aliens had not been short of resources.\n “Who would the father be?”\n He looked embarrassed. “Me, I guess.”\n She recoiled. “You?”\n “It’s not taboo any more, brothers and sisters. How could it be? No real children are being born. No real children are getting inbred. What does a Unity kid care about being infertile or getting cancer? You can patch that shit. At least, you could, if you ever went to work.”\n \n Wildlife may be damaged in ways we cannot detect. The xenobiologist may screen for pathogens and other physical defects, but accurate assessment of human mental capacity is currently unavailable.\n \n –Did you assimilate this morning?\n –Jid, it’s not my fault.\n –Did you?\n –How was I supposed to know they would send a colony ship?\n –They interrogated our module with that crude AI of theirs. Instead of staying away from us, instead of improving their shuttles and avoiding our planet, they are coming to live here. Feed a human and it loses its fear. Then it becomes aggressive. You know this.\n –I suppose there’s only one thing I can do to make amends. I’ll go personally to the human planet and remove knowledge of us from that crude AI of theirs, after the module with the girl in it lands on the planet but before the colony ship is launched.\n –How can you do that, Sil? You have nothing.\n –Exactly. So why stay here? I could send you back reports. Observe them in the wild. You could buy me another module. You’re old and you don’t even want offspring. If that colony ship gets here, the others will find out exactly what we did.\n –Maybe it’s time to confess.\n –Please, Jid. Let me go. I can fix this.\n \n Decisions to rescue and treat humans in an emergency setting must be based on sound biodiversity and system health principles yet take into account animal welfare and the emotions of local onlookers.\n \n Kelly stared hollowly at the child she had thought she wanted, through the mirror that was actually one-way glass, in the ballet school that Unity had virtually built for her.\n As the other children had departed, hand in virtual hand with their parents, none of those parents had called their costumed children beautiful or their mastery well-earned.\n Beauty was cheap, here. Anybody could be beautiful. Anyone could buy mastery.\n Thank you, the parents had said instead. My child had fun.\n Fun. They did not bother to judge her choreography on its originality. The forms of the dancers were irrelevant to onlookers who had not paid for the right information downloads to appreciate the art form, who had other sights to see more individually tailored to their tastes. The new dances she had created were fun, or they were not fun. If a child could not perform the dances, they waited for their free upgrade and made something that once only looked effortless, truly effortless.\n Hey beautiful, the handsome man in the office at the spaceport had said.\n The great grace, the Unity Therapist had said reverently, and skill of your grandmother at the height of her career.\n Now you’re empty, her mother had said. Now you can breathe in again.\n The second man had whistled. That’s no animal. That’s the most perfect woman I’ve ever seen.\n Kelly was beautiful, for real. Nobody knew that, here. She couldn’t stay. She had to go somewhere where the things that she had, her beauty and her ability to endure the unendurable—two lonely, pitiful things of value—were readily observable. She had to go where her grande allegros would shake the core of a solid structure, where her pirouettes would shift the station, ever so slightly, in space. She had to go where she could be broken, in order to prove that they could not break her.\n Take those shoes off at once, Mama had ordered, her nostrils flaring, or I’ll whip your backside.\n She had been whipped, but she had worn the shoes anyway, and hidden her bruises under her pale pink tights.\n Kelly Junior ran up to the glass. He breathed on it, a great hot huff that made it fog up, right before drawing a love-heart shape in it.\n “Hi, Mum!” he shouted. He was six years old. “I know you’re watching me. I’m having so much fun!”\n That fact was never in dispute. He had never been hungry, except when he’d been hungry for her embrace; he had never been tired or bored. It would have been impossible for Kelly to whip him, when he could so easily mute pain. His fat little hands felt their way along the barre with silent awe, knowing that it was a replica in Unity of the one Kelly’s grandmother had left to her descendants. But no matter how often he touched it; banged it; swung from it, howling, pretending to be a monkey, it could not change.\n Kelly traced her full cheeks, her padded arms and thighs. In the maintenance cell, in the flesh world, she was as thin, now, as Minnie had ever been. She had hoarded enough food to pay bribes to the next generation of men who waited in offices at understaffed spaceports.\n She would take the next ship to Centauri station. She would leave her happy child behind. Jamie wouldn’t need to take care of him. The Unity would do that. And if he was unhappy, if he missed her, what of it? He looked beautiful, he looked like hers and Jamie’s child, but he wasn’t.\n He could never understand her, or the ghosts of women who stood behind her.\n \n Human mass-strandings are rare, but they do occur. When human colony ship (see ref p. 107) of unknown manufacture (mass measured at 0.93 x 10^9 moles of iron) crashed during the Great Seasonal Solidification at Center-Facing, several hundred animals might have frozen before they were found, if not for the fortuitous coincidence of Professor E. Jid (see ref p.55) being present in the field taking star-images with assistant X. Sil.\n \n \n Professor and assistant, between them, were able to place all surviving animals in zoological parks. The ship’s computer was never found and the circumstances that led to this stranding remain a puzzle to eminent xenobiologists in the field today.\n \n Thoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe."}