{"fingerprint": "hOeaj+sS//ZFeqlE5MK+ACAb/fA=", "sitename": "Clarkesworld Magazine", "title": "The Wisdom of Ants by Thoraiya Dyer", "author": "Thoraiya Dyer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/dyer_12_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Wisdom of Ants by Thoraiya Dyer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5970 words, short story\n The Wisdom of Ants\n Winner: 2013 Ditmar Award for Best Short StoryWinner: 2012 Aurealis Award for Best YA Short Story\n The sound of something flailing in the soft sludge distracted me and my bare foot slipped on the thin, bowed branch.\n The branch cracked. I fell.\n As I plunged shoulder-deep into fetid sink-silt, I had time to think, I’m not fit to take Mother’s place, before the arboreal ant’s nest I’d been reaching for dropped after me, cracking open on my upturned face.\n The copper and iron in the dilly bags at my waist dragged me down, deeper than I could have gone down alone. I clenched everything, crying silently, bearing the pain of the bites without opening my eyes or mouth until the silt closed over my head and the ants began drowning.\n I could hold my breath longer than they could.\n Eventually, with stale air burning in my lungs, I reached overhead, breaking the surface of the tidal flat while my scissoring legs created a water-filled space, reducing the suction. My fingers found the arched stilt-roots of the mangrove tree I’d been climbing and I pulled myself slowly, laboriously out of the muck.\n There was a thin layer of briny water on top of the silt. My arm and back muscles burned, but I skimmed some water for washing my face, which was already beginning to swell.\n The bites didn’t burn as badly as my pride.\n Everybody will see them!\n Mother would see, and I didn’t even have the prize to show for it. The ants’ nest, made of mangrove leaves cemented with larval silk, with its core of precious gold metal, was now lost in the mud. Only floating leaves and gold-ant corpses were left behind. At least my bag belt had held; at least I hadn’t lost the whole day’s forage.\n Nosey, the yellow hunting dog who had found the nest for me, whined softly from his seat on a stilt platform of mangrove roots and flotsam. The sunset behind him gave him a florescent pink aura.\n “Sorry, Nosey,” I said quietly. His reward was usually chunks of ant larvae and the salty-sweet jelly that surrounded the metal core. “Did you hear that sound, though?”\n Nosey tilted his long face to one side. He had a blind eye and worn-down teeth. His hearing wasn’t that great, but his nose still worked.\n The sound had come from downwind.\n I hugged a tree trunk and, trying to make up for my earlier impatience, expanded my awareness. Sharks wouldn’t come into the mangroves, risking entrapment and death. Nor would crocodiles, unable to navigate the maze of aerial roots. If the wallowing animal was one of the Island People coming to trade, they had missed the beach camp by about two kilometers and I hadn’t heard the distinctive whirr of their heli.\n If it was wireminds, perhaps my noisy fall had frightened them away.\n I shivered.\n If it was wireminds, perhaps they killed all the Island People, and there will be no trade, no whirring heli, ever again.\n Once again, I berated myself: Mother would never think that way. It was probably an eagle taking a fish! The Island People are due in four days.\n The Island People.\n We called them Balanda, once. Five hundred years ago they stole our land. Two hundred years ago, they gave it back. Except for Shark Island, which they said was strategic and necessary for them to protect us from the wireminds that lived across the sea.\n Ten years ago, though, when the wireminds invaded from the other direction, the Island People were helpless to stop them. All of our initiated men gathered up their explosive-tipped spears and returning EMP boomerangs and went to fight.\n None of the men came back. Not my father and not my mother’s brother. I was one of the oldest children and I remember the weeping.\n The wireminds temporarily won for themselves what they thought was isolated territory, free of the modified, metal-mining ants that had ravaged the rest of the world. They saw us and thought we were proof. Little did they know we had been living with the ants for decades, that we were skilled in keeping our few precious electronic devices safe from them.\n Ants ate the wiremind shelters, their vehicles, exoskeletons and communications devices. They ate their wristwatches. Their boot buckles. When the soldiers lay down to sleep, they were woken by ants trying to bore through their skulls to get at the metal implants inside.\n Cut off from their commanders, they were too afraid of us to ask for help. Or perhaps they thought they had killed us all. They starved, died of exposure or poisoned themselves unknowingly with the flesh of native animals.\n For our land and seas were polluted with pesticides that had failed to stop the relentless march of the ants. Every animal that survived had adapted by sequestering or becoming resistant to the toxins. We could only eat the animals ourselves because of the vials of gut bacteria constantly supplied to us by the Island People in exchange for metallic gold, silver, copper and iron. The island that they had kept was their only refuge, their southern heartland destroyed, fallen into lawlessness.\n Just as I was about to give up and return to the beach camp, I heard the noise again from the direction of open water.\n With my hand, I gave Nosey the signal to circle behind prey; he went away silently, paddy paws light on the stilt-roots.\n Camouflaged by my coating of mud, I went in a straight line toward the source of the sound.\n It was a tall, skinny woman dragging a pair of pressurized gas tanks behind her. A pair of flippers were abandoned far behind her, where it seemed they’d become a liability in the mud, but she persisted with the bulky metal cylinders, though she must have known they would attract ants.\n She was pale, not from breeding, I thought, but from being kept in the dark. Her head was shaved. A square electronic device was strapped to her chest over the top of a soggy, sack-like smock. Bra straps stuck out over her shoulders. Her exposed arms were covered in fresh insect bites. Older bites on her legs were turned to weeping, mud-smeared sores.\n “This is Clan territory,” I said, and she jolted feverishly as though ants had already started eating her bra wire. “Are you lost?”\n I saw Nosey cut off her retreat to the ocean, sniffing interestedly at her flippers.\n “I got to find Rivers-of-Milk,” she gasped, naming the one who was birth mother to me and spiritual mother to the Clan.\n “I am Quiet-One,” I said.\n “You’re her daughter, then.”\n “You know me? What else do you know about us?”\n She laughed crazily.\n “I know you have vials of bacteria. I know that you trade for them. My name is Muhsina. They sterilized my gut as punishment. If you don’t help me, I’ll die.”\n Fires flickered on the beach.\n Rivers-of-Milk stood with her hunting dog, Bloodmuzzle, beneath the safe tree, where dilly bags of metals were hung like sparkling fruit.\n Each time we moved camp, a tree was chosen that harbored nests of fierce, meat-eating green ants. Green ants could not prevail over the metal-mining ants for more than a season; they had monstrous, crushing, acid-oozing mandibles, but their numbers were too small.\n Still, it was only a few days until the trade tide, and then our small guardians would no longer be needed. Children caught crickets and cicadas and pinned them to the bark of high branches to keep the green ants moving up and down the trunk, hyper-alert for intruders from any rival nest.\n Nosey ran straight over to Bloodmuzzle and started licking his shit-caked anus. Bloodmuzzle did the same to Nosey. Dogs were disgusting. The shaved-headed woman, Muhsina, shadowed me. I’d helped tie her tanks to a mangrove tree and submerge them so that ants wouldn’t get them.\n Mother accepted my mud-stinking bags. She didn’t mention my stung face. Her encouraging smile was the same whether I brought great chunks of metal or none at all, but eating me inside was the drive to deliver, just once, more metal than she had gathered herself.\n To prove myself.\n Skink’s mother, Brushfire, felt no need to be encouraging. The plump little woman leaned over to peer at the bags—her eyesight was failing—and cackled,\n “Not even enough for a full vial, girl. You want us hungry. You want to be Rivers-of-Milk yourself. Ha ha ha!”\n Skink would be my husband when he became an initiated man. He hid behind his mother’s legs now, a twelve year old boy with long eyelashes.\n Skink and I had no need to drink the vials of bacteria. The Island People said that sometimes, with children, the intestinal environment was suitable for the bacteria to breed by themselves.\n Whatever that meant.\n The point was, if we didn’t have metals to trade, it would be the adults who starved to death.\n I felt conscious of Muhsina close by me. She had not said whether she would require a single vial in order to survive, or repeated doses.\n The cooking smells were distracting and had to be making Muhsina’s mouth water. Poison toad, poison croc and poison barracuda; they roasted on long spits over the fires, but Muhsina could not eat, not without first drinking a vial, and only my mother could grant one to her.\n “What is your story, Island Woman?” Rivers-of-Milk asked, beckoning to Muhsina.\n Muhsina’s exhausted, shambling shape moved around me, to sit at my mother’s feet in supplication.\n “My name is Muhsina,” she said. “They said I was crazy, but I’m not crazy. People scare me sometimes, that’s what. Lots of people all in one place, breathing on me like wasp stings. All those women in the same room as me, sleeping, sucking up my oxygen, I had to kill them. It’s better out here.”\n “Of course it is,” my mother said without blinking. “Why did you take so long to come?”\n “Cause I’ll die, that’s what. After I killed those others, they put in a stomach tube and flushed me out with antibiotics. Left me in hospital to starve to death, but after I’d been starving for a while, I could fit through the bars. Didn’t think of that, did they? Stole the thing that the net-divers use, the thing that makes the electrical signature of the mother of all sharks. Kept me safe as far as the mainland.”\n “You asked for me by name.”\n “I heard them talking about you. Said you hid in the bushes and watched while all those metalminds starved, because you had no mercy for them not of your own kind.”\n “The metalminds killed our men.”\n “And I killed Island People, and you’ve got a treaty with them. Are you gonna let me starve? Because to me, Rivers-of-Milk is the name of a woman who feeds starving people.”\n Rivers-of-Milk put her hand on Bloodmuzzle’s head, smoothing one silken ear.\n “This dog serves the Clan and I feed him. How will you serve, Muhsina?”\n “Information,” Muhsina said with a glint in her eye. “And then I’ll be gone. Over the mountains and west. You’ll never see me again. You’ll never need to worry if I’ll bring harm to your young ones, because I’ll be gone away forever.”\n “Give her a vial,” Rivers-of-Milk said to Skink, who scrambled immediately up the tree to fetch one.\n And because we had saved her, Muhsina told us everything she knew, in the firelight, as we ate poison toad, poison croc and poison barramundi.\n She told us more than we wanted to know about what the Island People had done with all of the metals we had given them.\n In the morning, I helped my mother prepare for the ceremony.\n Muhsina was already gone and my mind was with spinning with all that she had said.\n While Rivers-of-Milk made the sweet sugar-cane water intended to fill the drinker with the wisdom of birds, I ground drowned green ants between two rocks to make the citrus-acid water that filled the drinker with the wisdom of ants. Brushfire beat a malleable golden ant-core into the shape of a metal flame, fixing it in place of a spear-tip on a long, hardwood haft, and Skink prepared strips of dried turtle and shark meat, saying the words over them so they would give the eater the wisdom of reptiles and the wisdom of fish, respectively.\n “How can it be true,” I blurted at last, “that the Island People can manufacture a great wave, a great flood, such as the one Muhsina described?”\n “It is a great stupidity,” my mother said angrily. “Their machine will drown all of us but it will not drown the ants. Water will cover us but it will not cover the high mountains. The ants will come back, worse than before. Do they not know that mountain ants eat through living flesh to reach the minerals in bones? That they build their nests around white, bony cores? If the Island People kill the gold ants and the silver ants and the copper ants, the bone ants will come.”\n “The madwoman lied to us,” Brushfire scoffed. “There will be no wave. If the Island People are so clever why do they need to wait for the wet season before unleashing this great wave? Why not do it now? We need do nothing, Freshwater.”\n Freshwater was my mother’s name before she became leader. Before she became Rivers-of-Milk. Brushfire shouldn’t have called her that.\n “I must ask for guidance,” was all my mother said.\n “Let me help you with that, mother,” I said, wanting to show her that I paid attention, that I remembered how to make the bird drink. I took the rest of the cane from her.\n “You look too ugly for my son,” Brushfire said to me. “Your face tells me that you have the wisdom of ants already!”\n “The pelican is my sister,” I said, naming my spirit animal, thinking furiously: It will be the wisdom of birds that we need. The pelican flies far inland to nest. We should go far inland, where the wave will not reach us.\n We should go where Muhsina went. Over the mountains and west.\n When night fell, fifty-seven warm bodies gathered around the fire.\n Fifty-seven members of my great family began to sing, tossing dried coconut palm fronds into the flame to feed it.\n I stared across at my mother, imagining I was her. When Skink became a man and I became his wife, all of my mother’s tasks would become mine.\n Her chin was lifted. Eyes lidded. Hands outstretched. She was our protector. She was our mother.\n I was so hypnotized by her that I didn’t even see the golden flame fall. Didn’t know which direction it had shown to her until her lips moved.\n “What we need is the wisdom of ants,” she said, lifting the wooden bowl full of the elixir I had prepared. She sipped from it and passed the bowl to Brushfire, who sat beside her.\n Because I watched her so closely, I saw the flicker of fear on her face.\n I was shocked to realize she didn’t know what to say next.\n The spirits had not spoken to her.\n I felt in that moment I left childhood behind, though it was some time since I’d become a woman. The wisdom of ants which we waited for was nothing but my mother’s own wisdom. It fell to her alone to decide whether Muhsina was lying or whether the Island People had betrayed us; whether we could trust them and continue trading with them or whether they would use a machine made of copper, iron, silver and gold to make an underwater earthquake and an unprecedented tidal wave in the hope that the mainland could be made safe for their growing numbers and their metal-loving way of life.\n “The ants that live by freshwater,” my mother said, “build their leaf-nests high in the branches of trees. When the wet season raises the water level, the nests stay safe. The ants teach us that the trees are safe. When we go to the forest camp for the wet season, we will build wooden platforms high in the trees. They will keep us safe when the wave comes.”\n “And the Island People?” Brushfire demanded. “Will we continue to trade with them?”\n “We will give them no more metals,” my mother answered calmly. “Ants keep their gold and silver safe, close to their hearts. We shall do the same.”\n Fifty-seven warm bodies leaped to their feet, roaring in outrage. It was my mother’s death sentence. It meant the death of half the Clan.\n In all the commotion, I felt Skink’s hand sneaking into my palm and gripping tight.\n I squeezed his hand in return without looking at him. He would be shamed if anybody noticed his need for comfort, his future wife included. My heart thudded. I realized that my mother did not trust the Island People; had never trusted them, though they had kept us alive all this time with their magical vials.\n “Come here, Quiet-One,” Rivers-of-Milk commanded, and I quickly detached my hand and fell to the sand at my mother’s feet. She took the glass bottle that had hung on a cord around her neck since the men had gone away, and put it around my neck. “I give up the name Rivers-of-Milk. It is yours, now. I am Freshwater. I will take no more food from the Clan. I have died. I will go to the sea caves.”\n I stared at her, rivers of tears flowing down my cheeks.\n That is the new name I deserve: Rivers-of-Tears.\n Rivers-of-Mud.\n Rivers-of-Bodies, drowned in the flood, if I make poor decisions for the Clan.\n I reached for her, but she could not take my hand. She was gone; dead. She had said the words. Without trade, there would be no more vials, and instead of starving horrifically in front of the children, my mother and the other women would, instead, leave us with untarnished memories by starving alone in the caves.\n She made the motion with her hand for Bloodmuzzle to stay behind, and his plaintive whimper was the whimper I wanted to make.\n Don’t leave me, I begged her with my eyes in silence, but she turned and walked away.\n Brushfire’s teeth were bared in fury, but she spat,\n “I have died. I will go to the sea caves.”\n She turned on her heel to follow Freshwater into darkness. I remembered my mother eating ant-jelly in secret; she was supposed to give it to the dog but she couldn’t help eating it herself. I remembered Brushfire, talking to her husband’s totem, the turtle, telling it how much she missed him every day.\n When Brushfire caught up with Freshwater, she struck her old friend, hard, on the back of the head, but it didn’t matter what dead people did; they couldn’t be acknowledged by the living. One by one, the women said the words and went away from the fire, until there was nobody left but crying children and me. I was technically a woman but had been a child at heart until only a moment past.\n The bottle. I wrapped my palm around the glass. My mother had carried it since the warriors went away to die. Inside, a tiny, solar-powered voice recorder, sealed in black plastic, floated in seawater that would keep it safe from ants until the time came for Skink’s initiation. The voice of my mother’s dead brother would tell Skink what to do.\n “I will take care of you,” I said to the children. Some of them stopped crying, but most of them had to be pushed away by the dead people they were trying to cling to.\n It felt stupid. I couldn’t take care of them. I wanted to give Skink the bottle right now and send him away for his initiation. He would come back to us with a new name, Blood-of-the-Shark, and it would be his responsibility to see that the Clan obeyed the wisdom of the ant, that safe tree-houses were built when we moved to the forest camp.\n I looked around at what was left of us, twenty-eight little bodies around a smoldering beach fire, and I realized that a bunch of children could never build wooden platforms in high treetops. We were small and still-growing.\n We were weak.\n “Skink, help me put them to bed,” I begged, and we tucked the other children into their bark tents and shushed them until they stopped crying and fell asleep. I tried not to think of all the mothers at the caves, in blackness, sitting in sand, watching the waves that would soon wash their spirits back out to sea, to the place where spirits came from.\n The wisdom of ants.\n “Two days until the Island People come,” Skink said as we banked the fire.\n “Do you think I should trade with them?” I asked him at once. If I could get more vials, the mothers wouldn’t have to die. I could save them. They’re dead, but I’m Rivers-of-Milk, now. I could give life back to them! Just this once, I could deliver something better than my mother delivered. Life, instead of death.\n “Ask the ants, I suppose,” Skink shrugged. “I suppose we won’t kill those ants anymore.”\n “Why not?”\n “They’re like a totem for the Clan, aren’t they?”\n “The totem for the Clan is the shark. We still kill sharks.”\n “Only when making new men.”\n And I saw his mouth firm with determination, and felt shame at my cowardice at wanting to pass my burden on to this brave, shy little boy.\n The wisdom of ants.\n “Maybe you’re right,” I said slowly. “Maybe we shouldn’t kill them any more. Maybe we should even protect them from the Island People.”\n “How?” Skink wanted to know.\n “Take care of the others,” I told Skink. “Keep Bloodmuzzle with you. I’ll come back in two days. I’ll be here when the Island People come. Don’t be afraid. And don’t let any of the children join the dead.”\n The first day, I waited in mud.\n Muhsina’s metal tanks were buried in mud except for the thin metal rims and twin openings at the top. It only took two hours for the first, fresh-hatched silver-ant-queen to arrive, with a cadre of winged workers, also fresh-hatched, to help her begin construction of a new nest.\n The tang of metal had induced the nearby nest to divide. It had drawn the new queen.\n As soon as she and her workers moved into the tank, I leaped up and flung enough ant-jelly on top of them to trap them in the bottom of the tank. Followed by two handfuls of mangrove muck to make sure they didn’t eat through the jelly and escape, I put the tank seals on before digging the tanks out and moving to a new place on the tidal flat.\n Nosey sniffed out a new nest for me within minutes. This one was copper-ants. I re-buried the tanks at the base of the tree where the nest was, and waited for another queen to be hatched.\n By nightfall, the sealed tank contained twenty new ant queens.\n I shouldered the tanks as the moon rose over the sea and the incoming tide lapped at the flippers on my feet. Jelly and trapped air would keep the queens alive. I had until sunrise before the earliest-caught ants, energized by the rich jelly, breached the metal of the tank.\n “You think the tank metal is a treat?” I whispered to the ants as I waded into the water, the shark-signal device strapped to my chest, already activated. “Just wait until you get to the Island.”\n I swam out to sea, green turtles lolling in the water on either side of me, mistaking me for some monstrous relative, showing no fear. We came to the surface together to breathe, emptying capacious lungs and drinking air from sweet darkness before diving again.\n There was a net.\n Muhsina had not mentioned how she’d passed it.\n In the moonlight, I’d seen the floats on the surface, forming a ring around Shark Island. I’d seen razor wire gleaming under the sweep of spotlights, mounted on the Island’s stone towers beside guns of terrible range and accuracy.\n When I went to swim under, the net caught and held me by the left arm and left leg. I hadn’t seen it. I had no shell blade with me, and if I had, it wouldn’t have been sharp enough to cut the plastic rope.\n I tried to relax my body; to behave as I might if I was caught in mangrove sludge.\n Think.\n Conserve energy.\n There will be no more oxygen unless you think of a way to get free!\n A spotlight brightened the water around me.\n For an instant, I saw the bodies of dead sharks trapped in the net.\n Shark Island.\n The totem for the Clan is the shark.\n My body felt numb; I didn’t know if it was because I was drowning or because I finally knew what I must do to escape the net. I took the glass bottle around my neck and smashed it against the metal tanks.\n I had no spare hand to catch the voice recorder as it floated away; I could only grip tight to the neck of the bottle. With the broken glass, I sheared quickly and easily through the net.\n Surfacing on the other side was like walking into the death caves. I had killed the Clan. Skink and the other young boys could never become men. There would be no more children.\n I tried my best not to bawl as I swam the rest of the way to the Island. I should never have come. Everything was ruined. The mothers had sacrificed themselves for nothing.\n When I reached the fortified shores, it was as though the shark spirit whose egg-casing had become Shark Island sought to comfort me. Swinging spotlights missed me by hand’s-breadths. By chance, I’d come aground by a concrete pipe that dribbled effluent, and was able to climb inside.\n I crawled up the pipe until I came to a plastic grate, which I smashed with the heavy weight of the tanks and passed through into a room full of glass stills, vials and wooden racks. There was a ceramic jar of sea salt and a stack of cut cane.\n The blackness was held at bay only by the red light on my shark-mimicking device which flashed when it was operational. I used the tiny guide to escape the still-room into a stairwell that led up to a walled vegetable garden.\n With the last of my strength, I buried the tanks in the brown, sewer-smelling soil of the garden, re-planted two rows of carrots on top, then crawled back into the stairwell to fall asleep in the muck at the bottom.\n “I’m sorry, Skink,” I whispered in the dark, my heart broken all over again.\n When I woke, ants were crawling on the device still strapped to me.\n Stifling a shout, I crushed out the lives of three little workers. They were my allies, but I needed the device to get home. My face was crusted with mud and still swollen from earlier bites. It felt like lifetimes since I’d brought my meager bounty back to my mother, Muhsina in tow.\n I heard voices from the still-room. Risked a look through the light-filled crack of the closed door.\n A man in a clean, white coat was pulling folded white napkins, soiled with what looked and smelled like baby-shit, from a white plastic bag. A second man was scraping the shit off the napkins with a wooden spoon.\n He mixed it in a large beaker with water, squeezing fresh sugar cane juice into the water, adding a pinch of salt and the yolk of an egg.\n Then, he divided the mixture amongst twenty vials, stoppered them with sugar cane pith, and packed them into the loops of a belt I had seen many times before.\n “Incubator’s down,” he said to the other man, laughing. “Body heat will do.”\n I retreated to the stairwell.\n Though it was still dark under there, I wondered that my bare hands weren’t made incandescent by my anger. It was shit; the precious vials that we bartered for were nothing but baby shit in salty sugar-water.\n The Island People said that sometimes, with children, the intestinal environment was suitable for the bacteria to breed by themselves.\n And the meaning, which had seemed so mysterious before, resolved itself in my understanding. All that I needed to save the mothers was my own guts, or the guts of the other children, the ones who had no need to drink from the vials because all the bacteria that they needed to break down the poisoned flesh of their prey was inside them.\n The Island People had been laughing at us the whole time. Using us to get metals for them.\n See how you like the wisdom of ants, I thought furiously.\n Long after the men had gone, I made a beaker of sugar-water to re-energize myself before returning, in darkness, to the sea.\n Skink and the two dogs waited for me when I staggered up the beach.\n I didn’t want to look at him. I didn’t want to talk to him. I collapsed on the sand and he built a fire beside me, bringing poison toad, poison croc and poison barramundi.\n “Nice swim?” he asked.\n I was saved from having to answer him by the whirring sound of the Island People’s heli. It would land in knee-deep water on the tidal flat.\n They always landed in water.\n “Skink,” I said, “when the Island People leave their machine, I want you to fill it with the nests of iron-ants. Nosey and Bloodmuzzle will find them for you.”\n We gazed at one another. Iron-ants were the most plentiful. I hadn’t taken any with me to the Island, because they were the fastest at stripping down steel, and they would have escaped Muhsina’s tanks long before I’d made landfall.\n “You are a good leader, Rivers-of-Milk,” Skink said, and tears came to my eyes, because he hadn’t noticed that the precious glass bottle was missing from around my neck.\n He leaped to his feet, the dogs at his heels, and ran straight towards the mangroves. I gathered myself, ready to face the two men in their white coats and the two guards with electric prods and teargas that always appeared alongside them.\n Wind from the flying machine made white water on the flat. It took the Island people a long time to find a place they liked the look of and lower the dragonfly’s spindly legs into the water. Then, they inflated a rubber boat, climbed into it and drove it into dry sand, rather than get their trousers wet.\n I waited by the little fire that Skink had made for me. Without turning my head away from their bow wave, I saw Skink pushing a floating piece of bark out towards the machine. It was covered in the broken, pulsating nests of iron ants.\n They were so confident. They were so commanding that they even commanded the full attention of themselves. They didn’t look back.\n “Welcome to Clan territory,” I told them when they came to a halt before me.\n “The same tree?” one of the white-coated men asked casually.\n “There will be no trade today. You will stay as our guests.”\n “No,” one of the guards said, starting to step forward, but the white-coated man was curious and unafraid.\n “Guests for how long?” he asked.\n “Permanent guests,” I said, and the guards, swearing, turned in time to see Skink flinging nests into the open hatch of their heli. They pulled out guns and fired bullets at him, but he dived into the water and swam away.\n They pointed their guns at me, but I laughed in their faces.\n “Kill me,” I said, “and the Clan will vanish into the forest. You’ll never find them. You can drink those vials under your coat for a while, but then you’ll die.”\n “Another helicopter will come from the Island,” the man said, struggling to remain calm.\n “Maybe. Maybe they’ve got ant troubles of their own, on the Island. Come with me, now. We’re going to the caves. There are some women there who will need those vials.”\n “Wait,” the second white-coated man said. “You don’t understand. We can’t stay here. Our instruments have detected a big storm approaching. There will be a wave like nothing that you’ve—”\n “Yes,” I said, grimacing, turning away from him. “I know about the wave. Put your weapons down and follow me. We’ll be going through the trees. If you bring any metals, the ants will smell it. They can taste it from very far away, and they’ll come.”\n One of the guards didn’t follow.\n He sloshed back through the water to the flying machine and climbed into the cockpit. I watched him struggle with the controls, twitching while the ants bit him again and again. The motor started and the machine’s mounted wings began to whir.\n In silence, the three that remained watched the heli fly crazily back towards the island.\n “The protocols,” the white-coated man whispered. “Without them, they’ll shoot it down.”\n But nobody shot it down.\n “I think they’re busy,” I said.\n The remaining guard put his weapons down shakily.\n Ants were already marching out onto the sand.\n Nosey came to me, hours later, but there was still no sign of Skink.\n “Show me where he is, Nosey,” I said, making the signal for Nosey to find people. The old yellow dog whuffed and skittered off into the mangroves.\n I followed with a sense of dread.\n The Island People had been set to building bark tents and catching toads; I was expecting many more Island People to arrive over the following days and weeks. We would not stay. They would be angry with us. There might be more shootings.\n But the Island People were not like the wireminds. They knew about the local poisons as well as the bacterial remedy, and so long as they brought their children with them, they would not die if left alone. I would let their anger cool in our absence. Maybe, one day, we would make contact with them again.\n Nosey whuffed again, excitedly.\n “Skink!” I shrieked, and ran to my future husband.\n He sat in a bloody puddle of mud, staring into the dead, filmed eyes of an enormous shark that had wriggled its way through the shallow water, desperate to get to him, but then become trapped by the gills in a snarl of stilt-roots.\n “Skink!” I cried again, shaking him by the shoulders. “Where are you hurt?”\n Skink’s dark eyes gradually focused on me.\n “A bullet went through my leg,” he said quietly. “It’s not bleeding any more.”\n “Where’s Bloodmuzzle?”\n “Inside the shark,” he said.\n He didn’t cry.\n Nosey licked the small leg wound clean, and I helped Skink return to the camp. Once he was settled, I went back to the mangroves with a long shell knife and cut the dead shark open, determined to get my mother’s dog out of its guts.\n Inside its stomach, along with poor Bloodmuzzle’s remains, I found a little black plastic package.\n The totem for the Clan is the shark.\n I held the voice of my mother’s brother in my hand. The vials had brought life back to the dead mothers in the caves. The recorder would bring life back to the whole Clan.\n “I am Rivers-of-Milk,” I said with astonishment to Nosey.\n He tilted his long face to one side. His hearing wasn’t that great.\n Thoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe."}