{"fingerprint": "ZKnTxzsoAqkN16k8QokXgKzffac=", "sitename": "Clarkesworld Magazine", "title": "The Story Is All: Ten Fiction Editors Talk Shop by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/editors_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Story Is All: Ten Fiction Editors Talk Shop by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "InterviewThe Story Is All: Ten Fiction Editors Talk ShopFirst and foremost, magazine fiction editors are readers who love stories so much that they’ve made a career out of reading them. They have a not-so-simple job: select, prepare, and present the best stories they can to a specific audience.Below, ten of the top speculative fiction magazine editors talk about what they do and how they do it. Each of the editors works for a different speculative fiction magazine—print or online (or both), new or long-running (or revived after a hiatus). They seek fantasy, science fiction, or horror stories . . . or some innovative combination thereof.Ultimately, fiction editors are the people who mine the slush pile for new voices and who push established writers to grow beyond their previous stories. They read story after story, and more pile up each day. They screen, sort, revise, and reject. They seek the new, the fresh, the familiar, the entertaining, and the weird. They discover and they miss out.“There is no magic formula,” said Gordon Van Gelder of The Magazine of Fantasy and Science Fiction. And this holds true for writing stories, submitting stories, and editing stories.For, as Patrick Nielsen Hayden of Tor.com said, “It’s not about writers and editors; it’s about stories and readers.”The Editors, Their Magazines & Their Editorial PhilosophiesPatrick Nielsen Hayden edits books for Tor Books and short fiction for Tor.com. “I’m not sure I have an organizing ‘philosophy,’ or that I would trust one even if one occurred to me,” said Nielsen Hayden. “I do have a belief, which is that I’m working for the reader. I work with authors, and publishers pay me, but my real boss is the person who’s just looking for something interesting to read.” For more information about him visit his webpage.Shawna McCarthy is an editor, anthologist, and literary agent. “I believe that genre fiction should be held to a standard every bit as high as mainstream fiction,” said McCarthy, who has been the editor at Realms of Fantasy since the first issue in 1994.John O’Neill is the publisher and editor of Black Gate magazine. “I think a magazine becomes successful by finding new, emerging authors and providing them with a stage, helping them launch their careers in your pages, and enjoying the fruits of their success along the way,” said O’Neill.Cat Rambo is a fiction writer and the co-editor of Fantasy Magazine. “My editorial philosophy is to try to create a magazine that the readers can enjoy and identify with,” she said. Learn more about Rambo at her webpage.Mike Resnick co-edits Jim Baen’s Universe. He is also a prolific fiction and non-fiction writer. As an editor, he said, “I try to remember that not all readers share my taste, and to select the best stories, regardless of subject matter or approach.” Learn more about Resnick at his webpage.Stanley Schmidt is a fiction and non-fiction writer, as well as an editor at Analog Science Fiction and Fact. “My editorial goal,” Schmidt said, “is to produce that science fiction magazine I would most like to read if I had to pay for my subscription and could only afford one.” Learn more about him here.Jason Sizemore is a fiction writer and the founding editor of Apex Magazine. “I’m a hands-on editor who is a stickler for getting the story just so,” said Sizemore. Learn more about Sizemore at his webpage.Gordon Van Gelder is editor and publisher of The Magazine of Fantasy and Science Fiction. “I subscribe to Maxwell Perkins’s theory that an editor’s hand should be invisible,” said Van Gelder. “I publish works that I think readers will find entertaining, and I do my best to publish them responsibly.Sheila Williams is the editor at Asimov’s Science Fiction. “I’m excited by a lot of young and up-and-coming authors,” said Williams. “I’m always thrilled when I find the second story that I love by a new author because that shows me that the author may be a new force to be reckoned with.”Ann VanderMeer is an anthologist and fiction editor at Weird Tales. “I see myself somewhat as a cheerleader for great fiction. My philosophy is to bring the widest possible audience to fiction that I love. The story is all—a big name or previous credits are not important to me, only the story.”The Questions & AnswersWhat do you look for in a short story?VanderMeer: I look for originality, uniqueness and the weird. I especially love work that makes me look at fiction in a new light. I love to be surprised (not grossed out, please) and completely drawn into a story. If I start to read a story and do not want to stop, that’s a very good sign. When I do stop reading, if that story stays with me for the next few days, that’s another good sign.McCarthy: I’ve been doing this for so long now that what I really look for is something I haven’t seen before, which is very difficult to do, but it does happen!O’Neill: First and foremost, I’m looking for a rousing work of fantasy—an opening that grabs attention, a middle that heightens expectations, and finally a satisfying climax that delivers.Beyond that, I’m looking for the same things that every other editor is: freshness of voice, originality in setting and character, and a certain skill in creating and building narrative tension.Resnick: The first thing a story has to do is appeal to me on an emotional level: it has to make me love or hate or fear or laugh—in other words, to make me feel. If it also makes me think, so much the better . . . but if it doesn’t make me feel, then the author has simply written a thinly-disguised polemic or a fictionalized high-tech crossword puzzle.Rambo: I look for the stories that come back the next day and make me think about them some more.Schmidt: Ideally, I would like a story so engagingly written that I forget I’m reading it, with a provocative idea I’d never thought of before so deeply integrated into it that it couldn’t be removed without making the whole story collapse.Sizemore: Being a web-based magazine, the opening sentence [or] paragraph becomes the most important aspect of your story. Readers on the web are fickle and know that with one simple click they can move on to other things. Compare that to where you shell out a fiver for a magazine of stories, you’re more likely to stick with it since you’ve got something on the line, so to speak.Van Gelder: Ideally, I look for a story that grabs me with the first line, draws me in, comes alive, and makes me forget everything around me until it all wraps up with a satisfying conclusion.I also look for my baseball team’s pitchers to throw a perfect game every time out, but since these things don’t happen every day, here are some of the other things I look for in a short story:Story (too many submissions I receive nowadays are fragments or plotless mood pieces.)A strong narrative voice and good proseCompelling charactersAn interesting settingA solid storyline that leads to a conclusion that the story earns (as opposed to one that is tacked on)FreshnessWilliams: I enjoy experimental stories and adventure stories that entertain me. Even a story that breaks a reader’s heart should be entertaining. I love big ideas, but I also need well-drawn characters. I love screwball comedies and stories that fill me with dread—though I rarely enjoy straight out horror fiction.Nielsen Hayden: The glib (and yet true) answer is that I’m looking for the thing I didn’t know I was looking for. The first SF story I ever bought out of a slushpile was Maureen McHugh’s novel China Mountain Zhang. But if you’d asked me that morning what I was looking for, I probably wouldn’t have said “a picaresque, somewhat unstructured novel of a gay American-born Chinese man in a China-dominated future, filled out with substantial interludes in which the main character is neither present nor particularly relevant.”I do have a couple of observable biases. I’m very interested in stories that tell me something I didn’t know about how the world works. And I’m actively interested in SF—specifically SF—that speaks to the kind of emotional and psychological issues that are of interest to smart readers in their teens. This is not the same thing as “YA SF,” although it includes a lot of YA SF.What does “fit” mean for your magazine?Resnick: Not a thing. Eric Flint and I co-edit Jim Baen’s Universe, and we both have to agree on a story before we’ll buy it. In close to three years we’ve disagreed once, and let the managing editor decide. There is no kind of fiction that can’t fit our magazine if it’s well done.VanderMeer: “Fit?” It’s gotta be weird, not the usual story you could see somewhere else. The kind of story when you see it you say, “That’s a Weird Tales Story.”McCarthy: That’s just rejection slip speak. When a rejection slip says your story wasn’t a good fit for the magazine, it just means that for whatever reason, we didn’t like it. I think it means the same thing for any magazine—a story that’s a good fit is one we like and would be happy to publish.O’Neill: A story that fits is one that has a beginning, middle, and an ending. At Black Gate, we’re not trying to be more “cutting edge” than everyone else, or looking to explore new frontiers of splatter-horror. We like adventure fantasy, especially classic adventure serials, and that’s what our readers are clamoring for.I once got an angry letter from a reader asking why I didn’t publish more medieval fantasy, with castles, princesses and dragons and the like. I thought it was a bit ridiculous at first. Isn’t everyone as tired of that as I am? How many dragon—slaying stories do we need? But now I think I understand what she meant. Like most editors I respond best to genuine innovation in fiction—the original, truly well-crafted setting, the character with a fresh voice—but there’s a very real hunger for the familiar among readers, especially the trappings of the fantasy of our youth. I think we ignore that at our peril.Rambo: “Fit” is such a nebulous word, and yet we all seem to use it, it seems. For me, a story that fits is one that has a fantasy element that matters to the story, and is more than a prop. While I like poetic and/or complicated language, too much of it can drag a story down and I want a story where the reader can float through the words, emerging changed from that immersion. I want the stories that stick with a reader, that they can worry over in their head like one of those simple puzzles that manages to be infinitely complex, infinitely challenging.I like stories that tease at the edges of human experience, that talk about love and sorrow and what it means to be a changing being in an endlessly shifting world. I look for stories that aren’t mainstream, which don’t reflect the consumer-culture cookie cutter images that have been created by corporate-owned media. If I’m succeeding in that a small portion of the time, I’m feeling that I’m doing well.Schmidt: I’m a matchmaker: I try to get writers who like to tell certain kinds of stories (a much broader range of them than people often assume, by the way) together with readers who like to read those kinds of stories. I’m not looking for stories that are more about rivets than people; I’m looking for stories in which both science and fiction are essential, entertaining, and as well thought out as the writer can make them. And the science doesn’t have to be limited to careful extrapolation of what we already think we know. There’s certainly a place for that, but it’s no less important to explore how we humans might respond to the big surprises the future is sure to throw at us.There’s a more practical side to “fit,” too, of course. Every issue needs a mix of lengths, subject matter, tone, and so on. So if next month I’m up to my ears in humorous novellas, I won’t be buying many more of those for a while. And the physical make-up of the magazine imposes requirements, too. Novellas between 20,000 and 40,000 words have always been hard for us to accommodate, and it’s even harder with our latest format change—so if you try to sell me a story that size, I’m going to have to really like it, and I still may not be able to find a place for it. So if you can tell it in less than 20,000 words, you probably should.Sizemore: When we pass on a story and say it is not a good fit, that means that it falls into one of two categories of rejection: not really the type of story Apex publishes or the story is too similar to something else we’re publishing soon or publishing recently in the past.A good “fit” for Apex are stories that show the reader the dangers of technology to the human condition. It also includes darker themes such as oppressive alien races, dangerous astronomical situations, and other familiar science fiction tropes.Van Gelder: What’s a good fit for F&SF? I like to think I know it when I see it.In the header notes of our Oct/Nov 2008 issue, there are some comments about how we can publish a Twilight Zone-ish story next to a Playboy-esque story and also have a story in the same issue that would have been at home in any SF magazine of the 1950s. But all of them felt right for F&SF.Williams: At Asimov’s, I strive for balance, keeping in mind that the readers and I both prefer science fiction. I do publish some fantasy, although usually not more than one or two (in a double issue) a month. Often one weird and hard to classify story will appear in an issue as well. I don’t adhere strictly to my own rules, though. If I love a fantasy story, I’ll probably buy it.Nielsen Hayden: As used in rejection notes, it’s basically a weasel word. We use it as a way of closing the door politely and firmly on a submission, and not getting snookered into a back-and-forth about what it would take to make something we don’t like into something we’d buy.What are some reasons why you’d reject a good story?VanderMeer: If the story doesn’t fit (see above—there are all kinds of great stories that are traditional, non-weird stories). If the story is too long (sometimes I have space limitations). If the story is too similar to another one I’ve got or just doesn’t work with other stories I am publishing.McCarthy: A good story, to me, is one that has an interesting setting, and unusual or unfamiliar mythos, an interesting protagonist, and has something to say beyond the surface action of the plot. I see tons of good stories a year but can only publish around 40 of them. So that’s one reason. Another is a good story that has all the right elements but just doesn’t come to life for me.O’Neill: I’ve rejected some fabulous stories. We published a great piece by Ellen Klages in BG 3, but I turned down the chance to publish the short story that eventually grew into The Green Glass Sea—her fantastic novel that just won the Scott O’Dell Award, and has been nominated for many more. It was a terrific piece, but it wasn’t really fantasy.I’ve also had to pass on very solid stories that were too adult for our target market (we’ve advertised Black Gate as family-friendly, which means it needs to be suitable for ages 12 and up).I’ve also returned very solid stories simply because I thought they could be better—and should be better.Rambo: Too long, not fantasy, too unimaginative. A good story is one worth returning to more than once, either mentally or on the page.Schmidt: I’ve just given one: It’s a size that I can’t use. Other reasons may be that it’s a good story, but it’s fantasy or mainstream rather than science fiction; or that it’s too similar in theme or flavor to something I already have in the works. That last, by the way, does not necessarily mean you can’t go ahead and sell it elsewhere. It may be too similar for me to want both in my magazine anywhere close to the same time, but different enough that the world will welcome it somewhere else.Resnick: The only reason I’d reject a good story would be that I was running something too similar to it—and then I’d probably buy it and hold it for a few issues. A good story is any well-written, well-characterized story that elicits an emotional reaction; everything else is gravy.Sizemore: Just about every time, I will read a “good” story to completion, even if I know within the first page or two I won’t be buying it.Why won’t I be buying it? This generally falls into the “not a good fit” category. Jennifer Pelland sent me one of the best short stories I’ve ever read (titled “Ghosts of New York”) but it wasn’t an “Apex story.” It’s heartbreaking passing on work such as that, but you have to stay true to your readers.Van Gelder: Here are three common reasons:Story is executed well, but the science fictional or fantastic element is too familiar or uninteresting.Story is of a sort or in a genre that I already have too much of in inventory.Story isn’t actually SF or fantasy.Williams: I may have a story in inventory or recently published that is in some way similar to the story on hand. Not right for Asimov’s—the fantasy is too high or the horror is too integral a part of the story to work for Asimov’s. Story just isn’t right for me, though it could very well be perfect for the next editor.Nielsen Hayden: Unlike some of the magazine editors here, I’m not currently buying short fiction for a magazine with an established tone or approach. The original stories that appear on Tor.com—a new one roughly every two or three weeks—have been all over the map; we’re still feeling our way into this kind of publishing. I’m sure I’ve turned down good stories; every editor does. Nobody’s sensibility encompasses everything that’s good. And I’ve certainly turned down novels that I thought were very good indeed, because I thought my house wouldn’t be very good at publishing them.The point is that editors aren’t in the business of adjudicating what’s good; we’re in the business of acquiring and publishing material through particular channels and organizations, mustering the opportunities that actually exist. Of course, every so often in every editor’s career you get something that seems unsuitable for the magazine, or web site, or anthology, or publishing house that you’re editing for, but it’s so outrageously good that you wind up running around with your hair on fire demanding that reality change so that this thing can get published. Sometimes this even works.How has the magazine business (especially as it pertains to fiction) changed since you started out?VanderMeer: One of the main changes is the delivery system and how we communicate with each other. Technology has motivated us to change the way we do business. Right now it is more difficult to sustain a hard-copy magazine as the audience is getting more and more of their reading done online or on other virtual devices. Online magazines are getting more sophisticated and garnering more and more readers.As to communication, most everyone is “plugged in.” We send emails, text messages, update our Facebook status and/or Twitter to stay in touch. And because of this the expectation for an instant response is very high. Technology makes our world smaller and allows us to connect more quickly—this is the positive side. And we can reach a much wider audience than before. Technology also levels the playing field as we all have access to the tools.But on the downside, we’ve become so fragmented. And we seem to have no patience. Many short fiction venues out there are looking for shorter and shorter pieces, perhaps for space considerations, but I also think for the shorter attention spans of the current readership. And that’s a shame.Rambo: I’m very much a newcomer. I became fiction editor in late 2007, and before then was a reader. I have always been a bit of a web-head, and so I’m very comfortable with the electronic format.McCarthy: Gosh, where do I begin with this one? When I started out, magazines made money, were sold on newsstands everywhere and were printed on offset presses after having been typeset by hand!As far as the fiction goes, I’d like to say that the level of the fiction has gone up over the years, but what’s really changed is the society we live in and peoples’ tastes along with it.When I started out, the personal computer was a science fictional idea—you knew you were in the future when the protagonist entered his house and said, “Computer, lights on!”The first Star Wars movie had just come out and rollicking science fiction adventure stories were very popular. When was the last time you read one of those? It doesn’t mean they’re not good anymore, just the times have changed and tastes with them. I’d like to think that everything I published 25 years ago would still stand up today and that the stories I publish today would be just as effective had they appeared long ago.O’Neill: Funny you should ask. When I started out in 1995 my day job was at the Internet company Spyglass. We sold our new browser to Microsoft, and they renamed it Internet Explorer. I was pretty convinced the future of the genre was on the Internet, and I started a Web magazine called SF Site and ran that until 1999, waiting for the first wave of readers and revenue.I may be the only editor to have run an Internet genre magazine, only to give up and switch to print. I’ve watched the current wave of publishers migrating the other direction over the last decade with some fascination. Print has proven much more successful for me than the Internet did—at least in terms of reliable revenue, anyway. Maybe all these publishers headed in the other direction will find the right formula and prove me wrong, but I don’t think it’s happened yet.How has the magazine business changed? I’ve watched a lot of publishers chasing the dream of revenue on the Internet, without much success yet. There’s still a very real demand for print fantasy, and print fantasy magazines aren’t dead yet.Resnick: When I was a kid, there were (honest!) 52 science fiction magazines. When I broke in, there were still perhaps a dozen. Today there are 3 (until Realms of Fantasy is resurrected), and all three have circulations that have been on a straight downhill trajectory for well over a decade. I’d be surprised if any of them are around in eight years.On the other hand, there are currently 17 science fiction magazines paying what SFWA considers pro rates, and 14 of them are electronic, so I don’t think the short story is in as much trouble as it appeared to be a decade ago.Williams: The fiction hasn’t changed, but there are more ways to deliver it. In addition to print subscriptions and newsstand sales, Asimov’s can now be purchased on Fictionwise and for the Kindle.Schmidt: This question is much too big for a short answer, but the most obvious changes are the decrease in print circulation and the increase in both electronic publication and electronic connection with the audience. Some older readers have complained that our letter column isn’t as big as it used to be and mistaken that for a decline in reader interest, but what’s really happened is that most of the discussion that used to take place in “Brass Tacks” has moved onto our online forum—and there’s far more there than the magazine’s letter column ever had room for.Electronics has also had a big effect on how writers and publishers work. So many writers now take computers for granted that publishers do, too. We now assume we’ll be able to typeset from an electronic manuscript provided by the author, so the author has to be able to provide one—so a computer is now as necessary to a writer as a typewriter was when I started out. We still need hard copy for the initial reading, though; we have no use for an electronic file until we decide to buy a story, and we certainly don’t open e-mail attachments from people we don’t know.Sizemore: I started in 2005, so my tenure has been short. Unfortunately, it appears that short fiction keeps being marginalized in terms of the magazine market. For the past few years, we’ve seen more and more print markets go online, generally becoming just a small part of a grander site. And the last year or two, many of the best stories have appeared in anthologies and collections. I would expect both these trends to continue as the print magazine market thins out further.Van Gelder: I started working at St. Martin’s Press (in book publishing) in July of ’88. Within three months, Tappan King offered me a job as an assistant at Twilight Zone magazine. “I can’t claim that we’re in great shape,” he told me, “But I can promise you that we’ll be around for at least a year.” I was sorely tempted to take the job, but I decided to give book publishing a year. And as it happened, they pulled the plug on TZ in January of ’89, in spite of whatever Tappan had been told. In that sense, nothing much has changed. The magazine business has always been pretty precarious.But what has changed since I started working at F&SF in Jan. of ’97? Here are a few things:In 1997, we had one old guy in a back room who wrote the contents of each issue. Moe. Nowadays, we have two people doing the work. Moe writes just as much, but he seems to like having someone around to keep him company.In 1997, most of the people who told me what we need to do to “save the magazines” talked about the contents. (Several people told me we should run more tie-in fiction, and others suggested that we should serialize Robert Jordan novels.) Nowadays, almost all of the people who tell me what we need to do to “save the magazines” discuss format, medium, and marketing.The USPS has undergone a lot of changes, most of which are detrimental to small magazines.The internet has risen and prospered since 1997. (I think F&SF launched its Website in 1998.) And the internet has lots of wonderful features and it has made some great changes. It has also made some lousy changes and it has some aspects I don’t like. One of those aspects is that I’ve found it’s not a good venue for discussions about itself, and since this interview is going to appear in an online magazine, I’m going to skip making general comments about how the internet has changed the magazine business.Nielsen Hayden: I think the biggest change in SF’s overall readership is that it’s become much less dominated by hardcore SF buffs whose reading consists largely of SF. Compared to a generation ago, a lot more of our readers are just plain middlebrow readers—people who read a little SF along with a little of a lot of other things, and who don’t necessarily regard the SF as alien to the rest of literature, or below the salt, or any of that stuff.[Today’s readers] are probably not connected to the SF social scene, they don’t assess their SF and fantasy reading against a huge backdrop of inside-baseball industry lore, they may not have read all of the classics, but they’re pretty good at making sense of fairly sophisticated SF storytelling because, guess what, in 2009, hundreds of millions of people are good at making sense of sophisticated SF storytelling. The problem for SF writers and publishers today isn’t that there’s not a mass audience for high-end SF storytelling; it’s that there are immense numbers of other diversions on offer for those hundreds of millions of people.Lastly, any advice for someone submitting fiction?Resnick: Yes, and this is not just for our magazine: Read the magazine before you submit. You’d be surprised how many don’t. I am sure Stan Schmidt gets his share of fantasy stories, and fantasy magazines get some nuts and-bolts hard science stories.VanderMeer: Please, be polite when submitting your fiction. Remove that chip on your shoulder. Editors are people, too. And keep in mind that just because we may not take your story doesn’t mean there is something wrong with it. Please don’t ask us to tell you “why” we didn’t take a story after we’ve responded. By the time we get your query, we’ve probably read another 100 stories. Keep writing, keep submitting and again, be polite. Thanks!McCarthy: Don’t include money, candy, condoms, underwear, stamps, four leaf clovers, photos of yourself, photos of your cat or photos of your kids. We have gotten all of these at one time or another. Send it to the right address. Enclose an SASE. Neatness counts. So does spelling. Don’t copy someone else’s work. Sit up straight. Cover your mouth when you cough. Look both ways when you cross the street.O’Neill: Probably the best piece of advice I can give an aspiring writer is to pay as much attention to your setting as to your plot, characters, and prose.When I’m reading an unsolicited manuscript, I’m reading to reject. I need to be done with your piece as quickly as I can, because there’re 20 more in that stack, and my wife is going to bed in 30 minutes, without me if necessary. So you’ve got a few precious minutes to grab my attention, and you better use them.It’s hard do with plot. If your plot is simple enough to communicate in the first two pages, I’ve probably seen it a hundred times. It’s hard to do with character, for similar reasons.It’s easy to do with setting. Two pages is more than enough space to paint a picture of your world that grabs my attention, if it’s fresh and intriguing. You can’t compete with my wife when all you have to offer is yet another version of the tale of King Arthur, or a generic medieval setting, or a tavern filled with rangers, dwarves, and a half-orc with a dungeon map.Of course, if Alice puts on that sheer nightgown before going to bed, God help you.Rambo: Take the time to look over the magazine and get a feel for what we’re publishing. You can see the online works here. The same holds true of any publication you’re submitting to. If you can read samples online, I don’t really think there’s any excuse for not at least glancing over what they publish.Schmidt: Read the magazines you’re interested in submitting to, to get a “feel” for how the editors’ tastes run; but don’t try to imitate the stories you find there. That’s what they were buying last year; they’re looking for something new now. The story I most want to buy is one that I didn’t even suspect I was interested in until I saw it, and then it won’t let me go.Sizemore: When it comes to the basics, we expect the author to have those down. The Apex editors are quick to dismiss stories that might be interesting but lack rudimentary stuff like correct grammar and punctuation. Follow the writer’s guidelines. Don’t get yourself rejected without at least getting your foot in the door. Make sure your story has a good opening hook. Avoid passive voice like the plague.Van Gelder: There is no magic formula. All the age-old advice has been around for an eternity because it’s still good advice: Write the best stories you can, submit them (I’m amazed at how many people fail to submit their stories), don’t take rejections personally, resubmit stories, persevere.Williams: Read widely, both in SF and elsewhere. Spend time on a story. It’s often a good idea to populate stories, rather than just write about one character. Keep learning about and perfecting your art.Nielsen Hayden: Read something other than SF. Do something with your life other than struggling to sell SF stories. Sheila Williams, above, rightly recommends that you populate your stories. I’d say you should populate your life. Do some stuff that not all the other striving writers have done. Go out into the world and discover interesting things about how it works. Report back.Or, alternately, live in a closet and eat cactus. Emily Dickinson barely ever left her room. It really doesn’t matter how you do it. It’s not about writers and editors, it’s about stories and readers.Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}