{"fingerprint": "obV3keyd8N7qbYxCTXCm3IJxXjo=", "sitename": "Clarkesworld Magazine", "title": "You and Whose Army? by Greg Egan", "author": "Greg Egan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/egan_10_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: You and Whose Army? by Greg Egan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "13050 words, novelette\n You and Whose Army?\n 1\n The last thing Rufus could recall his brother Linus doing was swimming laps, in the aquatic center twenty minutes’ walk from his apartment in West Ryde. Rufus hadn’t been near a pool in years, but he booked a lane, went to the center and climbed, shivering, down into the water.\n He floundered at first, thrashing about, getting the acrid, chlorinated water up his nose. Then Linus’s memories took over, and Rufus found himself gliding along, if not effortlessly, at least competently. The sound of children shouting in the paddling pool, coming and going as he turned his head to breathe, anchored him with its familiarity, and whenever his technique began to falter he managed to think back to some moment when Linus had corrected a similar flaw in his own stroke.\n Linus had completed his usual twenty laps. Rufus settled for eight; his lungs and limbs should have been in good enough shape from his running and weights, but his shoulders were protesting and his breathing was growing labored. He climbed out and went looking for his towel, chilly again, pondering the dissonance between his own mixture of pride in this mildly uncomfortable achievement, and Linus’s memory of emerging from the water, far more invigorated and physically at ease, but too accustomed to that for it to mean much.\n He dried himself and pulled on his T-shirt, then sat on the lowest tier of the spectators’ benches, watching the other swimmers for a while. After a few minutes he noticed a woman approaching, goggles on her forehead, arms still dripping, frowning at him uncertainly.\n “Linus?”\n Rufus shook his head. “I’m his brother.” He recognized the woman: Beth, a regular in the same time slot, whom Linus had chatted with now and then.\n She laughed with surprise and came closer, and they introduced themselves. “Linus never told me he had a twin! Do you live nearby?”\n “No, I just flew in from Adelaide.”\n “Oh, it must be nice to catch up.” She looked back toward the water. “Is he still going? I can’t see which lane he’s in.”\n “I didn’t come here with Linus,” Rufus replied. “Actually, he hasn’t been in touch for a while.”\n Beth digested that. “You’re looking for him?”\n “Yes.”\n She thought for a moment. “The last time I saw him here was Thursday.”\n That was the last session Rufus remembered. “Did you speak to him?” he asked, though he believed he knew the answer.\n “No,” she confirmed. “I just saw him getting out of the pool.” She hovered, concerned, clearly struggling to think of something more tangible she could offer. “If I see him, should I tell him to call you?”\n “That would be great, thank you.”\n “I’m sure he’s fine.”\n Rufus nodded and smiled, and she departed.\n Even if Linus had dropped this part of his routine at the same time as he’d stopped sharing his memories, that didn’t necessarily mean he’d come to harm. But it did suggest that he hadn’t merely decided to pull the plug and then continue with his life as if nothing had changed.\n Rufus returned to Linus’s apartment. He knocked a few times, then tried Linus’s phone again, listening in vain for any hint of the ringtone coming through the walls. Either it was on silent, or it was somewhere else entirely—and there really was no reason to think that Linus was lying comatose on the floor. He couldn’t go to the police with nothing but the fact that a healthy twenty-four-year-old man didn’t seem to be at home, and had had no contact with his brothers for five days.\n As he headed down to the railway station, he set up a group call with Caius in Bonn and Silus in London.\n “Any news?” Caius asked.\n “It looks like he hasn’t been to the pool since Thursday.” Rufus felt strange conversing this way, but their usual mode of interaction didn’t make for a speedy exchange of information.\n “You need to get into his apartment,” Silus insisted.\n “How?” However many memories they had of Linus opening the door and walking straight in, the biometric lock wasn’t so shoddy as to succumb to either their shared knowledge or their shared DNA.\n “Break a window,” Caius suggested. “Quietly.”\n “Yeah, thanks for that last bit.” The apartment had no alarm system, and the building wasn’t known for its late-night parties; by midnight, the chance of him encountering any neighbors coming or going would be minimal. “I’ll buy a glass cutter,” he decided, talking over Silus who’d just come up with the same idea.\n “I’ll call back if I find something,” Rufus said. “But if I end up in prison, I’m going to expect both of you to start pulling your weight and having a lot more fun.”\n 2\n When Rufus had bought the tools he needed, he got a pizza and took it to his hotel room, then he lay on the bed and passed the time watching the same shows as he would have streamed at home: a couple of comedies, a police procedural, a supernatural thriller, a psychological drama. He hadn’t much liked Louisiana Nights at first, but recalling Linus mulling over his own memories of the first few episodes had really turned him around, and anticipating Caius’s groans and eye rolls did nothing to change his mind.\n Around eleven o’clock, he left and caught a train to West Ryde. When he reached the apartment his nerve almost failed him, but then he convinced himself that if a neighbor showed up he could probably bluff his way through the encounter by pretending to be the rightful occupant, wielding a desperate solution to a malfunctioning lock. Linus hadn’t had much contact with anyone in the building, but he’d been there long enough for the people on either side to know his face.\n Rufus attached a suction-cupped handle to the kitchen window and started rolling the cutting wheel along the edge of the pane, oiling it to silence its squeaking, feeling like a jewel thief from a heist comedy transplanted into some kind of weird suburban melodrama. He’d tried Linus’s phone again while he was on the train, but hadn’t risked waking the neighbors by knocking, so it was entirely possible he was about to blunder in and find his brother, safe and well, in bed with someone whose intimacies he’d had no wish to share.\n The square of glass came free; Rufus set it down on the balcony, lifted out the insect screen, placed a bath towel over the remaining sharp edges, and then climbed through the curtains onto the kitchen sink.\n He pulled out his phone to light up the scene. The kitchen looked completely bare, and the refrigerator stood with its door ajar, unplugged and empty.\n When he got down off the sink and tried the light switch, it confirmed that the power had been disconnected. Linus wasn’t lying dead in an alley; he’d simply moved out of the apartment.\n A fraternal corpse was the last thing Rufus had been hoping for, but robbed of the potential exculpatory gravitas, he suddenly felt ten times more embarrassed at the prospect of being caught. He quickly opened the front door and brought the excised pane inside, pretty sure that the deglazed window itself would attract no attention from a casual passerby.\n He moved from room to room, checking the landlord’s furniture for anything Linus might have left in a drawer or a cupboard. It was strange to see bare plywood where he was accustomed to recalling socks or stationary, and however presumptuous it would be to feel as shocked as if he’d come home to his own place and found it burgled, he couldn’t deny the skin-prickling sense that a sudden change had been wrought on things he’d always thought of as lying fixed beneath his gaze.\n Linus had left no possessions behind, let alone any revelatory clues. If he’d wanted out, why hadn’t he just said so? Rufus couldn’t deny that the loss would have been painful, but he did not believe that any of them would have stood in his way.\n Then again, if he hadn’t even known what Linus was planning, how much were his predictions of his other siblings worth?\n Rufus booked a glazier to come and repair the window in the morning, charging everything to his credit card; the landlord was sure to discover the whole story eventually, but restoring the damage as swiftly as possible seemed like an honorable compromise that would probably keep him out of court.\n He called the others as he walked to the train station, and described what he’d seen.\n “If he doesn’t want to be found,” Caius said, “then I don’t know what else we can do.”\n “Hire a private investigator?” Silus proposed.\n “That could make things worse,” Rufus replied. “If he wanted to get away from us, and we start chasing after him, it isn’t going to help.”\n “Why would he throw away four weeks’ rent by moving out without giving notice?” Silus protested. “And even if he felt like he had to act on the spur of the moment—at the very same time as he decided to pull the plug on us—don’t you think that sounds as if someone pressured him into it?”\n Rufus could feel his memories of Caius agreeing with Caius, those of Silus agreeing with Silus. His memories of Linus stayed silent on the matter, just gliding through the water, content with the rhythm of his stroke.\n “I’m tired,” he said. “Let me look into some options in the morning.”\n Back at the hotel, Rufus undressed and crawled into bed, almost tempted to switch off the link himself. He could understand Linus doing that if they’d been badgering him, ganging up against him, trying to control his life. But no one had filled his head with reproach or disapproval; they’d accepted him as he was, as they always had.\n Rufus dreamed his own dream first: breaking into his father’s prison cell, carrying the glass cutter and a birthday cake. “Shouldn’t you have hidden it in the cake?” his father complained. “What good is it out here in plain sight?”\n “It’s not your birthday,” Rufus replied. “None of this is for you.”\n As Caius, he hung like a sloth from a power line, inching his way along the live wire, sure that he was safe so long as he remained scrupulously isolated. Urchins down on the ground tossed their shoes at him, but he didn’t flinch. He could smell burning rubber, though: maybe from the shoes, maybe something closer.\n Then he was Silus, eight years old again, in their first foster home: the Coopers. He had found a ball of wool, and he was using it to tie the cat’s collar to the dog’s. Mrs. Cooper came in and began denouncing him angrily.\n “But they don’t mind,” Silus pointed out. The cat was tentatively licking the dog’s nose, and the dog, so far, was tolerating it.\n “That’s the worst part!” Mrs. Cooper raged. “We trained them to fight! They should be fighting!”\n The alarm dragged Rufus back to the hotel room. He lay still for a moment, sorting out exactly who and where he was. His expatriate brothers had not yet shared their still-unfinished Tuesday; on the European Monday he now recalled, both of them had tried and failed to make progress on their theses, too distracted by their worries about Linus as they’d waited for Rufus to arrive in Sydney and report back. This kind of lag had rarely mattered before, but Rufus found it annoyingly disorienting, now that they were trying to coordinate in real time as well.\n As he started to rise, the absence hit him anew. At the back of his mind he’d still been hoping for a miraculous reconnection, but where the signal from Radio Linus should have been there was nothing but dead air.\n When he’d showered and eaten breakfast, Rufus sat glumly scrolling through advertisements for investigators. The fact that everyone promised “discretion” only made the whole business seem sleazier. If Linus had found a girlfriend who’d persuaded him to walk away from the shared house of his brothers’ skulls, all power to her; the two of them should be left in peace, not chased down with a telephoto lens as if they were adulterers hiding from jealous spouses.\n But . . . persuaded him in the space of a day? As far as Rufus could tell, there’d been no candidate waiting in the wings to take on the role of liberator. Silus was right: the sheer speed with which Linus had cut all his ties with them raised doubts about how freely he’d acted. And if the PI found him blissfully shacked up with some mono-cerebral Juliet after all, the happy couple need be none the wiser. Linus’s brothers could step back and give him space, reassured that he was safe, and hope for invitations to the wedding.\n Rufus picked a firm in Lane Cove, reasonably close to Linus’s haunts, and diligently checked the details against the official register. The website offered him an appointment at eleven o’clock, so he steeled himself and prepared to rip away the bandage. Sharing the family’s secrets with a total stranger almost never went smoothly, but if that was what it took to protect their brother, so be it.\n 3\n As Rufus entered the waiting room, his phone pinged with a message telling him he’d be seen shortly, and in less than a minute this promise was fulfilled.\n “Mr. Bennett? I’m Catherine Leong. Please come through.”\n Rufus followed her into her office. She ushered him into a seat, then sat behind the desk and glanced down at a tablet.\n “You’re concerned for your brother, but you don’t believe this is a matter the police would be willing to take up?”\n “That’s right,” Rufus confirmed. In fact, the firm’s website had stated that it would redirect him to the police if he checked any of a list of potential red flags.\n “Why do you think he might be in trouble?” Leong asked.\n “He cut off contact with the whole family very suddenly. No arguments, no warnings.”\n “He just stopped returning your calls? Since last Thursday?”\n “Yes. And it looks like he moved out of his apartment at the same time.”\n “Is it possible he just lost his phone,” Leong suggested, “and with the move he’s been too busy to replace it?”\n “Not really.” Rufus squirmed inside, unprepared despite all his rehearsals. If this woman was so good at her job, why didn’t she know everything about the family already? But the names had all been redacted from the court files, and no one had paid her to go trawling yet.\n Leong paused expectantly, giving him a chance to explain what he meant, but when he remained silent she tried prompting him. “You live in Adelaide, right? So do you meet up in person regularly?”\n “Not in person.” Rufus clenched his fists and inhaled slowly. “We have neural links. All four of us. We share each other’s memories. They took us off the boat when we were eight.”\n Leong was clearly thrown for a moment, but she retained a professional demeanor. Rufus guessed she was in her early forties, so mid-twenties when the story broke. Unless she’d been living in a cult of her own, she’d know exactly what he was talking about.\n “You were born on the Physalia?”\n “That’s right.” Rufus had to give her full marks for not only recalling the name, but pronouncing it correctly.\n “And you and Linus are quadruplets?”\n “Yes. The others are overseas, studying.” No idiotic blather confusing them with “clones.” Rufus’s experience had set the bar low, but he felt entitled to a small celebration at every sensible word that came out of her mouth.\n “Forgive me if I’m not clear on exactly how this works,” Leong said. “When you say you share each other’s memories . . . ?”\n “We wake up recalling what the other three did,” Rufus replied. “When we sleep, as well as consolidating our own experience into long-term memory, we receive enough data to do the same with the others’. We remember being them, as well as ourselves.”\n Leong pondered this. “Does that stretch to everything they planned as well? Everything they imagined?”\n Rufus said, “Maybe not everything. I mean, when we were on the boat, Linus used to tell us he was building a castle under the sea—which confused the hell out of me, because I couldn’t even remember him imagining it. But I doubt he could plan something as concrete as cutting his ties and moving home without any of us knowing about it.”\n “Okay.” Leong consulted the tablet again. “You’ve said that Linus wasn’t working. Is he on unemployment benefits?”\n “No. There was a settlement a few years ago with the organization that ran the Physalia; all the children got some compensation.”\n “So you’re independently wealthy?”\n Rufus laughed. “More like independently not-quite-starving. It’s a small income stream, not a lump sum. Caius and Silus use theirs to supplement their scholarships while they’re finishing their PhDs; I’m the only one of us with a job, so I pool mine with Linus’s to keep him afloat.”\n “What do you do?”\n “I’m a high school teacher. Mathematics.”\n “And how does Linus pass the time?”\n “Swimming,” Rufus replied. “Walking. Reading.”\n “What kind of books?”\n “Nineteenth century fiction, mostly.”\n Leong grimaced. “So what’s his plan? What does he want from life?”\n Rufus had no definitive verdict on that, so he confined himself to the facts. “He’s tried to get work in the past. Mostly seasonal, like fruit-picking. But it’s been hard to find for the last few years.”\n “Could he be working on a farm right now?”\n “I suppose so. But I don’t know why he wouldn’t have told us.”\n Leong hesitated. Rufus said, “You can ask me anything, I won’t get angry.”\n “Does he share your skills? Yours and your brothers’?”\n “Up to a point. I’m sure he could teach my classes, and he probably understands most of the research the others are doing. But if you’re wondering about employment, since he has no formal qualifications he couldn’t just walk into a teaching job, let alone a PhD.”\n “What are your brothers studying?”\n “Mathematics. Different subfields, but . . . not wildly different.”\n “Wasn’t the original idea that you’d all have complementary talents?”\n Rufus said, “You’re giving the cult a bit too much credit. The original idea was that we’d form the first layer of building blocks in the construction of a vast, transcendental hive mind.” He couldn’t quite believe he’d just said that, in a mundane office in suburban Lane Cove. “My parents were gullible idiots, caught up in a group delusion with some unscrupulous, mildly tech-savvy nutjobs. The plan wasn’t about giving us a head start getting into Harvard; they thought they were on the verge of conquering the galaxy.”\n Leong persisted. “So it gave you no advantages at all?”\n “Well, we might have been prodigies early on,” Rufus conceded. “We learned very quickly, if not quite four times as fast, or four times as broadly. We could all speak five languages by the time we were six, but there were a lot of nationalities on the boat, so I’m not sure we would have needed the link for that. In the real world, we were thrown off-balance by the dislocation for the first few years, but we did all get straight As in high school by sharing everything we learned. So we were more like members of a moderately efficient study group than potential cogs in a global superintelligence.”\n Leong smiled warily. “You haven’t switched it off, though? After sixteen years?”\n “It’s who we are,” Rufus said. “When they tried to wean us off it after the raids we went ballistic, and the psychologists decided to leave it in our hands.”\n “I get the sense that you don’t tell many people about it.”\n “No.” Rufus knew what she was driving at and decided to spare her any need for delicacy. “We’ve all had relationships with women who had no idea that three other people would remember everything that happened. If that sounds unethical, maybe it is, but full disclosure is a lot to expect of someone if they know it’s either going to ruin their chances or turn them into some kind of . . . novelty.”\n Leong nodded slightly, suggesting that none of this even registered on the scale of improprieties she was inured to. “You’d probably know if Linus had commenced a new relationship,” she said. “But what about someone from his past? Could someone have turned up, with enough of a prior connection to persuade him to make a sudden change like this?”\n “It’s possible,” Rufus admitted. By Linus’s own assessment every breakup had been final, but it didn’t necessarily follow that he would have turned down a second chance.\n “If you could send me a list, that would be helpful.” Leong caught the flicker of unease on his face, and added, “All I’ll tell them is that Linus’s family is concerned for him, and want to know that he’s safe.”\n “Sure.”\n “What about other people from his past?” Leong wondered. “Your parents . . . ?”\n Rufus said, “They won’t get out of prison for at least four more years, and none of us have been in touch with them since the trial.”\n “Can you give me a list of his school friends? And anyone else with enough of a history that he might hear them out if they showed up on his doorstep.”\n “Okay.”\n “Do you have a recent photo?”\n “This is four years old, sorry.” He showed her a picture on his phone of Linus standing in a mango orchard, visibly wilting at the end of his first day laboring in the tropical heat. Rufus still felt a secondhand ache in half the muscles of his body every time he smelled the fruit.\n Leong accepted a copy via airdrop, then leaned back in her chair. “Those names will be a start, and I can talk to his neighbors as well. But before we move ahead . . . you will have seen the rates on our website. There’s a six-hour minimum, payable in advance, and then each extension will require the same payment. Are you ready to sign up for that?”\n Rufus said, “I’ll need to confer with my brothers first.”\n For a second, Leong betrayed a hint of discomfort, as if she was afraid that his eyes were about to roll back into his skull while he muttered to himself in three different voices.\n Rufus rose from his seat and held up his phone as he headed for the waiting room. “Can you give me two minutes?” he asked. “It’s pretty late in Bonn and London, but I messaged them earlier, so I know they’re waiting for my call.”\n 4\n Rufus dreamed that he was Caius, contemplating a lattice of spheres in a space of some unspecified higher dimension, trying to decide if a certain kind of hyperplane lay entirely within the gaps between the spheres, or if it would be forced to intersect some of them. He swung the hyperplane back and forth, agitated, hunting for a solution. But the problem was not purely mathematical; Caius was sure that the answer would determine whether or not the police would be able to prove that he had murdered Linus.\n As Silus, Rufus dreamed that he was back on the boat, half-watching their favorite cartoon, half-living inside it. The plucky meerkat Lano had tracked down the villainous hyena, Raggler, to a desolate canyon, where he was holding a litter of baby meerkats hostage.\n “Let them go!” Lano demanded angrily. As he approached the cave where his foe lay in wait, his voice echoed from the rock face, but it faded with each reverberation, ending in a plaintive whisper. And though his shadow stretched for ten times his height along the dried riverbed, it remained so slender that it was lost in the vastness of the canyon.\n “Let them go!” Lano bellowed. “Don’t make me come and get them!”\n Raggler laughed derisively. “Come and get them, will you? You and whose army?”\n Silus knew exactly what that line foretold; every time a hapless wrongdoer invoked it, it summoned the same kind of triumphant finale. But as he looked back toward the top of the canyon, there was no meerkat cavalry, no swarm of brotherly solidarity to transform the villain’s taunt into an unwitting prophecy.\n And then Rufus dreamed that he was Linus, swimming across the ocean, away from the boat toward the invisible shore. But after a certain number of strokes, anticipating by sheer force of habit the wall at the end of the swimming pool, he curled up, tumbled over in the water, and reversed, back toward the Physalia.\n When the alarm went off, Rufus was sure of it: Linus was back. Why else would he have dreamed through his eyes? But as he searched his memories, there was nothing new. The dreams had left a hazy penumbra around the border, but everything still ended on the same Thursday.\n With the room still in darkness he cast the blankets aside, then he saw a pale light shine briefly from the skin of his forefinger. He touched it again with his thumbnail, which had dug into it a moment before. The glow returned, then died away as he increased the pressure. The genes that made some of his neurons glow for the benefit of the link weren’t meant to be expressed in his peripheral nervous system, but it happened now and then. He remembered trying to convince a confused bedmate that the fluorescent dye from a nightclub stamp could glow without being bathed in ultraviolet—but he wasn’t sure now if he’d been the one making the argument.\n It was his first day back at work after his trip. He’d only been away for a week, but every class was a struggle; the substitute teacher had followed his lesson plans, but as he reviewed the material his students seemed to seize upon any opportunity to disrupt the flow, as if he was a student teacher again and they all smelled blood in the water. Rufus hunted for the ease and self-confidence he’d had in front of the same audience just days before, but he kept finding himself saying something clumsy or misjudged every time he tried to restore the status quo.\n In the staff room at lunchtime, Dianne Unger caught him staring at her copy of The Brothers Karamazov.\n “Any good?” he asked.\n “Wait until I’ve finished it,” she said. “Then I can loan it to you if you like.”\n “Thanks.”\n In the evening, when he’d finished his usual routine in the gym, he tried swimming a few laps in the pool. But it was a quarter the length of the one Linus was used to, fracturing his rhythm, throwing him off-balance over and over, even when he thought he’d prepared himself for the too-frequent turns.\n In the changing room, he checked his phone and saw a message from Catherine Leong: Can you confirm that this is Linus?\n The picture below came with metadata stating that it was taken six days ago, in the international terminal at Sydney airport—about an hour before Rufus’s own domestic flight had touched down. Linus was wheeling a suitcase across the carpet, caught in the background of another traveler’s social media snap. He wasn’t facing the camera, but in profile he seemed no more anxious than anyone with a boarding time to meet and a gate to find. Rufus could see no obvious companion, no woman or man who was looking toward Linus with even a trace of interest. If he was eloping, his beloved was off queuing for the toilets. If he was being kidnapped, his abductors had him on a very long leash.\n Rufus phoned Leong. “It’s him,” he said. “Do you know what flight he caught?”\n “Sorry, no. That’s the only image I could find. From the time stamp it’s most likely he was going to Singapore or Kuala Lumpur, but, well . . . ”\n “Yeah.” That ruled out the Americas and the Pacific, but left the entire remainder of the planet. “There’s no way that Linus could afford a ticket himself, though. When he checked his bank balance a fortnight ago, he had thirty-six dollars.”\n “You can’t access his current records?” Leong asked, clearly as frustrated by Rufus’s truncated omniscience on all things Linus as he was himself. “Not that I’d encourage you to break the law.”\n “All our online security is iris and fingerprint,” Rufus explained. He didn’t have the heart to tell Leong that no one under thirty had ever used a password, whether or not they were a neurally linked quadruplet.\n “He doesn’t look as if he’s under duress,” Leong said reluctantly.\n “No. But who decides to skip the country like that, without telling any of the people who’ll be worried?”\n “Stranger things have happened,” Leong replied. “Maybe he had some simmering resentment you never picked up on. Maybe he bumped into someone who offered him a chance for a fresh start, and he was afraid you’d try to talk him out of it. His life was going nowhere; he didn’t need to blame you for that to decide that the ties to his family were part of what was holding him back.”\n Rufus couldn’t dismiss any of this, but he didn’t believe it. “What now?” he asked.\n “I talked to everyone on the lists you gave me,” she said. “None of them admitted to any recent contact with Linus, and none of them were out of the country.”\n “Okay. So . . . ?”\n Leong hesitated. “Is it fair to say that growing up on the Physalia was the most formative experience in your brother’s life?”\n “Absolutely.”\n “So as a driving force, it would be off the charts compared to some old girlfriend showing up?”\n “Sure, but . . . ” Rufus was about to object that Linus hadn’t been brooding about the past in the run up to his flight, but that wasn’t what Leong was suggesting. “You think someone from the boat got in touch with him?”\n “You don’t believe that’s possible?”\n “All the adults are in prison. I suppose there’s a chance one of the other kids could have tracked him down somehow—but I wouldn’t know where to begin finding any of them myself.”\n “Okay.” Leong didn’t push him. “Maybe take some time to think about it, and let me know if it’s a line you want me to pursue.”\n As Rufus walked home, he tried to decide exactly what position he should take when he broke the news to the others. None of Leong’s suggestions made much sense to him, but he had no better hypothesis of his own.\n He closed his eyes for a moment and did his best to set his own preconceptions aside and defer to the expert. But all that the Linus inside him wished to dwell on was the Dostoyevsky novel he’d been promised, and the chances of finding a better place to swim. Maybe the power of whatever had lured him out of the country lay in their shared past—but the actual trigger must have fallen from the sky, as much of a shock to Linus as it would have been to any of them.\n 5\n As Silus listened to his brothers arguing, he stepped back from the conversation and let their doppelgängers follow along in his stead, nodding in all the right places while he thought through a plan of his own.\n Leong must have requested a targeted search from a face recognition service, limited to Sydney’s transport hubs; any wider scan would have been too expensive. But now that Linus had left the country, the possibilities had exploded exponentially. They couldn’t afford to hunt through half the planet’s social media posts, hoping to get lucky again. Not at commercial rates.\n So they really had no choice but to crowdsource it. The official missing persons apps only matched against official lists; they would need something of their own. And they’d need a rapid take-up, since they were starting from a base of zero. Their app would need to go viral, even if it was a joke a few days later, and entirely forgotten a week after that.\n When the chance finally came to get a word in, he said, “Which Noah do you know?”\n Caius scowled. “What are you gibbering about?”\n But Rufus got it. “Noah Tribedi,” he explained to Caius. “He was in Idiot Empire, about four years ago. You must remember me watching that. But the point is, Tribedi’s had a wildly different look in every show he’s ever been in; people joke that it’s only a matter of time until he plays a character who resembles your favorite food.”\n Caius’s face was already crumpled in resignation, and his doppelgänger was thinking: these fools are going to do this whatever I say, so there’s no point arguing about it.\n Silus took up the thread, touting the idea with exaggerated enthusiasm just to annoy Caius. “So we put out a free app called ‘Which Noah do you know?’ that scans your social media feed and tells you the closest matches between your friends and each of Noah’s characters. It even offers you some side-by-side comparisons to post: ‘Here’s Diego at Vera’s party last week, the spitting image of Noah in All the Pretty Murderers!’”\n Caius said, “Just pretend I’m not here.”\n Silus talked over the logistics with Rufus. The code itself would be trivial, invoking standard toolkits in any of the phones it ran on. The permissions it needed from the user would be precisely those that the advertised purpose required. And though the pictures of Noah were subject to copyright, and couldn’t be embedded in the app if it was to pass the vetting process, they could embed URLs for the officially published versions that the app then worked from—and at the end of the process, they could outsource the merging and captioning of the images to one of the meme-building sites that the studios already tolerated, or positively encouraged.\n “How do we smuggle a picture of Linus into the app without giving the game away?” Rufus wondered. “I mean, we can obfuscate the image itself, but whatever encoding we use . . . last I heard, Apple wanted ten-page explanations for every chunk of data that goes into the bundle.”\n Silus was stumped for a moment, but then he had it. “I’ll change my profile picture on GitHub to a picture of Linus, and then we’ll disguise the comparison with Linus as a calibration run. We don’t even need to embed the image; we just have the app use the developer’s own, publicly available picture of himself as test data. What could be more innocuous than that?”\n Caius said, “If anyone decompiles this and inspects it properly—”\n Rufus laughed. “Why would they bother?”\n “Some people have a lot of time on their hands.”\n Silus said, “There are a thousand times more phone apps than there are people in the world. If ours ever gets so popular that it starts to draw enough attention for any human being to care exactly what it’s doing behind the scenes, we will already have completed a few hundred grands’ worth of Linus-hunting for free.”\n 6\n When Silus tested the app on his own feed, it turned out that nobody he knew looked like any Noah at all. Rufus and Caius had no better luck.\n “Keep the name,” Rufus suggested. “But add a few more chameleonic celebrities.”\n Silus dredged through the swoon accounts of his target demographic, scooping up dozens of actors and singers he’d never even heard of. What he really needed was a list so complete that no customer would walk away unsatisfied.\n “‘Sorry, you know no Noahs,’” Rufus read from his results, “‘but here are your best three Lydias, your top two Simons, and your number one Ga-yoon.’”\n “I think we’re at a sweet spot,” Silus decided. “If we loosen the resemblance criteria, or go further down the B-list, people will just groan.”\n Caius opened his mouth, but then thought better of it. Rufus said, “Time to launch.”\n Silus had a meeting with his adviser in ten minutes. He drained his mug of hot chocolate, submitted the app to the six stores they were aiming to reach, then switched his phone off and set off across the campus.\n As he was leaving the café, Linus’s doppelgänger said, “This is all very touching, but what if I don’t want you to find me?”\n “Do you know for a fact that you don’t?” Silus countered.\n “No,” the doppelgänger admitted.\n “What’s the worst that can happen?” Silus pressed him. “If we find you, when you’d rather we didn’t?”\n “I don’t know. But whatever made me leave without a word, I know it must have been important. Don’t you trust me on that?”\n “I trust you,” Silus assured him. “But what if it wasn’t your decision? What if there was a gun to your head? You need to trust the three of us as well.”\n The doppelgänger fell silent. Silus strode across the grass, trying to clear his head.\n In the weekly meeting with his thesis adviser, he was meant to describe any progress he’d made and any obstacles he’d encountered. But the truth was, he’d barely given his work any thought since Linus had gone missing. So he sat beside Dr. Tamura and bluffed his way through forty excruciating minutes, pretending that an idea that had come to Caius out of the blue while he flossed his teeth a few nights ago was the product of his own tortured efforts over the last seven days.\n “Will you name me as a coauthor?” Caius’s doppelgänger enquired as Silus finally escaped from the room.\n “Fuck off. Next week I’ll tell her the whole thing was a dead end.”\n “I think it’s exactly what you’ve been looking for,” the doppelgänger taunted him.\n “I don’t care. I’ll find a better method myself.”\n Silus sat down at the edge of the quadrangle. He steeled himself and switched on his phone. The app had been accepted into five of the stores; the sixth had raised a long list of trivial issues because the automated checker didn’t understand its own company’s policies. Silus fixed them all, resubmitted the app, received five new objections, and went through the cycle again. By the time he was done, the aggregated download count for the other five stores had already passed a hundred thousand.\n A few minutes later, hits started coming through . . . showing himself, Rufus, and Caius. Silus had been expecting that, and though he’d set up a filter to screen out any of their previously known cameos in the lives of actual friends, the only way to find any of the cases when they’d been snapped in the background by a total stranger was the process now underway.\n Rufus, who was seeing the same results, sent a message: At least we know everything’s working.\n The download count kept rising, but the new matches slowed to a trickle. Silus had an ache in his gut; if he’d screwed this up, it might have cost them their only chance to find their brother before he covered his tracks. “Would you have guessed we’d do this, and taken countermeasures?” he asked Linus’s doppelgänger.\n “I didn’t manage that in the airport, did I?”\n “But once you’d reached your destination, would you have started walking around in a hoodie? Covering your face every time you saw someone raise their phone?”\n The doppelgänger considered this. “Now that I know what you’re doing, it seems obvious in retrospect. But I’m not sure how long it would have taken me to think of it myself.”\n “None of us are just ourselves,” Silus retorted.\n “True. But I would have had as much trouble anticipating what you’d do as you’re having now anticipating what I’d do.”\n Silus’s phone pinged. He glanced at the latest picture, and scrolled down to see the metadata, but it had been stripped out by a user intent on preserving their privacy.\n He looked at the picture again. His first thought had been that the figure caught striding past behind the smiling couple was Caius, but now he was almost certain that it wasn’t. The backdrop was dominated by a wrought iron fence, in front of a courtyard with weeds growing through the cracks between paving stones. Neither he nor any of the doppelgängers could recall seeing the place before—though there were probably thousands of houses that they’d walked past dozens of times but would never have recognized out of context.\n A few seconds later, Rufus initiated a group call. “That’s definitely Linus,” he said. “And it must be recent.”\n “Why?”\n “He never owned a jacket like that in Sydney.”\n “Have you tried a Street View match?” Caius asked impatiently.\n Silus laughed. “That’s ten thousand US dollars!”\n “Globally. We’ve ruled out the Americas.”\n Silus opened the app and got a quote. “Without the Americas, it’s still six thousand.”\n “What about the jacket?” Linus’s doppelgänger suggested. “I’d only buy something like that if I didn’t have time to hunt down something I liked.”\n “Give me a minute,” Silus told the others. There were more than seven hundred free apps that offered to find a product matching a photo; the first six that he tried returned links to items with only a superficial resemblance.\n The seventh produced an exact match. Though the jacket was made in China, and a couple of online stores would ship it anywhere, the only bricks-and-mortar outlets that stocked it were in France.\n Silus rejoined the chat and showed them what he’d found. “A Street View search of France is still a thousand,” he grumbled.\n “And what would it tell us?” Rufus wondered. “Wherever this was taken, he might not be that close anymore.”\n Silus’s phone pinged again. In this image, Linus was walking past a café, distracted, frowning slightly. The photo had been taken from inside, and the name of the establishment wasn’t visible, but the user had left the metadata intact. “Jouy-en-Josas,” Silus read. “Four days ago.”\n Rufus beat him to the search. “Best known for HEC Paris: École des hautes études commerciales.”\n Caius started laughing in disbelief, and Linus’s doppelgänger joined in.\n Rufus said, “You know the joke: if I ever call you to say how much I enjoyed a Wagner opera, it means I’ve been kidnapped and they’re listening in. But even if you really want to ram the message home . . . how do you talk the kidnappers into buying you tickets to the Bayreuth Festival?”\n Silus didn’t want to rush to any conclusion, but whichever way he read it seemed equally bizarre. Unless Linus had chosen this particular Parisian suburb for some other, even more obscure reason, it looked as if he’d packed his bags, fled the country, and cut off all ties with his family, in order to enroll in a French business school.\n 7\n Caius said, “Leave it with me. I can ask around; if he really is there, it shouldn’t take long to find out.”\n He put down his phone and thought for a moment. Before he started imposing on his French colleagues, there was a chance he could resolve the whole question himself. He opened the HEC website and looked through the section on international scholarships. Was there really a route by which a penniless foreigner who’d done no more than finish high school could win a coveted place in one of the most prestigious grandes écoles?\n Incredibly, there was. A decade ago, a wealthy benefactor had endowed a program that allowed applicants from across the globe to take an online admission test, with the ten highest scoring entrants flown to Paris for interviews. The last day to apply for the current round had been the day Linus had fallen silent.\n No recipients of the scholarship were listed on the site, let alone current finalists, but that was probably just due to a cautious reading of EU privacy rules. Caius didn’t doubt that Linus could have mastered anything he’d put his mind to, given time. And a certain portion of the test might well have required no more than the level of purely mathematical aptitude that all four of them possessed. But there was nothing Linus could have drawn on, from any of their histories, that would have elevated him—within a few hours of making the decision to apply—into the top ten candidates when it came to economics, management theory, or business law.\n Could he be wrong about that? Caius closed his eyes and pictured the memory palace he’d built from everything Linus had shared. He passed through the grand foyer with its swimming pool, the library with its shelves full of Balzac and Flaubert, the study lined with blackboards packed with mathematical exposition. Linus had pondered concrete examples to illustrate many of the abstract theorems on display, but his choices were geometrical: sculptural rather than mercantile. It was only after rummaging through a dozen increasingly small and dingy side-rooms that Caius finally found the word “Finance”—on a squashed cardboard box that looked like it might once have held washing powder, at the bottom of a pile of junk sitting in the corner of a disused garage.\n And yet, there Linus was, in just the right place at just the right time to be interviewed for a scholarship he couldn’t possibly covet, let alone win.\n Caius emailed a recent coauthor, Sophie Allard, who worked in a complex-systems modeling group at the University of Lyon that had links to the econometric world. He tried to keep his dishonesty to a minimum, writing, “I heard a rumor that my brother Linus was short listed for this year’s Guinard scholarship at the HEC! He’s too modest to tell me something like that, but I wonder if there’s any way to check if it’s true? If it is, I want to surprise him there and offer congrats/support!”\n As soon as he’d sent the message, the whole idea seemed ten times more absurd than before. Maybe Linus had won a few thousand dollars in a lottery and decided to spend some time in the city where so many of his favorite novels were set. He might have passed through Jouy-en-Josas on his way to see the Palace of Versailles. And he’d pulled the plug on his brothers out of some misguided notion that they’d begrudge him not sharing the windfall. And though Linus had never actually bought a lottery ticket in his entire life, as far as anyone knew, if he’d acquired the money by some shadier route that would only make it more explicable that he’d decided to keep it to himself.\n Caius pushed these speculations aside. There was no point trying to conjure all the answers out of thin air; he needed to be patient and wait for the facts. He picked up his notebook and started reviewing the calculations he’d been trying to finish for the past ten days. While Linus hovered at the edge of his thoughts, crisscrossing Paris in some kind of furtive homage to Jean Valjean, Caius turned his attention back to the lattice he was trying to characterize. Finding the shortest distance between neighbors by a brute force search would be an intractable computation, but he had a set of inequalities that he still hoped could be used to pin down the distance indirectly.\n Three hours later, he’d made enough progress to think about taking a break, and the smell of cooking from the apartment below was making him salivate. He opened his laptop and checked his email; Sophie had replied more than an hour before. She’d pasted in a chain of replies from other correspondents on the matter, but her conclusion was right at the top.\n “Hi Caius, yeah your brother’s at HEC! And not just short listed anymore, he got the place! Congratulations! I’m sure he’ll be happy to see you!”\n 8\n “I’ve been looking into Marcel Guinard,” Rufus said. “He made his first billion in a micro-payments start-up at the turn of the millennium, then played the stock market well enough to keep getting richer, even while he blew half the profits on vaporware. He’s endowed a few chairs and funded a few institutes for tech bro bullshit around the world: Simulation Cosmology in Berkley, Superintelligent AI in London, Singularitarian Theology in Rome. I can’t link him to the Physalia directly, but even if he didn’t play some covert role in funding it, I don’t believe for one second that he wouldn’t know about Linus’s past.”\n Caius had assembled the same sketch of the man for himself, but it still made no sense to him. “What’s the deal, though? He’s gathering up children from the boat to have another crack at the whole hive mind fantasy?”\n Silus said, “As bribes for human experimentation go, offering an MBA to a Dostoyevsky fan . . . ?”\n Caius laughed wearily. It was after midnight, and he had to catch the train to Paris at six a.m., but he couldn’t tell his brothers to be patient and wait for him to report back. None of them were going to sleep until they knew exactly what Linus had got himself into.\n Rufus said, “So the scholarship’s just a pretext for him to be in Paris. The real bribe will be in cash, and I’m sure they’ll let him skip as many classes as he wants.”\n “Why does he have to be in Paris?” Caius protested. “If Guinard has persuaded him to unplug us and link up with a different group, the participants could be anywhere.”\n Rufus sighed at his obtuseness. “Whoever’s running this needs to have physical control over the guinea pigs, in case they start having second thoughts.”\n “If this billionaire wants to stuff money into Linus’s bank account while he catches up with some old friends from the boat, he might have been tempted into humoring the fucker,” Silus conceded. “Taking in memories from a whole new set of people might even be fun for a while, and when they fail to evolve godlike powers—because they’re basically just swapping stories about their foster homes—they can all walk away a little richer, while Guinard walks away a little crazier.”\n Rufus wasn’t so sanguine. “And what if he wants them there in person so he can open up their skulls for an upgrade?”\n “If Guinard was going to take the risk of installing new hardware in his subjects’ heads,” Silus said, “why drag the Physalia kids into it at all? The only value someone like Linus has is that he comes with the link preinstalled, and the crime of putting it there has already been paid for.”\n “And his neurons are already tweaked for optical channels,” Rufus added. “It takes time to raise an engineered child to the age they need to reach before they’re any use to you.”\n Caius shared his anger, even as he observed it with a kind of detachment. They’d thought they’d put the Physalia behind them; for anyone to drag them back into that deranged world was unforgivable—and trying to pick off the most vulnerable of the survivors only made it worse. “What did Guinard think we’d do?” he wondered. “Just stop searching for Linus? Or swallow the whole ridiculous cover story?”\n Silus said, “More to the point, what did Linus think we’d do? He must have had a plan when he pulled the plug on us. He must have had his reasons.”\n “Yeah.” Caius ran a hand over his face. “But I’m sure he’ll make it all clear when I ask him.”\n 9\n Caius didn’t actually doze on the train, so much as lapse into a sleep-deprived state in which his thoughts succumbed to a kind of dream logic. The journey from Bonn to Cologne was secretly taking him back to Adelaide, to the apartment he’d shared with Rufus and Silus when the three of them were undergraduates, and Linus had traipsed around the countryside looking for work. Silus had called it Schrödinger’s gap year: education and adventure at the same time, with none of them really missing out on anything.\n When he stood on the platform in Cologne, waiting for his connection, the clock measured out the time for one of Linus’s high school swimming competitions. Caius could recall watching him powering through the water ahead of his rivals, but later he’d felt Linus’s own proprioceptive joy, which didn’t depend at all on beating the competition, but only on creating something entirely his own and sharing it with the rest of them.\n The next train carried him back to the Coopers. Caius couldn’t blame them for their clumsy attempts to carve separate identities out of the strange, conjoined creature they’d agreed to take into their home. They’d had no one to advise them on the right way to deal with four traumatized children who’d just discovered that their parents had created them as a kind of technological asset to be deployed in a global war between different forms of superintelligence. The one blessing was that they’d been taken off the boat before anyone had considered them ready to be indoctrinated into that fantasy; they hadn’t needed to be deprogrammed from the cult, because the cult had merely brainwashed them into thinking they were perfectly normal.\n In a restroom in Brussels, Caius splashed water on his face and slapped his cheeks until they stung. He grabbed some hot chocolate from a vending machine, then caught the train to Paris with the warmth still suffusing out from his esophagus. He took out his notebook and reread his calculations from the day before; he couldn’t move past the last stumbling block he’d hit, but the mechanical process of checking and rechecking what he had almost kept his mind occupied.\n From Gare du Nord, he took the B line south to Massy-Palaiseau, then he changed for Jouy-en-Josas. This was still suburban Paris, but as the train approached the station the patches of woodland beside the tracks were lush green. There was a bus he could have taken all the way to the campus, but he needed a walk to clear his head, and as he made his way along Rue de la Libération birdsong rose up over the traffic noise.\n The map of HEC showed ten different dorms, and Caius couldn’t parse the system by which the students in different courses were allocated between them. But the sixth place he checked had Linus’s name scribbled in on a directory in the foyer. Caius walked down to the room, but was unsurprised to find the door locked and no one answering. He sent Linus an email, telling him where he was and asking if they could meet; there was no point playing hard to get now that the two of them were a few hundred meters apart. Then he went and sat outside the dorm in the sunshine.\n His eyes had fallen shut when he heard a voice close by. “You want to grab some lunch?”\n Caius looked up; he hadn’t been dreaming.\n “Sure,” he said. “Let’s do that.”\n 10\n In the self-serve cafeteria, the first thing Linus put on his tray was a pot of tea. Caius was bemused, but he said nothing; a change in taste they might have joked about a month ago no longer really rated in the greater scheme of things.\n When they were seated, Linus took a sip of tea, then started eating. He didn’t seem angry that he’d been hunted down, but he showed no sign of being on the verge of volunteering any explanations.\n “Hogy vagy?” Caius asked.\n Linus smiled. “I’m fine, but my Hungarian’s pretty rusty. Can we stick with English or French?”\n “I thought it might be worth it, just to give us some privacy.”\n Linus glanced around. “No one’s going to be listening to us. We’re not that interesting. If we start speaking Hungarian, any Hungarians in the room will tune in straight away.”\n Caius said, “I’m sure the odds of a Hungarian within earshot are less than a thousand to one.”\n “You’re probably right. But I really am rusty.”\n Caius nodded. “You had us worried,” he said. “Did you really need to pack up and leave without a word?”\n “I’m sorry.” Linus twirled spaghetti around his fork. “But once I’d made up my mind, I wasn’t in the mood to have a big debate about it.”\n “About what, exactly?” Caius pressed him. “I wouldn’t have thought it would be too hard to make your case. This place churned out more Fortune 500 CEOs in the last twenty years than Harvard. Who could turn down a chance like that?”\n “Not me.”\n “I’m just surprised it took so long for your hidden passion for the business world to reveal itself.”\n Linus said, “You’d rather I spent my life squinting into the searing light of your genius?”\n Caius laughed, but he was taken aback, less by the words themselves than his own uncertainty as to just how seriously he was meant to take them. “You could have done anything you liked. I know it’s been hard for Silus sometimes, because his interests are so close to mine. But if you’d become a writer, or an athlete, or any fucking thing short of stealing my thesis topic, neither of us would ever have had to feel like we were riding on the other’s coattails.” He shook his head irritably. “Anyway, can we drop the bullshit? I know you’re not here to polish your business acumen.”\n “No? Why, then?”\n Caius thought of trying Hungarian again, but he’d been told there was no need to censor himself. “You’re here because your benefactor wants to exploit what’s in your head.”\n “Really?” Linus feigned astonishment. “Exploit it how?”\n “I was hoping you’d clear that up, but my own tiny hive mind’s consensus is Physalia Mark Two.”\n Linus gestured at the crowd of diners around them. “Do you see anyone else from the boat here?”\n “It’s been sixteen years,” Caius replied. “I wouldn’t recognize them if I was staring right at them. Besides, they wouldn’t need to be physically close to you.”\n “So I’m in Paris myself because . . . ?”\n “I don’t know,” Caius admitted. “The only thing I know for sure is that you’ve never had the slightest interest in anything this place has to teach you.”\n Linus gazed at him with amused defiance, but didn’t contradict him. Finally he said, “Maybe I decided to acquire an interest.”\n “What does that mean?”\n “I spent twenty-four years acquiring interests from the three of you. Maybe I decided to look elsewhere.”\n Caius said, “All right. But what exactly did Guinard offer you that made you want to look here, in particular?”\n “A career path,” Linus replied. “Better prospects than I’ve ever had in my life.”\n “And what does he get in return?”\n “Every scholarship holder reports back regularly on their progress. That’s all that’s expected from me.”\n Caius realized he’d been eating too quickly, risking indigestion. He slowed down, chewing his current mouthful thoroughly before swallowing.\n Marcel Guinard was ninety-four years old. Over the decades, he’d thrown money at every crackpot scheme for longevity that had held out its supplicant hands to him, and seen them all come to nothing. No doubt he was still clinging to the hope that an antifreeze cocktail and a liquid nitrogen bath could turn him into something more than Ötzi with a manicure—but he’d made a career out of hedging his bets.\n “You’re sharing memories?” Caius guessed. “With Guinard.”\n Linus remained silent.\n “You need to be discreet, because I’m wearing a wire?” Caius joked. “Or is the problem that you’re wearing one yourself?”\n “I told you, I’ve chosen a career,” Linus replied. “At long last. Isn’t that what you wanted? You should be happy for me.”\n So the course was not a sham, exactly: Linus would wake each morning with his mentor’s reflections on the previous day’s lessons to guide him. Guinard could have had his pick of conventional protégés, far better qualified and self-motivated, eager to hear his advice without any need for such intensive tutoring. But Linus’s value to him was as an empty vessel into which he could pour his accumulated wisdom—on the topics at hand, and much more.\n “Where does this end?” Caius asked. “You graduate at the top of all your classes, then Guinard’s company snaps you up. You rise and rise, the golden child, taking on ever more responsibility, proving yourself to be a steady hand. Until . . . what? People will finally believe that when he’s on his deathbed, he’s handing you the keys to the empire on your merits?”\n Linus said, “You make it sound as if there’s something wrong with me succeeding in my chosen profession.”\n “No, the problem is why you’ve chosen it.”\n Linus’s poker face cracked a little, but Caius wasn’t sure what was showing through. “What was I ever going to make of myself, without this? What could I ever have become? You chose the one thing we could all excel at, but then if anyone else tried to take the same path, they’d just end up having to fight you for space.”\n “It wasn’t like that,” Caius protested. “And it still isn’t. You could still do anything you want.”\n “All I ever wanted was what you wanted,” Linus said bitterly. “I never had the power to want anything else.”\n Caius didn’t believe that, but it wasn’t the point anymore. “I’m not asking you to link up with us again. But how long did you wait between pulling the plug on us and letting Guinard into your head? What kind of chance did you give yourself to find a direction of your own?”\n Linus laughed softly. “You make it sound as if I’m a normal person, who could just step out from my family’s shadow and thrive. But you know I’m not like that: I’m a vine, not a tree. On my own, I’d just fall to the ground and die. So I’ve chosen a tree to support me, and to shape my path, instead of tying me up in a race I can’t win. This is what I want, because it’s the best I can do with what I am.”\n 11\n Caius was too agitated to call his brothers immediately, so he set about finding a place to stay for the night. His phone offered him four choices, but none had a check-in time before three p.m., so he picked the one that would take that long to reach on foot.\n As he walked, his surroundings barely registered; he felt as if his head was ringing from the aftermath of an explosion. How had he not seen how Linus had seen him: as someone setting the agenda and then seizing it for himself? He’d understood how it had worked with Silus, but that had always felt like a friendly rivalry, in which, for all his vanity, the two of them were more or less evenly matched. And Rufus, though he’d been infused with the same obsessions, had found his own entirely separate way to pursue them.\n But Linus had had his swimming and his books; he had never seemed to have been jostling for space that the others had occupied. Because . . . what, he’d given up his claim on it so early? Caius’s memories of Linus’s days had seemed to be full of tranquility, not resentment. But maybe the link’s imperfectly transcribed version had missed an underlying sense of resignation. If he’d been squeezed out of the light for so long that he could barely imagine regaining it, his numb acceptance might have been mistaken for genuine contentment.\n Caius checked into the motel. He sat on the bed and made the call.\n “I don’t know what to do,” he admitted, after tersely summarizing his conversation with Linus.\n “Guinard must have tracked down everyone from the boat,” Rufus said, “and sent investigators around the world to observe them. And out of all those people, he judged Linus to be the one most receptive to the notion that the brightest future he could have would require his own erasure.” His voice was unsteady with anger and shame. “So what does that say about the way we treated him?”\n Silus looked equally troubled, but he said nothing.\n Caius said, “I keep thinking we should go to the police—but has Guinard actually broken any laws? Whatever he’s done to install his own link, he could have found a jurisdiction where it was legal for an adult. The fact that Linus has had his link since childhood isn’t Guinard’s fault, in any way that we can prove. And I don’t see how we could force either of them to admit that they’re connected at all, let alone confess to what the endgame is.”\n Rufus was contemptuous of this timidity. “So we stand by and let Guinard bury him?”\n “Have we buried each other?” Silus asked. “Do you think we’re all just clones of Caius by now?”\n “No,” Rufus replied. “But we seem to have squeezed enough life out of Linus, without even trying, that he’s ready to let someone else finish the job.”\n “We need to get him out of there,” Caius decided. “Get him away from that place, and keep him unplugged from Guinard until he’s had a chance to think things through for himself.”\n Silus was skeptical. “You think we’re commandos now?”\n “I’m up for it,” Rufus promised. “I’ll be there on the first flight I can get.”\n Caius addressed Silus. “I’m not talking about breaking into the dorm with knockout gas. We find an excuse to invite him off campus, then take him somewhere with no Internet access for a few days so he can come to his senses.”\n Silus said, “There is nowhere in Europe without Internet access.”\n “Then we put him in a Faraday cage.”\n Silus grimaced in disbelief. “Just listen to yourself! You want to kidnap your brother, drag him off to a cabin in the woods, and force him to wear a tinfoil hat?”\n Caius shared his dismay at the prospect of resorting to coercion, but he couldn’t see any other choice. “We can’t let him walk away from his life, leaving nothing but an empty space for someone else to stand in. If the old way left no room for him, and he’s convinced himself that he can’t survive alone, the only way to put things right is to show him that we can support him from the outside. We need to do whatever it takes to prove that, without getting back inside his head.”\n 12\n As Linus walked along Rue de la Libération, glimpses of the woods behind the wall that lined the road kept evoking memories of Marcel’s youth. He’d got drunk here with some friends on a summer night, in 1976. Linus could see a woman’s face, and he felt a nostalgic affection welling up . . . but he pushed the image away irritably. Tonight he had to be entirely himself, if he was ever going to get his brothers off his back.\n Trudging around the long arc in the road, he could envisage the earnest entreaties ahead. It had been naïve of him to hope that talking to Caius alone would have settled anything; the others were never going to be content with remembering the conversation secondhand. They would need to see him in the flesh and hear the words straight from his mouth. Even the link hadn’t told them, clearly enough, exactly where he’d been headed; they’d just padded out his fading presence with their own ideas of him, and never really noticed how little of the original remained.\n It was dusk when he reached the motel. He lingered by the roadside, working up the courage to take the last few steps. He’d prepared a long speech earlier that he’d hoped would convey what needed to be said, but running through it in his head now it just felt clumsy.\n He walked across the parking lot and knocked on the door. Caius opened it, but the others were right behind him.\n In the face of a quadruple reunion, Linus couldn’t help himself. “Me and this army!” he proclaimed, in his most triumphant meerkat voice.\n Silus laughed, but no one else seemed to have retained their sense of humor. Rufus stepped forward and embraced him, so forcefully that Linus caught himself anticipating reliving the gesture from the other side. But that was never going to happen. The best he could guess was that it was meant as a message: an offering of strength in a common purpose. Linus thumped his back amiably in return, but they no longer shared a purpose.\n “I know this is hard,” he said, once they’d parted, turning to take in Silus as well. “But you have to accept it. I can’t go on as a spare wheel, and I can’t go on by myself. I know you think Guinard is exploiting me, but he’s the one who’ll be giving me a clear direction and then stepping out of my way.”\n Silus grew stony-faced. “If you can stand on your own feet once Guinard is dead, you can do it right now.”\n “How would you know?” Linus retorted. “Whatever goals we had, the three of you divided them up between yourselves a long time ago. Just because I clung on as your backup drive—”\n “We’re not a fucking computer network,” Silus interjected angrily. “That might have been what the cult wanted, but they didn’t succeed.”\n “And we’re not four ordinary people,” Linus said. “That might have been what the Coopers wanted, but they didn’t succeed either.”\n “We’re just asking you to give it a chance,” Rufus pleaded. “Stay unplugged from us, and from Guinard too, and see what happens.”\n “That’s a good idea,” Linus replied. “Guinard suggested exactly the same thing. I didn’t start sharing his memories until a week after I unplugged from you.”\n “And what was that week like?” Rufus asked, though he didn’t sound as if he wanted to hear the answer.\n Linus said, “It felt like I was vanishing. It felt like I was dissolving into the air.”\n Rufus glanced at Caius, as if this revelation had given him pause. But then he said, “Guinard was still pulling strings, though: fixing your test score, buying you plane tickets. What if you came back to Adelaide for a while, and just tried living by yourself?”\n “Doing what?”\n “Whatever you like.”\n Linus said, “There is nothing I like, myself.”\n “You don’t like swimming?” Rufus protested. “You don’t like Balzac?”\n “A couple of hobbies don’t make a life. You want me to sit around living on your charity, struggling to find a reason to get up every morning, hoping that some kind of grand vocation will suddenly crystallize in my brain? Here, I have a curriculum to follow, a guaranteed career that starts at a six-figure salary, and a good chance I’ll be a billionaire before I’m forty.”\n Caius said, “You, or Guinard in his new body?”\n Linus shrugged. “How much of any of you is your own work, alone? Maybe I’m the only one of us who really faced up to what we are, but whatever you think about yourselves, it’s what I know about myself that counts.”\n Rufus regarded him dolefully, and when he approached Linus braced himself for a farewell hug, but instead he found his hands forced together behind his back, while Caius stepped in and put cable ties around them.\n “What the fuck is this?” Linus demanded. He contemplated bellowing for help, but a part of him flinched away from the sheer embarrassment of having a stranger walk in on this family dispute. “You’re so used to dictating what goes into my head, you can’t bear the thought of me choosing for myself?”\n Rufus groaned. “Guinard would say that, wouldn’t he?” Caius pulled a long strip of white cloth from his pocket and proceeded to wind it between Linus’s lips and the back of his neck, before switching to a second loop aimed at holding his jaw closed. As a gag, the whole thing seemed less than ideal, but he guessed they were too afraid of choking him to shove a wad of material into his mouth—and too viscerally defensive of body parts they could all personally recall him using to breathe, eat, cough, and kiss.\n As they maneuvered him onto the bed to tie his feet together, Linus caught a glimpse of the scene in a mirror: the bandages around his face looked like he was being prepared for a role as the Invisible Man. He fought down the urge to keep arguing and complaining, reluctant to reveal how much noise he was still capable of producing. But when they started wrapping the blanket around him, he couldn’t help himself: he began to yell. Rufus knelt on his chest and clamped a hand over his mouth while Silus set to work with a roll of duct tape.\n When he was cocooned in several blankets, he could still feel Rufus on top of him, trembling from the adrenaline. “Just stay still and keep quiet,” he begged Linus. “We don’t want to have to drug you.”\n They lifted him and carried him out of the room. When they started lowering him into the trunk of a car, he needed to assume a near-fetal position in order to fit, but he cooperated placidly. If anything, he was more mortified than ever by the thought that they might be caught in the act. This had moved beyond a motel-room scuffle into a scene that police might treat as the prelude to a burial in the woods, and he wasn’t going to risk drawing a bullet into anyone’s brain.\n Someone closed the trunk. The stale air around him smelled of scented cleaning products. Linus heard the soft purr of the motor and felt the car reversing, then moving across the lot. They couldn’t imagine they had any hope of spiriting him out of the country, but perhaps they’d rented a place where they wouldn’t be disturbed.\n To what end? They genuinely believed he’d die if he stayed, so they’d do whatever they had to in order to protect him.\n The car braked hard, and he heard tires squealing. Someone shouted in French: “Get out! Get out!”\n Linus felt it through the chassis when the doors were flung open. Moments later, he was being lifted out of the trunk, laid down on the ground, and his bindings unwrapped.\n As he rose to his feet, he saw his brothers kneeling beside the car with their faces downturned and their hands behind their heads. He turned to the security guard beside him. “Don’t you dare fucking hurt them! And you can’t call the police.”\n Linus had never seen the man before, but he nodded respectfully. “Of course. We will release them when you’re clear. They will be fine.”\n Linus wanted to reply, “Merci,” but Marcel caught the word in his throat. He works for us. He works for you. Don’t thank him for doing his job.\n 13\n Linus swam through the dark water, away from the boat. He paused and looked back over his shoulder: Rufus, Silus, and Caius all stood on the deck, wretched and abandoned, watching him escape. Why would he leave them behind? His guilt and horror at the thought of his betrayal cut into him like a cord around his skin, and as he moved his arms he saw it: a loop of fishing line, tangled around him, biting into his shoulders and torso.\n Oh, good, I’m dreaming, he thought. He took control, shaking off the silly metaphorical cord and parting the water, creating a slanted cylinder of air that reached from the surface to his house on the seafloor. He slid down the inside of the cylinder, passing through the library’s skylight as smoothly as the camera in Citizen Kane.\n Inside it was warm and the lamps blazed brightly. He shook the water off his skin like a dog and walked barefoot over the carpet to the shelf where the new periodicals were kept.\n The clock on the wall read three a.m. A new pamphlet of Guinard’s memoirs had arrived; Linus settled into a plush armchair and read through the latest installment.\n It opened with Guinard’s recollections of, and reflections on, Waking Linus’s encounter with his brothers at the motel. Linus read and reread the passage carefully, but he could detect no trace of suspicion, no subtext of mistrust. Both Guinard’s spies, and everything he’d now seen and felt through Waking Linus’s eyes, told a story in which the three of them had fought desperately to save their wayward brother. Never mind if the protégé himself had not entirely faced up to the prospect of his own demise, and took solace in a vague conviction that he might endure as a significant component in an amalgamated Linus-Marcel; the three people who knew him best clearly believed otherwise. They understood how weak he was, and how easily he’d be subjugated, then snuffed out entirely.\n Linus skimmed the rest, which consisted of Guinard’s tedious daily routine and even more dreary meditations and recollections, but it was up to Waking Linus to take this guff seriously as notes for his character’s role. He put the pamphlet aside and walked over to the shelf that held the volumes recounting the lives of his brothers.\n As he touched the spines of the bound copies of these temporarily suspended serials, he felt a pang of guilt; rereading old issues would help him pass the time while he lay dreaming—in between revisiting Zola and Proust—but how badly would the three of them be suffering while he bunkered down and waited for Guinard to die?\n He wanted to believe that they would reason their way out of despair into an understanding of the secret he couldn’t reveal to them—and that they themselves, if they came to know it, could never speak out loud. Guinard would be watching them, gauging their progression from grief to resignation, and the long con they hadn’t known they were to be a part of would rely on them appearing to continue to mourn."}