{"fingerprint": "souaSJxu7AxWtzSxvNacyNLPwhQ=", "sitename": "Clarkesworld Magazine", "title": "Mammals Underfoot! An Interview with Emerging Writers by Jeff Vandermeer", "author": "Jeff Vandermeer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/emerging_authors_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mammals Underfoot! An Interview with Emerging Writers by Jeff Vandermeer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nMammals Underfoot! An Interview with Emerging Writers\nEvery once in awhile, it’s good for a fool like me, entering mid-career, to check the pulse of what’s going on among the emerging writers who will one day call you a curmudgeon. Keeping tabs on this unruly, diverse lot not only lets you see the end of the road coming from much farther away and softens the often abrupt transition from “young turk” to “old fart”—it also re-energizes you and helps ensure that your reading patterns don’t get too predictable. Usually, I keep up via blogs and online fiction, but I thought it would be interesting to interview a few emerging writers about subjects like their connection to the larger community, where they see themselves in five years, what they’ve been reading, and their take on mammals versus large reptiles. A kind of core sample, if you will.\nWhat is an “emerging writer”? I think of an emerging writer as someone who has published at least some stories but not yet published a collection, or published stories and has a novel pending, or even someone who has had a couple of books out but seems to be flying under the radar, relative to talent (see: Mr. Shipp). I like the term better than “new” writer because by the time writers come to our attention, they are often not exactly new. Some may have been writing for fifteen or even twenty years. An emerging writer could be in their teens, or in their forties. A writer’s career is for life, and a writer can come into focus for readers and the general public at any point during that career.\nThe sample provided below is by no means definitive or complete or arrived at via any scientific method, but all of the interviewees below are dynamic, original, intelligent in their approaches to writing, and likely to contribute in interesting ways to the next couple decades of non-realist fiction.\nThe following writers participated in the survey below:\nJesse Bullington spent the bulk of his formative years in rural Pennsylvania, the Netherlands, and Tallahassee, Florida. He is a folklore and outdoor enthusiast who holds a bachelor’s degree in History and English Literature from Florida State University. His novel The Sad Tale of the Brothers Grossbart will be released by Orbit in November 2009. He currently resides in Colorado, can be found online at jessebullington.com.\nN. K. Jemisin has sold short stories to Strange Horizons, Postscripts, Baen’s Universe, and other markets. Her first novel, The Hundred Thousand Kingdoms, is forthcoming from Orbit in February 2010. She’s lived in New Orleans, New York, Boston, and Mobile (Alabama), and has only written stories about the first two cities so far. Her website is at nkjemisin.com.\nBy day, Tessa Kum sits at her computer and types. By night, she also sits at her computer and types. Hers is the very definition of a rock ’n roll lifestyle. She is a graduate of the Clarion South Writers Workshop, editorial assistant for Weird Tales, and assistant editor for the Best American Fantasy series. She has been published in Daikaiju 3 and ASIM, with forthcoming fiction appearing in anthologies such as Baggage and Last Drink Bird Head, and her short story collection 7wishes is currently free to read online at Silence Without. She lives in Melbourne, Australia, with a fridge full of condiments and no TV.\nMeghan McCarron was born in 1983 and grew up in the Philadelphia suburbs. She has since spent time in Beijing, Los Angeles, and rural New Hampshire. Her stories have appeared in venues such as Strange Horizons and Lady Churchill’s Rosebud Wristlet, and have been reprinted in several years’ best anthologies. She currently lives in Brooklyn, works at a tiny independent bookstore, and maintains a web resence at megmccarron.livejournal.com.\nShweta Narayan is something of a cultural crazy-quilt; she was born in India and lived in Malaysia, Saudi Arabia, the Netherlands, and Scotland before moving to California. Her work has appeared or is forthcoming in places like Strange Horizons, Realms of Fantasy, and the Beastly Bride anthology. She was the Octavia E. Butler Memorial Scholarship recipient at the Clarion workshop in 2007. Shweta can be found on the web at shwetanarayan.org.\nJeremy C. Shipp’s work has appeared or is forthcoming in the likes of Cemetery Dance, ChiZine, Apex Magazine, Pseudopod, and The Bizarro Starter Kit (blue). While preparing for the forthcoming collapse of civilization, Jeremy enjoys living in Southern California in a moderately haunted Victorian farmhouse with his wife, Lisa, and their legion of yard gnomes. His books include Vacation, Sheep and Wolves, and Cursed. And thankfully, only one mime was killed during the making of his first short film, Egg. His online home is jeremycshipp.com.\nAngela Slatter is a Brisbane, Australia, writer of speculative fiction. Her short stories have appeared in anthologies such as Jack Dann’s Dreaming Again, Tartarus Press’ Strange Tales II, Twelfth Planet Press’ 2012, Dirk Flinthart’s Canterbury 2100, and in journals such as Lady Churchill’s Rosebud Wristlet, Shimmer, On Spec and Doorways Magazine. Her work has had several Honorable Mentions in the Datlow, Link, Grant Year’s Best Fantasy and Horror anthologies #20 and #21; and two of her stories have been shortlisted for the Aurealis Awards in the Best Fantasy Short Story category. She has a blog at angelaslatter.wordpress.com.\nGenevieve Valentine’s fiction has appeared or is forthcoming in Clarkesworld, Strange Horizons, Fantasy, Federations, and more. Her first novel, Mechanique: A Tale of the Circus Tresaulti, is forthcoming from Prime Books. She is a columnist at Tor.com and Fantasy Magazine; her appetite for bad movies is insatiable, a tragedy she tracks on her blog, glvalentine.livejournal.com.\nCan you give us a sense of what writing means to you? How it fits into your life and what you get out of it?\nBullington: Writing is the strange mixture of hobby and purpose, or at least it was before I sold my debut novel—now it’s becoming more of a job, though not in a bad way. Instead of fitting time for writing into my life, lately I’ve found myself looking at writing as what I need to be doing unless I’m doing something else, such as spending time with my family, doing non-writing activities by myself, etc. As for what I get out of it, writing gives me more stress than most things in my life, but it also rewards me with a great deal of satisfaction, pleasure, and interesting nightmares.\nKum: I’ve come to think of writing as being similar to having a kidney—it just is. It doesn’t mean anything at all to have a kidney—do you think about your kidneys much? I don’t—and at the same time, it means the world to have a kidney. You know what happens without kidneys? Bad things. Life is not so sweet. That’s what writing is to me. I don’t choose it, I don’t think about it, I don’t lie awake at night questioning its meaning or giving it a greater purpose. It just is. Although I think writing is of more use when trying to impress people at bars than my kidneys. To date, no one has been impressed by my kidneys.\nMcCarron: This is a hilarious question to attempt to answer, because I ask it of myself all the time. I’ve always been drawn to books—I used to crawl around with them, and there’s video of me narrating stories I drew out in pictures because I couldn’t write yet. My love of books is this totally primal thing, and I have no idea why, as a drooling baby, I decided they were for me. You’d think this would mean that I knew from an early age that I wanted to be a writer, but instead I assumed it was something private, a hobby that I would fit around whatever I actually wanted to do with my life. It took an embarrassingly long time for me to put together that I could write for someone besides myself—that it could be what I “did.” As to how it fits into my life—well. New York is distracting. Let’s just say I wish it fit more!\nNarayan: Writing means I live with a story filter on. Any experience, any idea, anything anyone does around me, is fair game. I’ll stop what I’m doing at random points to scribble furiously—in a book I carry around, on napkins and scraps, in crisp damp sand with a pebble. It means I’ve become a terrible conversationalist; I hear this isn’t unusual. It seems silly to say I get stories out of writing, but I do. I love the work of writing—pulling images into focus, listening to character voices till they are distinct(ive), poking at plots till they behave. I love/hate editing—hate the feel of my work being off and love the feel of it getting closer to right. But. Sure, I love all that, but it’s still work, and work carries the risk of failure. So if I wasn’t writing to communicate, to have these bits of my thinking out there for other people to read and respond to, I’m not sure I would ever get past the fun and non-threatening stage of playing with ideas.\nShipp: Even if I were trapped in the dimension of fiction-hating demonic clowns, I would still write. I need to tell stories the way I need to breathe. I’ve been writing almost constantly since I was 13, and I don’t know how to stop. And, of course, I don’t want to. I love writing. For me, the spawning of tales isn’t an exercise in escapism. When creating fictional worlds, I bring my pain and my love and my horror with me. And so, the process is cathartic, therapeutic and fun. And while I would continue to write even among fiction-hating demons, I’m exceedingly thankful that I live amidst those human beings who connect with my work. As a storyteller, I’m given the opportunity to share my heart and mind and soul with others. And if I can touch a few hearts, twist a few minds, massage a few spleens, then I’m a happy writer.\nSlatter: I guess writing stops my head from exploding. There are a lot of ideas flying around in there that need to get out and writing allows me to do that. It also allows me to spend time on my own playing with imaginary friends and no one looks askance at me! It’s a way of me being able to ask and answer “What if” questions without driving the people around me nuts (“What if?” can have the same effect as “Are we there yet?” if heard too many times.) I like creating things, worlds, people, stories—does that make it a god complex?\nValentine: For me, writing is a way to explore questions the real world can’t answer.\nDo you find there’s a personal or autobiographical element to your fiction? How does it usually manifest itself, and is this element usually obvious to readers?\nBullington: I think that there very much is, in varying degrees depending on the project. Because I write primarily historical and fantastical works I don’t think this is necessarily obvious but it’s there. Only rarely does the personal stuff come out in any overt fashion, such as dialect, turn of phrase, or description.\nJemisin: I think there’s always an autobiographical element in writing, whether the author intends it or not. That’s just the nature of art; it’s analytical. But like any self-analysis, it’s not always done consciously. Frankly, I’m often not sure what personal elements are manifesting in my fiction. Some of them I intentionally put in, but some I figure out years later, when I go back and re-read. I can speak to what’s deliberate: I try to depict realistic human characters—sometimes including nonhumans—dealing with difficult situations. Those difficult situations might be anything from angry gods to rogue probabilities, but I want the people to be real, in all the complexity and three-dimensionality of actual people. So I try to make sure my characters run the gamut of human diversity, and I usually choose to focus on the kinds of people speculative fiction frequently ignores—the blind artist who sells trinkets in the park, the meek office worker, the fallen chef who yearns for her glory days.\nNo heroes, though. I just don’t find heroes interesting unless they’ve got a generous dollop of selfishness and anger and a willingness to throw others under the bus for their own goals. Then they feel real to me.\nKum: This question is a trap, it must be, as the last several stories I’ve written have featured one Tessa Kum in the role of Madame Protagonist. As far as characters go, she’s not very convincing.\nMcCarron: My stories are definitely personal, and the stories I’m most proud of tend to be the most so. That said, I flounder when I try for straight-up autobiography—I seem to need a great amount of lying to keep things interesting. Also, the way “personal” manifests in my work surprises me. As for readers—I did once get an email from someone that implied I had read her mind and/or foreseen the future of her relationship with her ex-girlfriend, so maybe I’m writing other people’s autobiographies? Oh god, though, I really hope that isn’t true, because otherwise I’d feel like I had to write happy endings.\nNarayan: Yes. Always. I don’t think I’ve written a successful story yet that didn’t come out of something that was bothering me. Sometimes the personal element is pretty obvious; I retell stories I grew up with in a way that relates them to my experience. Or I write about shapeshifters and people pulled between different worlds because of my background as a neither-nor sort of cultural hybrid. It’s not that I’m drawing deliberate analogies, just that I know there’s a fictional “me” in the story while I write it. At other times, I don’t figure it out myself until far later. I wrote three stories about one character before figuring out why I keep coming back to her.\nShipp: There are definitely bits and pieces of me and my life in my fiction. For instance, in my debut novel, Vacation, the main character experiences a major paradigm shift. The story is, in a sense, an ideological autobiography of my life, although the plot itself has very little to do with my experiences. And the two main characters in my newest novel, Cursed, are basically the two halves of my personality. Nicholas is my neurotic, insecure side. And Cicely is my easy-going, passionate side. My life is often reflected in my fiction, although the reflections take many forms, as they’re distorted by the fun house mirrors of my imagination.\nSlatter: Yes and no. When I’m writing a character I try my best to utterly be that character, think like her/him, make sure the rhythms of my dialogue match the character and hopefully nothing jars. I try to be really aware of how s/he sounds and also to engage with what the character feels and thinks without any kind of judgment - there’s no point in turning away from a character because s/he is doing or thinking something questionable. Sometimes my stories will start from a personal experience and then be filtered and changed to go with the story. So much of my work is based on fairytales because that’s what I had read to me in childhood and it remains a form I’m very comfortable with, although I have no personal experience of being caught in gingerbread houses or wearing little red riding hoods to hang out with wolves.\nValentine: I’ve only written two stories with autobiographical elements, which contributed to setting but had no bearing on character or plot. I feel like the “write what you know” refrain is a dangerous thing. Maybe “don’t write what you know nothing about” is a better approach; by all means, let outside knowledge inform your setting, but if you start sticking your friends into your stories wholesale it might come back to haunt you—either your readers will catch on or your friends will.\nIs there a story of yours that proved a challenge to write? Can you tell us a little bit about the story and your struggle with it?\nBullington: The novel I’m currently working on is hands down the toughest project I’ve ever attempted. Part of the reason its proved challenging is that it is, in part, more serious in tone and subject matter than The Sad Tale of the Brothers Grossbart, though there’s still some humor in it. The main reason I’m finding it difficult, though, is that I’m trying to evoke real emotion in the reader without exploiting said emotions—no easy feat when much of the plot consists of terrible things happening to good people.\nJemisin: All of them are a challenge to write. I love to write—can’t stop myself from writing—but it’s always hard for me. It almost never flows effortlessly. Though I’d have to say the hardest struggle I’ve had lately was with one of my efforts to depict nonhumans. I wrote a short story from the point-of-view of artificial intelligences in hiding from human beings, who have instituted anti-AI laws for fear of some Matrix-like apocalypse. The AIs think of themselves as humanity’s children, but humanity doesn’t want them, so they’ve grown up angry and lonely and a bit warped like any neglected children. I’ve rewritten that thing maybe five times, and while the voice is clear in my head, I’ve had trouble conveying its peculiar point-of-view to others. I’m determined to get it right one day.\nKum: Is the story worth writing if it doesn’t prove to be a challenge? I like my stories to fight back, so that when they’re conquered, defeated and lying bloodied on the battlefield that sense of accomplishment is so much sweeter. Veni, vidi, vici, bitchez. That said, the story “Acception” (to be published in the forthcoming Baggage anthology) proved a much greater challenge than I’d anticipated. The effect of cultural baggage on Australia was a great theme, lots of room to play and interesting angles to take, and I figured the story would near write itself. Instead, I discovered I had a huge emotional block concerning personal and cultural identity. There isn’t much else that can make writing as excruciating. And I may never again experience a greater sense of victory.\nMcCarron: I started writing my story “The Magician’s House,” in the dead of winter in New Hampshire, when there was three feet of snow on the ground and it got dark at 4:30 in the afternoon. The story was much darker than things I had written before, and while the beginning came out fast, working on the story alone in my tiny apartment deepened my winter funk considerably, so I set the story aside. I went back to it in hot, sunny August, when I was living in Brooklyn with several good friends, and I was able to finish it in a week. I think I had to start that story in a dark, wintery place, but I wasn’t able to write the darkest parts until it was warm and sunny outside, and I had lots of good people around to bring me out again.\nNarayan: I am easily distracted by shinies, so I am terrible at writing what I know. If a story’s not enough of a challenge to demand my attention and make me learn new things in the writing, I’ll never finish it. I’m currently working on my first SF story, which means I’m hinting at a world that’s significantly changed from ours, but needs to hold together without either explanations or mythic structure to support it. The setting is rife with underlying class issues (and by virtue of being written in English, race issues) that I could mess up really badly—or even get reasonably right but fail to communicate well. The piece is also indirect narrative in the form of a paper, in an academic voice that has to ring true but still fail at dehumanizing the “subjects” to the status of “an interesting question”. I have no idea if I can make any of it work, but I shall have fun and learn things while finding out.\nShipp: When I was a teenager, I never struggled with my tales. I wrote rather unconsciously. But over the years, my style has become more and more minimalistic. And so, for the past few years, I’ve struggled with all of my stories. I’m more obsessive than I used to be, and I revise my work constantly. It’s horrible, but at my worst, I can spend an hour on one paragraph. I must be masochistic. Out of all of my recent work, Cursed was the most challenging for me to write. I saw the book as one big puzzle, and I wanted each piece to fit together appropriately. I was also rather fixated on the rhythm of the sentences. Everything had to sound right to my mad little mind. In addition to all this, I wrote this book because of my wife. She was disabled with CFIDS for a few years, and many people treated her as if she wasn’t a whole person. They looked down on her, pitied her, hated her. I wanted to write a story that honored what she taught me about disability and about life.\nSlatter: I’ve been struggling with a short story called “Gallowberries” for almost three years now. It wasn’t until I thought about integrating into a collection of short stories (“Sourdough and Other Tales”) that I worked out how to finish it. I kept avoiding writing the hard emotional scenes and so it stopped me from getting the story finished—couldn’t see the forest for the trees. It was making me very grumpy. I’d also kept the story close to my chest, no one else had seen it until my friend and fellow Clarion Souther Lisa Hannett (whose “On The Lot and In the Air” appeared in Clarkesworld 34) read it and we talked about it and solutions gradually unraveled. I was on the train last week scribbling notes and it hit me in a flash ’Oh, of course she turns him into a [spoiler].’ Sometimes you just need to talk about the story and tap into someone else’s brain.\nTo what extent do you feel part of the genre community? Why or why not?\nBullington: I certainly don’t feel unwelcome in the community, though I think it’s as rife with problems as any community, literary or otherwise—there’s the crackpot loudmouths who think they speak for everyone, the sticks-in-the-mud who don’t want the back-roads paved, the smiling old-timers who secretly worry about the neighborhood becoming “too dark,” and on and on. Overall, I think the genre community can be very exciting and accepting, more so than it is often portrayed by its detractors, but I do think identifying only with one style or genre can be stifling for writers as well as readers. All that said, so far everyone I’ve personally talked to has been aces.\nJemisin: I feel very much a part of the genre community—why wouldn’t I? This is my business. I’ve been blogging and attending cons and workshopping and so on for the past ten years or so—since I got serious about wanting to be published. It’s not always an ideal community to be part of, granted. (But then, what community is ever ideal?) This genre has issues. I think the same issues probably apply to futurism or New Age philosophy or any movement dedicated to exploring the hopes and fears and subconscious of humankind, but SF/F is uniquely ill-equipped to deal with the squicky issues that come up whenever you talk about that kind of stuff. As I see it, SF is endlessly self-congratulatory, proud of its optimism and willingness to ask questions. However, that optimism is an illusion. Frequently it’s just a stubborn unwillingness to speak or think about the world’s problems, like a child sticking fingers in his ears and humming really loudly. The questions being asked aren’t usually the hard questions, and the community tends to react badly to answers it doesn’t like.\nThat said, I’m relieved to see that more of those questions have been asked in the past few years. The resulting conversations have been difficult, but progress is always difficult. I’m hoping it will lead to long-term, substantive change, but we’ll have to see.\nKum: I am not a community-minded person. This is not because “all writers are introverts,” but because “I am a bloody misanthrope now get off my lawn before I come back with my cheese grater.”\nMcCarron: When I went to Clarion West in 2004, people kept telling me it was going to change my life, and I totally didn’t believe them. I’d found Clarion by happenstance—picked up Kelly Link’s first collection in the library, found out she taught at this thing called Clarion, and I decided to apply, since my college gave grants for “summer writing projects.” While I was psyched to spend six weeks writing and critiquing, I didn’t see how it would result in anything dramatic. Since then, I have met so many amazing people, formed so many incredible friendships, and learned so much about writing, that I am a completely different person than I would have been without that initial door into the genre community. So, yes, I completely feel a part of it, and I am grateful to have found it.\nNarayan: I am, in fact, far more a part of the genre community than I was a couple of years ago. However, in the process of becoming more involved with it, I’ve learned a lot about internal tensions, many of which seem to be between people in power and people more like myself. Given the recent controversy around a book titled The Mammoth Book of Mindblowing SF: the 21 finest stories of awesome SF, which turned out to contain nothing by Octavia Butler, Samuel Delany, or Ursula K. Le Guin, or in fact anyone not white and male, I think it’d be hard for a woman of color not to feel marginalized. Add in one writer’s argument that questioning the table of contents was akin to setting up “quotas,” and I can’t see my position in the community as anything but peripheral. However, I’m pretty heartened by the many people who’ve objected to this sort of marginalization, and by signs of change (like the table of contents of the Eclipse 3 anthology, which contains many women, several non-het writers, and at least one writer of color—and, not coincidentally, many of my favorite writers) and look forward to eventually being a proud part of a community that’s truly inclusive, of these differences and others.\nShipp: I do feel a warm and fuzzy connection with the genre community, especially the Bizarro and horror population. I’m active on various forums, and I’ve gotten to know many publishers, editors, and writers over the years. Most importantly, I try to keep myself as assessable as possible to my readers. I spend hours every day talking and interacting with them in one way or another.\nSlatter: Ah, I guess part of it because so many of my friends are in the tribe in Australia and the United States. We’re kind of a funny group because a lot of our connections are enabled mainly through t’intertubes. It’s often quite funny to meet people at cons after chatting online with them after a year! I’m also a Clarion South grad and nothing makes you feel quite like part of the Borg Collective than that experience. Ultimately, writing is a solitary activity, no matter who looks at your work at what stage: the putting the words on the page and making them stick there, that’s all you. Sometimes I get a bit lost, spending so much time in my own head, so it’s a relief to go online and say “Hi” and have a those bright blinking lights of friends say “Hi, back, out of the cave, are we?”\nIn terms of the idea of a writing career as opposed to the writing itself, what’s the most frustrating, annoying, or just plain stupid part of the business end, in your opinion?\nBullington: I’ve had a remarkably charmed experience so far, so I suppose the lack of wheelbarrows full of hard cash being rolled up my driveway stands out. Seriously, though, what I’ve found really tough is trying to divorce myself from worrying about the business end of things and just focusing on the writing itself.\nKum: I don’t understand the business end. It’s some bemusing fog lurking in the distance, and from what I can tell, seems to be designed for the sole purpose of providing the transition between “writer” and “nervous wreck.” I daresay this is because the business end of a writing career is purely business, which is a vastly different animal and requires alternate environments and sustenance for its survival. Should I eventually meet this animal, I suspect I will be devoured whole, chewed a bit, and spat out much worse for wear. I could be wrong, of course.\nMcCarron: The business end of writing is changing so dramatically that the adjectives that come to mind aren’t so much “annoying” or “frustrating,” as “terrifying” and “exhilarating.” My experience with all of these possibilities has been relatively small so far, but I know all sorts of choices are coming. For instance, I love reading fiction in print, but it’s been immensely valuable to have my work available online. Except that often readers then tell me they read those online stories in print years’ best anthologies. So what, exactly, does one do with a collection? A novel? People are finding fiction in all these new, amazing ways—I once ran into a quote from a story of mine on someone’s MySpace page—but it’s hard to know where to focus your attention.\nNarayan: The death of the midlist.\nShipp: The whole money aspect is rather frustrating.\nSlatter: In Australia we have maybe 20 literary agents working—getting one to look at your work is very difficult. Even if you’re prepared to offer your first-born, it’s still quite difficult to get a look-in. If someone is kind enough to refer you then that’s wonderful and gracious, but sometimes people seem to forget that they can help others. I’m a big fan of networking and trying to build those helpful relationships that benefit everyone - paying it forward. The favours you do or the help you offer isn’t given in the expectation of “pay back”; you may never “collect”, but someone might remember you kindly and offer a good opportunity later in your career. It’s like Androcles and the lion—if you can, always pull the thorn out of a paw!\nValentine: I often feel it’s not my place to tell people what to think of my fiction—that authorial intent is negligible once it reaches an audience. Given that, it’s sometimes difficult to entice people to read my work by assuring them it’s very good; even when I’m feeling vain enough to say it, there’s no promise that a given reader will like it at all. It’s like playing a shell game with perfectly nice strangers.\nWhat are the most pleasurable and most frightening parts of being a writer?\nBullington: For me, the most pleasurable part is the result, be it tweaking a sentence until it sings, crafting a paragraph that can’t be improved upon, or actually completing a project. As for the frightening parts, where to begin? In the film Barton Fink, the title character, played by John Turturro, has this great little bit where he talks about how “writing always comes with a great deal of pain,” which struck me hard when I first heard it—granted, I was still a kid then, but up until that point I always felt sort of like a fraud because of how difficult writing sometimes was for me, as if it should always be pleasant and easy. While there are certainly fun times and painless stretches, I very much find the process to be nerve-wracking—I was neurotic long before I found anything resembling success as a writer. I have a hard time turning off the part of my brain that mulls over whatever projects I’m working on at any given point, which leads me to being perpetually distracted when I’m really into something, and so one of the most frightening things is how much I sometime let projects take over my mind, to the detriment of my interaction with, you know, reality.\nJemisin: Most pleasurable: the act of writing, particularly when I’ve got an idea really burning in my head and needing to be written down. Indulging that urge is deeply, viscerally satisfying, whether the final result is publishable or not. (Though of course I like it better if it’s publishable!)\nMost frightening: writing when I don’t know where I’m going. It feels like wandering around in a foggy room, not knowing when you’re going to hit a piece of furniture or some stairs. I’ve learned to work through this fear and just endure the bruises if I hit an obstacle. I will sometimes scrap huge chunks of text I’ve written and start over. (Scrapped a whole novel once; the rewritten version is getting published in February.) I don’t like doing that, but I refuse to think of it as a loss. It was necessary to map out the foggy room. Now I’ll be able to find my way around better.\nKum: Occasionally it occurs to me: HOLY SMOKES BATMAN, THEY’RE READING MY STORIES YAAAAAAAAAAY! Then it occurs to me: HOLY SMOKES BATMAN, THEY’RE READING MY STORIES AAAAAAUUUUUUGH! The two cannot be separated.\nMcCarron: The most pleasurable part of being a writer is waking up in the morning, making tea, sitting down at my desk, and falling completely into the story I’m writing. That level of surrender to fiction is also kind of scary.\nNarayan: I choose to interpret this question as “Which parts are simultaneously most pleasurable and most frightening?” They are: a) Writing something completely outside my normal range—there’s no reassurance of familiarity, no idea if I’ll pull it together or not, but it is fun, and b) Going online the day something new comes out. Will people like it? Hate it? Not notice at all?\nShipp: As far as the writing process goes, I love when the characters start to feel real. I love putting them in impossible situations, and letting them find their way out. Sometimes they surprise me. And then there’s the publishing side of writing when people start reading a new book or story. I love feedback and knowing my work has affected someone in a positive way.\nSlatter: Pleasurable is writing a sentence or a paragraph and finding it sings, that you’ve got all the words in exactly the right place and the rhythms are perfect and what you’ve written is beautiful. Frightening is putting your work out there, especially if it’s something you love, and putting it out there for crit (Clarion will take your skin off, no matter how experienced you are or how thick a skin you’ve grown), or for publication. It’s always like jumping off a cliff and wondering if you’ve remembered how to fly.\nValentine: The most pleasurable part of a story is the image that drives you to begin. All the other stages of the process are pretty frightening by turns.\nIf you had the luxury of daydreaming, what would you want for yourself five years from now in terms of the writing?\nBullington: I hope that I’m able to find more discipline, and of course more skill. The wheelbarrows of currency should really be arriving by then, too.\nJemisin: Well, naturally I’d be a bestseller, making enough money to live without a nine-to-five for the rest of my life! But what I think would make me just as happy would be if I begin to see changes in the fantasy genre as a result of something I’ve done. For example, The Hundred Thousand Kingdoms is an epic fantasy—with a woman of color as its protagonist. There’s also more than one strong woman character, and blatant bisexuality and poly-positivity, and men who display strength without Mighty Thews (tm) and phallic objects. Also there’s some genre flexibility in the form of mystery and romance components. So it’s an epic that breaks the epic mold, in my opinion. A lot of people may reject it because of all this, but my hope is that the mould will become more flexible instead. Maybe it’s presumptuous of me to hope that I can contribute to this kind of change, but . . . well. I’m presumptuous.\nKum: Oh that’s easy. Let me hit fame and fortune harder than JK Rowling, Stephenie Meyer, and Dan Brown combined, then do the sensible thing and have a breakdown, which would lead to writer’s block, and then I would have no choice but to go and live out my days in some remote lighthouse of the coast of France with nothing but my millions and millions in royalties to feed me. There would be a lot of cake involved. Probably ice cream too. And I’d have to do that washed up celebrity thing of space tourism, as well. I think I’d buy land on the Moon and Mars. You know. Thinking ahead and all that. What was the question?\nMcCarron: My two big goals for the next few years aren’t particularly unique ones—I want to write enough stories to fill out a collection, and I’d like to write, and publish, a novel. I’ve finished the draft of a novel, several times over, but I haven’t quite figured out how to make all the disparate elements of a big story fit together. So, in my daydreams, I have accomplished, or am on my way to accomplishing both those things, and I’ve managed to set up my life in a way that I get to wake up, have my tea, and sit down to write every morning. Or almost every morning, anyway. Brunch is too good to pass up sometimes.\nNarayan: A multi-book deal, a Tiptree award, and an electrode headset telepathic computer interface. And a hypoallergenic pony.\nShipp: I’d want to write a book that makes the world a better place, somehow. I’d also want to write a screenplay about yard gnomes that gets made into a film. Perhaps a yard gnome musical.\nSlatter: The ability to be a stay-at-home writer who doesn’t have to worry about an income. Being a successful novelist and continuing to be able to do short stories because I love them. Oh, and Zachary Quinto on speed-dial. Unreasonable, right?\nWhat writers you’ve read recently have really excited and challenged you? In what ways?\nBullington: I haven’t read anything to top two that I discovered last year: The Dream of Scipio by Iain Pears and Blood Meridian by Cormac McCarthy. The Dream of Scipio follows three lives—a professor during World War II, a poet during the Black Plague, and a philosopher, and patrician, during the death throes of the Roman Empire in the 5th century, and the manner in which Pears layers their stories on both literal and symbolic levels is nothing short of genius. It would have been incredibly easy for Pears to trip himself up, for the three stories to catch on one another or come off as contrived, but instead the reader is left in awe of his power and ability.\nBlood Meridian, on the other hand, is a masterpiece of language instead of style, though it shares Scipio’s impressive historical detailing. That the poetry of McCarthy’s language is employed to tell the grittiest, most brutal western I’ve ever encountered only makes the novel more interesting. In talking about the novel I always mention this simile McCarthy uses, this perfect simile that would only be cheapened by repeating it out of context. He uses the simile early in the novel and for me it was one of those put-the-book-down-and-gape-into-space moments, and so when he re-used the simile about halfway through I very much took notice—it was such a great use of language that using it a second time very much diminished its power, except that by this point I was convinced McCarthy was far too meticulous to be unaware of this, and so I moved on, my curiosity piqued. Then McCarthy used the simile a third time, and it all fell into place, this one simile used three times establishing this beautiful cadence to the novel, a daring move, and a risky one, but in my opinion a complete success. And with it thus established, the simile was not used again; using it a fourth time would have spoiled the whole thing, it would have been too much, just as if he had only used it twice it would have stumbled the text, it would have not been enough.\nOf late I’ve been enjoying some gothic and Victorian gothic novels such as Carl Friedrich Kahlert’s The Necromancer and G.W.M. Reynolds’s Wagner the Wehr-wolf. I’ve also really dug Joe Abercrombie’s First Law Trilogy, and the short fictions I’ve recently read by Orrin Grey, Ekaterina Sedia, J.T. Glover, and Brian Evenson.\nJemisin: Well, I’ve been raving about this woman all over the web, but I absolutely loved Kate Griffin’s A Madness of Angels. It’s an urban fantasy that, in my opinion, seamlessly blends the two kinds of urban fantasy. I’m not sure what to call those two kinds—China Mieville-esque and Laurell K. Hamilton-esque? The big-picture epic kind and the intensely personal noir kind? Whatever. I like both. Anyway, Griffin’s book has rich, gorgeous language and a tough protagonist whom I find incredibly sexy, fighting his way through a London that’s so rich and magical and diverse and organic and quirky that I’ve fallen in love with it sight unseen. I run into a lot of people who are writing off Urban Fantasy these days because it’s infested with girl cooties, or something. I’ve been referring those people to this book.\nI’ve also been reading some interesting YA lately. The one that stands out in my mind is Skin Hunger, by Kathleen Duey. It’s not without flaws—the cliffhanger ending being one of them; I hate those—but it’s been one of the chief contributors to my understanding that YA really can be about anything, content-wise. This is a riveting, horrifying story about children in a school of magic being sacrificed, tortured, starved to death; it’s not easy reading at all. But holy crap, I wish there had been more stuff like this around when I was a kid/teen. I jumped to adult books rather earlier than I should have because I couldn’t stand being coddled and talked down-to, the way youth-oriented books did back then. I’m glad to see that the book industry has finally realized kids are actually intelligent, complex beings who aren’t always happy or ignorant of the world’s flaws.\nKum: I’ve had a good run recently, it seems every book I pick up is a fine and wonderful thing. I last read Ben Peek’s yet unpublished “Beneath the Red Sun,” in which he does a masterful job of splicing alternating narratives and, in a way, reversing the chronology of the story while surging forward. It’s also uniquely Australian in flavour, which is a rare and wonderful thing to encounter, and something I’d like to see more of in the genre.\nHouse of Leaves by Mark Z. Danielewski did a number on me as well. In a purely ’I love this but have no desire to break my brain in an effort to emulate it’ fashion. I know I’m late to the party with it, which makes me wonder why there aren’t more books in a similar vein sneaking onto the shelves. I do love a book that fucks with the reader in unexpected ways.\nMcCarron: The best part of my job (bookselling) is that I get to read all sorts of new, exciting fiction and then sell it to people who will (ideally) love it as much as I do. I just finished a galley of The Children’s Book by A.S. Byatt, which is coming out in October, and I can’t stop telling everyone I know how amazing it was. I’ve actually been daydreaming about getting to hand it to customers. I think I’m on a big, thick omniscient-narrator kick, however, because the last book I was totally obsessed with was Middlemarch, which I read earlier this summer. I love fiction that talks to me, that tells instead of shows, but for a long time I had no idea what that looked like when done well. Now I do, and I look forward to stealing liberally.\nNarayan: Nisi Shawl. Her characters always come from somewhere. Reading her stories made me realize the extent to which I’d been accepting blank generic cultural backgrounds elsewhere. Hers all have personal histories; the reader gets fragments only, but I never doubt there’s more than I was given. The personal histories tell me about the overall setting and how pressures are working on the characters, and makes them incredibly vivid, and because everyone has a past, her futuristic settings feel like they have real history.\nCatherynne M. Valente. Not that her work is new to me, but her latest Clarkesworld story is part of why I’m writing an SF piece. Every time I read something of hers, I think “You can do that?” and some unseen wall in my mind crumbles away. Larissa Lai. Her mixture of humor, world detail, and multithreaded story structure in When Fox is a Thousand reminds me that fun and awesome stories go together.\nThis list could go on, you realize. Forever. But I’ll stop with the note that several of the speculative poets—Cat Valente, Amal El-Mohtar, Samantha Henderson, Jules Runolfson, JoSelle Vanderhoofd, Rose Lemberg, Mike Allen (and I know I’m missing people)—have been exciting and challenging me at the sentence level. The precision and power with which they use language reminds me that good enough isn’t.\nShipp: I’m currently exploring the tales of Haruki Murakami. His work confounds and mystifies me. I don’t know anyone who writes like he does, or who thinks like he does. When I can find a writer like that, I feel blessed. Some other writers that have electrified me recently: John Ajvide Lindqvist, Lois Lowry, Franny Billingsley.\nSlatter: Mieville’s The City & the City because it was very different from his other stuff and it took a bit of a head-shift on my part to shake away expectations. Emma Donoghue’s Kissing the Witch, which is a collection of framed re-written fairytales, which is wondrous strange. Alan Moore’s Voice of the Flame is the book I have literally just finished and it’s totally amazing: the mastery of craft is phenomenal and how he weaves past and present into a story is just awesome. My only complaint was that the font size was too damned small for easy reading! Curmudgeonly person that I am.\nCan you tell us a little bit about your current writing projects?\nBullington: I love history, and the work in progress, as well as the next few longer projects I have planned, will also be set in Europe, though in different eras and locations than The Sad Tale of the Brothers Grossbart. The WIP is set in the early days of the Reformation, and will perhaps have a touch more of the fantastic than the last novel, though it hasn’t come out of the oven yet so we’ll see what shape it ends up taking.\nJemisin: Well, right now I’m working on Book 3 of the Inheritance Trilogy. (Calling it Book 3 because I suck at titles and keep changing this one.) Book 2, currently titled The Broken Kingdoms, is done. All three books are set in the same world, where something’s gone Horribly Wrong with the gods and humankind is just trying to cope. The third book looks to be the most “actiony” of the three, with magic battles and flying palaces and so on. I’m trying to figure out a way to insert giant robots. Okay, no. But I really think epic fantasy could use more giant robots, don’t you? I dig giant robots.\nNext up, I’ve been wanting to write a YA novel for several years now, set in the world of that AI short story I mentioned. (Because there’s no better way to master something you’ve had trouble with than to try and write a whole novel based on it.) Also, am hoping to finally complete the third book of an unsold trilogy I’ve been working on for years—another epic fantasy, this one set in an Egypt-like society, with a magic system based on Jungian dream theory. Still might not sell, but I just need to get that one out of my system. There’s other stuff in my head. But first things first.\nKum: As mentioned, I just put myself through a whole lot of heartbreak and anguish dealing with culture and identity within Australia, the end result of which will be published in Baggage, slated for release early next year. I also just finished 35,000 word “short” story that was my first collaboration and written in the space of a month, and I haven’t quite recovered from that yet. One day I may even finish my novel.\nMcCarron: I’ve spent August revising and getting stories ready to go out. My next story to revise is a ghost story I wrote for the Sycamore Hill workshop this year, and then I’m going to finish a science fiction story I started earlier this summer about a woman sleeping with her roommate’s artificial lover. My (ambitious) plan for the fall is to knock out a big rewrite on my novel.\nNarayan: Seems I can’t not, given that I’ve already mentioned the current piece twice. Besides that, I have several short stories waiting plaintively for edits, two that are still at the daydream stage. The short stories range from mythic fantasy to anthropological SF to I-don’t-know-what-to-call-this. There’s also a novel; it’s a third done (first draft) and keeps threatening to take over my mind. The setting’s a clockpunk Holland in which the Little Ice Age is getting rather big, and “elf” is a racial slur. It’s a sweet little love story, evident from the blood on page one. However, I also have rather less of a dissertation draft than I should, and a real deadline on that, so everything else is currently on hold. Well, as on hold as I can stand.\nShipp: “Fungus of the Heart” is the short story collection I’m working on. I’m also writing tales for my fiction subscription service, Bizarro Bytes. And there’s Sharkface, my children’s middle-grade book. And then my newest novel, Cursed, is coming out around Halloween. This is the story of Nicholas, Cicely, and their friends and enemies. They create an informal support group of sorts for cursed individuals. Together, they try to find out who cursed them, why, and what the heck they can do about it.\nSlatter: “Sourdough and Other Tales” is a collection of short stories set in and around a fairytale city. “Sourdough” appeared in Tartarus Press Strange Tales II in 2007 and they’re taking “Sister, Sister” for Strange Tales III later this year. There are characters that wander between tales and over a period of about a hundred years. It’s about disconnected memories and fairytale themes. I’m working on a novel, “Well of Souls”, that’s about to get a huge re-work during an October writing retreat. Novels are a totally different shape to short stories, it’s an entirely different art form and you need to learn everything over again . . .\nValentine: My first novel, Mechanique: A Tale of the Circus Tresaulti, is due from Prime Books in early 2011. I’m working on several short stories, and have a few novels in various stages of completion. I am also moving forward in my attempts to watch every bad movie in the world and document it on my blog.\nPretend you’re a mammal in a writing landscape dominated by dinosaurs stomping around. Do you have a message for the dinosaurs or for your fellow mammals?\nBullington: Mind the tar beds, one and all, and keep in mind that even if you’re fast, hot-blooded, and new there’s still the risk of a blundering thunder lizard stomping your furry ass into paste.\nJemisin: To the dinosaurs: don’t eat me; I eat a lot of peppers, so I’d give you heartburn. And watch your step. I would make a really unpleasant schmear between your toes. Seriously. You’d never be able to scrape me off. To the mammals: WTF are you standing around reading messages for? You’re supposed to be at the Mammalian Auxiliary meeting, plotting the overthrow of the oppressive reptilian regime. Really, now—how can we build the Doomsday Weapon that summons an asteroid, without everyone on board? Remember, it takes a village to trigger an Extinction Level Event.\nKum: To Our Dear Dinosaur Friends: When the asteroid hits, you’re fucked. Love, Sir Tessa (a monkey)\nMcCarron: I have to say, I’m not so into this metaphor, mostly because (a) I love dinosaurs and am kind of pissed that we mammals are around and they are not and (b) this has not been my experience of the writing landscape at all. I went to Clarion when I was twenty-one, Wiscon when I was twenty-two, and Sycamore Hill when I was twenty-four, and in each of those places, the “established” writers were welcoming, generous, and extremely supportive. Sure there are exceptions, but compared to other writing communities, SF is extremely open. The one thing I would love to see, both inside and outside of the genre, is more openness to new experiences, not as writers, but as readers. Everybody gets caught in reading loops, or is sure that they will hate something with that kind of protagonist or in that genre over there, but then we miss all sorts of awesome stuff. People who think they’re mammals read mammals, people who think they’re dinosaurs read dinosaurs, when really we’re all big nerds who like books, and would probably get a kick out of each other.\nNarayan: Fellow mammals! Do not incubate dinosaur eggs. They are delicious.\nShipp: The bigger they are, the harder they fall. And, of course, they’ll be falling on us, so let’s not knock them over, yes? Let’s create our own hunter-gatherer-based sustainable eco-villages away from the dinosaurs, where we can live in peace and harmony and other good words like that. Together, we can put on a yard gnome musical, and we’ll put those boring dinosaur musicals to shame.\nSlatter: “Don’t make any plans for next week, guys. No, really.”\nValentine: I’m gristly and flavorless! Do not attempt under any circumstances to kill me for food.\nJeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\nJeff's novel Finch and writing book, Booklife, are forthcoming this fall."}