{"fingerprint": "1c6pL55XqGarfIijIZxz6Sej6Zs=", "sitename": "Clarkesworld Magazine", "title": "First Contact, Fantasy, and Cooperation: A Conversation with Steven Erikson by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/erikson_interview_2018/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: First Contact, Fantasy, and Cooperation: A Conversation with Steven Erikson by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nFirst Contact, Fantasy, and Cooperation: A Conversation with Steven Erikson\nHumanity has unconsciously defined itself as the lone intelligence in the universe. From our attitudes toward other species, to our own sometimes overblown sense of self-importance. For all intents and purposes, many of us believe that the universe revolves around us—until it doesn’t.\nSteven Erikson’s new novel Rejoice, A Knife to the Heart tackles a question that has wracked the brains of many authors before: What happens when we discover that we aren’t the all-powerful intelligence in the universe? Science fiction author Samantha August is abducted by aliens in broad daylight. In an instant, the entire planet knows that we aren’t alone. Not only do the aliens abduct one of the planet’s best loved authors to be their ambassador, but they start imposing their will worldwide, to help humanity save themselves from an apocalypse of their own making.\nSteve Erikson is the New York Times and Sunday Times bestselling author of the epic fantasy series, The Malazan Book of the Fallen. He’s also written numerous short stories and science fiction novels. His newest novel is Rejoice, A Knife to the Heart. It’ll be available from Promontory Press on October 16th.\nWhat first got you interested in writing?\nI had early ambitions to be a comic book illustrator, but this was back in the day before anything digital existed, and it turned out to be a lot of work. Too much work. Since even my drawing had a narrative bent, I guess I naturally transitioned over to using just words.\nHaving written both fantasy and science fiction novels, which genre do you feel most at home working in?\nThat’s changing, to be honest. It was so relaxing writing a basically mimetic novel. In a way, it brought me back to my short story writing origins in creative writing programs.\nI still enjoy writing fantasy, but it’s a much harder genre, to be honest. There are structural and stylistic impositions that simply aren’t there with a mimetic novel. Rejoice was much closer to my natural style of speaking, writing, rhythm, and composition. Am I prevaricating here? Possibly.\nIf you had to choose one science fiction author to act as the communication conduit between humans and an alien race, who would you choose?\nWere she still alive, Ursula K. Le Guin. Now, maybe Kim Stanley Robinson or Robert Sawyer.\nYour novel struck me as somewhat subversive. It toys with some of the familiar alien invasion tropes but quickly flips them on their head. What inspired you to tackle an alien invasion story?\nThe subject has been of long interest to me, and I’ve read scads of First Contact novels, some brilliant, some not so much. Basically, Rejoice is a thought experiment. I think many First Contact novels carry with them some dubious assumptions, particularly when it comes to what’s out there (who’s out there) and how they might proceed to initiate and engage in contact with our species. I felt the desire to upend some of those assumptions, although I would humbly suggest that the subversive elements are less about alien tropes than about human society and modern civilization.\nBut to stay with your question, as part of my thought experiment I needed to establish some basic premises:\n- Alien species capable of traveling between stars are probably post-scarcity (there is growing evidence that space is rife with resources).\n- Alien species will approach us from a position that dispenses with (or ignores) our hierarchical, nationalistic obsessions.\n- Proper, full, First Contact must engage with all members of our species, not just government agencies or any other choke points (said agencies being the self-proclaimed gatekeepers to information would be counterproductive to initiating a fundamental, existential shift in the thinking our species engages in, said shift being utterly necessary to our being welcomed into a galactic community)\n- The only effective First Contact will involve both carrot and stick.\n- Secrecy is anathema: what changes occur must occur to each and every one of us, and those among our species obsessed with secrecy are in fact obsessed with power and domination: that attitude needs humbling.\nThe most interesting parts of your novel aren’t the alien invaders, it’s humanity’s reactions to the limitations placed on the planet and society. What made you decide to have the aliens impose these particular limitations?\nIf there is a barrier to contact, it’s to do with our attitudes, our ways of engaging in those aspects of human behavior we assume to be innate, sociobiological even: competition over cooperation, aggression over agreement, territoriality over the common, hierarchy over egalitarianism, and so on. Most people will assert the dominance of such self-serving traits via a recursive, oxymoronic, and self-justifying melange of capitalist ethos, individualism, even genetics, which strikes me as misplaced emphasis—humanity achieves civilization through cooperation, and when cooperation breaks down, so does civilization. As any archaeologist will tell you. We acquire civilization, societal peace, and well-being in counterpoint to our worse tendencies, those negative impulses that break down community or work to curtail it.\nAccordingly, we need a shift in our thinking (and yes, it would present the most profound existential crisis our species has ever experienced) and, thus far it seems, we can’t do it on our own. Hence the external imposition on our most cherished behaviors of unfettered expansion and rapacious self-expression.\nYour novel, like many great science fiction novels, tackles a number of “what if” scenarios. For example: What if aliens prevented humans from decimating our environmental resources. What is one scenario you would have liked to include in your novel but didn’t quite have the chance?\nHmm, how about an explicit slap of reason, delivered to everyone?\nRejoice juggles a more personal story of Samantha August’s abduction with a worldwide global catastrophe as seen through numerous other characters. Did you find it difficult to keep the story grounded as you shifted perspective all around the world?\nNot at all. Samantha’s story needed a counterpoint, a more tactile sense of what people were experiencing on the planet’s surface. If anything, the challenge was in keeping the number of other stories manageable—I could easily have added another ten or so new character points-of-view. Instead, I tried for a representative selection that tackled the experience from various levels, from the kid on the street to the working woman and man to religious figures to politicians to scientists and so on. That also served in varying the voices used.\nHow did you go about creating the various POV characters around the world?\nThe key for me was in covering as much of the planet as possible: not just one country or one culture.\nIs Samantha August a wholly unique creation or an amalgam of science fiction authors throughout history?\nShe’s an amalgam of Ursula K.Le Guin and maybe Margaret Atwood: Le Guin for her “social” SF approach and Atwood for her edginess. When I conjured up a physical image of her in my head, it was Meryl Streep (!!!).\nYour novel is struck through with some clever commentary on humanity, politics, and the environment. Do you believe science fiction has the power to change minds or at the very least encourage someone to think differently?\nIt’d be nice to think so, but only in the sense of all fiction offering to a reader that potential for a shift in perspective. Historically, do we really see any efficacy in SF? Was Orwell’s 1984 sufficient warning against totalitarianism? Was Huxley’s Brave New World a heeded warning on the dangers of collective somnolence? These sonorous bells ring on and on, don’t they? Who knows, maybe only dogs hear them.\nWhat projects are you working on next?\nI am working on the new trilogy set in the Malazan world (the epic fantasy series).\nWould you like to be abducted by aliens? If so, which kind?\nMy bags are packed. Which kind? The kind that I think are probably out there.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}