{"fingerprint": "HAxEE5zp/+HhfqpE38c0eCQkTeQ=", "sitename": "Clarkesworld Magazine", "title": "The Minimal and Finely Focused Fantasy of Ian C. Esslemont by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/esslemont_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Minimal and Finely Focused Fantasy of Ian C. Esslemont by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "InterviewThe Minimal and Finely Focused Fantasy of Ian C. EsslemontIan C. Esslemont has lived in and out of Malaz since 1982. And you can tell. The people breathe, the seas rage, and time stretches far in both directions. Malaz is a big world, a huge world, given life in Esslemont’s novels Night of Knives and Return of the Crimson Guard and in Steven Erikson’s nine novels, starting with Gardens of the Moon through to the most recent Dust of Dreams.Malaz can be grim and dark and violent. In the hands of Esslemont, Malaz is always vibrant and real. “Far in the distance a dark smudge appeared,” writes Esslemont in Night of Knives, “but the figure continued its laboured march, on and on under a sky that remained hazy and dim, where shapes resembling birds swept high into the clouds.”There are far distances and dark smudges, but Esslemont is the most concerned with the individual characters, the people as they struggle along. And it is here, in his characters, that Esslemont does the most world building, telling the story of a whole world in the lives of his characters.“I hope that what I write contains everything—else it would not have the feel of a complete fiction (if you know what I mean),” said Esslemont. “More specifically, I suppose I write about contending goals and agendas, the evolution of mythologies, beliefs, and legends, the efforts of the individual to find his or her ’self’ and to understand and come to peace with the world and their place in it (everything, in other words).”Malaz is a world built through conversations between two long-time friends, and reading Esslemont’s novels possess a certain intimacy, a certain closeness that is both exhilarating and real.These days Esslemont lives in Alaska with his family while finishing a graduated degree and working on more novels set in Malaz.What do you enjoy most about writing?What I enjoy the most about writing is the creation in creative writing. The surprise and discovery that comes with pushing ahead on the blank page: anything can happen, and sometimes does.[Writing] is like any other creative art—painting, sculpting—there’s always more to learn, skills to hone further. And one can always choose to take risks as well, if one is so inclined.I am glad to see [writing fiction] regarded now as more of a ’craft’ rather than how it has been regarded in the past: sort of as the divinely-granted mystical gift where one waits for inspiration to strike, like lightning. Really, it’s more of a job. Ninety percent of writing is planting one’s butt in a chair for four to six hours a day.What did (or has) playing role-playing games taught you about writing fiction?A great deal, I think. In your interview with Robert Redick, he confesses that he was an RPG fan. Like Robert, I think it helped teach me dialogue, character development, plotting, pacing, how to stage a scene . . . just about everything. At the same time I also read feverishly in fantasy and science fiction (as I’m sure he did as well). For me, the old-style RPG of a gang of friends gathered around a table provided a self-selected set of like-minded readers (an audience) to try out material.Also, like any hobby or pursuit, the RPG can be handled poorly or skillfully. Dull, uninspiring campaigns and games are as common as poorly prepared meals at restaurants, stupid films, or shoddily made electronic goods. I suppose I was lucky in encountering such a skilled, intelligent, and dedicated group as I found at the University of Manitoba back in the ’80s. The games there were challenging, surprising, dynamic, even thrilling. As good as any fantasy story could be—as they should be.Then I met Steve [Erikson] and introduced him to role-playing games, and things just took off from there. The more we gamed the less we came to reference the mechanics and paraphernalia of the game and the more we came to just talk. We ran entire games just in dialogue between numerous characters who argued and sniped and vied amongst themselves all through the night.Most of our fiction features our characters from those games—even those very scenarios we ran.Both you and Steven Erikson have done archaeological work. Are there any similarities between that and writing? Being a graduate student and writing fiction?A lot of similarities, I think. To me, being a writer feels like being a perpetual graduate student—you never finish! At least with a dissertation one finishes the book and can then move on to articles and such, but in writing fiction there’s always the next book! And there’s always supporting research, etc. But then, I’ve been a grad student for many years so maybe that’s just what I’m used to.As to archaeology, yes, very much so. The analogy is no doubt quite well established: one digs up things, unearths what can be unearthed, makes connections and establishes context, constructs the weave of a society, a culture. It’s all there.Is there anything of Manitoba in Malaz? Alaska in Malaz?Hmm. Interesting question. Since both Steve and I grew up in Winnipeg there must be a lot of Manitoba in Malaz. Not directly though, no geographic stand-in. Steve and I have deliberately tried to avoid the old fantasy cliché of the northern ’Scandinavian’ type region, the ’Celtic’ region, and the eastern ’Chinese’ type or Mongol type region or peoples who stand in for such.As to Manitoba, well, there is a great love of the land, of forest, and plain, that we hope comes through, and that is perhaps traceable to having been raised on the prairie. It’s a landscape that puts a stamp on one, that’s for certain.Now, as to Alaska, well, the question of aboriginal vs. invader peoples is central in the world of Malaz, as is the question of colonialism and imperialism in its various historical forms. Alaska is a region where that is still very much playing out.The world of Malaz began as a setting for a home-brew role-playing game. How did this fact flavor the world?In one foundational way you could say that the abandonment of the traditional single hero, single protagonist narrative line, in favor of the ensemble multi-character narrative, is perhaps traceable to Steve and my RPG roots. In Malaz, we deliberately threw aside the (ridiculous in hindsight) conceit that any single individual can defeat an army, or overturn history. That’s the old “great man” model of history that doesn’t really stand up once you take a good long hard look at it.Malaz evolved out of our need for a milieu for our rpg. We poured everything we had into it, all our ideas, all our enthusiasm and creativity. It could have easily faltered or “failed” ( if disappearing counts as failure) at any time. It was frankly unlikely that Gardens of the Moon would have ever seen the light of day. Only Steve’s stubbornness and persuasiveness saw it over the hump into print—not to take away from the quality of writing, it’s just that so many turned it down . . . too long, too complicated, too many characters, too dense, too lacking in explanations for the readers . . . the list went on and on.The world was built through a process of dialogue, collaboration. Steve would throw something onto the table and I would build on it, or I would throw something onto the table and he would then take that idea and run with it. Sometimes what we tried didn’t work, or didn’t appeal to the other and that element, withered. Naturally, the elements we liked were the one that we developed. I think that this process of natural selection made things very strong and cohesive (or so I hope).What part or parts of Malaz feel the most yours? Or, put differently, where is your stamp or fingerprint the most apparent?Oh-oh, are you trying to foment trouble between Steve and me here?This is really hard to say as we originally developed each region together. Now, years later, as we flesh out further parts you might say that these are mine or Steve’s, such as how Letheras is very much fleshed out by Steve. Yet, it is not that simple as the Tiste Edur brothers were my player characters originally . . .Or, for example, I might say that the Korel, or Fist, subcontinent has my stamp. But again that is not completely true—it’s a good example of how we shared development. All the city and country names were written in by Steve, leaving me to make of them what I may. Similarly, I filled in and named the regions of south Genabackis, including Darujhistan (excluding Bastion and regions which Steve later added), and mapped out the subcontinent south of Korel.Much of Knives of Knives takes place in a day and a night. What did this limited time frame let you do? Did you ever feel constrained by this abbreviated time frame?I set this limited time frame deliberately. It was my creative response to the criticism of fantasy similar to the one raised in your interview with Robert Redick. In that interview he cites Kim Stanley Robinson explaining his dislike of fantasy: “As he put it, in a world where anything is possible, nothing is interesting.” In effect, I guess that this implies there are no limits in fantasy and thus there is no creative challenge (in painting, for example, every canvas has a border). My idea was that fantasy can work just as well in the minimal and finely focused. Thus the limit of twenty-four hours. There are well-known literary precursors and models for this but I won’t go into all that here. Suffice it to say that it is my opinion that fantasy can be just as effective a medium for investigating the close and intimate as any other genre.I learned an extraordinary amount in writing Knives. It was my apprenticeship piece, you might say. I cut my first chops and all that. Everything I learned with it then went into Return of the Crimson Guard. Mainly, I think I learned to trust myself more and to take my time . . . and I’m still working on those very hard lessons.What are you working on now and how does it expand upon the previous books and the world of Malaz?I have a contract with Bantam for four more Malazan novels. I’m really excited by the chance to follow through with these. The first tackles the Korel, or Fistian, subcontinent. It centers on Malazan entanglements there, the Stormriders, and a local religious cult. After that I’ll turn to Darujhistan, then events on the continent of Jacuruku, and finally I’ll finish up by revealing Assail. All these four fit in with and complete Steve’s and my main arc for the world as a whole.Are you ever over-whelmed by the sheer size of the world you and Steven Erikson have built?No, not at all. In fact, I enjoy it immensely; it’s half the fun! There’s so much to tell; it all adds to the richness.Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}