{"fingerprint": "wQzaCXfxFHKWhViB0JGlQuuE71M=", "sitename": "Clarkesworld Magazine", "title": "Meddling Fields by R.T. Ester", "author": "R T Ester", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ester_03_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Meddling Fields by R.T. Ester", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5870 words, short story\nMeddling Fields\nHistory gave the people of August little to look back on. Whenever a report came that one of them had been spreading their own version of it, one of us had to pay those storied steppes a visit.\nThe latest offender lived on one of the strewn fields left by a meteorite that came down centuries ago to give the place its name. Neighbors feared he had been in contact with visitors from alternate time strands, putting him in violation of laws enacted after the meteorite’s interlineal quality was discovered.\nHe stood a stone’s throw from his homestead, waving like a child as the inspector brought her flyer down. The vessel’s rotors leveled sheaths of grass underneath and kicked dust at him, but he kept at it.\nHe had a meddler’s grin. It exposed his chipped tooth while failing to lift the bags under his eyes.\nEven meddlers too young to have seen the August Meteorite come down had the grin—passed down through the same mutation that gave them immune cells most suited to Sanctuary 2’s biome.\nHalfway up from the flyer, the inspector saw the first sign of a fragment on the property. The man’s August Aeronautics coverall had been deep blue while she observed him from the air. Down here, it appeared much lighter. The spaceflight manufacturer native to August didn’t issue coveralls in that shade. It had either been acquired from wear or the man had damned himself and everyone on the homestead to extended stays at the internment camp east of here; perhaps fates worse than that.\n“Hear now,” he greeted in the outback’s patois before lowering his hand.\n“Hello,” she shouted over the rotors, stopping six yards out from him. “I would want to skip the frivolities this morning if that’s alright. Are you who they call Timoh?”\nHe placed a bony hand on his chest. “Name Now-Timoh, hear now. Then-Timoh is pa—dead and buried. Gone to be with her who throw the rock down. Name Now-Timoh, ’til the rock thrower call me to her side, hear—”\nShe smiled through his soft-spoken soliloquy as he meandered a few seconds more. There came the old itch on the nape of her neck. She met it with all the restraint she could muster. For this visit, she needed to be fully in her own mind.\nFinding a window to speak, she heaved a quick sigh and wrested her cloak from the wind’s dalliance with it.\n“Timoh . . . ” She fished a warrant from her fatigues. “I am Inspector Ransom Nu’Terra with the August Meteorite Recovery Mission. In my hand is a warrant signed by the Magisterium on Sanctuary 2 and the Now and Forever Sovereign Cletus Nu’Dawn the Infinite. It gives me command this morning to search your property for the presence of fragments from the August Meteorite—meddling stones, as you otherwise know them. But first—” Widening her smile, she pocketed the warrant. “Allow me to extend you a courtesy by asking that you come forward with knowledge of any such fragments you may have come across here on these pastures.”\nTimoh narrowed his eyes—an expression that made him look younger than his six decades alive permitted. Behind him, one of the compound’s outbuildings towered over the others. Two hundred feet wide, its roof was without most of its panels, so it looked to Inspector Nu’Terra like an unauthorized rocket launch being prepped.\nShe scowled. Another inspector had recently been here in August and ventured close to a Transient Extralocal Object, frying his implant as a result. A launchpad in working order—though common in the Sovereign’s Prime—was still dangerous in a meddler’s possession. Beyond Sanctuary 2’s orbit lay transients wanting war between their time strands and this one.\nTimoh shook his head in a halting manner, making the inspector think he hadn’t understood her. People had died for just failing to communicate knowledge of where fragments of the meteorite could be found. The August Meteorite Recovery Mission originated from violent campaigns to confiscate the stones and exterminate ghosts of resistance they allowed in from alternate time strands.\n“If that’s a denial,” she said, “my sweepers will now check the premises for extralocal particle emissions and be out of your hair within the hour. How’s that?”\nHe nodded. She paid her flyer an over-the-shoulder glance. The rhomboid vessel was farther out than she recalled landing it. Taking a moment to visually confirm it hadn’t drifted on its tethers, she whistled to her sweepers. The likely explanation—she knew—was that she had been channeled into one of them while grounding the flyer and hadn’t fully resumed awareness of self when it landed.\nA sweeper began as a canine-arachnoid hybrid. Once old enough, it was fused to a geodesic carapace fashioned from recovered fragments of the meteorite.\nShe had brought just two with her for this visit, judging from reports of Timoh’s brazen antics that a fragment—if on the property—wouldn’t be hidden well. The six-legged cyborgs shot like bricks of rusted metal from their docks under the flyer. As they scuttled past her, she palmed the nape of her neck where a scar marked the place her implant was inserted years ago.\nAn implant was a recovered meteorite fragment, barely bigger than a grain of sand, fused to a transmitter that kept it bonded to other recovered fragments. The trove of research on the meteorite included the finding that linking its fragments like that prevented inspectors from walking across bridges laid by unrecovered fragments—tears on the fabric of the Sovereign’s Prime.\nSoftening his gaze, Timoh’s lips curled up. “Perchancin’ tea, inspector?”\nHis case had been escalated once it became clear the recovery mission could no longer ignore his retellings of Sovereign Nu’Dawn’s conquest and events that followed.\nThere were reports from the August Aeronautics plant of him passing out leaflets he had authored. He had been recorded gathering children around various statues to tell them stories of the people in those statues that could only have taken place after they died.\nThe mission pieced his confused versions of events together after getting word that he had begun speaking of the Sovereign Cletus Nu’Dawn the Infinite as though he were dead. What they found was worryingly similar to six near-congruent strands believed to have splintered from the Sovereign’s Prime shortly before he arrived on Sanctuary 2.\n“That building without a roof . . . ” Having refused Timoh’s offer of tea, Nu’Terra gestured toward the outbuilding that previously drew her attention. “What’s in it?”\nScratching his coarse head of hair, Timoh turned for a glance at it. “Hear now, as the rock thrower be true, so I must be.” He fixed her with eyes that modeled virtue. “Old rocket shed. Then-Timoh’s handiwork, hear now—before the magisterium forbid it.”\nShe nodded, holding a thought as one of her sweepers crawled out of the hole in the building’s roof. It scurried like a gecko down the building’s exterior next, indicators flashing a sallow green on its iron-nickel shell. Green meant the shed was clear, no extralocal emissions detected, no fragments discovered. Red, without exception, meant a fragment nearby, a meddling stone, a bridge from the Sovereign’s Prime to an alternate strand.\nNu’Terra returned her attention to Timoh. “Did old Timoh rid the shed of rockets once the magisterium ruled them illegal?”\n“True as the rock thrower, he did.”\n“And you haven’t been collecting more of them for nostalgia’s sake or similar justifications?” She watched his eyes pinch together, considering, putting on the air of incredulity. One could never tell with a meddler.\nSeeing the second sweeper exit the shed through a tilt door, she channeled into its awareness through the bond between her implant and its carapace. Though a limited awareness, it gave confirmation that the shed was clear, both of fragments and transients from alternate strands.\nShe spared Timoh a flat smile, hoping on the kindly fool’s behalf that she truly would be out of his hair soon.\n“Let’s go have a look.”\nCrossing after him into the shed, she heard laughter. His case file had indicated three children still live here with him, counting a grandchild.\nThe floor felt damp. No light passed into the enclosure except through that cavity in its roof. The musk of fertilizer hung in the air. Where daylight shafted down, machine parts glinted in heaps on the ground.\n“Beholding, just junk Fig scavenge from motoshop.” With his eyes glinting outside the light, Timoh lurked in her periphery. “Nothing go up to the rock thrower from here, true as her.”\nLaughter bounced off the walls again, pitched too high to belong to someone old enough for work in a repair shop.\nNu’Terra turned to regard Timoh’s hunched frame. “Is that Fig laughing?”\n“Fig rap to none but the rock thrower since birth,” he answered, a hint of grief in his voice. “Call him Soon-Timoh ’til I’m in the earth, kin of my dotty Sarawa who rap the Standard fluent.”\nShe nodded—hearing about his mute son—but that hadn’t answered her question.\nIt wasn’t for lack of trying on the Sovereign’s part that, after ninety years, people in August hadn’t accepted his Standard as a first language. After all of Sanctuary 2 was forced to adopt it, dissidents previously executed in this strand began turning up in August. In their native dialects, they regaled its populace with retellings in which Sanctuary 2’s invasion hadn’t succeeded.\nNu’Terra glared another few seconds at Timoh. The silence between them filled her mind with images of transients being chased like fugitives through fields of hay. She had been too young to attend the public executions where those captured were hung alongside meddlers they had come in contact with. Though a bygone era, the rule remained. The killings—whenever deemed expedient—now happened in private.\nTimoh shifted his weight from one foot to the other, slight but enough to betray that he was blocking Nu’Terra’s view of something.\n“What’s behind you?”\nWith that penetrating stare of his to the ground, he inhaled deep. Between his feet, she spied an object like a dome under a weathered mass of tarp. She rounded him to get to the other side of it, keeping his trembling hands in the corner of her eye as his gaze followed her.\nThe object reached up to their knees under the tarp, spanning twenty feet between them.\nShe eyed him with care to hide her apprehension. “Do you mind?”\nHe muttered something that could have been a prayer in his language or a curse. In a swift motion, he pulled the tarp back.\nNu’Terra clenched her jaw at the object under the tarp and the pit it had been lowered into. One misstep and she might have fallen in. More to her displeasure, she was now looking at a small passenger capsule and a platform underneath.\n“Only capsule you find,” Timoh stammered. “No booster.”\n“You expect me to take your word on that—you hitching this thing to a platform, then lowering it down this far while having nothing to hide?”\n“It’s for my grandy.”\n“Your grandchild?”\n“To pretend she’s sailin’. Playtime, true as her. No rockets here.”\nA metallic belch issued from down the pit where Nu’Terra couldn’t see. She began wondering what Timoh had muttered in his language before removing the tarp. They eyed each other. The squeaking continued a few seconds more. After a muffled thud, the pit fell silent.\nNu’Terra hummed a sigh. “How long will it take to crane the rig up to ground level so I can see for myself?”\nTimoh chortled, and it made her cock an eyebrow. “More than the hour you timed on staying.”\n“Start now in that case.”\nHe wiped the shed with his gaze, stopping beside its tilt door where a slab protruding from the wall held a control module with its screen idle. After a nod from Nu’Terra, he shuffled toward it. She wiped sweat from her brow as he keyed in commands through the screen. The ground shook. A hum commenced. The muck under her boots began to feel like it might pull her in.\n“Best be outside ’til it’s done,” Timoh shouted over the hum, peering behind his back at her. She paid the advice a begrudging nod and began haltingly toward the door. At the door, she let him exit first, ducking cautiously under it once he was at a safe distance from her.\nBefore she was fully out, laughter echoed again. This time she traced it to two children no older than seven, like mirror images of each other as they scrambled out of the shed behind her.\nShe froze. They beat their little legs past her to the main building forty yards out. Without hesitation, she channeled into the awareness of the sweeper closest to her.\nShe felt its six legs like they were hers, the channeling so abrupt she lost balance on her own feet and fell. Memory of encountering the kids inside the shed flashed vividly enough that it may as well have been hers. They were identical. They had been playing under the module when this sweeper tagged them as native to this strand. Even children from outside the Sovereign’s Prime couldn’t be spared once identified.\n“Timoh,” she mouthed, shaking herself out of the sweeper’s awareness. “Your case file doesn’t list a set of identical—” She paused at the sight of him offering his hand to help her up.\nShe should have brought more sweepers. If these two had erroneously cleared a transient, the entire compound could truly now be dangerous ground. A transient of unknown design could fry her implant, leading to brain death, her body in this strand, her mind in that in-between void where time moved in no direction.\nWithout Timoh’s help, she shuffled back to her feet. “You have just one grandchild who looks like that, and she doesn’t have a twin.”\n“True as her.”\n“Who was that with her just now?”\n“Friend of my grandy.” His eyes roamed, darting frequently to the sidearm holstered to her waist. “Some call them twins but they’s just friends, true as her.”\nNu’Terra sighed in annoyance at meddler beliefs that refused to die. “True as who?”\n“Her the rock thrower.” Timoh puffed his chest up. “Her who throw the rock down.”\n“There’s no rock thrower, Timoh. There was a meteorite—we call it the August Meteorite. It fell a century before the Sovereign’s advance on Sanctuary 2. When the atmosphere broke it in pieces, it rained chaos on August, creating bridges to and from time strands not ours. It’s a cosmic anomaly, not the work of some savior destined to reverse history’s course as it concerns you meddlers and your insistence Sanctuary 2 was yours first.\n“This goes beyond religious conviction into realpolitik. Do you understand? If you’ve been keeping knowledge of a fragment from us, you’ll be interred the rest of your life, if not executed. If there’s a transient here—even one young as those two I just saw—they’ll be executed. I can try explaining this to you in that pidgin you speak.”\nNodding and looking away, Timoh raised a hand as if to stop her onslaught. She followed his gaze to the main building.\nThere, amid its rubble masonry, she saw the sweeper she had just channeled out of climbing to the roof, indicators green on its carapace. Beside it, a shirtless young man stumbled out of the building’s arched entryway. He held a tray while, behind him, a slightly younger woman in a frock rushed two mugs to him.\n“Fig and Sarawa?” asked Nu’Terra, matching their faces to photos of Timoh’s youngest children.\nTimoh beamed a wide, unrepentant grin at her as the shirtless man bounded toward them. “Tea, inspector?”\n“Hear now, these fields be as unkind as we ’gree to let them.” Timoh breathed deeply after his first sip. “Views differ but I meme the golden rule: you get out what you put in.”\nNu’Terra stalled when it was her turn to grab a mug from Fig’s tray, eyeing its creamy content, steam rising like a charmed snake from it. Beside her, Timoh continued his small talk while the noise from the shed kept on at a reduced volume.\nFig nudged the tray toward Nu’Terra. Both men had the same protruding stare, but Fig’s was more commanding, as though he’d learned to carry conversations with his eyes. To Nu’Terra, those eyes seemed to assure her he had slipped nothing in the beverage.\nShe took the mug, thanked him under her breath. Clipping the tray below his armpit, he backed away so the trio now stood in a circle. Timoh was talking about new printers at the plant when Nu’Terra returned her attention to him. Glancing at Fig a second later, he switched seamlessly to his native tongue.\nHe must have shared a joke with him next because the man doubled over suddenly and mimed laughter, eyes wide, muscles stiff as veins bulged on his brawny frame. He used his fist to respond in a sign language equally impenetrable to Nu’Terra, then barreled toward the main building.\nNu’Terra dismissed a thought that the joke had been at her expense. The tea smelled like ginger, but she felt no rush to try it.\nAt the building’s entrance, Sarawa caught her eye as Fig vanished behind her. The woman was dainty with sharp features that made her look like chiseled stone. She waved at Nu’Terra. After a brief hesitation, Nu’Terra waved back.\n“You have a lovely family, Timoh.”\n“They’s my youngest,” he replied. “Per’venture you cross to Port Country up north, ask after my firstborn, stationed there three years. Iwa sur-Timoh. She got high ranking with Global Defense, true as her. Left her dotty here to come up how she come up—pasturing life.”\n“Would that be your grandchild . . . or the friend who looks—” Nu’Terra tittered as mounting disbelief threatened her resolve. “—strikingly like her?”\nAs if he hadn’t heard her, Timoh resumed his philosophizing about life on the steppes. “Hear now, these fields don’t grow crop if you don’t let them grow you up first. Many give up and cross to Port Country or Lake Valley below. No patience with the rock thrower to learn how to till the earth she mark as ours. Then-Timoh tell the stories before he gone—the folks who crossed from here before Inzi come down from orbit to lay Cletus the enemy commander low.”\nNu’Terra huffed so audibly it made Timoh jump. Inzi was a name without a historical person attached to it in the Sovereign’s Prime. However, in about six other strands, she loomed large. In each of them, according to legends that bled into this strand years ago, she had cut down Commander Cletus Nu’Dawn before he assumed his immortal form.\n“Timoh, there’s no Inzi who came down to lay the Sovereign low.” She pitched his daughter a quick glance as if to confirm with her what she’d just heard. “You’re a very confused old man. That or it’s something worse for you and everyone else here. We’ll know soon, but for the sake of disclosure, you should know that speaking of the Sovereign as if he’s dead is the reason I’m here this morning.” She bent her head at Timoh’s unnerving calm. “You’re so unassuming yet we have these reports of you spreading apocrypha the likes of which nobody’s encountered since the recovery mission got its start.”\nTimoh nodded. Again she wasn’t sure he understood her.\n“That’s all you have to say?”\nHe downed his remaining tea, then raised a finger. “Perchancin’ I excuse myself, inspector? Very quick in the house and back—very quick.”\n“Go,” she shot back. He scurried toward the main building. “Don’t wander too far,” she called after him. “I would hate to waste an extraction request on you and we find nothing on your property.”\nWith his back to her, he waved as if to shoo her away, barely acknowledging his daughter as he strode past her into the house.\nThe woman threw Nu’Terra a hard glance. Nu’Terra turned her back so she could channel undistracted into the sweeper currently inside the compound’s garage.\nOn six legs, she scaled a compactor and thought—as I did once—that she would’ve done well if born a sweeper. Its eight bulbous black eyes pierced the surface of things ’til all it saw was a soup of quantum ephemera inside which particles that didn’t belong stuck out like artifacts in the blur—extralocal emissions. At times she channeled so deep it felt like she swam in a numbing sea and all that broached her own awareness was bliss. No pesky meddlers exhausting her patience. No faculties of cognition complex enough to have her questioning the mission.\nShe sensed a presence behind her and knew this wouldn’t be one of those times. Shaking her hand discreetly, she shook herself out of the sweeper’s awareness.\n“Inspector,” came a lilting voice.\nShe whirled to meet it, her hand itching for her sidearm. Sarawa’s frown was oddly enchanting up close, and it knocked her breath from her.\n“Sarawa . . . ”\n“Did I interrupt something?”\nNu’Terra wiped sweat from her brow. “Not at all.”\nSarawa’s lips curled up but Nu’Terra could only read torment on them. “So it isn’t true you all develop a dependence on channeling that slowly erodes your senses?”\nRecalling her confusion over where she’d landed her flyer, Nu’Terra huffed. “What do you want?”\n“To ask why you’re here.”\nNu’Terra took a moment to resume her even keel. “Your father’s playing a dangerous game, Sarawa. If there’s a transient on this property, we may not even have to prove one of you knew about it.”\nSarawa nodded, that tortuous smile still on her. “Have you considered that it might be you getting history wrong?”\n“That’s nonsense. When time came for the Sovereign to redeem his claim to this moonworld, it was discovered that your forebears had been squatting here and had neglected to inform the rest of civilization. After they got tired of warring with him and chose to hear reason, they neglected again—in true meddler fashion—to tell anyone about this thing that came down a century before he arrived and turned August into a haunted plain.\n“I’m here on his orders to prevent war with adversaries he can’t properly anticipate because they strategize outside his Prime. This morning, as it’s been for some time, we’re doing what we must to prevent death on a scale previously unseen. This time strand—an untold number of alternates connected to the Sovereign’s journey here ninety years ago—”\n“Don’t put on airs, knowing exactly what I asked. Why did you choose this version?”\nNu’Terra clenched her jaw as a grudge she’d held since birth threatened to surface. “That’s enough from you, Sarawa.”\nThe woman held her hand out. It took Nu’Terra a few seconds to understand why, then hand her the untouched tea.\nWhile Sarawa gulped it down, a thought crossed Nu’Terra’s mind and stirred tremors in her chest.\nShe folded her arms as the woman began toward the building. “I couldn’t help noticing you didn’t deny there being a fragment here.”\nSarawa turned to pitch her that bewitching smile again while backing away. “I’m not my father . . . I won’t dance for you.”\nNu’Terra looked away.\n“It’s nice meeting you, Inspector . . . ”\n“Inspector Ransom Nu’Terra.”\n“Hm.”\nThe grandchild answered to Suniwa—whichever of the two girls she was. A minute after Sarawa entered the house, they ran out, flitting past Nu’Terra without a glance at her.\nShe watched them frolic in a clearing beside the shed, mindful of the three now inside the house. They played a clapping game that involved a tongue-twister in their language, teasing laughter every few seconds.\nReminding herself that her sweepers had cleared both of them, Nu’Terra began pacing in their direction. They stopped their game when she crossed within a few yards from them.\n“Suniwa,” she called, stopping as well.\nA moment passed as they eyed her obliquely, like they’d never had to decide who would respond to that name.\nNu’Terra squatted down, adjusting her plaited brown hair in effort to look disarming. “Come here, Suniwa.”\nThe one in a leotard snuck another glance at the one in overalls before ambling toward Nu’Terra. Her expression was bashful, but she flashed Nu’Terra an enormous grin when she reached her.\n“That’s your name, is it?” Nu’Terra asked.\nThe girl nodded, hands behind her back as she rocked gently. Her missing front teeth captivated Nu’Terra.\nNu’Terra glanced over the girl’s shoulder. “Who’s that you’re playing with?” The girl didn’t answer. “Come,” Nu’Terra called, waving the other girl over.\nShe came close, flashed a timid, gap-toothed grin to match Suniwa’s.\n“What’s your name?” asked Nu’Terra.\n“Caruwa.”\n“Suni and Caru . . . ” Nu’Terra’s smile came unforced for the first time since she arrived. “Caruwa . . . ” Her mirth regained its artificial quality as she tried for a wistful hum before levying her next question. “Do people tell you how much you look like Suni?”\nCaruwa nodded.\n“Why do you think that is?”\n“I don’t know,” the girl said gingerly.\n“Do you live here with Suni or are you just visiting?”\n“Here.”\nNu’Terra batted her eyes at the girl. She had never encountered a transient this precious. This wasn’t one, she reminded herself. Her sweepers had checked.\n“Where’s ma and pa, Caruwa?”\n“New Autumn,” the girl mumbled through her smile.\n“New Autumn Reserve—” An image of two adults getting violently separated from their infant child flashed in Nu’Terra’s mind. “The internment camp . . . ”\nCaruwa’s smile faltered. Nu’Terra lingered on that image. The infant child; only a few minutes old when sentinels hired by the recovery mission dragged her parents out of the birthing ward.\nBurying the image, she regarded Suniwa. “What do you think of your grandpa, Suniwa?”\nSuniwa was no longer smiling. Nu’Terra hadn’t noticed the grim look in her eyes ’til now; as though she too had seen something upsetting flash in her mind.\n“Don’t run,” the girl muttered.\nNu’Terra pinched her eyes together. “What—” A smile lit her face up, masking horror underneath. “What does that mean?” She thought the girl might be speaking the Standard in that same broken manner as her grandfather. “Timoh doesn’t . . . run?”\n“Don’t run,” echoed Caruwa. She too had stopped smiling. As Nu’Terra searched for context within which such instruction wouldn’t be cause for alarm, the girl spoke again. “You’re not completely across the bridge.”\nA chill coursed through Nu’Terra and made her woozy. Bridge . . . That was what the girl said—delivered in perfect Standard.\nShe bolted up, staggered back. The word could only mean she was no longer in the Sovereign’s Prime.\nHer heart pounded. She almost fell, backing away from the girls. They stared vacantly while the word reverberated in her mind, forcing her hand toward her sidearm. Not completely across.\nNo one had ever conceived of a bridge that could hold someone on it, rather than pass them instantly to another strand. A childish prank, she tried telling herself. But before becoming aware of it, she had drawn her sidearm and begun choking its grip.\n“Timoh,” she bellowed, the main building in front of her again, the sidearm pointed down. Not at the girls, she made sure. “Timoh, come out here!”\n“Shortly, inspector,” came his hooting response.\n“This second, you doddering, old, moon creature.”\n“Just another minute.”\n“Right this—” Something on her left caught her eye.\nShe hadn’t landed her flyer so far off the compound, yet there it was. What it posited now, she refused, breathing harshly while her head throbbed and the floor felt like it might drop from under her feet.\nNo bridge had been discovered stable enough to return anyone who crossed it into another strand. She tried telling herself she was still in the Sovereign’s Prime. Timoh shouted in what she now realized was perfect Standard.\n“Inspector, I think one of your sweepers found something.”\nThe sweepers. She focused on the implant behind her brain stem in order to channel into one of them. If they had discovered extralocal emissions, she should have sensed it when they did. The channeling attempt failed, giving her severe chills and a rush of blood to the head.\nShe thumbed a lock on her sidearm to set its payload to lethal. The film of sweat under her nose took on a blood smell. She wiped the nosebleed on the back of her hand, nodded her resignation at the turn of events.\n“Meddler scum,” she barked, taking quick aim at the entrance. “Come out here—all of you.”\n“Lay down your weapon,” returned a new voice. Velvety. Rattling her for how similar it sounded to hers.\nHer stomach dropped as, through the entrance, I took my first step outside.\n“Ransom Nu’Terra,” I said, completing my exit. “Don’t be so quick with that, or you’ll kill your own ghost before she’s had her day with your Sovereign.”\nShe squeezed her eyes shut. Opened them. Shook her head. Having failed to wake herself from the dream she hoped this was, she trained a pleading look on me, mouth agape, chest heaving as her breathing grew difficult.\nOne of her sweepers squirmed in my arms, smearing its sweat on my coverall. Fidgety beast it was with its carapace removed, spiked fur, a falciform pate with its eight bulbous eyes. Fig walked up beside me with the other sweeper in one arm and its carapace dangling off the other. He tossed the carapace. It landed halfway to Ransom—my soon-to-collapse doppel.\nYou might still need that, I signed to Fig, briefly able to get a hand free.\nHis eyes went to the net hanging off a string around my wrist.\nWe have too much already, he signed.\nRansom—sidearm still pointed at me—gazed finally at that net. Seeing the nineteen meddling stones like flints of polished rock inside it, her eyes rolled back, and she fell unconscious to the ground.\nWhenever a report came that one of the meddlers had been spreading their own version of history, one of us had to pay these storied steppes a visit. Years ago in my native strand, I defied that order, embarking on this endeavor instead.\nIt’s now Ransom’s turn to rebel.\nWhat would my name have been had the recovery mission not whisked my parents away to be burned for their fragment collection?\nI glance at Ransom Prime—my spitting image. She has no answer to that. Only tears right now.\nMinutes ago, my sweet Sarawa—seeing her finally awake—entered the makeshift operating room and broke the news. We had to surgically remove her implant when it looked like she was minutes from brain death.\nShe held herself and bawled into the mattress while Sarawa tried to comfort her. I waited out the worst of it outside. I wouldn’t have been able to relive that moment when—learning I would never channel into my sweepers again—the withdrawals began.\n“You know the story,” I tell her; my story as well as hers, the infant barely minutes from her mother’s womb. “You don’t think about it but it’s always with you. You come from meddlers. The Sovereign here killed your parents before they had a chance to tell you your name. Because he never learned it himself, you were spared and conscripted into service as one of Sanctuary 2’s child spies.”\nI sit at the foot of the mattress as she sobs. She rests her head on Sarawa’s chest, her shoulders like an engine failing to start. In my native strand, I’ve been here, on a similar bridge, stable enough to have enveloped the homestead over time. My strand was also called the Sovereign’s Prime until another Ransom Nu’Terra entered it and followed steps to kill the technically immortal Cletus Nu’Dawn.\n“They were going to name you Inzi,” I tell this one. “Inzinaga sur-Amat.”\nShe pulls away from Sarawa. Sitting up, she takes a moment to halt her sniffling, then nods. Right about here is where I too began to understand. Inzi who came down to lay the enemy commander low. Ransom Prime faces me and, for the first time, doesn’t see just herself. She sees someone so inevitable as to barrel through legend and truth in search of her.\n“You know what it means?” I ask. Watching her close her eyes the same way I did, a lingering disgust at myself that can’t be helped makes me consider denying her its meaning. “You shouldn’t. You don’t speak the language. You went to great lengths to make sure you didn’t pick up any of it so you’d never be reminded who you are. I did that as well.”\nA new round of tears well in her eyes, triggering unpleasant memories inside me. Age six was when I had it ingrained that my parents had spoken a language that conditioned them toward rebellion and led to them choosing their meddling stones over me.\n“Inzi-na-ga . . . ” I get up and move closer toward the room’s window so I don’t have to face her. “Stone of us—our stone.”\nI consider telling her about Timoh’s meddling stones. Up to nineteen now and momentarily in my possession, they’ve been smoothed into a distinct variety of shapes that, when held together, unlock configurations able to shield both the stones and any transients around them from detection. Where she’s going, all we know about the August Meteorite and have kept to ourselves will be revealed to her.\nThrough the window, I see her ride there; the launchpad inside the shed with boosters and a passenger capsule now ready to board.\nWhen she’s ready, she’ll slip into a pressure suit without protest while I swap my coverall for her fatigues and burgundy cloak.\nInside the shed, she’ll board the capsule willingly, then smile.\n“I hope you’re right about this working,” she’ll say.\n“This bridge we’re on goes to many places,” I’ll explain while helping her with the safety belts. “When the girls warned you against running, they were only worried you’d end up in a strand too alien for you to survive.”\nThough the girl doesn’t know the extent of it, Caruwa escaped a strand where her own grandpa Timoh and her parents were interred and later executed.\n“This endeavor isn’t without risk,” I’ll add.\nSix miles in the air above this compound, the bridge connects to a strand where a station orbiting Sanctuary 2 takes us in ’til we are fully recovered, then sends us out to infiltrate more strands.\nOutside the shed, I’ll be joined by Sarawa, Fig, Timoh, and the girls. Together we’ll watch Ransom Prime lift off, then slip out of this strand.\nI’ll kiss Sarawa and the others after that, then—with the sweepers in tow—walk the roundabout path leading safely back to the flyer."}