{"fingerprint": "+7RsuQK2f3w3MhXLSfjp3uS/tgs=", "sitename": "Clarkesworld Magazine", "title": "Logistics by A.J. Fitzwater", "author": "A J Fitzwater", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/fitzwater_04_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Logistics by A.J. Fitzwater", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5150 words, short story\nLogistics\nAlls I want is a goddamn tampon. Is that so much to ask at the end of the world?\nYo. Name’s Enfys. This is, uh, my channel as I wander in search of tampons and the meaning of life in what’s left of Western Europe. Seems, I’m, um, immune to the phage. So far, so apocalyptic.\nNot so good at, uh, this talking stuff, but this is as good a way as any since people aren’t totally into face to face right now. Anyone could be a latent carrier. Plus, it’s a way to feel less mad. Until I go mad from talking to myself.\nGuess you’re wondering about, um, this lopsided-ness. Welp, I was on the table in Stockholm getting chest reconstruction surgery when Calais went down in a blaze of glory. Surgeons panicked, sewed me up, left me half the person I should have been. Ugh. Scars itch. Can’t feel my nipple. So that sucks.\nSo, why would you do a dumb thing like major surgery in the middle of a worldwide epidemic, I hear you ask. Well, no one knew we were in the middle of anything coz the CDC said they had it under control. I thought, hey, mutant flesh-eating bacteria. It’s like HIV in the ’80s, or Ebola in ’16, or the Monkey Flu in ’21. We’ll deal. Movie of the week in six months.\nDidn’t even know about Zero Point Jacksonville or population estimates until I left Sweden. By that time things were starting to make a bit of sense and everyone had a channel. Guess that’s what happens when most your newsrooms are wiped out, huh.\nHalf the world’s population, gone. Just like that. Geez.\nUgh, this is turning into one of those “where were you when” things. I dunno, do you need to hear mine? Everyone’s had it rough and lost people. I don’t have it near as bad as others. I wanted to do something different. Coz, need, and I can’t be the only one, right? So.\nSHOW ME THE TAMPONS.\nSeriously. The African co-op did great work collecting and warehousing goods before everything north of the equator was sent up in smoke by those WHO idiots, but they could have left something behind in the emergency caches for those of us who are the subset of still wandering and still bleeding.\nAnyway. I’m heading south through Germany. No, I won’t put location tags on. Message me. Point me other channels. Help me out here please. Leaves in my undies is uncomfortable.\nEnfys out.\n. . . mazed anyone saw it considering . . . oh, it’s going now? Uh, hi again. Enfys still on the search for sanitary products in the afterlife.\nSo, um, thanks for watching. It’s nice to know you’re out there. The last people I spent meat time with was the lift I got from Malmo and they dropped me off in Hamburg. Well, what was left of Hamburg. Wall of smoke started freaking them out.\nAs for suggestions on where to find me those sweet tampons. Someone said “try a roadside cache,” and yo, were you even paying attention? Next cache I find I’ll record so you can see what us wanderers are up against.\nDionysus365—yo, sup—said resource crews were still scouring what’s left of Berlin and there were untouched pharmacies buuuut I was too late. Smoke cloud over the city is huge. Tried to flag down one of the road trains but when they’re on full auto nothing stops them until they hit the Mediterranean. And I can tell you straight, burn and resource crews have been ordered not to pick up stragglers outside the evac zones.\nNot that I mind. I do not want to become a lab rat. I’ve seen the channels out of Joburg and Lagos. The sweet afterlife, just so long as you’re cool with being the face of the biological resistance. Ugh. I’m no good with needles.\nAnnnd I have the idiots who were calling me the “titless wonder” and a few other choice things. Screw you. Guess it was too much to hope the apocalypse would wipe out all the jerks. I wanna make some joke about putting the fascist into fasciitis. Ha. Nazholes. Ha!\nWhatcha gonna do? Come looking for me? You’re too bloody chicken, all locked up in your bunkers until the time is ripe to reemerge.\nI think it’s awesome how the apocalypse didn’t happen like all those scifi books predicted. All that dire-as shit preppers went on about was basically the only way they figured they could get women to worship them. “You’ll come running when you need a man to REALLY protect you from the looting and pillaging and raping.” Bish, please. That had been happening worldwide for time immemorial ANYWAY, and people have always been resisting that shit. We were always ready. If not ready for this.\nSo, the ones holed up in nuclear bunkers or their castles or vacuum sealed mansions. One latent carrier in there, and PWNT!\nAlso, newsflash. The phage can wait you out.\nYeah, I’ve been watching some of the science channels. Can go dormant in stone? That’s some weird ass shit. Eesh. The smoke cloud over Russia alone will probably trigger a nuclear winter.\nHere. See that? It’s summer yo. But all the insects are like, NOPE, and it looks like a billion volcanoes or thunderstorms all at once. And my hair is not streaked from stress. Ugh. Regular reminder: clean ash off with water, keep your eyes protected.\nAt least they thought to leave filters and face masks in the caches, eh. It’s not so bad. Some places are clearer than others.\nUh, Go Oyo wants to know how I survived post-op in Stockholm coz it burned quick. That’s . . . I don’t wanna tell you that one right now. It’s nothing like axes to zombie skulls or whatever. Just. It’s fresh. Maybe later.\nAnd BullaB from the new Caribbean republic—PR, sup—wants to know what an enby with a welsh name and a kiwi accent was doing in Sweden. Welp, two of those were choices, I moved there for capital R reasons. And hey, it also meant with my current immunity my life expectancy just went up. Loss-win. Dark humor, I know.\nAnyway, it doesn’t matter now.\nOkay. Done for now. Tired, and air quality ain’t great. Been walking for, uh, weeks. Fuel reserves gone south, and most solar and electric vehicles too. But I’m coping. It’s scenic.\nCatch ya.\n. . . documenting the landscape before it’s taken over by triffid wildlife. I mean, look at this. I call it: Death of the Front Lawn Brought on by Neoliberal Collapse of Worldwide Health Systems. Beautiful.\nUm, comments. Captain Spike-hi-says there’s a place for me in one of the enclaves in, um, maybe Joburg or one of the central cities. Oh my god, the afterlife even has drag queens. Thanks, love. I appreciate the thought, but I’m taking my time, sussing out the new world order.\nThe continent is big. Seriously, yo, Africa’s not a country. Takes time to get around. Things are in flux. Too many people on the move. Too many tribal and community conflicts to resolve. Central co-op doing the best they can, but it’s still early days. Not even worth doing the census, if you ask me. They make it sound so normal, it’s weird.\nAnd we don’t know the vector of the phage. Another wave could come at any time and then and it’d be Zero Point all over again.\nHey, does anyone have links to channels from California, or people formerly thereof? I know the whole country is basically wasteland, and the resource trains are programmed for Panama southwards but there’s some, um, people . . . yeah, uh, put it in comments.\nSo, I said I’d, uh, show you a roadside cache. They’re regular but on the small side since wanderer stats are apparently low. Most people are pretty good at keeping to themselves. I’ve watched a few other wanderer channels, especially that one by the anonymous Bush Cook, and yeah, it’s mainly true. You put up a flag and they’ll leave some cooked food or supplies out for you. I’ve only come across one camp who were, like, totally strict quarantine and walked me off, no hassles, no fuss, they were nice about it.\nThen there was a Roma camp who let me stay over. Was nice to have a bed for a few nights, but it ended up feeling weird being around so many. Nice people, they know how to survive.\nSo, um, this is a cache. They’re kept in these new hybrid plastic units. Waterproof, vermin-proof, and, uh, supposedly phage-proof. Apparently, this stuff could last a thousand years in outer space.\nYou’ll usually find them near motorway off-ramps or the site of an old landmark. They’re flagged and people have been good about geo-tagging them.\nIt’s kept unlocked, coz, come on. It’s not survival of the fittest. It’s simply the survival of. Good array of tinned and dried food, utensils, solar chargers, and a solar plate. So much better and cleaner and lighter than a gas cooker. Plus, for the days when it’s, uh, overcast, they’ve gone for a wide range of accessibility. Like electric-based gear. Grid’s still on, which is cool, eh. That’s if you can find a handy outlet.\nAlways useful medical supplies, painkillers and such. No antibiotics, I mean, come on. This is the post-antibiotics world. Nappies and formula, good job there. Masks, wet weather gear, pet food, toilet wipes. But . . . whaaat! Some goddamn sanitary pads. Enough for a couple periods anyway. This has gotta be a first. Thank you, um . . . See Ay Gee. That stands for . . . ah, there it is: Centralized African Government. Not to be mistaken for the former Central African Republic. Huh, the alliance vote must’ve gone through. I was paying attention to the South American Alliance voting over the weekend, coz I got friends down in what used to be Argentina. If I can find them. Not that I’d get over there. We got super plastics outta this thing, but not easy ways to get across oceans right now.\nThanks for the comments and support, by the way. I appreciate you’re watching someone rambling across Europe griping about tampons. Salonga82 said a tampon factory has opened in Lagos, and India is doing good things producing pads in rural areas on the back of their cottage industry. That’s really cool. Just gotta figure out distribution models, yeah.\nAnd since this is the afterlife, and I don’t give a flying rats, I’m putting it out there: I’ve received death threats from the nazholes. Ugh, you have no idea how hard it was to say that. Some old habits die real hard. Anyway, I’ve reported them to channel admin, and they’re investigating, so that feels like progress. Thanks to BackChannelNinja from Oceania for hooking me up with the admins. Oceania is hanging on. They may be small, but they’re mighty. Aroha nui, whanau.\nWell, I have baked beans, sausages, and chocolate milk powder, so I’m set for a feast and a not entirely uncomfortable night’s sleep. Imma go change my leaf for a pad. Oh my god, heaven.\nOh, and have you peeps watched the recording of Black Friday Live for Life in Luanda? That shit rocks! So awesome to see 3 of the 4 band members survived. Link is below.\nEnfys out.\n. . . course not every town and minute village has been sectioned. Gonna take years to develop proper testing procedures for the dormant phage. I mean, we lost a good chunk of the scientific and medical community coz many of them were first responders.\nHuh. Wow.\nUm.\nSo yeah. You’re gonna find people still living in small pockets. They’re usually good about sticking to quarantine rules and stay in touch with resource teams. No, I haven’t seen any marauding bands. This isn’t some sick HBO hellscape, yo.\nAnd, no, I’m not gonna be ghoulish and show you an abandoned town still waiting for the burn crews. Cremation teams have done their best, but yeah, there are still bodies out there where they dropped. You can smell it. Those idiots who ran corpse hunter channels. Tsk. Really? Thought they were latent, but in the end it only showed the good side of chaos had them fooled . . .\nSHIT.\nHa ha. Phew. Just a door banging in the wind.\nWoah, weird. Empty. No quarantine signs. No bodies. Nothing. Interesting. Never seen a building made out of the super plastic before. Just. A regular house. Knew they were being experimented with before . . . uh . . .\nListen. Can you hear all the birds? Insects too. Wind in the trees. So loud. Mmm, smell the fresh growth. Love it.\nINT: Dark screen[Unintelligible fast whispering]\n. . . have half a chest and my goddamn binder tore and nothing fits shit shit shit . . .\n. . . and with a bit of sticky tape like so, it does the trick. I mean, hell, I can find sticky tape in the afterlife but not sanitary products? Ugh. I know. What I’d give to have my implant reupped but that would, um, mean rejoining civilization and my med papers are not all that since I left Stockholm in a hell of a hurry.\nYeah, so some of you have been asking about that. The whole hospital deal, a nurse having my back, er, front, ha ha. Those first weeks were, um, yeah.\nBut I then I got to thinking. She deserves her name out there, coz she was goddamn hero like all those other first responders. Maybe she has family that doesn’t know what happened to her. So anyway, here goes.\nPhewf.\nHer name was My. Here’s a stealthie I took. I know, not entirely legal, but I didn’t want her memory lost.\nI didn’t come round ’til I was in ICU, which wasn’t necessary for my circumstances, but necessary for the circumstances. My and a few others put us in quarantine under the impression this would pass in a few days.\nI mostly slept through the first European wave like some Sleeping Beauty 28 Days Later kinda crap. One of my drain sites got infected and I could barely sit up. My didn’t lie, she said it was bad and that people were being evacuated and stuff was burning all over the place. I saw some of it on the Internet, but connections were sporadic, information distorted by panic. The power wasn’t on auto by then, like, not fully switched over to the Saharan solar or offshore turbine grids.\nI dunno. I wasn’t scared. Maybe coz she kept us on the happy stuff. End of the world was pretty boring, really.\nMy was real careful. Hazmat suit and quarantine procedures at all times. One of the other patients was mobile and would deliver us food and meds and stuff. I, um, kinda don’t remember the others’ names. I was in this weird place. I dunno, more annoyed that I only had half my chest realigned than thinking the world was coming to an end. I thought it would pass. We’re humans, we’re incredible, we’re on our way to Mars. Shit, I wonder what’s happened to them? Yeah, we can deal with one stupid flesh-eating bacteria that kills in 48 hours, right?\nHuh.\nIt was obvious when the other nurses and doctors stopped coming. But My, she was doing great. I really thought she was going to make it through. She was so careful.\nLast I saw her she had one of those purple blotches on her face. She couldn’t hide it. Didn’t really want to. We were all reasonably mobile by then, so she, uh, gave us packs and pills.\nThen she turned up the gas and torched the place with her in it.\nWe were well away, but I heard the hospital go up like the bombing runs in Washington and New York and Seattle.\nI guess we were the last out.\nUm, so look at this view. Beautiful, huh. All those untended vineyards. What a waste. Mmm, and the sound of the river, so nice. Noticed waterways are coming back quicker than expected . . . ?\nOkay, I admit, I’d been holed up for a few weeks. That plastic house, okay? I didn’t record from inside, coz, well, old habits. You think all the shitheads would figure we gotta work for the betterment of humankind, yadda yadda, but nah. They’re quite happy to see this as the Second Coming or whatevs. Nazholes like cockroaches, still up in my mentions. Piss off. You’re all cowards, stuck in your bunkers. And whatcha gonna do? Who’s saving the world? That’s right. The CAG. South American Alliance. Oceania. India. They put up with your goddamn colonial shit for hundreds of years and yet they opened their arms and their borders when it came to the crunch time.\nBorders. Damn. Even thinking about such a concept now is so weird.\nSo yeah. I faked it when I channeled before. But now I’m on my way again. The ferries are running regularly to Alexandria, but. I dunno. The CAG is supposed to be the new enlightenment. Everyone has a place. But, do they really? I’m a cynic. I don’t expect humankind to change that quick. Ugh, old habits old habits old habits. And I know the Big S has hit the more vulnerable people. My people. It’s that old holdover. You wanna be in control of your death when you didn’t have much control over your life.\nI’m out of tampons again. Surely someone’s got it together with sanitary product distribution? I mean, getting the word out and drone drops wouldn’t be such a biggie.\nOh, thanks for all the concern when I was a little quiet on it. BigWiggie224 wants to know if I’ve been able to track down my fam in New Zealand. Still working on. I buried enough of them Before it shouldn’t hurt . . .\nINT: Dark screen[unintelligible sobbing]\nIt’s the end of the world as we know it, and I feel fine, except for cramps and leaks and constipation.\nBeen a few months off my implant now, and my cycle is, um, reinforcing itself in style. Hard enough without my anti-anxiety meds. But now the dysphoria is real, yo. Stupid body.\nWoah. A thought. If I’m dealing without my meds, what about those with chronic conditions. Insulin and dialysis and stuff. Dang, that’s scary, yo. Hope CAG is onto that shit. I should look it up.\nHmm. Sea is pretty today. Some sunlight. Keeping on the move gives me something to do. Whoever is working hard at Google Maps is a goddamn legend.\nHell, what am I doing! Have I got a story for you!\nI shit you not, but I met Jaybee Middlewake the other day. Totally hot even without the eyeliner. I’m not lying! He didn’t want to go on camera, coz the art of celebrity is dead in the afterlife. And good riddance to it too.\nHe was working with an evac crew, and I joined in for a while coz it felt good to be doing something. Hells, incredible they let me stay with my shitty med papers.\nThe others from Black Friday were there. Inch said she’d seen some of my channel. I dunno, maybe she was just being nice. Justice gave me some moon cups. What a babe. I didn’t tell her I can’t use the things, they give me the creeps. I didn’t go all fanperson tho, and freak out about how awesome the Luanda show was. This is the afterlife. I have to be cool with whatever it throws my way, even if it is my favorite punk band wandering out of the French mist.\nBut Jaybee. He was ethereal. This big team was evacuating an assisted living facility and some rest homes. I mean, what sort of jerk leaves disabled people behind in the afterlife? Thank god it wasn’t a town the burn crews had been through. The place was pretty rank, but somehow the majority of them had survived this long. Turns out couple those kids were really handy at scavenging, and a couple the older ones were really good cooks. They had running water, and they did their best.\nI’m no saint. I admit I didn’t think about it, like the meds thing. Makes me a damn regular jerk. Glad there are people out there with longer vision than me.\nAfter we got them on a transport, the crew spent another couple days repurposing supplies from around the area. The hospital was a no go, already burned down. But there were some supermarkets and pharmacies which were a gold mine.\nIt was . . . nice. Hard work. But nice. I’m not one to kiss and tell buuuut . . . believe me, don’t believe me, up to you. Jaybee lost his whole family back in California, and his best friend from the band. We all need a bit of comfort in these dark times. I’d forgotten what it was like to hug someone. Bit weird, being lopsided. Ha.\nJaybee and me discussed a couple things. Like the trouble I’ve been getting up in my mentions. I said, I’m fine. Sure. There’s been a couple nazhole stalker channels, but I’m pretty sure they’re fake.\nThe other thing was the offer of joining the evac caravan to the ferry. I said, my grrl, my papers would not get me across the Mediterranean. He said, like some of you others have, they’re working on a point of transfer test for everything from latency to actively involved. Actively involved, god, what a euphemism for something that’ll kill you in 48 flat.\nI dunno. You’re talking to someone who’s had a body stared at and prodded all my goddamn life.\nBut Jaybee was cool. He understood. He said if I ever make it to Lagos to look him up. How did the embodiment of modern anarchy come to be a CAG guy? Keep rocking on, my grrl. I hope you stay immune.\nSo, I’m heading thataway, away from the smoke. Thought I’d check out what Monaco looks like empty. I hear all those gold toilets are a trip if you can slip past quarantine . . .\nShit. And we’re live.\nSorry for the whispering, but . . .\nOkay, I was a jerk. I was fooling myself. Said I was cynic, but I guess this whole change thing has made me part optimist too. It was nice to slide through the world with my only problem being finding tampons, finding my next meal, and dealing with my meat sack. I wasn’t hurting anyone.\nGuess that’s not good enough for some.\nShit, hang on.\nSorry it’s so dark. It’s like, 2AM. But I’ve been moving all night coz there’s someone out there.\nDon’t expect anyone to be round coz I’ve never done live before and shit I know I’m babbling but I can’t stop. There’s someone out there.\nShit, how do you turn location tags on. Shit. Sorry. Don’t have a selfie stick. Ugh, shut UP, Enfys.\nI don’t know if they suck, or they just got on the good side of chaos. Not a roaming pack. They’re pretty insular. Not cannibals or anything.\n. . .\nShit. You heard that, right?\nI think they’ve got guns. I know the new co-ops are doing their best to round up and dispose of weapons coz the afterlife isn’t gonna be like that but there’s only so much people can do and shit there are still nukes out there oh my god . . .\nShit shit shit shit I think I can see them. Not very stealthy but, I guess, what does it matter. Playing at First Person Shooter they don’t care. Shit shit I’m in the middle of nowhere. There’s a burn out a couple of kays back and a quarantine about five kays down the road but I don’t think I’m fast enough and the electric scooter I borrowed in Monaco is out of juice and like that would outrun a bullet, ha, shit . . .\n. . .\nI’m screwed, I stayed at the plastic house too long, got too comfortable. All cozy apocalypse. Ignore the stench, the smoke, the hunger, it’ll go away.\nOh but Enfys, you say. Shouldn’t you shut the hell up? They’re gonna hear ya. What’s it matter? A bullet, the phage, an infected scratch coz antibiotics are so last century. God, my scar itches. What’s one more death out of three and half billion?\nShit . . . can you hear that?\nWhat the hell . . . they’ve got drones? Of course they have. Well, unless a drone can open a dead refrigerator. Ugh, it stinks in here.\nWhat, I . . . can’t hear what they’re . . . Christ, I’m not the praying type but if anyone’s listening . . .\nOh god.\n. . .\nOh god!\n. . .\nThey’re close.\nCongrats Enfys, you’re gonna be famous. Channeling live, from inside the fridge, it’s death!\nShitshitshitshitshit . . .\n. . .\nThe hell?\n. . .\nUh. Huh? Someone’s . . . live commenting. They say . . . they’re in control of the drones and the nazhole stalkers are neutralized? Sure, Jan. How did you know they were there?\n. . .\nThey’re part of an online task force and were . . . monitoring the nazhole’s channel . . . and saw me come online at the same time and . . . cross referenced location tags and IPs . . . and Jesus Christ on a Biscuit, that’s some top level chaotic good luck.\nNazhole that confident, huh?\nNah, yo. I’m not that dumb. I need a sign of good faith. How the hell some drones take down a nazhole with guns?\nTrank darts? That’s some James Bond shit, yo. What’s to say you won’t use them on me?\nYou . . . need tampons, too?\nINT: Dark screen.[Quiet sobbing]\nGidday, yo, and welcome to the channel of the, uh, Tampon Express. Just doing final checks before we head out on the second ever delivery round. Mmm, the smell of fresher salt air, only slightly tinged with smoke. This time we’re going up the eastern Mediterranean coast, heading into Gaza, then up into the former Aegean states and around the Adriatic. Map and distrib points linked below.\nCourse, it’s not just tampons. Me and a few others worked hard to get those sorta things included in the medical supply drops. And here we are, round number two. Team Tampon kicking it, communal styles.\nUh, TikTakSinceBefore asks why I’m so obsessed with lady luxuries, and aren’t there more important things to worry, don’t we have bigger phages to fry? First of all DikDak, not everyone who needs sanitary products are ladies, so piss off. Second of all, we all do what we can, where we can. Right now, I care about tampons and gynecological health for all sorts of genders, coz it’s still HEALTH and it’s one small thing I CAN do. You not learned anything from the Purple People Eater? Infections, pain, prolapse, endo, fibroids, menorrhagia. Yeah, ew, not ew. Those are all still happening, even if you don’t want to think about the half the pop, no it’s now sixty percent, it’s happening to. Comfort, dignity, uh, people who bleed deserve that, even in these trying times.\nUm, been hanging out for this trip, tell ya. Time off gave me a chance to brush up on the basics of a few other languages. Few weeks at the Alexandria outpost was nice enough, but it’s not Addis Ababa, since Alexandria was cleaned out good in proper in one of the first waves. And um, thanks everyone for asking, I’m healing nicely after the surgery, and it’s, uh, certainly a weight off my chest. Yeah yeah, shuddup.\nOh, need to tell you that new sexual health clinics have opened in Nairobi and the Dar es Salaam outpost. Dar es Salaam is the second newly opened filter point for refugees coming in from the latest phage wave in India, check the link for the refugee news channel below. Um, both these new clinics are available for IUDs, implants, oral birth control, and all your disposables. South Shore Hospital in Lagos has a full gynecological suite. So glad it’s up and running again. Desperately needed.\nOh, and I got a new implant too. I’m period free for years! God, it feels so good. I can feel the, uh, proper shape of me now.\nAnother reason I’m stoked for this supply run, other than getting out on the road, um, sea? Is that I’m finally gonna meet Minette in Gaza! Yeah, yo. The woman who saved my arse back in the ruins of Marseilles. Hey, Min, you bad arse, lookit all I got for you. Woosh. TAMPONS.\nYerp, links below if you’re interested in her tutes on how to build and fly drones. Totally looking forward to getting flying lessons from her. The ex-military people here are cool, but they’re too busy to teach a civvie how to fly drones just yet.\nBut it’s, uh, getting kind of an imperative since I’ve been working with CAG Distribution on how to do supply drops without using up resources like the planes and boats that get first dibs on the rationed fuel stocks. But yo, necessity is the mother of invention, and Armageddon has been a great kick in the arse to divest humanity of fossil fuels. Check out the link to Doctor Samanat Apour’s channel about the labs investigating that new dry fusion. It is mind-blowing, yo.\nAnyway, uh, rambling again. Um. What else? Oh yeah, if I’m back in time I can join the team heading up to the Svalbard Vault and do supply drops along the way. Pretty freaking cool CAG Medical discovered the phage doesn’t settle in stone in extreme temperatures. Yay, the Sahara. Yay, the North Pole.\nAnd, so cool, so many of the Sami way up North have survived, just like the Inuits out of Canada. Those people got survival skills, yo. Great to hear from them finally. Medical is still trying to figure out why certain genetic predispositions and indigenous people are more resistant to the phage. I know somewhere back in my history my adoptive parents never wanted to talk about there is Māori ancestry.\nDo I know if my parents are still alive? Uh, don’t care.\nHeard from some fam who made it across the Tasman to the Melbourne outpost, though. Well . . . shit. Excuse me. Need a tissue.\nAnyway. Just about time to set sail. Weather’s looking good. I’ll be channeling in live each day at 1PM West Africa time. Time conversion app, yep, in links. I’m stocked to the eyeballs with tampons, pads, moon cups, sponges, washable organic cotton pads, knickers, bladder control pads, etcetera. And if I don’t have what you want, drop me a line, and I’ll run it past Distribution. I’ll be heading to the factories in Lagos and Luanda after Svalbard to see how production is going. Shout out to Counselor Yemisi Ekundayo, who is part of the council. She’s the woman, yo. Keeps me busy. Plus her egusi soup is the bomb.\nThis is Enfys, your host with the tampon most, signing off. Be well, yo.\nA.J. Fitzwater is a meat-suit wearing dragon living between the cracks of Christchurch, New Zealand. They emerged partially complete from the trail-by-wordfire of Clarion 2014, and have won two Sir Julius Vogel Awards (so named after the eighth Premier of New Zealand, not the bread). Their work has appeared in various venues of the fantastical such as Beneath Ceaseless Skies, Shimmer Magazine, Crossed Genres, Kaleidotrope, and Giganotosaurus. Brain eructations can be found on Twitter at @AJFitzwater."}