{"fingerprint": "fqegoeE2uGUWkjP8BVjGgAWPHcs=", "sitename": "Clarkesworld Magazine", "title": "Determined To Publish: A Conversation with John Fleskes by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/fleskes_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Determined To Publish: A Conversation with John Fleskes by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nDetermined To Publish: A Conversation with John Fleskes\nMany only know him by the shortened name on the spine: Flesk, next to the logo resembling leaves or fire—at least to me. But John Fleskes has been putting out high quality art books for nearly twenty years. Flesk Publications showcases fantastic art by a range of artists, many of them with an array of accolades, including iconic Elfquest creators Wendy and Richard Pini, distinctively smoky Jeffrey Alan Love, Prince Valiant comic strip artist Gary Gianni, and multiple-award-winning illustrator Frank Cho.\nJohn Fleskes has always been determined. Long before Flesk Publications put out their first title in 2002, Franklin Booth: Painter with a Pen, Fleskes was fast at work: at age eight, he was earning cash around the neighborhood, going door-to-door to wash cars, mow lawns, paint street numbers on curbs, make Christmas wreaths, and more. Once he started working, he never stopped. As a teen he was skateboarding, rock climbing, surfing, mountain biking, and more, but he was always working. At seventeen, he worked at Bungee Adventures, doing stunts and traveling. Among many jobs, he did a stint at a comic book shop, before joining Sun Microsystems for a decade. It was at Sun where he started to learn, plan, and save up for his own publishing venture.\nIn 2014, Fleskes took over as editor for the Spectrum series, which is both an awards competition and a gorgeous, wonderfully thick art book. The Spectrum books have received award nominations and wins across the span of their publishing history, beginning with book one. Accolades include multiple Hugo Awards nominations and Locus Awards nominations and wins, with Spectrum 26 taking the 2020 Locus Award for Best Illustrated and Art Book.\nHow did you become interested in SFF art, and at what point did you decide to make it a professional endeavor?\nMy interest in fantasy and science fiction was sparked by comics. When I was twelve, I came across the collected edition of Elfquest: The Original Quest by Richard and Wendy Pini. The stories were all about loyalty, acceptance, diversity, overcoming obstacles, family, and the strength of relationships, and so much more, and all done through the brilliant visual storytelling by Wendy. Soon after, I found a local comic shop and began my lifelong passion for this genre.\nWhen I published my first book in 2002 on the artist Franklin Booth I had no plans to be a publisher. I merely self-published a book on an artist who I was passionate about. By 2006 I had published six books and started thinking about how I could transition from my day job to being a publisher full time. After a few dedicated years of juggling a new family, a day job, and the publishing business, I was able to make the jump.\nYou started Flesk Publications in 2002. Was it a difficult and rocky start, or did things go smoothly right from the beginning?\nOh, gosh, it was hard. But I’m a pretty determined guy and I sort of get fired up when things get tougher. My close friends know how focused I can be when I want to accomplish something. I’m not one to get discouraged too easily. In fact, I tend to get a little pleasure out of adversity. I’m going to be honest though. Starting and getting a business up and running is incredibly hard. I had a full-time day job, a kid, and was doing the publishing late at night and on the weekends until I could turn it into a full-time gig. I was willing to work as hard as I had to in order to accomplish what I wanted. At the end of the day I’m trying to prove my value to myself, and it is that drive to satisfy myself that keeps me going.\nOne thing that was imperative in running this business, both when I started and even now, is to have the support and help from a good circle of close friends. There is no way this can be done alone. All along the way I have had a very clear purpose. Making books isn’t about the books or the money. It is about the path you take and the relationships you build. That is what motivates me the most.\nThe first Spectrum book came out from Underwood Books in 1994: Spectrum: The First Annual Collection of the Best in Contemporary Fantastic Art. You took over the series as editor for 2014’s Spectrum 21. Was there a calibration process of some kind, where you and Arnie and Cathy talked about what kinds of pieces to showcase? Or were your tastes fairly aligned anyway? And were you nervous about continuing this legacy?\nOh, yeah! I was very nervous in the beginning. I wasn’t worried about the job on hand. I knew I could do the book and handle the organization of everything. But, that didn’t mean that I was relaxed by any means. I put so much pressure on myself to do a good job. I am very demanding of myself. I had a lot to prove to myself. I was aware of the responsibility and wanted to make the Fenners proud.\nI knew I had a lot of eyes watching me. I’ve never enjoyed the spotlight or attention on myself, so that was the part that I liked the least. I did everything that I could to shift the attention away from myself and onto the artists.\nI remember how nervous I was the first time I went up on stage! I felt like I couldn’t breathe! I’m very comfortable now, but in the beginning, oh boy! It was Iain McCaig who gave me the encouragement to learn how to relax on stage. Thanks Iain!\nThe Fenners gave me a tremendous amount of freedom and supported me to try some new things, while I was very aware of being respectful to them and what they built. The thing that enticed me the most about Spectrum was the community. I naturally enjoy doing things for others. The position gave me a chance to help raise the awareness of the artists and the genre to a larger audience.\nThe art that appears in the different categories of the book is selected by the judges. That’s what makes it so neat. But again, the Fenners gave me the freedom to apply my own aesthetics to the book, such as the design and with the year in review section. I’m very grateful to them for bringing me on, and for the experience. I made a lot of lifelong friends through Spectrum.\nThe Spectrum books demonstrate a large range of visual arts across a variety of mediums. Are there certain subjects, styles, or mediums that speak to you more, in terms of your own personal tastes?\nI’m glad that you noticed the variety of mediums and visuals. That’s one thing that I love about Spectrum. There’s always something new and exciting to see in the annual.\nI really like good storytelling in art. I admire those who have a strong foundation to their art and understand the fundamentals of how a figure works. The style or medium is unimportant to me as long as the ability to connect with the viewer is there. If you have to write an essay to explain the meaning of the piece then it is a failure.\nYou’ve published a great number of pieces in the pages of the Spectrum books. Are there a few that stand out in your mind, even after seeing so much art? And what makes them memorable?\nToo many to list here, but yes. Wow, so much good art! The artists that appear in the most volumes of Spectrum and have the most pieces included in a single volume tend to have a unique voice. He or she does not try to mimic or imitate others. Avoiding a recent popular fad is always a good plan. The unique voices that have something to say will always have room to be seen in the most crowded of rooms. Being your own person and having the confidence to trust who you are will take you far.\nOK, OK, I’ll give you a name . . . J.A.W. Cooper! I discovered her work through Spectrum and by every count her work grabbed my attention the most. Absolutely stunning. How lucky am I to have published her books so far? Then there is Tran Nguyen. I discovered her through Spectrum as well and was fortunate to work with her. Have you seen the latest works by Annie Stegg Gerard? Wow! Tyler Jacobson, Victo Ngai, Allen Williams, I can go on forever.\nSpectrum 27 is scheduled for publication this October. Are there things that may surprise those who have read through the previous books? Are there ways in which this book differs from last year’s?\nOne of the neat things about Spectrum is the wide variety of art and types of people who are represented within. Because of this there is something that can surprise someone. I’m really proud of how we were able to add the double-page spreads that feature the Gold and Silver award recipients. The quotes and bios and photos share who these artists are as people. I hope that the connection to the artists is stronger in this way. Spectrum 27 means a lot to me and Katherine Chu. This was our last Spectrum and we wanted it to be the absolute best that we could possibly do. There’s a lot of good people and artists that made this book amazing. I hope it shows.\nWhat are the most challenging aspects of putting these books together, and what are the most rewarding?\nI look at challenges as a good thing. They can be a complete headache to deal with, yet usually when you are done it can feel very satisfying. In pretty much every case where a weird situation arose I feel like I grew in some way once it was said and done. I’m not one to believe that everything should go my way. How boring would life be if it did?\nThe absolute biggest challenge for me is time. Time to do everything that I want to do. As a business owner and someone who likes life and has an overall curious mind, I juggle a lot throughout each day. Emails, office stuff, creative stuff, working with the team, being a dad, making time for myself and friends, designing and writing books, doing photography, and everything else that I do in a day. It could sound exhausting, but I am driven by the belief that my actions can do some good for others.\nThe “About” section of the Flesk publisher page talks about “the relationships formed with the artists we showcase.” I remember talking with a notable artist at a World Fantasy a few years back, and he told me that artists are overlooked and undervalued in the science fiction community. Do you agree?\nI wrote that “About” section back in 2002 when I first started publishing. What I love about it is that I knew exactly what I wanted to accomplish then, and it has remained my absolute first focus ever since. Everything is about the relationships. The job, the books, the money—everything comes secondary to the people. If the relationships are solid then everything else happens naturally. I never went to college, nor did I ever study business, had no art experience before I published, so I figured this all out on my own. I’m grateful that I never picked up any bad habits from others, just my own, haha.\nAs for this person who you talked to, about being overlooked and undervalued, I can’t really comment on someone else’s experience and won’t say that what he or she feels is false. All I can say is that I have had a different experience. Mine has been very positive and the artists who I work with are pretty amazing people. There are so many opportunities and people willing to help in this business. I may look grumpy at times, mainly because I haven’t slept enough or am hungry, but I feel mighty darn lucky and grateful to be in this business.\nWhere do awards and other kinds of recognition land in the career of an artist—do these things inevitably boost an individual, or are there times when they have little impact beyond the moment?\nHaving had direct experience by being a part of the Spectrum awards ceremony I can tell you that there are a few people who look at the award as a doorstop or paperweight, and then those who consider it to be life changing and are humbled to win. I think to answer your question it can be both, depending on the artist. There’s no one answer for everyone.\nMy personal perspective is that when we won a Locus Award it felt incredible to be recognized. Did it boost or help us business-wise? I don’t know and I don’t even consider or think about how it could benefit me. What is incredible is that we were recognized, and we did something that stood out enough for people to highlight us. That is greater than any monetary boost as far as I’m concerned. I don’t seek attention and do not need awards to validate myself, but when they do happen, it’s always a great feeling and I find myself intimidated by the award. It generally encourages me to work harder as if I have to prove that we deserved the award.\nBut again, it is different for everyone. I’ve seen people get a lot of attention from receiving an award, and those who may go off in a different direction and you never hear from them again. What I do know is how much fun it was to help highlight people while I was with Spectrum. Those awards ceremonies were fun. I loved being backstage and seeing the emotions as the recipients would become vulnerable and overwhelmed with emotion.\nBesides talent, what does it take to make it as an illustrator? What does it take to have a successful run as an independent publisher?\nTalent is pretty worthless if you are arrogant or difficult to work with or have an inflated ego. I think grit and determination will take you farther than talent. I can only share what worked for me. I had my own vision and my own purpose and my own goals. Regardless of who you are or where you came from there is a way.\nI started with nothing. I’m a street kid who spent his teen years skateboarding and surfing and had no parental supervision. I’ve been making my own money since I was eight years old. The only money I had is what I earned myself, I had no formal education, and had to make my own way through life from a young age. My success was absolutely necessary because I could not fail. I had nowhere to fall. No soft landing was available. That’s a hell of a motivator. In my case this absolutely informs my work ethic.\nIf someone were to start a business I would focus on the plan rather than the money. Make sure you have a very good plan in place, do the work, and put in your time. There are no shortcuts to success. If you are looking to make a quick buck, you may have better luck gambling in Las Vegas.\nFlesk has produced so many beautiful art books by a variety of talented and hardworking artists: J.A.W. Cooper, Brom, Jeffrey Alan Love, more recently Frank Cho. When is an artist ready to have a Flesk book showcasing their work?\nHmm, boy, let me think about this for a second. That’s a good question. I’d say it has less to do with when they are ready and more to do when I am ready. I can think of a hundred artists that I would love to publish right now. But, I’m stretched so thin and can only do so much. We’re a small team and are very limited in how much work we can take on. We can add one new artist to our list next year. I’m currently working with the crew here at the office to narrow down a big list of possible artists to approach. It’s a tough choice. I truly wish I could take on more artists.\nAs someone who is in constant observation of and conversation with the field, do you feel like there have been noticeable changes in the aesthetics, themes, or designs of SFF art in the past ten or twenty years?\nSure, yes so much! And for the better!\nThe most amazing and best thing to ever happen to this industry is the inclusion of women and greater diversity within the field over the last ten to twenty years. I’ve been going to shows long enough that it really wasn’t that long ago that the comic shows were all guys. The industry was very closed off to women for, well, forever. What changed everything was technology and social media providing more opportunities for people who were typically marginalized to have a shot.\nThe Marvel movies and cosplay and popularity of events and many other factors also played a role. And with that we are seeing this wonderful transformation of the field that includes far more voices in art than was ever seen before. There has never been a time like this in the art world before. I am amazed and excited about what I see that is going on, and love seeing this industry expand. Just go to a show now like the new LightBox Expo or even Spectrum Fantastic Art Live pavilion, and you will see so much variety in art.\nThe cool thing is that all of these different voices have a chance to be seen and heard like never before. Imagine where we will be in the next ten or twenty years! So, the very act of this monumental shift will continue to absolutely shift the aesthetics of art. I’m not sure if there ever was a better time to be involved in the industry?! Can you tell I’m excited?\nYou have published many high-quality art books besides the Spectrum series over many years. Are there a few books that you are especially proud of?\nIt is always so hard for me to answer this question. I never look at the books that I have published in the past. I’m too focused on the future. I can’t necessarily pick out one book, but what I am most proud of is the opportunity to share the works of these artists with others.\nI know I may be sounding like a broken record here, but I like sharing, while valuing the relationships that I have with people, and the chance to help people out when I can. Making books is not my first priority. I really enjoy books, but my motivation stems from being able to do for others and help others. That’s all there is to it. If what you do does not help others, then why do it?\nI see the books that I have published as the relationships and sense of family that we have. The books are the by-product of this.\nAs you pass the Spectrum series back into the hands of Arnie and Cathy, what’s next for John Fleskes? What projects or plans do you have coming up that you’re excited about?\nOh boy! Lots of stuff! I want to share, really I do. I have a five-year plan and a ten-year plan that will take every bit of my energy and time to pull off. In a way I am challenging myself like never before. I’m actually a bit intimidated by what I have planned and am unsure of how I can do it, but I know I can and that I will. For the immediate future you will continue to see more nice books coming out. I have no plans to be involved in any sort of events or ceremonies or art competitions for the foreseeable future. I want to pour all my time into books and to build the foundation for what I have planned next. I’d love to share it with you, but it is a bit too early. It excites me, and will allow us to help more people, that’s all I can share for now.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}