{"fingerprint": "4sD6gWiRcHZgdANWOTtS/aWQ+9w=", "sitename": "Clarkesworld Magazine", "title": "In Panic Town, on the Backward Moon by Michael F. Flynn", "author": "Michael F Flynn", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/flynn_05_18_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In Panic Town, on the Backward Moon by Michael F. Flynn", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7350 words, short story, REPRINT\nIn Panic Town, on the Backward Moon\nThe man who slipped into the Second Dog that day was thin and pinch-faced and crossed the room with a half-scared, furtive look. Willy cut off in the middle of a sentence and said, “I wonder what that Gof wants?” The rest of us at the table turned to watch. An Authority cop at the next table, busy not noticing how strong the near-beer was, slipped his hand into his pocket, and VJ loosened the knife in his ankle scabbard. Robbery was rare in Panic Town—making the getaway a major hurdle—but it was not unknown.\nHot Dog sucked the nipple of his beer bottle. “He has something.”\n“Something he values,” suggested Willy.\nVJ chuckled. “That a man values something is no assurance that the thing is valuable. It might be a picture of his sainted grandmother.” But he didn’t think so, and neither did anyone else in the Dog.\nAll this happened a long time ago. Mars was the happening place back then. Magnetic sails had brought transit times down to one month, and costs had dropped with them, so the place was filling up with dreamers and scamps and dogs of all kinds, out to siphon a buck from the desert or from the pockets of those who did. There were zeppelin pilots and water miners, air-squeezers and terraformers. Half the industry supported the parasol-makers of course, but they needed construction, maintenance, teamsters, and rocket-jocks, and throughout history whenever there was a man and a dollar there was another man willing to separate them.\nWe were friends, the four of us hooching that day; but the kind of friends who rarely saw one another except across a bottle. Hot Dog’s name was Rusty Johnson, but he eschewed that for a gonzo nickname. He flew ballistics for Iron Planet, taking passengers and cargo up to the Dogs or around to the antipodes. He had the glam, and women lined up and took numbers, even though he wasn’t much to look at and even less to listen to. Maybe it was the cute freckles.\nVJ’s name was Viktor Djeh and it was fairly easy to figure how he’d gotten his nickname. He did maintenance on PP&L’s converter out by Reldresel, where they pulled oxygen and other useful crap from the ilmenite. His job was not nearly as glamorous as Hot Dog’s, but he made it up in morphy-star good looks. He was a joker, and always ready with a favor. He had saved my ass once when I was on a job in Reldresel and the high-pressure line sprang a leak, so I always paid his freight when we crossed paths at the Dog.\nWilly’s name, to complete the trifecta, was actually Johann Sebastian Früh, but a childhood friend had given him the moniker from an old movie and it stuck. Willy clerked for the Authority, so he had neither good looks nor glamour, but he got by on a willingness to listen. His earnest expression invited confidences, a circumstance that provided him with a steady, if clandestine income.\nPinch-face crossed to the bar, where Pondo was serving. Dogs move in microgravity like they’re underwater—in slow, gliding steps and grip shoes. I once saw Jen Wuli chase Squint-Eye Terry M’Govern down the Shklovsky-Lagado tubeway and it was the funniest damn thing I ever did see.\nPondo and the stranger traded whispers, then sidled into the office. Everyone relaxed, and the Authority cop took his hand out of his pocket. A few minutes later, they reemerged from the office with smiles all over their teeth.\n“Who was that muffer?” someone at another table asked when the stranger was gone.\n“I seen him around, down below. Works outta Port Rosario.”\nWilly smiled when he overheard this, and VJ gave a thoughtful nod. Hot Dog pulled his handi from his coverall pocket and checked his schedule. “I’m dropping down to chair a Guild meeting in a couple days,” he told us. “Pig Hanson has a run out to Marineris and I have to sub. I’ll ask around.”\nThat’s how it started, though at the time we didn’t know it.\nThe next day I called Aurora Sails in Under-Gulliver, where they ran an assembly hanger. The superconductor loop sets up a magnetic field that acts as a sail and takes up momentum from the solar wind. It doesn’t harvest much acceleration, but the velocity keeps building, and you don’t have to carry fuel. By adjusting the loops you can change the size and shape of the field and sail damn near anywhere at respectable speeds. When you kick amps into a superloop, the current keeps going like a bunny with a drum until you quench it.\nThe problem the client had at the time was that some of their sails wouldn’t kick amps. They thought there might be something wrong with the kicker, but they didn’t know how to prove it. So the Authority tasked me to settle matters because the bickering under Gulliver was growing intense and nothing soothes internal squabbles like an external consultant.\nTechnically, I work for the Ares Consortium, an alliance of corporations formed to run the Martian parasol business. Aurora strings the parasols and Pegasus ferries them to the target asteroid, where Sisyphus rigs the harnesses in place. My ultimate boss was actually old man Bryce van Huyten, but Phobos Port Authority coordinates the local action, so I carry an Authority troubleshooter’s badge.\nI told Aurora to set up two loops in the test beds: one that worked and one that didn’t. They balked because any loop that worked was immediately installed on a parasol and packaged for transit, while the defective ones were salvaged for parts. Parasols were urgent, high-priority work, and they couldn’t let loops sit around for me to play with, and blah-blah-blah. The usual. So I told them to call me back when they were ready to get serious and I cut the link.\nIt took them two days while they pondered what the Authority would say if they blew me off. Then I got a call from Antonelli, the sail prep boss. He had two loops set aside, he told me, “but hustle your ass out here because Logistics is giving me the stink-eye.”\nAntonelli and his engineers managed to conceal their delight when my ass arrived. They floated at a respectable distance. Everybody wanted to be close enough to the problem to count coup in case I succeeded, but not so close that they’d get cooties if I failed.\nI forgot their names as soon as they were introduced, except for one fellow from Logistics named Moynihan Truth, both because of his unusual name and because I saw him again later. He was ten years old, but that’s in dog years; double it for Earth-equivalent. He’d been born in Golden Flats on Mars, where they have the monument to the first Rover. You’ve probably seen images of Farzi Baroomand’s famous statue, the one that shows all the aliens lined up behind the Rover where the camera can’t see them, laughing themselves silly. Everyone there takes the last name Truth to honor the Rover. The Kid was the only one in the locker smiling and I remember wondering what the big joke was.\nFour test beds took up most of the horizontal space. Hobartium loops were tethered to beds A and B. I pointed to A and said, “This one’s not working?” Nods all around. The neon-yellow Hold tag was my clue. “And that one works?” More bobbleheads. It was green-tagged. “And you think it might be the kicker?” Grudging assents, but dissenters mentioned other components, assembly errors, you-name-it. Paralysis of analysis. Smart people with a dozen smart ideas, but not smart enough to try any for fear of being wrong.\nBut the first rule of troubleshooting is: Start Somewhere. When you don’t know crap, whatever you learn moves you ahead. “Take this kicker,” I pointed, “and install it on that loop; and take that kicker and install it on this loop.”\nWhen the switcheroo was finished I told them to kick amps, and the superconductor on A began to circularize from the hoop stress, while the one on B now remained flaccid. I nodded.\n“Yep. It’s the kicker, all right.”\nAntonelli swelled up. “For that, we pay Port Authority two ounces troy per diem? We could have done that ourselves!”\n“No you couldn’t,” I reminded him. “You couldn’t even get the two hoops set up without my prodding.”\n“Big deal,” said one of the engineers. “We already thought it was the kicker.” No matter what the solution turns out to be, there will always be someone to say I told you so.\n“Sure,” I said. “But now you know. Now take the top assembly off this kicker and switch it with the top assembly on the other. If nothing changes, the problem’s in the bottom half. If A fails but B works, the problem’s in the top half.”\nAntonelli sucked lemons. “What if they both start working?”\n“Then it gets interesting.”\nThe secret of my success doesn’t come from knowing all the answers, but in knowing how to ask the questions. Disassembly-and-reassembly successively narrows the search zone for the cause. Three iterations homed in on the damper circuit subassembly. After that, it was a matter of screening the other kickers in stock and finding the ones with defective dampers. Antonelli wrote a Stern Letter to the Earthside parts manufacturer, which let him wrap things up on a suitably righteous note of indignation. Nothing makes a man happier than the prospect of blaming someone else.\nWhen I returned to my rooms toward shift-end, I found a message from Pondo asking me to stop by the Second Dog as soon as I could. I finished repacking my go-bag for my next assignment, then took the towline up Dilman’s Bore, where I found Pondo waiting just inside the Dog.\nSmall as Phobos was, you’d think an illicit bar would be a tough thing to hide. Scientists back in the day had known that Phobos was partly hollow and that puzzled them some. They also realized that the moonlet resembled a Main Belt asteroid, but they couldn’t figure how Mars could capture an asteroid, circularize its eccentric orbit, and rope it onto the Martian equatorial plane—not until they discovered that the Visitors had been tricking it out back in the day. About a third of the interior had been gutted by the Visitors, and the rooms, warrens, and passageways they dug totaled two-thousand cubic kilometers usable volume. But volumes can be made operationally larger when people look the other way, and the pocket under Kepler’s Ridge had somehow escaped notice when volume was platted out.\nKoso Bassendi, the owner, was a hard man to cross and was big enough to make it harder still if you did manage it. I never heard of anyone crossing him twice. Come retirement, he and brother Pondo took their bonus money and started the Second Dog. They served beer stronger than the wretched double-deuce that the Prague Convention allowed, but they served an honest measure. You can’t ask more than that of any man.\n“Mickey,” Pondo said, “I understand yer going Mars-side tomorrow.”\nI didn’t ask him how he knew. My schedule was not exactly classified, and the Authority likes to rotate its employees into gravity wells to keep up their muscle tone and bone calcium.\n“Maybe you’ll have time to do my brother and me a little favor.”\nDoing favors for the Bassendis was risky. So was refusing. I figured they wanted me to smuggle up some potables in my Authority packet, so I said, “Sure.” Technically, Phobos is “outer space” and Mars “planetary surface,” so the Prague Convention covers one, but not the other. Go figure.\nPondo guided me into the office, where Koso bobbed with his arms crossed and his scowl directed toward the thick, open door of an Eismann and Hertzog safe.\n“Somebody got into our vault,” Pondo explained, in case I couldn’t figure it out. Koso said nothing, but his face tightened like a hangman’s knot.\n“You call the cops?”\nBoth brothers looked at me and I let it go. “So, what’d you lose? Money, securities?”\nThey shook their heads. “Not even the Bassendi Brothers Benevolent Fund was touched,” said Koso.\nI didn’t ask who the Fund was intended to benefit.\nPondo said, “Remember that fellow, Jaroslav Bytchkov, what give us something to keep for him the other day? Well, it’s gone.”\nWhich meant that whatever that packet contained, it was worth a great deal more than what was left untouched. At least now I knew Pinch-Face’s name.\n“And what was it?”\n“How would we know?” Pondo said. “My brother and me sell trust. Who would trust us with their keepsakes if we stuck our noses into them?”\nThe brothers might be shady, but they had a code. “What you want me to do?” I said, though I could already guess.\n“Yer a troubleshooter,” said Pondo. “Find what caused our trouble.”\nKoso spoke. “We take care of the other part.”\nThe brothers figured the taker had been in the bar the night Bytchkov had brought his precious. Who else would have known it was there? I reminded them that I had been there and Koso smiled. “The vault software was tickled during the day, when all decent men are sleeping. You was out to Gulliver the whole time.”\nSo I had an alibi, which was comforting; but the Bassendis wanted me to work for them, which was not so comforting. We went over the surveillance videos and identified everyone present, weeded out those too honest or too inept, and they asked me to investigate the ones who had dropped Mars-side.\nThat included Hot Dog, of course, who had that guild meeting to run. And Willy’s job, like mine, required periodic commutes. But VJ had also dropped, taking some personal days to “bone up” at a calcium spa. Among the handful of Martians in the bar, a petite ice-miner—Gloria “Iceman,” from Rosario—had already gone home.\n“And we’d appreciate it, Mickey, if ye’d look up our depositor and find out what he given us.”\nKoso said, “And it shows up for sale, we might trace the taker.”\n“But we’d rather you not tell him it’s been stolen.”\n“Bad for business.”\nI had a private notion that Bytchkov already knew it was stolen. He just didn’t know it had been stolen from him.\nPort Rosario sits in Arabia, a densely cratered, heavily eroded upland in the Northern Territories. Despite its name, it sits over some of the richest ice-bearing strata on Mars. Old water-canyons wind through the terrain and onto the lowlands, an ancient ocean bed. The dome is set in a deep crater and protected by hobartium loops that deflect incoming cosmic radiation. Mars is a hardscrabble world and attracts hardscrabble folk. No one would go there, weren’t for the archeology and the asteroid-capture program.\nEverybody needs a hobby, and the Visitors’ hobby had been throwing rocks at Earth. They had booby-trapped a mess of Main Belt asteroids to drop earthward if we ever got too nosy. If it was some kind of sociopathic IQ test, like some folks thought, we had passed. We had bridled scores of ’stroids with magnetic sails and tacked them into GEO for mining and smelting. And if you’re going to bridle asteroids, Mars is the go-to place. You need less delta-vee going up and down from Mars than hopping rock to rock. That’s why the Visitors come to Mars back when Man was squatting in the forest primeval; and that’s why we’re there now.\nPort Rosario always looked down-at-the-heels. There was dust everywhere. I don’t care how good the precipitators are. They say you can never see Venus because clouds hide the surface. The same is true of Mars, except everything is covered with dust. You need a broom to see the true surface. The Martian wind is not very fierce—the air’s too thin—but it’s persistent. A dust storm can develop in hours, cover the planet in days, and last for weeks. Some of it gets inside the domes in spite of all, and gives everything a rough, gritty look.\nRosarians were also rough and gritty, miners and teamsters being far from genteel, so it was well to walk careful. I tried to look dangerous whenever I strolled around town and carried enough mass to make it convincing and a set of brass knuckles in case it wasn’t.\nThe town is laid out on a simple spoke-and-wheel street-plan. I arrived toward local sunset and took a room in Coughlin House in the northern quadrant with a nice view of the lowlands. Nothing but the best for the Authority. I tossed my gear in the room and headed for Centre Square, which was located exactly where you’d expect.\nLocal custom says everyone goes there first and shakes hands with the statue of Jacinta Rosario. She’s portrayed without a helmet, which is historically inaccurate but artistically necessary. The statue is surrounded by grass and wildflowers and the only open trickle-fountain on Mars. Periodically, someone worries about “wasting water,” but since Rosario is a closed system, the water doesn’t really get wasted, and the size of the “Fossil Aquifer” underneath the town is good for a great long time. It’s not like Martians are profligate, but like they’ll tell you: “Anything for Jacinta.”\nPilot House is out the end of Mercado Radial by the ATC tower. That’s where zeppelin pilots check in. I stuck my head in the Chief Pilot’s office and asked if Jaroslav Bytchkov was in town and he checked the logs and told me to try Dominick’s Tavern at Mercado and Fourth. That was the heart of the Groin, where the merchant association had chipped in to hire a marshal to patrol the streets and break up fights. The neighborhood was called the Groin because it was a bad place to get your kicks.\nDominick’s proved a three-story duroplast building facing inward from the Dome. Apartments were on the second and third floors. No fine views for them. I found a café across the street—One-Ball Murphy’s—with a view of the entrance and waited for Bytchkov to show. I ordered a drink of “whiskey,” though it wouldn’t pass muster in Scotland or Kentucky. I think One-Ball boiled it out back in an old radiator.\nI noticed Gloria Iceman at another table, also watching Dominick’s. That was interesting, so I clicked a pix with my handi and made a note. Ice miners generally hung out in the south quadrant, around the mine elevators, not here near the aerodrome. I don’t think she recognized me, but the next time I looked, she was gone and I hadn’t seen her leave.\nIt was 2100 when I saw Bytchkov exit Dominick’s right under the streetlamp. It must have been Old Home Week, because he was in animated conversation with Moynihan Truth. The young man had not been in the Dog the night Bytchkov squirreled his precious, but here he was chatting him up like an aged uncle with a legacy. I took a few more pix—and became suddenly aware that the other two seats at my table had acquired occupants.\nOn my right sat a pale, hard-faced woman with the indefinable glam of a rocket jock. She smiled at me, but it wasn’t a friendly smile and she didn’t say anything. On my left, a dusky man with obsidian eyes held a quarterstaff in his right hand. I nodded to him.\n“Morning, marshal,” I said.\nIt was Tiki Ferrer. “Morning, Mickey. What’s a respectable Phobic like you doing in the Groin at night?”\n“Just getting my land legs back,” I told him. “Came down from the Dogs at sunset.”\n“And snapping pix like a muffing tourist,” he marveled. “Fourth and Merc’ isn’t a noted tourist spot. Why the interest?”\nI’m pretty good at arithmetic, and added one and one. “Which are you watching, Bytchkov or Truth?”\n“What is Truth?” he asked me. “That the young guy? Tell me about him.”\nThat meant Bytchkov was the marshal’s target and he was taking an interest in anyone who took an interest. That included Moynihan. It also included me. It was no skin off my nose, so I told him what I knew about the Truther.\nTiki introduced the woman as Genie Satterwaithe, a courier on the Red Ball laying over on Mars while her loop was refurbished and stocked up for the Green Ball to Earth. She had earlier flown ballistics and orbitals around the homeworld, which accounted for her implicit swagger even sitting down.\n“I’m trying to talk her into signing on with Iron Planet,” Tiki told me.\n“What’s your interest in Bytchkov?” I asked him. When the marshal demurred I flashed my badge. I wasn’t on Authority business, but Tiki didn’t have to know that.\n“That’s a Port Authority badge, Mickey. It doesn’t push much mass down here.”\n“Look, marshal, this ain’t for broadcast, but Bytchkov deposited something for safekeeping up in Panic Town and it’s been stolen. I’m trying to find out what it was without tipping him off.” That was the truth, if not the whole truth.\nBytchkov turned and reentered his rooming house. Moynihan made an obscene gesture to his back. Tiki sighed. “One more name for the list of people less than pleased with Jaroslav Bytchkov. Why doesn’t that list ever get shorter?”\nSatterwaithe said, “It’s a gift he has.”\nTiki showed me a holo of a tall, lean woman. “This is Despina Edathanal,” he said. “Recognize her?”\nI shook my head. She had the lanky physique of the spaceborn. She hadn’t been in the Dog. “She’s a tall drink of water,” I said. “I’d’ve noticed her.”\n“She’s digmaster out at Cassini,” Tiki said. “She filed a complaint against Bytchkov, claiming that he’s filched Visitor artifacts.”\nMuch was thereby explained. The Visitors were a long time gone, but they had left some trash behind. A Visitor artifact could fetch enough troy ounces Earth-side to make snatching the Bassendi Brothers Benevolent Fund look like chump change and not worth the risk. The trick would be getting the artifact from Mars to Earth, and I began to see how that might have been arranged.\n“A couple days ago,” Tiki continued, “Edathanal braced him right here in Murphy’s and told him if he didn’t return the goods she would tear off his left arm and beat him to death with it.”\n“His left arm?”\n“Yeah, she was being nice. Bytchkov’s right-handed. Anyhow, Bytchkov lifted for Phobos the next day. Want to tell me who he left the packet with?”\nI shook my head. “Wouldn’t be a health-conscious choice.”\nTiki grunted. “So. Tell Koso hello when you see him.”\n“I’m starting to think Pondo has the brains in the family.”\n“Someone has to. Jaroslav’s had some in-your-face time with a half dozen people these past two days. Words were exchanged, as they say, and fists a couple times. Now he’ll only meet with one person at a time and only at a time and place of his choosing.” Tiki laid out a series of holos on the table, each the size and shape of a standard playing card. “Tell me if you know any of these people.”\nOne was the archeologist from the dig; another, the ice miner I had seen in the Dog. There were three guys I’d never laid eyes on; but the other three were Hot Dog, VJ, and Willy. I told him who they were.\n“Bytchkov had fights with all eight of these?” I said.\n“Let’s say spirited discussions. I guess I should add that fellow Moynihan. I have a feeling he’s the one smuggling the stolen artifacts off Phobos.”\n“The yellow-tagged loops,” I said, and explained about the defective kickers. “Moynihan’s in Logistics. He could’ve rigged those defects in the first place, then instead of salvaging the parts, hung the loops out with the contraband. Since the parts are already accounted for, they won’t be noticed until Corporate runs a material balance.”\nSatterwaithe spoke up. “Makes sense. You can program those parasols to hold station in the solar wind and a courier like me can snag it on the fly.”\nTiki smiled. “Maybe I should add you to the suspects.”\n“That’s why Moynihan was grinning,” I said. “He wasn’t amused; he was nervous.”\nThe marshal nodded. “And you accidentally cut off their channel. Phobos-Mars radio is too public, so he came down to tell Jaroslav on the QT, probably phoned from the terminal as soon as he hit dirt. That was . . . ” Tiki did a quick search over his handi and said, “He grounded Mars-side at 1830 in Roustabout. Easy enough to call from there.” He closed the dust cover on his device. “Half an hour later Jaroslav made a call to a tosser cell. He told whoever answered that he had ‘a big one’ if the price was right and set up a meet at Dominick’s for 2200. I bet he’s trying to unload his latest acquisition. Genie and I were waiting to see who shows up, catch them passing the contraband.”\n“Which now he doesn’t have.”\nTiki checked his watch. “Almost time, but I haven’t seen anyone enter the boarding house.”\n“You have someone watching the back?” I asked, and he gave me a teach-your-grandmother look.\n“I got posse-men watching everyone on my list. These three . . . ” He pointed to the ones I didn’t know. “ . . . they got rounded up an hour ago when the Minetown marshal busted a gambling den over the other side of town.”\nI glanced at the roster of miscreants. In Phobos, no one cared if you gambled away your life savings, but Martians were different. They don’t approve of people who take foolish chances. Fast Paddy Murchison, Kenny ben Hauser, Johnny Free, Piglet Lieskovsky, Lucy Diamonds, Flo Miraziz, Rahim Hadfi, Manoj Patel, Big-O Saukkonen, and my old pal Squint-Eye Terry M’Govern. Fast Paddy, Big-O, and Lucy Diamonds had gotten into public altercations with Jaroslav within the past few days.\nI handed him back the list. “Where were the others?”\n“I should tell you because . . . ?”\nI shrugged. “Because one of them may have guessed what Bytchkov took to Phobos and arranged to steal it. I’m looking into the Phobos theft for my, ah, patron.”\nTiki conceded the point. He thumbed up his reports on his handi. “Posse touched base around 1930. Dr. Edathanal, they lost track of.” He scowled at me. “They’re volunteers, not professionals. . . . Let’s see. Hot Dog was at a meeting. Gloria was here at Murphy’s. Your buddy VJ was at Susie Xiao’s Social Club getting himself greased. And your other buddy Willy was ‘networking.’” He shook his head over the foibles of humanity. “Any of them could have received the call.”\nI didn’t correct him. “And Moynihan Truth would have been in inbound processing. He could’ve got the call, too.”\n“But as of right now . . . ” Tiki made a sound of disgust. “ . . . we don’t know where any of them are.”\n“Because . . . ?”\n“Dinnertime for most of my posse. I told you, they’re not pros.”\n“Hell, Tiki, I don’t even have a posse.”\n“Yeah? You’re a troubleshooter, not a lawman.”\nSatterwaithe spoke up and said, “It’s time. Shouldn’t we close in?”\nI wanted to say, You’re a courier, not a lawman, but I sensed Tiki had his reasons for keeping her around.\n“No one’s gone in yet,” said Tiki, but he opened his link. “Bill? We’re going to close in.” He listened, then said sweetly, “Well, I sure hope it was bone,” and broke the link. He looked at Genie. “Martha called him home, told him supper was getting cold.”\nI waited a beat and said, “So, the entire Rosario Marching Band could have gone in the back way and you wouldn’t have seen them.”\nTiki glowered.\n“On the positive side,” I added cheerfully, “we probably would have heard them.”\n“I swear, Mickey, I’m gonna hit up the Association for a deputy. I can’t get by with part-time amateurs. You want the job? You meet a better class of people than you do in industrial troubleshooting.”\nI told him I was happy where I was, but he gave me a posse badge anyway, “for the interim,” and took me with him when we exited Murphy’s. He told me to cover the back in case Jaroslav bolted. “You heavy?”\n“I could stand to lose a few pounds.”\n“I mean are you armed?” He twirled his quarterstaff. Firearms are illegal in Port Rosario. The Dome was supposed to be bulletproof, but not even the criminals want to field test the theory. I showed him the knuckles and that seemed to satisfy him. Satterwaithe carried a baton.\nJust then we saw someone scrambling from behind Dominick’s. The streetlamp there was out and the figure was indistinct in the pale glow of its more distant cousins. The building on Fifth, right behind Dominick’s, had overhanging balconies and the figure ran under the balcony and vanished in the shadows.\n“Don’t like that,” said Tiki and we hurried across the street. I circled behind the building as planned and Satterwaithe sprinted up Mercado to try to catch the runner on the next block. Tiki went in the front.\nJust as well, for I had a bad feeling about this.\nDrifting sand had accumulated around the base of the tavern and just below one of the windows there was a very nice footprint. Someone had jumped from the second or third floor. This is an easier feat on Mars than on Earth. I knelt and inspected it, measuring its depth. I looked up and saw Tiki leaning out the second floor window. That gave me the height of the jump.\n“Bytchkov’s dead,” I guessed.\n“Deader’n Dizzy’s mouse,” Tiki said.\n“Knifed?”\nHe scowled. “How’d you know?”\n“It’s fast and to the point. I may know who did it.” I entered the figures into my handi and the results told me that the jumper had likely weighed over 70 kilos earthweight. I crossed the rear lot to the building on the next street and measured the height of the balcony. One-seventy centimeters. I closed the tape measure and put it in my pouch. Then I made a few notations on my handi.\nI felt immeasurably sad.\nTiki had sealed Bytchkov’s apartment and made his way down to where I stood. He studied the rear of the tavern. “Not an impossible jump,” he agreed.\nSatterwaithe came loping back from Fifth Circle, cutting between the two apartment blocks and ducking under the balcony. “He ran off the other way, toward Sulbertson. I found a witness, though.” She touched her handi. “The runner had a white overshirt and tan overpants. Unless the shirt was yellow and the pants brown.” She grimaced. “He’s not sure. Looked about mid-thirties. Maybe one-seventy height.”\nTiki annotated his handi, snapped the sand-shield closed, and reinserted the stylus in its sheath. “I guess we should round up the usual suspects. My money’s on Edathanal. Bytchkov was going to sell the artifact back to her because he couldn’t hang it out for pickup. When he couldn’t produce it, Edathanal lost her temper and . . . You’re shaking your head, Mickey?”\n“It wasn’t her.”\n“How do you know? She was the only one we don’t know where she was at 1900 when Bytchkov made the appointment with his killer.”\nI sighed. “When you’ve eliminated the impossible you won’t always like what’s left.”\nTiki put a hold on the morning lift, and brought Despina and Gloria to join the others in the departure lounge. Hot Dog had been doing the preflight checklist and Tiki assured him that Iron Planet had bumped back the official lift time. “This won’t take long,” he said. “It’s not like Phobos doesn’t make two passes every day.” Indeed, it swept the Martian sky faster than Mars himself rotated, and so rose in the west and set in the east.\nTiki placed me by the entry from the main terminal while Satterwaithe stood by the tubeway out to the shuttle. I’m not sure where Tiki thought the killer would try to run, but it’s in the nature of the guilty to flee even if no man pursueth. In moments like that a man might not think clearly. Willy gave me a quizzical glance because he had caught the posse badge on my coveralls and the knuckle-bar on my right fist. He dealt in information, and the amount of information is proportional to its surprise.\n“I think it is fair to say,” Tiki began, “that all of you knew that Jaroslav Bytchkov had stolen something valuable and you all wanted to get your hands on it.”\nDespina Edathanal protested. “It belongs to the Visitor Project!”\nTiki nodded and said, “Why don’t you describe the artifact that Bytchkov filched.”\nFive pairs of eyes turned toward her. I knew damn well one of the group already knew, but I saw no overt sign. Well, Tiki had his purpose and I had mine.\n“It was a truncated pyramid of sandstone,” Edathanal said, “about the size of my two hands. In the right lighting, you can see the hints of a face. Three eyes, arranged as a triangle; a suggestion of structure scoured by untold centuries of gentle Martian sandblasting. It’s the only artifact we’ve ever found that hints at what the Visitors looked like. The weird thing is, the face doesn’t seem to stay put. It’s on one side, then it’s on another. So we think there’s also some very subtle micro- or nano-tech going on with the stone.”\nI spoke up. “You’ll provide a detailed sketch? I’ll make sure Goods Outbound gets a copy up on the Dogs. Aurora and Pegasus, too.” This was within my purview as an agent of the Port Authority. I wanted the thief to know that moving the contraband off-Mars would not be easy. Moynihan Truth shifted in his seat, probably wondering how much we knew.\nTiki turned to me. “Mickey, you want to tell them the next bit?”\nEveryone scrooched around in his seat, except Hot Dog, who was leaning against the wall by the departure tube with his arms crossed, and Gloria Iceman, who sat to the side where she could see everyone.\n“Jaroslav had one very hot potato and bounced to Phobos before the word could get out to deposit the statue for safekeeping until his partner could smuggle it out. Unfortunately, that channel was cut off a couple days later.” Moynihan’s smile had grown so broad I thought it might split his face in two.\nTiki took up the narrative once more. “Each of you either wanted to lay hands on the contraband or at least find out what it was. And each of you had a very public argument with Bytchkov. In some cases, knockdown fights.”\nVJ laughed. “That wasn’t no fight. We played catch. He threw a punch; I caught it; threw it back.” Willy and Hot Dog laughed with him.\nMoynihan said, “He’s not the easiest guy to get along with.”\nVJ said, “He was a prick.”\nTiki cautioned them, “Don’t speak ill of the dead.”\nThat got their attention. I had been waiting for the line and had been watching their faces. Tiki’s announcement should be a surprise to all but one. I caught the tell where I was expecting it and a glance at Tiki and Satterwaithe showed that they had caught it, too.\n“At first, Dr. Edathanal seemed a good suspect,” Tiki said. “She had the best motive. The statuette had been stolen from her. She had a fight with Bytchkov in which he slapped her across the face, a public humiliation. And no one knew where she was at the crucial times. But the killer was seen running under the balcony of the neighboring building. Genie over there had to duck when she chased after. The good doctor is too tall. She would have scalped herself.”\n“And the rest of us?” demanded Hot Dog, so red in the face that his freckles had disappeared.\n“I also wondered about Gloria, here,” Tiki continued. “She was seen in One-Ball Murphy’s keeping a sharp eye on the rooming house, but disappeared just before. But the killer jumped from the second floor window, and she’s too light to have made the resulting footprint.”\nMoynihan Truth perked up. “Me, too?”\nTiki shook his head. “No, you weigh enough. Your motive . . . Thieves falling out, perhaps—oh, yes, we know about your end of the smuggling operation. You came down to tell Bytchkov that your game with the parasols was busted. But the witness on the next block saw the killer from a distance, and you would never be mistaken for the age he figured.”\nVJ wiped his brow dramatically. “People always say my good looks make me seem young.”\n“You wish,” said Hot Dog. But an unease had fallen over him because he had noticed that only three suspects were left. He noticed Tiki watching him and protested, “I got an alibi for the whole day. I was at the Guild meeting!”\n“The Guild meeting broke up at 2100,” said Eugenie Satterwaithe. “I talked to some Guild comrades. That would have left plenty of time to get over to the Groin.”\n“But Bytchkov made a call at 1900,” I explained, “and made an appointment to see the man who killed him. You were still in the meeting.”\n“So what?” asked VJ. “I seen lots of people on their handis in meetings.”\n“’Cept I was running the muffing meeting,” Hot Dog said with evident relief. “I was sitting up on the muffing dais right in front of God and twenty-three muffing comrades, banging a muffing gavel. You can ask them!”\n“I did,” said Satterwaithe. “You didn’t receive the call.”\nDuring this exchange, Willy had grown more and more pale, and he had begun to ease away from the others. VJ noticed this and whispered, “Better make a break for it.” Tiki and I both heard it, and so did Hot Dog.\n“Willy?” he said. “I don’t believe it!”\n“You don’t have to,” I said. “Willy has the best alibi of all. He was in custody in Minetown when Bytchkov was killed, same as three other suspects. If you’d told the arresting officer your name was Willy, it would’ve been obvious. But your legal name is Johann Früh, and it got recorded as Johnny Free on the booking sheet.”\nThe arithmetic was simple enough now that everyone could see the remainder. VJ gave me a pained look and said, “Geez, Mickey. This is freeping Mars! You know what they do to you here?” Then he bolted for the exit where I stood, hoping I wouldn’t have the heart to deck him. And I remembered how he had shoved me out of the way of that leaking pipe.\nTiki Ferrer’s hands barely twitched and his quarterstaff tangled VJ’s legs and he sprawled out. Satterwaithe was by his side with her baton ready, but there was no fight in him.\n“Victor E. Djeh,” Tiki told him formally, “you are detained on the authority of the City of Port Rosario and the Groin Merchants’ Association.”\n“You don’t like to hear it,” I told Tiki afterward, when Satterwaithe had marched VJ off to the cells. “You think you know people; but you never do, and sometimes you find out just how much you don’t know them.” I shook my head. “I hope it was just a fight that got out of hand. I hate to think VJ went in there planning to knife the guy.”\nVJ was never the sharpest tool in the box. He’d been smart enough to wash his knife, but not smart enough to throw it away. It later proved to have Jaroslav’s blood in the space between the blade and the handle. Just goes to show the importance of cleanup.\nTiki turned to me. “But he had nothing to do with stealing the artifact?”\n“No, and I’ll make sure Pondo understands that. I owe VJ that much at least. At least he never crossed the Bassendis.”\nThe next day, I tracked Gloria Iceman to a Minetown bar. She was hooching with friends, but when she saw me she separated herself and came to sit in my booth.\n“Iceman isn’t your actual name,” I told her without preamble. “It’s Eismann, and someone transcribed it incorrectly when you applied for a Martian visa.”\nThe miner smiled at me. “I liked the sound of it. It’s a good nickname for an ice miner.”\n“It is that,” I agreed. “But I think if I dig a little bit, I’ll find out that you belong to the Eismann family that makes the vaults. Eismann and Hertzog. It’s enough to make me wonder if someone at the company built a trapdoor into their products’ software.”\nGloria Iceman gave me a wide-eyed look. “That sounds awfully precocious.”\n“I even wonder who convinced Bytchkov to leave his precious with the Bassendis in the first place.”\n“Well, he had to hide it until the heat died down. The statue wasn’t just another link or valve or other bit of trash from a technological midden heap. It was important. Best to hide it somewhere secure.”\n“But Edathanal knew who had taken it, and a dozen dogs knew he had brought something to the Second Dog. The Bassendis are shady, but they would not have defied a Port Authority warrant.”\nGloria nodded. “It’s harder to find something if no one knows where it actually is—or who actually took it.”\n“You don’t want the Bassendis mad at you.”\n“At me? Why would they be mad at me? Where’s the evidence I took it, beside a similarity of names?”\n“The Bassendis aren’t anal about evidence.”\n“You wouldn’t put a flea in their ear on such flimsy suppositions.”\n“You’ll never get the statue off Phobos. Every cubic of luggage will be scanned at the most minute levels.”\nGloria frowned and pursed her lips. “I think that whoever has the statue will wait a long time before trying to move it off-world. Long after the hoo-rah has died down, long after the inspectors have forgotten what they were looking for. All that extra effort . . . You can’t keep that up for very long.”\nThen she clapped me on the shoulder and walked lightly through the barroom and exited into the streets of Port Rosario. I never saw her again.\nAll that was many years ago and they’re all gone now. Hot Dog smeared himself across a hectare of Martian desert when his ballistic failed to reenter properly. Willy went down for blackmail. Satterwaithe left Mars after the baby she had with Tiki died; and Tiki was never the same after that.\nTiki found enough evidence in Bytchkov’s apartment for the Port Authority to arrest Moynihan Truth when he stepped off the shuttle in Panic Town. He was exiled to Ceres.\nThe Martian Board of Actuaries sentenced VJ to slavery on the thermal decompositors out by Mt. Olympus for the remainder of Jaroslav Bytchkov’s natural lifetime. I did what I could for him by arguing to the Board that Bytchkov’s chosen profession of smuggler and thief put his lifespan at the low end of the confidence interval. That shortened VJ’s sentence, but he never got around to thanking me for it.\nGloria “Iceman” Eismann was killed three months later when the tunnel collapsed in Ice Mine <#>23. I don’t think the Bassendis had anything to do with it. I never told them my suspicions. Wherever she squirreled the statuette remains unknown, and it has never been found to this day.\nEdathanal never found another artifact like it, and after a time everyone assumed she had been mistaken about the whole thing.\nA writer back on Luna named Myles Hertzog possesses a replica, probably made from Edathanal’s sketches, and has achieved a modest success with exciting stories about aliens he calls “the People of Sand and Iron.”\nOriginally published in Mission: Tomorrow, edited by Bryan Thomas Schmidt.\nMichael Flynn began selling science fiction in 1984 with the short story \"Slan Libh.\" His first novel, In the Country of the Blind, appeared in 1990. He has since sold seventy or more stories to Analog, Asimov's Science Fiction, Fantasy & Science Fiction, and elsewhere. He is best know for the Hugo-nominated Eifelheim and his Tales of the Spiral Arm sequence, which includes The January Dancer, Up Jim River, In the Lion's Mouth, and On Razor's Edge. His most recent book is the collection Captive Dreams. He is currently working on a novel, The Shipwrecks of Time, set in the alien world of 1965."}