{"fingerprint": "aUw6pdYkWFtbCe5XsaiOh5+jwRM=", "sitename": "Clarkesworld Magazine", "title": "After Moreau by Jeffrey Ford", "author": "Jeffrey Ford", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ford_04_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: After Moreau by Jeffrey Ford", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1930 words, short story\n After Moreau\n I, Hippopotamus Man, can say without question that Moreau was a total asshole. Wells at least got that part right, but the rest of the story he told all wrong. He makes it seem like the Doctor was about trying to turn beasts into humans. The writer must have heard about it third-hand from some guy who knew a guy who knew something about the guy who escaped the island by raft. In fact, we were people first before we were kidnapped and brought to the island. I was living in a little town, Daysue City, on the coast in California. Sleepy doesn’t half describe it. I owned the local hardware store, had a wife and two kids. One night I took my dog for a walk down by the sea, and as we passed along the trail through the woods, I was jumped from behind and hit on the head. I woke in a cage in the hold of a ship.\n People from all over the place wound up on the island. Dog Girl was originally from the Bronx, Monkey Man Number Two was from Miami, and they snatched Bird Boy, in broad daylight, from a public beach in North Carolina. We all went through Moreau’s horrifying course of injections together. The stuff was an angry wasp in the vein, and bloated me with putrid gases, made my brain itch unbearably. Still, I can’t say I suffered more than the others. Forget House of Pain, it was more like a city block. When you wake from a deep, feverish sleep and find your mouth has become a beak, your hand a talon, it’s terrifying. A scream comes forth as a bleat, a roar, a chirp. You can’t conceive of it, because it’s not make believe.\n Go ahead, pet my snout, but watch the tusks. No one wants the impossible. What human part of us remained didn’t want it either. It was a rough transition, coming to terms with the animal, but we helped each other. After we had time to settle into our hides, so to speak, there were some good times in the jungle. Moreau could only jab so many needles in your ass in a week, so the rest of the time we roamed the island. There was a lot of fucking too. I’ll never forget the sight of Caribou Woman and Skunk Man going at it on the beach, beneath the bright island sun. The only way I can describe it is by using a quote I remember from my school days, from Coleridge about metaphor, “the reconciliation of opposites.” I know, it means nothing to you.\n We all talked a lot and for some reason continued to understand each other. Everybody was pretty reasonable about getting along, and some of the smarter ones like Fish Guy helped to develop a general philosophy for the community of survivors. The Seven Precepts are simple and make perfect sense. I’ll list them, but before I do I want to point something out. Keep in mind what it states in the list below and then compare that to the dark, twisted version that appears in Laughton’s film version of the Wells’ novel, Island of Lost Souls. Monkey Man Number One and a couple of the others took the boat to Frisco, and by dark of night robbed a Macy’s. One of the things they brought back was a projector and an 8-millimeter version of the flick. I believe it’s Bela Lugosi who plays Speaker of the Law. I’ll refrain from saying “hambone” for the sake of Pig Lady’s feelings. That performance is an insult to the truth, but, on the otherhand, Laughton, himself was so much Moreau it startled us to see the film. Here are the real Seven Precepts, the list of how we live:\n \n Trust don’t Trust\n Sleep don’t Sleep\n Breathe don’t Breathe\n Laugh don’t Laugh\n Weep don’t Weep\n Eat don’t Eat\n Fuck Whenever You Want\n \n You see what I mean? Animal clarity, clean and sharp, like an owl’s gaze. Anyway, here we are, after Moreau. We’ve got the island to ourselves. There’s plenty to eat—all the animals that resided naturally and the exotic beasts Moreau brought in for the transmission of somatic essence—the raw ingredients to make us them. A good number of the latter escaped the fire, took to the jungle and reproduced. There are herds of suburban house cats that have wiped out the natural ostrich population and herds of water oxen that aren’t indigenous.\n Actually, there’s also a tiger that roams the lower slopes of the island’s one mountain. Ocelot Boy thought he could communicate with the tiger. He tracked the cat to its lair in a cave in the side of the mountain, and sat outside the entrance exchanging growls and snarls with the beast until the sun went down. Then the tiger killed and ate him. The tiger roared that night and the sound of its voice echoed down the mountain slope. Panther Woman, who lay with me in my wallow, trembled and whispered that the tiger was laughing.\n She also told me about how back in the days of the Doctor, when her tail and whiskers were still developing, she’d be brought naked to his kitchen and made to kneel and lap from a bowl of milk while Moreau, sitting in a chair with his pants around his ankles, boots still on, petted his knobby member. I asked Panther Woman why she thought he did it. She said, “He was so smart, he was stupid. I mean, what was he going for? People turning into animals part way? What kind of life goal is that? A big jerk-off.” We laughed, lying there in the moonlight.\n Where was I? I had to learn to love the water, but otherwise things weren’t bad. I had friends to talk to, and we survived because we stuck together, we shared, we sacrificed for the common good. Do I have to explain? Of course I do, but I’m not going to. I can’t remember where this was all headed. I had a point to make, here. What I can tell you right now is that Rooster Man went down today. He came to see me in the big river. I was bobbing in the flow with my real hippo friends when I noticed Rooster calling me from the bank. He was flapping a wing and his comb was moving in the breeze. Right behind him, he obviously had no idea, was a gigantic alligator. I could have called a warning to him, but I knew it was too late. Instead I just waved goodbye. He squawked bloody murder, and I finally dove under when I heard the crunch of his beak.\n Tomorrow I’ve got tea with the Boar family. I ran into old man Boar and he invited me and Panther Woman over to their cave. The Boars are a strange group. They all still wear human clothes—the ones that can do anyway. Old man Boar wears Moreau’s white suit and his Panama hat. It doesn’t seem to faze him in the least that there’s a big shit stain in the back of the pants. I’ve shared the Doctor’s old cigars with Boar. He blows smoke like the boat’s funnel and talks a crazy politics not of this world. I just nod and say yes to him, because he puts honey in his tea. Panther and I crave honey.\n The other day, when he offered the invitation, Boar told me under his breath that Giraffe Man was engaged in continuing experiments with Moreau’s formulas and techniques. He said the situation was dire, like a coconut with legs. I had no idea what he meant. I asked around, and a couple of the beast people told me it was true. Giraffe couldn’t leave well enough alone. He was injecting himself. Then a couple days after I confirmed old Boar’s claim, I heard they found Giraffe Man, on the floor of what remained of the old lab—a bubbling brown mass of putrescence.\n We gathered at the site and Fish Guy shoveled up Giraffe’s remains and buried them in the garden out back. Monkey Man Number Two played a requiem on the unburned half of the piano and Squirrel Girl, gray with age, read a poem that was a story of a tree that would grow in the spot Giraffe was buried and bear fruit that would allow us all to achieve complete animality. Everybody knew it would never happen but we all wished it would.\n When I loll in the big river, I think about the cosmos as if it’s a big river of stars. I eat fish and leaves and roots. Weasel Woman says it’s a healthy diet, and I guess it is. How would she know, though, really? As long as I stay with the herd of real hippos, I’m safe from the alligators. There have been close calls, believe me. When standing on land in the hot sun, sometimes I bleed from all my pores to cool my hide. Panther Woman has admitted this aspect of my nature disgusts her. To me she is beautiful in every way. The fur . . . you can’t imagine. She’s a hot furry number, and she’s gotten over her fear of water. I’m telling you, we do it in the river, with the stars watching, and it’s a smooth animal.\n If you find this message in this bottle, don’t come looking for us. It would be pointless. I can’t even remember what possessed me to write in the first place. You should see how pathetic it is to write with a hippo paw. My reason for writing is probably the same unknown thing that made Moreau want to turn people into beasts. Straight up human madness. No animal would do either.\n Monkey Man Numbers One and Two are trying to talk some of the others into going back to civilization to stay. They approached me and I asked them, “Why would I want to live the rest of my life as a sideshow freak?”\n Number Two said, “You know, eventually Panther Woman is going to turn on you. She’ll eat your heart for breakfast.”\n “Tell me something I don’t know,” I said. Till then, it’s roots and leaves, fucking in the wallow, and bobbing in the flow, dreaming of the cosmos. Infrequently, there’s an uncertain memory of my family I left behind in the old life but the river’s current mercifully whisks that vague impression of pale faces to the sea.\n That should have been the end of the message, but I forgot to tell you something. This is important. We ate Moreau. That’s right. He screamed like the bird of paradise when we took him down. I don’t eat meat, but even I had a small toe. Sweet flesh for a bitter man. Mouse Person insisted on eating the brain, and no one cared to fight him for it. The only thing is, he got haunted inside from it. When we listened in his big ears, we heard voices. He kept telling us he was the Devil. At first we laughed, but he kept it up too long. A couple of us got together one night and pushed him off the sea cliff. The next day and for months after, we searched the shore for his body, but never found it. Monkey Man Number One sniffs the air and swears the half-rodent is still alive on the island. We’ve found droppings.\n Jeffrey Ford's most recent novels are The Portrait of Mrs. Charbuque, The Girl in the Glass, and The Shadow Year (all from Harper Collins). His short stories have been collected into two books from Golden Gryphon Press, The Fantasy Writer's Assistant and The Empire of Ice Cream. In September of 2008, Harper Collins will publish a third collection, The Drowned Life. Also in '08 Golden Gryphon will rerelease his trilogy, The Physiognomy, Memoranda, and The Beyond with new covers by John Picacio. Ford's stories have appeared in a variety of magazines and anthologies, and his work has been awarded The World Fantasy Award, The Nebula, The Edgar Allan Poe Award, The Fountain Award, and Le Grand Prix de l'imaginaire. He lives in South Jersey with his wife and two sons and works as a professor of Writing and Literature at Brookdale Community College."}