{"fingerprint": "AxaWkN2UcrwhCu0I3oxUG8/zzTA=", "sitename": "Clarkesworld Magazine", "title": "Writing Is Magic: A Conversation with John R. Fultz by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/fultz_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Writing Is Magic: A Conversation with John R. Fultz by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nWriting Is Magic: A Conversation with John R. Fultz\nMadness comes to the King \"like a creeping fungus in the hollows of his mind.\" The dark sorcerer returns. The Giants welcome the storm. A Prince must avenge his father's death and take his rightful place upon a distant throne.\nFrom page one, Seven Princes by John R. Fultz cracks open like teeth-shattering thunder and rolls through more than five hundred pages of adventure, dark intrigue, and incisive character development.\nThis is no flimsy first novel. Seven Princes has the heft of Tolkien's fiction, the pacing of Edgar Rice Burroughs' John Carter tales, and the character-rich complexity of... well, of a John R. Fultz novel.\n\"Is war an inevitable part of human existence?\" asks Fultz in his debut novel. \"Is vengeance worth its cost? What is the nature of reality and what are the keys to mastering it? Which is more powerful—love or hate? What do rulers owe to those who are ruled? How do you kill someone who cannot die? How does a Prince become a true and worthy King? What is the price of wisdom?\" These are some of the book's most prevalent themes.\nWritten in a simultaneously elegant and effortless style, Seven Princes swallows the reader into a world where the battle between good and evil is as complex as the human heart.\nIn the interview below, Fultz and I talk about writing as a form of sorcery, bringing characters to life, and the abiding philosophy that informs his work...\nWhat do you enjoy about writing fiction in general and fantasy in particular?\nAs I tell my students, writing is magic. I don't mean that in a metaphorical way; I'm quite literal about it. Art is a bridge between spirits, and writing is one of the most effective art forms to do this (another is music). Writing joins mind to mind, spirit to spirit, and it defies the restrictions of space and time. You can read Shakespeare or Poe and get inside their mindspace, share their visions, even though they've been dead for ages. You can read ancient texts and get fresh meaning and relevance from them. (When it comes to non-fiction, I recommend Marcus Aurelius and Lao Tzu.) Something you write today can be found and read in a thousand years and it will still make an immediate connection with the reader's consciousness. This is magic.\nThe written word is the basis for our entire human civilization, and it stems from the ability to tell stories, which separated us from animals thousands and thousands of years ago. By telling each other stories we preserve and pass along vital information...the early myths of every culture evolved in this way. Modern fantasy is simply the latest evolution of those primal myths. In some cases, fantasy fiction is a literal throwback to those myths. Of course, the real difference between fantasy fiction and actual myths is that in a fantasy world myths aren't metaphors, they are literal realities (as early peoples believed their myths to be). Fantasy speaks to something ancient and honest inside us all. It elevates us from our day-to-day existence into a realm of ideas, archetypes, universal consciousness, and boundless imagination, where the spirit can roam free and expand. When we finish a fantasy story or novel and return to our own reality, we are better for the experience.\nIn my view, fantasy fiction is a perfectly valid form of literature that can be as enlightening, truthful, and transformative as any \"classic\" literature. I also enjoy horror and sci-fi, but the fantasy genre has always been my first love.\nWhat do you admire about Edgar Rice Burroughs' writing? And in what does his influence show up in Seven Princes?\nBurroughs is the Master of Adventure. They say Felix Faust (aka Max Brand) was the \"King of the Pulps,\" but I think that title would better be bestowed on Burroughs. His Martian Tales series really hit me hard as a kid. I read the first four or five books, beginning with his first novel A Princess of Mars. Those books just drew me in like magnets—especially with their gorgeous Michael Whelan covers. The Martian Tales starring John Carter (i.e. most of them) are the missing links between Western fiction and Sword and Sorcery. On Barsoom (Mars) you have swashbuckling, sword-slinging action alongside radium pistols, flying ships, ancient technology, and tons of monsters. John Carter is plunged from the post-Civil War Old West into the brutal culture of the red planet, and his adventures hearken back to the classic romances of earlier decades. As you can probably tell, I prefer Burroughs' Martian Tales to his Tarzan work. I also love to point out that John Carter came before Tarzan. With the release of the upcoming John Carter movie, the character is finally getting his \"moment in the sun.\" I hope the movie lives up to the spirit of Burroughs' work. From the two trailers I've seen, and the creative teams involved, I'm very optimistic. (For a more precise list of reasons why, check out my recent blog post on the subject.)\nBurroughs had a taste for pure adventure that has rarely been rivaled. So what if he recycled plots—the guy wrote tons of John Carter and Tarzan books, so some repetition was inevitable. And they say that when you steal from yourself it's called \"style.\" Burroughs inspired a generation of pulp writers who came after him, and his work continues to inspire writers today. It was only a matter of time until John Carter found his way to the silver screen. Especially since the Tarzan franchise has been reduced to a kids' cartoon musical. Perhaps if John Carter is a success, we'll see a revival of the true, visceral Tarzan character in a new series of movies. I think you can find almost anything you love about a Tarzan story somewhere inside the John Carter tales—and more. They are my favorite because they are full of wild imagination, bizarre aliens, swordplay, romance, and heroism. The very idea that Mars is covered with all of these ancient ruined cities, dried-up ocean seabeds, and lost civilizations is enough to get the imagination going.\nI'm not sure if any of my Burroughs influence shows up in Seven Princes, but if it does it's deeply embedded in the raw sense of adventure that erupts again and again throughout the novel. Of course, today we writers are more interested in three-dimensional characters who are conflicted and complex beings, whereas Burroughs worked more with clear-cut heroes, dastardly villains, and traditional casts of supporting characters. However, the breakneck sense of adventure that made Burroughs so beloved remains as strong as it was a hundred years ago.\nWhere did Seven Princes start—with an image, a character, something else?\nIt actually started with an idea called Child of Thunder, the story of \"the Giant who was a Man and the Man who was a Giant.\" This shows up in Seven Princes as the backstory of Vod the Giant-King. Vod's story is a romance about a Giant who could take the form of a Man, and it serves as part of the vast backdrop against which The Books of the Shaper are set. Child of Thunder didn't quite work as a novel...so I dove back into the world I had created and decided to tell the story of Vod's heirs—the Princes Tadarus and Vireon, and the Princess Sharadza. The book also involves five other Princes from various kingdoms, some in more crucial roles than others. Some day I'd like to go back and tell Vod's complete story as a graphic novel with the right artist. But to get at the heart of your question, Seven Princes started with a character. The character of Vod. All of my stories begin with character, and character is for me the driving force of the narrative. Plot, theme, and everything else comes from character. The old saying \"Character is king,\" really applies to the way I write. It's rare that I find a writer who disagrees with this approach. If you have great characters in a great setting, and you listen to those characters, then you inevitably get a great story.\nWhat goes into the creation of a compelling—or great— protagonist in general and a compelling fantasy protagonist in particular?\nI think a compelling protagonist means a character that seems real in as many ways as possible. In fantasy, this can mean many different things, but in general the basic human factor remains the same. Even if you're writing about a protagonist who isn't literally human, he (or she) must have something that readers can embrace and identify as essentially human traits. Usually this means some kind of internal conflict or challenge, which accentuates and magnifies an external conflict. \"Perfect\" characters are boring, and the very nature of humanity is that we are imperfect beings. So imperfect characters are the most interesting. The current popularity of the \"anti-hero\" in our society is indicative of this idea.\nIn what ways are you and D'zan similar? Or is there a different character that more closely resembles you?\nActually, I probably identify most with Prince Lyrilan of Uurz. He is the Scholar Prince, a historian, an archivist, and a budding author. His initial goal is to chronicle the events of D'zan's struggle. The written word is his domain, unlike his twin brother who is a born warrior. I don't have a warrior twin, but I'm all about the written word.\nI suspect we'll be hearing much more from Lyrilan of Uurz in future books?\nLyrilan is one of the prime viewpoint characters of Book Two: Seven Kings. I can't say much more about it for fear of giving spoilers, but he has an incredible character arc in that volume.\nAnd how about Sharadza? Who is she, where'd she come from, and what makes her tick?\nSharadza is the daughter of Vod the Giant-King, and her brothers are three of the titular Princes. Her goal in the first book is to master the sorcery that her kingly father refuses to teach her, so she sets out to find her own way into the mysterious world of magic and spellcraft. She is the reader's entry point into the Shaper's mystical and mysterious world... Her growth as a woman and a sorceress continues throughout the series.\nYou mentioned the importance of a great setting. Can you talk a little bit about how you built the world of Seven Princes? What's the relationship between character and setting in this novel?\nI think they are so closely intertwined as to be practically inseparable. The environment in which we grow and thrive (or against which we struggle) tends to define us to a large degree. So all of these characters are products of their kingdoms, including the socio-cultural and moral aspects of these kingdoms. In some cases, characters influence the environment to the point of completely altering it—usually in the cases of great acts of sorcery. Vod had such an impact on the world more than twenty years before Seven Princes begins. Everyone is sort of living in his shadow, so to speak—especially his three sons and his daughter. Vod cracked the world, slew a desert, and brought Men and Giants together.\nThroughout Seven Princes you embrace tropes while somehow stripping them of cliche. Is this novel Sword and Sorcery? Epic fantasy? Something else altogether?\nThank you for the compliment; this was a primary goal of mine. You really can't get away from fantasy tropes when you write fantasy, so instead you have to embrace them and do something new with them. People have referred to my work as \"Sword andSorcery\" for years, but I don't put that label on myself. Readers are free to call it what they will, and publishers need labels to market and sell books, so genre labels are handy tools. I think Epic Fantasy is probably closer to the mark with Seven Princes, but then again there are no \"hard and fast\" definitions for either S&S or Epic Fantasy. The second often involves elements of the first. When I write, I simply create stories that are meaningful to me, the stories that I would like to read. I don't worry about what genre I'm writing in. I go where my passion takes me, which if you ask me is the key to all good writing. These days it seems like the term \"Sword and Sorcery,\" which used to be fairly derogatory, has been given fresh life and revived as a viable sub-genre of Fantasy. When I was in a rock band, people used to say \"What kind of music do you play?\" and it was always a hard answer to give because musicians, like writers, don't want to limit themselves. If people want to call Seven Princes \"Sword and Sorcery\" I'm fine with that—just as I'm fine with \"Epic Fantasy,\" \"Heroic Fantasy,\" \"Dark Fantasy,\" and \"High Fantasy.\" It all falls under the broad Fantasy category, so it's all good.\nSeven Princes is dedicated to Darrell S. I'm assuming the \"S\" stands for \"Schweitzer.\" What influence has he had on you?\nYes it does, and you'll find Darrell's full name listed among my acknowledgments in the back of the book. Darrell began as one of my favorite writers, then became a longtime mentor, and ended up as one of my dearest friends (who is still one of my favorite writers). I first discovered the genius of his short stories when I read \"Mysteries of the Faceless King\" in Marvin Kaye's anthology Weird Tales: The Magazine That Never Dies way back in 1988. (This was also the book that turned me on to the brilliance of Tanith Lee, thanks to her wonderful story \"The Sombrus Tower\" in that same collection.) \"Faceless King\" led me on a search to find any more Schweitzer stories that I could...and there are hundreds of amazing tales to discover, as he is a master of the form. I did the same thing with Tanith Lee's stories from that time onward. I was in college at the time, and I soon discovered the legendary Terminus run of Weird Tales magazine (famously edited by Schweitzer and the late George Scithers). I immediately began sending stories to Weird Tales, and I immediately got several rejections, as any young writer must.\nHowever, every rejection carried priceless writing advice from Darrell. I kept on writing, and I kept on reading, and I followed Darrell's great work through the intervening years. Throughout the 90s his stories of Sekenre the Sorcerer set a new bar for Sword and Sorcery fiction and Dark Fantasy in general. After 15 years of attempting to write a story worth of publishing in WT, 15 years of polishing my craft, striving to apply the principles of good writing I continued to learn from Darrell (as well as the many other writers I studied—from Dunsany to Silverberg to Lee to Ellison, etc.), I finally did it. Darrell bought my first pro story, \"The Persecution of Artifice the Quill,\" and published it in Weird Tales #340, one of the last issues he and Scithers edited. This was a major breakthrough for me, and it inspired a dozen other tales that soon followed.\nAfter corresponding with Darrell for nearly two decades, I finally got the chance to meet him and his wife in person at the 2006 WorldCon (where he introduced me to the great Harlan Ellison—I was tongue-tied). Since then I've made it a priority to meet up with Darrell at the World Fantasy Convention every year. It was Darrell who told me a few years ago that the next phase of my career should be writing novels. As in so many other cases, he was right. This is only one example of the tons of great advice he's given me over the years. I'm known far and wide for singing the praises of Darrell's fiction, which deserves far more attention than it gets. His Mask of the Sorcerer novel is a great place to start reading if you haven't experienced his work, as are any of his short story collections. He is without a doubt one of the world's greatest living fantasists.\nAre teaching and writing similar?\nWell, both require an intense passion for what you're doing. Teaching is a calling, not a job. It's the same with writing. Writers write because they have to write. The same may be true for teachers. Certainly nobody gets into teaching for the money. And while most writers would love to be financially successful, it's not a prime motivation to start writing. If you want a lot of money you get into accounting, finance, or some other profession that provides those kinds of rewards. In some ways you have to be a very impractical person to be a writer...there are any number of things you could do that are easier and more materially rewarding. The same is true of teaching. I tried the corporate route and was delighted to leave it behind in favor of teaching young people to read, write, and think. One thing that happens when you teach literature is that the lessons you learn from teaching a great story, novel, or poem tend to creep back into your writing. Appreciating, analyzing, and enjoying great works of literature is something that all writers should do, and teaching those works as part of my daily living can often be very inspiring.\nWhat are some of the things your students have taught you about writing?\nThey've taught me to be patient, which is a crucial lesson for a writer (as well as a teacher). Publishing moves at a glacial pace. Sometimes the writing itself also moves incredibly slowly. You can't rush it. And you can't rush kids to learn... you can lead them, but they have to follow you willingly. They've also taught me time and again that the best stories are those that connect to readers on a basic human level. Readers (of any age) respond to characters that seem real and believable to them. So I try to create characters that readers can relate to, even when they are characters you love to hate.\nWhat's next for you?\nRight now I'm working on the Third Book of the Shaper, Seven Sorcerers. It's going to be massive. The second book, Seven Kings, is nearly finished; once again the great Richard Anderson has done an amazing cover. I've also got the PRIMORDIA hardcover graphic novel coming from Archaia this month (with amazing artwork by Roel Wielinga) and a great \"weird history\" story called \"The Gnomes of Carrick County\" appearing in the new issue of Space & Time magazine.\nAny parting words of advice, wisdom, or mischief?\nI just want to thank the amazing Orbit Books team for bringing Seven Princes and The Books of the Shaper to fantasy fans all across the globe. Orbit is truly a class act and it's humbling to be a part of their terrific lineup.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}