{"fingerprint": "ChscLWc+VFBWdl5gonyuB22/4oU=", "sitename": "Clarkesworld Magazine", "title": "Writing for Video Games: A Conversation with E. Lily Yu, Yoon Ha Lee, Robert Reed, Seth Dickinson, and Karl Schroeder", "author": "Alvaro Zinos-Amaro", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/game_writers_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Writing for Video Games: A Conversation with E. Lily Yu, Yoon Ha Lee, Robert Reed, Seth Dickinson, and Karl Schroeder", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nWriting for Video Games: A Conversation with E. Lily Yu, Yoon Ha Lee, Robert Reed, Seth Dickinson, and Karl Schroeder\nContemporary video games with science fiction and fantasy settings, such as last year’s Destiny, are often conceived on grand production scales and have movie-sized budgets. They attract prime Hollywood voice talent, are accompanied by full original orchestral scores, and so on. We thought it would be fun to catch up with some of the writers who inspire and shape these visions.\nE. Lily Yu is an author and narrative designer and recipient of the John W. Campbell Award for Best New Writer. Her stories have appeared in Clarkesworld, Uncanny, McSweeney’s, and Boston Review and been nominated for the Hugo, Nebula, Sturgeon, and World Fantasy Awards.\nYoon Ha Lee is the author of the collection Conservation of Shadows and the StoryNexus game Winterstrike. He lives in Louisiana with his family and an extremely lazy cat, and has not yet been eaten by gators.\nRobert Reed has been a professional science fiction writer for thirty years, and he writes a lot about a big spaceship called the Great Ship.\nSeth Dickinson is the author of The Traitor Baru Cormorant, “a mic drop for epic fantasy,” and more than a dozen short stories. He wrote much of the flavor and fiction for Bungie Studios’ Destiny.\nKarl Schroeder is a Toronto-based futurist and author of ten science fiction novels, including the acclaimed Virga series.\nWhat are your video game writing credits, and how did you come to work in the industry? Were you sought out, or did you actively look for the opportunity to work in video games?\nSeth Dickinson: My sole full-time credit is Destiny, Bungie’s mythic space opera, where I worked on the game’s deep fiction. I got involved by filling out a job application on their website. I’ve also worked on Marauder Interactive’s upcoming Enemy Starfighter, a game of interstellar rebellion. And since 2009 I’ve been a writer and designer for Blue Planet, a fan-made sequel to Volition’s classic FreeSpace 2. One of our stories actually ended up here in Clarkesworld! I joined the Blue Planet team because I played FreeSpace 2 when I was very young, and it remains one of my favorite works of fiction across any genre.\nKarl Schroeder: Like Seth, my direct experience has been limited to the Destiny project, but I will say that I was creating levels for a dial-up multi-player dungeon game written by my friend Nick Gloor back in the 1980s, so you might say it’s always been in my blood. Bungie approached me, and told me it was because of the epic-scale worldbuilding I’ve done in the past, especially for my Virga books. They are very careful and systematic in constructing the Destiny universe and the logic that drives it, and they’ve called on different authors at different times for the specific skill-sets each can bring to the table. For the storytellers involved, Destiny is very much an ensemble performance.\nE. Lily Yu: I was a writer on Destiny at Bungie from 2012 to 2013 and a freelancer with them for parts of 2014, a remote collaborator for Tale of Tales on an unreleased game in 2013, and shortly expect to join a VR dev team. Bungie sought me out on the strength of my prior work.\nRobert Reed: Destiny is my one credit, and Bungie is my only employer in the vast gaming business. They sought me out back when their game was still called Tiger. Apparently, my space opera novels Marrow and Sister Alice were what piqued their interest. After I signed 200,017 pieces of legal paper, they began to teach me about their universe and about video games in general. Which was fun, I should say. More than I ever would have guessed. And once given a sense of their story, I tried to offer suggestions and critical comments, and now and again, I wrote words that eventually made it into the game.\nYoon Ha Lee: Right now, just one: Winterstrike, which was a narrative-style game commissioned for Failbetter Games’ (the folks behind Fallen London) StoryNexus platform. Apparently I came to their attention because Emily Short, who’s active in interactive fiction and narrative games, recommended me; we’d been acquainted for some years on the strength of a text adventure I’d written about ten years ago, The Moonlit Tower, in Inform 6. Alexis Kennedy at Failbetter Games liked the game and my writing style in static fiction, and it went from there.\nCurrently I’m working on a (small) choose-your-own-adventure style videogame for Choice of Games; in that case I sought out the opportunity since I was between projects. I’ve always been fascinated by game-writing/design and I thought it would be interesting to try to broaden my horizons.\nE. Lily Yu: I should add that when we say that Bungie sought us out, we all mean Eric Raab, who came to Bungie from an editing position at Tor and has been critical in bringing science fiction writers to the company.\nRobert Reed: In my case, I was called by Eric at the beginning, but he still worked at Tor. He was a facilitator in a process mostly invisible to me. It was Joseph Staten who took me out for dancing and drinks, which means that he came to Lincoln to give me the pitch. Joseph was the face of my Bungie during that first year, and then Eric arrived.\nCan you talk a little about the requirements/parameters of your various video game writing assignments? What factors do you have to consider when you do the work?\nRobert Reed: There’s this kid. You might not know him at all, but he’s very rich and he has invited you over to his house to play in his sand pile. And by “sand pile,” I mean that he owns three miles of pristine beach on a tropical island, and by “play,” I mean that besides the usual plastic buckets and scoops, your new friend maintains a fleet of backhoes and barges and hundreds of other kids who have come over for the play day. In other words, he has resources beyond any that you have ever seen. But you are his guest and certain rules apply. This is not your property. None of this will ever belong to you. Some patch of the beach will be yours, but only temporarily, and you should always play nice with everybody and obey more than a few of the rules, and if anybody important asks you to leave, you leave. This isn’t your sand, and these aren’t your toys. Keep that in mind at all times.\nFor me, working for Bungie means visiting about once a year, absorbing what I can over several days, and then flying home with one or several assignments. I work best at home, in a familiar and well-lit environment. Bungie is neither familiar nor well-lit, and three days usually leaves me craving even the weakest Seattle sunshine.\nThis isn’t my beach, but even still, I have to feel invested in the work. My temporary sand and my borrowed shovel matter. If there is no emotional connection, then everybody will suffer.\nOf course, money helps my enthusiasms. Without doubt.\nAt first, Bungie gave me the task of building a logical, halfway scientific structure for their preliminary Tiger project. And this is a point I can’t make often enough: Bungie gave me SF conundrums that I never would have faced on my own. One of my last duties of that first year was to build the science for blowing something up. Something rather big. I’m not going to tell you what that something was. And I won’t claim that I thought it was a good thing to demolish—in a story-problem sense. But they had second thoughts too, and before I finished, they told me that no, they wanted something else blown up. And I had to do it with some rather limited technology, by the way.\nThis was a problem that I happily chewed on for days. And has that big something actually blown up yet? Not that I’ve seen in the game, no. But who knows what’s going to happen? Not me. This isn’t my beach or my universe.\nLater, I wrote some pieces from one character’s POV. Which I enjoyed quite a bit. After that, Eric brought me back to write more pieces and re-calibrate what I did before. And this brings up another basic tenant: The universe isn’t yours, no. But if you can make any little part of it your own, then you’ll be invited back again. And how did I manage this trick? Dumb luck and writing SF for nearly forty years now. And reading about astronomy and physics every day. Plus sitting happily at home while I’m trying to figure out how to blow shit up.\nSeth Dickinson: Above all else I want my game writing to rhyme with the actions of playing the game. I want it to live inside the basic muscle action and the emotional associations.\nIn Enemy Starfighter, a game about calculated violence and well-timed retreat, I want sharp fiction with aggression and a certain esoteric elusiveness. In Blue Planet, a game about forcing you to reckon with the humanity and moral worth of the people you’re killing, I want my writing to evoke hesitation, pain, and necessary rage. Starfighter demands inhuman precision. Blue Planet should make you feel like you have to saw through the gristle of human connection.\nI want basic gameplay actions like killing an enemy or firing a missile to conjure up stories and emotional hues from the lore. If you can follow the game design and paint a little color into the mechanics, I think you’re doing your job.\nAnd, at the opposite extreme, you want to render a world for the designer to pluck ideas from. It’s symbiosis. You help the designer fictionalize the mechanics and tell stories about how they work—because people have an ear for stories, they like to organize facts by associating them with people and emotions. And in turn the designer counts on you to create stories that inspire mechanics. The artist wants a framework to focus her imagination.\nOn Blue Planet I worked really closely with a designer from Finland who I only knew as “Fury.” We had a problem: our enemies were dumb! We had to throw a lot of them at the player to create a challenge. They felt like swarms of dumb machines who didn’t care about their lives, and that ruined the story, because it didn’t feel like a tragic war between two compassionate democracies who cared about human life.\nFury built a new set of behaviors that made enemies much smarter and much more self-caring. They put a lot more effort into saving themselves. Players stopped seeing them as obstacles to swat, and started respecting them as enemies, fearing them as predators, and feeling sorry for them when they ran and tried to live. That mechanical change altered our whole approach to mission design. We could put the player up against small groups of smart antagonists with the illusion of social behavior. And that, in turn, saved our whole story.\nI guess you could call this “ludonarrative consonance” if you wanted to get fancy. If you can engage the player’s imagination, they’ll do work for you. Dark Souls did an amazing job of using its world and mechanics to evoke a mood. I really like Kerbal Space Program because its mechanics teach you to explore, push, and learn from joyful failure. I liked Crysis 2 because the heavily scripted narrative worked with a story that was very skeptical of human agency in a system of smart machines. STALKER: Shadow of Chernobyl and Bastion also drew me in with a strong link between mood, mechanics, and world. The Stanley Parable is explicitly about choice in both story and gameplay. Amnesia is a horror game that punishes you for looking at the monster—that’s brilliant! Half-Life 2 used a cocktail of sound design, good writing, and smart AI to make you afraid of its enemies and attached to your friends. The Last of Us makes violence difficult and painful, and its follow-up Left Behind pushes out into the warmth of human relationships by letting you use the environment to socialize with your friend. Papers Please makes you complicit in a very ugly system.\nGames conjure up the power of the situation by letting the player act out motivations and fears. Games are pretty cool. (At Chicago and NYU we used a very simple game to model racial bias in police shootings, and it was frighteningly effective.)\nThe other big constraint is the need to alter your writing in response to changing technical and design requirements! You can’t be precious. It’s a give and take!\nYoon Ha Lee: For both Failbetter Games and Choice of Games, I was working with my own IP, so I didn’t have to worry about messing up someone else’s sandbox (although that’s certainly a requirement I’ve dealt with before; I used to write game fiction for Alderac Entertainment Group’s [non-video/tabletop] collectible card game Legend of the Five Rings). Once the proposals were accepted, I had broad latitude in terms of how I wanted to approach worldbuilding.\nFor Failbetter Games, the big constraint was the mechanics of the StoryNexus platform itself. StoryNexus works similarly to their game Fallen London in that you have both an “Opportunity Deck,” from which you draw multiple-choice “storylets” randomly as you advance in stats, and “Pinned Decks” that are visible at all times and that represent more linear aspects of the setting. Writing encounters for the Opportunity Deck was a particular challenge because they really were randomly drawn—you could constrain them so that players wouldn’t encounter cards that were too easy or too difficult for their level, but otherwise? Random. And they would recur, too, because otherwise you’d run out of game content too quickly. So if you wrote something like, say, the assassination of Archduke Ferdinand, it would start looking really bizarre because the event would happen over and over as the card showed up again and again, especially as chances were you could choose different ways of dealing with the situation each time. This resulted in having to write encounters such that they could be interpreted as being somewhat generic. (Fallen London itself does this very well, and I looked to it a lot for examples.) The other way I dealt with this was by creating a world/society at the edge of breakdown, in which these sorts of freewheeling encounters would not seem too unnatural as the norm.\nChoice of Games is interesting in that it’s Choose-Your-Own-Adventure-style with added statistics, but the games are text-only. No sound, no music, no graphics to carry the story. Everything has to be built on words. At the same time, you don’t want to dump screens and screens of the stuff on the player because I certainly have been that player who scrolls down and stops reading after a paragraph or so of text in an overly long-winded dialog. So it’s a matter of getting across the essential action and setting as concisely as possible.\nKarl Schroeder: Much of my work is still under NDA, but I can talk about my involvement in last year’s Urgent Evoke workshop in Arizona. Urgent Evoke is a World Bank initiative to create online games that help empower people in remote/disadvantaged communities. The 2014 workshop I participated in focused on building out story skeletons we’d discussed online. Authors, subject experts, and artists brainstormed together for three days to craft community-building scenarios that could be gamified. This was an interesting project because the aim wasn’t just to craft a game that was fun to play, but to generate a kind of trail of breadcrumbs that showed how people under strain could build and use resources together to help each other out. Each team developed a scenario which was then rendered as a storyboard sequence by the artist for group presentation and discussion. So, this was early-stage design that would later be taken up by programmers and artists to develop the final games.\nAlso last fall, I was hired to script an augmented reality game/experience. The player would, using Google Glass or a similar device, take a tour of a real physical space and interact with virtual prompts at different points. This was a kind of real world “choose your own adventure” process that was quite fun.\nThese experiences have made it clear to me that the current PC or platform-based model of gaming is just the tip of the iceberg, and that it’s still early days in gaming as an art form.\nE. Lily Yu: First question is tough because of the variety of work I and most game writers have done, everything from multilingual naming to reference documentation for third parties to Kickstarter reward tiers, and because narrative design is a continuous, collaborative process. Generally, I try to understand the purpose and desired effect of whatever is on the table, which designers or artists are directly involved and what their different visions are, what is technically feasible and what is not, and how costly different options are in terms of time and resources. From this, in close consultation with whoever else is involved, I come up with multiple pitches that take into account the overall tone and arc of the project and the various ideas, requests, and suggestions from other people, narrow them down after feedback, and revise based on continued feedback.\nIt’s probably a lot like what other designers and artists do, but with a different skill set, different priorities, and different considerations.\nWhen you play a game you’ve been working on, can you spot your writing/storytelling contributions, and if so, how does it make you feel?\nSeth Dickinson: Yeah, definitely! It feels great. It’s the second-best feeling. The best feeling is when your work inspires a coworker or a fan to make something even better, or when you’re able to riff off something a coworker did in a way that supports and speaks to their work.\nRobert Reed: “When you play a game you’ve worked on . . . ”\nNow that’s a phrase I never imagined would pertain to me.\nI visited Seattle last year, months before Destiny’s launch. Earnest people tried to show me the game by having me play it. Which was a tragic mistake. To say that I was awful is kind. I was pathetic. I couldn’t shoot. Hell, I couldn’t walk with authority across the simplest scene. I embarrassed myself, my teachers, and the entire gaming profession. But Destiny has been out for months, and I’ve been playing from the start. Perhaps too much time has been spent shooting the Fallen. And while I didn’t create the Cosmodrome, it’s nothing but fun to have my Guardian stop at some random point and stare at a piece of ground. The details are fabulous. Running through a vast landscape that hangs on a museum wall—that’s what it feels like. A museum catering to scenes from the Apocalypse, but gorgeous all the same. And because I know some of the history and I know secret possibilities, this middle-aged author is enjoying himself quite a bit.\nI wrote a few of the grimoire cards, and I’ve collected a portion of those by honest means. Playing the game. Which is rather like finding your work in a library or bookstore. Except it’s not under your name, or anybody’s name. And there’s nobody standing in the aisle, letting you wave your words under their nose.\nMost of my efforts? I don’t see them. I may never see them. But it says something that I would like to contribute something that I could point to and claim as my own. Giving a shit. That’s what separates us from the Fallen.\nKarl Schroeder: At first I wasn’t sure I could answer this, but Robert’s description pretty much sums it up. Unless you’re writing dialogue or are in on the early stages of design, your own personal contribution is not likely to be that visible. There is, though, this indefinable sense of belonging—in a particularly special way—to the world of Destiny as you walk through it, if you’ve had a part in its creation. Particularly if you know certain secrets.\nThere’s always a lot that doesn’t make it into the game, or is altered along the way. I know things about some of the characters in the Tower, for instance—legends and backstories both official and unofficial. I know a great deal about the City and its fortresses, and about the long era between the Collapse and the present in Destiny history. The fact that I can’t talk about any of that actually adds a certain mystique to it all.\nOh, and despite having played every shooter since Doom, I was unfamiliar with the PS4 controller when I first played the game, so I too walked over walls, off cliffs, and into the arms of the Fallen more times than I can count. I’m probably the lowest-ranked Guardian in Crucible. But I Know Things. That’s the one shred of dignity I can cling to as I’m getting fragged by some pipsqueak Hunter half my age . . .\nE. Lily Yu: It’s an incredible feeling, coming from print media, to see your words or descriptions or suggestions visualized either in 2D or 3D art, in characters, in actual game events, sometimes only days after you send the idea around. Probably not as astounding for former TV and movie writers, who’ve been there and done that. Also, I’ve done placeholder audio on a couple of different projects, when it’s too early for voice actors (thanks for inviting me that first time, Clay!), and it always cracks me up.\nYoon Ha Lee: With a text/narrative-based game, I can’t get away from my writing! It’s the primary means through which the player forms an impression of the world or decides upon actions. I remember when I was playtesting Winterstrike myself, I would go cross-eyed staring at the text looking for typos. (I had other playtesters, of course . . .) It got to the point where I was looking for (logic) bugs (I also did the coding for this game using StoryNexus’s platform) and stopped actually reading the text because when you draw the same card three hands in a row, it gets old real fast. There was probably a point where I had most of the content memorized. I was greatly relieved to hand the project in and stop playtesting because that feeling of going cross-eyed was not fun. I can only hope the experience was more fun for people who played the game . . .\nHow has your video game writing informed your non-video game work, if it has?\nSeth Dickinson: I learned a lot from game writing. Some simple skills, not always mandatory, but good to understand—brevity, economy of effect, a mind for the cognitive capacity of a reader who’s probably either deep in trance or very distracted. That came from figuring out how to write in a way appropriate to games.\nBut I think I stole a couple bigger ideas from games, too. One is the magic of skyboxes. If you surround the theater of action with hints of distant, marvelous things, you can create a sense of awe. Another is the idea of a tight, satisfying action loop—here’s a problem, here’s a set of skills, I apply the skills, I solve the problem, I check out what new problem emerges. Players and readers both love to feel like they’re gradually discovering things! I did a lot of work on The Traitor Baru Cormorant trying to create that cycle on a sentence-by-sentence and chapter-by-chapter level.\nI like the idea of a reader gripping the logic of a story, then using that logic to understand and feel what happens next. In a game the logic might be “stay near cover” or “do spectacular things.” In a story it might be “place your trust carefully” or “love shouldn’t silence you.”\nOn Baru I tried to organize the world’s peoples and politics in a vibrant, colorful way that lets readers imagine a game board with elegant rules. On a story I’m shopping around right now I tried breaking the narrative into three threads, then adding a little progress header on each thread—so a scene in the Nagari thread might open with “Nagari 4/6.” I know players love making little numbers get bigger. Maybe I can create some of that sense of satisfaction and progress? Maybe I risk leaning too heavily on an extrinsic reward, instead of the intrinsic joy of the story.\nYoon Ha Lee: Honestly, I’m not sure. I do remember the one big lesson I got from video game writing, which is that players take things really personally in a way that readers don’t always, due to the issue of agency. In Winterstrike I have an NPC that is an agent of entropy (actually an alien life form) and while I had some players that loved it, I also had one player come to my blog and let me know in no uncertain terms that it was not fair to set them up with a cute pet that turned out to be a death-dealing alien of DOOM. In static (non-game) fiction, I can get away with more terrible acts/constructions in the sense that the reader doesn’t have to type in KILL BABY for the game to proceed, which people find upsetting. I am thinking of a particular text game from IFComp 2010, Jason McIntosh’s The Warbler’s Nest. It’s a good game, but there’s this point at which you-the-player have a choice to treat a baby as a changeling and kill it, and it infuriated me when it looked like I might have to do that to proceed. On the other hand, I can read from the viewpoints of rapists and serial killers without batting an eyelash because I’m not being asked to “perform” the act as the reader, just to be carried along by the narrative.\nKarl Schroeder: Writing for Destiny has reminded me that the writer is a tour guide to the reader’s imagination, not to their own. It’s the reader (or player) who actually has the experience you’re trying to create; your job is to help them have that experience, not to have it for them. To put it yet another way, we’re midwives. So there’s this balance between what you say (and show) and what you leave to the imagination that’s absolutely critical to get right. If you over-tell, over-show, and over-explain, you drain the life out of the experience for the reader or player. It’s better to simply point and let them use their imaginations to fill in the details. I think this is what Seth means by skyboxes: underdetermined spaces are not laziness, they’re a gift to the reader/player’s imagination, and properly done they can vastly expand the dimensions of the experience.\nIn writing this translates to being economical, spare, even. Baroque detail is fun for its own sake, but two or three choice details can do the same work, or even more. The real ‘game engine’ in literature is the reader’s imagination.\nRobert Reed: Two benefits come to mind:\nWith Bungie, one of my jobs has been writing tiny stories that might or might not be buried inside Destiny today. (Not everything makes the cut.) It’s an education, trying to make every word carry a heavy knapsack. Can I drop that “that”? Can I squeeze two insults into one pithy phrase? And how do you end the scene that has barely begun? When you find yourself pining for the days of fat, thousand-word epics, you know you’re working in new ways.\nThe other benefit has been more direct. I’m planning a sequel to my Great Ship novels, The Memory of Sky. What I’m building—only in my head so far—is a joyful, hyperviolent landscape where nobody truly dies and most of the citizens are nearly immortal children.\nNow what game does that sound like?\nAlso, I should point out that while playing Destiny, I’ve been writing stories set in the Destiny universe. Nobody has asked for this. My head does what it needs to do, applying knowing voices and twisted plots to the very beautiful mayhem.\nE. Lily Yu: “Daedalum, the Devil’s Wheel” came directly from conversations with an animator. Besides that, game writing taught me the discipline of sitting pen to paper or fingers to keyboard for eight hour stretches and creating at will, as well as the incredible generative potential of talking across disciplines. I’m much more aware of design principles, of the presence of the reader/player, and of the constraints and possibilities of different formats: audio, action, text, mobile, website, controller input, haptic feedback, VR headsets, and so on. And I haven’t done it yet, but writing nonlinear narratives that could be encountered in any order seems like it would translate well into experimental print fiction.\nIf any of your own stories or novels could be made into a video game (with an unlimited budget), which one would you pick, and why?\nKarl Schroeder: A lot of people have told me they’d love to see my Virga books made into a massively multiplayer online environment. It would be a zero-gravity steampunk mix of pirate adventure and Homeworld-style fleet engagement, No Man’s Sky exploration, with a little bit of Thief and other RPG elements thrown in. Who wouldn’t want to fly around a boundless, weightless shirtsleeve environment on a wingless jet engine with handlebars and a saddle? Circle forested asteroids or dive into spherical lakes? Have sword fights in freefall? Dance in micro-g? Or coordinate an armada of wooden prop-driven warships festooned with cannons? The possibilities are endless and I really hope somebody makes it.\nRobert Reed: A digital version of my Great Ship, complete with Marrow boiling at the core. That’s what I want to walk through. Strong visuals. A sense of claustrophobia and Deep Time. Think of the upcoming No Man’s Sky, but the action takes place on and inside one Uranus-sized starship, and there are thousands of alien species in residence, and you’re one of the captains who has to keep a lid on every beast and religion and goofball political force that comes across your dragonblood desk.\nMake me an offer. The Ship is for sale.\nYoon Ha Lee: I love reading up on game design (both tabletop and videogame) and I’m keenly aware that differences in media, as well as technological difficulties in generating NPC AI, would make a straight-up adaptation hard. That being said, I would be curious to see an RTS or turn-based strategy take on the world of “The Battle of Candle Arc,” which is also the world of my forthcoming novel Ninefox Gambit. I used computer games as one of the models for the space opera “magic” combat in that system, so it might be workable, and the formation effects could be pretty.\nSeth Dickinson: Oh man! Blue Planet was a game first, a fan-made sequel to the cult classic FreeSpace 2. That turned into “Morrigan in the Sunglare” here in Clarkesworld. I guess it’d be interesting to see that turned back into a game again, a full-fledged production—but you said an unlimited budget, and having a lot of money can be really confining. I’m not sure we could take risks and experiment if we were worried about making back our investment.\nThe thing about games is that the player can choose how to explore the story. You can leave as much esoterica, exposition, and emotional perspective lying around as you like, and you can trust your player to chase it if they want. That’s not like standard prose, where you have to be very careful about your linear architecture. And games can implicate the player in their own events (like Spec Ops: The Line). I think good game stories do something with that.\nI’d love to see a game for Robert Reed’s Marrow and Yoon Ha Lee’s “Flower, Mercy, Needle, Chain” in which you’d have to select your targets very carefully—maybe you could even set up asymmetrical competitive multiplayer, with each player issued a different one of Arighan’s weapons and an objective. It’d be a system-driven game, which is the best kind.\nI guess I’ll confess that I’d love to see a social board game for The Traitor Baru Cormorant, something like Archipelago or the Battlestar Galactica game, in which players have to superficially cooperate to manage the world while secretly pursuing their own agendas.\nE. Lily Yu: Ha, fun question, but no way. If I were making a video game on my own, it would have a dynamic pronged narrative that evolved in response to player choices, lots of environmental storytelling, and unexpected flips of player expectations that don’t exist in print. I don’t think anything I’ve published would work.\nAlvaro is the co-author, with Robert Silverberg, of When the Blue Shift Comes, which received a starred review from Library Journal. Alvaro's short fiction and poetry have appeared or are forthcoming in Analog, Nature, Galaxy's Edge, Apex and other venues, and Alvaro was nominated for the 2013 Rhysling Award. Alvaro's reviews, critical essays and interviews have appeared in The Los Angeles Review of Books, Strange Horizons, SF Signal, The New York Review of Science Fiction, Foundation, and other markets. Alvaro currently edits the blog for Locus."}