{"fingerprint": "VlDjMYokTAKJNWoD5XsMULznnak=", "sitename": "Clarkesworld Magazine", "title": "The Sun from Both Sides by R.S.A. Garcia", "author": "R S A Garcia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/garcia_05_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Sun from Both Sides by R.S.A. Garcia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "16460 words, novelette\n The Sun from Both Sides\n Once, a woman loved a man, and a man loved a woman.\n They lived in a forest, in a small stone-gray hut, set far enough back from a river to escape the seasonal floods. Every day, they woke on a too-soft mattress and turned their faces to each other before they opened their eyes. Her smile would curve her lips as she lay her hand on his cheek, and he would sigh and nuzzle her palm.\n Then they would roll away and sit up on either side of the low bed and push their feet into their shoes.\n Days were short and cool, or long and hot, but there was always something to do. Firewood to chop, the roof to repair, a garden to tend. They carried out their chores accompanied by his tuneless humming, and when she looked at him, he always knew. They would pause, gazes locked as they took a breath, hands wiping sweaty foreheads, or resting on bent knees, before they both went back to what they were doing.\n Nights were for dinner, and fireside reading, and sitting with their shoulders touching on the wooden swing-bench outside the creaky front door as they stared up at the patches of sky visible between the swaying branches. He would use his legs to push them back and forth slowly while she sat with her knees drawn up. Sometimes she let her head rest against his neck, and sometimes he put his head in her lap. Other times, he would play his flute while she lay her hand on his chest and her head on his shoulder. If she fell asleep, he would carry her inside without waking her.\n When they fought, with air sucked through teeth, hands on hips, and narrowed eyes, it was usually over small things, like whose turn it was to clean up. But they made up quickly, with soft kisses, fingers interlaced as they walked, and bodies entwined at night.\n Whatever surplus food they had, he would go into Town to sell or trade, and she would take that time to clear the traps, or fish, and then make something special for when he came home. She would swim in the river then sit on their bench, waiting for him to come down the path alongside the house, whistling to himself. Her skin would tingle like a young girl’s when he climbed the two shallow stone steps, stamped the dirt from his feet before he stepped onto the wooden porch, and looked down at her from under the brim of his battered hat.\n Home again, husband? she would ask.\n He would smile and say, Home again, wife. Tired of me yet?\n Not yet. Maybe tomorrow.\n She would stand and they would link arms and go inside together.\n This happened many times, the quiet pattern of their lives wearing pleasurable grooves into their time together, until the day came when she kissed him goodbye, went for a swim, made a stew, and waited for a return that did not come.\n That night was wind and rain and thunder and lightning, and she sat with the front door open and the lamp lit, staring into the darkness. The river roared, and the trees whipped, and the house grew too cold for the fire to warm, but she did not shiver, and she did not move. Morning met her still in the chair across from the door. When the rain became irregular drips on the roof and graying light softened the lamp’s glow, she woke with a start from a light doze.\n She cast her gaze over the undisturbed room, and stood with stiff legs, her hands going to the small of her back as she stretched out the kinks.\n All right then, she thought. There was the slightest tremor in her fingers as she put out the lamp. Then she walked out the door and through the forest until she reached the main road into Town.\n Her boots sank into the mud with every step, the air fresh and clean and cold, scoring her tight chest with every breath. Early morning light glimmered on the puddles she passed.\n He’s fine. She repeated this mantra in rhythm with her heart. He’s safe. He’s fine. He’s safe.\n She told herself it was the storm. He’d taken shelter somewhere overnight and now the rain had passed, she’d meet him on the road, empty sack under his arm, and he’d shake his head when he saw her and smile and call her a worrywart.\n He’s fine. It was just the storm.\n But her stomach buzzed with a familiar energy and her skin prickled, and all she could think was it had finally happened, and she hadn’t been there.\n A long hour later, the red peak of the church belfry came into view between the trees. There was a scorch mark on it, and the bell had crashed through the stone arch and the roof. The wind shifted as she passed the sign that welcomed travelers and she smelled acrid smoke and mud, and beneath that, something thick and coppery and nauseating.\n Her pulse quickened. She closed her eyes, letting the scent she knew so well flow over and through her. Then her heart settled into a calm, steady beat and she opened her eyes and strode into Town, her gaze scanning the wide plaza and every building and side street that lead off it.\n She ignored the crushed and splintered homes and the smoking piles of debris that used to be walls, windows, roofs. She stepped over the bodies and the weeping people huddled near them and crouched in doorways. She walked past those few searching the collapsed dwellings for survivors and headed straight for the market. Only when she reached the blasted hole in the ground that used to be the heart of Town did she stop, her nostrils burning, her hands clenched at her sides. An old man was ministering to someone on the front stoop of a building across from the marketplace. She looked down at him and recognized the Town’s only doctor, a man she knew well. He’d helped care for her when she first arrived, years ago.\n “My husband?” she signed.\n Weariness and sorrow made his watery blue eyes dull. His bloodied fingers sketched brief movements. “Gone. With the others.”\n She looked back at the market and her hands trembled as she pointed. “There?”\n The doctor rose to his feet, giving up on the man he’d been trying to save. She turned her head and watched his throat work as he struggled for speech, read his lips.\n “Taken,” he said. Then he signed, “Slavers.”\n Relief made her expel a breath while rage sent tension singing through her entire body. It was slavers.\n Not them. He’s alive. For now.\n But there was a clock on her options and it had been ticking down for some time.\n “How long?”\n “They waited out the storm. Two . . . three hours? We’ve sent for help, but . . . ”\n “Which way?”\n The doctor shook his head and held out a trembling hand. “No. Wait for help.”\n The nearest Base was three days travel. That’s why they’d come this far out. No one would get there in time to stop them. “Which way?”\n The hand descended on her forearm, gripped her sleeve. She read his lips as he spoke. “You can’t go by yourself. If you go, you die, or they take you too. Do you understand?”\n She glanced back up at him and whatever he saw in her face made him release her arm. His mouth opened then closed and a frown carved a deep groove between his brows. She searched the tumult of her mind for something appropriate to say.\n “Alright. I understand.” She paused. “Which way?”\n There was a larger settlement to the east. One she hadn’t seen since she’d first come to this place. The slavers had gone in that direction, and she knew they would strip that town of every healthy person they could find. The weather was glorious today, and it was the last settlement in the Eastern Lands. They would leave once they were done. She had hours at most.\n As she strode out of town, she tapped a command against the underside of her wrist. Wake, Sister.\n Under the brown of her skin, a white pinpoint of light flickered into being between the forked veins of her right wrist.\n In her mind’s eye, she saw the dark dankness of the root cellar her husband had enlarged after her arrival. Saw past the rows of barrels and shelves of vegetables and preserves to where shadows wreathed the back. They would shiver away at her word, the cloaking revealing the silver dart of her solo-ship, the cockpit nose flowering open.\n Drone.\n A translucent mass would float free of the cockpit, unfurling rippling ribbonlike appendages, the center of it a pulsing yellow light.\n Find and report.\n The light would disappear as the ribbons twisted in on themselves and made a tight ball, smaller than her fist. Colorless and silent, it would burst through the doors, up and out of the cellar.\n Come, Sister.\n She began to jog, blood rushing through her veins, her body pumping adrenaline.\n Some minutes later, the ground vibrated beneath her feet and the hair on her arms stood on end. Sister kept pace with her until she came to a clearing large enough to land, then descended and de-cloaked, waiting.\n Suit, she tapped.\n There was a hiss as a storage compartment behind the cockpit opened. She reached in and drew out her old armor, silver-gray, just like her ship. Her fingers touched the mended area low on the left side, in the crease between the chest plate and the leggings. She closed her eyes, remembering the white-hot pain of being pinned, red washing over her vision as Sister’s alarm systems cascaded into full auto-repair shutdown, the chilly certainty of death as the cockpit failed to seal around the branch that impaled her, and blood-tinged water rose rapidly to her chest.\n Remembering him, bending into the cockpit, hair plastered to his head from the water he swam through to reach her crashed ship, long brown fingers, callused and scarred, reaching down to help her.\n She stripped off her clothes and put on her armor, her lips a tight line, her nostrils flared. The drone returned as she activated her faceplate. It floated down onto her wrist and wrapped itself along her forearm. She started the Kinnec to see what it had seen. Sister’s displays crowded her periphery vision, but she focused on the tracking and reconnaissance stream.\n He was alive, his tracker a pulsing marker in a complex schematic the drone had uploaded. Her chest heaved with a quick breath, and she got into the cockpit as she scanned the rest of the feed.\n It took a quarter of an hour at top speed before she saw her first sign of the slaver’s passage—a smoking village, a burned landing circle—and she raced past with only a cursory look. Sister lost contact with his tracker just as the hub on her arm began to vibrate. Her throat grew tight as she reduced speed and swung north, dropping down close to the treetops.\n He’s fine. He has to be. She landed on the mountain slope behind the settlement, near the tree line and out of sight of the slaver ship. She kept the Kinnec up in her vision and half ran, half slid down the slope to the field below.\n Six armed catchers stood guard around the loading bay doors, leaning on their weapons, or standing with them slung over their limbs. She ignored the bright blossoms of weapons’ fire in the town on her right, leaving Sister to catalog all hostiles as she strode toward the entrance ramp. When they saw her, she stopped and retracted her hood, waiting as two of them turned their weapons on her.\n “Who the fuck are you?” scrolled across her vision. Good. The translator knew their language. There was no time to waste.\n She thought her answer and the Kinnec translated it into speech that rumbled against her flesh as it projected it out of the suit’s speakers. The words flashed in the bottom of her vision. ^I’ve come for my husband.^\n The guards looked at each other. One of those standing on the ramp threw his head back, laughing. The rest looked blank. Perhaps she had used the wrong language. She checked her settings, but they were error free.\n ^I wish to speak with your Captain,^ she tried again.\n “No one cares what you want, least of all the Captain.” The Kinnec dropped a blinking triangular denoter over the speaker, the slaver who had laughed. “But cargo is always welcome. She’s not armed. Looks healthy enough. Take her in.”\n She didn’t struggle as they came alongside her and grabbed her arms. They marched her up the ramp into the bay, mag-boots shaking the metal floor. She stopped as soon as they were out of sight of the entrance ramp, pulling against their hold. One of them tripped and landed against the metal bulkhead. The denoter appeared above the slaver and curses scrolled across her vision before the one that was upright struck her across her face. “Keep moving. You’re almost past your prime, not worth much if they can’t fix you. The Captain’s welcome to take you out of my wages if you give us any trouble.”\n She licked the bit of flesh her teeth had cut out of the inside of her mouth. Copper and salt stung her tongue as she tapped her wrist.\n Two ribbons unsnapped from her arm and whipped themselves around the slavers’ necks. They tightened lovingly, thin bands of translucence. The slavers stood straight and still under the drone’s control, eyes unblinking. Pacified.\n ^Take me to the Captain.^\n They turned down a T-junction, and she followed. This was a Consortium slaver. Their slave berths were controlled from the bridge, the cargo secured by the Captain’s command only. Crew and cargo could form no alliances, and problems could be dealt with as easily as jettisoning a berth. The crew members the drone controlled incapacitated the two guards outside the bridge, so the Captain and First Mate were alone when she entered the bridge. The First Mate turned from conversation with the Captain as the door irised open, words giving way to silence and a frown.\n Drone. Sentry. The slavers behind her turned toward the empty corridor, standing guard over their unconscious brethren.\n She stepped forward, her heart sinking as she took in the Captain. There will be no bargaining with this one. Still, she had to try. It was only fair.\n ^I will offer you one chance,^ her suit intoned. ^Open your cargo hold, give me my husband, and you and your crew can go in peace.^\n The First Mate stared at her with narrowed eyes. The Captain’s head tilted a little in her direction.\n “Who let you in here?” the denoter blinked to life over the First Mate.\n ^You acted in ignorance. I’m willing to forgive that. This does not have to end badly.^\n The Captain’s vaguely humanoid shape shifted in its berth as it flexed a metallic limb inserted into one of the many glowing ports surrounding it. A ripple flowed across its blank bronze face as it turned toward her, a flower following the sun’s path. Speech unscrolled beneath the denoter. “Remove this creature to the hold.”\n She met the First Mate’s gaze. ^To be clear, you refuse to give me my husband?^\n For an answer, the First Mate raised a hand toward her and the hairs on her arms rose in a telltale response. Her fingers tapped twice. Shield.\n The blast from the weapon built into the First Mate’s wrist was absorbed by her suit, leaving behind little more than a momentary flash and a tingling sensation.\n She sighed. All right then.\n The First Mate lunged at her.\n Sister. Control and Command. End all transmissions.\n She sidestepped, bending backward, almost parallel to the floor as a fist swung at her. She grabbed the arm, coming upright even as she yanked downward. The First Mate crashed into the steel deck, and a swift kick to the head with her reinforced boot did the rest.\n A ribbon detached itself from her arm and darted into a port. The Captain tried to insert one of its appendages into the hub, but a spark and a snap made it withdraw.\n “You are resisting. You are trouble. You will not be cargo,” it said as she stood in front of it. Her vision flashed a red atmosphere warning before her hood slid over her head and sealed itself. Stale air filled her nostrils.\n Her patience evaporated. Anger made her breath come fast and her skin grow cold. ^Yes, I am trouble. And no, I will not be cargo.^\n Notifications slipped past. *Bridge atmosphere incompatible with biological life. Adjusting.*\n The First Mate’s heels drummed against the floor as the toxin took hold. They stopped moving before a new series of notifications appeared. *Emitters adjusted. Transmissions blocked. Recalibrating ship’s systems for sibling compatibility.*\n ^You should have taken my offer.^\n The Captain rose from its perch, releasing dozens of slender limbs.\n ^You’re no ordinary Captain,^ she said. ^You’re a secondary shell. I’ve seen Plantation Class AIs like you before. I know the Consortium you hunt for.^\n “Many know the Consortium,” it said. Its face rippled as a maw yawned open. “Those that know of it, also know fear.”\n The projectiles it fired glanced off her armor, and she leapt out of the way as it attempted to grab her. Her boots activated, latching onto the side of the bulkhead. The Captain withdrew into itself, losing its humanoid shape for a few seconds before splitting into two blobs that grew limbs and sharp edges.\n She amused herself by carving some of them off with the tiny lasers in her gloves before dancing out of the way and onto the ceiling as the blobs divided yet again. Two stretched upward to meet her. Two more flowed up the bulkheads on opposite sides of the bridge, reforming into something she didn’t immediately recognize.\n *Recalibration at 75%. Alarm systems disengaged. Defense systems disengaged. Disabling shell motor functions.*\n ^The Consortium knows fear too.^ One of the polyforms beneath her collapsed. Another froze on its way across the ceiling toward her, its surface undulating like storm-tossed water.\n ^Search your records.^ She stepped onto the bridge’s dark viewscreen, crouched down and extended a flat, open palm. Her people’s red, white, and black emblem glowed into life above it. ^You should find me there. Find us.^\n “You are Kairi.” The Captain’s shell paused, its attention almost fully engaged by the battle to retain control of the ship, but Sister was relentless, disabling code and recalibrating every system. “Not possible. This backwater is no Kairi protectorate.”\n *Recalibration at 90%.*\n Another polyform collapsed, electrical sparks arcing as it dripped in a slow column from the ceiling to the floor.\n ^I’m retired,^ she said. ^And you violated my home. Took my husband.^\n “Primarch—”\n ^I gave you a chance.^ She rose to her feet, studying the results of Sister’s data mining.\n Trapped in the quarantined section of the slaver’s databases, the Captain continued to fight Sister’s incursion, but his Plantation class cruiser was no match for Sister’s Havoc class brain. The reforming code was deleted as soon as it appeared, fireworks blinking out in the night sky. “The Consortium does not negotiate. This planet was unclaimed territory. If you take the cargo, we will petition for its release, and we will win.”\n ^Always focused on the rules. But they are your rules. Not ours.^ She glared at the polyform as one side of it began to list, sharp edges rounding and slipping. ^This planet was already claimed by those living on it. And I’ve found your primary brain. It’s in orbit, awaiting your return.^\n *Recalibration complete. All systems ready.*\n “Then you know if you harm this ship, it will strafe these settlements. Crews are replaceable. Cargo is everywhere.”\n She stepped off the viewscreen, anger making her fingers fly as her suit translated. ^You believe you can take what you want without consequence. Even now, you comfort yourself that I am one woman, one Primarch, against a cruiser and all it carries.^\n Sister. Amend starlogs on Plantation class cruiser. Delete all references to current position. Amend transponder location to new position at least two systems distant.\n “Because you are one Primarch against a Consortium cruiser.” The Captain was now a featureless glistening blob. “Should you defeat me today, the Consortium will simply return for its cargo at another time.”\n *Tasks complete. Awaiting further instructions.*\n ^Then you have no true understanding of my people.^ Combat mode.\n The green wash of the ready light filtered down her vision. Her arm vibrated with Sister’s response.\n ^We don’t allow others to take without consent. And we are never alone. Tell me, captain, when did you last speak with your primary brain, waiting on its cruiser with its crew . . . and no cargo in its hold?^\n Sister, execute Cleanslate Protocol. Extreme prejudice.\n As the Captain collapsed into liquid, sparking deactivation, the bridge sank into darkness. Around her, the ship shivered in the wake of explosions and energy blasts. The drone’s filaments detached itself from the dead crew members outside, who had been poisoned along with the First Mate, and returned to the Kinnec hub in her arm. Sister activated the emergency lighting and she followed the ship schematics to the cargo hold.\n No one had been loaded into the berths yet. The crew would have been waiting to put them all under at the same time. Two separate groups had been divided into two large bays, each protected by an energy field. One group was mag-cuffed to the bulkheads, but some in the second group had gotten free and were trying to help others out of their restraints. They all stared as she appeared. Then prisoners in the second group were shoved aside, one after the other, as someone pushed to the front.\n Sister. Release restraints. Open bays.\n She retracted her hood and stepped into the bay. She pulled him into her arms and closed her eyes as she inhaled sweat and blood and smoke and him. He took her face between his palms as she signed, her thoughts too emotional and disordered for the translator.\n “Did they hurt you?”\n He shook his head and she read his lips. “I’m good. Are you?”\n She nodded. “Never better.”\n He smiled and leaned his forehead against hers. She stayed that way for a moment before leaning back to sign. “You’ve been busy.”\n He winced as she took his left wrist between her fingers. He had dug his implant from it and used the overload feature to disable his mag-cuffs, shorting out his tracker. A dirty rag covered the bloody wound above a glittering 3-D geometric tattoo. His fingernails were torn and bleeding. She shook her head as she touched a hand to his bruised eye and bloodied lip. Her suit chided, ^There was no need for this.^\n “The accommodations were less than satisfactory. I thought relocation was in order.”\n She couldn’t hold back her smile. “What a coincidence. That’s why I’m here.”\n By the time they left the ship, Sister had completely withdrawn from it, leaving only a darkened husk of machinery behind, devoid of intellect and power. The first fragments of the orbiting cruiser were burning up as they entered the atmosphere above them. Surprise and shock rippled through the escaped captives as they saw the dead slavers outside the ship. Those that were uninjured rushed forward to meet the survivors in the town. Several of them embraced, faces contorting as tears flowed.\n “Maybe we should fly our people home,” her husband signed as they stood at the bottom of the ramp, arms around one another’s waists. He was limping but trying to hide it.\n ^I destroyed the Captain. Ship’s not going anywhere. They’ll have to go to the nearest transport hub and find their own way.^\n He studied her face. “Not just the Captain, I take it?”\n She shot him a defensive look. ^I did what you would have wanted. I asked nicely. They wouldn’t give you back.^\n A finger tilted her chin upward and his dark eyes met hers. “Sure you’re okay? You must have been worried . . . ”\n She grasped his fingers, stilled their movement. “It wasn’t them. That’s all that matters.”\n “You were retired.”\n “So were you. I’ll live.”\n They walked toward the mountain, watching Sister descend from orbit, her mission completed. He stopped and faced her.\n “I’m not getting in without you.”\n “You’re injured.” The drone floated up from the hub on her arm. “She’ll take care of you on the way back. There’s stew. Make sure to get some sleep.”\n “It’s too far to walk. Come with me.”\n She put her hands on her hips, her eyes narrowed. ^Don’t make me sedate you.^\n He pursed his lips and argued some more, but in the end, she let him hold her then handed him over to Sister, who left a drone behind to see her home.\n After Sister left and most of the crowd was gone, she leaned against the hull of the slaver and cried until her legs slipped out from under her and she sat on the ground, shoulders shaking. Her hands clenched and unclenched, her heart raced, and her skin prickled as she came down from the battle high.\n It wasn’t Valencia. Only slavers. They didn’t take him.\n She sat just breathing for a while as the adrenalin flowed out of her, the tears dried, and her body stopped shaking. The drone settled over her arm, its grip comforting as she stood up and turned for the road.\n It was a long way home and she took her time. It was late afternoon when she returned to the forest and the path beside their house.\n He was leaning against the doorway, legs crossed at the ankles, arms folded across his bare chest. A strip of synthskin circled his wrist and his bruises were purpling. She paused at the top of the steps and just took him in.\n “Home again, wife?” he signed.\n She smiled. “Home again, husband. Tired of me yet?”\n “Not yet.” His split lip stretched into a slight smile. “Not ever.”\n They linked arms and went inside.\n Once, a man left his home to find his home.\n It was not an easy journey, but going home never is.\n He gave up all that he was, and all he knew, to experience a great many things. Genuine smiles and thoughtless malice. Shared purpose and individual failure.\n And one bright day, in the middle of a river, he found peace. The first true peace in his long life. He learned that a home could be shared, and that in finding his home, he’d become another’s. That was more than enough to bury the fears and chase away the memories. More than enough to keep the world and its cares far, far away.\n Until the day he came home, and the world was sitting at their table, brushing invisible dust from white diaphanous trousers with immaculately trimmed and painted fingers. The Knight rose from the wooden chair it had been seated on, the smooth white surface of its full-mask catching the evening light. A pinhole speaker made a glowing blue circle in the center of the lower half of the mask, and tinted slits hid the Knight’s eyes.\n He froze in the doorway, instinctively putting out a hand to keep his wife from going past him into the house. Eva halted against his outstretched arm, her body rigid as she dropped the bag of paw-paw they’d collected during their walk on the swing-bench.\n He glanced at her, but she was focused on the Knight, her brown eyes narrowed. Her soft, springy hair was an unbound halo around her face. He had been planning to help her wash and dry it by the fire. Heart thumping in his chest, he thought on all his plans for that day, and the next, and the next. Pointless now, like crystal smashed against the floor.\n I’m sorry, he thought, willing her to look at him. She met his gaze as if she could sense his thoughts. I’m sorry I was right. I should have known they’d come when we least expected it.\n In front of them, the Knight took a step forward, extended one leg, and swept a bow over it. The voice that issued from the speaker was light, conversational—the voice of a friend coming upon another old friend after a long while.\n The sound of it grated on his ears like a scream.\n “Grandmaster Didecus Avnette Valentino Lucochin, you are called to the Greatwood for the annual Opening of the Term at Valencia.”\n She tapped his arm and when she had his attention, made a few curt moves with her fingers. “Let me deal with it.”\n He shook his head.\n Her eyes widened as she signed again. “Turn around. Walk away.”\n He took her hand in his instead, weaving their fingers together. Valencians had their own sign language, which most Septholds used to communicate silently and frustrate eavesdroppers. It was very similar to hers; a lucky thing on the day they’d met, but not so lucky now. The Knight could know what she was saying.\n He faced the Knight. “How did you find me?”\n “Your implant.”\n He frowned. “It was . . . removed more than a year ago.” He had a new one Sister had printed for him, and only his wife could track.\n “It was designed to ping its final location at the moment of its destruction, so the Grandmaster’s death would be recorded in the Greatwood.”\n Only one person would have cared to know the moment of his death—the same person who’d made sure the implant was reprogrammed from its original purpose as a weapon that would kill him if he ever crossed into his planet’s atmosphere.\n “I was exiled from Valencia and may not return,” he said, pleased his voice was calm when he’d been caught so completely offguard. Which was their intent, of course. He put aside the thought and the cold anger it brought with it. “I must decline the invitation.”\n “Not an invitation.” The Knight’s hand rested lightly on the black cylinder clipped to the utility belt on its waist—a retractable energy spear. A full-color reproduction of its Grandmaster’s geometric crest was tattooed on its bare shoulder. “A summons. Queenside.”\n She flattened a palm against his cheek and turned his face to her. A frown creased her forehead and he saw the question in her eyes. The mask prevented her from reading lips and the pinhole speaker limited vibrations. She could only follow what he said. He had no doubt she sensed his inner turmoil; his fingers gripped hers tighter than they should. He released them.\n “I am no longer the Lucochin,” he said, his voice harsher than he intended. “My King is dead. I have no Queen.”\n “A glorious miracle, Grandmaster. As happened with you, many tempi ago, there has been a promotion. A new Queen summons you.”\n By the fucking Graces. Fuck them all to hell and back.\n He forced out, “Who?”\n “I’ve been instructed only to bring you to Valencia with all haste. Questions must wait until we return to the Greatwood.”\n “When then? How many tempi ago did it happen?”\n “Forty, Grandmaster.”\n So many tempi since he’d left Valencia. To go back now would be madness. A death warrant.\n “I no longer have a seedling. The Vineyard would reject me.”\n The Knight plucked at its belt and held its hands out to reveal the jeweled speck of a Coretree’s seed in the center of one palm.\n He closed his eyes, expelling a heavy breath. Turning his back to the Knight so his wife could read his lips, he said, “I have to go, Eva.”\n The determination in her eyes spoke to him before she shook her head.\n “If I don’t, they’ll send Pawns. Pawns that won’t care who they hurt, or what they must do to carry out their Grandmaster’s commands. At least I can reason with a Knight. If I allow it to complete its move, it won’t harm you or anyone else.”\n Her eyes widened as she divined his intent. “No. We discussed this.” She hit him in the chest with a closed fist. He grabbed it, held it against him.\n “That was before so much time passed. It’s been too long since I was last home. Everything will have changed. I will have no allies.”\n He didn’t tell her what he feared most. That his only ally must be dead, or the Knight would not be there.\n She pulled her hand away. “Try to leave without me. See how far you get.”\n He gave her an exasperated sigh. She arched her eyebrows at him.\n After a long hesitation, he said, “I need time to prepare,” to the Knight without looking at it. He wanted her to see what he was saying. She nodded once, her lips a compressed line of triumph.\n “Those are not my instructions.”\n “I am Grandmaster Lucochin and I survived the Great Game more tempi than you’ve been in service. You will give me what I ask.” He faced the Knight. “And you will prepare a seedling for my wife.”\n The Knight took a step forward. “You wish to bring your wife?”\n “Yes. You came here by the Vineyards, did you not?”\n “Of course.”\n “So you can prepare a seedling.”\n The Knight shifted its masked head ever so slightly in his wife’s direction. “She is not Valencian.”\n “She is Kairi. They were enhanced for interstellar travel, as were our ancestors. She can withstand the seedling, and she goes where she pleases. Take care not to insult her.”\n “Damn right I go where I want,” she added. He fought back a smile.\n “If she doesn’t come, you won’t complete your task.”\n There was no way to tell how the Knight took this news. All he knew was it would inform its Grandmaster and Queen. The arrival of a Primarch—a citizen of the Kairi Protectorate—in Valencia would be unprecedented. And they would know she was coming.\n The Knight bowed. “As you wish, Grandmaster.”\n He circled her shoulders with an arm, pulling her against his side and giving the Knight their backs. So many memories and emotions churned through him at the thought of going back—dread and adrenaline made him tense. But he couldn’t deny part of him breathed easier knowing she would be with him. Knowing whatever happened, he wouldn’t be alone in the nest of vipers that was the Greatwood.\n And he was not unprepared. He’d planned for this long before he met her.\n “Are you sure?” he asked her.\n She rolled her eyes at his question. “I’ll send a message to Sister. She’s gone adventuring.”\n “They may not allow her through the Vineyards.”\n She grinned, tilted her head at him. “They’re welcome to try and stop her.”\n Sister came, of course. Her primary consciousness had been traveling the Kairi networks, fighting far-off skirmishes in myriad shells, or visiting new planets with diplomats and explorers, but she returned in time, curious to see a ship and a world few had ever been invited to visit.\n The Vineyard ship had been in orbit for several weeks while the Knight searched. The decision to live simply had been about not needing more than food, shelter, and freedom to be content, and—once he’d met his wife—happy. But he had also considered the day his people might come looking.\n In the end, all his caution had been in vain.\n Sister followed on her own as they traveled to the Vineyard with the Knight in its much larger drop-ship. She landed on the polished, weathered deck of the Vineyard’s cargo hold as they disembarked behind the Knight, holding hands loosely.\n His wife squeezed his fingers to get his attention before signing, “Smells wonderful.”\n “It’s the Vineyard,” he explained. “The ship is grown around it to infuse it with the vine’s atoms. It gets into every part of the vessel and flowers. Even when they’re not flowering, the mirror Vineyard on Valencia, or other ships, might be, so ships end up smelling like this all the time.”\n They were in the corridors now. Petrified carbon curved under and around them, the same color as his wife’s startlingly light brown eyes, the whorls and rings rippling through the surface a testament to the ship’s advanced age.\n This Vineyard was one of the massive fleet his people maintained to trade and lay seedlings in space to create Arbors, so that ships could travel ever further by navigating from one Arbor or Vineyard to another. No matter how far they explored, all other ships, seedlings, and Arbors, remained permanently entangled with Valencia and each other, allowing Valencians to travel vast distances in an instant and trade reliably with many other colonies.\n Maintaining their ability to use the Coretrees for problem-solving and space travel was the only mandate of the Greatwood and the Grandmasters that ruled it. Without the Coretrees, Valencians would lack even the basics. Their world was far from established routes, discovered by accident when several colony ships were forced to land to make repairs.\n He itched absently at the crook of his arm where the seedling had been implanted as they approached massive doors that stretched ceiling to floor. The panels folded back and air spilled out into the corridor, sweet with the cloying fragrance of the vine within. It was the smell of home and victory and sorrow and pain and every waking moment of his life before his exile.\n He closed his eyes against the rage that tightened his chest and the bile that rose in this throat.\n She gripped his upper arm and leaned her head against it, letting him know she was there. Grateful, he covered her fingers with his and opened his eyes.\n The Vineyard sparkled back at him through a tinted shield. The Knight withdrew masks from alcoves just inside the open doors—standard gray models with red pinhole speakers. Eva accepted one as a courtesy rather than choosing to tint her own hood. When he activated his, it dimmed the Vineyard’s glow to a shimmer, and oxygen rushed into his lungs from the tiny pac built into the mask. They would only need it to breathe for a few seconds, until they crossed into the mirror Vineyard and Valencia’s purer atmosphere.\n “You may be disoriented when you arrive. It’s a stress on the body, the sudden shift, even with the seedlings.”\n She shook her head and gave him a look that said he was fussing for no reason. She donned her mask and signed, “Lead the way.”\n The vines were a shimmering curtain he parted to find his way forward, his wife’s hand firmly in his. He took care where he placed his feet as the smooth floor of the ship was hidden by the ceiling to floor plants.\n The scent of them raised nausea in the back of his throat just as the world seemed to tilt, then right itself again. The surface beneath his feet went from smooth to bumpy, his wife stumbling against his back at the abrupt shift. With no warning, they were pushing through not just glittering vines but knee-high blades of grass. He saw dark shapes ahead of him, against the fall of light that was the vineyard. The pac on his mask switched off, and air flooded into his lungs, heavy with vine-perfume.\n When they broke from the Vineyards, it was in front of a row of opaque panels. He took a deep breath and stilled his wife’s hand as she reached for her mask. “No. Leave it.”\n They walked up to the panels together and he pushed it aside for her to step through first.\n He recognized the room they entered—the high square ceiling, the pale walls and stone floors, the two graceful statues on either side that represented the Navigator and the Captain, the founding colonists of Sept Lucochin.\n He was home, standing outside his own Vineyards. This, he understood with a cold clench in his gut, was not proper etiquette.\n Three knights, holding buzzing, activated spears, surrounded a much shorter figure that stepped toward them. Sheer white cloth danced on the air, so thin he could see slender bare legs and small dark-tipped breasts through it. The Bishop’s full-mask was elaborately painted with the crest of its Grandmaster, two diamonds inside a circle, a twin to the tattoo on a bare upper right arm.\n “Welcome home, Grandmaster Lucochin. You have been missed.” The Bishop’s voice was smooth, light, and monotone.\n “I find that difficult to believe as I was exiled,” he replied. “Let us not waste time. Explain my summons.”\n The Bishop’s mask tilted in his wife’s direction. “And who is this?”\n “My wife, as the Knight would have informed you.”\n “I had no opportunity to speak with the Knight. I have been directed by Grandmaster Kingston to escort you to your rooms.”\n “Kingston?” He frowned, the coldness in his gut now ice. “Why does the Kingston give orders in a Septhold of Valencia?”\n A pitying sigh escaped the pinhole speaker. “My apologies, Grandmaster. You’ve been gone a long time. You could not be expected to know.”\n “Know?” He raised his eyebrows and waited.\n “Sept Lucochin has been dormant for many tempi.”\n He turned his head and his wife met his gaze, but she could not see past the mask to the anguish that made his knees feel unsteady.\n All those people.\n His people.\n Alexandar betrayed me?\n No. It couldn’t be that. Never that.\n “But the Game? Our Game?” he said, desperate not to believe.\n “It ended, shortly after you were exiled,” the Bishop confirmed as though discussing the weather and not the clearing of a Board. The wholesale execution of a Grandmaster’s pieces—Pawns, Knights, Rooks—everyone. “With your return, a new Game has begun.”\n He sat with his head in his hands for the longest while. Long enough for the golden evening outside to turn full dark. He’d thought no day could be harder than the day he’d been forced to leave Valencia knowing that either he would never be back, or worse, that he might one day have to return. But he’d been wrong. So very wrong.\n Eva waited, allowing him his grief even though she couldn’t have fully understood the conversation he’d had with the Bishop. She sat at his feet, her head against his knee, her fingers intertwined with his and never once did she ask a question.\n The lights in their bedchamber brightened as darkness fell. There was only the large carved bed, some chairs, and two doors—one led to the dressing area and one to the baths. He’d refused the services of Sept Kingston’s servants, preferring to let them leave two trays of food on the only table in the room. The rooms had been aired, and the long hallways they walked still had dustnets over the little furniture that remained. Sept Kingston must have been directed by Sept Valencia to prepare for his arrival. With no people on the Lucochin estate, there would have been no one else.\n He was lucky, he supposed, that he hadn’t been imprisoned on arrival, but he knew with certainty that had been deliberate.\n It was a new Game. It would be up to him to figure out the objective. To know which of the many moves he’d planned would be necessary.\n He stared at the gray masks on the table and sighed. She shifted and looked up at him, worry crinkling her eyes. Her free hand squeezed his thigh and he stroked her hair. He spoke aloud so he wouldn’t have to let go of her warm, comforting hand. “I’ll be okay. I just—need time.”\n She leaned her head back on his knee, still looking up at him. “Tell me.”\n He glanced out at the dark estate and the dancing rainbow colors of Valencia’s night sky—the light of the Vineyards reflected into the atmosphere, so beautiful now that he saw it for the first time in many tempi.\n “This is was my estate. They bought us directly here instead of the Greatwood.”\n “That’s bad?”\n “Almost certainly. The Bishop told me the Grandmaster Valencia would speak with me tomorrow. It’s odd Sept Kingston and Sept Valencia would go through all this trouble to find the exiled Grandmaster of a dormant Sept, and yet the new Grandmaster Valencia doesn’t meet with me on arrival.”\n Understanding dawned in her eyes and she took a breath. Freeing her hand, she signed, “Your Valencia. Your Sept. Both gone?”\n He closed his eyes for a moment, too bone-weary and heartsick to even nod. When he opened them, she had tears in hers. “My love, I’m so sorry. You tried. You let them exile you. It’s not your fault.”\n He swallowed, the tightness in his throat and burning in his eyes making him pause to gather himself. “It was my fault we lost the Great Game. I set in motion the events that led to my Sept’s destruction. Sept Lucochin numbered over ten thousand when I left. Ten thousand souls. Executed. Including my King. And the previous Valencia.”\n She knelt between his legs, facing him. “When?”\n “After I left.” His hands faltered and she placed hers on either side of his face and kissed him, her mouth soft, sweet, and fleeting.\n He leaned against the padded headrest and stroked a finger over her lips. “They didn’t deserve that. I played the Game. I thought I’d won.”\n “You traded your life. Left those you loved behind.”\n She kissed the tears on his cheeks, and his lips trembled as he spoke. “I love you. And I don’t deserve you. This . . . happiness. All this time we’ve had with each other—”\n She shook her head fiercely. “No. Don’t do that. It’s not true. We’ll find out what they want, together. Then we leave. Together.”\n He hugged her to him, stroking his hands over the supple armor that covered her back, watching the blinking ready light of the drone on her forearm as her hand lay against his. The Bishop had claimed not to know his wife was with him. Why would the Grandmaster Valencia not mention the arrival of a citizen of the Kairi Protectorate to the Bishop that was sent to meet them? It was disconcerting, yet probably for the best. Eva was not their focus. He needed it to stay that way.\n After a while she raised her head and sat back on her knees. “Should we eat?”\n He signed back. “No. Dangerous until I meet with Grandmaster Valencia tomorrow and know why I’ve been summoned. Hungry?”\n “Not hungry. Tired.”\n They settled on the firm bed with only their boots removed. He knew they weren’t safe. His body prickled with awareness and warning since they’d arrived, and his instincts had kept him alive for many tempi in Valencia. He trusted them enough to know he wouldn’t sleep tonight.\n “You’ll take first watch?” she asked.\n “Yes.”\n “You better wake me.”\n “Of course,” he lied.\n She snorted as he lay down, his chest against her back. She pulled his arm over her waist and he propped his head on his hand, so he could watch her sleep. Several minutes after they lay down, the sensors in the bed lowered the lights in the room and he lay in the dark, thinking, as her breathing evened out and the wind rose outside, the thick walls and windows muffling the sound to the whisper of ghosts.\n *Hibernation mode activated.*\n Sister pinged a query in response to the drone’s abrupt re-tasking and the loss of its live feed. She was engaged with analyzing the Vineyard ship’s primary language and systems. The ship’s technology had originated on Terra, and this shared evolutionary foundation provided her with a key to begin her decryption within an hour. She required almost half her processing power to catalog and flag the most useful information in the enormous database, so she’d delayed her reconnoitering of Valencia until she’d secured enough preliminary data on it to ensure security protocols were met.\n *Hibernation mode in progress.*\n Sister flagged the pingback as unsatisfactory and retrieved another drone to proceed to her Primarch’s location and comm a live feed.\n At that moment, she registered several things at once. The Vineyard ship’s engines powering up. The navigational AI implementing a new course away from her home system. A Stage Four hardware breach of her solo-ship’s security. A localized EMP that sent the unshielded sections of her solo-ship’s power core into temporary shutdown.\n None of these things disrupted her operational focus as much as the sudden silence from her Primach’s location beacon. The drone responded to all pings with the proper hibernation codes, but it remained dark to her emergency activation commands.\n Hidden in the Vineyard ship’s subroutines, Sister studied its live feeds as Knights surrounded her primary shell in the cargo bay, placing clamps on her struts and erecting a dampening field.\n These, she understood, were acts of aggression.\n As bonded AI to the leading Primarch of the Gomez clan—and frontline of any Kairi Primarch’s defense—Sister’s mission was now clear. She would enact Caution Protocol. Secure an operating base, determine the location and safety of her sister and husband, and ensure means by which she could access them and carry out offensive missions, if necessary.\n While the Knights worked on her shell, Sister hid her secondary drone in an alcove on an empty deck. She supplanted the subroutines of several mundane programs across critical decks before disguising herself as a diagnostic tool and slipping into the Vineyard’s primary AI. She would need to find her own seedling. It was clear the Valencians had no intention of giving her one, as promised.\n Her Primarch, like all Kairi, was more than capable of protecting herself, but the Kairi were descended from a small Earth tribe. Every Primarch’s life was precious. She would take nothing for granted.\n \n He is eleven and his grandmother kneels in front of him, smoothing her wrinkled hands down the front of his cream shirt. Her smile is sad, her eyes desperate.\n “You know what you must do,” she says, and he nods.\n “I must enter the Greatwood and pass my Presentation so I can see the real Valencia.”\n She grips his upper arms. “If you’re worthy. If you learn its language.”\n He doesn’t reply because it’s not necessary. He’s heard the same story his entire life. He doesn’t know what language the Greatwood speaks, but he will learn it. He has no choice. His grandmother’s gaunt cheeks speak to the cancer burning through her and his parents are long dead. He will either become Septed or become an orphaned un-Septed. A child with no skill and no caregivers will die in Valencia’s Lesser Games. And he doesn’t want to die.\n She takes his hand and leads him to the entrance of Sept Lucochin’s Audience Room. He joins the line of children his age.\n The room changes around him, expanding as if breathing in, and he stops to look over his shoulder. The Red Door of Failure is open behind him, letting out crying children into the arms of their silent, devastated parents.\n He can see his grandmother standing at the front, watching as a Pawn takes his hand and guides him to the Purple Door of Acceptance. She’s also in tears, but he knows they’re tears of relief.\n He won’t die in the Lesser Games now.\n He’ll never see his grandmother again. Only healthy family members can join the newly Septed in service to the Great Game. Anguish rises in him, knowing she’ll die alone. But he’s studied with his grandmother how to never show his emotions. He relies on that training now, as they close his first mask on his face.\n He is thirty and a Pawn legendary for his ruthlessness. He’s stripped the un-Septed of their homes at the command of his Grandmaster. Put the spear to those who attempt to come too close to his charges. He’s turned away from the food banks those who’ve lost their ranking in the Lesser Games and watched them walk away into certain starvation when trade is slow, and rationing begins.\n He’s done it all while showing none of the rage and despair that fills him at the sight of the waste that continues in Lucochin’s Halls, even when the un-Septed have nothing. The Young Masters eat and drink and play the Great Game they’re born into, and he hovers at the edges.\n Waiting.\n Watching as the Lucochin’s youngest daughter pulls him down with her onto the bed.\n Holding himself separate as she has her fun with him. Remaining passive as she licks his ear behind his mask and says, “If you kill him, we can be like this always.”\n She thinks as they all do. That un-Septed are ignorant.\n Stupid. That they can be easily manipulated by base emotion.\n When she sighs the question, he says yes, and she whispers a date and time for the deed.\n He scrubs himself well before he meets with the Grandmaster, trying to erase the previous hour from his body. Lowers himself to the cold floor and touches his head to the ground, as all do who have bad news to deliver. He’s calm as he explains the plot, though he knows the Grandmaster could choose to have him killed instead of his daughter. He has nothing to lose but his life, and that hasn’t been his since he was a child.\n “You’ve done me a great service,” the Grandmaster says to him as the youngest Lucochin Master rides away in a transport to a hastily arranged marriage. “Name your reward.”\n He’s always known he must become more than he is, so he doesn’t hesitate. “I would be a Rook in your service.”\n The Grandmaster turns cold eyes on him and says, “Why waste such talent at game play? My Bishop is old, and his strategies grow simplistic. Take his place, if you will.”\n They hand him the keys to their Kingdom.\n He will find a way to throw open the gates.\n \n \n The Bishop is buried in pomp and circumstance, and at the graveside he sees his future for the first time. Master Alexandar is blond and grave as a painting in his white half-mask. The only Young Master left alive in the vicious Sept of Valencia—his form straight and strong as a Coretree.\n The thump of his heart as he looks at Alexandar is an unfamiliar rhythm in his chest.\n The Master turns away without seeing him, and he returns to his Sept—a new Bishop with a tiny crack in his façade only he knows is there.\n \n \n He’s seventy and Queen and it’s his wedding day. Grandmaster Yuta congratulates him even as he apologizes for refusing the match he was offered to one of the Grandmaster’s many children.\n “You’ve done well,” Yuta says. “My son would have poisoned you at the first opportunity and taken your post.”\n He knows this, of course. It’s what he would have done.\n He’s pressing his thumb against the contract when the new Grandmaster Valencia, now unmasked, enters to add his DNA to the seal.\n His wife Rachel steps aside and dips low with the elegance of a Master whose family has always been Septed. When he straightens from his own bow, the Grandmaster Valencia is between them and the crack in his façade widens as those blue eyes remain on him, speaking of other things than the polite felicitations the Valencia utters to his face.\n He’s one hundred and three and a Grandmaster, and soft lips touch his under the Coretrees of the Greatwood, sending sharp shocks through his entire body—and the Corevines in his wrists. Alexandar also forgets to remove his Corevines.\n That’s when he finally learns it. The language he’s been searching for his entire life.\n For the first time, he’s unable to hide his discovery—his truth—from his wife. She narrows her eyes at him as he tries to make her understand.\n “You’re a Grandmaster,” she says in a voice that betrays only mild annoyance. Her hair is braided intricately in coils on her head. She’s unmasked, as they often are in private. “Why do you concern yourself with the troubles of the un-Septed? You give them higher rations than they deserve, build them better houses. They’re not grateful for this and you only encourage them to believe they’re entitled to more.”\n “How can you say this,” he says, “when I was one of them?”\n “You are Grandmaster Lucochin, Sire to a Master of Sept Kingston. You are not them. Cease this inappropriate worry over their comfort.”\n “And yet,” he says, “how many of them would be me, if given the chance?”\n “Chances are taken, not given,” she scoffs. “Keep your sympathy for those who work to provide the foundation for all Valencia is and can be.”\n He stares at her, resigned. “You truly don’t care.”\n \n \n “Of course, she doesn’t,” Alexandar says, touching his jaw gently. “She’s your Queen. The latest in a line second only to mine. This is her world. You don’t belong in it.”\n He reaches for that hand, but Alexandar is standing next to the fountain in the middle of Valencia’s Audience Room, staring into the rippling pool. He walks toward him, the fountain pulling away from him with every step, the tinkling of the water a rising susurration.\n “Didecus,” Alexandar says, not looking at him, hands clenching the sides of the basin. “They must see everything. You must show it to them, as you showed it to me.”\n “Alexandar,” he calls over the roaring in his ears, heart pounding, fracturing in his chest. “Wait.”\n Alexandar’s lips open and Rachel’s voice emerges. “They’ll destroy us. They’ll destroy it all.”\n “Alexandar.” He would cry if he could. But this part of him never does. “Forgive me.”\n “Grandmaster Lucochin.”\n \n “Grandmaster Lucochin.”\n He started awake, his hand tightening on something. Someone.\n The Knight hung motionless over him. He had it by the throat, his fingers digging into the soft flesh beneath the golden full-mask and its red speaker.\n A gold mask. A Knight of the Royal Sept Valencia. He released the Knight and it straightened, showing no sign that he had almost throttled it in his sleep.\n His sleep. He’d fallen asleep.\n He looked down at the empty sheets beside him and sucked in a breath. The Knight took a step back as he swung his legs onto the floor.\n “Where is my wife?” he ground out, his voice harsh with sleep and fear.\n “Grandmaster Valencia awaits you in the Audience Room.”\n “Where is my wife?”\n The Knight crossed its arms over bare breasts, the only outward reaction to his inexcusable rudeness.\n “Grandmaster Valencia awaits you,” the Knight repeated. The rainbow colors of the three-dimensional dodecahedron crest of Sept Valencia covered most of its forearm.\n His blood was ice in his veins as he swiftly pulled on his boots. There was no sign Eva had ever been there. Her shoes were gone, the trays of food had been removed and only one mask remained on the table. His heart stuttered when he laid eyes on it, his lungs refusing to draw air. Then he took a breath and let the old calm, the old watchfulness, settle around him.\n For the first time in years, he was the Grandmaster Didecus Avnette Valentino Lucochin, and Sept Valencia and the entire Greatwood was going to be very sorry they’d brought him back.\n He left the mask behind and strode from the room, his mind several moves ahead as the Knight trailed him. He ran down the gentle ramp to the lower floors, toward the public areas at the front of the manse. His boots were muffled on the polished stone floors, so he made sure to push open the doors to the Audience Room hard enough to make them slam against the walls.\n As he strode to the center of the chamber and faced the throne, he saw the sedan chair on one side of the dais—the last piece of the puzzle.\n Two rows of golden-headed Knights lining the path to the throne turned their faces in his direction, hands ready at the belts on their waists. He ignored them, stalking between them to the unmasked figure waiting for him in a pile of red translucent silks. Valencia’s Queen stood next to the throne in red trousers, black-gloved hands clasped behind his back and Valencia’s crest shining in the center of his chest.\n He should have known not to use the room they’d selected. He’d been unforgivably careless, and Eva had paid for it.\n He stopped with one foot on the incline that led up the dais as he met the cold gaze of the Grandmaster Valencia. “You gassed us,” he said.\n The Valencia didn’t hesitate. “Yes.”\n “This was never just about me, was it?”\n “On the contrary. It has everything to do with you. And your wife.”\n He narrowed his eyes at the only person in the Greatwood who didn’t wear a mask, the better for everyone to know exactly who they were.\n His first wife stared back at him, her dreadlocks so thick and long they fell past her waist, her dark eyes like obsidian.\n “She had nothing to do with this.”\n “She is a solution,” the man beside the Valencia said.\n He let his eyes drift over the Grandmaster’s Queen, once a White Knight of Valencia, bitterness filling his mouth. “To what problem? She has never set foot on Valencia.”\n The Grandmaster fluttered a hand and the Knights came to attention then trooped out, closing the doors behind them. It galled him that she knew he would take no action. Not while he had no idea where they held his wife.\n “Her people will come for her if you harm a hair on her head,” he warned.\n “We’ve taken precautions,” the Valencia said. “For now, she’s alive and well. Your solution will decide if she stays that way.”\n “I was exiled,” he said. “You no longer command me.”\n The Grandmaster Valencia leaned forward, her brown skin flawless and supple in the morning light streaming through the floor to ceiling windows behind him. “You will solve our problem, or the Consortium will receive the solution they contracted for.”\n He was careful not to let her see the dread that filled him. The Valencia propped her chin in the palm of her hand, studying him.\n “The Consortium?”\n “Yes.” She let her gaze slide past him, as though bored. “They lost a ship a solar year ago. There was a catastrophic malfunction before it disappeared, but the Consortium didn’t find any debris at the ship’s last known location. Their inability to confirm the fate of the ship meant insurance on the ship and cargo could be withheld for years, so the Consortium turned to the best problem solvers in the known Systems for help in finding it.”\n “And have you done so?”\n She leaned back and tapped her fingers against the arms of the throne. “No. And we never will, given it was destroyed by a Kairi Havoc class solo-ship. Your wife’s, to be precise.”\n He folded his arms across his chest. “You came to this conclusion how?”\n “My Grandmasters examined all data from the ship. The transmissions and location coordinates had been altered by a rare Trojan, one that amends the AI code of any analyst, erasing all data not in support of a false conclusion. The Kairi call it Cleanslate and developed it during the Nicene war. No machine could pinpoint it, but Grandmasters are not code.\n “We refocused our search from a missing ship to reports of engagements involving Kairi ships, then cross-referenced them with the time of the Consortium ship’s disappearance. There weren’t many—those that attack the Protectorate soon learn why the Sibling Army is feared in all the known galaxies.\n “One report was of a raid by an unknown attacker on an Outpost planet with few defenses. The description of the ship that repelled the attack matched that of a Kairi solo-ship. The description of the destroyed ship matched that of a slaver. And your implant’s ping occurred on the same planet, at around the same time.”\n His derisive snort was without humor and he glanced first at the silent Queen, then the Valencia. “That’s how you found me. It’s not why I’m here.”\n The Valencia raised her eyebrows. “Tell me why then.”\n “I’m here because you’ve been trapped by your games and your lies.”\n The Queen took a threatening step toward him, but he gave him a withering stare. “It wouldn’t be wise to hurt me or my wife when we both know you are desperate for my assistance.”\n The Valencia’s eyes came alive for the first time, mirth crinkling their corners, though she never smiled. “Desperate? You’re the one who stands captive in your former Sept. The penalty for returning from exile is death.”\n “You don’t want me dead,” he said. “The game was obvious the moment I saw your chair.”\n The Valencia leaned back. He’d been married to her long enough to recognize her annoyance. “You’re still very much the Lucochin, aren’t you?”\n “You came here in a transport, instead of entering Valencia’s Greatwood and arriving at my Vineyard. I was delivered to my estate instead of Valencia’s because your Vineyard is no longer functioning as it should, and you couldn’t take the chance I wouldn’t arrive.\n “You had been searching for me for many tempi when the Consortium reached out to you. When you learned about my wife, you seized the chance to use her as leverage. Like a newly Septed Pawn, I obliged you by bringing her along.”\n “Don’t feel too badly,” the Queen said, his voice cold and calm. “Sept Kingston’s White Knight was told to bring you both in alive. He chose subtlety over force. He knew no Kairi citizen would allow a mate to go anywhere without them.”\n The Lucochin inclined his head mockingly. “You know everything but what’s most important. How to save the Greatwood. The Coretrees are fading, aren’t they? Accepting fewer and fewer stratagems from the Games, or problems from outsiders. Solutions have errors. Vineyard transports are erratic and inaccurate, if they work at all. I can only imagine how much cargo has been stranded or lost.”\n “How do you know any of this? You haven’t been here in many, many tempi.” The Valencia’s voice was sharp.\n “The same way I know you had Alexandar killed after your marriage, so you could be promoted to Grandmaster. Your actions cost thousands of lives and destroyed any chance of mercy from me.”\n “Grandmaster Lucochin.” He heard a soft snick as the Queen clenched his fingers, activating the weapon in his gloves. “You will respect the Valencia.”\n “What are a few thousand souls?” she replied with a shrug. “The Game separates the useful from the useless and ensures resources are not strained beyond capacity. You haven’t been so long from Valencia you’ve forgotten your work as Grandmaster, have you?”\n “You have my wife,” he said, refusing to give in to the guilt and shame that flashed through him at the mention of his past. “Make your demands.”\n The Valencia’s head made a slight nod and the Queen stepped back to her side, fingers loose.\n “Grandmaster Lucochin. You will attend the Coretrees in the Greatwood and return them to health. You will attend Valencia’s Vineyards and return them to health. You will do these things quickly and well, or I will give your wife to the Consortium, so they may seek redress for their injustices.”\n “Injustices?” He raised an eyebrow. “You apply this term to slave traders?”\n “I apply it to a client. It’s not for me to judge an artificial lifeform because it has no attachment to biological entities. Only to provide the contracted solution, where possible.”\n She stood. The Queen touched thumb to middle finger and the Knights reentered the room, forming a silent phalanx behind the Lucochin.\n “What is your answer, Grandmaster Lucochin?”\n He bowed, as custom dictated, then met her gaze with an unflinching one of his own. “Show her to me and I’ll do as you ask.”\n The Queen raised his hands, brought his extended index fingers together then drew a glowing square in front of him. The square filled with the image of a suspension chamber. His wife was enclosed beneath the transparent lid, her sleeping face tranquil.\n It took a supreme effort not to leap forward and snap the Queen’s neck.\n Patience, he told himself.\n “Take me to her,” he said.\n The Valencia smiled. “Not before the Greatwood is repaired.”\n Of course. They would never let him use the annex at his own Sept. They didn’t trust him.\n And they shouldn’t.\n “Then take me to the Greatwood.”\n The Rook stopped short when the maintenance robot rolled directly into his path.\n *You are Second Rook of the Sept Kingston. Confirm.*\n The Rook put a hand to the spear on his waist as he read the robot’s serial number.\n “Unit 1014, you have deviated from your assigned tasks.”\n *Correct.*\n “You are malfunctioning, Unit 1014. Proceed to the nearest repair station.”\n *This bot is functioning at 86% efficiency. Confirm identity.*\n The Rook unsnapped his spear and sank into an attack position.\n “I am Second Rook of Sept Kingston. Identify yourself.”\n *Second Rook,* the robot replied, *There has been a Stage Four violation against my shell. Vineyard link to Valencia was closed without notification. Caution Protocol enacted.*\n The Rook’s fingers flexed on his weapon. “You are the solo-ship?”\n *I am Sister to Eva Gomez. You have committed infractions against my sibling. There will be consequences. Release my ship. Take me to my Primarch.*\n The Rook sliced the humming point of his spear at the machine.\n It rolled backward, unfolding two cutting attachments from its conical body.\n *Second Rook,* it intoned. *You have attempted violence on a temporary shell. There will be consequences.*\n “Hear me,” the Rook replied calmly. “Your demands will not be met. I’m under orders from my Grandmaster to secure your solo-ship indefinitely.”\n He took a step forward and slashed at the robot. It slid out of the way, snapping its shears onto the end of the spear. The Rook tugged the robot toward it with one hand and drew an energy blade from his belt with the other. In a single movement, he sliced through the control box on the side of the robot. It settled onto the floor with a heavy thunk.\n He poked the robot with his spear, ensuring it was deactivated, before re-sheathing his knife. Striding to the nearest comm, he placed a hand on the panel next to it.\n *Temporary shell deactivated,* the comm said before he could utter a word. *Negotiations have failed.*\n “As I have no authority to negotiate on behalf of my Grandmaster, this was a foregone conclusion.”\n *Defense is noted. Crew statements consistent. Veracity estimated at 98.2%.*\n “You have spoken to my comrades?”\n *All crew are being informed. This is standard procedure.*\n The Rook swung around, intending to try another comm. A drone hovered behind him, transparent petal-arms rippling around a glowing central light. Beyond the drone, he saw two cleaning robots enter the corridor and roll to a silent stop.\n “How did you breach our security?” Second Rook demanded.\n *Swiftly,* one of the robots responded. *Caution Protocol ended. Negotiations ended. This vessel is forfeit.*\n “You think gaining control of cleaning robots will force us to do as you wish? There are more than enough crew to disable whatever machinery you attack us with,” the Rook said.\n *Warning,* the comm said. *Greenlight Protocol authorized. Crew confined to quarters.*\n “You will find it difficult to convince us to go peacefully.”\n Hissing filled the air, and the ship’s address system announced the removal of oxygen from all public areas in preparation for a ship-wide cleansing of the air-filtration system.\n *Greenlight protocol enacted,* the drone replied. *Persuasion not required.*\n The Valencia’s transport waited in the courtyard, a shield humming around its passenger cab. The Grandmaster stepped directly from her chair into the large, padded interior and the Queen settled next to her. He took the seat opposite them both. The chair was stored away in the compartment at the back of the domed vehicle and they were on their way, the Knights riding in security berths on the outside of the cab as the guidance system took them back to Sept Valencia.\n He felt the Valencia’s eyes on him, but he refused to meet her gaze. He stared out of the transparent dome as they drove away from his overrun estate, an ache in his chest and his head as saw the dark shape of servant quarters, harvester homes, and barracks beneath the glimmering overgrowth. All empty now.\n His fall from grace had brought down a Sept, killed thousands, and led to Eva’s abduction. It was time to ensure nothing like that ever happened again.\n Sept Valencia lay several hours to the west of Sept Lucochin via transport, through some un-Septed townships. The first two were once part of Sept Lucochin and were as abandoned as his Sept. The townships beyond those had sprung up around Sept Valencia and hundreds thronged the sides of the smooth road they traveled on to see them pass, even though they would see nothing but Knights and a darkened shell. Grandmasters seldom left their mansions without using the Vineyards, and those born un-Septed would only see such personages when important news, ceremonies, or changes in the Great Game of Valencia warranted the use of Sept Valencia’s continental broadcast system to notify all citizens, regardless of Sept status.\n Their unmasked faces blurred together, every shade from pale to ebony, their expressions curious, contemptuous, desperate, angry—nothing like the careful blankness the Septed and the ruling class cultivated.\n By the time the huge curves of the colony ship Valencia, now a monument, rose up out of the open fields to his left, the rainbow glare of the vast Greatwood was almost too much for the tinted transport.\n “A mask?” the Queen asked.\n He shook his head. “When we arrive is soon enough.”\n The Valencia remained in the transport when the doors were opened at the ramp to her white mansion. He raised his eyebrows at her, waiting.\n “The Queen and several of my Knights will accompany you to the Coretrees. Once you have a solution, you will implement it and return to the mansion to wait. As soon as we know your solution has worked, you will have your wife.”\n “And what do you intend to tell the Consortium?”\n She shrugged. “We’ve failed to provide solutions before. I will happily refund our retainer and extend our regrets in exchange for a Harvest and your permanent solution.”\n He inclined his head at her. “Be assured, the solution will be permanent.”\n The Valencia descended into her chair and the Queen waved a hand over the sensors to shut the doors. The transport continued on to the Greatwood’s entrance beyond the colony ship. When the Queen extended a mask, he took it, watching as the man donned his own.\n The Greatwood’s iridescence dimmed to a shifting, multicolored glow as he exited the transport and four Knights surrounded him. He was marched alongside the Queen into the low-hanging needle-leaves that spun and glinted in the wind, until they reached the Barrier, which kept all but the Grandmasters from entering. A cylindrical drone swept over to verify his seedling, then retreated to its charging station somewhere beyond the Barrier. He walked into the heart of the Greatwood, sensing the Queen’s unwavering gaze on his back.\n At the transport hub a short distance from the Barrier, he got into one of the small carts and let it take him on its pre-programmed route to the Coretrees. The sweet, musky perfume of the flowering vines draped on the trees surrounded him like a blanket, but for the first time, he caught the dank scent of rot underneath it all. Purple, red, golden, and green seedpods peeped between the branches, but many were shriveled and blackened, and heaps of spoiled pods had burst open on the ground. He heard the rustling of small animals in the undergrowth, but sobered by what he’d seen, he focused on clearing his mind for the task ahead.\n The enormous stand of Coretrees rose out of the deep forest like a monolith, entwined trunks and quantum vines woven together into one massive, flowering, windblown, pulsing glare that forced his mask to its maximum setting. But there were also large dark areas within the Coretrees, where saplings had faded and died. More than ever before.\n As the cart halted, a vibration prickled his skin, and heat blasted him. He made his way to the nearest annex in the group of hollowed-out beds at the roots of the Coretrees. He lay down, heart hammering in his chest at the thought of what he was about to do, adrenaline making his fingers shake as he wrapped a Corevine around the hand implanted with the seedling. The needle-leaves sank into his arm, tiny stinging points.\n Instantly, he was weightless, his body free of pain and filled with the euphoria of the joining. His mind squeezed with energy and impressions, even as it grew to include every scrabbling life in the Greatwood, every vine curtain on every Vineyard ship, every needle-leaf that draped over his paralyzed body, every quark in every Arbor floating in the silent dark.\n He chased the rush of information to its source, past the inexorable pull of the Vineyards in other Septs, or near other worlds, and the flow of thoughts other Grandmasters fed into the Coretrees from their Sept annexes. He delved deep, deeper than anyone before him, including the long dead First Gardeners.\n Into the white. Into the murmuration and hum of life.\n Into Valencia and all its living, breathing, moving parts. All its dead, rotting, dying parts. Every soul and every sapling connected to it, before and to come.\n Bright warmth and cold realization flooded his mind, drowning him, pulling at him, forcing him to fight for his thoughts as It turned Its complex regard on him. A tsunami of sensation and energy. Life engaged in living, nature striving toward continuance by any means possible.\n And it shifted, glowing and hungry at his return. Eager.\n He offered up logic puzzles he’d concocted out of habit over the years tending his garden at home.\n It recoiled.\n Then surged forward, surrounding him, searching blindly. Tiny feathery sensations. Sharp probes. The ice-cold lick of interstellar Arbors, drawing on the energy and life of its planet-bound mother-brethren.\n Satisfaction flashed through the tiny part of his mind he’d kept for himself. What he’d tried to correct had never been a mistake, and so his attempts to put things back to the way they had been so many tempi ago had failed, just as he’d hoped.\n His plan would work.\n There would be no going back now.\n When he emerged from the seductive whirlpool of Valencia’s embrace hours later, he barely found the strength to detach himself from the annex and drag his heavy limbs to the cart. The Queen caught him as he fell across the Barrier and lifted him into the transport.\n Knowing they couldn’t execute him before they were sure his solution had worked, he let himself slip into sweet oblivion.\n Loss speared through him as soon as he opened his eyes. The ecstatic link to Valencia’s true heart was one he’d survived losing many tempi ago. Terrible as it was to be without it again, the excruciating absence of his wife eclipsed that pain with ease. He’d sensed the infinitesimally small presence of Eva’s seedling while in the annex, but it had been too new, too weak to follow to its source.\n He sat up on the hard bed, his gaze going to the gold-masked Knight that stood guard in the doorway. They were still careful not to let him near a Pawn or a Rook, ranks he might manipulate.\n “Food. Now.”\n The Knight retreated from the doorway and he strode over to the window. The night sky danced with colors. He’d been asleep for hours.\n Good. By now, the Grandmasters would be gathering.\n The Knight supervised the servant that brought him his food, making sure no conversation occurred. He sat at a table that folded down from the wall to eat, noting the chair was bolted to the floor and the bed he’d slept in was devoid of sheets. He had a selection of fruit and bread, nothing that would require utensils, and a sip-bag of wine. He ate it all, hunger gnawing at him after more than a day without food, and all he saw, all he thought about, as he stared at the wall before him, was the woman he loved, the man he’d lost, and the people he still had a chance to save.\n When the Knight returned, he was waiting.\n “Take me to the Audience Room.”\n The Knight was silent.\n “As a Grandmaster, it’s my right to attend any gathering concerning the Great Game. Take me to the Audience Room.”\n He folded his arms across his chest and didn’t let his gaze move from the tinted slits of the mask. After long minutes, the Knight turned and strode away.\n The hallways were cool and meandering and had not changed since his days as the Lucochin. Valencia’s mansion was the only one grown from the Greatwood itself, as the colony ship had landed on the very edge of it. The petrified wood of the walls and floors had been left unpainted, and the shimmer of vines was everywhere, the powdery scent of flowers infused in every breath.\n He’d been kept in private quarters on the upper floors. He heard the hum of voices long before he reached the vast Audience Room on the first floor. The Knight stopped next to the guards who opened the doors for him. He walked in past the masked Kings, Queens, and Grandmasters that turned to look, and the rows of Knights from the twelve Septs of Valencia lining the sides of the room. He focused on the stage at the far end, the line of Valencian Knights before it, and the floating silver fountain in the shape of dodecahedron in front of them.\n He approached among a flurry of signing hands and mutters. The Valencia sat between her King and Queen and watched him enter, the long drape of her sheer sleeves billowing around her gilded throne. None of their expressions changed, but the Valencian Bishop who stood below her throne started toward him.\n He stopped to the left of the fountain, resting one hand against its side as he raised the other, palm out in warning.\n “I am Grandmaster Didecus Avnette Valentino Lucochin and I would speak to my fellow Grandmasters regarding the failure of their annexes and their inability to access and feed the Coretrees.”\n The Valencia’s eyes narrowed, the smallest movement. “You are no longer a Grandmaster of Valencia.”\n “And yet I am the only Grandmaster who can tell you what has happened and why, and how you can save our people.” His fingers quested against the underside of the fountain, found the rough imprint they were searching for, and pushed.\n “Traitor!” came a voice behind him.\n “You are exiled,” came another. “You should have been executed the moment you arrived.”\n “The Grandmaster Valencia brought me here,” he answered without turning as he withdrew his hand. “Ask yourselves why.”\n He sensed someone draw closer and tensed, even though none of the Knights in front of him had moved.\n “He is a Grandmaster of Valencia until the Greatwood calls him home,” said a familiar voice. He turned to face a tiny man in an orange mask who sat in a mobile chair. The Grandmaster Yuta, oldest of their number, gave him a deferential nod. “He is entitled to speak at any gathering if he has not yet been executed. This is the law.”\n The Valencia let her gaze rise above the crowded room. “Very well. I brought the Lucochin here to repair the damage he caused to the Greatwood. It was an error on my part. One I will remedy once this gathering has ended.”\n “Before we get to my imminent demise,” he interrupted. “Allow me to tell you a story.”\n Whispers spread behind him.\n The Grandmaster hissed out a breath and shook her head, her braids swishing against the thin silk of her robe. “My predecessor died without uttering a word, not even a plea for his life. This delay does not become you.”\n Sorrow and anger swept through him. “Your actions do not become you. Why order the clearing of Lucochin’s board?”\n “Because you corrupted it. You Septed all families of Pawns. Increased the rations for the un-Septed. Visited them to hear their concerns. What you did—it was Deviation.” The Valencia’s voice was filled with disgust despite her tranquil expression. “You had no respect for the governance of the Grandmasters. You corrupted Alexandar as you tried to corrupt me. I only regret you escaped to exile instead of facing your due for your crimes. Sept Lucochin was an abomination under you. Clearing the board of it was my duty to the Great Game and my Sept. I did what was best for Valencia.”\n He laughed, a sad, resigned sound that echoed in the cavernous room. “You are as wrong about that as you are about the un-Septed.”\n He faced the sea of colorful masks. His back felt naked, vulnerable, but he would let them see the truth of his words, the emotions he’d learned to express over time.\n They had to know emotions were possible, even for a Grandmaster.\n “Once,” he said, “an orphan of un-Septed Valencians whose township was cleared from the board, a descendant of the First Gardeners, made his Presentation and was taken into a new Sept. He rose through the ranks, from servant to Grandmaster, over many tempi of the Great Game.\n “He found allies and a wife and more enemies than he ever knew possible, but he didn’t forget what it was to be un-Septed. How it felt to have no control over whether he ate or starved, whether he had a life of purpose or not. He knew this to be wrong. He knew Valencia to be unfair. And he wanted, more than anything to change that, and to protect the people under his care for as long as he could.\n “This orphan knew he held strange views. That the Great Game was not played for the benefit of the un-Septed, but to feed the Greatwood. So, imagine his shock to find another who believed as he did. The Grandmaster Alexandar Gordon Millefleur Valencia.”\n There were gasps and a whisper of, “Impossible.”\n “Together, they searched for a secret told to the orphan by his grandmother, and those Gardeners before her. A secret buried in the Coretrees. That there was intelligence within the Greatwood, which Gardeners had encountered.”\n Silence fell as all in attendance hung on his every word.\n “One of those Gardeners told an officer, and once the Captains of the colony ships learned of this intelligence, they determined ordinary colonists could not be allowed to control something so important as the Coretrees. They took over the care of the Greatwood. Gardeners were stripped of their duties and demoted. But some remembered what their comrades had spoken of and tried to find ways to contact it again.\n “The orphan believed this entity might be the key to controlling the Greatwood without constant input from the Games. It had lain dormant despite the logic and puzzles of the Grandmasters who came after the Gardeners. But once both Grandmasters entered the Coretrees to investigate, they realized they were wrong, and everything changed.”\n “We know what changed. There was a trial, Lucochin,” came the Valencia’s icy voice. “All here remember it.”\n “You know part of the story,” he replied. “This is what I never spoke of. There is no single intelligence in the Coretrees. The Coretrees are intelligent and they are nature itself—the center of Valencia’s ecosystem—a key part of a great whole we’ve injected ourselves into. They don’t respond only to logic. They respond to stimulation. Water, sunlight, nutrients—the Greatwood produces what it needs, in the amount it needs. Then we came, demanding more and more, and willing to stimulate the Greatwood in whatever way we could to get it.\n “The Coretrees took what we gave it, logic as a form of cultivation, but when Alexandar and I entered together, it sensed what any good gardener will tell you is the secret to growing thriving plants. Care. Affection. It fed on our emotions. The more it did, the more we opened to it—and to our connection. With each other. With the Coretrees. With every Coretree, everywhere.” He stopped, taking a shuddering breath to center himself.\n “And the Harvest. It was the largest, the most incredible . . . So many ships were grown.” He shook his head with a sigh. “But that was when my estate’s Vineyard began to die. I had neglected it too long. Our ranking in the Great Game suffered and my wife, as my Queen, brought charges of neglect of my Sept and the Vineyards against me and my King.\n “Alexandar had no choice but to bring me to trial for capital crimes. I begged him to save Lucochin, to absorb its people into Sept Valencia. In return I would save Valencia from what I had done in ignorance, prevent whatever corruption I had started from spreading, and agree to exile.\n “To save my Vineyard, I gave it more than puzzles and stratagems. I gave it what I felt for Alexandar and for my Sept. And then I severed its annex from the Greatwood.”\n His words echoed around them and he looked from mask to mask, willing them to understand.\n “Valencia had only had a taste of human emotion, so I hoped it would forget and no further damage would be done. But it had taught me a new way, and I couldn’t forget.\n “Now I know Valencia didn’t either. And while your ever-growing demands exhausted the ecosystem around it, the Coretrees crave a different kind of stimulation and waste away without it.”\n As he spoke, he saw it. The exact moment they understood what his solution had been. Behind him the Valencia let anger seep into her voice.\n “Grandmaster Lucochin, what have you done?”\n He turned to face her, glad to be nearing the end of this farce. “I fixed the Coretrees the one way I knew.”\n “You gave it your bond with your wife,” the Grandmaster Yuta said in a resigned voice.\n “Oh no,” he said softly. “I gave it much more than that. I gave it the first moment I saw her. The first time I laughed. The first time I held Alexandar. I gave it every good emotion I’ve ever had. I gave it joy and hope . . . and love. I now suspect it has lost any taste for what Grandmasters provide.”\n Anger buffeted him, even as some Grandmasters stepped back, gesturing to allies and members of their Septholds.\n “For too long we’ve existed by making demands of an ecosystem we don’t fully understand and cannot live without. We’ve made a slave of a unique evolutionary miracle that exists across vast reaches of time and space, and in return we’ve given it death and cold space. The Greatwood can feel, and we’ve fed it logic and greed and forced separation. If we continue this way, we’ll destroy every part of it, no matter how far it’s spread. And we’ll doom ourselves.”\n “You’ve taken away our only means of controlling the Greatwood,” someone whispered. “You’ve killed us.”\n “Not at all. Dig deep and you’ll find what you need, though I caution you against negative emotions that might harm the Harvest. And if you truly cannot feed the Coretrees, I suggest you turn to the un-Septed. You’ll need every person you can find. Valencia is vast. Communing with it will require every open mind and warm heart.”\n The Valencia stood, hands clenched, and for the first time, he saw Knights turn to look at each other. Heard voices speaking simultaneously behind his back.\n It’s done, he thought. And there was no triumph in him. Only disgust for so many tempi of needlessly wasted lives. Only guilt for his part in Valencia’s treacherous, bloody past. Only sadness for those who had lost so much before, and those who would be called to sacrifice while Valencia transitioned to something else. Something new.\n “You’ll die here,” the Valencia spat, “knowing your wife is in the hands of the Consortium.”\n He faced her, the merest frisson of sympathy curling within him for what awaited her. “You have far more important things to worry about. Like how you’re going to handle the revolution that’s marching to your doorstep at this very moment.”\n “What are you talking about?” the Queen said, eyes narrowed.\n He shrugged. “You’ve been broadcasting this gathering to Valencia the entire time. Every citizen has heard what’s been said here tonight.”\n The cries of horror rose to the rafters like a murder of crows.\n The Queen clenched and released a glove, holding his palm flat and face up. An image of the Audience Chamber shimmered to life, confirming the open feed.\n “Alexandar often recorded meetings without his Queen. There’s a surveillance drone in this fountain. I activated it and its link to the broadcast system the moment I entered.\n “Thousands of souls and countless denizens of the Greatwood and this planet have paid for our ambitions. It’s time everyone knows the perversion that sits at the head of this Game so they understand all Games must end.”\n “Queen,” the Valencia said in an arctic voice. “Seize the Grandmaster Lucochin and seal him in a chamber until his execution.”\n He cast his gaze over the room. “You should secure your estates. There are far more un-Septed than you. You’ll want to be prepared to negotiate come morning.”\n “Queen! I gave an order!”\n He swung his gaze back to the hesitating Queen. “Do the Grandmasters know you hold a Primarch of the Kairi here? Do they know you risk the Sibling Army arriving on their doorstep searching for her? If you let us leave peacefully, together, this ends here. If it doesn’t, you will have killed two citizens of the Kairi Protectorate. You know what happens to governments that do that.”\n Around him, Grandmasters were leaving. Knights pushed past, weapons at the ready as they escorted their charges.\n But some Knights, Bishops, and Rooks—some didn’t move at all.\n He waited, his last card played, his last game ended.\n The Valencian Knights turned to their motionless Queen for instructions.\n “Queen.”\n The Valencian Queen met his Grandmaster’s gaze.\n “Is this rebellion?” she asked in a gentle voice.\n A hand gripped the last Lucochin’s arm. He turned to face the Grandmaster Yuta. “Come,” the old man said. “At the Valencia’s command, I kept your wife at my Sept. I will take you to her.”\n He glanced at the stage where the Valencia stood, all her attention on her Queen. “Is it rebellion?” she asked him again.\n The Queen tilted his head in deference. “Yes.”\n He grasped her hands before she could draw a weapon.\n “Come,” Yuta said again.\n He followed, his last sight of the Valencia that of both her wrists caught in her Queen’s hands as her Bishop motioned to the Knights. One Knight deactivated its spear, returned it to its belt and walked away.\n His heart sang relief and a fierce rightness as he did the same.\n His wife was asleep in his arms when he exited the Yuta’s Vineyards into his own and found Sister’s secondary drone floating in the center of the field, filaments rippling, waiting for him.\n He smiled at it. “You were worried.”\n *Sister was out of contact for more than 24 hours. Caution Protocol enacted. Tracking systems were activated and found you both alive and not in distress. Greenlight Protocol enacted.*\n He started for the Vineyard controls, Sister floating behind him. “There was no need for that. You know I would never let her come to harm.”\n *Tracking could not confirm location data and Sister’s drone was deactivated. Vineyard ship did not respond satisfactorily to queries. Greenlight Protocol enacted.*\n “The Vineyard crew must have enjoyed that.”\n *Crew was neutralized. Sister obtained seedling. Vineyard is under Sister’s control. Mirror connection open and active.*\n He put a mask on Eva, then himself.\n “No need to set the controls then?”\n *Mirror connection open and active.*\n He trailed the drone toward the translocation point.\n “You didn’t hurt the crew, did you?”\n *Neutralized. Sister would not want to cause a planetary incident. Husband is a pacifist.*\n He stopped to laugh, the drone hovering patiently in the glistening fields beneath the rainbow-lit night.\n Hours later, Eva stirred in the soft bed next to him, rolled over, and opened her eyes. He smiled, his hand cupping her shoulder as he held her body against his. She smiled back, then let her gaze drift over the opulent stateroom, the best one in the Vineyard ship, intended only for Valencian dignitaries and guests. With everyone else locked in their cabins and Sister flying the ship back to the Outpost, there was no one to object and his wife damn well deserved the finest they had on offer, as he was never setting foot on a Vineyard again.\n She groaned and buried her head in his shoulder before signing.\n “You never woke me.”\n He kissed the delicate shell of her ear and signed. “Guilty as charged.”\n She leaned back to meet his eyes. “What happened?”\n “Long story. It will keep. Enjoy your sleep. The Vineyard ship left orbit while we were away. We’re a few hours from the Outpost.”\n She caressed the side of his face. “You okay?”\n “I’m good. Never better.” And he knew she could see he meant it. Her body relaxed and she threw her leg over his, cuddling closer.\n “Told you we’d leave together.”\n “You did.” He kissed her forehead, blinking rapidly to clear his suddenly blurry vision. “Right as always.”\n “Don’t you forget it.”\n He stroked her hair as her breathing slowed.\n “Wake me for first watch?”\n “Of course.”\n “Liar.”\n This time, they fell asleep together.\n R.S.A. Garcia writes speculative fiction, and lives in Trinidad and Tobago with an extended family and too many cats and dogs. Her debut science fiction mystery novel, Lex Talionis, received a starred review from Publishers Weekly, the Silver Medal for Best Scifi/Fantasy/Horror Ebook from the Independent Publishers Awards (2015), and became an Amazon Bestseller.\n She has published short fiction in magazines such as Clarkesworld Magazine, Escape Pod, and Internazionale Magazine. Her stories have appeared in several anthologies, including the critically acclaimed The Best of World SF: Volume 1, The Best Science Fiction of the Year: Volume 4, The Apex Book of World SF: Volume 5, and Sunspot Jungle: Volume 2. Her work has been translated into Italian, Spanish, and Czech."}