{"fingerprint": "QWlxyxxmHvrNoELEmdBqgiw7Fb8=", "sitename": "Clarkesworld Magazine", "title": "Where Water Joins by Nelly Geraldine García-Rosas", "author": "Nelly Geraldine García-Rosas", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/garcia-rosas_11_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Where Water Joins by Nelly Geraldine García-Rosas", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1810 words, short story\n Where Water Joins\n require 'Marina.rb'\n # Talk to the image of a person like you talk to the real person. Talk to the real person, just like this. No comparisons needed.\n greetings = message.newgreetings.send (\"Are you there?\")if Marina.is_there? = trueprint her_answerelseprint \"Marina is not here.\"end\n => I’m always here.\n I dream with her.\n Last time, I was waiting for the metro at Tacubaya station when I noticed she was staring at me from the platform on the other side. She had a different face, but it was her. Somehow I knew it was her. She had the same piercing, black eyes, and the same gesture, as if her lips were about to open. I don’t know why, but I felt the urge to go after her, to find out what her voice sounds like. I wanted to jump into the rails so I could get faster to her side, but I was stopped by the whirring of the metro approaching. Doppler Effect. I ran the stairs instead as fast as I could, and, like in a bad movie, I just managed to see the coach doors closing behind her back. Thirty-five meters under the surface, I lost her heading towards metro Barranca del Muerto.\n I need to ask her why I keep on remembering her even though she never appears in my dream data recordings.\n => Why her?\n # Coincidences.\n coincidences.are_real?\n => nil\n I had to reboot. Haven’t done that since the BrainSight was installed two years ago. I remember how amazed I was at the clearness of the images, the true colors, the blood running through my hand’s veins, the qualitative and quantitative analysis of the air-suspended particles.\n Initializing . . . and, suddenly, the world became more real, more world.\n “You don’t see with your eyes, Iris, you see with your brain. Eyes are just lenses, information receivers,” said the technician. “Change the lenses, and the quality of vision changes. Thus, if you improve the information gathered, what you see is naturally enhanced.”\n Enhancing. I just wanted to see for real.\n “Choose between two models. The basic one is just a retinal implant which is linked to the optic nerve using a couple thousand electrodes and a processor. Boring, right? I guess your grandma had been using a similar one for ages.\n “BrainSight Pro, on the other hand, is gorgeous. Quite the tech wonder.”\n I remember those horrible migraines as well. They’re documented in my pain databank to the smallest detail. Phantom eye syndrome. Phantom optic nerve merged with carbon nanotubes syndrome.\n “BrainSight is just a link. Memory recording and processing in general is done by your brain. We could say that your implant gives it the means for being more efficient and organized.”\n I vaguely remember the girl I donated my right cornea to. I’ve forgotten her face since my new memory was not active when I met her. I barely remember anything that happened to me before the procedure. People and moments there, in that past, are like made-up movie stills. Everything that was real before isn’t anymore.\n I had to reboot. The first time I did it, it was because of those migraines. Apparently my BrainSight installation was interfering with my brain’s gamma waves. —It hurt to think—. The second time I rebooted was this morning. The technician recited the greek alphabet: alpha waves were acting like theta ones, maybe deltas’ amplitude was not high enough and beta waves were possibly causing hallucinations . . .\n “Are you sure you’re not drinking too much coffee? Data looks normal: processing at 1021 FLOPS and your memory has more than 1.5 petabytes of free space,” said the technician. Then, proceeded to shut me down.\n Initializing . . .\n “You shouldn’t have trouble with your dreams from now on.”\n But I still remember her. All of her faces. Phantom memory-of-my-non-existent-dreams syndrome.\n Tacubaya is a Nahuatl word that means “where water joins.” I liked to think it was an intended joke since Mexico City-Tenochtitlan is almost completely drained, and the former great lake Texcoco where the city was built upon is now a salty marsh. But, with time, I got to understand that the memory of water is everywhere: metro stations’ logos are reminiscences of the former lake-city, their tunnels and bridges seem like ghost-water canals. There are images of fountains, fish, aqueducts, cranes, rafts, jugs, streams. People gather in shoals; they swim in the streets, glassy eyes, mouths opening and closing in a mesmerizing way.\n Every time I enter Tacubaya station, I feel like going underwater. I take a deep breath and start descending the stairs whose walls are surrounded by a blue and turquoise mural that depicts the Aztec pilgrimage in search for a new land. I take a deep breath and flow with the crowd. Lit by dim lights, we are all still searching for the promised land among the memory of the water.\n time_with_you = computer.is_on?while time_with_you = falseputs \"I'm thinking about you.\"end\n => Do you always have to talk to me as if I were a goddamn machine?\n # If I didn’t, you wouldn’t understand me at all.\n She had enormous wings. A clockwork royal eagle standing by the entrance of La Viga metro station. The complex cogwheel mechanism seemed to rotate seamlessly with every movement of her. There were feathers of colors I hadn’t seen before hanging from the metallic frame. I was getting to the top of the stairs when her wings opened wide before me. I almost fell on my back. Her hand grabbed me, though.\n “So you can see them, uh? I wrote all the code myself. You like them?”\n I didn’t know what to say. I was shocked because I had been about to fall down the stairs and, mostly, because I realized I was seeing an illusion. Electronic patches made intricate drawings on her skin, but in my eyes—in my brain—they were transformed into wings.\n “I’m Adriana. You come here often, I guess? See you around, then. And . . . take care, ok?” She giggled.\n She turned her back. Now, she looked like a lizard dressed with butterfly wings. Iridescent scales. She then got lost among the people.\n I had not started dreaming with her then, but I like to think that one of her faces is like Adriana’s. Though the woman in my dreams is wingless, she does have chameleonic faces.\n class Wings\n def initializeimage = rand['eagle', 'crystal', 'fire', 'butterfly', 'quetzal', 'shadow']end\n def spread (image)if image.gets (BrainSight_visor)BrainSight_OS << 'Marina.rb'elsenilend\n end\n Tacubaya station again. I’m awake this time. Something burns on the platform. No. It’s just her fiery wings. I see Adriana telling me something, but the metro’s noise makes everything hard to hear. I follow her towards Pantitlán station.\n When I was a little girl, I liked to believe that Mexico City’s limits started in metro Observatorio. The city branched out from there through its subway lines as if they were veins and bones going down to the center of the Earth and then rushing towards the sky. Pantitlán was the end of the world: that place where metro trains as well as people went to die at peak hours.\n I’m elbowing my way among people. If it weren’t for this mirage I’m seeing, Adriana would be lost from me among the crowd where she swims without a hassle. We get out of the metro station into a big avenue where we pass street food vendors and counterfeit-goods tianguis. Here, in the end of the world, nothing seems real. Gray concrete raised to the power of n.\n She hasn’t said anything since we boarded the metro. I have nothing to say yet.\n We arrive at an old building. Adriana walks up the stairs as if her crystal wings let her float over every step. One, two, three floors. She stops in front of a door and waves one of her electronic patches by the near field key. We get in.\n The room is not big, but seems enough for the stuff inside: a bed, a desk, a couple of bean bags, a coffee table. Axolotl images slowly swim on the walls. I’m not sure how long I have been engrossed in the magical way their gills float.\n “I like the axolotls too. The whole thing is a tattoo. Was.” She tells me, but I feel she’s talking to herself.\n “Is it you?” I bluntly ask.\n Adriana remains silent for a moment. A couple of eternities. She then says, still looking at the amphibians on the wall: “The one in your dreams? Nah. It’s her. It’s always her.”\n “Her?”\n “Marina. The axolotls drawing . . . It’s her tattoo.”\n “What the hell? Why?”\n “Because I’m not able to keep her by other means. D’you know what will happen to your memory data once you’re dead?” She asks at the same time she points at my right eye. Then adds: “You’ll stop existing completely.”\n I know. The technician is legally bound to destroy my BrainSight as well as any insignificant trace of data. All my memory will be lost as my brain decomposes. I’m a supercomputer doomed to putrefaction.\n “If it wasn’t for you. If it wasn’t for all the other dreamers . . . D’you know what’s the problem with computers that make a ton of operations per second? They spend half their energy cooling down to prevent overheating. The human brain is a computer too, but has all that heat under control. It’s more efficient than it seems. BrainSight devices maintain the network connection. Like a huge computer that’s easy to keep up to date and that has a monstrous processing power. We made an entire world, you know? Just for her.”\n Monstrous shouldn’t be the word used here.\n “Are you insane? Where’s Marina, then?”\n “There,” Adriana says while pointing to a server rack in a corner of the room, “and here.” She touches my forehead with her index finger.\n I look at the axolotls while pretending that I’m not angry, that I understand everything. But there are so many things I wish to ask her.\n # She already wanted to be a machine, didn’t she?\n class Tacubaya\n def initialize@coaches = 9end\n def join_water@coaches.open do |mind|mind.join_waterendend\n end\n Tacubaya.new\n Metro Tacubaya, always. Water joins here. Everything is water. People move slowly, they swim colorful, like those axolotls in Adriana’s room. Doppler Effect. The coach doors open. She’s sitting alone in a corner. It’s her. I know. She’s wearing another face, but it’s her. She has that gesture, as if her lips were about to open. She looks like the jade mask in the mural drawn on the walls behind me. I know what she’s about to say. I also look different.\n require 'Marina.rb'require 'Iris.rb'"}