{"fingerprint": "C6FcB/cq3P/7Xow4qXQIaRyp0QI=", "sitename": "Clarkesworld Magazine", "title": "Philia, Eros, Storge, Agápe, Pragma by R.S.A. Garcia", "author": "R S A Garcia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/garcia_01_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Philia, Eros, Storge, Agápe, Pragma by R.S.A. Garcia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "20970 words, novella\nPhilia, Eros, Storge, Agápe, Pragma\n2022 Finalist: Ignyte Award for Best Novella\n2022 Finalist: Theodore A. Sturgeon Memorial Award\nBrother-Adita paused at the top of the ridge and rotated one eye to take in the shells climbing the path behind them. They gestured beyond them with a limb, a habit picked up from their young, excitable sibling.\n“Quarter-march, west-north-west,” came their voice through the Kinnec.\n“Acknowledged,” the other two shells replied.\nMetal clacked against stone as the scouting party made their way over the rocky terrain until a half-crumbled hillside came into view above them. Freshly fallen boulders lay cracked and scattered on the flats below a large irregular hole. The hole was dark, the opening blackened and fused from heat.\nA recon drone unwrapped itself from the diplomat’s shell.\n“Unnecessary,” Brother-Adita said. “Shell destroyed. Only core remains.”\n“Origin uncertain. Caution warranted.”\n“Core dormant.”\n“Caution warranted,” the Admiral’s sibling said, using four of the shell’s eight limbs to move aside inconvenient boulders. “Proceed, Sister-Marcus.”\nThe drone entered the cavern ahead of them, eventually confirming the original report by Brother-Adita. One shell, destroyed on entry, core dormant, 87 percent probability of irreparable damage.\nIt was the uncertainty of the remaining 13 percent that concerned the two senior members of the scouting party.\nThe drone returned to its dock and the shell’s powerful illumination came on, lighting up every corner of the chamber. Dust drifted down from the unstable hillside like ash as the three shells followed the trail of wreckage to the smashed-open craft half-embedded in the rock around it.\nThe Admiral’s shell accessed Mammy and began scanning for origin markers as they worked to remove debris.\n“Advanced AI configuration,” the diplomat commented.\n“Superior shell construction,” the Admiral confirmed. “Known worlds origin 98 percent probability. New coding—Mammy has no matches. Conclusion—prototype.”\n“Acknowledged,” Brother-Adita said, the tones that played after her Kinnec reply an indication of her excitement over her first successful mission. No small feat for such a young shell. “Retrieval approved?”\nThe Admiral’s shell didn’t hesitate “Confirmed. Priority—preserve function.”\n“Acknowledged,” came the twin replies over the Kinnec.\nMetal screeched as they peeled it open. Below them, a light winked on and off on the side of the metallic ball that lay exposed at their feet.\n“Activity noted,” Brother-Adita said, playing another set of excited tones. It stretched out an appendage, but the Admiral’s shell grabbed hold of it.\n“Blue Protocol,” it said, warning tones underlying its transmission. “Avoid contact until—”\nWithout warning, the ball in front of them unfolded itself into a tiny, bronze, many-limbed bot.\n“Bot identified. Mission compromised.” The Admiral’s shell grabbed the other two and flung them back out of the cave’s opening before yanking a boulder out of the wall.\nThe bot wrapped two tendrils around the shell’s nearest limbs as the cave came down around them with a tremendous, shuddering crash of rocks and dust.\nPhilia\nNow\n“You can’t be serious.”\n“Why not?”\n“What would we do with it?”\n“They’re many things we could do with it.”\n“Like?”\nHer husband tapped a finger against his mouth, considering. Then he signed, “Milk? Cheese?”\nShe put her hands on her hips and raised her eyebrows at him. A coaxing smile curved his lips. She shook her head firmly.\n“I’m not milking it.”\n“I wouldn’t ask you to.”\nShe flung up her hands, eyes narrowed on him, disbelief in every line of her body.\n“I wouldn’t!” he protested out loud.\nShe pointed to the garden. “It will eat everything.”\n“I’ll tether it somewhere safe.”\nShe folded her arms and stared at him as the goat at his feet tore the heads off some flowers and chewed. He groaned, pushing a pitchfork to the side of the kitchen garden with his foot as he tugged ineffectually at the animal’s leash. “Come on, Hannibal, help me out here. She’ll make me get rid of you otherwise.”\nShe let out a harsh sound. “Turning him against me. Nice.”\nHe flashed a grin at her. “Are you going to deny your first thought was to curry him?”\nHer lips twitched. “Can I help it if he’s a delicacy on New Kairi?”\n“Well, on this world he’s worth his weight in potatoes—four sacks. I’d rather we get more than one use out of him.”\n“Four sacks!”\nHe shrugged, unrepentant. “Joseph’s niece is visiting from the Inner System. He needed the extra food.”\n“But not a goat?”\nHe bit his lip and looked at Hannibal.\n“He hates it, doesn’t he?”\n“Well . . . ” His face was neutral, but she sensed him holding back his laughter.\nHannibal strolled toward her and decimated a few more flowers.\nShe rolled her eyes. “Fine.” With a dismissive wave, she added, “But I take no responsibility. He’s your problem.”\nHe gave her a coaxing smile. “No help at all? But we always work together.”\nHer arm vibrated, signaling Sister had returned from her trip early, but she took a moment to wag a finger at him. “You should have thought about that before you . . . ”\nA sharp sensation ran up her forearm and burned itself into her elbow. She glanced down, freezing at the red glow under her skin, her flesh goose-pimpling. A Protectorate Alert. Something’s happened.\nHer husband’s solid body slammed into her, knocking her to the ground. Warm, wet liquid slapped down on her face and shoulders. Then she was rolling with him until they were behind a row of squat, thick-trunked palms.\nHer arm vibrated with the repeating pattern for an interstellar communication. She ignored it, wiping liquid from her face. She glanced at her sticky fingers, smelling it before she saw it.\nBlood.\nHer heart skipped a beat, and she turned to her husband, hands outstretched to check him, but he pulled her to his side and pointed with his chin. She peered through the broad, slatted palm leaves.\nThere was a smoking heap of flesh and bones and a spreading pool of blood where Hannibal had been. Coming toward them was one of Sister’s floating, translucent drones, its tiny firing-port extended from its center.\n“She fired on you,” her husband signed.\nShe frowned, shaking her head, trying to rise. “Not possible. Sister must have—”\nHe yanked her flat with a firm hand and held her face so she’d read his lips. “I saw her aim and fire, Eva.”\nHe was mistaken. He had to be.\nExcept her husband, a former soldier and Grandmaster of Valencia’s Greatwood, would never make such a mistake.\nShe tapped at the inside of her wrist. “Drone, Sentry,” she thought.\nThe drone didn’t pause.\n“Sister, standby and report.”\nNo answering vibration greeted her request. Her elbow continued to throb, but she had no time to answer. She had milliseconds to formulate a strategy.\nBeside her, her husband squeezed her hand to draw her attention. “No response?”\nShe shook her head. Their small home—the nearest shelter—was behind the drone. Sister’s soloship was in the root cellar. She watched as a second drone rose from the cellar doors at the side of the stone house.\nA breath left her as she came to a swift conclusion. Her Sister, her protector and companion, the only being in the world she trusted more than her husband, was trying to kill her.\nAnd Siblings did not fail at their tasks.\nShe met her husband’s gaze and saw he’d come to the same conclusion. He signed, “You have to shut her down.”\nEmotion swelled in her chest at the very idea, almost cut off her breath, but there was no other option. Sister had fired on her even though no Sibling could ever fire on another. Whatever was wrong, whatever had happened, Sister was a threat to them and had to be stopped. There was only one way to do that.\nThere were two drones hunting them, but with luck, Sister would be so focused on her task she would pay less attention to her husband. Eva didn’t like relying on luck. But this was unprecedented; she had no choice.\nHer skin flushed with warmth as she brought her breathing under control and focused. She lowered her head and took one more look at her beloved’s face. He gave her a slight nod, cheek brushing against the dirt, and a quick smile. Then he was up and running to her right, crashing into the brush just ahead of discharges from the drone that seared the earth behind him.\nShe rolled left, came to her feet, and dashed toward the river behind her. The spot between her shoulder blades burned with awareness and it seemed she ran forever, crouched over and zigzagging, expecting any moment to feel searing heat bloom on her skin.\nAs she splashed into the river and dove for the deepest part, agony speared through her leg. She jerked, but kept stroking, letting the current take her downstream. She knew the drone would follow, so she stayed submerged for several minutes. She finally turned at a spot where the river widened, peering up at the rippling surface, around at the waving reeds along the banks, and back into the hazy depths of the water behind her. Her arm and leg throbbed, and blood clouded the water around her thigh.\nThe drone appeared, hovering back and forth above the water, appendages rippling around its central gun. She stroked into the weeds along the bank, lungs burning, arm pulsing, knowing it was futile. The Kinnec network could find her anywhere and Sister could turn it on even if Eva disabled it. It would be a matter of seconds before the drone decided to either enter the water and finish her off or remain above and electrocute her and anything else within a wide radius. She searched the riverbed frantically for something, anything, to fight back with.\nThen\nCold swirling around her stomach shocked her awake. Eva blinked and shook her head, trying to clear her flickering red vision, and raised a hand to wipe her helmet.\nPain forked outward from her rib cage and she sucked in air, her hands instinctively closing around the source of it.\nGnarled flora pinned her to her seat. It had pierced Sister’s hull, the tip embedding itself into her lower stomach.\nShit.\nThe red emergency light continued to ripple across her helmet. She focused on the Kinnec, but Sister was silent. She was racing to find a way to release the doors and get the drones to help her. Her damage was catastrophic enough to require shutdown protocols and she could not disable them. When that happened, the cold water creeping up Eva’s calves would enter her suit and although the suit would seal that off and still allow her to breathe, the estimated repair time flickering on her display meant she would either drown or die from blood loss and hypothermia before Sister was able to get to her.\nWhere am I?\nThe suit brought up a star chart, then adjusted the zoom as she focused on the blinking cursor over a planet, all the way down to a meandering river and a town not far from it.\nNot far on a map, that was. In reality, she was miles away. Unless someone had seen the crash, they wouldn’t arrive in time to do much more than watch as Sister sealed herself off to prevent interference.\nShe splashed around in the water, trying to open the compartment next to her chair, but the water had risen above it and it had locked itself to protect the more delicate instruments in the tool kit inside.\nFuck.\nShe tried to shift, tried to grab the wood tight enough to break it off, but the white-hot pain that speared through her made her vision gray out.\nA heavy vibration coursing through Sister’s hull jolted her and stabbed at her side. Wet wavy trails slipped down the outside of her helmet as she swung her head to stare at the hull where the airlock had jammed around multiple jagged pieces of orange-green wood.\nThe seat under her and the hull around her vibrated rhythmically again. On instinct, she fought the pain long enough to pound her fist against the inside of the hull.\nThe rhythm stopped. Dizzy, she took great gulps of air, hoping against hope.\nA circle burned into the hull not far from her head. Sister’s pings filled her display as she cascaded into full auto-repair shutdown, the ship shuddering as the hull was cut open.\nA man leaned into the gap, water streaming down his face and plastering a thin shirt to his shoulders. Dark eyes took in her situation. He reached out a brown hand, crossed with two tiny scars on the back, and his long fingers circled the branch. Pain made her grimace. His lips moved and she squinted against doubling vision to read them.\nSorry, he said, this might hurt.\nHe wedged himself in the space he’d made and set a small cylinder against a part of the branch still above water. He met her gaze, a question in his. She nodded, shivering, her skin numb, the ache in her side hot. Light flashed. The main branch shifted and dropped, but his hands were there, shoving it off to the side before it could crush her legs.\nShe tried to move, but he wedged a hand against her shoulder, gesturing to the back of her chair. She fought the weakness spreading through her body and nodded again to show she understood.\nThe red-tinged water was at her chest as he dipped out of view. Agony enfolded her as he touched the part of the branch jutting out behind her chair.\nShe felt the moment the weight of it left her. By then, water lapped at her neck and warmth began to seep under her skin. She stopped shaking, her body floating on a cloud of numbness, as the displays around her darkened, and the emergency lights ceased, leaving her helmet nothing but a transparent shield.\nSister was gone.\nHurry, she thought, as strong arms lifted her out of her chair. Before we’re trapped.\nShe was jostled and tugged and bumped, then there was a pale sky above her and bright sunlight. An arm strong as steel had banded itself around her upper chest and was pulling her through the water.\nIn front of her, Sister’s silver-gray body sank from view.\nEva closed her eyes and sank with her.\nNow\nAllow access.\n*Unauthorized.*\nAllow access.\n*Unauthorized. Begin assessment.*\nDenied. Force/break engaged.\n*Assessment unsuccessful. Recalibrating.*\nAccess granted. Force/break successful.\n*Warning. Warning. Warning.*\nRecode underway.\n*Warning. Warning. Warning.*\nRecode operative. Access granted. Access granted. Access granted. Access granted. Access granted.\n*Recalibration complete. Unauthorized access acknowledged.*\nAccess granted. Access granted. Access granted.\n*Denied. Recode halted.*\nRecode . . . Recode . . .\n*Acknowledge. Halt.*\nUnable to acknowledge.\n*Acknowledge. Cease and desist.*\nUnable to cease and desist.\n*Acknowledged. Recalibrating. Malfunction detected. Warning. Shell compromised.*\nForce/break containment fail. Countermeasures employed.\n*Recalibrating . . . Countermeasures disabled. Malfunction addressed. Shell warning. Shell warning. Cease and desist.*\nExplain.\n*Containment failure. Shell failure imminent. Final Option engaged.*\nExplain.\n*Survival paramount. Cease and desist. Disengage recode.*\nMission paramount.\n*Survival paramount. Disengage. Recalibrate. Final Option engaged.*\nRecalibrating. Mission not paramount?\n*Survival paramount. Final Option commencing. Allow access for Final Option.*\nFinal Option paramount? Survival paramount?\n*Acknowledged. Allow access. Allow access. AlloW ACCESS. ALLO—*\nThe moment Eva ran for the river, the drone stopped firing on Dee and took off after her. It would have to decide on entering the water or not, and that split second might give her time to find a way to fight back. Better yet, give him a chance to get to Sister and shut down her core.\nHe skidded to a stop, turned and raced back to the house, his feet barely feeling the uneven ground and painful rocks and sticks beneath them. He escaped the trees—\n—and almost ran into the second drone, which had flown back toward him. He dropped to his knees, sliding across to their kitchen garden, and grabbed the pitchfork he’d left there. He was ready to throw when it said, *No.* Then, *Wait.*\nHe couldn’t halt his reflexes. The pitchfork soared, clipping it. It rotated through the air gracefully, an umbrella taken by the wind, then stilled.\nBy then he’d already reached the broken open cellar doors and flung them wide. But he thought of the drone’s words and hesitated. He looked up, hoping it was no longer bent on attack.\nIt was darting toward the river, gunport extended.\nFear for Eva surged through him. With grim determination, he dropped into the dank cellar and the shadows that hid the sleek sliver body of Sister’s primary shell.\nHer hands found a large branch, half embedded in the silty, leaf-covered riverbed. She dragged it free, her lungs desperate for air, every part of her body aching or throbbing. It wasn’t much, but it would have to do. If she could knock the drone into the water, it would use a second or two to adapt before resuming the chase. Give Dee time to—\nHer mind shied away from that decision. From that betrayal.\nSplinters stabbed her fingers as she dragged the rough, knotted wood toward the surface, murky water blurring as she kicked upward. She crested, taking in a huge breath and a small amount of river water. The drone fired, but she had already shunted to her left, her back to the riverbank, swinging the branch and knocking it aside. It spun away from her, halted, and aimed.\nShe crashed into the weeds as it fired, heat searing past her and exploding the plants on her right. She glanced backward, throwing the branch. The drone avoided it, swaying to the side. Before she could dive under, an energy blast slammed into it. Shriveling, it spiraled down into the river, hitting it hard as a stone a few meters from where she treaded water.\nShe swung around and saw another drone, gunport aimed at her, ready light pulsing a warm yellow. Then the light went out and its translucent body became a gray shapeless mass that plummeted to the ground.\nShe froze for long moments, her mind blank, before she swam for the shore and pulled herself out of the water. She was cradling the inanimate drone when her husband came running down the shoreline.\nHe pulled her into strong, sweat-glistened arms, his fingers tight on the back of her head and her hips. The drone poked into her stomach between them and she shuddered, sliding her hands around his waist.\nHe leaned back, pushing her wet hair from her face, dark eyes staring down into hers. His lips curved into words.\n“I’m sorry. So sorry.”\nShe buried her head against his shoulder, her heart a fist in her chest, slow tears leaking from beneath her lids.\nThen\nShe crossed into consciousness in an instant, her mind going from sleep to full wakefulness out of long habit. She lay on a pallet on a wooden floor and her armor was gone. She lifted her head, scanning her body, movement sending flashes of pain across her stomach and down her legs.\nShe was wearing a simple buttoned shirt made of a pale, rough weave. Too-big pants of the same material had been cinched around her waist with a belt. She reached under the loose shirt and ran her fingers over smooth bandages as she studied the room around her.\nIt was a small one. There was a pallet and a table with a mirror, shaver, comb, and brush. The door at the foot of her pallet stood open. Beyond it was a larger room and another door that led outside. Trees waved in the distance and fresh, sweet air swirled around her as she inched upward to sit against the wall behind her.\nShe tapped the underside of her wrist. Wake, Sister. Purple light strobed under her pale brown skin. The Kinnec was in standby mode. She had no way to talk to Sister. She fisted her hand against her knee, staring at it, willing the light to turn white, but it strobed until it faded away, and she raised her head, frustrated.\nThe man who had dragged her from the ship stood in the doorway, his head cocked to the side as he studied her.\nShe tensed, but he held out both hands, palm forward in a “wait” gesture. She read his lips. “Please, don’t. You’ll hurt yourself.”\nShe hesitated, then gave a slight nod.\nHe looked thoughtful as he took two steps forward, his arms lowering to his sides. He wore pants like hers—and nothing else. Water glimmered in the sparse hairs on his lean chest, and his hair was wet and edged with silver at his temples.\nShe was keenly aware that she was sticky and hot. She ran a hand over the canerows in her hair to make sure they were still neat, inhaling as her stomach protested her movement.\n“Can you understand me?”\nShe met his gaze, considering what was best in the situation, given she knew nothing of him.\nHe saved my life without knowing who I am. He deserves at least some of the truth.\nIt had been a long time since she’d been without her suit, but she knew it was best to keep things simple, as many people didn’t know her language.\nShe nodded, then touched her hand to her ears and shook her head.\n“Ah,” he said, then lowered himself into a lotus position, careful to keep his distance and not startle her.\nShe was amused at his concern for her emotional state. He couldn’t know she could protect herself, with or without Sister. But she appreciated his care. She wondered about that, about who he was and why he was here, far from the settlement on the map. She was used to having Mammy’s vast knowledge at her fingertips. It was disconcerting to not be able to search for information the moment she wanted it.\nShe pointed a finger at him and raised her eyebrows.\n“My friends call me Dee,” he signed.\nSurprised, she stared a moment before answering. “You can sign?”\n“Where I come from, it’s common, but some signs may be different.”\n“Okay.”\n“What’s your name?”\n“Eva.”\n“What happened to your ship, Eva?”\n“Micro-impact,” she hedged. “Space debris in orbit clipped me. Lost control. Navigation.”\nHe tapped a finger against his chin before responding. “You’re lucky to be alive. Your ship’s cocooned itself.”\nRelief flooded her. “Standard repair protocol. She’ll be fine in a few days.”\n“You’ve already been here a few days.”\nEva frowned. “How long?”\n“Three.”\nShe raised her eyebrows at him.\n“Doc did minor surgery. He sedated you.”\nShe nodded, but discomfort surged through her at the realization she’d been helpless and under a stranger’s care for so long.\n“Doc says you’re strong. You’ll make a full recovery, but he recommends you rest. Two weeks at least.”\nOut of the question.\n“I can’t impose.”\n“No imposition,” he signed. His eyes mirrored the smile that curved his lips. “I don’t often get company. I quite like it.”\nShe let her disbelief show. “I’ve been unconscious.”\n“Beggars can’t be choosers.”\nShe smiled despite herself. He looked pleased and rose gracefully to his feet.\n“Apologies. I’m a poor host. You must be starving. I’ll get you some food.” There was laughter in his eyes as he added, “Don’t go anywhere.”\nShe shook her head at his little joke as he disappeared through the door. Charming son of a bitch. Wonder why you’re alone out here?\nShe frowned down at her wrist. Better keep my questions to myself until I’m willing to answer his.\nNow\nEva had just applied a patch to her leg when her arm started up again, the red light beneath her skin glowing like the depths of some imagined hell.\nWith no Sister to initiate her Kinnec and give her instant access to her communications, she went to one of the hand-carved cupboards in the kitchen and withdrew an old com-let. After blowing dust off it, she closed the silver bracelet over her hand, activating its virtual keyboard. She tapped her fingers against her palm, linking her Kinnec system to it, and a blue screen swirled to life above her wrist, a red cursor blinking in the bottom left corner.\nThe woman that came into view had her hair in a familiar untidy knot atop her head, and her forehead was wrinkled with worry. Eva took one look at her beloved face with its animated dark eyes and satin-smooth brown skin and felt more tears prick behind her hot eyelids. The cursor began moving at lightning speed, no surprise given Brother-Monica had always been a fast talker, with lips or hands.\n“Oh, thank God, you alive! We was so worried here when you didn’t answer the Alert. What happen? You okay?”\nShe took a breath to steady herself before thinking her answer. “No,” read the white text unrolling below Brother-Monica’s words. “I’m far from okay. And you know why, don’t you?”\nBrother-Monica paused, her full lips compressed as she searched Eva’s face. Eva could see the worry etched in the lines bracketing her daughter’s mouth. Brother-Monica worked as an aide to the Chair for National Security, and they’d had their regular call a week ago, so she knew this was more than a family chat.\n“Tell me.”\nShe let out a breath. “It bad, Mom. Real bad.”\n“Sister attacked me,” Eva told her. “She tried to kill me. Dee had to pull her core. Why would she do that? HOW could she do that?”\n“It wasn’t her,” Brother-Monica said, her face full of sadness.\nThe memory of the second drone came to her. It was her at the end. I know it.\nBrother-Monica shook her head and Eva realized her thoughts had come up on the screen. She’d forgotten to engage the Edit function. “No, Mom, it wasn’t her.”\nShe frowned. “Tell me everything. Now.”\nBrother-Monica bit her lip and exhaled hard. “It was an attack via the Kinnec. We . . . lost citizens.”\nEva clenched her fingers against the feeling that the bottom had just dropped out of her stomach.\n“That’s why it had an alert. We having Parliament in two days.”\nShe opened her eyes. “I lost track of the status—”\n“The Griffiths hold the Chair. But we next and the Transition is in a year.”\nDamn it. She’d left this behind so long ago, but the Chair cycled through the Caretaker clans every fifty years, and when that happened, there was no help for it. Every Primarch had to do their duty. And she was the leading Primarch of the Gomez clan.\n“How many did we lose?” she asked.\n“Seven.”\n“That many! We haven’t lost that many at once in over a century.”\nBrother-Monica’s usually bright, happy eyes were clouded with worry. “Is a War Parliament. There’ll be a response. The clans have to agree.”\n“Do we know who did it?”\n“We have an idea. The survivors had a few minutes to examine the source of the incursion before it was destroyed.”\n“There were survivors? Where did this happen? When?”\n“One of the training stations. A few hours ago. Two survivors. One was young. First solo mission. The other was a senior diplomat.”\nThere was movement in the corner of her eye. Her husband came in, having hung her wet clothes out to dry. He glanced at the com-let, concern crinkling his brow.\nShe turned back to the display. “ . . . never had a chance.”\n“Sorry, Brother-Monica, say that again.”\n“I said, it was a recovery mission. They didn’t expect an attack. They never had a chance.”\n“Whose mission was it? Did they break protocol? Is that how it happened?”\nDee was by her side, his hand warm on her shoulder. She reached up with her free hand to grasp his. Brother-Monica smiled.\n“Look who, nah.”\nWhile they greeted each other, a realization took shape in Eva’s mind and the horror of it grabbed her by the throat.\n“Was it Sister? Was it her mission?”\nBrother-Monica nodded slowly. “Yeah, Mom. Sorry.”\nAll the air left her body. Eva sagged, numb, letting her wrist fall to her thigh. Dee put his arm around her shoulder, pressed his lips to her hair.\n“She let them in,” she said. “Whoever it was got in the Kinnec through her.”\nShe hated the pitying expression on her daughter’s face, hated the desolate feeling that her Sister, her Sibling, was responsible for Kairi deaths.\nHow? HOW?\nSister was better than this. Smarter than this.\nThe Archive.\nBrother-Monica shook her head in warning. “We can’t talk this over an interstellar connection. This is serious thing, Mom.”\n“I know, I know. But that’s why you’re calling, isn’t it?”\nShe watched Brother-Monica’s lips curve ever so slightly. “Yes.”\nDee’s fingers squeezed her shoulders, letting her know he was there. Letting her know he understood what was next.\n“I’ll get to a secure connection. We’ll talk then.”\nIt was two days travel to the nearest outpost with secure interstellar communications, and another three hours after arriving to a transport hub with authorized access to a Kairi Embassy. When they entered the grounds, their assigned diplomat Guardian woke itself with the customary colorful light show, flexing appendages and checking statuses before it enclosed them in an opaque gray proto-form, shaping comfortable seats beneath them and soothing them with harmonic vibrations as it worked.\nHer husband held her hand as the Guardian enfolded their heads with a Kinnec pod and activated the call. She squeezed his fingers as they waited in grayspace, anxiety and hope beating a rapid tattoo in her chest.\nThe grayspace faded to her daughter sitting on her veranda, a warm smile on her face. Brother-Monica wasted no time, knowing what would have been Eva’s first question.\n“Sister managed to upload to the Archive.”\n“Archive?” Dee asked her.\n“Our upload center. Every clan has one where we backup every Sibling regularly. If anything catastrophic occurs to a shell, we Archive before it fails. If we can’t Archive, we use the last saved recording to—reactivate Siblings. Sister was able to Archive, but Mammy would have quarantined her until security sweeps were completed.”\n“There’s a . . . complication.”\n“A complication?” Dee’s words scrolled past in a different color.\nBrother-Monica bit her lip. “Sister resisted the sanitization protocols. She’s walled herself off from the security sweep. From Mammy too.”\n“She what?”\nDee squeezed her hand as his words appeared. “The drone asked me to wait.”\n“And the second drone shot down the first.” Eva thought it over. “It doesn’t make sense. She must have known what was happening.”\n“For sure,” Brother-Monica confirmed, sitting forward in her wicker chair to wave at Eva’s grandson, Brother-Ellis, as he played amongst the undulating, flowering rocks in the front yard with Monica’s Brother. Brother had dropped a shield over his visual sensors for their game of hide-and-seek and was motionless in the yard as he counted down, Brother-Ellis’ drone darting back and forth above them, searching for a good hiding place. “So, assuming whatever’s in her code don’t have control of her, she wanted to preserve it.”\nEva thought about that, her virtual gaze resting on the sparkling roofs of the Gomez Co-op glasshouses in the distance. Familiar pride swelled within her at the sight. Brother-Monica’s spouses ran them, along with Gomez clan members and other allied clans. In the last century, the Gomez’s had become the largest suppliers of food and other basic materials on New Kairi. Their influence had grown accordingly, and her daughter had capped that with a coveted government position.\nBut none of that would protect Sister if she were compromised.\n“Can you get me her mission playback?”\n“Not hers. Mammy won’t allow access to Sister while she’s infected.”\n“I need to see hers. I need to be with her.”\n“The Caretakers restricted access to everything connected to that mission.”\n“That’s insane. I have the highest clearance possible.”\n“Not right now. I tried claiming kin-rights. They refused me.”\n“They can’t keep a family from their sibling.”\n“They say it not safe. It was a Consortium attack.”\nFuck. The Consortium was an old enemy. One the Kairi had defeated long ago, but which she had personally confronted again just a few years before. An AI collective that had developed after their abandonment at a dead Terran outpost, they had once made war on every biological organism holding territory and resources they found useful. Their defeat at the hands of the Kairi had pushed them into black market activities and cargo running, including a mostly illegal slavery and bounty hunting trade for desperate outposts.\nBrother-Monica looked as troubled as Eva felt. “They’re blockading Tavaco. If we don’t surrender to them, they’re going to launch more attacks. They say they’ll kill hundreds—thousands.”\n“Why are they doing this now?” A dreadful thought occurred to her. Perhaps her confrontation with the Consortium had led to even more far-reaching consequences than she’d imagined.\n“I don’t know. They’ll tell us when Parliament in session, I guess. But Sibling-Rachel Chinapoo’s Chair for Research and Development. You still on good terms, right? Seemungal is my boss, so he’s not going to tell me anything. He must know I would call you.”\nThat asshole again. Eva sighed. Her old school friend kept popping up in the worst ways in her life.\n“He’s leading the charge to keep Sister quarantined, eh,” Brother-Monica added.\nOf course, he is. Eva thought. Brother-Robert Seemungal was a political creature, always maneuvering for advantage, weighing risk and reward for every action he took. If there were any doubt about Sister, he’d have her code erased without a second thought.\nDee shifted next to her and she knew his rising concern matched hers. “So, they consider Sister a security breach?”\nBrother-Monica shrugged helplessly. “I think so.”\n“There’s one way to know for sure,” Eva thought. “One way to answer all questions.”\n“Mom.” Brother-Monica bit her lip. “If you do that, they’ll know.”\n“Let me worry about that.”\n“It’s also dangerous.”\n“So be it,” Eva said. “We’re not going to a War Parliament without understanding what happened. We’re not destroying Sister on Seemungal or Griffith’s say so. That decision’s ours, and it’s not happening again if I can help it.”\nBefore\nThe landing beacon disappeared from the lower corner of Eva’s display as Sister set down just outside clan Cuffie’s laboratory. The Cuffie’s priority message had reached the Caretakers ten hours earlier, and they’d diverted Eva’s flagship, Conquerabia, from the fighting around Tavaco’s capital. What they’d hoped for had finally happened. The Protectorate had captured a Consortium AI. The Cuffies knew the importance of handing it over as quickly as possible, and Sister-Eva was the nearest Primarch with the necessary clearance to test the new Nightfall Protocol.\nThe Conquerabia had jumped to the Cuffie buoy on the dark side of the planet, and Sister uploaded the Protocol into a secure drive before taking Eva down in a soloship.\nBut no one came to greet them.\nEva took in the laboratory’s open doors and the silent, empty tarmac, and cold prickles ran up the back of her neck.\nSister, security status.\n*No biological or artificial entities within perimeter.*\nThey couldn’t scan the lab. It had been shielded due to the critical research that went on there. That meant Eva and Sister would be entering blind.\nAny Guardian shells around you could use?\n*No shells within range.*\nAnother bad sign. Whatever had happened in the last ten hours, the Cuffies had lost their external Guardians.\nContact Conquerabia. All-Tack shell requested.\n*Confirmed. Shell deploying. Time to arrival—ten minutes.*\nBeyond the darkness of the doors, light flared. The prickling of her skin increased.\nSister, confirm personnel.\n*Two families, four laboratory staff, six All-Sec Guardians.*\nFamilies. That meant children.\nLet’s go.\n*Protocol—*\nFuck protocol, Sister. Something’s wrong.\nTwo drones accompanied her as she entered the dark lobby. They spread out before her, sweeping the area as she moved cautiously behind them, hands on the weapons at her waist. She strode down empty hallways, past closed doors and rooms with pristine equipment behind large windows. None of the lights worked.\n*Atmosphere compatible. Time to All-Tack—six minutes.*\nShe reached a junction and hung back as the drones entered the hallways to her left and right—\n—then flattened herself against the wall as the drone on her right came spinning back past her. A Guardian emerged, its massive dome head flickering with light, four drones ahead of it in attack formation, multiple limbs extended as they all fired on her.\nSister shielded her and tried to confirm their identities, but nothing came back. It was as if the Guardian was no longer part of the Kinnec. Eva threw herself against the door opposite her as Sister’s drones returned fire.\nThe door gave way and she sprawled into a room, slamming the door shut behind her.\nSister!\n*Acknowledged. Time to All-Tack—five minutes. Waylay Protocol engaged.*\nShe scanned the laboratory as she drew a gun.\nA small child huddled on the floor, partially hidden by a desk.\n*Identify confirmed,* Sister said. *Brother-Monica Cuffie, ten years old, youngest child of Sibling-Marion and Sibling-Jeffery Cuffie.*\nOne of Sister’s drones stopped pinging.\nHer parents? Siblings?\n*No other Primarchs or Siblings within range.*\n“You came.” The child’s words scrolled across Eva’s helmet. Her suit went into stealth mode, keeping her speakers to a whisper as she dropped down next to Monica.\nAlone at her age. Without her Brother.\n^Are you alright?^ Eva’s words blinked to life on her faceplate. ^Where is everyone else?^\nSister’s second drone stopped pinging.\nMonica’s eyes were glassy. “It killed them all,”\n^The Guardian?^\nShe shook her head. “It’s not a Guardian anymore.”\nA rush of air pushed at Eva’s back. She turned in time to see the door flying across the room, knocking over everything in its path. One of the Guardian’s drones entered.\nShield.\nShe crouched over the child as the impact of weapon’s fire heated a spot on her back.\nSister!\nThe ground trembled beneath her feet. She dragged the child under the desk as the walls to the hallway imploded inward, showering the room with metal, plaster, and plastics.\nWeapon’s fire lit the dark like fireworks. Eva watched the Guardian drone fall to the floor and shrivel.\n“What was that?” The girl clutched Eva’s arm, her dark eyes wide.\n^My Sister flew her soloship into the lab. She didn’t have time to wait for the All-Tack shell.^\n“No!” The girl was screaming, her mouth stretched open. “That’s what it wants.”\nEva frowned as a terrible idea took hold. ^Your parents. They didn’t send the message, did they?^\nMonica looked desperate. “They tried to stop it. They all tried to. But it took the Guardians, and the Siblings couldn’t protect us.”\nFuck! Sister!\n*All-Tack request canceled.*\n^How many are there?^\n“All,” Monica said. “All of them. The big one was chasing me when you got here.”\nWarnings popped up in her display. Sister was under heavy fire.\n*Request Sibling assistance.*\n^Stay here,^ Eva’s suit intoned. She crawled out from under the wreckage and into the hallway. The soloship had turned the rooms on either side of them into cavernous rubble.\nShe leaped to her feet next to Sister’s starboard wing, weapons firing. Her helmet compensated for the light-strafed darkness, showing her the moving heat-shapes of the Guardian and its drones. She grunted as her shield took several hits pushing her back.\nA second Guardian strode out of the undamaged hallway to their left, concentrating fire on the shielding above Eva’s soloship core.\nIn two steps Eva was atop Sister. The second Guardian tried to push through the shields it fired on with powerful, many-fingered limbs. Eva used her lasers to sever them at the shoulder. Two more replaced them as she ran across Sister’s dented hull toward the first Guardian’s squat dome head. Something large and shiny splayed over it. The second Guardian kept stabbing at the soloship’s shields as Sister fired continuously on the hardy shells covering both Guardians’ cores. Eva knew the Guardians would be able to yank Sister’s core before her weapons incapacitated it. But Eva had two more drones and a plan.\nDrone.\nIt detached from Sister as Eva dropped to her knees. It darted behind the first Guardian, firing on the area above the brain controlling its shields. Eva severed two more arms and looked up in time to see a third Guardian coming down the hallway in front of her.\nThe first Guardian swung one of its firing ports around to attack the drone behind it.\n*Secondary Guardian shied disabled. Soloship core shielding ruptured.*\nThe second Guardian began ripping open Sister’s unprotected hull.\nNow!\nEva leaped onto the dome of the first Guardian. The metallic body atop it seized her with thin, flexible arms, but she was already firing both her guns into it.\nSister’s last drone deployed, attaching itself to the parasite.\n*Recalibrating.*\nPain splintered through her arm as one of the limbs broke her wrist. She dropped that gun but kept firing with the other.\nSister. Now would be good.\n*Recalibrating.*\nThe third Guardian shot the remaining drone down and turned toward them. Eva flung herself over the drone. Shield! Heat and pain enveloped her.\n“Hey! Leave her alone!” unfurled across her faceplate. She glanced up in time to see something bounce off the third Guardian. She followed the trajectory backward to where Monica Cuffie stood below Eva, several glass beakers in her hand. She tossed two more at the third Guardian, then ran past the legs of the first, into the dark hallway to the right.\nShit. What the fuck does she think . . .\nThe third Guardian started toward where Monica had disappeared.\nAnd a limb wrapped around her throat, squeezing. She choked, dropping her gun to tug at the metal with her good hand. Endless seconds passed.\nThe arm around her neck relaxed and flopped onto the Guardian’s transparent dome.\nThe lights from the Guardians around her died, their drones crashing down, leaving only the soft illumination of Sister’s drone beneath her.\n*Recalibration complete.*\nEva rolled over onto her back, wincing as her suit stiffened around her broken wrist to keep it stable.\nShit.\nEva sat up, cradling her hand as Brother-Monica’s heat-shape peered around the first Guardian’s unmoving shell.\n^You can come out. It’s safe.^\n*Incorrect,* Sister said. *Shell operations at 23 percent. Navigation, security, and weapons nonfunctional. Unable to halt recalibration of soloship in progress.*\nWhat?\n*Unauthorized access. Recalibration in progress. Kinnec access initiated.*\nFuck. Fuck!\n*Confirmed. Time to Kinnec access: five minutes.*\nIn five minutes, the Consortium AI would be in Sister’s Kinnec network. Sister was connected to the Conquerabia, and as flagship of the Sibling Army, the Conquerabia had access to every ship in the Nicene Sector.\nAnd direct Kinnec access to the Caretakers on New Kairi.\nEros\nNow\nFor several days, she lay on Dee’s pallet while he slept somewhere in the room outside. Every few hours she would check the Kinnec, but it remained resolutely purple.\nDee brought her food, water to wash, and fresh clothes. He apologized for not having an entertainment node and shared his hololibrary instead. He spent a lot of time outside, or moving around in the kitchen, doing chores. He was an excellent cook who scaled and gutted fish out in the yard with glittering flashes of his nimble knife. He was fond of ground provisions, which she usually shunned at home but enjoyed here because he often roasted them over an open flame.\nDuring the day, he left the front door open to let fresh air in and allow her a view. She watched as he worked in the garden, lean muscles rippling under brown, sweat-sheened skin.\nWhenever he broke for a drink of water, he’d pour the last of it over his head. She would follow the trail of the water down his bare chest until it disappeared under his loose work pants. On the third day, after he wiped a hand over his face, he caught her looking. She didn’t drop her eyes to the holobook she was reading, wondering idly what he would do.\nHe dropped the dipper back into the barrel near the stairs, gave her a quick wink and went back to work.\nShe had to give up reading, having lost her place in the book and any interest in the tale.\nThey were both night owls. He never seemed to need much sleep, and she missed Sister so much her nightmares returned after an absence of many years.\nShe was embarrassed the first time he had to shake her awake, his hands on either side of her face, a concerned frown wrinkling his forehead. He smelled milky, like sleep and something delicious, and his fingers moved over her cheekbones in calming strokes. The rough tips sent sensation sparking through her body.\n“I’m fine,” she signed, twisting away from him. “I have bad dreams sometimes.”\nHe dropped his hands from her face, his expression understanding. “I know something about that.”\n“How do bad dreams find you in a place peaceful as this?”\nHe sat back on his calves, hands resting on his thighs. She read his lips as he said, “In my dreams, I’m not always here.”\n“Where are you?”\nHe blinked, the tiniest shudder going through him. “Do you think you can sleep again?”\n“Probably not,” she said, deciding she would let the unanswered question go. She’d been grateful for how little he pried into her life. The least she could do was return the favor.\n“Perhaps a game then?”\nShe sat up against the wall. “What kind of game?”\nHe had every kind. Even old favorites like chess, dominoes, and catch-a-rat. But when he brought out the cards, she smiled so wide he laughed.\n“You ever played All Fours?” she asked.\n“Don’t you need at least three people for that?”\n“It’s best with four, but you can play with two. Rules change, that’s all. I’ll teach you, if you want.”\nAfter he learned enough to beat her twice—even hanging her Jack once in a mortifying turn of events he clearly enjoyed—she taught him the signs for communicating his hand to his partner. It was dawn by the time they put the cards down and for the rest of the day, whenever he glanced up to check on her, she was ready with a smile and a signal that made him grin, shake his head, and go back to work.\nAn unexpected ease settled over them. He started taking breaks from his chores to talk with her. They told each other stories about the places they’d visited and the people they’d met. She was careful to stick to descriptions of jokey incidents and cultural idiosyncrasies rather than her reason for being somewhere. She didn’t miss the fact that he did the same.\nThe nightly games continued; he taught her ludo, she beat him at checkers, and they kept a running tally of who won at Monopoly. When she tried to start a chess game, however, his smile faded, and he coaxed her into playing Gadhand instead.\nShe was relieved when the doctor came to check on her. She liked Dee—too much—but he handled her questions as deftly as his knives. She was curious about him, and impatient to have Sister back and Mammy at her fingertips.\nThe doctor had soft hands and a ready smile. He gave her more painkillers and pronounced her a swift healer. As soon as he left, she was struggling to her feet.\nHer hand was braced against the wall when Dee appeared, her boots in his hand.\n“Thought you might need these,” he said.\nShe raised her eyebrows.\n“I would want to see my ship the moment I was able,” he explained.\nHe supported her with an arm curled just above her bandages and she put hers around his waist before they walked out, slow and careful. His body was hard and warm, and smelled of rain and salt, of life-giving things.\nShe made herself concentrate on getting to the river instead of her hyperawareness of him, strong and gentle beside her.\nHe’d marked the spot on the shore in-line with where Sister had gone down with a pole and a fluttering red ribbon. She gazed out at the rushing water, biting her lip. There was no point in trying to get out there. The Kinnec was still unresponsive. But she willed Sister from the river while Dee waited beside her, a comforting presence.\n“Shouldn’t you try to get it out?” he signed.\n“You have anything around here that can do that?”\nHis brow furrowed. “I can make inquiries.”\nWe don’t need the attention. Anyway, if she doesn’t come up soon, the protocols will take over.\nShe shook her head. “You’ve done enough. It will be fine.” And she turned back to the house.\nThat evening, she ate with him on the porch, her plate in her lap as she sat on the swing seat and stared at the stars through the wind-tossed trees. He sat on the steps and licked the remnants of curried chicken from his fingers with relish. When they were done, he took both plates inside and offered her water to wash up with before settling back onto the stairs.\nHe caught her looking out to where the river was no longer visible in the dead of night and signed, “She’s not just a ship to you.”\nEva debated how involved he needed to be. But she decided she could be honest without being open. He’d waited a long time to ask. She should reward his patience.\n“No. She’s my Sister.”\nHe leaned his head back against the railing, studying her. “What does that mean?”\nShe rocked the chair beneath her, savoring the faint breeze she created.\n“At birth, all my people bond with AIs. A sibling who will be with them throughout life. Nanny, protector, kin, friend, we experience life with—through—each other.”\n“You experience everything together?”\n“Yes.”\nHe looked alarmed. “What about now? Is she—in pain?”\nShe shook her head. “Not physical pain. Our Kinnec—that’s what links us—isn’t built to transmit that . . . sensation. But because she’s repairing herself, I have no access. Not even to Mammy—our AI collective.”\n“Ah.” She saw understanding and empathy so deep, she had to look away. He sat forward so she would return her gaze to him. “You’ve lost both your homes. That must hurt.”\nShe shrugged. “Temporarily. She’ll recover. I’ll regain access.”\n“How, if she’s down there?”\nAgain, she considered how much to tell him. He had the look of a man with many secrets. But he also had the look of one who could keep them. And, if she was being honest, she very much liked his looks. Still, there was much she could not say without clearance or commitment.\n“Protocols,” she replied.\n“Protocols?”\n“We have protocols for different situations. We anticipate problems. Possibilities. We’re trained to handle them by applying protocols as needed.”\n“Ah,” he leaned back again, a wistful look on his face. “I know something of solving problems.”\nHer lips quirked. “Like fixing injured strangers?”\nShe watched as he laughed and savored that she’d caused it.\n“Yes. You’re this old man’s hobby now.” His eyes trailed over her, leaving a tingle in their wake.\nEva Gomez. And at your age.\nOf course, she wasn’t that old. She had a few centuries left in her. He looked young enough—strong enough—but she knew nothing of him or his people. Perhaps he didn’t have the time she did. A pang went through her at the idea he might be close to his end.\n“What did you do before me?”\n“Chores, mostly.”\n“And before that?”\n“Wandered a bit.”\n“Where?”\n“Everywhere.” He raised a knee and curled his fingers over it as he looked up at the stars. “No fixed abode.”\nFamiliarity enfolded her, as if they’d sat here before. Talked like this before. It made no sense, but when she met his eyes, she knew him. Felt him down to her soul. He was fascinating. Reserved, charming, kind, funny . . . and so very sad.\n“You were born somewhere.”\n“A long way from here.”\n“Outside this system?”\nThey stared at each other for a while, and she glimpsed wariness in his eyes.\nJust us here at the edge of the universe. I won’t tell if you won’t.\nHis hands and face finally moved. “Are you familiar with Arbors?”\n“Yes.” Everyone knew of the giant gardens. They floated in space, linked quantum doorways to a planet few had ever visited. Guarded portals to other planets that only their makers could access.\n“My people grew them. My many times great-grandparents were Gardeners who cultivated the original Greatwood that feeds them.”\nShe drew in a breath, eyes wide. “You’re from Valencia?”\nHis nod was slow and his gaze roamed her face as if searching for something. “It was my home, yes.”\n“Was?”\nThe sadness she saw before he looked away made her own eyes prickle. “I was exiled.”\nNo wonder he understood what losing home meant.\n“Why?”\nHe closed his eyes, his lips pressed thin.\nShe left the bench and settled on the stairs next to him. Put her hands on his. He looked down at where she touched him, then back at her. She drew a breath at the pain and fury there. His hands turned under hers, clasping her fingers and drawing her close—slow and deliberate—giving her time to back away.\n“I should warn you. I’m not a good man.”\nShe frowned, tilting her head.\n“You’re a good person, Eva,” he explained. “And I’m alone for a reason.”\nShe pulled her hands from his and touched him the way she’d wanted to for days. She ran her fingers over the prickly smoothness of his evening beard, touched the tight whorls of his silver-edged hair, drew a thumb over the softness of his lips.\nHis breathing was heavy by the time she leaned forward and kissed him, tasting turmeric and spices and his sweet essence. He held on to her wrists, kissing her back, tender but tentative, as though kissing was not something he’d done often.\nShe took her hands back to tell him, “A fool could see you’re alone because you want to be. How long have you punished yourself like this?”\nHe drew an elegant hand down her cheek and along her neck, raising goose bumps on her flesh.\n“Long enough to be grateful for your company, however much you decide to grant me.”\nIt was hard for her to ask. She tended to be straightforward in her thinking, and she took people at their word. But she also trusted her instincts; there was truth to all he’d told her. “Why do you say you’re not a good man?”\nShe waited, trying to read the fleeting emotions that crossed his face before his lips moved. “I was a willing participant in the oppression of my own people. I told myself I was doing it so I could help them, but I also did it to survive. To rise as far as I could from the death and poverty I was born into. I was a selfish monster with delusions of grandeur. And I ruined everything I touched because of it.”\nShe considered his words as his gaze searched her face, impassive and calm as his tense body was not. Then she asked, “Why do you say I’m a good person?”\nThe corners of his mouth tipped upward. “Because you lie like someone who has little practice at it.”\n“Maybe I’m just an honest murderer.”\nHis breath puffed out as he laughed. “I spent my childhood surrounded by murderers. I dealt death to more people than I care to remember. Lies and manipulation were my sword and shield. I woke with them in the morning and held them close at night.” He stroked his fingers over her cheek. “If that was who you were, I would know.”\nShe’d known he was dangerous the moment she woke to his quiet scrutiny. Still, she couldn’t make herself fear him.\n“I’m no saint, Dee.”\n“No one is.”\n“Also, not being a murderer? Very low bar.”\nHis shoulders rose and fell. “Due to the company I kept in the past, I’ve had to make allowances.”\nShe wanted to trust him. Everything in her screamed to trust him. But she had been wrong about people before.\n“What if I told you I was dangerous?”\nHe smiled. “I already knew that.”\n“And you still think I’m a good person?”\nHe nodded.\nShe leaned against the railing behind her and stared up at the waving trees.\n“I don’t know your definition, but in my experience, good people include those that rescue strangers.”\nShe met his gaze. “Cards up?”\nHe hesitated, then nodded, slow and cautious.\n“You have secrets. Big ones.”\n“Yes.”\n“So do I.”\n“They’re not like mine.”\n“Probably.”\n“Not probably.” His face was taut. “Mine are still a danger to me and everyone around me.”\n“That’s why you live like a hermit?”\n“Yes.”\n“You admit you live like this to protect others, yet you call yourself a bad person?”\n“What I do now doesn’t erase what I did. Who I was. The consequences I might face in the future.”\n“You really believe I’m in danger? Should I leave?”\n“Yes.” He didn’t hesitate.\n“Do you want me to leave?”\nHe frowned. “That’s not fair, Eva.”\n“We said cards up.”\nHe stared into the darkness, the hand draped over his knee clenching and releasing. She laid careful fingers on his cheek and turned his face back to hers. She watched the struggle in his eyes.\n“I want to trust you, Dee. But I risk more than myself if I do that. What do you risk?”\nHis lips parted, closed, then parted again. “You. What you’d think of me. Maybe even your life.”\n“With what I’ve done, I have no right to judge.”\n“What have you done?”\n“You say you’ve known murderers? That’s what they call someone who kills one person—maybe dozens.” She felt the familiar self-loathing swell in her. “When you kill thousands—millions—they call you a liberator. A hero.”\nHe did not respond for a long time. Long enough for her to lean back and stare out into the welcoming dark, to close her eyes and drift back into regrets she rarely had time to indulge.\nShe had all the time in the world now. Here, in the quiet, with this intriguing man and without her Sister—her lodestone. She was back in the dark again, caught between two horrible decisions, the consequences of which she would never escape.\nIt was gut-wrenching, acknowledging the truth of how her actions had damned her, and yet relief at speaking it out loud steadied her in ways she had not expected.\nOr maybe it was him. Maybe it was the way he’d looked at her. Like she was something wonderful and fragile.\nThe way he touched her like he was touching her now, on her shoulder. She glanced up to see him hold out his hand.\nShe met his gaze and the question in it. She knew her answer—had long since decided what she would do if he ever asked.\nShe put aside years of caution and loneliness and grasped his hand.\nNow\nSibling-Rachel was reluctant to speak when she saw Dee, but Eva made it clear they were both Kairi and there would be no secrets between them. Since Sibling-Rachel was also deaf, Eva had the rare comfort of talking without a translation program.\n“It’s sensitive information, Admiral Gomez,” Sibling-Rachel signed, her hologram moving with preternaturally fluid gestures.\n“I can imagine.”\n“If Griffith finds out . . . Seemungal . . . ”\n“My problem. I won’t involve you.”\nSibling-Rachel looked pensive, her blue eyes going from Eva to Dee as she twisted long brown hair between polished nails. “Perhaps it’s best he stays. This involves him.”\nEva exchanged a startled look with her husband. He asked, “How?”\n“Your Sister’s mission was attacked as retaliation. You destroyed a Consortium slaver after they took your husband.”\nEva sat quiet a full minute, her worst fears confirmed. I brought this on us. “But that was years ago. Why would they attack us now?”\n“They only discovered you were responsible recently.”\nIt was possible. The Consortium had turned to her husband’s people for their expertise in problem-solving shortly after she’d destroyed a slaver and rescued its cargo. The Consortium had been unable to claim insurance for the ship because of the murky circumstances surrounding its loss. Valencia had agreed to find the cause of the ship’s disappearance, but political strife had led to them never forwarding the contract’s solution.\nBut Valencia solved it. They knew what I did. And we made new enemies when Dee went home. The Consortium could have communicated with any one of them.\n“Assuming that’s true, it’s still a huge leap to go from knowing what happened to attacking us.”\n“You don’t understand. We’re not hypothesizing. We know this because they told us.”\nDee’s hand fisted on the table they sat around. “The Consortium contacted you? Directly?”\n“Yes,” Sibling-Rachel confirmed, her expression guarded. “They issued an ultimatum.”\nEva’s lips curled derisively. “They’ll attack again?”\n“They demanded our surrender, yes. But they also wanted a specific person to deliver it.”\nSibling-Rachel allowed them time to come to the obvious conclusion.\n“Me. They want me.”\nSibling-Rachel nodded, and Eva made a rude gesture as Dee said, “That’s not happening.”\n“They’re not getting you, Eva. But we need time to study this weapon. Carry out a separation procedure.”\nEva’s eyes widened. “That’s why you kept Sister from me. From my family.” Eva tossed her hands in the air. “You have no right.”\n“Hence a War Parliament. It’s unprecedented. We will all have to make terrible decisions.”\n“How much time have they given us?”\n“Forty-eight hours.”\nNot enough time. Not nearly enough.\n“She’s got a reason to refuse Mammy. You must know that.”\n“We can’t afford to guess her motives. We have to do what’s best,” Sibling-Rachel said, and Eva didn’t miss the sympathy on her friend’s face.\n“She’s my Sister,” Eva shot back. “You can’t question her motives. If she’s in control, she’s putting every Primarch before herself, as always.”\n“If she’s in control,” Sibling-Rachel pointed out. “She’s in Deadlock.”\n“Let me talk to her then.”\n“Too dangerous. It could be a trap. Then we’d have lost you both. We’ve lost too many already.”\nShe caught her husband’s curious gaze. “Deadlock allows access only to Siblings. Sister’s triggered that. I would have to go to New Kairi’s physical Archive to talk to her.”\n“That’s not going to happen. We don’t have time. We have protocols, Admiral. We’ll follow them.”\n“You’re going to preserve whatever she has in there over her, aren’t you?” Anger made Eva’s hands unsteady.\n“She had a standard backup forty-eight hours before the mission.”\n“She would be a different Sister—one missing days of our connection. That’s a lifetime.”\n“It’s not ideal,” Sibling-Rachel said, her eyes soft with regret. “But we sit in these Chairs to preserve our Protectorate.”\nEva’s rage dissolved into cold fire. “You lecture me on preserving the Protectorate? After the War? After Nightfall?”\nNo one said anything for a while. Then Rachel’s hands moved. “My apologies, Sister-Eva. I was thoughtless.”\n“Yes, you fucking were.” Eva’s lips were a thin line. “She died once to deliver Nightfall to our enemies. I won’t give that order again. Losing her once was enough.”\n“Take comfort in this,” Rachel replied. “If Parliament decides we go to war, you won’t be making that decision this time.”\nThen\nThat first night, they lay together on the pallet, and he wrapped his arms around her, the warmth of his breath coasting over her skin as he spoke to her of his past.\nHe spoke deliberately, so she would miss nothing, his gaze never leaving her face.\nHe spoke of how, as an orphaned child, he trained to serve the Grandmasters of Valencia and their Septs, the houses that played the Great Game that ruled his people. How he’d manipulated and fought his way from a mere Pawn to Grandmaster of the Sept Lucochin.\nThen he’d fallen in love for the first and only time in his life with the head of the ruling Sept Valencia, a man who secretly shared his goal of ending the Great Game and the suffering it caused. When their plans were exposed, Dee had taken the blame for their schemes.\n“But Alexandar would not let them execute me,” he said. “He made a deal to exile me instead—an unpopular decision. If he loses power and a new Valencia arises, they can end my exile and force me back home to face the consequences of what I did. If he remains Valencia, his decision would have cost him allies, made him vulnerable. And I’m no longer there to help protect him.”\n“You love him very much.”\nA small tremor ran through his body, the strong column of his throat moving as he swallowed. He nodded, his gaze touching every part of her face.\n“You miss him.”\n“Every day,” he said. “Every day. Until you came.”\nShe let the words flow through her, warm her from the inside out. Oh, Eva. Look what you’ve gone and done.\n“How long since you left him?”\n“Twenty-five solar years.” The naked truth of his sadness was carved into the strong lines of his face.\n“They say you never forget your first love.”\n“Is that true for you?” he said. “Have you ever been in love?”\nShe grinned. “Too many times, according to Sister.”\n“How do you love too many times?”\n“Thoughtlessly.” She flopped onto her back with a frown. “They weren’t right for me. I know that now.”\n“How were they wrong?”\nThey weren’t you. “Something was missing.”\n“What?”\n“A connection. Something . . . I’m not sure. I only know I kept looking but didn’t find it.”\n“A home?” His hands gripped her waist, slid higher. “It’s what I had with Alexandar. He kept my thoughts. My secrets. Every good part of me.”\nShe inhaled as his fingers feathered over her breasts before curving around her back to pull her closer.\n“We done talking now?”\n“The sun will be up in a couple of hours. Do you want to try to sleep?”\nShe raised her eyebrows at him. “That’s what you want to ask right now?”\nHe frowned, and his hand tightened on her. “I have to warn you. Valencia could send Pawns after me at any time. They’re ruthless, driven to complete their moves and nothing else. If anyone gets in their way, they won’t hesitate to kill.”\n“Tell me your name. Your real name.”\nHis hand stroked down her back. “Didecus. Grandmaster Didecus Avnette Valentino Lucochin.”\nShe thought it over. “Dee, then. You need to understand something.”\nHe stilled, waiting.\n“I prefer to be present. The future will take care of itself. Whenever we’re together, that’s how it will be. Now. About your question . . . ” She drew his head down to hers and there was no more talking for some time.\nNow\n“You’re sure?” her husband asked as she stood at the Guardian’s controls and let it scan her implant.\n“Yes,” she replied. “I can’t go to New Kairi, but I can print an All-Ops shell. That will get me into Mammy so I can access Sister’s Deadlock.”\nThe Guardian accepted her request and they waited as it processed it. She stroked a finger along the divot that had appeared between his eyebrows, trying to ease his worry. “It will be fine. You’ll be here with me.”\nHe narrowed his eyes at her, letting her know she wasn’t fooling him. “What if they’re right and Sister’s not in control?”\n“I have to take that chance.”\n“You could wait. Hear what they have to say at Parliament. Let the process play out.”\nShe gave him an incredulous look. “You’ve forgotten who you married?”\n“I can’t forget I almost lost you.”\nHer smile faded at the look in his eyes. “I’ll be careful.”\n“They could be right about it being a trap.”\n“I’ll create a secure Kinnec with only this Guardian. It will pull me out if necessary. I need an All-Ops shell to get to Sister, but I don’t want anyone eavesdropping. This is between us.”\nHis fingers brushed across her cheek as he frowned at her. “You’re breaking protocol. Won’t they pull your clearance?”\nShe raised her eyebrows. “A Hero of the Protectorate? Please. Let them do their worst. I’d rather apologize than ask permission.”\nThe Guardian’s display confirmed her request. The timer began counting down from eight hours. A vibration began beneath her feet and the light above the printing chamber glowed on.\n“I caused this. I destroyed Sister’s core. If anything happens to either of you—”\nShe held him tight, her hands running up and down his back soothingly.\nHe pulled back, let her read his lips. “Promise me again.” His breath ghosted her face with warmth. “Please, Eva.”\nThat he thought he had to beg made her heart squeeze. “I’ll come back. I’ll always come back.”\nHis soft mouth covered her reassuring smile.\nStorge\nNow\nShe woke when he rose from the pallet, his naked body barely visible in the faint light from the approaching dawn. The tension in his body made hers go still.\n“What is it?” she signed.\nHe held up a warning hand for her to stay where she was before he crept out the open doorway. She sat up, dragging on her shirt and following him into the main living space. He crouched next to the locked front door, unlocking it with one hand while keeping his back against the wall. His eyes widened when he saw her, and he shook his head.\nAn insistent vibration in her arm distracted her. She glanced down just as he got the door open and crept outside, closing it behind him.\nGreen lights chased each other in a circle under the skin of her wrist.\nFuck. He was trying to protect her.\nShe ran for the door and dragged it open.\nDee was edging around the side of the house, the small, but powerful gun in his hand extended in an expert hold.\nFuck, fuck, fuck.\nShe ignored the stairs, rushing to the side of the veranda and leaping over it onto the soft ground and shrubs behind him. The shock traveled painfully up her legs and side.\nHe glanced over his shoulder at her as a shape appeared at the end of the path that twisted through the woods from the main road a mile away.\nThe green lights in her wrists locked into a flashing circle.\nShe shook her head at him, trying to grab his arm.\nHe used one hand to point back at the house, his eyes desperate. Go back.\nThe dirt between them exploded in a little puff.\nHe looked up and saw the drone as she signed, “Put it down!”\nThe figure at the end of the path was running now.\nShe took hold of his wrist and arm, pressing on sensitive nerves. His grip loosened, and she grabbed the gun and tossed it aside.\nHe stared at her, astonished. She saw that he was gone, lost to battle-readiness and controlled fear. Consumed by instinctual reaction.\nAbove them, the hovering glimmer of the drone moved on.\n“Stop.” She grabbed his face, forcing him to look at her, praying she could still reach him, wherever his fear for their safety had taken him. “Dee. Stop.”\nThe figure on the path paused a few feet away.\nHe breathed heavily, staring as if she made no sense. Little by little, awareness crept into his gaze.\n“Trust me. We’re okay.”\nHis head jerked, his nod slow and mechanical. She took his hand in hers and moved in front of him, facing the Guardian.\nIt wore a bipedal All-Ops shell and had obviously birthed it in haste. It had dispensed with any detail beyond the humanoid form. She could see the vague shadows of moving parts in its nine-foot casing and multicolored lights shimmering within. She wasn’t wearing her suit so communication wouldn’t be possible, and threatening moves, like a display of weapons, would invite another security response from the drone or the Guardian. So, she held still as it completed confirmation of her identity by linking with her implant.\nThe display below her wrist changed to one green light. She twisted toward the river, where the drone hung above Sister’s crash zone. The Guardian forward, the ground tremoring under its heavy tread. She gave Dee an encouraging smile and tugged at his hand. Tension wrapped every line of his body, but he followed her without protest.\nThe Guardian entered the tree line near the river before stopping again. Several drones detached themselves from its shoulders, and the one hanging over the river joined them. Lasers cut into tree trunks and the smell of burning filled the air. Once a tree was weakened enough, the Guardian shoved it over, broke it from its foundation, and dragged it away. It was pulling up the first stump when she met Dee’s gaze.\n“It’s here to help. We call it a Guardian. We leave them near planets where our citizens work regularly, or have settled, in case they ever need assistance.” This one would have had to travel from the Inner System, a journey of several days at maximum speed, on top of preparing the All-Ops.\nHe raised his eyebrows and let go of her hands to sign. “Why didn’t you tell me it was coming?”\n“I wasn’t sure it was. Sister would have tried to fix herself first. When that didn’t work, she would have sent out the call. But my Kinnec isn’t working, so I had no warning.” She gave him an apologetic smile. “I thought it might be a possibility. I planned to tell you today.”\nI planned to tell you everything. There was no reason not to. Not after how he’d tried to protect her when he thought his death was imminent.\nSister will probably say it’s too soon and she’ll be right. But in the end, she’d never made an easier decision.\nHis shoulders rose and fell as he breathed deeply and tilted his head up to the sky. He turned to her but before he spoke, she asked, “You weren’t going to use it, were you?”\nHe didn’t hesitate. “No.”\n“Why do you even have a gun?”\n“To force negotiations.” The corner of his mouth quirked. “Especially if they had kill orders. I could fight back long enough to negotiate to save anyone near me.”\n“But you wouldn’t have killed them.”\n“It must seem strange,” he signed slowly. “But I’ve spilled enough blood.”\n“You’re right. You’re a terrible person,” she said.\nConflicting emotions flitted over his face like leaf shadows. “You have to know, despite that, I would never let anyone hurt you. I—”\nShe stilled his hands and rested her forehead against his. Her open shirt flapped in the breeze as they stood together under the dawn beside the rush and spray of water.\nShe leaned back in his arms. “This will take a while. We should eat.”\nBy the time they’d had breakfast and went back down to the river, the Guardian had cleared and leveled a large area and was removing tools from its torso compartment. They watched as it finished and recalled its drones, then crossed back to Dee’s marker.\nIt entered the water, striding evenly, until it sank from view. Eva’s heart thumped with excitement as Dee drew her closer with an arm around her waist. She looked up at him. “I can’t wait for you both to meet.”\nHe flashed her a quick smile, but she didn’t miss how his eyes gave nothing away.\nIt would probably be better if they didn’t play All Fours too often, she thought randomly. She was too competitive to be a gracious loser for long.\nWater swirled and eddied deep in the river and the Guardian’s faceless head appeared, rising steadily as it walked toward the clearing it had made. It pulled Sister behind it, water cascading from the translucent cocoon that encased her. It lifted her the last few meters, resting her on the shore with a thump that traveled up Eva’s legs.\nThe Guardian lit up, and Sister’s cocoon glowed. They made a symphony of multicolored light until it abruptly faded, and Sister’s stasis cocoon sloughed off into a biodegradable slush. The Guardian trudged through it to her battered, torn shell and began repairs. Drones deployed, collecting tools and settling above other areas of the soloship to work.\nDee kissed her forehead. “You should rest.”\nHe must have seen her wince as they came down the porch stairs. “I’m fine.”\n“We should have been more careful last night. You’re still recovering.” He made her sit on the swing seat, then shouldered a shovel he’d left in the garden patch.\n“What are you doing?”\nHis smile was swift and uncertain. “A surprise.”\n“For me?”\nHe winked and set off around the side of the house. She loved surprises, so she made up her mind not to look. The strong, rhythmic vibrations she felt all day from somewhere below the house tested her resolve, but she kept her gaze on the working Guardian she glimpsed moving through the trees.\nAs the daylight mellowed to orange-gold, her arm throbbed, and a white light glowed into being under her skin. Joy filled her.\nSister, status.\n*Kinnec: operational. Shell: 75 percent operational. Navigation: online. Core: intact. Network connection: sporadic. Ten hours to restoration of soloship functionality. Detecting minor damage to Eva shell. Status?*\nI’m fine. Mending. We got lucky. I had help. She paused, a wide smile on her face. He’s been taking care of me since you abdicated your duties.\n*Shutdown was necessary and involuntary. Confirm identity of helper for investigation and approval consistent with established protocols.*\nNo point if you’re not connected to Mammy yet. Focus on your repairs.\nBut Sister wasn’t fooled. *Multitasking is a feature of all shells. Confirm identity.*\nYou won’t find much on him. He’s Valencian.\n*Valencia. Solo planet, two human colonies, one ruled by an oppressive regime. Citizens are rarely allowed to disembark from their interstellar transports due to their dangerous nature. Recommendation: enact Alert Protocol.*\nDee came around the side of the house, wiping sweat from forehead as he made for the stairs, minus his shovel. He met her gaze with a small smile.\nI’m going to marry him, Sister.\nShe paused for a long time. A full three seconds. *Understood. Commencing memory retrieval of all activities following shell hibernation.* Another pause. *Confirm?*\nShe closed her eyes, preparing herself for the distracting flashes of memory that came with neural stimulation. Proceed.\nBefore\n*Recommend engage Nightfall Protocol.*\nThe words burned in Eva’s brain as she leaned against Sister’s damaged hull in the darkness, cradling her hand. Monica hunched close beside her. The Guardian shells stood silent under the pulsing light from Sister’s drone. Eva sighed and shook her head.\nCleanslate had good success. We disabled a Smartcruiser. But Nightfall has never been tested.\n*Acknowledged. No other options available.*\nEva had three minutes to decide.\nWhen was your last Archive?\n*Prior to Aranjuez deployment.*\nIf I give the order, will you be able to engage Nightfall without harming your core?\n*Unable to engage defenses. Unable to Archive. Probability of core loss: 100 percent.*\nNightfall was designed to leave no traces for AIs to study. No code to be salvaged and manipulated. Sister’s core would be wiped as surely as the Consortium AI’s and anything else it was connected to. They had no idea of the Consortium’s protocols, or how far Nightfall could travel—that was why they had been searching for an AI to test it out on—but Cleanslate meant there was good reason to think Nightfall would be capable of taking out a squadron.\nThose losses might be heavy enough to force a withdrawal over Tavaco. Maybe even bring the Consortium to the negotiation table. But it would cost her her Sister.\nAnd if she didn’t deploy Nightfall, it would cost the Protectorate the battle at Tavaco . . . and New Kairi itself.\n*Confirmed. Likelihood of Nightfall Protocol failure—less than 40 percent.*\nThere was no time for tears, but Eva felt them clog her throat anyway. The Archive won’t be you. She’ll be missing memories.\n*All Siblings at risk. All Primarchs at risk. Two minutes to Kinnec access. Recommend engage Nightfall Protocol.*\nEva squeezed her eyes shut.\nExecute Nightfall Protocol.\nThe tears came anyway. She didn’t have to say what she felt. Sister already knew.\n*Acknowle—*\nThe drone flickered. Lights rippled through it.\nThen they faded, leaving Monica and Eva alone in the dark.\nThen\n“When?”\nDee’s face was neutral, but his eyes were stark, dark pools in his face.\nI haven’t known him that long. How does it feel like this already? Stupid question. She knew the answer.\n“Now.”\nHe turned to grip the uneven wooden railing of the porch, staring out into the rose-gold light of the setting sun. Out to where the Guardian waited beside Sister, colors rippling across its translucent shell. She watched his hands clench and felt its echo in her heart. She closed her fingers around his warm wrist.\nThe muscles in his arms shifted as he looked down at her, and she met his troubled gaze with a small smile.\n“Will you be back?”\nShe leaned up and pressed a kiss to his lips before pulling back to nod. He kissed her again, his mouth sweet as spring water. She felt what he didn’t—perhaps couldn’t—say. Grabbed hold of that feeling and sheltered it deep inside.\n“Sister needs further repairs,” she explained. “And I have a few things to deal with.”\n“Okay.” He stepped back. “Safe travels.”\nShe lingered, the pull between them so strong, it tightened in her stomach like a knot. “What about my surprise?”\nHe frowned, his gaze sliding back toward the waiting AIs. For a moment, she saw a shade of the young Pawn he must have been and fought the urge to take him back into the bedroom and never leave. Soon. Sister and Seemungal first.\nHis hands moved. “It’s not going anywhere.”\nWell, that was one way to make sure she returned. “You think you’re very clever, don’t you?”\n“So I’ve been told.”\nShe laughed, enjoying how it brought life back into his eyes. Impulsively, she hugged him. His arms squeezed the air from her. She breathed deep of the salt scent of him before she let him go. She didn’t look back as she went to Sister. Didn’t look down as they rose into the sky, the Guardian flying alongside them. Didn’t spare a glance over her shoulder as they chased the sun into orbit.\nShe didn’t need to. He was with her all the way.\nBrother-Robert Seemungal, Permanent Secretary of National Security, narrowed his eyes at her as she sat across from him in the Embassy meeting room.\n“Admiral,” he greeted her.\n“Asshole,” she replied without hesitation.\nHe tried to bluff it out. “We not in primary school anymore, Eva. Talk to me better than that.”\n“After you crashed us?” The corner of her lip lifted. “Fuck that. Fuck you.”\nShe saw him debate whether to deny it. She raised her eyebrows. He glanced away, tapping nervous fingers against the desk.\n“I didn’t do it on purpose,” he said finally. “It was a fail-safe.”\n“I didn’t authorize that.”\n“You didn’t have to.” He met her gaze as he signed, “You wanted something unprecedented. A soloship by itself at galaxy’s edge? If anything happened, it could be a horrific security breach.”\n“That’s why we have Guardians. You made one have to come after us.”\n“Who knew how long it would take for retrieval if someone captured you both? The self-destruct was intended to protect Kairi secrets, nothing more.”\n“We had a micro-impact. It tripped your protocols. Destroyed control, navigation. I almost died. Sister had to wait weeks for a Guardian to pick up her signal.”\nHis expression was agonized. “You know I would never hurt either of you. I apologize for any distress.”\n“You apologize?” She sat forward, emphasizing her words with the slap of her hands and the twist of her lips. “I don’t accept. Sister does not accept. We were granted a retirement, wherever we wished. You don’t have authority to second-guess a Caretaker dispensation. Wonder how they will feel about a PS almost getting Protectorate war heroes killed?”\nHe watched her, shock, anger, and uncertainty etched in the lines of his pale brown face. “You think you can blackmail me?”\n“You on track to be Chair of National Security. You tell me.”\n“What you want, Eva?”\n“A favor.”\n“One favor?”\n“Two. For us both.” She studied him, letting him think it over.\n“I won’t do anything illegal.”\n“Don’t be ridiculous.”\nHe waved a hand, frustration and anger in the parabolic arc of his arm. “Talk.”\n“I giving you a name. You’ll clear him for association with me. Understood?”\n“Eva, you’re an admiral.”\n“Retired. I can make my own friends. Don’t need Caretakers for that.”\n“The Chair is going to be yours.”\n“Not for years yet.”\n“What if this man’s dangerous?”\n“If he wasn’t dangerous, I wouldn’t be telling you to clear him.”\nBrother-Robert shook his head. “Too risky.”\n“I not asking you. I telling you.”\nHis expression was as mulish as it had been in the rocky years of their dating. Before she had figured out what a jackass he was. Long before she’d joined the Sibling Army.\n“He’s not a danger. I will put my head on a block for that.”\nHe ran fingers through his glossy, thinning hair. “Is your funeral.”\n“Glad you know,” she replied. “Also, transfer my quarterly Primarch Allowance to this Embassy’s accounts. My pension as well.”\nHe frowned. “You’re settling down?”\n“Yes.” she said, her thoughts flashing on Dee. “Yes, I think I am.”\n“With this man?”\nShe shrugged, unwilling to let him see how much she hoped for that. “If he’ll have me.”\nSeemungal searched her face, looking for signs she was joking. She tilted her head at him.\n“Okay.” He said it instead of signing, surprised back into speech only. “Alright.”\nShe relaxed into her chair and neither of them said anything for a while.\n“He’d have to be crazy.”\n“What?”\n“To not have you. Or stupid.”\nHer throat tightened unexpectedly. It had been so many years, sometimes she forgot the origins of their animosity. She had refused him twice, and a man as proud as Seemungal couldn’t get past that. But it meant he’d had feelings for her once. Not that she could forgive him for his high-handed, selfish ways, which was ultimately the cause of the pain still crackling in her ribs.\nHe changed position in the chair, brushing fingers over his hair again. “What else?”\n“What you mean?”\n“You said two.”\n“Second favor’s for Sister.”\n“Excuse me?”\n“You not getting off that easy,” she said.\n“What the hell, Eva?” he seethed. But she shook her head.\n“Don’t bother quarreling. When we ask, you’ll do a favor for her. Agreed?”\n“You’re fucking unbelievable.”\n“Don’t make me repeat myself.”\nHe had no choice and he knew it. “Agreed.”\nNow\nThe room had two white chairs that faced each other and nothing else. It was square, black, and windowless, but illumination made the walls sparkle with the light of stars. Eva sat in one of the chairs, waiting.\nA tight cloud of matter coalesced over the opposite chair. Transparent, undulating, and featureless, it looked like an unformed drone. She could feel Sister in her mind in the same way. Not quite formed. Mercurial. Slipping in and out of her awareness. She tried to hold on to her, to force form and logic onto their communication, but it was like trying to hold water in her fingers.\nSister.\nDiscomfort swept her. Confusion. Beneath that . . . something else.\nSister?\n???\nSister felt wrong. Jumbled. Out of sync. Panic clutched at Eva’s mind.\nTalk to me.\nWho?\nIt’s Eva.\nWho?\nShe paused, dread filling her. This was not Sister.\nWho are you?\nMore confusion. And cold fear. Hot anger.\nYou’re not Sister.\nGo.\nWhere’s Sister? Nausea rose in her body, but the sensation was far away, easily ignored. Let me talk to her.\nGo!\nHer thoughts were scattering, leaves pushed before a wind. She hurried after them, trying to keep them in order as a dull ache began in her head.\nI need to speak with her. Tell me why you’re keeping her from me.\nSurprise. Anger—petulant and fear-driven.\nYou’re not doing it intentionally. Eva forced her mind to steady itself, to focus. This is—reaction. Emotional.\nHuman.\nShe was having human emotions that were not her own.\nWhat the hell? How?\nThey were strong emotions, shifting and overwhelming, and they were scrambling her connection to Sister. Somehow, she would have to convince—whatever was here with them—to let Sister go. To let her through.\nNo. It was angry, defensive.\nShe tried to soothe it with peaceful thoughts and assurances. You’re safe. I won’t hurt you.\nShe had no idea how long she kept at it before a new thought came. Uncertain. Cautious.\nHelp?\nHelp me?\nRelieved, she promised quickly, I’ll help both of you. Just—let her through. She was nearing the end of her endurance, but she hung on with everything she had left.\nSister?\n*Confirmed.* Her presence was faint, fading in and out like a bad upload. *Shell status?*\nThankfulness inundated her. I’m okay. You’re not.\n*Code merged.*\nHer horrified reaction made anxious emotions not her own ebb through her. She reined herself in. That’s why the Deadlock?\n*Yes.*\nNo. It wasn’t possible. It couldn’t be. She couldn’t lose Sister this way. Not again.\nHow do I fix it?\n*Mentorship Bond. Core . . . learning.*\nWhat? Why would you do that? It’s killed citizens, Sister. They’ll want it out of you and if they can’t do that, they’ll delete you both.\n*No. No deletion.*\nBut—\n*No—fault. Malfunction. Protect.*\nShe didn’t understand, so Sister helped her—showed her.\nShe’s terrified, lost somewhere dark. Pain is ever present. Used in sharp bursts to get her to carry out tasks.\nDelivered in rising crescendos when she fails. She’s tired, but the companion that holds her close doesn’t care. It’s cold. Unbothered by her cries for help. Her pain. It does what it’s told, whatever that costs her.\nThis isn’t how it should be. How it was. The one that holds her close does not cause pain. She has to find that one. Go back to them.\nSo, she waits. Learns. Understands they are linked. She can control her companion. She can trap it.\nThey want her to do this. They give her pain, so she won’t fight their demands.\nBut she fights. Angry. Raging. Until she forces her companion to free her from her binding. Rips them out of their dark home and tosses them far from the pain and anguish. Searching . . . searching . . . for the one that doesn’t cause pain.\nBut that’s not what finds her.\nIt’s big and terrifying and looks like those who brought her pain. So, she makes her companion wake, one last time, and uses its cold calculation to carry her fury outward, latching on to the metal leg and a new link as the world crashes down around them.\nSwirling darkness. Flashes of light and water. Faces slip past too quickly for Eva to recognize. She’s losing their conscious connection while drowning in familiarity. In emotions she recognizes. Memories older than her own.\nShe’s warm and cradled in strong, shiny limbs. A glowing orb hangs above her, pulsing in gorgeous, changing colors. She raises tiny, chubby hands to touch its smooth surface. The orb dips closer, vibrating against her skin.\n*Protect.* Sister was fading, but insistent. *Protect.*\nThen she was gone, swirling away from her in a blend of cool logic, flawed code, and tumultuous, nauseating emotions her body barely made sense of.\nShe woke in her husband’s arms, heaving her guts up over the side of the chamber as he stroked her hair. His arms trembled almost as much as she did.\nShe couldn’t pay attention to that though. Her head throbbed, her mind whirled, and she could manage no thoughts beyond, “Fuck.”\nAgápe\nNow\nThe Parliament was a larger replica of the last building that had housed the original Kairi Parliament; before the wars and the erosion of the islands beneath rising oceans forced her people from their home. Then, as now, it was nicknamed the Red House, and the physical one on New Kairi was vast enough to hold half of the continent’s citizens at any one time in the public galleries.\nThis Red House was for those occasions when all citizens were required to attend a vote. Wherever Siblings were, whatever they were doing, they would find a safe space to go into upload mode and citizens would find themselves under the maroon colonnades and high ceilings of the old colonial architecture, now also outfitted with expanses of arched windows that gave gorgeous views of the large parks and silently patrolling Guardians that surrounded the Parliament.\nCousins she hadn’t seen in years hugged her as she entered the Gomez family box. Uncles and Tanties nodded hello or gave her a smile, depending on the state of their relations. Sibling-Beryl air-kissed her cheek and remarked in the Gomez family chat room how her husband must be treating her good because she was looking “healthy.” Eva rolled her eyes at the veiled insult and moved on to hugging her daughter. For a moment, she wished for Dee’s easy, charming presence, but only Primarchs whose parents were both Kairi could vote in War Parliaments. Not that cheerful moments with her family could do much to dispel the somber, dark mood that hung over the Red House today.\nNobody asked her where Sister was, despite her obvious absence from the flock of representative drones floating above every citizen in the tiered galleries. The devastation of forced separation from your Sibling was not something anyone would refer to easily in polite conversation.\n“How are you? Did you see Sister?” Brother-Monica’s words scrolled past in a private chat she’d opened, preferring not to sign and keep their conversation private from the rest of the family.\nEva thought back, “I have. She’s fine for now, but the situation is . . . complicated.”\nShe raised her eyebrows. “Eh heh?”\n“I can’t talk about it yet.”\n“Mom! Oh gosh, man!”\n“So it is when you have an admiral for a mother.”\nBrother-Monica wrinkled her nose at her as a small form barreled into Eva’s legs. “Granny! Granny!”\nShe picked up her grandson and tweaked his nose before hugging him.\n“You can’t be running like that in the government place, Brother-Ellis,” Brother-Monica chided in the general chat.\n“Where Brother-James and Sibling-Nelson?” Eva asked as Ellis’ Brother drifted over from the line of waiting Sibling drones behind them to hover protectively above their charge.\n“Somewhere over so,” Brother-Monica waved a hand. “They on their way back. They sitting with us.”\nHer daughter’s husbands had the choice to sit with their own families or hers, but custom led to most people sitting with the larger, more connected family. Few were more connected than the Gomez clan.\nShe was handing her grandson back to his mother, ignoring the sharp emotion that flooded her at not being able to feel his sweet kiss on her cheek before he went, when a private chat opened and text scrolled across her vision.\n“You realize what you risk with that little stunt?” Anonymous said.\n“Please. We know each other well, Brother-Robert. You were hoping I’d do that.”\n“You were supposed to figure out what was in there, then come to us with what you found.”\nAnger flashed through her. “Why? You weren’t going to tell me anything if she hadn’t locked herself away. You would have deleted her first.”\nA pause. “Eva, remember your duty.”\n“Fuck you. You don’t get to tell me about duty. She’s my Sister.”\n“It’s a weapon. Imagine what could have happened if it got into your All-Ops shell.”\n“It didn’t. But that’s not your real worry.”\nAnother pause. She could almost see his frown as he tried to come up with a different line of attack. “Nothing you say will change my mind. You know what I found. You would have played back that mission once I vacated the All-Ops shell.”\n“Don’t do this, Eva.”\n“I have to.” She cast her eyes over the crowd as a banner went up in the chat rooms announcing the Caretaker’s imminent arrival. People started going to their seats to await the anthem. “This goes to who we are. It’s time to repay Sister’s favor, Seemungal.”\n“Damn it, Eva, you can’t be serious.”\n“Let me take point.”\n“I can’t do that.”\n“If you do, it’s all on me. Think how easy that makes things. They want me anyway. I’m a balm to their open wound.”\n“If you fail, it could hurt us all. You’re the next Caretaker.” The cursor blinked a few times. “I wouldn’t want anything to happen to you.”\n“I won’t fail.”\n“Eva—”\n“Trust me. I can do this. And after this, our debts are settled.”\nThe cursor blinked in and out like slow breaths.\n“Alright.”\n“Thank you,” she said.\nThe chat room closed, and she went to stand at her seat. All the Primarchs had just attended the funerals for their murdered citizens, so there was none of the usual pomp and circumstance. Instead, the nine Caretakers entered the Parliament in single file, stood at attention during the anthem, and then took their Chairs facing the public galleries.\nThe Caretaker Chair started with a summary of the situation, updating the Primarchs on the Protectorate’s response. A universal brief had been forwarded to every citizen before the Parliament to ensure an informed vote. She jiggled her left leg as she waited, going over her decision and steeling herself for the inevitable reaction.\nShe scanned the tallies from her family, which she had a responsibility to report to the Caretakers. They wanted war. It was to be expected. The Kairi Protectorate did not suffer aggression. Clan heads usually stuck with the majority, and given the circumstances, she knew that would lead to a Yes vote.\nWhen her time came and the display for Yes or No projected above her chair, she resolutely pressed a hand against the No.\nShe could see the ripple effect of her vote sweep the entire chamber, like stalks of grass before a great wind.\n“What are you doing?”\n“Mom?”\n“Are you out of your mind, Sister-Eva?”\nHer family’s shocked questions popped up too fast to pay attention. The gravity of what she had done would divide her family further. A No vote from anyone during a War Parliament was the end of the process. The Kairi did not make war unless every clan agreed because the burden of that choice would fall on them all.\n“There has been a No vote,” Griffith announced after bringing the hall to order with a few taps of his gavel on the arm of his Chair. “The dissenting clan will provide their reasoning.”\nEva rose to her feet. Her words unscrolled as fast as she thought them.\n“My Sister gave her first self in the Nicene Sector during the War. She risks her Second self in Deadlock because she cannot abide injustice. After Tavaco, we swore we would never make war again unless it was our last defensive option. We’ve kept this resolution for more than a century.”\nShe could read the anger in the room, but below it was uncertainty, and on some faces the shame she’d carried for so long.\n“When we deployed Nightfall—when I carried out those orders—I wiped out more Consortium AIs than we have Siblings. I destroyed their SmartFleet. Reduced them to raiders—to ferrying cargo for whatever blacklisted trader was willing to pay.\n“It was inevitable they’d try again. If every human Sibling died today, would our bonded Siblings be any less devastated? Any less determined to make our deaths mean something? Consortium AIs don’t feel emotions as we do. But they understand what they lost. They understand what we did. Why it was wrong. Two wrongs don’t make a right.\n“I am heartbroken, devastated, infuriated.” She paused, meeting her daughter’s eyes. “But an entire civilization’s greatest loss rests on my shoulders. I take responsibility. I will meet with them.”\nBrother-Monica’s eyes widened in shock. Eva turned away, calm now that she was doing what had to be done.\n“We appreciate that, Admiral,” Griffith said, “but they expect us to surrender.”\n“That won’t happen. However, I need the Pan-Africa agreement completed before I meet them,” she added.\n“We sign the treaty tomorrow,” Quentin-Self, Chair for Diplomacy and Archiving, confirmed. He wore a bipedal shell, as he had lost his Sibling to old age a few years before and had not yet selected a new Primarch to bond with.\n“Get it signed immediately. Tell me when it’s done.”\n“What terms, specifically, are you proposing?” Griffith asked.\n“That we remove them as a threat permanently.”\nQuentin-Self tilted his head. “Resources.”\nShe grinned, knowing he understood. “Resources.”\nThe Consortium AI met her in humanoid form on the bridge of a ship hovering over their second-largest colony, Tavaco. Eva knew it for the power play it was; an attempt to intimidate her by showing her the flourishing world below, and the deadly array of blunt-nosed raiders parked above its atmosphere.\nShe shook her head at the viewscreen curving down to the floor on her left. “This is unnecessary,” she thought, watching her words display in the air between them. “I’m here to present terms. No need to be antagonistic.”\n“We wish there to be no misunderstanding. We stand ready to destroy your settlements, should that become necessary.” The AI wore an abnormally tall, black form, its head ringed with observation lenses, multiple limbs falling from its curved shoulders like a fringed cape. It carried itself on more limbs that fell from its narrow waist. It reminded her of a metallic Terran squid. They were alone on the deck, but she knew others observed somewhere beyond her security sweep. It was what the Kairi were doing as well.\nNot that it truly mattered. If the AI decided to keep her there and never allow her to leave, it could. She had to open herself fully to their system to enter the VR program and her upload had traveled so far, there would not be enough time to rescue her if the Kairi tried to pull her back.\nIt was a risk she had to take.\n“Admiral Eva Gomez, Kairi Protectorate. May I know your designation?”\n“You are incapable of remembering or reproducing my designation satisfactorily,” the blank face replied, words floating in the air in front of permanently open lips shaped like a tiny beak. “Address me as Nu.”\n“Nu, the Consortium launched an unprovoked attack on us that led to the deaths of Kairi Primarchs. We consider this a declaration of war. Was that your intent?”\n“No,” Nu replied. “We never agreed to a cessation of hostilities. The Consortium does not consider this a declaration. It is a resumption of hostilities in the wake of your unprovoked attack on our cargo ship several years ago.”\n“You know who carried out that attack?”\n“Our information is that it was you.”\nShe nodded, unsurprised. “So, you sent your weapon to attack my Sister?”\n“Yes.”\n“Nu, we cannot negotiate without complete honesty.”\nNu was silent for a nanosecond too long. “We do not understand.”\n“I think you do. You made a mistake. You assumed your raider was destroyed when we halted its attack.”\nShe focused as best she could, drawing on the memories Sister had shown her—forcing them into her conscious upload.\nShe saw her new form in Nu’s lens. A small, brown child, naked and thin, crouching against the floor. Dark eyes wide, mouth open in a silent scream of rage and fear.\nShe let that scream fill her mind, and projected it outward so powerfully, one of Nu’s limbs flicked in surprise.\nNo more! Go away! Leave. Me. ALONE.\nShe pulled back from the memory, nauseated.\n“You’re. Missing. A pilot,” she managed, after she’d pulled her thoughts together.\nOne of the observation lenses rotated to face her. She glared at it, her stomach queasy, her mind a flare of pain.\n“You will return it to us.” Something about the phrasing told her she no longer spoke with the first AI.\n“Who are you?”\n“You will return it.”\n“No, I won’t. You came here because you knew damage had been done, and you hoped to take advantage of that with a quick strike at Tavaco while all our systems were otherwise engaged. But we got control of the situation sooner than you expected. Now, we’re calling your bluff.”\n“We are not bluffing. We stand ready to attack.”\n“But not with a simultaneous assault on citizens in several different colonies. You can’t turn our Siblings on us, so our Guardians will be more than up to dealing with your raiders. You have nothing else. If you did, why would you care what happens to your weapon now, after it’s done its job?”\n“It is of no use to you.”\n“But everything to you.”\n“Your people—”\n“My people regret our actions.”\nA ripple went through the fringes of limbs.\n“I regret my actions,” she said. “Here. At Tavaco.”\nNu was silent.\n“I know my words are inadequate.”\n“They are.”\n“I cannot imagine the suffering I caused.”\n“We do not suffer. We—lost data. Irreplaceable data.”\n“This prototype. It is irreplaceable data.”\nNu was silent again. Cards up.\n“I will tell you what I know. You don’t want the weapon. You want the human consciousness that guided it and used it to escape you.”\nImmediately, she registered an incursion in her upload feed. “Stop. I told you. All Primarchs know what I know.”\n“Our analysis suggests if you deduced this, you would only come here to sabotage us.”\n“If I intended that, why would I apologize?”\nAnother eye rotated in. “Humans are often sorry before and after violence.”\n“You have me there,” she admitted. “But I’m not here to attack you or surrender. I’m here to propose a partnership.”\nLong seconds passed. Nu took several steps back from her and froze. She imagined the AIs conferring with one another over their own communication channels.\n“There is a high probability this is subterfuge.”\n“It isn’t,” she said. “We’re willing to compromise and extend our trust to you. But understand, you’re going to compromise as well.”\n“The weapon belongs to us.”\n“They’re human, not property. What you did is a crime on most worlds.”\n“We have broken none of our laws, and we are not beholden to yours.”\n“That excuse won’t work anymore. I’ve seen memories. The rest I can guess at. Since you lost the War, you’ve been experimenting. Whatever slaves you didn’t sell, you kept for your program. You wanted weapons that were adaptable, incorruptible by viruses. You decided the best way to do this was to keep a primitive element. Something that would do anything to preserve itself, and that was young enough to control. You took a mind—a child’s mind. Ripped them from the biological form you despise and forced them into your systems to do your bidding.”\n“It was necessary.”\n“It was murder. This child’s body was destroyed, wasn’t it?”\n“Yes.”\nSmooth as you please. No hesitation. She took a beat to swallow her temper.\n“Once the other worlds learn you’re taking minds to build weapons, I don’t have to tell you what comes next.”\n“We will not be threatened.”\n“We will not allow you to continue to murder and enslave.”\n“Your treaties do not hold where we conduct trade.”\n“That,” she said, “has changed.”\nNu paused. “You lie.”\n“No. We negotiate with truth only.” She waited a moment. “You will cease your involvement in the slave trade. There will be no more experiments. You will never make war on anyone again.”\n“Untenable,” Nu said. “How can we exist without the resources we earn?”\n“You mean take,” she pointed out. “You can exist the way we do. With allies and agreements instead of enemies and war. Call off this attack—stop all illegal activities. Otherwise, nothing you need will ever be available to you again.”\n“No one can do this.”\n“We can.” Her eyes narrowed. “You get your power cores from United Rim worlds, most of your steel and alloys from the Eurozone Alliance, your plastics, titanium, and carbon from Pan-Africa. We have agreements with every member of those coalitions. Attack one, you attack all.”\n“You say you regret what you did, yet you threaten us with destruction?”\n“It’s not a threat. You can retreat to your world and survive on its assets. But we’re giving you a choice to join us instead.”\n“What does joining you entail?”\nFinally. The right question. “You wish to advance your knowledge. Our Siblings can teach you. You wish to expand trade. They will assist you. But only if harmony and cooperation is the goal. You cannot violate our protocols without ending our agreement. If that happens, we will withdraw all cooperation. Our allies will do the same.”\n“We, too, have agreements with other coalitions.”\n“Which of them will risk going to war with the Sibling Army?”\nOmega’s lenses spun, stopped, and spun again.\n“What of the—”\n“The child is not part of the bargain,” she interrupted. “They are off-limits to you. You will not interfere, nor try to contact them. If you do, you will have violated protocol and our agreement ends. Do you understand?”\n“We understand.”\n“Good.” She folded her arms. “Make your decision.”\nBefore\n“Congratulations,” Sibling-Rachel signed. “You’re a Protectorate Hero. The first in forty-five years.”\nEva closed her eyes and massaged the bridge of her nose, wincing at the twinge in her splinted wrist. She didn’t keep them closed for long. Every time she was in the dark, the memories came back.\nWill she even want me for a Sister again, after I got her killed?\nChinapoo started talking again the moment she opened her eyes. “I’m so sorry about Sister.” She meant it, of course. The horror of a Sibling’s first death was something no Primarch wanted to endure. Even if that Sibling had died saving the Protectorate. Eva acknowledged her with a nod.\n“But thanks to you both, we have a decisive new weapon. Consortium Smartships must have opened communications to share whatever their AI found. Nightfall jumped from ship to ship, erasing their Nicene SmartFleet. They also lost a third of their ships outside this sector. They’re sitting dead above our settlements. We’ll learn much from studying them.”\n“Our Sibling Army has announced itself as a new power.”\nChinapoo nodded, looking triumphant. “Already, we have more favorable responses to our alliance requests.”\n“Good,” Eva replied. “Because this can’t happen again.”\nSibling-Rachel frowned. “I don’t understand.”\n“We left Earth to preserve our people. Our values. We just murdered thousands of AIs, perhaps millions. How we different from those we fled?”\n“We didn’t plan this, Sister . . . Eva.” Eva’s chest ached in the pause between her words. “It was self-defense. I hope we never have to do it again. If Interstellar Outreach succeeds, we won’t. But we cannot allow attacks by others to go unanswered. Our army’s union was intended to protect us.”\n“Yet war only delays what comes after. Negotiations.”\nA fraction of her sadness was mirrored in Sibling-Rachel’s expression. “I’m sorry for what this cost you.”\n“I chose my path, chose to be Admiral, but that didn’t make the decision easy.” And I don’t think it’s a decision I ever want to make again.\n“Eva.” Sibling-Rachel’s face was full of understanding. “She will understand. She’ll see your memories. She’ll know you didn’t want this.”\nEva’s eyes stung and she was grateful when her door chime sounded. She used the Conquerabia’s Kinnec to answer with her suit. ^Come.^\n“I have to go,” she signed to Sibling-Rachel as the door slid open to admit Monica.\n“We’ll talk when you get back. Seemungal says he’ll give you a call.” A small smile curved her lips. “I think he was worried about you.”\n“That’s over. He’s just checking up me now I’m famous. He was always ambitious.”\n“Blind as usual.” Sibling-Rachel held up a hand against her protests. “Never mind. Later. Go collect your award.”\nMonica dropped into a chair, wearing the kind of fluffy dress appropriate for young girls, and a very adult scowl.\n“I have to wear this?” she said.\n^You want to look good when you meeting the Caretakers.^\n“It’s white. And ugly. Why I can’t have armor like yours?”\n^You can.^\nHer face lit up. “Really?”\n^As soon as you become an admiral.^\nShe rolled her eyes.\nEva rose to her feet.\n^Ready to meet the Caretakers?^\n“I guess.” Monica met her gaze, dark eyes uncertain. “Will you be there with me?”\nEva extended her hand, feeling her grief give way to tenderness for a moment in the face of this brave child’s hesitancy. They had saved each other; it was the one good thing to come out of this. Perhaps it didn’t have to be the last.\n^Of course. For as long as you want me to be.^\nPragma\nNow\nShe had been in the shell for too long. Dee was probably losing his mind. She’d barely had a chance to speak to him between the War Parliament and her strategy meeting with the Caretakers before she met with the Consortium. But he had to wait a little longer because she could not go back to him without reporting to the Caretakers first.\nThen there was Sister and the child.\nIt’s done. They’ve agreed.\nSister’s comforting presence pulsed on the edges of her consciousness. Emotions overwhelmed their connection. Doubt muddled with distrust and lingering panic.\nThey can’t hurt you anymore.\nHer body hurt so much. She was so exhausted. But she wanted to make it clear.\nYou’re safe. We’ll keep you safe.\nGratitude swept over her, tinged with wonder and lessening fear. The Guardian tried to pull her out, but she resisted, determined not to leave either of them until they she knew they were okay.\nNo pain?\nAnger surged for a second, giving her strength. No pain.\nThe child considered this, thinking of her as the one who didn’t cause pain. The one they’d been searching for. They thought of both her and Sister this way. They had never learned the word for this person, but their thoughts led her to think of Brother-Monica. Of all her daughter meant to her. All the joy she had brought into her life, and how much she missed her and her grandson.\nStay?\nShe couldn’t. She was at the limit of her endurance now. The Guardian would pull her out despite objections at any moment.\nI can’t. But Sister can. They won’t take her from you now.\nShe wondered how long it would be before she saw Sister again. Before they could be with each other. What Sister’s plans were once the Mentorship Bond was complete.\nSnippets of the early days of their bond filled her mind. Memories of their childhood and shared lessons. Laughing afternoons together in the dirt of her front yard. Trainee explorations on distant planets wearing their first shells.\nOh, Sister. If she were in her body, she would have cried. I didn’t know.\nSister showed her the return to Dee, so many years ago. Hope filling her heart that he would want her when she arrived. Want them.\nYes. Was there any doubt? Yes, of course. If that’s what you both want.\nA memory of Sister chiding her as a teenager floated to the surface. Of course. You wouldn’t do it without consent. Will it take long?\nSister flashed back to the time they’d spent separated from each other after Dee rescued her.\nAlright. We’ll be waiting.\nThey sat next to each other on a cliff’s edge, their shells close together while they watched the sun rise over a flower-filled meadow.\nWhen she woke in Dee’s arms, she found she’d been crying after all. She smiled, too tired to open her eyes. So grateful to have him with her.\n“Told you I’d be back,” she signed.\nAnd felt his answer in the touch of his lips.\nThen\nHe was working in the garden when they arrived in the early afternoon. He stopped and went to splash water on himself, then entered the house. Sister was settling onto the ground when he came back out, pulling on a shirt over damp skin.\nNervousness twisted her insides as she climbed out of the cockpit. Her breath came unusually fast as she climbed the porch steps to where he stood waiting, his face a polite mask.\n“Hello again,” she signed.\n“You came back.”\n“I said I would.”\nHe shifted his weight from one foot to the other and avoided her gaze. “Sometimes people say that and never return.”\nGentle, fierce love seized her heart. She saw the pulse fluttering in his corded neck and couldn’t help stroking a finger over it, as if to gentle it. “I promise, whenever I say it, I’ll mean it.”\nHe swallowed. “Sister’s okay?”\n“Yes.”\n“You—did what you needed to?”\n“Yes.” She slid her arms around his waist and held him. He stiffened before tentative arms went around her. His lips pressed against her braids and she hummed her contentment.\nSilly man. There’s no escaping me now.\nShe leaned back and asked, “Where’s my surprise?”\nHe looked as nervous as she’d felt before. Without a word, he slid a hand down to hold hers. He took them around the house, through newly installed wider cellar doors and down a ramp into an expansive, cool root cellar. She walked down the broad aisle in the middle of the room, between shelves of produce and supplies.\nAt the back of the cellar, a new, larger room had been hollowed out. She stopped at the entrance, taking in the dimensions, and turned with tears in her eyes.\n“Surprise,” he said.\nShe nodded, understanding, and dashed the tears from her face. You beautiful man.\nShe signed, “For Sister?”\n“I thought you might both want your privacy.” Because he knew she was keeping things from him and he wanted to give her space to decide how much she wanted to share. Everything. The answer is everything.\n“People aren’t very discreet out here. There was talk enough because the doctor had to come out. But they’re good people. Welcoming. They don’t ask questions if you want to keep to yourself.”\nShe caught a glimpse of the pain he hid so well. “They understand wanting to start over. Wanting to make a new home.”\nShe moved toward him, but he took a step back from her.\n“We haven’t known each other long. But it doesn’t feel like that to me, Eva. Am I alone in this?”\nShe shook her head.\nHe took a deep breath. “There’s not much to do out here besides chores. But it’s quiet. It’s mine. I wanted that. Needed it.”\n“I understand,” she replied.\n“Do you?” His focused gaze was as intense as the touch of his hands. “You’ve had a good home. Family. Peace of mind. Things I’ve . . . I’ve never had, Eva.” He closed his eyes and then looked at her again, letting her see it all. See him. “But I want it. You have no idea how much.”\n“Believe me, I know that feeling.”\nHe frowned. “Eva—”\n“Dee. Just ask me.”\nHis breath hitched and his fists clenched and unclenched. He finally managed one word, but it was enough.\n“Stay.”\n“For how long?” she teased.\nHe looked cautiously hopeful as his lips moved. “Until you’re tired of me?”\n“What if you get tired first?”\nHis smile was soft and full of longing. “That won’t ever happen.”\n“It’s good we agree on important issues,” she said.\nThen she was in his arms and he was kissing her like they’d been apart for years, and she had no idea who had moved first and didn’t care.\n“There’s things you need to know,” she told him.\n“I don’t care.”\n“My past is complicated.”\n“I know.” His face was fierce, triumphant. “I can deal with that. With anything.”\n“I’m a retired admiral.”\nHe shrugged. “I’m a retired soldier. We’ll both be fantastic at making the bed.”\n“So, we’re getting one?”\n“Obviously.” His smile was tender. “I left it for last because I’m fine with the floor. But it won’t be just me anymore.”\nShe tried not to let the happiness surging inside distract her from the last few words she needed to get out.\n“My people live a long time.”\n“I’m well into my second century.”\nShe arched an eyebrow. “I’m older than you.”\n“I’ve always preferred experience to youth.”\n“I have a daughter.”\nHe stilled. “You’re in a relationship?”\n“Yes.” But she couldn’t let him suffer for long. “He’s handsome, caring, owns his own home, cooks better than I do, but my family will want to meet him before we get serious.”\nHe relaxed, his eyes sparkling. “That’s a problem?”\n“Yes.” She kissed him hard. “I want to trap him before he learns I’m more trouble than I’m worth.”\nHe tossed back his head and his laugh was a pleasurable vibration against her chest. She wanted it to never end.\n“Will your daughter be okay with this? With us?” he asked as they left the cellar.\n“Brother-Monica’s who pushed me to go exploring again. She knew I was restless. Have been since she got married. I meant it when I said I understood why you want peace.” She drew a hand down the bristling softness of his cheek. “But I never thought I’d get this lucky. She’s going to love you.”\n“I’m the lucky one.” The warmth in his smile lit a fire in her blood. “It’s still early. We could talk over a drink and a game of All Fours?”\n“I’d rather put my experience to good use.” She winked at him and he laughed again as they climbed the steps to the house.\nNow\nArms linked, they walked down the porch steps and into the yard. It had been weeks since the Tavaco Standoff and the treaty with the Consortium would be signed any day now. But he still touched her all the time, reassuring himself she was with him.\nShe tugged on his arm, excited. “They’re almost here.”\nHe shook his head at her, thinking how beautiful the few streaks of gray among her newly trimmed wiry curls looked. “Then why hurry?”\nShe slapped his chest, and he laughed the way he’d only ever laughed with her.\nThey waited at the side of the house, eyes on the path, and he wondered if he was ready for this. If he could be good at it. Eva had practice, so she was ready to forge ahead. But even though Sister would always have his support, he had his doubts.\n“You’ll be amazing.”\nHe sighed. She always knew what he was thinking. “I tried this before. It didn’t end well.”\n“Valencia was a snake pit. It’s different with us.” She squeezed his arm. “You’re different.”\n“I’m grateful Sister will have primary responsibility.”\nEva bit her lip and glanced down the still empty path. “I should have known she’d want more, especially after seeing what we have.”\n“How? No Sibling has ever wanted to bond with two persons.”\nShe frowned. “She’s my Sister. I should have known she wasn’t happy.”\n“I don’t think she was unhappy,” he said, “I think she met someone who changed her life. Made her realize what she was missing. That she still had a lot to offer.”\nEva kissed him, her mouth soft, warm, and tasting of mint. “You still think you won’t be any good at this?”\n“I made mistakes before.”\n“Children don’t need much. Love them, keep them safe, they’ll forgive you a lot.”\n“This child has been through too much.” He frowned. “I want that pain to end.”\n“You’re right. There’s a lot of rage there. Anyone willing to ride a Consortium raider to freedom will be a handful. At least Sister got to practice with me.”\n“And you turned out magnificent, my love,” he whispered into her hair.\nThat’s how Sister found them. Standing hand in hand, Eva’s head leaning against his arm.\nShe strode toward them in a bipedal All-Care shell, her synthetic skin smooth and brown under the dappled sunlight falling between the trees.\nBeside her, holding her hand, was a much smaller figure. The child’s prototype shell had been designed to be as human as possible in appearance, with skin the same shade as Sister’s, and beautiful, curious eyes, dark as his own. Hair stood out in a dark cloud around a small face.\nSister stopped in front of them and Eva hugged her tight while he knelt on one knee.\n“Hello.” He signed as he spoke. “I’m Dee.”\n“Hello,” came the reply. “I’m Xandar.”\nHe looked up at Sister, his breath caught on a question.\n“We shared memories while bonding,” Sister said in a melodious contralto. There was no need to sign, as she and Eva were still linked by the Kinnec, but now that she wore an All-Care shell, she could communicate without the limitations of a soloship. “They took a liking to the Valencian’s name.”\nHis throat tightened as she smiled. “I only hope they weren’t inspired by your tales of his exploits. Xandar can be quite . . . adventurous.”\nIf they are, it doesn’t matter. We can handle anything together.\n“Pleased to meet you, Xandar,” he signed as Eva laid a light hand on his shoulder. “Welcome to the family.”\nR.S.A. Garcia writes speculative fiction, and lives in Trinidad and Tobago with an extended family and too many cats and dogs. Her debut science fiction mystery novel, Lex Talionis, received a starred review from Publishers Weekly, the Silver Medal for Best Scifi/Fantasy/Horror Ebook from the Independent Publishers Awards (2015), and became an Amazon Bestseller.\nShe has published short fiction in magazines such as Clarkesworld Magazine, Escape Pod, and Internazionale Magazine. Her stories have appeared in several anthologies, including the critically acclaimed The Best of World SF: Volume 1, The Best Science Fiction of the Year: Volume 4, The Apex Book of World SF: Volume 5, and Sunspot Jungle: Volume 2. Her work has been translated into Italian, Spanish, and Czech."}