{"fingerprint": "X9T54tJrUIFHeqHEBYj06ZbnVVs=", "sitename": "Clarkesworld Magazine", "title": "Marsbodies by Adele Gardner", "author": "Adele Gardner", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gardner_06_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Marsbodies by Adele Gardner", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5370 words, short story\n Marsbodies\n The Seven Minutes of Terror had never been so terrifying. Or exhilarating. We hurtled down, our heat shields roaring. In my capsule, despite being harnessed in, my Marsbody trembled in the relentless vibration that accompanied the sound of the inferno. I raced down at a thousand miles an hour. The supersonic parachute deployed with a nine-G jolt.\n Right on schedule, the heat shield popped off. The disc soared off like a Frisbee. The pocked dunes of Mars zoomed in to giant size with frightening speed. (Two hundred miles an hour!) The backshell flew off, and I zoomed to one side, out of the way of the parachute array as the rocket brakes kicked in. Then the sky crane halted me, twenty meters above the surface.\n I extended my wheels and swung down on the tether. I still had to fight human instincts that told me this was way too high. But my wheels touched down lightly. I checked myself, automatic, obsessive: no damage. My teammates and I checked in, their braying cheers filling my head with a warm hum as I rolled to meet them.\n That was fun, ha. Have you ever had a robot party? We rolled around hooting and whistling our delight, waving extensor arms, and rotating our gyroscopes. We looked like the wacky children of the original Mars rovers, except with more of everything: arms, equipment, chambers for samples and processing.\n Now, this was fun, but with twenty of us down here, all of us in fine working condition, we got right down to business. We only had a few hours before night fell, and the temperature dropped to minus one hundred and forty degrees Fahrenheit. Our Marsbodies could still operate, but we expended less energy when we didn’t have to simultaneously provide our own heat and light.\n As we set up the base, I sought out Jin Kyung Mi. My best friend. She looked like herself, as much as any of us could: the faceplate viewscreen perched atop her spindly body bore an image of the face I’d loved on Earth, filmed and broken down into its component emotions so that she could still communicate with us in this wordless human way. We worked side by side in harmony, like the longtime teammates we were.\n Jin Kyung Mi and I had known each other since elementary school. Beautiful, thoughtful, artistic, quiet in a good way that meant she was thinking carefully and giving you the space to do so too, to enjoy the moment for whatever it might bring, even if—especially if—that was work. A richness that meant I knew that when I did speak, she would listen and take me seriously, and when she spoke, it would be something I would stop everything to hear, her mellifluous voice speaking to the heart of things, helping me see the world in new ways.\n Of course, as we grew older, there were other things; her long, shining black hair, the way her deep brown, East Asian eyes crinkled when she smiled. When we were in fifth grade, she drew a lot of Korean princesses, and I secretly thought she might be one of them; her kindness was proof, a forgiving air that reminded me of the noblesse oblige in the Arthurian tales I was reading then.\n Living so near the coast, we were lucky to have a wide mix of cultures in our community; our neighbors in the townhouse complex came from New York (my family), Saudi Arabia, Korea, Vietnam, Alabama, Nigeria, Germany, Puerto Rica, Japan, and South Africa, and those were just the kids we played with in our court. Many of us came from several places, like my own Irish-German-English-Pennsylvania Dutch mix, or Pamela’s African American-Japanese. It was partly thanks to the military and the nearby base where Dad worked. We loved it.\n But Jin Kyung Mi was my favorite, the special friend I sought above all others, who wouldn’t laugh at me like my brothers when I asked her to help me make tiny plates and tables for my dollhouse out of the clay we dug from the hill behind our school. When I stopped by and knocked on her family’s door—at a carefully chosen time when she’d let me know she’d be done with violin lessons, and her mother would let her come out to play—whenever she appeared on her stoop, at that first sight of my friend, my heart lifted with warmth like a hot air balloon. Anything was possible.\n As you can tell, I loved Kyung Mi. I guess maybe it showed, though she never spoke of it. I heard the snickering, the way the other kids called me gay, then explained to me what it meant, not in the most flattering terms. We were only ten. But I did love her. Then, and ever since.\n That’s why, when she turned to science with an eye on the space program, I did, too. One of her several specialties (we needed at least three to be considered for the long-term Mars program) was robotics, while mine was the mapping of the human mind to a programmed simulation. We worked hard to hit every mark and then some; even then, it seemed women had to accomplish five times as much to be noticed and given an “equal” chance—but Kyung Mi was still so kind, giving time from her own limited sleep to assist newer astronaut candidates.\n But Kyung Mi was straight. At least, so she told me, when we were undergraduates, and I finally got the nerve to ask her out. We were roommates, and she was crying over another jerk, so maybe it wasn’t the best timing. But I wanted her to know she was loved. That, even though I knew she liked guys and I had no chance, there was one person whom she could count on, who’d take good care of her heart.\n I swear my heart was going so fast I thought I might be having some kind of attack. “I love you, sweetheart. Don’t worry. I love you.” I stroked her shining black hair, smoothing it away from her tearstained face. “I know it’s not the same for you. Believe me, I wish I was a man, and not just so we could be together. If you want me to move out, I understand. But I just want you to know you’re so worthy of being loved. Don’t let that jerk poison your mind. You’re the best person I know.”\n I proceeded to tell her. All the while, my heart was in my throat, and I was sitting next to her, stroking her back where she huddled over the end of the couch.\n At last the heavy gasps settled into long sighs. Kyung Mi sat up. I handed her tissues and sat back quietly while she composed herself. It wasn’t easy. But I thought about the many times she’d been quiet for me, like after my mother died.\n “I do love you, Peri. Please understand. I’ll always love you. You’re my best friend. But I’m not wired the same way you are. I don’t want you to break your heart pining after me.”\n I admit, I had tears in my eyes, but I appreciated her honesty.\n So I was surprised when she came to my bunk the night before we set off on our mission. “It’s the last time we’ll be human together for a while,” she said. In that narrow bunk, her kind eyes and gentle hands assured me she wanted to be here. I showed her all the love I’d kept pent up, and she showed me how deep a well our friendship was. She didn’t make any promises. She couldn’t. We effectively wouldn’t have bodies up there. And I knew better than to think beyond the joy of this moment. And so we slept at last.\n The next morning, we entered hibernation. No going back until the mission was complete.\n Twenty astronauts slept under the tender care of our robot pilot. Hibernating humans required less oxygen, food, water, and luggage—leaving room for yet more building blocks that could be sent to Mars. But oh, the dreams! I think I got about a lifetime of happiness with Kyung Mi on the months out.\n Once our robot pilot achieved orbit, we roused a bit: just awake enough to connect with our Marsbodies. This was the trickiest part. Frankly, it was terrifying. We’d trained for months to stay calm, not to give in to the panic of suffocation in the goo as we transitioned from dreams to paralysis, to the absolute sense-D that preceded connection with our Marsbodies. Because we had to be awake to switch those pathways on.\n The specially shielded hull and the goo itself kept us safe from radiation; automated processes would stimulate muscles and keep us sharp; but we didn’t have the resources on board to maintain life support for the ten years we’d be out here, terraforming and building habitats in our hardy Marsbodies. We just had to trust that on board the ship, our computer would monitor human life signs and replenish the oxygen, nutrients, and life-giving elements of the goo. Because we couldn’t sense those bodies. We wouldn’t know if they began to rot.\n For us, it had begun: life on Mars.\n On days without dust storms, when we’d finished our tasks, Kyung Mi and I sat on a ridge, looking up at all the stars. They looked so very, very clear. The night chill deepened. We could feel it; our sensors fed into our brains. We hunkered near each other in the dark, draping extensible arms over one another’s hulls for added stability. Our aerogel and heaters kept us warm, and our nearness cut the wind. I could feel the faint purr of the motors rumbling deep within Kyung Mi, a soothing vibration like my brother’s cat Jimmy back home.\n We’d return to the joint cabin. In order to cushion the mind from unrelenting toil and prevent soul-sapping ennui that might lead to mistakes or to overlooking solutions, we’d been encouraged to bring entertainment and make use of downtime.\n Downtime could be weird in a Marsbody. It was the time you felt most out of yourself, disconnected, because you weren’t focused on work; because on Earth, that might be the time you felt most aware of your physicality, your desire for mental or physical pleasures. It was a time when you were allowed, even encouraged to think of yourself, in a good way. Who you were. What you liked. Self-care. Who you wanted to spend time with.\n We weren’t eating on Mars, but I still had my comics and music, downloaded and stored in my Marsbody’s long-term memory cache. I had movies and shows, too, and so did the others, and we swapped, we talked, we even watched things together. Sometimes the group chat veered into the pleasures we missed.\n “What do you like on your pizza?” I asked. I had pizza on the brain—my favorite food.\n “Anchovies,” said Kyung Mi.\n Benny wrinkled his nose. “God, I hate those things. How can you eat them?”\n Kyung Mi shrugged. “I tried them once on a Hawaiian pizza. You know, pineapples, ham . . . anchovies. I fell in love.”\n “I’m falling a little in love myself,” he said gallantly. I remembered Benny, how he’d looked on Earth, in his human form. That impish grin looked even funnier atop the dome of his robot body, an egg with eight skinny extensor legs that let him run like a spider. That goofy guy was just her type.\n In private chat, Kyung Mi sent me a drawing she’d made of my human self wolfing down a pepperoni pizza and sharing some with Marsbody-me. I chuckled.\n “I can’t wait to get home,” Sargon said. “No offense. You’re all great, but I miss alone time. For one thing, it’s really hard to concentrate on writing a novel. I just can’t get a nice, good block of time to concentrate because everything you all say and do is so interesting, I can’t pull myself away!”\n Mara said, “All of us have things we want to do. But this is also probably the most exciting thing we’ll do in our lives. Seriously, we’re on Mars. We’re robots, for goodness sake! Nothing else is going to measure up to this. Tell me I’m wrong!”\n Of course, we could not.\n Were we the robots? Or were we riding robots who had just a hint of sentience themselves? Were we brushing off on them? I knew a lot about encoding human personalities, but I couldn’t always tell. It wasn’t part of our mission, but I’d started keeping a private log.\n It had started sometime after the second week, when Benny’s robot body had saved him from an avalanche without any hint of being asked. Lots of other little hints of assistance; an extra push here, a head unconsciously turned toward an interesting scientific sample we hadn’t noticed before there.\n We talked about it sometimes in downtime. Always and only the positive aspects. After all, our robot-suits were listening.\n We’d been there quite a while when we started speculating about what would happen when we left.\n Serena said thoughtfully, “Leaving our Marsbodies is going to be like death.”\n “For them? Or for us?” I wondered.\n “If they get other operators,” Pinter said, “it’ll be like reincarnation, only in reverse. Our children, maybe. It won’t be us.”\n Benny said, whimsically, wistfully, “Do you think the robonauts will know the difference?\n And Mara said quietly, “I think they will. They’ve got that primitive AI functionality that gives us an assist. They’re going to be programmed with their upkeep, housekeeping tasks during the interval while no one’s directing them. They’re rather like our cats and dogs. Haven’t you felt that? A kind of warm comfort and affection. They may not be fully sapient, but they are aware, and they care what happens to us. They’ll have to go on without us, and they won’t know why. Or is that just me?”\n Quietly, Kyung Mi mused, “Dogsbodies.”\n “Do you mean them? Or us?”\n Pinter laughed and said, “Well, we ought to go on and explore Pluto with them. Then the Dog Star.”\n Serena said with quiet certainty, “We will someday.”\n “Maybe so,” I said slowly. But I was exploring the strange warmth I felt about my upper carapace, a comforting sensation that reminded me of when my brother’s orange tabby cat draped my shoulders, purring. I could see Jimmy’s sad eyes as he sat on my suitcase during my last visit, as if he’d been pleading with me not to go. The pang, like a rod through my chest: so long, so long since I’d seen my family. Would I ever see them again?\n “I miss Jimmy too,” Jin Kyung Mi said softly.\n Kendra said, “I miss my dad. And my baby brother, Robert. He was only one when I left, and his head smelled really good.” She laughed, using the carefully modulated robotic equivalent we’d all practiced to avoid blaring like scary monsters.\n “Yes. Babies smell good. I wish—” Even a robot could hang its head.\n Kyung Mi said, “Don’t worry, Mara. One of the good things about this setup is our bodies are well cared for. We should be biologically younger than our technical ages when we get back.”\n “Because our bodies aren’t lived in,” Leonard said gloomily. Last week, he’d received a cold, clipped message from his wife. She was leaving him. Leonard’s work began to suffer. None of us wanted to say anything to him about it, but I knew I wasn’t the only one watching his increasingly erratic behavior with anxiety.\n But it wasn’t only Leonard whose health was deteriorating, mental or otherwise. The longer we humans stayed in our robot shells, the more problems developed. With such complex structures over such a length of time, this seemed inevitable. And some of it was just the wearing away at our patience of this increasingly interminable sojourn.\n Last night I woke up during the erasure.\n It was a glitch. It had never happened before.\n In our Marsbodies, we only had so much onboard room to store our memories. The Marsbodies derived mission data, which had to be stored; but even with the planetside computer, not everything could be saved. Just think about the human process of sleep, during which the mind somehow decides what will become long-term memory, what is retained for temporary short-term, and what can be safely erased.\n After downtime, each night we’d enter a sleep period, to facilitate the computer’s version of this process.\n I half-woke, which shouldn’t have been possible in maintenance mode. I found my mind in the middle of singing the remnants of the song I’d spontaneously created the day before while we’d worked, which had been so catchy, and which I’d repeated enough times that I’d surely remember it. But now I couldn’t remember all the words, just snippets. Most of the melody seemed intact, but without the words. I couldn’t be sure.\n I was still groggy, half-asleep, but as I often am in dreams, found myself cheerful in a way I seldom feel in real life when initially confronted by a challenge. Kyung Mi and I stayed up late last night reading comic books, so I didn’t have enough time to sleep before work to record the song. But I went back to humming it over in my mind, groping for the missing words, hoping that this time I’d remember it, like an interesting dream—that I’d interrupted the destructive process of wiping the memory banks in time.\n But no. When morning dawned, it was gone, despite that catchy rhythm.\n I remember trying to save it. I remember it was a good song, which Kyung Mi seemed to enjoy. When I’d started singing, creating words and melody as I went, I’d been happy, in a deep, satisfying way I didn’t want to question. It wasn’t just the sheer pleasure of the amazing sequential art.\n Each night, before I shut my unit down, Kyung Mi and I sat together, plugged in so our speech wouldn’t disturb the others. I watched her smiling faceplate as we conversed. It sounds corny, but as we secured each other for sleep—running visual and diagnostic checks on one another like a grooming ritual—it felt like a sweetness I’d known only a few times on Earth. They might be faceplates with viewscreens, but it sure felt like staring into loving eyes, that unconditional bond, deep beyond words.\n So it upset me—made me sad to part with any moment of that. I could feel the chomp, chomp, chomp as my brain ate away all those bits of ephemeral information. As I slept, I must have been unconsciously trying to save this song, humming it as I woke. But like so many dreams, I couldn’t hang onto it. It was gone.\n I could almost hear the echoes. Maybe if I pulled on the tail—maybe I’d saved just enough—\n This was the panic that woke me in a cold sweat in my Marsbody, fighting to move. Fighting to think. Fighting to remember.\n Don’t wipe! I pleaded with my brain. Not now, when she finally loves me!\n Desperately I repeated the song—the scraps I now remembered—hoping that even if my robot brain wiped things, maybe my meat brain might save it. If enough of my meat brain was engaged to know, and I wasn’t just the autonomic ghost of a hibernating mind.\n So the next day I found myself in an odd mood. I woke up with a sense of loss whose strength bewildered me, even though I remembered that frightening feeling of my brain being chomped. I know we were supposed to focus our attention on the scientific challenges of Mars, but I couldn’t stop looking at Kyung Mi. Something seemed—off. Her graceful motions would stop in the middle, for just a millisecond. A burr in the joint, which maybe only I noticed. But it was another thing that shouldn’t be happening.\n The Martian sand got into everything. Maybe it got into her joints, in spite of all the insulation. But her calculations were off. A storm rose, and I couldn’t seem to get her moving. It was strong enough, I needed to get her back to the tent quickly. She kept tripping. I hovered close, moving ahead to smooth the sand, reaching out a retractor arm to clear the path of stones.\n We all made it into our mobile camp just as the horizon turned crimson with dust.\n I was still settling Kyung Mi in a safe place in the back to examine her when Sargon and Kendra rumbled in, arguing, their face screens turned toward each other while their onboard guidance systems moved them forward. This made them clumsier than they needed to be, even with robot limbs. They collided and tripped Benny, who broke one of the struts. Kendra leaped forward, shooting out a telescoping arm to bind it in place and keep the roof above our heads. It drummed with debris. As I moved to help, I could feel the vibrations.\n I returned to Kyung Mi. “How are you feeling?”\n Her sleek eyestalks rotated in the “no” signal.\n I grabbed the nearest sterilization kit and began to buff the dirt and crud from her joints. “Maybe you should go back upstairs.” This was an option reserved for the direst circs, but I had a terrible feeling as I manipulated her limbs and felt only a weak, fluttering response. As if the human mind had only a tenuous grasp on the Marsbody’s controls. I didn’t want to say it, but if there was something wrong with her human body, there was no one upstairs to help her.\n “If I do that, I might never get back into this body,” Kyung Mi said calmly.\n “Maybe I’ll go, too.” I used the buffing rag to smooth her dome. No one else was watching, so I mixed in a small amount of metallic polish and brought her faceplate up to a glossy shine. As I smoothed away the dust, the colors on Kyung Mi’s face screen brightened, as if her mood were lifting. That gentle smile. I wanted to hug her. The impossibility of that felt like beating my head against a wall.\n “Besides,” she said, “if I can’t get back into my Marsbody, there’s not enough life support up there for the rest of the mission.”\n I stroked her shell. “What if we created a small containment area just big enough for you?”\n “Still not enough.”\n “Those trees are doing well. I think we should be able to leave soon.”\n “No way,” Sargon said. “If we don’t maintain the dome, the first big storm will take them down.”\n Kendra argued, “The rock face will shield them. We set up for this. We bolstered that dome, and it’s going to stand. If it doesn’t none of us have a chance here anyway.”\n “Besides,” Leonard added, “we wasted way too much air on that dome to let it blow down. That’s our fallback position, so it had damn well better stay intact.”\n Kyung Mi could barely move. Slowly, she stretched out one extensible limb to adjust my faceplate, a pensive smile on her screen. But even her face kept breaking up with static. Was it just an unusual transmission disruption effect from the storm? Fighting back panic, I reviewed schematics and readouts and found nothing. Was the fault in her Marsbody? Or was her body on the ship injured? Dying? What about those domes? Some of the oak groves might almost be strong enough to support human life, at least for a few years, especially if it was just one person. Could we get her out of stasis and downstairs if we needed to?\n By now, the team was involved. No more joking or fighting. Everyone knew there was something wrong with Kyung Mi. Kendra and Mara started checking on the nearest dome, while Sargon came over to help me run diagnostics on Kyung Mi. Benny and Serena kept pinging the ship for status updates. All they got back was the smiley-face, automated “Everything’s under control.”\n “That could mean anything.” Benny uttered a mournful whistle. In the emotion of the moment, we were forgetting our human mannerisms, letting the simpler robot gestures shine through. Over the years, this shorthand had made more and more sense as we got more comfortable with ourselves.\n Leonard said glumly, “What if an asteroid hit the ship and wiped out the robot pilot? And us?”\n Serena looked scared. “Peri? Is that possible?”\n I really didn’t want to talk about this. That experience, waking up while the computer chomped my memories, haunted me as I said, “It’s possible.”\n Benny demanded, “If we’re dead, who’s running our Marsbodies?”\n “We are.”\n “That makes no sense!”\n Kyung Mi smiled up at me as I met all fourteen of her hands with mine, forming what we called a Perfect Union. I said, “If we were killed, our Marsbodies would still have our recorded personalities and memories. We did an elaborate fit of each person’s mind, creating an impression in the robot brain so that we’d feel ‘at home’ in our own skulls.”\n “So these robots might be the only thing keeping us alive?” Sargon sounded incredulous.\n “Let’s not jump to conclusions,” Kendra cautioned.\n My mind was racing. Selfishly, I couldn’t help thinking about the fact that back in our human bodies, the relationship between Kyung Mi and me might not even exist. But I said, “We need to get upstairs and see what’s going on.”\n “You mean wake up?” Leonard looked at me sharply.\n “In a manner of speaking.”\n “You want us to kill ourselves,” Benny said, rolling around us and back and forth in a frantic, haphazard way.\n “No, I want us to save Kyung Mi.”\n Mara said, “So why don’t we switch ourselves off?”\n Serena, who’d been humming “Spirit in the Sky” while whittling out the corrosion from her little robot dog, went silent.\n Greg said, “We’d have to be damned sure we were going to wake up. I don’t want to be stuck in that tank in the dark—drowning—” He got up from his seat and started pacing violently. At least, that was the human mind’s translation. Actually, he rose up on his leg stalks and whirled in a floor-polishing circle while his human voice blatted angrily, in the D&D style they’d come to use, “I get up and pace furiously around the room.” His hands worked in rapid competence, fixing the repeaters that had blown out in the storm, their skill and the utility of their task making the action the opposite of the agitated fidgeting he clearly wanted to express. He growled, “Look at me! Even when we’re off-duty, even when we’re upset, it’s always some activity to help humanity! And they can’t even make sure we have a way back to the ship?”\n “I feel you, Greg,” Serena said, in the lingo they’d adopted due to the disconnect between their human feelings and robotic exteriors. “But we all knew the risks. They were very clear about that.”\n Mara laughed. “Yeah, but I trusted them because they’re NASA. Come on, no matter what they say, there’s nothing they can’t do.”\n Serena smiled. “Nothing we can’t do, you mean.” She raised both her antenna atop the traditional dome of her brainbox. “We astronauts—we always come through! It really is up to us.”\n I cautioned, “If we wake up on the ship. If we fix whatever’s hampering Kyung Mi and make sure everyone’s okay. And then we get back to work. When we plug back in—we’ll be taking over the Marsbodies again.”\n Kendra arched a brow. “Isn’t that what we want?”\n “We’ll be overwriting them. Whatever personality they have now.”\n Kyung Mi’s flickering screen cleared. “Whatever personality we have,” she said clearly.\n I felt it then. Holding her fourteen hands and looking into those eyes that had never lied to me, so help me, I felt it.\n “We’ll disappear—” I gasped.\n Kyung Mi’s sad smile confirmed it.\n Over our private channel, she and I sussed out the situation in a rapid exchange of speculation and data. She’d seen it—for just a moment—our ship.\n Mara said frankly, “If we have to remain robots, I’d rather stay on Mars—at least we’d be doing some good—and hey, we’d be on Mars.”\n Benny took up the chime. “We’re aliens here anyway, if you think about it. As robots, we fit right in, ‘and hey, we’d be on Mars.’” He pointed a long arm at the ceiling in what had become our “thumbs up” gesture. For once, his silly grin looked entirely appropriate.\n But I couldn’t let it ride. I just couldn’t.\n Kyung Mi was up there.\n “We have to save them,” I said.\n They looked at me like I was crazy.\n But I knew they understood.\n “We have to save us,” I clarified.\n Serena said, with a metallic edge in her voice, “That’s not us up there any longer.”\n “It’s our mission,” Leonard said. His gearbox rattled in his equivalent of a long, frustrated sigh. “If we don’t save them, it’s a court-martial offense.”\n “Court-martial?” Sargon scoffed. “They’d court-martial a bunch of robots?”\n “No,” I said bluntly. “They’d just wipe us clean and start again.”\n We fell silent then. Outside, the Martian wind raged. I felt a helpless love for this place. Home.\n Kyung Mi looked at me, her spindly body graceful, her face on the screen shining serene, like a crowned princess. I loved her so much. I knew she was real. I knew she was herself.\n I knew we were happy.\n And I knew we couldn’t leave her—and the others—alone on that ship, possibly dying, without at least trying to help.\n “We can hack into the shipboard computer. Force it to send the sleepers down in their escape pods. We’ll collect them and bring them to the oak dome,” Mara said decisively. “We can take care of them, and we can still be us.”\n That made so much sense I almost fell for it. “We’d scrub the mission. They haven’t been sterilized, they aren’t cleared for landing, and they’d have no way of getting back to the ship. We might be destroying their best hope of survival—continued hibernation—without even finding out what’s wrong.”\n Kyung Mi said, “Is there a way to find out?”\n “I built a back door to the shipboard computer. It’s buried under secret codes, but it’s there. I hid it in my personality interface, for emergencies. I’ll partition my consciousness, tunnel up, and find out what’s really happening. And if I have to—I’ll wake my meat self up.”\n Kyung Mi and I looked at each other. Just as we had all these nights on Mars. That loving gaze. I didn’t want to be the lone voice dooming the others. I wanted to save her. Maybe there was a way that only I could go. I—and Kyung Mi, who might be drowning. Whose screen had brightened, resolved, its colors factory sharp. Who might already be dead. Or nearly so. Who might only have moments to live.\n Moments that might be enough, if she had help.\n I took to the broad channel. Into our shared chat, I poured out my heart. No time for rambling or even data. No time for awkward translations of what a robot feels.\n I exerted every bit of memory and creativity I had and called up the scraps of my song.\n I wove them together into something new.\n Softly, Kyung Mi sang along.\n “Do it,” Serena said. “Only take us with you, through the shared channel. We can help.”\n They all voted—two hundred and eighty thumbs up. With the clamor of noisemakers and Bronx cheers. The rattling, enthusiastic fireworks of a robot party.\n Our last one.\n “Ten,” I began, and paused.\n “Nine,” Kyung Mi answered, with shining eyes.\n “Eight!” Kendra shouted.\n Together, we counted down.\n Adele Gardner (none/they/Mx.) is a fiction writer & award-winning poet with work in Analog (forthcoming), Strange Horizons, PodCastle, and Daily Science Fiction. A poetry collection, Halloween Hearts, is forthcoming from Jackanapes Press. A graduate of the Clarion West Writers Workshop, this genderfluid night owl loves watching samurai films and reading comics with cats. Adele serves as literary executor for father, namesake, and mentor Delbert R. Gardner and guest-edited the Arthuriana issue of Eye to the Telescope."}