{"fingerprint": "JxrsvBeZe04tZD7azoMTeci9TcE=", "sitename": "Clarkesworld Magazine", "title": "Touring with the Alien by Carolyn Ives Gilman", "author": "Carolyn Ives Gilman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gilman_04_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Touring with the Alien by Carolyn Ives Gilman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11790 words, novelette\n Touring with the Alien\n 2017 Finalist: Hugo Award for Best Novelette\n The alien spaceships were beautiful, no one could deny that: towering domes of overlapping, chitinous plates in pearly dawn colors, like reflections on a tranquil sea. They appeared overnight, a dozen incongruous soap-bubble structures scattered across the North American continent. One of them blocked a major Interstate in Ohio; another monopolized a stadium parking lot in Tulsa. But most stood in cornfields and forests and deserts where they caused little inconvenience.\n Everyone called them spaceships, but from the beginning the experts questioned that name. NORAD had recorded no incoming landing craft, and no mother ship orbited above. That left two main possibilities: they were visitations from an alien race that traveled by some incomprehensibly advanced method; or they were a mutant eruption of Earth’s own tortured ecosystem.\n The domes were impervious. Probing radiation bounced off them, as did potshots from locals in the days before the military moved in to cordon off the areas. Attempts to communicate produced no reaction. All the domes did was sit there reflecting the sky in luminous, dreaming colors.\n Six months later, the panic had subsided and even CNN had grown weary of reporting breaking news that was just the same old news. Then, entry panels began to open and out walked the translators, one per dome. They were perfectly ordinary-looking human beings who said that they had been abducted as children and had now come back to interpret between their biological race and the people who had adopted them.\n Humanity learned surprisingly little from the translators. The aliens had come in peace. They had no demands and no questions. They merely wanted to sit here minding their own business for a while. They wanted to be left alone.\n No one believed it.\n Avery was visiting her brother when her boss called.\n “Say, you’ve still got those security credentials, right?” Frank said.\n “Yes . . . ” She had gotten the security clearance in order to haul a hush-hush load of nuclear fuel to Nevada, a feat she wasn’t keen on repeating.\n “And you’re in D.C.?”\n She was actually in northern Virginia, but close enough. “Yeah.”\n “I’ve got a job for you.”\n “Don’t tell me it’s another gig for Those We Dare Not Name.”\n He didn’t laugh, which told her it was bad. “Uh . . . no. More like those we can’t name.”\n She didn’t get it. “What?”\n “Some . . . neighbors. Who live in funny-shaped houses. I can’t say more over the phone.”\n She got it then. “Frank! You took a contract from the frigging aliens?”\n “Sssh,” he said, as if every phone in America weren’t bugged. “It’s strictly confidential.”\n “Jesus,” she breathed out. She had done some crazy things for Frank, but this was over the top. “When, where, what?”\n “Leaving tonight. D.C. to St. Louis. A converted tour bus.”\n “Tour bus? How many of them are going?”\n “Two passengers. One human, one . . . whatever. Will you do it?”\n She looked into the immaculate condo living room, where her brother, Blake, and his husband, Jeff, were playing a noisy, fast-paced video game, oblivious to her conversation. She had promised to be at Blake’s concert tomorrow. It meant a lot to him. “Just a second,” she said to Frank.\n “I can’t wait,” he said.\n “Two seconds.” She muted the phone and walked into the living room. Blake saw her expression and paused the game.\n She said, “Would you hate me if I couldn’t be there tomorrow?”\n Disappointment, resignation, and wry acceptance crossed his face, as if he hadn’t ever really expected her to keep her promise. “What is it?” he asked.\n “A job,” she said. “A really important job. Never mind, I’ll turn it down.”\n “No, Ave, don’t worry. There will be other concerts.”\n Still, she hesitated. “You sure?” she said. She and Blake had always hung together, like castaways on a hostile sea. They had given each other courage to sail into the wind. To disappoint him felt disloyal.\n “Go ahead,” he said. “Now I’ll be sorry if you stay.”\n She thumbed the phone on. “Okay, Frank, I’ll do it. This better not get me in trouble.”\n “Cross my heart and hope to die,” he said. “I’ll email you instructions. Bye.”\n From the couch, Jeff said, “Now I know why you want to do it. Because it’s likely to get you in trouble.”\n “No, he gave me his word,” Avery said.\n “Cowboy Frank? The one who had you drive guns to Nicaragua?”\n “That was perfectly legal,” Avery said.\n Jeff had a point, as usual. Specialty Shipping did the jobs no reputable company would handle. Ergo, so did Avery.\n “What is it this time?” Blake asked.\n “I can’t say.” The email had come through; Frank had attached the instructions as if a PDF were more secure than email. She opened and scanned them.\n The job had been cleared by the government, but the client was the alien passenger, and she was to take orders only from him, within the law. She scanned the rest of the instructions till she saw the pickup time. “Damn, I’ve got to get going,” she said.\n Her brother followed her into the guest room to watch her pack up. He had never understood her nomadic lifestyle, which made his silent support for it all the more generous. She was compelled to wander; he was rooted in this home, this relationship, this warm, supportive community. She was a discarder, using things up and throwing them away; he had created a home that was a visual expression of himself—from the spare, Japanese-style furniture to the Zen colors on the walls. Visiting him was like living inside a beautiful soul. She had no idea how they could have grown up so different. It was as if they were foundlings.\n She pulled on her boots and shouldered her backpack. Blake hugged her. “Have a good trip,” he said. “Call me.”\n “Will do,” she said, and hit the road again.\n The media had called the dome in Rock Creek Park the Mother Ship—but only because of its proximity to the White House, not because it was in any way distinctive. Like the others, it had appeared overnight, sited on a broad, grassy clearing that had been a secluded picnic ground in the urban park. It filled the entire creek valley, cutting off the trails and greatly inconveniencing the joggers and bikers.\n Avery was unprepared for its scale. Like most people, she had seen the domes only on TV, and the small screen did not do justice to the neck-craning reality. She leaned forward over the wheel and peered out the windshield as she brought the bus to a halt at the last checkpoint. The National Park Police pickup that had escorted her through all the other checkpoints pulled aside.\n The appearance of an alien habitat had set off a battle of jurisdictions in Washington. The dome stood on U.S. Park Service property, but D.C. Police controlled all the access streets, and the U.S. Army was tasked with maintaining a perimeter around it. No agency wanted to surrender a particle of authority to the others. And then there was the polite, well-groomed young man who had introduced himself as “Henry,” now sitting in the passenger seat next to her. His neatly pressed suit sported no bulges of weaponry, but she assumed he was CIA.\n She now saw method in Frank’s madness at calling her so spur-of-the-moment. Her last-minute arrival had prevented anyone from pulling her aside into a cinderblock room for a “briefing.” Instead, Henry had accompanied her in the bus, chatting informally.\n “Say, while you’re on the road . . . ”\n “No,” she said.\n “No?”\n “The alien’s my client. I don’t spy on clients.”\n He paused a moment, but seemed unruffled. “Not even for your country?”\n “If I think my country’s in danger, I’ll get in touch.”\n “Fair enough,” he said pleasantly. She hadn’t expected him to give up so easily.\n He handed her a business card. “So you can get in touch,” he said.\n She glanced at it. It said “Henry,” with a phone number. No logo, no agency, no last name. She put it in a pocket.\n “I have to get out here,” he said when the bus rolled to a halt a hundred yards from the dome. “It’s been nice meeting you, Avery.”\n “Take your bug with you,” she said.\n “I beg your pardon?”\n “The bug you left somewhere in this cab.”\n “There’s no bug,” he said seriously.\n Since the bus was probably wired like a studio, she shrugged and resolved not to scratch anywhere embarrassing till she had a chance to search. As she closed the door behind Henry, the soldiers removed the roadblock and she eased the bus forward.\n It was almost evening, but floodlights came on as she approached the dome. She pulled the bus parallel to the wall and lowered the wheelchair lift. One of the hexagonal panels slid aside, revealing a stocky, dark-haired young man in black glasses, surrounded by packing crates of the same pearly substance as the dome. Avery started forward to help with loading, but he said tensely, “Stay where you are.” She obeyed. He pushed the first crate forward and it moved as if on wheels, though Avery could see none. It was slightly too wide for the lift, so the man put his hands on either side and pushed in. The crate reconfigured itself, growing taller and narrower till it fit onto the platform. Avery activated the power lift.\n He wouldn’t let Avery touch any of the crates, but insisted on stowing them himself at the back of the bus, where a private bedroom suite had once accommodated a touring celebrity singer. When the last crate was on, he came forward and said, “We can go now.”\n “What about the other passenger?” Avery said.\n “He’s here.”\n She realized that the alien must have been in one of the crates—or, for all she knew, was one of the crates. “Okay,” she said. “Where to?”\n “Anywhere,” he said, and turned to go back into the bedroom.\n Since she had no instructions to the contrary, Avery decided to head south. As she pulled out of the park, there was no police escort, no helicopter overhead, no obvious trailing car. The terms of this journey had been carefully negotiated at the highest levels, she knew. Their security was to be secrecy; no one was to know where they were. Avery’s instructions from Frank had stressed that, aside from getting the alien safely where he wanted to go, insuring his privacy was her top priority. She was not to pry into his business or allow anyone else to do so.\n Rush hour traffic delayed them a long time. At first, Avery concentrated on putting as much distance as she could between the bus and Washington. It was past ten by the time she turned off the main roads. She activated the GPS to try and find a route, but all the screen showed was snow. She tried her phone, and the result was the same. Not even the radio worked. One of those crates must have contained a jamming device; the bus was a rolling electronic dead zone. She smiled. So much for Henry’s bugs.\n It was quiet and peaceful driving through the night. A nearly full moon rode in the clear autumn sky, and woods closed in around them. Once, when she had first taken up driving in order to escape her memories, she had played a game of heading randomly down roads she had never seen, getting deliberately lost. Now she played it again, not caring where she ended up. She had never been good at keeping to the main roads.\n By 3:00 she was tired, and when she saw the entrance to a state park, she turned and pulled into the empty parking lot. In the quiet after the engine shut off, she walked back through the kitchen and sitting area to see if there were any objections from her passengers. She listened at the closed door, but heard nothing and concluded they were asleep. As she was turning away, the door jerked open and the translator said, “What do you want?”\n He was still fully dressed, exactly as she had seen him before, except without the glasses, his eyes were a little bloodshot, as if he hadn’t closed them. “I’ve pulled over to get some sleep,” she said. “It’s not safe to keep driving without rest.”\n “Oh. All right,” he said, and closed the door.\n Shrugging, she went forward. There was a fold-down bunk that had once served the previous owner’s entourage, and she now prepared to use it. She brushed her teeth in the tiny bathroom, pulled a sleeping bag from her backpack, and settled in.\n Morning sun woke her. When she opened her eyes, it was flooding in the windows. At the kitchen table a yard away from her, the translator was sitting, staring out the window. By daylight, she saw that he had a square face the color of teak and closely trimmed black beard. She guessed that he might be Latino, and in his twenties.\n “Morning,” she said. He turned to stare at her, but said nothing. Not practiced in social graces, she thought. “I’m Avery,” she said.\n Still he didn’t reply. “It’s customary to tell me your name now,” she said.\n “Oh. Lionel,” he answered.\n “Pleased to meet you.”\n He said nothing, so she got up and went into the bathroom. When she came out, he was still staring fixedly out the window. She started making coffee. “Want some?” she asked.\n “What is it?”\n “Coffee.”\n “I ought to try it,” he said reluctantly.\n “Well, don’t let me force you,” she said.\n “Why would you do that?” He was studying her, apprehensive.\n “I wouldn’t. I was being sarcastic. Like a joke. Never mind.”\n “Oh.”\n He got up restlessly and started opening the cupboards. Frank had stocked them with all the necessities, even a few luxuries. But Lionel didn’t seem to find what he was looking for.\n “Are you hungry?” Avery guessed.\n “What do you mean?”\n Avery searched for another way to word the question. “Would you like me to fix you some breakfast?”\n He looked utterly stumped.\n “Never mind. Just sit down and I’ll make you something.”\n He sat down, gripping the edge of the table tensely. “That’s a tree,” he said, looking out the window.\n “Right. It’s a whole lot of trees.”\n “I ought to go out.”\n She didn’t make the mistake of joking again. It was like talking to a person raised by wolves. Or aliens.\n When she set a plate of eggs and bacon down in front of him, he sniffed it suspiciously. “That’s food?”\n “Yes, it’s good. Try it.”\n He watched her eat for a few moments, then gingerly tried a bite of scrambled eggs. His expression showed distaste, but he resolutely forced himself to swallow. But when he tried the bacon, he couldn’t bear it. “It bit my mouth,” he said.\n “You’re probably not used to the salt. What do you normally eat?”\n He reached in a pocket and took out some brown pellets that looked like dog kibble. Avery made a face of disgust. “What is that, people chow?”\n “It’s perfectly adapted to our nutritional needs,” Lionel said. “Try it.”\n She was about to say “no thanks,” but he was clearly making an effort to try new things, so she took a pellet and popped it in her mouth. It wasn’t terrible—chewy rather than crunchy—but tasteless. “I think I’ll stick to our food,” she said.\n He looked gloomy. “I need to learn to eat yours.”\n “Why? Research?”\n He nodded. “I have to find out how the feral humans live.”\n So, Avery reflected, she was dealing with someone raised as a pet, who was now being released into the wild. For whatever reason.\n “So where do you want to go today?” Avery said, sipping coffee.\n He gave an indifferent gesture.\n “You’re heading for St. Louis?”\n “Oh, I just picked that name off a map. It seemed to be in the center.”\n “That it is.” She had lived there once; it was so incorrigibly in the center there was no edge to it. “Do you want to go by any particular route?”\n He shrugged.\n “How much time do you have?”\n “As long as it takes.”\n “Okay. The scenic route, then.”\n She got up to clean the dishes, telling Lionel that this was a good time for him to go out, if he wanted to. It took him a while to summon his resolve. She watched out the kitchen window as he approached a tree as if to have a conversation with it. He felt its bark, smelled its leaves, and returned unhappy and distracted.\n Avery followed the same random-choice method of navigation as the previous night, but always trending west. Soon they came to the first ridge of mountains. People from western states talked as if the Appalachians weren’t real mountains, but they were—rugged and impenetrable ridges like walls erected to bar people from the land of milk and honey. In the mountains, all the roads ran northeast and southwest through the valleys between the crumpled land, with only the brave roads daring to climb up and pierce the ranges. The autumn leaves were at their height, russet and gold against the brilliant sky. All day long Lionel sat staring out the window.\n That night she found a half-deserted campground outside a small town. She refilled the water tanks, hooked up the electricity, then came back in. “You’re all set,” she told Lionel. “If it’s all right with you, I’m heading into town.”\n “Okay,” he said.\n It felt good to stretch her legs walking along the highway shoulder. The air was chill but bracing. The town was a tired, half abandoned place, but she found a bar and settled down with a beer and a burger. She couldn’t help watching the patrons around her—worn-down, elderly people just managing to hang on. What would an alien think of America if she brought him here?\n Remembering that she was away from the interference field, she thumbed on her phone—and immediately realized that the ping would give away her location to the spooks. But since she’d already done it, she dialed her brother’s number and left a voicemail congratulating him on the concert she was missing. “Everything’s fine with me,” she said, then added mischievously, “I met a nice young man named Henry. I think he’s sweet on me. Bye.”\n Heading back through the night, she became aware that someone was following her. The highway was too dark to see who it was, but when she stopped, the footsteps behind her stopped, too. At last a car passed, and she wheeled around to see what the headlights showed.\n “Lionel!” she shouted. He didn’t answer, just stood there, so she walked back toward him. “Did you follow me?”\n He was standing with hands in pockets, hunched against the cold. Defensively, he said, “I wanted to see what you would do when I wasn’t around.”\n “It’s none of your business what I do off duty. Listen, respecting privacy goes both ways. If you want me to respect yours, you’ve got to respect mine, okay?”\n He looked cold and miserable, so she said, “Come on, let’s get back before you freeze solid.”\n They walked side by side in silence, gravel crunching underfoot. At last he said stiffly, “I’d like to re-negotiate our contract.”\n “Oh, yeah? What part of the contract?”\n “The part about privacy. I . . . ” He searched for words. “We should have asked for more than a driver. We need a translator.”\n At least he’d realized it. He might speak perfect English, but he was not fluent in Human.\n “My contract is with your . . . employer. Is this what he wants?”\n “Who?”\n “The other passenger. I don’t know what to call him. ‘The alien’ isn’t polite. What’s his name?”\n “They don’t have names. They don’t have a language.”\n Astonished, Avery said, “Then how do you communicate?”\n He glowered at her. She held up her hands. “Sorry. No offense intended. I’m just trying to find out what he wants.”\n “They don’t want things,” he muttered, gazing fixedly at the moonlit road. “At least, not like you do. They’re not . . . awake. Aware. Not like people are.”\n This made so little sense to Avery, she wondered if he were having trouble with the language. “I don’t understand,” she said. “You mean they’re not . . . sentient?”\n “They’re not conscious,” he said. “There’s a difference.”\n “But they have technology. They built those domes, or brought them here, or whatever the hell they did. They have an advanced civilization.”\n “I didn’t say they aren’t smart. They’re smarter than people are. They’re just not conscious.”\n Avery shook her head. “I’m sorry, I just can’t imagine it.”\n “Yes, you can,” Lionel said impatiently. “People function unconsciously all the time. You’re not aware that you’re keeping your balance right now—you just do it automatically. You don’t have to be aware to walk, or breathe. In fact, the more skillful you are at something, the less aware you are. Being aware would just degrade their skill.”\n They had come to the campground entrance. Behind the dark pine trees, Avery could see the bus, holding its unknowable passenger. For a moment the bus seemed to stare back with blank eyes. She made herself focus on the practical. “So how can I know what he wants?”\n “I’m telling you.”\n She refrained from asking, “And how do you know?” because he’d already refused to answer that. The new privacy rules were to be selective, then. But she already knew more about the aliens than anyone else on Earth, except the translators. Not that she understood.\n “I’m sorry, I can’t keep calling him ‘him,’ or ‘the alien,’” Avery said the next morning over breakfast. “I have to give him a name. I’m going to call him ‘Mr. Burbage.’ If he doesn’t know, he won’t mind.”\n Lionel didn’t look any more disturbed than usual. She took that as consent.\n “So where are we going today?” she asked.\n He pressed his lips together in concentration. “I need to go to a place where I can acquire knowledge.”\n Since this could encompass anything from a brothel to a university, Avery said, “You’ve got to be more specific. What kind of knowledge?”\n “Knowledge about you.”\n “Me?”\n “No, you humans. How you work.”\n Humans. For that, she would have to find a bigger town.\n As she cruised down a county road, Avery thought about Blake. Once, he had told her that to play an instrument truly well, you had to lose all awareness of what you were doing, and rely entirely on the muscle memory in your fingers. “You are so in the present, there is no room for self,” Blake said. “No ego, no doubt, no introspection.”\n She envied him the ability to achieve such a state. She had tried to play the saxophone, but had never gotten good enough to experience what Blake described. Only playing video games could she concentrate intensely enough to lose self-awareness. It was strange, how addictive it was to escape the prison of her skull and forget she had a self. Mystics and meditators strove to achieve such a state.\n A motion in the corner of her eye made her slam on the brakes and swerve. A startled deer pirouetted, flipped its tail, and leaped away. She continued on more slowly, searching for a sign to see where she was. She could not remember having driven the last miles, or whether she had passed any turns. Smiling grimly, she realized that driving was her skill, something she knew so well that she could do it unconsciously. She had even reacted to a threat before knowing what it was. Her reflexes were faster than her conscious mind.\n Were the aliens like that all the time? In a perpetual state of flow, like virtuoso musicians or Zen monks in samadhi? What would be the point of achieving such supreme skill, if the price was never knowing it was you doing it?\n Around noon, they came to a town nestled in a steep valley on a rushing river. Driving down the main street, she spied a quaint, cupolaed building with a “Municipal Library” sign out front. Farther on, at the edge of town, an abandoned car lot offered a grass-pocked parking lot, so she turned in. “Come on, Lionel,” she called out. “I’ve found a place for you to acquire knowledge.”\n They walked back into town together. The library was quiet and empty except for an old man reading a magazine. The selection of books was sparse, but there was a row of computers. “You know how to use these?” Avery said in a low voice.\n “Not this kind,” Lionel said. “They’re very . . . primitive.”\n They sat down together, and Avery explained how to work the mouse and get on the Internet, how to search and scroll. “I’ve got it,” he said. “You can go now.”\n Shrugging, she left him to his research. She strolled down the main street, stopped in a drugstore, then found a café that offered fried egg sandwiches on Wonder Bread, a luxury from her childhood. With lunch and a cup of coffee, she settled down to wait, sorting email on her phone.\n Some time later, she became aware of the television behind the counter. It was tuned to one of those daytime exposé shows hosted by a shrill woman who spoke in a tone of breathless indignation. “Coming up,” she said, “Slaves or traitors? Who are these alien translators?”\n Avery realized that some part of her brain must have been listening and alerted her conscious mind to pay attention, just as it had reacted to the deer. She had a threat detection system she was not even aware of.\n In the story that followed, a correspondent revealed that she had been unable to match any of the translators with missing children recorded in the past twenty years. The host treated this as suspicious information that someone ought to be looking into. Then came a panel of experts to discuss what they knew of the translators, which was nothing.\n “Turncoats,” commented one of the men at the counter watching the show. “Why would anyone betray his own race?”\n “They’re not even human,” said another, “just made to look that way. They’re clones or robots or something.”\n “The government won’t do anything. They’re just letting those aliens sit there.”\n Avery got up to pay her bill. The woman at the cash register said, “You connected with that big tour bus parked out at Fenniman’s?”\n She had forgotten that in a town like this, everyone knew instantly what was out of the ordinary.\n “Yeah,” Avery said. “Me and my . . . boyfriend are delivering it to a new owner.”\n She glanced up at the television just as a collage of faces appeared. Lionel’s was in the top row. “Look closely,” the show’s host said. “If you recognize any of these faces, call us at 1-800- . . . ” Avery didn’t wait to hear the number. The door shut behind her.\n It was hard not to walk quickly enough to attract attention. Why had she left him alone, as if it were safe? Briefly, she thought of bringing the bus in to pick him up at the library, but it would only attract more attention. The sensible thing was to slip inconspicuously out of town.\n Lionel was engrossed in a website about the brain when she came in. She sat down next to him and said quietly, “We’ve got to leave.”\n “I’m not . . . ”\n “Lionel. We have to leave. Right now.”\n He frowned, but got the message. As he rose to put on his coat, she quickly erased his browser history and cache. Then she led the way out and around the building to a back street where there were fewer eyes. “Hold my hand,” she said.\n “Why?”\n “I told them you were my boyfriend. We’ve got to act friendly.”\n He didn’t object or ask what was going on. The aliens had trained him well, she thought.\n The street they were on came to an end, and they were forced back onto the main thoroughfare, right past the café. In Avery’s mind every window was a pair of eyes staring at the strangers. As they left the business section of town and the buildings thinned out, she became aware of someone walking a block behind them. Glancing back, she saw a man in hunter’s camouflage and billed cap, carrying a gun case on a strap over one shoulder.\n She sped up, but the man trailing them sped up as well. When they were in sight of the bus, Avery pressed the keys into Lionel’s hand and said, “Go on ahead. I’ll stall this guy. Get inside and don’t open the door to anyone but me.” Then she turned back to confront their pursuer.\n Familiarity tickled as he drew closer. When she was sure, she called out, “Afternoon, Henry! What a coincidence to see you here.”\n “Hello, Avery,” he said. He didn’t look quite right in the hunter costume: he was too urban and fit. “That was pretty careless of you. I followed to make sure you got back safe.”\n “I didn’t know his picture was all over the TV,” she said. “I’ve been out of touch.”\n “I know, we lost track of you for a while there. Please don’t do that again.”\n As threats went, Henry now seemed like the lesser evil. She hesitated, then said, “I didn’t see any need to get in touch.” That meant the country was not in peril.\n “Thanks,” he said. “Listen, if you turn left on Highway 19 ahead, you’ll come to a national park with a campground. It’ll be safe.”\n As she walked back to the bus, she was composing a lie about who she had been talking to. But Lionel never asked. As soon as she was on board he started eagerly telling her about what he had learned in the library. She had never seen him so animated, so she gestured him to sit in the passenger seat beside her while she got the bus moving again.\n “The reason you’re conscious is because of the cerebral cortex,” he said. “It’s an add-on, the last part of the brain to evolve. Its only purpose is to monitor what the rest of the brain is doing. All the sensory input goes to the inner brain first, and gets processed, so the cortex never gets the raw data. It only sees the effect on the rest of the brain, not what’s really out there. That’s why you’re aware of yourself. In fact, it’s all you’re aware of.”\n “Why are you saying ‘you’?” Avery asked. “You’ve got a cerebral cortex, too.”\n Defensively, he said, “I’m not like you.”\n Avery shrugged. “Okay.” But she wanted to keep the conversation going. “So Mr. Burbage doesn’t have a cortex? Is that what you’re saying?”\n “That’s right,” Lionel said. “For him, life is a skill of the autonomic nervous system, not something he had to consciously learn. That’s why he can think and react faster than we can, and requires less energy. The messages don’t have to travel on a useless detour through the cortex.”\n “Useless?” Avery objected. “I kind of like being conscious.”\n Lionel fell silent, suddenly grave and troubled.\n She glanced over at him. “What’s the matter?”\n In a low tone he said, “He likes being conscious, too. It’s what they want from us.”\n Avery gripped the wheel and tried not to react. Up to now, the translators had denied that the aliens wanted anything at all from humans. But then it occurred to her that Lionel might not mean humans when he said “us.”\n “You mean, you translators?” she ventured.\n He nodded, looking grim.\n “Is that a bad thing?” she asked, reacting to his expression.\n “Not for us,” he said. “It’s bad for them. It’s killing him.”\n He was struggling with some strong emotion. Guilt, she thought. Maybe grief.\n “I’m sorry,” she said.\n Angrily, he stood up to head back into the bus. “Why do you make me think of this?” he said. “Why can’t you just mind your own business?”\n Avery drove on, listening as he slammed the bedroom door behind him. She didn’t feel any resentment. She knew all about guilt and grief, and how useless they made you feel. Lionel’s behavior made more sense to her now. He was having trouble distinguishing between what was happening to him externally and what was coming from inside. Even people skilled at being human had trouble with that.\n The national park Henry had recommended turned out to be at Cumberland Gap, the mountain pass early pioneers had used to migrate west to Kentucky. They spent the night in the campground undisturbed. At dawn, Avery strolled out in the damp morning air to look around. She quickly returned to say, “Lionel, come out here. You need to see this.”\n She led him across the road to an overlook facing west. From the edge of the Appalachians they looked out on range after range of wooded foothills swaddled in fog. The morning sun at their backs lit everything in shades of mauve and azure. Avery felt like Daniel Boone looking out on the Promised Land, stretching before her into the misty distance, unpolluted by the past.\n “I find this pleasant,” Lionel said gravely.\n Avery smiled. It was a breakthrough statement for someone so unaccustomed to introspection that he hadn’t been able to tell her he was hungry two days ago. But all she said was, “Me, too.”\n After several moments of silence, she ventured, “Don’t you think Mr. Burbage would enjoy seeing this? There’s no one else around. Doesn’t he want to get out of the bus some time?”\n “He is seeing it,” Lionel said.\n “What do you mean?”\n “He is here.” Lionel tapped his head with a finger.\n Avery couldn’t help staring. “You mean you have some sort of telepathic connection with him?”\n “There’s no such thing as telepathy,” Lionel said dismissively. “They communicate with neurotransmitters.” She was still waiting, so he said, “He doesn’t have to be all in one place. Part of him is with me, part of him is in the bus.”\n “In your head?” she asked, trying not to betray how creepy she found this news.\n He nodded. “He needs me to observe the world for him, and understand it. They have had lots of other helper species to do things for them—species that build things, or transport them. But we’re the first one with advanced consciousness.”\n “And that’s why they’re interested in us.”\n Lionel looked away to avoid her eyes, but nodded. “They like it,” he said, his voice low and reluctant. “At first it was just novel and new for them, but now it’s become an addiction, like a dangerous drug. We pay a high metabolic price for consciousness; it’s why our lifespan is so short. They live for centuries. But when they get hooked on us, they burn out even faster than we do.”\n He picked up a rock and flung it over the cliff, watching as it arced up, then plummeted.\n “And if he dies, what happens to you?” Avery asked.\n “I don’t want him to die,” Lionel said. He put his hands in his pockets and studied his feet. “It feels . . . good to have him around. I like his company. He’s very old, very wise.”\n For a moment, she could see it through his eyes. She could imagine feeling intimately connected to an ancient being who was dying from an inability to part with his adopted human son. What a terrible burden for Lionel to carry, to be slowly killing someone he loved.\n And yet, she still felt uneasy.\n “How do you know?” she asked.\n He looked confused. “What do you mean?”\n “You said he’s old and wise. How do you know that?”\n “The way you know anything unconscious. It’s a feeling, an instinct.”\n “Are you sure he not controlling you? Pushing around your neurotransmitters?”\n “That’s absurd,” he said, mildly irritated. “I told you, he’s not conscious, at least not naturally. Control is a conscious thing.”\n “But what if you did something he didn’t want?”\n “I don’t feel like doing things he doesn’t want. Like talking to you now. He must have decided he can trust you, because I wouldn’t feel like telling you anything if he hadn’t.”\n Avery wasn’t sure whether being trusted by an alien was something she aspired to. But she did want Lionel to trust her, and so she let the subject drop.\n “Where do you want to go today?” she asked.\n “You keep asking me that.” He stared out on the landscape, as if waiting for a revelation. At last he said, “I want to see humans living as they normally do. We’ve barely seen any of them. I didn’t think the planet was so sparsely populated.”\n “Okay,” she said. “I’m going to have to make a phone call for that.”\n When he had returned to the bus, she strolled away, took out Henry’s card, and thumbed the number. Despite the early hour, he answered on the first ring.\n “He wants to see humans,” she said. “Normal humans behaving normally. Can you help me out?”\n “Let me make some calls,” he said. “I’ll text you instructions.”\n “No men in black,” she said. “You know what I mean?”\n “I get it.”\n When Avery stopped for diesel around noon, the gas station television was blaring with news that the Justice Department would investigate the aliens for abducting human children. She escaped into the restroom to check her phone. The internet was ablaze with speculation: who the translators were, whether they could be freed, whether they were human at all. The part of the government that had approved Lionel’s road trip was clearly working at cross purposes with the part that had dreamed up this new strategy for extracting information from the aliens. The only good news was that no hint had leaked out that an alien was roaming the back roads of America in a converted bus.\n Henry had texted her a cryptic suggestion to head toward Paris. She had to Google it to find that there actually was a Paris, Kentucky. When she came out to pay for the fuel, she was relieved to see that the television had moved on to World Series coverage. On impulse, she bought a Cardinals cap for Lionel.\n Paris turned out to be a quaint old Kentucky town that had once had delusions of cityhood. Today, a county fair was the main event in town. The RV park was almost full, but Avery’s E.T. Express managed to maneuver in. When everything was settled, she sat on the bus steps sipping a Bud and waiting for night so they could venture out with a little more anonymity. The only thing watching her was a skittish, half-wild cat crouched behind a trashcan. Somehow, it reminded her of Lionel, so she tossed it a Cheeto to see if she could lure it out. It refused the bait.\n That night, disguised by the dark and a Cardinals cap, Lionel looked tolerably inconspicuous. As they were leaving to take in the fair, she said, “Will Mr. Burbage be okay while we’re gone? What if someone tries to break into the bus?”\n “Don’t worry, he’ll be all right,” Lionel said. His tone implied more than his words. She resolved to call Henry at the earliest opportunity and pass along a warning not to try anything.\n The people in the midway all looked authentic. If there were snipers on the bigtop and agents on the merry-go-round, she couldn’t tell. When people failed to recognize Lionel at the ticket stand and popcorn wagon, she began to relax. Everyone was here to enjoy themselves, not to look for aliens.\n She introduced Lionel to the joys of corn dogs and cotton candy, to the Ferris wheel and tilt-a-whirl. He took in the jangling sounds, the smells of deep-fried food, and the blinking lights with a grave and studious air. When they had had their fill of all the machines meant to disorient and confuse, they took a break at a picnic table, sipping Cokes.\n Avery said, “Is Mr. Burbage enjoying this?”\n Lionel shrugged. “Are you?” He wasn’t deflecting her question; he actually wanted to know.\n She considered. “I think people enjoy these events mainly because they bring back childhood memories,” she said.\n “Yes. It does seem familiar,” Lionel said.\n “Really? What about it?”\n He paused, searching his mind. “The smells,” he said at last.\n Avery nodded. It was smells for her, as well: deep fat fryers, popcorn. “Do you remember anything from the time before you were abducted?”\n “Adopted,” he corrected her.\n “Right, adopted. What about your family?”\n He shook his head.\n “Do you ever wonder what kind of people they were?”\n “The kind of people who wouldn’t look for me,” he said coldly.\n “Wait a minute. You don’t know that. For all you know, your mother might have cried her eyes out when you disappeared.”\n He stared at her. She realized she had spoken with more emotion than she had intended. The subject had touched a nerve. “Sorry,” she muttered, and got up. “I’m tired. Can we head back?”\n “Sure,” he said, and followed her without question.\n That night she couldn’t sleep. She lay watching the pattern from the lights outside on the ceiling, but her mind was on the back of the bus. Up to now she had slept without thinking of the strangeness just beyond the door, but tonight it bothered her.\n About 3:00 AM she roused from a doze at the sound of Lionel’s quiet footstep going past her. She lay silent as he eased the bus door open. When he had gone outside she rose and looked to see what he was doing. He walked away from the bus toward a maintenance shed and some dumpsters. She debated whether to follow him; it was just what she had scolded him for doing to her. But concern for his safety won out, and she took a flashlight from the driver’s console, put it in the pocket of a windbreaker, and followed.\n At first she thought she had lost him. The parking lot was motionless and quiet. A slight breeze stirred the pines on the edge of the road. Then she heard a scuffling sound ahead, a thump, and a soft crack. At first she stood listening, but when there was no more sound, she crept forward. Rounding the dumpster, she saw in its shadow a figure crouched on the ground. Unable to make out what was going on, she switched on the flashlight.\n Lionel turned, his eyes wild and hostile. Dangling from his hand was the limp body of a cat, its head ripped off. His face was smeared with its blood. Watching her, he deliberately ripped a bite of cat meat from the body with his teeth and swallowed.\n “Lionel!” she cried out in horror. “Put that down!”\n He turned away, trying to hide his prey like an animal. Without thinking, she grabbed his arm, and he spun fiercely around, as if to fight her. His eyes looked utterly alien. She stepped back. “It’s me, Avery,” she said.\n He looked down at the mangled carcass in his hand, then dropped it, rose, and backed away. Once again taking his arm, Avery guided him away from the dumpsters, back to the bus. Inside, she led him to the kitchen sink. “Wash,” she ordered, then went to firmly close the bus door.\n Her heart was pounding, and she kept the heavy flashlight in her hand for security. But when she came back, she saw he was trembling so hard he had dropped the soap and was leaning against the sink for support. Seeing that his face was still smeared with blood, she took a paper towel and wiped him off, then dried his hands. He sank onto the bench by the kitchen table. She stood watching him, arms crossed, waiting for him to speak. He didn’t.\n “So what was that about?” she said sternly.\n He shook his head.\n “Cats aren’t food,” she said. “They’re living beings.”\n Still he didn’t speak.\n “Have you been sneaking out at night all along?” she demanded.\n He shook his head. “I don’t know . . . I just thought . . . I wanted to see what it would feel like.”\n “You mean Mr. Burbage wanted to see what it would feel like,” she said.\n “Maybe,” he admitted.\n “Well, people don’t do things like that.”\n He was looking ill. She grabbed his arm and hustled him into the bathroom, aiming him at the toilet. She left him there vomiting, and started shoving belongings into her backpack. As she swung it onto her shoulder, he staggered to the bathroom door.\n “I’m leaving,” she said. “I can’t sleep here, knowing you do things like that.”\n He looked dumbstruck. She pushed past him and out the door. She was striding away across the gravel parking lot when he called after her, “Avery! You can’t leave.”\n She wheeled around. “Can’t I? Just watch me.”\n He left the bus and followed her. “What are we going to do?”\n “I don’t care,” she said.\n “I won’t do it again.”\n “Who’s talking, you or him?”\n A light went on in the RV next to them. She realized they were making a late-night scene like trailer-park trash, attracting attention. This wasn’t an argument they could have in public. And now that she was out here, she realized she had no place to go. So she shooed Lionel back toward the bus.\n Once inside, she said, “This is the thing, Lionel. This whole situation is creeping me out. You can’t make any promises as long as he’s in charge. Maybe next time he’ll want to see what it feels like to kill me in my sleep, and you won’t be able to stop him.”\n Lionel looked disturbed. “He won’t do that.”\n “How do you know?”\n “I just . . . do.”\n “That’s not good enough. I need to see him.”\n Avery wasn’t sure why she had blurted it out, except that living with an invisible, ever-present passenger had become intolerable. As long as she didn’t know what the door in the back of the bus concealed, she couldn’t be at ease.\n He shook his head. “That won’t help.”\n She crossed her arms and said, “I can’t stay unless I know what he is.”\n Lionel’s face took on an introspective look, as if he were consulting his conscience. At last he said, “You’d have to promise not to tell anyone.”\n Avery hadn’t really expected him to consent, and now felt a nervous tremor. She dropped her pack on the bed and gripped her hands into fists. “All right.”\n He led the way to the back of the bus and eased the door open as if fearing to disturb the occupant within. She followed him in. The small room was dimly lit and there was an earthy smell. All the crates he had brought in must have been folded up and put away, because none were visible. There was an unmade bed, and beside it a clear box like an aquarium tank, holding something she could not quite make out. When Lionel turned on a light, she saw what the tank contained.\n It looked most like a coral or sponge—a yellowish, rounded growth the size of half a beach ball, resting on a bed of wood chips and dead leaves. Lionel picked up a spray bottle and misted it tenderly. It responded by expanding as if breathing.\n “That’s Mr. Burbage?” Avery whispered.\n Lionel nodded. “Part of him. The most important part.”\n The alien seemed insignificant, something she could destroy with a bottle of bleach. “Can he move?” she asked.\n “Oh, yes,” Lionel said. “Not the way we do.”\n She waited for him to explain. At first he seemed reluctant, but he finally said, “They are colonies of cells with a complicated life cycle. This is the final stage of their development, when they become most complex and organized. After this, they dissolve into the earth. The cells don’t die; they go on to form other coalitions. But the individual is lost. Just like us, I suppose.”\n What she was feeling, she realized, was disappointment. In spite of all Lionel had told her, she had hoped there would be some way of communicating. Before, she had not truly believed that the alien could be insentient. Now she did. In fact, she found it hard to believe that it could think at all.\n “How do you know he’s intelligent?” she asked. “He could be just a heap of chemicals, like a loaf of bread rising.”\n “How do you know I’m intelligent?” he said, staring at the tank. “Or anyone?”\n “You react to me. You communicate. He can’t.”\n “Yes, he can.”\n “How? If I touched him—“\n “No!” Lionel said quickly. “Don’t touch him. You’d see, he would react. It wouldn’t be malice, just a reflex.”\n “Then how do you . . . ?”\n Reluctantly, Lionel said, “He has to touch you. It’s the only way to exchange neurotransmitters.” He paused, as if debating something internally. She watched the conflict play across his face. At last, reluctantly, he said, “I think he would be willing to communicate with you.”\n It was what she had wanted, some reassurance of the alien’s intentions. But now it was offered, her instincts were unwilling. “No thanks,” she said.\n Lionel looked relieved. She realized he hadn’t wanted to give up his unique relationship with Mr. Burbage.\n “Thanks anyway,” she said, for the generosity of the offer he hadn’t wanted to make.\n And yet, it left her unsure. She had only Lionel’s word that the alien was friendly. After tonight, that wasn’t enough.\n Neither of them could sleep, so as soon as day came they set out again. Heading west, Avery knew they were going deeper and deeper into isolationist territory, where even human strangers were unwelcome, never mind aliens. This was the land where she had grown up, and she knew it well. From here, the world outside looked like a violent, threatening place full of impoverished hordes who envied and hated the good life in America. Here, even the churches preached self-satisfaction, and discontent was the fault of those who hated freedom—like college professors, homosexuals, and immigrants.\n Growing up, she had expected to spend her life in this country. She had done everything right—married just out of high school, worked as a waitress, gotten pregnant at 19. Her life had been mapped out in front of her.\n She couldn’t even imagine it now.\n This morning, Lionel seemed to want to talk. He sat beside her in the co-pilot seat, watching the road and answering her questions.\n “What does it feel like, when he communicates with you?”\n He reflected. “It feels like a mood, or a hunch. Or I act on impulse.”\n “How do you know it’s him, and not your own subconscious?”\n “I don’t. It doesn’t matter.”\n Avery shook her head. “I wouldn’t want to go through life acting on hunches.”\n “Why not?”\n “Your unconscious . . . it’s unreliable. You can’t control it. It can lead you wrong.”\n “That’s absurd,” he said. “It’s not some outside entity; it’s you. It’s your conscious mind that’s the slave master, always worrying about control. Your unconscious only wants to preserve you.”\n “Not if there’s an alien messing around with it.”\n “He’s not like that. This drive to dominate—that’s a conscious thing. He doesn’t have that slave master part of the brain.”\n “Do you know that for a fact, or are you just guessing?”\n “Guessing is what your unconscious tells you. Knowing is a conscious thing. They’re only in conflict if your mind is fighting itself.”\n “Sounds like the human condition to me,” Avery said. This had to be the weirdest conversation in her life.\n “Is he here now?” she asked.\n “Of course he is.”\n “Don’t you ever want to get away from him?”\n Puzzled, he said, “Why should I?”\n “Privacy. To be by yourself.”\n “I don’t want to be by myself.”\n Something in his voice told her he was thinking ahead, to the death of his lifelong companion. Abruptly, he rose and walked back into the bus.\n Actually, she had lied to him. She had gone through life acting on hunches. Go with your gut had been her motto, because she had trusted her gut. But of course it had nothing to do with gut, or heart—it was her unconscious mind she had been following. Her unconscious was why she took this road rather than that, or preferred Raisin Bran to Corn Flakes. It was why she found certain tunes achingly beautiful, and why she was fond of this strange young man, against all rational evidence.\n As the road led them nearer to southern Illinois, Avery found memories surfacing. They came with a tug of regret, like a choking rope pulling her back toward the person she hadn’t become. She thought of the cascade of non-decisions that had led her to become the rootless, disconnected person she was, as much a stranger to the human race as Lionel was, in her way.\n What good has consciousness ever done me? she thought. It only made her aware that she could never truly connect with another human being, deep down. And on that day when her cells would dissolve into the soil, there would be no trace her consciousness had ever existed.\n That night they camped at a freeway rest stop a day’s drive from St. Louis. Lionel was moody and anxious. Avery’s attempt to interest him in a trashy novel was fruitless. At last she asked what was wrong. Fighting to find the words, he said, “He’s very ill. This trip was a bad idea. All the stimulation has made him worse.”\n Tentatively, she said, “Should we head for one of the domes?”\n Lionel shook his head. “They can’t cure this . . . this addiction to consciousness. If they could, I don’t think he’d take it.”\n “Do the others—his own people—know what’s wrong with him?”\n Lionel nodded wordlessly.\n She didn’t know what comfort to offer. “Well,” she said at last, “it was his choice to come.”\n “A selfish choice,” Lionel said angrily.\n She couldn’t help noticing that he was speaking for himself, Lionel, as distinct from Mr. Burbage. Thoughtfully, she said, “Maybe they can’t love us as much as we can love them.”\n He looked at her as if the word “love” had never entered his vocabulary. “Don’t say us,” he said. “I’m not one of you.”\n She didn’t believe it for a second, but she just said, “Suit yourself,” and turned back to her novel. After a few moments, he went into the back of the bus and closed the door.\n She lay there trying to read for a while, but the story couldn’t hold her attention. She kept listening for some sound from beyond the door, some indication of how they were doing. At last she got up quietly and went to listen. Hearing nothing, she tried the door and found it unlocked. Softly, she cracked it open to look inside.\n Lionel was not asleep. He was lying on the bed, his head next to the alien’s tank. But the alien was no longer in the tank; it was on the pillow. It had extruded a mass of long, cordlike tentacles that gripped Lionel’s head in a medusa embrace, snaking into every opening. One had entered an ear, another a nostril. A third had nudged aside an eyeball in order to enter the eye socket. Fluid coursed along the translucent vessels connecting man and creature.\n Avery wavered on the edge of horror. Her first instinct was to intervene, to defend Lionel from what looked like an attack. But the expression on his face was not of terror, but peace. All his vague references to exchanging neurotransmitters came back to her now: this was what he had meant. The alien communicated by drinking cerebrospinal fluid, its drug of choice, and injecting its own.\n Shaken, she eased the door shut again. Unable to get the image out of her mind, she went outside to walk around the bus to calm her nerves. After three circuits she leaned back against the cold metal, wishing she had a cigarette for the first time in years. Above her, the stars were cold and bright. What was this relationship she had landed in the middle of—predator and prey? father and son? pusher and addict? master and slave? Or some strange combination of all? Had she just witnessed an alien learning about love?\n She had been saving a bottle of bourbon for special occasions, so she went in to pour herself a shot.\n To her surprise, Lionel emerged before she was quite drunk. She thought of offering him a glass, but wasn’t sure how it would mix with whatever was already in his brain.\n He sat down across from her, but just stared silently at the floor for a long time. At last he stirred and said, “I think we ought to take him to a private place.”\n “What sort of private place?” Avery asked.\n “Somewhere dignified. Natural. Secluded.”\n To die, she realized. The alien wanted to die in private. Or Lionel wanted him to. There was no telling where one left off and the other began.\n “I know a place,” she said. “Will he make it another day?”\n Lionel nodded silently.\n Through the bourbon haze, Avery wondered what she ought to say to Henry. Was the country in danger? She didn’t think so. This seemed like a personal matter. To be sure, she said, “You’re certain his relatives won’t blame us if he dies?”\n “Blame?” he said.\n That was conscious-talk, she realized. “React when he doesn’t come back?”\n “If they were going to react, they would have done it when he left. They aren’t expecting anything, not even his return. They don’t live in an imaginary future like you people do.”\n “Wise of them,” she said.\n “Yes.”\n They rolled into St. Louis in late afternoon, across the Poplar Street Bridge next to the Arch and off onto I-70 toward the north part of town. Avery knew exactly where she was going. From the first moment Frank had told her the destination was St. Louis, she had known she would end up driving this way, toward the place where she had left the first part of her life.\n Bellefontaine Cemetery lay on what had been the outskirts of the city in Victorian times, several hundred acres of greenery behind a stone wall and a wrought-iron gate. It was a relic from a time when cemeteries were landscaped, parklike sanctuaries from the city. Huge old oak and sweetgum trees lined the winding roadways, their branches now black against the sky. Avery drove slowly past the marble mausoleums and toward the hill at the back of the cemetery, which looked out over the valley toward the Missouri River. It was everything Lionel had wanted—peaceful, natural, secluded.\n Some light rain misted down out of the overcast sky. Avery parked the bus and went out to check whether they were alone. She had seen no one but a single dog-walker near the entrance, and no vehicle had followed them in. The gates would close in half an hour, and the bus would have to be out. Henry and his friends were probably waiting outside the gate for them to appear again. She returned to the bus and knocked on Lionel’s door. He opened it right away. Inside, the large picnic cooler they had bought was standing open, ready.\n “Help me lift him in,” Lionel said.\n Avery maneuvered past the cooler to the tank. “Is it okay for me to touch him?”\n “Hold your hand close to him for a few seconds.”\n Avery did as instructed. A translucent tentacle extruded from the cauliflower folds of the alien’s body. It touched her palm, recoiled, then extended again. Gently, hesitantly, it explored her hand, tickling slightly as it probed her palm and curled around her pinkie. She held perfectly still.\n “What is he thinking?” she whispered.\n “He’s learning your chemical identity,” Lionel said.\n “How can he learn without being aware? Can he even remember?”\n “Of course he can remember. Your immune system learns and remembers just about every pathogen it ever met, and it’s not aware. Can you remember them all?”\n She shook her head, stymied.\n At last, apparently satisfied, the tendril retracted into the alien’s body.\n “All right,” Lionel said, “now you can touch him.”\n The alien was surprisingly heavy. Together, they lifted him onto the bed of dirt and wood chips Lionel had spread in the bottom of the cooler. Lionel fitted the lid on loosely, and each of them took a handle to carry their load out into the open air. Avery led the way around a mausoleum shaped like a Greek temple to an unmowed spot hidden from the path. Sycamore leaves and bark littered the ground, damp from the rain.\n “Is this okay?” she asked.\n For answer, Lionel set down his end of the cooler and straightened, breathing in the forest smell. “This is okay.”\n “I have to move the bus. Stay behind this building in case anyone comes by. I’ll be back.”\n The gatekeeper waved as she pulled the bus out onto the street. By the time she had parked it on a nearby residential street and returned, the gate was closed. She walked around the cemetery perimeter to an unfrequented side, then scrambled up the wall and over the spiked fence.\n Inside, the traffic noise of the city fell away. The trees arched overhead in churchlike silence. Not a squirrel stirred. Avery sat down on a tombstone to wait. Beyond the hill, Lionel was holding vigil at the side of his dying companion, and she wanted to give him privacy. The stillness felt good, but unfamiliar. Her life was made of motion. She had been driving for twenty years—driving away, driving beyond, always a new destination. Never back.\n The daylight would soon be gone. She needed to do the other thing she had come here for. Raising the hood of her raincoat, she headed downhill, the grass caressing her sneakers wetly. It was years since she had visited the grave of her daughter Gabrielle, whose short life and death were like a chasm dividing her life into before and after. They had called it crib death then—an unexplained, random, purposeless death. “Nothing you could have done,” the doctor had said, thinking that was more comforting than knowing that the universe just didn’t give a damn.\n Gabrielle’s grave lay in a grove of cedar trees—the plot a gift from a sympathetic patron at the café where Avery had worked. At first she had thought of turning it down because the little grave would be overshadowed by more ostentatious death; but the suburban cemeteries had looked so industrial, monuments stamped out by machine. She had come to love the age and seclusion of this spot. At first, she had visited over and over.\n As she approached in the fading light, she saw that something was lying on the headstone. When she came close she saw that some stranger had placed on the grave a little terra cotta angel with one wing broken. Avery stood staring at the bedraggled figurine, now soaked with rain, a gift to her daughter from someone she didn’t even know. Then, a sudden, unexpected wave of grief doubled her over. It had been twenty years since she had touched her daughter, but the memory was still vivid and tactile. She remembered the smell, the softness of her skin, the utter trust in her eyes. She felt again the aching hole of her absence.\n Avery sank to her knees in the wet grass, sobbing for the child she hadn’t been able to protect, for the sympathy of the nameless stranger, even for the helpless, mutilated angel who would never fly.\n There was a sound behind her, and she looked up. Lionel stood there watching her, rain running down his face—no, it was tears. He wiped his eyes, then looked at his hands. “I don’t know why I feel like this,” he said.\n Poor, muddled man. She got up and hugged him for knowing exactly how she felt. They stood there for a moment, two people trapped in their own brains, and the only crack in the wall was empathy.\n “Is he gone?” she asked softly.\n He shook his head. “Not yet. I left him alone in case it was me . . . interfering. Then I saw you and followed.”\n “This is my daughter’s grave,” Avery said. “I didn’t know I still miss her so much.”\n She took his hand and started back up the hill. They said nothing, but didn’t let go of each other till they got to the marble mausoleum where they had left Mr. Burbage.\n The alien was still there, resting on the ground next to the cooler. Lionel knelt beside him and held out a hand. A bouquet of tentacles reached out and grasped it, then withdrew. Lionel came over to where Avery stood watching. “I’m going to stay with him. You don’t have to.”\n “I’d like to,” she said, “if it’s okay with you.”\n He ducked his head furtively.\n So they settled down to keep a strange death watch. Avery shared some chemical hand-warmers she had brought from the bus. When those ran out and night deepened, she managed to find some dry wood at the bottom of a groundskeeper’s brush pile to start a campfire. She sat poking the fire with a stick, feeling drained of tears, worn down as an old tire.\n “Does he know he’s dying?” she asked.\n Lionel nodded. “I know, and so he knows.” A little bitterly, he added, “That’s what consciousness does for you.”\n “So normally he wouldn’t know?”\n He shook his head. “Or care. It’s just part of their life cycle. There’s no death if there’s no self to be aware of it.”\n “No life either,” Avery said.\n Lionel just sat breaking twigs and tossing them on the fire. “I keep wondering if it was worth it. If consciousness is good enough to die for.”\n She tried to imagine being free of her self—of the regrets of the past and fear of the future. If this were a Star Trek episode, she thought, this would be when Captain Kirk would deliver a speech in defense of being human, despite all the drawbacks. She didn’t feel that way.\n “You’re right,” she said. “Consciousness kind of sucks.”\n The sky was beginning to glow with dawn when at last they saw a change in the alien. The brainlike mass started to shrink and a liquid pool spread out from under it, as if it were dissolving. There was no sound. At the end, its body deflated like a falling soufflé, leaving nothing but a slight crust on the leaves and a damp patch on the ground.\n They sat for a long time in silence. It was light when Lionel got up and brushed off his pants, his face set and grim. “Well, that’s that,” he said.\n Avery felt reluctant to leave. “His cells are in the soil?” she said.\n “Yes, they’ll live underground for a while, spreading and multiplying. They’ll go through some blooming and sporing cycles. If any dogs or children come along at that stage, the spores will establish a colony in their brains. It’s how they invade.”\n His voice was perfectly indifferent. Avery stared at him. “You might have mentioned that.”\n He shrugged.\n An inspiration struck her. She seized up a stick and started digging in the damp patch of ground, scooping up soil in her hands and putting it into the cooler.\n “What are you doing?” Lionel said. “You can’t stop him, it’s too late.”\n “I’m not trying to,” Avery said. “I want some cells to transplant. I’m going to grow an alien of my own.”\n “That’s the stupidest—ˮ\n A moment later he was on his knees beside her, digging and scooping up dirt. They got enough to half-fill the cooler, then covered it with leaves to keep it damp.\n “Wait here,” she told him. “I’ll bring the bus to pick you up. The gates open in an hour. Don’t let anyone see you.”\n When she got back to the street where she had left the bus, Henry was waiting in a parked car. He got out and opened the passenger door for her, but she didn’t get inside. “I’ve got to get back,” she said, inclining her head toward the bus. “They’re waiting for me.”\n “Do you mind telling me what’s going on?”\n “I just needed a break. I had to get away.”\n “In a cemetery? All night?”\n “It’s personal.”\n “Is there something I should know?”\n “We’re heading back home today.”\n He waited, but she said no more. There was no use telling him; he couldn’t do anything about it. The invasion was already underway.\n He let her return to the bus, and she drove it to a gas station to fuel up while waiting for the cemetery to open. At the stroke of 8:30 she pulled the bus through the gate, waving at the puzzled gatekeeper.\n Between them, she and Lionel carried the cooler into the bus, leaving behind only the remains of a campfire and a slightly disturbed spot of soil. Then she headed straight for the freeway.\n They stopped for a fast-food breakfast in southern Illinois. Avery kept driving as she ate her egg muffin and coffee. Soon Lionel came to sit shotgun beside her, carrying a plastic container full of soil.\n “Is that mine?” she asked.\n “No, this one’s mine. You can have the rest.”\n “Thanks.”\n “It won’t be him,” Lionel said, looking at the soil cradled on his lap.\n “No. But it’ll be yours. Yours to raise and teach.”\n As hers would be.\n “I thought you would have some kind of tribal loyalty to prevent them invading,” Lionel said.\n Avery thought about it a moment, then said, “We’re not defenseless, you know. We’ve got something they want. The gift of self, of mortality. God, I feel like the snake in the garden. But my alien will love me for it.” She could see the cooler in the rear view mirror, sitting on the floor in the kitchen. Already she felt fond of the person it would become. Gestating inside. “It gives a new meaning to alien abduction, doesn’t it?” she said.\n He didn’t get the joke. “You aren’t afraid to become . . . something like me?”\n She looked over at him. “No one can be like you, Lionel.”\n Even after all this time together, he still didn’t know how to react when she said things like that.\n Carolyn Ives Gilman is currently celebrating her decision to quit her job in order to write more science fiction. She has written two novels and five stories in the loosely connected Twenty Planets universe. Her books include Dark Orbit, a space exploration adventure; Isles of the Forsaken and Ison of the Isles, a two-book fantasy about culture clash and revolution; and Halfway Human, a novel about gender and oppression. Her short fiction has appeared in Clarkesworld, Fantasy and Science Fiction, The Year's Best Science Fiction, Lightspeed, Interzone, Universe, Full Spectrum, Realms of Fantasy, and others. She has been nominated for the Nebula Award three times and for the Hugo twice.\n Gilman lives in Washington, D.C., and works as a freelance writer and museum consultant. She is also author of several nonfiction books about North American frontier and Native history."}