{"fingerprint": "/6wwXCKld7x8aiwwTeiGscyqFf4=", "sitename": "Clarkesworld Magazine", "title": "Staying Loose: A Conversation with Max Gladstone by Arley Sorg", "author": "Arley Sorg", "date": "2022-02-00", "source": "https://clarkesworldmagazine.com/gladstone_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Staying Loose: A Conversation with Max Gladstone by Arley Sorg", "categories": "Interview", "tags": null, "id": 3004850, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nStaying Loose: A Conversation with Max Gladstone\nMax Gladstone was born in Concord, MA and grew up in Ohio and Tennessee. He studied Chinese Literature at Yale, then lived in China as a Yale Fellow, teaching for two years in the rural Anhui province. When he returned to the US in 2008, the economic crisis and its impact on people was an important inspiration for his debut novel, Three Parts Dead.\nGladstone was a writer before he knew what writers were. As a child who could barely hold a pencil, he wrote his first story about a pirate. As a kid, he read a retelling of Journey to the West, which he’d found on his parents’ bookshelf. He grew up with genre influences such as Star Trek and was given more genre books to read by his uncle, who noted which titles had won important awards. At age ten, he was reading Isaac Asimov, Roger Zelazny, and more. In high school and inspired by role-playing games, he drafted a book that clocked in at roughly two hundred and sixty thousand words.\nGladstone’s affection for Journey to the West led him to Chinese martial arts and philosophy, as well as the Chinese language. He began studying international relations and diplomacy, and when he graduated from college, he took a fellowship that would bring him to China. Along with important personal development, living in Xiuning provided him with time to write. He wrote three novels in two years. The experience was transformative.\nThe Craft Sequence began with Three Parts Dead in 2012, Two Serpents Rise in 2013, and Full Fathom Five in 2014, all published by Tor. Layered and innovative, they discuss a host of heavy topics, such as colonialism, democracy, government, and corruption, through a fantasy world of law and business drama—but with magic. The series immediately garnered attention, putting Gladstone on awards radars. Accolades included a Mythopoeic nomination, a Lambda nomination, being a Locus Award finalist, and a finalist for the Astounding Award for best new writer two years in a row.\nSince then, Gladstone has put out a few more books in the Craft Sequence. He’s created serial collaborative fictions Bookburners (2015–2018) and The Witch Who Came in from the Cold (2017, cocreated with Lindsay Smith) for Serial Box, and he created interactive projects Choice of the Deathless and Deathless: The City’s Thirst. In 2019, Tor published novel Empress of Forever, which was a Locus Award finalist; and Simon & Schuster imprint Saga published novella This Is How You Lose the Time War, cowritten with Amal El-Mohtar, which swept up a host of awards nominations, and won Aurora, BSFA, Locus, Nebula, and Hugo awards.\nNovel Last Exit, “a dark, contemporary fantasy of the open road, alternate realities, and self-discovery,” is due from Tor March 8th, 2022.\nI read in a prior interview that you read a lot of genre fiction when you were younger. Are there stories or writers you loved, whose influence you see in Last Exit?\nWhen I was very young, I used to go to sleep listening to a book on tape of Ginsberg reading The Dharma Bums, and some of what’s here, the treatment of names and the mythology of friendships and the matter-of-fact recounting of former adventures as if, of course you know, of course you were there, comes out of that voice; then there’s The Stand, of course.\nAnd I couldn’t go without mentioning Roger Zelazny. The concept of alternate universes and hellriding from Amber were rich veins of reference, and of course his Roadmarks is a multiversal (multi-time?) treatment of highway driving in its own right. I didn’t read Donna Tartt’s Secret History until much later, or It, but I think they were both relevant, as points of departure if nothing else.\nHow did the story for Last Exit come about—what was the inspiration, how did it develop, and did the final book end up being different in significant ways from the initial idea(s)?\nI don’t always know why an idea excites me when it does. The seed for the novel that became the novel that became Last Exit was a long, Bob Seger-ish look out the window at the highway while traveling alone for a book tour.\nI started thinking about the scope of the United States, about how little of it we see, about the ghosts and uncertainties and strangeness that await when we step off the road, about how many aspects of our modern life offer us tricks and cover, to let us avoid thinking about those ghosts, those uncertainties, that strangeness. I thought it was a book about working magic of some sort by driving along the highways, but it was really a book about loneliness, and terror, and history, and about control. Which meant it was also a book about friendship, and love, and redemption, and freedom. Which meant . . .\nOne of my favorite lines from John Crowley’s Little, Big is, “The further in you go, the bigger it gets.” Writing a book always feels like that for me. The crack through which you crawl into this other world does not define the limits of that world. Those are marked out by things you might not know, going in: history, psychology, your own courage and ability. How far you’re willing to explore.\nYou were at one point, arguably, best known for your Craft Sequence. For folks who read and loved those books, coming into Last Exit, what are the things that will ring familiar, and what are the things that will stand out as being very different?\nI like writing about smart and competent people whose smarts and competence, alone, aren’t enough to save them. I like writing about the contradictions of being alive and morally aware in the world. That’s pretty true to my experience of life and that’s been a part of every book I’ve written. Compared with the Craft Sequence, I think Last Exit is a bit darker. Magic can do less; the world is less forgiving in that way. Last Exit is also set very close to our world—many of the places are real, even if evoked fictionally or revised a bit for effect. People carry more recognizable damage. Also, in the Craft Sequence there aren’t any cars, so I couldn’t have someone hanging out the side window of a Dodge Challenger having a spear fight with a Mad Max wannabe wasteland cultist.\nIn Last Exit, part of Zelda’s internal conflict is the idea that doing what’s right also causes people to suffer. It’s a very different, more complex approach from the outright heroic type of quest. What do you like most about this type of story, and why does it speak so powerfully to readers?\nI hope it does speak powerfully to them! For me, Zelda’s feelings about suffering are part of her own psychology. She sees all the angles, and she doubts herself, and her choices. Sometimes this can be a great strength. Sometimes it weighs on you.\nThere is also this juxtaposition of personalities and experiences with Zelda and June, kind of the scarred veteran and the insistent newcomer. What makes this pairing as wonderful as it is?\nThank you for the implied compliment! I think it’s one of the classic tensions. It’s tempting to call it experience vs. innocence, but I think that papers over the important difference between Zelda and June as regards the nature of their varied experiences of the world.\nI wrote this book fascinated by these people who went out to change the world, and maybe it didn’t work out the way they hoped. They remember how it felt to be young, but they’re not young anymore, and they’re maybe feeling that change. June’s young—and she sees these people more for who they are now, than for who they used to be.\nAs soon as she showed up on page, that tension felt alive and important to explore. Sometimes the scarred oldster knows what’s what, and sometimes she’s too set in her thinking to see what’s really going on. Sometimes the new kid has the bright and brilliant idea, and sometimes she’s going to get herself hurt. That’s parenting, that’s teaching, that’s living in the world.\nDebut novel Three Parts Dead came out in 2012. A decade later, you’ve published a lot more words, including This Is How You Lose the Time War with Amal El-Mohtar and your 2019 novel Empress of Forever. What are the biggest, most important changes in your writing—craft, process, or anything else?\nWhen I started Three Parts Dead, my approach was to go right in, guns blazing, and write until I had a general sense of the world and characters, and the suggestion of a plot, then figure out how it was all connected. Since then, I’ve done all sorts of work in all sorts of ways. I’ve outlined extensively in a half-dozen styles and settings, at varying densities. I’ve written submission drafts that were very close to the final book. I’ve written submission drafts that had to be taken apart and wired back together. Last Exit I wrote entirely by hand. If I’ve learned anything, it’s stay loose. Listen to the project and listen to your own heart. Even if sometimes you don’t understand what it’s trying to say.\nGoing back for a moment to This Is How You Lose the Time War. Did working on that project change anything about the way you write, or the way you look at narrative or story?\nAmal’s a tremendous writer, and so much of the fun of writing Time War was to try on different voices, to experiment with following one another’s writing styles. We kept trying to push the envelope. It’s hard to say specifically what I took away because there was so much. A renewed enthusiasm for the writing project in general? On a craft level I’d have to get very technical, about things for which I’m not even sure technical vocabulary exists. Rhythms of detail? Descriptive transference? Just letting characters hurt more.\nWhat was the most difficult or challenging aspect of writing Last Exit?\nWriting while taking care of a small child. Revising and rewriting extensively while taking care of a small child, in the middle of a global pandemic. All other difficulties descend from those two.\nWhat else are you working on, what do you have coming up for new readers and fans?\nOh man, there’s a lot. I wish I could talk about more of it, but I don’t want to jinx anything. Watch the skies!\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}