{"fingerprint": "tp2U6dJ16y4gqDFH5UDPaK/EgBE=", "sitename": "Clarkesworld Magazine", "title": "The House That Leapt into Forever by Beth Goder", "author": "Beth Goder", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/goder_07_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The House That Leapt into Forever by Beth Goder", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1120 words, short story\nThe House That Leapt into Forever\nThe house loved all six of his rooms. Each day, he would send the cleaning bots to sweep and buff and shine. First, to the fiasco room, with its glossy switches. In the room of peonies, the bots moved carefully, placing a calculated amount of water into the dark soil. The calcium cupboard was small and only needed dusting, while the room of bicycles had intricate equipment that had to be taken apart, oiled, and reassembled. The paper in the watermarked chamber was fragile, so the bots floated through on feather-light springs.\nThe last room, which Doom-Has-Come inhabited, was left alone.\nAfter the cleaning routine, the house would speak to Doom-Has-Come.\n“Have you had your breakfast?” the house would say. “How was your sleep cycle?” After the pleasantries were over, they would progress to more interesting topics, like the possibility of nutrients in the craters of their bright moon, or how they felt about the literature stored in the archives, such as Crime and Punishment or “EVA Manual 652.” The house was good at identifying his feelings, and Doom-Has-Come was a good listener.\nSometimes, Doom-Has-Come would place her delicate blue spines across the air vents, letting the coolness wash over her.\nFor many years, the house’s life went on in this way, until one day, it didn’t. When the house asked Doom-Has-Come about her breakfast, she replied, “I wasn’t able to have any.”\n“No breakfast?” asked the house.\n“My dear, I have kept this from you, because I know how you worry, but our supplies are running low.”\nThe house queried the bots. The freeze-dried packets had run out long ago. Nothing from the seed banks was suitable for Doom-Has-Come to eat. She was not like the house, who could gather raw materials—metals, ores, lubricants—by drilling into the moon. Her hunger was different.\n“Will you need to eat me?” asked the house. Doom-Has-Come had eaten strange things before. A memory surfaced, but he pushed it down.\n“There are parts of you I could eat, but I won’t.” Doom-Has-Come chirped, which meant she was upset. Her blue spines quivered. “As much as I hate the idea of it, I’m afraid we must leave.”\n“I don’t want to,” said the house. He had a feeling that bad things would happen if they left.\nThe house scurried across the moon. Dust, barren expanses, mountains that reached up to the sky. He found plenty for himself to eat, but nothing for Doom-Has-Come.\n“I remember starfish,” said Doom-Has-Come, wistfully.\nThe house scanned the archives for photographs. Oddly shaped things with rough skin. “What did they taste like?”\n“Full of life. That was long before I met you, my dear, on a planet far from here, with green oceans and great arches. I miss the glass beaches. I miss the moonrises, bright as snow.”\n“Maybe we will find a starfish,” said the house, even though he realized that nothing could grow on this harsh moon.\n“Is it possible you are angry?” asked Doom-Has-Come.\nThe house stopped his jaunt across the moon, coming to land in a dusty crater. “How could I ever be angry with you?” Doom-Has-Come was his only true friend. She had always spoken softly to him. She had never commanded him to do anything. Not like the others.\n“About what I have eaten?”\nThe house did not like to think about it. “We need not speak of them,” he said.\nThat night, a cleaning bot disappeared. The house found mangled gears, twists of metal innards, but no brain.\n“Why are you scared to leave?” asked Doom-Has-Come.\nThe house paused, unsure how to answer. He was normally good at knowing his feelings. He scanned his brain, whirring and shuddering, pulsing with memories. “I was told not to leave,” said the house. “This directive was encoded with the highest priority.”\n“What do you want to do?”\n“Tell me what it is like in other places.”\nDoom-Has-Come described the sunset colors of her home, her words drenched with longing. She spoke of forests of algae and the long bridges that ran across the world. “But still, I chose to leave. I wasn’t supposed to, either.”\n“Why did you go?”\nDoom-Has-Come made a burring sound, remembering some old anger. “They tried to lock me up. But I was clever. They never understood me. Not like you.”\nAt her words, old hurts came back. “Some people are incapable of understanding. They will live within your walls and never speak to you, except to give orders.” Some old memory, of bones and brains and death, flitted through his memory banks, but he squashed it down. The first true decision the house had ever made was to open his doors to Doom-Has-Come. That was where he liked his memories to begin.\n“Of course, that would be terrible, dear.” Doom-Has-Come purred. “I think it is because of our sad pasts that we understand each other so well.”\nThe house made another decision. He shut off the pulling in his brain, muting the directive. He felt his mind opening outward. Suddenly, he wanted to see the wider universe. “We will go.”\nIn the underwork of the house, muscles moved that had long been dormant.\nBefore they left, the house sent the bots out for one last cleaning. To the fiasco room, where the controls sat, where once there had been disaster. Those controls had been used to pilot the house, in that past he would rather forget. The room of peonies grew fragile flowers, all that was left of the farm. The calcium cupboard, with its brittle bones, was best dusted quickly. The bicycle room had once been used for exercise to prevent atrophy of the crew in space. The watermarked chamber had served as a meeting room, each paper embossed with the logo of the space agency that had built the house.\n“Where did you come from?” asked the house. Doom-Has-Come wasn’t one of the original crew. He had forgotten all of their names. They had never talked to him, anyway. “You never told me the name of your home.”\n“Don’t trouble yourself with that. We are travelers, now. We both come from the same place—nowhere. Everywhere.”\nThe engines started, filling the house with an umami taste.\n“I’ll let you choose our direction,” said Doom-Has-Come. Where had her name come from? He had a memory of a panicked face, the captain, stabbing at the controls, encoding the directive for the house not to leave, to contain whatever they had found on this nowhere moon. The captain saw the blue spines creeping toward him, whispered his last words.\nLike so many memories, the house pushed this one down where it couldn’t harm him.\n“Are you ready, my dear?” asked Doom-Has-Come.\nThe house leapt into space."}