{"fingerprint": "wAxNwJ+6ABtqxgG2CuS8fKwfmEc=", "sitename": "Clarkesworld Magazine", "title": "Building Forests, Remaking Planets by Sarah Goslee", "author": "Sarah Goslee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/goslee_06_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Building Forests, Remaking Planets by Sarah Goslee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Building Forests, Remaking Planets\n Last September the popular science news was full of stories about Ascension Island1. This small volcanic island in the middle of the South Atlantic was nearly barren when Charles Darwin described it in 1836, supporting only 25 or 30 species of small plants, a flightless bird, and a land crab. But today the mountain is covered by a thriving and diverse cloud forest. What happened? Joseph Hooker happened2. The English botanist was asked by the Royal Navy to improve the island by increasing soil and water availability so that it could better serve as a stopping point mid-ocean3. Hooker suggested planting trees on the mountain to improve water cycling, and planting other species on the steep slopes to hold soil, much as we do now on steep embankments.\n For the next few years, regular shipments of plants came to the island, whatever the botanical gardens thought might be appropriate (or had extra of, perhaps). They were planted and tended, and at least some of them thrived, creating the lush forest found today. In the popular press, this remarkable unplanned experiment was billed as offering insights into how we might someday terraform Mars, making it habitable for terrestrial life, and especially for humans. The greening of Ascension is an artificially-enhanced example of primary succession, a speedy version of the process by which newly formed land becomes a thriving ecosystem. Does this example tell us anything that can be used to guide the greening of a whole new planet?\n Primary succession is a fascinating process, but usually very slow. New land, devoid of life, is created by volcanic activity or uncovered after thousands of years of glacial ice. First microbes colonize the ground, beginning to establish nutrient cycling and to turn rock fragments into soil that can someday support plants. Pioneer species such as lichens, tolerant of extreme conditions, aid in creating soil. This new soil holds water and nutrients, allowing hardy plants to move in. Small animals follow, often insects and spiders, and finally after centuries of development more specialized plants and animals become established. Each set of species makes it possible for the next to survive, and is replaced by those newcomers.\n Primary succession sounds orderly and well-regulated, but it is actually slow and messy, and highly dependent on which species arrive and in what order. When Hooker started trying to modify Ascension Island, it had already reached the pioneer species stage, with basic nutrient and water cycling and soil development established (only a million years after it rose from the sea). Hooker sped up the next steps in the process by sending all sorts of plants that probably would never have reached the island unaided.\n Ascension Island, and any terrestrial primary succession, has a tremendous advantage over any terraforming project, Mars for example. Earth already has an oxygen atmosphere, a well-established global hydrological cycle and a favorable temperature range. Mars has none of those things. Instead, future planetary engineers will need to compensate for the initial conditions by careful planning, and by their knowledge of how primary succession works on sites like Ascension. Here, as in so many human endeavors, intelligence will help us overcome physical challenges.\n Is planetary engineering even possible: can living things change an entire planet, and can people do so? The answer to both parts of that question is unequivocally yes. Our oxygen atmosphere, necessary to support animal life, is a byproduct of photosynthesis, which causes plants to release oxygen. Global warming is a clear demonstration that humans can change the planet: here both atmospheric composition and the related global climate have been altered as a direct result of human activity. In both cases the changes were accidental, unexpected by the organisms causing them and even actively harmful to those organisms. If planned instead of haphazard, though, it should be possible to choose and direct the outcome of planetary engineering efforts.\n Terraforming a barren planet like Mars will require a combination of physical and biological engineering4. The physical engineering will modify the inhospitable environment, making it possible for Mars to support hardy pioneer species. Right now terrestrial organisms would find Mars an impossible environment. Once that is accomplished, a carefully-planned sequence of species can be introduced to further modify the environment into something more suitable for human use.\n The first challenge will be to raise the surface temperature so that liquid water can exist at least part of the time. The greenhouse effect currently worrying terrestrial climatologists would be beneficial on Mars. Releasing carbon dioxide from the Martian polar ice caps, or even releasing more effective custom-tailored greenhouse gases into the atmosphere, would create a positive feedback loop because heating the planet melts more carbon dioxide ice, increasing the concentration of greenhouse gases and warming the planet more.\n This engineering process creates an atmosphere high in carbon dioxide, not an ideal condition for human purposes. But once Mars can support terrestrial species, biological engineering comes into play. Seeding Mars with cyanobacteria (blue-green algae), lichens, and other cold-tolerant photosynthetic organisms will cause the development an oxygen-rich atmosphere, though it will be a very slow process. The growth and death of these organisms creates soil, simultaneously breaking rock fragments into smaller particles and enriching it with organic matter and nutrients. Mosses can eventually be added. They are not only more efficient at photosynthesis but also capable of storing carbon dioxide from the atmosphere as peat.\n Later, decades or centuries after the project is started, animals can be added to the mix. When the ecosystem can support insects, flowering plants can also be introduced; they would not thrive without pollinators. Arctic and alpine plants are already adapted to cold climates, making them perfect for this stage of terraforming. This is roughly where the Ascension Island project started: some soil, an oxygen atmosphere, a habitable climate. Pollinators and pest insects alike probably came along with the plants as hitchhikers, another advantage of being immersed in a biologically active world.\n One of the key questions seems fairly simple at first: how do you choose which species to put together to create and maintain a functioning ecosystem? The easiest approach is the Ascension tactic: plant a bunch of things and see what happens. Simply let the ones that can thrive do so, and the ones that can’t will become extinct. But as hard as it was to ship plants to the South Atlantic, it will be much harder to ship them to Mars. Is there a better way to choose what to introduce and in what order, to go from the messy and chaotic process of primary succession to something more orderly and efficient?\n Building a successful community requires juggling many dynamic and interrelated factors—atmosphere, soil, water, nutrients, plants, animals—all while keeping the system moving toward the ultimate goal of the terraforming project many centuries in the future. Any species a planetary engineer adds has to be able to survive in the current conditions, to coexist with the other plants and animals present, and to move the environment in the correct direction.\n Right now ecologists don’t know nearly enough even to build community types here on Earth where the environment is already hospitable, but community assembly and functional ecology are very active research topics. Scientists are very interested in understanding how ecosystems form without human manipulation, and in the functional role that each species performs within that ecosystem. Besides terraforming, this knowledge has many smaller-scale applications, including agriculture, conservation management, controlling invasive species, and planning for future climate changes.\n Combating climate change gives planetary engineers a chance to develop their skills here at home. Many different schemes have been proposed to terraform Earth itself, to undo the inadvertent atmospheric changes we’ve already caused. Fertilizing the ocean with iron to increase algae growth, thus storing carbon dioxide, and injecting sulfur particles into the upper atmosphere to reduce the amount of sunlight warming the Earth, have both been suggested5. Either of these strategies could be part of terraforming other planets.\n Humans can change the atmosphere, and the plants and animals found, on large scale, both at home on Earth and someday on other planets. But just because we can do these things it doesn’t necessarily make them a good idea. There’s concern that, if we try out planetary engineering solutions to anthropogenic climate change and other problems here on Earth, we’ll just make something else go wrong, maybe even destroy the planet. Scientists don’t understand everything about global cycles, so causing new problems while solving old ones is entirely possible. It’s unlikely that we’ll destroy the whole planet, though: an active biological system is hard to kill off, though we could easily make it uncomfortable for humans or other species. Just as rats and cockroaches are said to be able to survive after a nuclear disaster, something will always thrive.\n On another world, the initial lack of an active biosphere makes it hard to get things going. And there’s another question to grapple with when deciding whether to terraform other planets: is it ethical to make another planet into an Earthlike world? Bioethicists have thought deeply about that question, and have come up with a spectrum of possible answers6.\n On one end are the preservationists, who believe that all of nature, even a lifeless planet, is deserving of protection, and that terraforming or any other planetary modification is wrong. On the other end are the anthropocentrists, who recognize the evolutionary imperative to reproduce ourselves encoded in our genes. Spreading our species is the highest goal, and terraforming other planets is the only way to extend our habitat beyond Earth. Nature is only valuable in so far as it benefits humans.\n The zoocentrists and the ecocentrists fall in between. Both groups recognize the ethical importance of organisms other than humans. Zoocentrists recognize the intrinsic value of higher organisms, those animals capable of feeling pleasure and pain. Terraforming Mars poses no ethical problem for zoocentrists if it is lifeless or supports only microbial organisms. Ecocentrism assigns intrinsic value to every species: all have the right to live and reproduce, regardless of complexity or relationship with humans. Nonliving things are not included. A barren Mars could be terraformed, but not one that supports microbial life.\n When deciding whether terraforming Mars is justified there are three questions to consider7. Does this terraforming project improve the situation of humanity? Of all life? Of Mars itself? The first question is easy: spreading the human population and associated terrestrial organisms among more than one locale makes it far less likely that we’ll be wiped out by a sudden catastrophe. Following that logic, not establishing outposts on other planets is the immoral choice. Given that the only life proven to exist is right here on Earth, the answer to the second question is also “yes,” until and unless extraterrestrial life is found.\n The third question is the key: is a living planet better than a naturally-lifeless one? Who decides, and how? How hard should we hunt for microorganisms before beginning a terraforming project? Both the scientific and philosophical components of terraforming have been considered in detail in Kim Stanley Robinson’s award-winning Mars trilogy, Red Mars, Green Mars, and Blue Mars. Preservationists and those in favor of terraforming debate and act in a well-thought-out and thoroughly researched work of science fiction.\n Not just Mars, but also Venus, Jupiter’s moon Europa and Saturn’s moon Titan are considered good candidates for terraforming (see Paul McAuley’s The Quiet War and Gardens of the Sun, the science behind which Paul wrote about in Clarkesworld #36, for speculation about Europa, Titan and other outer system moons). Mars is the most Earthlike, and could be made habitable, if not for unprotected people then for plants. The artificial cloud forest on Ascension Island provides inspiration for scientists studying the development of ecosystems on barren land, but was too haphazard to offer much guidance for terraforming projects on other planets. Ecologists and planetary engineers are actively studying terraforming and similar areas. The more we learn about designing and managing ecosystems, with all their interrelated component parts, the more effectively we will be able to tend our current planet and remake others to bring them into the fold.\n Footnotes:\n 1. Many such stories are available online. One particularly good one appeared in The Economist: Another Green World 2010 http://www.economist.com/node/17722704\n 2. Morse, Adrian. The Island as Laboratory: Ascension Island, Joseph Hooker, and Imperial Botany. http://www.adrianmorse.com/ascension.pdf\n 3. Wilkinson, David M. 2004. The parable of Green Mountain: Ascension Island, ecosystem construction and ecological fitting David M. Wilkinson Journal of Biogeography 31: 1-4. http://www.livjm.ac.uk/BIE/greenmt.pdf\n 4. Graham, James M. 2004. The Biological Terraforming of Mars: Planetary Ecosynthesis as Ecological Succession on a Global Scale. Astrobiology. 4: 168-195. http://www.liebertonline.com/doi/abs/10.1089/153110704323175133\n 5. Keith, David W. 2000. Geoengineering the Climate: History and Prospect. Annual Review of Energy and the Environment 25: 245-284. http://www.annualreviews.org/doi/abs/10.1146/annurev.energy.25.1.245\n 6. Fogg, Martyn J. 1999. The ethical dimensions of space settlement. IAA-99-IAA.7.1.07 http://www.users.globalnet.co.uk/~mfogg/EthicsDTP.pdf\n 7. Fogg, Martyn J. 1999. The ethical dimensions of space settlement. IAA-99-IAA.7.1.07 http://www.users.globalnet.co.uk/~mfogg/EthicsDTP.pdf\n Sarah Goslee is an ecologist working on agricultural issues at a government lab in Pennsylvania and a regular contributor to the Crossed Genres Science in My Fiction series. She likes to figurethings out and tell people about them, and writes regularly on adiverse array of topics including fiber arts, medieval science, andViking culture."}