{"fingerprint": "uhh6hPz3/9CrV+7rcJROQ1aR2zw=", "sitename": "Clarkesworld Magazine", "title": "Writing My Mother's Ghosts by Theodora Goss", "author": "Theodora Goss", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/goss_08a_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Writing My Mother's Ghosts by Theodora Goss", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Writing My Mother's Ghosts\n This essay was presented as part of a panel called \"Reeling Beyond Realism: But to Reel in What?\" proposed by Rusty Morrison and Ken Keegan of Omnidawn Publishing for the 2008 Association of Writers and Writing Programs conference in New York City. I’m grateful to Rusty and Ken for proposing such a fantastic panel, and for inviting me to participate.\n When Rusty and Ken asked me to be on this panel, for some reason I thought of a story I had written several years ago called “Her Mother’s Ghosts.” It begins,\n \n Her name is Ilona. The other children at school call her Smellona.\n \n The other children at school call her Smellona because the children at my school called me Snora. I spoke with an accent and wore hand-me-down clothes, which in elementary school are very good reasons for calling someone Snora. Ilona is a version of me. I even gave her my grandmother’s name. Before I tell you more about Ilona, I should tell you that I was born in Hungary in 1968. It is obvious, in my story, that Ilona was as well. I thought this presentation, short as it is, should have the dignity of a title, so I’m calling it “Writing My Mother’s Ghosts.”\n This is my favorite part of the story:\n \n In the kitchen drawer are silver spoons, smuggled in socks, the sleeves of pajamas. They are heavy, dulled with use. They are older than her mother, her grandmother. One is much worse for having slipped into the garbage disposal. In the kitchen cabinet are margarine tubs, more than ten, perhaps more than twenty, washed clean, ready in case the world runs out of margarine tubs. Don’t laugh. It could happen.\n \n So far, I’m being a stark realist. My mother really did collect margarine tubs. Sometimes I thought they were going to take over the house. (There, you see, as soon as I begin to exaggerate, realism slips and the story turns fantastical, as in my vision of an apocalypse without margarine tubs.) But the next paragraph begins,\n \n Since Ilona turned seven, she has been haunted by her mother’s ghosts.\n \n And there I am, writing fantasy. Her mother’s ghosts are party officials, who threaten and cajole her. Ilona’s father appears briefly, identifiable as a party official by the red star on his cap. (I made that up. I have no idea what sorts of uniforms party officials wore in Hungary at that time, or even if they wore uniforms. Sometimes it is when I seem most realistic that I’m fantasizing.)\n Several years ago, soon after I set up a website, because I had been told that all writers needed websites, someone wrote to me. I think he was in the writing program at Boston University, where I teach. It is a prestigious writing program. But I don’t think it has much regard for the fantastical in literature. He said that he had read my biography.\n The biography on my website begins with a description of growing up in Hungary, of living in an apartment building in Budapest that had probably once been the residence of an aristocratic family, but was now divided into small flats. (I think our apartment had once been a double parlor, because its two rooms are still connected by a large door with panes of glass.) We would fetch coal from the cellar to heat water. In the bathroom, there was an alcove where my mother and her sister could have hidden if, in 1956, the Russians had come into our apartment. That was good writing, he told me. Good enough for a prestigious literary magazine. But why, after describing how we left Hungary, with two suitcases and the equivalent of twenty-five dollars, did I talk about disappearing into books, and specifically fantasy books? I came to the United States and disappeared into Narnia and Middle Earth and Earthsea. I exchanged real for imaginary geography. Why? he asked me. He was not asking me why, as a child, I had escaped to imaginary countries, but why, as an adult, I remained there. Why I wrote fantasy when I could, evidently, write realism.\n There, you see, I have used the dreaded word “escape.” I was an escapist. That was what, finally although implicitly, he was accusing me of. For a long time I felt vaguely ashamed of being an escapist. But recently I have decided to reclaim the word. I am not, after all, ashamed of being a feminist, which is also one of those words ending in —ist that has acquired, I’m not sure why, a negative connotation. But, you might say, an escapist is more passive than a feminist. A feminist chains herself to the White House gates. An escapist allows herself to be taken somewhere else, where political engagement is not necessary. That is certainly part of our definition of an escapist, but in reclaiming the word I want to redefine it. Think of how we define a capitalist, or a communist. One actively accumulates capital and attempts to create a world in which the accumulation of capital is possible; the other actively agitates for the collective ownership of capital. Both attempt to change the world. Think of a bicyclist. She bicycles, joins bicycling clubs, agitates for paths. Why, then, should an escapist be passive? I have decided that I am an active escapist, an advocate of escape. Remember that I was born in a country that one could not leave, that one could only escape from. Escaping was, in a sense, the first important act of my life.\n Of course I didn’t think of all this back then, when I had someone to answer. I don’t remember what I wrote to him, but it was something vague and unsatisfying. I had not realized, then, that escape is my ideology. I believe that imaginative escape allows us to look back at the country we came from, whether it is a geographical country or the country of literary realism, and do what exiles have always done: offer a critique. That’s what I did in my story about Ilona, in which I say,\n \n There is something I have forgotten to tell you. When she was twelve and still living in Washington D.C., day after day for a period of three months she saw tanks driving down the streets. On her way to school, on her way to the dentist. During these months, she could not sleep. She threw up everything but a slice of birthday cake at a party for a girl from school. She lost weight and developed dark circles under her eyes. Her mother took her to the doctor. She began to believe she was turning into a ghost.\n \n Once, when my aunt was telling me about being in a car accident, she said, “I was so scared, almost as scared as I was in 1956.” In my family, everything, finally, goes back to tanks rolling down the street. My brother and I grew up haunted by the ghosts of tanks rolling down the streets of Washington D.C.\n My mother had rejected communist ideology but had left it only imperfectly behind, in the way you reject, but never entirely leave behind, what you learned as a child. So communists and capitalists were both fantastical creatures. They might as well have had horns coming out of their heads, and tails. One would come in the night to take you away to prison, the other would corrupt your soul. Perhaps one reason I write fantasy is that I grew up in a fantastical reality. But didn’t we all? What fantasy allows us to escape from is, in part, the illusion that the world we live in is entirely real, when there are significant parts of it that are really make-believe. We are surrounded by unreality: parts of our political system, the stock market, the fashion industry. There are even people, like Princess Diana, who are partly make-believe.\n I think what I’ve said, among the tanks and margarine tubs, is something like this. That I write fantasy because the reality I see around me is fantastical, so that fantasy becomes a new realism, representing our reality, the reality of the twenty-first century, more accurately than the old realism, which was formed in the nineteenth. That fantasy is important because it offers escape, which allows us to leave our countries, the countries where we are citizens and understand the language, to become at least temporary exiles. As exiles, we can look back at the countries we have left, to see them again more clearly. Literary realism is one of those countries. Escapist ideology allows me to see that realism is also an ideology, one that can obscure reality as much as it can illuminate it. It can also turn into escapism, the passive kind that allows us to evade reality without looking at it closely, without reflecting and critiquing.\n “Her Mother’s Ghosts” ends by acknowledging that I am an escapist, that my story is fantasy, that the story I am telling is not my story:\n \n When Ilona was seventeen, her mother died of breast cancer. After that, she never saw ghosts. Her brother grew up to be a famous entomologist. He is now a professor at Harvard. She grew up to be a writer, but not of stories. She writes about art, and sometimes architecture. She would never write this story, so I am writing it for her.\n My mother did not die. Last year, she finished law school. My brother, a computer programmer, went to her graduation. They live by the ocean in California, where it is always sunny.\n I rarely see them. I am haunted by ghosts, invisible, impalpable: the ghosts of silver spoons and margarine tubs, the smell of paprikás cooking on Sunday afternoons. The ghost of a country.\n \n And there, although I am talking about ghosts, I am back to the starkest realism, because these are the things by which I really am haunted. But it is a different kind of realism, a truthfulness to psychological facts. That is what I mean, I think, when I talk about a new realism. All literature is a representation of reality, because we have nothing else. We have ourselves and the world around us, that is all. Fantasy represents that world, in a different way than literary realism, but it represents it nevertheless. It also, and this I have not said, allows us to imagine new possibilities that do not exist in our current reality. It is fantasy that allows us to imagine the world we want to create. Perhaps a world without tanks, which a realist might tell you is stark fantasy.\n Theodora Goss's publications include the short story collection In the Forest of Forgetting (2006); Interfictions (2007), a short story anthology coedited with Delia Sherman; Voices from Fairyland (2008), a poetry anthology with critical essays and a selection of her own poems; and The Thorn and the Blossom (2012), a novella in a two-sided accordion format. She has been a finalist for the Nebula, Crawford, Locus, and Mythopoeic Awards, and on the Tiptree Award Honor List. She has won the World Fantasy and Rhysling Awards."}