{"fingerprint": "oOSqrpkYp3dxKeQ7JRq5q8gL2gs=", "sitename": "Clarkesworld Magazine", "title": "Give the Family My Love by A. T. Greenblatt", "author": "A T Greenblatt", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/greenblatt_02_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Give the Family My Love by A. T. Greenblatt", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5320 words, short story\nGive the Family My Love\n2019 Nebula Award Winner for Best Short Story\n2020 Finalist: Theodore A. Sturgeon Memorial Award\n2020 Finalist: WSFA Small Press Award\nI’m beginning to regret my life choices, Saul. Also, hello from the edge of the galaxy.\nAlso, surprise! I know this isn’t what you had in mind when you said “Keep in touch, Hazel” but this planet doesn’t exactly invoke the muse of letter writing. The muse of extremely long voice messages however . . .\nSo. Want to know what’s this world’s like? Rocky, empty, and bleak in all directions, except one. The sky’s so stormy and green it looks like I’m trudging through the bottom of an algae-infested pond. I’ve got this 85-million-dollar suit between me and the outside, but I swear, I’m suffocating on the atmosphere. Also, I’m 900 meters away from where I need to be with no vehicle to get me there except my own two legs.\nSo here I am. Walking.\nSorry to do this to you, Saul, but if I don’t talk to someone—well, freak out at someone—I’m not going to make it to the Library. And like hell I’m going to send a message like this back to the boys on the program. You, at least, won’t think less of me for this. You know that emotional meltdowns are part of my process.\n850 meters. I should have listened to you, Saul.\nAnd yes, I know how cliché that sounds. I’ve been to enough dinner parties and heard enough dinner party stories, especially once people learned that I’m possibly the last astronaut ever. At least now I have an excellent excuse for turning down invitations. “I’d love to come, but I’m currently thirty-two and a half lightyears away from Earth. Give your family my love.”\nOf course, they won’t get the message until six months too late.\nWow, that’s depressing. See, this is why I told the people in R&D not to give me too many facts and figures, but they’re nerds, you know? They can’t help themselves. Despite best intentions, it sort of spills out of them sometimes.\nAnd it’s not like I can forget.\n750 meters.\nThe good news is I can actually see the Library. So if I died here 742 meters from the entrance, I can expire knowing I was the first human to set eyes on this massive infrastructure of information in person.\nOh god. I might actually die out here, Saul. Not that the thought hasn’t crossed my mind before, but the possibility becomes a lot more tangible when you’re walking across an inhospitable alien landscape.\nAlso, my fancy astronaut suit is making some worrying noises. I don’t think it’s supposed to sound like it’s wheezing.\n675 meters. God, Saul, I really hope this mission is worth it.\nHave I told about the Library, yet? No, I haven’t, have I? And I’ve only been talking about this, for what, years now? Well, you should know, it’s not what I expected. Which is stupid because alien structures are supposed to be alien and not castles or temples, like with steeples and everything. Shut up, Saul. (I know you’re laughing, or will be laughing at this six months from now.) I don’t regret reading all those fantasy sagas when we were kids. Only that I didn’t get to read more.\nBut you want to know what the Library looks like. Well, I’ve climbed mountains that feel like anthills next to this building. It sort of looks like a mountain too. An ugly misshapen mountain, full of weird windows and jutting walls. It’s shiny and smooth from some angles and gritty and dull from others. It gives me the shivers.\nWhich is not really surprising. This is an alien world with alien architecture full of all that alien and not so alien knowledge just waiting to be learned. More information than the starry-eyed Homo sapiens ever dreamed there was possible to know.\n500 meters.\nSaul, I’m getting concerned about my suit. My left arm isn’t bending at the elbow anymore. Not that I need my left arm to keep walking, but it’s a bit disquieting, in a panic-inducing sort of way. God, this was so much easier when all I had to do was rely on the Librarians’ technology to get me here. Now, I have to rely on humanity’s own questionable designs to get me this last kilometer. But that’s the Librarians’ rules for getting in. “You have to get your representative to our entrance safely through a most unforgiving landscape.” Turns out that outside of my very expensive outfit there’s an absurdly high atmospheric pressure, corrosive gases, wild temperature fluctuations between shady and light patches, et cetera, et cetera. Also, the ground is just rocky enough to surprise you.\nI don’t want to think about what’ll happen if I trip. Can’t think about it. I wasn’t a physics major before, and this is not the time to start.\n350 meters.\nI mean, I knew the dangers signing up. I knew this was going to be the hardest part of the trip. (I mean, how could it not be? The Librarians figured out how to travel lightyears in a matter of months. And that’s just for starters.) But I was the best candidate for the job and I had to do something, Saul. I know you think otherwise, but I haven’t given up on humanity. This isn’t running away.\nI wish I could run right now because now there seems to be a layer of fine dust coating the inside of my suit. Oh my god.\n250 meters.\nShut up, Saul. I can hear you telling me in that big brother voice of yours: “It’s okay if you freak out, Hazel, just not right now” like you did when we were kids. And you’re right, I can’t freak out, because the worst thing that could happen right now, aside from dying, is having an asthma attack from the dust. Okay, okay, okay. I just need to keep calm, keep focused, keep moving.\n175 meters.\nThere’s definitely something wrong with my suit. The coating of dust in my suit has gone from “minimal” to “dense” and I have no idea which piece of equipment I’m breathing in.\nDon’t panic, Hazel.\nDon’t panic, don’t panic, don’t panic.\nCan’t panic. I’m picturing the R&D nerds when I tell them about this. They’re going to completely melt down when they hear that their precious design didn’t hold up as well as planned. Good, retaliation hyperventilating. Because that’s what happens when your best candidate for the job is an asthmatic anthropologist.\n100 meters.\nOkay, I’m almost there. I can see the door. This faulty, pathetic excuse for a space suit only has to last me a few more minutes. I just need to keep walking. Soon I’ll be safely inside and reunited with my beautiful, beautiful inhaler.\n75 meters\nWell. Hopefully, they let me in.\nSo . . . here’s the thing Saul. The Librarians never actually gave us a guarantee that they would admit me. They said it was up to the Librarians who live in the Library. (Apparently, they are a different sect from the explorer Librarians that I met and traveled with and well, the two sects don’t always agree.) But the explorer faction gave me a ride here, so that’s got to count for something, right?\nThing is, this stupid suit was supposed to withstand a walk to the Library and back to the ship if I needed it. Looks like my safety net isn’t catching much now.\n25 meters.\nI’m sorry I didn’t tell you this before I left, but I’m not sorry either. The knowledge that I can potentially gain here is worth the risk. It’s worth every cent of that 85 million and if I’m going to die on the steps, well that sucks. But okay, at least we tried.\n10 meters.\nI’m not sorry, Saul. Just scared.\nHopefully the Librarians let me in, but if you don’t get another transmission from me, you know what happened. Give the rest of the family my love.\nOkay. Here we go.\nHave you ever been in love, Saul?\nYes, I know you love Huang. I’ve seen the way you look at her and she looks at you. But remember the moment when you looked at her like that for the first time and you thought, “Holy crap. This is it. I’ve finally found it.”\nYeah. The Library, Saul, is magnificent.\nAnd . . . difficult to describe. It’s sort of like the outside of the Library. It changes depending on what angle you look at it from.\nWhen I left the decontamination chamber (at least, I think that’s what it was?), I stepped into the main room and everything was dimly lit and quiet. The Library’s Librarians—which I later learned preferred to be called the Archivists because they are not the Librarians who travel the universe—were milling around the massive room. They looked similar to the explorer Librarians we met on Earth; tall, lanky, humanoid-like bodies. But they all had long, shimmering whiskers that the explorer Librarians didn’t (couldn’t?) grow out. Their whiskers went all the way down to their splayed, ten fingered feet.\nThe room was surprisingly empty except for these installations in the middle of the room that could either have been art or furniture. So you know, sort of like university libraries back home.\nI was just starting to breathe easier, my inhaler finally kicking in after that walk from hell, when the light changed and suddenly I was standing next to this fern/skyscraper thing that smelled weirdly like hops and was a violent shade of purple. It became ridiculously humid and the room was filled with what I can only assume were plants. Even the Librarians—I mean, Archivists—changed. Now, they had four legs and two arms and were covered in this lush white hair.\nI reached out and touched one of the ferns next to me and it was like touching a prickly soap bubble, which was not what I was expecting. But then again, I wasn’t expecting it to reach out and tap me back on the forehead either.\nI think I swore. I’m not sure because everything changed again. Suddenly, I was shivering and standing on something like a frozen ocean that’s trapped an aurora in the floe. The air was nosebleed dry and smelled like rust and I could see pale things moving underneath the ice. The Archivists themselves had become round and translucent, floating a meter in the air.\nAnd the room kept changing. It was terrifying . . . and completely amazing, Saul.\nSo there I was, gaping like an idiot, simultaneously too afraid to move and too busy trying to take all of it in. In my slack-jawed stupidity, it took me far too long to notice that two things didn’t change. First, the Archivists always kept their rubbery fluidity and their whiskers. And those little lights never moved.\nCrap, I’m not describing this well. I forgot to mention the lights. There were thousands of them, like miniature stars, scattered seemingly at random around the room, drifting, hanging out in midair. I think they were what made everything change, because when an Archivist would go up and touch one with their long whiskers, bam! new setting.\nSo get this: When I finally mustered up a little courage and asked a passing Archivist what those lights were, they said: “Every known solar system worth learning about.”\nI would say I’ve died and gone to a better place, but I’ve used up my quota of terrible clichés just getting here.\nWait, that’s not true. I still have one awful one left.\nI stood in that room for a while, longer than I should have, but the truth is I was trying to work up the nerve to introduce myself to the head Archivist. But I never did because eventually they came up and greeted me. It was one of the most nerve-wracking conversations I’ve ever had. Between the steroids from my inhaler and pure, uncut anxiety, my hands were like a nine on the Richter scale.\nYou see, Saul, the Archivists are not to be messed with. Like seriously. Do not contradict them, raise your voice, be anything less than painfully respectful. They may look squishy, but they can dismantle you down to your atoms, capture you in a memory tablet, and put your unbelieving ass on a shelf where they keep all of the boring information that no one ever checks out. And they’ll keep you sentient too.\nOr sentient enough. I hope.\nFortunately, my interview was fairly short. The head Archivist found me worthy enough, I guess, and gave me very, very limited access to the Library. When they led me to the section with our solar system, I sort of wished you were here Saul, so you could have taken a picture of my expression at that moment. Pretty sure you would qualify it as “priceless.” Because the size of this room, you could fit a small town in here.\nAnd get this, the Archivist was apologetic. “We’ve only just begun to study you and we thought you would prefer to see our research in physical form,” they said, “Hopefully you can find what you need in our meager collection.”\nExcept, here’s the thing. They probably have more information on us than we have on ourselves.\nActually, I’m counting on it.\nEverything here is so strange, Saul. The light is too colorless and the air tastes weird. The walls and the shelves seem to bend slightly. It’s all new and deeply alien.\nIt’s wonderful.\nThe Archivists have set up something that’s not too different from a studio apartment in the corner of the section on sea coral. It has running water and artificial sunlight and all eleven seasons of M*A*S*H on a TV that looks like it came from the 1980s. I have this theory that my living quarters are part of some junior Archivist’s final thesis project, but I’m probably just culturally projecting. On the bright side, if they picked the 80s, they could have done much worse than M*A*S*H.\nI’m sure in a few weeks I’ll start having terrible bouts of homesickness and will send you even longer, possibly more rambling messages questioning every life decision leading up to this point. But right now, being in the Library is sort of liberating. In a let’s-call-my-big-brother-because-my-new-studio-home-is-way-too-quiet sort of way.\nOh. I got your first message today. Remember the one you recorded six months ago, about three days after I left? I knew you were pissed, but wow, Saul. A backstabbing, alien-loving, wheezing, useless coward? You had three whole days to think of something and that’s the best you could do?\nI know you didn’t mean it. I know you’re only half angry at me, half angry at our dying planet, and half angry at, well . . .\nI got a message from Huang too. She told me about the most recent miscarriage. I’m so sorry, Saul. One day the two of you are going to be the world’s best parents. I believe that more than I believe in your international reforestation project, which is definitely going to work.\nAnd I get how you think I’m abandoning you and Earth for a sterile, stable library, but I needed to come here. I have this working theory about the Librarians. Wanna hear it? Too bad, I’m going to tell you anyway.\nSee, the more time I spend with them, the more I’m convinced Librarians could have obliterated us if they wanted to. But they haven’t. In fact, they’ve put a painstaking amount of effort into studying us and making first contact with all the right people. Asking those people just the right questions like: “We managed to save the information before this university archive burned or this datacenter got flooded. Would you like to retrieve it?” Questions that convinced us to put this mission together.\nWhich leads me to believe they’re trying to help us.\nI know you’re rolling your eyes, Saul. Have I ever told you that you always look like a moody teenager when you do that? Yeah, I know I have. But hear me out, I’m trying to tell you something important.\nPlease.\nDo you remember our first big argument over this mission? You said that anyone who comes to Earth while in the middle of an environmental collapse can’t be trusted. I agree. Except, the first Librarian I ever met told me that the Library was built as a beacon for all sentient life in the universe. A place where researchers could come and learn about lost discoveries. And past mistakes.\nI can hear you saying: “And you were naïve enough to blindly trust them, Hazel?” No, Saul, I’m not. Before I was picked for this crazy mission, I was just there to help first contact go smoothly, being one of the few remaining anthropologists who have studied interactions between vastly different cultures. I had zero interest in becoming an astronaut; space travel always seemed too risky and uncomfortable to me. But the Librarians were impressed by my commitment to cultural preservation. The space program was impressed by my ridiculously good memory. And I became convinced that if I didn’t go, someone else would eventually slip and we’d be adding “total societal collapse” along with “environmental disaster” to the list of humanity’s problems.\nYou see, Saul, there’s so much that I’m witnessing in the Library that I’m not telling you, because the Librarians’ advanced tech would devastate our underdeveloped society.\nWhich didn’t stop the people in R&D from telling me over and over again to take careful notes on everything I observe and send them the information on the down low, of course. I was sent here to reclaim any research and history that could help us save ourselves, but I think they’re hoping that I’ll learn about useful alien tech too. I’m tempted to send them a report that says: Sorry nerds, it’s all just magic.\nNo, Saul, not really. My official reports are going to be way more straightforward and professional. You know, double the facts and half the amount of sarcasm. But I think I’m going to keep sending these messages to you, for a while at least. All this is not actually why I “ran away” from home.\nReally, it was just a good excuse to get out of commuting in Chicago traffic.\nJust kidding. It was the Great Plains fires. There’s only so much smoke and ash an asthmatic researcher can deal with before she ships out.\nOnly sort of kidding.\nI have a list of things I need to investigate for the scientists back home, but for now, I think I’m going to call it a day. Looking at the amazing amount of information around me makes me realize how much we’ve lost. How the Librarians managed to recover all this is a mystery I don’t intend to solve, but hopefully they managed to save the research I’m looking for.\nHave I mentioned how much of this is mission is chalked up to hope?\nHello, Saul, I’m lost. No, that’s not true, my memory won’t let me get lost, but I imagine this is what it feels like. The rows of memory tablets are identical, if you don’t pay attention to the Archivists’ annotations at every turn. I can’t actually read them because they just look like miniature sculptures, but I remember the small differences. The Archivists were kind enough to give me a basic map with a basic translation of where to find things. But Librarians’ basics and human basics are not the same thing.\nGod, I thought finding the research would be the easy part of this trip, but I might never find my way out of the single-celled organism section. So, give the family my love.\nI know what you’re thinking. Yes, I do. You’re thinking: “How about you come home then, Hazel, and help me with these seedlings?” because we’ve been having this argument for what, ten years now?\nNo, not quite. Nine years, 10 months, and twenty-seven days, since that first fight over dinner.\nYeah, Saul. My memory is my own worst enemy sometimes.\nBy the way, I got your second message today. Apology accepted. But I can’t come back, Saul. I barely started my information recovery project. Some good stuff got destroyed this last decade.\nLike Dr. Ryu’s research. If I can find it. If it’s here at all.\nGod, this message is depressing. Hey, here’s something cool I learned today; the kitchen cabinets produce whatever food I’m thinking about and the twenty some blank books in the living room become whatever I want to read. It really is like magic. Everything a human needs and all the books a girl can want.\nI’m not coming home, Saul.\nWell, it’s been a week and while I still haven’t found Dr. Ryu’s research, I’ve found plenty of other interesting things here. Like patents and working concepts of solar powered vehicles and papers on regenerating corn seed that needs two times the amount of CO2 for photosynthesis. We had so many opportunities to stop things before they got terrible, Saul. And we missed them all.\nHonestly, the wealth of information here is mind-blowing. The Librarians are like the universe’s most organized hoarders. They’ve saved everything from road construction projects to packing and advertising protocols for the garment industry. And get this, every time I activate a memory table, the information is projected around me. Sometimes the entire aisle transforms and I literally get lost in my work. Which is why there’s been a long gap since my last message. Sorry about that, Saul.\nDon’t laugh, but I spent all of yesterday in the children’s literature section. All the stories there came to life too; old houses covered in vines and chocolate factories and little engines that could. It was fantastic, Saul. And completely depressing. Because as I sat there surrounded by those hopeful stories, it hit me that your grandchildren might not even know these stories exist. Yes, I know you disagree. But I’m a learned anthropologist and a general pessimist and I’m scared.\nI asked an Archivist if this is how they store all their information. They asked if I’d be offended if they laughed and showed me the memory tablet that contained all the knowledge of the Library. It was about the size of paperback romance novel.\n“Our information would be inaccessible to you otherwise,” the Archivist explained. “All of your search engines are either too crude or too biased.”\n“But didn’t this take you forever to build?”\n“No,” they said, but I must not have looked convinced. “Magic,” they added.\nSaul, I think the alien race of information scientists are listening to these recordings. So whatever you do, don’t reply back with anything you don’t want recorded for posterity.\n“Why is the Library so large then?” I asked.\nAnd here’s where the story gets really depressing, Saul.\nThey told me that once this planet, the inhospitable place that’s just a wasteland and a massive Library now, was full of life. There were once billions of Librarians. Now, there’s only a few thousand. Before they became the masters of information science of the known universe, the Librarians ended up destroying their planet too.\nThe first Librarians I ever met told me the Library is a beacon for sentient life in the galaxy, except now I know it’s not just a beacon for other species. The reason why the Library’s so big, Saul, is that most of the Archivists and Librarians live here too.\nThey couldn’t save their planet either.\nI can hear you asking me why I bothered coming here if I’m going to be stubbornly bleak about the future and it’s not an easy thing you demanded, brother mine, and I’m trying to tell you in my circular, rambling way, that I . . .\nI . . .\nSaul. I need to call you back. I think I finally found Dr. Ryu’s research.\nI’ve got it, oh my god, I’m so relieved. It was a fight to get it, though. No, Saul, I’m not exaggerating. Stop rolling your eyes.\nRemember when I said the Archivists could keep their information sentient? Well, she was sentient enough, Saul.\nWhen I accessed the memory tablet, the researcher herself appeared so real and sharp I could see the gray strands in her hair and the clear gloss on her fingernails. She didn’t look thrilled to see me and I should’ve taken it as a warning, but I was way too excited.\n“Are you Dr. Yumi Ryu?” I asked. (Gushed would be more accurate.)\n“Up to the age of 53,” she answered\n“Amazing! It’s great to finally meet you, Dr. Ryu. I want to ask you everything. What’s it like being archived by the Librarians? No, wait, can you tell me about your reforesting research first?”\nFor some reason, Saul, my rambling didn’t put her at ease. “Why?” she asked, her expression suspicious.\n“Um, well, because the news back home isn’t good. Most of the North Pacific rain forest has been destroyed by a combination of drought and wildfires. Including your original research at UBC.”\nShe didn’t seem surprised by this, just sad. “And where is your team, Ms. . . . ?”\n“Hazel Smith. It’s just me.”\nShe frowned, the suspicion on her face growing. “They sent a single astronaut? Why?”\n“Resources and funds. Both are extremely limited these days.”\n“Why you then?”\n“Because I’m a researcher too, Dr. Ryu, and I’m dedicated to preserving human society. Also, because I have an extraordinary memory, especially for data and details, and don’t need batteries.”\nRyu arched an eyebrow. Out of nowhere, a memory tablet about the size of a romance novel appeared in her hands. She stared it intently.\n“What are you doing?” I asked, not getting a good vibe from this.\n“Reading your articles, academic and otherwise. Being part of the Library, Ms., excuse me, Dr. Smith, means I can check out materials too.”\nSuddenly, I knew how this conversation would go. It would be like those awful dinner parties that ended in silent awkwardness when people asked why I didn’t have kids. But there was nothing I could do, except try not to chew on my fingernails. In all of human culture, there’s nothing more uncomfortable than standing there while someone else reads your work.\nBut if anthropology has taught me anything, Saul, it is that human beings can always surprise you.\n“Wow,” Dr. Ryu said and the tablet disappeared from her hands. “You have a depressing view on human nature.”\nI’ve always hated having this conversation, so I stuck my hand in my pockets and said: “I’m just going off history.”\nShe nodded. “For what it’s worth, I agree.”\nColor me stunned, Saul. “So will you tell me about your research?”\nRyu stared at me hard, with that critical eye that only people who spend too much time in labs analyzing details can pull off.\n“No,” she said.\nNo. That’s what she really said. After traveling thirty-two and a half lightyears for research like this. I won’t lie, Saul, for a brief second I considered smashing the memory tablet.\n“You serious?” I said.\n“Yes, Dr. Smith. I’ve spent most of my professional career fighting politicians, big businesses, home developers, farmers. Anyone who didn’t like the idea of giving up their land and returning it to forests, to try to reverse some of the damage we’ve done. I can’t tell you how many times people tried to destroy this research.”\n“I’m not here to destroy anything, Dr. Ryu. I’ve given up too much for that.”\n“And what did you give up, Dr. Smith?”\n“Earth. Everyone I know and love. I’ve risked my life for this information!” I said. In hindsight, maybe a little too defensively.\n“No, that’s running away,” she replied. Yeah, she really said that to me, Saul. “Why are you really here?”\nI sighed and used your classic line. “Because it’s hope for the future that keeps us going.”\n“And who do you have hope for, Dr. Smith? Because from what I’ve read, you don’t paint a hopeful picture.”\nI didn’t know what else to do. So, I told her, Saul. Everything I’ve been trying to tell you.\nThere aren’t many defining moments in my life. Mostly, I think defining moments are clichés in hindsight. So maybe this is too, but do you remember that summer, ten years ago, when everything burned? Yeah, hard to forget.\nI’d just gotten my first master’s degree and wildfires in northern Washington were raging, and there was a trail you could take up a mountain that was still a safe distance away, but you could witness the worst fires in history firsthand. It was only an hour drive from campus. And I was frustrated and scared, but also curious. So I figured what the hell.\nI took this guy with me. No, you’ve never met him, Saul.\nWe walked up that mountain together, though the ash made for awful traction.\nIt wasn’t love and we both knew it. That was one of the many, many rules I broke to myself that summer. But I liked him and he liked me. And in that moment, that was enough. Good enough. The world was on fire and right then, I was too grateful to have someone who would climb a mountain with me just to watch the world ending.\nMortality makes you reckless sometimes, Saul.\nEventually the smoke got so bad that my asthma couldn’t take it. He practically carried me back down.\nTwo months later, he went back home to Colorado, where there were a few trees left and I spent that fall sobbing and wheezing. Which made sense when I took a pregnancy test.\nI chose. And I don’t regret that choice, Saul. Except three days, eighteen hours, and twelve minutes later, you called and told me about the first child you and Huang wouldn’t have after all.\nI’m sorry I didn’t tell you before, Saul. But I’m not sorry either. I was twenty-three, and though I could repeat back textbooks verbatim, I consistently lost my keys and forgot to eat. And after that summer, it was hard to see myself with a future and much less, a future for a kid. I know you’re disappointed in me because you believe that no opportunity should be wasted. You think every life, even the cockroaches in the shed, should have a go at it. You’ve always believed in a future on Earth, Saul. Where I saw ashes, you saw fertile soil.\nThat’s what I told Dr. Ryu. I told her all about you and Huang and your relentless perseverance and hope. I think she saw a kindred spirit in you or maybe just the right strain of stubbornness. So, she agreed to share her research with you. We’re going to transcribe a little every day. Her memory tablet makes the Library’s aisles transform into thriving forests. It is truly beautiful.\nConsider this part one of my gift to you, Saul, because like hell am I going to apologize for the choices that brought me here.\nPart two is that one of the benefits of becoming the last astronaut was getting a ridiculous stipend from the government. Well, more like a life insurance payout, because I’m going to be here for a long time. Hopefully not forever, but there’s a lot of lost information here and the Archivists apparently are used to long-term guests.\nI told you I had one last, terrible cliché and it’s the worst one of all. The one where the astronaut doesn’t come home.\nSaul, I want you to use that money to start that family you and Huang always wanted.\nHonestly, I’m still not convinced we can save Earth, but you are, and that works for me. So, I’ll keep searching and sending home the information I find and maybe, between the two of us, that’ll be enough.\nSo, give the family my love.\nA.T. Greenblatt is a mechanical engineer by day and a writer by night. She lives in Philadelphia where she's known to frequently subject her friends to various cooking and home brewing experiments. She is a graduate of Viable Paradise XVI and Clarion West 2017. Her work has won a Nebula Award, has been in multiple Year's Best anthologies, and has appeared in Uncanny, Beneath Ceaseless Skies, and Clarkesworld, as well as other fine publications. You can find her on Twitter at @AtGreenblatt"}