{"fingerprint": "IVfpRMLJ1qGMH2AzDpudBdFt4zw=", "sitename": "Clarkesworld Magazine", "title": "Move Forward, Disappear, Transcend by A. T. Greenblatt", "author": "A T Greenblatt", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/greenblatt_05_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Move Forward, Disappear, Transcend by A. T. Greenblatt", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2410 words, short story\n Move Forward, Disappear, Transcend\n I lost my favorite fingers as I was walking to the library. Spotting it first from the corner of my eye, I glanced down. A gasp seized up in my throat. Instead of the long, beautiful, expertly manicured prosthetics that Sonya made me, there were ten empty nubs. And the grief I’d been carrying these last few months grew heavier.\n I scanned the tall reeds around me, hoping that maybe I simply dropped them. But it was pointless. It was impossible to find anything in this city anymore. Downtown was more like a wilderness preserve than the vibrant cityscape I knew as a girl. The buildings were covered in ferns, and wildflowers grew where the roads use to be. My allergies would have been terrible if I still had sinus cavities.\n There are a few advantages to being so old that you’re mostly clone parts or inorganic replicas. A ship of Theseus of the flesh.\n I stared at my incomplete hands, fighting back the tight sob in my chest. In a moment of weakness and I tapped the side of my temples with my knuckles and messaged Frida. “I’ve lost my fingers.” I blinked and took a snap of my hands, palms up, and sent that too.\n “The ones with the indigo manicure? Are you sure you didn’t leave them at home, Mom?” she messaged back.\n Of course I was sure. I would never so carelessly lose something my second wife made me. But I wasn’t going to risk an argument about it. Of my many children, Frida was the only one who still responded to my messages.\n I took a few deep, steadying breaths. I was far too old to get emotional in the middle of the street. Instead, I smoothed my hair with my palms and looked ahead. Because there was nothing else to do, but keep moving forward. That was what I always told my children.\n I continued on towards the library.\n When I arrived, the librarian at the desk was wearing a transcended body that made him look like a model from an Andy Warhol painting. Unlike me, his body was completely synthetic.\n “Hello Lin Pei,” I said, hiding my hands behind me, the nubs of my missing fingers sharp against the small of my back. “How are you today?”\n “Hi Ms. Y,” he said, brightly, “Studio room 4 is all set. The students are eager to meet you.”\n “Wonderful.” My apartment was too old to support a personal VR room. Thank goodness for libraries.\n Lin Pei moved like a dancer as he led me to an empty studio and booted the school’s program for me. A few seconds later, the studio became a perfect replica of a 2030s apartment. Nothing like my real apartment, of course. Mine didn’t have so much clutter and my taste in deco was much less . . . old fashioned. I always disliked the scene design of this program. It made me feel like an alien in my own history. But I didn’t have the heart to tell that to the program managers. They were so excited to have me as part of their living history project.\n I took a seat in the middle of the living room, carefully tucking my fingerless hands in my pockets.\n Two minutes later, my audience appeared. The kids sat on the couches and chairs and floor, facing me. I guessed they were about eight years old. Some of them seemed interested in their surroundings, some looked wrapped up in the feeds in their heads. I had to resist shaking my head. Children didn’t know how to multitask anymore.\n The boy closest to me had bright red, curly hair and I was tempted to reach out and tousle it. But that would have been ridiculous. I was the only non-projected thing in the studio.\n I put on my brightest smile.\n “Hello, everyone. Who do I have the pleasure of speaking with today?”\n They introduced themselves as Oakwood Primary’s fourth year students from Melbourne. I gave my little opening speech: Who I was, how old, what my life was like way back when, what it is like now, what it was like to be one of the first people to ever transcend.\n “You don’t look like you’ve transcended.”\n “No,” I agreed. “Because I transcend so long ago, I don’t have the right tech installed to be completely relocated.”\n “What does that mean?”\n “What does it mean?” I had asked, as my children and I sat in the doctor’s office when they first mentioned replacing my failing lungs with inorganic replicates.\n “It means you’re going to be around for a very long time, Mom,” Frida said, squeezing my hand.\n “It means I was upgraded in pieces,” I explained. “And that I’m not completely synthetic, even now.”\n The kids looked impressed.\n “So that’s why you have wrinkles?”\n “Yes and don’t I look fabulous?” I replied, tossing my hair back and striking a pose. The kids giggled and I smiled. It amused me that I was an ancient relic to them even though physically, I hadn’t aged since I turned sixty-five.\n “Did you know,” I said. “That before we had comm implants up here,” I almost tapped the side of my temple, but remembered my missing fingers at the last moment. I tilted my head instead. “That we sent messages with something called a phone.”\n The kids giggled again. “Ms. Y you said ‘message’! It’s called a dash!”\n “Gran, you’ve got to keep up with the new tech,” my grandkids said, laughing, but I could tell they were worried. They were in their seventies, but wearing transcended bodies that looked thirty. “We don’t want you to get left behind.”\n “I’m trying, dears. Really.”\n “We know, Gran.”\n “Oops,” I said, smiling through my embarrassment.\n “Can you tell us more about what it was like when you were younger, Ms. Y?” the teacher said, with a sympathetic expression.\n Silently, I thanked the teacher and took the opportunity to steer the conversation into familiar territory. I told them about what gaming on a console was like, how we had to travel to visit places because we didn’t have comm implants or realistic VR yet. I explained that if you wanted to eat, you had to make your own food or have someone else make it for you.\n They stared at me in a mixture of horror and disbelief.\n “But why didn’t you just print it?”\n “Because back then, printers could only make things in plastic and metal,” I replied. “We actually had to practice to make good food.”\n “The future is so much better, then.”\n “You can’t go,” I told Sonya, clutching her hands in the hospital, as her original organs and the new clones failed and died indiscriminately. “The future will be worth living for.”\n “I’m sorry, love. But I think it’s just my time.”\n “The future is better,” I agreed, out of habit. But in that moment, the grief I’d been carrying for the last three months, ever since I snuck a look at Frida’s personal messages, put its cold hand on my chest and squeezed. Until recently, I really did believe that the future was brighter.\n “We have to go soon. Any last questions for Ms. Y?” the teacher said.\n “Aren’t you sad you can’t transcend beyond your body? What if you’re the only person left one day?” the boy with the red, curly hair asked.\n “How can you just abandon your body?” I demanded, when Ru, my third and last husband, broke the news that he was transcending. Really transcending. “We promised we’d always be here for each other. What about me?”\n “I’m sorry, dear. Nothing personal. I just want to see my grandkids—and great grandkids—again.”\n “Leo!” The teacher reddens with embarrassment.\n “Oh, that’s alright,” I said, turning to the boy. “No, I’m not worried. If I’ve learned something over the years, it’s that I’ll always have things to care about right here.”\n I tried to smile, but the feeling of the nubs of my fingers against my thighs, made it impossible. And as I sat there among the children, this fresh generation, the memory of sifting through Frida’s personal stream of messages three months ago, haunted me.\n It was like a mother spying on her teenage daughter, even though we were both far too old for that. I still felt guilty about it, but Frida had grown distant. My daughter, my last relative that hadn’t upgraded beyond my capabilities yet. The only one I could still see and communicate with.\n In her message stream, I found four different information packets about “Taking the Next Step!” Guides about transcending beyond the physical body.\n I knew then, that one day soon, my daughter would disappear too.\n Every year, Frida throws a fabulous party for our birthdays. Mine’s only four days after hers, so a joint celebration is something we’d been doing for decades. She always offered to host and I’m always happy to let her take charge.\n I was embarrassingly late to the party, but my brown eyes went missing that afternoon. The latest piece of me to disappear.\n They hadn’t been my favorite, but they were the closest to what my original eyes had been and recently, I found myself using them almost daily. After an hour of frantic searching, I gave up and agonized over which pair to wear instead. Many of my other pairs were noticeable and bright, something I used to delight in, but now they felt like they belonged to a different person. Or another life. In the end, I chose to wear my green ones with hazel flecks to the party. These eyes were lucky, I told myself; I’d been wearing these eyes when I met my last husband, Ru.\n By the time I arrived, there were about two dozen transcended bodies in Frida’s apartment. Her home was tastefully retro, favoring the shiny surfaces and severe lines style of the early 22nd century. Most of Frida’s friends and lovers were nouveau-retro too, looking like they stepped off the set of a 2120s stream. All loose fitting, flowing clothes and short cuts, curls close to their scalps. There were fewer people in attendance this year than last, though. An unsettling trend in last decade. Once, Frida’s parties spilled over with guests.\n “Happy birthday, Mom!”\n I turned, and there was my daughter. She looked nothing like when I last saw her, choosing mods that made her body curvy, complete with an A-line haircut and dimpled cheeks. But I could recognize that smile, the way she moved her hands, on anything she wore.\n “Happy birthday, yourself,” I replied. “Sorry I’m late.”\n “I was getting worried.”\n “I sent you a message.”\n Frida laughed. “No one’s called them messages in decades, Mom. It’s dashes, now.”\n I smiled. “I know, but I’m a stubborn antique.”\n “Not to me.” She took my hand. “Come on, let’s go mingle.”\n Frida’s friends were polite, as always. Asking about my work with the living history project and my health. Those were safe topics. Most people knew that modern tech and organic material weren’t compatible, so I couldn’t get the upgrades I needed to follow the latest feeds. In many ways, the guests reminded me of the school children I talked with. Conversations felt more like an interview and everyone seemed so . . . well, young.\n When the talk turned, as it always did, to who among their acquaintances were transcending next, I excused myself to the kitchen, claiming to need some water.\n I didn’t, but this was the only empty room in the apartment. The kitchen was a relic of another time, no longer required. Like me. I looked at my hands, relieved that my second favorite fingers were still there, but then, grief threatened to overwhelm me and I had to steady myself on the edge of the counter.\n Today, my youngest daughter turned one hundred and sixty seven. On Wednesday, I would be two hundred and fourteen. And of my numerous friends, lovers, family, and descendants over my extended life, she was the only one left with a physical body. The rest had disappeared to places I couldn’t reach.\n “You okay, Mom?” Frida stood in the doorway of the kitchen, leaning against the threshold.\n I stood up straight and smoothed my hair. “You always worry about me.”\n “Of course. I don’t want to lose you, Mom.”\n “Even when you transcend beyond a body?”\n Frida bit her lip, for a moment looking guilty and so much like the child she once was. “How did you know?”\n “A mother’s instinct.”\n She settled herself next to me by the kitchen counter, staring through the doorway at her friends in the other room. “It’s getting harder,” she said.\n “Yes.”\n We were silent for a few minutes, watching the guests in their beautifully crafted bodies that would never gain muscle, change shape, or get wrinkles. No one could move forward in this state.\n “I think,” I said, slowly, through the grief, the ache in my chest. “I think this should be our last birthday party.”\n “What do you—” Frida began. Then she realized and her eyes widened. “Oh. I can’t just leave you, Mom.”\n “When was the last time you talked to your children? Your grandchildren? Great-grandchildren?”\n “I have some great-great-greats that are still too young to transition,” Her eyes glisten. “But it’s not really the same, is it?”\n I shook my head. “You should reconnect with them.” I said. “Before they become unrecognizable.”\n “What about you?”\n “I’ll be fine. They’re starting communities for us first transcenders, you know.”\n “I didn’t.”\n “I’ll be fine.” I said again and gave her my most reassuring smile.\n It was a lie, of course. My eyes, fingers, and a dozen other pieces of me had disappeared these last three months and I had no idea why. Perhaps, my memory, which had served me well for over two centuries, was overfull and leaking information. But, maybe like Sonya, it was just my time to go.\n I don’t tell Frida any of this. Instead, I reach out and pull her into a tight embrace. A moment later, I felt her arms wrap around me too.\n My daughter and I held each other in her small, useless kitchen. Neither of us willing to end the moment first.\n “To many happy returns, love,” I said.\n “Like you always say, Mom, let’s keep moving forward.”\n “Yes.” I squeezed her tightly one last time and then let go.\n A.T. Greenblatt is a mechanical engineer by day and a writer by night. She lives in Philadelphia where she's known to frequently subject her friends to various cooking and home brewing experiments. She is a graduate of Viable Paradise XVI and Clarion West 2017. Her work has won a Nebula Award, has been in multiple Year's Best anthologies, and has appeared in Uncanny, Beneath Ceaseless Skies, and Clarkesworld, as well as other fine publications. You can find her on Twitter at @AtGreenblatt"}