{"fingerprint": "FEYTlmsfQ3rrvDtvYDf0hnU1Xp0=", "sitename": "Clarkesworld Magazine", "title": "Shining Armor by Dominic Green", "author": "Dominic Green", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/green_04_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Shining Armor by Dominic Green", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7530 words, novelette, REPRINT\nShining Armor\nIt was close to dawn. The sun was a sliver of brilliance just visible over the mass of canyons on the western horizon. There was no reason why the direction the sun rose in should not be arbitrarily defined as East; the only reason why the sun rose in the West on this planet was that, if looked at from the same galactic direction as Earth, it span retrograde. Even at this number of light years’ distance, men still had an apron-string connecting them to their homeworld.\nThe old man was still doing his exercises.\nThe boy didn’t realize why the exercises had to take so long. They didn’t look hard to do, although when he tried to copy them, the old man laughed as if he were doing them in the most ridiculous manner possible. The old man used a sword while he did the exercises, but not even a real one—it had no edge, and was made of aluminum which could not even be made to take one. He held the sword-stick ridiculously, not even using his whole hand most of the time; usually he held it with only his middle finger and forefinger, some of the time with only the little and ring fingers. Both of his hands, in fact, were held in that peculiar crab claw, with the fingers separated.\nFinally, though, there were signs that the old man was coming to the end of the set, stabbing around him to right and left with his stick. The boy now had something to do. Gradually, he scurried out among the rusting steel shells, carrying the basket of fruit. It was, of course, spoiled fruit, fruit the old man would not have been able to sell at market. There would have been no point in wasting saleable produce.\nThe boy arranged a marrow to the west, a pineapple to the east, a durian to the north, and a big juicy watermelon to the south. Each piece of fruit sat on its own square of rice paper. He was careful to leave the empty basket in a spot where it would not interfere with the old man’s movements. Then, just as his elder and better was turning into his final movement, facing into the sun as it blazed up into the sky, the boy ran to the long half-buried shelf the old man called the dead hulk’s ‘glacis plate’, and unwrapped the Real Sword.\nThe Real Sword was taller than he was. He had been instructed to unwrap it carefully. The old man had illustrated why by dropping a playing card onto the blade. The card had stuck fast, its weight driving the blade a good half centimeter into it.\nThe old man bowed to the sun—why? Did it ever bow back?—walked over to the sword, nodded stiffly to the boy, and picked up the weapon. He executed a few practice cuts and parries, jumping backwards and forwards across the sand. This was more exciting—he was moving quickly now, with a sword of spring steel.\nThen, he became almost motionless, the sword whipped up into a position of readiness up above his head. As always, he was directly between all four pieces of fruit. Sometimes there were five pieces of fruit, sometimes six or seven.\nThe sword moved up and down, one, two, three, four times, the old man lashing out at all quarters, turning on his heel on the sand. There were four soft tearing sounds, but no sparks or sounds of metal hitting metal.\nThe old man stood finally upright, ready to slide the sword back into a nonexistent scabbard. He had lost the scabbard somehow years ago, nobody seemed to know how—nobody could convince him to shell out the money for a new one.\nHe walked over to inspect the fruit. All four pieces now lay in two pieces, making eight pieces. In all four cases, the cut had been deep enough to completely halve the fruit right down to the rind. In not one case had the rice paper underneath been touched. In some cases, the old man’s activities had cut the rot clean out of the fruit. The boy gathered up the good pieces, which would now be breakfast.\nThe rotten pieces he slung away into the desert.\nWhen they walked back toward the village, the General Alarm was sounding. This, the boy knew, could be very bad, as no alarm practice was scheduled for today.\nGeneral Alarm could mean that another boy like him had fallen down a melt-hole like a damned fool and the whole village was out looking for his corpsicle. Or it could mean that a flash flood was on the way and every homeowner had to rush out and bolt the streamliner onto the north end of his habitat, then rush back in and dog all the hatches. It might mean a flare had been reported, and everyone except Mad Farmer Bob who carried on digging his ditches in all weathers despite skin cancer and radiation alopoecia had to go underground till the All Clear.\nBut it was clear, when they reached the outskirts of the village, that this was none of these things. There was a personal conveyor in the Civic Square, with its green lights flashing to indicate it had been set to automatic guidance. Someone had used towing cable to secure three long irregular wet red shapes to the back of it, shapes the grown-ups would not let him see. But he had a horrible idea what they were, or what they had once been. Dragging your enemy behind a conveyor was a badabing-badaboum thing to do, and normally the boys in the village would have run and jostled to see such a marvelous sight. But when the men who had been dragged, probably alive, were Mr. d’Souza, big friendly Mr. d’Souza who had three hairy Irish wolfhounds, and Mr. Bamigboye, who told rude jokes about naked ladies, and even Mr. Chundi, who told kids to get off his property—then things did not seem so exciting.\nMr. d’Souza, Mr. Bamigboye, and Mr. Chundi were Town Councilors, and they had gone up to the Big City to argue with the authorities about the mining site. Although there was nothing there now but a few spray-painted rocks and prospectors’ transponders, the boy knew that some Big City men had found rocks they called Radioactives upriver. But the boy’s father said the Big City men were too lazy to dig the rocks out of the ground using shovels and the Honest Sweat Of Their Brow. Instead, they planned to build a sifting plant downstream of the village, and set off bombs also made of Radioactives in the regolith upstream. A handsome stream of Radioactives would thus flow downriver to the sifting plant, but the village’s water would be poisoned. The villagers had all been offered what were described as ‘generous offers’ to leave by the Big City men; but the Town Councilors had voted to stay. The Big City men had been rumored to be hiring a top Persuasion Consultancy to deal with the situation. Now it seemed that the rumors had come true.\n“We ought to take a few guns into town and sort out those City folk,” said old father Magnusson, who thought everyone didn’t know he ordered sex pheromones and illegal subliminal messaging software through the mail from Big City, but Aunt Raisa knew. Now no woman in town would either visit him or call him on the videophone.\n“How many guns do we have? And small-bore ones, too, for seeing off interlopers, not armour-piercing stuff. The combine bosses will be protected by men in armour, ten feet tall, with magnetic accelerators that shoot off a million rounds through you POW-POW-POW before you pop your first round off! You are maximally insane.” This was old mother Tho. Despite her insulting mode of communication, many of the older and wiser heads in the square were nodding their agreement.\n“Don’t be ridiculous,” said Mother Murdo. “Magnetic accelerators are illegal.”\n“Anything illegal is legal if nobody is prepared to enforce the law. Have you not been up to the City recently? The mining combines have been making their own militaria for months. After they had to start making their own machine tools and coining their own money, weapons were the logical next step.”\n“But we are still citizens of the Commonwealth of Man,” said father Magnusson, drawing himself up to his full one hundred and thirty-five centimeters, “and an attack on us would be an attack on the Commonwealth itself.”\n“Pshaw! The Commonwealth doesn’t even bother to send out ships to collect taxes any longer,” said mother Tho. “And when the taxman doesn’t call, you know the government is in disrepair.”\nThere were slow nods of appreciation from the crowd, most of whom were secretly glad that the tribute ships had not visited for so many years, but all of whom were alarmed at the prospect that those ships might have funded services whose unavailability might now kill the village.\n“Well, in any case,” said father Magnusson, “if they dare to come up here and attempt their person-dragging activities, the State will repel them instantly.”\nMother Tho was unimpressed. “We must be pragmatic,” she said. “The Guardian has not moved for sixty Good Old Original Standard Years. Not since the last Barbarian incursion.”\nFather Magnusson smacked his lips stolidly. “But I remember,” he said, “when it last moved. And it operated most satisfactorily on that occasion. The Barbarians’ ships filled the skies like locusts, but our Guardian was equal to them.”\nMother Tho looked up into the sky, where the silhouette of the Guardian took a huge bite out of the sunrise. “Father, you are only one of perhaps two or three people still alive who remember the Guardian moving. And it is a machine, and machines rust, corrode, and biodegrade.”\n“The Guardian was built to last forever.”\n“But a Guardian also needs an operator. And where is ours?”\nThe old man put a hand upon the boy’s shoulder, and moved away among the buildings before the conversation grew more heated.\n“There are foreigners in the village,” said the boy’s mother, folding clothes with infinite precision. “Men from the mining company. They are asking for Khan by name, and you know why, old man.”\nThe old man tucked the sword away in a crevice by the side of the atmosphere detoxifier. “Khan can look after himself.”\n“They had guns, by all accounts, and you know he can’t.” The boy’s mother ran the iron over a fresh set of clothes. “Khan is fat and slow and has long since ceased to be any use in a fight. It isn’t fair for him to be put through this.” She looked up at the old man. “Something must be done.”\nThe old man looked away. “They have heard the name Khan, heard that this Khan is the man who is our Guardian’s operator. They perhaps mean harm. I will radio to Khan in the clear to stay out fixing watercourses and not return home until these men have gone. They will be listening, of course. This will inform them that their task is pointless, and then maybe they will leave.”\n“Or they will go out and search the watercourses till they find him.”\n“Khan knows the watercourses, and is more resourceful than you give him credit for. They will not find him.”\n“Khan is not as young as he once was. It will be cold tonight. You think that just because people are not as old as you, they are striplings who can accomplish anything.”\n“I think nothing of the sort, woman. Now boil me some water. I have a revitalizing tea to prepare for Mother Murdo’s fin-de-siècle ennui.”\nKhan’s mother gathered up the heap of ironing and made her way out of the kitchen past the floor maintenance robot. “Boil your own water, and lower your underparts into it.”\nIn order to defuse a family quarrel, the boy walked across the kitchen and turned on the water heater himself. He could not, however, meet the old man’s eyes. Khan was, after all, his father.\nThe next morning, underneath the Guardian’s metal legs, there was a gaggle of young men jostling for position.\n“I will save the village!”\n“You are wrong! It will be I!”\n“No, I!”\nThe boy, who was running a flask of tea to Mother Murdo, saw Mother Tho rap three of them on the occiput with her walnut-wood staff in quick succession.\n“Fools! Loblollies! What would you do, if you were even able to gain access to the Guardian’s control cabin?” She pointed upward with her polyethylene ferrule at the ladder that led up the Guardian’s right leg, with a dizzying number of rungs, up to the tiny hatch in its Under Bridge Area where a normal person’s back body would be. Once, the boy had climbed all those rungs and touched the hatch with his hand for a bet, before being dragged down by his father, who told him not to tamper with Commonweal property. His father had had hair then, and much of it had been dark.\n“If I gained access,” swaggered the most audacious of the three, “I would march to the Big City and trample the mining syndicate buildings beneath boots of iron.” And he blew kisses to those girls of marriageable age who had gathered to watch.\n“If you gained access!” repeated the old witch, and grabbed him by the nose using fingers of surprising strength. “YOU WOULD NEVER GAIN ACCESS! Only the Guardian’s operator has a key, and it is synchronized to his genetic code. You would do nothing but sit staring up at a big metal arse until the cold froze you off the ladder.”\n“OW! Bedder dat dan allow our iddibidual vreedods do be sudgugaded!” protested the putative loblolly.\nMother Tho let the young man go, and wiped her fingers on her grubby shawl.\n“Our Guardian will defend us when its operator is ready,” she intoned.\nA voice chipped in across the crowd: “Our Guardian’s operator is too feeble.”\nThe boy shrunk back behind a battery of heat sinks and hid his face.\n“It’s true!” yelled another voice. “The company assassins turned out the whole of Mr. Wu’s drinking establishment and threatened to shoot all its clientele one by one until Khan was turned over to them. In his confusion and concern for his customers, Wu turned over the wrong Khan, Khan the undertaker, and they killed him instantly. His tongue lolled out of his face like a frosted pickle. When the company men find the real Khan and kill him, there will be no trained professional to bury him.”\n“There are men in the village with guns?” said one of the bold youngsters, removing his thumbs from his belt, staring at his contemporaries with a face of horror.\n“Ha!” gloated Mother Tho. “So our bravos are not quite so audacious when faced with the prospect of their skins actually being broken.”\nThe boy put dropped his cargo of tea and ran for home.\nHome proved to be more difficult to get to than usual. The boy followed the path most usually followed by children through the village, disregarding the streets and ducking under the support struts of the houses. Had crows been able to fly in this atmosphere instead of expiring exhausted after a few tottering flutters, he would have been traveling as the crow flew.\nHowever, there was a problem. A small group of boys were holed up under the belly of Mother Tho’s house, whispering deafeningly, fancifully imagining they were Seeing without Beeing Seen. But the boy was not afraid of other boys—at least, not as much as he was afraid of the men in the street who were tolerating Being Seen.\nIt was quite rare for children to be playing on the streets now. Their mothers were keeping them indoors. It was hoped that the Persuasion Consultancy assassins had not realized their mistake, and would be happy with having disabled the village’s (admittedly one hundred per cent lethal) corpse-burying capabilities.\nHowever, it seemed the assassins were not content with simple murder. They were standing in the street outside the house of Khan the undertaker, above which a grainy holographic angel flickered in the breeze. Not content with having murdered the undertaker’s unburied corpse, the men had turned out the contents of his funeral emporium, headstones-in-progress and all, into the street. They were searching the whole pile of morbid paraphernalia with microscopic thoroughness, while his widow screamed and hurled such violent abuse as the poor woman knew. The boy could only conclude that onyx-look polymer angels were of great value to them.\n“They are searching for our Guardian’s access key,” hissed one of the watchers in a strict confidence that carried all the way to the boy’s ears.\n“Only the Operator has the access key,” said another boy. “Was Khan the Operator?”\n“No,” said a third. “I think it was Khan the farmer.”\n“Khan, a warrior! He is a fat little fruit seller.”\n“Operators are not chosen for their physical strength,” said the third boy contemptuously. “The servomechanisms of the Guardian provide that. Operators are chosen for the extreme precision of their physical movements. It is said that the operator of the Guardian of the Gate of the City of Governance back on Earth was so precise in his motions that he was able to grip a normal human paintbrush between his Guardian’s claws and inscribe the Rights and Duties of Citizens on the pavement in letters only three meters high.”\nThe boy ducked under the hull of the nearest building and took a dog leg a habitat to the south before any Persuasion Consultancy men could engage him in conversation.\nIt was sunset. The sun was setting in the East.\nThe old man was sitting dozing, pretending to be absorbed in serious meditation. The boy walked up and pointedly slammed down the basket on a nearby ruined Barbarian war machine, pretending not to notice the old man starting as if he had been jumped on by a tiger.\n“I have brought everything,” said the boy. “Father is still at large. The assassins are reputed to be pursuing him along the north arroyo.”\nThe old man nodded, and sucked his teeth in a repulsive manner. “Did you bring the weapons from underneath the loose slab in the conveyor garage?”\nThe boy nodded. “There is no need to conceal these weapons,” he sniffed. “It is not illegal to possess them, and surely they can be of no intrinsic value.”\nThe old man ran his hand along the bow as he lifted it from the bundle, and grinned. “There was also a picture of your grandmother underneath that slab,” he said. “That is also of little intrinsic value.”\n“I never knew my grandmother,” said the boy.\n“Think yourself lucky,” said the old man grumpily, “that I did.” He set an arrow—the only arrow in the bundle—to the bow, and began trying to bend it, frowning as his hands shook with the effort.\n“OLD MAN,” called a voice. “STOP PLAYING AT SOLDIERS. WE DEMAND TO KNOW WHERE KHAN IS.”\nThe bow collapsed. The arrow quivered into the dirt. The old man turned round. From the direction of the village, three young men, muscles big from digging ditches and lifting baskets, had strolled in to the clearing between the destroyed military machines. The boy realized with a sinking heart that he had been followed.\n“My father,” said their leader, “says that Khan is the operator of our Guardian.”\nThe old man nodded. “True enough,” he said.\n“Then why is he hiding outside the village like a thief?” The youngster threw his hand out towards the horizon. “Not only are there murderers in our midst, but an army is gathering on our doorstep. Employees of a Persuasion Consultancy engaged by the mining combine have arrived. They have delivered an ultimatum to the effect that, if the combine’s generous terms are not accepted by sunrise tomorrow, they will evacuate the village using minimum force.” He licked his lips nervously. “Scouts have been out, and the consultancy’s definition of ‘minimum force’ appears to extend to fragmentation bombs and vehicle-seeking missiles.”\nThe old man’s face sunk into even more wrinkles than was normally its wont. “Khan,” he said, “hides nowhere. Who here says that Khan hides?” And despite the fact that he was armed only with a bamboo bow and arrows, none of the young men present would meet his eyes.\n“Father, we have the greatest respect for your age, and none of us would dare to strike a weak and defenseless old man. We simply wish to know when, if at all, our Operator intends to discharge his duty.”\nThe old man nodded.\n“Weak and defenseless, you say.”\nHe slung out the bow at the spokesman of the group, who the boy believed was called Lokman. It whirled in the air and struck Lokman in the jaw. Lokman rubbed the side of his face, complaining bitterly; but still his manners were too correct to allow him to attack his elders.\n“Pick the bow up,” said the old man. He grubbed in the dirt for the arrow, and tossed it to Lokman. “Now notch the arrow, and pull the bow back as hard as you like.” He did not rise from his sitting position.\nLokman shrugged, and heaved hard on the bow. It was an effort even for him, the boy noticed. The bow was almost as stiff as a roof-tie.\n“Point the bow at me,” said the old man, grinning. “You purulent stream of cat excrement.”\nLokman’s hands were shaking on the bow too now. It rotated round to point at the old man.\n“Now fire!” said the old man. “I said FIRE, you worthless spawn of a mining company executive—”\n“No, DON’T—” said the boy.\nThe string twanged free. The boy did not even see the arrow move. Nor did he see the old man’s hand move. But when both hand and arrow blurred back into position, the one was in the other; and the hand held the arrow, rather than the arrow being embedded in the hand.\nLokman stared at the old man’s hand for a second; then he snorted.\n“A useful parlor trick,” he said. “Can you do it against missiles?”\nHe threw down the bow and walked away.\n“Khan is a coward who will not fight,” he said, over his shoulder. “Besides, he could not get to the Guardian even if he wished. The assassins have the access ladder under guard. Pack up your things and leave, old man. The Councilors are leaving. We are all leaving. We are finished.”\nThe old man watched the visitors leave. Then, he reached into the bundle, where a battered oblong of black plastic lay alongside the picture of the boy’s grandmother. In the plastic were embossed the letters KHAN 63007248.\n“It is good,” said the old man. “You have made sure Khan has everything he needs.”\nThe old man hung the oblong round his neck on a chain that pierced it, and felt his throat to make sure it was not visible as it hung.\n“What time did they say the ultimatum expired tomorrow?” he asked, without looking at the boy.\n“Sunup,” said the boy.\n“It is good,” said the old man, nodding. “There is time. Run back to the village with these things, and return quickly. Then you shall accompany me while I deliver these troublemakers an ultimatum of our own.”\n“Why am I going with you?” said the boy.\n“Because no man will shoot an old man,” said the old man, “unless he is a wicked man indeed. But even a wicked man will not shoot an old man accompanied by a small boy—unless, of course, he is a very wicked man indeed.” He grinned, and his grin was more gaps than teeth. “This, I must admit, is the only flaw in my plan.”\nThen he returned to his meditation, as if nothing had either happened or was about to. The boy seriously suspected he was sleeping.\nThe sun had set, and the reg had ceased to be its accustomed thousand shades of khaki. Now, it was the color of a world plunged underwater to a depth where every shade of anything became a democratic twilight blue.\nThe boy followed the old man uncertainly across the regolith towards a group of Persuasion Consultants lounging around an alcohol burner in the shadow of an APC. Even the burner’s flame was blue, as if carefully coordinated to fit in with the night. The Consultants noticed the old man long before he began to jump up and down and wave his arms to get their attention, but the boy noticed that it was only at this point that they relaxed and began the laborious process of putting the safeties back on their weapons.\n“Hey! Ugly Boy! Take me to your ugly leader!”\nNone of the Persuasion Consultants answered. Evidently none of them was willing to own up to the name of Ugly Boy.\n“Suit yourselves, physically unprepossessing persons, but be informed that I bear a message from Khan.”\nThe men began to fidget indecisively in their dapper uniforms. Eventually, one spoke up and said:\n“If you are in communication with Khan, you must give us information on his whereabouts, citizen, or it will go poorly with you.”\nThe old man scoffed. The boy was not entirely sure it was prudent to scoff in the presence of so much firepower. “You still do not know Khan’s whereabouts? With the man right under your nose, and so many complex tracking systems in that khaki jalopy you are leaning against? For shame! Khan has a message for you. You must vacate the environs of this village, or as the appointed operator of the Guardian of this colony he will be obliged to make you quit by main force.”\nThe spokesman crossed both hands over his rifle and said: “Your Guardian’s operator is taking sides unjustifiedly in a purely civil matter, citizen. This is not a military matter. For this reason, Beauchef and Grisnez Incorporated regrets that, on behalf of its clients, it is forced to take action to eliminate this unruly operator, and that this action will continue until he himself quits the village. We are also making initial seismic surveys preliminary to placing charges underneath the Guardian’s foundations, destroying the underground geegaws that charge it. Beauchef and Grisnez of course regret the damage to Commonwealth property concomitant to this strategy, but final blame for this unfortunate state of affairs must lie at the head of the operator concerned. That is our message, which you may convey to Khan.”\nThe old man stood facing the line of soldiers silently for several seconds.\n“Very well,” he said. “Despite the fact that you behave like barbarians, you continue to describe yourselves as Commonwealth citizens and hence merit a warning in law; you have received that warning. Whatever consequences follow, Khan will not be answerable.”\nHe said nothing more, but turned and trudged back in the direction of the village. There were sniggers from the line of riflemen.\nIn the morning, the boy’s mother woke him well before dawn. She had already prepared sleeping gear for all of them, together with food she had irradiated that same morning. It would keep for a month, as well as making the boy’s stomach turn when he ate it. This was the sort of food City people had to eat.\n“But aren’t we staying to defend the village?”\nHe got a slap for that one. Mother was in no mood to talk. She was crying softly as she walked round the rooms of the habitat, picking things up, putting things down, and the boy realized suddenly that she was deciding which of the pieces of her life she was going to take with her and which she was going to leave behind forever. He threw his arms around her, and this time she did not slap him.\n“Go out and fetch the old one,” she said. “Where is he? I’ve prepared the conveyor. We have to leave.”\nThe boy told his mother that the old man had said he was going to do his exercises, and that, on this particular morning, the boy was not allowed to accompany him.\nThe boy’s mother’s eyes flew open in horror. She looked out of the window, which showed sand billowing down a dusty street.\nShe stood still a moment, as though paralyzed. Then she grabbed his arm.\n“Come with me.”\nThey walked out to the edge of the village. The village was small. It was not a long walk. Out there at the very edge of the sun farms, beyond a hectare or so of jet-black solar collectors, the wrecked battle machines of the Barbarians sat rusting in the sand.\nWhat are Barbarians? the boy had asked his teacher once in class. And the answer had been quick and pat. Why, people from outside the Commonwealth, of course. Any people from outside the Commonwealth.\nThe machines sat at what the boy knew to have been the extreme limit of the Guardian’s target acquisition range, sixty years ago.\nOf the old man, there was no sign.\n“Stupid old fool,” said mother, and pulled the boy off down the village streets again. She seemed to know where she was going. Only two streets, two rows of gleaming aluminum habitats, and the old man came into view. Standing in the square at the Guardian’s habitat-sized feet, he was arguing with a pair of Consultancy men, armored troopers holding guns that could track the electrical emissions of a man’s heartbeat in the dark and shoot him dead through steel. He was carrying a sword.\n“But I always do my exercises in the square at this time,” the old man was saying, which was a lie.\n“You are carrying a weapon, grandfather,” said one of the Consultants gently, “which I am forced to regard as a potential threat, despite your advanced years.”\nThe old man looked from hand to hand, then finally held up the sword as if he had only just realized it was there. “This? Why, but this is only an old sword-shaped piece of aluminum It cannot even be made to take an edge.”\n“All the same,” said the Consultant persuasively, “out of deference to the tense situation in which we find ourselves, it would be safer if—”\n“HOI!”\nThe shout broke the polite silence in the town square. Five heads turned towards it. As the sun heaved its head over the southern horizon, a figure staggered into town out of the desert. It waved its arms.\n“HOI! It’s me, Khan! Khan, the man you’re looking for! Catch me if you can!”\nGuns rose instantaneously to shoulders. Khan dived for cover. How useful that cover was was debatable, as a line of projectile explosions stitched its way across the wall of the nearest habitat like a finger tearing through tinfoil. When the guns had finished tracking across the building, the building was two buildings, one balanced precariously on top of the other, radiator coolant gushing from the walls and electrical connections sparking. Hopefully no-one was sitting headless at breakfast within it. The Consultancy men were already spreading out round the habitat, hoping to outflank their target if he had somehow survived the first attack. The boy’s mother looked on, appalled.\nSome caprice, however, drew the boy’s attention upward.\nThe old man was on the inside leg of the metal colossus, on the access ladder, moving with dinosaurian slowness towards the Guardian’s bumward access hatch.\nThe boy’s jaw dropped.\nMeanwhile, the men who were guarding the Guardian seemed on the point of following Khan and finishing him, until one of them remembered his orders, waved his comrade back to the square, pulled a communicator from one of his ammunition pouches, opened it, spoke into it, and flipped it shut again. Someone Else, he told his comrade, Could Do The Running. Up above, the old man was still moving, but with the speed of evolution, at the speed glass flowed down windowpanes, at the speed boys grew up doorposts. He had not even reached the knee. Surely, before the old fool reached the top of his climb, somebody in the village underneath had to notice? And what did he think he’d accomplish, if he once got up the ladder?\nThe two Consultants reassumed their positions underneath the Guardian’s treads. They stood on the square of concrete, reaching all the way down through the regolith to the bedrock, that had been put there solely as a foundation for the vehicle to stand on. They faced outwards, willing to bleed good red blood to stop anyone who tried to get past them. One of them even remarked on the old man’s sword discarded in the sand, saying that they Must Have Frit The Old Coot Away. Meanwhile, by pretending to scratch his eye against the dust, the boy was able to see, far above, the old coot pulling an battered slab of black plastic from his tunic and sliding it into what the boy knew, from the climb he had been dared to do a year ago, to be a recess in the circular ass-end access hatch about the same size as the slab. The hatch was also spraypainted with the letters AUGMENTED INFANTRY UNIT MK 73 (1 OFF), and only members of the privileged club of boys who had taken the dare and made the climb knew it.\nSomething glittered like a rack of unsheathed blades in the Guardian’s normally dull and pitted skin; the old man skimmed his fingers over the glitter rapidly, and the boy saw blood ooze out of his fingers onto the hatch cover momentarily, before the surface drank it like a vampire.\nThe key was tuned to the operator’s genetic code. The vehicle had to have a part of him to know who he was.\nThe hatch slid into the structure, silently. The old man began to slip into the hole it had opened. But for all the wondrous silence of the mechanism, the old man was by now unable to prevent the boy’s mother from standing with her head in the air gawping like a new-hatched chick waiting to be fed worms. And as she gawped, the guards gawped with her.\nLuckily for the old man, the guards also took a couple of moments to do helpless baby chick impersonations before remembering they had weapons and were supposed to use them. The hatch had slid shut before they could get their guns to their shoulders, take aim and fire. They were not used to firing their weapons in that position, and the recoil, coming from an unaccustomed direction, blew them about on the spot like unattended pneumatic drills. The boy saw stars twinkle on the Guardian’s hide. He was not sure whether they had inflicted any damage or not; the detonations left a mass of after-images on his retinas.\nThe two men could not have inflicted too much damage, however, as they thought better of continuing to shoot, and instead stood back and contemplated the crotch of the colossus.\nFor one long minute, nothing happened. The lead Consultant spoke quietly but urgently into his communicator, saying that he Wasn’t Quite Sure Whether Or Not The Shit Indicator Had Just Risen to Nostril Deep.\nThen the dust under the left tread of the Guardian moaned like a man being put to the press. The boy looked up to see the great pipe legs of the Augmented Infantry Unit buckling and twisting, as if the wind were blowing it off its base. But Guardians weighed so much they smashed themselves if they fell over, the boy knew; and despite the fact that the dry season wind howled down from the mountains here like a katabatic banshee, it had never stirred the Guardian as much as a millimeter from its post.\nThe Guardian was moving under its own power.\nHuge alloy arms the weight of bridge spans swung over the boy’s head. Knee joints that could have acted as railway turntables flexed arthritically in the legs. And at that point, the boy knew exactly who was at the controls of the Guardian.\nThe whole colossal thousand-tonne weapon was doing the old man’s morning exercises. Moving gently at first, swinging its arms and legs under their own weight, cautiously bending and unbending its ancient joints. Some of those joints screamed with the pressure of the merest movement. The boy suddenly, oddly, appreciated what the old man meant when he talked of rheumatism, arthritis and sciatica.\nThe old man’s exercises were good for a man with rheumatic joints who needed them oiling in the morning. But they were just as good for a village-sized automaton that had not moved for sixty standard years.\nThe men sent to guard the Guardian were backing away. From somewhere in the village on the other side of the buildings, meanwhile, someone else decided to fire at the machine. A pretty colored show of lights sprayed out of the ground and cascaded off the metal mountain’s armour. Habitats that the cascade hit on the way back down became colanders full of flying swarf. The Guardian carried on its warm-up regardless.\nEight times for the leg-stretching exercise—eight times for the arm-swinging—eight times for the two-handed push up above the head—\nThe boy began to back away, and pulling at his mother’s robe. He knew what was coming next.\nMen ran out of the buildings with light anti-armour weapons. Many of the weapons were recoilless, and some argument ensued about whether they should really be pointed up into the sky or not. Some of them were loosed off at point blank range at the Guardian’s treads, leaving big black stains of burnt hydrocarbon. But a Guardian’s feet were among its most heavily armored parts. Every old person in town would tell you that. They were heavily armored because they were used to crush infantry.\nThe Guardian lowered its massive head to stare at the situation on the ground. The operator, the boy knew, was actually in the main chassis, and the head was only used to affix target acquisition systems and armament. That small movement of the head was in itself enough to make the Consultants back away and run.\nOne of the Consultants, thinking smarter than his colleagues, grabbed hold of the boy’s mother, shouting at the sky and pointing a pistol shakily at her head. He might as well have threatened a mountain.\nThe Guardian turned its head to look directly at him.\nThe boy screamed to his mother to drop down.\nThe Guardian’s hand came down like the Red Sea on an Egyptian. Or, the boy pondered, like a sword upon a melon. Unlike a human hand, it had three fingers, which might be more properly described as claws. Exactly the same disposition of fingers a man might have, in fact, if a man held his middle finger and forefinger, and his little and ring finger, together, and spread the two groups of fingers apart. A roof of steel slammed down from heaven. The boy felt warm blood spray over his back.\nThen the sunlight returned to the sand, though the sand was now red rather than brown, and the gunman’s headless body toppled to the ground in front of him. The man had not simply been decapitated. His head no longer existed. It had been squashed flat.\nBeside him, his mother, still alive, was trembling. Looking at the front of her skirts, the boy realized suddenly that she had wet herself.\nOne of the Guardian’s massive treads rose from the ground and whined over his head. For some reason the sole of its left foot was stenciled LEFT LEG, and that on its right foot was labeled RIGHT LEG. Arms fire both small and large whined and caromed off its carapace; the Guardian ignored it. It was moving out of the village, eastward, in the direction of the mining company army camped beyond the outskirts. Soon it was out of shooting range, but the boy could still hear guns going off around him. Single shot firearms! The villagers had brought out their antique home defense weapons and were using them on their oppressors. The boy swelled with pride.\nDespite the fact that she had clearly wet herself, the boy’s mother hauled herself to her feet, and remarked:\n“The old fool! What does he think he’s doing? At his age!”\nThe boy hopped up onto a ladder fixed to the main water tower. The Guardian was striding eastward like a force of nature, silhouetted by things exploding against it. The boy saw it pick a thing up from the ground, and hurl it like a discus. The thing was a light armored vehicle. He saw men tumble from it as it flew.\nThe mining company men were now flocking round a larger vehicle that was evidently their Big Gun. Most probably it had been brought in specially to deal with the possibility that the villagers might be able to revive their Guardian. It appeared to be a form of missile launcher, and the missile it fired looked frighteningly large. The turret on the top of the vehicle was being rotated round to bear on the approaching threat, and men were clearing from the danger space behind it.\nThe Guardian had stopped. Its hand was held before it, the elbow crooked, extended out towards the launcher. If had it been human, the boy would have described the posture it had now moved into as a defensive stance.\nThe boy blinked.\nNo. Surely not—\nThe missile blazed from its mounting, and then became invisible; and the Guardian’s arm blurred with it.\nThen the missile was tumbling away into the sky, its gyros trying frantically to put it back on course, wobbling unsteadily overhead; and the Guardian was standing in exactly the same position as before. A streak of rocket exhaust had licked up its arm and blackened its fingers.\nThe Guardian had brushed aside the missile in mid-air, so softly as not to detonate its fuse.\nMen in the mining company launcher were standing staring motionless, as if their own operators had left them via their back entrances. The boy, however, suspected that other substances were currently leaving them by that exit; and as soon as the Guardian cranked into a forward stride again, the men began to run. By the time the Guardian eventually arrived at the launcher and methodically and thoroughly destroyed it, the boy was quite certain there were no human beings inside it. To the east of the village, he heard the terrific impact of the anti-armour missile eventually reaching its maximum range and aborting.\nThen there was nothing on the face of the desert but running men, and smoking metal, and the gigantic figure of the Guardian standing casting a long, long shadow in the dawn.\nThe old man climbed down slowly, with painstaking exactness, just as he did in all things. He was breathing quite heavily by the time he swung off the last rung and into a crowd of cheering children.\n“I knew Khan would not let us down,” said Mother Tho.\n“Khan Senior is a terrible fruit farmer,” observed Father Magnusson, “but a Guardian operator without equal.”\n“His oranges are scabby-skinned and dry inside,” agreed Mother Dingiswayo.\n“All the same, I knew,” opined Mother Jayaraman, “that he would eventually come in useful for something.”\nThe old man shook his fist at the boy’s father in mock rage. “Khan Junior! What a fool to expose yourself so! Do you want your family to grow up without a father?”\nKhan grinned. “I am sorry, father. I have no idea what came over me.”\n“Maybe it is a hereditary condition,” muttered the boy’s mother.\n“Well,” said the old man, “at least it has turned out for the best. Had you not jumped out when you did, I might not have made it to the access ladder. One might almost imagine that that was your deliberate intention.”\n“I apologize if I did badly, father,” said Khan. “I am more of a farmer by trade.”\nThe old man walked across the square, to a handcart one of the younger boys had led out. In a fit of patriotic Commonwealther fervor, Father Magnusson had donated a hundred kilos of potatoes for a celebration, and they had been stacked in a neat pile ready for baking.\nThe old man picked one up, raw, and bit into it.\n“Never apologize for being a farmer,” said the old man, chewing gamely for a man with few remaining teeth. “After all, a gun will protect your family’s life only once in a lifetime. But a potato,” he said, gesturing with the tuber to illustrate his point, “is useful every day.”\nOriginally published in The Solaris Book of New Science Fiction: Volume Two, edited by George Mann.\nDominic Green was born some time ago. He remembers when telephones were attached to the wall with cables. As a child, he was lied to by magazines that told him he would be living on the Moon in the year 2000 wearing silver rocket boots. People have been publishing science fiction by him since 1996, ha! The fools. In 2006, he was nominated for a Hugo Award for his story, \"The Clockwork Atom Bomb.\" Nowadays, he writes children's science fiction ebooks (in particular the six-book Ant and Cleo series, available on Amazon). He is married with three cats and a seventeen-week-old Newfoundland puppy who greatly resembles a cartoon bear."}