{"fingerprint": "eXw0SbCzwNZl25hdmghius0H+14=", "sitename": "Clarkesworld Magazine", "title": "The Illustrated Biography of Lord Grimm by Daryl Gregory", "author": "Daryl Gregory", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gregory_07_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Illustrated Biography of Lord Grimm by Daryl Gregory", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8090 words, novelette, REPRINT\n The Illustrated Biography of Lord Grimm\n The 22nd Invasion of Trovenia began with a streak of scarlet against a gray sky fast as the flick of a paintbrush. The red blur zipped across the length of the island, moving west to east, and shot out to sea. The sonic boom a moment later scattered the birds that wheeled above the fish processing plant and sent them squealing and plummeting.\n Elena said, “Was that—it was, wasn’t it?”\n “You’ve never seen a U-Man, Elena?” Jürgo said.\n “Not in person.” At nineteen, Elena Pendareva was the youngest of the crew by at least two decades, and the only female. She and the other five members of the heavy plate welding unit were perched 110 meters in the air, taking their lunch upon the great steel shoulder of the Slaybot Prime. The giant robot, latest in a long series of ultimate weapons, was unfinished, its unpainted skin speckled with bird shit, its chest turrets empty, the open dome of its head covered only by a tarp.\n It had been Jürgo’s idea to ride up the gantry for lunch. They had plenty of time: for the fifth day in a row, steel plate for the Slaybot’s skin had failed to arrive from the foundry, and the welding crew had nothing to do but clean their equipment and play cards until the guards let them go home.\n It was a good day for a picnic. An unseasonably warm spring wind blew in from the docks, carrying the smell of the sea only slightly tainted by odors of diesel fuel and fish guts. From the giant’s shoulder the crew looked down on the entire capital, from the port and industrial sector below them, to the old city in the west and the rows of gray apartment buildings rising up beyond. The only structures higher than their perch were Castle Grimm’s black spires, carved out of the sides of Mount Kriegstahl, and the peak of the mountain itself.\n “You know what you must do, Elena,” Verner said with mock sincerity. He was the oldest in the group, a veteran mechaneer whose body was more metal than flesh. “Your first übermensch, you must make a wish.”\n Elena said, “Is ‘Oh shit,’ a wish?”\n Verner pivoted on his rubber-tipped stump to follow her gaze. The figure in red had turned about over the eastern sea, and was streaking back toward the island. Sunlight glinted on something long and metallic in its hands.\n The UM dove straight toward them.\n There was nowhere to hide. The crew sat on a naked shelf of metal between the gantry and the sheer profile of the robot’s head. Elena threw herself flat and spread her arms on the metal surface, willing herself to stick.\n Nobody else moved. Maybe because they were old men, or maybe because they were all veterans, former zoomandos and mechaneers and castle guards. They’d seen dozens of U-Men, fought them even. Elena didn’t know if they were unafraid or simply too old to care much for their skin.\n The UM shot past with a whoosh, making the steel shiver beneath her. She looked up in time to take in a flash of metal, a crimson cape, black boots—and then the figure crashed through the wall of Castle Grimm. Masonry and dust exploded into the air.\n “Lunch break,” Jürgo said in his Estonian accent, “is over.”\n Toolboxes slammed, paper sacks took to the wind. Elena got to her feet. Jürgo picked up his lunch pail with one clawed foot, spread his patchy, soot-stained wings, and leaned over the side, considering. His arms and neck were skinny as always, but in the past few years he’d grown a beer gut.\n Elena said, “Jürgo, can you still fly?”\n “Of course,” he said. He hooked his pail to his belt and backed away from the edge. “However, I don’t believe I’m authorized for this air space.”\n The rest of the crew had already crowded into the gantry elevator. Elena and Jürgo pressed inside and the cage began to slowly descend, rattling and shrieking.\n “What’s it about this time, you think?” Verner said, clockwork lungs wheezing. “Old Rivet Head kidnap one of their women?” Only the oldest veterans could get away with insulting Lord Grimm in mixed company. Verner had survived at least four invasions that she knew of. His loyalty to Trovenia was assumed to go beyond patriotism into something like ownership.\n Guntis, a gray, pebble-skinned amphibian of Latvian descent, said, “I fought this girlie with a sword once, Energy Lady—”\n “Power Woman,” Elena said in English. She’d read the Illustrated Biography of Lord Grimm to her little brother dozens of times before he learned to read it himself. The Lord’s most significant adversaries were all listed in the appendix, in multiple languages.\n “That’s the one, Par-wer Woh-man,” Guntis said, imitating her. “She had enormous—”\n “Abilities,” Jürgo said pointedly. Jürgo had been a friend of Elena’s father, and often played the protective uncle.\n “I think he meant to say ‘tits’,” Elena said. Several of the men laughed.\n “No! Jürgo is right,” Guntis said. “They were more than breasts. They had abilities. I think one of them spoke to me.”\n The elevator clanged down on the concrete pad and the crew followed Jürgo into the long shed of the 3000 line. The factory floor was emptying. Workers pulled on coats, joking and laughing as if it were a holiday.\n Jürgo pulled aside a man and asked him what was going on. “The guards have run away!” the man said happily. “Off to fight the übermensch!”\n “So what’s it going to be, boss?” Guntis said. “Stay or go?”\n Jürgo scratched at the cement floor, thinking. Half-assembled Slaybot 3000’s, five-meter-tall cousins to the colossal Prime, dangled from hooks all along the assembly line, wires spilling from their chests, legs missing. The factory was well behind its quota for the month. As well as for the quarter, year, and five-year mark. Circuit boards and batteries were in particularly short supply, but tools and equipment vanished daily. Especially scarce were acetylene tanks, a home-heating accessory for the very cold, the very stupid, or both.\n Jürgo finally shook his feathered head and said, “Nothing we can do here. Let’s go home and hide under our beds.”\n “And in our bottles,” Verner said.\n Elena waved good-bye and walked toward the women’s changing rooms to empty her locker.\n A block from her apartment she heard Mr. Bojars singing out, “Guh-RATE day for sausa-JEZ! Izza GREAT day for SAW-sages!” The mechaneer veteran was parked at his permanent spot at the corner of Glorious Victory Street and Infinite Progress Avenue, in the shadow of the statue of Grimm Triumphant. He saw her crossing the intersection and shouted, “My beautiful Elena! A fat bratwurst to go with that bread, maybe. Perfect for a celebration!”\n “No thank you, Mr. Bojars.” She hoisted the bag of groceries onto her hip and shuffled the welder’s helmet to her other arm. “You know we’ve been invaded, don’t you?”\n The man laughed heartily. “The trap is sprung! The crab is in the basket!” He wore the same clothes he wore every day, a black nylon ski hat and a green, grease-stained parka decorated at the breast with three medals from his years in the motorized cavalry. The coat hung down to cover where his flesh ended and his motorcycle body began.\n “Don’t you worry about Lord Grimm,” he said. “He can handle any American muscle-head stupid enough to enter his lair. Especially the Red Meteor.”\n “It was Most Excellent Man,” Elena said, using the Trovenian translation of his name. “I saw the Staff of Mightiness in his hand, or whatever he calls it.”\n “Even better! The man’s an idiot. A U-Moron.”\n “He’s defeated Lord Grimm several times,” Elena said. “So I hear.”\n “And Lord Grimm has been declared dead a dozen times! You can’t believe the underground newspapers, Elena. You’re not reading that trash are you?”\n “You know I’m not political, Mr. Bojars.”\n “Good for you. This Excellent Man, let me tell you something about—yes sir? Great day for a sausage.” He turned his attention to the customer and Elena quickly wished him luck and slipped away before he could begin another story.\n The small lobby of her apartment building smelled like burnt plastic and cooking grease. She climbed the cement stairs to the third floor. As usual the door to her apartment was wide open, as was the door to Mr. Fishman’s apartment across the hall. Staticky television laughter and applause carried down the hallway: It sounded like Mr. Sascha’s Celebrity Polka Fun-Time. Not even an invasion could pre-empt Mr. Sascha.\n She knocked on the frame of his door. “Mr. Fishman,” she called loudly. He’d never revealed his real name. “Mr. Fishman, would you like to come to dinner tonight?”\n There was no answer except for the blast of the television. She walked into the dim hallway and leaned around the corner. The living room was dark except for the glow of the TV. The little set was propped up on a wooden chair at the edge of a large cast iron bathtub, the light from its screen reflecting off the smooth surface of the water. “Mr. Fishman? Did you hear me?” She walked across the room, shoes crinkling on the plastic tarp that covered the floor, and switched off the TV.\n The surface of the water shimmied. A lumpy head rose up out of the water, followed by a pair of dark eyes, a flap of nose, and a wide carp mouth.\n “I was watching that,” the zooman said.\n “Some day you’re going to pull that thing into the tub and electrocute yourself,” Elena said.\n He exhaled, making a rude noise through rubbery lips.\n “We’re having dinner,” Elena said. She turned on a lamp. Long ago Mr. Fishman had pushed all the furniture to the edge of the room to make room for his easels. She didn’t see any new canvasses upon them, but there was an empty liquor bottle on the floor next to the tub. “Would you like to join us?”\n He eyed the bag in her arms. “That wouldn’t be, umm, fresh catch?”\n “It is, as a matter of fact.”\n “I suppose I could stop by.” His head sank below the surface.\n In Elena’s own apartment, Grandmother Zita smoked and rocked in front of the window, while Mattias, nine years old, sat at the table with his shoe box of colored pencils and several gray pages crammed with drawings. “Elena, did you hear?” Matti asked. “A U-Man flew over the island! They canceled school!”\n “It’s nothing to be happy about,” Elena said. She rubbed the top of her brother’s head. The page showed a robot of Matti’s own design marching toward a hyper-muscled man in a red cape. In the background was a huge, lumpy monster with triangle eyes—an escaped MoG, she supposed.\n “The last time the U-men came,” Grandmother Zita said, “more than robots lost their heads. This family knows that better than most. When your mother—”\n “Let’s not talk politics, Grandmother.” She kissed the old woman on the cheek, then reached past her to crank open the window—she’d told the woman to let in some air when she smoked in front of Matti, to no avail. Outside, sirens wailed.\n Elena had been only eleven years old during the last invasion. She’d slept through most of it, and when she woke to sirens that morning the apartment was cold and the lights didn’t work. Her parents were government geneticists—there was no other kind—and often were called away at odd hours. Her mother had left her a note asking her to feed Baby Matti and please stay indoors. Elena made oatmeal, the first of many breakfasts she would make for her little brother. Only after her parents failed to come home did she realize that the note was a kind of battlefield promotion to adulthood: impossible to refuse because there was no one left to accept her refusal.\n Mr. Fishman, in his blue bathrobe and striped pajama pants, arrived a half hour later, his great webbed feet slapping the floor. He sat at the table and argued with Grandmother Zita about which of the twenty-one previous invasions was most violent. There was a time in the 1960’s and seventies when their little country seemed to be under attack every other month. Matti listened raptly.\n Elena had just brought the fried whitefish to the table when the thumping march playing on the radio suddenly cut off. An announcer said, “Please stand by for an important message from His Royal Majesty, the Guardian of our Shores, the Scourge of Fascism, Professor General of the Royal Academy of Sciences, the Savior of Trovenia—”\n Mr. Fishman pointed at Matti. “Boy, get my television!” Matti dashed to the man’s apartment and Elena cleared a spot on the table.\n After Mr. Fishman fiddled with the antenna the screen suddenly cleared, showing a large room decorated in Early 1400’s: stone floors, flickering torches, and dulled tapestries on the walls. The only piece of furniture was a huge oaken chair reinforced at the joints with plates and rivets.\n A figure appeared at the far end of the room and strode toward the camera.\n “He’s still alive then,” Grandmother said. Lord Grimm didn’t appear on live television more than once or twice a year.\n Matti said, “Oh, look at him.”\n Lord Grimm wore the traditional black and green cape of Trovenian nobility, which contrasted nicely with the polished suit of armor. His faceplate, hawk-nosed and heavily riveted, suggested simultaneously the prow of a battleship and the beak of the Baltic albatross, the Trovenian national bird.\n Elena had to admit he cut a dramatic figure. She almost felt sorry for people in other countries whose leaders all looked like postal inspectors. You could no more imagine those timid, pinch-faced bureaucrats leading troops into battle than you could imagine Lord Grimm ice skating.\n “Sons and daughters of Trovenia,” the leader intoned. His deep voice was charged with metallic echoes. “We have been invaded.”\n “We knew that already,” Grandmother said, and Mr. Fishman shushed her.\n “Once again, an American super power has violated our sovereignty. With typical, misguided arrogance, a so-called übermensch has trespassed upon our borders, destroy our property . . . ” The litany of crimes went on for some time.\n “Look! The U-Man!” Matti said.\n On screen, castle guards carried in a red-clad figure and dumped him in the huge chair. His head lolled. Lord Grimm lifted the prisoner’s chin to show his bloody face to the camera. One eye was half open, the other swelled shut. “As you can see, he is completely powerless.”\n Mr. Fishman grunted in disappointment.\n “What?” Matti asked.\n “Again with the captives, and the taunting,” Grandmother said.\n “Why not? They invaded us!”\n Mr. Fishman grimaced, and his gills flapped shut.\n “If Lord Grimm simply beat up Most Excellent Man and sent him packing, that would be one thing,” Grandmother said. “Or even if he just promised to stop doing what he was doing for a couple of months until they forgot about him, then—”\n “Then we’d all go back to our business,” Mr. Fishman said.\n Grandmother said, “But no, he’s got to keep him captive. Now it’s going to be just like 1972.”\n “And seventy-five,” Mr. Fishman said. He sawed into his whitefish. “And eighty-three.”\n Elena snapped off the television. “Matti, go pack your school bag with clothes. Now.”\n “What? Why?”\n “We’re spending the night in the basement. You too, Grandmother.”\n “But I haven’t finished my supper!”\n “I’ll wrap it up for you. Mr. Fishman, I can help you down the stairs if you like.”\n “Pah,” he said. “I’m going back to bed. Wake me when the war’s over.”\n A dozen or so residents of the building had gotten the same idea. For several hours the group sat on boxes and old furniture in the damp basement under stuttering fluorescent lights, listening to the distant roar of jets, the rumble of mechaneer tanks, and the bass-drum stomps of Slaybot 3000s marching into position.\n Grandmother Zita had claimed the best seat in the room, a ripped vinyl armchair. Matti had fallen asleep across her lap, still clutching the Illustrated Biography of Lord Grimm. The boy was so comfortable with her. Zita wasn’t even a relative, but she’d watched over the boy since he was a toddler and so became his grandmother—another wartime employment opportunity. Elena slipped the book from under Matti’s arms and bent to put it into his school bag.\n Zita lit another cigarette. “How do you suppose it really started?” she said.\n “What, the war?” Elena asked.\n “No, the first time.” She nodded at Matti’s book. “Hating the Americans, okay, no problem. But why the scary mask, the cape?”\n Elena pretended to sort out the contents of the bag.\n “What possesses a person to do that?” Zita said, undeterred. “Wake up one day and say, Today I will put a bucket over my head. Today I declare war on all U-Men. Today I become, what’s the English . . . ”\n “Grandmother, please,” Elena said, keeping her voice low.\n “A super villain,” Zita said.\n A couple of the nearest people looked away in embarrassment. Mr. Rimkis, an old man from the fourth floor, glared at Grandmother down the length of his gray-bristled snout. He was a veteran with one long tusk and the other snapped off at the base. He claimed to have suffered the injury fighting the U-Men, though others said he’d lost the tusk in combat with vodka and gravity: The Battle of the Pub Stairs.\n “He is the hero,” Mr. Rimkis said. “Not these imperialists in long underwear. They invaded his country, attacked his family, maimed him and left him with—”\n “Oh please,” Grandmother said. “Every villain believes himself to be a hero.”\n The last few words were nearly drowned out by the sudden wail of an air raid siren. Matti jerked awake and Zita automatically put a hand to his sweat-dampened forehead. The residents stared up at the ceiling. Soon there was a chorus of sirens.\n They’ve come, Elena thought, as everyone knew they would, to rescue their comrade.\n From somewhere in the distance came a steady thump, thump that vibrated the ground and made the basement’s bare cinderblock walls chuff dust into the air. Each explosion seemed louder and closer. Between the explosions, slaybot auto-cannons whined and chattered.\n Someone said, “Everybody just remain calm—”\n The floor seemed to jump beneath their feet. Elena lost her balance and smacked into the cement on her side. At the same moment she was deafened by a noise louder than her ears could process.\n The lights had gone out. Elena rolled over, eyes straining, but she couldn’t make out Grandmother or Matti or anyone. She shouted but barely heard her own voice above the ringing in her ears.\n Someone behind her switched on an electric torch and flicked it around the room. Most of the basement seemed to have filled with rubble.\n Elena crawled toward where she thought Grandmother’s chair had been and was stopped by a pile of cement and splintered wood. She called Matti’s name and began to push the debris out of the way.\n Someone grabbed her foot, and then Matti fell into her, hugged her fiercely. Somehow he’d been thrown behind her, over her. She called for a light, but the torch was aimed now at a pair of men attempting to clear the stairway. Elena took Matti’s hand and led him cautiously toward the light. Pebbles fell on them; the building seemed to shift and groan. Somewhere a woman cried out, her voice muffled.\n “Grandmother Zita,” Matti said.\n Elena was grateful that she could hear him. “I’ll come back for Grandmother,” she said, though she didn’t know for sure if it had been Zita’s voice. “First you.”\n The two men had cleared a passage to the outside. One of them boosted the other to where he could crawl out. The freed man then reached back and Elena lifted Matti to him. The boy’s jacket snagged on a length of rebar, and the boy yelped. After what seemed like minutes of tugging and shouting the coat finally ripped free.\n “Stay there, Mattias!” Elena called. “Don’t move!” She turned to assist the next person in line to climb out, an old woman from the sixth floor. She carried an enormous wicker basket which she refused to relinquish. Elena promised repeatedly that the basket would be the first thing to come out after her. The others in the basement began to shout at the old woman, which only made her grip the handle more fiercely. Elena was considering prying her fingers from it when a yellow flash illuminated the passage. People outside screamed.\n Elena scrambled up and out without being conscious of how she managed it. The street lights had gone out but the gray sky flickered with strange lights. A small crowd of dazed citizens sat or lay sprawled across the rubble-strewn street, as if a bomb had gone off. The man who’d pulled Matti out of the basement sat on the ground, holding his hands to his face and moaning.\n The sky was full of flying men.\n Searchlights panned from a dozen points around the city, and clouds pulsed with exotic energies. In that spasmodic light dozens of tiny figures darted: caped invaders, squadrons of Royal Air Dragoons riding pinpricks of fire, winged zoomandos, glowing U-Men leaving iridescent fairy trails. Beams of energy flicked from horizon to horizon; soldiers ignited and dropped like dollops of burning wax.\n Elena looked around wildly for her brother. Rubble was everywhere. The front of her apartment building had been sheared off, exposing bedrooms and bathrooms. Protruding girders bent toward the ground like tongues.\n Finally she saw the boy. He sat on the ground, staring at the sky. Elena ran to him, calling his name. He looked in her direction. His eyes were wide, unseeing.\n She knelt down in front of him.\n “I looked at straight at him,” Matti said. “He flew right over our heads. He was so bright. So bright.”\n There was something wrong with Matti’s face. In the inconstant light she could only tell that his skin was darker than it should have been.\n “Take my hand,” Elena said. “Can you stand up? Good. Good. How do you feel?”\n “My face feels hot,” he said. Then, “Is Grandmother out yet?”\n Elena didn’t answer. She led him around the piles of debris. Once she had to yank him sideways and he yelped. “Something in our way,” she said. A half-buried figure lay with one arm and one leg jutting into the street. The body would have been unrecognizable if not for the blue-striped pajamas and the webbing between the toes of the bare foot.\n Matti wrenched his hand from her grip. “Where are we going? You have to tell me where we’re going.”\n She had no idea. She’d thought they’d be safe in the basement. She’d thought it would be like the invasions everyone talked about, a handful of U-Men—a super team—storming the castle. No one told her there could be an army of them. The entire city had become the battleground.\n “Out of the city,” she said. “Into the country.”\n “But Grandmother—”\n “I promise I’ll come back for Grandmother Zita,” she said.\n “And my book,” he said. “It’s still in the basement.”\n All along Infinite Progress Avenue, families spilled out of buildings carrying bundles of clothes and plastic jugs, pushing wheelchairs and shopping carts loaded with canned food, TV sets, photo albums. Elena grabbed tight to Matti’s arm and joined the exodus north.\n After an hour they’d covered only ten blocks. The street had narrowed as they left the residential district, condensing the stream of people into a herd, then a single shuffling animal. Explosions and gunfire continued to sound from behind them and the sky still flashed with parti-colored lightning, but hardly anyone glanced back.\n The surrounding bodies provided Elena and Matti with some protection against the cold, though frigid channels of night air randomly opened through the crowd. Matti’s vision still hadn’t returned; he saw nothing but the yellow light of the U-Man. He told her his skin still felt hot, but he trembled as if he were cold. Once he stopped suddenly and threw up into the street. The crowd behind bumped into them, forcing them to keep moving.\n One of their fellow refugees gave Matti a blanket. He pulled it onto his shoulders like a cape but it kept slipping as he walked, tripping him up. The boy hadn’t cried since they’d started walking, hadn’t complained—he’d even stopped asking about Grandmother Zita—but Elena still couldn’t stop herself from being annoyed at him. He stumbled again and she yanked the blanket from him. “For God’s sake, Mattias,” she said. “If you can’t hold onto it—” She drew up short. The black-coated women in front of them had suddenly stopped.\n Shouts went up from somewhere ahead, and then the crowd surged backward. Elena recognized the escalating whine of an auto-cannon coming up to speed.\n Elena pulled Matti up onto her chest and he yelped in surprise or pain. The boy was heavy and awkward; she locked her hands under his butt and shoved toward the crowd’s edge, aiming for the mouth of an alley. The crowd buffeted her, knocked her off course. She came up hard against the plate glass window of a shop.\n A Slaybot 3000 lumbered through the crowd, knocking people aside. Its gun arm, a huge thing like a barrel of steel pipes, jerked from figure to figure, targeting automatically. A uniformed technician sat in the jumpseat on the robot’s back, gesturing frantically and shouting, “Out of the way! Out of the way!” It was impossible to tell whether he’d lost control or was deliberately marching through the crowd.\n The mass of figures had almost certainly overwhelmed the robot’s vision and recognition processors. The 3000 model, like its predecessors, had difficulty telling friend from foe even in the spare environment of the factory QA room.\n The gun arm pivoted toward her: six black mouths. Then the carousel began to spin and the six barrels blurred, became one vast maw.\n Elena felt her gut go cold. She would have sunk to the ground—she wanted desperately to disappear—but the mob held her upright, pinned. She twisted to place at least part of her body between the robot and Matti. The glass at her shoulder trembled, began to bow.\n For a moment she saw both sides of the glass. Inside the dimly lit shop were two rows of blank white faces, a choir of eyeless women regarding her. And in the window’s reflection she saw her own face, and above that, a streak of light like a falling star. The UM flew toward them from the west, moving incredibly fast.\n The robot’s gun fired even as it flicked upward to acquire the new target.\n The glass shattered. The mass of people on the street beside her seemed to disintegrate into blood and cloth tatters. A moment later she registered the sound of the gun, a thunderous ba-rap! The crowd pulsed away from her, releasing its pressure, and she collapsed to the ground.\n The slaybot broke into a clumsy stomping run, its gun ripping at the air.\n Matti had rolled away from her. Elena touched his shoulder, turned him over. His eyes were open, but unmoving, glassy.\n The air seemed to freeze. She couldn’t breathe, couldn’t move her hand from him.\n He blinked. Then he began to scream.\n Elena got to her knees. Her left hand was bloody and freckled with glass; her fingers glistened. Each movement triggered the prick of a thousand tiny needles. Matti screamed and screamed.\n “It’s okay, it’s okay,” she said. “I’m right here.”\n She talked to him for almost a minute before he calmed down enough to hear her and stop screaming.\n The window was gone, the shop door blown open. The window case was filled with foam heads on posts, some with wigs askew, others tipped over and bald. She got Matti to take her hand—her good hand—and led him through the doorway. She was thankful that he could not see the things they stepped over.\n Inside the scene was remarkably similar. Arms and legs of all sizes hung from straps on the walls. Trays of dentures sat out on the countertops. A score of heads sported hairstyles old-fashioned even by Trovenian standards. There were several such shops across the city. Decent business in a land of amputees.\n Elena’s face had begun to burn. She walked Matti through the dark, kicking aside prosthetic limbs, and found a tiny bathroom at the back of the shop. She pulled on the chain to the fluorescent light and was surprised when it flickered to life.\n This was her first good look at Matti’s face. The skin was bright red, puffy and raw looking—a second-degree burn at least.\n She guided the boy to the sink and helped him drink from the tap. It was the only thing she could think of to do for him. Then she helped him sit on the floor just outside the bathroom door.\n She could no longer avoid looking in the mirror.\n The shattering glass had turned half of her face into a speckled red mask. She ran her hands under the water, not daring to scrub, and then splashed water on her face. She dabbed at her cheek and jaw with the tail of her shirt but the blood continued to weep through a peppering of cuts. She looked like a cartoon in Matti’s Lord Grimm book, the coloring accomplished by tiny dots.\n She reached into jacket and took out the leather work gloves she’d stuffed there when she emptied her locker. She pulled one onto her wounded hand, stifling the urge to shout.\n “Hello?” Matti said.\n She turned, alarmed. Matti wasn’t talking to her. His face was turned toward the hallway.\n Elena stepped out. A few feet away were the base of a set of stairs that led up into the back of the building. A man stood at the first landing, pointing an ancient rifle at the boy. His jaw was flesh-toned plastic, held in place by an arrangement of leather straps and mechanical springs. A woman with outrageously golden hair stood higher on the stairs, leaning around the corner to look over the man’s shoulder.\n The man’s jaw clacked and he gestured with the gun. “Go. Get along,” he said. The syllables were distorted.\n “They’re hurt,” the wigged woman said.\n The man did not quite shake his head. Of course they’re hurt, he seemed to say. Everyone’s hurt. It’s the national condition.\n “We didn’t mean to break in,” Elena said. She held up her hands. “We’re going.” She glanced back into the showroom. Outside the smashed window, the street was still packed, and no one seemed to be moving.\n “The bridge is out,” the man said. He meant the Prince’s Bridge, the only paved bridge that crossed the river. No wonder then that the crowd was moving so slowly.\n “They’re taking the wounded to the mill,” the woman said. “Then trying to get them out of the city by the foot bridges.”\n “What mill?” Elena asked.\n The wigged woman wouldn’t take them herself, but she gave directions. “Go out the back,” she said.\n The millrace had dried out and the mill had been abandoned fifty years ago, but its musty, barn-like interior still smelled of grain. Its rooms were already crowded with injured soldiers and citizens.\n Elena found a spot for Matti on a bench inside the building and told him not to move. She went from room to room asking if anyone had aspirin, antibiotic cream, anything to help the boy. She soon stopped asking. There didn’t seem to be any doctors or nurses at the mill, only wounded people helping the more severely wounded, and no medicines to be found. This wasn’t a medical clinic, or even a triage center. It was a way station.\n She came back to find that Matti had fallen asleep on the gray-furred shoulder of a veteran zoomando. She told the man that if the boy woke up she would be outside helping unload the wounded. Every few minutes another farm truck pulled up and bleeding men and women stepped out or were passed down on litters. The emptied trucks rumbled south back into the heart city.\n The conversation in the mill traded in rumor and wild speculation. But what report could be disbelieved when it came to the U-Men? Fifty of them were attacking, or a hundred. Lord Grimm was both dead and still fighting on the battlements. The MoGs had escaped from the mines in the confusion.\n Like everyone else Elena quickly grew deaf to gunfire, explosions, crackling energy beams. Only when something erupted particularly close—a nearby building bursting into flame, or a terrordactyl careening out of control overhead—did the workers look up or pause in their conversation.\n At some point a woman in the red smock of the Gene Corps noticed that Elena’s cheek had started bleeding again. “It’s a wonder you didn’t lose an eye,” the scientist said, and gave her a wad of torn-up cloth to press to her face. “You need to get that cleaned up or it will scar.”\n Elena thanked her curtly and walked outside. The air was cold but felt good on her skin.\n She was still dabbing at her face when she heard the sputter of engines. An old mechaneer cavalryman, painted head to wheels in mud, rolled into the north end of the yard, followed by two of his wheeled brethren. Each of them was towing a narrow cart padded with blankets.\n The lead mechaneer didn’t notice Elena at first, or perhaps noticed her but didn’t recognize her. He suddenly said, “My beautiful Elena!” and puttered forward, dragging the squeaking cart after him. He put on a smile but couldn’t hold it.\n “Not so beautiful, Mr. Bojars.”\n The old man surveyed her face with alarm. “But you are all right?” he asked. “Is Mattias—?”\n “I’m fine. Matti is inside. He’s sick. I think he . . . .” She shook her head. “I see you’ve lost your sausage oven.”\n “A temporary substitution only, my dear.” The surviving members of his old unit had reunited, he told her matter-of-factly, to do what they could. In the hours since the Prince’s Bridge had been knocked out they’d been ferrying wounded across the river. A field hospital had been set up at the northern barracks of the city guard. The only ways across the river were the foot bridges and a few muddy low spots in the river. “We have no weapons,” Mr. Bojars said, “but we can still drive like demons.”\n Volunteers were already carrying out the people chosen to evacuate next, four men and two women who seemed barely alive. Each cart could carry only two persons at a time, laid head to foot. Elena helped secure them.\n “Mr. Bojars, does the hospital have anything for radiation poisoning?”\n “Radiation?” He looked shocked. “I don’t know, I suppose . . .\n One of the mechaneers waved to Mr. Bojars, and the two wheeled men began to roll out.\n Elena said, “Mr. Bojars—”\n “Get him,” he replied.\n Elena ran into mill, dodging pallets and bodies. She scooped up the sleeping boy, ignoring the pain in her hand, and carried him back outside. She could feel his body trembling in her arms.\n “I can’t find my book,” Matti said. He sounded feverish. “I think I lost it.”\n “Matti, you’re going with Mr. Bojars,” Elena said. “He’s going to take you someplace safe.”\n He seemed to wake up. He looked around, but it was obvious he still couldn’t see. “Elena, no! We have to get Grandmother!”\n “Matti, listen to me. You’re going across the river to the hospital. They have medicine. In the morning I’ll come get you.”\n “She’s still in the basement. She’s still there. You promised you would—”\n “Yes, I promise!” Elena said. “Now go with Mr. Bojars.”\n “Matti, my boy, we shall have such a ride!” the mechaneer said with forced good humor. He opened his big green parka and held out his arms.\n Matti released his grip on Elena. Mr. Bojars set the boy on the broad gas tank in front of him, then zipped up the jacket so that only Matti’s head was visible. “Now we look like a cybernetic kangaroo, hey Mattias?”\n “I’ll be there in the morning,” Elena said. She kissed Matti’s forehead, then kissed the old man’s cheek. He smelled of grilled onions and diesel. “I can’t thank you enough,” she said.\n Mr. Bojars circled an arm around Matti and revved his engine. “A kiss from you, my dear, is payment enough.”\n She watched them go. A few minutes later another truck arrived in the yard and she fell in line to help carry in the wounded. When the new arrivals were all inside and the stained litters had all been returned to the truck, Elena stayed out in the yard. The truck drivers, a pair of women in coveralls, leaned against the hood. The truck’s two-way radio played ocean noise: whooshing static mixed with high, panicked pleas like the cries of seagulls. The larger of the women took a last drag on her cigarette, tossed it into the yard, and then both of them climbed into the cab. A minute later the vehicle started and began to move.\n “Shit,” Elena said. She jogged after the truck for a few steps, then broke into a full run. She caught up to it as it reached the road. With her good hand she hauled herself up into the open bed.\n The driver slowed and leaned out her window. “We’re leaving now!” she shouted. “Going back in!”\n “So go!” Elena said.\n The driver shook her head. The truck lurched into second gear and rumbled south.\n As they rolled into the city proper it was impossible for Elena to tell where they would find the front line of the battle, or if there was a front line at all. Damage seemed to be distributed randomly. The truck would roll through a sleepy side street that was completely untouched, and twenty yards away the buildings would be cracked open, their contents shaken into the street.\n The drivers seemed to possess some sixth sense for knowing where the injured were waiting. The truck would slow and men and women would emerge from the dark and hobble toward the headlights of the truck, or call for a litter. Some people stood at street corners and waved them down as if flagging a bus. Elena helped the drivers lift the wounded into the back, and sometimes had to force them to leave their belongings.\n “Small boats,” the largest driver said over and over. A Trovenian saying: In a storm, all boats are too small.\n Eventually she found herself crouched next to a burned dragoon who was half-welded to his jet pack. She held his hand, thinking that might give him something to feel besides the pain, but he only moaned and muttered to himself, seemingly oblivious to her presence.\n The truck slammed a stop, sending everyone sliding and crashing into each other. Through the slats Elena glimpsed a great slab of blue, some huge, organic shape. A leg. A giant’s leg. The U-Man had to be bigger than an apartment building. Gunfire clattered, and a voice like a fog horn shouted something in English.\n The truck lurched into reverse, engine whining, and Elena fell forward onto her hands. Someone in the truck bed cried, “Does he see us? Does he see us?”\n The truck backed to the intersection and turned hard. The occupants shouted as they collapsed into each other yet again. Half a block more the truck braked to a more gradual stop and the drivers hopped out. “Is everyone okay?” they asked.\n The dragoon beside Elena laughed.\n She stood up and looked around. They were in the residential district, only a few blocks from her apartment. She made her way to the gate of the truck and hopped down. She said to the driver, “I’m not going back with you.”\n The woman nodded, not needing or wanting an explanation.\n Elena walked slowly between the hulking buildings. The pain in her hand, her face, all seemed to be returning.\n She emerged into a large open space. She realized she’d been mistaken about where the truck had stopped—this park was nowhere she recognized. The ground in front of her had been turned to glass.\n The sky to the east glowed. For a moment she thought it was another super-powered UM. But no, only the dawn. Below the dark bulk of Mount Kriegstahl stood the familiar silhouette of the Slaybot Prime bolted to its gantry. The air battle had moved there, above the factories and docks. Or maybe no battle at all. There seemed to be only a few flyers in the air now. The planes and TDs had disappeared. Perhaps the only ones left were U-Men.\n Power bolts zipped through the air. They were firing at the Prime.\n A great metal arm dropped away from its shoulder socket and dangled by thick cables. Another flash of energy severed them. The arm fell away in seeming slow motion, and the sound of the impact reached her a moment later. The übermenschen were carving the damn thing up.\n She almost laughed. The Slaybot Prime was as mobile and dangerous as the Statue of Liberty. Were they actually afraid of the thing? Was that why an army of them had shown up for an ordinary hostage rescue?\n My God, she thought, the morons had actually believed Lord Grimm’s boasting.\n She walked west, and the rising sun turned the glazed surface in front of her into a mirror. She knew now that she wasn’t lost. The scorched buildings surrounding the open space were too familiar. But she kept walking. After a while she noticed that the ground was strangely warm beneath her feet. Hot even.\n She looked back the way she’d come, then decided the distance was shorter ahead. She was too tired to run outright but managed a shuffling trot. Reckoning by rough triangulation from the nearest buildings she decided she was passing over Mr. Bojars favorite spot, the corner of Glorious Victory Street and Infinite Progress Avenue. Her own apartment building should have loomed directly in front of her.\n After all she’d seen tonight she couldn’t doubt that there were beings with the power to melt a city block to slag. But she didn’t know what strange ability, or even stranger whim, allowed them to casually trowel it into a quartz skating rink.\n She heard another boom behind her. The Slaybot Prime was headless now. The southern gantry peeled away, and then the body itself began to lean. Elena had been inside the thing; the chest assembly alone was as big as a cathedral.\n The Slaybot Prime slowly bowed, deeper, deeper, until it tumbled off the pillars of its legs. Dust leaped into the sky where it fell. The tremor moved under Elena, sending cracks snaking across the glass.\n The collapse of the prime seemed to signal the end of the fighting. The sounds of the energy blasts ceased. Figures flew in from all points of the city and coalesced above the industrial sector. In less than a minute there were dozens and dozens of them, small and dark as blackcap geese. Then she realized that the flock of übermenschen was flying toward her.\n Elena glanced to her left, then right. She was as exposed as a pea on a plate. The glass plain ended fifty or sixty meters away at a line of rubble. She turned and ran.\n She listened to the hiss of breath in her throat and the smack of her heavy boots against the crystalline surface. She was surprised at every moment that she did not crash through.\n Elongated shadows shuddered onto the mirrored ground ahead of her. She ran faster, arms swinging. The glass abruptly ended in a jagged lip. She leaped, landed on broken ground, and stumbled onto hands and knees. Finally she looked up.\n Racing toward her with the sun behind them, the U-Men were nothing but silhouettes—shapes that suggested capes and helmets; swords, hammers, and staffs; bows and shields. Even the energy beings, clothed in shimmering auras, seemed strangely desaturated by the morning light.\n Without looking away from the sky she found a chunk of masonry on the ground in front of her. Then she stood and climbed onto a tilting slab of concrete.\n When the mass of U-Men was directly above her she heaved with all her might.\n Useless. At its peak the gray chunk fell laughably short of the nearest figure. It clattered to the ground somewhere out of sight.\n Elena screamed, tensed for—longing for—a searing blast of light, a thunderbolt. Nothing came. The U-Men vanished over the roof of the next apartment building, heading out to sea.\n Weeks after the invasion, the factory remained closed. Workers began to congregate there anyway. Some mornings they pushed around brooms or cleared debris, but mostly they played cards, exchanged stories of the invasion, and speculated on rumors. Lord Grimm had not been seen since the attack. Everyone agreed that the Savior of Trovenia had been dead too many times to doubt his eventual resurrection.\n When Elena finally returned, eighteen days after the invasion, she found Verner and Guntis playing chess beside the left boot of the Slaybot Prime. The other huge components of the robot’s body were scattered across two miles of the industrial sector like the buildings of a new city.\n The men greeted her warmly. Verner, the ancient mechaneer, frankly noted the still-red cuts that cross-hatched the side of her face, but didn’t ask how she’d acquired them. If Trovenians told the story of every scar there’d be no end to the talking.\n Elena asked about Jürgo and both men frowned. Guntis said that the birdman had taken to the air during the fight. As for the other two members of the heavy plate welding unit, no news.\n “I was sorry to hear about your brother,” Verner said.\n “Yes,” Elena said. “Well.”\n She walked back to the women’s changing rooms, and when she didn’t find what she was looking for, visited the men’s. One cinderblock wall had caved in, but the lockers still stood in orderly rows. She found the locker bearing Jürgo’s name on a duct tape label. The door was padlocked shut. It took her a half hour to find a cutting rig with oxygen and acetylene cylinders that weren’t empty, but only minutes to wheel the rig to the changing rooms and burn off the lock.\n She pulled open the door. Jürgo’s old-fashioned, rectangle-eyed welding helmet hung from a hook, staring at her. She thought of Grandmother Zita. What possesses a person to put a bucket on their head?\n The inside of the locker door was decorated with a column of faded photographs. In one of them a young Jürgo, naked from the waist up, stared into the camera with a concerned squint. His new wings were unfurled behind him. Elena’s mother and father, dressed in their red Gene Corps jackets, stood on either side of him. Elena unpeeled the yellowed tape and put the picture in her breast pocket, then unhooked the helmet and closed the door.\n She walked back to the old men, pulling the cart behind her. “Are we working today or what?” she asked.\n Guntis looked up from the chess board with amusement in his huge wet eyes. “So you are the boss now, eh, Elena?”\n Verner, however, said nothing. He seemed to recognize that she was not quite the person she had been. Damaged components had been stripped away, replaced by cruder, yet sturdier approximations. He was old enough to have seen the process repeated many times.\n Elena reached into the pockets of her coat and pulled on her leather work gloves. Then she wheeled the cart over to the toe of the boot and straightened the hoses with a flick of her arm.\n “Tell us your orders, Your Highness,” Guntis said.\n “First we tear apart the weapons,” she said. She thumbed the blast trigger and blue flame roared from the nozzle of the cutting torch. “Then we build better ones.”\n She slid the helmet onto her head, flipped down the mask, and bent to work.\n Originally published in Eclipse 2, edited by Jonathan Strahan.\n Daryl Gregory writes genre-mixing novels, stories, and comics. His novel Spoonbenders is out now from Knopf. Other recent work includes the young adult novel Harrison Squared and the novella We Are All Completely Fine, which won the World Fantasy and Shirley Jackson awards, and was a finalist for the Nebula, Sturgeon, and Locus awards. His novels include Afterparty, an NPR and Kirkus best fiction book of 2014; Raising Stony Mayhall; The Devil's Alphabet; and the Crawford-Award-winning Pandemonium. Many of his short stories are collected in Unpossible and Other Stories."}