{"fingerprint": "cUZnIfZjqfPQy+G/shAmv+LvcKg=", "sitename": "Clarkesworld Magazine", "title": "Second Person, Present Tense by Daryl Gregory", "author": "Daryl Gregory", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gregory_11_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Second Person, Present Tense by Daryl Gregory", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8230 words, novelette, REPRINT\n Second Person, Present Tense\n If you think, “I breathe,” the “I” is extra. There is no you to say “I.” What we call “I” is just a swinging door which moves when we inhale or when we exhale.—Shun Ryu SuzukiI used to think the brain was the most important organ in the body, until I realized who was telling me that.—Emo Phillips\n When I enter the office, Dr. S is leaning against the desk, talking earnestly to the dead girl’s parents. He isn’t happy, but when he looks up he puts on a smile for me. “And here she is,” he says, like a game show host revealing the grand prize. The people in the chairs turn, and Dr. Subramaniam gives me a private, encouraging wink.\n The father stands first, a blotchy, square-faced man with a tight belly he carries like a basketball. As in our previous visits, he is almost frowning, struggling to match his face to his emotions. The mother, though, has already been crying, and her face is wide open: joy, fear, hope, relief. It’s way over the top.\n “Oh, Therese,” she says. “Are you ready to come home?”\n Their daughter was named Therese. She died of an overdose almost two years ago, and since then Mitch and Alice Klass have visited this hospital dozens of times, looking for her. They desperately want me to be their daughter, and so in their heads I already am.\n My hand is still on the door handle. “Do I have a choice?” On paper I’m only seventeen years old. I have no money, no credit cards, no job, no car. I own only a handful of clothes. And Robierto, the burliest orderly on the ward, is in the hallway behind me, blocking my escape.\n Therese’s mother seems to stop breathing for a moment. She’s a slim, narrow-boned woman who seems tall until she stands next to anyone. Mitch raises a hand to her shoulder, then drops it.\n As usual whenever Alice and Mitch come to visit, I feel like I’ve walked into the middle of a soap opera and no one’s given me my lines. I look directly at Dr. S, and his face is frozen into that professional smile. Several times over the past year he’s convinced them to let me stay longer, but they’re not listening anymore. They’re my legal guardians, and they have Other Plans. Dr. S looks away from me, rubs the side of his nose.\n “That’s what I thought,” I say.\n The father scowls. The mother bursts into fresh tears, and she cries all the way out of the building. Dr. Subramaniam watches from the entrance as we drive away, his hands in his pockets. I’ve never been so angry with him in my life—all two years of it.\n The name of the drug is Zen, or Zombie, or just Z. Thanks to Dr. S I have a pretty good idea of how it killed Therese.\n “Flick your eyes to the left,” he told me one afternoon. “Now glance to the right. Did you see the room blur as your eyes moved?” He waited until I did it again. “No blur. No one sees it.”\n This is the kind of thing that gets brain doctors hot and bothered. Not only could no one see the blur, their brains edited it out completely. Skipped over it—left view, then right view, with nothing between—then fiddled with the person’s time sense so that it didn’t even seem missing.\n The scientists figured out that the brain was editing out shit all the time. They wired up patients and told them to lift one of their fingers, move it any time they wanted. Each time, the brain started the signal traveling toward the finger up to 120 milliseconds before the patient consciously decided to move it. Dr. S said you could see the brain warming up right before the patient consciously thought, now.\n This is weird, but it gets weirder the longer you think about it. And I’ve been thinking about this a lot.\n The conscious mind—the “I” that’s thinking, hey, I’m thirsty, I’ll reach for that cold cup of water—hasn’t really decided anything. The signal to start moving your hand has already traveled halfway down your arm by the time you even realize you are thirsty. Thought is an afterthought. By the way, the brain says, we’ve decided to move your arm, so please have the thought to move it.\n The gap is normally 120 milliseconds, max. Zen extends this minutes. Hours.\n If you run into somebody who’s on Zen, you won’t notice much. The person’s brain is still making decisions, and the body still follows orders. You can talk to the them, and they can talk to you. You can tell each other jokes, go out for hamburgers, do homework, have sex.\n But the person isn’t conscious. There is no “I” there. You might as well be talking to a computer. And two people on Zen—“you” and “I”—are just puppets talking to puppets.\n It’s a little girl’s room strewn with teenager. Stuffed animals crowd the shelves and windowsills, shoulder to shoulder with stacks of Christian rock CDs and hairbrushes and bottles of nail polish. Pinups from Teen People are taped to the wall, next to a bulletin board dripping with soccer ribbons and rec league gymnastic medals going back to second grade. Above the desk, a plaque titled “I Promise . . . ” exhorting Christian youth to abstain from premarital sex. And everywhere taped and pinned to the walls, the photos: Therese at Bible camp, Therese on the balance beam, Therese with her arms around her youth group friends. Every morning she could open her eyes to a thousand reminders of who she was, who she’d been, who she was supposed to become.\n I pick up the big stuffed panda that occupies the place of pride on the bed. It looks older than me, and the fur on the face is worn down to the batting. The button eyes hang by white thread—they’ve been re-sewn, maybe more than once.\n Therese’s father sets down the pitifully small bag that contains everything I’ve taken from the hospital: toiletries, a couple changes of clothes, and five of Dr. S’s books. “I guess old Boo Bear was waiting for you,” he says.\n “Boo W. Bear.”\n “Yes, Boo W!” It pleases him that I know this. As if it proves anything. “You know, your mother dusted this room every week. She never doubted that you’d come back.”\n I have never been here, and she is not coming back, but already I’m tired of correcting pronouns. “Well, that was nice,” I say.\n “She’s had a tough time of it. She knew people were talking, probably holding her responsible—both of us, really. And she was worried about them saying things about you. She couldn’t stand them thinking that you were a wild girl.”\n “Them?”\n He blinks. “The Church.”\n Ah. The Church. The term carried so many feelings and connotations for Therese that months ago I stopped trying to sort them out. The Church was the red-brick building of the Davenport Church of Christ, shafts of dusty light through rows of tall, glazed windows shaped like gravestones. The Church was God and the Holy Ghost (but not Jesus—he was personal, separate somehow). Mostly, though, it was the congregation, dozens and dozens of people who’d known her since before she was born. They loved her, they watched out for her, and they evaluated her every step. It was like having a hundred overprotective parents.\n I almost laugh. “The Church thinks Therese was wild?”\n He scowls, but whether because I’ve insulted the Church or because I keep referring to his daughter by name, I’m not sure. “Of course, not. It’s just that you caused a lot of worry.” His voice has assumed a sober tone that’s probably never failed to unnerve his daughter. “You know, the church prayed for you every week.”\n “They did?” I do know Therese well enough to be sure this would have mortified her. She was a pray-er, not a pray-ee.\n Therese’s father watches my face for the bloom of shame, maybe a few tears. From contrition it should have been one small step to confession. It’s hard for me to take any of this seriously.\n I sit down on the bed and sink deep into the mattress. This is not going to work. The double bed takes up most of the room, with only a few feet of open space around it. Where am I going to meditate?\n “Well,” Therese’s father says. His voice has softened. Maybe he thinks he’s won. “You probably want to get changed,” he says.\n He goes to the door but doesn’t leave. I stand by the window, but I can feel him there, waiting. Finally the oddness of this makes me turn around.\n He’s staring at the floor, a hand behind his neck. Therese might have been able to intuit his mood, but it’s beyond me.\n “We want to help you, Therese. But there’s so many things we just don’t understand. Who gave you the drugs, why you went off with that boy, why you would—” His hand moves, a stifled gesture that could be anger, or just frustration. “It’s just . . . hard.”\n “I know,” I say. “Me too.”\n He shuts the door when he leaves, and I push the panda to the floor and flop onto my back in relief. Poor Mr. Klass. He just wants to know if his daughter fell from grace, or was pushed.\n When I want to freak myself out, “I” think about “me” thinking about having an “I.” The only thing stupider than puppets talking to puppets is a puppet talking to itself.\n Dr. S says that nobody knows what the mind is, or how the brain generates it, and nobody really knows about consciousness. We talked almost every day while I was in the hospital, and after he saw that I was interested in this stuff—how could I not be—he gave me books and we’d talk about brains and how they cook up thoughts and make decisions.\n “How do I explain this,” he always starts. And then he tries out the metaphors he’s working on for his book. My favorite is the Parliament, the Page, and the Queen.\n “The brain isn’t one thing, of course,” he told me. “It’s millions of firing cells, and those resolve into hundreds of active sites, and so it is with the mind. There are dozens of nodes in the mind, each one trying to out-shout the others. For any decision, the mind erupts with noise, and that triggers . . . how do I explain this . . . Have you ever seen the British Parliament on C-SPAN?” Of course I had: in a hospital TV is a constant companion. “These members of the mind’s parliament, they’re all shouting in chemicals and electrical charges, until enough of the voices are shouting in unison. Ding! That’s a ‘thought,’ a ‘decision.’ The Parliament immediately sends a signal to the body to act on the decision, and at the same time it tells the Page to take the news—”\n “Wait, who’s the Page?”\n He waves his hand. “That’s not important right now.” (Weeks later, in a different discussion, Dr. S will explain that the Page isn’t one thing, but a cascade of neural events in the temporal area of the limbic system that meshes the neural map of the new thought with the existing neural map—but by then I know that “neural map” is just another metaphor for another deeply complex thing or process, and that I’ll never get to the bottom of this. Dr. S said not to worry about it, that nobody gets to the bottom of it.) “The Page takes the news of the decision to the Queen.”\n “All right then, who’s the Queen? Consciousness?”\n “Exactly right! The self itself.”\n He beamed at me, his attentive student. Talking about this stuff gets Dr. S going like nothing else, but he’s oblivious to the way I let the neck of my scrubs fall open when I stretch out on the couch. If only I could have tucked the two hemispheres of my brain into a lace bra.\n “The Page,” he said, “delivers its message to Her Majesty, telling her what the Parliament has decided. The Queen doesn’t need to know about all the other arguments that went on, all the other possibilities that were thrown out. She simply needs to know what to announce to her subjects. The Queen tells the parts of the body to act on the decision.”\n “Wait, I thought the Parliament had already sent out the signal. You said before that you can see the brain warming up before the self even knows about it.”\n “That’s the joke. The Queen announces the decision, and she thinks that her subjects are obeying her commands, but in reality, they have already been told what to do. They’re already reaching for their glasses of water.”\n I pad down to the kitchen in bare feet, wearing Therese’s sweatpants and a t-shirt. The shirt is a little tight; Therese, champion dieter and Olympic-level purger, was a bit smaller than me.\n Alice is at the table, already dressed, a book open in front of her. “Well, you slept in this morning,” she says brightly. Her face is made up, her hair sprayed into place. The coffee cup next to the book is empty. She’s been waiting for hours.\n I look around for a clock, and find one over the door. It’s only nine. At the hospital I slept in later than that all the time. “I’m starved,” I say. There’s a refrigerator, a stove, and dozens of cabinets.\n I’ve never made my own breakfast. Or any lunch or dinner, for that matter. For my entire life, my meals have been served on cafeteria trays. “Do you have scrambled eggs?”\n She blinks. “Eggs? You don’t—” She abruptly stands. “Sure. Sit down, Therese, and I’ll make you some.”\n “Just call me ‘Terry,’ okay?”\n Alice stops, thinks about saying something—I can almost hear the clank of cogs and ratchets—until she abruptly strides to the cabinet, crouches, and pulls out a non-stick pan.\n I take a guess on which cabinet holds the coffee mugs, guess right, and take the last inch of coffee from the pot. “Don’t you have to go to work?” I say. Alice does something at a restaurant supply company; Therese has always been hazy on the details.\n “I’ve taken a leave,” she says. She cracks an egg against the edge of the pan, does something subtle with the shells as the yolk squeezes out and plops into the pan, and folds the shell halves into each other. All with one hand.\n “Why?”\n She smiles tightly. “We couldn’t just abandon you after getting you home. I thought we might need some time together. During this adjustment period.”\n “So when do I have to see this therapist? Whatsisname.” My executioner.\n “Her. Dr. Mehldau’s in Baltimore, so we’ll drive there tomorrow.” This is their big plan. Dr. Subramaniam couldn’t bring back Therese, so they’re running to anyone who says they can. “You know, she’s had a lot of success with people in your situation. That’s her book.” She nods at the table.\n “So? Dr. Subramaniam is writing one too.” I pick up the book. The Road Home: Finding the Lost Children of Zen. “What if I don’t go along with this?”\n She says nothing, chopping at the eggs. I’ll be eighteen in four months. Dr. S said that it will become a lot harder for them to hold me then. This ticking clock sounds constantly in my head, and I’m sure it’s loud enough for Alice and Mitch to hear it too.\n “Let’s just try Dr. Mehldau first.”\n “First? What then?” She doesn’t answer. I flash on an image of me tied down to the bed, a priest making a cross over my twisting body. It’s a fantasy, not a Therese memory—I can tell the difference. Besides, if this had already happened to Therese, it wouldn’t have been a priest.\n “Okay then,” I say. “What if I just run away?”\n “If you turn into a fish,” she says lightly, “then I will turn into a fisherman and fish for you.”\n “What?” I’m laughing. I haven’t heard Alice speak in anything but straightforward, earnest sentences.\n Alice’s smile is sad. “You don’t remember?”\n “Oh, yeah.” The memory clicks. “Runaway Bunny. Did she like that?”\n Dr. S’s book is about me. Well, Zen OD-ers in general, but there are only a couple thousand of us. Z’s not a hugely popular drug, in the US or anywhere else. It’s not a hallucinogen. It’s not a euphoric or a depressant. You don’t speed, mellow out, or even get high in the normal sense. It’s hard to see what the attraction is. Frankly, I have trouble seeing it.\n Dr. S says that most drugs aren’t about making you feel better, they’re about not feeling anything at all. They’re about numbness, escape. And Zen is a kind of arty, designer escape hatch. Zen disables the Page, locks him in his room, so that he can’t make his deliveries to the Queen. There’s no update to the neural map, and the Queen stops hearing what Parliament is up to. With no orders to bark, she goes silent. It’s that silence that people like Therese craved.\n But the real attraction—again, for people like Therese—is the overdose. Swallow way too much Zen and the Page can’t get out for weeks. When he finally gets out, he can’t remember the way back to the Queen’s castle. The whole process of updating the self that’s been going on for years is suddenly derailed. The silent Queen can’t be found.\n The Page, poor guy, does the only thing he can. He goes out and delivers the proclamations to the first girl he sees.\n The Queen is dead. Long live the Queen.\n “Hi, Terry. I’m Dr. Mehldau.” She’s a stubby woman with a pleasant round face, and short dark hair shot with gray. She offers me her hand. Her fingers are cool and thin.\n “You called me Terry.”\n “I was told that you prefer to go by that. Do you want me to call you something else?”\n “No . . . I just expected you to make me say my name is ‘Therese’ over and over.”\n She laughs and sits down in a red leather chair that looks soft but sturdy. “I don’t think that would be very helpful, do you? I can’t make you do anything you don’t want to do, Terry.”\n “So I’m free to go.”\n “Can’t stop you. But I do have to report back to your parents on how we’re doing.”\n My parents.\n She shrugs. “It’s my job. Why don’t you have a seat and we can talk about why you’re here.”\n The chair opposite her is cloth, not leather, but it’s still nicer than anything in Dr. Subramaniam’s office. The entire office is nicer than Dr. S’s office. Daffodil walls in white trim, big windows glowing behind white cloth shades, tropically colored paintings.\n I don’t sit down.\n “Your job is to turn me into Mitch and Alice’s daughter. I’m not going to do that. So any time we spend talking is just bullshit.”\n “Terry, no one can turn you into something you’re not.”\n “Well then we’re done here.” I walk across the room—though “stroll” is what I’m shooting for—and pick up an African-looking wooden doll from the bookshelf. The shelves are decorated with enough books to look serious, but there are long open spaces for arty arrangements of candlesticks and Japanese fans and plaques that advertise awards and appreciations. Dr. S’s bookshelves are for holding books, and books stacked on books. Dr. Mehldau’s bookshelves are for selling the idea of Dr. Mehldau.\n “So what are you, a psychiatrist or a psychologist or what?” I’ve met all kinds in the hospital. The psychiatrists are M.D.’s like Dr. S and can give you drugs. I haven’t figured out what the psychologists are good for.\n “Neither,” she says. “I’m a counselor.”\n “So what’s the ‘doctor’ for?”\n “Education.” Her voice didn’t change, but I get the impression that the questions annoyed her. This makes me strangely happy.\n “Okay, Dr. Counselor, what are you supposed to counsel me about? I’m not crazy. I know who Therese was, I know what she did, I know that she used to walk around in my body.” I put the doll back in its spot next to a glass cube that could be a paperweight. “But I’m not her. This is my body, and I’m not going to kill myself just so Alice and Mitch can have their baby girl back.”\n “Terry, no one’s asking you to kill yourself. Nobody can even make you into who you were before.”\n “Yeah? Then what are they paying you for, then?”\n “Let me try to explain. Please, sit down. Please.”\n I look around for a clock and finally spot one on a high shelf. I mentally set the timer to five minutes and sit opposite her, hands on my knees. “Shoot.”\n “Your parents asked me to talk to you because I’ve helped other people in your situation, people who’ve overdosed on Z.”\n “Help them what? Pretend to be something they’re not?”\n “I help them take back what they are. Your experience of the world tells you that Therese was some other person. No one’s denying that. But you’re in a situation where biologically and legally, you’re Therese Klass. Do you have plans for dealing with that?”\n As a matter of fact I do, and it involves getting the hell out as soon as possible. “I’ll deal with it,” I say.\n “What about Alice and Mitch?”\n I shrug. “What about them?”\n “They’re still your parents, and you’re still their child. The overdose convinced you that you’re a new person, but that hasn’t changed who they are. They’re still responsible for you, and they still care for you.”\n “Not much I can do about that.”\n “You’re right. It’s a fact of your life. You have two people who love you, and you’re going to be with each other for the rest of your lives. You’re going to have to figure out how to relate to each other. Zen may have burned the bridge between you and your past life, but you can build that bridge again.”\n “Doc, I don’t want to build that bridge. Look, Alice and Mitch seem like nice people, but if I was looking for parents, I’d pick someone else.”\n Dr. Mehldau smiles. “None of us gets to choose our parents, Terry.”\n I’m not in the mood to laugh. I nod toward the clock. “This is a waste of time.”\n She leans forward. I think she’s going to try to touch me, but she doesn’t. “Terry, you’re not going to disappear if we talk about what happened to you. You’ll still be here. The only difference is that you’ll reclaim those memories as your own. You can get your old life back and choose your new life.”\n Sure, it’s that easy. I get to sell my soul and keep it too.\n I can’t remember my first weeks in the hospital, though Dr. S says I was awake. At some point I realized that time was passing, or rather, that there was a me who was passing through time. I had lasagna for dinner yesterday, I am having meat loaf today. I am this girl in a bed. I think I realized this and forgot it several times before I could hold onto it.\n Every day was mentally exhausting, because everything was so relentlessly new. I stared at the TV remote for a half hour, the name for it on the tip of my tongue, and it wasn’t until the nurse picked it up and turned on the TV for me that I thought: Remote. And then sometimes, this was followed by a raft of other ideas: TV. Channel. Gameshow.\n People were worse. They called me by a strange name, and they expected things of me. But to me, every visitor, from the night shift nurse to the janitor to Alice and Mitch Klass, seemed equally important—which is to say, not important at all.\n Except for Dr. S. He was there from the beginning, and so he was familiar before I met him. He belonged to me like my own body.\n But everything else about the world—the names, the details, the facts—had to be hauled into the sunlight, one by one. My brain was like an attic, chock full of old and interesting things jumbled together in no order at all.\n I only gradually understood that somebody must have owned this house before me. And then I realized the house was haunted.\n After the Sunday service, I’m caught in a stream of people. They lean across the pews to hug Alice and Mitch, then me. They pat my back, squeeze my arms, kiss my cheeks. I know from brief dips into Therese’s memories that many of these people are as emotionally close as aunts or uncles. And any of them, if Therese were ever in trouble, would take her in, feed her, and give her a bed to sleep in.\n This is all very nice, but the constant petting has me ready to scream.\n All I want to do is get back home and take off this dress. I had no choice but to wear one of Therese’s girly-girl extravaganzas. Her closet was full of them, and I finally found one that fit, if not comfortably. She loved these dresses, though. They were her floral print flak jackets. Who could doubt the purity of a girl in a high-necked Laura Ashley?\n We gradually make our way to the vestibule, then to the sidewalk and the parking lot, under assault the entire way. I stop trying to match their faces to anything in Therese’s memories.\n At our car a group of teenagers take turns on me, the girls hugging me tight, the boys leaning into me with half hugs: shoulders together, pelvises apart. One of the girls, freckled with soft red curls falling past her shoulders, hangs back for awhile, then abruptly clutches me and whispers into my ear, “I’m so glad you’re okay, Miss T.” Her tone is intense, like she’s passing a secret message.\n A man moves through the crowd, arms open, smiling broadly. He’s in his late twenties or early thirties, his hair cut in a choppy gelled style that’s ten years too young for him. He’s wearing pressed khakis, a blue Oxford rolled up at the forearms, a checked tie loosened at the throat.\n He smothers me in a hug, his cologne like another set of arms. He’s easy to find in Therese’s memories: This is Jared, the Youth Pastor. He was the most spiritually vibrant person Therese knew, and the object of her crush.\n “It’s so good to have you back, Therese,” he says. His cheek is pressed to mine. We’ve missed you.”\n A few months before her overdose, the youth group was coming back from a weekend-long retreat in the church’s converted school bus. Late into the trip, near midnight, Jared sat next to her, and she fell asleep leaning against him, inhaling that same cologne.\n “I bet you have,” I say. “Watch the hands, Jared.”\n His smile doesn’t waver, his hands are still on my shoulders. “I’m sorry?”\n “Oh please, you heard me.”\n He drops his hands, and looks questioningly at my father. He can do sincerity pretty well. “I don’t understand, Therese, but if—”\n I give him a look that makes him back up a step. At some point later in the trip Therese awoke with Jared still next to her, slumped in the seat, eyes closed and mouth open. His arm was resting between her thighs, a thumb against her knee. She was wearing shorts, and his flesh on hers was hot. His forearm was inches from her warm crotch.\n Therese believed that he was asleep.\n She believed, too, that it was the rumbling of the school bus that shifted Jared’s arm into contact with the crease of her shorts. Therese froze, flushed with arousal and embarrassment.\n “Try to work it out, Jared.” I get in the car.\n The big question I can help answer, Dr. S said, is why there is consciousness. Or, going back to my favorite metaphor, if the Parliament is making all the decisions, why have a Queen at all?\n He’s got theories, of course. He thinks the Queen is all about storytelling. The brain needs a story that gives all these decisions a sense of purpose, a sense of continuity, so it can remember them and use them in future decisions. The brain can’t keep track of the trillions of possible other decisions it could have made every moment; it needs one decision, and it needs a who, and a why. The brain lays down the memories, and the consciousness stamps them with identity: I did this, I did that. Those memories become the official record, the precedents that the Parliament uses to help make future decisions.\n “The Queen, you see, is a figurehead,” Dr. S said. “She represents the kingdom, but she isn’t the kingdom itself, or even in control of it.”\n “I don’t feel like a figurehead,” I said.\n Dr. S laughed. “Me neither. Nobody does.”\n Dr. Mehldau’s therapy involves occasional joint sessions with Alice and Mitch, reading aloud from Therese’s old diaries, and home movies. Today’s video features a pre-teen Therese dressed in sheets, surrounded by kids in bathrobes, staring fixedly at a doll in a manger.\n Dr. Mehldau asks me what Therese was thinking then. Was she enjoying playing Mary? Did she like being on stage?\n “How would I know?”\n “Then imagine it. What do you think Therese is thinking here?”\n She tells me to do that a lot. Imagine what she’s thinking. Just pretend. Put yourself in her shoes. In her book she calls this “reclaiming.” She makes up a lot of her own terms, then defines them however she wants, without research to back her up. Compared to the neurology texts Dr. S lent me, Dr. Mehldau’s little book is an Archie comic with footnotes.\n “You know what, Therese was a good Christian girl, so she probably loved it.”\n “Are you sure?”\n The wise men come on stage, three younger boys. They plop down their gifts and their lines, and the look on Therese’s face is wary. Her line is coming up.\n Therese was petrified of screwing up. Everybody would be staring at her. I can almost see the congregation in the dark behind the lights. Alice and Mitch are out there, and they’re waiting for every line. My chest tightens, and I realize I’m holding my breath.\n Dr. Mehldau’s eyes on mine are studiously neutral.\n “You know what?” I have no idea what I’m going to say next. I’m stalling for time. I shift my weight in the big beige chair and move a leg underneath me. “The thing I like about Buddhism is Buddhists understand that they’ve been screwed by a whole string of previous selves. I had nothing to do with the decisions Therese made, the good or bad karma she’d acquired.”\n This is a riff I’ve been thinking about in Therese’s big girly bedroom. “See, Therese was a Christian, so she probably thought by overdosing that she’d be born again, all her sins forgiven. It’s the perfect drug for her: suicide without the corpse.”\n “Was she thinking about suicide that night?”\n “I don’t know. I could spend a couple weeks mining through Therese’s memories, but frankly, I’m not interested. Whatever she was thinking, she wasn’t born again. I’m here, and I’m still saddled with her baggage. I am Therese’s donkey. I’m a karma donkey.”\n Dr. Mehldau nods. “Dr. Subramaniam is Buddhist, isn’t he?”\n “Yeah, but what’s . . . ?” It clicks. I roll my eyes. Dr. S and I talked about transference, and I know that my crush on him was par for the course. And it’s true that I spend a lot of time—still—thinking about fucking the man. But that doesn’t mean I’m wrong. “This is not about that,” I say. “I’ve been thinking about this on my own.”\n She doesn’t fight me on that. “Wouldn’t a Buddhist say that you and Therese share the same soul? Self’s an illusion. So there’s no rider in charge, no donkey. There’s just you.”\n “Just forget it,” I say.\n “Let’s follow this, Terry. Don’t you feel you have a responsibility to your old self? Your old self’s parents, your old friends? Maybe there’s karma you owe.”\n “And who are you responsible to, Doctor? Who’s your patient? Therese, or me?”\n She says nothing for a moment, then: “I’m responsible to you.”\n You.\n You swallow, surprised that the pills taste like cinnamon. The effect of the drug is intermittent at first. You realize that you’re in the back seat of a car, the cellphone in your hand, your friends laughing around you. You’re talking to your mother. If you concentrate, you can remember answering the phone, and telling her which friend’s house you’re staying at tonight. Before you can say goodbye, you’re stepping out of the car. The car is parked, your phone is away—and you remember saying goodnight to your mother and riding for a half hour before finding this parking garage. Joelly tosses her red curls and tugs you toward the stairwell: Come on, Miss T!\n Then you look up and realize that you’re on the sidewalk outside an all-ages club, and you’re holding a ten dollar bill, ready to hand it to the bouncer. The music thunders every time the door swings open. You turn to Joelly and—\n You’re in someone else’s car. On the Interstate. The driver is a boy you met hours ago, his name is Rush but you haven’t asked if that’s his first name or his last. In the club you leaned into each other and talked loud over the music about parents and food and the difference between the taste of a fresh cigarette in your mouth and the smell of stale smoke. But then you realize that there’s a cigarette in your mouth, you took it from Rush’s pack yourself, and you don’t like cigarettes. Do you like it now? You don’t know. Should you take it out, or keep smoking? You scour your memories, but can discover no reason why you decided to light the cigarette, no reason why you got into the car with this boy. You start to tell yourself a story: he must be a trustworthy person, or you wouldn’t have gotten into the car. You took that one cigarette because the boy’s feelings would have been hurt.\n You’re not feeling like yourself tonight. And you like it. You take another drag off the cigarette. You think back over the past few hours, and marvel at everything you’ve done, all without that constant weight of self-reflection: worry, anticipation, instant regret. Without the inner voice constantly critiquing you.\n Now the boy is wearing nothing but boxer shorts, and he’s reaching up to a shelf to get a box of cereal, and his back is beautiful. There is hazy light outside the small kitchen window. He pours Froot Loops into a bowl for you, and he laughs, though quietly because his mother is asleep in the next room. He looks at your face and frowns. He asks you what’s the matter. You look down, and you’re fully dressed. You think back, and realize that you’ve been in this boy’s apartment for hours. You made out in his bedroom, and the boy took off his clothes, and you kissed his chest and ran your hands along his legs. You let him put his hand under your shirt and cup your breasts, but you didn’t go any further. Why didn’t you have sex? Did he not interest you? No—you were wet. You were excited. Did you feel guilty? Did you feel ashamed?\n What were you thinking?\n When you get home there will be hell to pay. Your parents will be furious, and worse, they will pray for you. The entire church will pray for you. Everyone will know. And no one will ever look at you the same again.\n Now there’s a cinnamon taste in your mouth, and you’re sitting in the boy’s car again, outside a convenience store. It’s afternoon. Your cell phone is ringing. You turn off the cell phone and put it back in your purse. You swallow, and your throat is dry. That boy—Rush—is buying you another bottle of water. What was it you swallowed? Oh, yes. You think back, and remember putting all those little pills in your mouth. Why did you take so many? Why did you take another one at all? Oh, yes.\n Voices drift up from the kitchen. It’s before 6am, and I just want to pee and get back to sleep, but then I realize they’re talking about me.\n “She doesn’t even walk the same. The way she holds herself, the way she talks . . . ”\n “It’s all those books Dr. Subramaniam gave her. She’s up past one every night. Therese never read like that, not science.”\n “No, it’s not just the words, it’s how she sounds. That low voice . . . ” She sobs. “Oh hon, I didn’t know it would be this way. It’s like she’s right, it’s like it isn’t her at all.”\n He doesn’t say anything. Alice’s crying grows louder, subsides. The clink of dishes in the sink. I step back, and Mitch speaks again.\n “Maybe we should try the camp,” he says.\n “No, no, no! Not yet. Dr. Mehldau says she’s making progress. We’ve got to—”\n “Of course she’s going to say that.”\n “You said you’d try this, you said you’d give this a chance.” The anger cuts through the weeping, and Mitch mumbles something apologetic. I creep back to my bedroom, but I still have to pee, so I make a lot of noise going back out. Alice comes to the bottom of the stairs. “Are you all right, honey?”\n I keep my face sleepy and walk into the bathroom. I shut the door and sit down on the toilet in the dark.\n What fucking camp?\n “Let’s try again,” Dr. Mehldau said. “Something pleasant and vivid.”\n I’m having trouble concentrating. The brochure is like a bomb in my pocket. It wasn’t hard to find, once I decided to look for it. I want to ask Dr. Mehldau about the camp, but I know that once I bring it into the open, I’ll trigger a showdown between the doctor and the Klasses, with me in the middle.\n “Keep your eyes closed,” she says. “Think about Therese’s tenth birthday. In her diary, she wrote that was the best birthday she’d ever had. Do you remember Sea World?”\n “Vaguely.” I could see dolphins jumping—two at a time, three at a time. It had been sunny and hot. With every session it was getting easier for me to pop into Therese’s memories. Her life was on DVD, and I had the remote.\n “Do you remember getting wet at the Namu and Shamu show?”\n I laughed. “I think so.” I could see the metal benches, the glass wall just in front of me, the huge shapes in the blue-green water. “They had the whales flip their big tail fins. We got drenched.”\n “Can you picture who was there with you? Where are your parents?”\n There was a girl, my age, I can’t remember her name. The sheets of water were coming down on us and we were screaming and laughing. Afterward my parents toweled us off. They must have been sitting up high, out of the splash zone. Alice looked much younger: happier, and a little heavier. She was wider at the hips. This was before she started dieting and exercising, when she was Mom-sized.\n My eyes pop open. “Oh God.”\n “Are you okay?”\n “I’m fine—it was just . . . like you said. Vivid.” That image of a younger Alice still burns. For the first time I realize how sad she is now.\n “I’d like a joint session next time,” I say.\n “Really? All right. I’ll talk to Alice and Mitch. Is there anything in particular you want to talk about?”\n “Yeah. We need to talk about Therese.”\n Dr. S says everybody wants to know if the original neural map, the old Queen, can come back. Once the map to the map is lost, can you find it again? And if you do, then what happens to the new neural map, the new Queen?\n “Now, a good Buddhist would tell you that this question is unimportant. After all, the cycle of existence is not just between lives. Samsara is every moment. The self continuously dies and recreates itself.”\n “Are you a good Buddhist?” I asked him.\n He smiled. “Only on Sunday mornings.”\n “You go to church?”\n “I golf.”\n There’s a knock and I open my eyes. Alice steps into my room, a stack of folded laundry in her arms. “Oh!”\n I’ve rearranged the room, pushing the bed into the corner to give me a few square feet of free space the floor.\n Her face goes through a few changes. “I don’t suppose you’re praying.”\n “No.”\n She sighs, but it’s a mock-sigh. “I didn’t think so.” She moves around me and sets the laundry on the bed. She picks up the book there, Entering the Stream. “Dr. Subramaniam gave you this?”\n She’s looking at the passage I’ve highlighted. But loving kindness—maitri—toward ourselves doesn’t mean getting rid of anything. The point is not to try to change ourselves. Meditation practice isn’t about trying to throw ourselves away and become something better. It’s about befriending who we already are.\n “Well.” She sets the book down, careful to leave it open to the same page. “That sounds a bit like Dr. Mehldau.”\n I laugh. “Yeah, it does. Did she tell you I wanted you and Mitch to be at the next session?”\n “We’ll be there.” She works around the room, picking up t-shirts and underwear. I stand up to get out of the way. Somehow she manages to straighten up as she moves—righting books that had fallen over, setting Boo W. Bear back to his place on the bed, sweeping an empty chip bag into the garbage can—so that as she collects my dirty laundry she’s cleaning the entire room, like the Cat in the Hat’s cleaner-upper machine.\n “Alice, in the last session I remembered being at Sea World, but there was a girl next to me. Next to Therese.”\n “Sea World? Oh, that was the Hammel girl, Marcy. They took you to Ohio with them on their vacation that year.”\n “Who did?”\n “The Hammels. You were gone all week. All you wanted for your birthday was spending money for the trip.”\n “You weren’t there?”\n She picks up the jeans I left at the foot of the bed. “We always meant to go to Sea World, but your father and I never got out there.”\n “This is our last session,” I say.\n Alice, Mitch, Dr. Mehldau: I have their complete attention.\n The doctor, of course, is the first to recover. “It sounds like you’ve got something you want to tell us.”\n “Oh yeah.”\n Alice seems frozen, holding herself in check. Mitch rubs the back of his neck, suddenly intent on the carpet.\n “I’m not going along with this anymore.” I make a vague gesture. “Everything: the memory exercises, all this imagining of what Therese felt. I finally figured it out. It doesn’t matter to you if I’m Therese or not. You just want me to think I’m her. I’m not going along with the manipulation anymore.”\n Mitch shakes his head. “Honey, you took a drug.” He glances at me, looks back at his feet. “If you took LSD and saw God, that doesn’t mean you really saw God. Nobody’s trying to manipulate you, we’re trying to undo the manipulation.”\n “That’s bullshit, Mitch. You all keep acting like I’m schizophrenic, that I don’t know what’s real or not. Well, part of the problem is that the longer I talk to Dr. Mehldau here, the more fucked up I am.”\n Alice gasps.\n Dr. Mehldau puts out a hand to soothe her, but her eyes are on me. “Terry, what your father’s trying to say is that even though you feel like a new person, there’s a you that existed before the drug. That exists now.”\n “Yeah? You know all those OD-ers in your book who say they’ve ‘reclaimed’ themselves? Maybe they only feel like their old selves.”\n “It’s possible,” she says. “But I don’t think they’re fooling themselves. They’ve come to accept the parts of themselves they’ve lost, the family members they’ve left behind. They’re people like you.” She regards me with that standard-issue look of concern that doctors pick up with their diplomas. “Do you really want to feel like an orphan the rest of your life?”\n “What?” From out of nowhere, tears well in my eyes. I cough to clear my throat, and the tears keep coming, until I smear them off on my arm. I feel like I’ve been sucker punched. “Hey, look Alice, just like you,” I say.\n “It’s normal,” Dr. Mehldau says. “When you woke up in the hospital, you felt completely alone. You felt like a brand new person, no family, no friends. And you’re still just starting down this road. In a lot of ways you’re not even two years old.”\n “Damn you’re good,” I say. “I didn’t even see that one coming.”\n “Please, don’t leave. Let’s—”\n “Don’t worry, I’m not leaving yet.” I’m at the door, pulling my backpack from the peg by the door. I dig into the pocket, and pull out the brochure. “You know about this?”\n Alice speaks for the first time. “Oh honey, no . . . ”\n Dr. Mehldau takes it from me, frowning. On the front is a nicely posed picture of a smiling teenage boy hugging relieved parents. She looks at Alice and Mitch. “Are you considering this?”\n “It’s their big stick, Dr. Mehldau. If you can’t come through for them, or I bail out, boom. You know what goes on there?”\n She opens the pages, looking at pictures of the cabins, the obstacle course, the big lodge where kids just like me engage in “intense group sessions with trained counselors” where they can “recover their true identities.” She shakes her head. “Their approach is different than mine . . . ”\n “I don’t know, doc. Their approach sounds an awful lot like ‘reclaiming.’ I got to hand it to you, you had me going for awhile. Those visualization exercises? I was getting so good that I could even visualize stuff that never happened. I bet you could visualize me right into Therese’s head.”\n I turn to Alice and Mitch. “You’ve got a decision to make. Dr. Mehldau’s program is a bust. So are you sending me off to brainwashing camp or not?”\n Mitch has his arm around his wife. Alice, amazingly, is dry-eyed. Her eyes are wide, and she’s staring at me like a stranger.\n It rains the entire trip back from Baltimore, and it’s still raining when we pull up to the house. Alice and I run to the porch steps, illuminated by the glare of headlights. Mitch waits until Alice unlocks the door and we move inside, and then pulls away.\n “Does he do that a lot?” I ask.\n “He likes to drive when he’s upset.”\n “Oh.” Alice goes through the house, turning on lights. I follow her into the kitchen.\n “Don’t worry, he’ll be all right.” She opens the refrigerator door and crouches down. “He just doesn’t know what to do with you.”\n “He wants to put me in the camp, then.”\n “Oh, not that. He just never had a daughter who talked back to him before.” She carries a Tupperware cake holder to the table. “I made carrot cake. Can you get down the plates?”\n She’s such a small woman. Face to face, she comes up only to my chin. The hair on the top of her head is thin, made thinner by the rain, and her scalp is pink.\n “I’m not Therese. I never will be Therese.”\n “Oh I know,” she says, half sighing. And she does know it; I can see it in her face. “It’s just that you look so much like her.”\n I laugh. “I can dye my hair. Maybe get a nose job.”\n “It wouldn’t work, I’d still recognize you.” She pops the lid and sets it aside. The cake is a wheel with icing that looks half an inch thick. Miniature candy carrots line the edge.\n “Wow, you made that before we left? Why?”\n Alice shrugs, and cuts into it. She turns the knife on its side and uses the blade to lever a huge triangular wedge onto my plate. “I thought we might need it, one way or another.”\n She places the plate in front of me, and touches me lightly on the arm. “I know you want to move out. I know you may never want to come back.”\n “It’s not that I—”\n “We’re not going to stop you. But wherever you go, you’ll still be my daughter, whether you like it or not. You don’t get to decide who loves you.”\n “Alice . . . ”\n “Shssh. Eat your cake.”\n Originally published in Asimov’ Science Fiction, September 2005.\n Daryl Gregory writes genre-mixing novels, stories, and comics. His novel Spoonbenders is out now from Knopf. Other recent work includes the young adult novel Harrison Squared and the novella We Are All Completely Fine, which won the World Fantasy and Shirley Jackson awards, and was a finalist for the Nebula, Sturgeon, and Locus awards. His novels include Afterparty, an NPR and Kirkus best fiction book of 2014; Raising Stony Mayhall; The Devil's Alphabet; and the Crawford-Award-winning Pandemonium. Many of his short stories are collected in Unpossible and Other Stories."}