{"fingerprint": "Fm2Mw+yylLP9Mpa5ySjb/8/fzCM=", "sitename": "Clarkesworld Magazine", "title": "Dark Angels: Insects in the Films of Guillermo del Toro by Orrin Grey", "author": "Orrin Grey", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/grey_03_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dark Angels: Insects in the Films of Guillermo del Toro by Orrin Grey", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nDark Angels: Insects in the Films of Guillermo del Toro\nIt’s no secret that Guillermo del Toro loves bugs. Insects and insect imagery play a major role in just about every movie in his filmography, from the fly-in-amber ghosts of The Devil’s Backbone to the Reapers of Blade 2 and the vampires of The Strain, with their hive-like social structures and insectile proboscises. Even Hellboy 2 and Pacific Rim prominently featured swarming tooth fairies and kaiju skin parasites, respectively.\nMost of the time, these insects serve a primarily visual role, lending verisimilitude to a creature design or inspiring a monster’s behavior patterns, but del Toro’s inclination toward the insect doesn’t end with aesthetic appreciation. In several of his films, insects take on a more thematically dense role, their presence assuming an almost religious significance, with connections to divinity, the underworld, and eternal life.\nCronos (1993)\n“Cronos is about immortality,” Guillermo del Toro says in Cabinet of Curiosities.1 Shot when he was only twenty-nine, it is the director’s first feature film, and also the one that lays the groundwork for many of the insect themes that will appear later in his oeuvre. The titular Cronos Device is a small, golden mechanism in the shape of an insect—with a living insect trapped inside—that grants its user eternal life by transforming them into something that we would recognize as a vampire.\nDel Toro has said that his design of the Cronos Device was inspired by the jewel-encrusted Maquech Beetles that were popular as living jewelry when he was growing up in Mexico2 , but the Device also bears an obvious similarity to a reliquary, used to house the remains of saints. This similarity is only underscored by del Toro’s choice to first reveal the Device hidden inside the base of an archangel statue. In the commentary track for Cronos, del Toro says that he wanted the Catholic image of the archangel to hold inside itself the promise of a “more prosaic, more tangible eternal life.”3 It’s the first time that del Toro juxtaposes insects with Catholic imagery in his films, but it won’t be the last.\nIn his commentary, he describes his inspiration for the Device, which came from alchemy. What most people know about alchemy is that it was the quest to find a way to transform lead into gold, but del Toro talks about the search for the “ultimate depuration of vile matter—be it lead or flesh—and turn it into the ultimate expression of itself. Be it gold or eternal life, eternal flesh.”4 The Device—through the living insect trapped inside it—draws out mortal blood, filters it, and replaces it, adding a drop of the alchemical “Fifth Essence” which brings with it eternal life.\nNot only does Cronos mark the beginning of del Toro’s habit of linking insects with everlasting life, it also prefigures several of the themes that will come to play in his second film, Mimic, as the villainous industrialist de la Guardia in Cronos muses, “Who says insects aren’t God’s favored creatures?” It’s a sentiment that was meant to be echoed by the protagonists of Mimic years later, though the lines wound up on the cutting room floor.5 De la Guardia ultimately takes his reasoning further than Mimic was ever meant to, comparing insects to Jesus Christ and pointing out that, “the matter of the Resurrection is related to ants, to spiders,” as he describes spiders returning from seeming death after having been trapped in rock for years.\nAn anecdote from the set of Cronos tells as much about Guillermo del Toro the filmmaker as it does about the importance of insects in his films: The original budget for Cronos didn’t contain enough money to film the shots of the interior of the titular Device. Producers assured del Toro that he didn’t need the shots, but del Toro disagreed, and ended up selling his van in order to pay for the construction of a massive animatronic replica of the inside of the device—complete with rubber insect—through which the camera could be slowly passed. What could have been a silly or pointless sequence in less dedicated hands becomes not only a nod to the monster movie origins of Cronos, but also a profound moment of cinematic magic, one that shows the insect not as a monster or an angel, but as much a victim as any of the film’s human characters. It is perhaps the greatest condemnation of the allure of immortality in Cronos, as we see the insect suffering, trapped inside its golden prison, but unable to die.\nMimic (1997)\nIn the filmography of almost any visionary director, there is bound to be at least one film that represents a compromise between the director’s vision and the demands of the filmmaking machine. For Guillermo del Toro, that film was Mimic, his second feature and his first studio film. For years it was available only in a theatrical cut that lacked del Toro’s seal of approval, but recently a director’s cut, fully color-corrected by del Toro himself, was released onto Blu-ray. The director’s cut did more than just remove jump scares and action beats shot by the second unit; it returned the picture to something more closely resembling the director’s original vision, and brought the film’s symbolic elements more to the foreground.\n“I wanted to make them God’s favorite creatures, angels,” del Toro says of the film’s giant Judas Breed insects in Cabinet of Curiosities. “I wanted very much to indicate that God favored our downfall as a species.”6 On the opposite page is an image from one of del Toro’s ubiquitous notebooks, in which a man is “prostrating himself before the godlike figure of the man-shaped insect, a shaft of sunlight sweeping diagonally across them from on high, as if God were passing judgment.” 7\nIn the original screenplay, one of the characters was meant to take up de la Guardia’s chorus from Cronos, with lines like, “What if God is fed up with us? What if insects are now God’s favorite creatures?”8 Unfortunately, none of this dialogue made it into the final screenplay, leaving the heavy lifting of the film’s thematic concerns almost entirely in the hands of the visuals. The director’s cut does restore a scene of a woman calling the Judas Breed what del Toro called them in early treatments for the film, “dark angels.”9\nThe first time we see the Judas Breed is in and around a run-down inner city church. The film’s first on-screen fatality is a priest who falls to his death in front of a huge neon cross that reads, “Jesus Saves.” Inside the decaying church, the Judas Breed blend in with the plastic-wrapped figures of saints, familiar imagery for viewers of Cronos with its hanging gallery of archangels wrapped in plastic sheeting. In his commentary for Mimic, del Toro says that he wrapped the saints in plastic to make them “obsolete, out-of-order holy figures.” 10\n“We created the church and the despoiled figures again in the idea that the natural order of the sanctity of the world and our place in creation was being subverted, and that the new fathers and mothers of the world were insects,”11 del Toro continues in his commentary track. As the film progresses, this subversion is driven home again and again through careful visual choices. From the color coding, which makes it feel as if the “humans are insects trapped in amber,”12 to a dramatic change of scale in the film’s final acts, in which the humans find themselves in a massive underground subway station, effectively reduced to the size of insects, scurrying around, desperately trying to accomplish menial tasks, while the “dark angels” can climb the walls with ease or effortlessly fly around them.\nAmong the many struggles that del Toro describes when talking about the making of Mimic are his efforts to ensure that the character of Dr. Peter Mann wears glasses. “I like the idea of showing how imperfect mankind is,” del Toro says in Cabinet of Curiosities. “The insects in Mimic were all organic, but mankind needed glasses, artificial limbs. The mimics are the perfect ones, not us.”13 The value of human imperfection is another subject that comes up again and again in Guillermo del Toro’s filmography, and the dichotomy of the mechanistic perfection of the insect is one that he also brings up in the commentary track for Cronos, where he says, “I do happen to believe that insects, as far as form and function, are the most perfect—albeit soulless—creatures of creation.”14\nPan’s Labyrinth (2006)\nIf asked to identify the single most recurrent theme in Guillermo del Toro’s body of work, “the value of human imperfection and the choices that we make because of it” would probably be a pretty good start. While del Toro’s sixth feature and his third—and most widely celebrated—Spanish-language film may not seem to have a lot to do with insects at first glance, it does have a lot to do with choice and human imperfection, and it features an insect in a particularly key role.\nWe are first introduced to the insect in one of the earliest sequences of Pan’s Labyrinth, where we see it crawling out of the statue of a saint, continuing del Toro’s habit of equating insects with Catholic imagery. It’s also the last time it will happen in the film, though, breaking the insect free of its previous Catholic trappings in Cronos and Mimic and eventually equating it with a more pagan conception of eternal life. During this sequence, as the human protagonists arrive at the mill where most of the rest of the film will take place, our focus stays on the insect as it flits between the trees. In his commentary track, del Toro says, “I wanted to emphasize with the camera how important the insect was.”15\nFreed from the Catholic imagery of Cronos or Mimic, the insect in Pan’s Labyrinth is also distinct from the more oppressive or ominous themes of the insects in those films. No longer a “dark angel” passing divine judgment, the insect instead acts as a psychopomp, not only literally leading Ofelia into the labyrinth, but also serving as a visual transition device that signals to the viewer a shift from the “real world” of fascist-occupied Spain to the film’s fairytale underworld.\nIn most traditions, the psychopomp’s job is not to pass judgment on the dead, but merely to provide them safe passage into the underworld. In this way, the insect in Pan’s Labyrinth is very different from the Cronos Device or the “dark angels” of Mimic, acting as a bridge to eternal life, rather than a means of obtaining it, or an alternative to it.\nOver the years since the film’s release, much has been made about whether the magical elements of Pan’s Labyrinth are intended to be objectively “real” within the film, and del Toro himself has called the film a “litmus test” for audiences.16 By any reading, though, there are obvious parallels between the fairytale world of the film and the afterlife of many religious traditions. Del Toro has pointed to Ofelia’s choices at the end of the movie as her “giving birth to herself,”17 a theme that recurs in many of his projects. It’s telling that the last image of Pan’s Labyrinth is not of Ofelia in the fairy world, but of a flower blooming on the formerly dead tree that she saved from the toad in the “real world.” Here we see a purer kind of eternal life than the one offered by the Cronos Device, an immortality in which our choices today promote new life in the future.\nFOOTNOTES:\n1 Del Toro, Guillermo and Marc Scott Zicree. Cabinet of Curiosities. New York: Harper Design, 2013. 84\nOrrin Grey is a writer, editor, amateur film scholar, and monster expert who was born on the night before Halloween. He's the author of Never Bet the Devil & Other Warnings and of the forthcoming Painted Monsters & Other Strange Beasts. His favorite Guillermo del Toro movie is probably Pacific Rim, and you can find him online at orringrey.com, where he writes about monsters, movies, and monster movies, among other things."}