{"fingerprint": "WcRo+wBDUhJ27vz5bSBdHPY1YGg=", "sitename": "Clarkesworld Magazine", "title": "It Takes Two by Nicola Griffith", "author": "Nicola Griffith", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/griffith_02_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: It Takes Two by Nicola Griffith", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11580 words, novelette, REPRINT\n It Takes Two\n It began, as these things often do, at a bar—a long dark piece of mahogany along one wall of Seattle’s Queen City Grill polished by age and more than a few chins. The music was winding down. Richard and Cody (whose real name was Candice, though no one she had met since high school knew it) lived on different coasts, but tonight was the third time this year they had been drinking together. Cody was staring at the shadows gathering in the corners of the bar and trying not to think about her impersonal hotel room. She thought instead of the fact that in the last six months she had seen Richard more often than some of her friends in San Francisco, and that she would probably see him yet again in a few weeks when their respective companies bid on the Atlanta contract.\n She said, “You ever wonder what it would be like to have, you know, a normal type job, where you get up on Monday and drive to work, and do the same thing Tuesday and Wednesday and Thursday, every week, except when you take a vacation?”\n “You forgot Friday.”\n “What?” They had started on mojitos, escalated through James Bonds, and were now on a tequila-shooter-with-draft-chaser glide path.\n “I said, you forgot Friday. Monday, Tuesday—”\n “Right,” Cody said. “Right. Too many fucking details. But did you ever wonder? About a normal life?” An actual life, in one city, with actual friends.\n Richard was silent long enough for Cody to lever herself around on the bar stool and look at him. He was playing with his empty glass. “I just took a job,” he said. “A no-travel job.”\n “Ah, shit.”\n They had met, just after the first dotcom crash, at a graduate conference on synergies of bio-mechanics and expert decision-making software architecture or some such crap, which was wild because he started out in cognitive psychology and she in applied mathematics. But computers were the alien glue that made all kinds of odd limbs stick together and work in ways never intended by nature. Like Frankenstein’s monster, he had said when she mentioned it, and she had bought him a drink, because he got it. They ran into each other at a similar conference two months later, then again at some industry junket not long after they’d both joined social media startups. The pattern repeated itself, until, by the time they were both pitching venture capitalists at trade shows, they managed to get past the required cool, the distancing irony, and began to email each other beforehand to arrange dinners, drinks, tickets to the game. They were young, good-looking, and very, very smart. Even better, they had absolutely no romantic interest in each other.\n Now when they met it was while traveling as representatives of their credit-starved companies to make increasingly desperate pitches to industry-leading Goliaths on why they needed the nimble expertise of hungry Davids.\n Cody hadn’t told Richard that lately her pitches had been more about why the Goliaths might find it cost effective to absorb the getting-desperate David she worked for, along with all its innovative, motivated, boot-strapping employees whose stock options and 401(k)s were now worthless. But a no-travel job meant only one thing, and going back to the groves of academe was really admitting failure.\n She sighed. “Where?”\n “Chapel Hill. And it’s not . . . Well, okay, it is sort of an academic job, but not really.”\n “Uh-huh.”\n “No, really. It’s with a new company, a joint venture between WishtleNet and the University of North—”\n “See.”\n “Just let me finish.” Richard could get very didactic when he’d been drinking. “Think Google Labs, or Xerox PARC, but wackier. Lots of money to play with, lots of smart grad students to do what I tell them, lots of blue sky research, not just irritating Vice Presidents saying I’ve got six months to get the software on the market, even if it is garbage.”\n “I hear you on that.” Except that Vince, Cody’s COO, had told her that if she landed the Atlanta contract she would be made a VP herself.\n “It’s cool stuff, Cody. All those things we’ve talked about in the last six, seven years? The cognitive patterning and behavior mod, the modulated resonance imaging software, the intuitive learning algorithms—”\n “Yeah, yeah.”\n “—they want me to work on that. They want me to define new areas of interest. Very cool stuff.”\n Cody just shook her head. Cool. Cool didn’t remember to feed the fish when you were out of town, again.\n “Starts next month,” he said.\n Cody felt very tired. “So you won’t be in Atlanta.”\n “Nope.”\n “Atlanta in August. On my own. Jesus.”\n “On your own? What about all those pretty girls in skimpy summer clothes?”\n The muscles in Cody’s eyebrows felt tight. She rubbed them. “It’s Boone I’m not looking forward to. Boone and his sleazy strip club games.”\n “He’s the customer.”\n “Your sympathy’s killing me.”\n He shrugged. “I thought that lap-dancing hooker thing was your wet dream.”\n Her head ached. Now he was going to bring up Dallas.\n “That’s what you told us in—now where the hell was that?”\n “Dallas.” Might as well get it over with.\n “You were really into it. Are you blushing?”\n “No.” Three years ago she had been twenty-eight with four million dollars in stock options and the belief that her coding cowboy colleagues were her friends. Ha. And now probably half the geeks in the South had heard about her most intimate fantasy. Including Boone.\n She swallowed the last of her tequila. Oily, ugly stuff once it got tepid. She picked up her jacket.\n “I’m out of here. Unless you have any handy hints about landing that contract without playing Boone’s slimeball games? Didn’t think so.” She pushed her shot glass away and stood.\n “That Atlanta meeting’s when? Eight, nine weeks?”\n “About that.” She dropped two twenties on the bar.\n “I maybe could help.”\n “With Boone? Right.” But Richard’s usually cherubic face was quite stern.\n He fished his phone from his pocket and put it on the bar. He said, “Just trust me for a minute,” and tapped the memo icon. The icon winked red. “Whatever happens, I promise no one will ever hear what goes on this recording except you.”\n Cody slung on her jacket. “Cue ominous music.”\n “It’s more an, um, an ethics thing.”\n “Jesus, Richard. You’re such a drama queen.” But she caught the bartender’s eye, pointed to their glasses, and sat.\n “I did my Atlanta research too,” he said. “Like you, I’m pretty sure what will happen after you’ve made your presentations to Boone.”\n “The Golden Key,” she said, nodding. Common knowledge. The sun rises, the government taxes, Boone listens to bids and takes everyone to the Golden Key.\n “—but what I need to know from you is whether or not, to win this contract, you can authorize out-of-pocket expenses in the high five figures.”\n She snorted. “Five figures against a possible eight? What do you think?”\n He pointed at the phone.\n “Fine. Yes. I can approve that kind of expense.”\n He smiled, a very un-Richardlike sliding of muscle and bone, like a python disarticulating its jaw to swallow a pig. Cody nearly stood up, but the moment passed.\n “You’ll also have to authorize me to access your medical records,” he said.\n So here they were in Marietta, home of the kind of Georgians who wouldn’t fuck a stranger in the woods only because they didn’t know who his people were: seven men and one woman stepping from Boone’s white concrete and green glass tower into an August sun hot enough to make the blacktop bubble. Boone’s shades flashed as he turned to face the group.\n “All work and no play makes Jack a dull boy. And Jill,” with a nod at Cody, who nodded back and tried not to squint. Squinting made her look like a moron: not good when all around you were wearing sleek East Coast summer business clothes and gilded with Southern tans. At least the guy from Portland had forgotten his shades too.\n They moved in a small herd across the soft, sticky parking lot: the guy from Boston would have to throw away his fawn loafers.\n Boone said to the guy from Austin, “Dave, you take these three. I know you know where we’re going.”\n “Sure do,” Dave said, and the seven boys shared that we’re-all-men-of-the-world-yes-indeedy laugh. Cody missed Richard. And she was still pissed at the way he’d dropped the news on her only last week. Why hadn’t he told her earlier about not coming to Atlanta? Why hadn’t he told her in Seattle? And a university job: what was up with that? Loser. But she wished he was here.\n Boone’s car was a flashy Mercedes hybrid in silver. He opened the passenger door with a Yeah-I-know-men-and-women-are-equal-but-I-was-born-in-the-south-so-what-can-you-do? smile to which Cody responded with a perfect, ironic lift of both eyebrows. Hey, couldn’t have managed that in shades. The New York guy and Boston loafers got in the back. The others were climbing into Dave’s dark green rental SUV. A full-sized SUV. Very uncool. He’d lose points for that. She jammed her seatbelt home with a satisfying click.\n As they drove to the club, she let the two in the back jostle for conversational space with Boone. She stared out of the window. The meeting had gone very well. It was clear that she and Dave and the guy from Denver were the only ones representing companies with the chops for this contract, and she was pretty sure she had the edge over the Denver people when it came to program rollout. Between her and Dave, then. If only they weren’t going to the Golden Key. God. The thought of all those men watching her watch those women and think they knew what she was thinking made her scalp prickle with sweat. In the flow of conditioned air, her face turned cold.\n Two days before she left for Atlanta she’d emailed Vince to explain that it wasn’t her who would be uncomfortable at the strip club, but the men, and that he should at least consider giving Boone a call and setting her presentation up for either the day before or the day after the others. She’d got a reply half an hour later, short and to the point: You’re going, kid, end of story. She’d taken a deep breath and walked over to his office.\n He was on the phone, pacing up and down, but waved her in before she could knock. He covered the receiver with one hand, “Gotta take this, won’t be long,” and went back to pacing, shouting, “Damn it, Rick, I want it done. When we had that meeting last week you assured me— Yeah. No problem, you said. No fucking problem. So just do it, just find a way.” He slammed the phone down, shook his head, turned his attention to her. “Cody, what can I do for you? If it’s about this Atlanta thing I don’t want to hear it.”\n “Vince—”\n “Boone’s not stupid. He takes people to that titty club because he likes to watch how they behave under pressure. You’re the best we’ve got, you know that. Just be yourself and you won’t fuck up. Give him good presentation and don’t act like a Girl Scout when the nipples start to show. Can you handle that?”\n “I just resent—”\n “Jesus Christ, Cody. It’s not like you’ve never seen bare naked ladies before. You want to be a VP? Tell me now: yes or no.”\n Cody took a breath. “Yes.”\n “Glad to hear it. Now get out of here.”\n The Golden Key was another world: cool, and scented with the fruity overtones of beer; loud, with enough bass to make the walls of her abdomen vibrate; dark at the edges, though lushly lit at the central stage with its three chrome poles and laser strobes. Only one woman was dancing. It was just after six, but the place was already half full. Somewhere, someone was smoking expensive cigars. Cody wondered who the club paid off to make that possible.\n Boone ordered staff to put two tables together right by the stage, near the center pole. The guy from New York sat on Boone’s left, Dave on his right. Cody took a place at the end, out of Boone’s peripheral vision. She wouldn’t say or do anything that wasn’t detached and ironic. She would be seamless.\n A new dancer: shoulder-length red hair that fell over her face as she writhed around the right hand pole. She wore a skirt the size of a belt, and six inch-heels of translucent plastic embedded with suggestive pink flowers. Without the pole she probably couldn’t even stand. Did interesting things to her butt, though, Cody thought, then patted surreptitiously at her upper lip. Dry, thank god. Score one for air conditioning.\n New York poked her arm. He jerked his thumb at Boone, who leaned forward and shouted, “What do you want to drink?”\n “Does it matter?”\n He grinned. “No grape juice playing at champagne here. Place takes its liquor seriously.”\n Peachy. “Margarita. With salt.” If it was sour enough she wouldn’t want to gulp it.\n The dancer hung upside down on the pole and undid her bra. Her breasts were a marvel of modern art, almost architectural.\n “My God,” she said, “it’s the Hagia Sophia.”\n “What?” New York shouted. “She’s called Sophia?”\n “No,” Cody shouted back, “her breasts . . . Never mind.”\n “Fakes,” New York said, nodding.\n The drinks came, delivered by a blonde woman wearing nothing but a purple velvet G-string and a smile. She called Boone Darlin’—clearly he was a regular—and Cody Sugar.\n Cody managed to lift her eyes from the weirdness of unpierced nipples long enough to find a dollar bill and drop it on the drinks tray. Two of the guys were threading their tips under the G-string: a five and a ten. The blonde dropped Cody a wink as she walked away. New York caught it and leered. Cody tried her margarita: very sour. She gulped anyway.\n The music changed to a throbbing remix of mom music: the Pointer Sisters’ “Slowhand.” The bass line was insistent, pushing on her belly like a warm hand. She licked her lips and applied herself to her drink. Another dancer with soft black curls took the left hand pole, and the redhead moved to center stage on her hands and knees in front of their table, rotating her ass in slow motion, looking at them over her shoulder, slitting her eyes at them like a cat. Boone, Dave, all the guys had bills in their hands: “Ooh mama, I’ve got what you need.” The redhead backed towards them in slow motion, arching her spine now in apparent ecstasy—but not so far gone as to ignore the largest bill at the table: Boone’s twenty. She let him tease her with it, stroking up the inside of her thigh and circling a nipple, before she held out the waistband of the pseudo-skirt for the twenty. They probably didn’t notice that she plucked them of their bills in order—Boone’s twenty, Dave’s ten, the two fives. Then she was moving to her right, to a crowd of hipster suits who had obviously been there longer than was good for them: two of them were holding out fifties. The dancer pretended to fuck the fifty being held out at pelvis level. She had incredible muscle control. Next to Cody, New York swallowed hard, and fumbled for his wallet. But it was too late. The hipster was grinning hard as the redhead touched his cheek, tilted her head, said something. He stood and his friends hooted encouragement as he and the redhead disappeared through a heavily frosted glass door in the back.\n “Oh, man . . . ” Dave’s face was more red than tan, now. He pulled a fifty from his wallet, snapped it, folded it lengthways, and held it out over the stage to the remaining dancer. “Yo, curlyhead, come and get some!”\n “Yeah!” said New York in a high voice. Portland and Boston seemed to be engaged in a drinking game.\n Boone caught Cody’s eye and smiled slightly. She shrugged and spread her hand as if to say, Hey, it’s their money to waste, and he smiled again, this time with a touch of skepticism. Ah, shit.\n “Sugar?” The waitress with the velvet G-string, standing close and bending down so that her nipples brushed Cody’s hair, then dabbed her cheek.\n Cody looked at her faded blue eyes and found a ten dollar bill. She smiled and slipped it into the G-string at the woman’s hip and crooked a finger to make her bend close again.\n “I’d take it as a personal favor if you brought me another of these wonderful margaritas,” she said in the woman’s ear, “without the tequila.”\n “Whatever you say. But I’ll still have to charge for the liquor.”\n “Of course you do. Just make sure it looks good.” Cody jerked her head back at the rest of the table.\n “You let me take care of everything, sugar. I’m going to make you the meanest looking margarita in Dixie. They’ll be amazed, purely amazed, at your stamina. It’ll be our little secret.” She fondled Cody’s arm and shoulder, let the back of her hand brush the side of Cody’s breast. “My name is Mimi. If you need anything, later.” She gave Cody a molten look and headed for the bar. The skin on her rotating cheeks looked unnaturally smooth, like porcelain. Cosmetics, Cody decided.\n Curlyhead had spotted Dave’s fifty and was now on her back in front of their table. Cody imagined her as a glitched wigglebot responding to insane commands: clench, release, arch, whip back and forth. Whoever had designed her had done a great job on those muscles: each distinct, plump with strength, soft to the touch. Shame they hadn’t had much imagination with the facial expressions or managed to put any spark in the eyes.\n Breasts swaying near her face announced the arrival of her kickless drink. She slipped a ten from her wallet and reached for Mimi’s G-string.\n Mimi stepped back half a pace, put her tray down, and squeezed her breasts together with her hands. “Would you like to put it here instead, Sugar?”\n Cody blinked.\n “You could slide it in real slow. Then maybe we could get better acquainted.” But like the wigglebot, her eyes stayed blank.\n “You’re too hot for me, Mimi.” Cody snapped the bill into her G-string and tried not to feel Mimi’s flash of hatred. She sipped her drink and took a discreet peek in her wallet. This was costing the company a fortune.\n Boone watched Dave and New York with a detached expression. Then he turned her way with a speculative look. An invitation to talk?\n She stood. And turned to look at the stage just as a long-haired woman in cowboy boots strode to the center pole.\n For Cookie it was all routine so far, ankle holding up better than she thought it might. The boots helped. She couldn’t remember when she’d written that note to herself, Cowboys and Indians! but it was going to be inspired. She flexed and bent and pouted and pointed her breasts on automatic pilot. Should she get the ankle X-rayed? Nah. It was only a sprain. Two ibuprofen and some ice would fix it.\n Decent crowd for a Tuesday night. Some high spenders behind the pillar there, but Ginger had taken them for four lapdances already. Well, hey, there were always more men with more money than sense. She glanced into the wings. Danny had her hat. He nodded. She moved automatically, counted under her breath, and just as the first haunting whistle of Morricone’s “The Good, the Bad, and the Ugly” soundtrack echoed from the speakers she held out her hand, caught the hat, and swept it onto her head. Ooh, baby, perfect today, perfect. She smiled and strutted downstage. A woman at the front table was standing. Cookie saw the flash of a very expensive watch, and for no particular reason was flooded with conviction that tonight was going to go very well indeed. Cookie, baby, she told herself, tonight you’re gonna get rich.\n And with that catch of the hat, that strut, just like that, Cody forgot about Boone and his contract, forgot about being seamless, forgot everything. The dancer was fine, lean and soft, strong as a deer. The name Cookie was picked out in rhinestones on her hat, and she wore a tiny fringed buckskin halter and something that looked like a breechclout—flaps of suede that hung from the waist to cover front and back, but not the sides—and wicked spurs on the boots. She looked right at Cody and smiled, and her eyes were not blank.\n Part of Cody knew that Boone had seen her stand, and was now watching her watch this dancer, and that she should stop, or sit, or keep walking to Boone’s end of the table, but the other part—the part that liked to drink shots in biker bars, to code all night with Acid Girls pounding from the speakers and the company’s fortunes riding on her deadline, the part that had loaded up her pickup and left Florida to drive all the way to the West Coast on her own when she was just nineteen, that had once hung by her knees from a ninth floor balcony just because she could—that part cared about nothing but this woman with the long brown hair.\n The hair was Indian straight and ended just one inch above the hem of the breechclout, and the way she moved made Cody understand that the hat and spurs were trophies, taken from a dead man. When the dancer trailed her hands across her body, Cody knew they held knives. When the male voices began their rhythmic chanting, she could see this woman riding hard over the plain, vaulting from her pony, stripping naked as she walked.\n The music shifted but again it was drums, and now Cookie swayed like a maiden by a pool, pulling the straps of her halter off her shoulders, enough to expose half her breasts but not all, and she felt them thoughtfully, and began to smear them with warpaint. When she had painted all she could see, she pushed the buckskin down further, so that each breast rested like a satsuma on its soft shelf, then she turned her back on the audience, twisted her hair over one shoulder and examined the reflection of her ass in the water. She turned a little, this way and that, lifting the back flap, one corner then another, dropping it, thinking, stroking each cheek experimentally, trying to decide how to decorate it. Then she smoothed the buckskin with both hands so it pulled tight, and studied that effect. She frowned. She traced the outline of her G-string with her index finger. She smiled. She stuck her butt out, twitched it a couple of times, hooked both thumbs in the waistband of her G-string, and whipped it off. The breechclout stayed in place. She was still wearing the halter under her breasts.\n And the little dyke liked that, Cookie could tell. She smiled smooth as cream, danced closer, saw the stain creeping up the woman’s cheeks, the way her lips parted and her hands opened. Professionally manicured hands; clothes of beautifully cut linen, shoes handmade. The men in the room faded to irritation. This was the prize.\n One of the men at the table reached out and slipped a twenty between the rawhide tie of her breechclout and her hip, but Cookie barely took her eyes from the woman. Twenty here or fifty there was small change compared to this. For you, she mouthed and turned slightly, and tightened down into a mushroom of skin-sheathed muscle, took off her hat, and reached back and pulled the flap of her breechclout out of the way.\n She was aware of some shouting, the tall guy with the red face and the fifty but she kept her eyes fixed on the woman.\n And then the music changed, and Ginger was back from her lapdance, and she saw Christie was hand in hand with a glazed-looking mark, about to leave for the backroom, and it was time for her to put some of her clothes back on and work the floor.\n Five minutes, she mouthed to the woman.\n Cookie, Cody thought, as the dancer flicked the suede flap back in place, stood gracefully, and put her hat back on. Cookie. She watched as Cookie left the stage and took all the heat and light with her. She would come back, wouldn’t she? Five minutes, she had said.\n “Cunt!” Dave shouted again, “my money not good enough for you? Goddamned— No, you get off of me.” He pushed Boone’s hand from his arm, then realized what he’d done. “Shit. That’s— It’s just— You know how it is, man. But fifty bucks . . . ”\n “Hell, Dave, maybe she knew it was counterfeit,” Boone said jovially.\n Dave forced a laugh, thrust the bill in his pocket. “Yeah, or maybe she just doesn’t understand size matters.” Boone laughed, but everyone at the table heard the dismissive note.\n “Maybe it’s time to call it a night, folks.”\n But Cody wasn’t listening because Cookie was standing before her: no hat, buckskins and G-string back in place.\n “Okay guys, looks like we lost Cody.” Boone laughed, nothing like the laugh he’d given Dave. “Hey, girl, you make sure you get a cab home, hear? Mention my name to the doorman. Come on guys, we’re outta here.”\n “Cody. Is that your name?” said Cookie, and took her hand. Cody nodded dumbly. “I’m Cookie. It’s so good to find another woman here.”\n Another nod. How are you? Cody wanted to say, but that made no sense.\n “Would you like to dance with me? Just you and me in private?”\n “Yes.”\n “We’d have to pay for the room.”\n “Yes.”\n “I love dancing for women. It gets me going, turns me on. I understand what women want, Cody. Would you like me to show you?”\n “Yes,” said Cody, and was mildly amazed when her legs worked well enough to follow Cookie to the frosted glass door.\n Midnight in her hotel room. Cody sat on the bed, naked, too wired to lie down. Streetlight slanted through the unclosed drapes, turning the room sodium yellow. The air conditioning roared, but her skin burned. Cookie. Cookie’s lips, Cookie’s hips, Cookie’s cheek and chin and belly. Her thighs and ass and breasts. Oh, her breasts, their soft weight on Cody’s palms.\n She lifted her hands, turned her palms up, examined them. They didn’t look any different. She unsnapped her watch rubbed her wrist absently. Cookie.\n Stop it. What the fuck was the matter with her? She’d gone to a strip club and had sex for money. It was a first, okay, so some confusion was to be expected, but it was sordid, not romantic. She had been played by an expert and taken for hundreds of dollars. Oh, God, and Boone . . . She had made a fucking fool of herself.\n So why did she feel so happy?\n Cody, you’re so beautiful, she’d said. Oh, yes, yes, don’t stop, Cody. Give it to me, give me all of it. And Cody had. And Cookie had . . . Cookie had been perfect. She had understood everything, anticipated everything. What to say, what to do, when to cajole and goad, when to smile and be submissive, when to encourage, when to resist. Like a mind reader. And she had felt something, Cody knew it. She had. You couldn’t fake pupil dilation, you couldn’t fake that flush, you couldn’t fake that sheen of sweat and luxuriant slipperiness. Could you?\n Christ. She going mad. She rubbed her eyebrows. Cookie was a pro, and none of it was real.\n She got up. The woolen carpet made her bare feet itch. That was real. Her clothes were flung across the back of the chair by the desk; they reeked of cigar smoke. No great loss. She’d no idea why she’d chosen to wear those loose pants, anyway. Hadn’t worn them for about a year. Hadn’t worn that stupid watch for about as long, come to think of it. Cookie hated the smell of cigars, she’s said so, when she was unbuttoning—\n Stop it. Stop it now.\n She carried her pants to the bed and pulled the receipts from the pockets. Eight of them. She’d paid for eight lapdances, and the size of the tips . . . Jesus. That was two month’s rent. What had she been thinking?\n We have to pay for the room, Cookie said, but I’ll pay you half back. It’s just that I can’t wait. Oh, please, Cody. I want you again.\n “God damn it!” Her ferocity scared her momentarily and she stilled, listening. No stirrings or mutterings from either room next door.\n Give me your hotel phone number, Cookie had said. I’ll call you tomorrow. This has never happened before. This is real.\n And if it was . . . She could reschedule her flight. She’d explain it to Vince somehow.\n Christ. That huge contract gone, in a flash of lust. Vince would kill her.\n But, oh, she’d had nearly three hours of the best sex she’d ever had. It had gone exactly the way she’d imagined it in her fantasies. I know just what you want, Cookie had said, and proved it.\n But Cody had known too, that was the thing. She had known when the hoarse breath and clutching hands meant it was Cookie’s turn, meant that Cookie now wanted to be touched, wanted to break every single personal and club rule and be fucked over the back of the chair, just for pleasure.\n Cody stirred the receipts. She couldn’t make it make sense. She had paid for sex. That was not romance. But she had felt Cookie’s vaginal muscles tighten, felt that quiver in her perineum, the clutch and spasm of orgasm. It wasn’t faked. It hadn’t been faked the second time, either.\n Cody shivered. The air conditioning was finally beginning to bite. She rubbed her cold feet. Cookie’s feet were long and shapely, each toe painted with clear nail polish. She’d twisted her ankle, she’d said. Cody had held the ankle, kissed it, stroked it. Cookie’s smile was beautiful. How did you sprain it? Cody had asked, and Cookie had told her about falling five feet from the indoor climbing wall, and they had talked about climbing and rafting, and Cody had told her of the time when she was seven and had seen Cirque de Soleil and wanted to be one of the trapeze artists, and that led to talk of abdominal muscles, which led to more sex.\n She padded into the bathroom, still without bothering with the light. When she lifted her toothbrush to her mouth, the scent on her fingers tightened her muscles involuntarily. She dropped the toothbrush, leaned over the sink, and wept.\n A blue, blue Atlanta morning. Cody hadn’t slept. She didn’t want breakfast. Her plane wasn’t until four that afternoon.\n She’d lost the contract, lost a night’s sleep, lost her mind and her self-respect, and flushed two months’ rent down the toilet. She would never see Cookie again—and she couldn’t understand why she cared.\n The phone rang. Cookie! she thought, and hated herself for it.\n “Hello?”\n “Your cell phone’s off, but I called Vince back in Frisco and he told me you were at the Westin.”\n Boone. She shut her eyes.\n “Plane’s not til four, am I right? Cody, you there?”\n “Yes. I’m here.”\n “If you’re not too tuckered out, maybe you wouldn’t mind dropping by my office. We’ll give you lunch.”\n “Lunch?”\n “Yep. You know, food. Don’t they do lunch on the West Coast?”\n “Yes. I mean, why?”\n He chuckled. “Because we’ve got a few details to hammer out on this contract. So should we say, oh, eleven-thirty?”\n “That’s, yes, fine. Good,” she said at random, and put the phone down.\n She stared at her bag. Clothes. She’d need to change her clothes. Was he really giving her the contract?\n The phone rang again. “Hello?” she said doubtfully, expecting anyone from god to the devil to reply.\n “Hey, Cody. It’s me.”\n “Richard?”\n “Yeah. Listen, how did it go?”\n “I don’t . . . Things are . . . ” She took a deep breath. “I got the contract.”\n “Hey, that’s great. But how did last night go?”\n “Christ Richard, I can’t gossip now. I don’t have the time. I’m on my way to Boone’s, iron out a few details.” She had to pull it together. “I’ll call you in a week or two, okay?”\n “No, wait, Cody. Just don’t do anything you—”\n “Later, okay.” She dropped the phone in its cradle. How did he know to call the Westin? What did he care about her night? She rubbed her forehead again. Food might help with the contract. The headache, she meant. And she grinned: the contract. She’d goddamned well won the contract. She was gonna get a huge bonus. She was gonna be a Vice President. She was gonna be late.\n In the bathroom, she picked up the toothbrush, rinsed off the smeared paste, and resolutely refused to think about last night. Cookie dialed the hotel.\n “This is Cody. Leave a message, or reach me on my cell phone,” followed by a string of numbers beginning with 216. San Francisco. That’s right. She’d told Cookie that last night: San Francisco with its fog and hills and great espresso on Sunday mornings.\n That might be okay. Anything would beat this Atlanta heat.\n Boone didn’t want to talk details so much as to laugh and drink coffee and teach Cody how to eat a po’ boy sandwich. After all, if they were gonna be working together, they should get to know each other, was he right? And there was no mention of strip clubs or lapdances until the end when he signed the letter of intent, handed it to her, and said, “I like the way you handle yourself. Now take that Austin fella, Dave. No breeding. Can’t hold his liquor, can’t keep his temper, and calls a woman names in public. But you: no boasting, no big words, you just sit quiet then seize the opportunity.” He gave her a sly smile. “You do that in business and we’ll make ourselves some money.”\n And somehow, with his clap on the back, the letter in her laptop case and the sun on her face while she waited for the car for her trip to the airport, she started to forget her confusion. She’d had great sex, she’d built the foundations of a profitable working relationship, she was thirty-one and about to be a vice president, and she didn’t even have a hangover.\n The car came and she climbed into the cool, green-tinted interior.\n She let the outside world glide by for ten minutes before she got out the letter of intent. She read it twice. Beautifully phrased. Strong signature. Wonderful row of zeroes before the decimal point. If everything stayed on track, this one contract would keep their heads above water until they could develop a few more income streams. And she had done it. No one else. Damn she was good! Someone should buy her a great dinner to celebrate.\n She got out her phone, turned it on. The signal meter wavered as the car crossed from cell to cell. Who should she call? No one in their right mind would want to have dinner with Vince. Richard would only want all the details, and she didn’t want to talk about those details yet; he was in the Carolinas, anyway. Asshole.\n The signal suddenly cleared, and her phone bleeped: one message.\n “Hey. This is Cookie. I know you don’t go until the afternoon. If you . . . I know this is weird but last night was . . . Shit. Look, maybe you won’t believe me but I can’t stop thinking about you. I want to see you, okay? I’ll be in the park, the one I told you about. Piedmont. On one of the benches by the lake. I’m going there now, and I’ll wait. I hope you come. I’ll bring doughnuts. Do you like doughnuts? I’ll be waiting. Please.”\n Oooh, you’re different, ooh, you’re so special, ooh, give it to me baby, just pay another thousand dollars and I’ll love you forever. Sure. But Cookie’s voice sounded so soft, so uncertain, as though she really meant it. But of course it would. That was her living: playing pretend. Using people.\n Cody’s face prickled. Be honest, she told herself: who really used who, here? Who got the big contract, who got to have exactly what she wanted: great sex with no complications, and on the expense account no less?\n It was too confusing. She was too tired. She was leaving. It was all too late anyhow, she thought, as the car moved smoothly onto the interstate.\n A woman sitting on her own on a bench, maybe getting hot, maybe getting thirsty, wanting to use the bathroom. Afraid to get up and go pee because she might miss the one she was waiting for. Maybe the hot sweet scent of the doughnuts reminded her she was hungry, but she wouldn’t eat them because she wanted to present them in their round-dozen perfection to her sweetie, see her smile of delight. She would pick at the paint peeling on the wooden bench and look up every time someone like Cody walked past; every time, she’d be disappointed. This one magical thing had happened in her life, something very like a miracle, but as the hot fat sun sinks lower she understands that this miracle, this dream is going to die because the person she’s resting all her hopes on is worried she might look like a fool. Or doesn’t want to admit she had used a woman for sex then thrown her away.\n Cody blinked, looked at her watch. She leaned forward, cleared her throat.\n The driver looked at her in his mirror. “Ma’am?”\n “Where is Piedmont park?”\n “Northeast of downtown.”\n “Do we pass it on the way to the airport?”\n “No, ma’am.”\n She was crazy. But all that waited for her at home was a tankful of fish. “Take me there.”\n Without the hat and boots, wearing jeans and sandals and the kind of tank top Cody herself might have picked, Cookie looked young. So did her body language. Her hair was in a braid. She was flipping it from shoulder to shoulder, twisting on the bench to look to one side, behind her, the other side. When she saw Cody, her face opened in a big smile that was naked and utterly vulnerable.\n “How old are you?” Cody blurted.\n The face closed. “Twenty-six. How old are you?”\n “Thirty-one.” Cody didn’t sit down.\n They stared at each other. “Dirt on my face?”\n “No. Sorry. It looks . . . you look different.”\n “You expect me to dress like that on my day off, too?”\n “No! No.” But part of her had. “So. You get a lot of days off?”\n A short laugh. “Can’t afford it. No expense accounts for me. No insurance, no 401(k), no paid vacation.”\n Cody flushed. “Earning two thousand bucks a night isn’t exactly a hard luck story.”\n “Was I worth it?”\n Her smell filled Cody’s mouth. Yes! she wanted to shout. Yes, a hundred times over. But that made no sense, so she just stood there.\n “You paid twenty-two hundred. The house takes sixty percent off the top. Out of my eight eighty, Danny takes another twenty percent and, no, he’s a bouncer, not a pimp, and I’ve never done that before last night. And, no, I don’t expect you to believe me. Then there’s costumes, hair, waxing, make up . . . ” She leaned back, draped both arms along the back of the bench. “You tell me. Would fucking a complete stranger for three hours be worth five hundred dollars?”\n Her mouth stretched in a hard smile but her eyes glistened. She put one ankle up on the other knee.\n “Does your ankle still hurt?” It just popped out.\n Cookie turned away, blinked a couple of times. Cody found herself kneeling before the bench.\n “Cookie? Cookie, don’t cry.”\n “Susana,” she said, still turned away.\n “What?”\n “Susana. It’s my real name. Susana Herrera.” She turned to Cody, and her face was fierce. “I am Susana Herrera. I’m a dancer, I’m not a whore, and I want to know what you’ve done to me.”\n “What I’ve . . . ?”\n “I dance. I tease, I hint. It makes you feel good, you give me money, which makes me feel good. Sometimes I give a lapdance, but always by the rules: hands on the armrest, clothes on, a little bump and grind, because I need the extra tips. I dance, you pay. It’s my job. But this, this isn’t a job! I don’t know what it is. It’s crazy. I let you—” Her cheeks darkened. “And I would do it again, for no money. For nothing. It’s crazy. I feel . . . It’s like . . . I don’t even know how to say it! I want to talk to you, listen to you talk about your business. I want to see your house. I didn’t sleep last night. I thought about you: your smile, your hands, how strong it made me feel to give you pleasure, how warm I felt when you wrapped your arms around me. And I’m afraid.”\n “Me too,” Cody said, and she was, very, because she was beginning to get an idea what was wrong with them and it felt like a very bad joke.\n “You’re not afraid.” Susana folded her arms, turned her face again.\n “I am. Cook— Susana, do you suppose . . . Shit. I feel ridiculous even saying this. Look at me. Please. Thank you. Do you suppose this is what l—”\n She couldn’t say it. She didn’t believe it.\n After a very long pause, Susana said, “Dancers don’t fall in love with the marks.”\n That cut. “Marks don’t fall in love with whores.”\n “I’m not a—”\n “Neither am I.”\n They stared at each other. Cody’s phone rang. She thumbed it off without looking. “My full name is Candice Marcinko. I have to fly back to San Francisco this afternoon but I could come back to Atlanta at the end of the week. We could, you know, talk, go to the movies, walk in the park.” Jesus, had she left any stereotype unturned? She tried again. “I want to meet your, your cat.”\n “I don’t have a cat.”\n “Or your dog,” she said. Stop babbling. But she couldn’t. “I want to learn how long you’ve lived in Atlanta and what kind of food you like and whether you think the Braves will win tonight and how you feel when you sleep in my arms.” She felt like an idiot.\n Susana looked at her for a while, then picked up the box at her side. “Do you like Krispy Kreme?”\n When Cody turned her phone on again at the airport, there was a message from Richard: Call me, it’s important. But she had to run for her plane.\n In the air she leaned her head against the window and listened to the drone of the engines.\n Susana, sitting on the bench while the sun went down, thinking, Love, love is for rich people.\n A cream labrador runs by, head turned to watch its owner, running alongside. Its tongue lolls, happy and pink. Dogs love. Dogs are owned.\n She tears the last three doughnuts to pieces and throws them to the ducks.\n On Thursday, Vince and the executive team toasted her with champagne. She took the opportunity to ask for Friday and two days next week off. Vince couldn’t say no without looking chintzy, so he told her VPs didn’t have to ask permission.\n VP. She grinned hard and for a minute she felt almost normal. VP. Top dog.\n Friday morning she had just got out of the shower when the doorbell rang. She was so surprised she barely remembered to pull on a robe before she opened the door.\n “Well, that’s a sight for sore eyes.”\n “Richard!”\n “Not that I don’t appreciate the gesture but could you please tighten that belt, at least until we’ve had coffee? Here you go, quad grande, two percent.”\n She went to get dressed. When she emerged, drying her hair with a towel, he was sitting comfortably on the couch, ankle crossed at the knee, just like Susana in the park.\n “I envy you that dyke rub-and-go convenience.”\n She draped the towel round her neck, sat, and sipped the latte. “To paraphrase you, it’s not that I don’t appreciate the coffee, but . . . why the fuck are you here?”\n He put his phone on the table next to her latte. “Remember this?”\n “It’s your phone?”\n He took a thumbdrive from his laptop case and gave it, then her, a significant look.\n “Richard, I’ve had a real weird few days and I’m on a plane in four hours. Maybe.” Maybe she was crazy, maybe she should cancel . . . “Anyhow, could you please just get to the point?”\n “Drink your coffee. You’re going to need it. And tell me what happened on Tuesday night.” He held up his hand. “Just tell me. Because my guess is you had a hell of a night with a lovely young thing called Cookie.”\n She didn’t say anything for a long, long time. “Susana,” she said finally.\n “Ah. You got that far? Susana Herrera, aged twenty-four—”\n “Twenty-six.”\n “Twenty-four. Trust me. Mother Antonia Herrera, father unknown. Dunwoody community college, degree in business administration—oh, the look on your face—and one previous arrest for possession of a controlled substance. Healthy as an ox. Not currently taking any medication except contraceptive pills.”\n “The pill?”\n “What’s the matter?”\n “Nothing. Go on.”\n “No known allergies to pharmaceuticals, though a surprising tolerance to certain compounds, for example sodium thiopental and terpazine hydrochloride.”\n Cody seized on something that made sense. “Wait. I know that drug. It’s—”\n “RU486 for the mind. That’s the one.”\n “Oh, Jesus, Richard, you didn’t give her that! You didn’t make her forget what happened!”\n “Not what happened Tuesday.”\n Cody, confused, said nothing.\n He plugged the thumbdrive into his laptop and turned the screen so she could see the sound file icons. “It will all make sense when you’ve listened to these.”\n “But I don’t have time. I have a plane—”\n “You’ll want to cancel that, if it’s to Atlanta. Just listen. Then I’ll answer questions.”\n He tapped play.\n “ . . . ever happens, I promise no one will ever hear what goes on this tape except you.”\n “Cue ominous music.”\n She jumped at the sound of her own voice. “What—”\n “Shh.”\n “—more an, um, an ethics thing.”\n “Jesus, Richard. You’re such a drama queen.” Pause. Clink.\n “I’ve done my research, too. Like you, I’m pretty sure what will happen after you’ve made your presentations to Boone.”\n “The Golden Key.”\n “—but what I need to know from you is whether or not you can authorize out-of-pocket expenses in the high five figures to win this contract.”\n He touched pause. “Ring any bells?”\n “No.” Cody’s esophagus had clamped shut. She could hardly swallow her own spit, never mind the latte. But the cardboard was warm and smooth in her hand, comforting, and behind Richard her fish swam serenely back and forth.\n “Terpazine is a good drug. We managed to calculate your dosage beautifully. Susana’s was a bit more of a challenge. Incredible metabolism.”\n “You said you didn’t give her—”\n “Not in the last couple of weeks. But you’ve had it six times, and she seven. Now keep listening.”\n Six times?\n “—the exploration of memory and its retrieval. So exciting. A perfect dovetail with the work I’ve been doing on how people form attachments. It’s all about familiarity. You let someone in deep enough, or enough times, then your brain actually rewires to recognize that person as friend, or family.”\n Pause.\n “There are ways to make it easier for someone to let you in.”\n Clink of bottle on glass.\n “I’ve told you about those studies that show it’s as simple as having Person A anticipate Person B’s needs and fulfill them.”\n “So don’t tell me again.”\n She sounded so sure of herself, bored even. A woman who had never thought to use the world love.\n “—jumpstart the familiarization process. For example, person A works in a bookshop and is lonely, and when she’s lonely chocolate makes her feel better. And one day person B arrives mid-afternoon with some chocolate, says Hey, you look sorta miserable, when I’m miserable chocolate makes me feel better, would you like one? and A eats a chocolate and thinks, Wow, this B person is very thoughtful and empathic and must be just like me, and therefore gets slotted immediately into the almost-friend category. It’s easy to set something like that up. You just have to know enough about person A.”\n Know enough.\n Cody pushed the laptop from her. “I don’t believe this.”\n “No?”\n Cody didn’t say anything.\n “You sat in that Seattle bar, and you listened, and then you signed a temporary waiver.” He placed a piece of paper on the table by her hand. It was her signature at the bottom—a little sloppy, but hers. “Then you took some terpazine and forgot all about it.”\n “I wouldn’t forget something like this.”\n He held up his hand. Reached with his other and nudged the sound file slider to the right.\n “Take the pill.”\n “Alright, alright.” Pause. Tinkle of ice cubes. “Jesus. That tastes vile.”\n “Next time we’ll put it in a capsule. Just be grateful it’s not the vasopressin. It would make you gag. I speak from experience.”\n He tapped the file to silence. “It really does. Anyhow, a week after Seattle I came here and you signed a more robust set of papers.” He handed her a thick, bound document. “Believe me, they’re bombproof.”\n “Wait.” She dropped the document on her lap without looking. “You came here? To my apartment?”\n “I did. I played the recording you’ve just heard, showed you the initial waiver. Gave you that.” He nodded at her lap. “You signed. I gave you the sodium thiopental, we had our first session. You took another terpazine.”\n “I don’t remember.”\n He shrugged. “It happened.” He tapped the paper in her lap. “There’s a signed waiver for every session.”\n “How many did you say?”\n “Six. Four here, twice in North Carolina.”\n “But I don’t remember!”\n The fish in her tank swam back and forth, back and forth. She closed her eyes. Opened them. The fish were still there. Richard was still there. She could still remember the weight of Susana’s breasts in her hands.\n “You’d better listen to the rest. And read everything over.”\n He tapped play.\n “Okay. Think about what it would be like if you knew enough about someone and then you met: you’d know things about her and she’d know things about you, but all you’d know is that you recognize and trust this person and you feel connected. Now imagine what might happen if you add sex to the equation.”\n “Good sex, I hope.”\n “The best. There are hundreds of studies that show how powerful sex bonding can be, especially for women. If a woman has an orgasm in the presence of another person, her hormonal output for the next few days is sensitized to her lover: every time they walk in the room, her system floods with chemical messengers like oxytocin saying Friend! Friend! This is even with people you know, consciously, aren’t good for you. You put that together with someone compatible, who fits—whether they really fit or just seem to fit—and it’s a chemical bond with the potential to be human superglue. That’s what love is: a bond that’s renewed every few days until the brain is utterly rewired. So I wanted to know what would happen if you put together two sexually compatible people who magically knew exactly—exactly!—what the other wanted in bed but had no memory of how they’d acquired that knowledge . . . ”\n It took Cody a moment to pause the sound. “Love,” she said. “Love? What the fuck have you done to me?”\n “You did it to yourself. Keep listening.\n And she did. After she had listened for an hour, she accepted the sheaf of transcripts Richard handed her from his case.\n She looked at the clock.\n “Still thinking about that plane?”\n Cody didn’t know what she was thinking.\n “Is it refundable?” he said. “The flight?”\n Cody nodded.\n “Give me the ticket. I’ll cancel for you. You can always rebook for tomorrow. But you need to read.”\n She watched, paralyzed, as Richard picked up the phone and dialed. He turned to her while he was on hold, mouthed Read, and turned away again.\n So she began to read, only vaguely aware of Richard arguing his way up the airline hierarchy.\n After the first hundred pages of Subject C and Subject S, he brought her fresh coffee. She paused at one section, appalled.\n “What?”\n “I can’t believe I told you that.”\n He peered over her shoulder. “Oh, that’s a juicy one. Stop blushing. I’ve heard it all before. Several times now. Sodium thiopental will make you say anything. Besides, you don’t remember telling me, so why bother being embarrassed?”\n She watched her fish. It didn’t matter. Didn’t matter. She picked up the paper again and plowed on. May as well get it over with.\n Somewhere around page three hundred, he went into the kitchen to make lunch. She didn’t remember eating it, but when she set aside the final page at seven o’clock that evening, she saw that the plate by her elbow was empty, and heard the end of Richard’s order to the Chinese takeout place on the corner. It was clearly something he’d done before. From her phone, in her apartment. And she didn’t remember.\n She wished there was a way to feed him terpazine so he would forget all those things she’d never said to another soul before.\n She tried to organize her thoughts.\n He had asked for her permission to use her in an experiment. It would mean she would feel comfortable at the club in Atlanta, that she might even have a good couple of hours, and it would further his work while being paid for to some extent by her expense account. He had traveled to the Golden Key and picked Susana as the most likely dancer to fit her fantasies—and he knew a little about her preferences from that stupid, stupid night in Dallas—and made the same pitch to her. Only Susana got paid.\n Twice, Cody thought. I paid her too.\n And so Richard had flown to Cody’s apartment in San Francisco and given her sodium thiopental, and she had talked a bluestreak about her sexual fantasies, every nuance and variation and degree of pleasure. In North Carolina, she had talked about her fantasies again, even more explicitly, encouraged to imagine in great detail, pretend it was happening, while they had her hooked up to a functional MRI and other machines.\n Richard put down the phone. “Food in thirty minutes.”\n Cody forced herself to stay focused, to think past her embarrassment. “What were the fMRIs for, the fMRIs, blood-gas sensors, and—” she glanced at the paper, “—TMS during the, the fantasy interludes?”\n “We built a kind of mind and hormone map of how you’d feel if someone was actually doing those things to you. A sort of super-empathy direction finder. And one from Susana, of course. We played your words to each other, along with transcranial magnetic stimulation to encourage brain plasticity—the rewiring.”\n “And,” she hunted through the pages for the section labeled Theoretical Underpinnings. “You gave me, us, oxytocin?”\n “No. We wanted to separate out the variables. You supplied the oxytocin on your own, later.” He beamed. “That’s the beautiful part. It was all your own doing. Your hopes, your hormones, your needs. Yours. We made a couple of suggestions to each of you that you might not have come up with on your own: that expensive watch and the loose clothes, Cookie’s hat and spurs. But the rest was just you and Cookie, I mean Susana. But you two were primed for each other, so if that wasn’t the best sex of your life, I’ll eat this table.” He rapped the table top in satisfaction.\n All her own doing.\n “You can’t publish,” she said.\n “Not this, no.” He picked up one of the fMRIs and admired it. “It’s enough for now to know that it works.”\n She waited for anger to well up but nothing happened. “Is this real?”\n “The project? Quite real.”\n Project. She watched him gather all the documents, tap them into a neat pile.\n “Not the project,” she said. “Not the TMS, the fMRIs, the terpazine. This.” She tapped her chest. “Is it real?”\n He tilted his head. “Is love real? A lot of people seem to think so. But if you mean, is that what you’re feeling, the answer is, I don’t know. I don’t think a scan could give you that answer. But it could tell us if you’ve changed: your data have been remarkably clear. Not like Cookie’s. Susana’s.” He held the fMRI image up again, admired it some more, then put it back in the pile.\n “What do you mean?”\n “The data. Yours were perfectly consistent. Hers were . . . erratic.”\n “Erratic.” Her mind seemed to be working in another dimension. It took an age for the thought to form. “Like lying?”\n “She’s lied about a lot of things.”\n “But she could have been lying to me? About how she feels?”\n He shrugged. “How can we ever know?”\n She stared at him.“The literature,” she said, trying to force her slippery brain to remember what she’d just read. “Its says love’s a feedback loop, right?”\n “In terms of individual brain plasticity, yes.”\n “So it’s mutual. I can’t love someone if she doesn’t love me.” If it was love.\n He gave her a look she couldn’t interpret. “The data don’t support interdependence.” He paused, said more gently, “We don’t know.”\n Pity, she realized. He pities me. She felt the first flex and coil of something so far down she couldn’t identify it. “What have you done to me? What else have you done to me?”\n “To you? For you.”\n “You made me feel something for a woman who fucked for money. Who had her mind fucked for money.”\n “So did you, if you think about. Just at one remove.”\n “I didn’t.”\n “So, what, you did it for science?”\n Cody changed direction. “Does Susana know?”\n “I’m flying to Atlanta tomorrow.”\n “Do you have her sound files with you?”\n “Of course.”\n “Let me hear them.”\n “That would be unethical.”\n Unethical. “I think you might be a monster,” she said, but without heat.\n “I have a strange way of showing it, then, wouldn’t you say? For the price of a few embarrassing experimental sessions you won’t ever remember, I won you a contract, a girlfriend and a night on the town.”\n She stared at him. “You expect me to be grateful . . . ”\n “Well, look at this place. Look at it. Bare walls. Fish, for god’s sake.”\n “Get out.”\n “Oh, come on—”\n “Out.”\n “By tomorrow it will all fall into perspective.”\n “I swear to god, if you don’t leave now I’ll break your face.” She sounded so weirdly calm. Was this shock, or was it just how people in love, or whatever, behaved? She had no idea. “And you can put those papers down. They’re mine, my private thoughts. Leave them right there on the table. The thumbdrive, too.”\n He pulled the drive, laid it on the papers, stowed his laptop and stood. She held the door open for him.\n He was halfway through the door when she said, “Richard. You can’t tell Susana like this.”\n “No?”\n “It’s too much of a shock.”\n “You seem to be coping admirably.”\n “At least I already knew you. Or thought I did. You’ll be a complete stranger to her. You can’t. You just can’t. It’s . . . inhumane. And she’s so young.”\n “Young? Don’t make me laugh. She makes you look like an infant.” He walked away.\n Cookie danced. She didn’t want to think about the phone call. Didn’t want to think about any of it. Creep.\n But there was the money.\n The lights were hot, but the air conditioning cold. Her skin pebbled.\n “Yo, darlin’, let’s you and me go to the back room,” the suit with the moustache and bad tie said. He was drunk. She knew the type. He’d slip his hands from the chair, try cop a feel, get pissed off when she called in Danny, refuse to pay.\n “Well, now,” she said, in her special honey voice. “Let’s see if you’ve got the green,” and pushed her breasts together invitingly. He flicked a bill across her breasts. “A five won’t buy you much, baby.”\n “Five’ll buy you, babydoll,” he said, hamming for his table buddies. One of them giggled. Ugly sound in a man, Cookie thought. “Five’ll buy you five times!”\n “And how long did it take you to come up with that, honey?”\n “The fuck?” He looked confused.\n “I said, your brain must be smaller than your dick which I’d guess is even smaller than your wallet, only I doubt that’s possible,” and she plucked the bill from his fingers, snapped it under her G-string and walked away.\n In the dressing room she looked at herself in the mirror. Twenty-four was too old for this. Definitely. She had no idea what time it was.\n She stuck her head out of the door. “Danny!”\n “Yes, doll.”\n “Time is it?” She’d have to get herself a watch someday. A nice expensive watch.\n “Ten after,” Danny said.\n “After what?”\n “Ten.”\n Three hours earlier on the West Coast. She stacked her night’s take, counted it, thought for a minute, peeled off two hundred in fives and ones. She stuck her head out of the door again. “Danny!”\n “Here, doll.”\n “I’m gone.”\n “You sick?” He ambled up the corridor, stood breathing heavily by the door.\n “Sick of this.”\n “Mister Pergoletti says—”\n “You tell Pergoletti to stick it. I’m gone. Seriously.” She handed him the wad of bills. “You take care of these girls, now. And have a good life.”\n “Got something else lined up?”\n “Guess we’ll find out.”\n There was one bottle of beer in Cody’s fridge. She opened it, poured it carefully into a glass, stared at the beige foam. A glass: she never drank beer from a glass. She poured it down the sink. She had no idea what was real anymore but she was pretty sure alcohol would only make things worse.\n She made green tea instead and settled down in the window seat. The sun hung low over the bay. What did Susana see from her apartment? Was her ankle better? Contraceptive pills, Jesus. And, oh, the smell of her skin.\n She was losing her mind.\n She didn’t know who she hated more: Richard for making the proposal, or herself for accepting it. Or Susana. Susana had done it for money.\n Or maybe . . . But what about those contraceptive pills?\n And what if Susana did feel . . . whatever it was? Did that make it real? It was all an experiment, all engineered. Fake.\n But it didn’t feel fake. She wanted to cradle Susana, kiss her ankle better, protect her from the world. The Richards of the world.\n She picked up the phone, remembered for the tenth time she had neither address nor phone number. She called information, who told her there was no listing under Susana Herrera in the Atlanta Metro area. She found herself unsurprised.\n She got the number for the Golden Key instead.\n A man called Pergoletti answered. “Cookie? She’s gone. They always go.” The music thumped. Cody’s insides vibrated in sympathy, remembering.\n “—don’t have a number. Hey, you interested in a job?”\n Cody put the phone down carefully. Sipped her tea. Picked up the phone again, and called Richard.\n It was open mic night at Coffee to the People. Richard was in the back room on a sofa, as far from the music as possible. Two cups on the table. One still full.\n “You knew I’d call.”\n “I did.”\n “Did you program that, too?”\n “I didn’t program anything. I primed you—and only about the sex.” He patted the sofa. “Sit down before you fall down.”\n She sat. Blinked. “Give me her phone number.”\n “I can’t. She gave me a fake. I called her at the club, but she hung up on me.” He seemed put out.\n “What does she know?”\n “I talked fast. I don’t know how much she heard. But I told her she wouldn’t get the rest of the money until we’d done follow up.”\n The singer in the other room sang of love and broken hearts. It was terrible, but it made Cody want to cry anyway.\n “How long does it last?”\n “Love? I don’t know. I avoid it where possible.”\n “What am I going to do?”\n Richard lifted his laptop bag. “I planned for this eventuality.” He took out a small white cardboard box. He opened it, shook something onto his hand. A gray plastic inhaler.\n “What is it?”\n “A vasopressin analogue, formulated to block oxytocin receptors in the nucleus accumbens. That is, the antidote.”\n They both looked at it.\n “It works in voles,” he said. “Female voles.”\n Voles. “You said it tasted bad.”\n “I’ve used it. Just in case. I prefer my sex without complications. And I’ve had a lot of sex and never once fallen in love.” He arched his eyebrows. “So, hey, it must work.”\n The elephant whistle hypothesis. Hey, Bob, what’s that whistle? Well, Fred, it keeps elephants away. Don’t be an asshole, Bob, there aren’t any elephants around here. Well, Fred, that’s because of my whistle.\n “Cody.” He did his best to look sincere. “I’m so very sorry. I never thought it would work. Not like this. But I do think the antidote might work.” His face went back to normal. He hefted the inhaler. “Though before I give it to you, I have a favor to ask.”\n She stared at him. “On what planet do I owe you anything?”\n “For science, then. A follow up scan, and then another after you take the antidote.”\n “Maybe I won’t take it. Give me the info you have. Give me the number.”\n “Love is a form of insanity, you know.”\n “The number.”\n In the other room, the bad singing went on and on.\n “Oh, all right. For old time’s sake.” He extracted a folder from his bag, and a piece of paper from the folder. He slid it across the table towards her, put the inhaler on top of it.\n She nudged the inhaler aside, picked up the paper. Hand written. Susana’s writing.\n “Love’s just biochemical craziness,” he said, “designed to make us take a leap in the dark, to trust complete strangers. It’s not rational.”\n Cody said nothing.\n “She screwed us.”\n “She screwed you,” Cody said. “Maybe she fell in love with me.” But she took the inhaler.\n Cody sat in the window seat with the phone and the form Susana had filled in. Every now and again she punched in a different combination of the numbers Susana had written and got the Cannot be completed as dialed voice. Every now and again she touched the form with the tip of her middle finger; she could feel the indentation made by Susana’s strong strokes. Strong strokes, strong hands, strong mouth.\n She didn’t think about the gray inhaler in its white box, which she had put in the fridge—to stay viable a long time, just in case.\n After a while she stopped dialing and simply waited.\n When her phone lit up at 11:46 she knew who it was—even before she saw the 404 area code on the screen.\n “Do you feel it?” Susana said.\n “Yes,” and Cody did. Whatever it was, wherever it came from, it was there, as indelible as ink. She wanted to say, I don’t know if this is real, I don’t know if it’s good. She wanted to ask, Had you ever had sex with anyone for money before me? and Does it matter? She wanted to know, Have you ever loved anyone before? and, How can you know?\n She wanted to say, Will it hurt?\n Walking through the crowds at the airport, Cody searched for the familiar face, felt her heart thump every time she thought she saw her. Panic, or love? She didn’t know. She didn’t know anything except that her throat ached.\n Someone jostled her with his bag, and when she looked up, there was the back of that head, that smooth brown hair, so familiar, after just one night, and all her blood vessels seemed to expand at once, every cell leap forward.\n She didn’t move. This was it, the last moment. This was where she could just let the crowd carry her past, carry her away, out into the night. Walk away. Go home. Use the inhaler in the fridge.\n That was the sensible thing. But the Cody who had hung from the ninth story balcony, the Cody who had risked the Atlanta contract without a second thought, that Cody thought, fuck it, and stepped forward.\n You couldn’t know. You could never know.\n Originally published in Eclipse Three, edited by Jonathan Strahan.\n Nicola Griffith is an English novelist (now dual UK/US citizen) living in Seattle. Author of six novels (Hild, Ammonite, Slow River, The Blue Place, Stay, and Always) and a multi-media memoir (And Now We Are Going to Have a Party: Liner notes to a writer's early life). Co-editor of the Bending the Landscape series of original queer f/sf/h stories. Essayist. Teacher. Blogger. Winner of the Nebula, Tiptree, World Fantasy, and six Lambda Literary Awards. (Also a BBC poetry prize, some Gaylactic Spectrum awards, the Premio Italia, and a few others.) Married to writer Kelley Eskridge (they are co-founders of Sterling Editing). Currently lost in the 7th century working on the second novel about Hild of Whitby. Emerges to drink just the right amount of beer and take enormous delight in everything."}