{"fingerprint": "utwB2/eRTkOg1S0IUeivGZIT95E=", "sitename": "Clarkesworld Magazine", "title": "Chimera by Gu Shi translated by S. Qiouyi Lu and Ken Liu", "author": "Gu Shi; S Qiouyi Lu; Ken Liu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gu_03_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Chimera by Gu Shi translated by S. Qiouyi Lu and Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "17770 words, novella\n Chimera\n An individual, organ, or part consisting of tissues of diverse genetic constitution.\n —Merriam-Webster\n 1. Chimera\n It had the fore part of a lion, the tail of a dragon, and its third head, the middle one, was that of a goat, through which it belched fire.\n It was begotten by Typhon on Echidna, as Hesiod relates.\n —Apollodorus, Bibliotheca, Book 2, Chapter 3 (as translated by Sir James George Frazer)\n I watch her enter.\n In the six years since we parted ways, I’ve always wanted to know: exactly how cold and calculating is the machine under the soft, lustrous skin of this witch?\n She sees me, her eyes filling with delight—no trace of embarrassment, nor shame.\n “Evan.” She quickens her footsteps. “Darling, long time no see.”\n A delicate, warm perfume wafts from her approaching figure, the same as the scent in my memory. I recall what she said as she bared her heart to me, not long after we were married:\n “Lately I’ve been thinking—I could write my dissertation based on pictures of my expressions: Managing Emotions and Social Responses. What do you think? Take smiles: I know over a thousand of them, and each requires the manipulation of different muscle groups. Each one can be the response for many situations, and their combinations are infinite!\n “The only difficulty is meticulous expression management. It would require massive calculations; perhaps it’s untenable—Evan, don’t look at me that way—enough. See, you musicians always misunderstand the scientific mind. I’m not a machine; a Turing machine would never be able to figure out in such a short time which smile to use in which circumstance—I’m a human being, a wonderful creation.\n “This is a worthy subject for biology.”\n She solemnly pointed at her head, then laughed with a snort: sweet, innocent, like she couldn’t contain herself. “Look at you. So serious! I’m just joking around.”\n Now, she stands before me in a fine cashmere coat, a silk scarf snug against her throat: both wrapping her well-exercised, slim body. Nothing escapes her keen interest: she studies society, fashion, health, romance. She studies me, studies my passions, my expressions, my movements, as though I’m the most fascinating person she’s ever seen. In reality, I’m no different than the rats in her laboratory. She grants my wishes—then takes them away.\n She looks at me, the joy displayed by the curved corners of her mouth calibrated perfectly. But, face-to-face with my ex-wife, I can’t call forth the happiness from when we were in love.\n I’m weary of this.\n “I just wanted to talk about Tony.”\n No tabloid reporter would ever believe the truth: a mother abandoning her swaddled infant and guiltless husband on the same day as the child’s birth, then disappearing off the face of the Earth for six years.\n “I know.”\n I finally catch a flicker of weakness in her eyes, but her voice remains level.\n “I was just about to come talk to you about him, too.”\n Tony is six.\n If it weren’t for what happened three months ago, I would have never contacted his mother. That day, as I took Tony to the park, a maroon Honda barreled out of nowhere onto the sidewalk and pulled Tony under a tire. After five days in the emergency room, he opened his eyes, but his kidneys had sustained irreparable damage. Upon discovering that his body couldn’t take a kidney transplant, I realized that my son would have to undergo dialysis three times a week for the rest of his life. In despair, I pored over every piece of medical literature I could get my hands on until I stumbled upon the topic of regenerative medicine, the goal of which is to use the patient’s own stem cells to grow replacement organs.\n One of the foremost scientists in this field is my ex-wife. A rising star, she’s in charge of a new chimera lab that successfully grew a rat’s pancreas inside a mouse. They created a chimera that had never before existed in nature. In journal articles, commentators viewed this study as a milestone for regenerative medicine. Based on this success, a human-pig chimera could, in theory, be viable. And now, I’m hoping that she can grow Tony’s kidneys inside a pig. After the pig matures, the kidneys can be transplanted back to Tony.\n As she gently stirs a cup of Darjeeling tea, she murmurs, “Of course I love him. You have no idea how painful the news of the accident was for me. But what you mentioned in your letter—I really can’t make that happen.”\n “I read your article, plus the discussions in Cell. You and your lab are the only people in the whole world who would be able to duplicate Tony’s kidneys.” Seeing her disbelief, I can’t stop myself from adding, “Please don’t assume that I can’t find and read scientific articles.”\n “Of course. You’re so smart—if you want to accomplish something, you’ll get it done.” She masks her surprise and lets out a small sigh. “It’s just that, if you’ve already read my article, then you’d know that this is all only theoretical. Rat-mouse chimeras and human-pig chimeras are two entirely different things; it’s like—” She looks up, blinking, then looks back at me. “—Like how you can sing, and you can play guitar, but that doesn’t mean you can play a pipe organ.”\n “I could do it with time,” I say. “These skills share similar principles.”\n Facepalm. “Lord, that was a terrible analogy. How should I explain this to you . . . I imagine you already know how the chimera I created came to be.”\n I turn on my iPad. I’ve already highlighted many paragraphs in her article, so I find the quote I’m looking for easily: “We injected induced pluripotent stem cells (iPS) from a rat into blastocysts from a mouse lacking the Pdx1 gene. Mice lacking the Pdx1 gene are unable to develop a normal pancreas; the rat iPS cells were able to remedy the genetic deficiency of the recipient mouse blastocysts. These rat-mouse chimeras were able to develop into adults with normal, functional pancreases.”1\n She points to a sentence. “Oh right, this part. You must know that rats and mice are two entirely different animals, right? In taxonomical terms, the former is of the genus Rattus, and the latter is Mus—”\n I interrupt her. “Of course!”\n “Sorry.” She shrugs, then points again at that line of text. “Look here. If we wanted to use a similar method to create a human-pig chimera, then we would first have to get blastocysts from a pig that lacks the genes to produce kidneys. But where would we get such blastocysts? And how would we locate genes that can develop kidneys? These are all problems we have to solve from the ground up, and we don’t know if we’d be successful at any of them.”2\n “I’m begging you to try.” I see her lips opening and closing, but I don’t understand her words. “I know there’s no guarantee of success.”\n “Please don’t say ‘beg’; he’s also my son. I’m willing to do anything for him.” She implores me with a doleful look, her eyebrows downturned. “‘Try’—See, that’s the second question. Let’s say we could find all the genes that contribute to kidney development and knock them out of the pig blastocyst with precision. Then what? Can I inject Tony’s cells into the blastocyst? No. Using human embryonic stem cells to do research is illegal and highly unethical.”\n “You care about that?” I stare at her, astounded. “You care about ethics?”\n She touches a finger to her lips. “Please lower your voice.”\n I know her all too well. If she didn’t want to respond to my request, she wouldn’t have come to see me.\n She winks, as if we share an unspeakable little secret.\n “Tell me, what would it take to get you to try?” I really can’t take much more of her antics.\n She breaks eye contact and turns to look outside. A long silence. I gaze at her profile: her refined, nurturing face is as beautiful as it was the last time I saw her. In the afternoon light, she’s radiant, like a statue of the Virgin Mary in a church—a cold statue that can breathe. At last, she smiles and turns back to me:\n “A mother smashing through scientific taboos to save her son’s life—such a tale is enough for me, even better if I get to play the role of the magnificent mother in this story.”\n Yes, that would be her. Her actions are endowed with philosophy and poetry, but her performance is always built upon her own awareness of the philosophy and poetry that her actions will bring to her. In her mind, she’s cut off from the rest of the world, a god surveying the Earth. She will undertake this difficult task not because Tony is her son, but because doing so will turn her into a glorious legend.\n What a selfish, abhorrent monster.\n She continues. “I must tell you that I have no confidence of success. When it comes to human experimentation, there’s no precedent to refer to, and I may even create a monster—but that’s what makes it exciting, no? I’ll do it, but I still recommend that you go to the hospital and look into standard kidney transplant—”\n “Every one of his lymphocyte cross-matching tests has come back positive.”\n She looks at me, not quite understanding. “So?”\n “Kidneys from a donor will likely lead to acute rejection,” I say. “It’s possible he can only take a transplant from his own body.”\n “My God.” She furrows her brow.\n “Right now we’re relying on dialysis to keep him alive. You can’t imagine how painful this is.” I think of Tony’s cries and can’t help but shudder.\n The light in her eyes grows firm and resolute. “I understand. I’ll put my all into this.”\n “Thank you,” I say.\n “There’s one more thing that I should tell you.” She gets up and walks to my chair, then sits on the armrest. She holds up the iPad and finds another paragraph. “Look here.”\n A few locks of her hair fall against my face. I stare at those words, but they’re beyond my comprehension. I shake my head. “I don’t understand.”\n “The commentator here points out that although the result of the chimera experiment is successful, we don’t fully understand the underlying principles. So, in the course of these experiments, we can’t control the degree of chimerization. Although the goal may be to produce a pancreas, other areas of the mouse body may also have rat cells.”\n “So?”\n “This is the primary reason why we can’t just play around with human cells in research,” she says. “If we did a human-pig chimera experiment, I have no way of controlling how many human cells end up in the pig.”\n “I still don’t understand what you’re trying to say.”\n “Think about it, Evan.” She puts her hands on my shoulders and looks at me. “This pig may become a second Tony—our son could be concealed in its body. And when it grows up, we’ll snatch its kidneys together, then kill it.”\n A. Adam\n Lin Ke lay outside the operating room.\n They were already an hour late, and the anesthesiologist hadn’t even arrived yet. The only thing separating her naked body from the people walking up and down the corridor was a thin layer of white fabric. She felt very uneasy.\n “Why haven’t we started yet?” she asked the nurse.\n Flustered, the nurse replied, “We’ve just received notice that due to factors outside our control, your cultivated organ order was canceled. We’re very sorry.”\n What kind of reason was that?! She was the biggest goody-two-shoes aboard this spaceship. In all her one hundred years here, she’d always paid her cultivated organ insurance premiums on time to ensure that her every organ would remain young and healthy. Her heart, the very organ that she was trying to replace, palpitated from rage.\n She put on her clothes as quickly as she could. The first thing she did was to file a police report. Then, she took the rail to Deck Seven—supposedly, her new organ was there, in an Adam.\n “As your customer,” she protested to the overseer, “I demand an explanation for why my order was canceled. I absolutely will not wait another three years with only this shoddy heart!”\n “But your order is perfectly fine,” the overseer said, surprised. He turned on the monitor. The feed showed the interior of an organ cultivation cabin: organ after organ was wrapped in thin film, all of them growing from tubes that hung from the ceiling. They looked like bunches of grapes waiting for harvest.\n But the heart that belonged to Lin Ke was already gone and marked as “harvested.”\n Stunned, Lin Ke checked the hospital’s information platform again, forwarding the notice with the subject “Order Cancellation” to the overseer. But she wasn’t expecting that he would doubt the veracity of the notice. “Ma’am, our monitoring platform can’t be wrong.”\n The overseer’s response enraged Lin Ke. She stood up. “If you can’t figure out what happened, then I’ll have to go take a look myself.”\n “Of course. The organ cultivation contract specifies that to be within your rights.” The overseer didn’t back down at all. “But please remember, you can only look. You cannot enter the cabin.”\n Ten minutes later, Lin Ke, accompanied by a police droid, opened the door to Organ Cultivation Cabin 35. A horrifying, bloody stench assaulted her nose. As she realized what she was seeing, her view narrowed to an intense spasm as her chest tightened. Then, everything went dark as she fainted.\n Luo Ming was the first human police officer to arrive on the scene.\n Total chaos.\n Those were the first words that came to his mind. As he entered Cabin 35, he had a hard time imagining what the mountain of flesh and blood he was seeing used to look like.\n “What happened here?” He regretted not donning a filtration mask before coming in. He lowered his voice as he spoke to his “assistant” Edmund, an AI that was invisible to the naked eye. Edmund was his most dependable companion.\n “Ms. Lin Ke, who filed the police report, suffered a heart attack from shock and is now being treated in the hospital.” Edmund’s voice emitted from a speaker inside his ear. “She complained that the cultivators breached their contract and canceled her order.”\n At a loss, Luo Ming said, “I think we’re looking at a lot more than a breach of contract here.”\n Viscous blood was still seeping onto the immaculate white floor from a pile of organs three meters in diameter. In some places, the blood had already congealed into a pitch-black patch. Some organs in the outermost layer of the meter-tall flesh pile still looked fresh; a few were even twitching and wriggling—the rotting smell in the air had to be coming from something deeper inside the pile.\n As he imagined what the inside might look like, Luo Ming felt his scalp tingling. “We’d better make sure that there are only cultivated organs here. God forbid that this mess is hiding a murder scene.” Luo Ming commanded Edmund to scan the room. Edmund took control of the police droid via the wireless remote, overriding the droid’s visual system to complete his assigned task.\n “I’m always a little unsettled by how easily you take control of them,” Luo Ming muttered. He could, of course, issue commands to the police droid directly, but then he would have to waste time organizing and analyzing the raw data himself.\n “Please don’t grumble about your misgivings concerning AIs to me,” Edmund replied. “I believe I’ve found something that’s even more unsettling.”\n While Luo Ming had been griping, the scan revealed that two arms and half a head were also buried within the mountain of organs. The Adam matrix absolutely could not have created those three body parts.\n “Alright, looks like we’ve just added a dismembered corpse to the case,” Luo Ming said, sighing. “The Eden Daily is going to have a field day with this.”\n Luo Ming had Edmund scan and record the details of the scene in the cabin; then, he answered First Officer Qin Wei’s videocall. Qin Wei was the spaceship Eden’s head of security.\n “This is perhaps the worst case I’ve seen on my one hundred and three years aboard this ship.” As Luo Ming spoke, his gaze fell on a pair of human eyes that dangled from the ceiling. His voice shook. “You—you’d better come take a look.”\n 2. Echidna\n And in a hollow cave she bore another monster, irresistible, in no wise like either to mortal men or to the undying gods, even the goddess fierce Echidna who is half a nymph with glancing eyes and fair cheeks, and half again a huge snake, great and awful, with speckled skin, eating raw flesh beneath the secret parts of the holy earth.\n —Hesiod, Theogony 300-305 (as translated by Hugh G. Evelyn-White)\n “Excuse me, are you—” After observing me for twenty minutes, the woman beside me asks timidly, “Typhon’s lead singer Evan Lee?”\n “No.” All that feels like a past life.\n She blurts out an apology and follows up with, “You really look like him.”\n I channel all the cold disinterest I can muster into my voice. “Is that so.”\n So ends that conversation. The flight attendant soon comes around with drinks. I ask for a glass of wine, followed by another. The cramped economy seat constricts my body, and terrifying words throw heavy shackles on my mind: “father,” “responsibility,” and so on.\n When I was still Evan Lee, my days of pleasure and riches seemed endless—until she left me, taking with her half of my possessions and all of my musical inspiration.\n For a long time after our separation, I constantly thought of her, analyzed her, studied her. I flipped through old tabloids, gathered paparazzi gossip, replayed our wedding video again and again to pick up each of her frowns and smiles, and examined every picture and recording of all the times she appeared with me to support my publicity efforts. During that darkest period of my life, these were the best benefits from my once-great fame—plenty of materials for me to study. And so, bit by bit, I got close to the monster beneath her perfect shell, the serpent-half concealed beneath her beautiful appearance. But there was one part of our life together that I could never understand.\n Her pregnancy.\n The pregnancy happened only because it was part of her plan. During the first three years of our marriage, I told her many times that I wanted a child, but she would always brush me off with a “no need to rush,” plus a session of hot sex. When she decided it was time, she didn’t think to discuss the decision with me at all.\n “Evan, guess what?” That was the first night after the end of my tour. When I opened the door to our home, a festive atmosphere greeted me.\n “What kind of surprise does my little sweetheart have?” I cupped her neck and kissed her lips.\n “A baby.” She laughed, her eyes curving with joy. “Darling, we’re going to have a baby!”\n I was stunned. After three years of begging, I had all but given up on the idea.\n “It’s already three months old.” She put my hand on her flat stomach. “Right here.”\n My palm detected absolutely no movement, but, in that moment, the word “father” entered my mind. Every cell of my being filled with joy. Two months later, Typhon released its last single, “Fire by Lightning.” Music critics felt that its “every note was imbued with love and joy.” Then, on the day our hit single won the Golden Melody Award, my wife changed in a way that I never could have imagined.\n On that day, her labmate called me and said that she had suffered a nervous breakdown.\n Impossible. My wife—for whom even an “off mood” was rare—had suffered a nervous breakdown?\n Nothing like this had ever happened before. I rushed to campus. Her laboratory was at the end of a boulevard shaded with trees. The rows of Chinese parasol trees had already shed their leaves, leaving behind only branches full of round, dangling fruits. As I walked into that red-brick building, one of her students recognized me.\n “Mr. Lee, finally!” His expression was a mixture of agitation, worry, and curiosity, but he prudently suppressed his emotions under a veneer of politeness. “I’m Edmund. She’s in the third-floor animal room. You should hurry.”\n “Thank you, Edmund,” I said in a rush.\n Although the campus was where we first met, that was actually my first time in her lab. The sparkling floor was like a hospital’s; there were rows and rows of metal shelves, each neatly packed with plastic cages connected to a central ventilation system. This room must’ve held a thousand, no, ten thousand rats!\n I found her behind the shelves full of rats. She was cradling her head as she crouched in a corner, her hair a mess, her shoulders shuddering, but her cries were inaudible.\n “Honey—” Seeing her like this frightened me. “What’s wrong?”\n The moment my hand touched her, she let out a screech. I stepped back. “Okay, I won’t touch you. What happened?”\n Slowly, she raised her head. I had never before seen such panic in her eyes. Her parted lips trembled, but a long time passed before she uttered my name: “Evan.”\n “Yes, it’s me.” I chastised myself. “I should’ve held you back; I shouldn’t have let you go to work. The baby’s already almost six months old—”\n “No!” she shrieked. “No! Don’t bring it up! Don’t—”\n “Alright, we won’t talk about the baby.” I reached out and tried to get close to her. Her whole body trembled, as though she were struggling to escape. Defeated, I could only call upon my own specialty: “Honey, let’s sing ‘Titans’ together, okay?”\n She stopped struggling and looked at me blankly, like a helpless child.\n “A singer in the wilderness, recounting tales of the gods . . .”\n It was a gentle song, and also her favorite melody. I sang as softly as I could, so soft the words were almost inaudible. Music turned out to be more effective than language. She listened until I was halfway through the song, sniffled, then threw herself into my arms and sobbed. I stroked her messy hair and tried to soothe her terrified shivers.\n “It’s okay, it’s okay; I’m here.”\n She slumped against my chest and, with great effort, uttered a few disconnected phrases: “It’s a . . . parasitic . . . parasitic . . . monster . . . ”\n “What?”\n “I don’t want the baby. Evan, I don’t want that parasite inside my body!”\n Shocked, I asked, “What happened? I don’t understand.”\n She wiped her nose on my sleeve. Finally, she could speak in complete sentences. “The baby is taking over my life; it’s a parasite in my body. It’s controlling my thoughts, commanding me to eat what it wants to eat, telling me to go where it wants to go, demanding I do what it wants to do. It’s a parasitic monster in my body, a monster! It’s devouring me, do you understand? I can’t control myself anymore! I can’t stop myself from thinking about it! I can’t focus on what I want to do. I can’t understand my own notes. I don’t care about my papers, either. The only thing in my mind is how I can make it feel more comfortable! I’ve been possessed by it; it’s already wormed its way into my brain—do you understand?”\n I couldn’t help but laugh. “My silly girl; this is a normal reaction to pregnancy. It’s because you love the baby—our baby.”\n “No!” She stared at me with alarm. “This is absolutely not normal! Not normal at all! You just don’t get it because it hasn’t possessed your body!”\n I held back my laughter and said as sincerely as I could, “If it were possible, I would bear the baby for you, but I can’t. Chin up; you’re a mother now.”\n She stopped crying. For a few seconds, she stared at me in an unfamiliar way, as though I were the one who had lost my mind. But she soon became her usual self again. She wiped her eyes with her sleeve, then looked up and giggled sheepishly. “Oh goodness, I really did go nuts today.”\n “It’s a very common anxiety, honey.”\n She leaned against my shoulder. “You’re right. These are normal feelings for a new mother. I need to get used to them.”\n In the months that followed, there were a couple more incidents in which she was dejected and depressed, but there were no more episodes as intense as the one in the lab.\n But I started to be more vigilant, canceling a new tour so that I could spend more time with her. Around the 39th week of her pregnancy, I stumbled upon a file in her computer that recorded in detail the “conversations” she had with her unborn baby: when she went to the restroom, dreams, favorite foods and kinds of music—all trivial things. Reading these notes, I began to understand what she said that day in the lab. The things she noted were not her own habits or tastes, but someone else’s.\n The baby growing inside her was using her body to do what it wanted to do. Once she realized this, she was terrified.\n If she had been a typical mother, perhaps she would have used “love” to explain her behavior. But she couldn’t do that. Emotions to her are a kind of camouflage, something to let her blend in with others. So she could only understand everything from the baby’s perspective: this was a monster that had possessed her body and taken control of her so that it could survive inside her.\n Maybe the plane’s air conditioning is too cold, but suddenly, I shiver. I never thought I’d come to understand why she’d abandon her own child: If she didn’t, she’d always be under Tony’s control, forced to give up on having her own life—just as I have.\n “Please fasten your seatbelt, Mr. Lee,” the flight attendant says. “We’re about to land.”\n As we descend, a city surrounded by an oasis blooms in the vast expanse of desert outside.\n B. Eden\n After completing a genetic survey of the scene, Luo Ming received Edmund’s interim report: the limbs and head in Organ Cultivation Cabin 35 belonged to three deceased passengers. Terminal illness was unquestionably the cause of all three deaths; furthermore, they had all chosen to donate their bodies to science to advance research on those illnesses. Edmund’s discovery allowed Luo Ming to unfurrow his brows just a bit.\n “It’s not murder,” he said to First Officer Qin Wei, who had rushed to the scene. “That’s good news at least.”\n Like Luo Ming and the majority of the passengers aboard Eden, Qin Wei was close to a hundred fifty years old. He had just gotten a scalp replacement: only an infant-like layer of fine hair covered the top of his head, lending a comical air to his overall appearance.\n “Thank goodness.” Qin Wei was distracted, and he muttered as though to himself, “But . . . how’d these limbs even get here?”\n “The body parts should have been sent to the medical research center under Deck Seven,” Luo Ming said.\n “Should have been, yes.” Only now did Qin Wei look at Luo Ming. “The organ cultivation cabins are the most heavily monitored and secure part of this spaceship. For something like this to happen is unbelievable. You might not know this—even the police don’t have the clearance to view documentation about Adam.”\n “Sharing such information could greatly help my investigation.”\n “I’m very sorry, Officer Luo, but those documents involve classified information about the very heart of Eden,” Qin Wei said. “Since there aren’t any suspected murders, I’d say this investigation has come to an end. Why don’t you let me and the Adam overseers tie up any loose ends?”\n Luo Ming read between the lines. “So you’re saying that this is just an ordinary accident?”\n Qin Wei smiled noncommittally. “The ship has experienced severe organ cultivation failures before, you know? Malfunctions in the cabin’s temperature control.”\n Luo Ming studied his expression and let out a small sigh. “Alright, sir, I understand.”\n Only a day later, as he sat in his office, Luo Ming received an info packet from Edmund concerning Adam.\n “You’re a genius.” Luo Ming sighed with approval and opened the document. As the unredacted details filled his view, Luo Ming gasped. “This ship’s security system must have serious flaws for such classified data to be so easily accessible.”\n “Or perhaps it’s your fault for illicitly bringing an AI aboard, hmm?” Edmund’s voice was a cross between pride and smug derision.\n “Well, no one’s discovered you over all these years.” Edmund was a gift Luo Ming had received a long time ago, and after years of working and living together, he had found the AI indispensable. Even after hearing about Eden’s ban on AIs, Luo Ming still chose to implant the terminal into his body and smuggle Edmund aboard the spaceship.\n “That’s because the intelligence systems here are far too primitive,” Edmund said. “But you don’t need to worry about the security of the ship. Its core systems are sealed off from outside networks. I haven’t found a single entry point.”\n Luo Ming nodded and returned his attention to the documents. It appeared that Eden was actually a research vessel that provided replacement organs for its several hundred thousand passengers, allowing them to extend their lives indefinitely. At the same time, it transmitted the residents’ health data back to Earth, so that people back home could learn first-hand about potential complications from a large-scale organ replacement program. Eden followed a comet’s orbit in the Solar System so that its path crossed with the Earth’s once every four years, allowing the ship to dock at a space station and exchange both personnel and information.\n “I always thought we were heading away from the Solar System,” said a surprised Luo Ming. “And nobody ever told me we could leave the ship!”\n Edmund said, “Looks like they’d gone to a lot of trouble to hide the truth and prevent you all from discovering that you’re actually laboratory mice.”\n In light of this new-found knowledge, the organ cultivation cabins really were the soul of Eden. They were often called “Adam” chambers, after that figure from Christian lore who used his own rib to create humanity’s other ancestor. But, to be more precise, every mucous membrane pouch in the organ cultivation cabins that bore a human organ—those were all Adams. They were distinct, each carrying different passengers’ genes, cultivating different organs.\n When Eden was first designed, the Adams were separated from one another. But, as time passed, the Adam overseers discovered a strange phenomenon: after a few Adams began cultivation inside the same room, cells would start growing along the feeding tracts until all the Adams were connected to each other.\n However, this connection did not delay or corrupt the growing organs; rather, organ cultivation in all the Adams became more efficient as organ maturation time decreased. Some researchers believed that this “genetic networking” created a system among the Adams for exchanging growth signals and hormones, accelerating organ development.\n As a result, when the cultivation cabins were renovated forty years ago, the overseers installed passages that allowed all the Adams to connect to each other, resulting in an awe-inspiring effect—while each passenger’s genome was still preserved as separate and complete, the vast majority of organ cultivation times were cut by at least half. Even the development time for lungs, the slowest organ to cultivate, was cut down by a third.\n “I still don’t understand what any of this has to do with our case.” Luo Ming felt agitated. “I keep feeling like we missed something at the scene.”\n “I recorded a complete scan of the room,” Edmund said.\n “Perhaps—” Luo Ming pondered. “The problem may not only be inside the cultivation cabin.”\n “What do you mean?”\n “Do you remember the dispute between the woman who filed the report and the Adam overseer?” Luo Ming asked.\n “The hospital’s notification system showed that Ms. Lin Ke’s order for a heart had been canceled, whereas Adam’s monitoring platform showed that everything was fine.”\n “Right,” Luo Ming said. “Adam’s system should be much more secure than the hospital’s, yet the cultivation cabin overseer didn’t know the true state of Cabin 35. Why is that?”\n “Could it be that Adam’s overseers were trying to conceal the mess inside?” Edmund asked.\n “Maybe. But we can’t rule out another possibility: none of those in charge, including the first officer and the cultivation cabin overseers, have any idea what really happened.” Luo Ming put the recording of Lin Ke arguing with the overseer on the display. “Watch the man’s expression—the surprise is genuine.”\n “True, as I can confirm with microexpression analysis,” Edmund said.\n “Based on the scene we observed, it’s very likely that what happened to Lin Ke wasn’t an isolated incident. But she was the only one who felt strongly enough to make a report to the police, and who went to open the door to Cabin 35. That’s in the contract, but it looks like passengers only exercised their right to examine the cabins during the early years of the ship’s journey.”\n “Are you suggesting that all the organs we saw on the ground had their orders canceled?”\n Luo Ming’s eyes lit up. “We might as well follow this lead. Edmund, can you break into the databases for both the cultivation cabins and the hospital and pick out all relevant records? It’s possible that there are discrepancies between the two systems—those would be the organs we saw in Cabin 35.”\n “You really know how to come up with hard problems for me.” Despite these words, Edmund sounded delighted. “I’ll give it a shot.”\n 3. Typhon\n From his shoulders grew a hundred heads of a snake, a fearful dragon, with dark, flickering tongues, and from under the brows of his eyes in his marvelous heads flashed fire, and fire burned from his heads as he glared. And there were voices in all his dreadful heads which uttered every kind of sound unspeakable; for at one time they made sounds such that the gods understood, but at another, the noise of a bull bellowing aloud in proud ungovernable fury; and at another, the sound of a lion, relentless of heart; and at another, sounds like whelps, wonderful to hear.\n —Hesiod, Theogony 820-835 (as translated by Hugh G. Evelyn-White)\n Nine years later, I find myself in her laboratory again. Edmund has gone from an undergraduate to a doctoral student, but the way he looks at me hasn’t changed in the least—he’s just like any other awe-struck fan. “Mr. Lee, the professor is waiting for you in the animal room.”\n “Thank you, Edmund.”\n She doesn’t notice when I enter. She’s squatting beside a pig that has to be half a meter tall, all her attention focused on it as she laughs. She puts her cell phone on speaker, and music starts playing. It’s my song, “Fire by Lightning.”\n “When I cradle it in my hands,The sun and moon tumble, stars fall.Go ahead and fight, destroy;The king of the gods’ undying wish is in my hands.”\n The pig dances to the music on its hind legs, clumsily twisting and rocking. Gradually, it catches up to the tempo. She stands with it and leans against a desk, laughing so hard she can’t breathe. The pig faces her, dancing now with gusto, keeping up even better with the beat. It’s unbelievable—the pig is actually dancing to the brisk pace of the music.\n The song, now in an ornamental cadenza, switches tempo. The pig stumbles and tumbles to the ground, startling her. She falls to her knees by its prone body. “Are you okay?”\n The pig oinks in reply. Annoyed, she jabs its head with a finger, then says in the gentlest voice I’ve ever heard, “You rascal, don’t scare me like that.”\n The pig’s oinks are now laced with a hint of whining. She rubs its back. “Alright, alright; it’s okay, as long as you’re not hurt.”\n This is such a bizarre sight. I cough. She and the pig turn their heads simultaneously to look at me together—an image I’ll never forget.\n “What’s wrong, Evan?” She stands.\n It has Tony’s eyes.\n She’s never seen Tony, so she can’t know. But the eyes in that one-and-a-half-year-old pig belong to Tony: light brown irises with a hint of gray. It’s not just the eyes, but also something unnamable in their depths, something that sends chills down my spine, making me forget why I’m here.\n It reminds me of how I felt the time I found myself in the middle of a stage, having forgotten everything about the song I was supposed to sing. The electric guitar’s prelude was nothing but white noise, and my legs trembled in the flickering magnesium lights.\n “Do you need a cup of coffee?” She peers at me, concerned. “You don’t look so good.”\n “Can we . . . talk . . . alone?” Even if I performed at three back-to-back shows, my voice still wouldn’t sound like this.\n “I was just about to show you our pig,” she says. “It’s doing really well. Fantastic, don’t you think?”\n I catch its gaze again, and in that second, I feel my soul being torn apart.\n “My God!”\n The pig stares at me as though it already knows its destiny: a wordless acquiescence to suffering, imbued with a fatalistic sense of tragedy. The last few times Tony underwent dialysis, he gazed at me with the exact same expression.\n “Okay, Evan.” She steps forward to hold my trembling hands. “Let’s go somewhere else.”\n We don’t say a word on the way to her office. The afternoon sun dissipates all shadows in the spacious room. Edmund brings in two tiny, round cups. “Thank you,” she says, but then she doesn’t say a word to me after Edmund leaves. The dappled shadows of tree leaves upon the desk lengthen. I take a sip of the now cold and bitter coffee. Finally, she breaks an afternoon’s worth of silence.\n “I thought you might want to take a look at the report.”\n A thick file lands before me. I open it, my arms stiff. Inside are notes starting from when the pig was an embryo until now. I can only make sense of the pictures. From the outset, it’s always smiled at the camera, if that joyous and eager expression can be called a “smile”—but within the last month, it’s ceased smiling. On the last page is a close up portrait of its eyes. Staring at them, I can barely tolerate the agitation in my stomach—I throw the file to the ground.\n She stands and picks up the file, chuckling. “Good thing I didn’t give you a digital version, or else I’d have to fill out a damaged equipment report now.”\n “How could this be?” I murmur.\n “Evan, we have to face the facts.” She lets out a soft sigh. “This is perhaps the best outcome: the pig is now in prime condition for organ donation—if you were to ask me, this experiment went unusually smoothly. We found the right path from the very beginning, and we overcame every obstacle within the shortest possible time. I doubt you’d find another instance in the history of science where the road to discovery was so smooth—”\n “You—” I interrupt her, but I’m not sure what I should say.\n “I’ve already gotten in touch with my friend Dr. Sanger. He’s the best kidney surgeon at the state hospital.” Her tone is level and calm. “I’ve already sent him the pig’s file. He’s reviewed the data and thinks the surgery will be no more risky than a standard human-to-human transplant. Evan, I don’t understand why you’re still not satisfied.”\n Only her last sentence betrays her suppressed anger, but it’s enough to provoke all my terror and rage. I unlock my phone: the wallpaper is a picture of Tony staring innocently at me.\n “Enough.” I fling open the file and place my phone on top of the close up of the pig’s eyes. “We both know where the problem is, right? Look at these eyes: they’re exactly the same—”\n “—as Tony’s,” she finishes. “Of course I know. Those are Tony’s eyes; the cells in that organ are human cells.”\n I read the unspoken message from her face. “Are you . . . are you saying there are human cells in other organs as well?”\n “Yes . . . it’s a bit hard to take. Its nervous system is almost entirely made up of human cells.” She shrugs. “Don’t be naïve, Evan. We knew from the start that we couldn’t control the degree of chimerization, but we went ahead anyway.”\n “The nervous system?”\n “The cerebrum, the cerebellum, and the spinal cord—the vast majority of it,” she says, enunciating each word, as if she’s trying to engrave the words into my heart with her poisoned tongue. “To put it simply: our son is inside that pig.”\n I’ve never been so frightened, not even the time I saw Tony being pulled under that car. Back then, I was a father, but now, I’ve become a criminal—what in the world have we done? We’ve melded our son with a pig, and now we’re going to butcher it with our own hands!\n My silence allows her to relax her tone. “So long as I stay quiet, no one will know about this. These notes won’t appear in my paper. The nervous system isn’t the focus of this experiment, and it’s not important for whether the experiment is declared a success. The kidneys are perfect, Evan. You don’t have to worry about that at all.”\n “I’m not worried about that!” Her forced composure is intolerable. “Killing it is cruel—it’s wrong! Don’t you realize that the pig knows what’s going to happen?”\n She smiles. “Evan, what do you plan to do?”\n “I—”\n “You know, I haven’t been able to sleep for the last two weeks.” Her voice is low. “I keep thinking about whether you’ve been trying get back at me with this pig. I abandoned Tony, so you thought up the cruelest of methods to reawaken my motherly instincts. I kept telling myself that this isn’t Tony, that this isn’t my son; I even refused to name it out of fear that doing so would humanize the animal. But it went beyond my imagination: out of all the researchers, it’s closest to me; out of all the music we play for it, it only likes yours.”\n Tony is the same way. From when he was a baby, as soon as he heard “Fire by Lightning,” he’d start dancing.\n She continues. “I’ve thought about it: should we stop and let Tony succumb to his fate, thereby allowing the pig to live? But then I saw you, and I realized that we’ve never had any choice but to go forward.”\n Her gaze penetrates me to the root, and I, in turn, finally see the trembling that she’s kept hidden inside. Her terror and pain are undoubtedly far sharper than mine: it’s only because she’s been ruminating on them for so long that she can bury them under a tranquil facade. I’ve only glanced at the pig, but she’s been raising it since it was a single cell.\n Of course we can’t turn back. Tony continues to deteriorate, and everything her lab has invested into this pig can’t be hidden from her supporters. I demanded that she cross the Rubicon; it’s only reasonable that both of us should bear this heavy cross.\n “Right.” I force myself to forget the pig. “Tony hasn’t been doing so well lately. I’ll bring him here as soon as possible. Don’t want to miss the best window for surgery.”\n “We have an understanding then.” She smiles, erasing all misgivings from her face. She opens her notebook and gives me Dr. Sanger’s contact information as well as his CV. Then she tells me her own opinions and recommendations for the transplant surgery. Only after it’s gone dark outside does she stop talking. “You should go,” she reminds me. “If you leave now, you can still catch your flight.”\n I get up, hesitating for a moment over whether to shake her hand in a sign of friendship and gratitude. But she’s holding her hands together before her chest. I guess there’s no such need.\n “I’m off then. Thank you,” I say, my mouth dry.\n She laughs and shakes her head. “Evan, Tony is my son too. Why are you saying ‘thank you’?”\n “Ah, yes.” I laugh too.\n We walk out of the laboratory together. The shadows of the trees pool together, enveloping the world in the stillness of night. I’m about to say goodbye, but then she speaks.\n “The first time I saw you was over there, right?” She whispers, “That day, you played such a gentle tune. Who’d have thought that the song you’d end up recording would be so wild?”\n I know she’s talking about “Titans.” The inspiration for the first phrase had come to me while I was performing at this school. That night, as though in the throes of a craving for some drug, I rushed around in search of a piano to bring the notes in my mind to life. I climbed through the window of my room and felt my way back to the locked auditorium, never realizing that there was another pair of ears outside listening.\n “Detested by our forefathers,Buried deep, hidden from the sun,Scythe-wielding, throne-stealing, we bear curses and epithets.. . .We’re destined to rebel,Smashing barriers, heedless of cost;Let smoke choke the air, let the earth burn to oblivion!”\n She sings, only remembering some of the lyrics. She’s also totally off-pitch, but I can’t laugh as freely as I used to.\n She turns to look at me. “Now that I think of it, your song was rather prophetic.”\n In the end, she never went to the state hospital, nor did she show up at Tony’s recovery party. For five years, she disappeared into her lab, cutting off contact with all her friends.\n I’m shocked when she calls me out of the blue. She tells me that she would like me to set up a charitable foundation in Tony’s name to support organ transplants for children. During the last five years, I had emailed her with such an idea, but all my messages had been returned as undeliverable. I immediately agree.\n Once the framework of the foundation is in place, I contact her again.\n “I get the feeling that you’re about to make a grand gesture,” I say.\n “I am,” she replies. “I reprogrammed the chimera gene regulation network and turned it into a blastocyst-like structure—”\n “Sorry,” I interrupt her. “You know I don’t understand all that.”\n “Give me a minute.” She pauses, as though she were switching her linguistic module from scientific jargon to common. “We already have the capacity to produce human organs in a lab. I used existing chimeras to create a more stable structure; all you have to do is add new human cells, and it will create the corresponding organ.”\n “That’s fantastic!”\n “I’ll never allow it to look like a human being again.” Her tone is exhausted.\n Simultaneously with the creation of the foundation, she publishes a series of papers on chimeras in Cell. Starting with the first human-pig chimera, she traces her groundbreaking work through the regenerative medicine lab. Overnight, she rocks the foundation of humanity’s understanding of “life.”\n I buy that issue of Cell. The reviewers lavish her with praise: “This is a revolution for regenerative medicine, hinting at our near future: humanity will be able to swap out our organs as if they were interchangeable parts. We will live longer, maybe even forever.”\n Criticism and debates follow soon after. Although a mother’s pressing need to save her son’s life is understandable, experimenting with human stem cells is nonetheless an ethical taboo.\n Her third paper pushes back against the torrent of attacks, laying out her model for the organ-cultivation matrix, which she names “Adam.” It resembles a small, square box filled with mucous membranes and doesn’t look like a living creature at all.\n “The Adam technology won’t encroach upon any ethical concerns,” she says in an interview. “It won’t develop a human brain; it can’t think; it has no feelings—because we haven’t provided it with any mechanisms for thoughts or feelings. The only thing it can do is use its own rib to save the people who need it.”\n C. The Captain\n Luo Ming didn’t really think that he could get in front of the captain of Eden based on just a letter—though that was his plan.\n The woman before him had ashy white hair, wrinkled skin, and a hunched back; even sitting on the sofa seemed to take a lot out of her. Luo Ming was surprised by the captain’s appearance. The women he knew prioritized external beauty, listing organs related to appearance at the front of their replacement queue.\n “Regarding the incident in Cabin 35”—belying her appearance, the captain’s voice was energetic—“I’d like to hear your point of view.”\n “The first officer has indicated that the incident is beyond my purview,” Luo Ming said carefully, placing his hands before him.\n “I actually think it’s better to have a professional involved in the case.” The captain gestured for Luo Ming to take the armchair before her. “But given the sensitive nature of the cultivation cabins, the results of the investigation should be kept confidential. That’s not an issue for you, is it?”\n “No.” Luo Ming sat down. “I assume you’ve read my letter carefully?”\n “Yes.”\n “As I mentioned, I believe this was no accident, but a premeditated crime.”\n The captain dropped her gaze. “Your theory is in conflict with the first officer’s report.”\n “Haven’t you summoned me here for another perspective?” Luo Ming studied the captain’s expression, then continued. “I went over all the orders that the hospital’s system canceled without explanation from the last three months. The total was over seven times the normal cancellation rate. I traced all the canceled organs to Cabin 35, but the monitoring system showed all the organs to be developing normally.”\n “And that’s enough to convince you this wasn’t an accident?” the captain asked. “Maybe the monitoring system is malfunctioning.”\n “It’s not just the monitoring system, Your Excellency. Don’t forget the cultivation cabin itself—how did that pile of ‘accidentally harvested’ organs come to be? And we have no explanation for the discrepancy between the cultivation cabins’ monitoring system and the hospital’s order tracking system.”\n The captain stared at him. “I’m listening.”\n “Before coming to see you today, I wasn’t too sure about my conclusions.” Luo Ming smiled modestly. “I originally suspected that the mismatch between orders was due to the overseers’ efforts to hide the truth. But by summoning me, you’ve told me that even you, the captain of this ship, aren’t sure what exactly happened. That leaves us with only one other possibility: The Adam overseers did not know about the recent incident in Cabin 35. Thus, we can theorize that the monitoring system has been tampered with.”\n “I had First Officer Qin Wei examine the cultivation cabin monitoring system,” the captain said, her gaze growing more intent. “It appears to have been modified with a ‘green screen’-like technology. Police droids entering and leaving the cultivation cabins would show up on the monitors as normal, but they’d always appear against a background showing the interior of the Adam chambers functioning normally.”\n “You’re saying that the recording was selectively tampered with? The images of the Adam cabins on the monitors never changed?”\n “No, not ‘never changed;’ they showed as ‘functioning normally.’ On the monitors, you could see the organs growing as expected, and when orders were supposed to be fulfilled, they were ‘harvested normally.’” The captain shook her head. “This method of tampering with the system is highly sophisticated.”\n The captain’s news deepened Luo Ming’s puzzlement. “But this is what I can’t figure out. If the entire incident was a premeditated crime, then the criminal already accomplished the most difficult step—taking over Adam’s high-security monitoring system. Yet they forgot to cover their tracks in the far more basic hospital systems.”\n “There’s a simple explanation for that: the criminal couldn’t conjure the patients’ requested organs out of thin air. They had no choice but to leave the orders alone and hope that patients would not exercise their right to examine the cultivation cabins.”\n Luo Ming shook his head. “But they could have played any number of other tricks that would have worked better. For instance, they could have systematically delayed the order fulfillment dates for all the affected organs to prevent anyone from knowing what had happened. However, based on my review of the hospital’s records, the doctors and patients only found out at the last minute that their orders had been delayed or canceled. The notices came through the hospital’s regular organ reception channels, not Adam.”\n “I’m now thoroughly confused.” The captain furrowed her brow. “What are you trying to say?”\n “For someone who came up with such a complicated scheme—going so far as to use a green screen to tamper with the monitoring records—forgetting about the hospital’s basic database is a very strange oversight. They clearly have the capability to break into the hospital’s systems, but they didn’t—why not? One possibility is that they actually wanted to draw attention to what they did, but another possibility is that they didn’t even know that the hospital’s information platform existed.”\n “That’s impossible,” the captain said. “Every person aboard Eden knows about the hospital’s organ replacement database.”\n “Of course, that’s how it should be,” Luo Ming said. “But there are always bound to be some people who don’t know.”\n “I’m not interested in a vague hunch. If you have a definite suspicion, say so.”\n “On this ship, who wouldn’t know about the existence of the hospital’s organ replacement database? Or rather, who’s never ordered an organ?” Luo Ming looked at the captain. “I hope you can help me gather a list of names. They’re the primary suspects.”\n The captain tapped the armrest with a wrinkled finger and chuckled coldly. “That’s quite an accusation.” She met Luo Ming’s gaze. “I’ve never replaced an organ.”\n 4. Orthrus\n Men say that Typhaon (Typhon) the terrible, outrageous and lawless, was joined in love to her, the maid with glancing eyes. So she conceived and brought forth fierce offspring; first she bore Orthus the hound of Geryones . . . but Echidna was subject in love to Orthus and brought forth the deadly Sphinx which destroyed the Cadmeans.\n —Hesiod, Theogony, 304-335 (as translated by Hugh G. Evelyn-White)\n Some legends say that it was actually Orthrus, and not Typhon, with whom Echidna conceived of those other monstrosities: Chimera and Sphinx.\n —Anonymous\n The first time I see her is at my father’s funeral.\n Although at least half of that crowd of tens of thousands have come to see her, I’m the only one who picks her out. She’s wearing a black silk dress, a diamond ring dangling from a string around her neck. Her face looks even younger than mine. I don’t know if it’s my practice at identifying faces or a natural instinct that makes me recognize her as my mother. Then, she sees me too.\n Five seconds later, I receive a direct message: “I’d like to chat after the funeral.”\n I remember my father’s last words to me as he lay dying: “She’s your mother, and she gave you the gift of life twice—be grateful.”\n Once the crowd dissipates, I duck into her car. She enters Oslo Airport, Gardermoen as the destination and turns her seat around to face me.\n “Hello, Tony.”\n I haven’t been called that in years. After my parents created the Tony Lee Charitable Foundation, I had to change my name to protect my privacy and live a normal life.\n “Mom?” It turns out to be easier to say than I thought. “You look so young.”\n “Yes, it’s me.” She laughs, then winks, as though we share a secret. “I’m conducting a new experiment to restore my cells to a more youthful state. It’s a dangerous experiment, and we don’t know all the side effects—it’s such a shame that I don’t have another son to be the guinea pig this time.”\n “Um—” I have no idea what to say in response.\n “Oh, darling, I’m just joking!” She spreads her hands disarmingly. “Now, tell me about your life. I hear that you’re a police officer?”\n “It’s just a job.”\n Her grin widens. “You’ve done well. I noticed that you’re dealing with AI crimes. Amazing.”\n “The world changes so quickly. Scientists can’t control everything they invent.” I resent her tone: she’s speaking as though she’s always been a part of my life, exercising a mother’s care.\n “That’s true.” She nods vigorously. “Sometimes we don’t understand our creations as much as we’d like people to think.”\n That’s unexpected. “Really?”\n She doesn’t answer, asking a question instead. “Will you come to our press event? We’re going to announce some important news.”\n I’ve heard about her research group’s press event, scheduled for next month. After seven years of silence, everyone’s dying to find out what she’s going to say.\n “This could change the course of humanity.” The car slows down. She glances out the window, then looks back at me. “You’ll be there, of course.”\n Her confidence irritates me. I am not my father, who was always so entranced by her. “Sorry, I’m not interested in it.”\n “Believe me, darling, you will be interested.” The car stops. She taps twice on her watch, and I receive an invitation as well as a packet of documents. “The thirteenth of next month. Be there.”\n She holds my hand for a moment, then leaves for the airport. The midnight sun throws her black dress into sharp relief.\n Three hours and forty minutes later, the Airbus A400 she’s on plunges into the sea.\n I end my vacation early to join the search and rescue effort, but the Baltic Sea has swallowed any trace of her. In the depths of the turbid waves, I see the wreckage of the plane.\n They say that there lies entombed humanity’s wildest dream.\n The day the rescue efforts end, I receive another invitation to the press event.\n I’ve run out of excuses. Heeding the call of fate, I set forth on a journey of more than ten thousand kilometers. On the plane, I look through the documents she gave me.\n There are pictures of a pig from when it was a piglet to when it was fully grown—undoubtedly my savior. I transfer planes at Amsterdam and New York before arriving at a small town in the middle of the desert. My father once told me about this town: it’s the birthplace of my kidneys.\n “Tony Lee,” I say to the person who’s here to meet me. The name is written on my invitation.\n Her mouth hangs open with exaggerated surprise. She lowers her gaze. “I’m Chen Ying. My condolences.”\n “Thank you.”\n I enter the auditorium to a hero’s welcome. Everyone seems to recognize me: they surround me, chattering about my mother and my kidneys, but neither of these two topics feel real to me. Thankfully, the press event starts up soon after. The chattering ends as the lights dim, and everyone turns to look at the illuminated stage.\n “We will change the world once again.” The middle-aged man on stage opens the ceremony with these words.\n The applause is enthusiastic. “Alright, Edmund!”\n Edmund is the chief scientist of my mother’s medical research group—he and my mother once won a Nobel together. After the applause dies down, he speaks again.\n “In the past thirty years, we’ve accomplished the unimaginable. From chimera experiments to the first successful human organ cultivation, as well as the spread of regenerative medicine thereafter, we’ve saved many people’s lives—but we’ve also faced much opposition. The main objection has been: should we use humans as research subjects?”\n Edmund picks me out of the crowd. “We’re honored to have Mr. Tony Lee among us today. The fact that he’s healthy and alive is our answer.”\n Thunderous applause and a blinding spotlight fall upon me together. The world goes white for a moment, and I can’t see a thing.\n “Our lab has never backed off from the effort to make our case to the public, but we’ve always lacked a decisive argument for the moral rightness of allowing human experimentation.”\n The spotlight eases away from me as Edmund continues, “But our latest discovery should finally settle this decades-long ethical dispute. First, let me introduce the youngest and most powerful member of our team: Mr. Sphinx, an avatar personifying our quantum computer.”\n Rays of light gather at his fingertips and then scatter to form a human shape—a powerful demonstration of the latest hologram technology. But given my profession, what draws my attention is the word “avatar.” After handling hundreds of AI-related crimes, I’m leery of them, especially one taking advantage of quantum computing.\n Sphinx renders as a golden-skinned teen. Once the rays of light have condensed, I almost can’t tell that he’s a hologram. A shy smile appears on his face, perfectly calibrated to give the impression of innocence.\n “Good evening, everyone. I have a riddle—”\n Laughing, Edmund interrupts him. “Let me guess: ‘What has four legs in the morning, two legs in the afternoon, and three legs at night?’ Sphinx, everyone knows the answer: humanity.”\n “Humanity, yes. That riddle compares a lifetime to a day,” Sphinx says. “But I have a different riddle for you.”\n “Go ahead. The best minds of the world are gathered here today.”\n “Where did humanity come from? Before ‘morning,’ what happened in the darkness before dawn?”\n “Evolution, Sphinx. I taught you this,” Edmund says, sighing.\n “But you must have proof,” Sphinx says.\n “We have many fossils of Homo erectus and Homo sapiens.” Edmund pauses. “But—”\n Sphinx takes over. “But, there is a gap in the fossil record. Until now, we have no direct evidence that modern humans, or Homo sapiens sapiens, evolved from the archaic Homo sapiens.”\n “But you have no evidence to disprove that modern humans evolved from Homo sapiens, either,” Edmund counters.\n “No, I do have proof. I know that humanity’s ancestor is a chimera.”\n For about ten seconds, Edmund is silent. Murmurs rise in the meeting hall.\n “A chimera?” Edmund says finally. “What kind of joke is this?”\n “I never joke,” Sphinx says. “Before the birth of quantum computers, calculating the product of two large prime numbers was very easy for classical computers, but figuring out the prime factors of a semiprime number, a natural number which is the product of two prime numbers, was practically impossible, making them useful for cryptography. After the creation of quantum computers, these early encryption technologies are no longer of use, as we can easily decrypt those methods using quantum algorithms. After adding me to the lab’s research team, Edmund had a new idea—he wanted me to factor humanity’s DNA.”\n “In other words, I wanted Sphinx to take one person’s genome and separate it into their parents’ genomes. It’s a biologist’s extension of quantum decryption.” Edmund shrugs. “What I didn’t expect was that Sphinx would actually be able to do it.”\n Sphinx nods. “Yes, after continuous algorithmic improvements and experimental confirmation, I can ensure a very high degree of recoverability. That is, if I have the complete genome sequence for any one of you, I can figure out the genome sequences of all your ancestors. I can recover their skin color, blood type, hair and eye color—give me enough time, and I can even recreate an ancestral human. With the support of medical databases from around the world, I quickly created a database of the genomes of humanity’s ancestors.”\n “As we factored human genomes,” Edmund added, “we also attempted to factor the genomes of as many other species as possible, including mammals, reptiles, birds, insects, mollusks, and even plants—a total of 115,000 species for which we now have an ancestral genomic database. In the end, we made an astounding discovery.”\n The whole meeting hall is silent, enraptured.\n “In every species other than humans, there is a similar trajectory for the number of ancestors that contributed to the species’ genome.” Rays of light once again gather in Edmund’s hand. “Observe this graph—the x-axis is the number of genetic specimens per time period, and the y-axis is time. As we go further up, we go further back in time.\n “Let’s start with puffins. As we go up in the time scale, we discover that, regardless of how long the population has remained stable, there is always a period where the population rapidly declines—a ‘bottleneck zone.’”\n The graph slowly rises in pace with Edmund’s gesture and stops at the midway point to show an hourglass shape. “What does this mean? At some point, for whatever reason, puffins died off in great numbers. The puffins we see now are descended from the few survivors of the bottleneck zone.\n “If we continue tracing back the population count of the puffins’ ancestors, we discover a fascinating phenomenon: history repeats itself. Above the bottleneck zone is an expansion period, and above that, another bottleneck—this goes on. We’ve calculated the trajectories for 115,000 species over the past 500,000 years, and they are all the same.\n “Now, let’s take a look at the human population.”\n Edmund waves his hand to the side. The human population graph rises up a bit, then quickly narrows to an almost invisible dot.\n “A rather terrifying bottleneck, is it not?” Edmund says. “But, when we go back from here—”\n He lifts his hand, but the graph doesn’t rise with him. It stops there, towering, like the minaret of a mosque.\n “What does this graph of humanity tell us? It tells us that, approximately 180,000 years ago, our common ancestor ‘Mitochondrial Eve’ gave birth to her children, and those children gave birth to more children, until human civilization dominated the globe.” Edmund slows his speech. “But please take note: this graph also tells us that humanity can trace back to only one common ancestor.”\n Sphinx breaks in, “Let me remind you, one individual cannot proliferate the species.”\n “Of course, ‘one’ is neither accurate nor possible. We know now that, other than this woman, our common ancestors include four men as well. But regardless of how many people survived that bottleneck, how could something like this have happened? Sphinx’s genome factoring analysis tells me that, before these ancestors, there were no ancestors.”\n “It’s true,” Sphinx says.\n “Was there a mistake in our calculations?” Edmund says, “But we tested our calculations on fast-reproducing bacteria and generations of laboratory mice with detailed genetic records, and our algorithms were confirmed to be correct! Sphinx did not make any errors. Why, esteemed guests, why is it that we can trace the unbroken trajectories of 115,000 other species, but we can’t do the same for humans? Before humanity’s morning, what happened during the predawn darkness?”\n Dead silence.\n Everyone looks up at the inconceivable graph. Judging by the introductions given to me earlier, this room is filled with the world’s top scientists and doctors, a few politicians and business tycoons, as well as representatives from a number of influential media outlets. Everyone is trying to find a flaw in the graph, but no one speaks. “Chimera,” the word that Sphinx said at the beginning of the presentation, floats like a ghost over our heads.\n “When I, too, was at a loss like everyone here today, I called my mentor. After she listened to my description, she asked me only one question: ‘Edmund, do you still remember that pig?’”\n Edmund looks at me. “Tony, do you still remember the pig that saved your life?”\n Faint murmurs fill the hall.\n Edmund shakes his head. “Maybe you don’t; but I do. I always thought that that pig was the first chimera with human cells. But I was wrong.\n “I had Sphinx trace back a few other populations, those of the chimeras we’ve been cultivating these past few decades. Although there aren’t many chimera species, some rat-mouse chimeras have already reproduced over a hundred generations. What happens when we calculate the genomes of their ancestors?”\n All of the graphs except for the human population graph disappear, replaced by the graphs of a few dozen chimera species. Like demons, the graphs climb upward, all terminating in a single point, some higher, some lower.\n “They are the same as humans—these chimeras are the same as humans.” Edmund pauses, then raises his voice. “But can we conclude from this that humans descended from a chimera? Of course not!\n “I had Sphinx add to this model all of the Homo sapiens and Homo erectus genomes that we could find, leading to the discovery of one of our ancestors that shared a blood relationship with their ancestors.\n “This ancestor was not Eve’s human husband, but rather the hybrid child she had with a Homo sapiens. We used quantum algorithms on this child’s Homo sapiens genes to conduct a complicated ‘subtraction.’ Finally, we extracted the part of Eve’s genome that did not include any DNA from Homo sapiens.”\n Along with Sphinx, every point of light dissipates, then gathers into a huge double helix, one portion of which is highlighted in bright white.\n Edmund emphasizes every word as he concludes. “We are certain that this is a chimera—a cross-species chimera.”\n I close my eyes. A photo my mother sent me appears in my mind’s eye. In the documents, that photo was perhaps the most nondescript one, bundled together with countless standard shots of the chimera pig in the research notes. It was a close-up shot of the pig’s eyes.\n On the plane, I had glanced at it for maybe half a second, only to find that it had branded itself into my memories like a curse.\n Those were my eyes. It had my eyes.\n The hologram graphs disappear, leaving only Edmund on the stage.\n “Humanity’s common ancestor is a chimera. The foundation of all the ethical attacks and criticisms levied against us over the years has disintegrated. We have the evidence to prove that humanity was born in a laboratory. We are the product of science, not nature.”\n Edmund’s voice trembles with excitement. “We don’t yet have the technology to figure out what creatures were used to create humanity, and we can't tell who our creator was. But the success of chimeras and regenerative medicine tells us that we are only one step away from our Creator!\n “So what is there left to fear? Shall we boldly stride across this ethical barrier and let each person choose whether to join us, or shall we hesitate, timidly adhere to the fate of every other species on earth, and wait for the next bottleneck to return civilization to square one, or perhaps even to annihilation?\n “Esteemed guests, I submit that we’re at a crossroads of science and history: we must make a choice—now is the time for full-scale human experimentation.”\n The sound of scattered applause gradually swells to a thundering roar that fills the auditorium. Some in the crowd still wear expressions of doubt, but they’re also full of admiration. From the birth of that pig, this town has been the battlefront of human genetic transformation. It’s the holy site within the heart of every biologist and medical specialist. The announcement today has advanced the field again, perhaps even bringing humanity closer to a new world.\n It’s too bad my mother isn’t here to see this.\n Right at that moment, I receive a high-priority direct message. The sender’s name makes my heart skip a beat.\n “I’d like to chat after the event.”\n D. Cabin Zero\n “Edmund?”\n No answer.\n In the hundred years he’d been together with his AI, nothing like this had ever happened before. Luo Ming looked around, then raised his voice: “Edmund!”\n His assistant finally appeared. “I’m here.”\n Full of concern, Luo Ming asked, “What did you find in the captain’s cabin?”\n Before meeting the captain, Luo Ming suddenly thought of a trick—entering the captain’s cabin would give him the opportunity to have Edmund break into the ship’s core control systems, which were isolated from external networks. The AI would then be able steal all of the top-secret information there. The plan went smoothly until Luo Ming unexpectedly provoked the captain and was thrown out too soon.\n “It’s true: the captain has never replaced an organ,” Edmund said. “She was using prolonged hibernation to delay the aging process. The ship can awaken her in fifteen seconds, so there’s no impact on the ship’s normal operations.”\n “I don’t care about that,” Luo Ming said. “What else did you find?”\n “I only had time to gather some population data. There are 29,000 people aboard who haven’t undergone organ replacement surgery. The vast majority are young people under the age of 30. Only 15 are over 50 years old; above 80, only the captain. But she couldn’t have been the criminal because she’d been in deep sleep for the past month, and wasn’t awakened until after the incident had occurred.”\n “Then it seems we’ve reached a dead end here, too,” Luo Ming said, sighing.\n “Do you still think that the criminal is a ‘person’?”\n “You’re the only AI aboard this ship,” Luo Ming said. “If you did it, now would be a good time to confess.”\n Edmund’s voice lowered. “That’s a terrible joke. I have no way to clear my own name.”\n “That’s not what I meant,” Luo Ming said, backpedaling. “It was . . . a terrible joke.”\n “I know; I’ve already forgiven you,” Edmund said. “But I have indeed run into a bit of trouble.”\n “What happened?” Luo Ming turned and saw First Officer Qin Wei walking toward him with a couple of police droids.\n “I’m afraid that when I broke into the ship’s control system, the captain discovered me,” Edmund said apologetically.\n “Dammit!” Luo Ming furrowed his brow. “How can I turn you off?”\n “It’s too late. A part of my data was left behind in the captain’s cabin. By now, she probably knows everything about you.” Edmund hesitated. “For example, your other name.”\n For the first time, Luo Ming wished that Edmund had a physical form, so that he could give him the evil eye—both his “artificial” nature and his “intelligence” could learn to take secrecy more seriously.\n But he didn’t have time to scold the AI; Qin Wei was already standing before him. “Mr. Luo, I’m afraid you’ll have to come with us.”\n “What for?” Luo Ming asked, his face impassive.\n “There have been additional incidents involving Adam,” Qin Wei said, his rapid speech revealing his unease. “I need your help.”\n Luo Ming let out a held breath. “I would be happy to assist you, Mr. First Officer. But I recall that information concerning Adam is beyond my clearance level.”\n Qin Wei snapped his fingers: an enormous file suddenly filled Luo Ming’s inbox. Coldly, Qin Wei said, “You’re cleared now.” He turned and walked away.\n Luo Ming rushed to catch up. Summoning every ounce of sincerity, he said, “Please tell me what happened.”\n Qin Wei’s expression softened. “I’ll be brief: the other organ cultivation cabins all followed Cabin 35’s example. Our orders have been canceled en masse, and the hospital is paralyzed. The captain has declared a state of emergency.”\n As he spoke, he sent more files to Luo Ming. The documents included a three-dimensional cultivation cabin model that even Edmund hadn’t been able to find. According to these documents, the oval Deck Seven was the site for hundreds of linked cultivation cabins, which formed an inward spiral like a whirlpool.\n Luo Ming recalled what Edmund had said earlier. “Do these cultivation cabins communicate with each other?”\n “They share the same feeding ducts, so, theoretically, they’re not isolated from one another.” Qin Wei was now fully cooperating.\n Luo Ming mulled over Qin Wei’s response. Five minutes later, they arrived at the security line before Deck Seven. The white-haired captain stood amidst a crowd of police droids. She saw Luo Ming and made an unhappy face as she asked Qin Wei, “Why did you bring him here?”\n “Luo Ming is the officer in charge of this investigation, Your Excellency,” Qin Wei replied simply.\n The captain scrutinized Luo Ming. Luo Ming avoided her gaze and examined the scene instead. “Edmund,” Luo Ming said softly, “wasn’t there something within the documents you sent that said one of the cultivation cabins is dedicated to the nervous system?”\n No response. Edmund had disappeared completely. Luo Ming had no choice but to ask Qin Wei the same question.\n Qin Wei’s answer was quick: “Cabin Zero. Though it’s not a cultivation cabin; rather, it’s a conservation cabin that preserves a few exceptional brains.”\n “I thought brains were on the list of organs that can’t be replaced.”\n “Right.” Qin Wei gave him an odd look. “The brains grown in Adams have no memories. Replacing the brain would turn a patient into a mindless fool . . . who would do that?”\n A terrible chill ran up his spine. Luo Ming felt himself getting close to the answer. “Then the ones in Cabin Zero are—”\n Qin Wei hesitated, but still replied. “On their deathbeds, some important individuals chose to deposit their brains here. We adjusted the genetic expression modules of the Adams inside Cabin Zero so that they would age extremely slowly.”\n “So you’re telling me that though the bodies of these people have died, their minds live on.”\n “Their minds are in deep sleep.” Qin Wei was growing impatient. “Why are you asking this?”\n “I’d like to take a look at Cabin Zero.”\n “Cabin Zero is perfectly fine.” Qin Wei eyed him suspiciously. “The captain herself confirmed that.”\n Luo Ming persisted: “Last time, you and the captain also thought everything was perfectly fine.” He noted Qin Wei’s expression, then added, “I’m concerned that things are deteriorating faster than we imagined.”\n As things really did seem to be getting out of hand, Qin Wei finally agreed to Luo Ming’s request. Cabin Zero was on the lower part of Deck Seven, at the center of the whirlpool of cultivation cabins. When the cabin doors opened, Luo Ming was met with an unbelievable sight.\n Sacks made of translucent membrane dangled from the ceiling, each holding a spinal cord or a cerebrum. Between the Adam pouches, additional membranes had already enveloped all the interconnecting passageways, creating an actual web—a three-dimensional network made of neurons, spinal cords, and lumps of cerebral tissue. Two “people” were laid out neatly on the ground: the first a complete body—clean, naked, cold; the second a bulging sack of human skin, whose open abdomen revealed a heap of organs arranged in neat order: large intestines, stomach, liver . . .\n It wasn’t a human at all, but a pile of human parts.\n “My God, what in the world—” Qin Wei murmured.\n Luo Ming put on a pair of gloves and carefully peeled back the skin covering the loose organs. Where the thoracic cavity should have been, there was only a ghastly segment of gleaming white bone.\n “That’s his rib—Adam’s rib,” Luo Ming blurted. “He’s trying to create an Eve.”\n 5. Argus\n And [Hera] set a watcher upon [Io], great and strong Argus, who with four eyes looks every way. And the goddess stirred in him unwearying strength: sleep never fell upon his eyes; but he kept sure watch always.\n —Hesiod, Aegimius (as translated by Hugh G. Evelyn-White)\n It is said, too, that Echidna, daughter of Tartarus and Earth, who used to carry off passers-by, was caught asleep and slain by Argus.\n —Apollodorus, Bibliotheca, 2.1.2 (as translated by Sir James George Frazer)\n When I see her again, I begin to understand why my father was so madly in love with her.\n She can’t be controlled, can’t be known, can’t be predicted. But when she’s standing before me, she’s thoughtful and warm. This contradiction allows her to exude allure like a demon. She’s sitting on a black Barcelona chair now, her face pale and wan like a girl’s. Her gaze falls upon me and she laughs weakly. “Tony, I’m so sorry that I didn’t tell you earlier—did I worry you?”\n Neither “yes” nor “no” would do—both would reveal me as a hypocrite. So I say, “I helped out with the rescue effort. I’m overjoyed to see you’re alive and well.”\n “When I was at Gardermoen Airport, I realized something was wrong with my body, so I borrowed a friend’s plane to get back to the laboratory more quickly.” Her speech is deliberate, slow. “Then I discovered that nothing could be done about my problem, and so I just let the world think I was in the crash.”\n Anxious, I ask, “What do you mean?”\n “I’m going to die soon.” She looks at me, unperturbed. “For ten years, I’ve been exploring the potential of genetic modification. I thought I had resolved the entire genetic network, but I was wrong.”\n I don’t know what to say.\n Warmly, she tells me, “See, this is science. Most of the time, we aren’t so lucky.”\n “Mom—”\n “My failure has led me to make some adjustments to my future plans. We have to face the risks inherent in large-scale experimentation. I got in touch with a friend who’s investing in an interstellar colonization program.” She makes a call, and a hologram of a person appears before us. “Chen Ying, this is Tony. I believe you’ve already met.”\n The woman is the one who had come to meet me at the airport on the day of Sphinx’s announcement.\n Chen Ying ignores me completely. “How do you feel?”\n “Terrible,” says my mother. Then she looks at me again. “Tony, Chen Ying is one of the wealthiest people on Earth, but most people know nothing about her. I’m trying to convince her to lend me two of her five colonization ships for a few hundred years to use as research vessels.”\n “I’ve already agreed.” Chen Ying furrows her brow as she looks at her.\n “Right, but you haven’t heard the actual plan yet. I’d like to put them on the same orbit as a short-period comet—”\n “That’s not important,” Chen Ying says, interrupting her. “Send these details to the technicians; you need your rest now.”\n My mother makes a face. “Alright.” Then, she ends the call.\n The brief conversation leaves me with an impression of intimacy. Maybe it wasn’t so much the topic of the conversation as it was Chen Ying’s expressions. My mother senses my questions, but she doesn’t answer them. “I’m going to move the next-generation chimera lab onto the spaceships. That way, I don’t have to worry about the catastrophic consequences in the event of an accident in a terrestrial genetic lab. Eden is my first ship, which will conduct more conservative research. The chimeras she carries come from the first generation of stem cells—that is, part of them comes from you.”\n I remember the pig’s eyes.\n She continues: “We’ve been cultivating these cells for many years. Strangely, although we’ve tried to use other human cells and cells from other animals, this combination has always been the most stable. I guess we stumbled on a miracle with my first trial. Tony, you and I are both very lucky.” She realizes my mind is wandering and changes the topic. “Speaking of which, what did you think of the big announcement?”\n I think over the commentary from the last few days. “From what I’ve heard, this hypothesis still has some holes . . . ”\n “I left them on purpose.” She gives me a cunning grin. “I just wanted to get everyone arguing, even start a war within science—only then can there be a revolution.”\n “But you seem to be losing.”\n “You still don’t understand people.” She touches a finger to her chin. “Only through conflict can people have choices; only then can we rouse people’s emotions, even whip them into a frenzy. As the flames of war expand, the news will spread farther. More and more will join the battle, creating more soldiers for me. Only then will I stand forth to protect my believers, dealing a deadly blow to the opposition.”\n “You’re already holding the weapon for dealing that blow, aren’t you?”\n “Not only that, Tony,” she says gently. “All of this is a trap I’ve set to distract them from the real question.”\n “The real question?”\n “What we announced at the event has nothing to do with the research I want to conduct. The interesting question has never been whether we can use humans as test subjects. I’ve long trodden in that forbidden territory, starting from when you were six. The far more interesting question is: What have we created through these experiments?”\n “Chimeras.”\n “Chimeras, sure.” She nods. “But what exactly are chimeras—people or beasts? Do chimeras have thoughts? Can they reproduce with other chimeras? Are chimeras the path forward for human evolution or humanity’s downfall?\n “These are my fatal weaknesses because I don’t know the answers. From the very beginning, I didn’t understand why the chimera experiments were successful. I was like a child playing with clay, rolling various colors together until they turned into something new.\n “But I won’t tell people that I don’t know the answers. I’ll let them stare at an irrelevant chimera ancestor, a point of controversy where I hold in my hands all evidence, where the theory is both simple yet evocative. Look, they’ll use this issue to attack me, thinking that this is the foundation of regenerative medicine. But they’re wrong: once the arguments start and the flames of academic war erupt, I will be the only one who benefits. My opponents will fail and be thoroughly discredited; my soldiers will become a dedicated but foolish hivemind. Tony, this is what makes the game fun.”\n Seeing her eyes sparkle with excitement, I finally understand why my father would so often murmur the word “monster” whenever she came up in conversation. She’s far more terrifying than any AI I’ve encountered. I surmise her tactics: “Do you plan on continuing to let Edmund lead the charge for you?”\n “Edmund?” She’s startled for a moment, then laughs uproariously. “Oh my goodness, you really didn’t notice?”\n “Notice what?”\n “The Edmund at the press event was a hologram—the real Edmund passed away five years ago.”\n Once again I feel helpless, like an insect that’s been caught in a spider’s web. “I really didn’t notice—”\n “Okay, then that’s our little secret.” She giggles and taps her head. “There was no Edmund on stage at the announcement. The one standing there speaking through the hologram was me.”\n “But you . . . Why did you keep his death a secret?”\n “Using him and your father as the mouthpieces of the research group and the charitable foundation saved me a lot of trouble. Plus, he agreed to let me use his likeness,” she explains patiently.\n I notice her expectant gaze. “Then—do you want me to join the foundation?”\n “That would be the most perfect outcome. Tony Lee would without a doubt be the finest spokesperson for the Tony Lee Charitable Foundation.” She shrugs. “But you won’t join.”\n “Why not?”\n “Because your body language and your expression give you away,” she says. “You don’t want this, and this kind of work doesn’t suit you anyway—either way, I want you to make your own choices. From your reaction just now, I think you’re far more interested in the spaceship.”\n I relax my hands, held tightly all this time in front of my chest. “It’s true; a research ship does sound interesting.”\n “And also mad,” she says. “As your mother, I don’t want you to go. I don’t want you to become a research subject again.”\n Her gaze now seems to truly carry a deep love. I don’t understand her at all. “I’m sorry—I’ll make up my own mind.”\n “Of course. I have no right to tell you what to do.” She lets out a soft sigh. “But I still want to tell you that you’re my most perfect creation, so perfect that you frighten me.”\n “Why?”\n “Every time I saw you, heard about you, or even earlier, when I was pregnant with you and felt you, I experienced such terror.” She looks out the window. “Because once I turned my head and saw the pile of trash in my lab, I’d suddenly realize the vast distance between myself and the Creator. I’d worry if I’d made a mistake from the very start, because I’d broken His rules.”\n “You weren’t wrong,” I say. “You saved my life.”\n “At a price.” Her voice softens, revealing a deep exhaustion. “An enormous price that you can never imagine.”\n Everything happens just as she predicted.\n Controversy after controversy concerning chimeras and human experimentation erupt, and every politician and college student seems to have something to say about the subject.\n The dispute of the century ends three years later with news of Edmund’s “death.” His obituary, in combination with a new paper, deals a mortal blow to her opponents.\n The revolutionaries reap the fruits of their victory, and the conservatives, in the face of ironclad proof, wilt and fade. Chen Ying’s timely announcement of the research spaceships turns into the last lifeline for these drowning ethicists to clutch. The wild plan easily gains everyone’s support: immortality proves to be an irresistible temptation for all, and even the wealthiest can’t obtain a ticket aboard the ships.\n Of course, obtaining a ticket isn’t a problem for me.\n I end up boarding Eden after all. Called by a strange impulse and yearning deep in my heart, I abandon my family, my friends, my job—everything I have on Earth. At the embarkation ceremony, I watch Chen Ying, the captain, deliver a speech.\n “From today on, this is our ship. My dearest friend named it Eden, for it carries humanity’s wildest dream, and because it will bring us new life.”\n E. The Complex Chimera\n “It’s still a child,” Luo Ming said. “This explains everything.”\n “What do you mean? What exactly is ‘it’?” Qin Wei asked, confused.\n “Adam,” Luo Ming replied. “Or, to be more accurate, ‘it’ is the collective made up of the Adams within all 109 cultivation cabins. They’ve connected with one another to create an enormous creature that thinks, breathes, and bleeds—a complex chimera.”\n Qin Wei paused for three seconds before he processed what Luo Ming was saying. “Preposterous! How could this be?”\n “Yes, that’s really what it is. Originally, it wasn’t supposed to have thoughts, but you placed brains into its body, thereby giving it consciousness. All chimera experiments prohibit the creation of a nervous system—this was a basic rule put in place during the design of the Adam matrix, but you’ve broken it.”\n Luo Ming noticed that the captain had stopped outside the cultivation cabin to listen to his explanation. “It’s extremely smart, but, at the same time, extremely naïve. After observing for a long time, it was clever enough to break into and take over the monitoring system for the cultivation cabins, but it had no idea that the hospital ordering system even existed. Now it’s trying to imitate us. It found a human corpse to study and analyze, and it’s trying to use these organs to create a self—it really thinks of itself as the Adam of lore, so it’s trying to create an Eve. God, this is too funny!”\n “Enough!” Qin Wei shouted. “I need you to provide me with evidence, Officer Luo, and not mere crackpot theories.”\n “I believe that, in every cultivation cabin, you’ll find extra organs that haven’t been ordered—for example, eyes, because it’s eager to learn about this world.” Luo Ming was speaking quickly, his tongue racing to catch up with his thoughts. “Please send someone to check—oh, it must also have had help moving the corpses and limbs into the cultivation cabins, unintelligent helpers that it could easily control.”\n Luo Ming trailed off as a police droid entered. It was carrying a whole set of human ribs. Seeing Qin Wei and Luo Ming, it stopped, dazed, as though it didn’t know what it was supposed to do.\n “I’ve long said that the ship’s intelligence systems are too primitive.” Unwittingly, Luo Ming had borrowed one of Edmund’s phrases. “If the complex chimera can take over the monitoring system, then controlling these police droids would be child’s play.”\n The appearance of the confused police droid forced Qin Wei to accept Luo Ming’s conclusion: the one responsible for the series of incidents was Adam, the soul of Eden. After a hundred years of growth, it awakened the brains stored inside its pouches, dreamed up its own ideas, and was now trying to use the organs it had cultivated to create a new human-shaped self.\n “I’ll go check for those eyes you mentioned.” Qin Wei’s face was dark as he exited the cultivation cabin. Luo Ming watched him leave.\n Alone with Luo Ming in the cabin, the police droid came back to life and shut the door.\n Luo Ming heard his own heart thumping. This was no good. He had no idea where Edmund was, and this police droid looked much stronger than he was.\n “Did you find me,” the police droid said, “because you are me?”\n “Are . . . are you speaking through that thing?” Luo Ming stared at the pair of eyes hanging in the corner of the cultivation cabin—light brown with a hint of gray.\n “I am,” replied the police droid under the control of the complex chimera. “Please answer my question, Tony Lee.”\n “When did you discover my true identity?” Luo Ming countered.\n “When I first received your organ order,” the chimera said. “You asked for eyes. My eyes.”\n Those are my eyes—Luo Ming gazed into those irises, recalling the close-up photograph sealed away in his memories.\n “So I was the one who triggered your self-awareness.” He let out a soft sigh. “Yes, I felt your presence the very first time I entered a cultivation cabin. I deduced everything from that feeling.”\n “Would I have grown to look like you?”\n “I don’t know.”\n “I’ve failed; I didn’t create Eve.” The police droid looked down at the floor, then carefully placed the ribs atop the human skin. “Why? Tell me: where did I go wrong?”\n “This isn’t the way humans create new life.”\n “But this is how you created me. You put different things into my body, and then I became me.” The police droid looked at him, puzzled. “And I also know that I’m the same as you.”\n “No, you and I are not the same. We weren’t born in this way—even you weren’t born like this.” Luo Ming took a step back, gingerly making his way toward the cabin door.\n “How are we different? My cells are identical to yours.” The pair of eyeballs stared at Luo Ming.\n “Only some parts are the same.” Luo Ming burst through the cabin door, leaping out without any hesitation. Only after he landed did he yell, “Edmund!”\n The silhouette of the police droid froze by the cabin door. Edmund had appeared just in time to take control of it. “Nice work,” said Luo Ming.\n But there was no response.\n “What’s the matter?” Luo Ming tapped his ear. “Didn’t you do this? Stop hiding!”\n “I used the ship’s control system to lock down all police droids.” The captain answered him. “Thank you for helping us uncover the truth, Officer Luo—or do you prefer Tony Lee?”\n “Whatever you want.” Luo Ming looked at her. “I suppose you’ve known about my identity for a long time, Captain Chen Ying.”\n “Of course. Do you think I would have allowed you to gallivant about my ship, poking your nose into everything otherwise?” Chen Ying glared at him. “Enough. Don’t play innocent with me. Your acting skills are nowhere near your mother’s. Let me see: taking over a police droid, hmm? And stealing information from my cabin—do you need me to list out every violation you’ve committed over the years?”\n Luo Ming tried to placate her with a grin. “All in the service of solving cases, Your Excellency.”\n Chen Ying harrumphed. “I have to admit you’ve done a good job.”\n “Thank you for your approval.”\n Chen Ying shook her head, deciding to change the topic. “I’ve already directed the ship to land. Luckily, we happen to be headed toward Earth already. The regenerative medicine group will send scientists to study this complex chimera. Eden’s mission is over, and I’ve done my duty to your mother.”\n “I’d say you’ve done a good job, too,” Luo Ming said.\n “Have you kept your distance from me because I was your mother’s lover?” Chen Ying suddenly asked.\n Luo Ming couldn’t help laughing. “I’m sorry, but my mother has never ‘loved’ anyone.”\n “Why do you say that?”\n “Love requires being with someone; words of love are just lies,” Luo Ming said. “She would never have wasted time being with anyone.”\n Chen Ying looked at him. “Are you sure?”\n 6. Epilogue\n Before I leave Eden, I go find Chen Ying.\n “She passed away not even a month after you saw her for the last time,” Chen Ying says. “Of course, she’d already planned everything.”\n “I guessed.” It was around then that I received the AI Edmund as a gift.\n Chen Ying takes me to the medical research facility under Deck Seven. Her real tomb is hidden there: a small, white box, not a single word anywhere on it.\n “Is this really what she wanted?” I ask.\n “Actually, I decided to bring her with me when we loaded the ship.” Chen Ying laughs bitterly. “She wouldn’t have cared where she’s buried, anyway.”\n “But to be on a spaceship—” I think about it. “Forget it. This is fine.”\n Chen Ying looks at me. “Thank you.” After a pause, she says, “From the very beginning, I knew she wanted me only for my ships.”\n “What happened between my mother and you is none of my business.”\n But she goes on, speaking to herself. “My family was among the first to get into the space assembly business, and the first to construct a ship large enough for interstellar colonization—I’m sorry, I know you don’t want to hear any of this.”\n “Uh—” I hesitate for a moment. “Please go on.”\n “To make a long story short, by the time I met her, we’d already completed the designs for the spaceships and the preliminary investment. The first time she saw me, she asked me right away whether she could borrow a couple ships for research. I thought she was nuts—each ship cost hundreds of billions!”\n That sounds just like my mother. “I can imagine that.”\n “To change my mind, she switched to an equally ridiculous method of persuasion. I was younger than her by six years. I had two children, but I’d never gotten married. At first, I told my boyfriend about her as a joke.”\n “But she succeeded in the end.”\n Chen Ying sighs. “Yep.”\n “That’s just how she was,” I tell her. “My father was more or less in the same situation.”\n “She was . . . very unique.” Chen Ying pauses and looks at me again. “When I hesitated about starting a relationship with her, she said something that changed me. She could plant her ideas into your heart and make it seem like they were native to the soil.”\n My curiosity overcame the awkwardness of hearing about my mother’s love life. “What did she say?”\n “She said, ‘You’re standing inside a cage that I can’t see, but outside the cage is the whole world. I’ll be here waiting for you to come out, and then you’ll see that there’s nothing to be scared of.’”\n I’m reminded of a recording of an interview my father did shortly after setting up the Tony Lee Charitable Foundation. That was the one time he and my mother appeared together on TV after their divorce, and they’d appeared only to respond to the attacks on chimera experiments. The host was losing in verbal jousting with my mother and decided to change tactics by turning to my father: “I’d really like to know why you’ve agreed to work with the former Mrs. Lee. Didn’t she abandon you and Tony?”\n My father paused thoughtfully, and then said, “We’ve chosen different paths in life, but, as her friend, I’ve never doubted her wisdom and courage. You must understand that she’s not an ordinary person like you and me.”\n “How is she different?” asked the host.\n “We’re often bound by custom and habit, but she’s not. She doesn’t even understand why we’re confined by these rules, unable to keep up with her. Marriage, science, what have you—to her, these are all mere problems to be solved. She’s like a curious child, afraid of nothing, intent on finding out what the world beyond the fence is like—this is why she was able to successfully create a chimera, and it’s also why she can now save lives through Adam.”\n While he spoke, the camera was focused instead on my mother’s face. Her perfect little smile disappeared, replaced by confusion and surprise. I can’t remember if I asked Edmund a question while watching the recording or if he had jumped in on his own initiative, but I distinctly remember the AI’s commentary:\n “She thought she knew the truth about everything, but she didn’t know the truth about herself—only your father understood her.”\n F. Regeneration\n The last person to disembark from Eden was Lin Ke—the woman who was so upset by her organ cancellation that she reported it to the police, and who suffered a heart attack upon seeing Cabin 35.\n After three days of emergency medical treatment, her heart was still on the verge of failure. And, due to oxygen deprivation, her cerebrum was barely alive. Having obtained the captain’s authorization, the doctors decided to take the extraordinary step of conducting an emergency transplant with two organs found in the cultivation cabins—they certainly weren’t hers, but they came back negative on the lymphocyte cross-matching test. Unexpectedly, the procedure was a complete success.\n A week later, Lin Ke, supported by a doctor, disembarked from Eden. Standing together with Luo Ming, they waited for the shuttle to take them back to Earth. She said “hello” to Luo Ming, who recognized her as the woman who had first pursued the mysterious organ cancellations and who had collapsed in front of Cabin 35.\n After some small talk, he said, “So, you’ve recovered?”\n “Thanks to organ replacement surgery,” she said, “How did you solve the case?”\n “That’s quite a story.” Since she was the first witness, he felt comfortable recounting for her the details of the mystery, including the part where all the Adams had joined to become a complex chimera.\n “Incredible!” Lin Ke’s eyes shone as she listened. “How’s the pig—I mean, how’s the complex chimera doing now?”\n Luo Ming looked at her, startled. “Wait, did you just say ‘pig’?”\n “I’ve got some strange ideas in my head now.” She laughed sheepishly. “You told me all the cultivation cabins are joined into one chimera; maybe a part of ‘it’ is now in my brain.”\n “Did you have a cerebrum transplant? I thought those weren’t possible!”\n “Ah, yes, but the doctors had to try to save my life,” she said. “They used a preserved brain from Cabin Zero instead of one grown from scratch. My current brain must have spent quite a long time in Cabin Zero.”\n Luo Ming nodded. “I’m glad the risky surgery worked out. But are you still ‘Lin Ke’?”\n “Who knows.” She shrugged. “I don’t plan to see her friends any time soon, at least.”\n Luo Ming felt a sense of déjà vu when he saw her warm and cunning smile. Uneasy, he cleared his throat and said, “The complex chimera is still on Deck Seven. Right now Eden is swarming with regenerative medicine specialists.”\n “So that’s what’s going on! After you go back to Earth, what are you going to do?”\n “I don’t know. Maybe I’ll travel the world after so many years spent cooped up in a ship.”\n She smiled again. “Sounds like a great plan.”\n The shuttle arrived at the port. Luo Ming stepped through the door and turned around. He found Lin Ke rooted to her spot.\n “Do you need help?” he asked.\n She dismissed him with a little wave. “I’ve decided to stay on the ship, Tony. This time, I won’t abandon it again.”\n Luo Ming’s eyes widened. “What?”\n “I’ve spent more than a century with you—I think that’s long enough,” she said. “My other child needs me now.”\n Before Luo Ming could try to go back to her, the doors to the shuttle hissed shut. He pounded with all his might against the metal panels, but they didn’t budge at all. “Dammit! Open the door! Please, open the door!”\n But the shuddering of the floor told him that the shuttle had already taken off. Luo Ming looked out the window in despair. The space station was already several kilometers away. He would never again see “Lin Ke.”\n He held his breath, and, fingers trembling, found her in his long contacts list.\n “Who are you?” Luo Ming asked.\n Soon, he received a direct message in response:\n “Remember what I told you before, Tony: there never was any Edmund. I was always the one speaking.”\n Footnotes\n 1 - In 2010, Kobayashi et al. published a study in Cell that demonstrated the viability of rat-mouse chimeras. At the same time, commentary about the study also appeared in Cell under the title “Viable rat-mouse chimeras: where do we go from here?” This quote paraphrases that commentary. Of note is the fact that the same research group published another study in PNAS in which they performed a similar experiment with a pig. Ethical concerns stopped them from creating a human-pig chimera.\n 2 - Named as one of the ten greatest scientific discoveries of 2013, CRISPR/Cas9 allows the creation of organisms with knocked out genes. That is, so long as we know which genes control the development of which organs, those genes can be made inoperative (“knocked out”). If a knockout pig blastocyst were combined with human stem cells, theoretically, a pig could be grown with a human organ.\n Originally published in Chinese in Science Fiction World, October 2015.\n Translated and published in partnership with Storycom.\n Gu Shi is a speculative fiction writer and an urban planner. A graduate of Shanghai’s Tongji University, she obtained her master’s degree in urban planning from the China Academy of Urban Planning and Design. Since 2012, she has been working as a researcher at the academy's Urban Design Institute.\n Ms. Gu has been publishing fiction since 2011 in markets like Super Nice, Science Fiction World, Mystery World, and SF King. Notable works include “Chimera,” “Memory of Time,” and “Reflection.” In 2014, she won the Silver Award for Best New Writer at the Chinese Nebula (Xingyun) Awards. Currently, she’s working on her first novel, The Reign of Eternal Delight, an alternate history set in the court of an empress ruling in the dynasty founded by Wu Zetian, the first Chinese empress.\n Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\n Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\n Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\n He lives with his family near Boston, Massachusetts."}