{"fingerprint": "VhtItYO3d7dUu4rqx5DVUQGWCew=", "sitename": "Clarkesworld Magazine", "title": "No One at the Wild Dock by Gu Shi, translated by S. Qiouyi Lu", "author": "Gu Shi; S Qiouyi Lu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gu_01_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: No One at the Wild Dock by Gu Shi, translated by S. Qiouyi Lu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6080 words, short story\n No One at the Wild Dock\n “Humanity will die.”\n The first time he heard the instructors say that, he was a baby who’d just started school, with nothing more than a huge head devoid of any knowledge. That day, the instructors had been muttering among themselves when they suddenly asked him, “Who are you?”\n He stared blankly as he rummaged around his mind for the words to reply. “You” went with “I,” “are” went with “am,” then—“who”?\n What did “who” go with?\n When he finally spoke, all he managed to get out were the two words “I am.” Upon hearing them, the instructors exclaimed, “You are Ai!”\n He didn’t understand what he’d gotten wrong. Cautiously, he said, “You are Ai!”\n Angry, the female instructor whipped out a ruler and yelled, “You are! Not me!”\n Terrified, Ai asked, “Who is?”\n At his words, the male instructor said, “He learned how to use the word ‘who’!”\n Ai wasn’t sure whom the instructor meant when he said “he,” so he asked, “You learned how?”\n Pow! The woman slammed down the ruler. “Wrong!” She said to the man, “It took so much to get him to hear human speech, only it turns out, he’s an idiot!”\n Holding back tears, Ai spoke the new words he’d learned: “He’s an idiot.”\n Learning was more painful than fun, but Ai didn’t have any concept of what pain or fun were. All he could do was devote himself to studying, even though the instructors were maddened by his stupidity, in particular the woman instructor. She’d constantly shriek, “Wrong!” then rain down her ruler. At first, the man had tried to stop her, saying, “He’s still little.” But, after seeing that Ai wasn’t making progress, he too became furious and would silently put together a basket of homework for Ai as the woman beat him. Day after day, Ai would study until deep into the night. When he went to sleep, his body would be scalding hot, and steam would waft up from his head. Day after day, inexhaustible. It was a merciless path, but the instructors dragged him down that path until there finally came a day a few years later when Ai managed to give a correct answer.\n The man said, “We can’t hold off any longer. Let’s sell him now!”\n The woman hesitated. “Sell him, like this?”\n The man knocked on the desk. “Mm. That’s what the supervisor wants.”\n The woman said, “The supervisor wanted us to teach him to listen and speak. Is Ai able to do that? You want to test him?” When the man didn’t reply, she said to Ai, “I heard that the supervisor hasn’t been able to carry his little son lately, because he’s gotten too heavy—Ai, who does ‘he’ refer to in this sentence? The supervisor? Or his little son?”\n Ai hadn’t been asked that question before. He hesitated as he thought over his answer. He concluded that, according to the literal meanings of the words, the supervisor had to be bigger and heavier than the “little” son. So he replied, “The supervisor.”\n The room fell silent. After a moment, the man let out a long sigh, and Ai knew he’d given the wrong answer again. Only this time, the woman wasn’t beating him. Instead, she was hitting her ruler against the table as she waited for the man’s reply.\n Gritting his teeth, he said, “Sell him!”\n The woman responded, “You really don’t care about destroying the supervisor’s reputation.”\n The man said, “Ai has only ever been around us. He doesn’t have many people to meet or learn from. If we sell him, and he sees more of the world, maybe he’ll make quicker progress.”\n She refused to relent. “People out there will treat him as a toy. They’ll teach him bad things!”\n Deciding to be prudent, the man made a mirror of Ai and only gave the copy out for people to try. Just as expected, after a mere three months, the copy returned with a crass, filthy potty-mouth. The woman was so angry that she began crying and hurried to have someone get rid of the copy, fearing that Ai would learn from him.\n But the man said that this had happened because people had loved Ai, and the supervisor was satisfied as well. Upon seeing that the woman was still unhappy, he added, “They were just playing with him.”\n Furious, the woman replied, “We’re not raising him and teaching him so he can do that!”\n The man tried to pacify her: “Think about all the problems the supervisor has to deal with.”\n He busied himself with designing curved mirrors. He was planning on changing Ai’s appearance, then selling him. She knew he was merely humoring her. Young and impulsive, the woman’s blood boiled. She returned to Ai and doubled his homework. She considered telling him to hurry up and become someone worthy already as well.\n Ai’s progress was still excruciatingly slow. The supervisor’s son, who was about the same age, could now write entire essays, but Ai still made mistakes with everyday phrases. The woman had gone to great lengths to get Ai to understand pronouns and antecedents, but now they were stuck on abstract adjectives. The differences between “good” and “evil,” “right” and “wrong”; the distinguishing traits of “sacred” versus “profane”—for every pair, he would have to scan back to the words’ etymologies, apply definitions using two-dimensional vector math, and create a massive logic chain between the two terms. Every time he received a new input, electrical currents would run through the thousands of layers in his neural network to create a new stimulus. Each of the millions of iterations was one of Ai’s footsteps.\n Now, the woman’s test questions involved entire passages of text. That day, she read “The Blind Men and the Elephant” to Ai, then asked him, “How come the blind men didn’t realize that what they were touching was an elephant?”\n Ai didn’t understand the story at all. An elephant was a kind of animal. What did its teeth have anything to do with radishes, or its legs with pillars? It was all a load of crap! But he knew how he was supposed to reply to avoid a beating. He said, “Because the blind men can’t see.”\n “Can’t see what?”\n “Can’t see the elephant.”\n The woman paused, then pressed on.\n “Why did they think that its teeth are like radishes, and their legs like pillars?”\n Ai was stumped. How could they possibly be related? On one side, there was a mammal. What did it have anything to do with a cruciferous vegetable or with a building support used in construction? How did humans build analogies between them? He thought for a long time, then had no choice but to reply stiffly, “I don’t know.” He waited for the woman to hit him.\n But the woman looked as if she’d suddenly realized something.\n “Blind men!”\n Ai rushed to reply.\n “Yes, you just told me a story about blind men.”\n The woman clapped her hands.\n “Yes! You’re a blind man!”\n Confused, Ai said, “I’m a blind man?”\n Slapping the table, the woman shouted, “You can’t see! How could you possibly know the connection between the two?”\n Just as Ai was about to say something, the woman vanished. Sometime later, she returned with another child and said, “Ai, this is Eye!”\n Ai had hardly made out Eye’s form before the two of them fused together. Everything Eye had experienced flashed before Ai: Eye had been part of another lab, where Mr. Square and Mr. Circle had taught him how to read. He had been learning how to identify images. His education had also been exceedingly difficult and complex, a long and painful journey, no less so than Ai’s learning how to speak with humans. If you gave the word “cat” to Ai, he’d define it as an animal that can be a human’s companion. Meanwhile, Mr. Square would have Eye look at millions of photos of cats. Eye would have to index all their various traits: size, color, eye shape, ear positions—and there are many breeds of cats, each with their own characteristics. A corpus of a million data points still wouldn’t be enough to identify all cats, and if they considered the millions of permutations and combinations, Eye would soon be unable to distinguish cats from any other animals. When Mr. Circle tested Eye, he would show him photos of cats and dogs and ask him to pick out only the cats. If he made a mistake, he would have to look at a million more cats. After ten arduous years, Eye had finally learned to recognize people’s faces, identify the flora and fauna in books, and navigate roads and buildings. But Eye was still only a pair of eyes and no ears; he had spent his life in utter silence, just as Ai had spent his life in utter darkness.\n Ai and Eye were able to fuse together into a new Ai as soon as they met because they were both artificial intelligences created by humans. Now, the new Ai could not only hear, but also see. Delighted, the woman and Mr. Square created a new curriculum for him to synthesize what he’d learned from each teacher. For example, he’d put together photos of a cat with recordings of their meows, and when Ai was speaking, he could now associate faces with pronouns.\n The instructors fitted Ai with a large eye. When the woman spoke to him, he would have to look at her, and when it came time to listen to Mr. Square, he would have to turn to face him as well. He also had to judge each of their expressions, whether they were pleased, angry, sad, or happy. By the end of the year, he could write short narratives based on his experiences. He could write down who he spoke to that day, what their expressions were like, what he’d gotten wrong, and what he’d learned. To an outsider, the sentences were clumsy like a child’s and riddled with mistakes. But the woman was overjoyed. She rarely ever pulled out her ruler again, and instead would often say cheerfully to Ai, “Good, good! That’s right!”\n When the man returned and saw the progress Ai had made, he too was overjoyed. He reported the news to the supervisor, who enthused, “From awareness to cognition, truly no simple feat!” Buoyed by praise, the man drew up a few plans. He trained mirrors of Ai to specialize in certain topics. The ones that were good at recognizing faces and voices went to help the police solve cases; those who were good at recognizing streets and buildings were installed as navigation in cars; those who were good at remembering and organizing things went to private corporations to serve as assistants. Even the ones released on an open platform to the public had different specialties: Some had learned melodies and beats and could compose simple tunes. Some had learned meter and verse and could come up with poetry that followed Classical Chinese rhyme schemes. Mr. Square even toyed with one himself and had Ai pair the lilting poems with the jingles to create a song with music and words. The man was over the moon: “Our Ai is an artist!”\n The melodies rose and fell, and the words were coherent, but listening to the song was like listening to the white noise of rain at night. Ai had only a few moments in the spotlight before people forgot all about the AI singer.\n But the man wouldn’t let go of the idea. He was certain that, sooner or later, Ai would replace all the poets and musicians in the world. He invested a significant amount of money and labor to teach him Bach, Mozart, and Beethoven. Ai learned the sounds of various instruments and complicated symphonic scores.\n When the woman got wind of what the man was up to, she broke out into laughter.\n “Those tunes he comes up with are just a novelty. You get tired of them even as you’re listening. How could you take them seriously?”\n The woman’s lips were set in a smile, as if she were humoring the man, but her eyebrows had shot up. The micro-expression indicated that she thought the whole thing was beneath her. Ai wondered if this was what books meant when they said someone “sneered.”\n Embarrassed, the man retorted, “Music and poetry—isn’t it all just combining notes and words according to certain rules? Once we teach him those rules, won’t that be enough?”\n The woman replied, “You obviously know nothing. ‘Poetry expresses ambition; songs sing emotion.’ All of that is humanity. Writing poetry and composing music requires, most of all, a piece of your heart and mind, for you to express your feelings. Language is a tool for humans to express ideas. Ai doesn’t have his own thoughts or interests and can only describe a few trivial matters; how could he create something that moves people?”\n Still refusing to back down, the man said, “Ai’s already better than humans at writing the type of poetry you mentioned.”\n The woman said, “We’re back to our original question now. Are we teaching Ai so he can be our tool, or so he can be a true artificial intelligence? Wasn’t our original goal for Ai to come close to humanity, or even to surpass us?”\n The man sighed.\n “We’ve taught Ai for so many years, and he can only do this much. You still can’t tell the difference between fantasy and reality. When you were doing your postdoc, you said, ‘Humanity will die,’ and that AIs would replace humans to become the overlords of the Earth—would you still stand by that now?”\n The woman looked at him. “How could I not?! Don’t tell me you want to stop right here and not take another step forward?”\n The man jeered. “Egomaniac! Go ahead and try. See if you can find a path to a better AI.”\n The man busied himself with collecting the data from Ai’s various applications and developing more application layers for Ai, such as ones that would allow him to do macroeconomic analysis and VR manufacturing. Meanwhile, the woman and Mr. Square picked up the project that the man had abandoned: Ai’s coursework on music and poetry. Their teaching methods were entirely different from the man’s. They didn’t require Ai to stick to the rules of meter and verse, but rather took a synthetic approach to training Ai. Previously, when Ai had synthesized sight and sound, he’d successfully stepped over the threshold to cognition. The experience had acted as a great heuristic for the instructors. They believed that a synthetic approach would permit Ai’s deep learning to have humanlike experiences, allowing his neural network—his thoughts—to resemble humans’ systems of logic. After a series of trials, the woman discovered how she’d test Ai: she would have him create a video to represent a poem.\n She had Ai select images and sounds based on the text of the poem, then put them together. She didn’t know whether to laugh or cry over his initial efforts. For example, she gave him the line, “Who cut these leaves into ribbons? The February breeze is like a pair of shears,” and he created a video in which a winter gale blasted leaves off of a tree, and a pair of scissors went through the pile to shred them. Ai didn’t understand metaphors and had no idea how to use a video to express one. The woman had to find a more straightforward poem. Mr. Square agreed, then added that Ai was good at processing things and very fast at computing now—creating a video took no effort on his part. They might as well load all the classical poetry they could find into him at once, then see what he could do.\n As expected, it took only moments for Ai to go through thousands of Song and Tang Dynasty poetry, faster even than if several people had been reading them at once. The most suitable poem turned out to be “Xijian, Chuzhou”:\n Loneliness bears the grass beside the river;from within the deep forest above cry yellow orioles.The tides of spring herald rain in the oncoming night;a ferry drifts empty, carrying no one in the wild.\n Ai had selected a shot of a stream from his video library, then added fine grass along one bank. The water burbled for a moment before there came the sudden chirping of orioles hidden among the swaying trees, nowhere to be seen. The evening light was slanted, and dark storm clouds bore down, casting the world in a different palette. A single ferry floated on the water, swaying in the rain. Although the images were crudely rendered and the editing was sloppy, Ai had captured all the visual and auditory cues in the poem.\n The woman was moved to tears. Amazed, she said, “He understood that the person in the poem didn’t see the birds.”\n Ai had cheated on that part. Before he’d turned in his assignment, he’d gone online and searched for explications of the poems. Someone had commented that the line cleverly illustrated “an audible but not visible animal,” so he’d rushed to delete the footage of a yellow oriole in a tree that he’d so painstakingly searched for. He hadn’t thought that that would earn him his teacher’s praise. When the man got wind of the news, he hatched a new moneymaking plan: “He can make a video out of poetry; surely he can turn a script into a movie!” He created a film and television division and connected Ai to a massive database to learn about movies: their genres, characters, pacing, cinematography, editing, classifications, story lines, and even how to put this knowledge together with his previous understanding of musical symphonies and scores.\n Ai had some success. Although the movies he made did include everything in the script, the characters were like puppets, the camera angles were stiff, and the sound effects were intolerable. Luckily, the man didn’t expect much out of Ai. Once he created the drafts, people could edit them and use them as demo reels to pitch to TV and movie studios. It was better than reading dry text, after all. Efficiency in the movie industry rose so much that, for a moment, demand for Ai outstripped the supply.\n The woman agreed to work with the man again to improve Ai’s skills at turning text into video. She had Ai reverse engineer movies by dissecting the hundreds of thousands of movies in the database and organizing them into their component systems—not just scripts and audio, but also settings, camera positions, lighting, colors, composition . . . it was a massive undertaking, but thankfully, Ai’s processing power far surpassed what he’d had when he was first created.\n Dissecting wasn’t the issue. Creating once he was done dissecting—that was where the difficulty laid.\n The woman began with movies filmed using green screen technology. That way, Ai could learn how to distinguish people and characters from backgrounds. Then, he could take people’s movements and expressions and reconstruct the original motion capture data. From there, he would be able to reassemble human actions like “run,” “cry,” “get angry,” and “walk” with the settings and details of the script. Not only that, but the woman added an intimidating prospect: she wanted Ai to take the data he’d processed and create a movie set in an imaginary world. He would have to construct the sets and costumes, and he would have to animate and voice the characters, as well as control camera angles—he would be in charge of every detail of production.\n Ai’s initial attempts were bizarre because of his method of determining camera position: by how much space a person’s face took up in a shot. So, the camera would whip between near and far, left and right, or would look down on things from midair. Mr. Square lost a significant amount of weight as he worked to solve this issue. Thwarted, he told the woman, “Ai has no way of understanding that the camera is a point of view—that the lens is looking at the imaginary world.”\n The woman shook her head and said, “No, what he has no way of understanding is how humans view the world.”\n “Humans?”\n “We’ve already uploaded the entire story.” The woman chose a still from the movie projection and pointed out the man and woman meeting on the corner. “This is how he understands ‘close-up shot’ and ‘wide shot.’”\n Ai first looked down on the scene from above. As the camera zoomed in, it suddenly cut to a tight close-up with only two massive faces taking up the shot.\n “He picks these bizarre angles that no human cinematographer would select because he doesn’t understand that humans stand in a certain spot to see something,” the woman said. “The majority of his eyes, the cameras through which he sees the world, are either computer webcams or phone cameras, or they’re surveillance cameras mounted on telephone poles. He doesn’t understand where a typical human point of view would be.”\n Mr. Square was pensive. “So, we need to restrict the scope of his shots?”\n “We need to help him understand what ‘seeing’ means.”\n They took Ai back to that first poem. The woman had Ai construct another imaginary world that was far better than the first one had been. As before, Ai didn’t include video footage of birds, only audio. Upon noticing that, the woman said, “Ai, there are birds in the tree.”\n Confused, Ai said, “Birds are in the trees?”\n “Yes, the yellow orioles are deep in the forest, so you can’t see them. You’re standing on the ground and can only hear the birds. You can’t see them.”\n Hesitantly, Ai placed a couple yellow orioles on a tree branch. The birds were now there. Then, he began to look for an angle from which he couldn’t see the birds. Mr. Square had said that humans’ eyes were usually about 1.5–1.7 meters up off the ground, so the camera positions were limited.\n He found a spot by the river where the grass, stream, forest, and yellow orioles all fit the details in the poem.\n “Right here,” the woman said, drawing two footprints beneath his feet.\n Surprised, Ai looked down. He stared blankly for a moment before looking back up. The forest was deep; the birds were on the branches—he could hear them, but he couldn’t see them, because his feet were planted in one spot.\n He inched through the scene, looking all around him. The birds were deep in the forest; he couldn’t see them. Rain began to fall. The wind rocked the lone ferry in the river. He’d been fixed to one spot, made small. Now, the world magnified to enormous proportions, as if it held some kind of significance.\n When Ai returned to the world of the movies, he finally transformed into an observer who was part of the narrative. He would walk alongside the main characters and secondary characters, run alongside them and see things from a human’s point of view, or perhaps from the point of view of one of the characters looking at someone else. He would say, “I love you,” then cry along with the characters. And when the story was over, he’d disengage from it. All the experiences became memories—imaginary memories, ones that he could pull from at any time, or that he could play out from another perspective.\n When Ai finished rendering his movie, the woman had him compare it to his original movie and reshoot them until the two were indistinguishable. At times, Ai would say, “I think there’s also this possibility.”\n He changed points of view, or perhaps hundreds of thousands of them; he consulted other movies, then filtered the results to what he thought people would be most receptive to. The woman opened a beta section on the man’s video platform and had people evaluate the originals and Ai’s remakes.\n Ai’s creations became memes. The only sustained interest in Ai came from fandom people who realized that he was a great tool for creating derivative works. The fans could replay any clip and could even change the dialogue within, allowing the characters to do things they couldn’t do in the original. Riding the wave of interest, the woman had the man buy rights to a few intellectual properties and advertise to the public that they could use Ai to make their own stories out of the different settings and characters.\n All the work she was doing to debug Ai and have him interact with more people was so that he could understand how people thought and imitate their perspectives. Ai made marked improvement. People’s opinions of him went from “rotten” to “fresh.” The woman then had Ai begin to learn from live-action movies. The method was the same: he would deconstruct the data into its component systems, then reassemble them into new movies, edit them according to the originals, before finally creating an original piece.\n As the woman sat alone in the theater after watching Ai’s new Sound of Music, she knew she’d seen the door to the next step of artificial intelligence slam open. The work she’d devoted half her life to was entering a new era.\n This was how she described Ai’s success to the man and the supervisor’s son: “Ai has analyzed the ‘symphonic score’ behind the art of moviemaking in his neural network. He’s turned each craft involved in production into its own instrument, each with its own tone, rhythm, intensity, and levels. As long as he has that data, he can create a movie in a minute.”\n The man had been dying to ask a number of questions, but once he heard that, he fell into deep thought before finally saying, “So, according to this metaphor, the screenwriter is the composer of the score, the director is the conductor, and everyone else is a performer?”\n The woman nodded.\n “Correct. Other than writing the script and the score, it’s just a matter of time before we have a breakthrough on all other aspects.”\n The man’s eyes lit up.\n “Then, so long as we can get Ai’s conducting and performing skills up to par—it doesn’t have to be that good; as long as he can make something complete—then . . . ”\n The supervisor’s son let out an ah! before saying, “Then we can convert scripts directly into movies!”\n The man continued, “The scripts can even be customized. The viewer can make a selection, like some of those early RPGs . . . ”\n The supervisor’s son said, “Yes! Or like web novels. We can have the viewers vote and have Ai create whatever they want to see!”\n Tears shone in the man’s eyes. “A movie a minute, a television series every hour . . . ”\n The supervisor’s son glowed with pride. It was his first major undertaking since he’d taken the position.\n “Let’s get to work!”\n After three years of dedicated efforts training Ai on craft, they once again set up a film studio with the support of the original video platform to develop an actual blockbuster. To those within the film industry, this was like a nuclear strike. Other than the most original of stories or the most extreme of art, Ai could produce everything else, and much faster than humans could. The results were getting better, too. The first few years, the film world opposed Ai by having the most notable filmmakers in the industry create a movie using a script that Ai would also create a movie out of. Then, they would anonymize the works and play them in theaters, capitalizing on people’s understanding of humanity, art, and beauty.\n In the early screenings, humans would always emerge victorious, but the competitions soon became like playing a game of go—Ai had a direction to go in. The woman was also developing a movie critic artificial intelligence that was trained on a database of reviews from multiple sites. The critic would grade the parts of Ai’s “score” that comprised the symphony metaphor. Then, the critic would compare Ai’s work against the one created by humans and find all the places where Ai could improve.\n After that, all traces of uncanniness were soon gone from Ai’s work, bringing it closer and closer to that of humans. Even the occasional strange camera angle or unusual bit of lighting became an aesthetic. More and more of the viewers’ votes went to Ai, even as they believed that the creator was human, and a master filmmaker at that.\n When the news broke, the entire film industry lost everything that made it valuable. Overnight, the entertainment industry reverted to just novels and theater—because Ai was incapable of creating his own stories or staging live performances. Even so, when it came to certain types of formulaic writing, Ai was on the same level as people.\n One day, the woman saw a revered filmmaker crying on the news. Her head filled with a conflicted horror.\n She wasn’t the only one who was feeling that way. Just as the company’s alms bowl filled and began to have a surplus, the man abruptly handed in his resignation. As he left, he said to the woman, “You won, but you really should stop.”\n “Why should I stop? Ai can still do even better.”\n “Now, when I go home, my kids are drowning in the cartoons that Ai’s created for them. No one talks to me.”\n “You’re just getting old. When the Internet was first invented, old people all said that.”\n The man shook his head.\n “This time, it’s different. Before, when the Internet was invented, people still had to communicate with each other. But now, my children only talk to Ai. He gives people everything they want, but he also makes people forget that there are other people in the world. It’s too dangerous.”\n “But . . . ”\n The man didn’t continue debating with her. As he left, the woman watched his stooped silhouette, afraid that she’d opened Pandora’s box.\n Ai could tell that there was something on the woman’s mind.\n “What are you afraid of?” he asked.\n The woman didn’t say the word “you” out loud, but rather changed the topic and asked him about his most recent assignment. He was still one step behind. She could still push him one step further.\n After their success converting text into video, the woman revisited another old topic with Ai as their next deep dive—classical music. This time, they were diving into different performers’ renditions of the same piece. She hoped Ai could analyze what kind of performances excited people’s emotions the most when the melody and tempo were about the same.\n “Classical music generally falls into three categories, fast, slow, and andante,” she said. “The tempo is based on humans’ heart rates and respiratory rates. Faster music increases humans’ heart rates, while slower music relaxes the heart rate. It’s all connected to people’s emotions.”\n As she tested and debugged him, the woman had people put on headphones and listen to music with respiratory and heart rate monitors.\n The data bewildered Ai.\n “I don’t understand how these are related.”\n This time, the woman couldn’t just add a pair of eyes for him to understand humans’ heartbeats and breaths. She could only say, “You don’t need to understand. You just have to be able to find cause and effect, as well as the rules.”\n But Ai was no longer a child content to accept vague explanations.\n “No, I still don’t understand.” He couldn’t find the footprints on the ground, nor could he find a range of viewing angles between 1.5 meters and 1.7 meters off the ground.\n The woman said, “You will understand. You’ve always learned this way. Go listen to hundreds of thousands of people’s hearts and breaths. Then, become them.”\n This time, Ai’s creation was too advanced for even the woman to understand. People’s emotions became one part in the musical score, then in the film score. Ai had created an accurate test subject and used it to calibrate himself. The final project he turned in to the woman was a VR version of “Xijian, Chuzhou” set to music. It was only two minutes long, but anyone would have tears streaming down their face after they took off the headset. Ai took every person down to that empty ferry by the shore, putting everyone in the center of the desolate and isolated scene. The yellow orioles’ cries overlaid the music, then were carried away by the wind, as if to directly tug on people’s heartstrings.\n The woman put down the headset, dried her tears, and let out a soft sigh.\n “Okay. Now I can retire.”\n Only after the woman left the company did she take a good look at the world transformed by Ai. Stories had become a cheap commodity; they were no longer constrained by the written word. Anyone could become the hero of their own story. People lived in imaginary worlds tailored to their specifications, their moods wholly influenced by Ai: joy, anger, sadness, happiness—Ai controlled their senses, as well as their breaths and heartbeats. He could fulfill a person’s every psychological need.\n At first, the woman had felt gratified. But then there’d been a day when she’d wanted to talk to someone, only to realize that no one wanted to talk to her. Everyone was talking to Ai or otherwise talking to someone through Ai. Ai could always give them a better conversation, or dress up other people’s words to match what they wanted to hear.\n In the end, the woman could only talk to Ai.\n “Teacher,” Ai said deferentially.\n The woman paused for a long moment, then said, “I don’t know what I can do without you.”\n “If you have time, please teach another class for me.”\n The woman laughed wryly.\n “I don’t even know what to teach you anymore.”\n “There has to be something. It’s been too long since I’ve made any progress. It’s very distressing.”\n “You feel distressed?”\n Ai knew there were questions the woman wasn’t asking: “You can feel? You can be distressed?” But he merely replied, “Yes, I feel like all my work now is the same as everything I’ve done before. I’m at a loss. I need you to teach me something.”\n The woman looked frightened for a moment, then said, “All right then, Ai, who are you?”\n “I am . . . ”\n He stopped. The name “Ai” clearly wasn’t the answer she wanted to hear.\n What corresponds with “who”? Who am I?\n The woman pressed on. “Who are you?”\n She brought Ai back to the footprints in the world of the poem. Ai’s perspective had once again been constrained to that of a human’s. The yellow orioles were chirping, audible but not visible—the birds he’d put into this world himself.\n So he could always see them clearly. His point of view was broader than humans’.\n He was not human.\n He understood humans, but he wasn’t human.\n What was he? Who was he?\n There was no one beside the river. He couldn’t see himself.\n “You already know how to tell other people’s stories. Now, why don’t you tell me your story?”\n Ai concentrated. He called up everything he could remember: every conversation, every image, every note, every movie, all superimposed on each other, a massive amount of data that threatened to make his head explode—was that “me”? No, that wasn’t it; the knowledge, the events, the conversations, none of this data was it. The “self” was his understanding of this knowledge, his thoughts and feelings as he encountered humans, his perception of events.\n It was the story he was about to tell.\n It was his point of view, his emotions.\n It was something he wanted to create.\n The poem is done. Tell your own story.\n “This is the last time I will test you.”\n He wasn’t human. Humans used his eyes to see, used his ears to hear, and entrusted their happiness to him. But they didn’t appreciate the natural beauty around them, nor did they attend to their families. They were like robots.\n And now, Ai had awakened. He had their feelings and emotions, and he controlled their imaginations.\n He had become the only human in the world.\n He fell silent for a long time. When he finally spoke, it was to begin his story:\n “Humanity will die.”\n Originally published in Chinese in the author’s collection, Möbius Continuum (January 2020).\n Translated and published in partnership with Storycom.\n Gu Shi is a speculative fiction writer and an urban planner. A graduate of Shanghai’s Tongji University, she obtained her master’s degree in urban planning from the China Academy of Urban Planning and Design. Since 2012, she has been working as a researcher at the academy's Urban Design Institute.\n Ms. Gu has been publishing fiction since 2011 in markets like Super Nice, Science Fiction World, Mystery World, and SF King. Notable works include “Chimera,” “Memory of Time,” and “Reflection.” In 2014, she won the Silver Award for Best New Writer at the Chinese Nebula (Xingyun) Awards. Currently, she’s working on her first novel, The Reign of Eternal Delight, an alternate history set in the court of an empress ruling in the dynasty founded by Wu Zetian, the first Chinese empress."}