{"fingerprint": "NbtKeZlXsQes6664rJgZ24t3NfU=", "sitename": "Clarkesworld Magazine", "title": "Transcendent Transformation: A Conversation with James Gunn by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/gunn_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Transcendent Transformation: A Conversation with James Gunn by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nTranscendent Transformation: A Conversation with James Gunn\nScience fiction has always been a way to shrug off the shackles of our terrestrial imaginations and expand our minds out beyond the stars. Out there in the swirling heavens, the possibilities for life and the answers to its mysteries are endless. James Gunn’s newest novel explores the outer reaches of the galaxy while asking some questions that hit a bit closer to home.\nTransgalactic is the sequel to Gunn’s 2013 novel Transcendental and the second in a trilogy that will culminate with Transformation. In Transcendental, we’re introduced to Riley, a roguish veteran with a mysterious AI implanted in his head, as he joins a group of alien pilgrims on their way to the Transcendental Machine. No creature is what they seem and everyone is hiding their true intentions, maybe even Asha, another human that joins him on his journey. Transgalactic picks up exactly where the previous book leaves off. This time though, Riley and Asha are surprised to find themselves light years away from each other with no way reconnect. After the mysteries and intrigue of the first novel, Transgalactic delivers a more intimate portrait of Asha and Riley as they traverse the vast nothingness between them and uncover more about the Transcendental Machine.\nJames Gunn is the author of numerous novels and non-fiction. He has won a Locus, Hugo, Damon Knight Memorial Grand Master Award, and has been inducted into the Science Fiction and Fantasy Hall of Fame. His newest novel Transgalactic was released from Tor Books this past March.\nThe universe in Transcendental and Transgalactic is one filled with history and ruins. What is it about a lived-in universe that appeals to you?\nWhat I try to do in all my stories and novels is deal with situations as we would experience them if we were there (beginning as early as my first story, “Paradox” and my first novel This Fortress World). The Transcendental universe ought to be as real to its readers as the world they live in, and that means it has history and ruins and people’s lives and their individual histories.\nIn these books, you’ve created a diverse array of alien cultures complete with histories, customs, and philosophies. While completely foreign, they somehow remain relatable to human readers. How do you develop a culture like this? Is there a kernel of human culture in each of these?\nAs an author, I begin with my own experiences and the various human cultures we all are heir to (what else do we have?) and build from there. With the imagination that humans are gifted with, they can then alter elements (appearance, circumstance, cultural history, evolutionary history, genetics, personal experiences) one by one and examine what changes these might bring to the species involved. In addition, there are certain influences that are common to all sapient species—all of those listed above—plus the universe of evidence and laws we share, particularly the laws of evolution. And since the Transcendental trilogy’s central theme is evolution, this common experience makes us all siblings.\nHow do you determine alien biology? Do you create the planet first or its people?\nSometimes the people, sometimes the planet, but mostly the planet, since the central belief system of the trilogy (and, it is my conviction, science fiction is essentially Darwinian in evaluating the human species as a product of its environmental history). But if it’s the alien first, then the challenge is to imagine the environment that would have produced a species such as this.\nWhat are some difficult aspects of writing from the perspective of an alien species?\nThe most difficult part is shedding human assumptions, beginning with that Darwinian perspective I mentioned above—that is, realizing that nothing about human existence or history or qualities is inevitable or unquestionable. They all are a product of our evolutionary development, and they could have happened otherwise. It is in the “otherwise” that the science-fiction imagination operates.\nTranscendental occasionally feels like a locked-room mystery novel where each character has a secret agenda. Was there one mystery writer that most influenced you in this aspect?\nThe Transcendental trilogy is a mélange of influences to which I have paid tribute in various large and small ways, as my way of crediting my predecessors and building on their accomplishments. I never thought of mystery novelists, although I was a great fan of detective novels in my younger days (of all kinds, including the British whodoneits and the American hard-boiled mysteries, but mostly the latter, beginning with Dashiell Hammett and Raymond Chandler) but they must have contributed.\nIn Transgalactic, you expand the already far-reaching universe and refocus the style of the novel by incorporating multiple viewpoints. Why make this choice to broaden your cast of perspective characters?\nEach novel has its own dynamics. In Transcendental, because it was a mystery unfolding as well as a quest, it made sense to tell it from the viewpoint of my flawed hero Riley and discover the facts as he uncovers them (with multiple viewpoints the tension lessens). In Transgalactic, Asha and Riley have to find each other, and their mutual search requires alternating viewpoints and styles appropriate to each and to the aliens they encounter. In Transformation readers will encounter still other changes in viewpoint and styles as the challenge changes.\nThe end of Transgalactic left me on edge, waiting for the next book. Can you give us a little teaser of what we can expect in final installment of the trilogy?\nI didn’t know how the trilogy would end when I began work a decade ago, or rather the concept changed as the earlier books unfolded. But it all makes sense of everything that has gone before. I can reveal that while the structure of Transcendental was based on the Canterbury Tales and the structure of Transgalactic on the Odyssey, Transformation uses the Argonauts as its structural model. And one more thing: readers want answers, but they should remember that science fiction is best with questions.\nYou mentioned that you began working on this trilogy a decade ago. Do you feel these books needed a bit of time to mature or evolve?\nThe first one, Transcendental, took longer because I had to develop the story universe and the narrative structure, and I was trying to market the concept on the basis of the first and last chapters and a proposal. And I was taking more time with each chapter as I felt my way along. The last two built on that and took about six months each, helped along by the fact that I had contracts before I started them and knew where I was going and what would happen when I got there.\nYou mentioned that science fiction is best with questions. What are a couple of your favorite questions that science fiction has asked? Who asked them?\nI like the questions that ask us to consider who we are and what makes us who we are and how we can know either one. Sometimes that results in solipsism like Robert Heinlein’s “They” or most of Philip K. Dick. The ending of my novel The Joy Makers has a question at the end like that. But some of it questions the nature and quality of our humanity, like the works of Theodore Sturgeon. And some of it asks if the answer to all our problems isn’t thinking clearly and behaving rationally like the works of Isaac Asimov.\nTed Sturgeon once said that we could categorize writers by the statement that the world would be better “if only . . . . ” With Heinlein that might be “if only the incompetent people would get out of the way and let the competent among us save the world.” With Ted it might be “if only we really loved each other.” With Isaac, “if only we could think clearly and behave rationally.” I hope that the Transcendental trilogy is a contribution to Isaac’s “if only.”\nWhat does your writing process look like? Do you keep notebooks filled with characters or bits of scenes? Do you have any rituals, such as using a favorite pen?\nI try to avoid rituals and advised my writing students that they shouldn’t require special circumstances to do their writing. I used to write with my office door open to discipline myself in that way. Nevertheless, people develop certain ways of doing things that enhance production. I do a lot of research and print off documents, mostly from the internet, that provide information that I think I will need to refer to. I don’t do character sketches, because I think I know my characters well enough without that, but I give them back stories, as is evident in Transcendental.\nWith these novels I tried to enhance my productivity and avoid moments when I didn’t know what was going to happen next by writing a page of description about what would happen in each chapter before I started each one, a paragraph for each scene, so that I didn’t have to stop to invent anything during the writing itself, and I set a goal of writing a thousand words a day, a chapter a week.\nDo you have a particular dislike of arachnids, or do you think that they simply make for great looking alien baddies?\nI’m not quite sure why I settled on arachnids (or arachnoids, for they only resemble overgrown spiders), but I wanted creatures that were voracious, hard to stop, unemotional, and unromantic (not like animal predators).\nDo you have a favorite alien that you’ve created in this trilogy? One that you would most like to share a coffee with?\nI like Tordor, the pachyderm-like alien from Dor, and resurrected him for the final volume, Transformation. Though he might have difficulty drinking a cup of coffee, at least in the normal fashion.\nHaving chronicled the history and evolution of sci-fi in your series The Road To Science Fiction, where do you think the genre is heading?\nI recently added a 14th chapter to my illustrated history of science fiction, Alternate Worlds, in the hope of getting some ambitious publisher to bring out a new, updated edition, and in that chapter I built on the conclusion I reached in the 1975 first edition; that science fiction and the mainstream would grow closer together until in the middle they became indistinguishable, and that is the way it has turned out.\nThe limitations on publication and readership that SF grew up with have been outgrown, but at the same time some of the revolutionary qualities that distinguished it have faded and a great deal of what is published today is better written but less inspiring, and perhaps less hopeful (Paul Di Filippo in his review of Transgalactic in Locus Online comments that it runs counter to the dystopian vision that is currently in vogue). But I also wrote in 1975 that a genre that is recognizably science fiction would remain distinguishable from the rest, and that has happened, too.\nWhat was marvelous and remarkable about SF over its early history is that it was revolutionized about every twelve years as an editor and a magazine(s) came along that transformed the genre, from Hugo Gernsback to John Campbell to Boucher and McComas and Horace Gold to Michael Moorcock. But the magazines have lost their influence and books don’t create revolutions as easily, though Neuromancer and cyberpunk tried. What I continue to look for (and maybe secretly hope for) is a new revolution. That’s what SF is best at.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}