{"fingerprint": "XB/cWylEafOotRtxjEW2LvXqOh0=", "sitename": "Clarkesworld Magazine", "title": "Amorville by Bella Han", "author": "Bella Han", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/han_09_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Amorville by Bella Han", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9150 words, novelette\nAmorville\nShe had known that she would end up like this, but she gave in. Lights. Music. She closed her eyes. In a sea of beautiful visages, she reached out to the one and only beloved face.\n“Thoreau—I know it’s a meaningless name to you all. Yet this Thoreau was the founder of our economy today. Imagine a world two hundred years ago, when the sky was blue and the grass green, and people just idled about. This Yankee, Thoreau, lived by a lake for two years, doing nothing, and suddenly came up with an idea—we don’t have to have anything!”\nShe put down the pen. Yes, a pen, a real pen, inputting words by handwriting. It was slow and tiresome to write, yet she believed that it was inspiring. Words floated in the air above the piano-shaped desk. On the left there was product information. Behind, the openings of famous speeches. On the right, the video of her CEO making a speech, his audience marked by different colors indicating their emotions. And aside, two digital tips displaying Thoreau’s biography and excerpts from his works. This was all generated by Bill. Her company had bought this “digital bard,” and it was diligent, but she hated it. Now it told her the literary allusion she chose would be too unfamiliar to the audience. Yes, she agreed, because the audience was white-collar workers suffering from overtime, and middle-class couples exhausted by their kids—how could they know who Thoreau was? Still, she hated Bill. This digital writer would sooner or later take her job away. She took a pull from her mug. The coffee tasted like cinder.\n“Hey Eva, here’s your catalog. Don’t forget to mention the new products.”\nAn avatar leaped out. “Eva,” it had called her, making her a little uncomfortable. Everyone had an English name at this company, though most of its employees were Chinese. She shook her head and looked at the avatar. It was Anna’s avatar, translucent, about the size of the mug, with a big head and small body. It looked like Anna, but a little prettier. Its words were hard to understand, as if the speaker was chewing something. Eva looked through the glass panels of the working booth, and saw a piece of bread on the neighboring desk. Bold.\nShe opened her hands. The circuitry on her fingertips glimmered, and a flood of images rushed in. A flow of digital pets, all alive and kicking: a chicken-sized kitten, licking its paw with a pink tongue; a snow-white doggy, rolling over and wagging its tail. For each species, there were dozens of color schemes, several personalities, and customizable sizes. Each pet had its proportions adjusted, to have larger eyes and a smaller body, to be cuter. The best-selling ones were of course mini cats and mini dogs, and then rabbits and squirrels, and then . . .\n“What kind of freak would buy a life-sized sheep?”\nShe stared at a fat sheep under a blue sky. It grazed, and baaed stupidly. Sheep, life-sized, three available colors, with a free two by two by two meters cubed pastoral background.\nAnna rolled her eyes. “Rich folks. Rich enough to buy a house in which to keep a life-sized sheep and a pastoral background. Marketing says it will be the hit of the year.”\nEva rolled her eyes, but only in her mind. “Why don’t they just buy a real cat?” No, they wouldn’t. Just like what she had emphasized in the speeches she wrote—it was better not to have anything. The cat they would keep would be forever clean, healthy, friendly, and funny. Instead of giving, they’d only need to take. Just like . . .\nHer heart ached. She took up the pen and continued to write.\nAn awkward age, an average face, a mediocre salary, and a meaningless job. She walked in the crowd during rush hour, meditating on her small life without slowing down a bit. Outside, gray sky flashed between the glass panels of the transportation tubes. She stepped onto the auto walk and glanced at the crowd. They looked bleak, the cold light of the ads above providing the only colors in view. She had not seen the sun for a long while; this winter had been particularly cold. Was the heating broken? She wrapped herself up in the coat, thinking about home. Home, sweet home, a small fire in winter. Just thinking about it made her feel warmer. She recalled walking in the streets of Rome, with new sandals and a fresh haircut, her back warmed up by the sun, her hand holding an ice cream cone, her pockets empty, but her heart free. She recalled walking in Vienna on a summer night, along a sparkling river, listening to a poem, leaning on his shoulder, into his arms—\nShe felt something cold and hard. People rushed out, pressing her against a screen door, almost crushing her stomach. She quickly regained her composure, joined the crowd, and raced to the High Speed Rail. Her glasses planned a route for her, drew a huge holographic arrow at every turn. This was unnecessary; she could find her way eyes closed. She picked the shortest line and queued up behind a clean, small, agile girl. The HSR came, its headlights cutting across the air, its carriages running through years of air pollution. Doors opened, and people swarmed in from every direction. She squeezed into a corner before the crowd could crush her, and couldn’t move from then on. Three men in nanocoats pushed their way in next to her. She hated nanocoats; they were waterproof, stainproof, cold-proof and cheap, with only one disadvantage: ugliness. Colors flickered on these men’s glasses, their fingers jerked in the air. Ads floated on the windows and the ceiling and flew down to her when meeting her eyes. She waved her hand to drive them away. She didn’t need anything, except . . .\nShe grabbed the ad. Music began to play, a familiar logo emerged, and a handwritten SPRING FESTIVAL SALE spread out.\nShe threw away the ad and opened her inbox. Yes, there was neglected mail. Phantasus’ ad looked classic in the shape of a sealed envelope. The seal broke after verifying her fingerprint, and a brave new world rose before her eyes.\nThere were several remakes of old Hollywood classics and a new release. She had watched, or at least heard of, many of them, and she knew he would fit them perfectly. She smiled and swiped down. Charming actors and actresses, brooding, smoking, laughing, and blinking, were on sale this winter. But she could only look at those pretty actresses because she didn’t have any spare money. She flipped through each sexy actor looking for one face, but ended up sighing. Danny, always so haughty, always so expensive. She’d have to eat man-made meat next month.\nHe had shown up without warning. She had discovered him in a list in a similar email last month. She stared at him for three seconds, moved on, but came back. She saw a thumb-sized man reading. Feeling her gaze, he looked up, and narrowed his eyes. Of course, indifference could be a strategy, nothing special. Still, she clicked on him and opened his page. Her glasses switched to Closed Vision, the page extended to full-screen, and she saw a life-sized man sitting under a tree. Seen in the virtual reality generated by her glasses, this scene was much lower in definition than it would be at home. Yet, when the man narrowed his eyes again, she felt a pain in her heart. “Danny M. Amor?” A strange name, she couldn’t tell whether it belonged to a real person or a digital star. No score. No discount. Excellent compatibility with her favorite movies. She verified her fingerprint on the arm of her glasses and applied for a free trial.\nThen everything got out of hand.\nA scarlet “DISEMBARK TRAIN” broke into her vision. The train took a deep breath, and spat out the passengers.\nHer capsule apartment was no different from other capsule apartments. Ads hovering overhead, she got off the auto walk, went through a gray exit, entered a cement hall, and got on an elevator. The crowd separated; she stopped at her room, and the door rattled open. This was the moment she had waited for all day long.\nThere was nothing unnecessary in this room; there was no room for it. A palm-sized window hung on the wall. She opened the delivery box in the wall. Several packages fell down: the towels and bodywash she had ordered in the morning. Dinner was in the food box. She opened the boxed dinner, it heated itself. Wednesday: curry chicken and rice, with a slice of canned orange. She savored the orange; she wouldn’t have such luxury next month. She took off her glasses, took a quick shower, and walked to the corner of the room. For her, this place was where the day began and ended.\nIt waited for her at the place where a bed should be. The egg-shaped machine provided her all her happiness. It shouldn’t be here: its tranquil curves, ceramic surface, and soft glow made everything else in the room feel cheap. Its brand, Phantasus, and its logo, an abstract butterfly, gleamed on the top. Below was written the model of the machine: Psyche Alpha Divine, a premium model of Psyche Alpha, with better configuration, and an ergonomic, aromatherapeutic cabin, and it was of course much more expensive. It was worth it though, since she spent so much time inside the machine every night, and so little in her sleeping bag.\nShe touched the cabin. It opened silently, its interior a relaxing light gray. The ergonomic seat supported her body perfectly, the aromatherapy began, and music started to play. She felt safe and curious, as if on a rolling boat. The brain sensors embedded in the cabin wall lit up. She closed her eyes.\nShe floated in the dark. It felt like the dark before a movie began, she thought; she had read about those old-fashioned cinemas. Lights glimmered, a butterfly landed on her hand, shimmering impossible colors. She watched it for a moment, and a logo emerged from the colors. She waved her hand, and the butterfly flew away. A group of smiling men and women reached out; she walked past them, looking straight ahead.\nShe could draw his face eyes closed. He might be a mixed blood, with an elegant profile and a slightly tougher jaw. When he laughed, he looked like a happy beast, golden skin shining in the sun. When he was quiet, he was a statue under the moon. He always frowned a little, looked a little melancholy, showing that he was not just a pretty face. He was refreshing and charming and heartbreaking. He was innocent and sophisticated and cruel. Meeting his eyes, you could do nothing but fall prey. She could do nothing but fall into those black holes, where something horrible crouched. Fall, and meet him at the bottom of the abyss.\nHe held her hand and smiled—almost a sneer. Full-length mirrors emerged before them, each showing a different him and a different her in a different setting. Holding his hand, she walked to the mirror they used last time, and sank into it.\nShe surged upward. Water streamed down her hair and eyelashes, her clothes stuck to her body, and gooseflesh prickled her skin in the night air. At least the summer night wasn’t cold. She raised her hand, watching the water flow down her arm. Everything was so real that one might get confused at first glance. But when you looked at the oil painting-like lights along the riverbank, you could tell the truth. Old movies usually had poor definition when they became neuromersive. But instead of a high definition repair, Phantasus took advantage of this lack of definition to create a dreamlike effect. She and Danny thrashed their way to the bank. He held her from behind, her heart skipping a beat, her head turning blank. His suit covered her body, his warmth transferred to her through the damp clothes. She raised her eyes and saw the golden lights across the river. She raised her eyes to meet his. She saw herself and the lights and the Roman night in these beautiful eyes. Inevitably, they got closer.\nOverslept. She jumped out of the sleeping bag to get washed. The elevator was crammed, and so were the auto walk and the HSR. She couldn’t squeeze into a corner, but could still move her fingers, so she should be satisfied, she thought. Sentences looped before her eyes and in her ears: NO PUSHING. NO FIGHTING. HERE STARTS CIVILIZATION. Face pressed to someone’s nanocoat, she imagined life in another carriage. Twenty more yuan, and she could get first class. There would not necessarily be a seat for her, but there would at least be more space. But forty more yuan a day would add up to the price of a movie, or that of a month’s real meat. The HSR ran around the gray skyscrapers. She saw a Super HSR fly by. It looked like a green train from the old times, and rumors said it provided a seat and a drink for each passenger, but she couldn’t know whether they were true or not.\nShe dodged and squeezed and ran into the office at the last minute. Some colleagues shot a glance at her. No sooner had she sat down on an empty stomach than Lulu’s avatar jumped out.\n“Lulu Ouyang and Jiaming Chen would love for you to join them in celebration of their marriage.” Dressed in a white dress and a garland, the avatar handed out an invitation.\nShe took it, blocked the view of others with her back, and whispered, “You never told me that you were going to marry him!”\nThe smile faded from the avatar’s pretty face; exhaustion took place.\n“I have to marry someone.”\nLulu had been struggling with her boyfriend for years. He left her, and then begged her to come back, and blah blah blah. Eva had never understood them, so she asked Lulu, “Do you love him?” She only got a look. So she never asked again. Thinking about it now, that guy was a good for nothing, yet was still the optimal solution for the marriage Lulu sought after.\nEva let out a sigh. She went back to her pile of digital documents. Today she had to write an introduction to each updated pet. Dozens of pets, hundreds of temperaments. Running smoothly, Bill opened engineering documents, listed customer reviews, and selected a reservoir of adjectives for her. How damn intelligent this program was!\nBored, she spun her pen with her fingers, and stared at the mini sheep in front of her. It strolled around her mug and stared back. What temperament could a sheep have?\nIt was much easier to describe a cat. Yuanyuan, Nana, Tiger, and Cookie each had distinctive features, as long as you didn’t play with them for too long. Too long, and they began to repeat themselves. But after all, they were only cats. Nobody would pay too much attention to a cat; besides, they were only cheapos. But you would always pay attention to a person. Those digital idols, no matter how charming they were, could not hide the fact that they were simulations. Without a person to imitate, a blink, or a slight movement, not to mention the way they talked, could betray them. She tried digital stars once in the Psyche Alpha. They were perfect angels, but often made her uncomfortable, making her feel that she was kissing a mirror. After that she had never used them again. Her collection consisted only of real person stars, one of them being her beloved. Of course, they were not really “real people,” but only their neuromersive avatars, capable of reproducing their performance in certain movies and recording their voices and movements in order to be compatible with other movies. She could also connect to other players, but she wasn’t interested in that. Nothing could be worse than playing with a strange-looking, strange-behaving stranger. She would rather spend every minute with Danny.\nNeuromersive devices were not popular yet. Most owners used them to play games. Those who were willing to perform in neuromersive movies were either superstars who needed a campaign, or new faces unknown to the public. Danny was among the latter, yet once he was in the spotlight, he would no longer be hers.\nShe was a little jealous of his future fans, as if she had already lost him to them. It was in that moment she realized how much she relied on him, or his avatar rather. He was no longer her escape from reality; he was her reality. Another realization struck her like a thunderbolt: there might be another kind of happiness for Lulu.\nShe sank into her chair and took off her glasses. Made of aerospace alloys, this pair was featherlight, yet in her hand it seemed to weigh a ton. Pinching the bridge of her nose, she calculated her balance after giving a cash gift to Lulu, then suddenly leaped to her feet. She put on the glasses and looked at the food box. A menu appeared in her vision; she skipped the premium, the standard, and the economic, and stopped at the eco-friendly food plan. Eco-friendly indeed: not to mention fruit, there wasn’t even any meat. She tapped on the arm of the glasses and changed next month’s plan. She’d have to make a budget cut for movies next month too. There would come a day when she wouldn’t even be able to afford the rent on the stars. What to do then? It was hard enough for her to deal with the day job. She wouldn’t have time to sleep if she worked part-time too. What about looking for another job and selling herself to a mega corp while she still could? A chill went down her spine when she thought of Bill the Digital Bard.\nShe never thought of the future. She was uncertain whether there was a future. There was only another day and another night, only a total blank before her. How long could she work here? How long could she struggle? Could she meet someone and fall in love? It was hard to imagine any changes in her life, but changes were inevitable. She smelled dampness in the air, raised her head, and saw night falling. Light pollution blended with dampness, making the city look like a sham.\nMom called.\nMom didn’t use avatars. She only made phone calls, and sent fake news and stupid videos to her daughter. “Sweetie,” she ask timidly, “will you come back for the Spring Festival?”\n“I will.”\nMom smiled, and prattled about how Eva should take care of herself. Eva just nodded. She felt as if she were under a spotlight, exposing how self-abandoned she was. But she could not give Mom a clue.\n“Have you found a boyfriend?” Mom asked.\n“It feels good to be single, really.”\n“Really? Do you think so? You could always come back, you know. A life all by yourself . . . ”\nEva forced a confident smile. It felt good, she told herself. It was the only way she could enjoy her life . . .\nShe went into the dream machine. Seagulls cast down their shadows. A boy came to her with the smell of salt. She ran through gardens and courtyards, and saw herself in the mirror. Ten years old, blonde hair and emerald eyes, sap green dress and olive bows: it totally differed from her real looks, yet it was still her. Proud as she was, she was inevitably attracted to the boy. Ten years old, eyebrows speaking of curiosity, eyes murmuring innocence: he was still him. He painted her. She watched him and kissed him by the fountain, tasting salt on his tongue. She wouldn’t let him go. Innocent as he was, he had everything she lacked. She wouldn’t let him go, grabbed his hands, and danced with him, her taffeta dress rustling. Forward, backward, swing, turn around: it was a dance for ten years. They became a man and woman, fully grown. He turned her around into his arms.\nHe locked her in his arms, saying the words he shouldn’t say.\n“I know you. I knew you at first glance. Everyone says you’re pretty, but I know that your heart is cracking. Rather than a young and beautiful heart, I prefer yours. Ravaged.”\nShe pushed him away, ran out of the illusion, and escaped from the cabin. She could not breathe. Slapped by the cold air, she found tears on her face.\nDanny Murong Amor. What the heck.\nShe had watched thousands of neuromersive movies, used hundreds of neuromersive stars, yet had not seen improvisation once. The player could improvise, yes, but improvisation was limited to a few scenes and dialogues. After all, movies were not like games, and the player should not stand in the way of the plot. Maybe that movie had a new edition? Impossible. Antiquated as it was, this movie was lucky enough to become neuromersive. How could it dream of a new edition? She tried another actor in the movie. He said exactly the same words as what was written in the script. Maybe there was a system update? She went through Phantasus’ official website and its BBS, and no words were said about it. It could only be Danny’s problem. Maybe he had a bug. Did neuromersive stars have bugs? Even if so, she didn’t dare try again with him, fearing his words would break her heart.\nShe wrote to Phantasus and got no reply.\nDanny M. Amor. He was a mystery himself. Outstanding as he was, he had no introduction, no comments, and no scores. Blocking others’ view with her body, she searched stealthily in the office. There was no relevant information except an almost empty official website. It consisted only of his photo and filmography, and had not a word about his personal life. He must have used a pseudonym, she bet; maybe there would be some problems if he revealed his identity. Maybe even his face was fake. She joined the army that marched to lunch and chitchatted in the elevator while sending messages to her cyber friends. “Have you tried this actor?” She sent Danny’s picture to $outhPoleFlamingo, the founder of their neuromersive movie fan club. It was small, yet its members were hardcore.\n“No,” $outhPoleFlamingo curled her lips. “Never seen him. Cute. Where did you find him, you hacked their database?”\n“I found him in my machine.” She felt a little wronged.\nClouds cast down their shadows from the gaps between skyscrapers. She was seized by a fit of panic—what if Danny wasn’t supposed to have appeared on her machine in the first place? What if he himself was a bug, a secret she should not have discovered, and like the rumors had said, was the property of some princess, some millionaire, and had smiled on her accidentally. She was frightened. If they found out this mistake and took him away, her heart would be pierced through, would fly about like a balloon . . .\n“Eva!”\nShe raised her head and looked at her lunch buddy. Amused and vexed, Seb spoke with bread crumbs on his face. “I called you a thousand times . . . You’re always like that, dream walking. Sometimes I think you’re not you, but some—some—” The digital interpreter finished for him, “holographic projection.”\nShe had fallen too much into it.\n“It’s just a meet-up, won’t cost you anything. And it’s fine dining,” said Lulu.\nShe stared at the cinemagraph. A man waved vigorously from a snowy mountain. He had a good build. He wore a pair of sunglasses, so it was hard to imagine his looks. Maybe he had seen her at Lulu’s wedding, and had asked Lulu to introduce them afterwards. The guy was her husband’s friend, was Lulu guaranteed, and was handsome and funny, a good match indeed. “How long have you been single? They say you are a nerd now. No, you can’t go on like this.”\nNo, she couldn’t go on like this. Maybe she had forgotten how to talk to strangers already. She had knocked open a cloud castle, and if she took one more step, she wouldn’t be able to come back to reality. She let out a sigh and opened the home page of this Qiao Xin. Travels, parties, and game achievements. At least he and she had one similarity: an addiction to virtual reality. She searched the meeting place: a fancy restaurant, where a dinner could cost her a month’s food budget. Holy cow.\nShe went home ten minutes earlier than usual, took a shower, dressed up in her only little black dress, and chose the top-rated makeup for blind dates. The makeup printer stuck for a second, and sprayed too much red on her eyelids. She cursed the printer, and smeared the eye shadow with her finger. She took her most expensive purse and went to the taxi tube for the first time in a long while. A self-driving taxi was waiting for her. She squeezed in, and it joined the traffic automatically.\nNight had fallen. City lights went through the floating ads, surrounding her like deep-sea fish. Cars overwhelmed the highway like sea monsters. She hadn’t seen the city at night for a long while; now it felt strange to her. It was alive, an efficient, blind, cruel C/Fe creature. She closed her eyes and lay back.\nThe taxi stopped at the belt of a glass skyscraper. She held her head high and walked through a dark passage. A waiter took her coat at the end of the passage and led her to a door made of light. The restaurant, just like the building, was of post-contemporary style. Trees grew out of black and white checkered tiles; lights gleamed on the ceiling and shimmered in the air. This midsummer night’s dream was shaken by many light curtains, each with a different, iridescent color, cutting the hall into irregular spaces. She lowered her head, went past a curtain, and saw a man by the table.\n“Mr. Qiao?”\n“Call me Jo. Enchanté, Miss Liang.”\nWithout sunglasses, this Jo was just a big boy. It was hard to see him as a man in his thirties. He was wearing a T-shirt with a cartoon dinosaur, which looked familiar and expensive. She took her seat and touched the tree bark. It felt rough, just like how it felt in the movies.\n“Is this a real tree?”\n“Nope. A nanotree.” He grinned, “But I promise, what you’ll eat tonight is all real food.”\nHe looked much cuter when smiling.\nThe hors d’oeuvre came. Freshly-picked pea sprouts, dipped in sauce and decorated with purple flowers, lay on a ceramic dish. Jo tapped his finger on the table. “I like it here. Their dishes are crude—you can’t find this in other restaurants.”\nThat’s because you haven’t tried anything actually crude, she thought. She had a bite. The sprouts were incredibly crisp, and the flowers a little spicy.\n“I heard you and Mrs. Ouyang were classmates?” Jo asked.\n“Yeah, at Peking University. We were roommates.”\n“Ah! The old buildings there are impressive. Few colleges still have classes in low-rises, although lots do abroad.”\nThe topic naturally shifted to his life abroad when the entrée came. Eggs baked in butter and served in a cocotte. “Oeufs en Cocotte with Black Truffle,” she read in her vision. So this was truffle. It smelled so good that she almost forgot to listen to Jo’s lecture. Thanks to the ChatMaster, she could handle most conversations about travel. She talked about the places she had experienced in movies as if she had been to the real ones. She got his family background out of his words—a grandson of new money, he lived his life not only playing games, but also investing in them.\n“Do you play games?” Jo cut the steak. It lay on a paddle resting on a mini meadow made of foam and flowers.\n“Not really.”\n“So what are your hobbies?”\n“Watching movies.”\n“Movies . . . Few people watch them now. The industry has gone down since video games were born; it’s only a matter of time before it dies. Have you played neuromersive games? C’est fantastique. They say the hyper mode of Psyche Alpha is ‘more real than reality,’ but I only have an iFeel.”\n“There’s no such mode,” she said abruptly, then added, “I have a Psyche Alpha.”\nJo dropped his fork.\n“You have—you have one? But . . . how? I’ve wasted so much money on scalpers—”\n“I was an early club member of Phantasus.”\n“Ah. So desu ne.” The man nodded and regained his pride. “Why, you were talking about neuromersive movies. Well, Phantasus started up with them. But using a Psyche Alpha to watch movies . . . ” He shook his head.\n“What?”\nHe shrugged. “Voilà. It’s taking a musket to kill a butterfly. Nothing is impossible in games. A world more real than reality, but you can do whatever you want in it. Freedom! That’s the meaning of virtual reality. Is there freedom in movies? Everything is predestined. What’s the difference from the real world?”\n“There’s a great difference!” she protested. “Don’t you think life is already too chaotic? Movies provide a storyline, a guideline that gives meaning to life. Without stories, games are but heaps of loose sand. Good for nothing at all.”\nThe man gaped at her for a second, then burst into laughter. She smiled too; was it because of him, or the wine?\n“Touché!” He grinned. “Miss Liang, you are so interesting. Always surprising me. But if you don’t try them, you’ll never know the charm of games.”\nEyes glinting, he talked about his favorite games. She listened, admitting that some sounded like fun. Still, it was unlikely that she’d ever play them.\n“You must tell me if there is a Psyche Alpha purchase quota. I dream of playing with one every day.” Jo fiddled with a cherry tomato like an upset kid.\nShe was amused. “You could borrow one.”\nHis eyes lit up. “Can I borrow yours?”\nIt seemed an innocent question, yet she choked. She looked at his bright eyes, and then at the flowers on the plate. Was she a little drunk? Her face was hot on this fake summer night. Why not say yes? After all, she should give reality a chance . . .\n“Well . . . Perhaps.”\nShe talked about her favorite movies. Interested or not, he listened carefully. Lights flickered on the candles, in the air, and in his black eyes. His face blurred, and turned into one of her beloved faces . . .\n“Charming,” he commented. “No wonder you people like movies so much—it’s easy to get lost in them. You know, someone did get lost in a movie once.”\n“Oh?”\n“Hyperreality, remember? Neuromersive devices have three modes: low, medium, and high. In fact there’s a fourth, a hyperreality mode. No other device can support it, except Psyche Alpha. I heard a bro cracked the system, turned on this mode, and got into a movie. He ended up in a hospital, not knowing who he was for a whole week.”\n“How brave.” She was a little tipsy.\n“N’est-ce pas?” he shrugged. “Life is a challenge.”\nThey drank to the brave.\nTime for dessert. A perfect orange sat on a gilded plate like a little sun. The waiter picked it up with a gloved hand to show that it was a real orange, then cut it into halves. The air was bursting with citrusy happiness. She took a deep breath, almost tasting the orange with her nose, and suddenly stopped when she realized what she was doing. Embarrassed, she took a glance at the man, only to see him smiling at her. Why, maybe this smile was the beginning of a brand-new life . . .\nJo spoke. “Miss Liang, would you like to take a challenge?”\n“What challenge?”\n“Let’s be frank with each other from the very beginning.”\nShe stared at him. He swayed his hand, expensive rings shining on his fingers. “You know how painful it is to deceive oneself? Like my parents. Several decades they have done it just to keep face . . . Marriage is ridiculous. There are dozens of sexual preferences nowadays; how could one be chained to only one person for the rest of his or her life?”\n“ . . . Why not?” She was trembling.\nHe laughed. “I thought you could understand . . . Alors, after so many movies, you still don’t know that love is but an illusion? Illusion or disillusion, we have to go on living. If I have to get married, it won’t start with any illusion. I’ll get married, I’ll take the responsibility, but I’ll have the right to be with someone else, and so will my wife. See, here is a stage. Now we only need a heroine. Miss Liang, what say you?”\nShe bit her lips. The man studied her expressions. He suddenly backed off, for she stood up and stormed out.\n“Miss Liang—”\nHe sounded helpless.\nShe stomped out in high heels, running through the citrusy air. She wasn’t angry at him. She was just afraid, fearing she could not resist the temptation of the orange.\nShe hated herself.\n“Is love a transient illusion?” She grabbed his sleeve, not expecting his answer. Danny M. Amor smiled. They immersed into the mirror when she heard a whisper, “But life is transient already.”\nIllusions. She immersed her head in water, and looked at her floating blonde hair. He would soon appear in the next scene behind a fish tank, where corals swayed and clown fish flashed about. Smiles glistened, glances exchanged. He ran through a night of gunpowder and into her garden. Dripping wet, the two of them no longer belonged to this space-time. Moonlight swayed on his face, in his blue eyes, where years and decades were condensed into an instant. My cruelest friend, my dearest enemy. All is condensed into your eyes, not on your lips. “Romeo, O Romeo, Wherefore art thou Romeo? Deny thy father and refuse thy name—”\nWho are you? He was so beautiful and innocent. His lips so cold and burning hot. She could not speak.\nHe grabbed her hand and pressed it onto his chest. “Come and find me.”\nThey fell into water.\nThese violent delights have violent ends\nAnd in their triumph die, like fire and powder\nwhich, as they kiss, consume\nShe saw blue, white, and red. Moonlit pond, floating dress, his lips, and his blood. Maybe this was love, just like tears in rain.\nShe didn’t dream of Verona that night. She dreamed of a gray city, where words disappeared one after another. She opened her mouth, but forgot what to say. She dreamed of a glimmering city, where she had a strange hairstyle and strange clothes, her eyes were that of a sad deer. He sat in front of her, soaked by the rain. She saw herself in his eyes. A unicorn ran through the ashes.\n“Take me away,” she said.\nMist devoured the city and its residents. Mist carried her forward. She had a dream last night, and said something in it, but now she could not remember. Catching a dream was like catching the mist. The more strength you used, the easier it escaped. How about dreaming in a Psyche Alpha? Theoretically, it was impossible. It would wake you up when you almost fell asleep, play a song, and politely ask you to go to bed. This was not only a concern for your psychical health . . . What would happen if you dreamed in an electric dream?\nA sharp pain, and she almost screamed. In a battle for the handgrip, someone’s fingernails clasped into her hand. She dared not to speak, only glared at the person, and then squeezed deeper into the crowd. Now she couldn’t move, she could only take deep breaths and endure the pain. The pain was sharp as light. Ads lit up the ceiling. Passengers ebbed and flowed. People were quarreling somewhere. She suddenly felt afraid, because everyone was her enemy. She suddenly felt afraid, because there was no end to this life. She struggled to press the super noise-reducing button on the arm of the glasses.\nElectric waves went through her ears like thunderbolts. The pain soon passed, and the world became quiet. She looked around: people were acting pantomimes. Middle-aged women carried fake designer handbags and wagged their fluorescent fingers. A girl, immersed in rock and roll, closed her eyes and danced to herself. A foreigner spread his long legs that touched others’ knees, gazed at his glasses, and laughed silently. The train kept swaying. It was blank outside.\nThey arrived. People sleepwalked out.\nShe and Seb sat on the barstools on the street, eating sandwiches. The lunch that dropped out of the vending machine was no different from the self-heating dinner. The mist at noon was but slightly thinner than in the morning. They sat in the mist, as if on two isles. Seb glared at the remaining lettuce. “I think I’m gonna get fired.”\n“Nonsense. Look how your sheep sell.” That digital sheep had become an inhabitant of her desk. She gradually understood why it sold so well. Because it had no expression, no personality, nothing at all, so it was pleasant to everyone.\nSeb dumped his sandwich on the table. “They don’t need me anymore. That Pablo thing knows better than anyone, knows customer pre . . . preferences . . . and learns tren . . . trendy styles all by itself, and makes ten designs every five minutes. What can I do? I can only pick out pretty pictures to feed it.” He had lived in China for five years, yet the digital interpreter wouldn’t let go of him, and picked out vocabulary words he didn’t know: “customer preferences,” “trendy styles”.\nShe lowered her eyes. “It’s the same for me. It’s only a matter of time I’m replaced by Bill the Digital Bard.”\n“Oh, that’s not the same. You can find people like me everywhere, but it’s hard to find someone like you. AI can’t tell jokes. There was a video clip in the last speech you wrote. It made me laugh for twenty minutes!”\n“Thanks,” she smiled.\n“What was it again?” Seb asked enthusiastically. “A cartoon about a cat and a mouse? It was super fun, but a little, well, ancient.”\n“Ancient indeed. My ex worked at a library, or, you can say, an archaeology institute. I often snuck into its warehouse to watch movies—movies that weren’t even holographic. You know what, the cartoon you just mentioned was even handmade!”\nSeb took a deep breath; his reaction made her quite satisfied. She added, “Now that I’m thinking of it, I don’t know what it was that I actually liked, my ex or the library.”\nSeb struggled. “As if it matters.”\nShe sipped her Coke. A figure suddenly came to her, knelt down, and opened a little box, a handsome face shining with pride, the latest movies and games shining in the box. She waved her hand; the figure disappeared.\n“I’ll never get used to holographic ads,” she said. “The first time I saw one was at night, which really freaked me out.”\nSeb was more interested in pretty faces. “Who was that, in the ad?”\n“Pierre Yamazaki.”\n“Sounds like my . . . my . . . ” Ignoring Seb’s struggle to find the word, the digital interpreter claimed one for him, “Fellow townsman.”\nIndeed, they were both of French and Japanese origin.\n“Let me see.” Seb leaned forward, and linked his vision with hers. A bunch of windows jumped out. Seb took Yamazaki’s photo. “You like this kind of guy?”\nShe looked at that familiar face. A month ago it was her favorite, but she had no special feelings towards it now. She thought of her dozens of “favorite” stars, several ex-boyfriends . . . The face in the photo soon became misty.\n“Have you ever been crazy in love?” she asked.\nSeb raised one eyebrow. “I’m crazy in love with . . . ”\nHe drew out a little window. A beautiful young man stood in front of her, with close-cropped hair, deep eye sockets, dry and sexy lips, wires entwined in his arms and legs, and metallic joints. He looked at her with piercing eyes.\n“ . . . him. His name is Hal,” Seb said with pride.\n“What about your boyfriend?”\nSeb’s face paled. “We broke up. He couldn’t accept Hal.”\nShe examined the boy. He was pretty, but . . . Was he a machine, or a man dressed up like a machine? Regardless, there was a strange beauty in him, which attracted Seb like a magnet. She thought of another mysterious “man” who was as heartbreaking as this Hal. A program full of errors, but speaking out truths. An unhuman being, invading her human heart.\nOr vice versa?\nIn her mind’s eye, there was a man in a trench coat and a hat at the next table. He was reading a book, a real book. Feeling her gaze, he raised his eyes. She remembered—it was the movie she saw in the warehouse, it was the dream she had lost. Suddenly she felt that everything around her was tiny and pathetic. Only the rays of his existence pierced the mist.\nShe said, “I’m afraid. Now that I’ve seen you, I’m no longer normal. Under the reign of the machine, words are disappearing every day. Help me, where can I find them? What can I tell you?”\nHe closed the book, Capitale de la douleur.\n“You must recall them yourself, Princess. Or you will become one of those ghosts, lost forever in this city.”\nShe thought.\nShe thought, the mystery is solved. I don’t need to suffer anymore. The answer was so simple, so simple that it made her laugh. Who she loved was never an avatar, or some video clip; it was a man, a soul cowardly but true, hiding in that beautiful shell. That was why there were so many bugs: there were no bugs at all, but an improvising player, who somehow disguised himself as a neuromersive star. Maybe he wasn’t charming at all, his pretty looks merely a weapon against reality. Maybe he was also looking for someone, someone who could drag him out of everlasting loneliness. Would she be that person? Would she be the one who found the lost words and escaped from Alphaville with him?\nShe thought, I’m crazy. I don’t know who he is, whether he’s young, or old, or even a she. Maybe only his expressions, his movements, and his abrupt words were true. She only knew that he was not far away, because there was no time lag. She only knew that he was willing to be with her, that he understood her better than she did herself. If it was a gamble, the odds were horribly small. But she could only stake her all.\nAnd she thought, gamble? Don’t disgrace him. If he was water, she was a dying traveler in the desert, not knowing how to open her mouth and receive the grace. If he was fire, then she was a moth. Would a moth count its odds? Did water and fire have names?\nShe thought she was in love, but had never loved. She had done nothing but stand in front of a closed door.\n“I’ll see you in hyper mode next time. Will you come?”\nShe looked at Danny with pleading eyes, not knowing whether she could see through those optical fibers, electrons, and nerves to see his heart. Shadows danced, his green eyes flickered and dimmed. He narrowed them.\nSunday afternoon, stormy. It was inky black outside the window; wind whirled and shook the buildings. Lying in the cabin she thought the end of the world was coming. The end indeed: the Danny’s lease ended tomorrow, and maybe she would never see him thereafter. Her glasses were connected to the Psyche Alpha, which was put in developer mode, waiting for her to put in the code. The code was incredibly easy to find; it was everywhere, yet no one knew how to use it. It was $outhPoleFlamingo that told her where to look. In a mysterious BBS she saw a tutorial, followed by some ambiguous comments. This was it, her instinct told her.\nShe pasted in the code with trembling hands. Rebelling for the first time in life, her first thought was that the lifetime warranty was gone. Her precious club membership was probably gone too. The State Administration of Internet was definitely watching her . . . She thought about all this, but didn’t think about how she might end up in a hospital, or even worse. Though deep down, she was crystal clear about it.\nIt was her farewell to him, no matter what it might cost. Maybe she would forget the world. Maybe she would forget herself. Yet in an illusion more real than reality, love would be more true. If he was willing to come, she would open her heart, let him see how burning hot and desperate it was, then grab his hand and escape with him.\nRestart. The breathing lights had never flashed so fast, and looked as if they were a warning. She took off the glasses, laid back in the chair, thrilled. Was it fear or excitement? She was dragging herself to her doom. She knew she would end up like this, from when she saw him for the first time . . . No, from when she first saw neuromersive stars . . . But she couldn’t resist the temptation, and reached out a shivering hand, and touched the soft interior of the cabin. The places she touched lit up, their lights almost burning hot. Then the lights went off and the cabin closed, locking her in vast darkness.\nA butterfly fluttered its wings, on which a word appeared:\nHY-RE\nA world opened up its superfluous being, and squeezed into her body. Suddenly she was blind, and deaf, and could only grope her way along. Who am I? She saw a yellow-green river, smooth as velvet. She saw a girl stepping on the rails, gazing at the water. A girl wearing a celadon dress, lipstick, and a hat, only fifteen. Ah. It’s me.\nIt was windless. Always so hot, as hot as eternity. The sky was yellow-green, a sky she had known since she was born. The Mekong River splashed its dirty waves. Fifteen, she was only fifteen-and-a-half, and the world was too big for her. She almost got lost in it, in its Möbius loops of time. Just like now, she knew that this moment would last long, last for the rest of her life.\nFifteen-and-a-half. A silk dress of the river’s color, threadbare, almost transparent. A pair of high heels with golden lamé, worn-out. A foot on the rails, wiggling. And a man’s fedora, with braids hanging down in front, so rebellious, so right. She was proud.\nIn this eternal moment, everything except the ferry was still. Her mind was also a river, the future and the past swimming in it: mother, the elder brother, the younger brother, poverty, hatred, the doomed seawall, the upcoming deaths, and finally, the man. Yes, he was what was to happen. The man in the white suit inside the black car would come upon her body like an unstoppable sea tide and leave traces, and tears.\nHe came. It was a heavy moment. She saw him in the future, in the past, and in the now. It seemed that he didn’t belong to this world; she must have seen him somewhere else, maybe in a dream. He came. He finally came. Why, she wanted to cry. This elegant Chinese man in a light tussore suit had golden skin and dark eyes, which were sometimes sky green. He was trembling. He took out a cigarette as if it burned his fingers. But he was always smiling, as if afraid of her.\nThey strolled in the humid air, the sound of voices, the quacking of ducks, the noise of the engine, and the vapor of the river. As a Chinese, or maybe a mixed blood, he was handsome. He smelled like English cigarettes. He lowered his eyes, lights dancing on his eyelids like butterflies.\n“Excuse me, mademoiselle. Do you smoke?”\n“No, thank you.”\nHe spoke, and she only smiled. He said the hat suited her, and that she was so pretty she could do anything she liked. He offered to drive her to school. The door shut, the daylight dimmed, a barely discernible distress seized her, and a fog rolled in.\nHis skin was sumptuously soft. She was seeing stars. The world had been vivid, and was unbearable now. She saw herself in a kaleidoscope, floating on a sea of colors, being knocked over by waves, and sinking down. On the skin there was sweat, fruit, and honey. A neck craned up like a cathedral. Muscles moved slowly like sand dunes. Ebbing and flowing, she was all at once a grain of sand and the whole desert. Somehow she realized this wasn’t the first time she knew the secret of the body. Deep inside, she must be a woman instead of a girl, grown old too early because of insatiable desire. Love me, she said to his body. It was a beautiful body; she had never seen such a beautiful thing, so beautiful that it would burn at the touch. Love me, she begged again. She had just met him, but felt that she had known him for centuries. Finally in his arms, she held him so tight, as if he would disappear once she let go. Desire burned down her veins. Tides rose and fell in her body. The sea was formless. She fell to the infinite.\nHappiness was painful. A horrible kind of happiness, it consisted of too much self-destruction, and was therefore addicting. He said she would deceive him, and whether she loved him or not, it would be fatal to him. She listened, head in the clouds. How strange it was for him to say it, because he was the cruel one, and she was the begging one. The world was cruel, and her sadness was no longer the mother, the brother, the sadness that was born along with her, but another kind of sadness, superficial and deep at the same time.\nWhose sadness was it? Maybe she was dreaming. She dreamed of a kind of upward gravity, a figure emerging from its cocoon, or her body. Moments flashed in her mind. Beautiful bodies, beautiful eyes, an unforgettable afternoon. Smells, noises, a yellow-green river. A kiss fallen on the car window was all she could give him, and all they could have. They had no future, and even no present. Finally he married a Chinese woman with pearls and jades on her head. And she would not admit her love until on an ocean liner, in piano music and blue moonlight. It was with this love they built the seawall against the Pacific. Tell me you love me, would love me once again. Say it right now. Cold as she was, she should not say something like this. But was she really her? Her head was filled with phantoms: his face, his eyes, his poems, a sky hopelessly gray, a woman running after him, la capitale de la douleur.\nSay it right now. Say the words forgotten by the city of pain.\nShe grabbed his hand. A beautiful hand, which she had known in many other lives. “You’re not the lover. I’m not the girl. You’re not Danny. I’m not Eva.” She couldn’t read his eyes. She spoke her real name in his ear. “Come to me, just once! I’ll wait for you at Café de Flore every noon, until you come.”\nShe saw storms in his eyes, C-beams glittering in the dark, and a sea of butterfly wings. She fell in, and caught a glimpse of reality.\nIt was a good day. The sun shone from the small window and lit up the room. She got up early and sat down to have breakfast. She didn’t dream last night. It felt good.\nDanny Murong Amor disappeared from her Psyche Alpha. Strangely, she didn’t feel too sad. It was as if she had had a dream for a month, and now woke up to reality. She was lucky, luckier than “the brave,” luckier than most people. She looked at that square of sunlight, and somehow felt that Danny didn’t go far.\nBlue sky flashed between transportation tubes. She was the first to the office. Seb’s avatar jumped out, and told her he got another job. His sheep sold so well that Phantasus invited him to join their marketing team. She congratulated him, and opened an empty document. The digital writer began to work; it even looked less repulsive today. It was an efficient morning for her. She finished all the boring work enthusiastically.\nShe didn’t think about the future. That person might come, or might not. She was ready to pay the cost the moment she took the adventure. But like all women, she always hoped for the best.\nHer high heels clattered on the stone, yet she felt she was walking in the clouds. Her heart skipped a beat when she saw the café, people rushing in and out from its wooden gates. It didn’t have good food; it was but a name, a place. Still, she was willing to come here every day, imagining she was the heroine of a movie. Imagine—there was nothing to imagine from now on. From now on, she would see reality as it was.\nShe hadn’t opened the gate to the café yet.\nNews broadcast: “Phantasus says: intelligent stars are coming. Phantasus lab says a brand-new generation of neuromersive star has completed its alpha test, and will soon start a public beta. Dr. Murong: ‘It’s beyond imagination. It will shape itself into what you really want, and will become more and more intelligent with time. It knows your desires even better than you do . . . I see it as a great product, a product that will revive the cinematic arts . . . ’”\nThe man was still speaking, but she could no longer understand his words. She began to cry; cold eyes were cast on her, for she was in the way. The sun was shining bright, warming up her body. But she felt as if a rib had been taken, and it felt cold. Yet, the sacrifice had been made; somewhere, somewhere far away, gods of love had come to the world.\nWith special thanks to Giuliana Alfinito.\nOriginally published in Chinese in Science Fiction World, June 2017.\nThis story was translated by the author.\nTranslated and published in partnership with Storycom."}