{"fingerprint": "xgall2fErq6UdBiw9Thj1kygZEc=", "sitename": "Clarkesworld Magazine", "title": "Security Check by Han Song, translated by Ken Liu", "author": "Han Song; Ken Liu", "date": "2014-09-08", "source": "https://clarkesworldmagazine.com/han_08_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Security Check by Han Song, translated by Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3990 words, short story\nSecurity Check\nMy wife and I are celebrating our twentieth anniversary today. After work, I walk to the mall and pick out a necklace for her; then I walk to the subway station in the mall to take the train home.\nSubway stations are everywhere in New York City, and I do mean everywhere. The lines connect the most expensive neighborhoods with the poorest slums, and stations can be found in every shopping center, office building, theater, restaurant, nightclub, bar, church . . .\nA group of security agents, dressed in black uniforms with red armbands, are stationed at the entrance. They stand with their arms held behind their backs, their feet planted firmly apart, and survey the crowd with cold gazes. I try to go by them nonchalantly, but my legs start going rubbery as soon as I meet their gaze. I take off my jacket without prompting and place it—the necklace nestled in a pocket—and my briefcase into the yawning, dark maw of the x-ray machine.\nAfter the security check, they place a “safe” sticker on my chest.\nDazed and numb, I get on the subway. All the other passengers are also wearing “safe” stickers. Preoccupied, none of us say a word.\nWe’re at my stop. I walk home. My wife is already there. Trembling, I take out the necklace and hand it to her. She forces a smile and tries on the necklace once before putting it away. We eat dinner in silence, as is our habit. And then we go to bed, lying back to back, both of us quickly falling asleep.\nWe first met twenty years ago, also at a subway stop. Back then, everything was falling apart, and lawlessness reigned. One day, someone shouted that a killer was slashing at people in the subway, and we all panicked and stampeded. A woman in front of me fell; I rushed to help her up . . .\nLater, she said to me, “No matter how chaotic the world becomes, as long as you’re with me, I’ll feel safe.”\nTwenty years have passed, and life has been rendered one hundred percent safe, cleansed of all risks, dangers, and perils. It seems we’re left with nothing.\nThe loudspeakers installed in our neighborhood wake me up at four in the morning by blaring out the security briefing for the day. Only half awake, I fumble for my phone.\nOld habits die hard. Phones had been abandoned a long time ago, after all the telecom companies ceased operations and the Internet was cut off. All of it had been done to make us safe.\nMy wife and I get up and leave separately to take the subway to work. She’s not wearing the necklace I gave her, and I pretend not to notice.\nI walk by myself quietly. Under the dim streetlamps, pedestrians on the sidewalk scurry like a dull, gray swarm of rats, each clutching a briefcase, completely silent. Soon, I reach the station, where long lines of people wait to enter. Although advancing technology has sped up security checks, there are just too many people who must be processed. In this day and age, the subway is the only means of transportation left in the United States of America, all other modes having been outlawed.\nMore than an hour later, I finally reach the x-ray machine. Once again, I clench my teeth, and, though I’m fantasizing about striding into the station right past the security checkpoint, I do not even try to step out of line. One time, I did see someone try that stunt, and the security agents seized him right away and dragged him into a small cell next to the platform where they beat him to death as we all listened.\nThe train arrives in Manhattan. From the station I enter the office building through a tunnel. One by one, my colleagues arrive, their faces numb with exhaustion. How many of them have entertained the same fantasy of getting on the subway without going through security check?\nIn the restroom, Hoffman whispers to me, “Did you try it today?”\nI shake my head. “Why do we suffer from this peculiar yearning?”\n“Freedom.”\nEvery time Hoffman utters the word it sounds strange and chilling, even though I’ve heard it countless times.\nHe continues, “I want to live a life in which I am trusted, not watched and controlled . . . what about you, Louis?”\n“I want to give my wife a gift. We’ve been married for twenty years.” Once again, I feel terrible. I ask, “When would I ever get a chance to give her a gift that hasn’t been changed?”\n“Women don’t care about that,” Hoffman says; he means to comfort me. “She knows you’ve done your best.”\n“No, she does care. If we keep on going like this, we’re headed for divorce. She and I don’t live in a vacuum. The bond between us—the bond between everyone—requires the sustenance of the ordinary objects of daily life. But whatever we buy ends up passing through the security checkpoints: the food we eat, the water we drink, cups, books, televisions, refrigerators, computers, the beds we sleep on, even wedding bands and condoms . . . you understand.” Tears crawl down my face.\nOne time, Hoffman told me that the machine they use at security checkpoints isn’t really an x-ray machine. The government confiscates everything you put in; whatever emerges from the machine may look indistinguishable from what went in, but it has in fact been reconstituted. Atom by atom, the new objects are assembled, printed, and returned to the passenger. The process takes but an instant because our technology is so advanced. The new objects conform perfectly to the new American national security standards, with all elements deemed dangerous removed. If the objects contained any gasoline, it would be turned into water; if there were a gun, the bullets would be turned into rubber; if a computer contained harmful knowledge, it would be deleted and replaced with sanitized information.\nHoffman and I both dream of a day when we can ride the subway without going through security checks, but every time we tried to realize the dream, at the last minute, both of us would lose our courage and our legs would turn to rubber.\nOne time, Hoffman told me that some people did enter the subway without being checked.\n“I saw it with my own eyes. One morning, a woman in front of me walked right past the security agents with her purse, bold as you please. The agents stood frozen in place like mannequins.”\n“How was that possible? I saw someone try to do the same thing, but he was beaten to death right then and there,” I said. Was Hoffman hallucinating?\n“It was true,” Hoffman said solemnly.\n“What sort of woman was she?”\n“I only saw that she was young and beautiful. After she went through, she looked back at all of us standing in line and smiled triumphantly.” Hoffman clicked his tongue in admiration.\n“She must have used magic.”\n“Magic, indeed. Perhaps an invisibility cloak . . . or some machine that jammed electromagnetic waves?”\nI can’t remember much about the way things were twenty years ago, only that the country was very unsafe back then. I’ve watched special educational documentaries: the terrible explosions, gunshots, slashing knives, protest marches, petitions to the government, conflicts . . . everyone lived in terror, thinking danger was around every corner. Several times, a random shout or even a single shocked facial expression was enough to cause the crowd on Fifth Avenue to panic and stampede, trampling and injuring hundreds. Security threats were everywhere, as were hidden enemies. The 911 call centers were constantly swamped.\nThe White House had to mobilize a great deal of resources to enhance and expand the security system. The federal government took the lead, but the big companies on Wall Street and in Silicon Valley all participated. Through a public-private partnership, they invested money and technology to rebuild the entire city’s infrastructure into a system of security checkpoints. This was extremely important: buffeted by civil unrest and foreign threats, America was sliding down from its peak. It was no longer the hegemon of the world.\nThose old enough to remember say that the nation almost collapsed overnight, barely avoided the fate of becoming a ward under the guardianship of those Chinese coming from over the Pacific. Thank God for the subway, for the security checks. They saved America.\nNot only does the system guarantee safety, but the government is also able to gather all information contained in the objects taken onto the subway by passengers. Now, no one dares to make trouble. Even corruption has been eliminated—not just corruption, but also anything else destabilizing. Even so, the substitution of objects in the machines continues each day. The country still feels insecure. Security and insecurity: the two concepts were sometimes different, but often the same.\nHoffman tells me that this is fighting terror with terror. The terror produced by the security check mechanism is even more terrible, sufficiently powerful to shatter all other terrors. The price we pay is freedom.\nBut . . . the system obviously has holes. Hoffman saw someone enter the subway without going through security check. This was undoubtedly a miracle. Who was that woman who managed to bypass security so easily? Hoffman wanted to find her, but she has never reappeared.\nAfter work, I go to the supermarket for groceries and then take the subway home, dejected. At the completely silent dinner table, I eat my food, ashamed and with sweat beading on my back like a man who has done something wrong. I think maybe things would be better if we had a child, but my wife and I have lost all interest in sex . . .\nWe finish dinner quickly and get into bed. In the middle of the night my wife wakes up abruptly and says, “Louis, we shouldn’t be together anymore.”\nIt has been a long time since we’ve really talked. I understand that she’s disappointed in my weakness, my lack of courage. For twenty years I haven’t been able to bring her a single, true, unaltered gift. Because the objects that connect us have grown more and more unfamiliar, the two of us have been drifting ever further apart.\nHoping against hope, I say, “A colleague mentioned that someone managed to bypass the security check and get into the subway. I want to try it, too.”\nShe looks at me as though I’m a stranger, her eyes full of tears. She doesn’t know that I’ve already tried—and failed to carry through—many times.\nThe next day, I’m arrested. My wife reported me by calling 911, telling them that I was about to try to break through a checkpoint. She said she suspected that I was a terrorist in disguise.\nThree years later, I’m released from prison.\nThe world remains the same, except that my wife has divorced me. I find Hoffman. Like before, he tries to comfort me. “It’s not a big deal. I’ve figured something out during the last few years: life is a long security check, and not everyone passes. You just have bad luck.”\nI ask him whether he’s found that mysterious woman. He shakes his head. Then he suggests that I leave the country.\n“What? Leave America?” Surprise made my voice louder than normal. Very few people ever think of leaving America.\nHe shrugs. “If you can’t get through security check, you might as well leave. I’ve heard that some countries don’t require so much security on their subways.”\nI find the very concept absurd. Deep down, I’ve never thought of leaving America—it’s not that I’m very patriotic, just that I’ve grown used to my country. Life is just surviving one day after the other.\n“You’re divorced and you’ve been to prison,” says Hoffman. “Even if you try to break through security check again it will be a meaningless gesture.”\n“What about you? Will you leave as well?” I ask helplessly, having lost my goal in life.\n“No, I’m going to stick it out. Maybe a day will come when I can bypass security check and win freedom in my own country through my own efforts.” He sounds like a stubborn child.\nI lack Hoffman’s courage and tenacity, and my body and spirit are on the verge of collapse. So I start the paperwork for leaving the country. Though I fear that it will be difficult, it turns out to be simple. They actually really like it when you leave, and it’s best if you never return. Of course, they want the departure to be voluntary. They’ve never forcefully exiled an American citizen.\nI choose to go to the People’s Republic of China.\nJudging by official statistics, this is the world’s most secure country. I obtain a temporary residence permit in Shanghai and live on government subsidies. The Chinese subway does not require security checks; they really are that confident. But I’ve lost all interest in the subway. When I’m bored, I go to an Internet cafe and browse for news about America. In China, anyone is free to use the Internet. China is the freest country in the world.\nThere’s lots of news about America on the Web. I find out that my motherland, though it still appears familiar, is in fact changing every day. It isn’t just the goods carried by the passengers that are being replaced. To ensure security to the greatest extent possible, each day the entire United States is remade. The Chinese observe and analyze America with great interest. They’ve discovered that the entire territory of the United States is filled with nanomachines: from the rural countryside to the big cities, from the broad rivers to the majestic mountains, everything is renewed daily. Harmful things have no safe harbor in that land.\nBut this phenomenon can only be observed from the outside and at a distance because no outsiders are allowed to enter the United States. Theoretically, no one can pass through the American border security check system. Americans who are inside its borders cannot detect the changes because they think every day is the same as the day before.\nSometimes I wonder if the Chinese are observing and analyzing this because they are worried that America might one day deploy this technology to replace another country, or even the whole world.\nBut my worries are unfounded. America is focusing its security checks inwards, replacing itself. The effort has occupied all of its energy, with nothing left for other countries.\nGazing back from the other shore of the Pacific, I see a truly wondrous sight. The self-substituting America churns in constant transformation: one moment it’s like a wild flower—blossoming with a pop, collapsing, wilting, changing color from red to black, from yellow to white—and the next moment it’s like a dying star. Caught up in the changes are my compatriots. They are replaced and remade daily: from blood to muscle, from life to thought, becoming new people without knowing it themselves. From inside America, nothing is seen to change—every day people ride the subway to work like rats. But from China, the changes cannot be more obvious. I suppose this is a difference in frames of reference.\nAlso transforming is the wildlife, including the brown bear and the bald eagle, the sequoia and other plants, the fungi and bacteria, and every bit of soil, every drop of water. Sometimes the country displays the layered appearance of a tropical forest, and sometimes it looks like an ice crystal. Murky blood flows in the northeast, and the western deserts glow with a ghostly blue light. Sometimes the whole country is silent, save for the powerful rumbling of the subway system, the strangest sound on the planet. America has become distinct from all other countries in the world.\nFrom China, I can see all these changes clearly, and after shock and astonishment, I’m left with sorrow, my face drenched by tears.\nNew research indicates that as the security system itself evolves, America has developed even more advanced technology. Now the security system not only consists of nanorobots and 3D printers, not only big-data-based distributed reassembly devices, but also self-organizing technologies and artificial world collage machines. Countless cellular automata toil away with the aid of quantum teleportation, engaging in mass-scale atomic exchange from second to second. The White House has been rebuilt into a gigantic machine to take over from the millions of engineers who oversee and control every aspect of the process. The United States has become a giant, intelligent, churning vat.\nBut then, one day, the self-transformation of America suddenly halts. Instead of constantly replacing itself, the country vanishes completely. The Chinese manage to record the phenomenon, and their analysis concludes that America’s security check technology has achieved a major breakthrough. The time when something is completely secure is not when it has been replaced, but when it no longer exists. No one can find it, ever. This is not only science, but also a kind of profound philosophy capable of being understood only by a few elite individuals on the whole planet. Thus, in this sense, America has finally returned to being the mightiest of nations.\nI remember my ex-wife. Has she disappeared along with America? I hope she’s in another world, a happily-ever-after one. She will not have any mental baggage, and she won’t hate me.\nI’ve left my country, never able to return. I wish her freedom and happiness in a powerful United States of America.\nOne day, as I stroll through the People’s Square, I meet a beautiful Caucasian girl. She had also left America and came to China. Sitting down on a lawn together, we begin to chat. This is the first conversation I’ve had in twenty years where I feel no pressure.\n“You’re the first American I’ve seen overseas,” I say.\nThe girl, whose name is Lisa, says, “There aren’t many Americans left in the world. The nation of America has long been substituted away.”\n“What about you?” I ask, suddenly remembering the story Hoffman told me about the mysterious young woman who got into the subway station without going through security check.\n“I’m not like the rest of you,” she says. “I’m a real American. I’ve never been replaced. From the very start, I bypassed security checks.”\n“How were you able to do it?” My heartbeat speeds up.\n“I don’t have an invisibility cloak or an anti-electromagnetic-wave device. All I had to do was to walk calmly past the security agents. If you don’t acknowledge their existence, they don’t exist.”\n“But didn’t you say that everyone has been replaced? The entire country has been replaced!”\n“That’s right. At first, I was confused as well, but it’s the truth. Anyone who dared to defy the security checks, however, was not replaced. We were sent to a protected area, which was somewhere near the coast of Florida, about three hundred meters under the sea.”\n“It sounds like you were chosen by God—”\n“—not God. The Chinese.”\nThe girl tells me that there were about a thousand people like her from all over America. Before the disappearance of America, the Chinese helped with their evacuation.\n“The Chinese?” I ask.\n“They’ve been part of this business all along, including the security machines. Without the support of the Chinese, America couldn’t have produced those machines by itself. Chinese technicians even helped the American government to design and plan all those terrorist attacks from twenty years ago. If those events hadn’t shifted public opinion and increased the cohesiveness of the population, America might have collapsed a long time ago. Have you heard of the Huawei-Alibaba-ICBC Conglomerate and the Tencent-Baidu-Xiaomi-ZTE Corporation? They had the world’s best scientists and engineers. The White House and Zhongnanhai were extremely close partners, though superficially they pretended not to like each other—it was just a show to fool regular folks. If you look behind the scenes, China helped America design the neo-crony-capitalism of the twenty-first century so that America could act as a reference system . . . ”\nImpossible! I can’t believe any of this. I stop thinking. Lisa takes me to Xintiandi district to enjoy myself. The Museum of the First National Congress of the Chinese Communist Party was turned, some time ago, into a national laboratory. Many young women from America, like Lisa, now live here as volunteer subjects for experiments. A middle-aged Chinese man in a white lab coat welcomes us. The Chinese are trying to confirm an amazing discovery: they’ve discovered that the Earth is passing through a security checkpoint in space, which has something to do with the ultimate secret of the universe. The galaxy, it turns out, is a super security check machine.\n“Is the universe . . . not safe?” I ask, astonished.\n“That’s right. It’s not safe at all. We’ve only figured this out now. The purpose for life developing on Earth and evolving intelligence is to maintain the security of the universe.” As he explains, he leans into the eyepiece of a giant telescope and makes careful observations.\nLater, I find out that as the sole surviving major socialist nation, China is the only country concerned with the security of the universe. America, in fact, was nothing more than an experiment set up by China to help with this mission of protecting the universe’s security. The experiment that China carried out in America is about to be promoted across the whole globe, although there are still many mysteries related to this endeavor that I don’t fully understand, and the Chinese won’t explain the details to us.\nImpulsively, I tell Lisa, “I want to be a volunteer subject for the experiments, too!”\nShe looks at me with pity. “I’m sorry. The Chinese don’t want you for now. You and I are different. You asked to come to China, seeking asylum. You had already been replaced in America during earlier experiments. You’re no longer a standard American—to be more precise, you are no longer an American, or even a person. What you really are and what you can do are matters that the Chinese haven’t decided yet. You’ll have to wait.”\nWhen the security of the universe is the most urgent question, what role will the thousand or so real Americans like Lisa preserved by the Chinese play? That is the greater mystery.\nAshamed and confused, I lower my head.\nWas Lisa designed by the Chinese? Who designed China then? I’ve heard that a long time ago, China was also torn by terrible disasters, both natural and man-made—how did they happen? If the rumor I heard was real, then China was once the most insecure country in the whole world. What conclusions can I draw? Oh, the universe is too mysterious. Who designed it?\n“It doesn’t matter,” Lisa says to comfort me. “You don’t need to go through security checks anymore. At least superficially, you could pass for a Chinese. You even get government welfare checks, right?”\n“But had the Chinese already experienced what we experienced?” I blurt out. “How do you know they’re still Chinese?” Sweat soaks the back of my shirt. Sadly, I think of my ex-wife again. Yes, many countries in the world have survived, and they’re about to pass through the universe’s security check. But my country and family are gone. And Lisa and I aren’t even the same kind of human beings.\nLisa smiles awkwardly. Holding my hand, she takes me away from Xintiandi. We get on the subway. The Shanghai subway is far more crowded than the subway in New York. Squeezed in among the throng, she and I are temporarily pressed against each other as though we’re trying to fuse into one. The subway car is filled with every race from every continent. The multitude of passengers presses against and flows over our bodies like an underground river, directionless but melding into one another with every fresh encounter.\nOriginally published in Chinese in Southern People Weekly Magazine, September 8th, 2014.\nTranslated and published in partnership with Storycom.\nHan Song is a reporter for Xinhua News and a prolific science fiction author. His novels include Subway, Bullet Train, A Comet Illuminates America, Red Sea, and Tombstone of the Universe. He received the Chinese Milky Way Science Fiction Award in 1988 and 1990, the World Chinese Science Fiction Association Science Fiction Art Award in 1991, and the Chinese Science Fiction Art and Literature Award in 1995.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts."}