{"fingerprint": "2td2WrAqvKmg31YQRCJ0cyF9RyE=", "sitename": "Clarkesworld Magazine", "title": "Wendigo Waistcoat Spyglass and Other Words with Lisa L. Hannett by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/hannett_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Wendigo Waistcoat Spyglass and Other Words with Lisa L. Hannett by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nWendigo Waistcoat Spyglass and Other Words with Lisa L. Hannett\nIn Bluegrass Symphony, Lisa L. Hannett writes of a place that is, perhaps, somewhere (or nowhere) in the rural United States—a place that is inspired, in equal parts, by the American South and Medieval Icelandic literature.\n\"Lisa Hannett weaves words the way the Norns weave fates, elegantly, seamlessly and with just a little bit of cruelty,\" said Angela Slatter, author of Sourdough and Other Stories. \"Her stories are astonishing in their scope, so strange and yet familiar. Her ability to insert the unlikely and the terrifying into the everyday with such a convincing touch that you have no problem believing in Swan Girls, Minotaur rodeos, soul cigars and twig-wives, is simply stunning.\"\nRaised in Ottawa, Canada, Hannett now lives in Adelaide, South Australia, a coastal city much like Charleston, SC on a very weird day. Her fiction has appeared in Clarkesworld Magazine, Fantasy Magazine, Weird Tales, ChiZine, Midnight Echo, Shimmer, Electric Velocipede, Tesseracts 14, and Steampunk II: Steampunk Reloaded, among other places. She is a graduate of Clarion South.\nThere is a relentless musicality to Hannett's prose and fierceness to her vision. Beware of her beautiful song.\n\"L.L. Hannett's work has the uncanny ability to get under your skin,\" said Ann VanderMeer. \"Her stories are so comfortable and familiar until they turn on you in the best possible way. Never a boring minute, her fiction is fiercely original and imaginative.\"\nBelow, Hannett and I talk about style, the short form, and \"the human side of even the nastiest creatures.\"\nWhy the short form? What is it that you love about the short story?\nInitially, I started writing short stories because I was also working on my PhD, which is a long and often tedious process. I wanted to write something brief, immediate, with a clear end in sight. Also, I had loads of ideas for stories, and no matter how much I tried to ignore them, more kept cropping up. I'd be reading all sorts of dry academic articles or translating passages from the Icelandic sagas while my back-brain was jumping up and down, shouting \"There's a crow stuck in a mechanical carnival! What're you going to do about it?\" or \"She's got to sing while eating corpses! How's she going to do that without a voice?\" Things like that are hard to ignore.\nI grew to love short stories not just because they were convenient to write, but because they are beautiful capsules of narrative. They are complete without revealing everything. They evoke rather than explain at length. They make us wish they were longer, even though we know that stretching them out to novel length would break them, make them somehow less magical. I love that in short stories things can happen quickly — but since they're so brief, they can also get away with having nothing happen at all. They can be vignettes, or philosophical musings, and still be satisfying. Take Kij Johnson's \"Spar\": very little happens, plot-wise, but simultaneously so much is going on in this story that we want to re-read it almost before we've reached the final paragraph. I love writing short stories because it's possible to hold the whole narrative in your head, from beginning to end, and know all the twists and turns and nuances — not so with a novel (at least not for me, anyway). A novel unfolds. A novel has to be teased out. A novel needs time. But a short story is complex but compact. And it can offer more instant gratification.\nWhat should a short story do? How should it work on the reader?\nA few years ago at Clarion, I was chatting with Sean Williams about this very subject and he described the function of a short story in a way I'll never forget. He said to imagine the short story as one facet in a diamond. In one story, you can explore that facet completely, and through it you can describe glints and corners of the other planes — but you can't draw them fully into your piece. Novels are long and big enough to accommodate the whole diamond, but stories are more effective if they are confined to one aspect. It's basically another take on Poe's \"Single Effect\" theory, but presented in a prettier package.\nAs I mentioned before, I think short stories should evoke ideas beyond the single effect without actually exploring them. Readers should get the feeling that they've been in a three-dimensional world with a complete history and realistic characters, but without having to sift through superfluous detail to get that feeling — the kind of extra information that would be fine, expected even, in a novel. In short stories, no word should be wasted. They should be trimmed and trimmed and trimmed again until all that is left is what is essential to the narrative.\nWhat is style and how would you describe yours?\nThe way I see it, style is inherent in narrative structure, tone, and voice. Style should reinforce the story's world and its inhabitants; in other words, it should give readers extra insight into how the setting and characters function. It should highlight the story's themes, manipulate the pace, and help to convey the concepts driving the piece. For instance, if we were presented with a story about people in exile, disconnected from their homeworld, floating about lost in space, I'd hope the style would echo and emphasize their plight: sentences would be short, choppy, disconnected, not flowing lyrical rambles. Or if you were writing a story in which the protagonist is insane, you might want the structure of your piece to be off-kilter. You might leave chunks of information out so that the reader feels a bit nuts too — that sort of thing. In this respect, Jeff VanderMeer's Finch offers readers one of the most satisfying blends of style and content published in recent years.\nMy style changes from piece to piece. I like to set myself challenges, to write from different perspectives, with various voices, drawing on or breaking conventions. I've recently written a Regency fairy story in which the language and long sentences are part of the point. \"Gutted\" (Shimmer) and \"The Good Window\" (Fantasy) deal with gruesome and harrying subjects, so I've kept the style simple. By contrast, the stories in Bluegrass Symphony are, for the most part, about rednecks and hillbillies who live in the Middle of Nowhere, U.S.A. Many of these people have a twang in their voices. They have little to no education, their society is deprived (and depraved), superstitious and sometimes downright nasty. And yet... Publisher's Weekly describes the style of these stories as \"filled with lush imagery, unsettling concepts, indirect prose, and multilayered plots\" and I think this description is spot-on. Just because these people are poor, uneducated farmers doesn't mean they're simple, less emotionally complex, less capable of being beautiful, or less pathetic and hopeful than people with money and cars and city lives. I wanted the style of the stories in Bluegrass Symphony to reflect this complexity — to contrast with the Deliverance stereotype that often comes to mind when we think of isolated, close-knit rural towns.\nWhat has Medieval Icelandic literature taught you about life, love, and writing?\nA famous Icelandic scholar once said that all of the medieval Family Sagas (Íslendingasögur) could be summarized in four words: \"Farmers came to blows.\" This might seem overly simplistic for such a rich and broad body of literature, but the more you read these sagas, the more you realize what an insightful comment this is. Saga characters are perhaps most famous for their stereotypical \"Viking\" characteristics — pillaging and plundering, sailing, adventuring, fighting — just as stereotypical \"hillbillies\" are often portrayed as banjo-plucking, inbred, narrow-minded, toothless hicks. In both cases, we are poorer, as readers and writers, if we stop at these generalized, superficial descriptions. One of the most beautiful things about the Icelandic works is that, stylistically, they are quite straightforward. However, they use Spartan sentences to convey multiple symbolic meanings. These are masterpieces in restraint; universally, the Íslendingasögur use words economically to express extremely complex ideas. They are riddled with black humor, veiled threats, incredible intelligence and, in most cases, passion.\nThese Icelandic characters are far from the mindless horned-helmet-wearing brutes we often see cast in \"Viking\" roles. There certainly is violence, and this violence is driven by honor — but this isn't some comic book trope. Honor in Iceland entails much more than some incontrovertible, ephemeral notion of \"duty\" to one's \"chief\". Honor is bound up with emotion and love. It's about avoiding embarrassment; proving your worth as a lover; proving yourself to your parents; proving yourself as a human being who warrants remembering.\nSpending six years analyzing the Íslendingasögur has affected my fiction writing not so much stylistically as in terms of characterization. I can't help but look for the human side of even the nastiest creatures. I also can't help but couch beautiful elements in fraught or horrific contexts.\nWhere does a short story usually start for you—image, turn of phrase, character, situation, something else altogether?\nAll of the above, really, but if I had to narrow it down I'd say it's mostly the first two. I am a visual person: my first degree was in Fine Arts (painting and photography) so a lot of my ideas come to me as disconnected pictures or tableaux in my mind before they translate into words. \"Carousel,\" the first story in Bluegrass Symphony, first appeared as an image of a girl in a birdcage, surrounded by moths. I could see \"Down the Hollow\" — the snow, the ravine, the girl, Jesse's face — before I started writing the piece itself. \"Forever, Miss Tapekwa County\" started off as a visual, too: a tadpole in a round gelatinous egg. \"Depot to Depot\" practically wrote itself after I saw a news clip showing a horrendous car crash. But a lot of the time, a phrase will trigger the tale. The title of \"From the Teeth of Strange Children\" was what bred the narrative — actually, I have a notebook filled with titles that don't yet have stories attached. If I'm not sure what to write next, I flick through it and inevitably something jumps out at me (usually in the form of an image...)\nIs there a landmark piece of fiction in your career?\nI suppose it would have to be \"Commonplace Sacrifices,\" which was one of the first stories I ever wrote. The day after I sold it to On Spec in 2008, I discovered that it had also earned me a spot in the Clarion South Writers Workshop for 2009. Going to Clarion was an incredible first step in my writing career — if I hadn't taken the chance and sent in that story as my audition piece, I have no idea where I'd be now.\nWhat did you learn from compiling Bluegrass Symphony?\nBluegrass Symphony was my first major project: it's a collection of twelve short stories, yet all but one of them is original to this book. So I spent a lot of time writing new material, but also editing out the stories that didn't quite fit. I think I could probably fill another book with stories set in this world, based on all the ones I left out. I also carefully considered the order in which these stories appear. Many of them go to quite dark places, and I didn't want to put readers off right away. I wanted to lull them in with mildly disturbing stories, plunge them into the horrors of \"From the Teeth of Strange Children\" and then pull them back out and leave them unsettled, but hopefully not shattered. And since these are mostly new works, it was great putting Bluegrass Symphony together and seeing all the connections between the stories once they'd been compiled.\nYour forthcoming collection Midnight and Moonshine is co-authored with Angela Slatter. How did you work out the collaboration? How did you guys work together? What do you admire about Angela's writing?\nAngela and I met at Clarion in 2009, and have shared a brain ever since. Individually, our stories are quite different, but we share the same values when it comes to work ethic, aesthetics vs. content, character motivations, delving into the creepiness behind the beauty, etc... So while we were at Clarion, we'd bounce ideas off each other and soon discovered that we just \"got\" what the other had in mind. We started collaborating on stories in 2010, writing some fun and wacky pieces for Steampunk II: Steampunk Reloaded and then writing a more traditional fantasy story, \"The February Dragon,\" which won the Aurealis Award for \"Best Fantasy Short Story 2010\". We wrote \"Prohibition Blues\" last year, which will appear in Midnight and Moonshine but is first being published in Damnation & Dames, Ticonderoga Publications' new paranormal noir anthology, later this year. As was the case with Bluegrass Symphony, all but one of the stories in Midnight and Moonshine will be original to the collection. And I say \"will be\" because we're still writing them...!\nHow does the collaboration work? Via email, Skype, in hotel rooms during conventions... We live in different States, so we meet and plot whenever we can in person; otherwise we chat over the internet to come up with the book's major story arcs. This is a collection of interconnected short stories — a mosaic novel — so we are constantly in touch about where the overarching narrative is going.\nOn a more practical level: I'll start a story, or Angela will, and then we'll swap drafts, filling in gaps, fixing each other's gaffs, adding new twists and turns. Basically, it works because we trust each other implicitly. When we collaborate, neither of us is precious. If things need to go, they go.\nAnd I admire everything about Angela's writing. Everyone should read Sourdough and Other Stories. Once they do, they'll know why I can be so unequivocal here.\nHow did you and Ann VanderMeer get to know each other?\nA last-minute change in the teaching team at Clarion meant that Jeff came to Australia to be our Week 6 tutor, but Ann wasn't able to come at such short notice. However, because Ann is so unbelievably generous, she read all of my Clarion stories anyway and I met her \"virtually\" this way. The feedback Ann gave me about where to start a story always comes to mind when I find myself trying to get into a story through the wrong door... We kept in touch after Clarion, and Ann bought my story \"Sisters Under the Skin\" for Weird Tales. Since then, we've worked on a bunch of wild projects together (from steampunk to bestiaries to other weird things) and I couldn't be more delighted that she agreed to write the introduction to Bluegrass Symphony.\nOn your blog, you recently posted a list of \"Random Words I Kinda Love,\" including Hacienda, Spyglass, and Waistcoat. What do you look for in a word? Is it the sound? The meaning? Mouth feel? Associations? And likewise for \"Random Words I Hate\".\nMeaning first, of course. Rhythm is next in importance (partially mouth feel and sound), then associations. I love the musicality of hacienda, just as I love the period that spyglass and waistcoat evoke. They're such proper words, so ornate, and they conjure up images of polished brass and places to go. Wendigo has such a great rhythm and it sounds wonderful when spoken with an Australian accent (something happens to the \"o\" that makes it even more strange than it already is). Egypt is a word I love to write, physically, with pen and paper. All those loops connected in cursive — try it. It's such a fun word to write down.\nAnd, yes, the same random rules apply for words I hate. Moist sounds like someone smacking while chewing their food, and the images it evokes are always gross. I use 'moist' in stories if I want the character to seem disgusting or sleazy (if only to me!) As a child, I hated tummy because I thought it sounded babyish and stupid — and I still do. I will use the words I hate, almost as much as the words I love, but when I do it's nearly always to make the characters seem uglier, more disgusting, more repellent than they would otherwise be.\nWhat's next for you?\nI've recently won a grant from Arts SA, which has bought me almost a year of full-time writing time to complete my first novel, The Familiar. This is the first book in a dark fantasy trilogy focusing on witches and lunatic shapeshifters in the city of Stokenveld. There's magic! Dead cats! Did I mention the shapeshifting lunatics? Meanwhile, finishing Midnight and Moonshine is also a top priority. Later this year, I'm heading up to Toronto for the World Fantasy Convention — and it'll be great to meet some of you there.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}