{"fingerprint": "Dk0qiIogBXMABZOzXD0Hjh9kz/Y=", "sitename": "Clarkesworld Magazine", "title": "On the Lot and In the Air by Lisa L Hannett", "author": "Lisa L Hannett", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/hannett_07_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: On the Lot and In the Air by Lisa L Hannett", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3680 words, short storyOn the Lot and In the AirThe crow’s talons gouged new gashes into Jupiter’s enamel as the orrery revolved a clockwork orbit beneath him. Gaslights incandesced from the base of the carnival booth, projecting the solar system’s rotations onto the canvas dome above the crow’s head. Light strobed into his eyes each time Jupiter completed a rotation, which did nothing to improve the crow’s temper. He lifted an articulated wing to shade his eyes; when he dropped it a moment later, he saw a gawking crowd congregating on the midway, its collective attention captivated by the golden gear held steady in his beak.The midway’s makeshift stalls had sprouted like rank weeds, hell-bent on doing damage before they were uprooted. As evening slid into pungent night, the carnival had colonised the city’s neglected streets, transforming them with its garish gaslights and flea-bitten draperies. Tents had whorishly spread themselves along all surfaces, like the cheap skin show dames who plumped and corseted their wares in the fair’s liminal spaces.Now the thoroughfare teemed with noxious odours, secreted by a horde of notorious bodies, all crammed into collapsible houses of ill-repute. The buildings supporting the carnival’s crooked pavilions dripped constantly, as if a giant pig was spitted in the sky, its juices left to fall like fatty rain onto the scene below. By morning, discarded candy wrappers and flocks of shredded ticket stubs would papier-maché every tent, signpost, and tree, leaving archaeological layers of rubbish to congeal in the city’s slime.This whole place reeks, thought the crow.“Forget cheap arcades with rubber-limbed benders! Forget dime museums, string-shows and flea powders! What y’all need is to let off some STEAM! Step right up and have a FREE shot at this Foul Fowl! Sock him in the block and win a plethora of prizes!”The crow snorted as the sprocketed showman jangled out from behind a threadbare curtain. His stovepipe hat belched steam as he clanked over to the bally platform, which was girded in dusty organza. The showman’s pliable tin shanks were clad in darted velour leggings; aluminium tails grafted onto his torso lent his outfit a certain panache, as far as tarnished suits go. Small beads of humidity or grease drip-dropped down his pockmarked cheeks and neck, watermarking the collar of his ruffled shirt with grey splashes. Leaning on a bamboo walking stick atop the dais, he surveyed his flock for a heartbeat. On the second beat, he raised a gloved hand to his breast and bowed like a courtly gentleman.“Robin Marx, at your service,” he said to rapt listeners, “on behalf of the Outdoor Amusement Business Association. That’s right, folks—you’ve heard the rumours, and I’m here to prove ’em true—Robin Marx always gives the first shot for free! Win on that shot and the prize is yours! It’s no sin to be a winner, my friends; so come and collect an easy dinner.”Revellers were drawn to Marx’s stall faster than you could say shine on spit. He had greased more than a few palms to score such a choice locale; his bird-show was the first thing people’d see when they came in, set up as he was on the right-hand side of the midway, only two paces away from the carnival’s main entrance. The showman smiled, and blessed the corruptible lot man as he surveyed his coffer-filling patch of turf.It was proving to be the prime location for shooting marks.Ladies and gents disembarked from a motley collection of dirigibles—steam-powered and boiler-driven, with leather balloons or finest silk, depending on the owner’s station—directly outside Sideshow Alley’s hastily erected plyboard fences. Two guineas were extracted from each heavy purse by way of an entrance fee; once inside, the gullible masses would sure as sugar leave a goodly portion of their remaining shillings to Robin Marx, proprietor and entrepreneur extraordinaire.Pockets jingling, Marx wove through the crowd as if he were the Lord Mayor hisself; winking at the ugly girls and pinching the cute ones’ bottoms; shaking hands with the gents and slapping sharpies on the back as he progressed. In the midst of his campaigning, Marx made his way over to the crow’s slowly orbiting perch.Night clung to the bird’s mangy figure; his wings hung sodden tissue-like by his sides. The crow felt like a feathered showcase for their racket, a curio cabinet with an aching beak and flea-bitten wings. A cabinet that would do anything for a day off. He sighed, making sure not to knock the gear out of his beak as he did, and listened to the sideshow dames singing to their Johnnies:“—one fire burns out another’s burning,One pain is lessen’d by another’s anguish;Turn giddy, and be holp by backward turning;One desperate grief cures with another’s languish . . . ”“Why don’t you ever sing like that, bird?” Marx bent over and turned the ornate key jutting out of the orrery’s bulbous base, and forced the slowing planets to rev into dazzling motion once more. The crow flapped his discontent. He growled down at the showman’s oxidized head, much to the crowd’s insipid delight. A mechanical band organ began to caterwaul across the thoroughfare, drowning out the crow’s curses.“Ah,” said Marx, pausing before giving the key a final firm twist, ‘the only sound more haunting than the calliope is the music of money changing hands, my friend.’ And with a pseudo-sincere wink to his partner, he turned on his heel and directed his attention to the burgeoning audience.Robin Marx hoisted his walking stick, jabbed it skyward to reinforce his ballyhoo. ‘The winner of the day will get the key to the midway, straight from my two hands!’ He flashed a large bank roll—a carny roll, thought the crow, or I’ll be buggered—and made sure to expose the cash reward for only the briefest second before squirreling it away in his waistcoat pocket.“Get the bird to release his bootlegged prize! Five pence a shot,” the showman cried.The crow made sure to tilt his head as Marx worked the bally; the golden gear winked in the gaslight, catching more than one poor sap’s eye. As his roost lifted him skyward, he scanned the faces milling in the throng below him. Tried to guess which unfortunate sucker would reveal hisself—for it always was a bloke—to be Marx’s front-worker.Could be him, the crow thought, as a stocky gentleman in a bowler hat disembarked from a locomotive rickshaw and stepped onto the midway. But he changed his bet as the skin show dames peeled away from the shadows, snagging the bowler hat and its owner with their lurid insinuations. [“Me they shall feel, while I am able to stand: and ’tis known I am a pretty piece of flesh,” sang the dames down the way.] He’ll be there for hours, the crow realised, or until his pockets (and other things) are sucked dry.Jupiter convulsed on its brass frame, lurching further upward. The crow over-compensated for this movement and pitched forward at a precarious angle. His tomfoolery earned a round of raucous laughter from the carnival anemones swaying on the polluted floor beneath him. As he regained his balance, he saw a frogman wobble his way out of the ale den four stalls down, ribbetting up his dinner and the keg of piss-weak beer he’d consumed on a dare. Next door, a seedy-looking weasel in patched plus-fours emerged from the sky-grifter’s tent. He slid across the frogman’s spew, leaving a trail of putrid footsteps as he zigzagged his way up the noisy thoroughfare toward Robin Marx’s stall.The weasel’s shifty eyes didn’t blink twice to see the team of spontaneously combusting phoenixes bouncing on rickety trampolines in the centre of the midway. His listless mouth didn’t so much as twitch toward a smile, even when a row of constructs whirled a metallic dervish for his pleasure and coin. No, the weasel had the expression of a man on a mission. He had a job that wanted doing, just as sure as Old Cranker’s sausages weren’t stuffed with bona fide cud-chewer.That’s him all right, the crow thought. That’s the shill.He watched the weasel’s stilted progress, humming a fiddley snippet one of the lads from Labrador had played while the caravan steam-rolled its way across barren plains the previous night. The crow tried to ignore the ornamental gear whose jagged spokes were doing their utmost to bash his beak into a less functional shape. Agonising moments passed; the crow’s eyes began to water; his ears felt downright clogged with the midway’s hubbub. Finally, the weasel stepped up and placed his grimy paws on the footprints Marx had painted on the cobblestones, no more than spitting distance away from the crow’s orrery.“Al-a-ga-zam, capper. Give the crowd a wave, and tell us your name,” said Marx in a voice as slick as the carnival’s boulevards.“Trouper,” said the weasel.“Well, Trouper, as I’ve just been telling these here folk, this bird’s a scoundrel of the nineteenth degree. That’s right: this rotten crow is flaunting stolen merchandise in his good-for-nothing beak. He pinched that gear right out of my pappy’s precious time-keeper”—he withdrew an unremarkable watch from his breast pocket and dangled it mid-air, just as he’d seen hypnotists do—“and now it’s ticked its last tock. Irreplaceable, that’s what this piece is. You’ve got to help me, Trouper! Help me get it back from that vicious crow so I can get my pappy’s ticker started again!”The crow pretended to bow his head in shame at hearing Marx’s accusations. He swept his wings up before him in a gesture of mock supplication—his least favourite part of the act—and in so doing deftly swapped the golden gear for a confectioner’s imitation while Marx explained the rules of the game.“The first shot’s always free, folks. Trouper, give it your best go. If you’re a real lucky son-of-a-gun, you’ll be the one to empty my purse after one sweet shot.” As if of its own volition, Marx’s hand stroked his waistcoat pocket while he spoke; and with each tender caress, the counterfeit bankroll bulged for all to see.The crow gripped Jupiter more tightly as the weasel drew a jacked-up slingshot out of his leather satchel. Trouper braced hisself. He cranked the miniature catapult until its arm was fully cocked and in assault position. He took aim, his furry finger extending toward the trigger on the slingshot’s wooden handle, and fired. Across the midway, a group of girls squealed as their teetering seats topped the Ferris wheel’s luminous peak; the crowd at Marx’s stall gasped as the slingshot snapped into action with an ear-splitting crack of released carbon dioxide.The crow mimed he’d been hit. He creaked his sooty wings around in comical circles, then swallowed the confectioner’s gear with a tinny gulp. The orrery shuddered to a halt. From beneath cracked eyelids, he watched his performance drain dollar signs away from the sea of greedy faces beneath him. He chuckled as he righted hisself on his now-stalled perch.“Take that, you old shit,” he squawked at Marx, ruffling his oil-slick plumage. “Try and get your precious gear now.”“You see, folks? You see what pain he gives me? Please—someone—anyone—step right up! Help me shut that miserable trap of his for good!” Right on cue, the bird started wheezing, hacking and choking, reeling the crowd in with faux suffering. He covered his beak with a wing—as all polite crows should do when they cough—and replaced the dissolved candy gear with its golden counterpart. Beams of golden light twinkled out of the crow’s mouth as the clean gear was reinstated, wedged between the upper and lower sections of his beak.The crowd fell quiet at Marx’s feet. A chorus of accordions droned down the midway; coal-burners roared with delight as they powered bumper cars next door; whistles sporadically announced winners all across the carnival’s crooked landscape; [“—yet I cannot choose but laugh, To think it should leave crying—” wafted out of the skin-tents]; but the group that had pressed in close to witness the crow’s imminent demise was shocked into distrustful silence by the weasel’s apparent failure, and the crow’s derring-do.Venus chose that moment to add insult to the audience’s injury. The rose-coloured globe, two prongs away from the crow’s own Jupiter, flared on the orrery with a sudden brightness that blinded the already mute crowd, throwing the midway into unflattering relief. Yet when the yellow-blue afterimages faded from the spectators’ eyes, their hands sprang together with gleeful applause. Tiny wind-up fireflies had escaped their Venusian cage: on Marx’s command, they buzzed into formation, their minute bodies spelling out ’Golden Guinea’ in a bewitching message of fortune.“Never fear, my friends. What did I tell you? Everyone’s a winner at Robin Marx’s.” The showman beamed with feigned magnanimity from his position on the stall’s counter. He released the hidden lever that had unleashed the automatic fireflies, and blew contented smoke rings from his hat as he coddled the ersatz pocket watch. “Yes, the crow’s still a crook, but good Trouper here shook him up a good one, didn’t he?” Catcalls and wolf whistles punctuated general expressions of good humour in response.“And as the Lady Venus wills, the Gentleman shall receive,” Marx said. A newly-struck gold coin instantly appeared in Marx’s hand, and disappeared just as quickly in Trouper’s. The weasel snatched the throwaway as if it were the first and last coin he’d ever see, then forced a retreat through the jostling herd now vying to knock the crow senseless.Mark after mark placed feet on painted footprints, squared their shoulders and threw—but none seemed blessed with Trouper’s luck. Children began throwing tantrums instead of projectiles. One sniveling whelp kicked up such a stink that Marx gave both boy and mother a few ducats to go and see the Marx Brothers’ Rocket-Powered Penny Farthings. This one tactical freebie was all it took; a deluge of 5p’s avalanched across the countertop, and into Marx’s purse.More stones were launched the crow’s way amid showers of minor coins; the first of these missed, but the latter staunchly met their target. “Sorry, matie,” Marx said to one sour-breathed contestant, whose chest heaved against his sweat-soaked shirt after another pebble hurtled wide of its mark. “Your robust bear-huggers are just too strong for this game! You threw that one so quick, I reckon an African cheeter couldn’t have caught it.”“C’mon, Marx. Give me a rehash. I’ll slip you a free strudel next time you come past my bakery,” said the blubbery man through his long mustachios. Marx walked behind the counter, tilted his bulk forward on the orrery’s concealed pedals, and said, “Tell you what I’ll do for you, matie: if you win on the next go, I’ll give you back every penny you’ve gambled. Guaranteed. Peg this wretched bird with all your impressive might and you’ll have more dough than you could ever knead at that bakery of yours.”Marx’s tongue kept flappin’ until he got his way; such smooth words never did the marks any good. Bitter smoke billowed from the street vendors’ burners, following the losers home. Nightwatchmen changed shifts, grunting salutations and beating billies against enhanced meat-hooks, as adrenaline levels bloated the carnival’s nihilistic avenues. [“To see now, how a jest shall come about!” laughed the dancing girls, “I warrant, an I should live a thousand years, I never should forget it—”] The disgruntled baker turned away from Marx’s stall, stuffing his remaining two guineas into a ragged pocket. He nearly tripped over the fox wheeling its way up to the target.Dressed in a chrome yellow top hat and matching damask suit, the fox was a dapper fellow, every inch a gentleman. The spiked wheels of his wicker invalid’s chair sought purchase on the midway’s greasy cobblestones; they skidded nauseatingly, and moved forward at an inchworm’s pace. No matter if it took until morning for his master to reach his goal, the fox’s kettledrum construct would not interfere. Only when he was contentedly puffing away on a mahogany pipe, his wheeled chair jauntily parked on the scuffed painted footprints, did the housebot approach. He draped a Burberry rug across his master’s immobile copper knees, tucking it gently between the chair’s arms and the fox’s atrophied hindquarters, then stood off to his left-hand side.The fox’s eyes never wavered from their prize as he asked the bot to analyse the odds of his winning this game.A slender ticker tape chugged out of a slit beneath the construct’s speaker box. He tore it against his serrated teeth, and passed the results over to his master. “Immeasurably in your favour. As usual, Sir.”“Hey there, cowboy.” Marx rearranged his features until they imitated a passably charming grin. He released a burst of steam from his top hat as he spoke.The crow eyeballed the fox from his lofty perch. Those who balanced on wheels instead of legs were such simple targets. Weaker than children, and less confident. “Come have a go,” he said, flicking the gear to the corner of his beak and projecting his voice for all to hear. “In fact, what’s say we give him TWO goes for free, on accounta his poorly condition? Don’t that sound fair, Robin?” he asked, seeking and receiving the showman’s nod.The fox tapped his pipe on the chair’s padded arm, watched its sticky contents combine with the sludge lazily seeping around his wheels. [“—let them measure us by what they will, We’ll measure them a measure, and be gone. . . . ”] He flicked a shred of tobacco off his lap, and gently cleared his throat.“Indeed, I will take two shots, as you’ve so kindly offered, Mr Black,” said the fox.It took a second for the crow to realise the fox was addressing him. Not ‘bird’, not ‘jackdaw’, not ‘scoundrel’, no. He was Mr. Black.The fox feigned interest in the kaleidoscopic projections whirling around Marx’s tent while the crow fluffed and preened his feathers.Then he opened fire.“Shot the first: a question. How did such a magnificent creature—genuine Corvus corone, pure flesh and bone, not a single enhancement—how did such a miraculous being come to be shackled and used as a cyborg’s lackey?”The crow spluttered, and nearly swallowed the gear in earnest.“Shot the second,” the fox continued, undaunted. “An offer. Work for me.”The crow cocked his head, and waited for the punch line.“Let me set the terms,” said the fox, “for I am sure you will find them suitably appealing.”“First,” he said, “I will prohibit you from participating in any specimen of show—even though it would be an absolute delight to hear your dulcet tones raised in song, Mr Black, old chap.”“But, no. No singing today. Instead, I would like to employ your golden sense. What does Mr Marx pay you? Some flattering mirrors in front of which you might preen? Perhaps some chymical bird-feed?”The crow kept silent.[“True, I talk of dreams,Which are the children of an idle brain,Begot of nothing but vain fantasy . . . ”]“I will offer you a gentleman’s fare, Mr Black,” the fox continued, quietly. “I am not interested in paying carny’s fees for such a one as you are. Sneer all you like at the term, Mr Marx; you cannot deny that you have treated this dark angel as nothing more than a lowly carny.”“I need a partner, Mr Black, for a somewhat more lucrative . . . oh, let’s call it a venture, shall we? Your guile, your cleverness, your wit: these are exactly the assets I need for this undertaking. You are far too intelligent for this braggart’s show! In fact, the show’s very success hinges on your intellect. Don’t think I didn’t see you exchange the false gear with the real, earlier—”—the crowd stirred, grumbled as they fondled their weightless pockets——Marx fumed, “That’s enough out of you, cowboy—”“—indeed without your finesse, there would be no Robin Marx! And how does he repay you? By tying you to a moldy planet and shoving a gear down your gullet?”[“Ay, while you live, draw your neck out of the collar . . . ”]“What horror will he perform next? Are you a crow, Mr Black? Or are you a soiled dove, blackened much as this city has been of late, by too many trips up Marx’s sooty arse?”The paralytic’s got a point, thought the crow.He spat the gear out, propelling it with fury, loosening his tongue to ingratiate hisself to his new employer. The crowd dispersed like exhaled smoke. [Ladies, dames, raised their voices, ” To move is to stir; and to be valiant is to stand; therefore, if thou art mov’d, thou runn’st away . . . ”]The tiny gear negotiated a haphazard path across the cobblestones, before spinning to a halt at the housebot’s burnished feet. Before Marx could shift his frame off the counter, the bot had dropped a silk handkerchief onto the gear, collected it, and polished it properly. Then he lifted his master’s damask coattails, exposing the clockworks inset in his narrow russet back.Half of the works were still, while the other portion whirred out their quotidian functions. The bot gently laid the gear into the fox’s lower back, and used his index finger to screw it into place.“What do you want me to do, boss?” asked the crow, his eagerness to escape the ramshackle orrery hanging like a painful chandelier from his brief question.“Why, you’ve already done it, old chap,” said the newly mobile fox as his lower legs sprang to life. “You really have done it!”[“O, Wilt thou leave me so unsatisfied?”]Yipping like a newborn pup, the fox switched his tail into overdrive. He sprang out of his redundant chair, blew the crow a grateful kiss as he sped past, fleeing the scene before he could get slicked.[“What satisfaction canst thou have to-night?” chimed the sideshow dames as the Johnnies were ejected from their parlours. The women’s laughter was harsh and raw.]Lisa L Hannett hails from Ottawa, Canada but now lives in Adelaide, South Australia—city of churches, bizarre murders and pie floaters. Her short stories have been published in Clarkesworld Magazine, Fantasy Magazine, Weird Tales, ChiZine, Shimmer, Steampunk II: Steampunk Reloaded, the Year's Best Australian Fantasy and Horror (2010 & 2011), and Imaginarium 2012: Best Canadian Speculative Writing, among other places. She has won three Aurealis Awards, including Best Collection 2011 for her first book, Bluegrass Symphony (Ticonderoga), which was also nominated for a World Fantasy Award. Midnight and Moonshine, co-authored with Angela Slatter, will be published in 2012. Lisa has a PhD in medieval Icelandic literature, and is a graduate of Clarion South. You can find her on Twitter @LisaLHannett."}