{"fingerprint": "92+W2yD5i0TqEy6zqd6kclfeAn4=", "sitename": "Clarkesworld Magazine", "title": "Reversion by Nin Harris", "author": "Nin Harris", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/harris_08_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Reversion by Nin Harris", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6680 words, short story\nReversion\nFamily gatherings are mandatory for three reasons in the annals of Tamilian life either on Rig-VII or on its sister planet, Psychereon. Weddings and funerals were a given. Reversions, however, were rarer occurrences and Aakriti had never attended such a ritual.\nAakriti was on shore-leave, after serving six months on an oil-rig in the middle of Ocean Alpha-Two as a senior rig engineer, a fortuitous time for a family reunion and for the wedding of her brother. Earlier, she had endured a polite reunion with her immediate family members, and her extended family members on the planet. It had been painfully strained but not as unpleasant as her first reunion with Auntie Rukumani after she had been extracted from Tortz in wailing, dejected despair. Chill pebbled her skin, which was already chafed by the silver-beaded choli. The saree was draped over a chair, a deep indigo silk embroidered in silver thread with silver beads and tiny mirrors sewn in. A soft fuchsia and indigo shawl would be draped over the three-quarter sleeves of her choli once she was dressed. She would have to put them on soon, Aakriti thought as she walked reluctantly to the chair.\n“Do you need help getting into that saree? The ceremonial pleats can be such a bother,” asked her cousin Vashti from the bed where she was reading the news from one of the bubble readers that bobbed up and down with the movement of her head.\n“I still remember how to do the ceremonial pleats, Vashti,” Aakriti answered as she rubbed her hands up and down her pebbled forearms.\n“But you just don’t want to wear it, do you?” Vashti pushed the bubble reader away and watched as it bounced off one of the walls. “Aakriti akka, you don’t really have to go through with the Reversion, you know? Not all of us agree with what the elders want. Don’t you miss being Aakavi?”\nAakriti shrugged, “I am not sure if I know what it means to miss that. I only know that I will be better off without the dreams.”\n“You were always my most interesting cousin, Aakriti akka. Especially because you didn’t care what anyone thought about you. Just going off like that, running away from engineering. Becoming Aakavi.” Vashti’s voice was half-envious, half-sad.\n“That was another life, Vashti. Literally another life.”\n“You were happy, weren’t you, akka?”\nAakriti pursed her lips. “I’m not sure happiness even came into it, honestly. It was just something that felt right, like finally finding gravity-adjustment gloves that fit.”\nVashti asked, “Look, akka, not all of us . . . ”\nAakriti cut her off, appreciating the concern, but not able to endure it. “Look, I will probably need help with the back and front folds of the saree, so yes, let’s get this on me.”\nVashti gave Aakriti a quizzical look before getting up, her limbs all elegant languor. Working from opposite ends of the cloth, the cousins made the elaborate pleats that were customary of the Ruling Families of Rig-VII as they wound the cloth around Aakriti. Aakriti had been taught this art on her fifteenth birthday.\nOnce she was dressed, Aakriti poured herself a glass of water, while Vashti retreated back to her chair. Aakriti stared out of the window. As far as fuel planets went, Psychereon was rather idyllic, possessing a shoreline of soft, powdery crimson sand, beachside towns with casinos and spiritual retreats. Viridian green waves lapped with ominous avarice against the glittering red sands of the shoreline, licking swathes of barnacle-encrusted rust upon dark metal pilings of tall, lonely oil rigs that loomed far out beyond the safe waters of the harbor.\nPsychereon was nicknamed “Double Trouble” amongst off-planet engineers and drillmasters because currents existed both on the ocean and in the sky. The polarity of the planet played havoc with the movement of the wind and of the waves, causing the drilling of precious oils and gasses to be more challenging than on most fuel planets. The oil rigs had foundations that were drilled deep into the ocean bed, and they were fortified on all sides with flotation platforms positioned to ensure stability within flux. The currents of the planet were further complicated by the two satellites in the sky and their relative proximity.\nClimate-wise, it was far from being the safest planet in the solar system. The inhabitants had simply learned to adjust.\nThe silhouette of the oil-rigs resembled neglected ancient cities once inhabited by the crane people who existed in the autochthonous mythologies of Rig-VII. Growing up on Rig-VII, Aakriti had been taught the stories of the crane-people along with those of the Vedas, the Mahabharata, and the Panchantantra. The crane people had existed long before the Tamilian fleet of spaceships had settled on Rig-VII. The crane people walked on legs as long as stilts, and had wings on their backs that transformed them into seafaring birds. The crane people possessed a powerful folk fetish system, and were equipped with a capacity for re-invention that Aakriti had envied.\nMore than anything in her teenhood, she had wanted to be a crane person, she had wanted the ability to change, to re-invent, to be a different person. When her child was born, she had constructed a mobile of sorts for her young, even if the nursery was underwater, for Tortzian young were amphibious in later life, but wholly reptilian upon birth.\nPerhaps she had been a crane person of sorts on Tortz.\nPerhaps if she had remained there, she would have been happy, would have merged into the lives of her mate and their offspring. Perhaps she would have stopped speaking Intergalactic Lingua or Tamil. Those languages were not necessary in a world where she could be stripped of all usual ways of communication, except for the one that lay in the heart of underwater undulations which penetrated her dreams with the memory of squidgy, ridiculously expressive tentacles caressing her sensitive skin and impaling her with far more depth and flexibility than anything she had ever experienced.\nHer throat clenched like the fists at her sides at the memory.\nIt was getting colder.\nHungrily consuming the rays of the sun, the solarglass façade that shelled the serviced condominiums for the Double-T conglomerate powered the individual units allocated to their officers and engineers on shore leave. Aakriti kept two of the walls of her apartment curtained, obscuring the view of the dark green ocean, and the oil-rigs. Overhead, a lone mini container airship bobbed, buoyed by the currents of the skies, further agitated by the late afternoon grazing of the Zirafahs on the umbrella trees native to the planet.\nOn Tortz, Aakriti had been Aakavi. She had dressed often in tuxedos. She learned mathematics by day, and drove tourists to the edge of half-sleeping volcanoes at night. As Aakavi, she learned how to make, string, and play a zither, officiate at impromptu wedding ceremonies, and how to read the script of the Tortzians, the tentacled inhabitants of the planet Tortz, who loved their epic dramas and trashy pulp romances that sold as bestsellers to every solar system in the Conglomerate.\nAakavi had a daughter with Vazakh, a Tortzian engineer on that planet, participating in the ritual of marriage and the mingling of their DNA in one of the Holy Procreation Labs. This was a scant half a decade before she was transferred mandatorily out of Tortz, along with the rest of the humans, leaving her part-reptilian, part-cephalopodic mate and their hybrid offspring behind. When she had returned to Rig-VII, the matriarch had ordered Aakavi to revert back to Aakriti. She fought a long battle against it with their family but soon resigned herself to the inevitable. There did not seem to be any way back for her. All modes of communication back to Tortz had been closed, even though she still dreamed about her spouse and their life together before their enforced separation.\nThe first time she had met the multi-faceted eyes of her mate, Aakavi had partially recoiled at the difference. It had not been a marriage of passion, but rather an anthropological experiment carried out by human researchers on Tortz. The Tortzians did not identify to their bodies the way the humans identified to theirs, most of the time. It was easier to slip in-between identities, to become comfortable as just Aakavi, without the pronouns that defined her life on Rig-VII. She had agreed to the union in part because she thought that understanding Tortzian physiology would help her understand herself.\nIt was to be a celibate union. Most of the couples had opted for that, as had Aakavi and her mate. The mingling had been achieved by both parties pressing their thumbs to a panel that processed their imprints and created an embryonic environment for the development of a fetus. They had lived together in a comfortably accoutered Tortzian pod.\nTheir physical union came only after their child was two years old, another action recommended by the Society, for the more adventurous and curious. They were provided with carefully annotated diagrams about methods of insertion and pleasuring. They went at it carefully at first, and with more enthusiasm and derring-do towards the end of their married life, right until the point where the project was halted by the Galactic Union’s newly appointed President as an abomination against human nature and biology.\nThe Matriarch of the Kanapathy family was a slender scientist wearing a dark blue saree upon which the neighboring constellations were embroidered. Professor Rukumani’s eyelids were expertly filled in with color behind her owl-rimmed eyeshields. Vashti stood beside Aakriti, almost protectively. Rukumani waved the younger woman away and looked at Aakriti in the same way that had made Aakriti feel ashamed ever since her return from Tortz. Aakriti flinched from that gaze, her insides curdling.\n“The saree becomes you. You look like your mother,” was Rukumani’s terse greeting, before she embraced her niece in a gingerly manner.\n“Thank you, Auntie Rukumani,” Aakriti’s voice was dutiful in a lifeless way. Vashti raised her eyebrows at that, but Aakriti shrugged helplessly. What else could she do?\n“Your mother would die again. She would die thirty times if she knew how you’d allowed your body and your womb to be defiled, Aakriti. Defiled!”\nBeside her, Vashti sighed in annoyance. They had heard many iterations of this in the past week, and in the weeks after Aakriti had been extracted from Tortz.\n“Oh, come off it, Rukumani. Aakriti is not the only person in this family to have indulged their curiosities about interspecies sexual unions. Or have you forgotten, hmm?”\nAakriti looked up, startled, at the booming new voice. It was Cousin Sharanya, the Holy Sage that she had been introduced to earlier that day, the one who was to officiate her Reversion Ceremony two days after her brother’s wedding.\nSharanya said, “We’ve all dabbled in much wilder activities in our youth, Aakriti. Don’t let your Auntie hoodwink you into believing otherwise. Or have you forgotten how we had to pull you away from your Zeta Alpha II lovers?”\nRukumani’s features were wrought in a mask of consternation, the effort of pulling her composure back together visible in the tautness of her neck and the cast of her jaw. She said, “Have you had far too much toddy to drink, Sharanya? You are sounding rather unhinged.”\nSharanya snorted, her white eyebrows raised. “No. But I make it my work in this dimension to shatter illusions, and our relative has choices to be made before she performs the Reversion.”\n“Choices, what choices? She has to follow what is dictated by the tenets of our faith and culture!” Auntie Rukumani said, her voice booming and causing nearby cousins to flinch into themselves.\n“The sounds of one who protests too much is grating upon my holy ears,” Sharanya retorted, “my Holy Sage ears, might I remind you.”\n“Bother that!” Auntie Rukumani snapped, her head reared back as though in preparation for another tirade.\nAakriti uttered a small sound of distress. Sharanya nudged Auntie Rukumani aside to hug her cousin. “The Reversion Ceremony is not as frightening as you think it is, Aakriti, or Aakavi, if that is your preference,” she said, looking squarely at Aakriti before winking.\n“I can promise you this—it certainly will not be what your Auntie hopes it to be. When we connect to the center of who we are, we make choices about how we want our connection to be. I made that choice during my reversion. In fact, the person who never went through a reversion, was your fantastic Auntie here. But we know all politicians are hypocrites, huh?”\nAuntie Rukumani gasped and then quickly walked away from them, her shoulders stiff in affront, or embarrassment. It was hard to tell from the back, Aakriti thought, even after all of these years.\nWhen Aakriti had been a toddler, Professor Rukumani had been a doting Middle Aunt, a gentle scientist who slowly taught her charge the fundamentals of both biology and chemistry. She paid for the girl’s education after her parents had perished aboard a space station during a freak accident. This changed after Rukumani became first Professor Rukumani on Rig-VII’s University of Intergalactic Sciences, and then Vice-Chancellor. She started to spout party hard-lines, and became a member of the Tricolor party, who managed to get their candidate elected as the President of the Galactic Union. Aakriti often missed the woman her aunt had been, but there was no reversion for aunts who had grown into terrifying politicians. Aakriti uttered a shuddering sigh, and said to Sharanya, “Thank you, you have no idea how much I needed that.”\nSharanya gave Aakriti an impish smile, squeezing her shoulders, “I understand, my dear. Don’t worry, it won’t be as bad as you think, the Reversion. Trust me.”\nShe winked before walking away from Aakriti towards the betrothed couple. Her brother was dressed in a long shirt of gold silk with matching gold and white salvai and vesti. Aakriti gave him a half-hearted wave which he returned in the same gingerly manner of her aunt. She recoiled from the revulsion in his eyes, and wished she didn’t have to attend his wedding ceremony.\n“Leave him be, akka. Once he’s married you don’t ever have to see him again,” said Raehan, Vashti’s elder brother. His eyes upon hers were filled with a milder curiosity than Vashti’s.\n“That much is true, but that isn’t a wish one wants to have about one’s own siblings,” Aakriti said in a sad voice.\n“These things happen. Look, Rajesh has cut off ties with our family, and none of us have been as exciting as you. We lost our sibling because he married someone from the Kumaran clan. If it’s not kinky alien sex, it’s an old business disagreement. That’s the human way.”\n“Well, there you go. I need to be purged so I can be human enough to have silly feuds with other humans,” Aakriti said.\nRaehan’s laugh was rueful. “I’m sorry you have to go through this, akka. If you wanted to fight against it, you know we have your back, yes?”\n“You’re a good man, Raehan. I appreciate that. But, I’m going to need some time alone, if that’s alright?” Aakriti said.\n“Of course,” Raehan said, his voice warm. He squeezed her shoulders, much in the same way as Cousin Sharanya did.\nShe supposed shoulder-squeezing was one of those human things she had forgotten how to do. Aakriti retreated to a sofa hidden behind a landscaped indoor feature to wait for everyone to move towards the ceremonial hall. She peeped at Auntie Rukumani, who had wasted no time engaging the president of the Double-T conglomerate in conversation. Her boss, Aakriti thought in despair. Her life was a carefully controlled prison, and she had lost the strength, spirit, and adventure she possessed as Aakavi. She felt different. She felt fake.\nEvery now and then, she dreamed of Vazakh. The union was not one of love, but in the waters that they inhabited together, their entire selves cohered. Her dreams were thus of loss, and of a deep longing that went beyond bodily impulses.\nThey had to mate in the water, or the friction would have killed Aakavi. In the water, the scaled tentacles became malleable, porous, yet slick with lubrication. The suction pads that attached to her limbs provided pleasure that Aakavi had never associated with those parts of their body. Once the couple had grown used to it, their eyes would meet, and understanding began. Language happened, and with that knowledge, a connection so deep that this separation felt like a starvation of the spirit.\nWhen Aakriti neglected to talk about the sexual part of the union with her curious cousins and siblings, she was not protecting them from the knowledge of the potential for pleasure that lay within the violet streaked pearl of her partner’s tentacles, lightly scaled on the topside, silky and gelatinous on the underside. What she needed to conceal was the language that had changed them both. That language had cleaved open her mind, and had allowed her to communicate with Vazakh at a deeper level than previously possible. The gift of language allowed her to understand es dreams, as e projected thoughts of concern and caring about their child, and es desire to have more children.\nAakavi began to understand deeper the romanticism of the Tortzians, outside of the artificial languages the Tortzians constructed with mechanical communication devices. What she learned was the Tortzian Deep Language. And with that knowledge, everything had changed.\nAakavi’s fluctuation in-between identities had meant less than nothing to Vazakh. They were all the same to em, who only understood the curious warmth and heat of the human body, so much heat that occasionally, when they rubbed up against each other outside of a liquid medium, Vazakh’s scales began to drop off. The Tortzian Deep Language was as liquid and as natural as love was, even love that blossomed as an afterthought.\nNow, even on a planet that was mostly ocean, Aakriti was always thirsty. That thirst caused her to leave her comfortable seat in search of drinks. She filled a tall glass of water from one of the water pitcher tables and drank as she circled people. Some averted their eyes, and others came up to her to make summary small-talk. The liquid slid down her throat with the slight murky unease of memories. She refilled the glass from another pitcher before following the rest of the guests towards the temple that was located on the northernmost side of the courtyard. Her cousins went first, and then her siblings and her aunt. She brought up the rear and was one of the last to bless the thali laid out on bronze trays.\nInside the temple, the priest was waiting beside the open flames of the holy fire, waiting to officiate and to perform the Ganesha Puja. A gold statue of the elephant god graced the northernmost wall of the temple, almost taking up the height of the peacock green wall. Upon it, elaborate miniature scenes of Ganesha’s life as a child in the celestial gardens of his parents were painted in gold. Aakriti clutched at her necklace of gold and walked in brittle footsteps towards the side of the dais where guests sat on allotted chairs. On the dais, her cousin led his bride around the holy fire as incense rose up in the air. Beside the officiating priest, Cousin Sharanya stood, regal in her pristine white robes. She inclined her head at Aakriti, her eyes indicating understanding.\nReversion meant re-integrating with one’s culture after contamination with an alien culture. It was a backlash against the various interspecies experiments conducted by the Society of Interplanetary Anthropologists, now disbanded and excommunicated from the Galactic Union for their collaboration with the Holy Procreation Labs. Reversion included witnessing this wedding and other ceremonies. Reversion included immersion, and a pledge to honor her ancestors and her customs. She did not know much else beyond that. It was not an Earth-originating ceremony, but one created on Rig-VII to ensure cultural purity, a ceremony that ensured that centuries since they had settled on this solar system, certain customs remained constant. At least that was what Auntie Rukumani had told her. But Cousin Sharanya had planted a seed of doubt in her heart.\nThe golden moon dropped low in an aquamarine night sky as the indigo waves crashed upon the beach. Soon it was joined by its twin, a rust-colored satellite that cast orange patterns upon the waves. Aakriti watched the oil-rigs in the distance until a disturbance on the beach caught her attention. There were lights flashing on the beach, and a strange glow as a vessel rose up from the waves. Her curiosity piqued, Aakriti threw on a caftan over her sleeper’s jumpsuit, and put on her shoes. She pulled the hood of the caftan over her head and pressed her palm against the hermetically sealed door, stepping back as it softly whizzed open. She then padded down the carpeted hallway and entered the tube-lift. Gaining the ground floor and the entrance, she ran towards the beach, curious about the lights, desperate for any diversion against her thoughts, and her dreams.\nBy the time Aakriti reached the beach, only the two moons of Double Trouble illuminated the sands. The vessel had gone, as had whomever was receiving it on the beach. The waves looked warm and placid. It was a nice time of year for a swim. Aakriti divested herself of her clothes and waded into the waves for a strong swim around the bay.\nAs she cut through the waves in sinuous strokes towards Diamond Beach, she noticed light beneath the water. She dove beneath the waves. A small submarine seemed to be following her. She swam towards it. The submarine stopped, and then started moving in the opposite direction. Aakriti gasped and moved upwards to breathe. Above her the twin moons illuminated the dark green waves with golden-and-rust-colored light. Aakriti gulped in air before she dove beneath the waves again. The submarine was gone. There was no sense in wasting time, she thought, even though her heart was filled with a sudden, insane hope. Around her, the waves rippled and undulated in the rhythms of the Tortzian Deep Language.\nAakriti sobbed in surprised longing.\nThe winds surged and ebbed around them, almost like a sentient force. The winds were always stronger in the afternoon because of the aerial cross-currents. Occasionally, when the winds blew too strong, it was not unusual to see someone toppled off their feet and bobbing around on the ground like an oversized translucent beach ball. The suits were effective, but they were far from efficient. Vashti yelped and ducked as a lividly purple fruit dropped nearly a hundred feet near them. The cousins stopped as the earth beneath them shook. Not all of them were used to the ways of the veldt. Aakriti had taken them out on a short field trip the week before but that had not been nearly enough to acclimatize them.\n“Press the ‘repel’ button!” Aakriti barked at her cousins as she pushed her own button on the hiking suit. They followed her lead and they were soon all bobbing together within their own security bubbles of force that protected them from the fruit.\n“This planet is ridiculous, what made you decide to live here?” said Raehan through the microphone inside his helmeted suit as he bounced against the ground in his bubble.\n“This was as far as that leash Auntie Rukumani has around my neck could extend. Where else would I go?” Aakriti’s answer was matter-of-fact, but everyone fell silent on the communication channel. She felt rebellion in their silences, and knew that all she had to say was a word. A single word. And they would. If she only asked them. She shook her head and urged her cousins onward.\nThe impact of the umbrella fruit caused there to be small craters everywhere on the grassy cover. Within the craters, tiny spores that lived caught on the furry skin of the dense fruit blossomed into mushrooms, therefore ensuring that each time the long lipped Zirafahs pulled sweet leaves off the tops of the umbrella trees, the veldt was assured of the survival of both the trees and the red-topped mushrooms. The umbrella trees predated the arrival of humans, but the Zirafahs had been introduced by them to modify the ecosystem, and to ensure there would be enough oxygen for a livable climate. There were many unexpected benefits to the bio-engineering of the giraffe specimens in their bio-banks.\nThe species named after the giraffes of Earth were several times the length and height of an ordinary giraffe, but in dimensions and shape, they were almost similar. Nobody messed with the Zirafah, they were the natural pruners of the trees, and the fruit that dropped to the ground from the tops of the trees during their mealtimes had an armadillo-tough skin, with a fuzzy fur covering. The long drop would crack the skin—and the bodies of any hapless travelers, to reveal a soft, gelatinous yellow fruit which provided sustenance for the inhabitants of Psychereon.\nThey had no time to reflect upon Psychereon’s peculiar ecosystem as they struggled against the winds. There were pauses, moments when it was suggested that her cousins were ripe for an adventure. She thought about Cousin Sharanya’s words. Something made her press on until they reached the Old Elephant Temple.\nReversion required no less than thirteen rites of ablution carried out in thirteen different pools found in the Old Elephant Temple. Each pool contained a cocktail of different chemicals and water, intended to purify the body and to cleanse it of any residual alien spores. Next came the drinking ceremony, meant to purge any alien toxins out of the blood. Part-superstition, part-biology, and partly a constructed devotional to fit a new time, the act of Reversion lasted nine hours. By the end of it, Aakriti could be pronounced fully human again.\nIn the first pool, Aakriti allowed herself to be fully submerged in water that felt and tasted like herbal jelly.\nIn the second pool, the liquid was unbearably ticklish against her skin and her throat tightened as incense wafted through the space and her cousins threw flowers on top of her head.\nBy the tenth pool, her skin, and the beige saree she wore were streaked with color in frenetic striations that overlapped and clashed with each other.\nFinally, at the thirteenth pool, Aakriti started to hallucinate. This pool was filled with pure water, water that contained the same alkaline content as the waters of the Ganges on a long-destroyed Earth. As she plunged, her long-hidden bio-implanted gills finally feathered open, allowing her to breathe underwater. She opened her eyes, startled at the re-awakening of a self she thought she had left behind on Tortz.\nAuntie Rukumani is going to be so disappointed, she thought to herself, even as reality ruptured and she dissolved into the Tortzian Deep Language that crammed every molecule of the holy water. Before she could sink further, muscled arms pulled her out, and she could hear people screaming in the background.\n“If she dies, I’m holding you accountable, Auntie Rukumani,” yelled Vashti in outrage.\n“Aakriti akka? Akka?”\nShe tried to let them know she was fine, but found that she could not open her eyes, nor talk. She sank back into the embrace of sleep.\nWhen she regained consciousness she was on a bed, with tubes connected to her.\nVashti was asleep on the visitor’s couch that hovered next to the hospital bed. Aakavi sat up slowly, surprised to discover that she could actually move, and that her muscles were not as rigid as she had been expecting upon awakening.\n“I’m here, I’m awake,” Aakriti said.\n“You frightened us. You wouldn’t move, and there was a small whirlpool happening in that thirteenth pool.”\n“Was that when I passed out? Because I remember that happening very differently.”\n“The doctors said that the different chemical compounds used in the pools reacted differently to the atmosphere of Psychereon. This is the first time the full Rites of Reversion have been practiced here, and they didn’t do a proper biochemical test. Someone else said that the pools had been,” Vashti took a deep breath, “ . . . tampered with.”\nAakriti softly cursed beneath her breath. “So it wasn’t supposed to have hallucinatory qualities?”\n“Were you on a trip?” Vashti asked, her eyes now dancing with amusement.\n“It was a pretty good trip, I must say.” Aakriti chuckled weakly before a coughing fit stopped her.\n“What happened to my . . . ”\n“Oh, I’m so sorry akka. The chemicals affected your lungs. The doctors said you’re going to be asthmatic for life now.”\n“Fantastic. I wonder how my employers will take that.”\nA full bill of health and fitness was required to work on the oil rigs of Psychereon.\n“Auntie Rukumani’s already talked to them, akka.”\nVashti’s tone of voice told her the news was not good.\n“Am I fired? That was fast. Didn’t I just . . . ”\n“It’s been a week, akka. A week while the doctors worked on you. They found your gills. How did they miss it the first time?”\nAakriti waved her hand, “It was a procedure done on Tortz. My . . . mate paid for it, to conceal my changed attributes so I would be protected.”\n“I guess it didn’t work, huh?”\n“Well, whatever the chemicals were supposed to do to restore my humanity, they failed. I’m now back to being what I was on Tortz, I suspect. Even the lungs.”\n“The lungs, akka?”\n“I’m not asthmatic, really. I’m just amphibious, and my lungs had been modified so I could breathe underwater. It was the shock of the transformation that probably knocked me unconscious. That and whichever buffoons ripped me out of the water.”\n“That was Raehan and Devin pulling you out. They didn’t know. We didn’t know. Does this surgical transformation mean you’re a mermaid now?”\nAakriti laughed.\n“I don’t think I’m mermaid material. But what else is supposed to happen to me now, Vashti? What’s Auntie Rukumani planning?”\n“They’re taking you home to have our own scientists study you, remove the implants and then have the Reversion happen in the right circumstances.”\n“Shit!” Aakriti cursed.\n“That’s what I thought you would say. Or rather, I thought you would say something stronger, akka.”\n“I’m not leaving Psychereon,” Aakriti said firmly.\n“But,” Vashti protested.\n“No! And what’s more, you’re going to help me.”\n“Help you? Now? We would have put a stop to it earlier.”\n“Yup. Now. I’m finally taking you up on your offer. All of you. Sorry it took so long, I’m sure I should have done it sooner but . . . ”\nVashti said, “Offers of help don’t come with deadlines or time limitations, akka. Doesn’t work that way. Or it shouldn’t. Wait for a while, I’ll call my brothers.”\nAakriti was not the sort of person who could patiently wait. Slowly, she considered the tubes that were attached to her. She removed them one by one before carefully standing. They had left her nice bedroom slippers. She put them on gratefully and then started shuffling slowly across the hospital room she had been given. It was rather luxurious, she thought. Far more luxurious than her own quarters. She supposed there were perks to being her domineering Auntie’s niece and ward. She moved back to the window. They were ironically closer to the ocean here at the hospital, which was built next to one of the biggest waterfronts in the city. People got into fights at the casinos, an orderly had told her in a confidential tone the one other time she had been admitted here. The moons shone on the deep green waters of the ocean at night.\nAakriti remembered all of her midnight swims in that ocean, and recalled the careful notes taken by the marine biologists who had initially traversed the oceans of the planet. There were no monsters in the deep on Psychereon. The sea life was generally considered to be harmless. Which is not to say the oceans were not without danger, Aakriti supposed. She briefly fantasized about exploring the oceans at a deeper and more immediate level than any of the marine biologists had been able to attain.\nShe looked up as her two burly cousins entered the room, following a determined Vashti who brought clothes, a silver duffel bag, and a hiking suit. All three of her cousins had garbed themselves rather prematurely in those hiking suits.\n“Those suits are not needed,” Aakriti said briefly as she walked towards them.\n“Why not? Aakriti akka, are you okay? If we’re going to get into trouble with Auntie Rukumani this had better be worth it,” said Raehan.\n“I hope it will be, for me at least,” Aakriti said, while she allowed Devin to examine her gills. She remembered that he was a medical doctor. A specialist, even.\n“Were you the doctor who examined me earlier?”\n“Afraid not. I have no jurisdiction on Psychereon. But you do seem to be stronger than claimed by that doctor. Open your mouth?”\nAakriti opened her mouth obligingly as Devin peered in.\n“Hmm. Interesting. I think reversion is wasted on you, akka.”\n“Now that is an interesting observation, Devin,” Aakriti said in mild tones as she stared at her curly-haired cousin.\n“Yes. See the thing is, you’re no longer human. It’s amazing the work that’s been done to help you blend in during the first twenty health screenings that took place after you voluntarily relocated from Tortz. But it’s nothing even our best doctors and scientists can change. You’re irrevocably a hybrid, a non-human.”\n“My relocation wasn’t entirely voluntary, Devin,” Aakriti said. “I was happy on Tortz before they ripped me away.”\nDevin looked uncomfortable so she decided not to press the issue.\n“So where are we headed anyway?” asked Raehan who had been quiet.\nAakriti moved back to the window.\n“Down there,” she said, pointing at the pier that overlooked the dark green waters that gleamed in the neon lights of the casinos.\nThey walked with Aakriti down to the beach. Devin and Raehan managing to get her discharged from the hospital with a combination of expertise and charm. She was going to miss her cousins, Aakriti mused with some surprise.\nBeyond the pier lay the boardwalk, and steps leading to the small pocket of red sands that was the beach.\n“Are you sure?” asked Raehan doubtfully as she began to take off her sweater and her top.\n“You heard Devin. I’m amphibious. No longer human. And I want this.”\n“Wanting is not the same as having, not always,” Devin.\n“That needs to change. That should have changed.” Vashti said, firmly.\n“I agree. And that’s why I need to do this. It’s for you as much as it’s for me,” Aakriti said.\n“Why is that?” Devin asked, as he carefully sidestepped a broken bottle in the grainy red sand.\n“So you know that you can have what you want. And you don’t have to follow Auntie Rukumani’s rules and modified rituals of our forefathers. If the traditional ways of our people make you happy, go for it. But if you need to fly like the crane people or swim like our Rig-VII dolphins . . . well, don’t be stopped. Auntie Rukumani knows less now than she knew before.”\n“She was great before she became a politician,” Vashti said, her voice sad.\n“That she was. But no good ever came from politics,” Devin said before he turned to Aakriti, deep concern in his eyes. “Aakriti akka. There’s just Ocean out there.”\nAakriti gave a sigh of longing, “I know.”\n“Auntie Rukumani will only find another way to retrieve you. There are submarines, you know?”\n“I know. Let her try. Let her fail.”\nDevin nodded, “Alright. Let’s do this.”\n“But we’re going to be leaving food for you underneath the pier every day, okay?” Raehan added.\n“Why the pier?” Aakriti wrinkled her nose.\n“Well, you’re departing from here.”\n“Leave it at Diamond Beach.”\n“You’re going to swim from here to Diamond Beach? That’s impossible!”\nWeary as she was, Aakriti chuckled. “I’ve done it before. I’ll be fine.”\nShe hugged her cousins awkwardly. “You might want to look away, I’m removing the rest of my clothing now.”\n“I wish you wouldn’t, it’s going to be cold,” Raehan fussed.\n“Not human anymore, remember?”\nFinally, they turned around. She removed the rest of her clothing and waded to the water’s edge. As she entered the water to her neck, she watched as they turned towards her.\nWith a wave, Aakriti dove into the water, and reveled in the feeling of her gills flowering at the sides of her neck.\nShe swam silently out of the harbor in smooth, steady strokes, even though she had been tired before. The fatigue left her as her eyes adjusted to the liquid darkness of the deeps, no longer illuminated by the light of Psychereon’s moons.\nThe submarine was waiting for her halfway between Casino Strip and Diamond Beach, and as she approached, a dark, tentacled figure swam out. Aakriti did not feel particularly surprised.\nSome rescue, she vocalized in the Deep Language as Vazakh reached her and took her palm in es tentacles.\nIt would not have been safe to venture closer to humans. I have our young on board.\nSure, make your excuses, Aakavi flung at em crabbily. Why did you run away from me the other night?\nI knew you’d be able to find your way back to us. I left enough clues in the water. In your dreams. And you needed to make your choice. If you wanted to be with your people, I did not want to stop you. Cousin Sharanya said to let you come around. She asked me to give her some Deep Language messages to pass to you, so I did. Did you get it?\nVazakh sounded hopeful. Aakriti laughed. If e only knew what the tampering of the thirteenth pool had wrought. And it figured that Cousin Sharanya could actually speak the Deep Language.\nYes, I got it, honey. But I wish you hadn’t run away from me like that. Her Deep Language emanated in disapproving swirls from her gills and her skin which was fast changing in the language-infused waters, becoming more iridescent, and less mammalian.\nBesides, our young needed a steady regiment or this relocation would have really upset them. They were not ready to be reunited with you.\nWell, tough. And they’re going to be upset anyway when we move back to Tortz.\nThe silence that imbued the water around her was now filled with the deep shame of Tortzian failure. She had learned enough of the language to understand that her mate was bracing for her disappointment.\nWait. Why are you quiet?\nThere’s no way to get back to Tortz, love. I got out just before the Tortzian Planetary Authorities sequestered the planet from the Galactic Union. We’re exiled for good now.\nThe sound-meaning of love was awkward in the vibrations around and inside her. It was the first time Vazakh had ever communicated that emotion to her. Aakavi wished e had not done so when e was trying to obviously tell her bad news but apparently that was what married couples did. She’d seen her uncles pull similar stunts at that, she mused to herself.\nAre you saying . . . ?\nYes. If her mate could sigh, she thought e would sigh. The touch of es tentacle was like a sigh. A woebegone sigh. Tortzians were so silly and so dramatic, she thought fondly.\nWe’re going to have to make a home here on Psychereon, love.\nAuntie Rukumani will be so overjoyed to know this, Aakavi said sourly before she allowed her mate to embrace her with all of es squidgy, apologetic tentacles, even the one that brought her lavish amounts of indecent pleasure. Especially that one.\nNin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee."}