{"fingerprint": "iTRBz+WlaYHz3Qfds8J0q61df+8=", "sitename": "Clarkesworld Magazine", "title": "Moonage Daydream: The Rock Album as Science Fiction by Jason Heller", "author": "Jason Heller", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/heller_06_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Moonage Daydream: The Rock Album as Science Fiction by Jason Heller", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Moonage Daydream: The Rock Album as Science Fiction\n Rock ’n’ roll was never intended to have a future. Hot, fast, loud, bright: the genre was made to be as disposable as the chemically-fueled rockets that had started putting objects into orbit just as rock was getting off the ground in the ’50s.\n It’s perhaps more than coincidence that the song generally considered to be the first rock ’n’ roll tune was titled “Rocket 88”—a scorching instrumental by Ike Turner that, granted, was ostensibly an ode to an Oldsmobile. Still, even today the song takes off in a burst of fiery glory, one that most listeners back in the ’50s surely assumed would destroy itself in a puff of faddish obsolescence.\n Of course, what “Rocket 88”—and rock ’n’ roll in general—really did was this: open up a jagged, flaming path into the world of tomorrow.\n Science fiction served a similar purpose in the ’50s. Having vaulted from the fringes of pop culture into the mainstream after a newly atomic America became obsessed with films about mutants and aliens, SF literature matured and flowered throughout the ’60s and beyond, just as rock ’n’ roll did the same. It was inevitable that the two would mix. And although plenty of random rock songs in the ’60s were fixated on SF themes—including The Byrds’ “Mr. Spaceman” from 1966 and “Space Odyssey” from 1968, not to mention Pink Floyd’s groundbreaking “Set the Controls for the Heart of the Sun,” also from 1968—it was David Bowie’s “Space Oddity” in 1969 that really sealed the deal.\n Of course, Bowie would also be the artist to put the SF concept album on the map in the ’70s. Full albums, after all, are much better vessels for SF’s sprawling tropes. Since then, some bands have tried making bona fide, SF rock operas. Less ambitious groups have settled for loose concepts—many dystopian—for songs to revolve around. And some simply use the flash and fantasy of SF as a backdrop to their own warped vision of the future.\n Below are a few of the most intriguing SF-themed records launched at the unsuspecting public since Bowie made his first foray into the concept album. While many rock albums—like The Alan Parson Project’s I Robot or Golem’s Dune-based The 2nd Moon—base their narratives to some degree around existing SF works, the list below sticks with original concepts: the fevered output of a few dozen buzzing brains addled by feedback, distortion, beats, drugs and, of course, the ever-morphing futurism of science fiction.\n David Bowie, The Rise and Fall of Ziggy Stardust and the Spiders from Mars (1972)\n For a record that launched a thousand bloated, SF-centric concept albums, David Bowie’s The Rise and Fall of Ziggy Stardust and the Spiders from Mars is pretty concise—especially considering that title. In 38 minutes of apocalyptic surrealism rooted in the warped SF of Samuel R. Delany and William S. Burroughs, Ziggy Stardust tells the melancholic yet rapturous tale of a rock ’n’ roll alien who comes to Earth during the five years prior to the apocalypse. While never matching his sweep and scope, other glam-rock artists of the era—including Roxy Music, T. Rex, the doomed American singer Jobraith, and even Elton John with his hit “Rocket Man”—would share Bowie’s love for glittery, gender-bending SF. After all, what’s more androgynous than a spacesuit?\n Hawkwind, Space Ritual (1973)\n Progressive rock is synonymous with the concept album, but surprisingly few bands of the ’70s prog movement actually made SF concept albums (Yes’ unfocused yet excellent Tales from Topographic Oceans being a notable exception). The idiosyncratic Hawkwind was never entirely a prog band, but frontman Dave Brock and crew (which featured a pre-Motörhead Lemmy on bass) took their primal, interdimensional drone to its apex with Space Ritual. A double album that approximates what space travel might sound like if astronauts flew around in bong-shaped ships, Space Ritual even has some real SF credentials. Legendary author Michael Moorcock, a regular Hawkwind collaborator, delivers a metaphysical spoken-word piece titled “Black Corridor”—which just goes to show that his stentorian voice is just as grandiloquent in reality as it in on the page.\n Parliament, Mothership Connection (1975)\n “A pimp sitting in a spaceship shaped like a Cadillac” is the overall vibe George Clinton said he was aiming for with Mothership Connection, his masterpiece as the leader of the funk collective known as Parliament. Making Bowie and his brethren look downright bland by comparison, Clinton and company amped up the psychedelic, satirically cartoonish edge of Kurt Vonnegut’s SF work (whether they realized it or not). The result is a cyberfunk phantasmagoria that refurbishes the interstellar void as a vast, cosmic dancefloor. Clinton continues to man the Mothership to this day, but this album is where he invented Funkier Than Light travel.\n Rush, 2112 (1976)\n Although this list is meant to focus on original works of SF music, it’s hard to dismiss Rush’s 2112 as a mere adaptation, despite the fact that it borrows blatantly from Ayn Rand’s novel Anthem as well as two episodes—“Will the Real Martian Please Stand Up?” and “Stopover in a Quiet Town”—of The Twilight Zone. In fact the latter example is even titled “The Twilight Zone.” But there’s no denying that Rush’s drummer and lyricist, Neil Peart, folded his SF influences into a unique and stunning work of sustained imagination that pairs the cosmic, dystopian, multi-suite epic “2112” with excellent yet unconnected tracks that showcase the band’s prog chops, celestial melody, and philosophical waxing. Oh, and it rocks, too.\n Gary Numan and Tubeway Army, Replicas (1979)\n Glam, punk, and the robotic tones of Germany’s groundbreaking electronic group Kraftwerk came together in the late ’70s to form the basis of much of the new wave movement. But before bands like Duran Duran could chew that sound up into bubblegum in the ’80s, some truly edgy artists mined that dark sonic domain—one of the greatest being Gary Numan. His second album with Tubeway Army, Replicas, picks up on many of Philip K. Dick’s themes of alienation and self-negation in the wake of runaway technology. He wasn’t alone; at the same time Replicas was released, everyone from Klaus Nomi to Frank Zappa was using rock music to riff on androids as symbols of our dwindling humanity. Replicas’ bleak depiction of artificial intelligence and metaphysical estrangement should be considered not only great pop music, but part of the cultural groundswell that resulted in the 1982 film, Bladerunner (Dick again, and “replicants”), and the cyberpunk explosion soon after.\n Styx, Kilroy Was Here (1983)\n Styx wasn’t the first mainstream ’70s rock band to tinker with SF after the ’80s hit—ELO beat them to it by two years with 1981’s alien-abduction parable, Time—but Styx set the standard for both excellence and excess with Kilroy Was Here. Capitalizing on the buildup to 1984, one of the most infamous years in the SF canon, Kilroy is singer-keyboardist Dennis DeYoung’s over-the-top masterpiece. A rock ’n’ roll dystopia, it casts the oppressed rocker Kilroy as Winston Smith from George Orwell’s 1984, and the fascist leader Dr. Righteous as Big Brother. Bowie, of course, had already harvest Orwell’s most famous novel for his 1974 album Diamond Dogs, but Kilroy was a symphonic, synthesizer-soaked update for the Moral Majority era. Really, though, it all boils down to the album’s indelible hit single, “Mr. Roboto,” a song that’s more or less a rock opera unto itself.\n Jonzun Crew, Lost in Space (1983)\n While much of the SF community—and the world at large—debated just how close the real world was coming to resemble that of Orwell’s 1984, Jonzun Crew figured partying might be a healthier reaction. Picking up where George Clinton’s P-Funk crew left off (not that P-Funk ever really stopped), Jonzun Crew was part of an entire electro movement that married hardcore synthesizers and hip-hop into a sleek, chilling, yet wholly fun music. Granted, some electro groups like Time Zone and Cybotron were a bit gloomier, but Jonzun Crew’s SF-steeped Lost in Space struck the perfect balance between the nightmare of the future and the hangover of tomorrow.\n Planet P Project, Pink World (1984)\n Double albums were pretty much a dim memory of the ’70s in the slim, trim world of 1984. And yet Tony Carey’s Planet P Project decided that year was when the massive, 26-song Pink World needed to be unleashed. It failed to make the mark he’d hoped, but the album’s cult status persists, and for good reason. Although taking the name of his project from Planet P in Robert Heinlein’s Starship Troopers, Carey—like the SF world itself in 1984—had focused past the trite, tired tropes of space opera and tapped into the terrifying realms of inner space and the near future. Mixing the iciness of new wave with the chops, pomp, and circumstance of prog, Pink World remains a dizzying and literate SF vision.\n Queensrÿche, Operation: Mindcrime (1988)\n The spacefaring Hawkwind inspired many of the early metal bands, but it wasn’t until 1988 that the metal world truly embraced the idea of the SF concept album. Voivod’s brutal Dimension Hatröss is one such record that came out that year, but the more stunning example is Operation: Mindcrime by Queensrÿche. Melodic, immaculate, and surprisingly coherent for a concept album, Mindcrime is a speculative thriller about a heroin-addicted political dissident whose brain is rewired for assassination. Despite the ups and downs metal has suffered since the rise of grunge in the early ’90s, Operation: Mindcrime has remained a touchstone of the genre, even inspiring a serviceable sequel in 2006, Operation: Mindcrime II.\n Donald Fagen, Kamakiriad (1993)\n The ’90s were a tough time for the SF concept album (no, we’re not counting Billy Idol’s 1993 flop, Cyberpunk). Ironically, it took an old guy to remind everyone about the future. Donald Fagen of Steely Dan released his sophomore solo album, Kamakiriad, in 1993, and while it sounds as breezy yet sophisticated as your typical Steely Dan classic, it turned out to be a high-concept, cyberpunk travelogue through a virtual world of Fagen’s device, one that seems to tap into both J.G. Ballard and Neal Stephenson. (Another old guy, one David Bowie, would usher out the ’90s with another SF concept album—1999’s Outside—that would set the stage for the format’s wild resurgence in the following decade.)\n Deltron 3030, Deltron 3030 (2000)\n Hip-hop producer Dan the Automator already had one SF concept album—Dr. Octagon’s scattershot Dr. Octagonecologist—under his belt when he undertook 2000’s self-titled album with Deltron 3030. With rapper Del tha Funkee Homosapian on the mike, the disc is a rich, multilayered, post-apocalyptic storyline whose polyglot music actually sounds like a new configuration of the future—that is, exactly what the year 2000 direly needed. To paraphrase Del himself in the song “3030,” the album is a “perfect blend of technology and magic.” The track “Time Keeps on Slipping,” which features guest vocals from Damon Albarn of Brit-pop traditionalists Blur, set the stage for Dan’s and Albarn’s massively successful “virtual band,” Gorillaz—a group that released its own futureshock concept album, Plastic Beach, in 2010.\n Coheed and Cambria, The Amory Wars (2000-on)\n The most ambitious SF story arc to ever be attempted in the rock arena, Coheed and Cambria’s The Amory Wars, is not an album but an entire epic that spans almost every song the band has released since its early days as an unknown group called Delirium Trigger. A few random, early songs introduced the characters of Coheed and Cambria Kilgannon and their messianic son, Claudio—who just so happens to share a first name with Claudio Sanchez, the frontman of Coheed and Cambria. Unlike fellow post-hardcore practitioners My Chemical Romance, who have tried the concept-album thing with less success, Sanchez and crew are now five albums deep into the Amory Wars storyline. Besides spawning a comic book, the latest release in the arc, Year of the Black Rainbow, spun off into a novel that Sanchez co-wrote with Peter David. Sanchez’s Star Wars-meets-Dune story has its faults, but paired with the band’s soaring, anthemic, neo-progressive rock, it’s as close to concept-album heaven as the SF world has come.\n The Flaming Lips, Yoshimi Battles the Pink Robots (2002)\n Sometimes the first symptom of addiction to concept albums is denial. That definitely seems to be the case with The Flaming Lips’ Wayne Coyne, who followed his band’s cinematic record The Soft Bulletin with something even more solidly narrative: Yoshimi Battles the Pink Robots. Coyne has flatly denied that Yoshimi is a concept album, and certainly it wanders from the narrative quite a bit. However, there’s no denying that, at its core, the record is a sculpted, symphonic, indie-rock parable full of the kind of pop-culture pastiche Cory Doctorow would be proud to call his own.\n Nine Inch Nails, Year Zero (2007)\n Many of SF’s most horrifying predictions about the future have come true, in one form or another since 2001. Nine Inch Nails’ Trent Reznor used the specters of perpetual war, terrorism, societal disintegration, and overall dystopia as fodder for Year Zero, a concept album that details militaristic oppression in the not-so-far-flung future of 2022. Compared to NIN classics like The Downward Spiral, Year Zero is jagged, guttural, and oozing paranoia—a high-tech yet visceral scenario that wouldn’t be out of place in a Richard K. Morgan thriller.\n The Lisps, Futurity (2009)\n Steampunk-associated acts like Rasputina and Sleepytime Gorilla Museum are as fueled by gleeful anachronism as the genre itself. But the Arcade Fire-influenced, Brooklyn-based outfit The Lisps took things a few steps further with Futurity. Rather than an album per se, Futurity is a full-length stage musical the band produced in 2009—the story of a Civil War soldier and science fiction writer beset by hallucinatory visions of the future. With the same melting-pot abandon used by novelists like Cherie Priest and Brian Francis Slattery, The Lisps have crafted an indie-rock opera that combines vintage Americana with mind-bending weirdness. Now they just need to record the damn thing.\n Mastodon, Crack the Skye (2009)\n Heavy metal made a huge comeback in the ’00s, and so did the space opera. It only makes sense that the two would converge sooner or later. Mastodon, one of the heaviest yet most complex figureheads of today’s metal scene, used their latest record, Crack the Skye, as an opportunity to explore the darkest reaches of the universe—and of reality itself. It’s an overblown album, but gloriously so. Based around a paraplegic protagonist who travels the cosmos via astral projection, it’s more Arthur C. Clarke than Alastair Reynolds. But the metaphysical aspect of the story doesn’t dim the fact that Crack the Skye revels in the rich tradition of the SF concept album—including a “Space Oddity”—influenced video for the single “Oblivion” that brings everything full circle.\n Fads and styles in music and SF come and go, but one thing is a constant: musicians will probably be trying to perfect the amalgamation of the rock album and the science-fiction novel for as long as there is such a thing as the future.\n Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller."}