{"fingerprint": "uNB69/WouLMZLXE8imb0TZaD7u0=", "sitename": "Clarkesworld Magazine", "title": "Space Is the Place: The Science Fiction Pulse of '80s Electro Music by Jason Heller", "author": "Jason Heller", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/heller_09_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Space Is the Place: The Science Fiction Pulse of '80s Electro Music by Jason Heller", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nSpace Is the Place: The Science Fiction Pulse of '80s Electro Music\n“I am a computer,” says the voice. It isn’t human. Robotic and coldly electronic, it sounds like something conjured by the eeriest science fiction nightmare. Underneath it hovers a mechanical hum that might be the ambient noise of a spaceship, or an android brain, or even cyberspace. “I have been programmed to dance,” the voice goes on. Then it adds, with no small amount of ominousness, “I am here to digitize you.” A funky, machine-like beat kicks in, and the voice utters its sole commandment to the listener, one that leaves no room for disobedience: “DANCE.”\nThe song is titled “Mirda Rock,” released as a 12-inch single in 1982. It was written, produced, and sung (through the voice-altering device known as the vocoder) by Reggie Griffin under the name Reggie Griffin & Technofunk. Griffin had made a name for himself that year as the synthesizer player on Grandmaster Flash and the Furious Five’s “The Message,” the legendary hip-hop classic brimming with apocalyptic imagery. Griffin’s synth bleeps and burbles futuristically—and that futurism is magnified on “Mirda Rock,” a miniature SF odyssey that just happens to be pressed on a record rather than printed on the page.\nGriffin may have threatened to digitize the listener but he was part of a wave of musicians in the early 1980s who were digitizing something far larger: funk. This movement became known as electro, and it flourished from around 1982 to 1985 thanks to the likes of Newcleus, Cybotron, Jonzun Crew, Warp 9, Quadrant Six, Project Future, and Afrika Bambaataa & the Soulsonic Force.\nBut during that brief time, electro made a strong impact. Electro acts gathered up the Afrofuturism of certain ’70s music—most notably acts like Parliament-Funkadelic and Earth, Wind & Fire—and mixed it with the emerging instrumental technology explored by the likes of Kraftwerk and Gary Numan. And they wrapped it all in outrageous, glittering costumes that drew from science fiction’s camp tradition along with funk’s flair for the flamboyant. The result not only influenced countless waves of musicians with its imaginative, innovative sounds, it paralleled the early-to-mid-’80s explosion in SF cinema, SF-themed video games, and the cyberpunk movement in literature—as well as honoring Griffin’s vision of the future as something both fearsome and danceable.\nElectro may have felt radical in the early ’80s, but it didn’t show up out of nowhere. Bandleader and icon Sun Ra began incorporating electric keyboards and what would later become known as Afrofuturism into his work as early as the 1950s, when his cosmic vision of jazz first gazes toward the stars—and when he began dressing in glittery robes that bridged ancient Egypt and the world of tomorrow. His science fiction film from 1974, Space Is the Place, would turn out to be vastly influential to electro.\nThe advancement of the synthesizer in the ’70s, when the instruments started to become smaller, cheaper, and more accessible, led to its increasing use in all kinds of popular music, funk included. The late Bernie Worrell of the Parliament-Funkadelic collective was one of many funk keyboardists in the ’70s who coaxed space-age noises out of synthesizers—only in Worrell’s case, he was abetting P-Funk leader George Clinton, a man who shared many cosmic viewpoints and sartorial choices with Sun Ra. “If we can’t be free on Earth, then we’ll find liberation elsewhere in the galaxy,” is how writer JS Rafaeli summed up Clinton’s ethos, and that’s borne out in his songs: They’re infused with a powerful Afrofuturist vision of protest, hope, intergalactic mythology, and cartoon-sized fun.\nThroughout the ’70s, other artists besides P-Funk helped lay the groundwork for electro. In 1977—the year Star Wars helped popularize science fiction to a level that had never been seen before—funk veterans War released the song “Galaxy,” complete with laser-beam sound effects and a mandate to escape Earth “on a rocket ship, no time to wait / I just want to gravitate.” That same year, Earth, Wind & Fire recorded “Jupiter,” which speculated about an alien visitation—likely influenced by another SF blockbuster from 1977, Close Encounters of the Third Kind. And Herbie Hancock’s pioneering ’70s output with the Headhunters—especially the 1973 song “Chameleon”—helped push funk into weird, exciting new dimensions.\nA similar space-funk vibe ran through subsequent songs like Slave’s voice-modulated “Stellar Fungk” and Marvin Gaye’s sprawling “A Funky Space Reincarnation,” both from 1978. (The latter even mentioned Star Wars by name.) In that same year, the German/Caribbean group Boney M. issued “Nightflight to Venus,” a song about interplanetary travel that opens with a robotically-voiced countdown to liftoff. Curtis Knight—an R&B veteran who once counted a young Jimi Hendrix as one of his sidemen—clocked in with a record titled “UFO” which was an oddity on its release in 1979: “Looked inside, now I know / A UFO is a high-flying disco,” Knight sings, telling an entire epic story about his ride on a flying saucer. Really, though, “UFO” was just a couple years ahead of its time, as it presaged the clipped, sculpted electronic sound, computer-blip effects, and hip-hop slant of electro. And of course, Clinton and crew unleashed numerous SF-themed songs that decade, most notably 1975’s “Mothership Connection (Star Child).”\n“Mirda Rock” came out in 1982, just as three science fiction films hit the silver screen and helped spark the electro movement: Blade Runner, E.T. the Extra-Terrestrial, and Tron. Like Stars Wars and Close Encounters before them, these three films solidified SF’s hold on the pop-culture consciousness. But they also ignited the imaginations of what would become electro’s first wave. Leading the pack was Afrika Bambaataa & the Soulsonic Force, whose “Planet Rock” became electro’s blueprint and rallying cry in 1982. Bambaataa—whose accomplishments have been overshadowed by recent sexual abuse allegations—was a pioneer of hip-hop as a DJ in the late ’70s, but “Planet Rock” pushed him to the forefront of the emerging electro scene. Befitting its title, the song drew from a global palette of electronic-music influences—England’s Gary Numan, Japan’s Yellow Magic Orchestra, and Germany’s Kraftwerk, whose 1977 milestone “Trans Europe Express” was echoed in “Planet Rock”—while fusing those icy, futuristic sounds with the deep pulse of funk. And like Clinton and Sun Ra before him, Bambaataa dressed in lavish costumes that tapped into Afrofuturism’s time-warping scope.\nThe popular obsession with androids, aliens, and computers helped “Planet Rock” find a ready audience, but Bambaataa himself took inspiration from older sources: the SF of his childhood, namely Buck Rogers, Flash Gordon, Star Trek, and Lost in Space. He wasn’t the only one. In 1983, a group called Jonzun Crew released an album called Lost in Space. Not only did it pay homage to the beloved, robot-starring SF show of the ’60s, it upped the ante for electro. Awash in vocoder-filtered vocals, jerky funk, and sleek synthesizers, the album’s songs steeped themselves in SF tropes, from “Space Cowboy” to “Ground Control” to “Space Is the Place”—the last of the three proudly referencing Sun Ra’s Afrofuturist SF film from a decade earlier.\nJonzun Crew wasn’t alone when it came to that reference. In 1983, the project Warp 9 issued the single “Light Years Away.” Along with its overt space-travel theme—and SF-fusion lyrics like “Funk rays in the alleyways / Like laser beams they rock my dreams”—the song features the refrain, “Space Is the Place.” In the early ’80s, electro took on a political bent, even when not openly political; the movement’s Afrofuturist message was inclusive, pointing toward a better place for humanity beyond the stars, or even here on Earth, if Homo sapiens were able to harness technology as coolly as electro artists did drum machines, synthesizers, and vocoders.\nStill, there’s no mistaking the confrontational nature of electro. As Kodwo Eshun said in his book More Brilliant Than the Sun: Adventures in Sonic Fiction, “Instead of using synthesizer tones to emulate string quartets, electro deploys them inorganically, unmusically. The synthesizer becomes a sound weapon.” Even the vocoder, initially devised to encrypt messages for military purposes, had a tone that was both scary and thrilling—reminiscent of Colossus, the malevolent, monotone, vocoder-voiced supercomputer of the 1970 film Colossus: The Forbin Project (and even Darth Vader, despite the fact that vocoders were not applied to James Earl Jones’ delivery in the Star Wars films). The vocoder even hinted at posthumanity, creating a hybridized, cyborg-like voice that was as empowering as it was formidable.\nScores of other electro artists released music during the genre’s heyday of 1982 through 1984. The band names and titles alone sound like something pulled straight from the ascendant trend of cyberpunk literature, which hit critical mass in 1984 with the publication of William Gibson’s Neuromancer: “Cosmic Cars” by Cybotron, “Body Mechanic” by Quadrant Six, “We’re Rocking the Planet” by Hashim, “Ray-Gun-Omics” by Project Future, “Arcade Lover” by Project Future, and the group Newcleus, who delivered one of electo’s greatest anthems with a song titled, not coincidentally, “Space Is the Place,” in which a female singer assures, “I’ll be your cosmic tour guide on this trip through the galaxy.” Even some of the artists who had laid the groundwork for electro in the ’70s got in on the act: In 1982, George Clinton released the electro-leaning album Computer Games, and in 1983, Herbie Hancock’s single “Rockit”—aided by its captivating, robot-heavy music video—beamed electro into the homes of millions, going gold in the process. “Rockit” marked the commercial peak of electro, and also the end of its first wave.\nAlthough the music has experienced numerous revivals since then, the sheer inventiveness, imagination, and ingenuity of ’80s electro has rendered it timeless—and popularized Afrofuturism for an entire generation. As Rafaeli wrote, “The action heroes of the old sci-fi films may have been entirely white, but the stars of what became known as Afrofuturism weren’t just interested in passively watching these stories on the screen; they created their own mythology, embodying dazzling psychedelic, utopian personas and creating some of the coolest, weirdest music of the 20th century in the process.” The pioneers of electro hacked funk’s DNA, rewiring popular music for a brave, new future.\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller."}