{"fingerprint": "K848afsJukDluRym4K/90CZCdUc=", "sitename": "Clarkesworld Magazine", "title": "Song for a City-Universe: Lucius Shepard's Abandoned Vermillion by Jason Heller", "author": "Jason Heller", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/heller_01_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Song for a City-Universe: Lucius Shepard's Abandoned Vermillion by Jason Heller", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Song for a City-Universe: Lucius Shepard's Abandoned Vermillion\n It takes a long time to read an issue of Vermillion. Relatively speaking, anyway; each of the twelve issues of the brilliant, overlooked science-fantasy comic book series—written by the late SFF master Lucius Shepard and published in 1996 and ’97—is composed of as many pages as your average comic. Within that basic framework, though, Shepard sought to accomplish the near impossible: depict, in graphic-narrative form, his vision of a city called Vermillion, a megalopolis that spans light years instead of blocks and encompasses infinite distortions of time, space, biology, and being.\n That’s a tall order. Then again, this is Shepard, whose Dragon Griaule stories—collected in 2012 as The Dragon Griaule and concluded, posthumously, in 2014 with the novel Beautiful Blood—imagined the city of Teocinte, built against the body of vast, sleeping dragon. Vermillion is limitlessly more ambitious, to the point where it’s justified to wonder how Shepard ever thought he could sell the idea, let alone execute it. Jonathan Cave, the series’ protagonist, is vague, abstruse, self-absorbed, and borderline amoral; the sprawling, technologically advanced yet oddly Renaissance city he lives in has no rules, order, or structure. In other words, there’s little for a reader to cling to, especially those who crave some form of sympathetic bond with a comic’s main character. Often, it’s not even clear what he desires or pursues; Shepard seems bent on breaking every rule he can, not just of writing comics, but of writing fiction.\n Shepard wasn’t trained in the art of comics scripting, and it shows. Anyone familiar with his classics and his 1987 novel Life During Wartime know well how lush and labyrinthine his tangle of prose and ideas could be. Not to mention enveloping, enthralling, and luxuriantly time-consuming.\n Comic books—at least not the twenty-four-page variety—don’t always work well under that kind of weight. Vermillion was serialized, but Shepard either failed to grasp or refused to surrender to the format’s formal boundaries—much in the same way the city of Vermillion itself sprawls far beyond the realm of reality or reason.\n Instead of meshing symbiotically on the artists he collaborated with, so that they might convey their share of the story’s information, Shepard wrote and wrote and wrote, crowding the panels with fields of words until language itself became a key visual component. It’s as if he ripped one of his sumptuous novels into fragments then pasted them on top of artwork that sometimes bore only a tenuous connection to the text. His lengthy descriptions and philosophical perambulations made Vermillion stand out from so many of its contemporaries on the shelves; they also contributed to Vermillion’s demise.\n Vermillion was conceived as an open-ended, ongoing series, with a new issue coming out each month. It was unceremoniously canceled after a scant dozen issues. Shepard—who died last year at the age of seventy—had never written comics before undertaking Vermillion. Tellingly, he never would again. The series was an experiment for him, just as much as it was an experiment for its publisher. DC Comics, after finding much success in the early ’90s with sundry supernatural, horror, and weird-fiction themes thanks to its Vertigo imprint (led by Neil Gaiman’s groundbreaking The Sandman), decided to do something similar—only with science fiction and fantasy.\n That new imprint, Helix, failed abysmally. Only one of its titles, Warren Ellis’ gonzo-dystopian Transmetropolitan, survived Helix’s short life. Not even the series written by an even more legendary SFF author than Shepard, Michael Moorcock’s Multiverse, endured. But during its two-year existence, Helix took huge risks. Vermillion was one of them.\n Entering Vermillion is a disorienting experience. Yet there are familiar signposts, at least for those fortunate enough to have grounding in genre. Vermillion has its precedents in the form of other fictional SFF cities that their creators habitually revisit, each time looking in at a different angle: Fritz Leiber’s Lankhmar, Michael Moorcock’s Tanelorn, M. John Harrison’s Viriconium, Edward Bryant’s Cinnabar.\n The most obvious nod, though, is to J. G. Ballard’s Vermilion Sands—not a city per se, but a near-future resort in which technology, perception, and consciousness are reordered like so many building blocks. Vermillion’s first story arc, which comprises the first seven issues of the series, is its shakiest, due to Shepard’s overbearing narrative hand—not to mention the stiff murky art of Al Davison, who just doesn’t seem able to keep up with Shepard’s boiling imagination. Stories are nested within stories, and nested again, until they form a recursive puzzle.\n Even at its trickiest, though, that initial, seven-issue arc boasts some stunning ideas, including the almost magical singularity known as Starlight Drive—a close cousin to M. John Harrison’s Kefahuchi Tract—and a sinister church of AI mysticism that’s almost a pastiche of certain elements of Frank Herbert’s Dune. At times, Shepard zooms out to a profound scale, contorting the fundamentals of the cosmos to a degree so horrific, it might have made Lovecraft proud. It’s dizzying stuff. The universe of Vermillion is one “where whales once ferried the cold tonnage of their souls over reefs made from drowned kingdoms.” Similarly, Shepard is more concerned with letting these grand, terrifying visions dominate Vermillion, rather than plot.\n The story tightens and sharpens—and turns more fantasy than SF—during Vermillion’s second and final arc. Gary Erskine takes over the art duties, and his crisp, intricate work is a big step up from Davison’s. Accordingly, Shepard reins in his extravagant wordage; as Cave spends much of this disjointed story arc delving into the mysteries of the goddess Lady Manganese and her all-too-mortal husband Lord Iron, Shepard’s writing sheds much of its excess.\n Cave becomes more of a bystander, and occasional catalyst, rather than anything resembling a hero. By the time the series’ abrupt finale, issue #12, arrives, Shepard has hit his stride, crafting a collection of framed vignettes that verge on folklore and fit together like clockwork. Or so we must assume; DC Comics, eager to wash its hand of the flop that was Vermillion, was so negligent that it printed the pages of #12 out of order, so that the reader has to skip around to try to piece together an already piecemeal tale. Somehow, it’s the most fitting way Vermillion could have ended.\n In Shepard’s afterword to the first issue of Vermillion, he explained the comic’s conception by saying,\n \n I eventually came to understand that [the city of] Vermillion was not merely an exercise in wish fulfillment, but also a metaphor for my inner life, in effect a habitat like an enormous head in which trillions of thoughts and fragments of dreams dressed up as strangers and monsters and lovers prowled the endless galleries.\n \n At its heart, that’s what Vermillion is all about. Given the chance to get his foot in the door in the comics industry, he intrepidly, selfishly decided to turn his scripts into the most personal artistic expressions. In the series high point, the standalone issue #8, Cave takes a drunken traipse through his own psyche, one that turns increasingly psychedelic before finally settling into a Dante’s-Inferno-meets-Alice-in-Wonderland spiral of poignant lunacy. He’s advised by giant insects and finds insights in a grotesque amusement park. He’s also the mouthpiece for some of Shepard’s best prose; in fact, he becomes Shepard in all but name, echoing his creator’s ruminations on his perverse ability “to pass through oblivion into a space where grief becomes power and the wind shapes mournful vowels from the broken stones of a life.”\n That the art in Vermillion #8 is rendered by John Totleben—the best artist to have worked on Vermillion, previously known for his collaborations with Alan Moore on Miracleman and Swamp Thing, both of which are subtly evoked here—only cements issue #8’s status as the apex of the series’ truncated run. It’s also one of the most poetic, albeit unrecognized as such, single issues of a comic book every made, as rich in depth, sensitivity, lyricism, and emotional truth as anything Neil Gaiman accomplished with his formidable The Sandman.\n “Beauty is a deception. A lie we tell to cover the paucity of our lives,” says Ildiko the Immaculate, an angelic avatar of the apocalypse, when Cave and the others adventurers in their party linger too long on an idle conversation about the whys and wherefores of physical attraction—yet another one of Shepard’s ornate tangents that exterminates tension while adding rich texture. She then sagely adds, “My people had a saying: What is beautiful is what is not lost.”\n When Shepard wrote those words, he had no way of knowing that Vermillion was destined to become both a miserable failure and an overlooked gem in his body of work. But he must have had an inkling of how deceptively beautiful, and how beautifully deceptive, he’d made Vermillion itself. It’s not a short read, any more than Vermillion is an easy place to navigate. But it’s worth lingering in every polyglot market square, biotech-oozing back alley, and magical cul-de-sac.\n Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller."}