{"fingerprint": "5GdtDEv7m1cBrVG6ph8pQhXzAlw=", "sitename": "Clarkesworld Magazine", "title": "Curse by Samantha Henderson", "author": "Samantha Henderson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/henderson_12_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Curse by Samantha Henderson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1920 words, short story\nCurse\n1\nHer son was a year grown when the dream started. Always it began in the pantry, at first—she was tallying the beer, or the bags of grain, when the first joints of her fingers started to itch. Little more than a prickling warmth, then a fierce burning, and as she twisted and scratched them for relief they sprouted fur, some gray, some brown. One by one they disjointed, split away from her hands and fell to the floor, where they scampered into the corners. She thrust her hands into the folds of her gowns to save them, but it was no use—joint by joint her fingers changed into mice and ran over her feet until she was left with nothing but two stumpy paddles.\nAnd then she’d wake, sometimes alone, sometimes besides her husband’s softly breathing body, and check her fingers in the moonlight to see if they were still there. If she was alone she’d rise and go to the cellars, checking for nibbled food and dung in the corners.\nShe was alone more and more. One thing she’d learned was that the smaller the kingdom, the more the king had to take into his own hands. He was away from home more often than not, now, and stayed in his own rooms most of the time when he was home, with councilors and petitions and the business of an almost-prosperous land.\nAnother thing she’d learned was that her business was with the beer, and the bags of grain, and the stores kept in stone-lined cisterns beneath the ground, and keeping the woman a-weaving. Her business was her son, for now, and she knew that when he was grown enough he would become part of the men’s world with his father and learn the ways of a countrified prince.\nThen it happened when she was awake, walking the halls to her rooms, leaving the candle behind and trusting to the torchlight. Her hands felt thick and itchy, and when she lifted them they fell away joint by joint, little dark bodies running to the walls and vanishing between the stones. She waited an instant to wake, then screamed when she didn’t.\nShe staggered against the wall as a curious maid poked her head around the corner, eyes widening as she recognized her.\n“What’s the matter, my lady?” The maid came forward, brisk, in no sort of awe whatsoever. Because she wasn’t a proper queen, she wasn’t a lady, she was a miller’s daughter with an odd kind of luck. So far the servants treated her with condescending sympathy.\nShe raised her hands, for show or to defend herself, but they were normal—strong peasant’s hands with short, clean nails and losing their calluses.\n“Nothing,” she managed, then “nothing” again, in a tone that tried to be imperious and failed. “I just tripped, that’s all.”\n2\nThe dwarf smelled her long before she came over the rise of the hill: the soap she used and the oil at the roots of her hair, and skin that never lost a touch of the sun and the faint tang of soured milk. The boy, too—the sweat of its toiling beside its mother and a diaper clout that needed changing. They paused at the crest while she sought the entrance to his dwelling in the shadow of the valley below; a shelter hacked from the living stone of the mountainside. He stood in the doorway, not bothering to conceal himself. She spotted him and stumbled downhill, dragging the tired child behind her.\n“He wants me to do it again—the weaving,” she said, without preamble.\n“Took him a while,” he replied, dryly.\nShe started to cry, because she knew what he was going to say and realized the truth of it the instant before he spoke. He turned inside the cave and beckoned her to follow. It was cozy inside, and roomier than she’d imagined. Red coals glowed on a long, low hearth. A squat battered kettle sat there, with a water bucket in the corner.\n“He’s finding a reason to despise you. He feels guilty for doing it with no justification,” he threw over his shoulder.\nShe was such a child. She didn’t know that he could hate her so.\nShe spoke to his back as he lifted the kettle.\n“You sent them. The dreams. My fingers: mice. It was you.”\nHe didn’t turn around. She waited while he built up the fire under the heavy-bottomed copper, and folded her fingers carefully across her stomach. Afterwards he leaned against the mantle, built small to accommodate his height.\n“I felt sorry for you, you know,” he said. “At the beginning, even. That’s why I came in the first place. Sympathy you’d have for a snail in the path, or a turtle turned over in the sun. And then, after the first night—no more than that—you started to enjoy it, the attention that you feared so much before. I could see it in you. You almost believed you could do it, didn’t you?”\nWere her fingers beginning to itch? She twisted them in her skirt and didn’t look.\nIt’s true, she thought. I did think I could spin straw into gold. Not because I could, but because ugliness should serve beauty. Isn’t that always the way?\n“You were quick enough to agree to the child,” he said, giving her the side of his face, the silhouette of a long, gnarled nose. “And I can’t blame you, for your loving man would have killed you just to make the point. That’s a king’s job, you know. To make a point. And perhaps he didn’t want to marry you so much, for there are beautiful women enough of his own rank. But he had promised, you see. And he made his point.”\n“You hated me.”\n“Yes. For a long time.” He poked at the fire and a great clot of sparks flew up, some landing on the hearth and squirming like lit worms before darkening into black ashy spots. In the corner, the boy chuckled over some toy.\n“But I wouldn’t have sent the dreams if you hadn’t played the game of not knowing the third day. Belshazzar, Cruickshanks. Conrad. Harry.” His voice became burred and rough at the edges. “Three days you played me like a salmon.”\nShe said nothing, being an inland girl. She had never tasted salmon.\n3\nThe girl wrapped potatoes in damp clothes and pushed them into the coals banked behind the hearth. The men in the doorway were not going to go away, but she made them wait for all that. She heard one grunt softly and shift his weight.\nShe’d grown a lot the past year and had to bend her head to avoid hitting the arch of the fireplace, which had been built too low for human kind.\n“My brother left years ago,” she said, finally, still kneeling and staring at the coals. “He visits sometimes, and brings game from the forest. Less and less these days.”\n“Does he know who he is?” One of the men—the taller, thin one—surged forward, shrugging off the other’s restraining hand. “Do you?”\nHe stopped as she turned, her eyes cold and hard and blue, so blue they were almost violet at the edges. Her father’s eyes, a king’s eyes, chilly and appraising. She said nothing.\nThe thin man flinched but stood his ground. He made an effort to gentle his voice.\n“Your pardon. But your father is dying, and dying with no successor. Your brother is his heir.”\nShe was still kneeling, still looking up at him, and now she smiled very slightly and the thin man felt that to stand over her was no advantage at all.\n“His heir? What, with a miller’s slut-girl for a mother, who ran away from court to return to the squalor she came from?”\nThe thin man swallowed and stood his ground.\n“Even so, my lady.”\nShe sighed and looked back at the coals. The roasting potatoes filled the rough-hewn chamber with the smell of clean dirt.\n“He hunts,” she said, finally, rising and dusting the ash off her full skirts. “Track him down in the wild wood, if you must, but don’t seek him here, not if you value your lives.”\nThey didn’t move, glancing at each other nervously. The other man, who stood in the doorway, was shorter and stouter than his companion. He cleared his throat.\n“We do not seek only your brother, my lady,” he rumbled.\n“Ah?” she was grinning now. “My own humble self? But I would not inherit; I couldn’t. Perhaps my dam carried me in her belly to the manikin’s house, perhaps he got me on her—isn’t that what they say? You’d never prove the king’s my father.”\n“But your mother was your mother,” said the stout man. “And your mother had her gifts.”\n“Pieter,” said the thin man to his companion.\nThe girl laughed: a harsh bark. “So! Straw into gold, is it? If she could, then I can? How does your master’s kingdom these days, Pieter? Are there small economies? Is the wine cheap and raw in your throat? Are there discontented whispers outside the chamber of the dying king?”\nThe thin man turned to expostulate with Pieter, but the bulkier man pushed him aside roughly.\n“I’ve heard enough about it,” he growled, to his companion or to the girl.\n“Fine threads of gold, reams of it, spilling on the floor and piling under the window. Enough to buy a kingdom, much less . . . ”\n“I’m useless to you, gentlemen,” she returned, lifting her fingers spread like a fan in front of their faces. “For see?”\nAnd before their eyes her fingers sprouted fur, and separated from each other joint by joint, and scampered to the floor with a squeak and a flutter, with a twitch and a shiver of bright, beady eye.\nThe thin man started back with a shudder; Pieter never got a chance, because a great hairy bulk loomed behind him, wrapped a beefy arm around his throat, and lifted him half a foot off the floor as he choked him.\nBut the thin man didn’t run, not even then; it was only when he saw the footprints the girl had made in the ash and sand of the hearth that he ran—not footprints, but claw marks, a bird’s foot, like those the chickens make outside the kitchen door, but huge, monstrous.\nHe turned and pushed past the enormous man and the gasping Pieter and vanished into the night.\nThe big man released Pieter, who fell to the floor in a limp bundle.\n“Is he dead, Bearskin?” asked the girl.\nHer brother shrugged. “Perhaps.”\nShe returned to the fire and poked at the potatoes with the stumps of her hands.\n“We have to go,” she said.\n“Come with me,” he said. “I have places to hide you in the forest. And they will be afraid of you for a while.”\n“Yes,” she returned, tucking the hot potatoes in her apron and wrapping them against her. “But not long enough.” The cave was rustling with mice, scampering over the ashes, over the mantle, across Pieter’s limp body.\nShe followed her brother into the forest, the potatoes warm against her thighs and the stubs of her hands, warm against the tiny fingers that were sprouting from her bloodless flesh."}