{"fingerprint": "mETRKjK7eWsu8c6RNru08JmcuwY=", "sitename": "Clarkesworld Magazine", "title": "Outer by Hollis Joel Henry", "author": "Hollis Joel Henry", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/henry_02_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Outer by Hollis Joel Henry", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4290 words, short story\nOuter\nPart I\nToozen remembered Auntie Heather, sitting hunched on the sand, retreating under her beach towel.\n“Auntie, come swim nah,” he’d said that day, still a small boy.\nBut even at that age he could feel the waves of her anxiety and anger lapping up against him.\nShe steupsed like she was peeling skin between her teeth and her bitter voice was muffled from below the towel.\n“You not seeing what going on? You too blind, boy. You too frigging naïve.”\nHard words, but Toozen understood. He’d been with her all day. He’d been part of the beach posse. But he wasn’t like the other children. Toozen had a thing for people. It mattered more to him that the beach made them happy. Auntie Heather had started the day happy. And she hadn’t been too happy these days.\nIt was an effort for her, he saw that morning, to put on the swimsuit over her crooked body, to look at herself in the mirror through her crooked eyes. To put the longer arm on her hip and pose and smile like a playful flirt. To shake her bam bam to the dancehall music on the kitchen radio, crooked hip bone protruding.\nToozen saw, when the white and green regional corporation maxi stopped at the beach and the doors opened, Auntie Heather’s bony, twisted chest rise for a mindful breath. “Come along, children,” she said like a big woman. And she led them onto the beach.\nThe others couldn’t see, like Toozen could, how with each step she was sinking. They were children so all they cared about was the hot sun and the water and the bright beach colors. But walking beside her, he felt it all, everything she felt. He felt her hearing the whispers and seeing the looks. Toozen felt Auntie Heather pull back as the beach crowd pulled back from her. “Stay close,” she said, big woman voice now small. All the energy her bent body had whipped up in front of the mirror at the center wasn’t enough to protect her from that crowd. So she ran beneath the beach towels and a cold rage.\n“Auntie Heather, don’t be sad,” Toozen remembered telling her.\n“Sad? I not sad. Who say I said?” the beach towel beast barked at him. “I don’t care about them. I hate them. I hate all these shitty shitty people. People are shit.”\nAll of them? His small boy self had wondered. What about the nice people at the center? What about Nurse Rajkumar who gave them Kiss cake when they went for checkup? What about Constable Antoine who would come on weekends in a jersey and jeans and drive them in the regional corporation maxi to the play park or the old recreation grounds, or for chicken and chips, or to the beach?\n“No, Auntie Heather,” Toozen said that day. “People nice.”\nAnd he remembered the snarl building up from deep down in her belly. He remembered waiting to receive it. But she stopped. And she sighed. And she spoke like a big woman again—not a bold woman striding onto the beach, but a woman who knows more than a child.\n“No Toozen. People not nice. You nice, too too nice. And ah frighten for you. You don’t look like me but you are September too. They go hate you too. They go come for you too. You have to get hard, Toozen. They go mash you up.”\nAuntie Heather, he smiled and his eyes filled up. “Big woman”—she was 16 at the time. Toozen wished he could go back and protect her, protect all of them. That was one ability he did not have. He had many others but he couldn’t go backward. Still he wished he could go back, if just to tell her they had not mashed him up.\nYes he was a September—the child of a child of a child born in late September. They had a big accident, Constable Antoine told them, the “science men and them,” he said. They were playing with light. All the children loved the idea, science men and them down in the cities making footballs and swords and giant butterfly wings from light. But it wasn’t anything nice. The accident made people sick and killed them. It gave women bad bellies and the children came out twist-up, incomplete or with too much.\nThe Septembers lived at the center. It wasn’t good but they didn’t know any better, and children make do. They knew they didn’t look normal. Some of them couldn’t do normal things. But they could still laugh and play, even if they had to drag their bodies across the floor. In small communities the Septembers grew up, started families, and had their own children.\nAnd then a funny thing happened. The babies started being born normal. They had two legs and two arms, ten fingers and ten toes. They had normal Caribbean skin, black and brown and cream. Everything worked, their lungs and eyes and bawling baby voices. So they thought they were normal.\nToozen was one like this, a brown skin boy, miraculously normal. His hands were a little small, his head a bit big, but that just made him a small hand, big head boy, nothing strange. When he learned how to walk and his infant face developed into a toddler face, they saw the difference. He had big black eyes set back deep below his big forehead with fat, wild, and writhing eyebrows. That’s how you could tell them, the third generation, they all had it. They all looked like brothers and sisters, family of the wise and wild faces. The farthest thing from normal.\nAnd it wasn’t only them. A transformation had taken place. This very beach, the long coast, had gotten it rough from the work of the science men and them. The giant coconut trees collapsed like addicts, trunks too weak to hold them up. The coconut shells turned soft and foul and sick yellow. The community of crabs came out with fused legs or less legs or shells without space for eyes or holes in their backs for insects to feed off their open flesh.\nEven this sick beach had healed, but it healed strange. Now the tree trunks wrapped round and round like a brass horn and the giant coconuts gleamed. The crabs had brilliant purple, blue, and red shells. They had carapace gowns and carapace capes. When Toozen walked past them they turned to look at him and he turned to acknowledge them.\nHe had no fancy clothes, an old jeans and an old football league jersey. But he was important in his own way. One could say he was the master here, of the empty beach, the vacant coastal settlements beyond the forest, and the nearly abandoned town itself, where the few people that remained were hiding.\nThat day so long ago, the beach was packed with people. And they were beautiful to Toozen. He saw them in a way no one else could. That was the biggest difference, the thing that was not normal at all about him. Even Septembers like Auntie Heather didn’t have it. He could see and feel and touch without his eyes or hands. When he stood close to a person he felt what they felt, their fear, their sorrow, hope, and love. His little self wondered how could people be shit when you could feel them so?\nAnd when they were far and he closed his eyes he saw them in his head, lights in the darkness like single candle flames, so that the crowded beach looked like it was covered in deyas; a sea of lights before the sea itself. Toozen couldn’t see the coldness or cruelty in their faces when the Septembers came on the beach. He just saw the light. And he was enchanted. He loved people. Auntie Heather was right.\nPart II\nWhen the bush changed, as the bush always changed, traveling down through the forest, Muradali was frightened. It wasn’t the first time they had come down this way. It wasn’t the first time they had to pass through the strange bush, September bush, flaring and distended and deep, deep green. The whole bottom half of the forest was affected. The forest creatures made September sounds, hollow and humanlike. Like they were talking or pretending they were people, trying to set a trap.\nBut Muradali was a veteran in this thing. He was a hunter. So he was accustomed. His rifle wasn’t fancy, not like Gomez’s. She had the best gear. She was a red woman1 who came from money. So she had everything nice. He didn’t like her. He tried to smile for her the first time they went on a hunt together. Gave her a sweet eye, but she pretended she didn’t catch it. Haul your ass, yes woman. He thought to himself.\nNo he wasn’t handsome. Yes he had a soft and sagging belly that made his dirty brown shirt flow over his belt. Yes he was married. But he was a damn great hunter. One of the best. She shouldn’t have blanked him so. And she was so friendly with Chainani—not a handsome man by any means. A good tracker and a good shooter, but no kind of dude’s man with women.\nThe three of them had been a team for about two months now. They were working hard. A week before they took down three—a 25 year old and two teenagers—hiding in Charuma woods. Gomez made her best shot yet with the fancy rifle, burned a hole right through the boy’s chest. Dead one time,2 he didn’t have a chance to drop and he was gone. That’s how you had to do it. You never knew what a September could do. Satan business. Once they were still breathing they could hurt people. Muradali knew many stories about them. He knew hunters that had survived. Septembers could really hurt people.\nBut he was a veteran. He had been moving through September bush for years. It didn’t frighten him anymore, not until today. And now he knew why. Down on the beach, strolling along, was the fucking monster of monsters, Outer himself. They passed Gomez’s fancy zoom lens between the three of them to make sure it was him. Then they passed it around to check again. No mistake, he was in a jeans looking like it belonged to his father it was so big for him. He was wearing an old green jersey. It was him. They knew his funny face well, the eyebrows wild like September bush. They knew the eyes, big and expressive. “Don’t get fooled by Outer’s nice eyes” the warning was shared down in the lodge and at church.\nLying on the ground, Muradali passed the lens back to Gomez and they watched each other. There were no more petty thoughts between them. Truthfully, she wasn’t a looker herself. It didn’t matter. They might be dead already. Outer might have them already. They didn’t know his limits. No one knew how September power worked. But they knew he was the strongest on the island. He could be reading their minds. He could be walking around on the beach while his mind was standing over them in the bush. He could be hearing their hearts beat. And their hearts were beating hard.\nMuradali nodded at the other two hunters, closed his eyes, and began the prayer; the Lord is my shepherd, saying it in his mind. It’s what the pastor said to do to protect themselves. That’s all they had against Septembers this strong, faith. This was God’s work they were doing. They were cleansing the nation. Satan had tainted the land with these creatures. And more of them kept coming. So many bad womb women. And they were getting stronger.\nDown in Siparia there was Khaki Pants Susan, who set people on fire when she looked at them. There was talk of a real monster in Delta Amacuro, hiding in the swamp, using his mind to make people slaves. He had a kingdom in the swamp, the Spanish said.\nOuter was the worst of all. He left people dead, so many people. You knew where he’d been from the bodies. Bodies on the street, in houses and in stores, there was not a mark on them. Their eyes were still open. He was a walking epidemic, passing3 people out.\nMany hunters had come for him. That’s how they knew his face. He’d been captured on many a device. The problem wasn’t getting his image. It was getting out with your life. No hunter ever did. Muradali himself had come to collect the bodies of friends. He’d said prayers over them while they stared empty into nothing. The same thing could happen to them now.\nChainani was the first to find his courage. He checked his rifle. He nodded to the others. He crawled southward, weapon in his left hand, stomach flat on the ground. Chainani was always the left side of the cone. Muradali was the right and Gomez the center. The idea was, if the September’s attack was a wave they would not be packed together. He might miss one or even two of them. This idea was hope and faith. Nobody knew how this Satan business worked.\nBut they were still alive. They had a chance. Once they could take their shot they were taking it. Maybe he had not seen them.\nPart III\nToozen saw the hunters long time, three flames creeping through the forest. Everything alive had a light, even the bush. But from people it was different, brighter, jumpy. Like it wanted to run. Like it wanted to feed. People light always stood out. So he saw them way off and he knew they would have to be dealt with. It made him breathe heavy. He wanted to walk the beach today and think about the old times. He didn’t want to have to go inside the muck, head deep, with these people and their thoughts.\nLet them come, he told the crabs and coconut dreams. Ah go deal with them just now.\nHe was a lover of peace. That’s where the name “Toozen” came from, Uncle Brian had told him. Like Auntie Heather, he was one of the older Septembers at the center. He was born with arms and legs frayed like the roots of a plant. So he couldn’t walk or work. But he could talk. He was a storyteller like Constable Antoine, with even more jokes.\n“Toozen boy, you know how you get that name?” he said one time. Uncle Brian appreciated the youth’s willingness to listen to any story from anybody—and even better, he was gullible as hell. “You get it from the Chinese! ‘Zen’ means peaceful in the Chinese language, and you real real quiet. So they named you ‘Too Zen,’ get it? ‘Too Peaceful,’ you see?”\nToozen laughed at himself. He was really a dotish child. Not stupid, but he would believe anything. Or maybe he just wanted the people telling him stories to feel good about themselves. It made him happy that Uncle Brian was happy. It was a hard thing having roots for arms and legs. What did it hurt, believing his stories?\nYou too blind, boy.\nHe missed them all from the center. He missed the days by the long mirror and the kitchen radio playing dancehall. Maybe that was dotishness too. Because as he got older it all changed. No, those were good times then. It was the circumstances that changed. Too many Septembers like him were being born. He remembered the first time he saw one on a screen during the news. It was a little girl lighting matches by looking at them. Toozen thought it was magical and wonderful. Not knowing people, he couldn’t see what it would mean. Septembers were no longer just ugly and unfortunate wretches. They were now threats. They were doing “Devil thing.” People were frightened.\nWhen they were of age, they sent Toozen and the others to the government secondary school. It was like throwing crabs into predator waters. And the Septembers, they just wanted to belong. They were not ready. Toozen remembered his friends, cornered and beaten. He remembered a girl like his sister, school shirt open and bra lifted, in a ring of boys, terrified but not fighting, trying even to smile. In remembrance he touched his head and felt the knobs and knots from the many beatings beneath his curls. He remembered his friend, a September like him, punching him along with the others. It was that bad, the need to belong.\nHow could he judge? Toozen would try as well to be friends with the bullies. They would beat him Wednesday and he would smile at them on Thursday. One time he even tried to explain to a girl about the flame. He told her, “you don’t understand. I see light in you.” And she smiled and snarled, and ran to get the boys for him. And they slapped Toozen, and they beat him and they left him on the ground.\nHe thought that if he could show he was not so different, not a threat, not bitter from the attacks, they would accept him. That wasn’t how it went. There was only fear or disdain, no compassion in between. That’s how people were, Toozen began to see. He could smile big until his jaw burned. He could talk soft until his voice disappeared. He could give everything—his labor, his love, and the little small change in his September poverty pockets. He could change everything except what he was, and that was all that mattered to them.\nThen they started attacking the center. Not school children, grown people. They threw big stones at the windows. They sprayed ugly words on the walls. Constable Antoine got into a fight with one and knocked him out with a hard cuff. That made the children happy for days. But he had been punched as well in his stomach and it made him sick. For Toozen it was strange because in the shows people got into fights all the time and they were alright afterward. Constable Antoine got more and more sick.\nToward the end they had to take the long maxi ride north on the coastal road to visit him at the Sangre Grande Hospital. It was terrible, the ugly glares they received. At least in the village they were accustomed to Septembers. Grande was a massive town overflowing with hostile eyes. Toozen, by that time, was old enough to recognize them. He was wise enough to see the danger in dwelling in the dreamy land of lights.\nBut he went to visit Constable Antoine anyway. Even when the others wouldn’t come, Toozen went. He sat by the old man’s bedside and listened to his troubles and his stories. Despite everything, he was still a listener. Constable Antoine had been a big man, not in height or build, perhaps not even in ways. Perhaps he was only a big man in the mind of the children he cared for on weekends at the center. He cooked souse and pig tail soup for them. He taught them how to play football. He told them footballers never said “sorry.” They said “hard luck.” It wasn’t bad manners, it was “man thing.” He taught it to the girls as well.\nToozen visited him as often as he could. He did his best to smile and listen and update him on life down at the center. Most times the updates were lies. He didn’t want the constable to know how bad it was. Most times Toozen had to fight away the tears. He could see the constable’s flame, dimmer and dimmer.\n“Aye, what I tell you about the soft man thing?” Constable Antoine told him once. Toozen thought he’d been holding it in but the old man had seen it anyway.\n“I’m not! I’m not!” the boy said.\nConstable Antoine reached out to push his shoulder as he’d often done down at the center in the old days. He couldn’t make it, so he had to lie back. But still he told the boy, “Toozen, you are a big brother down there now, you know. You are an uncle now. You have to be strong for the rest ah them.”\n“I know, I know,” he said that day. It seemed to him all his life people had been telling him to be strong.\n“You know? It don’t seem like you know, eh,” the constable winced when he chuckled. “You have a fighter in you. You have what you need. Why you think they named you Toozen?”\nThis, he knew for sure, “Because I am too peaceful.”\n“What?” The old man nearly found the strength to stand up on the bed.\n“Zen means peaceful in Chinese. So I am too peaceful.”\nAnd the ailing man produced the healthiest steups. “Who tell you that shit? Brian nuh? Boy your name is Toussaint! You are named for a warrior who fought for his people. Down in Martinique or one of them islands. Brian again with his damn wrong information.”\nToozen stopped his beach stroll. He closed his eyes to see. He looked over his shoulder without looking. The hunters were close enough. He would have to deal with them. No peaceful day on the beach for him.\nConstable Antoine, like Auntie Heather, like Uncle Brian, and so many more, were dead now. The shitty people killed them. Sometimes they used violence, sometimes neglect. The people got shittier and shittier, so that the Septembers had to run and hide in the bush. And in the bush Toozen finally stopped being so dotish. In the cold night forest he finally understood.\nThe flame was beautiful, but it was just a flame. It meant life, like a beating heart or a rising chest. But the harshest heart still beats. What mattered wasn’t the flame, but what was done with it. And he could feel with his mind, listen with his mind, for everything ugly and small and ruthless in a person. In truth the light was nothing more than the flame on a stove, like the old gas stove in the kitchen at the center, cooking a pot of hunger and fear. And bubbling like foam were the lies, lies to protect themselves from the truth of themselves.\nAnd Toozen realized as well, sitting starving in the forest, going over every cuff, kick, and snarl he had received, remembering everyone from the center that was now gone, contemplating teenage Heather defeated on the beach, that his own pot was bubbling. It was bubbling awful.\nAnd most importantly of all, Toozen learned that in the same way he could see people’s light with his mind, he could touch it. He could reach out with two fingers of the mind, and clamp over it like a candle flame. Out. He could take a deep breath with lungs of the mind, make a tunnel with lips of the mind, and blow out a whole birthday cake of candle flames. Out. And when he did, finally it was quiet. Finally the assault of stares and words and weapons ended. The boiling pot of ugly thoughts that spilled from shitty people no longer scalded him. Finally it was peaceful. And this was the only way, he realized, to make it peaceful. So he went through the town and made it peaceful. He turned it into the most Zen place.\nAnd these three that had come for him were interrupting his peace. They were shitty people. Their work was shooting Septembers. They were professional shitty people. He was picking up their broadcast now. They were frightened. They felt weak. It made them murderous with rage. One of the men was reciting prayers in his head. The other man wanted to show them who was the best by shooting Toozen in the face. The woman felt disrespected by both of them because she was a woman. She wanted to prove she was just as good by blowing out Toozen’s heart.\nNone of them even considered him a person. He was a dangerous thing made to collect bullets and hot light. All of them felt they were righteous and doing God’s work. They all lied to themselves this way. They hid from themselves the hunger for the money they were going to collect for murdering him. And down deep were the images, Toozen saw, of shots splashing like red water balloons into Septembers, many of them children. So many splashes and they felt each one in their chest and down in their sex. Each eruption was an eruption.\nPeople not nice. You nice, too too nice. And ah frighten for you. You don’t look like me but you are September too. They go hate you too. They go come for you too. You have to get hard, Toozen. They go mash you up.\nToozen remembered the words of Auntie Heather, poor Heather. And he smiled and shook his head. He chuckled like Constable Antoine used to do at the dotishness of the young boys of the center.\n“Mash me up? Nah.”\nAnd he sent three sets of two fingers, projections of the mind, up to the candle flames hiding in the bush. Out. Out. Out.\nFootnotes:\n1 - A “red” person is a Caribbean term for mixed race people, usually of African and European heritage.\nHollis Joel Henry is a writer living in Trinidad and Tobago. Born in the US to Trinbagonian parents, he has spent his life between both countries, giving him a strange accent and even stranger approach to writing. A lover of fantasy, science fiction and horror from early childhood, he later became enthralled by the themes, wit and craftsmanship of Caribbean, Latin American, African and South Asian storytelling. He does his best to reflect these influences in his work.\nCurrently he is the editor of the official news magazine of The University of the West Indies (UWI) St. Augustine Campus, UWI Today. This is his first published short story, the product of a long journey back."}