{"fingerprint": "HxawBRyfrg5XSbm/xoxmJv6h0f4=", "sitename": "Clarkesworld Magazine", "title": "The Completely Rechargeable Man by Karen Heuler", "author": "Karen Heuler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/heuler_12_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Completely Rechargeable Man by Karen Heuler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3780 words, short story\n The Completely Rechargeable Man\n He was introduced as Johnny Volts, and most guests assumed he was a charlatan—the hostess, after all, was immensely gullible. But some of the guests had seen him before, and they said he was good, lots of fun, very “current”—a joke that got more mileage than it should have.\n “Do you need any kind of extension cord?” the hostess, Liz Pooley, asked. She wore a skintight suit of emerald lame, and had sprayed a lightning bolt pattern in her hair, in his honor.\n Johnny Volts sighed and then smiled. They all expected him to be something like a children’s magician—all patter and tricks. “No extension cord,” he said. “Where can I stand?” He caught his hostess’s frown. “I need an area to work in—and appliances, not plugged in. I’m the plug. No microwaves. A blender, a radio, a light bulb. Christmas lights?”\n The guests were charmed at first and then, inevitably, they were bored. Even if it wasn’t a trick, it was pretty limited. He could power a light, but not a microwave. He could charge your cell phone but not your car. He was an early adopter of some sort, that was all; they would wait for the jazzed-up version.\n Johnny Volts had a pacemaker with a rechargeable battery, and he had a friend who was a mad scientist. This friend had added a universal bus to his battery port, and hence Johnny Volts had a cable and a convertible socket. He could plug things in; he could be plugged in. This was a parlor trick as far as the public was concerned—and a strange, unsettling, but still somewhat interesting way of earning a living as far as Johnny Volts was concerned. He knew—he understood—that his pacemaker powered his heart, and his heart recharged the pacemaker in a lovely series of perpetual interactions. He had no issue with it.\n In Liz Pooley’s party, as Johnny Volts lit a lamp, turned on a clock radio, and charged an iPod, he was watched by a frowning man in a checked shirt whose companion seemed quite happy with Johnny.\n “Why he’s worth his weight in gold,” she said. “Imagine never having to pay an electric bill.”\n “Small appliances,” the man grunted.\n “Well now it’s small appliances, Bob, but he’s just the first. Wait till he can really get going, he’ll have his own rocket pack. Remember rocket packs, Bob? The Segway of long-lost memory.” She put her hand on Bob’s arm and rolled her eyes. “I was but a mere child of course, when I heard about those rocket packs. Shooting us up in the air. A new meaning to the term Jet Set, hey? Or is that phrase too old? I bet it’s too old. What are we called now, Bob?” She lifted her drink, saluted him, and winked.\n “We’re called only when they’ve run out of everyone else, Cheree.” Bob was idly thinking about what would bring a man to this: plugging in small irrelevant things into his own violated flesh. “Irrelevant,” he said finally. “They call us irrelevant.”\n Cheree frowned. “You’re turning into an old man, Bob. You’ve lost your spark.” She gave him a small motherly peck on the cheek and walked forward, powerfully, her lemon martini firm in her hand, straight to Johnny Volts, who was looking around, waiting to be paid. “You looking for a drink?” she asked. “I could get you one.”\n “Oh—well, all right,” he said, surprised.\n “You wait right here,” she said. “I want to know all about you, electric man.” And she turned until she found a server and came back with a dark liquid in a tumbler. “Now tell me—how does it feel? I mean you’re generating electricity, aren’t you?”\n “Yes. Not much. After next week it should be more. I’m having an upgrade.”\n “Lovely. How does it feel? Like little bugs up and down your spine?” She had a heady grin, a frank way of working. Johnny liked it.\n “It’s a beautiful kind of pressure,” he said. “It feels like I could fill the room with it, lift everything up, kind of explode—only I hold on to the explosion.” His eyes got internal.\n “Do you like it?”\n He was open-mouthed with surprise. “Yes. Of course. It’s wonderful.”\n She tilted her head a little, studying his face, and he found it embarrassing at first, and then he got used to it. He looked back at her, not lowering his eyes or glancing away. She was older than he was, but she had a bright engaging air about her, as if she made a point of not remembering anything bad.\n “Here you go,” the hostess said, her arm held out full length with a check at the end of it like a flattened appendage.\n Johnny took it and turned to leave. “Hey!” Cheree said, grabbing at his arm a little. “That’s rude. Not even a fond farewell?”\n “They usually want me to leave right away,” he said in explanation. “Before I get boring.”\n “Boring,” she said companionably as they headed together for the door. “That bunch? They think other people are boring?”\n He noted that she was walking along with him as if she belonged there. “So where do you see yourself in five years?” she asked. “That’s a test question. So many people can’t think ahead.”\n “Do you think ahead?”\n “Not me. I’m spontaneous. Then again, I’m not at all electric, so I don’t have to worry about running out of juice.”\n “I don’t run out,” he said. “I recharge. And I’m getting an upgrade to photovoltaic cells next week. I have to decide where to implant them; do you mind if I run it past you?” He rubbed his hand over his head as they took the elevator down. “The obvious thing is to replace my hair—it’s a bit of a jolt, though. I can lose it all and get a kind of mirror thing on top—a shiny bald pate, all right. Or fiber optic hair. But it will stick out. Like one of those weird lamps with all the wires with lights at the end? What do you think?”\n “Fiber optic hair,’ she said without hesitation. “Ahead of the times. Fashion-forward. I bet there’ll be a run on the hardware store.”\n He stopped—they were on the street—and frowned at her. “Your name?”\n “Cheree.”\n “Cheree, you’re glib.”\n “I am glib, Johnny,” she said in a soft voice. “It’s because my head doesn’t stop. You know the brain is all impulses, don’t you? Bang and pop all over the place. Well, mine is on superdrive, I have to keep talking or I’ll crack from all the thinking. The constant chatter . . . I can only dream of stillness.”\n He shook his head in sympathy. “That sounds like static.” He stopped and reached out for her hand. “Maybe you produce energy all your own?” She held her hand out, and Johnny hesitated, then touched the tips of their fingers together. He closed his eyes, briefly. There was a warmth, a moistness, a lovely frisson. He took a deep breath. He felt so tired after those parties, but now a delicious delicate rejuvenation spread through him. The back of his neck prickled; the hairs on his arms—even his eyebrows—hairs everywhere rose, he could feel it in his follicles. It rose up in him until suddenly Cheree was thrown backward slightly.\n “What was that?” she said tensely.\n He nodded. “Sorry. Volts. A little discharge. It won’t hurt you.”\n “Still,” she said uneasily. “Can’t say I know what to make of it.”\n They were at a crossroads, specifically Houston and Lafayette. “Where do you live?” he asked.\n “East Seventh.”\n “I’m uptown.” They stood for a moment in silence. “Will you come with me?” he asked finally.\n Her face broke into a smile, like a charge of sunshine.\n They were utterly charming together, they were full of sparks. Toasters popped up when they visited their friends—though did people really still have toasters? Wasn’t that, instead, the sound of CD players going through their disks, shuffling them? Wasn’t it the barely audible purr of the fan of a car as they passed it, sitting up and noticing as if it were a dog? They were attractive, after all; they attracted.\n “If we moved in together,” Johnny said after they’d known each other for a month, “we’d have half the bills. We could live on very little, we could live on what I make at the parties. You wouldn’t have to work as a waitress. In fact, we could be free.”\n “And give up my dreams of rocket science?” she asked, her eyebrows arched.\n “I thought you were a waitress.”\n “That’s just till I sell my first rocket.” Nevertheless, she decided to move in, and it was working out fine, except for the strange way that objects behaved around them.\n Small electrics followed them like dogs sometimes—they could turn down the block and hear a clanking or a scraping behind them. Eager little cell phones, staticky earphones, clicking electronic notepads gathered in piles on their doorstep.\n “We have to figure out a budget,” Cheree said after she moved in. “Until I sell that rocket. Rent, not much we can do. We should get bikes, that will save on transportation. But, you know, we’re still paying for electricity, and it’s pretty high, too. What do we really use it for?”\n Together, they went through their apartment, noting: refrigerator, lamps, clock, radio, stereo, TV, microwave, coffee maker, hair dryer, iron, laptop computer.\n “Well,” Johnny said. “All quite useful in their own way, but we can make coffee without electricity. And I already recharge the computer myself.”\n She considered it all. “You can recharge most of it, really, if we get the right kind of thing. If we look at everything that way—I’m sure there are rechargeable lamps, for instance—why are we paying electric bills? We could save a lot of money by doing it ourselves.”\n They canceled their energy provider, a savings right there of $70 a month. They would plug a different item into Johnny at night, so they would never run out. It was a brilliant solution.\n That gave him even more motivation for the photovoltaic upgrade. When he went to his mad scientist friend, she went with him, and they mentioned the strange way they seemed to be accumulating electrical appliances. The mad scientist was sitting across from them, taking down Johnny’s recap of the past few months, when the scientist felt his skin begin to tingle. He shook himself briefly, as if buzzed by a fly. He was a graduate student at Carnegie Mellon, a Mexican genius who did illegal cable and satellite hookups to make some money, and was always looking over his shoulder. Johnny Volts was his ticket to fame and fortune; once the process was perfect, he would offer it to a medical or electronics company and bring millions down to his hometown of Tijuana, where he would go to retire.\n The scientist ran a voltmeter over Cheree and whistled. “This is lovely,” he said. “Exciting, even.” He grinned at Johnny. “She’s got a field. You see, you two match. You kind of amplify each other—understand?” He looked at them happily, waiting for them to catch up with his thinking. “You match.”\n It took a moment. “You’re saying we’re related? Like siblings?”\n “Oh—no, no, I mean your energy matches. It doesn’t mean anything really, other than that you’re sensitive to each other’s waves. You two have sympathetic electricity—I’m making the term up—so you use less energy when you’re together than you do when you’re apart, because you’re actually attracting each other’s charge. The byproduct is, you attract things that charge. Get it?”\n “Oh, honey, yes,” Cheree said. “I get it.” It was like their little electric hearts went thudder-thump when they came near each other. Cheree was aware of it as a little sizzle in her brain.\n They noticed a few things: He was a thoughtless hummer, and when he hummed he gave her a headache. She was an adventurer, wanting to go out and about, here there and everywhere, while he liked to think and write and test how strong his recharging was.\n It happened gradually, the feeling that they were being watched, were being followed. She had coffee and a man who looked familiar sat opposite her in the café. He went to a party and saw the same man in a different suit watching him carefully. His apartment door was dusted with a fine powder one morning; the following week it was on a window.\n When they went out in the morning, there was always a bunch of people passing their front door. Jauntily, as if just interrupted, they were speeding away, towards, around, moving with a great deal more purpose than on any other block. “Have you noticed it?” Cheree asked, and Johnny nodded. “I asked the landlord, and he said there’s been some kind of gas leak, they’re checking the lines a lot more. Even went into the basement, he said, all up and down the block.”\n “A gas leak?’ she said, sniffing. “I don’t smell anything.”\n “Well, that’s good then.”\n But then Johnny disappeared. Went out to a party and didn’t come back, and when she called the number listed in his daybook, she was told he hadn’t shown up.\n Cheree buzzed in her head when she was near Johnny; she could feel the tingle coming on when she turned the corner, half a block away, so it wasn’t surprising that she felt she could find him. She said to herself: these are the things I know: He has a charge, and I can sense it. He has a head of fiber optic hair. And I am his magnet.\n She took her bike and rode slowly, up and down streets, starting with the top of the island. Her head refused to buzz, block after block, in traffic and out, but then, after three hours—just as she rounded the corner near the docks on the west side—she heard a tang, she felt a nibble at her brain. It was him. She biked forward, back, left and right, testing out the buzzing, following it to the door of a small garage dealing in vintage cars.\n She parked her bike and chained it. She noticed an electric toothbrush rolling on the sidewalk.\n She walked up to a man in a very neat jumpsuit. She didn’t know anything about vintage cars. “I have to get a present for my dear old dad,” she said. “He loves cars. I thought maybe we could all—he had two families, so there’s plenty of children—get together and buy him something smashing.” She grinned.\n He shrugged. “You can take a look at what we’ve got, but my gut says you’re out of your league.”\n She smiled at him steadily, looking around, her eyes skipping to the doorway to an office or a back room. She could feel Johnny’s electric kick. She walked around the cars slowly until his charge was at its strongest. She whipped around “I know you have him,” she said, and drew in her breath, kicking a chair over to trip him as he lunged forward. She bolted for the door, which was unlocked, and burst in.\n There was Johnny, in the corner of the room. They had him wired up to machines that beeped and spit, they had his arm strapped to a chair.\n “I’m all right,” Johnny said when he saw her. She stopped, uncertainly, in the middle of the room.\n “What’s going on?”\n The man in the garage was behind her, and two men came at her from the side. They were all dressed in white jumpsuits, with ties showing through their zippered fronts. “We’re from the collection agency,” one man said. “For unlawful theft of electricity.”\n “We don’t need to pay for electricity,” she said. “We only use our own.”\n “Ha,” he said. “You don’t own it. You’re just stealing it and not paying it. You know what? We put meters into and out of your apartment, just to make sure. You were off the charts! We could hear the volts clicking! Don’t tell me you’re not using electricity!”\n “I tried to explain—” Johnny said wearily.\n “Did you plug into him yet?” Cheree interrupted. “Then you’ll see.” She looked around and picked up a small calculator on a desk, plugging it into Johnny’s socket. It whirred on, but the jumpsuits looked impassive. She began to enter numbers faster and faster, until finally she rang up Total. “See?” she said, as the men stepped forward almost politely, glancing at the strip of paper (who had such old calculators, anyway?) that had curled out the top.\n “Nice,” the second man concluded. He reached into his pocket. “I’m not with them,” he said. “I’m with NASA and we think you might have stolen a restricted project. We’re going to have to take you with us for national security.” He offered his card.\n “Hold on there,” said the third man, “I’m with the Office of Ocean Exploration. You can’t take him, see here—I’ve got a signed order to bring him in for questioning.” He shook his head. “I mean it’s an invitation. We admire the strides he’s made in making a self-sustaining renewable resource.” He gave a business card to Johnny and one to Cheree.\n The first man took out a gun. “He’s not going anywhere. He’s been taking electricity and we own electricity. It’s that simple. You can’t take him because he’s going to jail, our own facilities in a state-approved housing unit until his case comes to trial.”\n Johnny hung his head and groaned. “I’m no use to any of you,” he said. “These fiber-optic hairs—they’re no use underwater, you know—they need the sun to recharge. Totally useless.” The NOAA man looked a little annoyed at that, but he said, “Who said you had to be under the water; maybe they want you on top of the water?” but even he looked skeptical.\n “Plus, he’s on a pacemaker,” Cheree said. “You can’t have a pacemaker in orbit, if that’s what you were thinking. You’d kill him; what good would that be?”\n The electric company man was looking increasingly smug. “That leaves me,” he said with a smile. “And all I want is for the bill to be paid. Plus interest and penalties.”\n “There is no bill,” Johnny said wearily. “We canceled our account months ago. No account, no bills.”\n “That’s not how it works. You think electricity is free? Like air? Like water? Like land? Are any of those free?” He waved Cheree aside as she said “Air! Air is free!”\n “Nothing’s free,” he said. “The factories pay us for the air they pollute, and you have to pay for cleaning it—one way or another, someone’s paying for it. As for electricity, that’s never been free since Franklin put a key on a chain. Right now, you’re stealing our business by interfering with a regulated industry without a license. It’s against the law.” He looked very merry about it. “I lied about our state-sanctioned facilities. You just go to jail, same as the scammers and the knockoff artists, and you can light your hair up all you want and see what it gets you!” He laughed then, thinking about the possible results.\n “And you agree with this?” Cheree asked the men from NASA and NOAA. They looked at each other and shrugged. “Nothing in it for us,” one said. “We don’t interfere in the private sector,” said the other.\n “Then it’s just you,” Cheree said to the last man, who looked at the others with contempt.\n “It’s okay,” he said, reaching into his pocket. “I’m a reasonable man.” He held out a taser gun. “And this is a perfectly legal means of protecting myself.”\n Cheree looked at it and grinned. She glanced up and saw Johnny’s face. “Johnny Volts,” she said, cooing to him. “Johnny, sing to me!”\n Johnny began to hum, and she decided to join him, sympathetically. The men in jumpsuits felt the hairs on their necks begin to rise, then their leg hairs, then their head hairs. The man from the electric company looked around wildly, then took a step towards Johnny, his taser outstretched.\n The taser suddenly snapped and shot a small series of electric arcs out into the air until the utilities man yelped and dropped it. Cheree released Johnny, who rose from his seat and said, “Sorry. But there was a buildup. And Cheree is an amplifier. And I think I got a shot of adrenaline or something that caused an overload.”\n The other two men looked at each other. “Time to go, I think,” one said and the other nodded. They walked off together slowly, as if not wanting to make a sudden move.\n “I’m really sorry,” Johnny said to the man writhing on the floor.\n “If I could get up I’d clobber you,” the energy man said. “This isn’t over. I’ll hunt you down and do something.” He panted. “Just as soon as I can move again.”\n They followed the mad scientist down to Mexico, all of them imagining the utilities man hot on their trail. Even Tijuana seemed unsafe, so the mad scientist took them to a small town in the mountains, where he continued his work.\n He gave Cheree a pacer, too, and he linked their charge, which was now big enough to fire a microwave, if there’d been a microwave around. But they had a bigger plan. In their mad dash down to the border they’d seen how much gasoline cost; wasn’t Johnny the wave of the future and the future’s savior? And wouldn’t the mad scientist get rewards and jobs and money up the wazoo if he could find a way to recharge a car without looking for an outlet?\n He plugged Johnny into the car he rigged up and called it the Voltswagon. Johnny could only get it to move slowly at first; but once the mad scientist hooked up Cheree to Johnny, and Johnny to the car, they were able to whiz to Tijuana and back at a merry clip. It took four years, but the cars ran and Johnny and Cheree were unharmed, and the mad scientist refined the recharging process to accommodate one person for one car\n Little by little they converted the inhabitants of Tijuana to fiber optic hair and plug-in Voltswagons. Big Oil shut down the borders to keep Americans from going to Mexico to buy cars, but late at night, and hidden in the back of trucks, Americans snuck across the border to buy their Voltswagons and bring them home.\n Karen Heuler's stories appear in literary, fantasy, and science fiction magazines regularly and have won various awards, including an O. Henry. Her 2014 novel, Glorious Plague, was about a strangely beautiful apocalypse, and her second story collection, The Inner City, was chosen as one of the best books of 2013 by Publishers Weekly."}