{"fingerprint": "32AWrGJ/0OPk9qR2s/uT/o+oNcI=", "sitename": "Clarkesworld Magazine", "title": "The Wine-Dark Sea: Color and Perception in the Ancient World by Erin Hoffman", "author": "Erin Hoffman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/hoffman_01_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Wine-Dark Sea: Color and Perception in the Ancient World by Erin Hoffman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n The Wine-Dark Sea: Color and Perception in the Ancient World\n “And jealous now of me, you gods, because I befriend a man, one I saved as he straddled the keel alone, when Zeus had blasted and shattered his swift ship with a bright lightning bolt, out on the wine-dark sea.”—Homer, The Odyssey, Book V\n Perception is a funny beast. Homer’s “wine-dark sea” has puzzled scholars for centuries, leading to such far-flung hypotheses as strange weather effects, air pollution, and mass Grecian color-blindness.\n It’s a phrase repeated in the works of W. H. Auden, Patrick O’Brian, and Brian Jacques, among others. Reading it today, we naturally assume that it is intended as allegory, some evocative reference to the sea’s mystery, its intoxication.\n We may never know for sure, but one peculiar fact casts the mystery in an interesting light: there is no word for “blue” in ancient Greek.\n Homer’s descriptions of color in The Iliad and The Odyssey, taken literally, paint an almost psychedelic landscape: in addition to the sea, sheep were also the color of wine; honey was green, as were the fear-filled faces of men; and the sky is often described as bronze.\n It gets stranger. Not only was Homer’s palette limited to only five colors (metallics, black, white, yellow-green, and red), but a prominent philosopher even centuries later, Empedocles, believed that all color was limited to four categories: white/light, dark/black, red, and yellow. Xenophanes, another philosopher, described the rainbow as having but three bands of color: porphyra (dark purple), khloros, and erythros (red).\n The conspicuous absence of blue is not limited to the Greeks. The color “blue” appears not once in the New Testament, and its appearance in the Torah is questioned (there are two words argued to be types of blue, sappir and tekeleth, but the latter appears to be arguably purple, and neither color is used, for instance, to describe the sky). Ancient Japanese used the same word for blue and green (青 Ao), and even modern Japanese describes, for instance, thriving trees as being “very blue,” retaining this artifact (青々とした: meaning “lush” or “abundant”).\n It turns out that the appearance of color in ancient texts, while also reasonably paralleling the frequency of colors that can be found in nature (blue and purple are very rare, red is quite frequent, and greens and browns are everywhere), tends to happen in the same sequence regardless of civilization: red : ochre : green : violet : yellow—and eventually, at least with the Egyptians and Byzantines, blue.\n “Why then 'tis none to you; for there is nothing either good or bad, but thinking makes it so.”—Hamlet, Act 2, Scene 2\n Blue certainly existed in the world, even if it was rare, and the Greeks must have stumbled across it occasionally even if they didn’t name it. But the thing is, if we don’t have a word for something, it turns out that to our perception—which becomes our construction of the universe—it might as well not exist. Specifically, neuroscience suggests that it might not just be “good or bad” for which “thinking makes it so,” but quite a lot of what we perceive.\n The malleability of our color perception can be demonstrated with a simple diagram, shown here as figure six, “Afterimages”. The more our photoreceptors are exposed to the same color, the more fatigued they become, eventually giving out entirely and creating a reversed “afterimage” (yellow becomes blue, red becomes green). This is really just a parlor trick of sorts, and more purely physical, but it shows how easily shifted our vision is; other famous demonstrations like this selective attention test (its name gives away the trick) emphasize the power our cognitive functions have to suppress what we see. Our brains are pattern-recognizing engines, built around identifying things that are useful to us and discarding the rest of what we perceive as meaningless noise. (And a good thing that they do; deficiencies in this filtering, called sensory gating, are some of what cause neurological dysfunctions such as schizophrenia and autism.)\n This suggests the possibility that not only did Homer lack a word for what we know as “blue”—he might never have perceived the color itself. To him, the sky really was bronze, and the sea really was the same color as wine. And because he lacked the concept “blue”—therefore its perception—to him it was invisible, nonexistent. This notion of concepts and language limiting cognitive perception is called linguistic relativism, and is typically used to describe the ways in which various cultures can have difficulty recalling or retaining information about objects or concepts for which they lack identifying language. Very simply: if we don’t have a word for it, we tend to forget it, or sometimes not perceive it at all.\n The famed neuroscientist Dr. Oliver Sacks (you might know him as Robin Williams’s character in Awakenings) described a poignant example of linguistic or conceptual relativism with regard to schizophrenia. Accounts of the disease prior to the 19th century are rare, and none at all exist in ancient literature (as opposed to “madness,” which was documented, but primarily concerned aimless wandering and spontaneous violence). The broad classification of “madness” persisted well through the 19th century, with schizophrenia identified in the early twentieth, and still considered rare through the middle of the century. When Sacks began practicing in 1965 in New York City, and in particular began studying disorders related to schizophrenia, he was shocked by a gradually increasing awareness that the disease was not nearly as rare as the science of the day claimed—especially among the homeless. Importantly, the clinical assumption that “schizophrenia is rare” was reinforcing the rarity of its diagnosis, to the point of blinding doctors to what was right in front of them. These blooms in diagnosis—we have been for the last ten years experiencing a bloom in autism recognition—have as much to do with clinical perception as they do with the actual physical incidence of the conditions.\n On a lighter note, Sacks also recently recalled that the most magnificent thing he had ever seen in his life was a field of yellow, seen while he was—is it appropriate to say a famous neuroscientist was high? Say rather that he was conducting experiential research in a varied state of neurochemical condition! But however you slice it, he says it was the most yellow yellow he had ever seen or expects to see again, a yellow beyond description, a yellow of interstellar radiance and the breath of ancient gods.\n It isn’t the first time that Dr. Sacks has discussed color and altered states: in “The Dog Beneath the Skin,” he tells the infamous story of the 22-year-old medical student who, under the influence of PCP and amphetamines, enters a week-long heightened state of awareness. Among other things, this student—decades later revealed to have been Sacks himself, of course—perceived “dozens of browns” where previously he had seen only one shade. (Dr. Sacks does not now recommend this type of student experimentation.)\n This particular super-sensory color perception is, too, reminiscent of another physical condition related to color: tetrachromacy. Most humans are trichromatic, possessing three types of color-sensing cone cells—but an undetermined percentage of women, as well as almost all birds, are tetrachromatic, possessing four receptor types. Tetrachromats perceive a kind of fourth primary color, usually a blue-green, that gives them a heightened ability to distinguish between shades of color, often to the point of distinguishing separate shades where a trichromat will perceive identicality.\n “The evolution of sense is, in a sense, the evolution of nonsense.”—Vladimir Nabokov, novelist, synesthete\n We need not travel far to determine whether these enhanced states of perception—which, given that we remain the same species as Homer, can be societal or psychological in their impetus—can impact our worldview, or our creative selves.\n We know that people with synesthesia, a neurological anomaly in which one sensation “bleeds” into other sensations, are eight times more likely to pursue careers in the arts than non-synesthetes. Synesthesia comes in many varieties, but those with a visual variant (for instance perceiving numbers and letters in colors) are more likely to become visual artists—or novelists.\n Vladimir Nabokov, novelist and synesthete, wrote his synesthesia into his characters on occasion, and some of his descriptions—such as the word “loyalty” suggesting “a golden fork lying in the sun”—indicate that this crossing of senses, infused with color, certainly influenced Nabokov’s construction of language. Words themselves could be beautiful or garish depending upon their letter-level construction.\n Some scientists have postulated that this phenomenon of carrying meaning from one sense into another—which is essentially the definition of a metaphor—is universal and contains insight into the deepest workings of our minds. In the case of the common grapheme-color synesthesia, such as Nabokov’s, a likely explanation is the close proximity of portions of the fusiform gyrus that deal respectively with word and color recognition in the brain. When a synesthete reads a word, some of the electrical energy from that word-recognizing region is possibly leaping over into that color recognition region. One remarkable side effect of this is that many synesthetes tend to perceive the same colors for letters (“A” tends to be red), which underscores the structural theory—and might suggest that this same phenomenon is at work in all of us below the level of our conscious awareness.\n While the causes of synesthesia remain unknown, it is generally agreed that the physical basis is a kind of excess of interconnectedness between neurons. It may be that the “pruning” we undergo as children does not complete, leaving connections behind that in the mainstream population are eradicated—but provoked synesthesia in the cases of drug use or epileptic seizures suggest that non-synesthesian brains are capable of synesthetic effects.\n A 1929 experiment by Gestalt psychologist Wolfgang Köhler elegantly illustrates what some call our natural synesthesia. Köhler drew two random shapes: one spiky and sharp, the other flowing and rounded. He then asked subjects to guess of these shapes which one was called “kiki” and which was called “bouba.” The results were very clear: 95-98% of subjects identified the sharp shape as “kiki” and the rounded shape as “bouba.” (Fascinatingly, autistic individuals make this match only 56% of the time.)\n Köhler’s experiment wrapped science around what we would call onomatopoeia: when a word sounds like what it is. But onomatopoeia is by definition synesthesia, the transference of sound into orthogonal meaning.\n The modern neuroscientist Dr. Vilayanur Ramachandran suggests that Köhler’s experiment shows that, to a certain extent, we are all synesthetes, and further that this inherent interconnection between our cognitive functions is intrinsic to the most beloved traits of humanity: compassion, creativity, ingenuity. What, after all, is an idea, but one flash of thought leaping across the mind to suggest novel possibility?\n “The aim of art is to represent not the outward appearance of things, but their inward significance.”—Aristotle\n So, if we’re all synesthetes, and our minds are extraordinarily plastic, capable of reorienting our entire perception around the addition of a single new concept (“there is a color between green and violet,” “schizophrenia is much more common than previously believed”), the implications of Homer’s wine-dark sea are rich indeed.\n We are all creatures of our own time, our realities framed not by the limits of our knowledge but by what we choose to perceive. Do we yet perceive all the colors there are? What concepts are hidden from us by the convention of our language? When a noblewoman of Syracuse looked out across the Mare Siculum, did she see waves of Bacchanalian indigo beneath a sunset of hammered bronze? If a seagull flew east toward Thapsus, did she think of Venus and the fall of Troy?\n The myriad details that define our everyday existence may define also the boundaries of our imagination, and with it our dreams, our ethics. We are lenses moving through time, beings of color and shadow."}