{"fingerprint": "4ngmpWpHS4/VduI5CiO52MKtW2Y=", "sitename": "Clarkesworld Magazine", "title": "A Star for Every Word Unspoken by Kai Hudson", "author": "Kai Hudson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/hudson_05_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Star for Every Word Unspoken by Kai Hudson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5750 words, short story\n A Star for Every Word Unspoken\n They say Omma’s in there, but she’s not, she’s not. It’s just an empty metal capsule they’re lowering into the ground, and the rain is too wet and the flowers too bright and the wailing of the mourners—it’s so much, too much, and Na-Yeong slaps Appa’s hand away and shuts her eyes and—\n Blink.\n She flies forward with the force of the stop. The sling catches her, thick belts snapping back to punch the air out of her chest and Na-Yeong gasps, gags, tastes the sweet-sour acid of last night’s nutrient fluid flood the back of her mouth.\n With effort, she swallows it back. Closes her eyes and breathes. Taps her thumb to the other fingers of her left hand in quick succession: pinky, ring, middle, index. Then backward: index, middle, ring, pinky. Repeat with the right: outward in, inward out.\n The world settles, if only faintly.\n She’s freezing. Even with the insulation of the slingsuit her body won’t stop shivering, and Na-Yeong rubs furiously at her arms, hissing through chattering teeth. Her slingsuit is the most advanced model available, but even its thick multiple layers and advanced nanotechnology weren’t designed to sustain a single lone human in deep space for more than a couple of days. And the pod itself was meant to transport the slipdrive, not a human being, so there are no life support systems. Right now the only things keeping her alive are the suit, the bladder of nutrient fluid that’s already running out of replication base, and her mission.\n It’s waiting, somewhere out there in the vastness of empty space. She just has to get there and catch it.\n “C-Computer,” she murmurs. The words taste thick and gooey, like overcooked juk. “Distance from. Distance. D-Distance from Earth.”\n “Ma’am. We are approximately three point eight-seven-seven-one lightyears from Earth.”\n Too soon. Far too soon. Na-Yeong swallows down the scream crawling up her throat. It’s her ninth jump already, she can feel it in her bones and the roots of her teeth, so why hasn’t she gotten it right yet? Why isn’t she better, smarter, faster—if she had been then maybe Omma would still be—\n No. No, no, no. The modern English word “no” derives from Old English “na,” which in turn derives from Proto-Germanic “ne” and “aiw.” She taps her fingers: outward in, inward out. Ne+ aiw, identical to “nay,” same roots, same usage. No, no, no.\n The insects crawling beneath her skin finally settle, temporarily calmed by the soothing rituals of repetition and concrete information. Facts don’t change. Facts are safe. Fact: this jump has failed. Fact: the slipdrive still works. Fact: she can keep going.\n “Recalculate,” she blurts, birthing the word from her lips like an alien infant. “C-Countdown. Recalculate. Initiate c-c-countdown.”\n The computer doesn’t hesitate. She has always liked computers. They never misunderstand her when she speaks. They never look at her like something unrecognizable.\n A slow hum starts up from somewhere behind her, buried in a messy forest of struts and wires. “Coordinates recalculated,” the pod tells her. “Engaging slipdrive in three . . . ”\n Na-Yeong closes her eyes.\n “Two . . . ”\n Blink.\n “Na-Yeong-a!”\n Through the haze of pain and noise and terror and why is there so much, she barely registers the voice. Fingers seize her wrist with a grip stronger than steel, slowly but firmly pulling her arm back from her mouth. “Na-Yeong, stop!”\n Everything tastes of blood, the scent of it coppery and thick in her mouth, but that’s okay. It’s better than the rest, the other kids’ laughter that grates like glass, the too-scratchy uniform and too-tight shoes, and above all that the buzz, the endless humming zzz-zzz-zzz like the whole classroom is swarming with bees, like they’re looking for her, hunting her, trying to cover her in squirming fuzzy bodies and eat her up alive—\n “Choe Na-Yeong.” Omma’s face resolves itself from the chaos: long red-brown hair, rumpled blouse, eyes kind above her smile. “Na-Yeong, what is it? Where’s the wrongness? Tell me. Tell Mommy where the wrongness is.”\n Over Omma’s shoulder, Teacher frowns, crossing his arms. “There’s nothing wrong, Mrs. Kim,” he says, with that little twitch of his jaw that says he’s trying not to raise his voice. “Your daughter just started having a screaming fit in the middle of reading time. This sort of behavior—”\n “My daughter,” Omma answers, and though she still smiles, her voice has the sharp edge of a diamond blade, “always knows when something is wrong, Teacher. You just have to ask. Na-Yeong, where is the wrongness?”\n “Bzzz,” Na-Yeong answers. Little flecks of blood fly from her lips, joining the deep red bite marks already decorating her forearms. “Bzzz, bzzz.”\n Omma blinks and looks around. Teacher’s frown goes all curly like he ate something bad. “Mrs. Kim—”\n “There.” Omma squeezes Na-Yeong’s wrist, just a reminder, an assurance, before rising and crossing the room in three strides. As the other six year olds look on with wide, scared eyes, she reaches up and flips a switch on the bright UV light hovering over the green plants by the window. The beehive goes finally, blessedly silent.\n “Mrs. Kim! That light feeds our sprouts! We are teaching the children—”\n “That plants can live off of the sunlight coming through the window perfectly fine,” Omma finishes, coming back over. As Teacher splutters, she kneels down, still smiling. “Is there less wrong now, Na-Yeong?”\n Na-Yeong nods. There’s still so much going on here, the feel of her clothes, the stares of the other students. But it’s not too much anymore. She can handle it. If she can just bite a little more, have a bit more of that pain to drown out the noise between her ears—\n Omma’s smile trembles. “No, Na-Yeong-a,” she says. “No biting. That’s not good. Here. Remember what we learned? Tap, Na-Yeong. Let’s tap our fingers.”\n Omma’s hands wrap around hers, encouraging, guiding. Thumb to pinky finger, then ring, then middle, then index. Outward in, inward out. “Good. Now the right hand. That’s it.” Outward in, inward out. Breathe. Breathe.\n “We’re okay,” Omma says, and Na-Yeong nods because we are, we are.\n “We’re okay,” she says.\n “Mommy loves you.”\n “Mommy loves you. Mommy loves you.”\n “She does that all the time,” Teacher grumbles. “The mimicking. The other kids think she’s making fun of them.”\n Omma sighs. It’s a tired sound, like all the air inside her is rushing out through a leak. Na-Yeong reaches out and presses a palm to Omma’s chest, feels the steady thrum of her heartbeat through the rumpled blouse. “Badum, badum,” she says, before pressing her other palm to her own heart. “Badum, badum, Mommy.”\n There are sudden tears in Omma’s eyes. “Yes, Na-Yeong-a,” she whispers. “Thank you.” Then she tilts her head and squeezes Na-Yeong’s hand. “Hey, how about coming to work with me for the rest of the day?”\n And Na-Yeong—\n Blink.\n It’s the worst stop yet, her body a lump of loose jelly jerked back and forth by the slings. Na-Yeong gags and loses the battle—acid and chalky nutrient fluid fly from her mouth as she retches and heaves, pale pink globules forming briefly inside the helmet before the slingsuit sucks them out in a burst of forced air.\n She can barely see, everything spinning wildly all around. The suit seems to weigh a thousand pounds even in zero gravity. She coughs around the sticky thickness of saliva and vomit. “B-Badum,” she whispers. Her fingers tremble and begin to tap. “Badum, badum, M-Mommy . . . ”\n “Apologies, ma’am,” says the pod. “I do not understand those commands.”\n Inward out, outward in. Or was it the other way around? Na-Yeong forms the words like lumpy dough, like when Halmeoni used to let her help in the kitchen making sweet songpyeon. “D-Distance. Earth. Distance.”\n “Ma’am. We are approximately six point zero-zero-eight-nine lightyears from Earth.”\n Too far. Tears sting her eyes, more salty little drops for the suit to eat. Now she’s too far. What if the slipdrive never gets it right? What if she never finds it, never gets to . . .\n No. She has to keep going. There is nothing else. Next jump. Next jump.\n “Re.” It’s a bare croak; she takes a breath, thin and reedy, and tries again. “Re-Re-Recalculate.”\n “Acknowledged.” A brief pause. “Coordinates recalculated. Engaging slipdrive . . . ”\n She loses consciousness before the countdown can start.\n Blink.\n Omma waves her chopsticks, barely avoiding hitting Na-Yeong with kimchi juice. “What would you do,” she says, “if you could travel anywhere in the universe in the blink of an eye?”\n The cafeteria is overrun this time of day, crammed with engineers and researchers and technicians, all arguing and conversing over their food, all trying to solve one problem or another. Though she’s only been here a few times, already Na-Yeong loves it. The people don’t grate on her, not when they talk about numbers and theories with the fluency of a native language. And the layout of the labs, the lighting grid, even the ventilation system—it’s all so efficient, so predictable. Solid and unchanging.\n Maybe she can work here one day. Maybe she won’t have to go back to school, school where the other kids look at her like a monster, and Teacher keeps asking why she can’t just be normal, like it’s a lesson she missed but can make up for with a report.\n “Na-Yeong.” Omma’s voice goes soft yet sharp, the verbal equivalent of a tug on her sleeve. Omma knows Na-Yeong doesn’t like to be touched, not unless she asks for it. Omma knows a lot of things. “Na-Yeong, are your thoughts focused on me?”\n Another one of her mother’s tricks: Na-Yeong sometimes has difficulty parsing Are you with me, too many possible interpretations. She nods, and Omma smiles.\n “Okay. See here?” She tears a sheet of paper from her notebook; Omma is the kind of person who prefers paper to tablets, which Appa chuckles about but always indulges. “Let’s pretend this is an area of space. Currently, if you’re in a spaceship and you want to get from one point in space to another, what do you do?”\n Na-Yeong touches her finger to one spot and draws it along the length of the page. Omma nods. “Correct. You have to go straight, for all intents and purposes. But what if you didn’t have to? What if you found a shortcut?”\n “W-W-Wormholes.” Omma has a lot of astrophysics books at home; Na-Yeong has read them all.\n “Not quite, although it’s the same basic theory.” Omma touches her finger to the same spot from before. “Let’s say you want to get from here—” She indicates another point near the opposite edge of the sheet. “—to here. But instead of going straight, you instead choose to curve.” She slowly curls the paper over so that both points align.\n Na-Yeong frowns. “W-Wormholes.”\n Omma shakes her head. “Generating a wormhole would require an immense amount of energy, not to mention a mess of calculations we just don’t have the processing power to achieve,” she says. “Think about it. Spontaneously building a tunnel from one part of space to another? That’s a lot of work.\n “But what if, instead, you curved even further?” Omma curls the paper until it forms a cylinder. “You bring Point B directly onto Point A, completely superimposed in space-time. Then you no longer have to worry about building anything. You’re already at your destination.”\n She smiles then, a spark in her eyes that warms something in Na-Yeong’s own heart, something she can’t express but she knows Omma will understand regardless. That’s what it means to be a mother. “At that point, it’s simple, really. All you have to do is—”\n Blink.\n Another sickening jolt. Na-Yeong groans weakly in the confines of the slingsuit. Her stomach rolls but there’s nothing left inside her.\n Where is she? The pod has no windows, no screens for display. She coughs, thick and wet. Uh, oh. That doesn’t taste like spit.\n How many jumps now? Twenty? Thirty?\n Where is she?\n “Commands, ma’am?” the pod asks.\n Na-Yeong breathes. Her lungs scream and her head throbs, entire body a single raw, exposed nerve. Maybe she doesn’t even have a body anymore. Maybe she has dissolved into a gooey mess, with what remains of her brain only able to send a single directive: find it, find it, find it.\n God, she wants to give up. She can still go home, can’t she? Appa will be waiting for her. Appa with his cheekbones stark, his eyes so full of grief. Appa who has lost, just as she has.\n “Commands, ma’am?” the pod prompts once more.\n “D-Diss . . . tance . . . ”\n “Ma’am. We are approximately five point one-two-one-nine lightyears from Earth.”\n Oh God, that’s close. Closer than she’s ever been. Something flickers in Na-Yeong’s chest, something small and weak and unmistakably warm. Something like hope.\n Not close enough, but almost. Almost.\n “Re . . . Re . . . calculate.”\n As the computer drones its acknowledgment, Na-Yeong concentrates on breathing. She must survive this. If she dies, no one else will ever remember Omma. Not like Na-Yeong can.\n Omma, Na-Yeong thinks, as the countdown starts and blackness rushes up. My thoughts are focused on you. My thoughts—\n Blink.\n “Honey!” Appa hurries up to them, one gloved hand pushing up his round, wire-framed glasses. “Honey, you’re not bringing her in here again?”\n “Why not?” Omma glances at Na-Yeong. “I already cleared it with management.”\n “She’s too young—”\n “She’s thirteen,” Omma corrects him gently, “and got into yet another fight at school. What was I supposed to do, Choe Man-Soo?”\n All the fight goes out of Appa at that. His shoulders slump and he looks at Na-Yeong with such sadness. It’s like her father is just made of sadness some days, like God long ago decided to build him out of other people’s tears. “Oh, Na-Yeong-a. Did they make fun of you again?”\n Na-Yeong looks away. There are boys at school who don’t like a girl who can solve complex math equations in the blink of an eye. There are boys at school who don’t like a girl who barely talks, and stutters and echoes others when she does. There are boys at school who don’t like a girl.\n Appa sighs. “Can you keep her out of the testing lab at least? Viewing window only. Mr. Oh complained last time about having a child in the same room as the prototype.”\n Omma rolls her eyes. “Na-Yeong could calculate circles around all of our engineers and you know it,” she says, but backs off at Appa’s pleading look. “All right, honey. I’ll keep an eye on her.”\n Appa grins and turns to Na-Yeong. “Say, how about after Omma shows you the slipdrive, you come by my lab? Maybe if you’re good, I’ll even let you try out a suit.” He indicates the clear double doors behind him. Na-Yeong glimpses a bunch of people in dark-blue uniforms, some with tablets, others soldering and welding behind thick protective gear. Beyond them, stuck to the smooth metal test wall like globs of spit, are several black suits wrapped around pale-yellow dummies, dozens of thick belts extending out to keep their cargo safely suspended.\n Appa works on slingsuits, specialized gear that will allow future space-goers to withstand the horrible forces of slipdrive jumps and survive in deep space, without needing the additional weight of seats or sleeping bags or latrines. He met Omma when one of his prototypes failed, shooting a belt out through the wall of his lab and nearly impaling her as she walked by. Na-Yeong has never understood how they ended up married, but they love each other, it’s obvious in Appa’s gentle touches and Omma’s warm smiles, so she doesn’t ask.\n Satoshi greets them in the viewing room. “Dr. Kim,” he says, bowing low. He’s one of the junior engineers under Omma’s supervision, fresh out of graduate school, who speaks Korean with a funny accent.\n His gaze stutters only briefly on Na-Yeong before he turns to the window. Beyond is a giant metal room absolutely crammed with researchers and engineers, all of them conversing and arguing and taking notes, and at the center stands a thick nest of metal struts and wires, coiled and knotted together in a tangled mess. Na-Yeong can’t see what’s inside.\n “So I think we finally fixed the coolant issue,” Satoshi says. “Kang generated a new matrix and rerouted the auxiliary valves. We should be ready for preliminary testing in—”\n “Engineer Tanaka.”\n The man striding up to them is Mr. Oh, Omma’s boss. Na-Yeong recognizes him because of his tendency to favor his right leg when he walks, an old injury he claims comes from his time in the military. Na-Yeong doubts that, personally. Mr. Oh doesn’t seem like the type of man who would ever show allegiance to anyone other than himself.\n Behind him walks a man who looks like the president, except not nearly as fit and with many more wrinkles. He’s accompanied by a gaggle of reporters and aides, whom he ignores with the ease of long practice.\n “It’s good to see you hard at work, as usual.” Mr. Oh indicates his sharply dressed companion. “This is Assemblyman Kim. I invited him here today to tour the building and gain a better understanding of the slipdrive.”\n “The people deserve to know exactly what their taxes are funding,” says Kim. Na-Yeong steps back behind Omma. She doesn’t like this Kim. He speaks like they’re in a drama and he’s the only one with a script.\n Satoshi and Omma both bow; the young engineer then glances at Na-Yeong’s mother. “We’re honored by your visit, Assemblyman,” he says. “This is Dr. Kim, our senior engineer and lead developer on the project. She can—”\n “I’m interested to know how the slipdrive actually works,” the assemblyman interrupts. “I understand there have been several hiccups in developing the theory.”\n “Ah, pardon my boldness, but the theory is in fact quite sound,” Satoshi says. “In fact, Dr. Kim authored one of the first papers on space-time supracurvature over ten years ago.”\n “Hm, good.” Mr. Oh glances briefly at Omma with a bored smile before turning back to Satoshi. “I’m sure you can tell us all about the project’s latest advancements. You see, sir, Engineer Tanaka is one of our best and brightest. We recruited him straight out of UTokyo.”\n Na-Yeong frowns and looks at Omma. Why has her mother not said anything? Why is she just standing there staring at the ground, letting Satoshi do all the explaining? She’s the one who always gets so excited about the slipdrive, making Appa roll his eyes indulgently as she raves about blueprints and tests over meals. Where is that energetic woman now? Who has taken Na-Yeong’s mother, the fearless Dr. Kim who memorizes theories and makes connections and gives orders in the lab, and replaced her with this meek, quiet woman who won’t even look Mr. Oh in the eye?\n “Well.” Satoshi, to his credit, looks to Omma once more for guidance. Receiving none, he bows once more to his superiors. “So far we think we’ve got a working curler—that’s what we call the pod the slipdrive is housed in, which is responsible for actually curving that other part of space over and into the reach of the drive itself. With regard to the actual jump, we’re, ah, still working on the calculations—”\n “Stupid.”\n Everyone turns. Omma stiffens. Na-Yeong looks at the floor. “S-Stupid,” she repeats.\n “Mrs. Kim.” Mr. Oh’s smile is a pasted-on thing as he waves toward the door. “Perhaps you should escort your . . . child out of the lab. You see, Assemblyman, we want to hire more women here, of course we do, but sometimes their family obligations simply—”\n “Stupid.” Na-Yeong points at the whiteboard standing a few feet away, covered in scribbles and numbers in Omma’s handwriting. Satoshi can’t do that. Neither can Lee or Park or Jung or anyone else, and why doesn’t she say anything? “Omma, tell. Omma, tell!”\n “Mrs. Kim.” There’s something jagged to Mr. Oh’s smile now, like the edges of a broken window, and it finally gets Omma moving.\n “Please forgive me, Director,” she says. “My daughter, she has a—a condition—”\n She’s reaching for Na-Yeong, but Na-Yeong isn’t having it. Where is her mother? She wants her mother! “Omma, tell! Tell tell tell, stupid stupid, tell—”\n And then she’s screaming, and Omma is shouting, and the assemblyman is shouting, and Oh is shouting the loudest of them all, yelling for security, yelling at Omma to get that little brat out of here or so help me, and it’s too much, and Na-Yeong clamps her hands over her ears and squeezes her eyes shut and—\n Blink.\n She’s dead, she has to be. Why else would everything hurt so? Why else would it feel like she’s falling apart at the seams, all her individual cells dissolving into the cold emptiness of space?\n “Commands, ma’am?”\n Oh, God. Still here. Still searching. Where . . . Where is she? Why does she hurt?\n She wants it to stop. She wants Omma.\n “Ma’am. Extrapolating command based on previous history. We are approximately five point zero-zero-two-three lightyears from Earth.”\n Somewhere through the haze: a spark. That’s close, so close. Maybe, finally, close enough. Maybe . . .\n “S . . . Sc . . . an.” Someone else speaks the words; Na-Yeong simply hangs in the slingsuit and listens. “Radio. Pre. P-P-Preset fre . . . quency.”\n “Ma’am. No broadcasts detected on the frequency you requested.”\n No. Not right. Try again. Try again.\n “Ma’am. Extrapolating command based on previous history. Confirm recalculation?”\n “Y . . . Y . . . Yes.”\n “Coordinates recalculated.”\n One more, then she’ll go home. Or maybe she’ll die. That doesn’t sound so bad.\n Blink.\n Na-Yeong misses her mother.\n They don’t talk anymore. Or, well. Her mother tries. She leaves voicemails throughout the week that Na-Yeong deletes without opening. She comes to Na-Yeong’s door and knocks and her voice comes through muffled, but Na-Yeong ignores it. This woman who accepted Oh’s censure without complaint, who now sits at a desk reviewing grant applications and spreadsheets while Satoshi leads the lab, cannot be Omma. She cannot be the same woman who turned off that light in Teacher’s classroom, who defended Na-Yeong from the judgments of the world with such grace and ferocity.\n So Na-Yeong cuts her out.\n Appa tries his best to bridge the gap. He tells Na-Yeong about the latest developments on the slipdrive, about how Omma works so hard to make sure they keep their funding even after Assemblyman Kim threatened to cancel all government contracts. He talks about slingsuit tech, and how Satoshi still can’t eat buldak without crying. But even Na-Yeong can sense the brittleness beneath. Appa’s foundations have always been rooted in family; without them, the cracks already present widen out into deep, crumbling fissures.\n Which is why, when Na-Yeong leaves her room one evening looking for food and discovers Appa seated at the kitchen table, pale, staring at nothing, she barely reacts. It’s only when he says her name as she’s boiling water for ramyun, “Choe Na-Yeong,” like it’s been torn from him, that she turns.\n Appa looks at her. No, past her, at something neither one of them understands. “There’s.” He swallows, everything about him suddenly lost and oh so small. “There’s been an accident.”\n Na-Yeong doesn’t believe in accidents. The universe is built on structure and predictability; there’s a theory and calculation for everything, and thus nothing exists that was not somehow set in place by something else beforehand. But as Satoshi bows low, almost parallel to the ground, and tells them what happened, Na-Yeong can’t find the congruence in it. Why was Omma even in the testing room to begin with? What reason did she have to be working on the prototype directly?\n And where did she go?\n “We, uh.” Satoshi’s voice breaks and he coughs into his fist. Na-Yeong barely squashes the urge to hit him. Doesn’t he understand they need more information? Why is it that no one seems able to look at her and Appa without bursting into tears? “We reviewed what footage we had from the time of the . . . incident. It appears your wife was, um, in the middle of making a recording when the slipdrive failed. We don’t know what it was since the malfunction destroyed the servers, but we do know that she . . . ” He looks at Na-Yeong, expression crumbling. “She meant to send it to you, Choe Na-Yeong.”\n Appa stands next to her perfectly still, a statue except for the tears streaming down his face. Satoshi turns away, shoulders trembling. People approach, offer condolences, but Na-Yeong ignores them because she knows. She’s known it since Appa gave her the terrible news.\n She turns fourteen today.\n Omma would have wanted to celebrate.\n Blink.\n Where.\n Where is she.\n Everything drifts. She is a mote floating in an endless dark ocean. She is small. She is nothing.\n From far away: “ . . . ommands, ma’am?”\n The voice sounds familiar.\n “Extrapolating command based on previous history. We are approximately five point zero-zero-two-six lightyears from Earth.”\n Omma?\n “No broadcasts detected on the frequency you requested. Confirm recalculation?”\n Maybe she says yes. Maybe she says nothing.\n Na-Yeong goes away.\n Blink.\n They lower the empty capsule into the ground two weeks later. Na-Yeong falls into a fit; Appa manages to calm her down after twenty minutes, but not before she’s scratched herself bloody and bitten three people.\n There’s talk of hospitalizing her, of giving her some time to herself, but somehow Appa manages to drag himself out of bed long enough to threaten to take it to the media, and that takes care of that. Na-Yeong spends long days locked in her room, curled up on her bed. She taps her fingers: outward in, inward out, until her knuckles stiffen and the pads go numb. She rocks back and forth, reciting numbers and equations, general relativity and s-quarks and the pulse period of PSR 1913+16, over and over and over, but none of it brings Omma back.\n Satoshi snuck her the surveillance feeds after the funeral, so after she has picked her skin enough to bleed, and ripped all her favorite outfits to shreds, and screamed at Appa until he retreats into the master bedroom with haunted eyes for the nth time, Na-Yeong watches them. Again and again she sees Omma, wearing her old lab coat with the coffee stain on the lapel, hunched over one of the computer terminals, her body blocking the screen. Omma spinning around when the camera trembles. Omma, eyes wide and mouth open as bright light floods the world and washes everything out.\n She will never see Omma again. The collection of particles and energies that once made up Na-Yeong’s mother no longer exist, but there is one tiny part of her left, one single floating bit that is all that remains of the only person who ever insisted on carving out a space for Na-Yeong in this universe.\n So, with the certainty of a universal law of physics, Na-Yeong decides to find it.\n It’s something of a media spectacle, those first few weeks as an assistant in Omma’s lab. Mr. Oh creates the position specifically for her, shifty eyes locked on the reporters taking pictures. “Hero Scientist’s Daughter Takes the Helm,” reads one of the biggest headlines.\n The attention fades away eventually, of course. Appa seems grateful for it, retreating into the comfort of his work in the slingsuit lab. The other engineers don’t quite seem to know how to approach her in the beginning, but after Na-Yeong recreates Omma’s initial supracurve proof by hand from memory, they mostly let her do what she wants.\n Months pass. Then years. Appa’s team finally perfects their slingsuit design, a truly impressive piece of nanotech that immediately has American defense contractors calling them at all hours. Assemblyman Kim loses reelection. Jung leaves the company after having her first child, Mr. Oh gets caught up in a scandal involving two mistresses, and Satoshi becomes Director Tanaka.\n Through it all, Na-Yeong works. Her days blend together: go to the lab, work, ignore other people’s sidelong looks, return home, repeat repeat repeat. Appa appears in there sometimes, a brief blip in the form of a quick dinner together or a small, neatly wrapped present left outside her door on her birthday. Otherwise, they maneuver around each other like carefully arranged wineglasses: close, but never touching.\n Na-Yeong doesn’t mind it so much. It helps to have a purpose again, a mission, something she can fall back on when the world becomes too much. Find it, she thinks, every time the insects inside her buzz up and make her want to bite and scratch. Find it, when the other engineers stare and whisper behind her back. Find it, when the despair threatens to swallow her whole. Find it, find it, find it.\n Is it any wonder that, in the end, she does?\n It’s chaos outside the pod. She can’t see it, but she knows: Men and women run around shouting, pointing, working frantically at their stations. She can see Satoshi’s face, the despair and terror as he yanks at the pod’s metal clamps. She can see the second pod gleaming atop its pad across the hangar, the backup they built in case this first one malfunctioned. But this one will not malfunction. Na-Yeong won’t allow it.\n She takes a deep breath. The slingsuit’s belts tighten across her shoulders and chest, and she imagines they are Appa’s arms, wrapping her up in security and protection. She wishes she could have apologized for locking him and his team in the slingsuit lab, but he’ll be released soon enough. And he’ll understand. He lost Omma too, after all.\n As the hum of the slipdrive starts up behind her, Na-Yeong doesn’t see her father stumble into the room, wild-eyed and disheveled. She doesn’t see him stare, eyes bright with desperation and a deep, all-encompassing instinct no amount of distance or diagnosis or grief could stamp out. She doesn’t see Appa turn and sprint for the second pod.\n “Subroutine accepted,” drones a familiar, computerized voice. Na-Yeong’s heard it say all sorts of things over the last five years, errors and assessments and status reports, but this unlocks something inside her, something warm and clear and solid as a neutron star. She can be friends with this voice. They’ll be spending a lot of time together, after all.\n Choe Na-Yeong turns nineteen today.\n Omma would be proud.\n She closes her eyes. “Engage,” she says, and the universe moves.\n Blink.\n Color. Light. What does this mean?\n Na-Yeong whimpers, a bare, empty sound. She’s so cold. Why doesn’t she have a blanket? She can’t feel her fingers, either, which is odd. Hadn’t she been doing something with them before?\n Noise. A faint, inaudible murmuring in the background. Na-Yeong moans and forces her eyes open. Everything stinks of vomit and sweat, and she doesn’t understand. Why are there so many colors? What do these shapes mean?\n Then, with the slow-moving assurance of a rotating planet, it comes together. The slingsuit. She’s in Appa’s slingsuit, and it’s displaying something inside her helmet. A series of warnings: Low oxygen, water reservoir empty. Suit temperature critical, and falling.\n She is dying. And she has failed.\n There are no tears left. Instead, Na-Yeong sags, exhaustion pulling at her with the weight of a thousand chains. So here she is, an innumerable distance from home, having stolen the most advanced piece of technology in the world and pushed it nearly to its limit. She’s out of food and air and will, and now she dies without completing her mission. Her mother forever lost, and her father forever grieving.\n Oh, Appa. Please forgive me.\n “ . . . ayback?”\n She blinks, slow, painful. The background noise, it’s . . . resolving. Transforming into a voice. The voice of a friend.\n “Broadcast received. Confirm playback?”\n Oh.\n Oh, God.\n “Disss . . . ” She licks dry, chapped lips, tastes the sour sting of acid and blood. “Disss . . . tance.”\n “Ma’am. We are approximately five point zero-zero-two-seven lightyears from Earth. Broadcast received on preset radio frequency. Confirm playback?”\n Oh. She’s here. She made it. She . . .\n “Y . . . es. Yes. Yes.”\n “Commencing playback.”\n A brief burst of static, and then:\n “Na-Yeong-a.”\n A different voice. A wonderful voice, the best in the universe, and it turns out she has a few tears left after all because Na-Yeong tastes them as she chokes out, “Omma.”\n Her mother’s voice continues, tinny and distorted, words flayed and broken up by time and distance, yet underneath it all it’s still warm, still unmistakably Omma.\n “—might not get thi—anted to sing—or you. My Engli—not so good, but I will try my b—kay. Okay.”\n A deep, crackly breath from five years ago.\n “—ap-pee buss-day to yoo . . . ”\n Na-Yeong closes her eyes. Omma’s voice surrounds her, suffuses her world with music and warmth. Outside, stars die and others are born, and a mother’s love for her child forms the foundation of the universe.\n “Hap-pee buss—o yoo . . . hap-pee buss-day dear Choe–eong . . . hap—uss-day to yoo . . . ”\n A woman dead half a decade gives an embarrassed chuckle. “That wasn’t ve—good, was it? Sorry—better next time. Re—mber, Mommy loves you, Na-Yeong-a. I’ll see—tonight, and we can—wait. Wha—”\n Static, then silence.\n In the confines of her failing slingsuit, blinded by warning lights and signals of her impending death, Choe Na-Yeong smiles. It cracks her lips and hurts her face, but she doesn’t care. Out here in cold vacuum, lightyears from home and any hope of return, she has found what she came to seek. Omma is here with her now. She will not die alone.\n Slowly, Na-Yeong gathers her strength and her final few breaths, and forms them into those most important words.\n “Mommy loves you,” she echoes. She imagines it rolling out from the pod into the reaches of deep space, her own tiny imprint on this universe, a neat little package containing all the love she has always held but never knew how to express. Perhaps, in time, someone else with a machine that outpaces light will pick it up, and it will make them smile too.\n “Mommy loves you. M-Mommy loves you.”\n The lights in the suit finally flicker and die. The world goes blessedly silent and dark. Na-Yeong sighs out a long, tired breath, and thinks about family and death and the bright gleaming pinpoint of a soul, and how maybe when God made the universe He wove all three of these things from the vast, unbreakable fabric of something called Love.\n There is no such thing as time or distance, when measured in devotion.\n Deep within the thrumming circuits of the pod’s computational system, the radar scanner registers a sudden, familiar blip."}