{"fingerprint": "AOJcVVJtIPGWBc4csfGdkoeEeN8=", "sitename": "Clarkesworld Magazine", "title": "Treasure Diving by Kai Hudson", "author": "Kai Hudson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/hudson_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Treasure Diving by Kai Hudson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3240 words, short story\n Treasure Diving\n There is a word in Ku’uti for the swallowing darkness that can only be found here, in the deepest parts of the sea. Ruhava. Alone.\n Ilana breathes in the silence. The water tastes dull and flat, not salty like toptide or sweet-tangy like her home estuary. A faint aftertaste of metal blossoms in the folds of her rear gill-flaps. Ick. The pressure suit’s filters must be malfunctioning again.\n The thin layer of woven exosteel sits awkward and tight against her skin, irritating the cilia. She’s going to come out with suit rash, she just knows it. Jeshri had better have some ointment left.\n As if on cue, the suit’s commpiece vibrates and her sister’s voice crackles in her ear, tinny and distant. “Ila-vei? You pick up the signature yet?” Jeshri speaks with that high, forced steadiness that tells Ilana she’s trying not to sound worried.\n “Not yet, Jesh-ta’u. It’s really dark down here.”\n “Oh. Yeah. Well, your suit has lights, so.” Ilana smiles. Jeshri acts as if this is her first treasure dive. Her sister must be really nervous.\n Then she remembers why Jeshri is nervous, and the smile fades. “Scanning now. Gimme a minute.”\n A quick gesture with her left hand activates the suit’s haptic controls. A low hum starts up as the sensors engage, seeking the telltale frequency of hypera, the shiny, jewellike material she is down here to find. The lights, of course, have been on since she first hit depth and the darkness closed in around her. Ilana is no stranger to treasure dives.\n They’re called that because, a long time ago, queens used to decorate their dorsal fins with bits of hypera, stitching them on in elaborate, sparkling webs even though all it did was increase drag. Still, it wasn’t like queens did much swimming back then, so it was fine, especially because the stuff looked so pretty, winking a thousand iridescent colors in the sunlight.\n Of course, it was only after several queens sickened and died and whole hives were lost that people discovered the enchanting trinkets also emitted an odd radiation that turned poison over prolonged exposure. That got rid of the fashion statement, but then it turned out the radiation was actually an easy source of light and energy. Thus, the dives for hypera continued. Still treasure, just in a different way.\n She looks around as the suit continues its scan. They’re about sixteen osh’dun from the nearest estuary, right smack in the middle of the Sunlit Sea. Even so, this far down, none of the light penetrates. Everywhere she turns, darkness devours the light from her suit, snatching and swallowing it so greedily she can barely make out a couple arm-lengths in front of her. What she can see is hardly worth writing home about: blue-black water all around, with floating bits of sand-like particles wherever the light shines. This far down, there is no life. Ruhava.\n She’s close to the ruins, that much is for sure. She and Jeshri spent months mapping this area from toptide, slowly building a sonar topography of the seafloor. It looks to be the remains of a satellite settlement, just a few crumbling foundations, tiny compared to the vast, sprawling cities discovered in other areas.\n But it’s theirs. The bigger ruins crawl with other divers along with researchers and historians, trying to learn more about this ancient, forgotten civilization that left nothing of themselves but these structures and the hypera. Impossible pickings for two young workers. That’s why they got so excited when they discovered this little place. With luck, it might just net them enough hypera to get their own chamber, away from the farms and larval nurseries and, most importantly, the glowheart.\n Every hive has one: a hypera reactor powering everything from the lights to the water pumps to the nutrient farms. Without glowhearts, they’d be back to the days of darkness and starvation, each estuary only able to support one or two hives, everyone scrabbling for food and warmth. Queens would still be nothing but swollen egg-laying machines, female workers like Ilana and Jeshri slaving away to make sure she stayed fed and fat and producing. Without glowhearts, there would be no leisure, no opportunities to look beyond the day-to-day survival of the hive. She would not be here now, a half-osh’dun beneath the surface in a special-made pressure suit, diving for long-forgotten bits of light. Glowhearts grant them technology, science, freedom.\n But they come with a cost. Such a cost. Hypera radiation can’t be shielded with their current tech; the best protective housings still let through low-grade particles. And if you can’t afford one of the outer-layer chambers, if you end up living too close to hive center for too many years . . .\n Ilana’s hearts clench in sudden ache. The casting was six days ago.\n The suit beeps: the sensors have picked up something. “Ila-vei?” Jeshri asks. She’s not even bothering to hide her worry anymore.\n Ilana clears her throat. “I’ve got a signature. Triangulating.” The suit homes in and produces a blinking waypoint on her display, a bright dot due south. “Got it.”\n She pumps her legs and shoots off. The suit makes swimming difficult, turns her usual smooth, undulating movements into clumsy, slow jerks. It can’t be helped. The exosteel has to cover even the webbing on her hands and feet, otherwise the pressure here would crush any exposed part of her. Thankfully, she’s in no hurry.\n A few minutes later, the suit’s lights illuminate the first ruin. It’s the outer wall of the settlement, maybe two osh’ni tall. What did the people who built this place fear so much that they needed a defensive perimeter around their home? Whatever it is, it’s long dead along with everything else down here.\n The waypoint is getting closer. Ilana swims around the remains of a dark stone tower, the beeping of the sensors growing louder and louder. She should be able to see something by now. Even the tiniest speck of hypera glows bright, and in this all-consuming darkness, it shouldn’t be hard to—\n Ah. There.\n Tiny lights glimmer from the stone. Ilana swims quickly forward and bends down for a closer look. Centuries of sand and sediment have nearly buried the tower, but the uncovered portions are not completely black—miniscule sparkles wink here and there in indefinable patterns, as if the ruins are trying to communicate with her through alien code. It’s not much—a couple grams, tops—but it’s better than she and Jeshri had hoped for.\n She unhooks the drill and turns it on. The suit filters out all outside noise, but the vibrations ring up her arm, humming like the walls of their chamber back home, so close to the glowheart. Mother tried her best growing up, told them it was the hive singing them a lullaby, but even though Jeshri believed her, Ilana never did. Her earliest memory of Mother is coming upon her at the refuse chute, coughing blood quietly into the pressurized opening, smoky red ribbons trailing from her gills to the greedy swallowing mouth in the wall. She’d smiled at Ilana, but there was no hiding the pain in her face. The glowheart slowly killing her, even back then.\n The first piece of hypera dislodges from the stone. It’s about the size of a seed, pulsing a soft, ever-changing mix of colors, and she can’t help the churning in her stomach as she drops it into the shielded canister at her hip. She makes a living from mining her mother’s murderer.\n “How much longer?” Jeshri’s voice crashes in through the quiet and Ilana nearly drops the drill. Focus! Mother wouldn’t want her losing her head down here. Not when it’s just her and Jeshri now.\n “A few more minutes, ta’u.” She’s true to her word: it doesn’t take long to finish transferring the bits of hypera to her suit. She shuts the drill off and re-clips it. “Okay. I’m coming back up.”\n “Prepping for depressurization,” Jeshri answers, with obvious relief.\n Ilana turns and begins to swim upward. Even though she’s only a couple of grams heavier, she imagines the weight of the hypera pulling her back down, heavy with guilt. She shouldn’t be here so soon after the casting, but Jeshri couldn’t stop crying for three days and Ilana knew they needed some sort of distraction, anything to scrub their minds of that last image of Mother, trying her best to smile as the pain wracked her body, until finally her eyes glazed over and the water grew heavy with the stench of death. Ilana can still taste it in her gill-flaps, bitter and cold. Home will never be sweet to her again.\n The darkness creeps in, total and complete. It’s only been an hour since she left toptide, but already she misses the sun, its bright, dappled rays shimmering magically through the water. She misses lazy afternoons with Jeshri, twisting and playing in the shallows. She misses Mother’s smile as she watched their games. She misses Mother.\n The water lightens around her, jerking her from her thoughts. She can’t be at toptide already? Ilana pauses, blinks all around. The light . . . it’s not from the sun approaching above. It’s . . . coming from somewhere behind her?\n She turns and squints into the dark, and she’s not crazy. A strange light glows among the ruins she just left. She can’t see the source from here, but it’s bright enough to see the buildings by. What is that?\n “Vei, what’re you doing?” Jeshri’s voice comes suddenly from very far away. “Why are you changing course?”\n Ilana ignores her and swims toward the light. She was right: it does have a source, and as she gets closer she sees that the light has a weird shimmer to it, shining alternately yellow and white and somewhere in between as it reflects off the ruins. She grips the edge of the nearest wall and pokes her head out for a peek.\n And gasps.\n It’s a Ku’uti. The figure hovers in the middle of a space between the stone buildings, and she can tell it’s a female, a worker like herself from the wide hips and the curve of the dorsal fin. There’s no sign of exosteel. How can someone be all the way down here without a pressure suit?\n “Hello?” she calls, readjusting her lights to fall on the figure, who turns to face her. And all the breath leaves Ilana in a rush.\n It’s Mother. She can’t believe it, it’s impossible, but it’s true: the figure glows like a pale ghost, flickering with the movements of the surrounding water, but it’s her. Ilana knows those soft webbed hands, that gentle face she last glimpsed contorted in agony. Mother smiles at her, and everything else fades away.\n How can she be here? They cast her to the sky six days ago, hurling her polished bones out onto the sandy beach as far up as they could. Ilana’s arms ached for hours afterward, and not just from the brief sun exposure drying the cilia. Mother is now where she could never go while alive: frolicking on dry land, warm and laughing in the sun.\n Yet here she is, floating among the ruins, giving Ilana that small, knowing smile like she’s just told a joke and she’s waiting for Ilana to get the punch line. But there’s nothing funny about this. There never has been.\n “Mother?” she whispers, and barely registers Jeshri’s gasp. She swims slowly forward. Mother doesn’t move, but her smile grows wider, more welcoming. She’s been here all this time, waiting for Ilana.\n Her eyes prickle with tears. Ilana swallows. “Mother, I . . . I’ve missed you so much.”\n Mother doesn’t say anything, and when Ilana reaches out, she only turns and floats away a few feet. There’s something wrong with the movement: it’s too jerky, too quick. Is Mother sick? Injured? Oh, streaking stars, is she dying all over again?\n “Mother!” She swims closer, but Mother moves again. Ilana follows and she’s crying now, she can feel the thick, glutinous tears gelling the edges of her eyes. She wants Mother to hold her, to wipe the tears away. She wants Mother to smile and sing her all the old songs, to calm Jeshri when she has night terrors, to be here and alive and not a scatter of pale-white bones on some faraway beach.\n Still Mother says nothing. She’s stopped now, floating serenely next to the tall remains of a building. She seems to beckon Ilana with her eyes, and Ilana goes, helpless. A sudden ripple churns the water, but she ignores it. Mother is here. Mother is alive. Breathless with relief, Ilana swims up to her and reaches out.\n Her hand touches the curve of Mother’s shoulder—and alarms in the suit instantly go off in screeching, high-pitched panic. Ilana cries out and jerks her hand back. In front of her, Mother’s smile melts and warps into an alien shape: a glowing, wriggling cylinder of light about Ilana’s height, that twists and turns and shines a thousand different colors.\n She has just enough time to think Hypera! before a giant black shape rises from the darkness. The fish is enormous, towering easily over the ruins, attached to the lure by a thick, veinous appendage protruding from its forehead. Ghost-white eyes the size of hive chambers hover above a mouth lined with oversized, razor-sharp teeth, a mouth that is opening, looming, even now rushing forward to swallow and devour—\n Ilana screams and scrambles sideways. The shockwave from the monster’s mouth snapping shut knocks her into a spin but that’s a good thing, it means it didn’t get her, she can still escape! She twists toward the surface and pumps her legs, but everything is clunky and slow inside the suit, it’s holding her down, slowing her, turning her into prey—\n A flicker of movement and she reacts on instinct, wrenching her body sideways, and not a second too soon as the monster’s giant teeth miss her leg but hit her suit. Pain explodes in her side as the exosteel buckles and pressure punches in. Ilana cries out and clamps her hand down on the breach, diving to avoid another pass by the monster. Everywhere is a mess of darkness and bubbles and crazy lights, her suit and the creature’s lure creating nothing but blobs and blurs in the water and she has to go up, she must reach the sunlight, it can’t follow her into the sunlight!\n The suit’s alarms wail in her ears—pressure, surface damage, depth warnings—but she tunes it all out, gritting her teeth as she shoots upward as fast as she can. Behind her she feels the monster’s vibrating roar, doesn’t need to look to know it’s in hot pursuit. Streaking stars, she can’t swim in this sky-damned suit—it’s gaining on her, she can feel it in the water: the stink of its breath, the scent of rotting things. It’s going to snatch her and eat her, and then who will look after Jeshri?\n It’s getting brighter, but the sun is still a mere twinkling pinpoint high above. She’s not going to make it. She glances back to see the creature only a few feet away, giant maw gaping open. The lure darts up and down as it rushes her, still glowing with hypera, and she doesn’t think. Right here, right now, only one thing makes sense.\n The lure when she seizes it, feels squishy and warm and slick with mucus. Ilana almost loses her grip but she forces herself to hold on as it flicks back on reflex, jerking her up with it—and out of the way of the creature’s mouth. Long teeth clamp down on empty water and the creature howls in fury. She doesn’t have long; already it knows where she is, is preparing to flick the lure downward to bring her right into its waiting jaws.\n She grips the lure as hard as she can, grits her teeth, and yanks.\n With a sudden riiiip! she feels all the way down her arm, the lure tears from the end of its line in a cloud of blood and ragged flesh. The creature screams—she feels the punch of it through her hearts, and in the next instant it’s gone, vanished back down into the depths. Only a trail of bubbles and a few floating scales remain. And the lure, still grasped in Ilana’s hand.\n She struggles for breath in the sudden quiet. The suit is still giving off alarms, high-pitched wails that bounce about painfully inside her skull. She quiets them with a hand gesture, but not before noting that the pressure warning is gone. Her side still feels like someone slashed it with a hammersaw, but when she lifts her hand carefully from the wound, it’s to see a fresh patch of shiny exosteel sealing the breach.\n She’s alive. She found a monster in the deep and it tried to eat her and she’s still here. Ilana laughs, high and thin, and tries to get her hands to stop shaking. It seems the depths of the sea aren’t as dead as they thought.\n In her hand, the creature’s lure gives one last, shuddering wriggle and goes limp. Ilana lifts it up, squinting for a better look in the faint light. She was right before: beneath the soft, rubbery surface, she can make out the telltale glow of hypera, what looks like patches of it all clumped together, pulsing in a million different colors. That must have been how it generated the illusion. That, and Ilana’s own grief.\n But this . . . this means something. This creature didn’t just happen to come across the pretty stuff and decide to scrape it into a lure. No. The way the hypera blends seamlessly into the flesh: this speaks of co-development, of evolution. This fish was born with the ability to absorb hypera and use it without being harmed.\n What does that mean for her own people, who are slaves to the hypera now?\n Static bursts in her ear. “Vei?” Jeshri’s voice is high and panicked, taut with terror. “Vei!”\n Ilana breathes out, groans as the wound in her side protests. “I’m here, ta’u. I’m okay.”\n “Oh, thank the streaking stars!” Jeshri begins to cry.\n Ilana doesn’t bother making comforting noises at her. Jeshri won’t believe it anyway, not until she’s able to see Ilana alive and whole for herself. Instead, she tightens her grip on the lure.\n She needs to get a move on; there are smoky trails of blood in the water, and moonsharks will smell it from an osh’dun away. Even so, Ilana takes a moment for a breath and a smile as she looks down at the long, rubbery thing, still glowing faintly with hypera. Jeshri is in for a surprise. They all are.\n This won’t save them. It won’t replace glowhearts, or keep other Mothers from wasting away, leaving their children alone in a vast, unforgiving sea. But it’s clear evidence: with enough time and perseverance, they can do what the fish did. They can use hypera without getting sick. They can evolve.\n There is a word in Ku’uti for that moment after a violent storm, when the crashing waves finally subside and one glimpses the first glimmer of sunlight. Na’wei. Hope.\n Something warm and beautiful unfurls in her chest, brighter than any glowheart. Ilana smiles, grips her treasure tight, and heads up toward the sun."}