{"fingerprint": "mgak7j7R9omHOtgKi0NK6wO3484=", "sitename": "Clarkesworld Magazine", "title": "Wizard's Six by Alex Irvine", "author": "Alex Irvine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/irvine_10_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Wizard's Six by Alex Irvine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10840 words, novelette, REPRINT\n Wizard's Six\n 1\n In the spring Paulus set out north from The Fells, hunting the apprentice Myros. He cannot be allowed to collect his six, the wizard had said. If you cannot find his track, you must kill whichever of the six he has already selected. It did Paulus’ conscience no good to kill people whose only fault was being collected by an aspiring wizard, but he would be only the first of many hunters. Without the guild’s protection, a wizard’s six were like baby turtles struggling toward the sea. Best to spare them a life of being hunted.\n The apprentice had spent enough time in the Agate Tower to know that there would be pursuit. He was moving fast and had four months’ head start; Paulus moved faster, riding through nights and spring storms, fording spring-swollen rivers, asking quiet questions over bottles in public houses along the only road over the mountains. He killed the first of the apprentice’s collection on a farm between a bend in the road and a ripple of foothills: a small boy with a dirty face and a stick in his hand.\n Yes, mister, a man passed by here in the winter.\n Yes, mister, he had a ring over his glove. I was feeding the pig, and he told me I was a likely boy. Are you looking for him?\n Can I see your sword?\n They weren’t supposed to choose children, Paulus was thinking as he rode on. Even apart from the cultural sanction, children’s magic was powerful but unpredictable, tricky to harness. No wonder the guild was after this one.\n In a public house that evening, the day’s chill slowly ebbing from his feet, Paulus said a prayer for the boy’s parents. He hoped they hadn’t sent anyone after him. It was bad enough to kill children; he had even less desire to take the lives of vengeful bumpkins. Best to keep moving. Already he had gained a month on the apprentice, who was moving fast for a normal man but not fast enough to stay ahead of Paulus, who had once been one of the king’s rangers. Upstairs in his room, Paulus watched a thin drift of snow appear on the windowsill, spilling onto the plank floor. His prayer beads worked through his fingers. Go, boy, he thought. Speed your way to heaven. He dreamed of turtles, and of great birds that flew at night.\n In the morning the snow had stopped, and Paulus cut a piece of cheese from a wheel left out in the kitchen. He stuck the knife in the remaining cheese and set a coin next to it, then left through the back door and saddled his horse without waking the stable boy. He rode hard, into the mountains and over the first of the passes where the road lay under drifted snow taller than a man on horseback. The horse picked out the track; like Paulus, it had been this way before. It was blowing hard by noon, when they had come to the bottom of a broad valley dotted with farms and a single manor house. Paulus rode to the gates of the manor and waited to be noticed.\n The gate creaked open, revealing a choleric elder in threadbare velvet, huddled under a bearskin cloak. “Who comes to the house of Baron Branchefort?”\n Paulus dismounted and let the seneschal see the sigil of the Agate Tower dangling from the horse’s bridle. “I ride on an errand from the wizards’ guild in The Fells,” he said. “Has an apprentice traveled through this valley?”\n “And how would I know an apprentice?”\n “He would wear a ring over the glove on his right hand. He is called Myros.”\n The elder nodded. “Aye, he was here. Visited the Baron asking permission to gather plant lore.”\n “Was this granted?”\n “It was. He was our guest for a week and a day, then rode to the head of the valley.”\n “Did he gather any herbs?”\n “I did not observe.”\n “You wouldn’t have. His errand has nothing to do with plants. He travels to collect children.”\n The elder held Paulus’ gaze for a long moment. “This is why you follow him.”\n “It is. Are there children in your house?”\n “No. The Baron nears his eightieth year. We have few servants, and no children.”\n Paulus offered up a prayer of thanks that he would not have to enter the manor. He had seen more than enough of noble houses fallen into somnolence. Standing at the gate of this one, his chest constricted and he thought of his brother.\n “Where,” he asked, “are the houses in this valley with children?”\n The elder looked up at the sky, then down at the ground between his feet. “Many children come into this world,” he said. “Few survive. Only one of the Baron’s vassals has children below marriageable age. He is called Philo, and his house is the last before the road rises into the mountains again.”\n Paulus nodded and mounted his horse again.\n “You will ease Philo’s mind, I pray,” the elder said.\n “What ease I can give, I will give,” Paulus said, and rode north.\n Philo’s house lay in the shadow of a double peak, across the saddle of which lay Paulus’ route over the mountains. As Paulus rode up, the sun rested between the peaks. A man about Paulus’ age, but with the caved-in chest and stooped neck of too much work and not enough food, was drawing water. A girl of seven or eight years stood waiting with an empty bucket.\n “Philo,” Paulus said.\n “That is my name,” Philo said, without looking up at Paulus, as he hauled a full bucket over the edge of the well. He emptied it into the bucket his daughter set on the ground at his feet. “And this is my daughter Sophia. Now you know what of us is worth knowing.”\n “A young man wearing a ring over his glove has been here,” Paulus said.\n Philo dropped the bucket back into the well. “He has.”\n “He spoke to your daughter.”\n “That’s right, sir, he did. Told her she was a likely girl. She’s always seemed so to me, but if I was any judge of men or girls I wouldn’t be here.” Still Philo had not met Paulus’ gaze. Paulus began to wonder what had passed between him and Myros; or was his demeanor caused by the Brancheforts?\n No matter.\n “I come from The Fells,” Paulus said. “My instructions are to gather the girl he spoke to. For service at the Agate Tower.”\n At this, Philo looked up and Paulus and put a hand around his daughter’s thin shoulders. Now it was Paulus who wanted to look away. He forced himself to hold Philo’s eye. “She’s my only, sir,” Philo said. “And my wife, we’re too old to have another.”\n “Philo,” Paulus said. “I have no quarrel with you. My errand is my errand.”\n He watched the awful calculus of the peasant on Philo’s face. One fewer mouth to feed. Giving his daughter over to a life of service with the wizards of The Fells, where she would spend the rest of her days forgetting what it was like to go to bed hungry. And against that . . .\n “May we visit her, sir?”\n “When she has been gone a year,” Paulus said. He was a poor liar, but this provision he remembered from his own journey to The Fells as a boy, when he had been taken into the King’s Acrobats.\n His mother had never come. After a year he had stopped expecting her.\n “Before that,” he said, “she will still long for home. You may write as long as you do not ask her to return. Censors at the guild will destroy your letters if you do.”\n Philo was nodding slowly. “We do love her, sir,” he said. “She’s our only.”\n And through all this, the girl Sophia spoke not a word.\n “I will return in the morning,” Paulus said.\n The ruse had cost him a day, and cost him, too, any chance of a better meal than jerky eaten under a tree. Paulus had started back to the manor house, then veered away from the road into a copse of beech and spruce. He had already lied more that day than during the previous ten years, and could no more maintain his fabrications than strike down young Sophia of Branchefort Valley in her father’s presence. So he hobbled his horse, found dry ground beneath the spreading branches of a spruce tree, and prayed until sleep came. Then he dreamed of his mother, refusing to look at him as he craned his neck to see through the wagon gate and cried out Mama, goodbye, Mama.\n In the morning, Sophia was waiting in the lambskin coat Philo had been wearing the afternoon before. Rabbit fur wrapped her feet, and she held a small satchel in both hands. Philo and her mother stood behind her, each with a hand on her; the woman’s hand moved to smooth the coat’s collar, tug a tangle out of Sophia’s hair. Philo reached down and took his daughter’s hand.\n “May she write us?” the woman said.\n “After a year, ma’am,” answered Paulus. “Should she prove unsuitable, I will bring her back myself, with no dishonor to you. It’s many a child isn’t meant for the wizards’ service.”\n “Not unsuitable, not our Sophia,” Philo said. He swallowed.\n “Philo,” Paulus said. “Can you spare this coat? She will be warm on the journey.”\n “I’d like her to have it,” Philo said. “It’s all we can give her.”\n Paulus could come up with no convincing reply. “There’s fresh eggs and bread in the bag,” Sophia’s mother said.\n “I thank you, ma’am,” Paulus said. “I am Paulus. Your man and I met yesterday.”\n “I am Clio, sir,” she said. She was looking hard at him—seeing, Paulus knew, the scars on his hands and the long sword on his right hip.\n “Your daughter has her destiny, Clio,” Paulus said. “I am here to take her to it.”\n Baby turtles, he told himself. Another might have killed all three by now, and moved on. The thought gave him no ease. He averted his eyes as Philo and Clio made their farewells. Braver than either, Sophia took Paulus’ hand and climbed onto the saddle in front of him. A tremor ran through her small body, but she reached out to get her fists into the horse’s mane. She looked back at her parents as Paulus spurred the horse northward, and he wondered what she saw.\n When she spoke, much later when the northern pass out of Branchefort Valley was behind them, Paulus didn’t register her voice at first. He was thinking about the boy who had been feeding his pig when Myros came. How easily children died. “Sir?” the girl said. “What do you call the horse?”\n “I never named him,” Paulus said.\n “Can I call him Brown?”\n “All right.”\n “Your name is Brown,” Sophia told the horse.\n He could kill her at any time, could have killed her at any moment since crossing the pass. Could, for that matter, have cut her down with the empty bucket in her hands while her father was drawing water. Hesitation kills, Paulus thought.\n “What are the wizards like?” she asked.\n “They are wizards,” Paulus said. “Not like men. But not cruel.”\n “How long until we get there?”\n “A little while yet,” Paulus said. He was silent after that, and they rode the edge of a canyon in which night fell early and forced them to make camp while the sky above was still light.\n At times, Paulus knew, he was slow to apprehend the consequences of his actions. Now he realized that he had complicated his task first by concocting a story and then by taking the girl. She was one of the apprentice’s six; Myros might well know that Paulus had her, and if he also knew about the boy he might be provoked into retaliation. Better to have killed her quickly and ridden on. Regardless of the wizard’s injunction, Paulus could not afford to carry her with him in his pursuit of Myros. Nor could he return her, now that his mouth had run away with his reason and pronounced that she might be returned if she did not satisfy the wizards. He could easily imagine what such a stigma might mean to a child in a place like Branchefort Valley. He stirred Philo’s eggs over the fire and damned himself for losing sight of his task.\n Over the sound of the night breeze in the canyon, he heard Sophia crying quietly. End this, he thought, and rose into a crouch.\n “I’m afraid,” she said, and the sound of her voice destroyed his resolve. He sat next to her. Paulus had no knowledge of children. He had none of his own and had been taken from his own home at about Sophia’s age, leaving behind three younger sisters whom he had never seen again.\n “Never been out of the valley before?” he asked her.\n She shook her head and wiped at her nose before tearing a piece of bread from the loaf and scooping eggs out of the bowl. Cowardice was a thick, bitter syrup in Paulus’ throat. The boy with the stick in his hand had fallen without a sound, face still bearing traces of his smile at seeing Paulus’ sword—yet Paulus knew that in the dying reaches of the boy’s brain had been the knowledge of his murder. He found that he could not bear the idea of Sophia dying with that same knowledge. Her name, he thought. If I had not learned her name . . .\n “Let me tell you a story,” Paulus said, and then he fell silent because he couldn’t remember any stories. He remembered the sound of his father’s voice telling him stories when he was a small boy, but he couldn’t hear any of the words. “There was a little girl who dreamed that she was a bird,” he began, and he let his voice follow the idea of that bird until Sophia was asleep. In the morning he buried the crusts of the bread with her, and burned the coat over her grave. As he climbed out of the canyon into sunlight, a wind sharp with snow raised gooseflesh on his arms. He filled his lungs and held his breath until the edges of his vision faded into red, then exhaled slowly, slowly, feeling his mind start to fade. At the point of unconsciousness he let himself breathe again, deeply and freely. He did not remember where he had learned the exercise, but it cleared his mind, and as his horse—Brown—picked his way across frosted scree below a peak like the head of a boil, Paulus let his mind wander. During the short time he had slept the night before, he had dreamed of being a dog, in a warm room with thick rugs and two great stone chairs too high for him to leap onto. There had been a kind woman and an old, old man, and another man who would not look at him but spoke gently. O queen, he thought; and after that, O brother.\n The motion of a hare bounding between rocks drew his attention. He slipped an old throwing knife from its sheath at the small of his back and waited for it to move again, thinking that now he was over the first high ridge of peaks and in this expanse of alpine valleys, game would be more plentiful. In the high country, above treeline, was nothing but pikas and the occasional adventuresome goat. He wished he had brought a bow, but the truth was that no one had ever mistaken him for a skillful archer; his boyhood circus training, though, had served him well where knives were concerned. When the hare made its move, Paulus flicked his wrist. Simple. Five minutes later, the hare was dressed and dangling from his saddle. He rode on, trying not to think of sopping up the hare’s fat with Sophia’s bread. Skill with knives or no, Paulus knew that hunger was going to be a close companion as he moved farther from settled regions. The hermits and occasional isolated hamlets huddled in the valleys would not all be as hospitable as the Brancheforts had been.\n Sparser settlement also meant that it would be harder to track Myros—although Myros would have his own problems, chief among them finding four more children to collect. Paulus had no doubt that all six of Myros’ collection would be children, and the certainty had come so quietly that he was reluctant to examine it too closely. He mistrusted his own intuition, feeling that it was often fueled by whatever it was he had paid the wizard to make him forget, and he feared breaking the spell by looking too closely at the workings of his mind.\n There was the problem, too, of where Myros was going—and why. Moving north as fast as feet could carry him, moving deeper and deeper into the winter that had already left the lowlands, Myros fled as if frantic to go backwards in time. If he kept heading north, he would reach the marshes and tundras that gave onto the ice-choked Mare Ultima. What would Myros want with the tribes who followed the whales and caribou?\n A stirring in Paulus’ mind set his fingers tingling with more than the cold. I can block the memories of your mind, the wizard had said, but the body’s memories are beyond my reach. Paulus looked at his hands and wondered what they remembered. He had paid good silver for his forgetfulness, but no wizard had yet charmed the curiosity out of man or woman, or the desire. Paulus’ brother was ample evidence of that.\n 2\n Days passed, and fell from memory with the sunset. Paulus saw no one, and stopped remembering his dreams. He was well into the second range of mountains, leading Brown on a foot trail skirting snow-buried canyons, when he found the apprentice’s third. He saw smoke funneling out of a crevice on the canyon wall, and found a cave entrance below it. Calling in, he roused an old hermit and described Myros. “Yes,” the hermit nodded, and invited Paulus in for hot water and flat bread. “He was here. And yes, he spoke to my lad and moved on. Quite a soft one to be this deep in the mountains.”\n Paulus thought, but did not say, that there were many kinds of hardness.\n “And he would not eat, nor drink,” the hermit went on. Paulus watched his fingers, how they moved through the silent catechism of the hermit’s god. Nine beads on a catgut string, a sacred abacus ticking off the arithmetic of holiness. I will pray after, Paulus thought. Not now.\n “I thank you for your welcome,” he said.\n The hermit did not acknowledge this. “Wizards,” he grumbled, and spat into the fire.\n “Myros is not yet a wizard,” Paulus said. “I am sent to make sure he never will be.”\n In the hermit’s eyes, Paulus saw suspicion. And something else; their expression teased at a memory, irritating like a hair on the back of the tongue. Eyes like gray stones, they put him in mind of something, stirred echoes of a kind of love that he could not remember feeling since he was a boy.\n “If you are following him,” the hermit said, “what does it matter whether he spoke to my lad?”\n You have not been gone from inhabited places as long as all that, old man, thought Paulus. “I need to know if he is collecting,” he said, and might have said more but the hermit threw hot water in his face and at the same time someone caught hold of his hair from behind. He threw a forearm across his throat and felt the impact of the blade, and then burning as the hermit kicked the embers of the fire across his leggings. Paulus scissored his legs, scattering the coals back toward the hermit, and with his left hand gripped the wrist of whoever had hold of his hair. The blade caught him on the cheek, and with an animal roar he squeezed until he felt bones snap. The grip on his hair loosened, and he pivoted to his feet, twisting the arm and breaking it again before he saw that he held a long-haired boy of perhaps thirteen, face twisted with hate and fear and pain. Paulus let him go, and the boy sprang up with the knife again. Stepping to his right, Paulus slapped the knife hand down and punched the boy hard on the left temple, knocking him straight down into the packed-earth floor, where he lay motionless save for a slow movement of his lips.\n Looking over his shoulder, Paulus saw the hermit brandishing a burning branch. I have tried lies, and I have tried truth, he thought. This time he did not speak at all.\n The next morning, in the sunny mouth of a snow cave near a frozen creek, Paulus ran his fingers carefully along his wounds. He had done this the night before, but could not credit what his fingertips reported. His cheek was unmarked, though his tongue felt a chipped molar where the thrust of the boy’s blade had landed, and on his forearm a deep cut ran for three inches or so, then stopped for slightly more, then began again before tapering into a scratch near the outside of his elbow. Paulus probed the skin between the two cuts as he reconstructed the fight in his mind. One blow across the arm, one blow to the cheek, then he had turned. Could he have forgotten a third strike? It seemed impossible. The uncut skin felt normal to the touch, but when he pressed the point of a knife into it, he could not leave a mark. An odd smell filled his nostrils, raising the hair on his forearms and shrinking his testicles though he could not identify it and did not know why he should be afraid. The forgetting, he thought. Perhaps the body cannot forget any more than a bird can forget to fly south.\n Well. Put it from your mind, he told himself. You paid for the forgetting, and must have had a good reason.\n More important was the fact that Myros knew he was being pursued. The hermit’s ambush made that clear, and that meant that at the time Paulus had killed the boy on the farm, Myros had not yet collected the hermit’s acolyte. So, Paulus reasoned, I am closing on him, but he will have laid traps where time and circumstances allow. Hesitation kills, and even more fatal is the failure to learn from mistakes. Three of Myros’ collection remained. Each, no doubt, would pose more risk than the last—and Myros himself could not be underestimated. The time for a budding wizard to gather his collection came near the end of his studies, when he could go no further without the actual performance of magic. Together, the sparks of magic in each of the six merged into a wizard’s strength, and in fact his life, since a wizard lived only as long as one of his collection survived. Paulus wasn’t sure which would be more difficult, eliminating the six or confronting Myros after he had completed his collection. The apprentice would not have completed his studies, but he would have learned enough in the Agate Tower to be a difficult opponent.\n Paulus had killed wizards before. He could do it again. He could also fail, and although he did not fear death, he feared dying and believed that knowledge of the difference between the two was the true wellspring of courage. Having taken money from the wizards’ guild, however, Paulus knew better than to abandon his mission. He finished the flat bread he had taken from the hermit’s cave, and gnawed the last of the rabbit, and went on.\n He came to tundra, and found a thin track that followed the course of a north-flowing river. Memories threatened, and Paulus held his breath until they went away. Five days he walked, eating little and haunted by the prospect of remembering. Often he thought of his brother, dead these four years, and of the strange sacrifice his brother had made. More often still he thought of the king whose father had killed Paulus’ father, and who had taken Paulus into his service and transformed him from an acrobat into the man he now was. Something slippery and vast remained just out of reach in his mind, and although he fought the impulse he could not help grasping after it. Nor could he help tracking his fingers across the blank patch of skin between the two healing cuts, or the bearded cheek that had not parted for the acolyte’s dagger. The magic is faltering, he thought, and was glad that he might be whole again but afraid that he might find his failures more complete as well.\n A village of thatched huts hugged the sandy inside of a bend in the river. Four men came out to meet him, careful not to point their spears too directly at him, and speaking a language that Paulus knew only in fragments from fellow soldiers. They recognized the sigil of the king on the hilt of his sword, and the figure of the Agate Tower on the medallion tied to Brown’s bridle, and when he asked about the apprentice who wore a ring over his glove they nodded and pointed to a lean-to of driftwood and sod downstream of the village.\n When he knocked at the crooked sticks of the door, it fell in, and before Paulus could draw his sword he was set upon by dogs. A ringing rose in his ears and he killed them, one at a time while the others tore at his legs and leapt snarling at his face. Before they were all dead a spear struck a glancing blow across the back of his head; Paulus caught the last dog, ran it through, and used its body as a shield to catch the thrust of the next spear. He twisted the dog’s body, jerking the spear from the hands of the villager who had held it, and killed him. The other three spread into a semicircle around him. Blood warm on the back of his neck, Paulus said, “He was dead when Myros came here and you did not set your dogs on him. Where is he?”\n The answer was three spears, driven at once toward his gut. He stepped to his left, between two of them, and struck down the two villagers before they could regain their balance. “You’re not killing caribou now,” Paulus said to the last of them. “Leave off.”\n It wasn’t working. Paulus looked into the last man’s face and saw a look he had come to know well in his days with the king’s army. May I never come to the point, he prayed, when I am willing to die for the sake of not being shamed by my failure to kill myself uselessly. A shouting pierced the ringing in his ears, and he looked to his left, upstream, where an old man and a younger woman stood with two children, a boy and a girl. Naked. Twins. The children stared wide-eyed at Paulus, streaked in blood and holding the carcass of a dog. They stared at the three dead men sprawled around him, and at the dead dogs fanning out from the open doorway of the driftwood lean-to. Their expressions did not change as the elder, standing behind them and looking Paulus in the eye, held up a bone knife and cut their throats before the eyes of the village. First the girl, then the boy, knelt and looked down at the blood running down their bellies. They put their hands over their wounds. The boy coughed, and sucked in a huge breath before choking blood out of his mouth. The girl’s mouth opened and her tongue came out as if she had tasted something bad. Then both of them, almost at once, put out a bloody hand to the ground and used it to guide their bodies down to rest.\n Something broke inside Paulus. The ringing in his ears disappeared, and he lowered his sword. “They were dead when Myros came,” he repeated. “I am made the instrument of his madness.”\n In the woman’s eyes was something neither pity nor hate. “Go,” the woman said.\n Many children I have let live, Paulus thought that night. Other men might have killed them all.\n And still other men, he answered himself, would have returned the wizards’ money before killing the boy with the stick.\n Again he grasped after the easy justification: Once Myros collected them, they were going to die. Baby turtles. Paulus had been kinder about it than most would have. Still and yet, there were men who made their way in the world without killing children. Paulus prayed to one day be among them.\n One more. He lay looking at the northern stars, knowing that some baby turtles survived, and thinking: One more.\n And on into the country of stone and smoke and ice, where men ate seals and great bears ate men. The world is running out of land, Paulus thought. The sixth cannot be far. After the hermit’s trap and the ambush laid at the village, he was no longer traveling, but patrolling, eyes and ears sharpened for possible threats, right hand moving restlessly back and forth between Brown’s saddle horn and the pommel of his sword. He caught himself praying under his breath, and wondered with wry humor if this was what it took for him to discover piety. Also he had the feeling that the membrane of his forgetting was growing dangerously thin, as if the part of his mind veiled by magic was speaking to him, more loudly and insistently with each hour he traveled north.\n I have been here before, he thought—and held his breath until the world grew purplish at the edges and he felt himself swaying in the saddle.\n On a morning sharp with ocean breeze and the smells of northern plants awakening to the promise of summer’s endless days, Paulus came upon a farmer plowing. Pulling his own blade, the man bent to his work, shirtless and running with sweat even in the chill air. Paulus rode to him, sword drawn and leveled. When the farmer looked up, he asked, “Has a young man with a ring over his glove passed this way?”\n The farmer let the handles of his plow drop and squinted up at Paulus. “It’s you,” he said.\n Paulus raised his sword, and would have killed the farmer except the man spoke his name. “How do you know my name?” he asked. “Was it Myros who told you?”\n “Do you—it hasn’t been that long.”\n “Since what?”\n The farmer cocked his head. “You don’t remember me, either, do you? Will?”\n “Why would I?”\n “Oh,” the farmer—Will—said. “You had a magic done, didn’t you?”\n Paulus’ sword point dipped in Will’s direction.\n “Paulus,” Will said. “Your apprentice was here, yesterday, and he did collect a boy. But there’s more you need to know.”\n “No, there isn’t,” Paulus said. “I don’t know how you know me, or if you know me or if Myros left you this part to play. None of that matters. Take me to the boy.”\n “Well, I was going to do that,” Will said. “After all, he’s yours.”\n The membrane stretched thinner, and then Will added, “From Joy. When you came to kill the dragon.”\n And Paulus remembered.\n When he tried to sleep, he heard the dragon.\n The whisper of its scales, their soft scrape and rattle. The cold draft of its indrawn breath, so like the breath of a cave. The slow creak of its wings, unfolding in the dark. All memory now, the ghost of his bitter triumph scratching its way through the inside of his mind.\n He rolled over, felt the mattress under him: so soft, softer than the wintry mountainside where he’d camped the night before he’d gone into the dragon’s lair. In a corner of his chamber, a mouse scampered. There were hours yet before dawn.\n He threw back the sheet and stood. In the courtyard below his window, the bucket hung over the well swung in the night wind. A light shone in the stables, and Paulus shrugged into a robe. The groom, Andrew, rarely slept and had grown accustomed to Paulus’ intrusions in the middle of the night.\n Before going down to the stables, Paulus rummaged in the dark for the bottle on his nightstand. Better to bring a gift when interrupting another man’s solitude.\n Andrew looked up at the squeak of the stable door’s hinges. “Paulus,” he said. Paulus set the bottle on the square table Andrew used to cut tack, and the old groom grinned. “The dragon again,” he said.\n Paulus sat heavily on the cutting bench.\n Killing the dragon: the shock of the blade driven at an angle below the scales behind its shoulder, the scalding spray of blood over his hands and face (no blade can cut his face now, nor a long irregular patch of skin on the inside of his right forearm where the seam of his jerkin had split), the long ropes of skin and muscle hanging from Paulus’ flanks and legs where its claws had raked him, the sight of his own bones. And then the woman who put him on a sledge and dragged him to her hearth, where the winter passed into spring without him remembering, and in the spring when he was strong again he desired her, and would have taken her back to The Fells; but although she gave freely of her body and her love, she would not leave her birthplace. So he had come back, and slept little and drunk much, and spent the dying hours of the night with Andrew at the tack bench, until with the last of the bounty on the dragon he had purchased his forgetting.\n Paulus woke.\n In her language, her name meant Joy. She had had one man before him, killed the year before hunting the horned whales among the ice floes of the Mare Ultima. Perhaps she had had none after.\n He could remember the smell of the cutting bench as if it were in the room with him. The morning after sharing that last bottle with Andrew, he had gone to a spell broker and negotiated the terms of his forgetting. Now he remembered it all again: The pain that crept like worms under his skin as the dragon’s poison did its slow work, the way the screams had fought their way out of his mouth as she dragged him down the hillside and for miles along the riverside trail. The pungency of her remedies, and the spasms of his body as they drew the poisons out. The long silences in her house, broken only by the whickering of the wind in the thatched roof—and at last the moment when he had caught her hand and said, Come to me.\n The boy, Paulus thought. The boy now sleeping on his pallet near the farmer’s hearth. He could be mine.\n I want him to be mine.\n He could never have imagined himself feeling this. He felt newly full, spilling over, as if the unstoppering of his memory had scoured away other walls. Paulus sat up, sealskin covers falling away from him. He had spoken to the boy the day before, Will hanging back with more discretion than Paulus would have expected. A simple conversation, and when the boy had asked in his pidgin four-year-old way to see Paulus’ sword, Paulus knew he did not have it in him to kill this boy. Perhaps it was the fact that he might be killing his own offspring—though that had not stopped a number of men Paulus had known, and even admired—and perhaps it was simply the lesson of this journey. The Book of the god to whom Paulus prayed spoke of the Journey, and the Lesson. Part of Paulus’ attraction to this faith was his life’s own journeying, the travels and travails; now here was a chapter of the Book incarnate in these four limbs, these two eyes and small voice. The boy did not know that Paulus might be his father. Will had not been so bold. Paulus wanted to tell him, and he burned on the forks of a problem. Duty spoke with the voice he had always heeded; the dawning reality of kinship, and the small hope he held of being able to face his maker, spoke in quietly unanswerable opposition.\n Paulus remembered sunrises slanting in through the cobwebby windows of Andrew’s tack shed. Had Andrew ever seen Paulus on the streets of The Fells, thought to hail him perhaps? Had he told Andrew of his plan to buy the forgetting?\n The sun was not yet up. Will was moving around just outside the door, and Paulus could hear the deep, even breaths of the boy. His boy. The sixth of Myros’ collection.\n Paulus stretched. He had not slept under a roof in more than a month, and his body was aging past the point when it could easily absorb a month on the campaign. The scars along his ribs hurt, and his shoulders popped, and in an instant of quiet revelation he understood that Myros had collected children, and Paulus had killed them, because Myros wanted the dragon Paulus had killed four years before.\n Will had a copy of the Book on a tree-stump table beside his hearth. It was still too dark to read, but Paulus paged through the Book anyway, soothing himself with the beads in his fingers and the familiar weight and texture of the faith he had known all his life. He thought he was looking for something in the Book, but he did not know what, and when enough light had returned to the sky that he could discern the words, he set the Book aside and went to his saddlebag for whetstone and oil.\n Sharpening his sword, Paulus imagined the boy grown into a soldier, and was filled with a black fury at what the world had done to him. No, he thought. The boy slept as only a child can, still as death, unstirred by the scrape of the whetstone. Memories rode in on the tide of Paulus’ anger. In the Book was a story of a girl named Lily, saved by a story whispered in her ear while she was sleeping. Thinking of it, Paulus found his own tongue loosening. A story came to him, and as he remembered it he told it to the boy.\n 3\n Legend had it that the commoners’ gift of magic came from the gods’ anger at the separation of people into high and low. Like all legends, this one was as good an explanation as any, and the kingdom largely subscribed to it. One bit of magic, to be deployed once and only once, whether foolish or wise: this was the commoner’s reward for a lifetime of subservience. The jester found this delicious, and wasted no opportunity to crow over the kingdom’s fatuous belief. But the jester had secrets, and reasons.\n Much of his life was apparent in the topology of his face. The king’s common subjects bore an expression of calm security, a faith in their sovereign and in their one bit of magic to see them through whatever demands life would place upon them. But as if he had been built by one of the angry gods, the jester’s face quirked and twisted with freshly remembered regret, and his cast eye, forever looking vacantly away to his right, took on a horrible aspect when his humor turned scabrous and biting. The younger princes and princesses fled the throne room at his every entrance, pushing each other in most ignoble haste, and the queen reluctantly took action when the youngest prince, awakening in mortal fear from a nightmare of the jester’s crooked eye and whiplash tongue, ran blindly from his room and broke both of his legs in a fall down a flight of stairs.\n Only a few hours later, in the throne room, the queen looked sadly from her liege lord to his memento mori, telling each that the safety of the royal progeny outweighed decades of service and reward. “His loyalty to you speaks well of him,” she said to the king. “Even your dog is not so loyal.”\n The old dog looked up at her, the tip of his tail twitching. The jester thought that if he had had a tail, it might have twitched as well.\n The queen spoke more than she knew, and behind his beard the king mused. The jester farted outrageously and refused to say a word, but within the scrawny rack of his chest, his heart beat with both fear and love for the queen who at that moment was proposing that he be pensioned off to a mountain barony safely away from tender gazes. His love for her exceeded the bounds even of his love for ruler and kingdom, and in that moment the jester bitterly regretted the day when he had loosed his one bit of magic to save the king.\n Outside the castle walls, the jester sat crosslegged against a dead tree, looking out over the shore of a lake whose surface was rippled like an old window. He was tired of conjuring witty deflating comments. Tired of handstands, tired of juggling the skulls of the king’s would-be assassins. He’d grown old, found aches in his joints and sleepless nights at the end of every day. There were many things he wished had never happened.\n The jester had not always been a jester, any more than the king had been a king or the king’s dog had been a dog. The day the old king died, the crown prince sat a silent vigil by his father’s body until midnight, when he leapt to his feet and went to the chamber door. “Tomorrow a barred door closes on me,” he said to his guard. “Tonight I walk through my city.”\n In the marketplace the uncrowned king walked among his subjects. He flirted with shop girls, bought perhaps one too many flagons of wine, and found himself in the shadow of the city walls watching a pair of ragged street performers. They were tired and performed reluctantly, but he gave them the strength of gold thrown at their feet. When the first birds had begun to chirp in anticipation of the dawn, the pair of acrobats were still turning their tumbles and mining their repertoire for tricks this munificent stranger had not yet seen.\n Few things travel faster then news of a king’s death, and the two weary acrobats were attuned to town gossip as only itinerant clowns can be. The older brother had absorbed the news and let it find a resting place in his mind; the younger had grown consumed with desire to avenge an injustice perpetrated by the dead king many years before, when an unlucky circus ringmaster had made an inopportune comment about the old king’s cleft palate. One thing that travels faster than news of royal death is tidings of royal insult, and before long the ringmaster had vanished into the castle dungeon as his two boys performed with masklike faces before their sovereign, who rose at the end to pronounce the show the most excellent he’d seen in many a year.\n The older son had made his peace with this. One lived in one’s world, and one did not insult the king. The younger, though, turned the injustice inward and fed on it, not realizing that it was also feeding on him. Over a span of ten years man and hatred grew more to look like one another, and at last on a breezy summer night with dew on the ivy that climbed the city walls, the younger brother, addled with fantasies of regicide, saw his chance for revenge.\n It would be their final routine, the brothers told their sole watcher. Dawn was coming, and besides they knew no trick to better it.\n The uncrowned king accepted this. “I have been well entertained,” he said, “and who better than you to know when you have no more to give?”\n Nodding, the brothers unfolded a leather package containing ten knives. “Ready?” the older asked.\n “We should rehearse it once.”\n “Start with three, then.”\n The king couldn’t be certain whether the clowns were really so uncertain of this routine, or whether the uncertainty was part of their patter. Predawn gleam flashed on the knife blades as they flickered between the two brothers in a pattern almost intelligible. “Marvelous,” the king said. “I imagine that’s dangerous given your eye. Can you see out of it?”\n Only for a moment, an eyeblink or even less, a long-dormant sense of hurt bloomed in the older brother. His life had given him a keen sense of irony, and it never escaped his notice when audiences tossed comments toward him of the sort that had gotten his father killed. The pain passed almost immediately, but not before causing a tremor in his throwing hand.\n Blades clashed as the younger brother knocked the errant throw from the air. “Careful, brother,” he said. The older brother blinked.\n “Well enough,” he lied. “I see well enough.”\n Six knives again, this time flawless for thirty seconds. Then the younger brother said, “Now four. Now.” Together they stooped, and the gleaming pattern between them recomplicated itself just long enough for the king to think Masterful. Then the younger brother cried out and dropped his knives in a clatter. One of them bounded toward the king, who reached to pick it up.\n “Not to worry, Your Majesty,” the younger brother said. He stooped to retrieve the knife, and just as it registered in the king’s mind that this slim and smiling trickster knew who he was -- had watched him from crowds since he was old enough to assume the paste crown of First Successor -- the younger brother leaned in low and thrust the knife into the king’s belly.\n What should have followed then was a lingering death and a hasty scampering escape over the city walls, but the uncrowned king was not quite the fool the younger acrobat had thought him. His mail shirt, forged within subterranean earshot of the cell where the old ringmaster had died wishing for sunlight, caught the blade and held it with only an inch of its tip parting skin and muscle. The younger brother’s weight bore the king over, and he lay on his back, struggling to catch his breath and looking calmly into the eyes of his assassin.\n “This blood,” the younger brother said, holding his cut hand so the blood dripped onto the king’s face. “It is my father’s, and I will avenge it.” He drew another knife from his belt.\n “You are older than I am,” the king said. “I do not know your father. Your grievance is with a dead man.”\n “When you are dead,” the younger brother said, “I will have no grievance.” He planted one knee in the king’s chest. His brother called his name.\n “Kill me, then,” said the king. “But know that you redress no wrong. You kill as a mad dog kills, because you don’t know what else to do.”\n Perhaps the younger brother hesitated for a moment, or perhaps magic saw its opportunity and spoke through his elder sibling’s mouth; but before the knife could fall the older brother said, “You will not be a mad dog, brother. You will not repay shame with shame.”\n With those words, his life’s one bit of magic whirlpooled from his body, and where a moment before the king had lain helpless under an assassin’s knife, now the older brother watched as a small brown dog pawed at the king’s tunic and strained to lick his chin.\n The king pushed the dog aside and with a disgusted noise jerked the knife from the broken links of his mail. “Did you know who I was?” he asked.\n The remaining brother, three knives in his two dangling hands, shook his head.\n “It is odd,” the king said, and had to pause for breath. He struggled to his feet. “To thank a man who would turn his brother into a dog.”\n “Odder yet to save the son of the man who killed my father,” the older brother replied.\n The king looked from the older brother to the attentive dog, who limped ever so slightly on one front paw. “So,” he said.\n “But I have seen men die, and few were able to face it as you did,” the older brother went on. He began to gather up his props and gimmicks. “I thought I saw a kingly man in you.” He tried to say something more, but he could not speak of what he had done.\n The dog sat in front of the king. His tail wagged against one of the fallen knives, and he started up at the clatter and ran a few steps before returning with tail and nose both low to the ground. “Take care of my brother,” said the lone acrobat as he shouldered his pack. “I see he wishes to remain with you.”\n “Why should I not kill him?”\n The acrobat looked the king in the eye. “Your grievance is not with a dog.”\n Dawn broke on the castle’s highest towers.\n “True,” said the king. “Very well, he will remain with me. As will you. I will have you and your brother at my throne, one to remind me of how close to death I came, and the other to remind me of why I was allowed to live. Walk with me, king’s jester.”\n All of this was bad enough; but then the jester fell in love with the queen.\n He remembered the moment of falling in love like a story told by someone else. The great stones of the hall outside the throne room, pale gray except streaks on either side, where generations of the royal wolfhounds had rubbed their ears along the grooves and ridges in the ancient stones. This king, whose life the jester had saved, was the first in memory to keep a limping brown dog of anonymous pedigree instead of the great loping hounds named for stars and mythical ancestors.\n Passing her in the hall: she taller by a head and younger by two generations, he favoring a heel bruised earlier that day tumbling for an ambassador. She with hair the color of the old streaks in the walls, a brown almost black, and eyes the color of the untouched stones, the gray of a cloud heavy with lightning; he with a balding head and knuckles swollen by winter’s chill. The jester became exalted in that moment, realizing that she was the castle, she was the kingdom, it was the twin example of her kindness and her iron rectitude that made it possible for the king to spare the jester’s brother. He loved her because she seemed in that moment to him like an ideal given flesh, an ideal for which the sacrifice of a brother was not too great. Foolish, yes, and sentimental: but as good an explanation as any.\n It haunted the jester that he had been willing to kill his brother. And he had; only the fickleness of magic had sped his mouth and stayed his hand. He found some small comfort in the royal heir’s person, his utter lack of resemblance to his father. The old king had been capricious, vindictive, wanton in both kindness and cruelty. His successor remained scrupulous and fair, even generous. Around him the kingdom prospered without war.\n And I didn’t kill my brother, the jester thought. I saved him. I protected him, as an older brother must.\n The king’s dog was old now, gray around the muzzle and lame in his hind legs. A superstition arose that the king would live only as long as his dog (no one said this about the jester), and although the king knew better, still he protected the dog’s life as jealously as his own, lest its death provoke unrest in the kingdom. The irony of this kept the jester in fine form for the mordant humor expected of him at court.\n What would happen, he wondered, if the king were actually persuaded to foist him off on some rustic baron? Sooner or later, wouldn’t the story of the dog his brother leak between the royal lips? And wouldn’t the queen . . . ? The duty of her heart was to her husband, and of her mind to her king. She would have the dog killed out of a kind of loathing mercy, pitying the beast its lost humanity even as she ordered it drowned to ensure that no entombed memory would resurface and tear out the throat of the sleeping king.\n Having once thought this, the jester grew certain events could play out no other way, just as having once seen the queen as his own ideals bodied forth he could never rid himself of his passion for her. Exaltation fled him. “Why must I love her?” he demanded of the sky, but the clouds of course took on the color of her eyes and kept their peace. Love twisted inside him the way magic had on its way from his body, anguish and ecstasy. Loving the queen who would kill his brother, the jester could only think of her implacable magnificence, her mind like light in cold water.\n It was afternoon. The jester left the lake, went back to the city and the castle, and the next day the queen mentioned it again. Wouldn’t the old jester be happier away from the trials and pressures of court? she asked, slipping through the fissure in his field of vision, and the jester knew what he had to do.\n The spell broker kept himself secret, but the jester knew where to find him in the twilit side of the city. “My magic is gone,” the jester said.\n “Else why would you be here?” the broker said, and displayed brown teeth in a round white face shaved smooth as an egg. “Let me look at you.”\n The jester kept himself still as the spell broker plucked a strand of his hair and burned it over a candle, traced the outline of his ribs, smelled his breath, looked into his eyes and ears. “What is it you want?” the broker said upon finishing his inspection.\n “The safety of my brother.” The jester had heard stories about the deviousness of the spell broker. It was best not to be too specific too soon.\n “Safety. Magic cannot guarantee safety. Magic can sometimes kill a threat, perhaps redirect it. Forgetting-magic is the easiest, though, and the surest.”\n She could forget, the jester thought. It made him inexplicably sad, though, the idea of court whispers: the queen, forget? She of the searchlight mind and unshakable will, the grey eyes like stones that held within them memories of each and every soul who passed by?\n I will protect my brother.\n “Forgetting magic, yes,” the jester said. “If it is the easiest, it must come cheaply.”\n “The cheapest magic comes dear,” said the broker.\n “Name your price.”\n “Your eye.”\n “Very well,” the jester said, and in a sudden panic thought too soon, spoke too soon, because the broker was still speaking, and the words out of his mouth were, “Your left eye.”\n My good eye, the jester thought. How will I look on the queen?\n But his mouth was already open saying yes.\n He found he could look upon the queen, after a fashion. If he positioned himself correctly, she would, on her way to kiss the king, walk through the part of his world that had not faded to a lifeless fog. He could not see her clearly, only well enough to remember how she had once appeared to him.\n Well enough.\n I did this for you, he would whisper sometimes under his breath. So you would not feel betrayed when you discovered what I have done for my brother.\n In the jester’s thirty-seventh year, when the dog his brother was thirty-three, the king had retired him from acrobatics, and the jester passed his days in excremental assaults on courtiers even as he kept his head turned slightly away to the left of the queen. The court thought him blind in the right eye instead of the left, and grudgingly credited him for his seemly deference to the queen’s presence. They imagined that this deference arose out of gratitude at being permitted to remain at court, and the queen’s stature increased among the aristocratic gossips, her reputation for kindness burnishing the well-known brilliance of her mind and the much-praised symmetry of her face. She often stooped to pet the old dog, who would thump his tail against the leg of the throne at her approach.\n The jester kept his secrets, and he was careful around the children. The broker’s spell made no guarantee against the queen’s remembering. If he pitied himself from time to time, he ran his fingers where the queen’s had been, along the dog his brother’s neck, and he said to himself, unable to stop: One lives in one’s world, he said to the sleeping dog. One lives in one’s world.\n 4\n The boy still slept. But Will had come in from outside. “You’re not blind,” he said.\n “I’m not a dog, either,” Paulus said. He set Will’s copy of the Book aside.\n Will lit his pipe. “Twice someone spent their magic on you?”\n “Aye,” Paulus said. “Twice.”\n “And how did the second come about?”\n “You wouldn’t believe me,” Paulus said.\n “Already I don’t believe you,” Will said. “Tell another one.”\n “My brother confessed to the queen and as a reward for the laughter he had brought to the court, she bought me back my shape as a man, on the condition that I enter the king’s service. I fought eleven years in the king’s wars, and then he sent me to kill the dragon. When I came back, my brother and the king had both died, and I was released. Since then I have been for hire.”\n Will blew smoke rings over the sleeping boy. “All of this after you tried to kill the king? Ha,” he said. “I wish that was true. No, I don’t.”\n Three times, actually, Paulus thought. The forgetting he’d bought four years ago in The Fells was the third. Paulus made an occasional pastime of imagining who that little bit of magic had come from: a gambler needing to cover a debt, a soldier wanting a woman, a merchant whose cargo had foundered in the straits. Perhaps even the woman who had borne this child who might be his. The brokers of The Fells moved through the hamlets and farms of the mountains, following the lucrative scents of poverty and desperation. Their prices weren’t fair, but even a rapacious deal often made the difference between feeding children and selling them.\n “Three years ago?” he asked.\n “Four, in the fall.”\n “How?”\n Will shrugged. “She was bringing water. Sat down for a rest beside the path, I guess, and I found her when I heard the boy crying. Maybe six months old, he was.”\n Could be, Paulus thought. The sleeping boy was curled on his side, arms drawn in under his chin, still shadowed from the sunlight falling through the hut’s single window. Firelight glowed in the tangles of his hair. Paulus thought he might see something of himself in the shape of the boy’s shoulders, the line of his jaw.\n Today I must kill Myros, he thought. Because if I do not, I will have to kill this boy, and I cannot.\n “Have you named him? Had she?”\n “She called him after you,” Will said. “So I did, too.”\n Paulus was brimful and shattering. A boy with my name, he thought. After all this, all the leavings and the years with no place to call my own, in my fiftieth year I ride out on a mission of killing and find a boy with my name.\n It was written in the Book: Let the Lesson be.\n He stood, and his knees cracked. “Today this ends,” Paulus said. “One way or another. If the boy asks for me, tell him I will return by nightfall or not at all.”\n The boy. Still, Paulus admonished himself, you cannot call him by his name?\n He walked the final steps of his Agate Tower errand, his body leading him to the dragon’s cave as if his scars were lines on a map. It would have taken Myros some time to prepare the spell to control the dragon, and more time yet for him to gather his courage and enter the cave when the dragon did not come out. Quite a string of surprises Myros was in for, Paulus thought, and bared his teeth as he wound up a switchbacking footpath that ended on the ridge above the cave. He made no effort to disguise his presence. If Myros had already spent his energy on the spell, then he was just another baby turtle; if he had not, Paulus was in for a hard fight, but on this day he would kill no man from behind. He crested the ridge and closed his eyes, riding out a wave of memories. The cave mouth, like a half-lidded eye, was the same, yet it seemed smaller to him; the smell of the snow on the north side of the ridge made him think of ice storms rattling against a window with a sound like the rasp of the dragon’s scales.\n They were all before him now, the specters of those gone from his life: his brother, Andrew, his mother, the king. Men he had served with. Joy. And the boy she had named for him.\n When Paulus opened his eyes, Myros was looking at him from the cave entrance. “For this you made me kill children,” Paulus said.\n “I made you do nothing,” Myros said, and made a gesture with his ringed hand.\n Paulus was alight with pain: every blade that had ever cut him cut him anew. He felt the teeth of dogs and the dragon’s talons, the piercing of an arrow and the grate of a spearpoint across his skull. Thumbs gouged at his eyes, and bootheels ground his fingers. He dropped his sword and felt his knees buckle. Blood roared in his ears, and somewhere beyond it he heard Myros’ footsteps on the stones of the trail. Looking up through tears, he saw the apprentice coming nearer. You misjudge me, Paulus thought, and drank of his pain until it had given him strength to stand, and when he had gotten to his feet he left his sword where it lay and fell upon Myros with bare hands.\n When it was done, he lay gasping on the stony ground as the apprentice’s spell slowly faded from his body. He felt as if he was being knit together again, and when the pain had faded into the leaden dullness that for Paulus always followed killing, he got to his feet. Leaving his sword where it lay, he walked a short distance into the cave, to the point where the light from without finally failed. Trailing away into the dark, the bones of the dragon had already begun taking on the color of the stones around them.\n One more, Paulus remembered thinking. I was right, and I was wrong.\n It was afternoon when he returned to Will’s farm. The boy was on his hands and knees following an insect through the beaten grass. He looked up at Paulus’ approach and stood. “There’s a beetle there,” he said.\n Paulus knew in that moment how little he understood of children, and how enormous his task was. “Your name is Paulus. Is that right?” he asked.\n The boy nodded, but his attention was already wandering back to the beetle. He parted the grasses looking for it.\n “My name is Paulus too.”\n The boy looked over his shoulder at Paulus. Where, Paulus wondered? A place without wizards. A place without these bargains driven for your soul. A place where my boy will not follow my path. He realized he had forgotten his sword, and resolved that he would never wear another. Let the Lesson be.\n “You’re going to come with me,” Paulus said.\n And the boy said, “Where are we going?”\n Originally published in The Magazine of Fantasy & Science Fiction, June 2007.\n Alexander Irvine has written more than thirty books. His most recent original novel is Buyout, while on the licensed front he has recently written novelizations of Pacific Rim and Dawn of the Planet of the Apes, as well as The Secret Journal of Ichabod Crane, for the television show Sleepy Hollow. He also writes the online games Marvel Avengers Alliance, Marvel War of Heroes, and Marvel Puzzle Quest. A native of Ypsilanti, Michigan, he lives in Maine but still roots for the Tigers."}