{"fingerprint": "OCtNyEJRanezykm2JaOIj++aJDk=", "sitename": "Clarkesworld Magazine", "title": "Say it Low, then Loud by Osahon Ize-Iyamu", "author": "Osahon Ize-Iyamu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ize-iyamu_01_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Say it Low, then Loud by Osahon Ize-Iyamu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5190 words, short story\nSay it Low, then Loud\nEfosa always dreams of absolutes. A whole integer leaping through the spaces of his subconscious. A positive value an everlasting constant in sleep, where there should be no place for negativity. No space for fractions.\nA half thought mind is the breeding ground for enemies, his mother says, in sleep too. She is long gone, as her ancestors have called her. They beckoned her, and now Efosa does not have enough cultural ties, relatives—never enough, space is not your ties, not your fatherland, not your once colonialist objective.\nHe misses her proverbial wisdoms. All the words that twisted in on themselves, often silly but always true. Upon pondering on these sayings, they always grew more interesting and revealing, layers and layers of knowledge. They were like food to the tongue, and he usually needed seconds. These secrets she knew were passed down to keep the history, the culture.\nCulture is not an absolute. Not to him, at least, in its values, as it is never complete, not perfection. Not a whole. There’s always a disconnect, a barrier preventing his identity from being his everything, always . . . rough numbers not causing him to fall to slumber.\nEfosa’s mother refused to share more secrets with him after he announced his role in the war. She screamed and rose in temperament when he told her. She shook her head in all her disapproval and folded her arms in betrayal. Finally, she became a negative equation, then turned silent. She made the family shut him out. She cursed his breath before perishing. She placed all the special values in a space he could not reach, with family members who will never tell.\nEverything that’s valuable is told orally, kept within the locks of the mouth, and all his earth country’s popular history and properties that’s found in bits and bytes have been appropriated, rendered meaningless.\nThere is nothing without context, specifics.\nWhen he thinks on these things, sleep is once again a thing that cannot be savored, an accomplishment destroyed, a war that makes him wonder what’s worth fighting for, who he is, who he is meant to be.\nEfosa and his war general both love values, but his war general’s love is to the point that she thinks words should be obsolete. Efosa never agreed to this, and upon hearing the woman proclaim it the first time, his lips curled to a frown. He obsessed over it, this concept that words should be nothing. It disturbed his sleep, the general’s belief, the one thing he values.\nWhen Efosa told the general he didn’t agree with this opinion, that numbers are indeed great things but words control the world, the woman nodded, but shifted away from him after that. Always made excuses when Efosa asked if she wanted to solve equations with him in the great library hall. Avoided him, like she couldn’t stand his thought process.\nHe had to do his late hours calculating in the hall with all the strangers that have eyes on him; on his soldier badge, to be specific. The young Indian tech whiz that has an insult for Efosa under their breath. The Igbo college student with the bulging muscles and towering height, who is rejecting him at every step, every feet. The Black woman and her two grandbabies that spit at Efosa’s feet. Most people he sees, knows don’t like the war; they know enough about it and how much it costs. How much it takes. Efosa wonders how much he needs to do to push these people to the point that they take action, destroy his work and livelihood. This colonial evil.\nWhen none of them do anything, his thoughts go back to words and purpose.\nThe annual code-naming day that came in the winter consisted of General 1019 listing her numbers to all officials, like she was counting out a census. The soldiers’ war names, for future reference, forever and ever. For Efosa, she stopped, peered at him. 1019 assessed him, before she stepped really close to him, like old times, and named him Whisper.\nWhisper: Because you should always be silent and respect your superiors. Because your culture even has a foundation of greeting and the young < old, not =, not anything other than what they gave you. Because you must not always speak, disagree, when there are wars to be fought.\nBecause maybe if you calculated more—estimating expenditures, equating soldiers to figures when filing strategic placement—instead of thinking, you would finally find rest.\n1019 never told him what Whisper meant, but he couldn’t deal with all the different interpretations going on in his mind, so Efosa made a constant to soothe his dreams.\nWhisper: Because your flying is soundless and your limitations are boundless and you are a valuable asset to winning a war assumed worth fighting for.\nLike horseback, like carriage, like airships, like drones, past and future all together, over the planets and stars, Efosa goes to fight his enemies and conquer the land.\nHis enemies. The war should be personal, even though he couldn’t further disassociate from this. Even when he’s sure everyone is tired of it, and some don’t even know about it, and it’s just reducing the empire to poverty, closed hands that cannot give, but now the war has just become a habit to pillage and take, as that’s the constant.\nThe difference between him and the war: The war never heard of the concept of rest. Never wants to stop. Never wants to fall down and die, empty itself and all its emotions. The war’s identity is Western.\nThe politicians call the war small-scale missions on broadcast missions everywhere. The government doesn’t provide enough equipment, funding. Despite all this, it doesn’t end. War never pauses, because it’s easy to know where to go when it’s only to destroy.\nHe’s always been taught to love anything, everything—engineer, doctor; let minorities take space and make themselves majority; his mother once said—so he can still feel active and find work meaningless. Because of this, he doesn’t think Mama should have been all that surprised when he told her where he was going in life, but at least it told him that there are wrong options, bad choices.\nWhat can he do if not the war?\nHe frowns today, deep scowls scarring thought of any kind, which he would have appreciated if he was in sleep. 1019 once offered him a cryo-freeze pass if he ever wanted to take a little break and get like, well, 1,000,000+ hours in slumber, give or take. She estimated that when he got up they would still be fighting the war and gaining territory for humans to expand to new places (colonialism; it’s colonialism) without much opposition.\nIf there is opposition, then there is death.\nEfosa frowns because the calculations for the speed of the drone he rides today and its level of operation is at a fractional level. He tried and tried and tried the night before, calculating repeatedly for different result, but math is firm. He tore out his curly black hair in clumps, easier to do after last year when he removed his dreadlocks. He can’t even approximate the properties because increasing values for drone operations almost made him crash into the spaceship of a parasite species that had spindly blue appendages once, when 1019 was going to try out her special attack formation that day, which would have been structured to look like a foot from a distance when all the drones came together. His punishment was even worse, in the form of helping amend the budget for his crash, taking away the money from public health centers, because at the end of the day everybody suffers.\nHe has to ride out a decimal and all its bumps in the air. The giant metal disc he sits on has invisible barriers all around it for oxygen and weapons control, but it’s mostly seen as just a circular flexible magnet that has rectangular slots to aim at the enemies. The machines aren’t as strong as they used to be.\nHe has to ride his ship through the dull natural light of space, since protests by NGOs came down hard on all the soldiers for encouraging light pollution through the artificial brightness of the ships. It was a huge scandal.\nHe never sees those protest numbers when it comes to the colonialist issues in invading peaceful planets through hostile takeover; but he’s still a hypocrite and not really changing anything, only grinding his teeth about inconsistent values.\nEfosa has never had his priorities right. Maybe it would be better if someone stopped him, said cease and desist. Somehow, he hopes that cultural secrets and the past of his ancestors will help him with his mistakes, show him the way to go—see how perfect his siblings and relations are; na the same Mama raise them—but the family’s shut him out, and they’re anti-war, and they’re withholding secrets like children and parts of his identity he needs now more than ever.\nEfosa doesn’t know how to say he’s at a standstill.\nHe’s not exactly pro-war, but, meh, this has good health benefits. And security, too. He’s going to have a full life. In the future, maybe, where he sleeps with peace . . .\nThe formation work is sloppy and disgraceful. The ships were supposed to form a balloon but they look already popped in their construction; full of defeat. He moves the fastest and without sound but he still wobbles his way through his drone like he’s never done an operation before. Efosa almost crashes. He doesn’t do anything to show he’s in control, doesn’t feign pulling the reigns of the drone he rides like his acquaintance 2348 does (there are no friends in war; just those that live and die with you, fight side by side with you, that flash before your eyes then disappear like memories), and 1019 makes him go to the back of the line.\nThe back of the formation is filled with interns and trainees that just bump into him every five seconds. They’re sloppy too, a mixture of who 1019 and officials are testing and who they don’t want and who have to stay because of potential lawsuits. He can hear the spoils of war—genocide, destruction, the sides, as well as the annoying sounds of excited first years trying to get an interview with him while they’re on a mission. Neither of them he really appreciates.\n“My monthly average is going to be so bad,” he mutters under his breath, while the noises of activity go on all around him.\nFor a minute, this feels like rest, but . . . no, it can’t be. No. Efosa will not accept it. This moment feels like a crushing weight beneath his windpipe, an ache between his eyes, and it is not what he wants. Not what he’s been looking for. Efosa will literally throw himself down from his drone and calculate his speed to the absolute infinity so he can burn up as the waste of oozing flesh and muscle that he is if he finds out that rest means giving up spirit, mind still whirring when the war takes and takes and takes, and he is left with nothing.\nThe family is always watching.\nEfosa’s ties are supposed to be far away on Omega-17, places where kin can continue to shut him out and distance conversation. Leave him in isolation, as being cursed before death carries a shame full of stink that never leaves. The elite all lay on home planet, bound to tradition and every old way. Efosa has never interacted with an Elder there since joining the war, and they would rather die than talk to him. Efosa’s great-grand-uncle even has pictures where the man dances with serrated, long legged parasites, his uncle and the being forever memorialized in a tap dance. Whenever Efosa’s great-grand-uncle sees him, the man screams “criminal” like bloody murder. Once, the man convinced the family to put Efosa in a cage when he was visiting, citing appropriate punishment for his war crimes.\nHis elders’ existence is a mere revelation, a look into his heritage, but they will never give him the privilege of even a smidge of more identity.\nMaybe one day, Efosa thinks, he can gain these secrets without their approval. Perhaps if they ever digitize this information he can calculate a hack into it.\nThe family members with the wandering spirits are not Omega-17, but rather all over the galaxy, in places like solar huts and climate-protecting holes. But he knows his nuclear relatives are only here, near the war region’s current station, spying on him.\nThey aren’t subtle with it. Every once in a while he sees Ede, his sister, reading from an archival memory tab then peering up at him every minute or so in the great library hall. He always waves, but she looks alarmed, her eyes widened whenever Efosa spots her, and quickly runs away. It gives him a good laugh.\nStill, he’s glad they’re here. Their home is steadied at a forever value of ninety on each side, a perfect right angle which makes the place never lopsided, even with its terrible location near asteroid clusters.\nHe only goes to visit when those that hate him most aren’t around to chase him out, like today, when his war-hating uncles have gone for their annual visit to homeworld. His skin feels disgusting on him and he hates himself a little bit, so that’s also another reason for visiting.\nHe’s not sure what caused a trigger in his sleep last night: family or fragments or . . . the war, that’s a new one. It occurs in violent flashes—the blood that’s not literally on his hands but in sleep, he can taste it on his lips; the flavor and song of extinction (silence, then pandemonium); the cry of what lives and what breathes, before it’s in the aim of a beam and then . . . gone.\nIt explains hating his skin. It explains visiting the family that will stress him more. As Efosa enters, past his family’s security system that’s finished scanning him, he can hear the sound of his sister, Osama, sleeping, while his other sister Ede is humming the lyrics to “Black Sheep.” Joke’s on her, since he’s already eaten the chocolates he brought for them.\nEde, of course, is wearing an Ankara print wrapper and head scarf on her head. The smell of Jollof rice wafts through the kitchen, followed by a hearty selection of stewed chicken that’s been left to marinate in spicy tomato sauce and stir-fry. Dodo is laid out in celebration: rose platters, cubes, sculptural designs, while the children snack hungrily. Ede must be trying to prove something, still, with all this: Efosa delights in knowing she hasn’t yet reached anything close to satisfaction. He sees her in markets and shops, and each time he comes to visit, it’s always more food, clothes, traditional songs she never learned.\nCulture she’s trying to expand like plants that never grew. He does not know how she plans to go higher when she doesn’t have all the seeds.\nThe cultural secrets awakened her, Ede tells everyone each year at family gatherings on home planet, and those who’ve been told, nod. Efosa finds himself drinking more at those events.\n“How is the genocide campaign?” Ede speaks, like every minute she expects to burst into a flurry of old languages. It doesn’t help that The Grant is always on her mind, the prize for the family member that can first deliver a Bini speech not influenced with any other language or imperialist power (no pidgin, fellas).\nNever enough, space is not your ties, not your fatherland, not your once colonialist objective.\n“How are your children?” Efosa diverts, and he immediately sees her eyes perk up, leave the lines of contempt and betrayal. Ede tries her hardest to be strict but is ultimately willing to discuss the easier thing, instead, which is why she’s Efosa’s favorite sibling.\nIn the next generation he is nothing but an uncle. There are less complications to the family dynamic with his youngest relatives; they don’t know what to hate him for yet. They don’t know what to keep from him. Slowly, though, when their values and loyalties come to them, he knows his days of objective love are numbered.\n“Ugh, just look at this one, Efosa! I can see it in his eyes, he’s shining,” Ede screams, causing her son, Ghare, to look up from his drawing and glare at her, before focusing back on his work.\n“Look at that concentration. His face dey scan informate! Ah, see the—”\nEfosa scratches his head and sighs, all of Ede’s words muddled in his brain. “Can you . . . not speak to me in pidgin?”\n“Why not?” Ede pouts, Osama’s snore almost clouding their conversation.\nI understand it less and less with each passing moment.\n“It’s disgusting. It’s dirty,” he speaks, waves her off.\nEde pauses to look at him. Her eyebrows are raised, and her face is a sweaty mixture of surprise and slow remembrance, so she adjusts her tone accordingly.\n“Ok, well, I’m not disgusting. And neither are all the—”\n“Oh, for—stop jumping to conclusions! I didn’t mean it like that. Quit trying to antagonize me. You’re always doing this!”\nEde laughs, her voice as bitter as the green tea she likes to drink. “Antagonize? I don’t think I could do any more of that.”\n“Ede, I can’t deal with this. You need to stop over—”\n“I’m over? Over-what? No, you know what? I think I’ve been letting you get too comfortable,” Ede replies, and Efosa’s eyes widen. He didn’t expect this from her. “I think you should get out.”\nEfosa’s face pales, and he runs to another side of the room before Ede can insist again. He knows if she sees him getting along with Ghare she won’t speak anymore. He just has to avoid her path, not step on her toes so he can enjoy the family he has left.\nHe deserves it, he knows, the scorn and contempt, and all the consequences that are surely coming his way (he won’t leave the war without a scar, a bruise, a broken promise, a shattered life), but Ede is ruining his mood.\nOut of his pack of chocolates, he places a triple-coated milk delight near Ghare, watching his nephew’s sketches. The pencil work’s faint, but grows broad and more defined with each passing moment, like the boy is finally jumping higher, towards the sun with each stroke.\n“That’s cool,” Efosa says to Ghare after a pause. He knows what the boy’s drawing, but he always enjoys hearing people’s excitement dance off their voices when they talk about their work. “What is it?”\n“It’s a generation ship. For animals!” He says, outlining a globe with his pencil midair as he skyrockets out his seat. “We’re moving more towards history educationally, and the computer and art teachers have been droning on about the topic forever. I’m inspired.”\nThe vessel Ghare sketched takes up the page, and it resembles a giant fan the way he modeled it. Efosa loves symbolism, imagery, even the ones he can’t understand.\n“The heaviest animals are on the bottom floor, and there are cold and underwater regions for things like polar bears and fishies,” Ghare continues, visibly effervescent.\n“Who’s gonna slow roast that chicken in the picture for generations to come?” Efosa teases, pokes Ghare in the chest.\n“Mummy and Aunty asked this same question two days ago. There are no humans on this ship! Oh my goodness, why do you all love food so much?”\nEfosa shouts and points the accusatory finger at his nephew. “That was a good amount of dodo I saw you enjoying earlier, child.”\n“I was prepping my energy!” Ghare screams defensively.\n“Nah, no food shaming here. You should be fat in peace,” Efosa jokes.\nGhare shrugs. “That’s fair. But there’s everything on my ship: there’s places for bugs and mosquitoes and elephants and all the things that go moo and that fly and that sing. All the things that swim and breathe. But no humans.”\n“He’s a poet, too,” Ede says, then bursts out crying, stretching out her hands to the heavens.\n“I love the construction of this!” Efosa says, throwing his hands in the air and then placing them on his nephew. “I don’t think this was intentional, but this work is at a perfect sixty. That’s a pretty good estimate for flying the galaxy. You know, where I work, I do a lot of this kind of thing, and the math, I must say—”\n“Um, Uncle Efosa, I hate to interrupt, but your hands shaking while on top of me is really uncomfortable.”\n“What?”\n“Your hands—they were fine before but then you started talking about where you work and they just started shaking all of a sudden.”\n“Oh.” His hands leave his nephew’s slowly like that’s his last latch onto the universe, and pretty soon the world is crashing over him. The entire concept of existence falls on top of him. He has drowned in a sea of equations too complex for him. He can’t raise his leg out of the rubble.\nHe can’t leave that house fast enough.\nWhisper: But your sounds are not quiet when you wake up screaming at night, disturbed, enraged, hungry. Everywhere you make a sound. Everywhere you are whining and hopeless, lost in a desert of windy sighs that have blown you into no direction. No direction. Not even magnitude.\nWhisper: Maybe your name is a farce, a mockery, a snicker behind your back. There’s something behind your back. There’s a monster behind your shadow or is that just . . . you? You reflect you. What are you, if you can’t even be a constant, solid then differentiated to be at zero, at rest?\nHey, now: A constant is consistent except only when it’s content.\nA whisper: You won’t sleep fulfilled. You won’t live fulfilled. You won’t be—\nEfosa opens his eyes and sits up in bed and looks for a recording. He wasn’t sleeping. He wipes his eyes and makes some instant onion noodles over low heat while he scrolls through old videos. It is ancient, but the recording is clear to mind when he cannot sleep, as most things are.\nAll his internal conflicts saved for the night hours.\nIt is a tape that’s like a checklist. It reminds him of Mama, yet it offers no sage advice, no cultural specificity. It is as bland as white rice and that is why he can’t connect to it.\nHe plays the recording.\nWe know that soldiers are doing good work, and we’re here to aid with your needs! And we’re ready to tackle your mental health problems with our all-new Sound for Help system. Say it loud into your room and be free, so we can help fight this battle TOGETHER.\nThe room listens, amplifies through static because this function has never been used before by Efosa, like a rat expecting the steps of a new human before it can move.\nMental health problems . . . together.\nHe can feel his insides moving—slowly pumping, beating. He can feel the knot in his throat.\nTogether.\nHe hesitates. He can’t find the words. They can barely come out of him. His vocal cords are tightened, still.\n“I, Efosa “Whisper” . . . I’ll be fine. Turn it off. Turn it off.”\nFriday at dawn at the station, where he is still full of sleep. Of thoughts. Repining restlessness and frustration while the alarms ring. Efosa screams at the room’s control systems to shut off the noise, which doesn’t work, so he breathes, then asks nicely, which does.\nThere is silence.\nDressing is nothing; the same selection of clothes from a time when the war used to be stylish and sponsored, what caught everyone’s eye. He could opt for a wrap shirt that he could pin to his shoulders, but he takes something simple, ordinary.\nYet he runs up to training and finds stunning hilarity.\nIt actually makes him belly laugh, makes him stop jogging. Makes him stop thinking. Is this him? He’s falling out of routine. The world’s in chaos. A war. His war. His comrades scratch their heads and even jump the air to catch the drones, but the machines move out of grasp. 1019 huffs and puffs like she’s about to blow the whole charade down but even her anger doesn’t do jack to the scene in front of her.\nThe drones—they fly, majestic, like they’ve never gone higher before. They sway, side to side, plunge dive, then move in little shifts again. The low humming of the engines feels like singing, something baritone and sweet and beyond boundaries. This is . . . a whole different complexity. A whole new sound. A new world that’s pumping through his veins. It’s excellent. Efosa can’t even fathom it.\nCould he ever imagine with his eyes that he would see his drone sing? The way it flies, so perfect, its calculation better than he’s ever done in his lifetime; it must be at infinity, at a glorious absolute. What is this?\nNo. No, it’s a chirp, the humming sound. It’s a flock. It’s a murder. It’s the sky, the whole group, the—\nBirds! The drones mimic birds. Crows, cattle egrets, pigeons, gannets. Pretty soon they’re cannibalistic, like mud catfish, circling each other round like an orbit then striking, machines clashing like an uppercut. Tearing and knocking off each other’s properties to make a nest. Must be birds again, he cheers. What are the drones’ young but scraps they sculpted themselves, a guttural whirring as the “adults” cough out parts out of engine slots to feed their babies. It’s nonsensical and yet so glorious. When the humming sound goes higher to a piercing shrill, he knows the species has changed; perhaps a three-wattled bellbird. 1019 shouts higher than ever as she calls operations to come fix this crap. He can’t stop laughing.\nThe general glares at him.\n“I’m very depressed,” Efosa diverts her attention, continuing to cackle. This whole thing is almost a mockery of the war.\n“We’ve been haaacked!” The general whines on all her holo-devices, and he falls to the floor of the general station while bursting into hysterics. When he looks up at her, she is fuming.\n“PTSD, too, probably.” With each word, his chest feels lighter. He feels . . . not better, but at least human for saying it. It’s progress, even if it’s to stop the general from killing him with her stare. His confessions are real this time, like his joy has finally made him know what to say: the right thing.\nHe never lied.\nOperations has to come and assess the situation and do damages, so the soldiers get the day off. His war has never been so ridiculous. Efosa uses one of those promo-tabs to binge comedy shows—he gets war discounts. His mind is at the kind of rest that he wants it to be—not out of defeat but out of joy. There is something to be happy over, and he didn’t get it entirely from moving forward, as he thought he would. From progressing. From getting cultural secrets. He’s alright so far, not forever, but he’ll live.\nLife is not so much a simple equation, because you get no firm answers.\nWell, he does for some things. Like when he meets the math-techs from operations who are just finishing up looking at some lines of code relating to the unstable machinery.\n“It seems a pretty easy fix. Just a routine hack, nothing special. The figures are even numbers and are pretty whole at all ends, so it was a quick reverse. Drones kind of suck but aren’t beyond repair, though,” Mohammed, an operator, speaks.\n“What kind of elaborate plan of attack was that?” One of the other operators asks, scratching their head.\n“Just trying to cause anarchy. Probably trying to spoil everything at once. No finesse to this attack,” Mohammed spits.\n“This can never happen again,” 1019 stutters, cold to the touch.\n“We’ll give your personnel better calculations for their rides and try to expand protection. Best we can do.”\n“Can’t we take out money from other sectors for more options?!”\nThe two operators stare at her with concerned faces full of furrowed brows. “Not with a good conscience. Or government approval, and to be honest, this is not that big a deal to grab their attention. It’s quite humorous.”\nAs the operators leave, Efosa wants to say how the hack looked like birds to him, up in the sky, moving through the galaxy, but he doesn’t. People don’t need to know the source of his joy; that’s how the war takes and takes and takes. That’s how it feasts, on information, and there is nothing without context. Somehow, this message feels special to him, or maybe it’s because he’s seen the generation ship Ghare drew, that all these animals just came back to life with the drones.\nEverything snaps into place with his thoughts, and he gets out of rest.\nEfosa doesn’t sleep. When the night comes, he is alive and concentrated, his thoughts working on a goal, a satisfaction in the recklessness. Maximizing potential.\nThe great library hall never closes, and the lights are always on, so he spends his time drawing architectural designs of different shapes and sizes.\n1019 gave him a mental health record, which mentions the installation of some aid-bots in the coming months to his room, as well as some adjustments. Therapy sessions. Detailed assessments every quarter, as well as helping him figure out his triggers. They will be watching him closely.\nArchival tabs of biological information lay on the table, as well as some physics records, like a new world right in front of him. He only stops humming when he starts chirping, tapping his feet on the floor.\nSomething’s different.\nHe likes a setting at -113.7385, where with just enough weight, it can make a drone feel like an elephant’s leg just about to hit the earth. Except you can’t really hit anything if space is just that: space.\nHe moves forward with a pencil stroke that makes him go from youth to age, all the while a grin on his face.\nAbsolutes are always easy: whole and perfect. Too perfect, even; too seen. Simplified. They’re easy to catch. They’re easy to fix. Easy to resolve. It’s a one-way street but his tracks are always divided. But a complete value can never be possible for a drone that wants to fly and moo and sing and jump without getting caught. Drones that want to self destroy every once in a while to make a war inoperable. A war at rest. Him at peace.\nThinking about it, his code name works, as do other things in his life right now. But there is nothing without context, specifics, the detailed image of who he is and who he wants to be.\nSo, Whisper: Because your limitations are boundless and your revolution is silence, but you know that everywhere you go, you make a sound."}