{"fingerprint": "YBJl4zruDgPyU1/nhUuZwGKE+wI=", "sitename": "Clarkesworld Magazine", "title": "Bad Day on Boscobel by Alexander Jablokov", "author": "Alexander Jablokov", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jablokov_05_19_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bad Day on Boscobel by Alexander Jablokov", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10420 words, novelette, REPRINT\nBad Day on Boscobel\nDunya stopped just outside Phineus’ unit to calm herself down. Otherwise she would burst in and start screaming at him. That was no way to start a check-in meeting with one of her refugees.\nThat gave her a chance to realize that she looked like hell. She’d already had one fight that morning, with her daughter, Bodil, and afterwards she had rushed out, unsnapped and unbrushed. It was hard enough to manage someone like Phineus, all Martian and precise, without giving him more ammunition about how lax things were here, among the asteroids.\nShe stepped out of the foot traffic, pulled out her kit, sharpened her eyebrows, got her pale hair in some semblance of order, and cleaned sleep and tears out of the corners of her eyes.\nThey’d put Phineus low-down, not far above actual rock, in a line of wooden cubicles along a root. Leaves rustled overhead. But there was no dramatic view up past the trunks to the spreading branches of the famed Boscobel axis, just some fibrous safety panels and a moving ladderway. Phineus sometimes grouched about what it said about his status.\nThere. Bodil had gone straight to bed after their fight. Dunya had a full day ahead of her. Looking good might be poor revenge on an ungrateful child, but that was what she had. And it had relaxed her enough. Now she was ready for that idiot.\nWhen she got into his narrow space, her most difficult refugee sat on his bed, bony knees against his chest. Phineus’ cliff of a face swept up into an impressive brow and forehead. It was almost too big for the room.\n“I didn’t expect you for a couple more days,” he said.\nSo she’d been getting predictable. And he wanted her to know it, which was interesting. “I have something to talk to you about.”\n“Am I in trouble?” He smiled.\nShe didn’t answer.\n“Look,” he said. “I’m happy to see you. It’s kind of a treat. Not a lot happens down here.”\n“I was just over in Lower Cort. In the Wendell Beech, about a third of the way up.”\n“Nice spot,” he said. “If you’re the sort who likes nice spots, that is. I never pegged you for the type.”\n“The branches sag down there,” she said. “Thick growth. If you climb up bough 73, then slide a bit down the branches there, you’ll find a bunch of these.” She flipped something across to him. He caught it. “All hanging from strings, blowing in the breeze. They’re getting tangled up in the twigs. Someone should have given them a bit more weight in the lower parts.”\nPhineus looked expressionlessly at the doll in his hand. It was made from human hair, looped and woven together, with the loose ends bursting from the top of its head in a huge fall. Its face was miserable, with downturned mouth and squinted eyes, like a child with a stomachache. It might have been almost cute, but it was all held together by something thick and sticky.\n“You know that’s blood, right?” she asked.\n“Look, I don’t—”\n“It’s gang sign, Phineus. Green Burnings. They jump the boughs around here. Sometimes keeping order, sometimes tearing it up. They’re Root & Branch party supporters, field workers, and enforcers. Things have been fairly balanced lately. But if the Green Burnings push up into Five Boughs, there’s going to be trouble with the Trunk. I don’t know how things are on Mars, but it’s not just about gang territory here on Boscobel. It’s always got another dimension. The Trunkers are losing support from small businesses who think the party’s not protecting their interests. Burnings jumping through Five Boughs will only make that more obvious. Things might get rough.”\n“I still don’t understand local politics,” he said.\n“That’s exactly why you shouldn’t be messing around with it.”\n“Me? What do I have to do with it?”\nThat expression of outraged innocence was the last straw. Dunya snatched the doll from his hand, startling the old Martian corridor fighter with her speed, and stuck it back in her pocket. “You know them. Hang out with them. Give them a bit of training. Just keeping your Martian hand in? Or something more? In any case, you’re going to get into trouble. Not just with some rival group. With me.”\n“How did—”\n“My sources are none of your business.” She wasn’t going to reveal that she had learned it entirely by chance, by fighting with her daughter just that morning, not because she had previously had any interest in what he was doing.\n“You’ve got the wrong guy. I see that detritus, sure. Green Burnings, whatever. They flip off branches above me while I’m catching some breakfast out at Kumar’s. We got to talking. So maybe I gave them some tactical tips, just to keep my hand in. But I don’t drill them or anything like that. Maybe they hired from outside. I mean, there are Martians hanging around Preem Bough. Maybe they’ve set up a school or something.”\nThis was unexpected. “You’re the only Martian in Boscobel.”\n“Piece of information, Dunya: there is always another Martian. We’re tricky that way.”\n“So you’ve seen other Martians out there?” she said.\n“Oh, you know, rumors. Someone uncomfortable with all the plant life is up there, looking for trouble. It would be nice to see someone from the old dustball.” He looked bleak. “But it’s probably false. I’m the only Martian here. Stuck down in the roots, going nowhere.”\nOnce Phineus started feeling sorry for himself, he usually went all the way and ended up lying facedown on the floor, refusing to respond. It could last for days.\nShe didn’t have time for that. “Phineus. Let me be clear. No more combat training. From now on. And no contact with anyone who jumps with Green Burnings. It will endanger your status if you do. Do you understand?”\n“What does that mean? Say I want to go up to Kumar’s. If a Burning comes in and gets coffee while I’m there, do I have to pack it up and leave?”\n“If you’re going to ask, I’m going to tell you. Yes. Don’t even share a common space with them until I say otherwise.” Phineus kept himself clean, but his room was a mess, with clothes shoved places that must have taken more work than just putting them away properly. He even had a couple of noodle-parlor containers under a cushion. She resisted the urge to lecture him about it. “You like to bring your food home. If you see a gang member, just do that. Any more questions?”\n“If I ask, I’ll find out I have to stay in my room. So, no.”\n“Smart man. Just find yourself a better hobby.”\nHe didn’t raise his head as she left.\nBodil had sauntered in that morning just as Dunya was getting ready to leave for work. She smelled of trees far from where she was supposed to be, with a couple of girlfriends: every spot in Boscobel had its own combination of gums, saps, pollens, nectars, and oils. Bodil relied too much on the fact that her mother wasn’t a native, and sometimes had trouble with the more subtle signals.\nWhen Bodil tried to just brush past her mother on her way to her room, Dunya had blocked her path with an outstretched leg. First Bodil had denied she had been anywhere. Then she said she’d told her mother about it, but she, distracted and too busy, had forgotten. Then she denied that her mother had any authority that meant anything.\n“And where is Dad?” Bodil had said, through too-ready tears. “Why isn’t he ever here? What’s he trying to get away from?”\nBryn was away a lot. Dunya didn’t like it either.\nBut the fight had come with one unexpected benefit. After Dunya had started in about Bodil’s on-again, off-again boyfriend Unray, who jumped with the Green Burnings, Bodil had burst out with a defense of his capabilities. “He’s the one who figures out their tactics. He’s learned a lot, don’t think he hasn’t. Martian stuff, not like the other gangs. It’s a whole other level of activity. You should see how he’s marked their territory over at Wendell Beech . . . ”\nHer mother’s sudden interest told Bodil she’d made a mistake boasting about that. But it was too late. Dunya connected that information with other things she’d learned, and understood something of what Phineus was up to. She let her daughter go, already planning a detour to Lower Cort on her way to Phineus.\nBodil could try to use Bryn as a weapon, she thought now, as she climbed to her next appointment. It would still be just the two of them for quite some time. They’d have to fight it out on their own.\nShe rose through several layers of the great branches that made up the dwelling levels of Boscobel. Sometimes the view went out a great distance, revealing a group of people at a table, a prowling cat, a vortex of rain renewing pockets of water in the great branches. Usually it was compacted, held in by leaves and lattice. She finally stepped off onto a busy pathway and made her way between shops and the small personal gardens people here kept in front of their units.\nNo matter where you were, most of Boscobel was invisible, but from this level, about a third of the way up, you got the best feel for what this world was. Boscobel was trees, the biggest trees in the solar system. They stuck their roots deep into the crust, flung themselves across the axis of the spinning cylinder of the asteroid, and then plunged into the opposite side, where their upper branches became roots. In between, vast boughs spread, providing living and production areas. Some had developed leaves meters across or complex meshes of interlaced branches. Though they still bore names like sycamore and juniper, they bore only slight resemblances to their earth-rooted ancestors.\n“I started out late,” she said, as she came up to Fama’s dining area. “I’m not catching up.”\n“That’s okay, you can help me get things ready. Let’s roll this out.”\nDunya pushed hot tables loaded with steaming pots out onto the balcony that looked out over a wide opening among the trees. Nothing dramatic, but a nice spot. It was shaded by a couple of gigantic leaves, each of which had bugs scurrying in its furry underside. To any asteroid-dweller eye, Boscobeli or not, that was comforting. It meant that, no matter what else happened, you wouldn’t starve.\nFama was a big woman who seemed to wear all of her clothes at the same time. The outer garment was always different, but Dunya thought she recognized a couple of the layers underneath. It was cooler than average here, where a breeze came down from the distant North Pole. But she didn’t think that was the explanation. Fama was still ready to flee, and wanted to make sure she had everything she needed with her when the time came.\n“Any shakedowns recently?” Dunya asked.\n“None, thanks to your suggestion.”\nDunya tried to remember what she had come up with.\n“Ah, Strop.”\nFama shrugged. “He knows his food, I’ll give him that.”\nMerv Strop was an agent of the Office of Adversary Knowledge, Boscobel’s internal security force. Fama had been getting harassed by some low-level thugs from the Dead Roots, competitors to those Green Burnings Phineus gave tactics classes to. Dunya had suggested that she invite agent Strop to dine, in a visible way. The Dead Roots had moved off to find an easier target, while Strop had stayed.\n“He’s actually got a real crime to solve, I hear,” Fama said. “Someone took off with an ancient emergency kit from some secure area. It’s sweating his skull, making him ornery.”\nDunya had to get to business. “I’m curious about someone. In the area. A Martian, I’ve heard.”\n“Anything else? Martians don’t got red dots on their foreheads to make them easy to spot.”\nDunya had found a few minutes to check up on available tourist entries. She had access because tourists were sometimes refugees in disguise—or ended up as refugees when a political shift back home left them unable to return after their relaxing vacation lounging in a tree branch. No Martians had turned up, but there was one good possibility, from the innerbelt asteroid Fortuna. Fortuna had close relations with Mars, and might have been willing to cooperate in screening someone’s identity. If so, this person had some connections to the Martian government, but was probably operating unofficially.\n“It’s someone a fairly tough guy would still be nervous about. One possibility is a woman, supposedly from Fortuna.” And Phineus had been nervous. Who knew what enemies Phineus might have made back on Mars?\n“I need some critters,” Fama said. “Soup’s kind of bland.”\nDunya helped pluck bugs from the underside of the leaf. Most of them escaped her fingers. Fama grabbed writhing handfuls and dumped them into the steaming pot. Their shells puffed, and their dissolving legs gave the stock the saffron color that marked its quality. A restaurant depended on the diet of its feedbugs as much as it did on the skill of its chef.\n“That might actually explain a few things, though.” Fama tasted, and nodded in satisfaction. “That’s enough now. Let the rest go.”\nThe bugs scurried into the fibers. “You’ve seen someone?” Dunya said.\n“Didn’t think ‘Martian’ ’til you said. A woman. Tall. Does claim to be from Fortuna but moves like she grew up in gravity. No obvious business. Has a drink here, chats with someone there. But she’s working hard the whole time. No relaxation in her.” Fama was desperate to expand her business, kept her eye on competitors and potential customers.\n“Any idea where I can find her?”\n“She sleeps at the Moss, I think.”\nFama was looking over Dunya’s shoulder to see who might have come in. She should let the woman get to her business.\n“Anything else you need to talk about?” Dunya said.\n“Well . . . ” Fama was suddenly reluctant. “Tell me. How long did it take you to feel that you fit in?”\n“Here in Boscobel?” Dunya made it a principle to be honest with her clients. Sometimes that was difficult. “Most days I don’t feel I fit in at all. But sometimes, when I stand under a dripping leaf and watch the white gibbons jump the gap at Gantan, I think I should never have been anywhere else.”\nFama scooped a bug out of the soup and sucked thoughtfully on its head. “Hope for me yet, then.”\n“Hope for us all.”\nA couple of clients later, Dunya was at the Moss, a set of rental rooms on stilts above the mosses that gave the name. This woman was after Phineus for something, and Phineus was nervous about it. His casualness had been unconvincing. If she was keeping Phineus under observation, Dunya had a chance to maybe spot her.\nPhineus wouldn’t listen to a thing Dunya had told him. He’d go to breakfast, meeting with a Green Burning or two, maybe in a corner, so as not to be obvious. If this woman, whoever she was, meant to keep him under observation, that would be an easy spot. If Phineus then went back to sulk in his unit, the woman might take the opportunity to come back to the Moss to take care of other business. If she did, she would most likely skirt the roots of the big ash tree.\nThat was a lot of assumptions. But Boscobel was incredibly resistant to travel if you didn’t know it well. Once visitors learned a useful route, they tended to stick to it. Dunya found a spot by a mossy root where she could watch, get work done, and have someone bring her a coffee every now and then.\nAfter an hour or so, she had updated everyone’s files. Just as she was considering giving it up, she saw an odd bit of movement. Someone had started down the stairs from the direction of Phineus, glanced across the open area below, then stepped back. Somehow, Dunya had been spotted.\nNow Dunya was even more interested. Who was this woman? And why was she so anxious to avoid an interview?\nShe’d been successful in predicting the Martian’s route home, at least. Where would the woman go now? She’d probably planned out some escape route and bolt-hole, for contingencies. Dunya was used to people trying to avoid her.\nWhat choices would have seemed smart to a Martian corridor dweller who hadn’t had the time to work out the intricacies of Boscobel? The main question was: up or down? Right here was a mazelike sprawl of roots. Concealment would seem easier, and it was just the kind of place that would give comfort to a Martian.\nBut she would have thought past that. She’d try to be unpredictable, at least to herself. And she’d want to use the ways in which Boscobel differed from her home. She’d want things to be interesting. She’d climb.\nThere were three good routes up from here. The closest one was exposed in most directions, easily seen. One of the other two, then.\nAs it happened, both those routes hit a bottleneck in the understory, in a volume that had suffered a fire a couple of decades before. Several branches had not regrown to useful size, so both those routes would kink back to near the ash trunk.\nDunya knew another way up. It was longer and involved climbing higher, into the crown. There was no on-bough route there, where a high wind swept the branches. To the inexperienced eye, it looked impassable. But Dunya knew a tunnel inside a bough, the result of a cleared-out fungal infection that sometimes served as swing housing for low-status new dwellers. She’d have to step over people’s shitpots, but they knew her there. After that a drop-down would put her across where the Martian would have to go. That should persuade her that Dunya was someone she had to pay attention to.\nNo matter what, after that she had to get home, find her daughter, and try to keep the rest of her life under repair. She grabbed a ladderway and rose up.\nThe sunglobe had moved past its brightest point and lunchtime had gone past when Dunya found herself in a wet space under massive leaves. Water burped up onto the ridged surfaces, and cascaded down to the hanging gardens below. Only a few misguided frogs clinging to strands of pale fungus gave hints of life elsewhere.\nThis was part of Boscobel’s secret support equipment. Fluid-filled tubes along the walls carried nourishment to the higher reaches of the impossible trees. Light fibers pumped photons into photosynthetic centers to support metabolisms that couldn’t possibly get all their energy from the mostly decorative sunglobe.\nThe woman now dodged through a small cafe that hung from the rough bark of the oak bough just below here. It was a good spot to check for pursuit.\nToo bad for her that Dunya was ahead of her, not behind.\nShe was a long-limbed woman with big hands and feet. With the strength in her shoulders she looked like she could have picked up the entire cafe and shaken everything out of it. But instead of revealing any force, she moved smoothly, sliding past people before they even knew she was there. She wore her dark brown hair loose, a style more suitable to a Martian corridor than leafy Boscobel. She’d clearly bought that treesilk jacket here, though, and it suited the length of her torso. Dunya pulled herself back into concealment.\nThe chase had taken her out of herself. Now all the worries of the day came back to her. As cold water dripped on the back of her neck, she worried about her afternoon schedule, about her next encounter with Bodil, about whether Bryn would send her a message today. The longer he was away, the more entertaining his messages got, a bad sign. A poorly healed pipe with a lumpy joint vibrated under her boot, and she saw that it had shaken a couple of the big leaves loose from their adhesive connections with each other. Pushing back with her elbow and feeling the leaves peel away from each other was like childishly poking at a loose tooth with your tongue, pleasant and disturbing at once. Looked at too closely, much of Boscobel was falling apart.\nShe slid out of concealment. Where was the woman? Had Dunya miscalculated?\nShe felt the breath behind her. There was no time to respond. Something hit the back of her head and knocked her forward. She rolled, and found herself looking up at a long boot that pushed on her throat, and beyond it, slowly coming into focus, the Martian.\nThe woman wasn’t beautiful, but she was certainly striking, with dark skin, high cheekbones, and big eyes the color of moss agate.\n“Who the hell are you?” Dunya said.\n“I could ask you the same thing,” the Martian said.\n“You could, but you have no right to. I’m a citizen of Boscobel trying to get through my day. You’re the one who snuck in here in pursuit of Phineus Gora.”\n“And who is Phineus Gora to you?”\n“My client. He’s a refugee. I’m responsible for grafting him onto Boscobel.”\n“Good luck with that.” The woman was amused. “So you look out for him.”\n“I look out for all my refugees. It’s my job. He’s worried about why you’re here.”\n“But he didn’t give you any details, hoping your sense of responsibility would put you in my way.” The amused look disappeared. “He had no right to risk you that way. His problems should stay his own.” She pulled her boot off Dunya’s throat.\nFor a second, Dunya didn’t know what to do.\n“Get up, get up.” The woman was impatient. “You’ve tempted me into . . . actually, I think you’ve tempted me into exactly what Phineus hoped. Exposing myself. Giving the OAKs a reason to throw me out of Boscobel. Maybe he’s smarter than he seems.”\nDunya sat up. What had Phineus gotten her to do?\n“He knows who you are,” Dunya said.\nThe woman laughed. “He thinks he does.”\n“But I still have no idea.”\n“It may not matter. But . . . my name is Miriam Kostal. I’m from Mars.”\n“Dunya Hautala.”\n“Let me be short. Phineus is the inside man for a filibustering expedition that left Mars orbit two months ago and will be here within a day. Does that mean anything to you?”\nAnarchic Mars had turned into a menace to everyone between the orbits of Jupiter and Earth. A weak central government, recovering from assassination and attempted revolution, was unable to stop ambitious groups from putting together military expeditions to seize individual asteroids and set themselves up as ruling juntas. As a girl, Dunya had fled just such a takeover, finally fetching up on Boscobel.\n“And so you take a room at the Moss and follow Phineus around?” Dunya said. “How much sense does that make? Do the OAKs know? Anyone else?”\n“No one knows. Even on Mars. Filibustering expeditions rarely succeed without cooperation from their targets, either tacit or explicit. On Mars, the expedition has some official support. Here . . . I have no idea who might be involved. Anyone could have an interest in rearranging things to end up closer to the top. Phineus is a technician, not anyone involved in political discussions. He’s got a specific mission, assisting the initial penetration by the attacking force. I can’t trust anyone here. But I don’t need to. All I need to do is figure out what he’s doing, and stop it. Then I can be on my way.”\nMiriam was almost persuasive. It was always tempting to skip the mess of political compromise and get straight to the decisive action. And Boscobel sure was a mess. Dunya didn’t even try to deny it. But decisive action always left its own mess, to be cleaned up by people like her, while people like Miriam strode off in search of some other dramatic problem to fix.\nDunya slid herself to sit with her back against the loose leaves.\n“The complexities of corruption are all we’ve got,” Dunya said. “I’m sure not everyone’s looking forward to being ruled by someone else. If you have information that will help our government fend off an attack, you should share it.”\n“No. I’ll be arrested. And now you. Any investigation will be ended by the new regime. End of story. End of us.”\nThat was plausible enough. But Miriam hadn’t even tried getting cooperation. Dunya found herself irritated at the woman, impressive though she was. Boscobel was her home. She didn’t like thinking of it as a clump of trees run by people instantly eager to betray it for a better deal.\nThe bottom of the leaves was loose. The top still stuck. She didn’t have time to work on it more. She had no real reason to trust Miriam. She had to make contact with someone. She leaned her head back, as if thinking it over, and pushed harder. She knew there was a branch about ten feet below, where she could find a quick route down. The leaves parted behind her and she fell through.\nFrom the last glimpse of her face, Miriam was taken completely by surprise. But she recovered almost instantly. She dove forward, whipped out a long arm, and just managed to snag Dunya’s ankle as she fell. Stopping Dunya’s fall almost jerked her out of the gap. She braced one foot against the ripping leaf and swung Dunya to the side, until she dangled over a much longer drop. The endless network of tree boughs circled around her.\nShe could tell Miriam was considering it. People would pretty much assume that Dunya had tried something too difficult for a non-native to do properly. “Poor Dunya never quite got the hang of it . . . ”\nWith a sudden effort, Miriam hauled her in. Dunya curled up and grabbed the edge of the leaf. Finally, she lay on the floor next to Miriam, sucking in air.\n“Nice move,” Miriam said. “You practice that?”\n“A sudden inspiration.”\n“Look,” Miriam said. “You want to go to the OAKs for help? I can’t stop you. It won’t help, and it might put this whole world at hazard. But it’s up to you.”\n“Would you really have killed me?” Dunya said.\n“An impolite question. We’ve been slashing each other’s faces on Mars for a decade or more now, trying to solve problems by eliminating the people we think are causing them. Hasn’t worked for us, but it’s habit now.”\n“Not for you, though.”\n“I wouldn’t rely on the quality of my habits, if I were you. Go. Go now. Before I get sensible.”\nDunya could feel the stare of those agate eyes like something physical. She thought about saying something else, but nothing, not even “good luck,” made sense. Without another word, she turned and went.\n“Eh?” Strop looked up from his soup. “Dunya. What are you doing here?”\n“I want to ask you some questions.”\n“Well, I . . . ” Strop grunted in annoyance as Dunya pulled a chair up and joined him at his table. “Suit yourself, then.”\nStrop’s pale hair lay plastered to a soft-looking skull. He was the local OAK agent, and as OAKs went, he was a decent sort. OAKs didn’t go very far, Dunya reminded herself.\n“What do you know about Phineus?” she said. “I mean, what drove him from Mars, why he’s here. Who he’s in contact with.”\nStrop swallowed a spoonful of the soup and closed his eyes. He was known for his devotion to food, and his presence at a restaurant actually served as a sign of approval. So maybe Fama wasn’t quite the victim she made herself sound.\n“Phineus is your client, isn’t he?”\n“Of course,” Dunya said.\n“So it’s your job to make sure he stays out of trouble. What we pay you for. Didn’t you do some kind of intake when you got him? Then you know he’s a protected exile. Unable to return to Mars, but protected by Martian law. A Martian trying to kill him would be in serious trouble on return home. Anyone after him would have an unusual devotion to justice. Please be more vigilant about your intakes. They give you at least a little preliminary information. Too bad we don’t get to do one when we have a child. That’s why children can surprise you. They never fill out the proper forms.”\nStrop had two well-liked and successful children, both older than Bodil. It was just exasperating.\nShe thought about giving him Miriam Kostal. That he’d have to pay attention to. But Miriam had gauged her right. She couldn’t do it.\nAnd she was reflecting that there were probably good reasons why Phineus had been dumped on her without much background information. Did Strop know those reasons? In any event, bringing that up would either sound like whining or be actively dangerous.\n“Look, Dunya.” Fama had whisked away the soup, careful to show no sign she’d seen Dunya earlier, and the sculpted pyramid that steamed in front of him smelled delicious. “I appreciate that you’ve gotten a yen to get better at your job. These impulses never last. If you don’t mind a bit of friendly advice, I’d say that you should look after your own family situation instead.”\n“My family situation?” Dunya said. “What the hell is that supposed to mean?”\nHe pursed his disconcertingly full lips, pleased that he’d pissed her off. “Children can be a handful. Sometimes they can even do things that pass beyond the childish, and get in real trouble. Are you heading home soon?”\n“I don’t think that’s your business.”\n“If you’re hoping to find your daughter there, give up on that notion. She’s found herself a hidey-hole. She seems to think it’s secret. Secrets can lead to trouble.”\nThis was too much. Not only was she not going to get any action out of Strop, he was going to punish her for trying by implying that she was a bad mother.\nAnd what was even more irritating was how right Miriam Kostal had been. There would be no help in the OAKs. Whether or not there was some high-level interest in a change of regime, field agents like Strop knew better than to wander into delicate political situations. It might interfere with their digestion. So Strop would fight as hard as he could to hear nothing about Phineus.\nShe pushed her chair back, ready to stand. But she couldn’t just leave. He had her, just as he intended.\n“Do you know where she is?” Dunya said.\n“In the crust. Near the Xanthus airball. Her boyfriend has run into trouble from his Green Burnings buddies, big surprise. Bodil might easily end up in the same trouble. If those kids broke into where I think they did, they’re all in serious trouble. Stop worrying about what plausible Martians might be up to and give your daughter some thought. This isn’t official advice, by the way. One parent to another.”\n“Thanks, Strop.” Dunya had to consciously loosen her jaw to speak. “I hope I can return the favor someday.”\n“Not likely, Dunya. Not likely.”\nHer daughter was definitely a Boscobel native, Dunya thought. An immigrant like her would have tried to hide in the trees. Bodil knew the many ways of getting found there, and had instead burrowed into Boscobel’s neglected shell, which she thought of as invisible.\nDunya looked up into the shaft above. Boscobel had a huge volume in its shell, but only the poorest lived in it. The air rumbled. Just beyond was the vast space of Xanthus, one of the pressure equalization spaces excavated after the newly expanded shell of Boscobel had cooled.\nThe only illumination came from infrequent light bumps. There was no way she was going to stumble around this ridiculous space searching for her daughter. She stood in the center of the shaft and said, “Come down, Bodil. Now.”\nBefore a minute was out, she wanted to say something more. She stopped herself. The silence grew as hollow as the space around her. The best way to get a client to say something was to say nothing. That conversational vacuum could suck out the most amazing things.\nThere was a rustle. A pair of shoes appeared in a hole about ten meters up. Bodil slid into view and then slowly climbed down to the level where her mother stood.\nBodil favored her father, Bryn. She was taller than Dunya, but with softer features, big eyes, and downturned mouth. She looked gentle. Maybe someday she would be.\n“It’s your fault.” Bodil spoke quietly, the way she showed she was really angry.\n“What? What’s my fault?”\n“Don’t pretend you don’t know!” The other way she showed she was really angry was by yelling. “You got that information about that Martian out of me, and now Unray’s been beaten. They knew it had to come from him. They hit him, momma. A lot. I never trusted them. I want to hurt them.”\n“You think that’s bad?” Dunya said. “Things are way worse than you think. Every one of us is in trouble. I don’t have time for this. You don’t have time for it. If we’re not careful, we might all end up as slaves, or refugees, or something worse.”\n“What are you talking about?”\n“I need your help, Bodil. I’m sorry about what happened to Unray. Probably not as sorry as you’d like me to be. But we’ve got Martians crawling around our home that might rip the whole thing apart and I don’t have time to worry about your stupid boyfriend and his lame-ass buddies.”\nFor the first time in a long time, Bodil clearly didn’t know what to say. She’d hoped her mother would feel guilty and help her. Instead, her mother was asking for help herself. That hadn’t happened in an equally long time.\nDunya realized she’d gotten up against her daughter, looking up at her, feeling like a knife pointed at her belly. She stepped back, looked around. “Isn’t this their territory? You shouldn’t be here.”\n“I don’t care what they call their territory. They don’t deserve anything. I thought . . . I can do something to them, make them feel it, the way they made me feel it.”\n“Well, Bodie,” a voice said from the gloom. “Good luck for you ’cause here’s your chance.”\nPhineus had trained the Green Burnings well. They appeared all around, blocking every route of escape, while moving as casually as if just out for a stroll.\n“Eger,” Bodil said. “Eger!”\n“Yeah?” A young man slouched from the shadows. He wore a long jacket decorated with silver loops and pins. Pieces of the stolen emergency kit, Dunya thought, the parts they thought weren’t good for anything.\n“My mother doesn’t have anything to do with any of this,” Bodil said.\nEger looked Dunya up and down, raised his eyebrows. “Doesn’t look that way to me. Like she said, this is Burnings’ territory. Doesn’t matter who’s messing with it. Or why.”\n“Why you—”\nEger blocked Bodil’s blow with a forearm and threw her back. Dunya took a step forward, and found herself looking at a blade that seemed to reflect more light than there was in that dark place.\nEger shook his head. “Nah, Mom. Not a good idea.”\nBodil was puffing next to her. Dunya thought she was crying, but when she glanced at her daughter, she realized that it was the breath of rage. Knife or not, greater fighting skill or not, she looked like she was going to throw herself at Eger.\nDid she know this girl?\n“You can define your territory with respect to some other gang,” Dunya said. “Not for ordinary citizens.”\n“Ordinary citizens?” Eger was in her face. “You telling me you don’t know what’s what? You come here, know all our business, what we do.” He looked even younger close up, with smooth skin and curly reddish hair.\n“We’ll get out,” Dunya said.\n“‘We’ won’t do anything. Bodil and us got to talk.”\n“No.”\n“No?”\n“Stop it, Eger,” Bodil said. “Don’t be an idiot. My mom doesn’t have anything to do with this. You’re the one who beat Unray. Right?”\nEger grinned. “I got some licks in, sure. But we had to share. Everyone wanted a piece. You know what it’s like when everyone wants a piece. We share, in the Burnings.”\nEven though he was genuinely dangerous, Dunya found his leer too deliberate, like he practiced it in front of the mirror.\n“Because Unray could have taken you alone,” Bodil said. “That’s why?”\nDunya knew that tone of lazy insolence well. It made her want to hit her daughter. She never had.\nEger had less restraint. Bodil dodged his first, overhand blow, but he moved fast and punched her in the side. She oofed and bent over and Dunya slid away from her position, looking for an opening, even as she knew they weren’t going to get out of this—\nThere was a wail from somewhere overhead, and a body came hurtling down out of the dangling roots. It hit so hard it bounced.\nDunya moved as if she had expected exactly that to happen. She hit Eger with her shoulder and, off-balance, he fell.\nShe turned to tell Bodil to run. Bodil was gone, already moving at full tilt, slashing at the face of the young Green Burning who tried to stop her. The boy dodged back, automatically covering his face. By the time he realized he still had his looks, it was too late, and she was past.\nBehind, another crash, as another scout fell from above, followed by shouts.\nHer daughter ran beautifully, also like her father. Dunya’s own legs were shorter, and she had to pump them hard to keep up. She kept expecting resistance, but the Burnings had been confident enough not to set pickets out this far.\nAnd if it hadn’t been for that sudden intervention, they wouldn’t have needed them. Who had flung that scout down? He seemed to have been flung with some force, by someone with muscles. Martian muscles.\nShe just managed to keep Bodil in view as she dodged, first into this corridor, then that, then up a ramp, first shallow, then steep, then stairs. Stairs covered with moss and ferns. They were out, in the shadows amid the roots. Around was the rustle of leaves, the green glow, air thick with pollen. Bees flickered in the light that made it through from high overhead.\nBodil turned and fell against her mother, almost knocking her over. She was laughing. Unbelievably, she was laughing, almost helpless.\n“Ah!” Bodil said. “Did you see the look on his face?”\n“I was too busy panicking.”\n“He always thinks he’s got it all under control. Jerk.” The savage look Bodil threw back down the black hole of the stairs was beautiful and terrifying. “I visited stupid Unray in the hospital. He talked all tough too, and blamed it all on me.”\n“Okay, it was my fault. Right now I need your mind working. Someone was above us in that shaft. She’s just a visitor, doesn’t know Boscobel. She’s going to be moving out of that area, fast. Where would she go, and can we intercept her?”\n“There’s really only one way. Come on.”\nThe route turned out to be fairly simple, involving just a climb up to a living bridge between a twisted olive tree and a baobab whose hollow interior held a playground filled with shrieking children.\nDunya grabbed her daughter’s shoulder and pointed. Below them, tall above the crowd, Miriam Kostal strolled. Dunya could sense that Bodil instantly picked her out.\nWithout hesitation, Bodil jumped off the stubby branch of a baobab. Dunya followed, hitting a mossy spot that would have been softer if it hadn’t been so worn. The gravity was highest here, near the roots, and Dunya really felt the impact as she landed.\nBodil slid ahead, and up again, on the aerial root of a mangrove. They were now ahead of Miriam, though Dunya had been in that position before, and it hadn’t helped her. Just below them was a noodle shop, Cairngorm’s, sending up puffs of aromatic steam and making her hungry. She looked down at the bubbling pots, the patrons with their heads bent over bowls. She’d never been there, but it seemed familiar to her—\n“Mind telling me why we’re after her?” Bodil plopped down in a tangled mass of vines and looked up at the hummingbirds that investigated a flower just above her.\n“Your buddies the Green Burnings are being used by someone else,” Dunya said. “A Martian. Phineus. Who happens to be one of my clients.”\n“You never talk about your clients.”\n“They appreciate my silence. You should too. But he’s kind of moved himself out of the confidential category by trying to get me killed. And you, now.”\n“Nah. I don’t know about this Phineus. Eger was on his own, just being his usual jerk of a self. Defending Burning territory. I was just hiding out there. Hoping no one would ever find me. But you did.”\nDunya had already resolved never to tell her daughter how she had found out. It was too humiliating.\nFortunately, Miriam rescued her again.\n“You think that was smart?” Miriam Kostal stood over them, casting more shadow than it seemed reasonable for her lean form. “Putting yourself at risk was bad enough. Putting my mission at risk might be fatal.”\nInstead of being intimidated by the other woman’s anger, Dunya found herself just as mad. “I don’t need to justify myself to you.”\n“Protecting your offspring.” Miriam eyed Bodil. “How do you feel about being defended, little girl?”\n“Don’t try to set us against each other.” Bodil’s insolence was more pleasant when applied to someone else. “That’s our own, on our own time. Nothing for you. And my name’s Bodil.”\nMiriam looked the girl over, then smiled, an expression as tight as a wrestler’s grip. “Pleased to meet you, Bodil. Have you had a chance to figure out what it is you are now involved in?”\n“No. Not that much.”\n“If I knew what your mother was up to, I might be able to fill in some of the gaps for you.”\nBodil and Miriam turned to look at her, and Dunya found herself nettled. That had been a nice bit of solidarity with her daughter, but it was over. Now that they were standing side by side, she fancied she saw similarities between her daughter and the rangy Martian. They both had sharp jaws, and an easy stance. Assuming that Dunya was perversely withholding information seemed to be another thing they had in common.\n“Bodil. That trim Eger was wearing, some of the others. What was it? Where did they get it?”\n“Those loops? They grabbed some kind of gear from some old locker.”\n“Emergency gear?”\n“I . . . I don’t know. They were all excited about it, though. First real operation. Tactics, penetration of secure areas. Martian training, they said.”\n“You have information about it?” Miriam said in Dunya’s ear.\n“A friend who runs a restaurant heard about it. Someone took off with a complete emergency kit. An old one, probably ignored and forgotten.”\n“Where did they run their operation?” Miriam asked Bodil.\n“Imperial Valley. There’s an access lock there, not used much now. This was in the storage area nearby. Secure, I guess. Not as secure as the OAKs thought, though.” She couldn’t suppress a hint of pride in what her boyfriend and his unpleasant friends had accomplished. “But . . . what’s going on?”\nDunya could feel Miriam waiting. This was up to her, how much to tell. “Phineus, the guy they’ve been getting their lessons from. He’s the inside man in a Martian filibustering expedition that means to take over Boscobel. He’s using them as some kind of screen.”\n“He’s using them to gain access to an airlock,” Miriam said. “A place they can make entry. And their vessel will be here soon.”\nBodil looked at Dunya. “Momma. What do we do?”\n“There’s really no need for you two to do anything,” Miriam said.\n“Really?” Dunya had thought about how to argue this. Practicality was the best way. “Does that give you the best chance of success?”\n“Are you going to help me by going back to the OAKs again?” Sarcasm didn’t suit Miriam.\n“The theft of safety equipment is a real crime, one the OAKs can enforce without any concern about who is hoping the Martians will give him a better office. If they hold Phineus for that, it will give you some breathing space. And Bodil . . . do you think you could face Unray again?”\n“Sure. I have to go there and tell him we’re through. I was too mad the last time.”\n“Well, that will give you a good reason to pump him on what the Green Burnings are up to. I’ll bet it isn’t at all what Phineus thinks they’re doing.”\n“I have the perfect outfit,” Bodil said. “I’ve been waiting for the opportunity to wear it. I’ll break his heart.”\n“That’s my girl.”\n“Do I get to say anything about the help I need?” Miriam was surprisingly patient.\n“I waited for that,” Dunya said. “I finally went without it.”\n“We’re making a lot of assumptions. Some are bound to be wrong. Be ready to switch direction as necessary. Keep your OAKs on the emergency kit, and leave any mention of Martians to me.”\n“You got it.”\n“I have to handle Phineus carefully,” Miriam said. “He’s got support back home, and harming him would have bad consequences. But preventing him from acting will achieve what I need. Then, maybe, Martians can start hashing out their problems with each other, rather than exporting them. It’s a dream, of course. But it’s one I share with my husband.”\n“You’re married?”\n“Don’t sound so shocked. Hektor doesn’t get to see much of me, unfortunately. While he’s trying to build a stable coalition at home, I’m usually out trying to keep each leak from turning into a blowout.”\n“I’m sure he misses you.”\n“I wish he was out here with me. He’d be better at working with people than I am.”\n“Oh, I don’t know,” Dunya said. “You seem to be doing fine.”\nDunya could see that, despite herself, the fierce Martian was pleased. Dunya wanted to meet the man who could keep someone like that in his bed.\n“The sooner we take care of Phineus and his ridiculous ambitions, the sooner I can get home,” Miriam said.\nDunya would have loved to order Bodil home, to prepare dinner and perhaps ready for a siege. That would just result in Bodil’s running off to do something on her own. She hoped she would not regret the choice that she had made.\n“See you, momma.” Bodil gave her a kiss, and was gone.\nBy this time, with the sunglobe getting red, Strop would have moved up and over and been holding court at a restaurant high up in an aromatic cedar. She’d have to find a way to get him on that missing emergency kit without getting herself arrested—\n“Twice in one day.” Phineus blocked the twisting ladder ahead of her. “How about that?”\nHe was the last person Dunya wanted to see. “I’m in kind of a hurry right now.”\n“Sure, sure.” He moved as if to go around her, then leaned in, his big forehead looming. “Did you get a chance to check out my fellow Martian?”\n“It’s on my list, Phineus.”\n“I’m in danger! It’s not at all like you not to take the concerns of your clients seriously.”\nUnfortunately, that was true. He knew her too well. “I think you just made her up.”\n“Maybe I did. But was my imagination good enough for you to notice if the Martian pursuing me was a man or a woman?”\nNo way she could remember how precisely he’d described who was after him. It didn’t matter. He knew that she would have checked his story out by now, and that Miriam would have done something about it. As far as he was concerned, no explanation for why Dunya was walking around healthy and alive was a good one.\n“I might have a chance to get out there before I go to bed.” If he wasn’t going to move, she would swing around him. She glanced up at a convenient branch, to find two long-jacketed kids hanging over her, one girl, one boy. How long had they been there?\nPhineus shook his head. “She doesn’t miss, Dunya. That’s why I’m afraid of her. I was hoping she’d make a mistake and get herself in trouble. Instead of killing you, she recruited you. And here I thought you were on my side.”\nBefore Dunya could move, the two kids grabbed her and swung her into the leaves.\nTo her surprise, there were fish here. A carp bumped its snout into her mask.\nWithin five minutes of grabbing her they had bound her, put her into a mask and air supply, tied her legs to an elastic band, and sucked her down under a water drop. It was half local water supply, half wildlife reserve—and now her prison. Phineus had not looked her in the eye as the Green Burnings had done their work, but just before the water had closed over her head, he had muttered, “The new administration will free you.”\nHe had made her complicit with his plot. Only his success would bring someone here to keep her from suffocating. If he failed she would be left here to become food for these fish.\nDunya breathed slowly and carefully. She had no idea how much air she had, and struggle would just shorten the time she had left. She’d curled herself down a couple of times. She could find no way to influence her bonds. She could only plan for what she would do if someone rescued her, or compose her soul for death.\nThe face mask, with its blinking indicators, smelled old. It had to be from the stolen emergency kit. So it was designed for vacuum, not underwater use, yet another thing to worry about. It did have an eyeball-controlled display that she ran through. No comm, and no “cut my bonds” command. It did have an inventory list of the kit of which it was a part, some things marked as “exhausted” or “damaged-unrepairable.” It included two spacesuits, of which this was presumably one, an exoshelter, fuel cells, enough procal bars to live on for a few months while awaiting rescue . . . and a full emergency airlock. Without her consciously willing it, the faceplate showed her an exploded view of the airlock and listed all of its many components. Good to go, it told her with satisfaction.\nPhineus had gotten the Green Burnings to steal the old emergency kit because he wanted the airlock. Dunya was sure of it. That the kit had been stored near the Imperial Valley airlock was just a distraction. Miriam was wasting her time there.\nBut he needed a place to link inside and outside. Asteroid environments didn’t survive by being easy to punch through. Dammit. It was one thing to resolve to be calm and meditative and accepting. It was another to keep on doing it. Where was Bryn? Why wasn’t he around, at least to comment mordantly on affairs? Her husband had been increasingly given to mordant commenting. Doing something about things was less his line.\nBut she was being unfair. He worked with cultural development in various asteroids, as far sunward as Phobos. He was respected, and busy. When he came home he was loving, attentive, and everything he needed to be.\nAnd then he was gone again. And she found herself just as happy. Could she imagine some other man who she would want around more? Sometimes she thought she could. But she, too, was too busy to spend too much time on that.\nBryn’s absence was equally hard on Bodil, of course. So she ran with losers like Unray, getting rudimentary political education with the Green Burnings. That seemed a reasonable explanation. Nothing to do with anything Dunya herself had done.\nDid this face mask have a setting that sucked away all illusions? Clever, some of these old gadgets. A rough way to die, though, facing the absolute truth about everything you’d been so careful to keep under control.\nShe thought about Bryn’s own dusty and peppery scent, which had eventually faded from his side of the bed, careful though she’d been not to move anything, and only breathe it when she absolutely had to. She’d smelled something else recently, associated with quite a different man. Peppery as well, but damper, and tanged with . . . cilantro. She remembered the noodle shop she’d parked herself above to get a drop on Miriam.\nPhineus had shoved leftover containers under his cushions. From that same place, Cairngorm’s.\nHe was working with his airlock somewhere down in Xanthus. The crust was thinner down there, sure, but it was still nothing you could just hack through.\nSomething splashed above her. A larger fish? Since the carp, she hadn’t seen much more than larvae. But now it was dark, and she couldn’t see anything. Someone yanked on her. She stretched up, then was pulled back by the cable holding her bound feet. She sensed swearing, hearing nothing. Arms reached far in, grabbed her, and pulled hard. She rose and rose . . . and finally pulled free. Then she was lying on a seeping bank of wildflowers. Her face mask was pulled off.\n“Momma!” Bodil said. “Are you still breathing?”\nUnray had given Bodil her mother’s location. He was out of the loop as far as Green Burning tactical operations were concerned. But someone had felt it right to tell him that his soon-to-be-ex-girlfriend’s mother had been captured and imprisoned in a water tank in the cedars.\nYou found virtue in the oddest places.\n“I guess they sometimes hide stuff in here,” Bodil said. “Contraband. Not usually people, though.”\n“What’s that?” Dunya looked at a bundle of steaming leaves that lay amid dew-covered yellow flowers.\n“Mom! You have no idea how hard it was for me growing up, to have a mom that didn’t know anything.”\n“God, of course I know what it is. Should I eat it, or nap on it?”\nIt was the wrong tone to take, even if she was newly resurrected and should be cut some slack. Bodil pushed her lower lip out and looked about to cry.\nDunya hugged her daughter. “We’re on a mission,” she whispered. “And we have a lot to do. Unwrap it.”\n“You’re cold.” Bodil pulled off her jacket and put it around her soaked, shivering mother. Then she dropped to her knees and unwrapped the leaves, letting steam rise into the dark air.\nThis lozenge cake was traditional Boscobeli food for a journey. The leaves were from a modified fig and added a spice to the outer layers of the dough, which cooked enzymatically when tugged in just the right way. Dunya had never cared for it, finding it too sour for a decent dessert, and, uncooked, too hard as a pillow, the use the ancient and fictional tradition had for it.\nOf course, a people defined itself by those things no sensible individuals would pick on their own. And Bodil was Boscobel born and bred. So Dunya sat on a branch in a world she had not chosen, happy to be alive, and shared the almost inedible cake with her daughter.\nBodil had figured it out instantly. Any airball had an expulsion pore, through which the waste rock had been expelled. And above that, a series of baffles. All safe, no danger from the ancient weakness.\nExcept that, at the base of Xanthus, the baffles had collapsed into useless piles of cracked rock, another sign of the deferred maintenance that put the entire world at risk.\nDunya climbed down the tumbled slabs alone. Bodil had gone to find Miriam. She wouldn’t succeed, of course. But Miriam would find her. Dunya only hoped that would happen before she got herself into serious trouble down here.\nOne other thing Bodil had learned from Unray: there was no one from the Green Burnings down here. They’d gotten irritated with their mysterious guru, and had dumped Phineus in preference to mixing it up with their competitors over in Five Boughs. After that, a party. Phineus was on his own down here.\nIt didn’t really matter. He could take her easily. She had to wait for Miriam, who knew what to do. Miriam would have told her that herself.\nShe couldn’t listen to Miriam, even though what Miriam had not actually said made perfect sense. Phineus was still her client, making bad choices. Even as she knew she had to stop him, she recognized him as her responsibility.\nThere he was, working with a small light. The airlock was in. She could see the rubble from the sealed pore all around it. Being so small, it had to be secret. It could fit, at most, two people at a time. It was next to impossible to get an army in position and deployed using that. But, as she had learned from both Phineus and Miriam, next to impossible was a Martian’s favorite spot to get a seat.\nShe thought she was moving quietly. Phineus heard her, and jerked around. The light caught her.\n“Aren’t you cold?” he said. “You’re all wet.”\n“Oh, how thoughtful, Phineus,” she said.\nHe muttered something.\n“What?” she said.\n“I said I’m sorry. It had to be done.”\n“Please stop, Phineus. Just stop. Do you really think you’re still going to get a force of Martians in here?”\nHe shook his head. “You think what you see is what there is. I have support, here in Boscobel. It’s really my place, not yours.”\nShe tried not to think about how much he was right. “Contingent support. If-you-win support. If there’s any problem, it will vanish. I walked right in here. The gang you trained up is gone, you’re here alone. That should tell you something.”\nHe’d never done his own dirty work. First he’d sent Dunya into Miriam’s path in the hopes that Miriam would take her out, then he’d used his gang. Now he was pretending to be too busy to bother with her. No wonder he’d left Mars. He just wasn’t up to it.\n“There’s no way to advance on Mars,” he said. “Everything’s owned or closed off. The only way to get somewhere is to come out here. There’s a lot of unrealized value in the asteroids.”\nIf he was arguing, there was a chance. But it was too late for him. At the last instant it seemed he knew that, because he stopped and stared at her. Before he could say anything else, Miriam dropped from somewhere overhead and kicked him in the head.\nNot straight on, though. Phineus reacted fast. He tilted his head so that the force of her kick grazed past, then tried to help her on her way with a slap at her heel.\nMiriam was fast too. She spun and landed in a crouch.\nDunya wished she could help. But she knew all she could do was get in the way or become a hostage.\nThe struggle was brief and vicious. Then Phineus whipped a rock at Miriam, and when she dodged he rolled and launched himself into a black gap among the dry roots.\nWithout hesitating, Miriam went after him. Both vanished among the rocks.\nDunya stepped down to the airlock. The least she could do was deactivate it while Miriam did her work.\n“I need to return that in good working order,” Strop said. He stood among the rocks, looking miserable and sweaty. Stumbling around in the high-gravity area in the dark wasn’t usually his way of getting things done.\n“Did it get too public?” Dunya said. “Too hard to deny?”\nShe hadn’t expected him to answer, and he didn’t. He lumbered forward and slapped a Maintenance Required sticker across the airlock.\n“What’s going to happen?” Dunya said.\n“I can at least tell you something that won’t happen. No Martian vessel will approach Boscobel. If one does, it will get a warning shot, and know to go elsewhere.”\n“Thus ensuring no one ever has to testify to who knew what.”\nHe shrugged. “A lot of people would prefer that. You might even be one of them. If Phineus is still alive, he won’t get a trial either. He’ll be expelled. He can go to Mars, where they’ll kill him. Or he can go somewhere else. Not our problem. I do need to say that your inability to control him will be a black mark on your record. Not a lot I can do, but I’ll put in a good word for you.” He smiled at her.\nShe’d take a shower when she got home. That might do something about the greasy film he left on her, even as he was helping her out.\n“As staff is rotated off the entry and departure airlocks to be revetted and cleared, coverage will be affected. Pretty much anyone who wants to get out of Boscobel without interference will be able to do so.”\nShe glanced up. Bodil stood on a rock high above. She smiled and gave her mother the thumbs-up.\n“Go ahead,” Strop said. “Get your girl home. I’ll pick up our unfortunate Martian invader.”\nShe’d have to use Bodil to communicate with Miriam and get her off Boscobel. Too dangerous for Dunya to do it directly. That was too bad. That woman was someone to know.\nSomeday, she guessed, Bodil would want an off-Boscobel school. Deliberately exposing her daughter to Miriam’s influence would be dangerous, of course. But she had heard that there really was nothing like a Martian education.\nShe climbed up the shattered slabs of rock, back toward the trees she had come to rely on.\nOriginally published in The Other Half of the Sky, edited by Athena Andreadis and Kay Holt.\nWith only a handful of stories, mostly for Asimov's, and a few well-received novels, Alexander Jablokov established himself as one of the most highly-regarded new writers of the '90s. His first novel, Carve The Sky, was released in 1991, and was followed by other successful novels such as A Deeper Sea, Nimbus, River of Dust, and Deepdrive, as well as a collection of his short-fiction, The Breath of Suspension. His most recent novel is Brain Thief."}