{"fingerprint": "0WRLqziuaePuSUNPK/UElIOeokU=", "sitename": "Clarkesworld Magazine", "title": "At the Cross-Time Jaunter's Ball by Alexander Jablokov", "author": "Alexander Jablokov", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jablokov_03_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: At the Cross-Time Jaunter's Ball by Alexander Jablokov", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11440 words, novelette, REPRINT\n At the Cross-Time Jaunter's Ball\n I had gotten lost again, as I so often did, because it was dark there, in those musty and unswept hallways that run between the universes. I’ve always been impressed by the amount of crap that seems to float in through the doorways and settle there, in some sort of plea for reality. An infinite network of passages linking the worlds of Shadow with that of the real might seem like a good idea, but who was going to keep it clean? The Lords were too haughty to concern themselves with things like that, and we humans were too . . . finite.\n I looked in through doorways as I walked, to see such things as a city of hanging tree dwellings or an endless stairway that curved up from mist into blinding sunlight. These were delicate worlds, miniatures. As a professional critic of such Shadows I had to say that these worlds were not the style I usually liked, though one, where a regatta of multicolored dirigibles sailed above a city whose towers stood half in the sea, was excellent.\n A rough wind blew past, carrying with it the clamor of a cheering army, and the pounding of swords on shields. The passage tilted upward, and I climbed a set of rough stairs, smelling first lilacs, then, when I took a deeper breath, an open sewer. I choked, and was surrounded by buzzing flies, who had wandered irrevocably from their world and, looking for shit, had found only the meager substitute of a critic. I ran up the stairs, waving the flies away, past the sound of temple bells, the dense choking of dust from a quarry, and a spray of briny water, accompanied by the shrieking of seagulls.\n Gathered in a knot in the hallway ahead of me were a group of Lords, with their servant, a huge man wearing a leather helmet. Lord Prokhor, Lord Sere, and Lord Ammene, three balding men with prison pallor and rings below their dark eyes, waited for me to give them advice on acquisition. They sat on little folding stools, and looked uncomfortable.\n “You are late, Mr. Landstatter,” Lord Ammene said, in a reedy voice.\n “Your servant, sir,” I said, ignoring the challenge. I eyed the three of them suspiciously. Lords were entirely unpredictable, and their motivations obscure. On my last trip I’d almost been trapped when Cuzco, capital of the Incan Empire, fell to invading Apache Sacred Warriors who had hired Maori warships for transport from their temple cities along the Pacific coast of Mexico. I’d spent three desperate days freezing in the Andes, my nights lit by the light from the burning city reflected in the ice fields, before I could return home. I had wondered if it was an accident, because someone had locked me in my room just when the attack began. The three of them returned my bow without standing.\n The servant raised the lamp he held in his hand and examined me. I wore a three-cornered, plumed hat, a heavy, powder blue tailcoat covered with useless gold buttons, a stiff, embroidered vest with hunting scenes on it, extremely tight cream-colored silk trousers, and black leather boots trimmed with sable. Beneath the hat, my hair was pomaded, powdered, and pulled back into a ponytail by an ornate silver clasp. The servant sneered at me.\n The Lords were dressed in their usual sober dark clothes, gold chains around their necks indicating rank. Unlike most people, they did not adopt clothing from Shadow, implying, I guess, that what they always wore was “real.” Style is never real, but I am a critic of worlds, not dress, so I said nothing.\n Then the servant turned the lamp around. I straightened my hat. We stood in front of a stretch of blank wall. Humming gently to himself, he adjusted the lamp until it focused on the wall. The wall shimmered, and a door opened onto a brightly lit street. I could hear the ringing of steel wagon wheels on cobblestones and the puffing of a steam launch on the river that flowed just out of sight of the doorway. “There you are, Mr. Landstatter. See you in forty-eight hours.” I stopped just in front of the shimmering, the way I always do, no matter who is watching. Vanishing into unreality makes me nervous. He pushed me through, not roughly, but the way you would direct a timid actor onto a stage in front of an audience. I turned to protest, but he and his masters were gone, and I found myself addressing my retort to a broken and stained brick wall.\n The water swirled against the brick side of the canal, as if irritated at having its freedom curtailed, but finally acquiesced and flowed under the arch of the bridge. On the river beyond, a vendor guiding his empty flatboat home from the market negotiated the uneven current with tired familiarity. Past the inflow of the canal he put his shoulders into his poling, undoubtedly thinking of a bowl of stew, a mug of beer, and a pipe of tobacco.\n I was starting to think of things like that too. I watched the boatman vanish into the iridescent meeting of sunset and oily water, then turned and began to walk in the direction of the dam, which was where the north and south branches of the Schekaagau River joined and flowed into Lake Vlekke. It was also where the best hotels were. I strayed into the path of a pedicab, and was startled by a jangle of bells that sounded like an angry gamelan. The white-suited driver bared polished, scrimshawed teeth, cursed at me in Malay, and was gone, leaving only a cloud of ginger and curry to mark his passing.\n The tall, step-gabled warehouses that had been flanking me on the left vanished, to be replaced by the unadorned brick facades of merchants’ houses, which gave only hints of wealth through panes of leaded glass: the glitter of a chandelier, the flash of a tapestry, the gleam of a silver serving bowl. From a half-open window came the sound of a drinking song, bellowed by male voices to the accompaniment of pounding pewter mugs. Merchants, home from the Bourse and ready to do their best to keep the price of malted barley high.\n A marble bridge carried me high over the river to the dam, a platform of pilings sunk into the soft earth. Ahead of me rose the towers of city hall. A small boy sat on the quay, trailing a fishing line in the water. The result of his day’s labors amounted to two carp, strung through the gills, and a frog, which was jumping up and down in a jar.\n “Say, lad,” I said, in the Lithuanian influenced patois of the Mississippi River trade. I thought it was a nice touch. “What is the best hotel in town?” I’ve had fellow critics tell me that, when they work in Shadow, they stay in the sleaziest fleabags they can find, because that makes the experience more “real.” I don’t find lice more real, in any ultimate sense, than satin sheets.\n “The best?” The boy jumped up eagerly. “The Emperor Kristiaan, on the Streetergracht! They have marble tubs and gold faucets. And Duc Noh the King of Nam Viet got shot in the lobby! They put a chair over it to hide it, but you can still see the bloodstains if you look.”\n “Sounds ideal. And do you know how to get there?”\n “Do I! I once got thrown out for climbing the flagpole. You can see the whole city from the top! It’s the tallest flagpole in Schekaagau.” He hung the fish on a string around his waist and picked up the jar containing the frog, which began to jump more frantically. “Follow me.” We crossed the tiled dam square, passing the triumphal arch, an explosion of soldiery, waving banners, crosses, and captive Indians pleading for mercy. Somewhere beyond city hall, bells were ringing Angelus. We walked down a narrow street, where merchants were locking up their stalls for the night. The blue lamps that taverns and places of public relief were required to show already glowed at spots along the street, lighthouses for the weary. A few minutes later, we emerged into a square which opened out onto the dark water of the canal called the Streetergracht. The other three sides of the square formed the ornate classical pile of the hotel. On top, hanging over us like a burnished artificial moon in the laboratory of a medieval alchemist, a gilded dome caught the last rays of sunlight. Three flagpoles stood in front, the flags those of the hotel, the city of Schekaagau, and the Stadholderate, in the process of being lowered by a squad of hotel employees in scarlet tunics and knee pants. The boy proudly pointed out the taller, center pole as the cause of his expulsion. I was properly impressed.\n I reached into my money purse, pulled out a crescent of silver, and flipped it to him. He stared at it in wonder, then stuffed it away in one of the secret pockets boys have. “I better go. Mum will be worried. I’m late for dinner.”\n I winked at him, which he liked. “Don’t let me catch you climbing the towers of city hall.”\n “You won’t,” he said, ambiguously, and was gone into the gathering darkness, his captive frog still tucked under one arm. I had never learned his name.\n It was after I had been lost for quite some time that I noticed I was being followed. For a moment, in my drunken state, that was funny. The poor fool thought he was going to end up in a nice hotel lobby with plush chairs and a bar where he could get a late night glass of arrack, but instead he was doomed to wander with me through back alleys and dark, warehouse-lined streets for the rest of the night, his path constantly disrupted by dark flowing canals. That was not why he was following me, of course, and I quickly ceased to find his company amusing. I glanced over my shoulder as I turned a corner. He was dressed in some sort of robes, not normal clothes at all, and didn’t seem to know the streets any better than I did. I emerged on the quay by the river, its edge marked by a line of heavy granite posts holding a chain. The river flowed quickly here, constrained by the quays, and I could hear its churning and grumbling.\n Out in the darkness a procession of torchlit barges, loaded to the gunwales with masquers, drifted on the reflected waters of the river. They laughed and screamed, and seemed to be having a terrific time, just as they had when I was with them, though I had not enjoyed them at all. I had drunk too much, and almost gotten sick. I had taken a walk to clear my head and work out my thoughts on my critical analysis. I doubted anyone had noticed my absence.\n Despite the threat at my back, my main emotion was still annoyance. The judgment of a good critic never relaxes. Peter Lucas had made a specialty of this sort of genre piece, and I was getting tired of it. It irritated me to think that I had another day to spend here before the Key the Lords had implanted in the limbic system of my brain would take me home to the real world. To think of all of Lucas’ labor in twisting human history, to create yet another set of drunken shipping magnates and aldermen in fancy masquerade pounding mugs on wooden trestle tables and pissing heartily over the sides of their barges. It made me sick. Lucas demonstrated that there were an infinite number of redundant possibilities, like a gallery hallway lined only with paintings of courting couples, or children playing with a little, furry dog.\n I didn’t know what Lucas had done to history in order to create this Shadow, what kings and queens he had given fevers, what storms he had raised, what matings he had arranged, what battles he had altered, in order for William Vlekke of Antwerp to discover this place so that Schekaagau stood on the shores of Lake Vlekke, rather than Chicago on Lake Michigan, and didn’t get much more of a chance to think about it, because my pursuer decided that that was a good moment to jump me.\n His attack was theatrical, with a scream and leap. His body was slim and strong underneath the heavy wool robes, but he was more enthusiastic than skilled, and I threw him off. He hit the ground heavily, then rolled and came up with a glittering, curved knife in his hand. I backed away. He didn’t seem to be trying to rob me. He had other things in mind. My ridiculous clothes suddenly seemed as constricting as a straitjacket. He came forward with his blade dancing before him. It was a beautiful piece of work, I noticed, with an elegantly patterned silver hilt. It would look wonderful sticking out of my chest in the morning light.\n Critics of Shadow are used to such things, however, and I was not as defenseless as I looked. As he came at me, I pulled a packet of powder out of a pocket and threw it at him, squeezing my eyes shut at the same time. Even through my closed lids, the flash of the powder left an afterimage. He shrieked and stumbled back, completely blinded. I slipped brass knuckles over my fingers, moved in, and punched him at the angle of his jaw. This was unfair, but I wasn’t feeling sporting that night. His head snapped back and he yelped. He slashed back and forth with his blade, still not able to see anything, but dangerous nevertheless. I dodged in and hit him again, and he stumbled back and fell. His head crunched sickeningly against one of the granite posts, and he rolled over the side of the quay into the water. For a long moment I stood swaying drunkenly, trying to figure out where he had gone. Then I ran up and looked over the edge. Water roared heavily below in the darkness, but there was nothing else to be seen. I slipped the brass knuckles off my hand, and started to try to find my way home again. It was a long while before I found the square in front of the hotel, and I was still shaking when I did.\n A marble bathtub is a beautiful thing, but it takes forever for hot water to heat it up. I finally slid into the bath and was able to relax my muscles. The attack had left me with a number of bruises, but no answers. Answers were sometimes scarce in the many worlds of Shadow, which the Lords had caused to be created for their mysterious pleasures. But the municipal river patrol would be pulling a body out of the weir at the dam in the morning, and I had no idea why he had tried to kill me, and I like to have reasons for things like that. Cuzco, Schekaagau . . . Had the Lords tired of my aesthetic sniping? Was I simply paranoid? That was an occupational hazard. I knew I would get no answers that night, so I got out of the bath, toweled myself dry, and went to bed.\n I turned the key on the gaslight, dimming it to a blue glow. The boy had been real, though. Give Lucas that much. Everyone else seemed like a moving waxwork, but that boy was as real as anyone. I was not sure the Lords enjoyed “reality” in that sense, since they themselves did not seem particularly real to me.\n Reveling in the feel of satin against skin, I turned over in bed, to find myself staring at the patterned silver hilt of a knife, still vibrating from its impact, which had somehow come to be imbedded in the bedpost next to my head. The motif was one of eyes and lighting bolts. The last knife I had seen like that was now at the bottom of the Schekaagau River. I wrenched the knife from the bedpost and ran to the window, but my second attacker had already slid down the drainpipe and vanished, leaving me with a souvenir of my night at the Emperor Kristiaan.\n “Mutated E. coli,” Salvator Martine said. He had pulled me away from the other guests at his party to give me this information.\n I swirled the Tokay in my glass and watched it sheet down the sides. “E. coli?” Only Martine would serve a wine as sweet as Tokay before dinner.\n Martine grinned, bright teeth in a face of tanned leather. He was annoyingly handsome, and smelled sharply of myrrh and patchouli. The Lords loved him, for no good reason that I could see. Several had even come to attend his party. “Normal intestinal flora. Mutated and hybridized with amyotrophic lateral sclerosis. Infects via the GI tract and destroys the central nervous systems of higher primates. Neat. Grew it in the guts of an Australopithecine on the African veldt, two, three million years ago. Not easy, Jacob, not easy. When I woke up on that pallet at Centrum, I had bedsores, and a headache that lasted a month. Killed them all. Every last one of the buggers. Nothing left on this planet with more brains than an orangutan.” He downed his glass of Tokay as if it were water. I took another slow sip of my own.\n We stood on the parapet of what he called his “palace.” Behind us I could hear the sound of the party, voices and clinking glasses, background music, occasionally a laugh. The sun set behind rolling green hills. From a distant ridge came the cry of a deer. A trail of mist descended on the valley, glowing in the evening light. Except for the ones behind us in the party, there were no other humans on the planet.\n “Infectious lateral sclerosis . . . ” I murmured to myself. This was art?\n Martine laughed. “Not to worry. With no hosts, it died out, and there are no other vectors. I was careful about that.”\n He’d misunderstood my moodiness, of course, but it took a particularly impervious cast of mind to be a molder of worlds. Martine had succeeded in wiping out all of humanity, collateral branches to boot. By some standards, that made him a god. A god with bedsores. That left me with a blank canvas to look at, but nothing to review, which was perhaps his intention. If a tree falls in a forest and no one hears it, that’s one thing, but when the acorn is worm devoured and the tree never exists, what sound does it make then?\n “You are looking at Berenson’s new world next?”\n “Yes. She’s been very mysterious about it, but I suspect—”\n A voice interrupted us.\n “There you are. The most notable men at the party, and the two of you stand out here watching the sunset. Where’s your sense of social responsibility?” We both turned. Amanda, my wife, closed the door behind her, passing through in the roar of voices. She wore a dress that fell in waves of green and blue silk, and she emerged from it like Aphrodite from the foam, her blond hair braided and coiled around her head. A moonstone glowed in its silver setting as it rested on her forehead.\n “We were waiting for you,” Martine said with that charming insincerity that Amanda seemed to like.\n She came up and took a sip of my drink. She smiled at Martine. “I’ll have you know, Salvator, that Jacob detests sweet drinks before dinner.” She took another, and kept the glass. “I’ve been wandering around your palace. It’s wonderful! How did you ever create anything like it?”\n I felt a surge of annoyance. The palace was a monstrosity. It had towers, with pennants snapping in the breeze. It had triumphal staircases. It had flying buttresses. It had colonnades. What it didn’t have was structure. It looked like an immense warehouse of architectural spare parts.\n “It was built by some people from a world I did a few years back. Remember it, Jacob? The Berbers of the Empire of the Maghreb ruled Northern Africa. They flooded the desert and built great palaces. I had planned that.” He turned to Amanda. “As I recall, Jacob didn’t like it much.”\n He recalled correctly. I couldn’t remember much about that particular work, just hot sun and blinding water, but I did remember that I hadn’t liked it. The Lords had bid it up, though, and it was now in someone’s collection, making Martine wealthy. Critics should never socialize with artists; it’s difficult enough to like their work in the first place.\n Amanda came up and pushed herself against me. Her perfume smelled of violets, and I lost track of what I was thinking. I put my arm around her, and she pulled away, as she always did once she had my attention, and walked to the other side of the parapet to enjoy the sunset.\n Amanda had once been close to me, but was now distant, and I couldn’t remember when that had changed. It could have happened overnight, since Amanda often went to bed loving and woke up cold. Something she saw in her dreams, I’d always thought. But now it was that way most of the time, and I felt I’d let something slip by, as if we’d had an immense knock-down drag-out fight that I had not been able to attend. On the infrequent occasions when we made love it was like two people sawing a tree trunk, the length of the saw between us and only the rhythm of the task keeping us together. This still left me wanting to do it much more often than she did.\n Voices shouted for Martine inside, so the three of us went in through the French doors. The banqueting hall was an immense room, thirty feet high, and banners from the Shadows Martine had created hung down from the beams supporting the ceiling. Someone pressed a glass of wine into my hand, not Tokay, mercifully, but some dry red. The party poured after Martine as he strode through the hall, out the double doors at the other end, and down the immense stairway. At the bottom rested a cube wrapped in black velvet, about six feet high. It had been delivered through the hallways by servants available to the Lords. Despite myself, I was impressed. They did not usually permit ordinary men to move objects from Shadow to Shadow.\n “Let’s carry her up,” Martine said, and the party surged forward with cheers. It took a half dozen people to lift it. “Take my place, Jacob,” Martine said, and I found myself with a shoulder under one corner of the cube. We angled it back and, cursing and laughing, hauled it up the stairs. It was heavy and tried to slide back. I started to sweat.\n A space was cleared on the floor among the armchairs and the tables covered with half-finished drinks. The cube was put down. I looked for Amanda in the crowd but couldn’t find her anywhere. I remembered what she was wearing, and her moonstone, but wasn’t sure that I knew what she looked like anymore. It seemed that as she had grown more distant her face had stopped being familiar.\n “This is from a world I did recently. It’s not worth visiting, believe me, but it did produce one thing that’s worthwhile. I asked the Lords for permission to bring it back for my collection.” He pulled on a cord and the black velvet fell to the floor. The crowd grew silent and drew back, but no one took his eyes away.\n The most beautiful woman in the world was in hell, but she had been turned to stone and no one could do anything about it. She stared at us from behind five inches of leaded glass with pleading in her eyes. She was a Madonna, and a newborn child lay in her lap. His eyes stared blankly upward, for He had been born hideously blind.\n I had more information than Martine thought I did, from my sources at Centrum. I knew that Martine had caused eight entire worlds to be destroyed by nuclear war before he got the effect he wanted. On the last try, a group of artists, vomiting, losing their hair, seeing the constant glimmer of optic nerves degenerating in the radiation flux, had found a boulder in a blast crater and set it on a hilltop. The rock was dense with exotic isotopes, and had killed the sculptors as they chiseled it. They had worked as one, and it was impossible to tell where one artist had left off and the next began. They had created a masterpiece, probably not even knowing why, but Martine claimed this work as his own. Radioactive fantasies had been fashionable among the Lords lately.\n I turned and walked away, rubbing my shoulder. The party was getting loud again, despite the pleading eyes of the Virgin Mary, and I felt a little sick. I walked down a long hallway lined with loot from Martine’s various creations. I stopped in front of one painting, of Christ being carried drunk from the Marriage of Cana by the Apostles. It looked like a rather mucky Titian, all droopy flesh and blue mist, but Amanda had pointed it out specifically to me earlier in the day. She never really seemed to care much about art herself, but she somehow always knew precisely what I would like. Or would not.\n “Mr. Landstatter. Good evening.” Sitting in the shadows on straight-backed chairs, like Egyptian deities, were two Lords, Jurum and Altina, who seemed to be married, although it was hard for me to tell. At any rate, they were always together.\n “Good evening.” I bowed, but did not speak further.\n “We’ve just been looking at Martine’s little collection,” Altina said, her voice a gentle hiss. “Symbols and parts, it seems to us. Reflections of worlds in objects, and so an imitation of our strings of Shadow. What say you?” They awaited my judgment.\n Lords are strange beings. They collect worlds the way children collect brightly colored stones and seashells, but require others both to create those worlds and to determine whether they are worth having. They had gained control of the infinite universe of Shadows before anyone could remember, raised Centrum, and seemed intent on continuing in this position forever. Had one of them decided to kill me? The fact that two attempts had already failed suggested that a critic of murder would have had to give their efforts a bad review.\n “The objects have significance in themselves, and not just as signs to Shadow,” I said. The Lords often had trouble understanding ordinary art. “This statue of Apollo, for instance . . . ” They stood and listened, Altina resting slightly on Jurum’s arm, as I took them through Martine’s collection, which ranged from the brilliant to the mediocre, and seemed to have been forgotten here, like junk in an attic. They thanked me, finally, and walked off to bed, discussing what I had said. I realized that the party above had grown silent, and that it was time for bed.\n When I returned to the banqueting hall, it was empty, save for the tormented Virgin. I stopped to look at her, but her expression had become reproachful, as if I were somehow responsible for her fate. I turned away and went to our room.\n The bed was still made, and Amanda was nowhere to be seen. I took my clothes off, threw them on the floor, and climbed in under the covers. Our room was in one of those dramatic towers, and there was nothing but darkness outside the windows. I fell asleep.\n Amanda woke me up as she slipped into bed, some time later. I started to say something, to ask where she had been.\n “Shh,” she said. “I didn’t mean to wake you up.” She hunched up on the other side of the bed, the way she did so often, even though the bed was not particularly large and this meant that she dangled precariously over the edge. I moved closer to her and nuzzled her neck. “Please, Jacob. It’s late and I want to sleep. See you in the morning.” She yawned and was quickly asleep, or at least pretended to be.\n I lay back on the other side of the bed, my heart pounding. I knew that no matter what I did, I would be unable to sleep. When I had left her, she had smelled of violets. Her neck now had the bitter aroma of myrrh and patchouli.\n The Capuchin did his calculations with a light pen on what looked like a pane of glass, causing equations to appear in glowing green. Interpolated quotations from the Old Testament emerged in yellow, while those from the New Testament were light blue. Unavoidable references to Muslim physicists flashed a gory, infidel red. I gazed out from under my cowl, impressed but unenlightened. I don’t know anything about nuclear physics, and even when I thought I had managed to pick up the thread of an argument, I was immediately thrown off by a gloss on Thomas Aquinas or Origen. I contented myself with smelling the incense and watching the glitter of the LEDs on the rosaries of the other monks as they checked the Capuchin’s calculations.\n He turned from the glass and faced his audience. He raised his arms in supplication to heaven, then clapped his hands together. The equations disappeared, to be replaced by a mosaic of Christos Pancrator, His brow clouded by stormy judgment, lightning ready to be unleashed from His imperial hands.\n “Brothers!” the monk said. “All is in readiness. For the first time in history, the fires of Hell shall be unleashed on Earth, chained at the command of the sacred Mathematics that God, in His Wisdom, has given us to smite the infidel. We will now examine this flame, and if it is not found wanting, its hunger will soon consume the arrogant cities of all those who would oppose the Will of God!” We rose to our feet and followed him up the stairs to the surface.\n It was dry and bright outside, and the sky was a featureless blue. We segregated ourselves by Order, the gray of Dominicans to the right, the brown of Franciscans to the left, and the martial, oriental splendor of the Templars and Hospitallers in the center. There were last-minute checks of the dosimeters, and several of the more cautious had already flipped their goggles down and were sucking on their respirators.\n In front of us, across the cracked, dried mud, amid the rubble of what had once been the city of Venice, stood the Campanile of St. Mark’s, looking the same as it did in a Canaletto painting, except for the fact that the gray ovoid of the atomic bomb rested on a frame on top of the steeply pitched roof. Nearby, the crumbled dome of the cathedral lay on the ground like an overturned bowl. At a distance stood the crazily leaning Rialto bridge. All around, the flats of the dry lagoon stretched away. A trumpet call rang through the air. We repaired to our trenches, all now monastic grasshoppers with our goggles and breathing tubes. We knelt, facing the tower, and the bomb.\n When the blast came, it looked, in my goggles, like a bright, glowing dot that faded quickly to red, and then darkness. The blast shoved at the shielded robe, and I felt the heat on my face. The sound of the blast thundered in my earplugs. A moment went by. I pulled up my goggles.\n The ruins of Venice had been replaced by a smoking crater. The mushroom cloud towered overhead like a cowled monk of a different Order.\n In sudden, unplanned fervor, the monks began to pull themselves out of the safety of the trench and march towards the crater. I, of course, was with them, though I felt like a fool.\n A resonant bass voice started the tune, and the rest of us joined in:\n Dies irae, dies illaSolvet saecllum in favillaTeste David cum Sybilla . . .\n The Latin held a wealth of allusion lost in the English:\n Day of wrath! Day of mourning!See fulfilled the prophets’ warningHeaven and Earth in ashes burning!\n We knelt by that smoking scar and prayed until night fell.\n My limbic Key brought me back to the hallways of Centrum vomiting and almost unconscious. Someone found me and hauled me out, a long way, since it was a distant Shadow. I had no idea who it had been, though somehow I doubted that it had been a Lord.\n The Medical Ward was high up and had large windows that let the sunlight in, unusual in the rest of the Centrum. It was a bright day outside, and I could see the endlessly repetitive walls and blocks of black rock that made up the home of the Lords of Time, stretching out to the horizon. There were no gardens in the pattern, no sculptures, and few windows. Centrum stretched over a large part of the continent some still called North America. I thought the Medical Ward abutted on the Rockies, but I was not sure, though I had already been here twice. My head pulsed and I felt disoriented.\n The ward was filled with the real effects of Shadow. A theoretical anthropologist, his arms and legs replaced by assemblages of ebony, cedar, and ivory by a race of mechanically inclined torturers, lay spread-eagled on his bed, asleep. Each twitch in his shoulder or hip sent dozens of precisely balanced joints flipping, so that he danced there like a windup toy. In the corner lay a fat man who had been participating in a stag hunt through the forests of Calvados, in some world that still had a Duke of Normandy, when a cornered aurochs had knocked over his horse and given him a compound fracture of the femur. He’d lain in some canopied bed, surrounded by porcelain and Shiraz carpets, dying of tetanus, while the colorful but medically ignorant inhabitants of that Shadow crossed themselves and prepared a grave in the local churchyard. When the timing signal in his Key finally came, he’d pulled himself out of bed and through the Gate to the hallway, just as I had. The man in the bed next to mine, who gasped hoarsely every few minutes, had gotten drunk, wandered into the wrong part of town, and been beaten by some gang. This was familiar to me too. It could have been any town, the Emperor of Zimbabwe’s summer capital on Lake Nyanza, or Manhattan, minor trading city in the Barony of New York, or Schekaagau. It didn’t really matter. He moaned again.\n “Ah, ‘The Suffering Critic.’ A work to gladden the heart of any artist.” Standing at the foot of my bed, with a bouquet of multicolored daisies, was a dark, bearded man with a slight twist of amusement to his mouth. That quirk was there so often that it had permanently distorted the muscles of his face, so that he always wore the same facial expression, like a mask. Masks don’t reveal, they conceal, something it was easy to forget.\n Amanda had caused to be sent to me an even dozen long stemmed red roses, which loomed over me where I lay. He read the card, which just said “Get Well” and nothing else, and, with the impatient gesture of a god eliminating an improperly conceived species of flatworm, he pulled them out of the vase and threw them away. He shoved his own daisies in their place. This done, he sat down in the chair next to me with a grunt of satisfaction. “Jacob, old friend. You look like hell, and your hair is falling out.”\n “You’re too kind, Samos.”\n “Do you know of any reason why anyone would want to kill you?” He peered at me to see what my reaction would be.\n I stared at him for a second before I thought of a response. “Samos, I’m a critic.”\n “Point well taken. But you haven’t answered my question.”\n “Samos, when you come to visit a sick friend in the hospital, you’re supposed to make small talk, not start off with—”\n “The fact that I suspect someone of trying to kill you?” Halicarnassus was remorseless. “Not telling you that as soon as possible would be crass impoliteness. However, if you insist. On the way here I saw some cumulus clouds. They brought a number of impressions to mind, and in fact I saw one that strongly resembled a mongoose.”\n I should have known better. I sighed and gave up. “To answer your question, Samos, no, I don’t think someone’s trying to kill me. Do you?”\n He grimaced. “I’m not sure. It’s just that the shielding in your robe was good, everything was in order, calculations from your dosimeter indicate that you absorbed a dose of somewhat over twenty rem, high but not fatal, and yet, you were almost dead when they got you here. Don’t you find that odd?”\n “How did—” I stopped. It was useless to ask Halicarnassus how he found these things out. He seemed to know all the back stairs of Centrum, including which steps creaked. “I don’t, unfortunately, find getting radiation sickness after walking into a fresh blast crater particularly odd, no.”\n “Let me remind you of the fate of one of your predecessors, who died in a zeppelin explosion while eating coq a vin off a silver plate in the company of the Duc de Moscau.”\n I’d been trying not to think of him. “Gambino was reviewing one of Nobunaga’s worlds, if I remember. His people are colorful, but tend to be indifferent engineers.” I didn’t know why I was arguing with him.\n Halicarnassus shrugged. “He’d also revealed Lord Meern’s collection of sexually obsessed societies, which caused Meern to suffocate himself, if you’ll recall. It could all be accidental, of course. In an infinite number of Shadows, an infinite number of things happen. But here’s an interesting thought. Can you conceive of two worlds that differ in only one important detail?”\n It was a relief to talk shop, rather than death. I hadn’t caused anyone’s suicide. Not that I knew about. “What do you mean?”\n “Say I create two Shadows, identical in everything, except in one the writing in books is boustrophedon, like the ancient Greeks did it, with alternate lines going right to left. It’s a more efficient way of reading, really, you don’t have to move your eyes back to the beginning of each line.”\n I liked the idea. “Or two Shadows, but in one men kiss, rather than shaking hands.”\n “Taking an inhabitant of one and dropping him in the other would cause no end of problems. Or better yet, trading two otherwise identical people.”\n “Both would end up arrested.”\n We laughed and explored the idea, and the thought of murder, never quite reasonable to begin with, was forgotten.\n “Jacob!” Amanda finally flounced in, wearing a red dress, not one I remembered ever having seen before. She pecked me on the forehead, then sat down in the chair and rearranged the pleats of her dress until they lay in the proper pattern. Then she smiled at me. Behind her, moving silently, was Martine, holding a box. My head was pulsing again, and I felt disoriented. I blinked my eyes, but it didn’t help.\n Martine and Amanda were both frowning over my shoulder, as if there was something improper there. Halicarnassus stared back expressionlessly, then bowed. Amanda smiled tightly, Martine did nothing. “Good day, Jacob,” Halicarnassus said, patted my shoulder, and was gone.\n They had brought me cookies, airy things of almond and spice. Amanda had made them. I hadn’t known she could bake. They brought me cookies. Symbols are not only in books, but help us see the structure of our own lives. Each cookie shattered as I bit into it, then stuck to my teeth. Martine avoided this problem by swallowing his whole.\n Martine was desperate to know what Halicarnassus and I had been discussing, but didn’t want to ask. I ignored his ever more pointed hints with sickbed stupidity, and left him frustrated. It was meager satisfaction. Amanda chattered, more talkative than I’d seen her in months. I watched the delicate curve of her throat and shoulders. She talked about the weather, about jewelry, about the music she’d been listening to, about art. Her tastes were dependent on the important others in her life, but she’d been mine for so long that I had forgotten, and was startled to hear her criticizing works that I loved, and thought she had also.\n I lay back and listened to them, until their voices were just a buzz. Life was full of troubles, and I had more important things to worry about than exploding zeppelins.\n I hadn’t been in Halicarnassus’ new world for more than five minutes when I saw her. I should have known better than to be in his Shadow in the first place, but I’ve never been able to resist an exclusive showing, even knowing his habit of unpleasant tricks. Halicarnassus had always enjoyed forcing societies into unnatural forms, unhealthy adaptations. He’d done an ornate Victorian style Europe full of confectionary palaces and light operas which practiced brutal ritual cannibalism at fancy dress dinner parties, a hereditary American Congress full of dangerously inbred religious fanatics who dressed in drag when deciding on bloody crusades against Sumatra and Ethiopia, and a North American Great Plains kept free of habitation from the Mississippi to the Rockies so that its Mongol conquerors could ride as their ancestors had, while forcing enslaved Europeans to build meaningless monuments larger than the Pyramids. His worlds seemed to disturb most of the Lords, who found them mocking, and they found few buyers. He got by, somehow, the way artists always have, and still made his art.\n I came into this world on the bottom level of Grand Central Station, as if I were simply another traveler amid the scurrying mobs, who carried me up into the light of the streets above.\n Just a few blocks away, near St. Patrick’s Cathedral, I saw Amanda, her blond hair curled and flowing, crossing 50th Street on Fifth Avenue, obviously in a hurry. I didn’t stop to think, but followed her trim, gray suited figure as she walked down the street, carrying a briefcase. The people of this Shadow did not dress brightly, or use much color on their buildings, which were disproportionately high, like the spires of iron cathedrals that had never been built. So Amanda, always in fashion, dressed here in discreet urban camouflage.\n Love is a random process, depending on such improbable events as an introduction by mutual friends followed by a chance meeting in an exhibit of etchings, and a common liking for a certain sweet wine punch which now, in memory, makes me gag. Or perhaps not so improbable: I later found out that Amanda had gone to that gallery because she knew I would be there. She has never learned to like copperplate etchings, though she pretended to, at the time. The loves of our ancestors were equally random. Exact duplicates of individuals seldom exist from Shadow to Shadow, despite Halicarnassus’ elaborate plans for almost duplicate worlds, so we almost never get to see ourselves in a different life. Was there a Jacob Landstatter in this world? A Salvator Martine?\n So I followed her, my heart pounding. Her waist and her hips were just the same, and she swayed, enchantingly, the way she always had. When she stopped at street corners, she looked up at the tops of the buildings, shading her eyes, as if looking for roosting storks, or gargoyles. Her walk was quick, even on heels, and I had to concentrate on keeping up, difficult on the crowded street. She continued for quite a distance, finally coming to the edge of a large green park called, with no particular originality, Central Park. This was a strange, mechanical Shadow, full of flying machines and automobiles. It was incredibly noisy. She finally turned into a large gray building called the Metropolitan Museum of Art. I paused at the base of the stairs for a long moment. Banners announced special exhibits of eighteenth century French crystal, Japanese swords, and the works of a Rembrandt van Rijn. Dutch again. I was tired of Dutch. I followed her up the stairs and into the museum.\n It was Rembrandt that she wanted, and she went straight there through the maze of corridors. It was an exhibit of copperplate etchings. Much of it was a series of self-portraits of that same Rembrandt van Rijn, from rather boorish youth to brooding old age, in a variety of strange headdresses. The man was obviously a genius, and I lost myself in his intricate lines.\n “He is remarkable, isn’t he?” she said, at my side. “I took some time off from work to come see him. This is the last day it’s going to be here.”\n I turned slowly to look at her. Her eyes were the same too, lighter blue within dark, under long, soft lashes. She looked down when I met her gaze then glanced back up. There was no sign of recognition in her eyes. No Jacob Landstatter in this world. Until now. She smiled. Here she smelled like wildflowers, something other than violets.\n We found ourselves strolling around the exhibit together, giving each other details of the various etchings as gifts. Some of her remarks were critical, and I suspected that she didn’t think as much of etchings as she had initially claimed she did.\n “I don’t know what I should do now,” she said, looking up and down the street after we emerged. “I don’t really want to go back to work . . . it’s too nice a day.” She looked at me, then looked away.\n I suggested we get a drink, and she took my arm as we walked. I felt like an idiot. What was I doing? It was a beautiful spring day, and our steps matched as we walked. She looked up again, at the corner, and we discussed the cornices of buildings, the eaves of the roof of the house she had grown up in, the strange places birds manage to relax, and hidden roof gardens in Manhattan. It had been a long time since I’d enjoyed a conversation quite that much. She flirted with intent, and smiled when she looked at me. “I’ve been so lonely,” she said.\n Suddenly she froze, then turned to look into the window of a stationery store, pretending to look at her reflection and correct her hair. “Oh shit,” she said under her breath. “Oh damn. Oh damn. Why is he here?”\n I looked up and down the street, and had no problem spotting him, no problem at all. He walked with his head held up and his arms swinging, and wore a floppy shirt from South America. His right hand was stained with chrome yellow and viridian. Still an artist, even here, Salvator Martine strode past, his eyes fixed on an image invisible to everyone else on the street, and did not see us. I looked at Amanda. She was trembling as if with a chill. Her left hand pulled at her hair, and she looked vulnerable, like an abandoned child. It was only then that I noticed the glint of a gold wedding band on her finger, and it all made sense.\n “Who was that?” I asked.\n “Who? Oh . . . somebody. It doesn’t matter.” She talked quickly. “Let’s go.”\n I went with her, but everything inside of me had turned to ice. I managed to disengage myself from her after drinks but before dinner, to her obvious dismay. She liked me, and found me attractive. I felt a fool for still wanting her, like a small child who wants to play with shards of glass because they glint so prettily in the sun, but I couldn’t help it. We made a date to meet at the Museum of Modern Art the following week, for an exhibition of Rothko. She would be there, but I wouldn’t be. It would be another two days before my Key would allow me back through the gate into the hallways. They had something called television here, moving images in a box. I decided to stay in my hotel room for the rest of the time and watch it.\n When I returned home, I knew Amanda, my Amanda, the real Amanda, had finally gone. There was no trace of her perfume in the air, and her things were gone from her bureau.\n I walked through the entryway, down the hall, and into the quiet room, where I settled into a low couch facing the green, moss-filled garden. The chuckle of the stream flowing through it was vivid in the silence.\n Why did I hurt? Because I, of all possible Jacob Landstatters, had finally lost my Amanda, out of all possible Amandas? Does a minute flux in the probability stream feel pain? Nonsense. The pain was real, perhaps, but I wasn’t. I waited to vanish. But cardiac muscle doesn’t know anything about alternate probability worlds, or Shadow, or feelings of unreality, or the Lords. My heart continued beating. My diaphragm continued to pull downward, filling my lungs with air. My stomach rumbled. I was hungry. I got up to make myself a sandwich.\n The kitchen was clean and silent. Copper pots and steel utensils hung over the drain board, and the red curtains puffed in the breeze from the open window. The breadbox contained half a loaf of rye bread, fresh and aromatic. Where the devil had it come from? Amanda couldn’t have put it here, she’d obviously been gone for too long. I hefted it. The crust was crisp.\n “Stop playing with your food and cut a slice for God’s sake,” a voice said behind me. I whirled, loaf in hand. Halicarnassus was sitting at the table in the darkened alcove. “It’s impolite to threaten your guests with deadly viands,” he observed. “Cut a slice, I said. I’ve got the mustard and roast beef here.”\n “How kind of you.”\n He took a luxurious bite of his sandwich. “Give it up, Jacob. Ah. Rye, beef, and mustard. There are some aesthetic verities that transcend reality. The field of gustatory ontology has been much neglected by philosophers.”\n “So much the worse for ontology,” I said, settling down to lunch with as much grace as I could muster. I really was quite hungry.\n “So much the worse for philosophers! All this Truth and Beauty stuff is fine, but it obscures the real issues. Rye bread! I try never to create a world in which it cannot be found. One must have an absolute aesthetic criterion to give an anchor to one’s life.”\n There are worse ones, I suppose. “Did you create that entire world to give me an object lesson about my personal life?”\n “Hey, they have great rye bread in that city. Don’t be such an egotist, Jacob. I put that in as a little detail, an ironic reference, like a dog crapping in the corner of a hunting scene. No artist is going to create an entire world just to please one critic’s vanity. That’s a real world, full of real people. Just like this one.”\n I had been suspicious for a long time, about the Lords, Centrum, and Samos Halicarnassus, so I decided to risk the question. “Did you create this world, Samos?”\n He grimaced. “Yes, and not one of my better efforts, I must say. The Lords are an insufferable bunch, and Centrum is . . . excessive.”\n “Where are you from?”\n He passed a hand over his forehead. “You know, I’m not even sure I remember. A lot of white stone buildings. Apple orchards. A big blue sky. Doesn’t tell you much, does it? I guess it didn’t tell me much either. But I remember school, a big hall with a dome, and my first world. It was a clunky thing, with brass and mahogany steam carriages and wars full of cavalry charges and solemn republics whose capital cities were always built of white marble and top-hatted ambassadors who exchanged calling cards and people who lived, breathed, and died, just like they did at home. I went to live there, a requirement for graduation, I think. I never went back. I just made worlds, Shadows you call them here, and moved on, sometimes into one of mine, usually into one I stumbled onto made, presumably, by someone else.”\n “So yours was the real world.”\n “Jacob, I’ve always been amazed at your inability to detach your emotions from your intellect. That world was created as a private project by a man from a culture so different from this one that my mind does not retain any information about it at all. He was ancient when I was a child, the grandmaster of the school. He died much honored, since he was, I suppose, God.” He cut himself another slice of bread. “It would be nice to be certain one existed, but as long as we spend our time twisting time like this, rather than on more rational pursuits, none of us ever will be sure. Most of the inhabitants of the worlds I have created at least believe they exist, which gives them the advantage over us. Your Lords devised these absurd Keys in your limbic systems to give you all a sense of reality, since you always feel like you are coming home. A nice touch. You, incidentally, no longer have one.”\n I remembered my strange dizziness and disorientation at the medical ward. At the time, I had chalked it up to radiation sickness. “How did you manage that?”\n “Friends at the hospital in Centrum, willing to do me a favor. And why shouldn’t they? I created them, after all. It’s really a simple modification, and performed more often than you might think, even in this most real of all possible worlds.” He ate the rest of his sandwich and stood up. “Well, that’s enough for now. You’ll be seeing me again, I think. You’re one of my more engaging creations.”\n “Oh shut up.” I put my head in my hands. This was too much.\n “Good luck on your next job.”\n “What do you know about my next job?”\n He grinned maliciously. “It’s by Martine.”\n I choked on my food. “That son of a bitch has taken off with my wife.” I stopped. It hurt. It was surprising how much it hurt.\n “Don’t worry. It’s no more real than anything else.”\n “It’s no less real. My guts feel like they’ve been caught by a fishhook.”\n “And you sneer at gustatory ontology. Good day, Jacob.” And he walked out the door and was gone.\n The various portions of the Chancellery Gardens of Laoyin harmonized not only in space, but in time. The arrangement of dells and lily ponds, of individual Dawn Redwoods, laboriously dug, full grown, in the fastness of Old China and brought here up the Lao River, which I knew as the Columbia, in barges built for the purpose, of stone temples with green bronze cupolas, and of spreads of native prairie, seemingly engaged in a devious wildness but actually existing because of the efforts of dedicated gardeners, took on meaning only when observed at a receptive stroll. I emerged from the yellow-green of a stand of ginkgoes, descended a gorge alongside a stream, and arrived at the rocky shore of a lake, its verge guarded by cunningly twisted pines and Amur maples. I trod the gravel path further, and felt uneasy. While I strolled, too many others strode purposefully, usually in tight groups of three or four. The vistas were ignored by men who muttered and gestured to each other. Either trouble was brewing, or the inhabitants of this Shadow had decidedly odd ideas of how to enjoy a sunny afternoon in the park.\n A Bodhisattva blessed my exit with bland beneficence. In contrast to the serene order of the Chancellor’s garden, the city streets beyond were a tangle. What had been intended as triumphal thoroughfares were blocked every hundred paces by merchant’s stalls, religious shrines, or entire shanty towns, complete with chickens and screaming children. Under other circumstances, it would have been a swirling, delightful mess.\n However, the streets had the same feeling of oppression as the park. Everywhere there were knots of people discussing dark matters. A scuffle broke out between two groups, one with dark skin and bulbous, deformed Mayan heads, shouting loudly and striking out clumsily, the other short, sibilant, with narrow catlike eyes and flat noses, darting with precisely placed energy. Suddenly abashed by the attention they aroused, both groups melted into the surrounding crowds.\n “The Prince is dead.” Everywhere I heard the murmur. “The Prince, murdered. Vengeance, for our Prince. Where is his murderer? He must be found. He must be killed. The. Prince. Is. Dead.” Each word was a call of anguish.\n I emerged onto a wide street that had been kept clear. Flat fronted buildings of basalt bulked on either side, all identical.\n There was a sound down the way, the rhythmic thud of metal drums, growing ever louder. In response to some signal not perceptible to me, a crowd had gathered. Some of them were dressed in woolen robes that looked suspiciously familiar to me, but there was no time to think about it. Everyone began to sway in time to the beat. As the sound of the drums approached I could hear, over it, the baying of hunting horns. I looked up the street. Sailing towards me like an image from an involuntarily recalled memory was the Face.\n “Woe!” the crowd wailed. “Oh woe! Dead. Dead!” Tears streamed down every face, and every body moved to the beat of those awful drums. “The Prince! Woe!” And the Face continued.\n It was huge, at least thirty feet high, carved out of some dark, gray flecked rock. The eyes, blank and pitiless, stared into mine, and beyond me, to infinity. The lips were curved in a slight smile, like that of a Buddha, but seemed to be arrested in the process of changing to some more definite expression. What would it have been? A grin? A scowl? A grimace of pain, or anger? Or a mindless nullity? The Face was of stone and would carry that secret forever. There were creases in the cheeks, and the nose was slightly bent at the end. The Prince was becoming a god, but obviously intended to keep his nose intact. A god is not handicapped by a twisted nose.\n The sculpture rested on a great wagon, each of its many wheels reaching to twice the height of a man. It was pulled by teams of men and women, volunteers. Everyone wanted to help, and unseemly scuffles broke out for places on the ropes. The drummers seated below the god’s chin occasionally enforced justice by clubbing someone with their brass drumsticks. And the crowd cried “Woe!”\n The Face swept by, becoming, from behind, a rough-hewn, lumbering mountain of stone.\n The mood of the crowd changed. Like a shadowed pool of blood in the corner of a slaughterhouse suddenly illuminated by shutters flung open on sunlight, the black despair of the crowd was revealed as scarlet imperfectly perceived. Icicles grew on my spine as shouts of rage and upraised daggers greeted the approach of the second Face. The daggers . . .\n “Murderer!” they cried. “Death!” Though essentially a thirty-foot-high stone wanted poster, the sculptors had lavished no less care on this Face than on that of the Prince. Its brows were knit in jealous rage, its eyes glowered. Its lips were pulled back in a contemptuous grin, challenging us all to do our worst. Though fleshier and more dissipated than I remembered, the Face was familiar. It should have been. I looked at it every morning in the mirror when I shaved. It was my own.\n The sculptors had done their work well. So compelling was the Face that no one noticed my real face as, shaking with fear, I slipped through the crowd. Their daggers, with silver hilts chased with a pattern of eyes and lightning bolts, were also familiar. The last time I had seen one, it had been sticking out of a bedpost next to my head.\n Martine! It had been him the whole time. He’d sent his creations to kill me in Schekaagau, and when that had failed, he’d exposed me to radiation from his Virgin Mary, so that the cumulative dosage from my visit to Berenson’s radioactive world would kill me. Hell, he’d probably locked me in my room at Cuzco. But for what? My wife? It made no sense, but then, murder often made no sense, at least to the victim. But didn’t the idiot know that none of this was real?\n So Martine had created this entire world just to kill me, despite what Halicarnassus had said about my ego. I should have been flattered, but it’s hard to feel flattered when you’ve pissed in your pants and are fleeing for your life.\n I quickly became lost in the tangle of streets, though I really had no idea of where I was going, or for what reason. Everywhere was equally dangerous in this city of Laoyin. The houses were all about four stories high, of cracked stucco, and leaned crazily. The air smelled of frying fish and fermented black beans. I turned a corner into a dusty square. A group of locals sat gloomily around a nonfunctioning fountain. I slunk past them, trying to look nonchalant. I almost made it.\n “Look, Daddy!” a little boy said, pointing at me. “Prince!”\n “No it isn’t. It’s—” Their knives were out in an instant. They didn’t waste time debating points of tactics, but launched themselves at me in a mass. I turned and ran.\n The tangled streets, confusing enough at a walk, were a nightmare at a dead run. Every few seconds I ran into a wall or the sharp corner of a building. I began to gain on my pursuers. Despite their hatred, they still had some concern for their bodies. I could not afford to have any.\n I broke clear of the high buildings and found myself on a wide promenade, paved with multicolored slabs of rock and bordered on my left by an ornamental railing. Through the railing, far below, were the waters of the Lao, as they flowed towards what I knew as Puget Sound. Leaning casually on the railing, as if on the parapet of his palace, was Martine. He held a gun in his hand, slightly nervously, as if unsure of what to do with it. He had been unable to resist taking a direct hand in things, despite all of his efforts to set up a perfect trap for me. I was trapped. I stopped. Would he posture, preen, and carry on first, or would he simply gun me down? Right on the first guess.\n “At last,” he said. “At last I can have my revenge.”\n “What? What the hell are you talking about?”\n “You have tormented and ruined me. I did my best, I poured my soul into my art, but it was not enough for you. My genius was never enough.” He raised the pistol. “Say your prayers, Jacob.”\n “Wait a minute, for God’s sake.”\n “Nothing can stay my hand now, Jacob. Compose yourself for death.”\n “I’ll compose myself for anything you want, if you tell me what you’re going on about. You’ve got Amanda, what more do you want?”\n He frowned, confused. “Amanda? What does Amanda have to do with this? How can you mock my work, humiliate me, degrade me—”\n I should have known. I grinned in relief. “Is that it? You’re all upset because of some lousy reviews? Don’t be ridiculous.”\n His finger whitened on the trigger. “You have destroyed me. Now I destroy you.”\n “For crissakes, Salvator, are you crazy? Who takes critics seriously?” I was almost in tears. Here I’d finally found someone who paid attention to my criticism, and he wanted to kill me for it. It wasn’t fair.\n “Make your peace with God, though I have no doubt that you’ll pick enough with Him that He’ll wish He never created you.” Martine was proving to be an extremely gabby murderer.\n A knot of people emerged from an alleyway behind Martine. Seeing that he had held me prisoner rather than killing me outright made them smile. It’s always nice when someone is willing to share.\n I nodded. “All right, Samos. Take him.”\n Martine snorted. “A feeble ruse, Jacob.”\n The first man in the group brushed past Martine’s elbow. With a shriek, he turned and fired, blowing the man’s chest open and leaving him with a surprised and offended expression on his face. Before Martine could get the barrel pointed back in my direction, the blades were into him, silver into scarlet. He screamed once. That done, the blades turned towards me. With the sharp decisiveness that makes for John Doe corpses in the morgue, I took three quick steps and threw myself over the railing into the air. I don’t know if I screamed. I know that those behind me did, in disappointment. I watched the river. It didn’t seem to get any closer, just more detailed, ripples, whirlpools, and flotsam appearing and sharpening as if on a developing piece of film.\n I must have remembered Halicarnassus’ modification to my Key subconsciously, because the next instant I found myself, sweating and soiled, in the dark hallway beneath Centrum.\n She was home, sitting in the quiet room reading a book about Caravaggio. She looked up at me as I entered, smiled, then went back to her reading, saying nothing. It was not a silence that could be easily broken, for it seemed to me that it would shatter into a thousand pieces at the first word. I walked to the bedroom, took a shower, and changed into household clothes. There was no clothing out, no suitcase, and everything was folded neatly in the drawers. I breathed. The air smelled, just slightly, of jasmine. Jasmine? I went to the kitchen.\n Amanda had cleaned up the remains of the final lunch Halicarnassus and I had had together. I opened the green kitchen curtains to have a view of the garden and began to pull out ingredients. Had the knives always been on the left side of the drawer? How observant was a critic? I examined the curtains. Still green. The last time I had seen them, at lunch, they had been red. That I remembered.\n One Shadow differing from another in only one minor, but significant way. Amanda and I had had a discussion about those curtains. I had wanted green, but finally gave in. My hand shook a little as I chopped the onions, as I began to realize that Halicarnassus had sent me drifting through Shadow, with no way to ever return to the world I had spent my whole life believing was the real one.\n I flipped the top of the garbage can up to throw away the onion peels. Inside, crumpled, was a set of red curtains. A note was pinned to them. “You’ll never know,” it said. “Get used to it.” It didn’t need a signature.\n I stir fried beef and ginger, and thought about the woman in the other room. Was this the woman I had married, who had betrayed me? Or was this someone else? If Amanda was different enough that she would not betray me, could I still love her? I was adrift in a sea of infinite worlds, so I was starting to think that it didn’t really matter. I could discuss it with Halicarnassus, when we finally ran into each other again. Somehow, I was sure that we would.\n When it was finished, I took the food in to Amanda. It tasted very good.\n Originally published in Isaac Asimov’s Science Fiction Magazine, August 1987.\n With only a handful of stories, mostly for Asimov's, and a few well-received novels, Alexander Jablokov established himself as one of the most highly-regarded new writers of the '90s. His first novel, Carve The Sky, was released in 1991, and was followed by other successful novels such as A Deeper Sea, Nimbus, River of Dust, and Deepdrive, as well as a collection of his short-fiction, The Breath of Suspension. His most recent novel is Brain Thief."}