{"fingerprint": "BUQqE9Dmnizy87FFfeg0HUenMVc=", "sitename": "Clarkesworld Magazine", "title": "Non-Zero Probabilities by N. K. Jemisin", "author": "N K Jemisin", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jemisin_09_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Non-Zero Probabilities by N. K. Jemisin", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3350 words, short story\n Non-Zero Probabilities\n 2009 Nebula Award Nominee2010 Hugo Award Nominee\n In the mornings, Adele girds herself for the trip to work as a warrior for battle. First she prays, both to the Christian god of her Irish ancestors and to the orishas of her African ancestors—the latter she is less familiar with, but getting to know. Then she takes a bath with herbs, including dried chickory and allspice, from a mixture given to her by the woman at the local botanica. (She doesn’t know Spanish well, but she’s getting to know that too. Today’s word is suerte.) Then, smelling vaguely of coffee and pumpkin pie, she layers on armor: the Saint Christopher medal her mother sent her, for protection on journeys. The hair-clasp she was wearing when she broke up with Larry, which she regards as the best decision of her life. On especially dangerous days, she wears the panties in which she experienced her first self-induced orgasm post-Larry. They’re a bit ragged after too many commercial laundromat washings, but still more or less sound. (She washes them by hand now, with Woollite, and lays them flat to dry.)\n Then she starts the trip to work. She doesn’t bike, though she owns one. A next-door neighbor broke an arm when her bike’s front wheel came off in mid-pedal. Could’ve been anything. Just an accident. But still.\n So Adele sets out, swinging her arms, enjoying the day if it’s sunny, wrestling with her shitty umbrella if it’s rainy. (She no longer opens the umbrella indoors.) Keeping a careful eye out for those who may not be as well-protected. It takes two to tango, but only one to seriously fuck up some shit, as they say in her ’hood. And lo and behold, just three blocks into her trip there is a horrible crash and the ground shakes and car alarms go off and there are screams and people start running. Smoke billows, full of acrid ozone and a taste like dirty blood. When Adele reaches the corner, tensed and ready to flee, she beholds the Franklin Avenue shuttle train, a tiny thing that runs on an elevated track for some portions of its brief run, lying sprawled over Atlantic Avenue like a beached aluminum whale. It has jumped its track, fallen thirty feet to the ground below, and probably killed everyone inside or under or near it.\n Adele goes to help, of course, but even as she and other good Samaritans pull bodies and screaming wounded from the wreckage, she cannot help but feel a measure of contempt. It is a cover, her anger; easier to feel that than horror at the shattered limbs, the truncated lives. She feels a bit ashamed too, but holds onto the anger because it makes a better shield.\n They should have known better. The probability of a train derailment was infinitesimal. That meant it was only a matter of time.\n Her neighbor—the other one, across the hall—helped her figure it out, long before the math geeks finished crunching their numbers.\n “Watch,” he’d said, and laid a deck of cards facedown on her coffee table. (There was coffee in the cups, with a generous dollop of Bailey’s. He was a nice-enough guy that Adele felt comfortable offering this.) He shuffled it with the blurring speed of an expert, cut the deck, shuffled again, then picked up the whole deck and spread it, still facedown. “Pick a card.”\n Adele picked. The Joker.\n “Only two of those in the deck,” he said, then shuffled and spread again. “Pick another.”\n She did, and got the other Joker.\n “Coincidence,” she said. (This had been months ago, when she was still skeptical.)\n He shook his head and set the deck of cards aside. From his pocket he took a pair of dice. (He was nice enough to invite inside, but he was still that kind of guy.) “Check it,” he said, and tossed them onto her table. Snake eyes. He scooped them up, shook them, tossed again. Two more ones. A third toss brought up double sixes; at this, Adele had pointed in triumph. But the fourth toss was snake eyes again.\n “These aren’t weighted, if you’re wondering,” he said. “Nobody filed the edges or anything. I got these from the bodega up the street, from a pile of shit the old man was tossing out to make more room for food shelves. Brand new, straight out of the package.”\n “Might be a bad set,” Adele said.\n “Might be. But the cards ain’t bad, nor your fingers.” He leaned forward, his eyes intent despite the pleasant haze that the Bailey’s had brought on. “Snake eyes three tosses out of four? And the fourth a double six. That ain’t supposed to happen even in a rigged game. Now check this out.”\n Carefully he crossed the fingers of his free hand. Then he tossed the dice again, six throws this time. The snakes still came up twice, but so did other numbers. Fours and threes and twos and fives. Only one double-six.\n “That’s batshit, man,” said Adele.\n “Yeah. But it works.”\n He was right. And so Adele had resolved to read up on gods of luck and to avoid breaking mirrors. And to see if she could find a four-leafed clover in the weed patch down the block. (They sell some in Chinatown, but she’s heard they’re knockoffs.) She’s hunted through the patch several times in the past few months, once for several hours. Nothing so far, but she remains optimistic.\n It’s only New York, that’s the really crazy thing. Yonkers? Fine. Jersey? Ditto. Long Island? Well, that’s still Long Island. But past East New York everything is fine.\n The news channels had been the first to figure out that particular wrinkle, but the religions really went to town with it. Some of them have been waiting for the End Times for the last thousand years; Adele can’t really blame them for getting all excited. She does blame them for their spin on it, though. There have to be bigger “dens of iniquity” in the world. Delhi has poor people coming out of its ears, Moscow’s mobbed up, Bangkok is pedophile heaven. She’s heard there are still some sundown towns in the Pacific Northwest. Everybody hates on New York.\n And it’s not like the signs are all bad. The state had to suspend its lottery program; too many winners in one week bankrupted it. The Knicks made it to the Finals and the Mets won the Series. A lot of people with cancer went into spontaneous remission, and some folks with full-blown AIDS stopped showing any viral load at all. (There are new tours now. Double-decker buses full of the sick and disabled. Adele tries to tell herself they’re just more tourists.)\n The missionaries from out of town are the worst. On any given day they step in front of her, shoving tracts under her nose and wanting to know if she’s saved yet. She’s getting better at spotting them from a distance, yappy islands interrupting the sidewalk river’s flow, their faces alight with an inner glow that no self-respecting local would display without three beers and a fat payday check. There’s one now, standing practically underneath a scaffolding ladder. Idiot; two steps back and he’ll double his chances for getting hit by a bus. (And then the bus will catch fire.)\n In the same instant that she spots him, he spots her, and a grin stretches wide across his freckled face. She is reminded of blind newts that have light-sensitive spots on their skin. This one is unsaved-sensitive. She veers right, intending to go around the scaffold, and he takes a wide step into her path again. She veers left; he breaks that way.\n She stops, sighing. “What.”\n “Have you accepted—”\n “I’m Catholic. They do us at birth, remember?”\n His smile is forgiving. “That doesn’t mean we can’t talk, does it?”\n “I’m busy.” She attempts a feint, hoping to catch him off-guard. He moves with her, nimble as a linebacker.\n “Then I’ll just give you this,” he says, tucking something into her hand. Not a tract, bigger. A flyer. “The day to remember is August 8th.”\n This, finally, catches Adele’s attention. August 8th. 8/8—a lucky day according to the Chinese. She has it marked on her calendar as a good day to do things like rent a Zipcar and go to Ikea.\n “Yankee Stadium,” he says. “Come join us. We’re going to pray the city back into shape.”\n “Sure, whatever,” she says, and finally manages to slip around him. (He lets her go, really. He knows she’s hooked.)\n She waits until she’s out of downtown before she reads the flyer, because downtown streets are narrow and close and she has to keep an eye out. It’s a hot day; everybody’s using their air conditioners. Most people don’t bolt the things in the way they’re supposed to.\n “A PRAYER FOR THE SOUL OF THE CITY,” the flyer proclaims, and in spite of herself, Adele is intrigued. The flyer says that over 500,000 New Yorkers have committed to gathering on that day and concentrating their prayers. That kind of thing has power now, she thinks. There’s some lab at Princeton—dusted off and given new funding lately—that’s been able to prove it. Whether that means Someone’s listening or just that human thoughtwaves are affecting events as the scientists say, she doesn’t know. She doesn’t care.\n She thinks, I could ride the train again.\n She could laugh at the next Friday the 13th.\n She could—and here her thoughts pause, because there’s something she’s been trying not to think about, but it’s been awhile and she’s never been a very good Catholic girl anyway. But she could, maybe, just maybe, try dating again.\n As she thinks this, she is walking through the park. She passes the vast lawn, which is covered in fast-darting black children and lazily sunning white adults and a few roving brown elders with Italian ice carts. Though she is usually on watch for things like this, the flyer has distracted her, so she does not notice the nearby cart-man stopping, cursing in Spanish because one of his wheels has gotten mired in the soft turf.\n This puts him directly in the path of a child who is running, his eyes trained on a descending frisbee; with the innate arrogance of a city child he has assumed that the cart will have moved out of the way by the time he gets there. Instead the child hits the cart at full speed, which catches Adele’s attention at last, so that too late she realizes she is at the epicenter of one of those devastating chains of events that only ever happen in comedy films and the transformed city. In a Rube Goldberg string of utter improbabilities, the cart tips over, spilling tubs of brightly-colored ices onto the grass. The boy flips over it with acrobatic precision, completely by accident, and lands with both feet on the tub of ices. The sheer force of this blow causes the tub to eject its contents with projectile force. A blast of blueberry-coconut-red hurtles toward Adele’s face, so fast that she has no time to scream. It will taste delicious. It will also likely knock her into oncoming bicycle traffic.\n At the last instant the frisbee hits the flying mass, altering its trajectory. Freezing fruit flavors splatter the naked backs of a row of sunbathers nearby, much to their dismay.\n Adele’s knees buckle at the close call. She sits down hard on the grass, her heart pounding, while the sunbathers scream and the cart-man checks to see if the boy is okay and the pigeons converge.\n She happens to glance down. A four-leafed clover is growing there, at her fingertips.\n Eventually she resumes the journey home. At the corner of her block, she sees a black cat lying atop a garbage can. Its head has been crushed, and someone has attempted to burn it. She hopes it was dead first, and hurries on.\n Adele has a garden on the fire escape. In one pot, eggplant and herbs; she has planted the clover in this. In another pot are peppers and flowers. In the big one, tomatoes and a scraggly collard that she’s going to kill if she keeps harvesting leaves so quickly. (But she likes greens.) It’s luck—good luck—that she’d chosen to grow a garden this year, because since things changed it’s been harder for wholesalers to bring food into the city, and prices have shot up. The farmers’ market that she attends on Saturdays has become a barterers’ market too, so she plucks a couple of slim, deep-purple eggplants and a handful of angry little peppers. She wants fresh fruit. Berries, maybe.\n On her way out, she knocks on the neighbor’s door. He looks surprised as he opens it, but pleased to see her. It occurs to her that maybe he’s been hoping for a little luck of his own. She gives it a think-over, and hands him an eggplant. He looks at it in consternation. (He’s not the kind of guy to eat eggplant.)\n “I’ll come by later and show you how to cook it,” she says. He grins.\n At the farmers’ market she trades the angry little peppers for sassy little raspberries, and the eggplant for two stalks of late rhubarb. She also wants information, so she hangs out awhile gossipping with whoever sits nearby. Everyone talks more than they used to. It’s nice.\n And everyone, everyone she speaks to, is planning to attend the prayer.\n “I’m on dialysis,” says an old lady who sits under a flowering tree. “Every time they hook me up to that thing I’m scared. Dialysis can kill you, you know.”\n It always could, Adele doesn’t say.\n “I work on Wall Street,” says another woman, who speaks briskly and clutches a bag of fresh fish as if it’s gold. Might as well be; fish is expensive now. A tiny Egyptian scarab pendant dangles from a necklace the woman wears. “Quantitative analysis. All the models are fucked now. We were the only ones they didn’t fire when the housing market went south, and now this.” So she’s going to pray too. “Even though I’m kind of an atheist. Whatever, if it works, right?”\n Adele finds others, all tired of performing their own daily rituals, all worried about their likelihood of being outliered to death.\n She goes back to her apartment building, picks some sweet basil and takes it and the eggplant next door. Her neighbor seems a little nervous. His apartment is cleaner than she’s ever seen it, with the scent of Pine Sol still strong in the bathroom. She tries not to laugh, and demonstrates how to peel and slice eggplant, salt it to draw out the toxins (“it’s related to nightshade, you know”), and sautee it with basil in olive oil. He tries to look impressed, but she can tell he’s not the kind of guy to enjoy eating his vegetables.\n Afterward they sit, and she tells him about the prayer thing. He shrugs. “Are you going?” she presses.\n “Nope.”\n “Why not? It could fix things.”\n “Maybe. Maybe I like the way things are now.”\n This stuns her. “Man, the train fell off its track last week.” Twenty people dead. She has woken up in a cold sweat on the nights since, screams ringing in her ears.\n “Could’ve happened anytime,” he says, and she blinks in surprise because it’s true. The official investigation says someone—track worker, maybe—left a wrench sitting on the track near a power coupling. The chance that the wrench would hit the coupling, causing a short and explosion, was one in a million. But never zero.\n “But . . . but . . . ” She wants to point out the other horrible things that have occurred. Gas leaks. Floods. A building fell down, in Harlem. A fatal duck attack. Several of the apartments in their building are empty because a lot of people can’t cope. Her neighbor—the other one, with the broken arm—is moving out at the end of the month. Seattle. Better bike paths.\n “Shit happens,” he says. “It happened then, it happens now. A little more shit, a little less shit . . . ” He shrugs. “Still shit, right?”\n She considers this. She considers it for a long time.\n They play cards, and have a little wine, and Adele teases him about the overdone chicken. She likes that he’s trying so hard. She likes even more that she’s not thinking about how lonely she’s been.\n So they retire to his bedroom and there’s awkwardness and she’s shy because it’s been awhile and you do lose some skills without practice, and he’s clumsy because he’s probably been developing bad habits from porn, but eventually they manage. They use a condom. She crosses her fingers while he puts it on. There’s a rabbit’s foot keychain attached to the bed railing, which he strokes before returning his attention to her. He swears he’s clean, and she’s on the pill, but . . . well. Shit happens.\n She closes her eyes and lets herself forget for awhile.\n The prayer thing is all over the news. The following week is the runup. Talking heads on the morning shows speculate that it should have some effect, if enough people go and exert “positive energy.” They are careful not to use the language of any particular faith; this is still New York. Alternative events are being planned all over the city for those who don’t want to come under the evangelical tent. The sukkah mobiles are rolling, though it’s the wrong time of year, just getting the word out about something happening at one of the synagogues. In Flatbush, Adele can’t walk a block without being hit up by Jehovah’s Witnesses. There’s a “constructive visualization” somewhere for the ethical humanists. Not everybody believes God, or gods, will save them. It’s just that this is the way the world works now, and everybody gets that. If crossed fingers can temporarily alter a dice throw, then why not something bigger? There’s nothing inherently special about crossed fingers. It’s only a “lucky” gesture because people believe in it. Get them to believe in something else, and that should work too.\n Except . . .\n Adele walks past the Botanical Gardens, where preparations are under way for a big Shinto ritual. She stops to watch workers putting up a graceful red gate.\n She’s still afraid of the subway. She knows better than to get her hopes up about her neighbor, but still . . . he’s kind of nice. She still plans her mornings around her ritual ablutions, and her walks to work around danger-spots—but how is that different, really, from what she did before? Back then it was makeup and hair, and fear of muggers. Now she walks more than she used to; she’s lost ten pounds. Now she knows her neighbors’ names.\n Looking around, she notices other people standing nearby, also watching the gate go up. They glance at her, some nodding, some smiling, some ignoring her and looking away. She doesn’t have to ask if they will be attending one of the services; she can see that they won’t be. Some people react to fear by seeking security, change, control. The rest accept the change and just go on about their lives.\n “Miss?” She glances back, startled, to find a young man there, holding forth a familiar flyer. He’s not as pushy as the guy downtown; once she takes it, he moves on. The PRAYER FOR THE SOUL OF THE CITY is tomorrow. Shuttle busses (“Specially blessed!“) will be picking up people at sites throughout the city.\n WE NEED YOU TO BELIEVE, reads the bottom of the flyer.\n Adele smiles. She folds the flyer carefully, her fingers remembering the skills of childhood, and presently it is perfect. They’ve printed the flyer on good, heavy paper.\n She takes out her St. Christopher, kisses it, and tucks it into the the rear folds to weight the thing properly.\n Then she launches the paper airplane, and it flies and flies and flies, dwindling as it travels an impossible distance, until it finally disappears into the bright blue sky.\n N. K. Jemisin is a Brooklyn author whose short fiction and novels have been multiply nominated for the Hugo and the Nebula, shortlisted for the Crawford and the Tiptree, and have won the Locus Award for Best First Novel. Her speculative works range from fantasy to science fiction to the undefinable; her themes include the intersections of race and gender, resistance to oppression, and the coolness of Stuff Blowing Up. She is a member of the Altered Fluid writing group, and a graduate of the Viable Paradise writing workshop. Her latest novel, The Shadowed Sun, was published in June 2012 from Orbit Books, and she's hard at work on a new series due to begin in 2014."}