{"fingerprint": "emSu2VnUEwGfjgQRPmBTgLwoZYM=", "sitename": "Clarkesworld Magazine", "title": "Dog and Pony Show by Robert Jeschonek", "author": "Robert Jeschonek", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jeschonek_09_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dog and Pony Show by Robert Jeschonek", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7850 words, novelette\n Dog and Pony Show\n People say the needles of a dog are a boy’s best friend, and I believe them.\n I mean, the nozzles are okay too, and I shiver with delight when they unfold from my dog Wazoo’s gleaming carapace. I love when they spray the green gas that makes me work harder, or the purple gas that makes the daydreams come.\n But the needles are the most magic part of the dog. Just ask anyone.\n One minute, I’m collapsed on the concrete floor of my bin, exhausted from another triple shift of Playtime. The next minute, ol’ Wazoo is scuttling over to me on his six spiny black legs, barking sweetly.\n K-klak klik buzzzz klak klik.\n Right away, as tired as I am, I’m smiling again. I can’t help it. My pup always takes good care of me.\n As his glossy black face gazes down at me, shiny silver needles poke out from the hundreds of facets in his big, bulbous eyes. When he leans closer, they jab into my nose, and I smell his voice in my mind, singing a story of very strong perfume like the scent given off by rotting flesh. Can there be anything more soothing to a ten-year-old boy like me, living with the perfect dog in the paradise of Beastbless, in the parish of Menagerie?\n Among dog lovers, this is what we call a good nose-lick. And it is enough, all alone, to make life worth living.\n Do you know how lucky I am to have a dog at all? Or a dog as great as Wazoo? My same-aged friend, Incompleta, would do anything to have Wazoo or any dog like him.\n This morning, she reminds me again. “Are you sure you don’t want to trade your dog for my breakfast, Beneathy?”\n “Thanks, but I already have breakfast.” From across the gray table where we eat alongside dozens of fellow Playtimers, I hold up my bowl of delicious red morning clay, sweetened with a garnish of baby chicks. As adorable as they are delicious, the chicks’ tiny black bodies scurry around on eight spindly legs, trying to avoid my white plastic spoon.\n “I have another idea.” She reaches back over her right shoulder, and two long, rust-colored antennae brush her hand. “We could trade my pet for your pet.” The body of a young kitten flows over her shoulder, hundreds of tiny legs flickering under its segmented scarlet shell. The body just keeps coming, wrapping around her three times like a gleaming stole.\n “Lovebite is adorable.” I reach over to pet the kitten’s smooth head, laughing as it snaps at me with its jagged pincers.\n Incompleta puts her hand under the kitten’s mouth, which disgorges a glob of lumpy green ooze. “Just listen to her purr.”\n “I hear it,” I tell her, and I do. Screee snap shrreee snap screeee. “What a beautiful sound,” I say, though I still believe there’s nothingas sweet as the bark of a dog. “Are you serious about trading her? Why would you ever giveher up?”\n “Because dogs are just the best.” Her freckled face reddens as she stares at Wazoo, who then scuttles down off my back and under the table. Lovebite’s tail scrolls around Incompleta’s head, little legs fluttering through her short red hair. “And yours is the best ever.”\n She’s right about that. Smiling, I reach under the table to feel Wazoo’s bristly proboscis quivering, making my fingertips sticky. I wouldn’t know what to do if I ever lost him; I can hardly remember what life was like before I got him.\n “So will you trade him for my kitty?” asks Incompleta.\n “No way.” I smile as Wazoo hops and barks, bumping the underside of the table. K-klak klik buzzzz klak klik.\n Incompleta sighs. “I wouldn’t, either. Especially with the dog shortage going on.”\n “There’s a shortage?” I spoon scuttling baby chicks and red clay into my mouth and chew.\n “That’s right.” As Incompleta eats the lumpy green ooze, her darling Lovebite rears its head up and jabs a clear spike into the soft spot on top of her skull, sipping pink fluid from her head. I’m a little jealous; as great as dogs are, a cat can still be pretty cute when it’s bonding with its owner. “And you better keep a close eye on your dog if you don’t want to end up at the Pet Pageant empty-handed.”\n I think about the Pet Pageant a lot during Playtime. It helps take my mind off the screaming things on the Funsembly Line as my fellow Playtimers and I make them extra Beautiful and Happy.\n The Pageant happens in less than a week. People and pets from all over Beastbless and the parish of Menagerie will be there, competing to take home awards for Best Bark, Best Fetch, Best Lick, Best Chew, and more. But only one animal will win the title of Doggiest Dogaroonie, Prince of Pups—and I’m hoping that dog will be Wazoo.\n “Hey, Beneathy!” Caustico, the tall, blond boy on the other side of the belt jabs the tip of his bloody Plaything at the screamer sliding slowly between us. “You missed one!”\n Snapping out of my reverie, I instantly spot what he’s talking about and jump to fix it. The screamer shrieks at the top of his lungs as I leave my playful mark on his belly, getting him ready for the next level of the Playtime game.\n “You wanna win this time, or not?” snaps Caustico.\n “Sure I do.”\n “Then pay attention.” Caustico flicks blood at me from his Plaything. It will blend right in with my red coveralls and the other blood already soaked into them. “We’re supposed to be on the same team, remember?” He puts down the Plaything and reaches for a Joy Stick, its barbed tip cherry-red and smoking.\n “I will, I will.” Even as I say it, my mind drifts back to the only thing Ireally want to win. I imagine my wonderful dog atop the Hill of Buddies, barking and flashing his glossy black wings as the top judge drapes a gold medal around his proboscis. I can just see Wazoo flapping up into the air and flying victory laps above the crowd, that beautiful medal swinging and glinting in the sunlight.\n K-klak klik buzzzz klak klik.\n On the front of the gleaming gold medal is the image of a dog’s face, complete with multifaceted eyes with needles jutting out of each facet. Two words are emblazoned around the edge of the medal, following the curved edge:\n Doggiest Dogaroonie.\n I see a date, too, and the name of the winner, and I feel a rush of joyful warmth from head to toe. As wonderful as every day of my life is, as lucky as I have always been to be alive and here, this one thing is what I most long to see.\n According to the medal in my daydream, the name of the winning dog is Wazoo, and this year is when he will win the title of Doggiest Dogaroonie.\n The bunnies are biting outside when I take Wazoo for a walk after Playtime. Clouds of them swirl around us, tiny dark flecks getting in my eyes and nipping at my skin—making me smile with each tiny bite, because who doesn’t love bunnies and their tender little kisses?\n Wazoo, as usual, scuttles back and forth before me, probing black masses and smears left behind by other pets on the sidewalk. Once in a while, he gets excited and pops out his wings, shooting pink mist from the special white nozzles exposed along his back. The mist, which smells sweet like burning plastic and drying paint, always makes me feel a little tipsy when I get a whiff of it.\n Suddenly, Wazoo stops zigzagging and bolts off the sidewalk on a beeline. He drags me along behind him through the brush, holding on to his prickly leash for dear life.\n “What are you doing, boy?” I duck out of the way of a low-hanging branch that narrowly misses my head. “Where are you going?’”\n Wazoo, who has never done anything like this before, answers by buzz-snorting and picking up speed, rushing even more recklessly onward. I stumble on a rock, then trip on a root, nearly going down both times—but miraculously stay on my feet.\n K-klak klik buzzzz klak klik.\n Wazoo’s barks get louder the farther off-trail we go. The loudest comes when he hurtles into a clearing and stops. When I stumble in behind him, I see why.\n Wazoo isn’t a big fan of complete strangers, and the clearing is full of them. Three cops in standard gray uniforms encircle a crouching man and a little boy, younger than me, on his knees.\n When the cops hear us, they move apart enough for me to see that the boy is crying and cradling something in his arms . . . something so misshapen, I can’t figure out what it is.\n K-klak klik buzzzz klak klik.\n Bzzzzeeeeeekkk.\n I’ve never heard Wazoo bark like that before, like some kind of broken machine. His wings unfold, and he takes to the air; I have to let go of the leash as he flies circles around the strangers in the clearing.\n “What’s going on here?” The words rush out of me, though I feel like I’m intruding.\n The boy’s face is wet with tears and smudged with black as he looks up at me. Moving closer, I see by the fading light that his arms are full of broken pieces of something black and shiny. Multicolored fluids drip from his elbows and run down his knees, pooling in the dirt.\n His father drops a hand on his shoulder, but the boy only sobs harder. “W-who would do something like this?” The boy asks the question as if Iknow the answer. “Who would k-kill my sweet Gilgamog?”\n Only when he says it and holds out the broken pieces do I realize what has happened here. Only then do I understand what has been in his arms since before I arrived.\n And my heart sinks. My belly twists, and I want to run away that very second. “Your poor dog . . . ”\n “I lovedher with all my h-heart,” says the boy. “And now somebody k-killed her!”\n “Somebody or something,” corrects one of the cops, a male.\n “We don’t know which one yet,” says a female cop.\n “It doesn’t matter.” The boy slumps to the ground on his side, still clutching the broken pieces of his beloved dog. His voice grows soft as he shivers with sobs. “She’s d-dead. My dog is d-dead.”\n Meanwhile, Wazoo keeps circling overhead, making that new sound as he passes.\n Bzzzzeeeeeekkk.\n Bzzzzeeeeeekkk.\n Bzzzzeeeeeekkk.\n People say the world would be a dark and awful place without the Nylon Knights around to keep it bright. Seeing them ride into town the next morning atop their handsome steeds, I believe it.\n The seven men and women ride tall in the saddle, clad in gleaming white plastic armor from head to toe. The long lances they carry are just as perfectly white, and so are the saddles they sit on. Proud and strong, the Knights stare straight ahead, fixed on their mission with unwavering focus.\n Their legendary horses are just as impressive. Their long green bodies clamber down the street, perfectly balanced and nimble on slender legs, though they hardly look sturdy enough to carry the weight of armored riders. With spiny forelegs always folded, they look like they’re constantly begging or praying—though the truth is, those legs can swing and clamp suddenly in time of battle.\n Who could resist running over to touch such beautiful animals? Not me. Along with a dozen other young Playtimers, I hurry over on the way to the Funsembly Line and pet the bright green hide of the closest horse. The hide is one of the nicest things I’ve ever touched, studded with points and bumps and jagged burrs that prick my skin and draw blood. It feels so good, I could gladly pet it for the rest of the day, if I had time.\n HSSSSS. As the horse whinnies, its triangular head spins around, and its big green eyes look my way. HSSSKLAK.\n “They’re so pretty!” Incompleta is beside me, stroking the leafy green folds of the horse’s wing. “I wish I had a pony like this!”\n “Is there any animal you don’t want?” I ask her.\n “A giraffe, maybe,” she tells me. “Too many fangs and too much venom, you know?”\n Just then, the knight spurs the horse, and it trots out of reach. We move on to the next in line, which turns out to have an even nicer hide. Two strokes along its leg, and my hand is speckled with blood.\n Impetuous as ever, Incompleta shouts up at the Nylon Knight. “Why are you here? Is it because of the dog killer?”\n The Knight, a woman, judging from the cut of its armor, glances down at us. Two eyes glow bright red from the darkness under her visor—and then a third glows bright yellow between them. “Curfew begins now.” Her voice is a droning monotone. “Proceed to your Playhouse and lock yourselves inside until further notice.”\n “Do you know who’s taking and killing the pets?” asks Incompleta. “Do you know where to find him?”\n “Information later,” says the Knight. “Curfew begins now.” With that, she spurs her horse, which rears up and whinnies before galloping off with the rest of the team.\n HSSSSS. HSSSKLAK.\n Incompleta sighs. “I want a pony more than ever now.”\n “Have you ever thought of becoming a Nylon Knight?” I ask as Wazoo scuttles up between us. “Then you’d get a pony for sure.”\n “Only if I get to keep Lovebite.” She pats her shoulder, and the long red kitten crawls up her back from under her shirt and wraps itself around her head like a multi-legged, segmented turban. “And a dog like Wazoo, of course. And maybe a giraffe, after all. Wearing a Knight’s super-hard plastic armor would make its poisonous fangs easier to deal with, wouldn’t it?”\n There’s no law against leaving Playtime early because who would want to? The Funsembly Line is just what the name says—funto the max.\n But today, for the first time in my life, leaving early is exactly what I do. I leave three hours early, believe it or not.\n And it’s all because of Incompleta and her cat.\n “Beneathy! You’ve got to help me!” She dashes into the room in a frantic state, eyes wide and hair wild. “Lovebite is gone!”\n I admit, I’m annoyed at the interruption. The screamer on the belt is in peak shriek, and I’ve got a fired-up Joy Stick with his name on it. “Gone?”\n “She slipped away somehow!” Incompleta grabs my sleeve. “I was busy playing and only just noticed.”\n “Where could she have gone?”\n “Anywhere! You know how cats are!” She shakes my arm roughly, oblivious to all the Playtimers who are staring our way. “Please, Beneathy! Help me find her!”\n The screamer’s going berserk. I have to finish him ASAP or someone else will get to have all the fun. “She’s probably just somewhere in the Playhouse.”\n “She’s not,” snaps Incompleta. “I’ve looked everywhere. She has to be outside. Maybe she sneaked out through a vent or a crack or something.”\n “I’m sure she’s fine.” I shrug off her hand and turn back to the screamer, raising the Joy Stick over his already-flaming navel. “Cats can take care of themselves pretty well.”\n That’s the last straw for Incompleta. With a loud grunt, she knocks the stick from my hand, seizes my arm, and drags me away from the Funsembly Line.\n I try to pull away, but she’s got a firm grip. Other Playtimers look like they think about helping me, but none of them do.\n When we get to the doorway, I grab hold of the jamb and fight, determined to stay put. She responds by swinging me around against the wall and getting up in my face.\n “What if it was your pet who was missing?” Even as she hisses out the words, Wazoo scurries around us, bumping our legs and barking. “Would you do nothing and just hope he came back?”\n K-klak klik buzzzz klak klik.\n Wazoo’s barks change my mind. So does the memory of the kid from the clearing the night before, the one crying over the broken corpse of the dog called Gilgamog.\n Incompleta is right.\n I shake my head and stop fighting. “Can somebody cover for me? I need to go look for a cat.”\n “Sure!” Caustico’s only too happy to take my place. “But I don’t think the Nylon Knights make exceptions to the curfew for cat-finders.”\n “Here, Kitty Kitty!” calls Incompleta as we wander the forest of Beastbless. “Come to Mama, little Lovebite!”\n The noise makes me nervous. I keep looking around, worried that the Nylon Knights might hear and punish us for breaking curfew . . . or worse, that the pet killer might decide to kill something other than pets. Sneaking out of the Playhouse might not have been the smartest move we’ve ever made.\n Though of course I want to find Lovebite, too. I can’t stand the thought of any pet owner, especially a fellow Playtimer, going without the sweet companion that makes life worth living.\n “Lovebite!” My calls aren’t as loud, but at least I bring another helper to the search. Antennae wiggling, Wazoo crashes through the brush by my side, snuffling at the vegetation with his bristly proboscis. If there’s one thing a dog’s good at, it’s hunting down a cat.\n “Where is she?” Incompleta stomps her foot in frustration. “We keep getting farther from the Playhouse, and there’s still no sign of her!”\n “Chasing a mouse, probably. Cats can’t resist the claws and stingers on those things.” I push through a patch of waist-high weeds, but nothing jumps out at me. Nothing much interests Wazoo, either.\n “What if the killer got her?” Incompleta sounds panicky, and her eyes well up with tears. “What if the reason she’s not coming to me is that she’s dead?”\n “I’ll bet she’s fine. Cats have nine lives, don’t they?” I smile her way with a confidence I don’t really feel.\n But it’s hard to keep up a good front as we search further without success. Either Lovebite’s a great hider, a fast traveler, or something’s happened to her—an accident or attack by another animal, if not the pet killer.\n Suddenly, though, Incompleta gets excited. She ducks down at the base of a big tree and picks up a bloody mass of fluff and feathers.\n “Look, Beneathy! I’d recognize this dead goldfish anywhere! It’s the work of my sweet little Lovebite!”\n Just then, we hear a loud animal cry from nearby, followed by the sound of thrashing through the brush, moving rapidly away.\n Without a word or hesitation, Incompleta leaps up and bolts away in the direction of the thrashing. I’m about to race off after her when I have a sudden change of plan.\n K-klak klik buzzzz klak klik.\n Barking his head off, Wazoo charges in the opposite direction, running so hard that he snaps his leash. Whatever he’s after, I can’t see or even hear it.\n But what if he’s heading into danger?\n I hesitate for an instant, looking one way and then the other. Wazoo and Incompleta might both need my help. Which one do I go after?\n Bzzzzeeeeeekkk.\n As soon as I hear that sound, the one Wazoo made at the scene of the other dog’s murder, my mind is made up. I run after him as fast as I can, leaving Incompleta to her own devices.\n Bzzzzeeeeeekkk.\n But as I run, and Wazoo keeps making those sounds, I wish I’d brought a Joy Stick from the Playhouse or something else I could use as a weapon. I’m just so used to a world where pets aren’t killed, and the only Playtime happens on the Funsembly Line, I didn’t even think about it.\n Bzzzzeeeeeekkk.\n Bzzzzeeeeeekkk.\n Bzzzzeeeeeekkk.\n But I’m thinking about it now. As I burst into a thicket of trees and see Wazoo face-to-face with some kind of monster, I’m thinking about it hard.\n Because the monster, with its four legs, long tail, and mottled brown and black fur, is crouching, baring its gleaming white fangs, and making a noise deep in its throat that can mean only one thing.\n Grrrrrrrrrrr.\n And that one thing is Playtime, monster style.\n Ears flattened back against its head, the monster snaps its jaws and lets loose an unholy howl.\n Raarrrr.\n My heart’s pounding, my hands are shaking—but Wazoo is unfazed. Fanning out his black wings, he roars at the monster with more menace than I’ve ever seen him muster.\n SCREEE KLAK EEEE AAARRKK.\n The monster lunges, snapping and howling with wild ferocity.\n RAARRRR RARRRR RARRRRR.\n Instead of backing down, Wazoo lunges at the monster, spraying green gas from one nozzle and black from another. The monster lurches back, coughing and shaking its head hard.\n Wazoo presses the attack, unleashing more plumes of gas. His opponent coughs harder than ever and stumbles back on shaky legs, his savagery flagging.\n Just as I cheer in my heart, however, things suddenly change. Loud, heavy footfalls pound toward us, accompanied by violent thrashing. Another monster explodes into the thicket, much bigger than the first—a four-legged beast taller than I am, with glossy black hair and a long face with a bone-white stripe down the middle. Before Wazoo can direct any sprays in its direction, this monster whips around and lashes out with its two hind legs, blasting a brutal kick in his direction.\n The new monster’s feet land with such force that they propel Wazoo across the thicket into a tree trunk. He slams into the wood and bounces off, dropping into a patch of weeds where he lies motionless on his back, leaking multicolored gases from his nozzles.\n “Wazoo!” I start to run to him, but I don’t get far. The bigger, black-haired monster lumbers between us, blocking the way.\n And then it gets worse. More monsters straggle in from all sides of the thicket, closer in size to the first—each covered in fur of a different color yet essentially the same type of creature as the first monster to attack. They all have similar shapes, with stubby snouts, black noses, and tails . . . and they all make the same noise in their throats as they converge around me.\n Grrrrrrrrrrr.\n I look around frantically for a way out or a weapon but find neither. I’m trapped and helpless in the midst of monsters who might have just killedmy faithful companion.\n Grrrrrrrrrrr.\n The biggest monster with the bone-white face backs out of the way as the other monsters come closer. They let him through, concerned only with me.\n “Go away!” I try to sound tough. “Get out of here! Leave me alone!”\n It doesn’t work. The ring of monsters tightens.\n “I said go!” I start to realize this might be it, the end, and I wonder: is this what happened to the missing and murdered pets?\n Suddenly, then, I hear an unexpected sound—a whistle. The kind of whistle only a human being can make.\n And then a voice. The voice of a boy my age or not much older.\n “So tell me.” When the boy steps into the thicket, I see he has long blond hair and bright blue eyes. His clothes are very brown, very dirty, or both, and his face and hands are caked with grime. “Should I call off the dogs, or let ’em have you?”\n I stare at the growling monsters arrayed around me. “Those aren’t dogs,” I tell him, though I know I shouldn’t talk back, given the circumstances. “I have a dog.”\n The new boy chuckles. “No offense, kid, but you’re barking up the wrong damn tree.”\n The boy, who says his name is Joe, leads me off through the forest with the monsters in tow. If I try to get away, he warns me, the monsters—which he insists on calling “dogs” and a “horse”—will run me down, and I might get hurt.\n But otherwise, he promises, hurting me is the last thing he wants to do.\n “Then what do you want to do to me?” I ask him.\n “I want to tell you the truth,” says Joe. “Though, to be honest, that might hurt a little bit, too.”\n We walk for what seems like a very long time, weaving between trees and through brush. I keep looking around, hoping I’ll see Wazoo zooming to the rescue with nozzles fuming . . . but all I see are sharks flitting around, chirping, and flapping their colorful, feathered wings. The sight of them with their pointy little beaks makes me shiver, the way sharks always do.\n When we come to a little stream, the “dogs” and “horse” stop to drink, their pink tongues lapping up the trickling water amid sunbeams cast down through the treetops. It’s sickening; everyone knows dogs only get their moisture by sipping it from the bodies of dead things.\n “You’ve never spent time with real animals, have you?” Joe runs his hand along the side of the “horse,” stroking its glossy black hair. “I’ll bet you’ve never even touched one, have you?”\n “You don’t know what you’re talking about.” I know I’m scowling, but I can’t help it. I hate him and all his monsters.\n “Or maybe you’re the one who doesn’t truly understand.” Joe reaches down, and a big “dog” with shaggy golden fur trots over and licks his fingers.\n Watching that happen makes my stomach churn. I think I might throw up—but not yet.\n Smiling, Joe pats the beast’s head, and the “dog’s” tail flicks quickly from side to side. “It’s not your fault,” he tells me. “All you know is what you were taught.”\n “You don’t know anything.”\n “But that’s all right.” Joe whistles, and the “dogs” and “horse” stop drinking and start across the stream. “You really can teach an old dog new tricks, my friend.”\n After a while, we come to an ancient cabin at the base of a tree-lined hillside, which seems to be our destination. The “dogs” run barking to the decrepit front door, and the “horse” ambles over to a rickety water trough for a drink.\n “Welcome to camp.” Joe claps a hand on my shoulder and leads me toward the ramshackle little building. “Or as I like to call it, Home-for-Now.”\n The front door opens, and a tall old man looks out from a cloud of wispy white hair. The “dogs” go crazy, jumping on their hind legs and pawing at his torso and chest. “Good boys,” he tells them. “Good dogs.”\n “Hey Grampa!” shouts Joe. “Look what I found!”\n “Oh, Joe.” Grampa wags his head. “What have I told you about bringing home strays?”\n “But he doesn’t know what a real dog is,” says Joe. “He doesn’t know about the old days.”\n Grampa eases his way out the door, feeding the jumping “dogs” with chips of black jerky from the pockets of his tattered denim overalls. “He’s probably better off that way. The truth hurts.”\n “I already told him about that.” Joe guides me forward. “Maybe he can take it.”\n Eyes narrowed, Grampa stoops and meets my gaze. “The others won’t like it when they get back from the hunt. They’ll say you shouldn’t have brought him here.”\n “But isn’t this why we’re doing it?” asks Joe. “For people like him?”\n “Doing what?” I frown. “Who are the others, and what are they hunting?”\n Grampa shakes his head. “You remember what happened to the last one you brought in?” He isn’t speaking to me.\n Joe sighs in frustration. “Just tell him. Please?”\n I’ve never had anyone stare at me as hard as Grampa does then. He makes me so uncomfortable; I squirm and want to run away.\n Reaching into his pocket, he pulls out a two-inch-long strip of jerky. “Take it.” When I don’t reach for it, he grabs my hand and presses the jerky into my palm. “Now give it to him.” He gestures at one of the “dogs”—a little white-and-tan furred one with pointy ears, short legs, and big green eyes. “His name is Stubby.”\n Stubby scampers toward me, licking his lips. Heart pounding, I jump back and drop the jerky. Stubby gobbles it up and gazes at me, clearly hoping for more.\n “Congratulations,” says Grampa. “You just fed an actual dog.”\n Stubby hops up and sniffs my fingers. I wipe them on my pants to try to shed the smell of the jerky, but then he just sniffs and licks my pants.\n “Those other things,” says Grampa. “The ones you and everyone else think of as dogs—they aren’t.” He walks back to the cabin and returns a moment later with a white plastic bag. It crinkles as he opens it and reaches inside. “This isn’t a dog.”\n He pulls something out of the bag, and my blood turns icy cold. I back away when he holds it up to me, stopped only by Joe when he clamps a hand on my shoulder.\n “This is a bug.”\n Grampa is wrong. I don’t care what he says. The thing in his hand is nothing like a bug.\n It’s a dog, a true dog, just like Wazoo, complete with a black proboscis, a shiny black shell that opens up into wings, and bulbous eyes with hundreds of facets for popping out the silver needles that are a boy’s best friend.\n But for once, a dog like this isn’t a welcome sight. Thisone isn’t moving. It doesn’t make even the slightest twitch, and the reason is clear.\n Its body has a gaping hole in it.\n “It’s dead.” A thought occurs to me, and I feel sicker than ever. “You killed it, didn’t you?”\n Grampa doesn’t answer my question. “If you tell enough people this is a dog, they accept that it’s a dog.” Black bits of the dead dog trickle out as he shakes it emphatically. “They forget what a real dog is like. Or a cat, or a horse. Or a life. They forget that things could be different. Better.”\n Grampa tosses the dead dog aside and marches over to grab my arm. He grips it so hard that it hurts.\n “But some of us remember. And we tend the packs and tell the stories and wait for the day when the better things replace the ugly ones.”\n “Because you killthem!” I twist free of Grampa’s grip. Joe makes a grab for me, and I push him away. “That’s what you do, isn’t it? You’re the ones who’ve been killing the pets!”\n “They aren’t pets,” says Grampa. “They’re monsters. They’re controlling you, and you don’t even know it.”\n “Did you kill my dog, too? Did you kill Wazoo?”\n Grampa stands there, glaring, and shakes his head. “His indoctrination is deep, isn’t it?” Again, he’s talking to Joe, not me. “I don’t know if we can ever get through to him.”\n “That’s what you used to say about me, too,” says Joe.\n “That’s true.” Grampa’s features soften. “Maybe you’re right.”\n “We should take a break, don’t you think?” says Joe.\n “Sure.” Grampa turns and heads for the cabin. He pulls jerky out of his pocket, and the “dogs” come running. “We’ll pick it up later.”\n But as I watch him go, taking a break is the last thing on my mind. If these people killed Wazoo, or even Lovebite, I will never see things their way. I will never forgive them.\n And I will never let go of the life and world I know.\n “Come on,” says Joe. “Let’s go play with the puppies.”\n “Play? Like on the Funsembly Line?” It doesn’t make sense. “But I don’t have a Joy Stickor Plaything. I don’t even have a man opener.”\n “Don’t worry.” Joe walks off, gesturing for me to come with him. “Different kind of play.”\n Joe and I hike to a nearby field, followed by a dozen “dogs.” The afternoon sun shines bright on the tall grass waving in the warm breeze.\n None of which improves my mood a bit. I don’t see how anything could, as long as I’m with one of the people who for all I know might have done something terrible to Wazoo.\n Seemingly oblivious to how I’m feeling, Joe scouts through the grass, looking for something. “Have you ever played fetch?” he asks.\n “With my dog, a real dog, yes.” I stay close to the tree line, hoping for a chance to slip away.\n Joe sees something and ducks down to retrieve it. “Well, that’s what we’re going to play.” He resurfaces with a stick in his hand, fairly straight and about two feet long. “I’ll make the first throw, and you can take the one after that.”\n When he whistles, the “dogs” fling themselves in front of him, jumping around and making noise.\n Rarrrr Rarrr Rarrr Rarrrr Rarrrr.\n “Fetch!” When he gives the stick a throw, the “dogs” scramble after it, churning pell-mell across the field. One of them, a big white “dog” with black spots and floppy black ears, scoops it away from another “dog” (a little one with gray fur and a pushed-in face) and runs it back to Joe with a spring in his step.\n “Good boy! Good boy!” Joe scratches behind the “dog’s” ears and takes the stick. As he reels it up and back for another throw, the spotted “dog” jumps around crazily, never taking his eyes off the thing. As soon as Jack heaves it, the “dog” bolts off after it, joined by several others.\n “You ready?” Joe shouts in my direction. “Want to give it a shot?\n “That isn’t fetch,” I tell him. “Not enough fire.”\n “There’s no fire in real fetch.” When Joe gets the stick back, he throws it my way. “Now you try.”\n Instinctively, I catch it, but I’m flustered when the “dogs” come bounding after it.\n Rarrr Rarrr Rarrr Rarrr.\n “Just throw it!” shouts Joe. “As far as you can, so they get a good run!”\n I hesitate, and the “dogs” press closer. When the spotted one jumps up, grazing my chest with a paw, it’s enough to make me panic and pitch the stick with a sudden burst of strength. It spins across the field, taking the pack of “dogs” with it, and the stress they make me feel.\n But the relief doesn’t last long. Seconds later, the spotted “dog” hurtles back through the grass with the stick in its mouth, heading straight for me.\n “Thank him and do it again!” says Joe. “Tell him what a good boy he is and give him another throw!”\n Taking a slobbered-on piece of wood from the mouth of a drooling monster and possible killer of real dogs is the last thing I want to do right now. I know I should play along, but I flinch when the beast pushes the stick at me. I turn away, and he follows, persistent.\n “Just do it! Just throw it!” Joe laughs. “He won’t hurt you, I promise!”\n As I turn away again, the other “dogs” barrel up and hurl themselves at me, leaping with jaws open to seize the stick. I let it go as I fall under the weight of them, unable to stop from toppling into the grass.\n My heart hammers, and I’m short of breath when I hit. It’s like something out of a nightmare as the pack of “dogs” converge around me, all fur and teeth and lolling pink tongues.\n It only gets worse from there. One “dog” licks my face, dragging its tongue over my cheek, and I want to scream. Then another licks my face as well, and another.\n And another. Stubby, the pointy-eared, short-legged one, licks my face with as much enthusiasm as he licked my jerky-scented fingers earlier.\n I close my eyes, toss my head, and thrash on the ground, but it doesn’t seem to help. The licking continues, three and four tongues at a time slathering my cheeks and nose and ears and mouth.\n And then the truly unexpected happens. Against my will, against my better judgment, I start to giggle. Something about the combined action of those tongues on my face makes me squirm and laugh uncontrollably.\n I reach up to bat away the monsters, and my hands come in contact with fur. I want to pull away, but I’m surprised at the feel of it; I’ve always been taught it’s rough and prickly, but it’s not. Something about it makes me want to keep touching it, running my hand over it just to feel the smooth texture.\n “Are you okay?” Joe’s standing over me, holding the fetch stick.\n “This fur.” I run my hands over Stubby’s shaggy white-and-tan coat. “It isn’t soft at all.”\n “Sure it is. It’s very soft.”\n “Soft means it hurts my hands.” I pet the “dog” some more, amazed. “This is the opposite of soft.”\n Joe nods and smiles. Maybe he understands. “Whatever you want to call it, ’Neath.”\n I frown up at him, still petting the monster. “My name is Beneathy.”\n “Well, now you have a nickname,” says Joe. “I like ’Neath better, don’t you?”\n Just then, something crashes through the grass across the field, and Stubby yaps and scampers off. Joe quickly helps me up, and we look toward the commotion.\n Five camouflage-wearing men riding “horses” are coming our way, looking grim. The “dogs” dart among them, tails wagging, calling out.\n Rarrr Rarrr Rarrr.\n “Hi, Mike!” Joe waves. “How was the hunt this time?”\n The man at the front of the group—a broad-shouldered, middle-aged man with curly black hair and a bushy beard—just scowls and points at me. “Who the hell is that?”\n “A new friend,” says Joe. “His name is—”\n Suddenly, a loud, blaring noise erupts from beyond the field, a single squawk like the blast of some kind of horn. Everyone looks in the direction of the sound, which is also the direction of camp.\n Without another word, Mike kicks the sides of his “horse,” and it bolts off toward camp at a fast gallop. The other four riders and “horses” follow just as fast, whipping past us with a flurry of “dogs” in their wake.\n Joe sprints after them full-tilt, and I run beside him. “What’s happening? What was that sound?”\n “Grampa was calling for help,” says Joe. “Camp is under attack.”\n As Joe and I race into camp on foot, the battle is already underway. The “horse”-riding hunters fire away with pistols and rifles, the woods booming with shot after shot.\n All of which bounce off the gleaming white armor of the Nylon Knights without leaving a mark.\n The Knights’ weapons are much more effective. I see a male Knight spear a hunter’s chest with a long white lance, driving its sharp point through his ribs and out his back, soaked with crimson. Another Knight’s great green horse unfolds a spiny foreleg and swings it out to clamp the throat of a hunter, unleashing gushers of blood.\n “Grampa!” Joe runs for the cabin, dodging Knights’ horses and hunters’ “horses” all around. Stubby scurries after him, too low to the ground to go very fast—or get out of the way of the hunter and wounded “horse” that suddenly topple toward him.\n Without thinking, I dash over, grab Stubby by the scruff of his neck, and dive out from under the hunter and “horse.” They slam down hard, just missing us as we roll under the wooden trough where Joe’s “horse” drank water earlier.\n Stubby whines as I keep him tucked under my arm and watch the battle rage from our hiding place. I feel his muscles twitch, but I don’t let go. Maybe he wants to run to Joe, but I don’t think he’ll last long in the midst of that fight.\n Not that the hunters are much of a match for the Knights. Soon, only two men in camouflage ride the battlefield amid the seven pristine Knights in white armor.\n Suddenly, though, another player joins the fray. “Bastards!” From the doorway of the cabin, Grampa blasts away with a shotgun. “Rot in Hell!”\n One of his shots hits a horse in its bulging green eye, and its head explodes. The horse goes down hard, throwing its rider to the ground without his lance.\n Grampa’s next shot isn’t as lucky. It goes right between the pair of Knights who charge him with lances aimed directly at his chest.\n They penetrate his chest from either side. Grampa drops the shotgun, and his eyes roll up in his head. He dangles like a meat puppet from the lances, held erect only by their crimson-dripping points.\n Meanwhile, the pack of “dogs” attacks the Knight who lost his horse, lunging and snapping furiously. Their teeth have no chance of piercing the white armor, but they keep him pinned down, flailing at them with his barb-knuckled gauntlets.\n He doesn’t stay down for long, though. Just as one of the “dogs” pounces, knocking him over on his back, a winged figure bursts from the woods, heading straight for them and making a familiar sound.\n K-klak klik buzzzz klak klik.\n “Wazoo!” My heart jumps with excitement at the sound and sight of him—the realization that he isn’t dead after all. He was only wounded and managed to recover from his injuries in time to come to the rescue.\n K-klak klik buzzzz klak klik.\n Swooping down at the “dogs,” Wazoo unleashes black gas from one of his nozzles. Plumes of it swirl around the monsters, making them cough and retch and stagger off with their tails between their legs.\n The Knight coughs, too, but he doesn’t let it stop him from clambering to his feet and running back to help his comrades.\n At this point, the outcome of the battle is no longer in doubt. The Knights surround the last two hunters, whose guns have stopped working. It won’t be long until the circle of lances pointing at them moves inward, ending the fight.\n In other words, I’m about to be rescued.\n So why do I stay hidden under the trough? Wazoo buzzes around camp, spraying monsters with more of his black gas. I should be running to him.\n But I’m not.\n Stubby’s body is warm against me. His fur feels good between my fingers. Something about him makes me want to hold on to him.\n But my loyal dog, my precious Wazoo, is right there, awaiting what will surely be a joyous reunion with me. I can just imagine how wonderful it will feel to have his needles pierce my nose again, to smell his voice in my mind after so long apart.\n So why am I thinking about sneaking away from him, crawling off into the forest with Stubby? Has this monster cast a spell on me?\n I look at Stubby, and he looks back at me with wide, green eyes. For reasons unknown, he leans toward me and licks my nose with his wet, pink tongue.\n For reasons unknown, I let him.\n K-klak klik buzzzz klak klik.\n Then, I watch Wazoo flying past, and I realize something.\n I don’t want to give up either of them. Perhaps, there’s a way I won’t have to.\n People say winning isn’t everything. But right now, it’s all I can think about.\n A few days ago, hiding under a trough at the hunters’ camp in the woods, I wasn’t sure what the future would bring. Now here I am, standing in front of thousands of people in Beastbless Stadium, waiting to hear if my greatest dream is about to come true.\n Dozens of other Playtimers and their pets are lined up beside me on the artificial turf field, likewise waiting for the verdict. Do any of them want this as much as I do? It doesn’t seem possible.\n But winning does. The pet I have at my side is so wonderful in every way. He did so magnificently well in every event, I can’t imagine him not winning.\n But if he doesn’t, it won’t be the end of the world. What I went through at the camp prepared me for any adversity—even as it increased my chances of winning. Our chances.\n “And now, the moment we’ve all been waiting for!” The female announcer’s voice booms through the stadium PA system, drowning out the excited chatter from the stands. “The naming of the grand prize in this year’s fabulous Pet Pageant!”\n I take a deep breath to steady my nerves. Incompleta, who’s sitting down in front, blows me a kiss for luck. Lovebite, who eventually came back to her that day in the woods, twines her segmented scarlet body around her head and neck, antennae twitching.\n A drumroll begins as the announcer keeps talking. “This year’s Doggiest Dogaroonie is . . . ”\n The tension in the stadium reaches its absolute peak . . . but I suddenly feel calm. Closing my eyes, I whisper my pet’s name.\n And then the announcer says it, too. “ . . . Wazoo!”\n The crowd roars and cheers. The other pet owners on the field slump with disappointment.\n As for me, I turn to my dog and pat him on his furry head, right between his pointy little ears. “Good boy, Wazoo! You did it!”\n Wazoo’s bristly proboscis twitches. He fidgets, unable to take a victory flight to mark the occasion.\n That’s because Stubby’s white-and-tan fur, which is clipped to his body, keeps him from deploying his wings.\n It’s a small price to pay, though. I’m convinced that fur is what clinched Wazoo’s winning the prize today. It made him unique, the best of both worlds—dog and monster, united.\n Because of that fur, I am able to walk the perimeter of the field proudly with Wazoo and Stubby both by my side, in their own ways. And as we finish that victory lap and climb the Hill of Buddies in the middle of the field—all those hundreds of bodies processed during Playtime throughout the year, including the hunters and Grampa and Joe from the camp—I feel like I owe Wazoo and Stubby a debt of gratitude I can never truly repay.\n So when I stand atop that hill, and the crowd continues to roar around me like the ocean, I give those two dogs—one real and one fake—the best tribute I can think of. I raise my arms overhead and cry out in the only languages they might appreciate.\n Rarrr Rarrr Rarrr Rarrr.\n K-klak klik buzzzz klak klik.\n Though the meaning of what I’ve just said is forever lost to me, not that it truly matters or ever will.\n Robert Jeschonek is a USA Today-bestselling author whose fiction has been published around the world. His stories have appeared in Galaxy’s Edge, StarShipSofa, Pulphouse, Escape Pod, and other publications. He has written official Star Trek and Doctor Who fiction and has scripted comics for DC and AHOY. His young adult slipstream novel, My Favorite Band Does Not Exist, won the Forward National Literature Award and was named one of Booklist’s Top Ten First Novels for Youth. He also won an International Book Award, a Scribe Award for Best Original Novel, and the grand prize in Pocket Books’ Strange New Worlds contest."}