{"fingerprint": "iFYTKZZXF+g9Z+wKFu48QQlDBmE=", "sitename": "Clarkesworld Magazine", "title": "The Secret in the House of Smiles by Paul Jessup", "author": "Paul Jessup", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jessup_06_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Secret in the House of Smiles by Paul Jessup", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3220 words, short story\n The Secret in the House of Smiles\n Jack cut up pictures of girls with thin razors and then glued the most pleasing body parts together onto a single white sheet of paper.\n A leg, snip; an arm, snip. Eyes, snip. Perfect hair, snip.\n And then the assemblage. Glue spread across the floor and the sound of glossy pages being stuck and unstuck together. Like Velcro and leather.\n The trance was finally broken when the door burst open, slamming against the fragile dormitory walls. Jack jumped but did not stop. Snip, snip, snip. Stick, stick, stick.\n Standing in the doorway was Alice in a black dress and green striped stockings. She had her bookbag slung over her shoulder. “Hey hot stuff. Want to go vampire hunting with me? I’ve got a good one.”\n Jack did not turn. Did not move. His body was still, rock still, stone still. Meditation. Concentration. The last sorcerer’s apprentice. He had to reverse it, to change it back to what it once was.\n Alice looked down and saw what Jack was doing. “This again?”\n Alice sat down on the floor next to him Indian style, draping her arms across his shoulders. She felt his bones beneath his shirt, his skin hot and sweaty against hers. Jack did not respond. He had found a page with the perfect waist.\n She walked over to his dorm window and looked at the campus outside. It looked cold. Night. The pathways between buildings were covered in a quilt of red and brown leaves, illuminated by the sparse golden light of the streetlamps.\n Alice sat on his bed. Jack liked seeing her on his bed. Her body accented against the green blanket.Her stockings almost matched. Jack screamed. Alice jumped in surprise. He spit, he swore. He pushed the glossy pages across the floor. Kicked the half-finished girls in anger, destroying all his work. “It’s no good, it’s no good,” he said, “I can’t do it. I shouldn’t have performed that magic trick. It was all wrong.. Now pieces are missing. Gone.”\n He looked up at Alice, her staring back. “Come on,” she said, “Let’s go and do something else. I hate it when you get like this.”\n Alice picked up the phone, the music of the dialtone singing in her ears. It was time to make a call, time to get Jack out of the dorm room and do something important, something worthwhile. Some vampire hunting would do them all some good.\n The walls were red brick and coated with posters. One advertised a local illusionist who was performing for the student government. He wore a top hat and cape, and a waxed moustache that curled to either side of his head like a cartoon villain. In the distance they heard the showers, splashing and laughter.\n Jack looked at the wall and grabbed a poster. It was a girl in a bunny costume, holding up two connected brass rings. A simple trick. “Her ears! Her ears! I feel like I’m back on top again. I can almost see her in my mind—moving in and out of vision like a pale ghost. I have to cut off these ears. They are her perfect ears.”\n Jack rubbed his stale glue laced hands together. It sounded like sandpaper grating. “It will only take a second. Just let me cut off her ears and shove them into my pocket. Come on pretty please, come on.”\n Alice tossed the poster to the ground and glanced up and down the hallways. No one was here. This didn’t feel right. “Hurry up,” she said, “Before someone sees us.”\n Eagerly Jack reached down, pulled out his razor. Snip, snip, a perfect ear for his pocket. Shaped like a conch shell.\n “Ok, let’s go.”\n They walked briskly down the hall, their footsteps echoing to the sound of the rushing water and bathing.\n Jenny sat on a large orange beanbag chair, her legs crossed and her eyes staring at a large flat screen television she had on the facing wall. A circus show. With artistic clowns prancing about and bemoaning on the nature of existentialism. One threw a pie at the other, and proclaimed all actions absurd.\n Jenny wore a dirty purple shirt, stained with ketchup and grease. Her hair was piled up above her head and tied in place with twine and wilted flowers. She wasn’t wearing any pants. Just panties and bare legs riddled with shaving scars. She nodded as they walked in. “Some fucked up sideshow,” she said, “Have a seat and watch it with me. They’re going to bring out the freaks next. My favorite part is when the geek cuts the Siamese twins in half. It’s akick.”\n They all sat on the floor, facing the large screen television. Alice saw the fridge over in the corner, pushed up against the wall. It opened from the top, like a trap door to a stage. She heard it humming from across the room.\n Jenny put her arm around Jack. Her skin was corpse cold, white and pale against his sprayon-tan skin, but she was not the true queen.\n “Hey, sweetie. Want to do me a favor?”\n Jack laughed, nervously. “Sure,” he said, pushing her arm away and standing up abruptly.\n “Go and get me a beer from the fridge. And maybe take out a pizza and put it into a microwave. You guys hungry? Thirsty? Want a beer or something?”\n They all grumbled sure, yeah, of course.\n “Good idea,” Jenny said, “And Alice—stop looking at my legs. Got it? These are not for you. I’ve already told you that you’re not my type.”\n Alice laughed a tittering hee hee hee laugh as on the verge of mania. She watched as Jack walked over the fridge. He wore a long yellow raincoat. Alice thought he looked ridiculous. Like a giant bumblebee detective.\n The televised twins howled, and there was a sound of tearing meat. “Oh,” Jenny said, “This is my favorite part. It always gets me hot. Watching them tear these girls apart. Damn. I am so horny.”\n Alice turned her face from the television and looked directly at Jenny, keeping her eyes on Jenny’s round and acne scarred face. “Did I ever tell you my major?”\n Jenny scoffed. “Do I even know you? You just came along with the boy. Why do you think I care about you?”\n Alice was unphased. She had done this a thousand times. “Come on,” she said, “Take a guess.”\n Jenny sighed. “I’m missing the best part. I don’t care.”\n “Just guess?”\n Jenny tried to hide her anger. “Quantum Physics? You look like a super geek.”\n Alice pointed to her nose. “Exactly. But not quite. It’s a branch of quantum physics. I’m a vampire hunter.”\n Now Jenny was interested. She turned off her television and turned her gaze to Alice. “A vampire hunter? What does that have to do with quantum physics?”\n Alice put her finger to her lip and chewed on the calluses as she spoke. “Well, it’s kind of like a vampire observer, really. See, reality is a binary state, right? You can be alive, or you can be dead. One or the other. Vampires, on the other hand, are a super position of both states. That are both and neither at the same time. Like a supernatural Schrödinger’s Cat.”\n Jenny inched in forward. “I don’t get it. So vampires are, what? Super posit wats?\n “Super position. See, in quantum computing a qbit can hold three states while a regular bit holds two. The third state is actually all states and no states at the same time. It’s kind of like the inverse of zero. Vampires are the same way—they are a qbit.”\n Now Alice was excited. She reached over and grabbed Jenny’s hands. Her eyes were red. “So, the only way you can tell what a quantum particle is, is by observing it. When you observe it then it tells you what states it is in. But it changes depending on how you observe it. Isn’t that wild? That’s why I’m a vampire observer. I perform tests to see if the state of something living could also be dead. If they are just living or just dead, then they aren’t quantum vampires. If they are living with the possibility of being dead, then they are vampires.”\n Jenny frowned. “I don’t get it.”\n Jack put a pizza into the microwave and turned it on, and tossed a beer at Jenny. Jenny quickly spun around and grabbed it. “Thanks,” she said.\n “It’s crazy, I know. But here. If I have a mirror, and I hold it up to you, and you don’t reflect I am performing a test. I am observing you, and if you have the possibility of being a vampire, then you would not have a reflection. Like this.”\n Alice held up a small makeup mirror. The glass glinted in the neon lights that flickered on the ceiling, casting its own mirror light in the room. Jen stared at it, stared through it, trying to peer into herself. No reflection. Jenny ran out of the room screaming.\n Jack hummed and rocked back and forth. Hummed like the freezer in Jenny’s apartment. He then darted beneath his bed and pulled out his little perfect pile of magazine parts and glue.\n Jack ignored Alice. She did not exist to him. She’d been trying to get his attention all day, all night, for the past month.\n He had an ear to affix. He wanted to use his special glue stick for this. It was black and white, like a magic wand. Stick, stick, stick.\n She looked at Jack, watched him drool over the perfect ear. No, she did not know why she was still with him. Maybe it was convenience?\n Jack screamed. He threw the razor against the ground and scattered the pictures. “The ear is wrong! I thought I had seen her—a glimpse. But no, fading. Fleeting. A mist. It’s gone. This trick went south.”\n He turned and looked at Alice. “There was an audience, you know? They watched the whole thing. Yet no one knew what really happened. And she was smiling the whole time.”\n Alice did her nervous laugh. Hee hee hee. “Come on Jack. You’re just worked up, is all. Take a breath, forget about it all for a moment. You need to relax a little.”\n Jack rubbed his hands together. Stuck pieces of magazine parts grinding. Arm and leg and stomach and mouth, pushing and rubbing between his hands in an orgy of glossy body parts. “I know of a secret. Hidden in the house of smiles.”\n Alice leaned forward. “Yeah? What’s that? House of Smiles?”\n Jack crawled under his bed. His head and waist disappeared under the mattress. Legs wiggled as he searched. Alice heard plastic boxes moving. More things moving. How could he be taking so long? There was barely any space underneath their beds.\n Jack scurried out form under his bed. He had a shoebox covered in a plastic bag. He removed the bag, pulling the box out. It was decorated with pictures of rabbits running and a picture of a fox stalking in the green pine trees.\n “Here,” Jack said proudly, “Here it is. Here, here, here. She smiled like a saw. Big teeth, cutting things apart. The last of the great stage performers. Queen vampire, in hidden stasis.” Jack pulled off the lid with a flourish and a tada! Inside was a diorama. Careful, tiny little pieces collected together. Hand made, hand painted. Perfect little pine trees. Perfect little cabin. With a large cartoonish smile painted on the side. And behind, bathed in a cold blue winter light was a perfect tiny freezer chest. Closed and grey.\n Excited, Jack turned over the lid. There was a map. It was a detailed map, one written by hand, with directions scrawled across it. Strange directions, turn left at the burning towers, if you’ve walked past the giant’s legs, you’ve gone too far.\n “Where is this at?” Alice asked.\n Jack pointed, moved his finger. Made humming sounds. Like a low flying plane. “Not far, not far. Just the woods outside of the University. Could walk there from here. There is a shack and all these abandoned apple trees. A whole orchard left to rot and misery. Whoever owned it must’ve left in a hurry.”\n Alice grunted. “Good.” She said, “Let’s get going then. I can collect everything we need and get going.”\n Jack shook his head, slamming the book shut. “No, not yet. We can’t go yet.”\n Now it was Alice’s turn to have a headache. She just couldn’t keep living life like this. Always on the edge of some strange madness.\n “Why not,” she asked, exhausted.\n Jack pointed at the mismatched photographs.\n “Because she is not finished yet. I have to remember her, I have to love her. Then we can go back. Then we can use the freezer.”\n Alice slouched his shoulders. Resigned. “Ok,” she said, “All right. Jackie boy, let’s construct your perfect girl, shall we? And then—then what? We go to the woods?”\n Jack pounded his fists into the floor, drumming the wood. He spoke as he drummed. “You don’t understand. Ghosts are more important than food. Ghosts are more important than anything. If you forget them they are erased. Stolen, vanished. Faceless things looking for masks in the rain. You cannot deny me this. You cannot deny her this. Ghosts are more important than vampires. Than dreams. Than water or light. And the ghosts of the saw are the hardest to please. Half finished ghosts, covered in smiles and torn apart.”\n When he stopped drumming they sat in silence for a minute. “Fuck Jackie,” Alice said, “Just tell me what to do, and I’ll do it.”\n She helped him find posters. Find magazines. She cut with him and glued with him and he was happy because he started to see her again. In the glimpse of still life, he caught her. Caught her in fleeting moments, flying and trying to escape.\n Alice didn’t know it. She could not know what Jack was looking for, who Jack was trying to piece together out of old sticky pages and glossy photos. All she knew was that there was a vampire, in the woods, one that she could observe, one that she could hunt.\n She helped Jackie-O Jack perform a bit of magic. Perform a bit of now-you-see-me, now-you-don’t. This was a special kind of magic. Backwards magic. Most magicians were in the art of taking things apart, taking things away, making them disappear and cut into tiny pieces. Not Jack—no, the Jack man had a plan. A new kind of trick. He was going to put someone back together. Reverse that saw, take the blade out and piece her back together again.\n A little bit of Now-you-don’t-see-me, Now-you-do.\n And she would be happy. She would be thankful. And she would say she forgave him, and say that he wouldn’t have to be sorry or feel guilty anymore. That was ok, what he did all those years ago. That she was happier now, better now. In a place where queens and puppets dance. And she would be whole again. Setting him free.\n They each had pockets filled with picture pieces. Photograph slices, body parts and different snatches of text that Jackie-Jack man thought would come in handy. Special words. Magic words, printed on the page but not to be spoken aloud. When spoken aloud they lose their magic.\n Out past the University. The lights and the towers dim glows behind them now. Like distant earth stars, slowly going supernova and fading out.\n Pine trees. From his dream, no—his memory. They surrounded them. Sticky, they smelled of sap. The knotted and spiny branches webbed around them, catching them. Claustrophobic. Leaves plastered to their feet with mud. In the distance they heard dogs barking in the cold and Alice shrieked.\n Jack did not care. Let Alice scream. Her screams would only echo through the air, and no one could hear them now. Not in the land of the saws. Not in the land of the dead.\n Alice reached over and held his face. Her lips were like wet pomegranates. He smelled the seeds on her. Very slowly she said—“I think we are being followed. Do you understand? We are being followed by someone. I think it is Jenny. Vampire Jenny.”\n Jack nodded, but didn’t care. He kept right on walking. Alice dragged behind him, her eyes looking out into the trees, searching and finding faces everywhere, blinking in and out of existence.\n He was laying seeds along the ground, and everyone would have to come. Follow, follow. To the house of smiles!\n Here was the place, the memory hole, the memory whole, the whole thing. The shack. Grey shack, shingles broken and smashed. Dead shack, undead shack, shack like a home brought back from the dead. Windows were holes, eyes like empty caves. Big smile painted on the side. Cheshire smile, haunted smile. Ghost smile.\n Welcome, welcome it said. Welcome to the house of smiles. Welcome to the quantum gateway, the world between binary states. Let the saws sing out the chorus of the heavens.\n Jack had a cape. Where did he get the cape from? Nobody knows but Jackie. So they laid the magazine parts down and asked him, now what? He walked over to the freezer in the back and inspected it. It hummed. He walked behind it, pulled out a saw and then approached Alice with heavy footsteps.\n Everything fit together now.\n “Open Your Pockets!” he commanded in his best magician voice.\n She opened her pockets and let the cut up pieces flutter around like butterflies, like broken and dead leaves. He opened the freezer with a flourish and a Tada! And a wave of the magic wand. Inside, inside.\n Queen of the House of Smiles. Cut up, wrapped in plastic. Each piece, each part. Crammed in. But some parts were missing. Some parts were always missing. He hated that. How could he remember her with all the parts missing? Sawed off and stolen. The trick that went south. The too sharp saw, grinning as it cut into her, and her all smiles the whole time, even in that pain, the audience applauding.\n And then her asking him—Jackie—please, put me back together again. She whispered it as she smiled, teeth together. He wanted to stop sawing, that Jackie O did—he wanted to. Keep cutting as the crowd applauded.\n The pages fluttered, stuck and unstuck. They flew over and stitched themselves onto parts, stitched everything together. The missing pieces made whole out of magazine skin and magazine eyes and magazine faces.\n In the trees faces crawled out, sat down to watch the show.\n Saw, saw, saw. The vampires applauded and Alice was all smiles. She could not stop grinning, could not stop laughing as each part of her body was removed, magazine pieces representing her waist, her eyes, her hair fluttering around her as he cut into her.\n The body rose slowly from the freezer chest tomb. The body was her. The sorcerer’s last apprentice. Dressed in plastic, the distorted clear making her even more real in the moonlight. Living, alive.\n Time to dance like half-dead cats. Presto!\n Paul Jessup has been published in many magazines, including PostScripts magazine, Fantasy Magazine, Apex Digest, Farrago's Wainscoat,Electric Velocipede, Psuedopod and the Journals of Experimental Fiction as well as many others.\n In 2009 he has two books coming out. PS Publishing will publish hiscollection of short stories, Glass Coffin Girls, as part of their PSShowcase series that will include a reprint of this short story, andApex Publishing is putting out his surrealistic space opera, Open Your Eyes."}