{"fingerprint": "81gd4bjYf1F8Jj1p//KYXCrvPyE=", "sitename": "Clarkesworld Magazine", "title": "Face Changing by Jiang Bo, translated by Andy Dudak", "author": "Jiang Bo; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jiang_06_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Face Changing by Jiang Bo, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7400 words, short story\n Face Changing\n Xu Haifeng sat down at the desk and tapped a button.\n Large screens slowly rose to surround him, like a three hundred and sixty-degree theater. All kinds of data scrolled on the screens in a never-ending torrent.\n Xu waved his hand and the screens responded, scrolls coming and going. When the capital flowchart revolved before his eyes, he raised a palm.\n The screen froze.\n A two-meter-high world map was revealed, bright lines rising from all parts of the map like ballistic trajectories, extending in various directions, of various length, finally plunging back to Earth and vanishing. North American’s lines were countless, becoming one mass of light. East Asia was much quieter, with only the occasional bright line appearing. It was midday in North America, while most of East Asia was immersed in deepest, darkest night.\n The lines also varied in thickness. The thinnest trajectory might represent just a few hundred yuan, while thicker, brighter lines could signify up to hundreds of millions.\n Hundreds of transactions a second. Biological human eyes couldn’t keep up, only watch meteor-like trajectories light up the huge map. Although this dynamic global trade monitoring map was like a beautiful e-art piece, watching for long enough must inevitably get boring, even to the point of dispirited exhaustion.\n But Xu Haifeng was not burned out—not in the slightest.\n He kept a close watch on the sparse transactions of vast, dark East Asia.\n He was waiting for a red line.\n A red line meant a rejected transaction. Amid the huge volume of transaction data, the server system could identify suspicious transactions. If after further analysis the system maintained it was illegal, the transaction was immediately rejected. Simultaneously, the Financial Crimes Office would receive an alert.\n Xu was waiting for that alert.\n Two rejections had occurred in the last fifteen minutes, but both in North America, the brief red lines flashing by—while pitch-black East Asia remained silent. The one he was waiting for had yet to come. Xu Haifeng frowned. Had the person of interest abandoned the deal for safety’s sake? Xu shook his head, quickly ruling out this suspicion.\n It was the nature of people like Huang Huali to take risks out of desperation. Tempted by twenty million US dollars, even massive risk could be ignored. Besides, given enough historical data, an individual’s behavior could be accurately modeled. Xu had the Heavenly Eye database on his side, invoking Huang Huali’s past ten years of behavioral data, and then came Wen Xin and Ante Corp’s behavioral analysis AI, producing forecasts.\n The results were unequivocal: Huang Huali would definitely make a move tonight.\n It was worth waiting to catch such a big fish. And Xu Haifeng was indeed like a fisherman, closely watching a trembling bobber, waiting for it to plunge and trigger his adrenaline.\n A green warning signal jumped into his field of view, the virtual major domo presenting an event notification.\n Now? What could it be? It was odd timing, the green signal flashing brightly, notice of something important.\n He turned on his virtual screen.\n A transaction!\n A sum of three hundred thousand US dollars had been posted to his account, but the system had rejected it.\n Xu Haifeng looked up at the big screen, vigilant, on guard. A bright red line rose from Shanghai, crossed the screen, and fell upon Beijing. There it was, the transaction with his own account.\n It was clearly abnormal. His account funds had never exceeded one hundred and fifty thousand dollars. According to the server system algorithm, three hundred thousand US dollars—nearly two million RMB—was certainly a transaction needing investigation.\n Huang Huali. The bastard’s final, desperate gambit.\n But before Xu Haifeng could fathom why his opponent had made this move, red lines lit up the screen, merging into one mass of light, a rash of illegal transactions: Guiyang, Kunming, Shanghai, Hangzhou, even smaller fourth-tier cities. It seemed people all over the country had awakened at the same time to make payments to the same account.\n All the money was coming to Xu Haifeng.\n At first, the sums were quite large and got rejected by the system. Soon the amounts grew smaller. These transfers didn’t require inspection. Such payments could directly post to his account. However, these small sums quickly added up. The balance rose sharply from one hundred and twenty thousand. In less than two minutes there was two million.\n Messages inundated his virtual screen. Xu Haifeng was shocked and scared.\n It occurred to him he’d been passive, waiting for an opportunity, while his opponent had prepared a devastating attack, a knockout blow.\n In that moment, he felt chagrined and vexed.\n Huang Hauli had been stunningly audacious, using such means to entrap him.\n Xu had greatly underestimated his opponent, and he’d been bitten. If he’d anticipated this, he could have applied directly for a warrant, then preemptively detained Huang for investigation.\n But it was too late for all that.\n The office door opened. Two robotic police stood out there, A Jia and A Yi. They’d been alerted and had come to handle the abnormality. Locate within ten minutes, arrest within twenty: this was the efficiency the financial police were so proud of. This time the suspect was inside headquarters, so the robots had arrived in under two minutes.\n “Officer Xu Haifeng, you’re under arrest,” A Jia said in a flat, synthetic voice, stepping forward. “Your actions will be restricted for twenty-four hours, until relevant investigations are complete.” This was the standard arrest declaration.\n Xu Haifeng stood up. Regarding the nature of the anomaly, the monitoring system had settled on suspicion of money laundering. Although he didn’t fear investigation whatsoever, this would cost him twenty-four hours of personal freedom.\n “My monitoring intel can’t be closed!” Xu Haifeng objected.\n “Your duties are temporarily suspended.” The robot was all business. “I will notify Chief Luo Haoyuan!”\n Xu glanced at the screen. A steady stream of money was pouring into his account, but each transaction was just a tenth of a yuan. Point one’s pulsed across the screen, every one of them like a slap in the face.\n I will catch him! Xu Haifeng vowed to himself.\n He turned and walked out of the room. A Jia and A Yi followed, in no particular hurry.\n The office lights presently dimmed.\n After the investigation, Xu Haifeng resumed his duties without issue, but his crammed-to-bursting account would remain frozen until all transactions have been identified and verified, one by one.\n The moment he returned to the office, he called Wen Xin, not even sitting down.\n The phone connected and Wen Xin’s face appeared on the screen. He was the vice president of Ante Finance, in charge of transaction security. The transaction server system was Ante’s product and they operated it. Wen Xin was also Xu Haifeng’s close friend from childhood. With such financial trickery unfolding, Wen was the one to go to.\n “What the hell is going on?” Xu Haifeng said, dispensing with pleasantries.\n Wen Xin raised a disapproving brow. “This was all arranged according to your request.”\n “My request?” Xu Haifeng almost flipped the table.\n Wen Xin perceived Xu’s anger through the vid-link and raised a hand. “Officer Xu, calm down. I’ve been waiting specifically to report this issue to you.”\n Xu Haifeng took a deep breath. “Talk!”\n “We adjusted the data settings as requested, to increase the sensitivity. That increased sensitivity had consequences. But this person really has skill, and surprisingly, he found the bugs in our system. Our test engineers don’t measure up to him. The algorithm we used is the Jacobi second-iteration method, plus the deep learning algorithm . . . ”\n Wen Xin droned on. Xu Haifeng’s frown deepened. Finally, he had to interrupt: “Mr. Wen, let’s not with the techno jargon. It’s giving me a headache. Just tell me the most important thing . . . how did he set me up like that?”\n “Well, he used a virus called Gray Shadow. This is recent software, designed specifically to harm computing clients. This Huang Huali really has skills. He used at least twenty-thousand client terminals. No simple matter.”\n Xu Haifeng struggled to control his temper. Wen Xin was good at everything, but he was long-winded. The man never stopped yapping.\n And Xu had no choice but to listen. He strove to suppress his impatience.\n “ . . . he understands our algorithm, so he used this method . . . repeated abnormal transactions with the same account . . . to raise the threshold. If the frequency of abnormal transactions on an account is too high, an alarm is triggered. This is algorithm-determined. Originally, it took a hundred abnormalities before a report to the financial police was triggered, but yesterday we set the trigger according to that request from you and yours. One abnormality was enough at that point. Once the alarm was triggered, the system was restored to initial settings. So, then standards were relatively lax, except for the anomalous account, of course. Other accounts were regulated more loosely than usual.”\n “So?”\n “So Huang Huali used our settings cunningly. He triggered the alarm. I’m guessing he used that alarm as cover for secretly transferring funds.”\n “Transferring funds? How can he do that? All his accounts are monitored.”\n “Hard to say. Since he’s able to use more than twenty thousand accounts to harass you, his real money could be hidden in normal cash flow.”\n “Don’t you guarantee all fund transactions are traceable and transparent?”\n “Yes, but we can’t be doubting and questioning normal cash flow. Nevertheless, we worked internally to check transaction records and we’ve listed several accounts that evinced suspicious behavior during the alarm trigger period. If you really want to keep going with this, you can check our list. But we mean to protect the privacy of our customers, so you’ll have to leverage the National Security Agency’s name to access our data. Let’s keep it all reasonable and legal.”\n “You’re saying ordinary accounts are under his control? Aren’t all the accounts real-named? He hacked all those accounts?”\n “Hard for us to say . . . Gray Shadow software can indeed hack many accounts. And there’s another possibility . . . ” Wen Xin smiled mysteriously, then briefly recovered his serious demeanor before laughing.\n Xu Haifeng scowled. “Oh come on man, spit it out!”\n “Well . . . we can only guarantee that each account matches with an ID in the Ministry of Public Security’s identity system.”\n Wen Xin had a point. The question became: was there a real person behind every ID? This was not a matter for a financial services company.\n “I’ll go through the formalities, you prepare the materials.”\n Wen Xin chuckled. “No worries, we’ve been friends a long time, and you have no idea how efficient we are.”\n Not in the mood to continue chatting with Wen Xin, Xu hung up.\n Only one question concerned him now: how to catch that bastard Huang Huali. Preventing his escape was paramount.\n Xu Haifeng sat staring and growing pale.\n He’d known his opponent was extraordinary but hadn’t expected him to evade the query database of the Ministry of Public Security.\n 3301272007022803XXXX.\n This ID number was familiar to Xu.\n It was Huang Huali’s, but the database search showed it to be nonexistent. The database was supposed to store all demographic data changes in the past two decades. Anyone vanishing from the query database would surely be discovered via the data verification process. The system would adjust automatically, triggering an alarm during the next backup data proofreading. And yet, somehow, in the past three days, Huang had vanished without a trace.\n Tampering with the database was certainly not something ordinary people could do. It also meant Huang Huali was going to escape.\n But without an identity, one could not survive in China. Give up your identity and you were giving up everything. It couldn’t have been easy making that great resolution, never mind actually doing it, taking the plunge.\n It would require not just careful planning, but also deep connections. It surprised Xu that Huang Huali had such capabilities.\n After sitting and stewing for a bit, Xu Haifeng leaped to his feet. A primordial instinct compelled him now. He couldn’t admit defeat.\n It was no longer possible to rely on the public security system, which couldn’t investigate a person who didn’t exist. If he reported that Huang had tampered with data, the red tape would consume several days. Xu Haifeng could not wait.\n He’d seen so many people use legal loopholes to get away with crimes, and Huang Huali was undoubtedly a skilled player. He’d already shown himself capable of tampering with identity data and using loopholes in legal procedures to buy time.\n The public security system couldn’t handle this, but Xu Haifeng reckoned he could.\n Huang Huali was in for a rude awakening.\n Xu Haifeng waited for half an hour at the Jinfeng Yaju residential gate.\n Jinfeng Yaju was an intelligent community. There were no security guards, but more than six hundred cameras fed directly into Heavenly Eye. Wandering around the community would be a dangerous move. Heavenly Eye might easily recognize you as a danger sign. Then would come the robotic police and interrogation.\n It was the same method the financial police used, but Xu was not afraid. He knew he was in a blind spot, one specially set up to facilitate police activity. He could linger here as long as he liked.\n There were few pedestrians on the road. Drivers passing by cast curious glances at the tall, lurking stranger, then hurried away. It always felt strange for a person—someone not a robot—to be active out in the open. Perhaps, in the eyes of those drivers, this big man was either stupid or a ghost. But with Heavenly Eye always watching, it didn’t pay to be nosy.\n It really was a tad embarrassing, the constant looks.\n But Xu Haifeng quickly got used to it, accepting curious gazes blankly, hoping his target would appear soon.\n He bided his time.\n A red Artes came drifting slowly toward the community entrance.\n The end-number on the plate was 1478. It was him!\n Xu Haifeng rushed out to stand in the middle of the road. The car braked hard, stopping just short of hitting Xu, lightly touching his thigh. Even the autopilot software was caught off guard by his rash and sudden roadblock.\n Streetlights illuminated the person sitting inside. It was Huang Huali alright. He wore a semitransparent hat, something like a helmet. It made him look like a motorcyclist.\n Xu Haifeng brought his fist down hard on the hood.\n The door opened, but Huang Huali did not emerge. “Get in.” His voice was cold, without a trace of fear.\n “How about you get out!” Xu Haifeng growled.\n “Do you really want to settle this in the street?” That voice was like a bucket of cold water poured on Xu Haifeng’s head.\n Obviously, the street was not the place to deal with this, or any, problem. The ubiquitous Heavenly Eye would record everything, and even though he was a financial policeman handling a case, he wouldn’t escape court inquiry. He might be imprisoned for months on abuse of power charges. It would be irresistible content for sensation-starved reporters. “Police Officer Harasses Innocent, Wealthy Businessman in the Street. What has become of the human rights guaranteed in our constitution?” It was easy to imagine the ridiculous headlines, the drumming up of outrage and incitement of busybodies.\n There were too many unknowns out here on the street, and chances to further muddy the waters.\n He repressed his anger and got in the car. The door closed.\n “They’ll think you’re an overeager friend,” Huang said casually. “No big deal, right?”\n Xu Haifeng kept his mouth shut. He was afraid that if he spoke, he would lose control of himself.\n The car rolled into the community.\n The most striking piece of furniture in Huang Huali’s place was the huge workbench by the window. There was a 3D printer on it and next to that a silver-gray laptop. Since the development of brain-computer interface systems, such notebook computers had become rare antiques. Xu Haifeng couldn’t keep his gaze off it.\n “Please.” Huang proffered a glass of red wine. Xu Haifeng, standing before spacious floor-to-ceiling windows, took the glass.\n “I don’t like red wine,” Xu said.\n “But still you took the glass.” Huang raised his own glass. “It’s the civilized thing. When two people talk over a glass of wine, it lightens the mood.”\n “Let’s just put our cards on the table, shall we? You invited me here, so I’ll be blunt. You erased your identity from the public security system. Admirable tradecraft, but you’ve committed a crime. I won’t let it go.”\n Huang Huali sipped his wine. “I’ve committed a crime, have I? What crime is that?”\n “Corruption, for starters.”\n Huang’s smile was cold. “But the victims haven’t investigated, haven’t complained. So why are you pursuing this?”\n Xu Haifeng was momentarily speechless. Huang was indeed guilty of corruption, and the victims had indeed not come forward. This case existed because the Ante Finance AI had detected abnormal transactions and launched an investigation. All financial crimes were filed this way. There was no such thing as a victim’s statement in this case.\n “You’ve endangered the public interest,” Xu retorted, his tone forceful. “Of course the financial police must safeguard the common good!”\n Huang Huali nodded. “Of course, but have you come here tonight as a police officer? I’m afraid not. If you’ve entered my home as an officer, why haven’t I seen a warrant? A badge?”\n Xu Haifeng dismissed this. “I could report you for trespassing in the public security query system and tampering with data.”\n “Yes, but who would you be reporting?”\n “You!”\n “And who am I?”\n Xu Haifeng met the gaze of his cunning opponent, not retreating, but he knew this question was a trap. Huang Huali had tampered with system data. He no longer existed in the system. It would take time to make a complaint or report. But for that, Xu wouldn’t be here talking this nonsense.\n The two men stared each other down. Xu Haifeng broke the silence: “I have a way to catch you.”\n “I’d love to see it.”\n Xu put down his glass, took out his pistol, and placed it on the table. “I wanted to deal with you that way, but now I’ve changed my mind.”\n Huang Huali glanced at the black weapon. “I’m glad you thought better of it. Guns are for savages. You and I are civilized. So, what’s your new plan? I’m listening.”\n “Your Huang Huali identity may be gone, but you have to eat, drink, consume. I can find out who you are now.”\n Huang nodded politely.\n “You can’t erase these transaction traces. And the connection with your previous account . . . there must be traces of that as well, somewhere. You’ll eventually be unearthed.”\n Huang Huali smiled, remaining silent.\n “There’s also your attack on my personal account. This was not a simple provocation. It was illegal. The entire financial police system will be involved in the investigation. You and I both believe in technology. I already know which accounts you used to transfer those funds. Even if you’ve washed your hands of them, it won’t matter. One always leaves traces in the digital world. I think you’ve heard that sentence before?”\n “One always leaves traces in the digital world,” Huang Huali repeated, as if to himself, then shook his head. “But these traces, some are true and some false. If true and false are difficult to distinguish, the traces are useless.”\n Xu Haifeng glared at the man before him, Xu full of false, bluffing bravado, his host seemingly not at all frightened. Xu had to believe that with the massive power of the government behind him, and the technical support of Ante Corp, Huang Huali must certainly be destined for justice.\n Xu just had to buy a few days, give the behemoth behind him time to react.\n Huang Huali put down his glass and smiled at his guest. “Officer Xu, I quite admire your professionalism. These days, there are many smart people, but few courageous ones. You coming here at least shows you’re one of the good ones. A person of courage, of integrity. I really do admire that. But courage is not nearly enough.”\n Xu watched his opponent like a hawk. Something like that from a criminal’s mouth: it meant he was at least a criminal with a high IQ. All the more reason to tread carefully.\n “I might as well give you a little demonstration,” Huang said. “Can you perform facial recognition right now?”\n “Yes.” Xu Haifeng’s suspicions deepened. Facial recog was a basic tool in the professional kit of a police officer. All officers could perform recog on anyone via the Heavenly Network System.\n Huang Huali took two steps back and threw a wall switch. A ceiling light blazed, illuminating Huang’s face. His fingers danced in the air, operating a virtual interface only he could see. A few seconds later, he gestured at Xu Haifeng. “Go on, check me.”\n Xu blinked, bringing up the virtual screen projection on his retina. The ID authentication system came online. The system prompted him to confirm this was official business. Xu Haifeng hesitated, then confirmed, but suffered an inexplicable foreboding. Huang Huali’s confident posture and relaxed demeanor made Xu feel things might be more complicated than he’d thought. Huang’s identity had vanished from the system. What identity would his face bring up? Had he become a human question mark?\n The scanning interface soon completed its work. Data verification was in progress. This usually took just a few seconds, but this time took more than ten.\n Huang Huali smiled.\n Xu Haifeng’s heart skipped a beat.\n A faint green dot jumped to the center of Xu’s field of vision. The test result had arrived, and Xu lowered his gaze to see. The information on the virtual screen was unequivocal.\n Name: Xu Haifeng\n ID number: 11074420151224XXXX\n Xu had to restrain a look of wide-eyed surprise.\n Huang Huali, standing right in front of him, had become him, as far as the system was concerned.\n “What the hell have you done?” Xu stared fiercely at the criminal. This was no simple hack of a few accounts, nor was it deletion of certain system records. Huang Huali had the power to bestow someone’s identity upon a nonexistent other.\n He didn’t answer Xu’s question, but reached out and gesticulated again, then said, “Verify again.”\n Xu Haifeng conducted another recog on the person before him.\n This time the data verification only took a few seconds. The criminal was now Li Lishi, a university teacher.\n Xu’s horror was beyond words.\n Huang Huali grinned.\n “How is this possible?” Xu blurted, realizing as he did that he’d completely lost the upper hand. He took a deep breath and controlled himself. “What the hell is going on?”\n “Your system needs an image, so I give it an image.”\n “What do you mean?”\n “My phone stores the facial recognition data of at least thirty people. Your system will find the person in front of you to be Tom, Dick, or Harry, Jesus, Mary, or Joseph, as I please.” He pointed at the ceiling light. “This forms a light field that modifies facial features in a specific area. Simply put, it masks me. You can’t see the mask, but your algorithm sees it, and it can turn me into anyone. Of course, if the facial features are too divergent, the subterfuge fails, so I choose my mask candidates carefully.”\n Xu Haifeng was dubious. He’d never heard of this technology. Perhaps he could go to Wen Xin to verify it. Facial recognition had always been the exclusive domain of Ante. No other company had managed it well.\n Huang Huali stepped out of the illuminated area. “Want to try?” he said, looking at Xu Haifeng challengingly.\n Xu Haifeng resigned himself. He had to try. What was the alternative? He stepped forward and stood where Huang had. “Go on then, let’s see.”\n “A moment please, I have to calibrate to your face.” Huang Huali gestured in the interface only he could see. Two minutes later, he looked up at Xu Haifeng. “So, your name is now Li Lishi.”\n Huang extended a hand. A translucent screen descended between the two of them. Xu Haifeng saw a face on the screen, his face, but covered in a thin layer, a mask of light.\n “Go ahead,” Huang Huali said.\n Xu Haifeng reached out to operate the screen. It was a standard interaction system, almost identical to the one he used in his office. His fingers danced, initiating facial recog mode. The face went to the public inquiry system, and the system returned the words Li Lishi.\n According to the Heavenly Eye system, he was no longer Xu Haifeng. Heavenly Eye was based on facial recog, and Huang’s tech had deconstructed it. The master of that tech could become another person in the system at any time. In a data-reliant world, this was certainly a devastating power.\n Xu Haifeng suddenly understood why he’d missed the mark: he hadn’t possessed the right intel on Huang Huali. Now he felt ill at ease, and roundly humiliated. “You . . . ” he began, flushed, then bit his lip. “Just tell me what this is all about.”\n “I need your help.”\n “Excuse me?”\n “You’ve been investigating me for so long, and I need help, so I’m asking you.”\n It sounded like a trap, but Xu Haifeng opted to play along. “What do you need me to do?”\n “This adventurous life is getting to be a bit much. At any given moment having to remember what I’m doing and what role I’m playing. I’ve had it. So, I need a favor from you, so I can fly far away.”\n Xu Haifeng couldn’t help an inner sneer. His goal was to catch Huang Huali and bring him to justice, and the bastard was asking for help escaping. What a joke!\n But Xu Haifeng didn’t laugh.\n “I don’t know how I can help.”\n “If you’re amenable, it’s a small thing really. And by the way, I’ve transferred twenty million to your account.”\n “Twenty mil?! Impossible.”\n “Go ahead and check, directly, not through a third-party app.”\n Xu Haifeng accessed his bank account.\n There it was, the impossible eight-digit number. Like a feat of magic.\n Where had so much money come from?\n “Twenty million US dollars. It’s all yours.”\n This declaration gave Xu Haifeng heart palpitations.\n Such a sum. He often investigated cases involving hundreds of millions, but he’d never imagined anything like twenty million one day falling upon him.\n The money was in his account. There could be no doubt.\n Who knew there would be someone willing to bribe him with twenty million—US dollars no less. It seemed this Huang Huali case involved much more than twenty million. The bribe must only be the tip of the iceberg.\n Xu Haifeng rallied his wits.\n “What do you need me to do?”\n “There’s only one public space in China that requires fingerprint verification after facial scanning . . . ”\n “Customs,” Xu said. This really was about escape.\n “Indeed. After fingerprinting, there are manual document inspections and identity verification. My light field cannot deceive the human eye.”\n “So, you can’t get through customs.”\n “Not with technology alone. I need your help.”\n Xu Haifeng began to guess at Huang’s plan. If he got through customs, there were still many places on Earth where an identity-less person could live at ease.\n “Think about it . . . feign confusion just once, and earn twenty million. So easy. I know you’re investigating me. I can’t wait around for you to get through all the red tape and arrest me. If you don’t want that twenty million, many people would do what I’m asking for a lot less.”\n Xu Haifeng took a deep breath, as if making up his mind. “Where will you go?”\n Huang Huali smirked. “A faraway place. Maybe you could follow me some day.” He picked up the glass Xu had set down and handed it over.\n Xu Haifeng took it.\n Huang Huali held up his own glass: “I prefer to cooperate with outstanding people. So . . . a toast, to our cooperation! Then we’ll talk details. And of course you always have the right to back out.”\n Xu Haifeng went straight from Huang Huali’s place to Xin Wen and told him about the encounter. He ended with a question: “You’ve got to tell me how that twenty million got into my account!”\n Wen Xin’s brow furrowed. “If your account can get credited twenty million and not get investigated, the only possibility is it’s a certified 5A account, government-chartered, which has nothing to with us at Ante Corp.”\n “First of all, never mind Ante. I’m not talking to Ante now, I’m talking to you! You’re a security expert. You must know how he pulled this off!”\n “A government privileged account is high-level classified. If Huang Huali can modify that list, whether by hacking or other means, you’d best not antagonize him.”\n Wen Xin’s words were quite discouraging.\n “What about that light field mask? Do you know what’s going on with that?”\n “We here at Ante Corp are only responsible for the security of financial—”\n “Enough about Ante,” Xu interrupted. “I’m asking for your help as a private individual.”\n “From a personal point of view then . . . ” Wen Xin paused, as if considering his wording, a far cry from his usual frenetic speaking style.\n Xu Haifeng watched him eagerly.\n “The year of the Bitcoin financial disaster . . . do you remember?”\n This change of subject left Xu Haifeng baffled. He had only a vague impression of the Bitcoin disaster, said to be the biggest financial tsunami in human history, evaporating up to ten trillion in financial assets and triggering more than two thousand suicides worldwide. The so-called Bit Black Hole incident.\n “What does my thing have to do with that?”\n “It was a disaster, but some people made fortunes. Two kinds of people got rich. First were quantum computer early adopters. They found some poorly guarded Bitcoin accounts, cracked the passkeys, stole Bitcoin, and cashed out. Keep in mind this was back when quantum computers weren’t widely used. So, these early adopters made a killing. The second type who got rich were Bitcoin short sellers. News of the quantum cracks spread fast through the marketplace. Bitcoin crashed overnight.”\n “Get to the point.” Xu Haifeng was not in the mood for this oral history. “What’s it got to do with Huang Huali?”\n “You asked me to look into those abnormal accounts. We’ve done our best. Most of them are the same as those used to cash out during the Bit Disaster. If you weren’t asking me privately, I wouldn’t tell you, but . . . we in financial security, we know not to touch anything related to the Bit Disaster, so I’m advising you to drop this. Huang Huali, even if he wasn’t directly involved with the Bit crash, he must be part of that ecosystem.”\n “You’re seriously telling me those accounts aren’t blocked?”\n “They’re supervised, but people dead set on something . . . how are they going to care about oversight?”\n Xu Haifeng’s mouth felt dry, and he swallowed audibly. He had found a loophole. At first, he thought he could dig a maggot out of it, but he ended up finding a black hole, one with an event horizon.\n “What about the light field mask?” he asked, hesitant, weakened.\n “Theoretically possible, but the technology would be tricky. If you say that someone has done it . . . well, I don’t know.” Wen Xin’s answer dripped with helpless frustration.\n Xu Haifeng’s spirits sank. Why continue to question the twenty million in his account? But then something occurred to him. “No matter how powerful he is, he’s still just an individual person. If I can catch him at the scene, red-handed, his identity-shifting won’t matter. All of that will be useless!”\n Wen Xin eyed him warily. “That’s police business, quite out of my control.”\n Xu Haifeng brought his fist down on the table. “Police business. Damn right. Just what’ll fix him in the end!”\n He sent RMB 246.79 to an account called “Often Pondering Past Mistakes,” attaching a message: “December 20, 6PM to 7PM, VIP SkyBridge.” This all accorded to his agreement with Huang Huali.\n As to whether Huang would believe him, he didn’t know, and was apprehensive.\n Huang Hauli’s original plan must have included a corrupt customs official, after all. But Xu’s sudden appearance had altered the plan. An unreliable police officer and a bribed customs official: which was the more viable path to freedom?\n Would Huang buy someone else?\n Xu Haifeng asked himself this question countless times. In the end, he cheered himself with an uncertain answer: He was watching Huang Huali very closely. Any abnormal moves were bound to be discovered. And with Xu bought and paid for—as far as Huang knew—the escape route was green-lit.\n Xu had checked the Ministry of Public Security’s household registry. Huang Huali’s missing identity was a data anomaly. It had been restored based on the backup database. Every investigation Xu had conducted on Huang Huali had been useful. Now, with the identity data restored, criminal charges could be leveled.\n Apart from flight, Huang Huali had no way out.\n Thinking of this, his confidence invariably swelled a bit. Justice would prevail over evil—it had to. No matter how powerful a hacker Huang was, he couldn’t escape the long arm of the law, or the palm of Buddha.\n “Received, thank you!”\n It was the reply from the account named “Often Pondering Past Mistakes.”\n Tomorrow then, it would all be decided.\n Huang had tried to buy off Xu for twenty million—a gross underestimation!\n Xu’s confidence suddenly surged, rage boiling up within him. Tomorrow he would educate Huang Hauli. The criminal would see how formidable his opponent really was.\n Xu Haifeng sat behind the inspection desk on the VIP SkyBridge. He’d used the turn-taking beat rotation system to apply for this customs officer posting. He’d reported the situation to his superiors. They knew this was a cover operation meant to paralyze Huang Huali, and they were on board.\n It would soon be 6 p.m.\n There weren’t many guests on the SkyBridge. One or two came by from time to time. Customs Official Xu absently checked their documents, their identities, and let them pass.\n Soon enough it was nearly seven o’clock. Still no sign of Huang Huali.\n Xu grew anxious, glancing at the gate with greater frequency.\n The doors opened, several figures entering at once.\n Robotic police. Xu’s heart sank.\n “Xu Haifeng, you are under arrest. You have the right to remain silent. All your words and actions are being recorded by Heavenly Eye for your case file.” With this standard announcement deployed, the robotic police came to flank him on both sides.\n “I’m on duty!”\n This had no effect on the robots. They simply lifted Xu Haifeng out of his seat and headed for the emergency passage, unhurried, unfeeling, and closed the gate behind them.\n Only a few passengers remained on the SkyBridge, looking at each other, at a loss.\n In the interrogation room, Xu Haifeng faced his boss, the director of the Financial Crimes Prevention Bureau. They glared at each other across a wide table, neither speaking for some time.\n The director finally broke the silence: “Why not tell the truth already?”\n “Everything I’ve said is the truth.”\n “You said he can use a light field mask to change his identity. What exactly is this thing?”\n “I’m not sure, but he stood there, the light hit his face, and the system took him for someone else. He called it a light field, and it was like a mask.”\n The director pushed a screen in front of Xu Haifeng. It showed someone clearing customs. He seemed familiar.\n The person looked up and smiled at the camera.\n Xu Haifeng stared, in shock.\n The person on screen was clearly himself.\n “He wore a mask alright, but it wasn’t a light field mask.” The director took something from his satchel and spread it on the table: a mask. Lying there shapeless, it seemed hideous and grimacing. “We found this in his flat. He used a high-precision printer with the best life-imitating materials to replicate your face. Obviously he printed more than one. This was in the bin.”\n Xu Haifeng, dazed, barely heard the director. He was back in the flat, that night. Huang Huali had scanned his face. And fingerprints! The wineglass, the touch screen. And the 3D printer! It had all been there, right in front of him. How could he have been so stupid? The tools of the crime had been put on display for him.\n He’d been entrapped. The goal had been to get his fingerprints and facial model. The so-called light field mask had been a prop, a frightening distraction, and he’d fallen for it.\n Xu Haifeng felt educated, and it left a bitter taste in his mouth.\n “And your fingerprints,” the director was saying, “he simulated them perfectly. You arranged the arrest here in Shanghai, but he actually left from Kunming, passing customs, at five o’clock. And because you applied for a beat rotation, your data was not in our sensitive database. Our expert system only discovered the anomaly two hours later.”\n Xu smiled. “I was duped.”\n “Were you?” The director sneered. “Or did you collude?”\n This left Xu momentarily dumbstruck. “What about that account?” he finally managed.\n “The account you provided is dead. It hasn’t been used in three years. Your transaction was the only one during that time.”\n “But whose account is it? You can check that.”\n “It’s an automatic reply. The owner of the account is a dead.”\n Xu Haifeng suddenly felt very tired. He’d been humiliated, brought low. Why hadn’t he asked Wen Xin to confirm the account? It didn’t matter though. Even if he’d known it was a dead person’s account, he would have taken it for a trick, a hack, a substitution, nothing more.\n He’d been foolish, falling into a trap while believing he laid one.\n “We also checked your account. That twenty million you claimed was there . . . no sign of it. If someone had tried to buy you for twenty mil, I’m afraid the system would’ve notified the police. So, where exactly did you see this alleged twenty million?”\n Xu Haifeng shook his head, no longer interested in defending himself. In the digital world, Huang Huali was simply a god. Xu never should have provoked him.\n “Think it about it carefully, Xu. You know our policy . . . forthright confession gets you leniency. Defiance is treated strictly!”\n “I know.” Xu Haifeng smiled bitterly.\n The director got up and left. Xu Haifeng was left alone with his thoughts in the vast interrogation room.\n It was over. Nothing left to ponder on that front. So, he thought about asking Wen Xin to help him find a good lawyer.\n Convicted of dereliction of duty!\n Convicted of endangering national financial security!\n Twenty years imprisonment, with a one-year deferment of sentence.\n After the verdict came down, Xu Haifeng let out a long breath. With a one-year reprieve, maybe he could fight to get the entire sentence overturned. The lawyer Wen Xin had found was quite good, despite everything.\n Leaving the courthouse, Xu Haifeng was followed by a police robot. It would always be with him during this year of probation. He would be under residential surveillance.\n The ubiquitous Heavenly Eye monitored everyone, but a robot at his side lent a sense of ritual. It made you always aware that you were in fact a prisoner.\n He sighed.\n The good news was at least he still had his personal freedom.\n An autonomous car stopped in front of Xu Haifeng, a delivery vehicle. A pair of manipulators handed over a package.\n “Mr. Xu, your parcel,” said a pleasant female voice.\n This was puzzling, but he took the package and glanced at the label: the sender was a Li Lishi. Suddenly shaking with excitement, Xu hugged the package to his chest.\n Back home, he hid in the bathroom and fell to tearing at paper and tape.\n Inside the package was a helmet, semitransparent and of exquisite workmanship. When he looked close he could see the densely arranged metal wires of the inner layer. He had seen Huang Huali wearing this helmet.\n There was also a note, with just one line: “One always leaves traces in the digital world.”\n On the other side was another line: “God said let there be light, so we created a light field.”\n Xu Haifeng picked up the helmet, tense with anticipation, his hands trembling slightly.\n He put on the helmet. It fit perfectly.\n The lamp in the helmet turned on. Xu Haifeng felt that everything before him was covered in a layer of radiance.\n He looked at himself in the mirror and initiated an identity query. The result came moments later. The name Li Lishi was projected into his vision. A chill went through him. He opened the account associated with Li Lishi, and there it was: twenty million. The eight digits were before his eyes, along with a string of peculiar characters in the remarks, which Xu Haifeng recognized at a glance: an encrypted contact method for connecting to a specific computer.\n Huang Huali may have humiliated him, but he had not cheated him.\n Xu Haifeng felt like he was standing on the edge of an abyss, a depthless void, no bottom discernible, but full of fatal temptation.\n If he took the plunge, would he fall and be smashed to pieces, or would he ride the wind and reach a free, blissful paradise?\n He stared into the mirror, and the stranger in the mirror stared back at him.\n In the basement of a single-family villa in the outer suburbs of Shanghai, a pair of hands pushed a door open.\n Words were engraved on the door: “Whoever masters technology will master the future.”\n The man went inside. There were screens everywhere in the room, constantly scrolling data, and on the big screen in the middle was Xu Haifeng’s face.\n The man’s gaze swept over the screen and landed on the wall behind. In the room full of screens, only here was the wall exposed.\n Written there was: “Whoever masters data will master the people!”\n Wen Xin studied Xu Haifeng’s face as he initiated a phone call.\n “Chief Wen!” It was Huang Huali’s voice.\n “He’s still hesitating.”\n “Yeah,” Huang said, “I know.”\n “I’ve deduction-gamed this a hundred times, and he always agrees.”\n “I know.”\n “But he’s been dallying for quite a while now.”\n “Chief Wen, you have a better grasp of data analysis than I. Xu Haifeng is quite a stubborn personality. Where he’s involved, extreme situations readily arise.”\n Wen Xin was silent a moment. “Well, he has joined the organization, so don’t contact him anymore.”\n “So I’m free then?”\n “Weren’t you already?”\n After disconnecting the call, Huang Huali gazed at the sea through his window. He was indeed free, but another person was falling into the grasp of that great invisible hand. He couldn’t reckon this the most perfect ending.\n The dark blue ocean was like an inverted, radiant sky. He glanced at the data scrolling on his computer. He’d just gotten the surgery: his eye implants were gone. Now he had to use an ancient interface to access the Internet. It was a huge price to pay, but worth it. He would no longer leave traces in the digital world.\n Freedom always had a price.\n Meanwhile, that young officer was still wandering, still struggling. Wen Xin’s big data showed he would eventually embark upon this path, never to return. Some people were in the light, and some were in the dark. It wasn’t fair. He’d used the young officer to get out of his predicament, so he’d felt obliged to help him.\n The data stream stopped scrolling. The connection had been successful.\n Huang Huali closed the computer.\n Xu Haifeng still stared dazedly at the mirror.\n A string of words appeared superimposed on his face, in the mirror, surprising him:\n “Whoever masters data will master the people.”\n The mirror under the text turned into a display screen. On the screen, Wen Xin was reclined halfway in a chair, staring at a screen of his own. On that screen, was Xu’s own face via the mirror, in real-time.\n Xu Haifeng frowned with the weight of a new revelation.\n Originally published in Chinese in Science Fiction World, Issue 3, 2018.\n Translated and published in partnership with Storycom.\n Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}