{"fingerprint": "2yc15NxaS96TVKIAo9B63wDO+Ug=", "sitename": "Clarkesworld Magazine", "title": "Impossible Colors of an Infinite Universe by Matt Jones", "author": "Matt Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jones_07_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Impossible Colors of an Infinite Universe by Matt Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Impossible Colors of an Infinite Universe\n In 2001, Karl Glazebrook and Ivan Baldry, a team of astronomers from John Hopkins University, discovered that the universe had a color.\n This discovery was somewhat inadvertent. Glazebrook and Baldry had originally set out to study the history of star formation through the use of a major spectroscopic survey known as the “2dF Galaxy Redshift.” The survey observed and measured the light emitted from over 200,000 galaxies scattered across billions of lightyears of the known universe. Based on their observations, Glazebrook and Baldry developed the “cosmic spectrum,” which represented “all the individual spectra of the separate galaxies in the 2dF survey.” After the study was complete, they realized they could add up all of their separate measurements, the sum of which would establish an average color of the universe. As it turned out, the universe—all of the matter, energy, and life of intergalactic space, everything—was a beigish white.\n Think: flax, ivory, eggshell, chamois, ecru, buttermilk. A color synonymous with all that is boring, drab, and conventional, yet that can also add a sense of richness, warmth, and elegance to any living room wall.\n Shortly after Glazebrook and Baldry’s discovery that the cosmos was essentially beige, the Washington Post ran an article featuring a swatch of the new color. The paper asked readers to write in with suggestions of what to name the newfound shade of the universe. The top ten proposals included names like Skyvory, Astronomer Almond, Univeige, and Primordial Clam Chowder—titles all worthy of high school bands, adult film production companies, and shades of concealer alike. However, not just any name would do. It didn’t seem fitting to christen all of space after a thick soup or a clever portmanteau. The color of the universe needed to be representative of the human experience, so Glazebrook and Baldry ultimately settled on a suggestion from Post subscriber David Frum. While reading the newspaper at his local Starbucks, Frum had looked down into his coffee cup and noticed that the frothy liquid bore a striking resemblance to the entirety of all time and space. Thus, the beigish white of the universe was dubbed “Cosmic Latte.”\n Now, the reason our universe is Cosmic Latte as opposed to something more grandiose like Smargadine, Aureolin, Empyrean Purple, or Orgasm Blush, has to do with multiple factors such as the age of stars, the speed of light, and cosmological inflation. Oh, and perspective, of course. When we say that the color of the universe is Cosmic Latte, what we really mean is that the color of our observable universe is Cosmic Latte, with what is observable encompassing only the spherical sliver of the two trillion galaxies from which light has had time to reach us. Even then, Glazebrook and Baldry’s cosmic spectrum is only based upon their observations of the 245,591 space objects collected in their 2dF Galaxy Redshift Survey.\n According to the theory of cosmic inflation, the estimated size of the entire universe is over 250 times larger than the observable universe. In essence, there is much that exists beyond the cosmic horizon that we are unable to see, not only because we lack the technology, but also because our vision is limited by what can be observed in the visible spectrum of light. In the same way that it is impossible to closely examine what lies beyond the edge of infinity—if there even is such a thing—it is also impossible to see some colors with the human eye.\n In 1748, Scottish philosopher David Hume conducted a thought experiment called “The Missing Shade of Blue” in his book An Enquiry Concerning Human Understanding. As part of the experiment, Hume asked what would happen if an adult was presented with different shades of blue “descending gradually from the deepest to the lightest,” except with one shade missing in the middle. He wrote:\n \n Let all the different shades of that colour, except that single one, be plac'd before him, descending gradually from the deepest to the lightest; ‘tis plain, that he will perceive a blank, where that shade is wanting, and will be sensible, that there is a greater distance in that place betwixt the contiguous colours, than in any other. Now I ask, whether ‘tis possible for him, from his own imagination, to supply this deficiency, and raise up to himself the idea of that particular shade, tho’ it had never been conveyed to him by his senses?\n \n Essentially, Hume theorized that all of human experience could be divided into two categories: ideas and impressions, in which “ideas represent faint images of their corresponding impressions.” Thus, “The Missing Shade of Blue” experiment was aimed at asking whether people could formulate ideas without first being exposed to the idea’s relevant sensory impressions. In this case: Could a person imagine a color they had never experienced before?\n Ultimately, Hume decided that they couldn’t, but some of his philosophical contemporaries believed it was a possible feat. William Edward Morris supposed that the missing shade of blue could easily be provided through a process of “mental mixing” in which a person simply blended the various surrounding shades inside their head. While Hume’s experiment was meant to function as a representative microcosm of a much larger philosophical theory based on the concept that “every idea which we examine is copied from a similar impression,” “The Missing Shade of Blue” experiment also poses interesting questions about color. Can a person imagine a color they have never seen? Is the act of experiencing a color purely physical, or is it imaginative? The potential answers to these questions become particularly complicated when faced with the prospect of impossible colors.\n Impossible colors are not impossible because they don’t exist, but because they can’t exist. The reason they can’t exist is because humans do not have the ability to perceive them with the naked eye. This means that we will never be privy to the various hues, tints, and shades of Ulfine, Argent, Sanguire, Smaudre, the eighth and ninth rays, and Douglas Adams’ super intelligent shade of blue known only as “Hooloovoo.”\n Earthly speaking, impossible colors refer to reddish greens and yellowish blues—not mixtures of the two, but hues that perfectly capture and equally represent coexisting shades of each. These colors are impossible to see because red frequencies cancel out green and because blue frequencies cancel out yellow. That being said, in their 1983 paper entitled “On Seeing Reddish Green and Bluish Yellow,” scientists Hewitt Crane and Thomas Piantanida laid out the results of an experiment in which they sought to prove that impossible colors were actually possible. Crane and Piantanida did not go the way of Hume and simply present participants with a visual strip of color with one blank shade resting between a swatch of red and green. Instead, the two researchers used a product of their own invention: the “double-Purkinje-image (DPI) eye tracking system.”\n Basically, Crane and Piantanida used the tracking system to bombard their subjects’ eyes with oppositional colors in the form of either red and green or blue and yellow stripes. Each participant had their head stabilized, a bite-bar placed inside their mouths, and black occluders positioned at the inner edges of their vision. While the results were mixed, “some observers indicated that although they were aware that what they were viewing was a color, they were unable to name or describe the color.”\n In other words, people were able to perceive the “impossible,” yet did not have the language to describe such an experience other than to know that what they were seeing was in fact a color.\n In H.P. Lovecraft’s 1927 short story “The Colour Out of Space,” an unnamed surveyor from Boston attempts to uncover the truth about an abandoned area of Arkham, Massachusetts known only as the “blasted heath.” During his investigation, the surveyor learns that a meteorite once crashed into the region in 1882. Of course, this was not a normal meteorite, but one that has never cooled and has only shrunk and shrunk until all that remains of the cosmic debris are strange globules of color. These aren’t globules of “color” in the strictest sense of the word. Instead, the color descriptor is used as an analogy for something that is otherwise impossible to describe.\n Over the course of the story, the surveyor discovers that once the remains of the meteorite completely disappeared, the crops on the land grew in overly large and inedible. The animals started acting strangely and plant-life became luminous. The farmer who lived on the land had to lock his wife in an attic because she went mad. Then, the vegetation turned to gray powder. The farmer’s sons disappeared and eventually, the farmer himself vanished. In response to his finds, the surveyor gathers six men from the town of Arkham and goes in search of the missing farmer and his family only to find the skeletons of the two sons and some other small animals at the bottom of the family’s well. Upon making their discovery, a “monstrous constellation of unnatural light” begins to glow from within the well. Before the men can turn away, the light rockets out and upward into the sky and across the marshes. Later, pondering on what the light was, the surveyor says: “It was just a colour out of space—a frightful messenger from unformed realms of infinity beyond all Nature as we know it; from realms whose mere existence stuns the brain and numbs us with the black extra-cosmic gulfs it throws open before our frenzied eyes.”\n What the surveyor calls the “unformed realms of infinity beyond all Nature as we know it” can also be conceived as the area beyond the observable universe, far outside of the cosmic horizon—that great, endless swatch of space that evades human technology, and therefore, sight. However, in much the same way that the participants involved in Crane and Piantanida’s study were able to identify that an impossible color was still a color despite lacking the language to describe it, so too is Lovecraft’s surveyor.\n What is unique about Lovecraft’s “The Colour Out of Space” is that it conjures the unknowable in the form of a color. That Lovecraft chose to portray this cosmic being as a “colour out of space” and not, say, a green-skinned alien, speaks to the profound and sometimes unspoken role that color plays in defining the edges of the known world. While any number of science fiction narratives include encounters with gray humanoid extraterrestrials, sentient pitch black blobs, and predatory shapeshifters with rainbow tentacles, these iterations of extraterrestrial beings are ultimately bound by the spectrum of light that is visible to humans.\n It may sound obvious, but color is at the heart of the way we see the world.\n When Isaac Newton published his 1704 paper “Opticks,” he also informed readers for the first time that color is not inherent to objects, but is instead an illusion of light that only comes to life inside our minds. He determined this in a series of 1666 experiments in which he used a glass prism to refract white light. Upon doing so, he noticed that seven different colors of light were produced in a spectrum: red, orange, yellow, green, blue, indigo, violet.\n The very term spectrum finds its etymological roots in words that mean both “to look” and “apparition.” So the appearance of color—of any color, really—is not only a physical act, but also an imaginative one that defines “seeing” as an encounter with the unusual, the apparitional, and the great beyond. While the physical components of human vision are confined to long, medium, and short wavelengths of light alongside Newton’s spectrum and the nearly one million various hues and shades in between, the imaginative elements of vision are capable of reaching out into what Lovecraft called the “unformed realms of infinity.”\n Consider the color octarine from Terry Pratchett’s Discworld series, also known as the “color of magic,” and the “undisputed pigment of the imagination.” In Discworld, humans can’t see octarine, but they can see where octarine should be. So what should appear as a vibrant greenish-purple—a combination scientifically undetectable to humans—instead appears as the black maw of space, the unformed realms. In Terry Pratchett’s universe, the color of magic is the absence of light. Darkness brims with both nothingness and possibility.\n As a genre, science fiction utilizes new and unseen colors not only as a tool for worldbuilding, but also as a means of challenging what is possible. Understanding the scope of human vision is just as much about understanding what we can know as it is about understanding what we can’t. When we imagine a new or impossible color, we also acknowledge that there is much that we can see that does not yet exist and more that exists that we cannot yet see. Looking up into the black cosmic gulfs of the sky is sometimes indistinguishable from closing our eyes. The difference between the two acts concerns not how much light there is, but how much light we allow ourselves to see. And that’s really what science fiction does—it allows us the chance to encounter the hidden light in the seemingly impenetrable and relentless darkness.\n When science fiction authors invent new colors like octarine, smaudre, and hooloovoo, they are doing more than simply making up words. They are naming shades of darkness. Like astronomers charting the stars of the cosmos, writers like Pratchett, Lovecraft, and countless others help give shape to the boundless obscurity of existence by pointing out the twinges of light in the distance. In doing so, the impossible becomes both more fathomable and familiar, something that is far away but perhaps not so far out of reach as we once thought."}