{"fingerprint": "8iSAE9zFJz2Mo/Ck/35Vs5QjqHQ=", "sitename": "Clarkesworld Magazine", "title": "How to Injure Characters Without Killing Them by S. E. Jones", "author": "S E Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jones_06_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: How to Injure Characters Without Killing Them by S. E. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nHow to Injure Characters Without Killing Them\nEvery author strives for reality. Especially so when it comes to science fiction and fantasy. If the author gets the details right, then the unreal is cemented.\nDespite this, authors often injure characters in ways that would, in the real world, lead them to death or extensive hospital stays. Humans are fragile creatures, and the patient that jumps up after being unconscious for half an hour is the exception rather than the rule. In the real world, that period of unconsciousness would generally lead to someone being on a ventilator and a lengthy hospital stay.\nSo how is an author to manage this fine line? How do you knock a character out when a hospital is not an option? How do you manage blood loss without needing a transfusion?\nThere are three major areas which often raise the eyebrows of anyone who’s worked in emergency health—unconsciousness, blood loss, and wound management and infection.\nUnconsciousness\nThe brain is a complex organ, but most importantly, it is what is known as a “beat-to-beat” organ. It has no way of storing energy, no way of storing oxygen, and its survival and function are dependent on each beat of the heart.\nEvery beat of the heart delivers the brain the products that it needs to survive. At the same time, the flow of blood takes away the waste created by the brain’s metabolic processes. Which leads us to our first major cause of unconsciousness:\nLack of Blood\nIn this circumstance, fainting is a survival mechanism. We faint because when we lie down, it’s easier for the heart to pump the blood up to the brain.\nLike fever, it’s not the safest way of achieving a goal, but it achieves that goal none-the-less.\nThis is why people often wake up after fainting. It’s also why, if you sit them up too quickly, they feel dizzy. It’s why they feel better when you lie them back down again.\nIn this case, if a person faints, and is unconscious for a significant period of time, then blood is not reaching that individual’s brain.\nIn this example, the brain is starving. It has no energy with which to run its metabolic processes. No way to get rid of carbon dioxide. No way to access oxygen. And barring the muscle in your heart, nerves are some of the most irreplaceable things in the body. They don’t grow back.\nSo, your brain both starves and pickles in its own carbon dioxide.\nAnd when nerves die, the complex systems of the brain start to die with them.\nThose connections allow you to think, to reason, to emote. If we look at many examples of characters losing consciousness, the way that other characters often check if they’re all right is by looking at their pulse and breathing.\nBreathing happens in the different part of the brain—the brain stem. Heart rate, while controlled by many things, gets most of its impulses from the same part of the brain. This is why it is entirely possible to be brain dead but still be breathing with a heartbeat.\nSo yes, a character may be breathing and have a pulse while they’re unconscious. But inside their skull, the parts of their brains that make them individuals are dying.\nBrain Injury\nPeople also faint due to brain injury. If someone is whacked over the head and faints, then they’re not fainting due to a sudden lack of blood to their brain—they’re fainting because of the shock to the brain.\nBrain injury occurs along a continuum. It ranges from a stunned moment, during which no true damage is recorded, to concussion, to acquired brain injury.\nBarring a stunned moment, concussion carries with it, the least, in the way of repercussions. The brain is bruised. Bruising in the brain, like bruising everywhere, results in swelling. This swelling restricts blood supply to the brain both in the immediate area of swelling, and to the brain generally.\nYour brain is locked in your skull, which is a limited space. Swelling decreases that space, and the body acts to make sure that no extra pressure is applied. It does this by limiting both cerebrospinal fluid, and blood supply.\nA decrease in blood supply to the brain does not end well.\nHowever, once the swelling dies down, the brain recovers from the bruising, and after a few days, the person recovers. Note that it normally takes a few days and it’s not an instantaneous fix.\nOther brain injuries are more serious because it’s not just bruising with which the character is dealing. It’s internal bleeding, extensive swelling, and increased pressure within the brain cavity. Anything more serious than a concussion will have serious ramifications to a person’s ability to function, and will probably require the skills of a surgeon.\nConsequences of Loss of Consciousness: Airway Integrity\nBrain injury, and a lack of consciousness in general, is dangerous for other reasons as well. When someone becomes unconscious, they lose control over particular parts of their bodies. Mainly, their gag reflex.\nA gag reflex protects your airway. When a person is unconscious, lying on their back, often with all their muscles relaxed, they run the risk of something called asphyxiation. This is what happens when the muscles of your stomach relax and you passively regurgitate your stomach contents. As you have no gag reflex to protect your lungs, you then inhale food and stomach acid into your lungs.\nLung tissue is about as replicable as heart and brain tissue. Once it’s gone, it’s gone. And if the lungs are blocked by food and stomach acid, oxygen is not able to get into the bloodstream, and carbon dioxide is not able to get out.\nSo even if the heart is pumping, it’s not delivering oxygen. Which is bad news for our beat-to-beat organs, including our brain and our heart.\nInjuring Your Patients Without Killing Them: Unconsciousness\nSo. Fainting is bad. How, then, do we effectively debilitate our characters without killing them when it comes to messing with the brain?\nThe easy answer to this is to dial down the intensity of what you’re doing. A person doesn’t need to be fully unconscious to be out of action. Looking at the different levels of consciousness is useful.\nGiven the consequences and probable causes of not being conscious, emergency medicine is obsessed with the scenario. One of the most common ways that consciousness is assessed is via something called the Glasgow Coma Scale (GCS). The scale ranges from a score of 3 (dead) to 15 (conscious, alert, and orientated).\nThe other measurements are made up by adding together three scores of responsiveness. See below:\nEyes (highest score = 4)\n- Eyes open spontaneously - 4\n- Eyes open to commands - 3\n- Eyes open to pain - 2\n- Eye do not open to pain, voice, or spontaneously - 1\nSpeech (highest score = 5)\n- Talking, aware of time, place, and purpose - 5\n- Talking, but confused - 4\n- Talking, words not approbate (i.e., banana when you ask the time) - 3\n- Not talking, but makes sounds (groans ect) in response to pain - 2\n- Not talking, no sounds made in response to pain - 1\nMotor (highest score = 6)\n- Able to obey commands - 6\n- Can locate the source of and react to pain (ie, pushing a hand away) - 5\n- Can withdraw from pain (flinching) - 4\n- Entire body flexes in reaction to pain - 3\n- Entire body extends in reaction to pain - 2\n- No motor response to pain - 1\nMy suggestion would be to pick from one of the in-between scores. Take note, that if a person is scoring a 1 or 2 for verbal, then they won’t be scoring a 5 or 6 for motor. You generally can’t go wrong by hovering around a column before or after the symptom you pick.\nTake note of the symptoms listed. Being unable to respond to pain is debilitating. Being unable to talk is debilitating. Being unable to open your eyes is debilitating. A person doesn’t need to be unconscious, and thus in need of an emergency department in order to get the effect that you want in a story. There’s plenty to choose from on the way there.\nBlood Loss\nThe second way in which authors often kill their characters off without meaning to is with blood loss. This is inherently tied with a lack of understanding of how much blood the human body needs to function, and the consequences of a lack of blood.\nWe’ve already looked at beat-to-beat organs. These are the organs that the body looks to protect when there’s a lack of blood available.\nBut the body is remarkably resilient, and also very good at dealing with horrific circumstances. It works on a principal of sacrifice and knows it won’t survive without its heart. It knows that a dead brain is not conducive to survival. If a person is losing blood, several things will happen.\nFirst, a coagulation cascade activates. This sequence of biochemical events is hideously complicated, and doesn’t need to be extensively examined to understand its effects—it boils down to two things. The process tries to stop your blood loss by knitting together a web of fibers that platelets adhere to. This acts as a wall, to try and keep the blood where it’s needed. The coagulation cascade also tries to increase the viscosity of your blood (thus, clotting of the blood).\nThese processes take time. This is where basic wound care comes into play. Pressure is your friend. The judicious application of pressure to a wound assists your body by both giving it time to do what it needs to do, and by providing part of the netting that clots form around.\nBecause of these processes, the body is remarkably efficient. If your character is fainting from a loss of blood? They’re dead. They need surgery, extensive surgery, yesterday. It also means that injuries that many authors prescribe fainting and pain too, aren’t really injuries that would result in either.\nInjuring Your Character Without Killing Them: Blood Loss\nSo how do you portray blood loss in your stories? Blood lost prompts hypovolemic shock. This happens when your cells do not get enough blood to deliver what they need to survive, and dispose of waste. Keep in mind that the average (male, 75kg) human body holds five litres of blood:\nStages of Hypovolemic Shock\nStage 1\n- Blood loss (%): 15%\n- Volume of blood lost (based on a young human male): Up to 750 ml\n- Symptoms: Heart rate is normal at under 100 beats per minute (bpm), normal blood pressure, normal/slightly elevated breath rate at a rate of 14-20 breaths per minute, slight anxiety\nStage 2:\n- Blood loss (%): 15 - 30%\n- Volume of blood lost: 750 - 1000 ml\n- Symptoms: Heart rate elevated at 100 - 120 bpm, blood pressure normal, breath rate elevated at 20 - 30 breaths per minute, mild anxiety\nStage 3:\n- Blood loss (%): 30 - 40%\n- Volume of blood lost: 1500 - 2000 ml\n- Symptoms: Heart rate over 120bpm, blood pressure decreased, breath rate at 30-40 breaths per minute, confusion\nStage three is the stage at which a patient now needs a blood transfusion, generally quite a large one, to half the progression of hypovolemic shock.\nStage 4:\n- Blood loss (%): >40%\n- Volume of blood lost: >2000ml\n- Symptoms: Heat rate over 140 ppm, blood pressure decreased, breath rate over 40 breaths per minute, coma\nStage 4 is when organs start to irreparably shut down, where brain trauma starts to occur (although some argument could be made for that starting in stage 3), and where death becomes the most likely outcome. It is also a stage that requires a blood transfusion, and more often than not a long stay in ICU, followed by weeks of rehabilitation and support.\nPick from something before 60%. It’s debilitating enough without needing a person to undergo surgery and six weeks of recovery. Take note that the amount of blood a person has varies widely depending on their size and weight. Generally speaking, a woman will need to lose less blood before her internal organs shut down than a man. Young males (most stab victims, statistically speaking) do remarkably well in the hour after the stabbing, because their bodies are in peak performance, and they compensate well.\nKeep in mind that if you want your character truly debilitated by blood loss, they will need all the marvels of modern surgery or a miracle and several weeks to rehabilitate.\nInfection and Wound Care\nWound care and infection are inherently tied. Most people know that without antibiotics, the world would be a much deadlier place.\nHowever, they often don’t understand the process of taking care of a wound. Logically, if you’re worried about infection, it makes sense to disinfect a wound. This works for scratches. It also works for small wounds which your immune system would probably deal with anyway.\nOne of the worst things you can do for a large wound is pour a mass of cleaning product on it. Or alcohol. Or anything else that burns and stings. Because yes, these substances kill things. Mostly though, they kill the surface cells of the wound and cause a lot of pain, because they also attack your exposed nerves.\nInjuring Your Character Without Killing Them: Infection and Wound Care\nIf infection is something that concerns you, it is enough to keep a wound clean. This means water. Lots of it, if a wound is particularly dirty. It means soaking the first layer of clean dressings in water. It means regularly changing dressings. It means using clean dressings in the first place.\nIf your worldbuilding includes antibiotics, these will be given orally or through a vein, and they will definitely not be poured into a wound. If you are worried enough about your character’s wounds getting infected that you want to use something other than water and regular bandage changes to clean the wound? Then the infection has probably already moved into that character’s bloodstream.\nSo how do you fix this? Either have a world that has antibiotics, or the magical equivalent, or hope that your character’s immune system can fight it off alone. Often with several weeks of bed-rest.\nA Note on Age, Gender, and Compensation\nAll of the things discussed above are true, but they are variable. Every stab victim I have attended as a paramedic has been up and walking. One particular fifteen-year-old, who had decided that getting high was the best way to deal with his situation, proceeded to hop down three flights of stairs after I’d just finished bandaging his leg. This was because he heard the police breaking into his apartment to make sure that there were no other injured parties present.\nPeople deal remarkably well with the injuries from which you would expect them to succumb.\nI was lucky to only go to one stabbing where breathing was impeded. Yet, the victim struggled his way to my ambulance, and complained the entire way. But the reason that most of the stab victims I met did so well with their injuries has to do with the age and fitness of those who, statistically speaking, get stabbed.\nYoung, healthy men do well when injured. As do young healthy women, but less so. The elderly respond the worst as they heal and physiologically react at a far slower pace. Children also do very well, until they very suddenly don’t.\nThis has carry-on effects for the other things we talk about—young men and women will deal with blood loss, infection, and head injuries far better than the elderly. Young children will also do quite well. But they only do so because their bodies are working very hard to keep things in equilibrium, and their bodies are also easily exhausted. Once they hit that point of exhaustion, they become very sick, very quickly. It is not unusual for children to be rushed into a hospital “just in case” for this reason.\nEvery human is different. While the things discussed above are generally true, they are also largely dependent on who the injured individual is, in terms of age, gender, and any other illness that they might already be managing.\nAnd as writers, I do think there is virtue in getting it right."}