{"fingerprint": "D1ASGXpy6EnLjDaPTaZBlu/pot0=", "sitename": "Clarkesworld Magazine", "title": "The Ki-anna by Gwyneth Jones", "author": "Gwyneth Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/jones_10_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Ki-anna by Gwyneth Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7440 words, short story, REPRINT\nThe Ki-anna\nIf he’d been at home, he’d have thought, Dump Plant Injuries. In the socially unbalanced, pioneer cities of the Equatorial Ring, little scavengers tangled with the recycling machinery. They needed premium, Earth-atmosphere-and-pressure nursing or the flesh would not regenerate—which they didn’t get. The gouges and dents would be permanent: skinned over, like the scars on her forearms. Visible through thin clothing, like the depressions in her thighs. But this wasn’t Mars, and she wasn’t human, she was a Ki. He guessed, uneasily, at a more horrifying childhood poverty.\nShe seemed very young for her post: hardly more than a girl. She could almost have been a human girl with gene-mods. Could have chosen to adopt that fine pelt of silky bronze, glimmering against the bare skin of her palms, her throat and face. Chosen those eyes, like drops of black dew; the hint of a mischievous animal muzzle. Her name was Ki-anna, she represented the KiAn authorities. Her partner, a Shet called Roaaat Bhvaaan, his heavy uniform making no concession to the warmth of the space-habitat, was from Interplanetary Affairs, and represented Speranza. The Shet looked far more alien: a head like a gray boulder, naked wrinkled hide hooding his eyes.\nPatrice didn’t expect them to be on his side, this odd couple, polite and sympathetic as they seemed. He must be careful, he must remember that his mind and body were reeling from the Buonarotti Transit—two instantaneous interstellar transits in two days, the first in his life. He’d never even seen a non-human sentient biped, in person, this time last week: and here he was in a stark police interview room with two of them.\n“You learned of your sister’s death a Martian year ago?”\n“Her disappearance. Yes.”\nKi-anna watched, Bhvaaan questioned: he wished it were the other way round. Patrice dreaded the Speranza mindset. Anyone who lives on a planet is a lesser form of life, of course we’re going to ignore your appeals, but it’s more fun to ignore them slowly, very, very slowly—\n“We can agree she disappeared,” muttered the Shet, what looked like mordant humor tugging the lipless trap of his mouth. “Yet, aah, you didn’t voice your concerns at once?”\n“Lione is, was, my twin. We were close, however far . . . When the notification of death came it was very brief, I didn’t take it in. A few days later I collapsed at work, I had to take compassionate leave.”\nAt first he’d accepted the official story. She’s dead, Lione is dead. She went into danger, it shouldn’t have happened but it did, on a suffering war-torn planet unimaginably far away . . .\nThe Shet rolled his neckless head, possibly in sympathy.\n“You’re, aah, a Social Knowledge Officer. Thap must be a demanding job. No blame if a loss to your family caused you to crash-out.”\n“I recovered. I examined the material that had arrived while I was ill: everything about my sister’s last expedition, and the ‘investigation.’ I knew there was something wrong. I couldn’t achieve anything at a distance. I had to get to Speranza, I had to get myself here—”\n“Quite right, child. Can’t do anything at long distance, aah.”\n“I had to apply for financial support, the system is slow. The Buonarotti Transit network isn’t for people like me—” He wished he’d bitten that back. “I mean, it’s for officials, diplomats, not civilian planet-dwellers.”\n“Unless they’re idle super-rich,” rumbled the Shet. “Or refugees getting shipped out of a hellhole, maybe. Well, you persisted. Your sister was Martian too. What was she doing here?”\nPatrice looked at the very slim file on the table. No way of telling if that tablet held a ton of documents or a single page.\n“Don’t you know?”\n“Explain it to us,” said Ki-anna. Her voice was sibilant, a hint of a lisp.\n“Lione was a troposphere engineer. She was working on the KiAn Atmosphere Recovery Project. But you must know . . . ” They waited, silently. “All right. The KiAn war practically flayed this planet. The atmosphere’s being repaired, it’s a major Speranza project. Out here it’s macro-engineering. They’ve created a—a membrane, like a casting mould, of magnetically charged particles. They’re shepherding small water ice asteroids, other debris with useful constituents, through it. Controlled annihilation releases the gases, bonding and venting propagates the right mix. We pioneered the technique. We’ve enriched the Martian atmosphere the same way . . . nothing like the scale of this. The job also has to be done from the bottom up. The troposphere, the lowest level of the inner atmosphere, is alive. It’s a saturated fluid full of viruses, fragments of DNA and RNA, amino acids, metabolizing mineral traces, pre-biotic chemistry. The configuration is unique to a living planet, and it’s like the mycorrhizal systems in the soil, back on Earth. If it isn’t there, or it’s not right, nothing will thrive.”\nHe couldn’t tell if they knew it all, or didn’t understand a word.\n“Lione knew the tropo reconstruction wasn’t going well. She found out there was an area of the surface, under the An-lalhar Lakes, where the living layer might be undamaged. This—where we are now—is the Orbital Refuge Habitat for that region. She came here, determined to get permission from the Ruling An to collect samples—”\nKi-anna interrupted softly. “Isn’t the surviving troposphere remotely sampled by the Project automats, all over the planet?”\n“Yes, but that obviously wasn’t good enough. That was Lione. If it was her responsibility, she had to do everything in her power to get the job done.”\n“Aah. Raarpht . . . Your sister befriended the Ruling An, she gained permission, she went down, and she stepped on a landmine. You understand that there was no body to be recovered? That she was vaporized?”\n“So I was told.”\nKi-anna rubbed her scarred forearms, the Shet studied Patrice. The interview room was haunted by meaning, shadowy with intent—\n“Aap. You need to make a ‘pilgrimage.’ A memorial journey?”\n“No, it’s not like that. There’s something wrong.”\nThe shadows tightened, but were they for him or against him?\n“Lione disappeared. I don’t speak any KiAn language, I didn’t have to, the reports were in English: when I hunted for more detail there are translator bots. I haven’t missed anything. A vaporized body doesn’t vanish. All that tissue, blood, and bone leaves forensic traces. None. No samples recovered. She was there to collect samples, don’t tell me it was forbidden . . . She didn’t come back, that’s all. Something happened to her, something other than a warzone accident—”\n“Are you saying your sister was murdered, Patrice?”\n“I need to go down there.”\n“I can see you’d feel thap way. You realize KiAn is uninhabitable?”\n“A lot of places on Mars are called ‘uninhabitable.’ My work takes me to the worst-off regions. I can handle myself.”\n“Aap. How do you feel about the KiAn issue, Messer Ferringhi?”\nPatrice opened his mouth, and shut it. He didn’t have a prepared answer for that one. “I don’t know enough.”\nThe Shet and the Ki looked at each other, for the first time. He felt they’d been through the motions, and they were agreeing to quit.\n“As you know,” rumbled Bhvaaan, “The Ruling An must give permission. The An-he will see you?”\n“I have an appointment.”\n“Then thap’s all for now. Enjoy your transit hangover in peace.”\nPatrice Ferringhi took a moment, looking puzzled, before he realized he could go. He stood, hesitated, gave an odd little bow and left the room.\nThe Shet and the Ki relaxed somewhat.\n“Collapsed at work,” said Roaaat Bhvaaan. “Thap’s not good.”\n“We can’t all be made of stone, Shet.”\n“Aaah well. Cross fingers, Chief.”\nThey were resigned to strange English figures of speech. The language of Speranza, of diplomacy, was also the language of interplanetary policing. You became fluent, or you relied on unreliable transaid: and you screwed up.\n“And all my toes,” said the Ki.\nOn his way to his cabin, Patrice found an ob-bay. He stared into a hollow sphere, permeated by the star-pricked darkness of KiAn system space: the limb of the planet obscured, the mainstar and the blue “daystar” out of sight. Knurled objects flew around, suddenly making endless field-beams visible. One lump rushed straight at him, growing huge: seemed to miss the ob-bay by centimeters, with a roar like monstrous thunder. The big impacts could be close enough to make this Refuge shake. He’d felt that, already. Like the Gods throwing giant furniture about—\nHe could not get over the fact that nothing was real. Everything had been translated here by the Buonarotti Torus, as pure data. This habitat, this shipboard jumper he wore, this body. All made over again, out of local elements, as if in a 3D scanner . . . The scarred Ki woman fascinated him, he hardly knew why. The portent he felt in their meeting (had he really met her?) was what they call a “transit hangover.” He must sleep it off.\nThe Ki-anna was rated Chief of Police, but she walked the beat most days. All her officers above nightstick grade were seconded from the Ruling An’s Household Guard: she didn’t like to impose on them. The Ki—natural street-dwellers, if ever life was natural again—melted indoors as she approached. Her uniform, backed by Speranza, should have made the refugees feel safe: but none of them trusted her. The only people she could talk to were the habitual criminals. They appreciated the Ruling An’s strange appointment.\nShe made her rounds, visiting the nests where law-abiding people better stay away. The gangsters knew a human had “joined the station.”\nThey were very curious. She sniffed the wind and lounged with the idlers, giving up Patrice Ferringhi in scraps, a resource to be conserved. The pressure of the human’s strange eyes was still with her—\nNo one ought to look at her scars like that, it was indecent.\nBut he was an alien, he didn’t know how to behave.\nShe didn’t remember being chosen for the treatment that would render her flesh delectable, while ensuring that what happened wouldn’t kill her. She only knew she’d been sold (tradition called it an honor) so that her littermates could live. She would always wonder, why me? What was wrong with me? We were very poor, I understand that, but why me? It had all been for nothing, anyway. Her parents and her littermates were dead, along with everyone else. So few survivors! A handful of die-hards on the surface. A token number of Ki taken away to Speranza, in the staggeringly distant Blue System. Would they ever return? The Ki-anna thought not . . . Six Refuge Habitats in orbit. And of course some of the Heaven-born, who’d seen what was coming before the war, and escaped to Balas or to Shet.\nAt curfew she filed a routine report, and retired to her quarters in the Curtain Wall. Roaaat, who was sharing her living space, was already at home. It was fortunate that Shet didn’t normally like to sit in Speranza-style “chairs”: he’d have broken a hole in her ceiling. His bulk, as he lay at ease, dwarfed her largest room. They compared notes.\n“All the Refuges have problems,” said the Ki-anna. “But I get the feeling I have more than my share. Extortion, intimidation, theft and violence—”\n“We can grease the wheels,” said Roaaat. “Strictly off the record, we can pay your villains off. It’s distasteful, not the way to do police work.”\n“But expedient.”\n“Aap . . . He seemed very taken with you,” said Roaaat.\n“The human? I don’t know how you make that out.”\n“Thap handsome Blue, yaas. I could smell pheromones.”\n“He isn’t a ‘Blue’ ” said the Ki-anna. “The almighty Blues rule Speranza. The humans left behind on Earth, or ‘Mars’—What is ‘Mars’? Is it a moon?”\n“Noope. A smaller planet in the Blue system.”\n“Well, they aren’t Blues, they’re just ordinary aliens.”\n“I shall give up matchmaking. You don’t appreciate my help . . . Let’s hope the An-he finds your ordinary alien more attractive.”\nThe Ki-anna shivered. “I think he will. He’s a simple soul.”\nRoaaat was an undemanding guest, despite his size. They shared a meal, based on “culturally neutral” Speranza Food Aid. The Shet spread his bedding. The Ki-anna groomed herself, crouched by a screen that showed views of the Warrens. Nothing untoward stirred, in the simulated night. She pressed knuckle-fur to her mouth. Sometimes the pain of living, haunted by the uncounted dead, became very hard to bear. Waking from every sleep to remember afresh that there was nothing left.\n“I might yet back out, Officer Bhvaaan. What if we only succeed in feeding the monsters, and make bad worse?”\nShe unfolded her nest, and settled behind him.\nHe patted her side with his clubbed fist—it felt like being clobbered by a kindly rock. “See how it goes. You can back out later.”\nThe Ki-anna lay sleepless, wondering about Patrice Ferringhi; the bulk of her unacknowledged bodyguard between her and the teeth of the An\nWhen his appointment with alien royalty came around, Patrice was glad he’d had a breathing space. The world was solid again, he felt in control of himself. He donned his new transaid, settling the pickup against his skull, and set out for the high-security bulkhead gate that led to the Refuge Habitat itself.\nArmored guards, intimidatingly tall, were waiting on the other side. They bent their heads, exhaled breath loudly—and indicated that he was to get into a kind of floating palanquin. Probably they knew no English.\nThe guards jogged around him in a hollow square: between their bodies he glimpsed the approach to an actual castle, like something in a fantasy game. Like a recreation of Mediaeval Europe or Japan, rising from a mass of basic living modules. It was amazing. He’d never been inside a big space-station before, not counting a few hours in Speranza Transit Port. The false horizon, the lilac sky, arcing far above the castle’s bannered towers, would have fooled him completely, if he hadn’t known.\nHe met the An-he in a windowless, antique chamber hung with tapestries (at least, tapestries seemed like the right word). Sleekly upholstered couches were scattered over the floor. The guard who’d escorted him backed out, snorting. Patrice looked around, vaguely bothered by an overly-warm indoor breeze. He saw someone almost human, loose-limbed and handsome in Speranza tailoring, reclining on a couch—large, wide-spaced eyes alight with curiosity—and realized he was alone with the king.\n“Excuse my steward,” said the An. “He doesn’t speak English well, and doesn’t like to embarrass himself by trying. Please, be at home.”\n“Thank you for seeing me,” said Patrice. “Your, er, Majesty—?”\nThe An-he grinned. “You are Patrice. I am the An, let’s just talk.”\nThe young co-ruler was charming and direct. He asked about the police: Patrice noted, disappointed, that Ki-anna was a title, the Ki-she, or something. He wondered what you had to do to learn their personal names.\n“It was a brief interview,” he admitted, ruefully. “I got the impression they weren’t very interested.”\n“Well, I am interested. Lione was a great friend to my people. To both my peoples. I’m not sure I understand, were you partners, or litter-mates?”\n“We were twins, that means litter-mates, but ‘partners’ too, though our careers took different directions.”\nHe needed to get partner into the conversation. The An partnership wasn’t sexual, but it was lifelong, and the closest social and emotional bond they knew. A lost partner justified his appeal.\nThe An-he touched the clip on the side of his head (he was using a transaid, too), reflexively. “A double loss, poor Patrice. Please do confide in me, it will help enormously if you are completely frank—”\nIn this pairing, the An-she was the senior. She made the decisions, but Patrice couldn’t meet her, she was too important. He could only work on the An-he, who would (hopefully) promote his cause . . . He had the eerie thought that he was doing exactly what Lione had done—trying to make a good impression on this alien aristocrat, maybe in this very room. The tapestries (if that was the word) swam and rippled in the moving air, drawing his attention to scenes he really didn’t want to examine. Brightly dressed lords and ladies gathered for the hunt. The game was driven onto the guns. The butchery, the bustling kitchen scenes, the banquet—\nHe realized, horrified, that his host had asked him something about his work on Mars, and he hadn’t heard the question.\n“Oh,” said the An-he, easily. “I see what you’re looking at. Don’t be offended, it’s all in the past, and priceless, marvelous art. Recreated, sadly. The originals were destroyed, along with the original of this castle. But still, our heritage! Don’t you Blues love ancient battle scenes, heaps of painted slaughter? And by the way, aren’t you closely related, limb for limb and bone for bone, to the beings that you traditionally kill and eat?”\n“Not on Mars.”\n“There, you are sundered from your web of life. At home on Earth, the natural humans do it all the time, I assure you.”\n“I don’t know what to say.”\nNotoriously, the Ki and the An had both been affronted when they were identified, by other sentient bipeds, as a single species. Of course they knew, but an indecent topic! In ways, the most disturbing aspect of “the KiAn issue” was not the genocidal war, in which the oppressed had risen up, savagely, against the oppressors. It was the fact that some highly respected Ki leaders actually defended “the traditional diet of the An.”\nThe An-he showed his bright white teeth. “Then you have an open mind, my dear Patrice! It gives me hope that you’ll come to understand us.” He stretched, and exhaled noisily. “Enough. All I can tell you today is that your request is under consideration. You’re a valuable person, and it’s dangerous down there! We don’t want to lose you. Now, I suppose you’d like to see your sister’s rooms? She stayed with us, you know: here in the castle.”\n“Would that be possible?”\n“Certainly! I’ll get some people to take you.”\nMore guards—or servants in military-looking uniform—led him along winding, irregular corridors, all plagued by that insistent breeze, and opened a round plug of a doorway. The An-he’s face appeared, on a display screen emblazoned on a guard’s tunic.\n“Take as long as you like, dear Patrice. Don’t be afraid of disturbing the evidence! The police took anything they thought was useful, ages ago.”\nThe guards gave him privacy, which he had not expected: they shut the door and stayed outside. He was alone, in his sister’s space. The eons he’d crossed, the unthinkable interstellar distance, vanished. Lione was here. He could feel her, all around him. The warm air, suddenly still, seemed full of images: glimpses of his sister, rushing into his mind—\n“Recreation” was skin-deep here. Essentially the room was identical to his cabin. A bed-shelf with a puffy mattress; storage space beneath. A desk, a closet bathroom, stripped of fittings. Her effects had been returned to Mars, couriered as data. The police had been and gone “ages ago.” What could this empty box tell him? Nothing, but he had to try.\nWas he under surveillance? He decided he didn’t care.\nHe searched swiftly, efficiently, studying the floor, running his hands over the walls and closet space, checking the seals on the mattress. The screen above the desk was set in an ornate decorative frame. He probed around it, and his fingertips brushed something that had slipped behind. Carefully, patiently, he teased out a corner of the object, and drew it from hiding.\nLione, he whispered.\nHe tucked his prize inside the breast of his shipboard jumper, and went to knock on the round door. It opened, and the guards were there.\n“I’m ready to leave now.”\nThe An-he looked out of the tunic display again. “By all means! But don’t be a stranger. Come and see me again, come often!”\nThat evening he searched the little tablet’s drive for his own name, for a message. He tried every password of theirs he could remember: found nothing, and was heartbroken. He barely noted the contents, except that it wasn’t about her work. Next day, to his great surprise, he was recalled to the castle. He met the An-he as before, and learned that the Ruling An would like to approve his mission, but the police were making difficulties.\n“Speranza doesn’t mind having a tragedy associated with their showcase Project,” said the young king. “A scandal would be much worse, so they want to bury this. My partner and I feel you have a right to investigate, but we have met with resistance.”\nThere was nothing Patrice could do . . . and it wasn’t a refusal. If the alien royals were on his side, the police would probably be helpless in the end. Back in his cabin he examined the tablet again and realized that Lione had been keeping a private record of her encounter with “the KiAn issue.”\nKiAn isn’t like other worlds of the Diaspora; they didn’t have a Conventional Space Age before First Contact. But they weren’t primitives when “we” found them, nor even Mediaeval. The An of today are the remnant of a planetary superpower. They were always the Great Nation, and the many nations of the Ki were treated as inferior, through millennia of civilization. But it was no more than fifteen hundred standard years ago, when, in a time of famine, the An or “Heaven Born” first began to hunt and eat the “Earth Born” Ki. They don’t do that anymore. They have painless processing plants (or did). They have retail packaging—\nCannibalism happens. It’s known in every sentient and pre-sentient biped species. What developed on KiAn is different, and the so-called “atavists” are not really atavist. This isn’t the survival, as some on Speranza would like to believe, of an ancient prehistoric symbiosis. The An weren’t animals, when this “stable genocide” began. They were people, who could think and feel. People, like us.\nThe entry was text-only, but he heard his sister’s voice: forthright, uncompromising. She must have forced herself to be more tactful with the An-he! The next was video. Lione, talking to him. Living and breathing.\nInside the slim case, when he opened it, he’d found pressed fragments of a moss, or lichen. Shards of it clung to his fingers; it smelled odd, but not unpleasant. He sniffed his fingertips and turned pages, painfully happy.\nDays passed, in a rhythm of light and darkness that belonged to the planet “below.” Patrice shuttled between the “station visitors quarters,” where he was the only guest, and the An castle. He didn’t dare refuse a summons, although he politely declined all dinner invitations, which made the An laugh.\nThe odd couple showed no interest in Patrice at all, and did not return his calls. He might have tried harder to get their attention, but there was Lione’s journal. He didn’t want to hand it over; or to lie about it either.\nOnce, as they walked in the castle’s galleries, the insistent breeze nagging at him as usual, Patrice felt he was being watched. He looked up. From a high, curtained balcony a wide-eyed, narrow face was looking down intently. “That was the An-she,” murmured his companion, stooping to exhale the words in Patrice’s ear. “She likes you, or she wouldn’t have let you glimpse her . . . I tell her all about you.”\n“I didn’t really see anything,” said Patrice, wary of causing offence. “The breeze is so strong, tossing the curtains about.”\n“I’m afraid we’re obsessed with air circulation, due to the crowded accommodation. There are aliens about, who don’t always smell very nice.”\n“I’m very sorry! I had no idea!”\n“Oh no, Patrice, not you. You smell fresh and sweet.”\nThe entries in Lione’s journal weren’t dated, but they charted a progress. At first he was afraid he’d find Lione actually defending industrial cannibalism. That never happened. But as he immersed himself, reviewing every entry over and over, he knew Lione was asking him to understand. Not to accept, but to understand the unthinkable—\nCompare chattel slavery. We look on the buying and selling of sentient bipeds, as if they were livestock, with revulsion. Who could question that? Then think of the intense bond between a beloved master, or mistress, and a beloved servant. A revered commanding officer and devoted troops. Must this go too? The An and the Ki accept that their way of life must change. But there is a deep equality in that exchange of being, which we “democratic individualists” can’t recognize—\nPatrice thought of the Ki-Anna’s scars.\nThe “deep equality” entry was almost the last.\nThe journal ended abruptly, with no sense of closure.\nLione’s incense—he’d decided the “lichen” was a kind of KiAn incense, perhaps a present from the An-he—filled his cabin with a subtle perfume. He closed the tablet, murmuring the words he knew by heart, a deep equality in that exchange of being, and decided to turn in. In his tiny bathroom, for a piercing moment it was Lione he saw in the mirror. A dark-skinned, light-eyed, serious young woman, with the aquiline bones of their North African ancestry. His other self, who had left him so far behind—\nThe whole journal was a message. It called him to follow her, and he didn’t yet know where his passionate journey would end.\nWhen he learned that permission to visit the surface was granted, but the Ki-anna and the Interplanetary Affairs officer were coming too, he knew that the Ruling An had been forced to make this concession—and the bargaining was over. He just wished he knew why the police had insisted on escorting him. To help Patrice discover the truth? Or to prevent him?\nHe didn’t meet the odd couple until they embarked together. They were all in full protective gear: skin sealed with quarantine film, under soft-shell life-support suits. The noisy shuttle bay put a damper on conversation, and the flight was no more sociable. Patrice spent it encased in an escape capsule and breathing tanked air: the police insisted on this. He saw nothing of KiAn until he was crunching across the seared rubble of their landing field.\nThe landscape was dry tundra, like Martian desert color-shifted into shades of gray and green. Armed Green Belts were waiting, with a landship and all-terrain hardsuits for the visitors.\n“The An-he offered me a military escort,” said Patrice, freedom of speech restored by helmet radio. “What was wrong with that?”\n“Sorry,” grunted Bhvaaan. “Couldn’t be allowed.”\nThe Ki-anna said nothing. He remembered, vividly, the way he’d felt at their meeting. There had been a connection, on her side too: he knew it. Now she was just another bulky Speranza doll, on a smaller scale than her partner. As if she’d read his thoughts, she cleared her faceplate and looked out at him, curiously. He wanted to tell her that he understood KiAn, better than she could imagine . . . but not with Bhvaaan around.\n“You’ve been keeping yourself to yourself, Messer Ferringhi.”\n“I could say the same of you two, Officer Bhvaaan.”\n“Aap. But you made friends with the An-he.”\n“The Ruling An were very willing to help me.”\n“We’ve been working in your interest too,” said the Ki-anna. She pivoted her suit to look through the windowband in the landship’s flank. “Far below this plateau, back that way, was the regional capital. Were fertile plains, rich forests, towns and fields and parklands. The ‘roof of Heaven’ was never beautiful. It’s strange, this part hardly seems much changed—”\n“Except that one dare not breathe,” she added, sadly.\nOn the shore of the largest ice sheet, the Lake of Heaven, the odd couple and Patrice disembarked. The Ki-anna led the way to a great low arch of rock-embedded ice. The Green Belts had stayed in the ship.\nEverything was livid mist.\n“We’re going under An-lalhar Lake alone?”\n“The Green Belts’ll be on call. It’s not their jurisdiction down there. It’s a precious enclave where the Ki and the An are stubbornly dying together.” Bhvaaan peered at him. “It’s not our jurisdiction either, Messer Ferringhi. If we meet with violence we can protect you, but that’s after the event and it might not save your life. The people under the Lake don’t have a lot to lose and their mood is volatile. Bear that in mind.”\n“I could have had an escort they’d respect.”\n“You’re better off with us.”\nThey descended the tunnel. The light never grew less; on the contrary, it grew brighter. When they emerged, the Heaven Lake was above them: a mass of blue-white radiance, indigo shadowed, shot through with rainbow refractions. It was extraordinarily beautiful. It seemed impossible that the ice had captured so much light from the poisoned smog. Far off, in the center of the glacial depression, geothermal vents made a glowing, spiderweb pattern of fire and snowy steam. Patrice checked his telltales, and eagerly began to release his helmet. The Shet dropped a gauntleted fist on his arm.\n“Don’t do it, child. Look at your rads.”\n“A moment won’t kill me. I want to feel KiAn—”\nThe odd couple, hidden in their gear, seemed to look at him strangely.\n“Maybe later,” said the Ki-anna, soothingly. “It’s safer in the Grottos, where your sister was headed.”\n“How do we get there?”\n“We walk,” rumbled Bhvaaan. “No vehicles. There’s not much growing but it’s still a sacred park. Let your suit do the work; keep up your fluids.”\n“Thanks, I know how to handle a hard shell.”\nThey walked in file. The desolation, the ruined beauty that had been revered by both “races,” caught at Patrice’s heart. His helmet display counted rads, paces, heart rate: counted down the meters. Thirty kilometers to the place where Lione had last been seen alive.\n“Which faction mined the Lake of Heaven parkland?”\n“To our knowledge? Nobody did, child.”\nIt was a question he’d asked over and over, long ago when he thought he could get answers. Now he asked and didn’t care. He followed the Shet, the Ki-anna behind him. His pace was steady, yet the display said his body was pumping adrenalin; not from fear, he knew, but in the grip of intense excitement. He sucked on glucose and tried to calm himself.\nAs the radiance above them dimmed, they reached the Grotto domain. Rugged rocky pillars seemed to hold up the roof of ice, widely spaced at first, clustering towards a center that could not be seen. There was a Ki community, surviving in rad-proofed modules. The Ki-anna went inside. Patrice and the Shet waited, in the darkening blighted landscape. She emerged after an hour or so.\n“We can’t go on without guides, and we can’t have guides until tomorrow. At the earliest. They have to think it over.”\n“They weren’t expecting us?”\n“They were. They know all about it, but they may have had fresh instructions. They’re in full communication with the castle: there’s some sophisticated kit in there. We’ll just have to wait.”\n“Do they remember Lione?” demanded Patrice. “I have transaid, I want to talk to someone.”\n“Not now. I’ll ask tomorrow.”\n“Can we sleep indoors?” asked the Shet.\n“No.”\nThe Shet and the Ki-anna made camp in the ruins of the former village, using their suits to clear ground and construct a shelter. Patrice moved over to a heap of boulders where he’d noticed patches of lichen. He had fragments of Lione’s incense in the sleeve pocket of his inner, in a First Aid pouch. The police were fully occupied: furtively he opened the arm of his hardshell, and fished the pouch out. He was right, it was the same—\nLione had stood here. The incense was not a gift, she had gathered it. She had been standing right here. His need was irresistible. He released his face-plate, stripped his gauntlets, rubbed away quarantine film.\nKiAn rushed in on him, cold and harsh in his throat, intoxicating—\n“What is that?”\nThe Ki-anna was behind him. “A lichen sample,” said Patrice, caught out. “Or that’s what I’d call it at home. It was in my sister’s room, in the An Castle. Look, they’re the same!”\n“Not quite,” said the Ki-anna. “Yours is a cultivated variety.”\nHe thought she’d be angry, maybe accuse him of concealing evidence. To his astonishment she took his bared hand, and bowed over it until her cheek brushed the vulnerable inner skin of his wrist. Her touch was a huge shock, sweet and profoundly sexual. She made him dizzy.\nThis can’t be happening, he thought. I’m here for Lione—\n“I don’t know your name.”\n“We don’t do that,” she whispered.\n“I felt, I can’t describe it, the moment I met you—”\n“I’d better keep this. You must get your gloves and helmet back on.”\n“But I want KiAn—”\nGently, she let go of his hand. “You’ve had enough.”\nThe shelter was a snug fit. Sealed inside, they shared rations and drank fresh water they’d brought from the Habitat. They would sleep in their suits, for warmth and security. Patrice lay down at once, to escape their questions and to be alone with his confusion. He was here for Lione, he was here to join Lione. How could he and the Ki-anna suddenly feel this way?\n“Were you getting romantic, with Patrice, over by those rocks?” asked Bhvaaan. “Sniffing his pheromones?”\n“No,” said the Ki-anna, grimly. “Something else.”\nShe showed him the First Aid pouch and its contents.\n“Mighty Void!”\n“He says it was in the room Lione used, in the castle.”\n“I don’t think so! We took that cabin apart.” The Shet’s delicates unfolded from his club of a fist. He turned the clear pouch around, probing her find with sensitive tentacles. “So that’s how, so that’s how—”\n“So that’s how the cookie was crumbled,” agreed the Ki-anna.\n“What do we do, Chief? Abort this, and run away very quickly?”\n“Not without back-up. If we run, and they have heavy weaponry, we’re at their mercy. I see what it looks like, but we should show no alarm.”\n“I have had thoughts about him,” she murmured, looking at the dark outline of Patrice Ferringhi. “Don’t know why. It’s something in his eyes.”\n“Thaap’s the way it starts,” said the Shet. “Thoughts. Then wondering if anything can come of them. They say sentient bipeds are attracted to each other like . . . like brothers and sisters, long separated. Well, I’ll talk to the Greenies. And you and I had better not sleep.”\nThe suit was a house the shape of her body. She sat in it, wondering about sexual pleasure: pleasure with Patrice. What would it be like? She had only one strange comparison, but that didn’t frighten her . . . What Roaaat Bhvaaan offered was far more disturbing.\nShe glimpsed the abyss, and fell into oblivion.\nPatrice dreamed he was in a strolling crowd, among bronze and purple trees, with branches that swayed in the breeze. He knew where he was, he was in the KiAn Orientation, a virtual reality. But there was something sinister going on, the crowd pressed too close, the beautiful trees hid what he ought to see. Then Lione came running up and bit him.\nHe yelled, and shook her off.\nShe came back and bit his thigh, but now he was in the dark, cold and sore. Lione was gone, he was being hunted by fierce hungry animals—\nSuddenly he knew he was not asleep.\nHe was completely naked. Where was his suit? Where was he?\nHe had no idea. The air was freezing, the darkness almost complete. He stumbled towards a gleam ahead, and entered a rocky cave. There was ice underfoot, icy stalactites hanging down. A lamp burned incense-scented oil, set on the ground next to a heap of something—\nThat’s a body, he thought. He went over and knelt down. It was a human body, freeze-dried. She was curled on her side, turned away from him, but he knew he’d found Lione. She was naked too.\nWhy was she naked?\nHe lifted the lamp and saw where flesh had been cut away, not by teeth, as in his dream, but by sharp knives. Lione had been butchered. He tried to turn her: the body moved all of a piece. Her face was recognizable, smooth and calm in death, the eyes sunken, the skin like cured leather. Was she smiling? Oh, Lione—\nBut why am I naked? he thought. Who brought me here?\nThe Ki entered the cave, and surrounded Patrice and his sister. They had brought more lights. One of them was carrying, reverently, a flattened spherical object, dull gray, the size of Patrice’s fist. It had a seam around the center, a beveled cap. That’s a vapor mine, he thought, shaken by an explosion of understanding. Then the An came. The Ki made no attempt to interfere with the banquet. They were here to witness. Patrice screamed. He fought the knives with his bare hands, kicked out with his bare feet. The An, outraged, kept yelling at him in scraps of English to keep still, be easy Blue, you want this, what’s wrong with you?\nThe Ki-anna and the Shet had ditched their hard shells, to search the narrow passages. They arrived armed but badly outnumbered, and they couldn’t get near Patrice. “I was the Earth In Heaven!” shouted the Chief of Police. “I say that flesh is not sacred, not yours to take. Let the stranger go!”\nShe held the fanatics at bay, uncertain because of her former status, until the Green Belts joined the party. Luckily Bhvaaan had summoned them, before he and the Ki-anna followed Patrice into that drugged sleep.\nPatrice’s injuries were not dangerous. As soon as he was allowed he signed himself out of medical care. He had to talk to the police again. He met the odd couple in the same bare interview room as before.\n“I’m sorry, I need to withdraw my statement. I can’t press charges.”\nIf the next of kin didn’t press charges, KiAn law made it difficult for Interplanetary Affairs to prosecute. He knew that, but he had no choice.\n“I realize the tablet I found in Lione’s room was planted on me. I know her words, if some of them were genuinely hers, had been rearranged to fool me into accepting atavism. It doesn’t matter. My sister wanted to die that way. She gave herself, her body. It was a ritual sacrifice, for peace. She was my twin, I can’t explain, I have to respect her wishes.”\n“A beautiful, consensual ritual,” remarked the Shet. “Yaap. That’s what the cannibal die-hards always say. But if you scratch any of these halfway ‘respectable’ atavists, such as our Ruling An here—”\n“You find the meat-packing industry,” said the Ki-anna.\nPatrice heard the blinkered, Speranza mindset.\n“My sister was willing.”\n“I believe she was.” To his confusion, the Ki-anna reached out, took his injured hand and held his wrist, where the blood ran, to her face. The same sweet, intimate gesture as on KiAn. “So are you, a little. It’ll wear off.”\nShe drew back, and placed an evidence bag, containing his First Aid pouch and the scraps of lichen, on the table.\n“In English, the common name of this herb, or lichen, would be ‘Willingness.’ It grows naturally only under the Lake of Heaven. Long ago it was known as a powerful aphrodisiac: the labwork kind has another use. It’s given to a child chosen to be the Ki-anna, which means sold to the An as living meat. It’s a refined form of cannibalism, practiced in my region. A drugged child, a willing victim, with a strong resistance to infection and trauma, is eaten alive, by degrees. If one of these children survives to adulthood, they are free, the debt is paid.\nThe Ki-anna showed her teeth. “I made it, as you see; but I haven’t forgotten that scent. When I smelled your flesh, under the Lake, I knew you’d been treated for butchery—and I understood. They drugged Lione until she was delirious with joy to be eaten, and they sent her to the atavist fanatics under An-lalhar. Then they tried the same trick on you.”\nBhvaaan tapped the casefile tablet with his delicates. “Your sister died too quickly, that was the problem.”\n“What—?”\n“We couldn’t prove it, but we knew they’d killed Lione, Messer Ferringhi. We could even show, thanks to the Chief here, who was pulling the strings, and how they got the prohibited ordnance into the Grottos. Your sister fell into a trap. She had to get under the Heaven Lake and that suited the atavists just fine. It would have been a powerful message. A Speranza scientist ritually eaten, then consumed by the very air of KiAn—”\n“Controlled annihilation,” whispered Patrice. “That’s what I saw, in the cave. Something they would understand—”\n“Thap was the idea. The atavists are planning to bring back the meat factories, once their planet has an atmosphere again. Your sister was going to help them: except something didn’t work out. You were right about the tropo sampling: there’s also stringent military activity monitoring. If a mine had gone off under the Lake, we’d know. If a human-sized body had been atomized, there’d have been a spike. So we knew the ‘consummation’ hadn’t happened, and we couldn’t figure it out. We think we know the answer now: she died too quickly. She had to be vaporized alive, a dead body can’t be willing. But she wasn’t a Ki, and they hit an artery or something.”\nPatrice had gone gray in the face.\n“You going to crash out, child—?”\n“No, go on—”\nThe Shet rearranged his bulk on the inadequate office chair. “The autopsy’ll tell us the details. Then you came along, Patrice. We saw a chance to get ourselves to the crime scene, and wasted Diaspora funds pushing on an open door. And you nearly died, because we drank the nice fresh water from this Habitat. Which happened to be doped—”\n“The atavists thought the willingness they’d cooked up for Lione would work on you,” explained the Ki-anna. “They’ve never heard of ‘fraternal twins.’ Ki litter-mates can be of any sex, but otherwise they are identical. You were begging to be lured to the Grottos, it was perfect, you would replace Dr Ferringhi. Luckily, you and your sister weren’t clones. You were affected, but you weren’t ready to be butchered. You fought for your life.”\n“You see, Messer Ferringhi,” said Bhvaaan, “what really happened here is that a pair of murdering atavist bastards thought they’d appoint themselves as Chief of Police a child who had been eaten. A girl like that, they thought, will never dare to do us any damage. Instead they found they had a tiger by the tail . . . ” He opened the casefile tablet, and pushed it over to Patrice. “They’re glamorous, the Atavist An. But your sister would never have fallen for them in her right mind, from what I’ve learned of her. Still want to withdraw this?”\nPatrice was silent, eyes down. The Ki-anna saw him shedding the exaltation of the drug; quietly taking in everything he’d been told. A new firmness in the lines of his face, a deep sadness as he said farewell to Lione. The human felt her eyes. He looked up and she saw another farewell, sad but final, to something that had barely begun—\n“No,” he said. “But I should go through it again. Can we do that now?”\nThe Ki-anna returned to her quarters.\nRoaaat joined her in a while. She sat by her window on the streets, small chin on her silky paws, and didn’t look round when he came in.\n“He’ll be fine. What will you do? You’ll have to leave, after this.”\n“I know. Leave or get killed, and I must not get killed.”\n“You could go with Patrice, see what Mars is like.”\n“I don’t think so. The pheromones are no more, now that he knows what ‘making love to the Ki-anna’ is supposed to be like.”\n“I’ve no idea what making love to you is supposed to be like. But you’re a damned fine investigator. Why don’t you come to Speranza?”\nYes, she thought. I knew all along what you were offering.\nBanishment, not just from my own world, but from all the worlds. Never to be a planet-dweller any more. And again I want to ask, Why me? What did I do? But you believe it is an honor and I think you are sincere.\n“Maybe I will.”\nOriginally published in Engineering Infinity, edited by Jonathan Strahan.\nGwyneth Jones was born in Manchester, England and is the author of more than twenty novels for teenagers, mostly under the name Ann Halam, and several highly regarded SF novels for adults. She has won two World Fantasy awards, the Arthur C. Clarke award, the British Science Fiction Association short story award, the Dracula Society's Children of the Night award, the Philip K. Dick award, and shared the first Tiptree award, in 1992, with Eleanor Arnason. Her most recent books are novel Spirit and essay collection Imagination/Space. Upcoming is new story collection The Universe of Things. She lives in Brighton, UK, with her husband and son; a Tonkinese cat called Ginger and her young friend Milo."}