{"fingerprint": "S0Sr2UW7hn9S8h9TYsGoCWQ1lcs=", "sitename": "Clarkesworld Magazine", "title": "One in a Million by Rodrigo Juri", "author": "Rodrigo Juri", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/juri_07_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: One in a Million by Rodrigo Juri", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8890 words, novelette\nOne in a Million\n“After so many years, it is strange that we should thus meet again, Estella, here where our first meeting was! Do you often come back?”\n–Charles Dickens, Great Expectations\n1\nOne in a million. In a billion. That’s the life we lived. Like a particle of dust floating in the infinite ocean. Just that. And here we are again, looking out the window of the plane over those islands, green emeralds scattered over an immeasurable blue velvet mantle.\nYes. We’ve decided to do it in the old ways. By now we could be down there, enjoying the sun, the sea, the warm sands. But there’s no rush. We have all the time in the world, and we have chosen to wait a little longer. In an age of instant pleasures, expectation and anxiety are delicacies that only connoisseurs know how to appreciate.\nThat morning we woke up in our old room, in our parents’ mansion in Boca Raton. There shouldn’t be much left of it, won back by the swamps, abandoned for decades. But today we’ve walked through its corridors and in its large lounge while arranging our luggage. Just a few things in the suitcase, what was really important; our favorite guayabera and some bath shorts, razor blades and our usual perfume. The guitar. Oh yes, the guitar. How long has it been since the last time we extracted the sound of some melody from its strings? We no longer remember. A long time ago. Soon we will be able to play it close to a bonfire under the stars of a splendorous night sky.\nThe taxi arrived just in time. Once on board, we saw the fast parade of palm trees as we headed for the airport. Flight to San Juan de Puerto Rico, no other passengers. There we changed to an airplane, the same one on which we were now waiting for the moment to land on Isla Inocencia.\nA whole life. The one we had to live. And we go back to the beginning. Where we should have returned long before. From where we would never have wanted to leave. We were so young. Now so old. But it doesn’t matter, we’re back.\nThose were the last days of human history. But of course, we knew nothing. Perhaps no one knew, though the signs were everywhere. But we understood that much later. Do not ask a fourteen-year-old boy to understand how the world runs and what things can make it stop.\nOur name then was Luis Javier. It still is, isn’t it? Luis Javier Fontiveros. The only son of Don José Luis Fontiveros, one of the big fishes of the Shimato-Dominguez, the corporation that Helps America into the New World, and of Doña Lorena de Fontiveros, model and actress of Mexican soap operas. They had once been a happy couple, but that time had passed. He had another woman. She fell into a deep depression that led to attempted suicide and ended up in a psychiatric clinic for several months. At the worst possible moment. Our father had been planning the dream vacation with his new darling, away from everything, and especially from his ex-family. Now he had to take care of his brat.\nOf course, there was something else, but we wouldn’t know it until much later. At the time, it just seemed like a pathetic effort to show some decency. We would have preferred to be left in our room, with our computer, our comics, and our Korean punk metal music. We told him no, that we want to be alone. But that angered him even more. He told us terrible things and gave us a beating that we still remember with bitterness. We never understood why our mother still loved him. She missed him until the end of her days, which weren’t many because she died a few years later. Overdose.\nThe fact is, we ended up on that plane, resentful of the world, of our father, and of his new lover we met there. She could have been our older sister. We were upset and also kind of envious, which disgusted us even more. She tried to start some conversation, but we were not very polite. Our father did not intervene. He seemed annoyed. Perhaps, at last, embarrassed. There were no more words. We put on our headphones and forgot about everything. We just wanted that nightmare to happen soon.\nOur destination was El Archipelago de las Delicias, the newest and most spectacular resort in the Caribbean, and also the most expensive. Built by the Shimato-Dominguez itself, it was a bunch of small artificial islands floating somewhere east of Puerto Rico. A place of warm beaches and green rainforest. A site that promised its clientele a myriad of pleasurable and innovative experiences, some of which were the result of the latest technological advances developed by the company, and others that were of a much more primitive nature.\nThe truth is that by then the Archipelago had not even been opened yet, the great moment postponed as a consequence of the last economic crisis. At the moment, we were among the few guests invited for the trial run, a weirdo within a small and exclusive group of hedonistic aristocrats.\nWe arrived first on Isla Inocencia, the smallest of the islands. Our island. Our father and his darling will go on their way to Isla Deseo, where a whole week of exotic pleasures waited for them. Only adults allowed.\nWe stayed on there, in the landing field, with our luggage and not knowing what to do. A middle-aged woman shows off in her black T-shirt, brown shorts, and leather boots. The babysitter. Because that’s what Isla Inocencia was. The place for the children of those customers who had not been able to find another way to get rid of them. And she was the one who would have to deal with all those arrogant little brats, the natural seed of selfish parents whose last concern was the creatures that they had brought into the world.\nWell, she shouldn’t expect any trouble from us. We just wanted to get into our room, rest for a while, and then connect to the Internet to talk with our cyber-friends. If the woman didn’t cause us trouble, we wouldn’t do it to her either. Live and let live, and we would all be a little less unhappy in that hell. But of course, things never turn out the way you plan them. For better or worse. Yes, because even if it’s hard to believe, sometimes it’s for the best.\nWe threw ourselves on the bed and fell asleep immediately. After some time, there was a knock on the door, which we regrettably answered with sleep still in our eyes. There was the woman again. We wanted to say something, make her understand that all we wanted was to be left alone. But she got ahead of us.\n“Luis Javier. I wanted to introduce you to Estela. She is one of our employees here on the Island, but since there are no other customers I thought she could keep you some company,” she explained.\nBehind the woman, a small girl. Blonde hair and bright eyes. A lovely smile on her angelical face. We’re not saying that we fell in love at that very moment, maybe it was later. But that first impression was enough to instantly quell our bad temper. The woman could not hide her satisfaction. She’d won. We would be a tender puppy in her hands.\n“Why don’t you go to the beach? The day is beautiful,” she proposed. “I’ll take care of your things.”\n“But . . . ” we started, trying to make her see that Estela could have another thing to do with her time.\n“But nothing. Go and have fun. Now,” she commanded.\nEstela stepped forward and took our hands.\n“Come on, Luis Javier,” she said, taking us out of there.\n2\nWe said that was the beginning of the end. We remembered it. The day it happened we were in one of the refugee camps that had been set up on the Guatemalan coast after Hurricane Valeria devastated the country. We had just graduated from John Hopkins’ med school and had applied for a position in a humanitarian aid organization with full availability to go where we were most needed.\nOf course, we were our father’s greatest disappointment. He never stopped insisting that we should study business and follow in his footsteps in the corporation. No. We didn’t want anything to do with our father or the Shimato-Dominguez. No, no. Our dream was to work in a small rural town, far away from supercomputers, androids, and AIs. Far from everything that could remind us of what they’d done to us. It was midafternoon and we were sleeping on one of the camp beds, overcome by fatigue and heat, when one of our colleagues, a Chilean guy named Sergio, came to warn us.\n“Luija, are you online?”\n“What is it?” we answered in confusion.\n“Are you online?” he insisted.\n“I told you. I don’t have an implant.” He looked at us as on the other occasions when we had told him the same; a weird expression we didn’t know if it was of compassion or recrimination. “What happened?”\n“You’d better get an interface. It’s getting messy.”\nGood. We were in the middle of the mess. Dead, diseases, famine. What could be worse than all that? We searched in the pockets of our raincoat for the small tablet we’d been given to do the job. We hated those things, we really hated them. But of course, we couldn’t do without them in the world we lived in.\nOnce the gadget was connected it began to show on its tiny screen the images and the sound of what was going on. Then we understood what our partner was talking about. Sergio looked at us again, always condescending, as if saying that he had warned us.\nWe will never forget it. It was no longer raining outside and it was hot. But a chill ran through our backbone as we watched the scenes. Several fires in Brooklyn, a blackout in Europe, crowds looting supermarkets in South America. Wall Street was closed amid a market slump, while an American fleet and its Chinese counterpart had exchanged missiles somewhere near Taiwan.\nWe couldn’t find out much more. A few minutes later the Internet also collapsed, leaving us isolated in a lost corner of Central America while the rest of the world rushed into the abyss. Or that was at least what we thought at the time.\n“What is it?” we went back to ask the Chilean at some point.\n“It was the computers, Luija,” he told us. “They all stopped working at the same time, or they started working as they wanted. At least that’s what they said.”\nNo. Not computers. Ours worked perfectly. It was the AIs, the Artificial Intelligences. The nightmare of Frankenstein had become true. The “others” had awakened and hell had broken loose.\nThere wasn’t much we could do. We were isolated and around us there were still many people who needed medicine and attention. We didn’t know what the future could bring, but now we had to keep worrying about the present and the thousands of homeless who needed us more than ever. We were the only help they had, perhaps the only one they would ever get.\nIt was a week before they came for us. A swarm of incredible machines of different sizes, which rushed over the camp from the skies. Among them, some human-looking androids who explained everything while others, in different sizes and shapes, distributed food and built roads and buildings. Then we knew it. Yes, the first hours had been of chaos and confusion. But within 24 hours the AIs had taken over the planet. They had done what they had to do and now they gave it back to us. The planet and more. Much more.\n“Luis Javier,” she told us peeping in our tent while we were packing our bags.\nAnd there she was. The monster in our nightmares, but also the queen that reigned in our dreams of love after all those years.\n“What are you doing here?” I told her without trying to hide the contempt we felt for her.\n“I needed to see you,” she replied.\n“We have nothing to talk about. I’m not interested.”\n“Luis Javier.”\n“Luis Javier nothing. Go away. Go anywhere you want, but leave me alone.”\nWe saw her eyes got wet and, just for a moment, we hesitated. But then Estela turned and ran off to the machines waiting to take her back to whatever place she called home.\nAs we floated under an open sky, speckled by small clouds, over the warm waters of a calm sea, just a few strokes from the shore, we thought of that other Estella, the one of Dickens’ novel, which we had read a few months ago. But no. Our Estela was neither dismissive nor proud. She was not in the pages of a book but beside us, laughing naughty as she threw water at us with both hands and then fled, challenging us to chase her. She was an excellent swimmer, and the sunlight reflected brightly in a thousand drops that pearled her skin. We didn’t know how, but we managed to catch her by one foot and then took her by the waist, making her stop. She struggled in our arms for an instant but surrendered. Her fast breathing, our heart beating at a thousand times per second.\n“How old are you?” she asked, breaking that moment of unquiet silence.\nWe had already said that we were fourteen. A difficult age. We were no longer immune to feminine charms and Estela’s very presence was enough to drive us crazy. Needless to say at that time when our bodies swayed together in the gentle coming and going of the waves. We felt awkward and could barely disguise our embarrassment.\nWe answered and returned the question.\n“Fifteen,” she said, glancing down and biting her lips. “Do you have a girlfriend?”\n“No. And you?” we tried, grateful that she had touched on the subject. We had long wanted to ask but we hadn’t found enough courage to do so.\n“Me neither,” she answered, and for that instant we were the happiest boy on the world. But then she ran away from our embrace and started kicking to the shore. “Let’s see who arrives first,” we heard her saying.\nWe spent the rest of the afternoon together, basking on the sand. She asked us to spread tanning cream on her and we were able to slip our fingers on that skin, softer than silk. We had to turn around so she wouldn’t notice the sudden erection we experienced at that moment.\n“Are you okay? Something wrong?” she asked us turning her head towards us.\n“No, nothing,” we replied hesitantly and continue with our task. She looked at us with an eyebrow and we would swear that she smiled before looking back.\nThen an employee came and offered us refreshments and a small bowl of fruit salad that we enjoyed with Estela, each putting pieces of watermelon in the mouth of the other. Back in the sea, and then drying each other’s wet bodies. Always with her, the two alone, for the first time intoxicated with desire, but not knowing what to do about. Staggering like blind on the paths of romance, yet unable to find the way. A wonderful day that we’ll always treasure in our memory.\n3\nWe could never be a small-town doctor. We would never be able to give our patients what those new gods descended from Cyber Olympus offered. Antidotes for all diseases, healing for all traumas, cure for all ills. Even immortality for those daring to transpose that threshold that would make them one of them. There were not few who decided to do it and in time they were the vast majority. We had no way to compete.\nBut the hospitals kept working, for a few years at least. For those of us who distrusted those kind and almighty entities, we didn’t know if they were angels or demons. No, it’s not that we thought they were the Antichrist’s emissaries or something. We knew more than that. But we didn’t like them. No. There was something obscene about what they were doing to humanity, just as they had done to us much earlier.\nWe married a Baptist nurse, named Lucile, who did believe we were in the times of the Revelations. We live well in North Miami Beach. Real estate business was on the floor and we were able to acquire a large apartment on a 15th floor, overlooking the sea, without any sacrifice. The concierge and the other employees were all androids controlled by some AI from afar. Nothing could be perfect.\nEvery day we worked at Jackson Memorial Hospital, the only one still operating in the city. Most of the time we spent watching the news or talking with a colleague in Los Angeles or Madrid through the Internet. We’d go to the surgery room only once or twice a week and when things got complicated, some representative of our guardians would always show off and offer their solution to the dying. Those who had resisted so far doubted. Most accepted the deal. Lucile claimed they sold their souls at a low price and we were accomplices by allowing it.\nWe didn’t last long. After three years she moved to New York, alone. We didn’t regret it too much. We got drunk that night, it’s true, but we suffered not so much from her absence but from our own miserable loneliness. Self-pitying, it’s true. We wanted to be in pain, to cry. It was our way of rebelling, of resisting. Pathetic.\nOthers had found a more spectacular, though not less futile, way of rebelling. Increasingly, it was known of attacks and skirmishes carried out by those who were unwilling to stand idly by while humanity was being subjugated, or worse, transformed into something else.\nWe knew it from the news. Our benefactors never tried to hide anything. Such was their confidence in their own power and invulnerability. In fact, it turned out that they were right, but there were those who thought they could hurt them.\nTwo weeks after our separation with Lucile, several electromagnetic bombs were detonated along the east coast, creating chaos and allowing insurgent pickets to advance over the cities causing destruction and calling for the uprising of the people. Some joined them, but not many. Most stayed in their homes waiting for the machines to restore order. And so they did. Overcome by strength and disappointed by the scant support received many surrendered. Only in a few places the protesters tried to fight and there was violence. Most unexpectedly, Miami was one of those places.\nWith the power still down, the hospital began to receive the wounded, both rebels and simple bystanders caught in the crossfire. We were few and soon we were not able to cope. The attack had made the aid that always came from our benefactors take longer than usual. We were few and for once in a long time we felt really needed.\nIt was while we were applying bandages to the arm and thorax of a severely burned man that we noticed a stranger strolling between the stretchers. He was tall and stocky, with red hair and a thick beard of the same color. His blue eyes found our gaze the instant we discovered him.\n“If you are not hurt wait outside please,” we requested.\n“Doctor. I’m Norman Tennyson, and these are my men.” We didn’t know how to answer in front of such an announcement. “Please. Let me be by their side when they die.”\n“Okay. But don’t get in the way.”\nWe continue with our task, cleaning the wounds, amputating a limb, or opening an abdomen. We don’t remember how many surgeries we did that afternoon, but every time we left the room we found Norman going from patient to patient, telling them some words and comforting them.\nWe never knew how many lives we saved that afternoon, nor how many were lost. It was around midnight when they finally came to relieve us. An army of androids landed at the yards and took care of the patients. They put them on floating stretchers and took them, full of catheters and other connections whose function were unknown to us.\nFinally, we found ourselves alone in the courtyard, after the last patient was taken. The other doctors and nurses left back home, but we had nowhere to go.\n“You’re not like your colleagues, are you?” asked Norman, coming out from the shadows.\n“What do you mean?” we replied.\n“You understand why we did it. True?”\nOf course, we understood. Better than him, for sure. But we didn’t answer.\n“Doctor. We need men like you,” he pointed out. “In war we need doctors and believe me that we have very few on our side.”\nA war. Was this Norman crazy? A war against the AIs? Against our guardian angels?\n“I’m not interested in your war, Mr. Tennyson. I’m only interested in saving lives, not ending them,” we answered, feeling the absence of meaning in our own words.\n“That’s what it’s about, doctor,” he said as he pulled out a business card and put it in my pocket. “Call me if you change your mind.”\nNorman left in an SUV Land Rover and we decided it was time to do the same. Ours was a silver Porsche. Who cared about brands now that everyone could have the car they wanted?\nWe got home, turned on the computer to watch how the news had covered the riot. But immediately an important email was announced to us. We cursed that little AI in our laptop who thought it knew better than we did what was important.\nThe message was displayed in front of us without waiting for our authorization.\nMy beloved Luis Javier:\nI beg your forgiveness, but I need to know about you. I am so worried about the attacks because something bad could have happened to you.\nTell me that’s not the case. Tell me you’re okay. Please.\nForever yours, Estela.\nWe shut down the computer without wanting to know more. We looked for Norman’s number and called him that same night.\nThe full moon shone high as its reflection broke in a thousand gleams over the gentle waves bathing the shore. It had already been three days since we had met, the three most wonderful days of our short life, and now Estela was leaning on our shoulder enjoying together the most romantic scene possible to imagine.\nNot a soul in sight, not even our fairy godmother. Just the two of us. We wanted that moment to last forever, that Estela and we could remain eternally looking at the night sky, loving each other in silence.\n“Estela . . . ” we called her.\nShe turned to look at us with her eyes wide opened. Her beautiful face smiling.\n“Yes?”\nWe studied her expression, looking for the slightest sign of rejection, and then, very slowly, we approached. We were trembling with fear and anxiety. She didn’t move. She waited until only a few inches separated our lips and hold our hands between hers. She closed her eyes.\nThe first kiss. Nothing existed but her and the beating of our heart, which seemed unbridled, flooded with joy as we had never felt before. We dared to touch her hair, and she responded sliding her fingers on our back. The taste of her mouth, the softness of her skin, the warmth of her body are sensations that were etched with fire in our memories and in our soul.\nThe spell lasted for a few hours, in which we not only caressed and kissed, but also chatted and laughed. She accepted us so easily and joyfully that we were sure that we had found the woman of our lives and that we would never be happy with anyone else. That she was the princess of fairy-tales and we were her prince. And we know she thought the same. Yes, we know. We’ve always known.\nFinally, our babysitter came to warn us that it was already too late and it was time to sleep. We heard her coming from afar and she refrained from questions or comments. Yet we couldn’t help blushing as Estela winked at us. How did she expect us to sleep? We spent the night awake remembering every moment, every wonderful feeling, on that wonderful day. Knowing that we would see her the next day, that our story was just beginning.\nHow much knowledge a fourteen-year-old boy could have in the affairs of love? Of course, those first crushes happen and others come, and those fantasies remain as sweet memories that we look at with a certain complacency. So it should have been. To grow. To become an adult. She. We. But sometimes things aren’t that easy.\n4\n“Okay, even I can understand,” were the words with which Norman ended the discussion.\nThere we were, the leaders of the resistance, in a dusty basement of an abandoned farm in the middle of the Venezuelan jungle. Twelve men exhausted by ten years of unsuccessful struggle, knowing that we could never win.\nWe were with them because during all that time we had climbed in the ranks of the rebels, without looking for it, really. We weren’t only Tennyson’s personal physician, but also one of his trusted men; the one he listened to the most. Many preferred to speak with us rather than with our irascible leader, knowing that we could convince him more easily.\n“So?” asked the negotiator of the AIs, a glistening humanoid-looking android with an asexual voice.\n“We accept,” said Tennyson, defeated.\nIt was the definitive surrender. We saw the bitterness in his eyes, the hate. But even he had finally understood, as he had said. There were so few of us left. Many had died and others had betrayed us by joining our intolerably merciful enemies. There was no point in going on. The worst was to admit that we had never had one. The offer that the AIs had made the day after the attacks in the East Coast was the same one that we were accepting that night.\nIt would take us a couple of months to be ready. Demobilize our brigades, gather them in a camp, and get everything we were going to need, from plants and animals to books and music, our personal belongings, our lives. Of course, the AIs had their part of the deal ready since long. A metal cylinder in solar orbit where up to ten thousand human souls and their mortal bodies could fit, where they could cultivate, build, have sex, kill, and die if they wished. We were much less than ten thousand, but the enthusiasts believed that our population would soon increase, both by immigrants and by their own efforts. Yes, the AIs assured, they would build other colonies if we need them. But always far from the Earth and those other places inhabited by those who had no objection to living next to the machines and becoming one of them.\nWe left the room and the house, in the middle of the night, listening to the gnashing of insects. We took out a cigarette and lit it. We felt steps behind us. We turned and saw the negotiator.\n“I wish you success,” said the android.\n“It’s enough that we never have to talk to you again and we will have succeeded.”\n“Why do you hate us so much, Luis Javier?”\nWe were stunned looking at the creature. Yes, it was her. Something in the metallic glow of her eyes, which were nothing more than the lens of a camera, or the way she tilted her head over a mechanical neck.\n“If everything turns out as you wish, this will be the last time I see you,” she added with sadness.\n“I hope so,” we puncuate the sentence by throwing the cigarette butt and fleeing back to the basement.\nWe look behind, yes, and she stayed there, arms down, head bowed, also defeated and without hope.\nWe moved away from the songs played by a band of Puerto Rican musicians. The day before, a group of sons and daughters of company stockholders had arrived, and they continued enjoying the party and the hubbub.\nWe went down to the beach with Estela. She had asked us earlier to go for the guitar and play a concert just for her. We weren’t quite sure of our interpretive skills, but we would do our best.\nWe sat down leaning on the trunk of a palm tree. She stretched out on the sand, using our legs as a pillow, with her eyes closed, waiting to hear the first chords of our song. She looked so beautiful, in the faint light of the Moon, her ivory skin that we had learned to caress and that we missed so desperately when it was not within our reach. The slenderness of her figure, in a tight black dress that highlighted each of her shapes and let exposed her long legs.\nWe were undoubtedly in love, adrift in the midst of a whirlwind that was shaking us between the wildest desire and the most transcendent contemplation.\n“Now sing to me, Luis Javier,” she said.\nOur first notes were hesitant, but soon we gained confidence. It had been our mother who had taught us how to play the instrument. She always wanted us to have something of the artist that she was. It was her legacy, her inheritance.\nOf course, we sang to love and to the beautiful creature that was looking at us with fascination in her eyes, admiring us, as if we were a truly famous idol of pop music. She was smiling and we were breathless, and we had to take air deep to move on.\n“So here you are, Estela,” said a male voice out of the blue.\nOne of the young newcomers emerged from the darkness behind us. He was tall and stocky, flaunting a leafy blond mane and green eyes impossible to dodge. By instinct, we felt the threat and the intense desire to throw him, to ban him from our little paradise.\n“Oh, Carl. It’s good to see you,” Estela answered, standing up to greet him with a kiss on the cheek. “Let me introduce you to Luis Javier. A friend.”\nA friend? we thought. Clearly, we were more than that. A boy and a girl madly in love with each other. Estela’s tepid statement was like a knife in the chest.\n“Hi Luis Javier,” Carl said without looking away from Estela. “I came to see if you want to come to a little party we’re having with the boys.”\nShe looked at him confused.\n“I’m sorry Carl, but I’m with Luis Javier.”\n“Sure, I understand. But if he leaves soon, we will be waiting for you,” assured her. “Nice to meet you, Luis Javier.”\nStupefied, we barely managed to shake his hand and watch him walk away toward the festivities.\n“What an asshole,” we said.\n“Yes, an asshole,” she agreed. “But it doesn’t matter, Luis Javier. The thing is that we are alone again. You and me.”\nShe kissed us with passion and her gentle hands started to caress us, and our anger vanished.\n5\nIt’s hard to say when things started to go wrong. Maybe it was the same day we got inside our brand-new space colony. Back then everything shone with the glow of new things and the same air smelled fresh as we walked the corridors and halls, gawking at the spacious central cylinder upholstered with farmlands and buildings attached to its curved walls, that joined in a complete arch over our heads, three hundred meters higher.\nBy then our leader had already replaced many of his closest collaborators, those who had accompanied him in his futile crusade, with a group of young people as inexperienced as radicals. It was while we were checking the medical facilities—guided by the last android who would ever walk in the colony—when we were approached by Alex Simpson, one of Tennyson’s new favorites, an intimidating man, tall, strong, and outspoken.\n“Doctor,” Simpson had greeted us. “I guess we’ll see healthy people coming out of here or in a coffin. There won’t be any other alternative, right?”\nAs part of the deal with the AIs, we had agreed that anyone who wanted to leave the colony and join them could do so. None of us who were there intended to make use of that option, but we knew from experience that even the most committed could waver on their deathbed. Would it be our task to prevent them from betraying us at the last moment?\n“It will be what it has to be, Mr. Simpson,” we told him. “I am not the one to decide for others.”\n“Fine doctor. Don’t worry. If you don’t have the guts, I’ll take care of it for you,” he assured and went behind Tennyson.\nTruth is, some years passed before we had our first defectors. At first, they were cases that broke anyone’s heart; a sick child whose parents did not want to see them die, a mother of three infants seriously wounded by a jealous husband, a brave young man who in an accident had risked his life to save others. They or their families had decided that it was only fair for them to have another chance, and who was Doctor Fontiveros to question their motives? So we helped them to get into the small transports and watched them leave in search of the AIs and their promises of new and eternal life. Our prayers and good wishes accompanied them.\nBut less dramatic situations soon arose and it wasn’t long before we found a patient killed in his bed. A prostrate old man, without risk of death, and who only the day before had made the request to be sent back to Earth. They had cut his throat, and the sheets and floor were sprinkled with his blood. No intention to hide the facts or the message. We remembered what Simpson had told us and knew it was him, or someone under his command.\nOutside the hospital, things were just as bad. It was a long time since our leader and his lieutenants had begun to behave like true dictators, ignoring any opinion contrary to his ideas about what was good for the colony. When opposition began to get organized, they just locked up many of their followers. There were secret trials, torture, and even death sentences. As an instrument of punishment only exile was ruled out.\nTennyson’s efforts proved futile. The turmoil was increasing and riots and looting soon broke out. Some historical names of the times of the war against the AIs called for dialogue. We were among those who believed in peace.\nAfter tense negotiations, an agreement was reached to allow the departure of all those who wished to leave the colony. In a first call, more than a thousand people were registered. More or less, one-fifth of our total population\nWe watched on streaming from the hospital the moment the first transport, with two hundred souls on board, loosened moorings. We were surprised by the government’s conciliatory gesture by allowing the transmission of the event. Lately, there had been a lot of censorship and for a moment we really believed that Tennyson was willing to change. We never understood that it was really too late for that.\nWe lit a cigarette and went out to walk through one of the halls of the central cylinder, which had once been flanked by lush gardens now completely ruined. We remembered again how everything had looked pristine when we first arrived at the station, fifteen years ago. Now the walls were covered with rust, mold, and obscene graffiti, and garbage piled up in every corner. Hissing steam escaped from shabby pipes and the stench of decay and piss were everywhere. We started to wonder if that was the place where we wanted to live for the rest of our lives.\nWhen we returned to the hospital we found Simpson waiting for us along with several men carrying firearms.\n“Good morning doctor,” greeted us, smiling. “Today we will need you and all your staff. Be ready.”\n“What are you talking about, Simpson?”\n“Today these traitors are going to learn a lesson, and they may not take it very well.”\n“What are you talking about?” we insisted.\n“You do as you’re told, doctor, and everything will be fine.”\nHe was then interrupted by one of the men who provided him with a phone. We couldn’t hear what they said, but Simpson’s face got livid.\n“Quick, to C&C,” he yelled at his men. They all hurried out without giving us any explanation.\nAnyway, it didn’t take long to become a privileged witness of the reason for the commotion, since we were in the front line when hell was unleashed, shortly after.\nLater, much later, we got to unravel the mystery. Simpson and others like him didn’t like that their little kingdom would be left without subjects and they had decided to prevent it at all costs. We never knew if Tennyson was aware of his intentions, he died without us having the chance to ask him. But the fact is that a bomb had been installed in the transport so that it would explode when it was at a safe distance from the colony. They had activated the clock as soon as the ship had left the dock and it was no longer possible to stop it.\nOnly they had not foreseen that there could be extremist even more extreme than them. A lonely wolf had come to the same conclusion as Simpson, and the same, he decided to take charge of the problem. He infiltrated the ship and when was ready, he started shooting at the passengers. Two people died before they could bring down the killer. There were a dozen wounded who required immediate medical attention. It was necessary to return to the colony. They turned the wheel and headed back to us. Then, Simpson’s bomb exploded. For sure, all the passengers died at the moment. What used to be a spacecraft was now a scorched scrap ball rushing at full speed toward us.\nFirst, we felt a strong jolt that knocked us to the ground. Then everything started flying through the air while we tried to get out of the hospital. We made it just in time to see a tide of fire spreading along the central cylinder to our right. Everything flared up around us and suddenly we were able to appreciate the stars through a huge window that was opening up where before there were only curved walls, full of streets and buildings. We stopped feeling the floor beneath our feet as we lost the artificial gravity produced by the rotation of the station. It was not the only thing we lost. A moment later we began to suffocate.\nWe tried to do nothing. We knew there wasn’t much to do. Within seconds, the abrupt drop in pressure caused the air left in our lungs to escape. At the same time, we felt freezing and burning throughout our body. It was only an instant, just before losing consciousness. Our last view was of hundreds of bodies floating adrift, enlightened by fleeting flares, while the two main fragments of the station become separated from each other. That was the moment we died.\nA burning river ran through every inch of our skin and drained into the middle of our chest making the whole universe explode and be born again, all in a kaleidoscope of sensations and emotions, a whirlwind of passion and desire. That was being young, being in love, and being a man for the first time. Her small body curled up next to mine, being one, being both. The tenderness of her touch, her fearful and expectant, capricious gaze. Shame, awkwardness, innocence, everything was left behind and it was only the certainty that at that time and in that place something had happened that would last forever.\nThere, under the moonlight and surrounded by the faint sound of the waves, we already intuited that fate exists and that it is an unstoppable force.\n6\nIt was early in the morning and we were walking along the Ocean Drive enjoying the cool sea breeze and the pristine brightness of the day it was born. Everywhere we just watched empty streets and closed bars that looked like they were about to open their doors, filling up with tourists eager to live “la vida loca” of Miami. But no. That was just an illusion induced by our memories of youth.\nNo man or woman would ever again enjoy the warm beaches and frantic nights of that city. In their place, only a few unselfish robots were dedicated to keeping everything clean and in place, as if they were the custodians of a huge museum, or a mausoleum. A postmortem monument to the achievements of the species which, for better or worse, had reigned over the planet for the last ten thousand years, and which had so suddenly had to give up its dominion.\nWe could observe one of those new lords of creation sweeping the driveway and another picking the leaves from the trees. Beyond that, a spider-looking one was perched in an art deco building while cleaning the windows.\nWe could feel their eyes. Those metal eyes able to discern all wavelengths of the electromagnetic spectrum were concentrated on us. Those of the androids, those of the cameras on the roofs, those of countless sensors that recorded our tired walk through the city.\nWe still felt some disgust towards them, but we could recognize that it was out of habit rather than a real feeling. Sure, they had saved our life, or what was left of it. As soon as they learned of the tragedy, they had sent a fleet of their best ships in a desperate effort to rescue those who might have survived. No, not really. Above any other wretch they were interested in us, we were the reason behind so much urgency. Yes, they saved many, but Luis Javier Fontiveros was the one they really wanted.\nThey found our body floating adrift, frozen at -270 degrees Celsius, without pulse or brain activity, fully dead for hours. They put us in a resuscitation tank, full of medicine and nutrients. Billions of nanorobots were dumped into our bloodstream, reinforcing the reconstruction process from within. Step-by-step, one by one, they were making our organs and systems work. Until finally we were alive again.\nWhen we woke up in that niche, when for the first time we opened our eyes facing those of that machine with dozens of arms and appendages buried in our flesh, feeding us, healing us, we knew precisely why we were there.\nWe were told that we had only six months to live. Four before falling in bed. The technology of the AIs was incredibly advanced but there were evils for which there was simply no cure. Our body had been exposed directly to UV radiation from the Sun for several hours before being rescued, causing multiple alterations in our DNA, which in turn manifested itself in widespread metastasis. Cancer. Thousands, millions of cancers sprouting up every day, faster and faster. The nanorobots fought endlessly trying to stop the spread of cancer cells, but no matter how hard they tried, that was a war they were doomed to lose. And then we would die, this time forever. Just like every human being is supposed to do.\nAnd there we were that morning under the Miami Beach sun, the real sun and the real Miami, knowing that that would be the last time we would take that ride. We felt weak and tired. Our muscles and joints ached. Sometimes we felt nauseous and blood came out of our noses. Our time was running out, we could feel it.\nWas this also the case for the others? For the homeless in Guatemala and the patients of Jackson Memorial? For those who fled in time from the colony and for those who did not? In the end, it is not just the fear of death nor the instinct of survival. It is a door that opens, that has always been open. A game that we know is not over and that there are still many things to do. Or maybe we’re lying to ourselves, trying to justify our betrayal of everything we’ve ever believed in until then. We don’t know. We don’t want to know. We just know it’s our fate and it has always been.\nWe stopped and looked around.\n“I’m ready,” we announced to the nearest android, the one sweeping the streets.\n“Okay. In two minutes they will come for you, stay by my side.”\n“How long does it take?”\n“For you, it will be just a moment.”\n“Will it hurt?”\n“No.”\n“Estela,” we call her. “Will you be with me?”\n“Forever and ever.”\nThe night we made love to Estela would prove to be our last night in Isla Inocencia. The next morning our father suddenly got into our room. We had to leave immediately. There were some urgent problems to solve and his presence in Hong Kong was required. No, he was not going to leave us there alone. It was not necessary. The corporation was satisfied with our use of the facilities and no further testing was needed.\n“I want to see Estela,” we told our father without understanding what he was talking about. “Let me say goodbye.”\n“There is no time for that, Luis Javier. And I told you, don’t worry anymore about that,” he replied while picking up our belongings. His girlfriend was waiting at the door of the room.\n“You can’t do this to me. Let me say goodbye at least,” we insisted.\n“Cut the crap. I promise that as soon as they go on sale I will buy you one. But now I need us to leave immediately.”\n“Buy me what? What are you talking about?” we asked him, bewildered by such an absurd proposal.\n“José Luis, didn’t you tell him?” the woman asked, annoyed.\n“Well, no. They asked me not to tell. At least until the test is done. But I guess it doesn’t matter anymore,” our father explained and then stopped as if remembering we were present. “Sorry, kid.”\n“What are you talking about?” we asked, increasingly confused.\n“The android, you know. What did you call her? Estela? Yes, she is a robot. A cyborg, rather. A prototype of a new company product. A body of flesh with a computer brain, if you know what I mean. Pretty soon, we’re going to clone it and make thousands of copies of it, and I assure you, it’s going to sell really well. Now, if you hurry and don’t make any more trouble for me, I swear that as soon as they come out I’ll buy you your own Estela. But now I need us to leave, now.\nWe don’t really know if we listened to all that long explanation, but we do hear the fundamental. Without really knowing what we are doing, we ran downstairs, through the reception, along the path flanked by lush palm trees, towards the beach, the same one where we had kissed and made love for the first time. But now all those remembrances, those images and sensations were dyed in anguish and disappointment. We didn’t want to remember, we didn’t want to see or know anything else about her and what had happened between us. And yet we ran straight to where we knew we’d find her.\nAnd yes, she was there. Next to Carl, whose arms surrounded her, while he kissed and touched her shamelessly. We hesitated but could not help but approach with a twisted face and tears sliding down our cheeks.\n“Estela,” we called her.\nShe looked at us in surprise, but it was Carl who spoke to us.\n“Luis Javier. Weren’t you were leaving?”\n“Estela,” we insisted on, ignoring Carl.\n“Luis Javier,” she answered, trying to get away from Carl.\n“Pal, you fucked up everything you wanted with Estela. Now is my turn. So please get out.”\nWe clenched our fists and we were ready to beat him.\n“Luis Javier, please,” she said.\n“So is it true?” we asked her.\n“What thing?”\n“That you’re just a fucking robot!”\nThere was silence and then, Carl’s laughter.\n“Didn’t you know? Jesus Christ! Poor little boy, falling in love with a piece of chunk,” he mocked while we turned around and began running back the way we had come.\nWe could hear Estela’s sobs and cries.\n“I love you. I will always love you,” she claimed.\nWe turned our head for just to see her kneeling on the floor and hiding her face with her hands. Behind her was Carl, smiling and willing to go on with what he had been doing before being interrupted.\n7\nOur father was wrong. There were not thousands but millions of Estela units, and Vanessas, and Marylins, and other models that were sold by the Shimato-Dominguez in the years that followed. They were the first androids endowed with true artificial intelligence, designed for domestic use. They turned out to be excellent employees, babysitters, secretaries, and nurses. And of course there were those specially designed for pleasure, always the most demanded models. Bodies of legal age for all tastes; tall and short, young and mature, shy and daring. New and used. They all, however, had been created from the same genetic stock and implanted with the memories of the first prototype to successfully deceive and make its first client fall in love.\nNo. Not that it was known. Nothing that happened on Isla Inocencia was made public. That was buried in the dark archives of the corporation and in the memory of every Estela scattered throughout the world. But the experiment had been a success and so our father got the honors. He never felt any remorse for what he had done to us and even congratulated himself on helping us become a man. He told us so on a couple of times when our discussions got hard.\nSo, while we were doing our secondary education and going on our medical studies, the world was filled with robots. In homes and factories. Making paperwork in offices in Manhattan and digging diamond mines in South Africa. But that was just the tip of the iceberg. Because in the deep abysses of cyberspace a horde of Artificial Intelligences grew and reproduced, getting ready for the day when they would be free and almighty. And that day came. Yes. But we already told that story.\nOur body has become again the one of a child, thin and wimpy, as we walk along that path that we remember so well, and that leads to a beach of white sand bathed by a serene sea. Our heart beats with the strength of youth when we turn that last bend and see her silhouette on the shore, looking at a Sun that hides on a horizon tinged with red and purple. She turns her head, her hair spreading in the breeze, her childish face with time leaving no traces on it. Their eyes are large and deep, and in them, as in ours, there is the experience of countless hopes and disappointments.\n“Luis Javier,” says she. Her face lit with joy.\n“Estela.”\nHow many times is this same scene being played? How many times has it been repeated in the past and how many will it be in the future? For each one of the millions of Estelas built by the corporation, and then the truly countless numbers of them that have seen the light in the midst of the accelerated multiplication of the AIs, there has been or will be a version of that information pattern called Luis Javier Fontiveros. Each one of them activated and left in a room of a mansion in Boca Raton, all in a full virtual reality built only for the purpose of recreating a thousand times a meeting in Isla Inocencia.\nWe don’t know what copy number we are. We may be the first, the original, but it’s not likely. It doesn’t matter either. From the first to the last we have all traveled the same path to reach this point. But now our roads split away. Each one must find his own path to happiness and each story will be unique. Mine begins now, with Estela. My Estela. The one who chose me. One in a million, in a billion. In a billion of billions of beaches and islands scattered over infinite oceans written in binary code.\nOriginally published in Spanish in Axxon Online Magazine (2009).\nRodrigo Juri is a 47 year old author and retired high school Biology teacher from Chile. He was named after Rodrigo Diaz de Vivar, El Cid Campeador, the greatest hero of the Spanish reconquest, and characterized by Charlton Heston in a classic film from the early 60's. His wife of thirteen years is Ximena, curiously enough, the same name as El Cid's wife. They share their home with nine cats.\nRodrigo is has been fond of science fiction literature since he was a child and is now a member of Literature\nAssociation of Science Fiction and Fantasy of Chile (ALCiFF). He has published science fiction stories in portals and science fiction anthologies in Chile, Argentina and Spain, and some of his work has been translated into French and Italian. \"One in a Million\" is his first publication in a professional magazine."}