{"fingerprint": "WQ7KZ9P7fZpvFdoVOjFG3s/shkI=", "sitename": "Clarkesworld Magazine", "title": "Slowly Builds An Empire by Naim Kabir", "author": "Naim Kabir", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kabir_03_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Slowly Builds An Empire by Naim Kabir", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6540 words, short story\n Slowly Builds An Empire\n There was no need for talk in Tokyo, so the streets were silent.\n The loudest features were the colors of the electric motorcars and the styles of the eclectic fashions—polychromatic shells that switched from lip-pucker lemon to cut-grass green and double-cut polymer skirts alongside old-fold silk suits.\n Shinsuke Takinami stood above and apart from it all, teetering on the edge of a ledge and wanting to yell down below, but swaying silent and still. They wouldn’t hear him anyway. Where his world was quiet, theirs was boisterous and noisy. Vibrant. Lively.\n Lovely.\n For a moment he considered letting the breeze pluck him from the rooftop like the floret of a dandelion, but a tone from his phone made him think better of it. Money had just come from what he called the Department of Pay. Shinsuke could have always let the yen funnel directly into his personal account, but he preferred walking on the marble floor of the brick-and-mortar building, where perhaps he had a chance of interaction.\n He took the mechanical elevator down twelve stories, walked past faded yellow wallpaper, through a set of double wood-and-glass doors, and onto the glistening street below.\n The taxis there had either forgotten how to interpret a hand signal or were willfully ignoring him. After fifteen limp minutes of flailing on the sidewalk, he stepped in front of a vehicle and watched it automatically roll to a stop. Shinsuke cleared his throat and whisper-yelled, “Oye! I need to go somewhere!”\n The driver’s eyes widened at the use of a mouth and tongue and forced air, but he remembered the rudiments of language and opened the door, thinking all the while that he had picked up an oddity.\n Shinsuke offered an address and they were off.\n The sun was high in the sky by the time they arrived, and Shinsuke squinted in the glare from the road. But the shade of the concrete pillars fell coolly over his eyes as he moved to enter the building, just one of three hundred people in lines feeding into a faraway desk.\n All was quiet.\n He wondered what they must’ve been saying to each other, these people. In intimate shades of sound and thought passed from mind to mind, with no need for facial twitches or a squeezed throat to speak. He wondered what they must be saying, these people so unlike him.\n He tried offering a smile, but was met with a glacial wall of empty face, all flat lines and smooth skin. Inscrutable.\n For the rest of the wait he kept his head down, wondering if they were trying to talk to him. Maybe they were giving him mental nudges that he just couldn’t feel, and maybe he was surrounded by hellos.\n He stared at his shoes, hoping he wasn’t being rude. Those hellos could turn into a collective hatred, the type felt by all tight-knit tribes as they came upon an outsider. They might have been thinking he was one of those loud, bad ones—those angry ones that roam at night and vandalize the city.\n Or maybe they were feeling pity; as they basked in the warmth of each other’s thoughts, perhaps they felt sorry for this poor hikikomori, this puppy left alone and afraid in the cold.\n He looked at the floor until he reached a desk, where there was an awkward silence as the attendant stared through him. Shinsuke whispered a word and the attendant seemed to catch on, presenting him a small electronic tablet.\n He pressed a button that transferred the money to his account—something he could have easily done at home—and was shooed out of the line and back onto the street. This always ended the same way, but he kept coming back.\n It gave him something to do.\n The screen at home shouted a constant stream of entertainment from the Misinformation Age, with bombastic characters and honorable warfighters yelling and jumping and trying their hardest to make Shinsuke feel like he wasn’t alone.\n It worked, sometimes.\n But Shinsuke’s greatest secret was the little black box nestled beneath the screen, connected illicitly with a tangle of wire and two paperclips. His father, Haru, had installed it some twenty years ago with a screwdriver tucked behind his ear and his tongue peeking out from the corner of his mouth, long before Shinsuke decided to run away from home.\n Deep into the afternoons Shinsuke would roll wire from a controller, plug it in, and roam through virtual worlds and talk to virtual people who spoke to him, joined him, fought with him, against him, and all those wonderful things he imagined must have gone on before the war on social parasites.\n His mother, Aiko, had told him the story while he played with his father. As they roamed through a dungeon she recounted the camp they escaped with shovels and wirecutters. While they waded through the inevitable sewer level she talked about how dank and cold and smelly it could actually be underground, among hundreds who lacked the “complete empathy” of their countrymen and were forced into hiding.\n When a god-emperor granted them three wishes as reward for defeating the demon king, Aiko told them how their only reward for survival was the sudden cessation of mass killings and an uptick of forced sterilizations instead.\n Shinsuke always lived in a sort of awe and loving respect for his parents, and then Shinjuku happened. A group of hikikomori gunmen had crashed into a surgery suite and destroyed the equipment with lead bullets before being neutralized by hyperefficient police machines. They had called themselves the Nation, and Shinsuke was convinced they all lived out in the countryside together. He wanted to set off at once.\n His parents said no. His mother hugged his head to her chest and just repeated the word, “No, no, no, no . . . ” She called him a miracle, their one miracle in a life of curses, and told him please not to go, he was a miracle, he couldn’t.\n Haru stood gruffly at the door with his arms crossed and his eyes closed, a bouncer meant to keep him inside. His mother tugged at his arm and said, “Shin, you have to stay, you’re a mir—” And that’s when he started yelling.\n He yelled that he couldn’t just be cooed at like that, that he wasn’t special, and that they could shut up trying to make him feel like he could be anything in this world when he was branded hikikomori, social recluse, parasite, insect who could never truly love someone.\n Shinsuke made to throw a lamp at the video game console and his father bolted to it with his arms flailing wildly, and then he dropped it to the floor and hurried out the door. Haru chased him a good three miles to the metro, but Shinsuke finally lost him in the crowd.\n After roaming for months in search of the Nation, he realized that his mother must’ve only been twenty years old when the sterilization procedures had been rolled out. They would have used an injection, radiation, or some surgery—but six years later there was a drooling baby boy who’d learn to talk and smile in their tiny apartment.\n Miracle. That’s what she called him the day he left.\n To the government’s credit, local law enforcement didn’t take any action when they found out about new hikikomori children. The experts weighed in and stated there was too tiny a population of nonpathics to affect the rest of the country, as long as they were spread far apart.\n So they let baby Shinsuke bounce, grow up, and tell his parents that he could never truly love.\n Sighing, he spun up the usual disk and sat at the usual rocking chair. Long into the night, he played through dungeons and wide-open landscapes, fighting, dancing, and singing along with his party of colorful friends.\n Shinsuke. Mama. Papa.\n Molotov cocktails can hardly mark a supercrete wall, but they made for an impressive lightshow. Shinsuke watched from his rooftop as a column of shouting hikikomori rode down the block on ancient revving motorcycles coughing black smoke, launching fiery bottles at the walls as they passed.\n They exploded deep unnatural red over the empty street: the color of the Nation Within a Nation, the Peoples Without Voice. Their shouts held a certain rhythm:\n Call, “We, the folk of Nihon-koku!”\n Response, “The Sun in the midst of the Cold White Field!”\n Call, “We, the folk of Nihon-koku!”\n Response, “Blood-drop red and the People’s shield!”\n Unwittingly, Shinsuke found himself mouthing along, wondering how these riders found each other, wondering how he could find them and belong. Was there really a city of them out there?\n The rumble of the thirty-person column echoed through the avenue and faded to silence, scarlet flames dying down in their path. The LED red and blue of a pursuing police machine and the whistle of a siren came later, much too late to catch them.\n The hallucinations started in summer.\n Twin suns in a slow waltz and a rust-brown sky. Volcanoes throwing ice twenty meters into the air, golden-brown lakes, soaked spongy islands, a smart clean smell that whipped the air.\n Then it was gone, as quickly as it had come.\n He was told in impersonal government letters that social isolation had its costs, and that some year he would begin to develop a sort of dementia. This, the letters said, was the line between a hikikomori who was a commensal symbiote of society and a hikikomori who was a parasite. To keep from becoming a parasite, he’d have to visit his city’s counselor.\n Thankfully, for this appointment Shinsuke could travel by train. It was a red and white rocket that floated on an invisible cushion, pushing off underneath the dense intersection at Shibuya. He bumped into padded shoulders and he scuffed a hundred polished shoes while everyone around him moved in rehearsed lockstep. After a few moments a circle of space bubbled around him as he walked, the crowd retreating and rerouting like a school of fish. He smiled meekly in gratitude and made his way to the platform as the masses parted ways.\n He got off at Yamato, deferentially bowing to the crowd that swirled around and blebbed him out into the open-air prefecture with rolling green hills and a sweet yellow sun.\n The counselor’s office here in Kanagawa was meant to serve the nonpathics of Tokyo and all of its wards and outlying towns, too. It was quite sufficient for this task.\n For the first time in a long time, he was addressed by name, spoken aloud.\n “Shinsuke Takinami.”\n The counselor was a brusque, short man in a bad brown suit and golden glasses, with a square moustache over tight lips. “You are here today because you have begun to see things.”\n The man had been trained well in speech, though his facial expressions were a little exaggerated, as if he were a player in a traditional kabuki history. For all Shinsuke knew, traditional theater actually was where he’d gotten his vocal training—this was a common practice for nonpath-liaison positions within the government.\n The man continued with a too-wide smile, “I am Dr. Otani, would you like to come into my office?”\n Shinsuke nodded meekly and entered, lowering himself onto a plastic chair as the counselor took his seat at the desk.\n “How long have you been alone at home? You are quite young to have these problems now,” said the doctor, jotting down a few notes on a yellow pad.\n Shinsuke answered in a hoarse whisper, “Maybe eight years, now.”\n The doctor frowned comically deep. “Ah, that’s a painfully long time. Perhaps that explains all these young people becoming sick so soon.” He put down the pencil and his face went to a stone neutral. “This year we have a new initiative. My colleagues and I have convinced the State to allow group meetings for many such as yourself.”\n Shinsuke’s eyes brightened. A group?\n “The problems are caused by extreme isolation. Conventional wisdom says that screen-entertainment helps you avoid this, but we’ve seen this isn’t true. We’ve convinced the government to allay this acute isolation by having meetings where you may speak to each other. Of course, there are limitations, but overall this sounds like a good idea, neh?”\n Shinsuke nodded vigorously, almost obsessively.\n Dr. Otani’s face lit up with a smile that could’ve been seen from the last row of an amphitheater. “Good, good. For now we will just take some tests and perform a short interview. But I will see you here again, in one week. Be prepared to socialize.”\n A vaulted sky of swirling red and yellow, like jelly spooned through cream. Dark spots of passing moons, thin sounds of music like wet thumbs on a wine glass. What sounded like a voice but was more like a thought being born, saying: Here is a part of Us, who are part of You.\n The train ride to Kanagawa was quiet like the streets were quiet, and the lobby of the counsel building was, too. But when Shinsuke shouldered through the doors to his first group meeting, the noise washed over him like a hot breath in wintertime.\n Shuffling chairs, men and women, boys and girls, all speaking to each other in voices loud and hushed. He basked in it.\n Some paused as he came through the door, and he forgot how to introduce himself. He said, “Hello, hello,” and they fell silent before a girl asked:\n “Nice to meet you. I am Saeko Inamasu. What’s your name?”\n “Ah, ah, Shinsuke Takinami!” he whispered back, smiling the warmest he had in years. The others introduced themselves. Rena Hasegawa, Ayano Nojima, Eiichiro Matsushita.\n Dr. Otani moved to the front of the room and rapped on a blackboard.\n “Before you get too friendly, some rules. You may not,” he fumbled with a piece of paper from his jacket pocket, “exchange addresses. Trade phone numbers. You may not leave together, or . . . ” He squinted at the page, “Engage in physical affection.”\n Shinsuke looked nervously at Saeko as she listened attentively. Dr. Otani continued reading, “If you are suspected of doing any of these, you will be forcibly removed from your home and sterilized. If your offense is especially grievous, you will be killed.” The room was silent, and then the counselor smiled that rubber-mask smile of his. “With that, continue introducing yourselves! In a few moments you will tell each other your stories!”\n The first story was an old man’s. He had survived the first wave of the war against social parasites but had been kidnapped and operated on during the second. He had a wife, once, and now she was back. That was why he was here.\n Shinsuke furrowed his brow. This was unfamiliar: the man was seeing ghosts?\n The second story was a gray-haired woman’s. She had always spoken to her cats, but it was only recently that they had begun to talk back.\n Shinsuke was glad for a moment that nobody in this room could read his mind, fully aware of the irony.\n Dr. Otani cleared his throat, “The dementia of a nonpathic always comes in this form. The human mind craves company, and when it does not receive it, it creates it. It is cruel of the State to discourage nonpathic communities, I know. But hopefully this meeting can make you feel better!”\n It was a bitter tragedy that even in this room full of hikikomori Shinsuke still did not belong. When his turn finally came, he went to the front of the room and spoke in a waver.\n “Sometimes, when I am alone at home . . . ” He inhaled deep as if he could breathe in more time to think, as if he could inspire a good lie.\n “Sometimes when I am alone at home I see my parents still there.” And the rushing gurgle of a dark current, a city lit by heat alone, and the warm sour taste of hydrogen sulfide. “I have not seen them for many years, but now I can finally talk to them.” A voice as old as starlight, saying, Look. “My last words to them were that I could never truly love someone, but now I can tell them that’s not true.” You are Us. “I can finally touch them and hug them.” We are You. “I can tell them I love them.” You belong.\n His audience nodded silently. He bobbed his head and returned to his seat so the next person could speak.\n When the meeting was concluded, they were let out one-by-one, at fifteen-minute intervals. Shinsuke left the same way he’d come and boarded a metro car.\n Partway to Shibuya, he felt a tug on his pinky. He whirled around to see Saeko staring dead ahead, her face blank like everyone else’s. But she had his pinky pinched between her thumb and forefinger. He looked dead ahead, too, trying not to blush. If anyone suspected two hikikomori meeting together, the news could travel at the speed of thought to someone who could stop it with an electric rifle and a plastic club. Who could have them thrown in a hospital and forcibly treated, down where Shinsuke wanted no scalpel to ever touch.\n When they reached Nagatsuta station she briefly tugged on his finger before floating away with the crowd. He did his best to follow, but was soon lost and spat out alone into the wide-open Midori ward, empty hill-country of Kanagawa prefecture.\n Then he saw her standing perfectly still, ten meters away. When she caught his gaze she was off again, and he followed. This time it was much easier: the crush of the crowd disappeared and it was just the two of them, beating a path from the cracked concrete sidewalks of Midori proper and into a hilly wilderness.\n When they crested the first peak she stopped and turned around to face him.\n “You see them too,” she said, in a voice strong and clear. She’d had more practice than he had in recent years. “The other worlds.”\n He whispered hoarsely, “How did you know?”\n “Your story was so much a lie. You didn’t shed a single tear. That’s how I knew,” she said, glancing periodically at the way they’d come. “There are more of us, at the camps. Not many, but more than just two.”\n “Camps?” This was very much illegal, and could very much get Shinsuke killed. But it was the dream he’d searched for as a young man, dropped into his lap. A commune. A place to be together.\n She grabbed his hand and jerked her head southwest.\n “Camps.”\n Hexagons of hard and warm, smells like a homecooked meal and a mother’s hair, and the comforting vibrato press of family. A hive. Even here, he was told, A revolution can take hold. We are You, You are Us, You belong.\n The camps were built from wooden planks and plastic bags, with the doorways draped in deep red flags and guarded by hard grown men and women. Motorcycles and jeeps girded the perimeter in a makeshift fence of headlights and black tires.\n “Welcome to the capital of Nihon-koku.” Saeko took him to one of the larger wooden cabins while he let out a hoarse, amazed sigh. This was the home of the Nation Within A Nation—the Peoples Without a Voice. He had actually found it.\n A big man with scars came out of the cabin and saw Shinsuke next to Saeko. The man had a stern face and what seemed like a permanent squint aimed right at him. Shinsuke had watched enough streams to know that this was when the newcomer would get grilled about his loyalties, his origins—everything. He needed to build trust or else he’d be turned away.\n The scarred man stomped through the dirt, Saeko averted her eyes, and Shinsuke braced himself. Then he was hugged tighter than he could remember, so firmly that he let his legs hang limp as he was lifted off the ground. So tightly that he saw stars, that the knots in his back unraveled and he was as soft as steamed rice in this big man’s arms.\n “You will never be alone again.” Shinsuke was placed gently back on the ground. “Welcome to our family.”\n Asteroids peppering a small red moon, craters like pinpricks in its skin. Then a massive barge, dragging rocks in a net of gravity, crushing them closer like fingers folded into a fist. A flick of a gravitic wrist, a sudden squeeze of gees, and the stone let loose from its sling to wreck that lunar face.\n “What are they?”\n Shinsuke was sitting on the dirt floor of a hut along with Saeko, Grace Ueda, and Keigo Naktani. All of them had the visions, and those bubbling thoughts that felt almost theirs but were far, far too old.\n Keigo explained as if he already knew, in a deep gravel voice: “They are voices from other worlds.” Shinsuke had already suspected this, but hearing it said aloud gave it a strange and terrifying life. He shuddered, and Grace smiled at him with wrinkles around her eyes.\n “We were each afraid, too,” she said. “How strange to find that we aren’t alone in this life!” She touched her fingers to her temple: “But think also how wonderful.”\n Keigo smiled and his thick bushy moustache curled up like a caterpillar reaching to nibble at his nose. “Think of what this means. Not only that we have friends in faraway places, but that it is possible to even hear them at all.” He put a fist over his heart, “The me inside can talk to someone millions of miles and millions of years away, someone as distant as the faintest star—and they can talk to me. We’ve seen their worlds, so unlike ours, and yet . . . ”\n Grace continued, “And yet here we are. Inside we are all the same.”\n Saeko had been silently nodding while sipping at a bowl of soup, but she lifted her head to lazily say, “Grace and Keigo think that means we have souls.”\n Shinsuke turned to her. “You don’t agree?”\n Her eyes were hard. “It would also mean there was a God, and what kind of God would make us live like this?”\n “Perhaps the same kind who would connect us with beings so far away,” Keigo offered. “One who is now giving us an opportunity.”\n Shinsuke’s brow crumpled in puzzlement. “What opportunity?”\n “Haven’t you understood? They’ve been talking to us about a revolution.”\n Upwells of deep ocean churning the thermocline, catalytic magnesium bubbling liquid in a vial, a diamond planet pecked just right and shattered into a trillion shining pieces throwing rainbows into space for light-minutes in every direction.\n Shinsuke had been learning how to be useful. In the mornings he helped cut a terrace from a hill and soak its soil with water for the rice paddies. After a nap ‘till noon, Keigo would take him to the hives to collect honey from the bees. Some horrifying days he’d have to wear a thick jacket with a netted hat and wield a wooden racket. Hornets the size and width of his thumb would sometimes come to steal bee-children, and he and Keigo and some others would need to swat them out of the sky. Their stings were brutal, and their biting jaws were just as bad.\n Today, Keigo asked him to do something he knew he couldn’t do. The pig was tied to a post and squealing like a child might cry, desperately tugging at the rope and lying limp in the dirt in awful alternations. Shinsuke was handed a small rifle and told to make it quick and painless.\n He shook his head no. “I can’t do this, Keigo.” His voice had gone from hoarse to the smooth timbre of a young man’s. “Give me another terrace to dig, or more rice to plant. But I can’t do this.”\n Keigo smiled and gently placed his hand on Shinsuke’s shoulder. Then he breathed in deep and asked, “Do you know why the countrymen use machines to fight for them? To act as their police, to hunt down their dissenters?”\n Shinsuke shook his head.\n “It’s because they are afraid of accountability. To their own feelings.” He drew a circle in the air with two fingers: “They are all connected like this, and if one of them commits a violence they all feel the guilt. So they give that job to their machines.”\n He gestured to the tied pig with an open palm. “You’ve eaten pork every week. You’ve spoken with, danced with, and played with everyone here who is happy to be well fed. And now it is time for you to pay for that pleasure.” Keigo pushed the rifle deeper into Shinsuke’s grip. “Will you be like the countrymen, too afraid of their feelings to do what is necessary? Or will you be like the men and women of the Nation?”\n Shaking, Shinsuke raised the weapon to his shoulder and took careful aim. The iron sights jitteringly aligned above the snorting creature’s eyes. He tightened his finger slowly, let go a long breath, and with one deft move he squeezed the trigger.\n Fire exploded from a bonfire and the week’s big feast was underway. Keigo cleared his throat in front of the crowd and publicly thanked Shinsuke for bringing them all a delicious dinner. And then the drums began.\n Everyone talked, ate, drank. When the time was right they danced on the flats that had been stamped down by the weeks of dancing that had come before. Saeko came by to lure Shinsuke away from the tables, but he remained and ate slow and shuddering everything but the pork.\n Monsters the size of subaquatic mountains lumbering through trenches in the sea, blankness in cold pursuit and a promise to unmake, spores released that latch on and change the very shape of the mind.\n Shinsuke awoke to find Keigo in moth-eaten fatigues and slung with a very large gun. Saeko was there, too, with grenades strapped to her belt and a long rifle strapped to her bulging pack. They gave him clothes and told him to get into the jeep outside.\n A girl was already there. Shinsuke knew she was named Namiyo, and that her father was an engineer. He traded awkward hellos and asked where they were going. She opened her mouth as if she were about to speak, but fell silent and told him to just wait.\n They spent a few minutes looking at the pre-dawn tease of orange across the cold gray sky before Keigo jumped into the driver’s seat and the jeep rumbled to life. Saeko joined them and they set off, tumbling through the hills.\n “Shinsuke, tell me—what happens when we miss a hornet and he makes his way into the hive?” He aimed his question over his shoulder, since the jeep’s mirror was missing.\n “He kills anything in his way,” Shinsuke said.\n “But?”\n “But then the hive will come together, surround the hornet with their bodies, and cook him until he dies.” Keigo slapped the steering wheel and laughed as they rolled between hills and onto an overgrown road.\n “Yes! Yes, that is perfect. And, what occurs if a fire is left too close to a hive when this happens?” Namiyo, the engineer’s daughter, blushed at this. Two weeks ago she left a torch next to a hive when hornets came looking for food.\n Shinsuke put his hand on her shoulder and answered, “The whole hive dies. Even a little more warmth is enough to kill every single one of them.”\n The vehicle bounced over cracks in the road and pieces of broken stone from the curb. Mottled light fell between leaves that blotted out the sun, flashing in a golden strobe when Shinsuke cared to look up.\n “The key to causing a defensive reaction like this is singular. Saeko, what is that key?” Creaking metal towers whipped by amidst the overgrowth, sagging under powerlines and leaning at dangerous angles.\n Saeko answered, “Abject fear.”\n “Precisely. Fear from a single hornet can kill the whole hive, under the right conditions. And we,” he said, setting his jaw, “We can be the hornet to the countrymen’s hive.” They arrived in a time-shattered lot of an old facility when Keigo snapped up the brake and jumped outside.\n “But the hornet dies,” said Shinsuke.\n Keigo waved away the thought and beckoned him inside the building. Hulking police machines stood limp at the gates, seventeen feet and sixteen tons of metal left deactivated to rust. Namiyo produced a small screen and began to swivel oddly with it as they proceeded through the facility.\n They finally reached a room designed like half of a stadium, with raised platforms filled with desks and chairs and a giant screen dominating the wall. Namiyo pressed a button, there was a loud rumble, and the room came to life. Panels turned on, the screen grew bright, and the loud tortured thrum of an old fan beat noise through the walls.\n Shinsuke wondered for a moment what the guns were for. Perhaps a safety precaution in the event this place was less abandoned than it seemed.\n Keigo gripped him by the elbows and looked at him with pride and knowing. “Shinsuke.” He took a deep breath. “Though you are our newest member, I know you’re the right man for the job.” He gripped harder. “I know you will act without hesitation—like a true man of the Nation—because I’ve seen you do it before.” Shinsuke had killed many pigs in his time with the Nation. And other animals, too.\n Namiyo dusted off a console and presented Shinsuke with a seat. Keigo guided him to it and sat him down.\n “This is where countrymen once piloted their machines themselves. Today, that job is yours.” Keigo patted Shinsuke on the back. Shinsuke threw Saeko a bewildered stare, but her face was blank. “You need to remind them what it is to hurt, Shinsuke. And then they’ll rush to defend themselves so hard and clumsy that we can take them all out with ease.” He did not elaborate.\n A control-stick slid out of the console with an aching whir. Shinsuke grasped it and asked, “What do I have to do?”\n Keigo sighed. “You are going to have to kill a lot of people.”\n An ocean boiled, a continent charred, a planet sliced open like an orange, a system sucked into a black hole, all necessary, all horrible, death that paved the way for new life, a spreading fire with revitalizing ash.\n Saeko and Keigo stayed until Shinsuke reached his first target. The controls were easy, like a game’s. They were all surprised that Shinsuke could pilot the rusted heaps so gracefully. Many of the guns attached to the walking mech-machines had long since been jammed, but the rockets and sheer mechanical force provided by the limbs were enough to smash a building to pieces. This target was simple enough: Shinsuke could see no bodies in the rubble and went on guilt-free.\n Keigo left his list of targets and said he and Saeko needed to attend to other business. “Don’t lose focus,” he said. “Keep going. If one machine is destroyed, engage another.” He glanced at Namiyo and unslung his rifle. “Trust only your senses, and do what is needed.”\n Their footsteps disappeared and the loud shunk of a metal door slamming shut followed their exit.\n Namiyo finally spoke. “They’re tricking you.”\n Shinsuke looked away from his screen and the growing scene of a chaotic crowd pulling at the rubble to find hands and feet crushed beneath. “They’re tricking me? Tricking me how?”\n “They never intended to wipe out these people. Right now they’re going to warn them, in exchange for replacing their police force with unconnected people like us. A hikikomori tribe that countrymen would encourage to grow, as protection.”\n “How do you know this?” Shinsuke’s hands left the machine’s controls. He saw the red-and-blue lights flash in the distance on-screen as the engineer answered.\n “I heard. Keigo finished yelling at me for being so stupid with the hive, and when I left, I heard him whisper to Saeko and Grace. This was always the plan.”\n Shinsuke closed his eyes and asked a question he already knew the answer to. “And what exactly will happen to us now?”\n “Keigo, Saeko, and a contingent of others from the Nation will come here with their big guns and destroy this entire facility.” She sank into her seat with what could only be described as acceptance. “They’ve locked us inside.”\n Shinsuke didn’t feel any roaring hot anger. It was cold, like a sword left in a quenching pool. It was sharp.\n He snapped up the controls just as an autonomous police machine approached his own, ready to fight, but instead it simply bent down to help the people with the rubble.\n “Your robot’s friend-or-foe identification is still valid.” She crinkled her nose. “Strangely enough. They won’t attack you.”\n “Perfect.” Shinsuke activated another machine close to the facility and followed the tire tracks in the road. He dropped his mech into full-transport modality and sped like a sportscar after Keigo and Saeko’s jeep.\n “Namiyo, what capabilities for speech are on board these machines?” Shinsuke flipped a few switches and returned his attention to the main screen.\n “Both audio and visual. Only audio when in transport mode. Speak into the microphone and press the green talk button to broadcast your message.”\n Shinsuke nodded, “Good. Now pull up a console and take a mech to Kanagawa prefecture, at this address.” He wrote down a street number and slid it to her desk. His machine was rolling at two-hundred kilometers per hour, bouncing high into the air when it hit ruts and ridges in the concrete. The jeep’s dust trail was only a few hundred meters away, and Shinsuke spun up the engine as fast as it could go.\n A defunct space station hanging derelict around a shattered star, a glowing glass world left devoid of life, a great machine sparking and blown to smithereens upon first touch. First Plans, first Results.\n Shinsuke activated another machine and commanded it to follow the jeep as well. His first mech was coming up close from behind, now. At a meter away, he swerved around the speeding vehicle and went perpendicular to the road in front of it. The spherical wheels slowed and the moving barrier ran the jeep off the steep shoulder of the road.\n Keigo and Saeko picked themselves out of the dirt while Shinsuke punched the talk button and calmly said, “Namiyo told me what you were planning.”\n Their voices streamed in as if through tin.\n “Shinsuke? What are you doing? What did Namiyo tell you?” Keigo stepped in front of Saeko and said, “I thought I could trust you to stay focused on your targets?”\n “She said your ultimate plan was to join with them, Keigo. To come back here and blow us to pieces. It’s a good plan.” Keigo raised his hands above his head, slowly.\n “We would never do that to you, Shinsuke. You’re family.” Shinsuke turned to look at Namiyo, who was still busy performing the task he’d asked her. When he looked back at the screen, he saw Saeko had slipped the big gun from under Keigo’s raised arms and was aiming directly at his mech. The barrel was as dark and deep as a black hole: until she fired and the camera feed burst into static.\n Cold, cold anger.\n The second machine was already within a hundred meters and he saw the smoldering wreckage of the first smoking in a junked heap. He jumped the mech into full-combat functionality and it rolled out into a heavy six-limbed titan in mid-air, swiping wildly at Keigo and Saeko and forcing them to dodge and drop their weapons. The mech landed with a thump and an explosion of dirt, with the two cowering at its feet.\n Phospholipid bubbles effervescing out of primordial ooze, the scaled predator hunting the fat prey, one set of teeth gnashing better than the last. Strong rules over Weak.\n Shinsuke smashed them into puddles of red mud almost without thinking, burying them deep with thirty-ton stomps of piston-legs and sealing their graves with jets of flame. Then he dropped back into transport mode and sped down the overgrown roadway, trying to remember the path back to the camps.\n Namiyo had finally made it to Dr. Otani’s office in Kanagawa prefecture, and was waiting for Shinsuke’s command.\n “Give me the microphone, and put me at full volume.” Namiyo complied.\n “Dr. Otani!” he called, and the mech’s speakers thumped with every syllable.\n The counselor emerged from his office and looked curiously at the big machine.\n “Shinsuke? We have been missing you at our meetings. What are you doing in that vehicle?” He puffed up in a show of indignant confusion, with his hands on his hips.\n “Never mind that, Doctor. There has been a crisis to your people, and I’ve managed to resolve it.” Otani made one of his classic thinking faces, with his fingers rubbing at his chin and a single eyebrow raised higher than should physiologically be possible. “Your machines no longer seem to be an effective tool for your protection and defense. I have a proposition for you. For all of you.”\n The old mech stood at full height in the middle of the Nation town. It had been draped with red flags and its metal shell was painted white with war stripes.\n In six months Shinsuke had taken the Nation from a cluster of huts in Midori to a pre-fabricated town named Haruaiko, with running water, electricity, and an academy for training the new generation of nonpathic protectors.\n His people had risen to control every war-machine produced by Tokyo’s factories, and they were growing larger. They sent for nonpaths from other cities, and the Nation’s glory finally matched its name. In a few years, towns like this were expected to pair with every major city in Japan. Strategic positions.\n A gas giant, a yellow rock, a blue-green marble swinging wildly around a star. Mountains like shards, nacreous clouds, spheres teased open in space and time; bent light and bridged minds—an infinity of minds that wove webs a galaxy in span. All connected. All united.\n It would take generations for this planet to be readied for Shinsuke’s faraway family: for enough conductive minds to be nurtured and enough defective ones to be culled. And it would take decades for the first arrivals to ever make landfall.\n Patience.\n Stars born over long centuries, systems resolving from spinning discs, planets coalescing from cosmic beads of molten rock.\n Slowly does Greatness come from Meanness.\n Comets splashing down in melting balls of carbonated snow, bilayered bubbles emerging from the morass, lightning striking cyanide and aminated soup.\n Slowly grows the Large from the Small, the Significant from the Worthless.\n Fire turning night to day on the eve of a rocket launch, accelerating strobes of dazzling light from inside a superluminal bubble, the great awe of touching the face of an other for the first time.\n Slowly."}