{"fingerprint": "54DCQv1sk6wHoGx/n2+Uj+vL30E=", "sitename": "Clarkesworld Magazine", "title": "Lydia's Body by Vylar Kaftan", "author": "Vylar Kaftan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kaftan_11_06/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Lydia's Body by Vylar Kaftan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2980 words, short story\nLydia's Body\nThe girl did everything for him. She polished his boots with bear grease and swept the floor with a willow broom. She washed the sheets, both sets, once a week. She dried them on a clothesline near their house—the one-room log cabin she guessed he’d built himself. Sometimes the Wisconsin breeze blew more dirt into the sheets as they fluttered, the linen stained with human fluids she couldn’t scrub out.\nHe went hunting most days, the man she believed to be Lydia’s father. Sometimes he’d stroke her hair and say, “I’ll be back by nightfall, my Lydia, with fresh meat.” The girl smiled at him, grateful for his presence at night when the panthers screamed. He trudged off through the forest, shotgun slung to his back, and she closed the door behind him. The door had no lock. No one was around for miles except the Chippewa, who ignored them.\nThe girl leaned against the door each morning, in the single room that had become her new home—her prison. She repeated to herself, in case she forgot: My name is Amanda Barnes. I’m twenty-six years old. I was born in 1980. I don’t belong here. But then she looked at her body, the unfamiliar skinny arms, her work-raw hands, and wondered how much longer she’d stay.\nMix cornmeal with water, and bake into johnnycakes. Thrust the dash into the churn with regular strokes.\nThis body knew its required tasks. The body’s hands mixed the cornmeal, stoked the stove, braided the onion tops together and hung them in the attic. Amanda found these chores instinctive—a way of listening to her core, where some ancestral spirit guided her. No words were spoken—she simply knew, the way she knew her heartbeat.\nOf course she’d told the man who she was—two years ago, when she woke up here. He’d blamed the fever and given her medicinal whiskey that she vomited back up. She couldn’t blame him—her story was unbelievable. How should she tell him she’d fallen asleep and awoken in another time, with no idea how she’d gotten here? She was only a little surprised to discover that the body had magic in it. Dishes cleaned faster than expected. The dirt floor swept itself at the barest touch. Magic must have brought her—but she couldn’t reverse it.\nHer old life was fading away. She remembered drinking cinnamon lattes, driving to work, skimming the Internet personals—these were the habits of a film character somewhere, in a theater she had been in once. They happened in darkness, and when the movie ended she was here, blinking in the sunlight of 1838.\nMend shirts with tiny stitches, overlapping each other so they look like white paint. The tighter your stitches, the less likely they’ll rip. I’m careful when mending his shirts.\nHe’d come home at night, with a dead deer or even a bear. Amanda marveled at how he slung the corpse around, the meaty weight under full control. She sometimes watched him working shirtless, as he smoked meat in a hickory fire or planted potato seeds. When he split firewood, the log cracked on the axe’s downstroke—almost before he touched it, like the wood opened itself for him. He worked to provide for her—not her, but Lydia, whose body she was in.\nAmanda had thought about leaving, but there was nowhere to go. The nearest town was forty miles away, and she didn’t know what direction. Wisconsin was frontier territory—just fur traders, Indians, and settlers who wanted to avoid other people. She’d asked where town was, but he didn’t say. “Why would you go there, Lydia?” he’d ask. “It’s too far, and there’s nothing to see. Someday I’ll take you, when you’re older.”\nSomeday. Amanda clung to that idea, as she scrubbed their undergarments. She didn’t know what magic had summoned her, nor who Lydia was. If something connected her to this body, she couldn’t see it. She’d stopped praying to find her way home. Even her mantra—My name is Amanda Barnes—felt useless. Just unrelated syllables—a spell with its life drained away. With each day, the idea of leaving became harder to remember. Despite her mantra, there was him, and he was the only reason she saw that drew her to this time.\nIt was impossible not to love him. That was the problem. Perhaps if she’d grown up here—if she remembered him swinging her in his arms, or leaning down to ruffle her hair—perhaps then, she could accept him as a father. But Amanda was twenty-six, and this man not much older—thirty-three, or a bit more. He was attractive, kind, and hardworking. He brought in fresh-killed meat, and hoed the potatoes with his strong arms, and once he shot a wolf that was nosing around the cabin door.\nOn Sunday nights, they sang hymns together. Their voices blended, tenor and soprano, and Amanda knew she could never tell him how she felt. He thought he was her father. Maybe, in a sense, he was—but he was all she had. At night as she listened to him sleep across the room, she thought about how they harmonized on the high notes, and how cold it was to sleep alone.\nI like how gravy simmers. A bubble pauses, swelling on the surface. It grows so large it might escape and float away. But the bubble bursts, because it must. It returns to the pot, to be served for his dinner.\nHe came home one night, flushed with November’s chill. “Poor huntin’ out there.”\nAmanda served his meal, buttering his potatoes. The attic was full of onions and smoked meat. Soon the blizzards would begin, and she—again—would be stuck inside the cabin for six months. Last year she’d gone nearly mad with boredom. Still—sometimes he’d go looking for fresh meat, and she’d worry. What if he didn’t come back? What if a wolf attacked him? What would she do on her own?\n“What happens to me?” she asked aloud.\n“Hmmm?”\n“What happens to me,” she said, changing her train of thought, “in a few years? I’m nearly grown. What then?”\nHe chewed on his venison. “I dunno,” he said. He spoke with difficulty, as if he’d been considering it. “Frank might want you. He’s the man I trade with in town.”\n“Am I property, to be given away?” she asked bitterly.\n“Lydia! I wouldn’t do that.” He stabbed his fork into the fried onions. “I wouldn’t give you to any man you didn’t want.”\n“Well, I have to think about my future.” Future—the word recalled something, about the butterscotch candies she kept in her desk . . . She shook her head. My name is Amanda Barnes . . .\nHe stirred the onions around his plate. “Want me to find someone for you? I could send you back East to work as a servant. I don’t got any living relatives. It’s just us, Lydia. You ’n me. At least out here, it’s just us. We can live any way we want. No one will bother us.”\n“Who would cook for you if I left?”\nHe set his fork down. The fire in the hearth crackled. “I don’t need much. I’d get on all right.”\n“Alone?”\nHe stood up. An upset person had nowhere to storm to, except the attic loft. Even there no one could hide, not long—everything was visible from below. He moved to the fire, next to the glassless shuttered windows. “I’d get a wife, I suppose.”\n“Why haven’t you?”\n“I don’t want one.”\nAmanda took a guess. “Because of my mother?”\nHe jumped like she’d shot him. He turned to face her. “Yes.”\nAmanda closed her eyes. “Do I look like her?”\nHis response was hoarse, and a long time coming. “Yes. Yes, you do, Lydia.”\nHe likes his meat fried with potatoes. The potatoes are in the attic. He never goes up there—that place is my own. Listen. A blizzard is coming.\nAmanda was in the attic, getting a string of onions for supper. All meals were the same each week—potatoes and onions, and whatever meat he brought home. He never came up here—somehow, she knew. She had memories that felt like someone else’s. He was hunting again. Amanda worried about him, alone in the woods. But he took his shotgun, and he kept it well-oiled.\nShe kept thinking of the way he’d spoken the name Lydia. She’d heard that note—the longing for his absent wife—his loneliness, alone with his daughter in the wilderness. But he’d chosen this life for them—to live undisturbed by others. Free.\nHer kerosene lamp gave little light in the attic. It was early March. The windows were shuttered for the season. Overhead the wind blew across the roof. A blizzard, she knew—no, it wasn’t her knowing that. The deep instinct told her. She hated the blizzards, hated the way they buried the house and trapped her inside. If he were home when it started, he’d stay—but otherwise, he dug shelter where he could, and she was alone.\nShe tugged on an onion string. All winter, she’d thought about him—as they slept in their beds, and as they sang together. She saw how he looked at her. He was thinking it too, and probably hating himself. A father and daughter—no, that couldn’t be. But she wasn’t his daughter. She was Amanda Barnes, whether he believed her or not.\nThe string broke. Onions tumbled to the floor. One rolled behind the cornmeal barrel. Amanda hunted it down and scooped it up like a runaway softball. She used to play softball—when was that? In her past, which was now her future. She felt shaky as the wind howled. The blizzard was coming. He would take shelter somewhere, and she was alone.\nAmanda cradled the rough onion in her hand. Every crop was hard-fought. Each onion grew from his sweat, as he worked to feed them both. Tears ran down her face. Winter was driving her mad—hands scratching inside her, a voice trying to shout, a feeling colder than snowdrifts. Something hateful rose inside her like a ghost, until she thought she would burst.\nShe threw the onion against the wall. It’s March that does this to me, she thought, only March. She wanted to vanish into the snow with this magic body. A wish—but wishes were powdery snow melting in sunlight, gone before a season ended. If she could wish herself into happier times—but she knew no spells, and the body only seemed to do household magic. The things it knew, perhaps, from when Lydia was here.\nBut now it was Amanda’s body. She was stuck in this house, this time. This life was hers—to suffer through, or to find happiness. She picked up the onion. “My name is Amanda Barnes,” she said aloud. That man was not her father, and she could do as she pleased. No one would stop her.\nThe wrong wish is a dangerous spell, cold like ice. It traps the careless. It freezes you under the surface and never melts. I made a mistake. I need my body back.\nDownstairs, the door crashed open. Amanda dropped the onion. Lydia’s father stumbled in with a swirl of snow, his arm clutched across his coat. His hand pressed bloody snow against his shoulder.\n“Lydia,” he called, “I’ve shot myself.”\nThe girl scrambled down the attic ladder. He staggered to his chair and shrugged his coat off. He tore his shirt away, ripping the stitches like paper. The wound was more blood than injury. She grabbed strips of cloth and put water on the stove. He would live—but her body was cold, like the blizzard had swept inside the house.\n“An accident,” he said. “My own fault—careless. So distracted—aahh!”\nHe sucked in his breath as she cleaned his wound with water. “No. Bring whiskey.”\nShe fetched the bottle from the shelf. He poured it over his shoulder, hissing when the alcohol burned the wound. The brown liquid mixed with blood and ran down his arm. He took a swig of whiskey. He swirled the liquor in the bottle, and drank three more times.\nShe took the whiskey. Her hands shook. The wind rattled the shutters. Behind his back she took a drink herself. The liquid burned her throat and warmed her, like she hadn’t felt for months. She drank again, to drive away March, and loneliness, and the dark hatefulness inside her.\n“More,” he muttered, and she handed it back. He drank deeply, leaving the bottle half-full. He set it down. “I’m fine. Help me wrap the wound.”\nThe girl obeyed, and the magic worked—her hands knew where to put the cloth, where to tighten or leave loose. The whiskey burned inside her like a kerosene lamp flame—banishing darkness, past, and future. There was only this moment, touching his skin, easing his pain. His breathing slowed, and his muscles relaxed. When she finished, she pulled her chair over and leaned on his good shoulder. She might have lost him, she realized, and she would have been alone—with the blizzard, and the cabin, and a lifetime stretching ahead of her.\n“I don’t know what I’d do without you,” he said. He took her hand and squeezed it. Her heart raced. She leaned over to kiss his cheek. He turned his head to say something—and she brushed against his mouth.\nI can do what I want, Amanda thought fiercely. She kissed his lips, her tongue exploring their closed line. He moaned once, then opened to her. Their tongues fought inside him, tasting of whiskey.\nAmanda stroked his hair. The room floated around her. “Shh,” she said, moving her mouth away. “It’s all right.” The instinct inside her screamed no, you can’t—and she silenced it. This was her life now.\nHe grabbed her waist and pulled her onto his lap. He plowed into her mouth like a starving man. Amanda’s breath quickened. His hardness pressed through his workpants against her leg. She wondered if this body could hex him. Her hand slid up his thigh, brushing against—\nHe shoved her away. She tumbled to the floor, bruising her hip. He reeled against the chair and clutched his forehead. “Oh, God, oh Mary, Jesus—” he muttered.\nAmanda crawled away. The room spun. His voice rang over the crackling fire: “We can never do that again, do you hear me? Never.” He yanked the door open. Blizzard winds swirled in. He swore and slammed the door, not looking at her. “Go to the attic. Stay away. Go away.”\n“I’m not your daughter!”\n“Stop it!”\n“My name is Amanda Barnes—”\n“Stop it!”\nShe couldn’t. The words poured out like blood, staining the space between them. “Don’t you see how I’ve changed? I’m not her anymore. I love you. Look at me—you know I’m not her!”\nHe whirled around, and she read doubt in his eyes. For a moment, she dared believe. Then his expression hardened, like he’d built a barrier against her—against himself. “It’s not possible.”\n“I swear it’s true. You know it’s true.”\n“We can never be that way. No matter what we want.” He pulled the Bible off the shelf and went to his bed. He faced the wall and opened the book. He didn’t turn the pages.\nNever. She could never have what she wanted, never leave, never hope. Deep inside her, something clawed to get out. It was that instinct, that voice—the one she’d trusted until now. Amanda glanced at the attic ladder, but it was too hard to climb. She stumbled to her bed and collapsed, drunk and exhausted. Her stomach heaved, but she kept its contents down. Even when she closed her eyes, she was spinning out of control. She couldn’t fight anymore. The darkness would bury her—like this damned cabin under ten feet of snow.\nNo, you can’t—I won’t let you—\nShe was fighting for her life, the girl: only one body for both of them, two minds in the same magic flesh—one born there, and one summoned against her will. It should have been an exchange—Lydia’s wish come true. The spell should have let her escape her hated life. It had been the wrong wish. The wrong wish could kill.\nLydia’s spell failed, and she had paid for it. Trapped under Amanda’s presence, she’d waited, cold as burial, imprisoned inside her own flesh. Somewhere in the future was a soulless body—Amanda’s body, the one Lydia wanted. She knew now: her magic couldn’t take her there. But it could still free her from this self-made prison.\nShe waited until Amanda was weak. The fight was brief—the body’s magic ran deep like a well, and Lydia knew how to tap it. Amanda did not, and was defenseless. Lydia rose from the icy place inside and summoned power from her own blood. She started with her fingertips, the muscles clenching at her command, and worked her way into the body’s organs. She wrapped Amanda in tendons and bile before pushing her into darkness. Lydia buried her in the body, grieving. Her guilt was a stain she would never scrub out. But she felt her life returning, once she controlled her body again.\nLydia woke in her familiar bed. It was night. Her head felt fuzzy, like she’d woken from a bad dream. Her tongue was cotton-dry. She looked toward her father’s empty bed. A candle stub cast its light across the patchwork quilt. Next to it stood the empty whiskey bottle, reflecting the flame into a shining stripe.\nShe sat up, wondering where he might be. Then she knew—by instinct, like breathing. She knew where he was, the way she knew what he wanted.\nA shadow crossed in front of the flickering candle. A breath touched her face, smelling of liquor. His hands pressed her shoulders against the bed. “No,” Lydia whispered, sick with whiskey and buried desire. Her stomach lurched as her fingers curled toward him. “No, we can’t—we can’t—”\nHe said, “Oh God.” The candle went out."}