{"fingerprint": "pm8e1aSKEokKN+xnwFuaNZXXvMw=", "sitename": "Clarkesworld Magazine", "title": "I'm Feeling Lucky by Leonid Kaganov, translated by Alex Shvartsman", "author": "Leonid Kaganov; Alex Shvartsman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kaganov_07_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: I'm Feeling Lucky by Leonid Kaganov, translated by Alex Shvartsman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6890 words, short story\n I'm Feeling Lucky\n My sandwiches will soon appear on the kitchen shelf. Grandpa An doesn’t eat sandwiches because he has cancer. He has only a couple of months left to live. That’s what the doctor said in the corridor, and when I overheard it, I cried all evening long. This had been two winters ago, when I was really little and used to cry a lot. Grandpa has a gray mustache, the best mustache in the world. Also, his head is funny-looking; it’s bald and covered in dark spots. It’s warm and velvety to the touch. Grandpa smokes his pipe and watches TV. Grandpa’s eyes are always laughing. He’s with us for now, but at some point he will leave for a distant future, where scientists will have learned how to cure cancer. Mom said so.\n “Grandpa!”\n There are voices coming from the television as Grandpa An watches the news. This is a foolish thing to do because tomorrow and the day after tomorrow and next week there will definitely be newer news, much more recent ones. I pull on the sleeve of his robe.\n “Grandpa, how soon will you leave forever, to go to the future where the scientists know how to cure cancer?”\n “Not too soon,” Grandpa replies with a smile. “You’ll have time to grow up, go to school, graduate with honors, and go to college, and I’ll still be with you, though less and less frequently. And when my health deteriorates badly, then I will go to the distant future, forever.”\n “This future—where is it?”\n “The future comes every second. But the future where they can cure cancer, that will still take a long time. It’s far away.”\n “Far?”\n “Yes. In this future, people will be able to cure any disease, travel to the stars, and robots will do all the work. There will be no war, no one will get sick or die, people won’t grow old, and all grandpas will become young again.”\n “Grandpa, will you take me with you to this future?”\n Grandpa An smiles. He upturns his pipe and knocks it against the edge of the ashtray. Bits of ash land on the carpet, but Grandpa’s vision is bad, and he doesn’t notice.\n “What do you need the future for? You have the present.”\n “What present?”\n “Everything around you. You need to live, grow, and study. Perhaps you will grow up to become a famous scientist and figure out how to cure cancer. And then the future will begin.”\n “But what if I don’t grow up?”\n “You will.” Grandpa laughs and his gray mustache hairs bristle.\n “But what if I don’t figure out how to cure cancer?”\n “Then you will learn to do something else. And other kids will figure out the cancer thing.”\n “But what if the other kids don’t figure it out?”\n “At some point, they will. The future is infinite.”\n “But what if it isn’t infinite? What if the sun goes out?”\n “Who told you such a foolish thing? Why don’t you go and check if your sandwiches are here yet?”\n I run to the kitchen, climb onto a stool, and check the shelf. The sandwiches aren’t there. I have to wait. It’s boring to wait for sandwiches. Mom made them, and they’re flying in a bag fastened with a temporal clip. Mom sent them in the morning, but she didn’t say what time they’d arrive. We haven’t had a refrigerator in years; Mom said it wastes space in the kitchen. Everyone uses the bags.\n I try to imagine the place where my sandwiches are at the moment, but I can’t. Grandpa An explained that the bag is like a boomerang—it travels from the kitchen shelf via a circular orbit, so it can return to the same spot. This orbit is created by the clip. Except it isn’t a simple orbit, but a temporal orbit. Which means in reality it doesn’t exist. And the bag doesn’t exist anywhere, until its time comes. And then it appears again.\n My Grandpa is the best in the world, and he explains everything better than any schoolteacher, because he is the best schoolteacher himself, except he’s retired for now. When he leaves for the distant future, where the scientists live, he will become healthy and young, and will once again work in a school teaching history. He said so.\n I haven’t started school yet, so I don’t know what an orbit is, or what a boomerang is. I don’t understand: if the bag doesn’t exist anywhere, then where will my sandwiches appear from? Where do my comforter, fur boots, and ice skates come from, when we send them away until autumn, to free up closet space? But I already know how to program the clip all on my own, and how to set the orbital angle. One time I sent our tea kettle one million years into the future, and Mom started locking the box where we keep the clips. She got very scared because I could’ve gone along with the kettle. Mom said that a million years from now the sun would go out, and I would die instantly. But if people die in the distant future, then in what future did Grandpa An expect to become cured?\n There are a lot of things I want to ask Grandpa, but I always forget. He spends two days a month with us, and it’s like a holiday. Tonight, when Mom comes home from work, we will have a fancy dinner. Mom says we’re so lucky to have our closest people stay with us for our whole lives, yet she leaves for work every day. Tomorrow, Grandpa and I will go to the zoo if he feels well enough. I want him to feel well. I want him to be with us forever. But the doctor said he only has two months left, and he needs to make it to the future where they cure cancer. But Grandpa isn’t in a hurry—he wants to spend as much time with us during those two months as possible. There’s a temporal clip attached to his pajamas; on the morning after tomorrow he will press it and disappear for another whole month. Only his pipe and a leather bag filled with tobacco will remain, if Grandpa forgets to bring them in the pocket of his robe again.\n Finally! There’s a pop and the bag of sandwiches appears on the shelf. I grab it, jump off the stool, and run to Grandpa’s room. Grandpa is watching TV and smoking his pipe. I unseal the bag and bite into a sandwich.\n “Grandpa! What do you see in the place where you spend the whole month?”\n “I see how quickly you’re growing up.” Grandpa smiles.\n That’s how I remember Grandpa, and my childhood.\n When I was in first grade, Grandpa suddenly took a turn for the worse; he lost consciousness, and Mom activated his clip, sending him one hundred years ahead. After that I had often sent letters to Grandpa. I drew pictures for him and, once I learned how, wrote notes for him: handwritten notes on regular paper, the way he liked. But it was difficult to keep writing without getting a response, and I have sent letters less frequently, usually to congratulate him on various holidays.\n I wrote the last, longest letter when I graduated high school. I put the sheet of paper into his tobacco bag, attached a clip to it, and sent it from Grandpa’s old room.\n Hi, Grandpa! You left us when I was still little, and we never got a chance to talk properly. I think you could’ve told me many interesting things. I really hope they cured you over there and that one day we will meet again. Honestly, I sometimes want to jump a hundred years ahead and see whether the scientists invented something to make life better. Because in our time everything sucks, and it is getting worse with each passing year. I remember how much you used to like the news, but I haven’t written to you much about our lives. Let me summarize the events of the past few years—who knows how history will remember them after a century? So, listen. There’s a worldwide crisis. It all started with the pension scandal, after you left. The pension fund managers were upset because the retirees grew obnoxious: they’d demand annual payment in full, spend it all at once, and jump ahead by a year. Seemingly they had the right to do so, this was their money. Except people in our time stopped dying, and it’s not like someone could say to their face that they should move on and make room for the young, that the pension fund is finite. At first they tried implementing a law about mobile check-ins, to identify those who were jumping ahead, but then the job crisis overtook us, they quit standing on ceremony and canceled pensions altogether. As in, if you don’t like it, here is a clip and piss off into the future, maybe someone will feed you there.\n About the job crisis. There was a huge wave of emigration, people leaving for the future because of curiosity, because someone had wronged them, or to escape the law or their creditors. They left one by one, with families, in groups—whatever was their preference. There was no accounting for this; no one knew who’d left, and for how long. And whether they’d left of their own volition. In the news they say this is now commonplace: someone is robbed and killed, then the bad guys attach a clip to the body and send it a thousand years into the future—and that’s that. Clips have been in mass-production for twelve years and already some very unpleasant things are beginning to fall out from the past, including corpses. But the worst thing of all is the immigrants.\n Not a day goes by without those who jumped five or ten years into the future crawling out of the woodwork. We’ve had it with them already. Someone is gone for ten years, legally presumed missing, new people live in his apartment now—an apartment he hasn’t made payments on for a decade—and suddenly he shows up and demands his rights! But the most annoying thing about them is that they wander the streets like tourists, gawk at everything, stick their noses into things, and bother everyone with questions about how life is now and what’s new. It makes you feel like some sort of a native in a fish tank, with tourists passing by all day long and glancing at you to see if you’re dead yet. They’re very easy to spot in the street: they’re the ones with sour expressions on their mugs, because they expected to find paradise here, ten years later. Instead, there’s a crisis, and no food. The good news is that they don’t stick around for long: they quarrel and complain, and then move on.\n You get why there’s no food, right? Take a guy who used to plant potatoes or drive a truck for a living. It was a meager existence with simple pleasures—to watch TV and drink with his buddies. And when the going got rough, he suffered through it because he didn’t have a choice. And then the clips appeared, and that guy got to thinking the same sort of thing you used to tell me about when I was a kid—what if twenty years from now there will come a future where the scientists will have solved everything, and he won’t have to plant potatoes, get old, get sick, and suffer hangovers? Every person has moments when it seems like things can’t possibly get any worse. They want to drop everything and head out seeking happiness—on their own, or with their families. Maybe in the future the potatoes grow themselves, are self-peeling, and self-frying? And so that person reaches for the clip . . .\n As a result there’s no one left to plant potatoes, to work construction, even to teach. I mean, not literally no one. It’s not like life fell apart and the famine came—no. There’s a scientific name for this: a human resources deficit crisis, and it is felt clearly on our own hides. They say in the past there were problems with unemployment and overpopulation. Now people joke about how in the distant future the scientists will invent a clip people will be able to use to go back in time, back to paradise.\n They considered the idea of ceasing clip production and registering the existing clips, but—how? There are millions already made. There’s even a latest model, a clip with a button that says “I’m Feeling Lucky.” If you press it, you will jump who-knows-where—perhaps half an hour into the future, perhaps a hundred years, or perhaps a million. The chip randomly selects the destination.\n The people who thrive in our time—they’re not the best people. They are—forgive me, Grandpa—utter scum. There are too many thieves and criminals around now. You won’t believe it—being a member of a gang is fashionable rather than shameful these days. And it’s dangerous to walk the streets. You know, Grandpa, there’s this sense of aggression in the air; everyone is tense, you can read in their eyes: “Be thankful I’m still here with you, when I could already be in the future.” The politics are tumultuous too, even though there isn’t any large-scale war yet.\n Grandpa, I wanted to tell you; if anything happens, I’ll try to catch up to you. So if you suddenly see Mom and me, don’t be surprised.\n Oh, and I almost forgot, I passed all my final exams with only two B’s! I’m getting ready to apply to college and study medicine.\n That was the last letter I wrote to Grandpa. With the exams and going to college, there was no time. I went to college for two semesters.\n Then, on the eve of my eighteenth birthday, Mom didn’t come home from work. Her coworkers said that she borrowed some money until the next paycheck and left early. They said she was probably very tired and jumped a couple of years ahead to see how I’d grow up. But I’m certain that she went to buy me a birthday present and was murdered over that damned money.\n I spent a month living in our empty apartment until I decided to join Grandpa in the distant future, a hundred years ahead.\n I’d made a few short jumps before. You don’t feel anything. You set the time so the chip could calculate the orbital angle, you crouch and hold the clip to your chest so that your entire body is definitely in the jump zone, and you press the button. That’s it. You’re still crouching, and your finger is pressing the button, but you’re already in a different time. Sometimes your ears pop, because of the difference in the atmospheric pressure.\n I went to the living room, gathered my courage, and finally pressed the button. My ears got clogged up badly, and I shook a bit—it seemed the pressure differential was significant. I was surrounded by velvety darkness on all sides—I probably arrived at night. I knew that the margin of error for a hundred-year jump was plus or minus two months, but that was obviously theoretical. So perhaps it was even more—who knows?\n It was pitch black and almost completely silent. I could hear only the breeze and the beating of my own heart. After a few seconds, my eyes adjusted, and I was able to make out shapes.\n The living room window was broken, and the cloud-covered sky offered little illumination. The lampposts in the street were off. Everything around me was covered in dilapidated garbage. I reached for the light switch, which felt unusually rough. I pressed it, and the plastic crumbled under my fingers.\n My heart was pounding. The night freaked me out. I set the clip for twelve hours, and pressed the button.\n There was blinding daylight, and the view it revealed was terrible. The room was in total ruin, the remnants of clothes covered in a thick layer of dirt, sand, and dust. There was a huge hive that looked like a paper balloon under the ceiling, but it was also old and decaying—the insects having long since abandoned it.\n I went to Grandpa’s room and saw him immediately. He was laid out on his couch in the same pose as when we’d sent him, a skeleton wrapped in strips of his robe. Envelopes with clips were strewn nearby—the letters I’d sent to him from his room. Some were fresh, others yellowed—I’d sent them to roughly the same time period, but the margin of error must’ve been fairly sizable. The bag of tobacco lay on the floor. I opened it and pulled out the letter I’d written two years before, after graduating high school. The paper was yellow, and the ink had bled, blurred on the damp page. I tossed it aside and ran.\n The city appeared abandoned—weeds grew through the concrete and some buildings had collapsed under their own weight and were now in ruins. It seemed no human had set foot there in many decades. Where, then? This wasn’t the capital, but ours wasn’t a small town, either.\n I forged ahead mindlessly, climbing over rocks, and navigating around piles of trash. For some reason I didn’t feel sorry for my grandfather—it had been a long time since I’d made peace with the fact that he’d been gone, after all. I didn’t even feel sorry for Mom, even though I held out the tiniest hope that I would find both her and Grandpa here, alive and healthy. I felt sorry for myself. Where was I? What was I to do? Where had all the people gone? They couldn’t have disappeared, died out after only a hundred years. They couldn’t have all jumped into the future, there must’ve been some communities left, some obstinate fanatics. And those who’d jumped—where had they jumped to? Perhaps there was a base in the future, a meeting point, where civilization had been rebuilt and was prospering again?\n I walked to Radio Square, which was covered in chunks of concrete and asphalt. It appeared almost as though these stones had been brought over and dumped here on purpose. I looked closer and found an arrow formed out of rocks. I followed its path and realized that the rocks and stones in the square formed a message: People, let’s meet here in the year 3000!\n To be honest, my first thought was to go back to the apartment, gather the letters attached to the clips with fresh batteries, and search the abandoned buildings for any stuff that people might find useful in the future. But I badly wanted to get away from this dusty hell and to see living human faces.\n I figured out how much time was left until the year 3000 and then cheated a little: I added another fifty years, so that humanity would have time to clean up all the garbage, to fix up the city, and to rebuild civilization. Then I figured I probably wasn’t the only one clever enough to think this and added another fifty years—to make certain I arrived at the height of civilization.\n When I pressed the button, for a moment I felt certain that I would arrive at that very place—the sunlit city where scientists had solved the mysteries of nature and people would be happy.\n The world I found myself in was cold and monochrome. There was no city at all. Everything was covered in a thick layer of snow and ice. I stood at the bottom of a basin, surrounded by hills. Above me, the low-hanging sky was the color of ash. It was silent and cold. Although I didn’t feel the cold right away, I knew I wouldn’t last here in my summer jacket. The time I had jumped from had at least been livable; it might have been possible to find water there and people. Here, though . . .\n I looked around. What I had first assumed were hills were the ruins of the city. The skeletons of buildings, sagging and collapsed inward, were covered with snow, dirt, and debris. The sharp edges of stone slabs protruded here and there from the snow.\n I wrapped the jacket around me—the cold was quickly getting to me. I finally realized that this was it. The end. The year 3000 was really far away. There was no way back, and it would only get worse later on.\n But I had no choice other than going further, because there was nothing for me here but death. What did you do, you bastards? You split up and ran in search of happiness, and every one of you hoped that someone would figure things out, solve, and organize everything for you? You believed your grandpas’ stories about the paradise that awaited ahead? Those who stayed had lived out their lives honestly. Meantime, we’d rushed into the distant future as if it were a resort, not bringing anything, not making a backup plan, or a way to communicate, convinced that the resort would have all the amenities.\n That’s when I saw a string of footsteps in the snow. They were fresh and definitely human, though I couldn’t tell what sort of shoes the person was wearing. But someone had passed by here, recently! I waded forward, knee-deep in the snow. I walked around the nearest hill and saw a column of smoke in the distance. It was as narrow as a blade, rising over the ruins. I ran toward it, holding my jacket tight. Snow crammed into my boots, and my feet froze.\n I was near the pile of rocks where the smoke originated when a face appeared among the ruins. I stopped abruptly. We were only twenty steps apart.\n This was a person—a man in his forties. He wore something like a turban made of ash-gray rags. One of his cheeks drooped visibly, as though he had a toothache. There was a scar on his forehead, and his face was covered in a dirty, ragged beard. The man’s mouth was open, and he breathed out white steam. His thorny eyes looked at me with such wariness that I didn’t want to come any closer. He didn’t seem in a hurry to emerge from his hiding place behind the pile of rocks, either.\n “Hi!” I said, raising my hands.\n The bearded man was silent. His face expressed nothing.\n “Hey!” I repeated uncertainly.\n “What year are you from?” the bearded man barked in an accented voice with no intonation. Before I could reply, he added, “Do you have clips? How about clip batteries?”\n I hesitated for several seconds, which was long enough for the bearded man. A pipe appeared from behind the rocks and emitted a burst of fire. Something rushed past my head, as though all the air in this basin was rolled into a needle that stabbed through my ears. Only then did I hear the booming sound of a gunshot.\n I threw myself to the ground by pure reflex. I felt that I had to fall down in that moment. That saved me. The second shot thundered overhead, missing me again. There was no time to think. I felt for the clip and pressed the “I’m Feeling Lucky” button before he fired again.\n I wasn’t lucky. It was probably a hundred degrees below zero here, and a hurricane wind blew. The black shroud of snow shoved me, lifted me up, and carried me across the snowdrifts so that I nearly dropped my clip. My fingers went numb right away, and I didn’t even feel whether or not they managed to press the “I’m Feeling Lucky” button.\n This time, I was lucky. Even though I fainted from the change in pressure. But I was lucky in that I found myself in a humid, warm jungle. The heat immediately defrosted my limbs. When I looked at the clip, my heart nearly gave out. The tiny tableau didn’t have enough room to display the number of years I’d traveled this time. Based on the number of characters, tens of billions of years have passed. If Grandpa had been right and the mechanics of the clip were comparable to those of an orbit, then the orbital angle was as close as it could get to a maximum, as much as the battery charge in the clip could handle.\n I didn’t know where I was, but there was a different sky, a different sun, and only one moon. The gravity was lower. But at least no one was hunting me here, to kill me and to take my clip. This place looked like it could sustain life.\n I’ve never seen such plants, animals, or insects. The animals here were really strange, and all seemed made from the same mold. Someone who’s never seen real animals might think they were all different, but when I first saw them, I thought the jungle was populated with caricatures of human beings. All the animals here resembled people who’d grown wild, shape-shifted, and lowered themselves onto all fours. All of them had a single spine terminating in a head with a skull, and all had four paws—no more, no less.\n Maybe Grandpa had been right, and the future was truly endless. Or maybe Mom had been right, and the sun had gone out, and the galaxy had had time to implode and then explode again, and a completely different planet with an oxygen atmosphere had formed in this area of space. The clip had brought me here—the clip always drops you onto the nearest surface. If this was the case, I’d been extremely lucky. It was terrifying to think what the nearest planet surface in a newborn universe billions of years later might have been like. How many people might have made it to this world? The chances were practically nil. Perhaps in time immemorial one of our people had landed on this lifeless planet and immediately died, but the microbes they’d hosted had survived and were the origin of new protein-based life? And then someone else had landed here? I realize that the chances of this are extremely slim, but how else could I explain the fact that people lived in this jungle? They were wild and spoke an incomprehensible language. I’d stumbled upon their camp on my second day of wandering the jungle. It was just in time; only a single young woman had still been alive. There was some sort of an epidemic, and she was the last survivor, also about to die. I probably would have also become sick and died, if not for the portable medicine kit in the pocket of my jacket.\n I stayed in this world. I knew there was nowhere else to go, knew that the battery in my clip would run out in a matter of months, and maybe was already dead. But it was possible to live here. And it was a pretty world.\n The sun hung over the hills, refusing to set. It looked like a sabertooth’s crimson eye. An eye that was neither evil nor kind, but indifferent. This eye had plenty of time to spare; it was in no hurry to descend into night, and instead kept peeking at what we were going to do next. The sky was already covered in clouds, and fog crept in from the lake. It seemed as if our hill stood in the center of the world, surrounded by clouds above and below.\n A distant, melancholy howl came from somewhere in the thicket below the hill—the sabertooths were on a hunt. But here, in the cave at the top of a stone hill, they presented no danger. Especially not while the fire was burning.\n “The clouds,” I said.\n “Stars in the morning,” my woman replied, and pressed herself against me.\n I didn’t argue—I was used to the fact that she always turned out to be right. She had been born and had grown up in this land of lakes, thickets, and ferns, whereas up until two years before I’d lived in the city among cars and electronics. I pulled the edge of the hide over her legs. We sat quietly and still. The sun got bored of this and decided to leave.\n The woman fell asleep, and I kept looking outside, toward where the sun left an orange strip in its wake. Lately, I’ve noticed that I enjoyed simply sitting still and staring into the distance. Either my body attempted to rest after the daily treks across the taiga, or the view from our cave was truly spectacular. Or perhaps, out of habit, I was waiting for something to happen, something to change. For civilized people to appear, to light fires and bring forth tools . . .\n There was a whistling sound and a shadow flickered. I shuddered, even though I realized no sabertooth could get up here. The shadow was small. It flew into the cave and landed on the rocks, neatly folding its wings behind its back. It was a small flying toad. One that was young, inexperienced, and easily startled. One that was tasty when roasted on a skewer—especially its crunchy wings. If someone had told me a few years ago that I would eat a toad, and a flying one to boot, I wouldn’t have believed it. If only I had a net of some kind, or a crossbow—\n Before I realized what was happening, another shadow flew from behind me. Something whistled. A thump followed by the sound of rolling rocks reverberated through the cave. The little toad twitched in the corner, its wings broken.\n My woman rose smoothly, grabbed the toad without looking, twisted its head, skewered it onto a twig, and lowered it onto the smoldering coals. Then she lay back down without saying a word. We didn’t speak much. She’d learned my language pretty well, and I learned a few of her guttural words, but we remained too different and had few topics for conversation.\n I thought she had fallen asleep again when I heard, “Tell about childhood.”\n “What?” I asked.\n “Tell about childhood,” she repeated, turning the toad on the coals.\n “Childhood . . . ” I lay down comfortably, my fist under my head, and stared into the dark cave ceiling covered in clumps of soot. “I’ve told you many times already. About my childhood, about Grandpa, about school and college, and how I got here. You already know my language well, why don’t you tell me a story instead?”\n She was silent.\n “Where is your tribe from?” I asked.\n “We’ve always lived here.”\n “Where did you come from?”\n “From the gods.”\n “The gods?” I leaned on my elbow and turned.\n No, she wasn’t kidding—her dark eyes shone calmly in the darkness of the cave. An amulet glittered on her dark neck, a stone with a hole in it she wore everywhere and believed guarded her against danger. It was her tribe’s ancient tradition, but I knew that the stone resembled the clip I similarly wore around my neck.\n “A long, long time ago the gods descended to the land and lived here. The ancient gods knew all and could do everything. Mountains and animals obeyed them. They could cure all diseases and wounds. They were mighty.”\n “Where did they come from?”\n “They appeared from nowhere. Probably from the sky, because where else could one appear from? They could do anything but didn’t know how to live in the taiga. They had to forget in order to survive. My tribe descends from them. And the other tribes. And the animals, the birds, the toads, the fish. They brought the insects with them.”\n “There are other tribes?” I was surprised.\n “Far, far away where the sun sets, live bad people. They look like us, but shorter. They speak a strange language and weave baskets. If you lay with them, you can bear children. Their backs are twisted, covered in black hair, with bulging spines.”\n “You’ve never told me about them!”\n “It’s bad to talk about them. They’re bad people.”\n “Do they also have a legend about being descended from the gods?”\n “Yes. All-powerful gods created everything in the world. Everyone knows this.”\n “Are there more people?”\n “Yes. Far, where the sun rises, where the forest ends, and the sky is blocked by rocks. Tall people live there. They have large heads, and long teeth stick out from their mouths. There are very many of them and they’re all covered in red fur. They know how to make stone axes, but don’t know how to speak. They often eat people. My grandmother said that it’s possible to lay with them, but there would be no children.”\n “What other kinds of people are there?”\n “A long time ago, gray people with hairy hands lived here, but in a hungry season the sabertooths ate them all.”\n “Are there others?”\n “I don’t know.”\n “Do all of them wear stone amulets around their necks for protection?”\n “Yes, especially when they hunt.”\n “Did all of your tribe perish?”\n “No. I’m alive. You’re alive.”\n “Two people are hardly a tribe.” I chuckled and hugged her shoulders.\n Silently and slowly, she took my palm and gently pressed it against her belly.\n The hunt had been unsuccessful. In half a day I’d checked two dozen traps, but all of them were empty, and the bait was eaten. Searching for nests, I walked around the far edge of the swamp, where I hadn’t ventured in a long time. Not a single egg clutch! It was getting late, the sun had already reached the tops of the pines, and there was only enough time for a trek back to the cave. Empty-handed. As I climbed out of the bog, I noticed a little hoof track on the muddy bank of a brook. By then I had become good at tracking footprints and could tell that a small animal had passed by here recently; the hole hadn’t yet filled with water. The animal was limping. I couldn’t let such fortune pass by.\n I got down on all fours and sniffed, the way my woman did. As usual, my nose refused to catch any scents beyond the stream and the peat. I would never develop my sense of smell sufficiently. But among the sedge stalks on the ground, the little hoof prints were clearly visible, and they led from the sedge into the thicket. I followed the trail, clutching my bow. The sun was setting, growing red and swollen, and bursting with fire among the tall pines. At some point, I lost the trail. I had to get on all fours again and crawl across the damp ground. My clip swung around my neck on its rawhide leather cord, catching on damp ferns. It hadn’t mattered in a long time, and I have long since made peace with the fact that the battery was exhausted, though I didn’t have the courage to test it, not even with a five-minute jump.\n Suddenly I found the trail again; I was certain this was a deer. The tracks led to the side. The deer had passed through the bushes here, stumbling through the moss, leaving clumps of dark fur on the thorns.\n The sun had set, and the forest was darkened and had grown cold. In the distance a bird cawed in alarm. But I could still see the tracks, and the deer seemed to be very close. There was no time to approach from upwind, no time to hunt properly. I simply readied a bone-tipped arrow and dashed through the thicket. I could already make out a dim shadow in the distance. Suddenly the trees parted, and a clearing opened in front of me.\n I loosed my arrow in surprise, and it buried itself in the remains of what had recently been a deer. The shadow that hovered over it moved suddenly. A bright full moon shone overhead, and a heavy animal scent wafted in the air. The largest sabertooth I’d ever seen raised its blood-covered muzzle and stared at me.\n A chill went up my spine as I backed away, drawing a second arrow from the quiver. The bowstring squeaked but the arrow went wide—I never had learned to shoot a bow well, especially in a stressful situation. The monster bristled and advanced toward me in an unhurried waddle. It wasn’t afraid of anything.\n I drew the last arrow and heard the roar coming from behind me. I turned around and fired. Again, the arrow missed the sabertooth rushing at me from the thicket. New shadows were emerging from the darkness. It was a large pack, hungry and strong.\n I knew this was the end, but I pulled a stone hatchet from my belt—a small one, made for butchering carcasses. I stepped forward, crouched, then shouted and rushed toward them. But I didn’t have time to strike. A clawed paw swiped at my stomach and threw me up in the air. I dropped the hatchet. A distant bird screamed hysterically, and I fell. My back hit against stone. My hands pressed against my lacerated stomach and chest, staunching the sticky blood. Suddenly, my hand felt the clip.\n The beasts were in no hurry. They approached at leisure from all directions, sniffing noisily.\n I had no choice, and almost no chance. But I still pressed the “I’m Feeling Lucky” button.\n The jump threw me a hundred thousand years into the future. I couldn’t forgive myself for leaving my woman behind in that cave. The first thing I did was to destroy the clip. I crushed it into a powder with a piece of scrap metal I found underhand. I had been lucky—there was metal here! There were even computers here!\n In this era, the planet is populated by several different races that are distinct by their skin color and facial features. They look the same to me. Our people were all so different that you could hardly find two alike, save for the number of limbs. Here, everyone is so similar they could all be twins, and I haven’t yet learned to tell them apart properly. All of them have somewhat flat faces—like my woman did. Their bodies are hairless except for a thick mane on their heads, just like mine. Their ancient legends tell about the gods who created them in their image. Those gods knew everything and created the world. Local scientists are convinced that nature is driven by never-ending evolution, rather than degradation. They’re certain that people evolved from apes, who began to use tools. Even though they agree that in terms of tissue structure, a human is closer to a pig. According to their legends, the apes gradually evolved from rats, lizards, and fish, and those in turn from the microbes. Biologists compare genes of different species, trying to find a connection, and they’re surprised by the fact that the genes are nearly identical. Local scientists simply do not know how different the genes could be, if they truly came from different species. They dig up the ancient bones of extinct mutations and try to build a clear diagram of evolution. It isn’t working well, but they believe. I love them for that. I love them for everything they do!\n First I ended up at a police precinct, where I was given first aid and driven to the hospital. The hospitals are pretty good here; they even know a little about treating cancer. The hospital they took me to was a psychiatric institution. I pretended to have lost my memory. I spent a long time learning their language and customs but kept insisting that I didn’t remember my past. A year later they discharged me, having given me a name and a temporary ID.\n Now I live outside the city, in a trailer by a vegetable warehouse. I work as a forklift driver. I go to church on Sundays and listen to the stories of divine miracles and a man who was crucified and then disappeared. I believe that’s how it happened. I have to work a lot, but I’m fine with that. I’m a traitor, who escaped one civilization and found his way to another because he got very lucky. I escaped death, and here I’m safe. I mulled it all over for a long time and understood everything, and I have matured. I won’t run any further even under the threat of death. I never once regretted destroying the clip, even if I could probably find a new battery for it. They’re very technologically advanced here, even more so than we were. And if one of them figured out how the clip works, they could probably manage to mass-produce them. I really want to believe that will never happen here. I’d like to believe that very much. I’m sure I’ll be lucky.\n Originally published in Russian in Earth’s Last Song (Последняя песня Земли), 2006.\n Leonid Kaganov, from St. Petersburg, Russia, is a scriptwriter and multiple award-winning author of ten novels and short story collections. His fiction has been translated and published in France, Poland, Hungary, Lithuania, and Estonia. This is his first English language publication."}