{"fingerprint": "gQadMnaeFzYEbJFVI30nRTEoLQs=", "sitename": "Clarkesworld Magazine", "title": "The Book Reader by Keishi Kajifune, translated by Toshiya Kamei", "author": "Keishi Kajifune; Toshiya Kamei", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kajifune_09_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Book Reader by Keishi Kajifune, translated by Toshiya Kamei", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1400 words, short story\n The Book Reader\n Outside the window, a large whale swims, or rather floats, in the clear, early-summer sky.\n As its disproportionately huge eyes turn toward me, the whale’s body becomes tinted eerily dark red, and its flesh starts dripping.\n I gaze around the white-walled physics classroom. The digital textbook remains open on my tablet, still showing today’s lesson.\n An infinite number of ants crawl up my hands on the desk—or so I feel. When I blink a few times, they’re gone without a trace.\n The class is thrown into chaos. Some girls get up and scream. Terrified cries fill the room.\n The teacher, a young man in his twenties, writhes about on the floor, screaming in agony.\n An explosion thunders afar, followed by a booming roar.\n “Rumi, come with me!”\n I turn in the direction of the voice. It’s Miina. She grabs my arm and pulls me hard.\n I follow her as she drags me along.\n As I feel her grip on my arm, we dash through the long hallway in the midst of utter confusion. We run up the stairs everyone stays away from.\n “Where are we going?”\n “A safe place,” Miina answers. “Away from everybody else.”\n Monitors are everywhere at our school, keeping tabs on us in the name of security.\n Miina leads me toward the rooftop. When she hurls herself against the entrance door, it opens without much resistance.\n We catch our breath in a shower of early-summer sunlight. A clean, monotonous townscape spreads in all directions.\n “That’s the only way in.” She points her chin toward the door. “And out.”\n A flame rises in the downtown area. I cower, startled.\n “What is it?” Miina asks.\n “An explosion . . . ”\n “Is that so? It’s all illusion—triggered by the nanobots.”\n Miina has a special ability.\n She can read physical books.\n “I’ve got something to show you.” Miina handed me a book in her dorm room. “Open it,” she added.\n As I flipped through the book, rubbing the print-filled pages with my fingers, the letters danced before my eyes.\n For a while, I followed the sentences with my eyes, but I eventually got lost in them. I had never read a printed book before. My head throbbed lightly.\n “You can’t read, can you?” she said, as if surprised.\n I shot her a resentful glance.\n “I can,” she said and described what the book contained.\n “The human brain feels threatened when another person suffers less or gains something. That characteristic has survived to this day because it has aided the survival of humanity. In other words, when necessities were scarce, when food and shelter were limited, humans had to take it from someone else in order to get something.”\n “Sounds a lot like the definition of the word ‘jealousy,’” I said.\n “You’ve got that right, Rumi.”\n I first saw Miina among the incoming freshmen who lined up in front of the immaculate first aid room where we regularly have learning nanobots administered. As I impatiently waited for my turn, the sound of cheerful laughter reached my ears. As I looked up, a short-haired tomboy caught my eye. She was the center of attention, chatting with other girls. She struck me as my exact opposite.\n Then she stepped closer and talked to me.\n We began with exchanging names, but the rest is all a blur to me now, except for one thing that I wondered—What does someone like her want from me?\n That’s how I met Miina.\n Before long, I began spending lots of time in Miina’s dorm room.\n “I don’t remember my mother’s face,” I confided in her one day.\n She listened to me attentively while she lay in her bed. When I was done, she rolled over, pulled up her sleeve, and showed me the inner part of her arm.\n “Look,” she said, pointing to several severe bruises. “They’ve tried to harvest my bone marrow cells.”\n I gasped.\n “I’m immune to the nanobots. They want to transfer this immunity to others. The military.”\n “The military?”\n “The psychological forces,” she lowered her voice. “Just don’t tell anyone, okay?”\n By this time, we had grown close to each other and shared each other’s secrets.\n “I’m different. I can read physical books. But because I’m different, the military practically owns me.”\n Although I neglected to tell Miina, my father serves as an officer in the psychological forces. When I went home for the winter holidays, I brought up some questions.\n “Do the nanobots ever fail to affect some people?” I asked.\n “Just between us,” he began, with a half-empty glass of whisky in his hand, relaxing on the couch in the living room. “Some of us aren’t affected by the nanobots. They’ve got a special immune system that expels the nanobots when they enter their bodies. What do you think they’re good for?”\n “The military.”\n “That’s right. We now employ the nanobots as a means of psychological warfare. We scatter them in the air to cause mental disorders in our targets. Anyone who’s immune to the nanobots can be an excellent candidate for a soldier or an agent.”\n “I’ve got a classmate who can read books. She’s immune to the nanobots given to us at school.”\n “A certain percentage of the population possesses that disposition. We keep a huge list of them.”\n I gathered that he knew about Miina as he averted his gaze.\n “Why do you not want us to read books?” I asked.\n “Half-baked imagination will breed hatred,” my father gulped his drink. “There was a time when information wasn’t controlled,” he continued, as if talking to someone afar. “Abundant information existed, more than humanity could process. Back then, humans’ ability to supplement reality with their imagination backfired. Imagination was at fault. That’s why we take away kids’ ability to imagine.”\n “What’s that got to do with our ability to read books?”\n “Information deemed harmful has been expunged from digital publications, but it may still remain in physical books. If you kids come across the harmful information, you won’t understand it. Above all, we need to protect kids from fiction so that they won’t develop imaginations. After you’re administered the nanobots in school for a few years, your imagination will be diminished for the rest of your life. You’ll need training to understand fiction. Without that training, you won’t be able to develop your imagination.”\n The learning nanobots we receive in school are designed to enhance memory as they stimulate the synapses to unite one another. In addition, they affect the prefrontal cortex in our brain and weaken our imagination. They also utilize how our brain reacts to transmitted light and reflected light differently to reduce our ability to understand texts written on paper.\n Besides what my father told me, this is pretty much what my online search has yielded. Even so, information is hard to come by due to blunt censorship. My quest for knowledge has repeatedly run aground, as I’ve never been granted full access to the archives.\n “I feel lonely sometimes,” Miina mumbles. We’re alone up here on the rooftop. The whole city is drowned in a sea of illusion the nanobots have unleashed.\n “Sooner or later, I’ll be alone, away from everyone,” she continues. “But I want someone to remember me and think of me once in a while.”\n “Did you get what I asked?” I change the subject. Miina looks surprised for a moment, but she takes a silver-colored cylinder out of her pocket and hands it to me.\n “I’ll remember you for the rest of my life, Miina,” I say and stick the tip of the cylinder into the inner part of my arm, taking aim at the vein.\n “Are you sure about that, Rumi?”\n “You’re asking me now?”\n We burst into laughter. Now Miina’s hemopoietic cells roam through my body. One prick of a painless needle does the trick. Thanks to the latest technology, no transplant rejection occurs.\n “Do you think you can pilfer your bone marrow cells for me?” I asked her about a month ago.\n An enormous dog walks along the street in the distance while it drools. Another bomb explodes in close vicinity. Unaffected by the nanobots, Miina sees or hears none of this while the whole city is under siege. My father said he had been busy at work. The military must have upped the ante.\n Miina can imagine and read books.\n I want to feel what she feels every day."}