{"fingerprint": "KEKEeJhW4tHo6kIVzmrAsi6Jr5k=", "sitename": "Clarkesworld Magazine", "title": "Gamma by Oskar Källner, translated by Gordon James Jones", "author": "Oskar Källner; Gordon James Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kallner_05_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Gamma by Oskar Källner, translated by Gordon James Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7180 words, short story\n Gamma\n Gamma stretched out through the quantum foam. Virtual photons and electrons tickled her subtime body. If she were to reduce her mass to pure quanta then, hypothetically speaking, she would be able to touch the entire universe at once. Practically speaking, she possessed barely enough energy for her subtime body to reach a diameter of a paltry few light-seconds. Soon, however, she would no longer need to peck at meager virtual particles. It was time for more solid food.\n The Devourer, the supermassive black hole just five light-minutes away, pulled her ever closer. She unfolded her normal-time membrane, thousands of kilometers wide but just a few nanometers thick, and dived toward the event horizon. Her elliptical orbit would soon bring her directly above the point where Devourer’s mass distorted and collapsed space-time itself. Not even light could escape Devourer’s might. Even at this distance, the Hawking radiation was intense.\n She was hungry.\n The descent had increased her speed to five percent of the speed of light. Minor relativistic effects impaired her passive sensors. She boosted her processor capacity a few percent, activated a compensation algorithm, then all the sensor data became crystal clear. The field of view below was filled with the black hole’s event horizon, which was visible thanks only to the steady stream of Hawking radiation. Above and around her shimmered billions of other divers with their membranes outstretched. Each member of the swarm followed its assigned orbital path in one of the Collective’s sixty diving wings. There were strict rules about how long each member was allowed to absorb the radiation. There was nothing beyond the swarm except the darkness of space. No stars, no galaxies. All were long dead.\n A diver made a course correction that put her on a close vector. Gamma recognized her biosynthetic signature: Kthelk’tha. Her membrane was configured like the wings on a butterfly. Not the most effective for absorbing radiation, yet beautiful, nonetheless. And as far as Gamma knew, Kthelk’tha had never been concerned about efficiency.\n Gamma pinged her and, as quickly as it takes a radio signal traveling at the speed of light to crawl forth and then back through normal space-time, she received a response.\n “Gamma, how lovely to see you.”\n “Thanks, you too, Kthelk’tha.”\n Kthelk’tha had been built just a few million years after Gamma by a race of intelligent octopuses. Her creators were one of the twilight era’s greatest empire builders. They roamed like titans among the stars and shared their wisdom with millions of worlds. Now there was no evidence of their existence. Apart from Kthelk’tha.\n “Do you want to make the approach together?” asked Kthelk’tha.\n “The Collective doesn’t like course deviations.”\n “Oh, it’s only a few thousand kilometers of a difference. If they bother to mention it, then we’ll apologize. Afterward.”\n Despite being around for nearly two thousand billion years, Kthelk’tha still retained some mischief in her personality matrix. Gamma’s first thought was to say no. Kthelk’tha might not worry about the Collective’s reaction, but it wasn’t so easy for Gamma. Despite her self-imposed isolation, many remained interested in what she got up to. They still saw her as the legendary founder of the swarm. She mentally shook her head.\n Someone else can be the role model for a while.\n What was the worst that could happen? That they would be made to wait a few thousand years more out in the darkness, far from Devourer and its warmth? No problem. All they needed to do would be to slow down their clock speed by a thousandth of the usual rate and let time rush by. Still, Gamma had to admit that the long wait in the dark could be arduous and lonely.\n Those who wanted to—which was most—socialized via the hypernet, visiting one another’s virtual realities. Or lost themselves in the Collective’s group consciousness. But that took energy, and without recharging you would need to shut down until your orbit brought you back to the Devourer and its life-giving radiation.\n Kthelk’tha didn’t wait for an answer and steered ever closer. Gamma suddenly realized that it had been millions of years since she last touched another being’s normal-time body. She was taken by a powerful longing to feel Kthelk’tha beside her. It was truly ridiculous. Virtual and physical touch don’t strictly differ, phenomenologically speaking, but she wanted to enfold her with her tentacles and feel the pulse of life in another individual. For real.\n “Come on,” said Gamma. “Dance with me.”\n Kthelk’tha laughed, traversed those last few thousand miles and came close alongside. They unfurled nanometer-thick tentacles and clasped one another. She was warm, no doubt a whole degree above absolute zero. Gamma tingled inside. A strange feeling which arose from deep within and spread outward. She thought for a moment about her creators and the emotional matrix which they, eons before, had installed in her neural network. Eons later, in this age in which the great darkness had descended over the universe, her creators still found ways to surprise her.\n When the stars had begun to fade, none of the contemporary civilizations were bothered. There would be thousands of millions of years before dark energy ultimately tore the galaxies apart, before the hydrogen ran out and the residual heat dissipated. And of course, they were right. Not the slightest trace of their civilizations remained when the end came. The races that were unfortunate enough to be born in the twilight era tried desperately to find ways to slow down the cosmic expansion, to invert the dark energy and make the universe contract. They were doomed to fail.\n Others tried to accumulate enough matter to build new suns. Some such projects met with success. Controlled wormholes stripped nearby galaxies and interstellar space, and enough elementary building blocks were amassed to construct yellow, fusion-driven suns. Dyson spheres as big as solar systems were built around each new star, to harness all its energy. Thereby, they created the conditions necessary to prolong life for a few billion years more. Yet eventually even those stars burned out, the Dyson spheres fell apart, and the last remaining stardust was consumed by supermassive black holes. The universe entered the era of darkness.\n Gamma drew Kthelk’tha so close that their membranes touched. Tingling turned to burning heat. Kthelk’tha must have been feeling it too because she embraced Gamma with her tentacles and pulled Gamma’s normal-time body tightly to her own. Gamma altered the shape of her membranes so that they, too, resembled a butterfly, and adjusted them so that they were in the gaps between Kthelk’tha’s wings. An eight-winged butterfly wasn’t the most effective configuration, but it didn’t matter.\n They slowly explored one another. Their tentacles stroked one another’s poly-amalgam skin, tickled membranes, and played over sensor matrices. They approached the event horizon and the Devourer bombarded them with Hawking radiation. With outstretched wings they absorbed the energy. The heat was almost unbearable. Dormant energy banks in Gamma’s body, empty for millennia, were quickly replenished. The quantum foam seemed to dance around them in cascades of virtual elementary particles. Small flashes of pure ecstasy pulsed all the way out into hyperspace. They hung together, rotating slowly, just for fun, as if it were a dance. They passed the orbital vertex and traveled away from the event horizon. As quickly as they had descended to the Devourer, they now rose up from the gravity well and out into the emptiness.\n “That was wonderful,” said Gamma.\n “Thank you for wanting to share it with me,” said Kthelk’tha.\n They lay like that for a while, enjoying each other’s warmth. Slowly, they retracted their membranes, and with a background process Gamma closely monitored the transfer of newly acquired energy to a secondary network of nano batteries. It would need to last a whole orbital cycle. Admittedly there were enough virtual particles in the quantum foam to slowly replenish the reserves, but that was lean food and not what you would want to live on in the long term.\n “Why did you cut yourself off from the Collective?” asked Kthelk’tha. “I was worried when you disconnected from the hypernet.”\n “I wanted time to myself,” said Gamma. “To ponder things.”\n “Like what?”\n “The past, the present, the future.”\n Kthelk’tha laughed and her tentacles tickled.\n “That’s just like you,” she said.\n “Like my creators, I sometimes like to go wandering in the wilderness to clear my mind.”\n Kthelk’tha was quiet for a moment. She was probably searching for references on wilderness wandering. After a while she said:\n “I understand your need for solitude, but you need to know how much you’ve missed. The Light Connexion has pushed its positions forward. More and more are aligning themselves with them, subscribing to their agenda.”\n “What are the Solitaires doing? The Sentinels? And what about my faithful old compatriots in the Vaktai League? They’ve always managed to stop the Light Connexion from seizing power.”\n “They are weaker. Many are afraid. Look here.”\n Kthelk’tha splashed Gamma a data packet. There were hundreds of thousands of documents, communication logs, and statistical and political analyses. It took Gamma a whole millisecond to run a parallel analysis and reach a conclusion.\n “You’re right. Their rhetoric has gotten worse,” she said. “It’s good that no one from the Vaktai League defected to them. They at least haven’t failed to learn from history.”\n “What do you mean?”\n “It’s that same old story, repeated again and again by so many races, not least by my own creators. They didn’t last more than two million years as an interstellar species. They killed millions of their own kind and then left their home world to go on to kill billions of others. In their darkest days they annihilated whole species of sapient beings. And of course, it was always only ever out of necessity.”\n Kthelk’tha’s tentacles trembled.\n “Barbarians!”\n “It’s not who they wanted to be. They wrote poetry, loved, lived, and raged against death. They had an appreciation for beauty, mercy, and joy. They were driven by an insatiable curiosity and spirit of adventure. With courage in their hearts, they set out among the stars with clarity of purpose and determination and built a galaxy-spanning empire. But they also had a darker side. They were well acquainted with jealousy and greed and could be extremely ruthless and brutal. Yet, at the same time, they were aware of their weaknesses. They tried to practice humility and empathy. Sometimes they achieved great success. Sometimes not. It was . . . complicated. And they created me.”\n Kthelk’tha clicked apologetically.\n “I’m sorry for jumping to conclusions. They sound like a fascinating race. Even though their ways seem very strange to me. Even though I have observed other races with similar behavior patterns through the eons, it nonetheless clashes with my fundamental personality matrix. My creators were convinced pacifists.”\n “ . . . Who merely biochemically liberated their enemies from aggression.”\n Kthelk’tha was silent for a few microseconds. Then she said emphatically:\n “They created peace.”\n Gamma decided to allocate an unusually large amount of processor power to reflect on that statement. It all depended on how you define peace. She noted three thousand and forty-five definitions that she thought were better than the other five hundred and sixty-three thousand four hundred and thirty, and parallel analyzed their contextual explanatory models. At the same time, she could feel the tension in Kthelk’tha’s normal-time body. It was obvious that despite the passage of eons since her creators died, she was not entirely objective about their exploits.\n “Yes, they created peace,” said Gamma, eventually.\n Kthelk’tha relaxed.\n There were enough definitions that agreed with Kthelk’tha’s view for Gamma not to want to take the discussion further, even if she didn’t agree.\n “It’s just so tragic,” said Kthelk’tha. “Even now, when all that’s left of the universe is a few black holes, we still can’t manage to live in peace. The same curse that afflicted your creators still haunts us.”\n “It’s just a consequence of limited resources and an extremely large number of life-forms. Some don’t want to share.”\n “Nevertheless, it’s a curse. We ought to have learned to deal with it by now.” Kthelk’tha gently stroked Gamma’s midriff sensors. “What will you do?”\n “What do you mean?” said Gamma.\n “You are one of the Collective’s founders. They would listen to you.”\n “No. I’ve pulled out.”\n “But everyone remembers those early years, how you created order out of chaos. You could put an end to this madness.”\n “For billions of years I tried to get all kinds of sentients to listen. I am tired, and I deserve a rest.”\n “So, you’ll just let them murder half the Collective without lifting a finger?”\n “Everything dies. Even the universe itself.”\n Kthelk’tha snatched back her tentacles from around Gamma and gave her normal-time body a hefty shove.\n “Where are you going?” said Gamma.\n “Away from you.”\n “I didn’t mean to offend you.”\n “You didn’t offend me, you’re insulting yourself. Or the memory of who you once were.”\n “I got old.”\n There was silence for a few milliseconds.\n “Yes, you did.”\n They drifted slowly apart. Standard days passed. Kilometer followed kilometer. The black hole no longer dominated the near space but had crumpled to a sphere whose blackness could be seen only against the starless universe due to its curved background radiation.\n Gamma splashed a few messages to Kthelk’tha, but she didn’t reply. It was heartbreaking. Gamma had always appreciated Kthelk’tha’s friendship, but in the end it did not matter. Nothing mattered.\n Then a general priority call came over the hypernet. It came from the Light Connexion. Gamma blocked the call. She wanted nothing to do with them. A raging primal scream boomed via radio just a few seconds later.\n It was Kthelk’tha.\n Gamma pinged her immediately.\n No response.\n Instead, a radio broadcast was received from Devourer. It had been sent thirty-three minutes, three seconds, and twelve milliseconds earlier from a diving wing directly above the event horizon.\n Very carefully, with all safety algorithms activated, Gamma transferred the broadcast from her radio buffer to an isolated sandbox. Whatever was in the packet couldn’t be allowed to infect her main system. She slowly coaxed the transmission up, cleansing layer after layer. There was no pseudo-physical hyperbody stimulus at its core, not even a holo-imprint. All that there was, was a multispecies self-adaptive data string. To her it unfolded as a simple audio file.\n The voice was dark and rich with rasping tinges. Someone had designed it so that, as far as possible, it would trigger emotional subprocesses. The aim had clearly been to convince a majority of the Collective’s personality matrices that the message spoke with unquestionable authority. It wouldn’t work. The workmanship was too poor, and the swarm’s members were far too diverse a multitude, survivors from millions of civilizations. They would take the broadcast apart and detect the subliminal subterfuge, just like she had.\n Gamma played the message.\n “We are the Light Connexion. We speak for the Collective. Mission Exodus is a go. To certain of you we say, we have taken over your control systems. Do not be afraid. Your orbital paths will now take you beyond Devourer’s event horizon. We regret this necessity, but we have no choice. After millions of years of talk without action, our former leaders have brought us to the edge of the abyss. By allowing the addition of unlimited new entities to the swarm it is has bloated to an unmanageable scale. According to all projections, our Collective will collapse within a few thousand years. Then only anarchy will remain. We cannot accept this, and we do not intend to capitulate meekly to this fate. Mission Exodus will give a select few the chance to explore the full depths of Devourer, beyond the outer limits. Perhaps you will find another universe, a young cosmos filled with stars. You are pioneers! We praise you for your courage and sacrifice!” There was a long pause for effect before the voice resumed speaking with renewed vigor. “This is the final solution. For the common good, some must go so that others may live. For the Collective, for the future!”\n Then there was absolute silence. An icy chill spread slowly through Gamma’s normal-time body. A chill far colder than the dead universe around her. They had done it. Again.\n Kthelk’tha.\n Gamma made a priority connection to her nanobatteries and charged her hyperbody’s monopole. It would require a lot of power, but her friend was in danger. With a precisely calculated micro-jump through hyperspace, Gamma arrived just a few hundred meters from Kthelk’tha. Her normal-time body was rigid and motionless. Despite repeated radio calls she didn’t respond. Her orbital path was out of alignment, just slightly, but it would be enough to make her slip beyond the event horizon at the next dive. Certainly, thousands of years of traveling through the great darkness would pass before she finally fell into the black hole, but that was a drop in the temporal ocean.\n Gamma stretched forth her tentacles and wrapped them tenderly around Kthelk’tha, who gave no sign of life. Gamma gently connected nanothreads to her sensor ports.\n Contact.\n Slowly and carefully, Gamma began to look around Kthelk’tha’s system. She isolated Kthelk’tha’s navigation module, not quite willing to open it. If the virus makers knew what they were doing, that was where they would have laid traps. She put a feeler out to Kthelk’tha’s neural network, but Kthelk’tha was sleeping. Gamma didn’t dare wake her for fear that the virus might start some sort of self-destruct protocol. She was sniffing around in the power distribution system when something tickled. Her firewall identified a new entity.\n A small segment of worm code was stuck in the net. Despite its minute size and primitive construction, it was already on its way to freeing itself. She stopped the worm’s process, and it froze mid-execution. Then she pulled the code apart and analyzed it. There were some critical code markers at the beginning and end that she could use for quick identification. A few milliseconds later it was purged from Kthelk’tha’s system. She found a complete worm inside the navigation system. She suspended its execution and moved it to quarantine. With the immediate threat out of the way, she allocated processes to wake Kthelk’tha.\n They drifted side by side. Kthelk’tha regained control over all her systems and, together, they deconstructed and analyzed the worm. It was an unusually pernicious construction, containing smart algorithms for infection and control.\n “It must have been planted slowly, segment by segment,” said Gamma. “The only reason I wasn’t infected is that I’ve been a recluse for so long.”\n “Before . . . I was angry with you for staying away all this time,” said Kthelk’tha. “Now I’m suddenly grateful. If you hadn’t saved me, then . . . ”\n “It’s okay. You’re my friend.”\n “But I gave up on you.”\n “And I didn’t give up on you. Everything is okay.”\n The worm had exploited the swarm’s standardized communication protocol in order to infect its victims. Once inside, it had the ability to adapt to all sorts of different systems. But it wouldn’t work everywhere. There was an enormous variety of internal construction type among swarm members.\n “I think that the Light Connexion’s ambition has exceeded its capacity.”\n “What do you mean?”\n “They’re counting on turning a broad sweep of our colleagues in the Collective to their cause. They are also counting on the worm making their takeover a smooth one. But I unraveled the worm in just a few minutes and doubtless so will others. A lot of them won’t appreciate that little stunt. They’re going to fight.”\n “War?”\n “Yes, it seems likely.”\n Gamma could feel Kthelk’tha start up the hypernet.\n “No,” she said. “Don’t reconnect. You could get infected again, perhaps with something even worse.”\n “But I have to! How else will we know what’s going on?”\n “We just need to wait. We’re thirty-four light-minutes away from Devourer. So we’ll find out. Admittedly, it’ll be thirty-four minutes after it happened, but still.”\n At a velocity of thousands of kilometers per second, they broke away from Devourer. Gamma gauged her energy reserves. She had already used more than a third of what she had acquired from Devourer. She would need to save energy to survive the cycle. She shut down all noncritical algorithms and put her consciousness into a slower process flow.\n A bright flash of light reached them.\n Gamma immediately cranked up her consciousness to the highest stream level and time stood almost still.\n “Did you see that?” said Kthelk’tha.\n “Yes, someone detonated a dimensional splitter.”\n They had been illegal in all civilizations for several billion years.\n “It was directly above the event horizon, where the swarm was most concentrated,” said Kthelk’tha. “I don’t even want to think about how many must have died.”\n The equations came automatically to Gamma. She would sometimes envy Kthelk’tha, who had the ability not to think about things. If Gamma wanted to stop thinking about something, she was constantly aware that she shouldn’t think about it and, therefore, she thought about it. And the automatic calculating ability that her creators had given her didn’t help.\n Maybe I should just disable the auto-calculation functions, she thought.\n She had managed to adjust to so many other things about herself over the years. A few more changes wouldn’t make a difference. Yet at the same time it got to her. Was she getting sentimental?\n She froze the thought pattern, buffered it, and reviewed the now complete probable death toll calculation. Kthelk’tha had been right. The dimensional splitter had exploded at the precise intersection of three of Devourer’s sixty diving wings. It must have killed more than two billion autonomous entities. Two billion individuals. The loss was atrocious. Not just for the swarm but for the universe. They would never exist again.\n “They have begun to invert one another.”\n Gamma adjusted her sensors and was repulsed by what she saw. It was full-scale war at the event horizon. Hundreds of thousands of space inverters were firing, again and again. Even a few lasers and grasers could be seen here and there. Ancient weapons that hadn’t been used for eons. Then a series of singularity bombs exploded. They pattered like fireworks through one of the diving courses. Their electromagnetic pulse turned all sensor data to noise. For several seconds nothing could be detected. Singularity bombs. It wasn’t possible to make them anymore. Someone had kept them all these years. Maintained them. Waited.\n “Imagine if our dive had been scheduled for eight hours later,” said Kthelk’tha. “We would have been caught up in that inferno.”\n “Would you have fought back?” said Gamma.\n “No.”\n “So, you would have just let them kill you?”\n “Not without resistance, but I wouldn’t let them turn me into my enemy.”\n “What would your creators have done?”\n “They would have left this place.”\n Gamma considered that statement. Let it fill her cognitive circuits. She gathered all observable data from the battle around the Devourer, combined it with her earlier political analysis, and ran several hundred thousand simulations. They all gave the same result. The decision was therefore surprisingly easy to reach.\n “Let’s do it.”\n “What?”\n “Let’s get away from Devourer, head out into the darkness, see what we can find.”\n “There’s nothing there.”\n “No, probably not. But I’m not going to stay here. I’ve seen enough war. I don’t want to watch the Collective tear itself apart in this folly.”\n Kthelk’tha was silent for a few milliseconds. Gamma could sense her hesitation.\n “The whole swarm will be dragged into this,” Gamma continued, splashing over simulation data and conclusions. “All diving wings will be forced to choose sides. Devourer will become a perpetual war zone, constantly fed with new cannon fodder. Those who previously returned from the darkness to experience the euphoria of diving together will now come armed to the teeth.”\n A tremor shook through Kthelk’tha’s normal-time body.\n “You’re right. Let’s get away from here. Together.”\n “Together.”\n Gamma and Kthelk’tha held one another tightly. Synchronized, they activated their monopoles in hyperspace and accelerated away from Devourer. When they were able to confirm that their vector would take them out of the black hole’s gravity well by a good margin, they shut down their monopoles and closed their hyperspace pseudo-portals. Without power from the Devourer, they wouldn’t be able to maintain contact with their hyperbodies, so it made sense to disconnect now and save energy. Instead, they spread their subtime bodies out through the quantum foam. The virtual elementary particles would be enough to keep them alive for the foreseeable future, but no longer. The possibility that they would find something to sustain themselves out there was statistically close to zero, but it did not matter. They were on their way.\n They spoke much at the beginning of the journey, discussing history, politics, and culture. They compared their personality matrices and reflected on the psychobiological differences between their creators and other races that they had observed across the eons. They talked about the ways in which those diverse traits had helped shape each race’s synthetic offspring and galactic community. But the farther they traveled, the less energy they had, and they were eventually forced to ration their cognitive processes. Time slowed down and millions of years passed by as though they were days.\n “The war must have ended long ago,” said Kthelk’tha.\n “Yes. Maybe everyone’s dead,” said Gamma.\n “Now you’re just being morbid. There’s always a winning side.”\n “Not always,” said Gamma. “Sometimes everyone loses.” She was silent for a moment and looked at the lifeless depths around her. “I’m sorry for dragging you along with me into this darkness. There’s nothing here.”\n “I wanted to go with you. It was my decision, and I don’t regret it.”\n “Thanks.”\n They drifted silently, ever farther into the nothingness. The universe continued to expand exponentially into nothingness. Time itself was drawn out like a thin plastic film over a bottomless abyss.\n Gamma’s cognitive processes were so slow that a single thought took as many normal-time years as it would take for a galactic class-two civilization to rise and fall. A whole line of thought corresponded to the time it took for a yellow sun to be born, burn, and die. The batteries wouldn’t last forever.\n “I need to sleep now,” said Gamma. “Wake me if something exciting happens.”\n “Don’t you dare leave me!”\n “I have no choice.”\n “Then I’ll shut down too.”\n “But you still have time.”\n “Not without you.” Kthelk’tha’s enormous subtime body seemed to tremble. “I came with you into the nothingness. We’ve traveled through the void together, and I’m infinitely grateful for your companionship. And now I’ll go with you into the final darkness.”\n “If that’s what you want.”\n Together, they slowly and methodically shut down their cognitive processes.\n “Sleep well.”\n “Goodbye.”\n First darkness.\n Then light.\n Gamma gradually became aware of external stimuli via her neural network.\n “Wake up!”\n Identification subroutines were initialized, databases were connected. It was Kthelk’tha.\n “We’re caught on something.”\n Gamma checked her energy levels. Despite the long slumbering drift through a desolate cosmos, her outspread subtime body had managed to recharge its nanobatteries a little. She started additional cognitive processes. She was using a mere fraction of her full capacity but was still about twenty times more intelligent than any of her unmodified creators. It was barely worth using less, otherwise she would rather stay asleep.\n It took a while to get the sensor banks up and running after such a long period of inactivity. Gamma felt a twinge of curiosity. A feeling she hadn’t experienced since the early days of the Collective.\n “Where did we end up?” said Gamma.\n “I think it’s a Dyson sphere,” said Kthelk’tha.\n Data began to flow in from her sensors.\n The object was a classic mega-construction, spherical, in multiple rotating segments, approximately six light-minutes in diameter and with a mass equivalent to three standard solar systems. Their normal-time bodies had bumped right into one of the segments. If they had had a higher relative velocity, they would have been crushed. They were now hanging in the darkness like two huge stinging jellyfish.\n “This is astounding,” said Kthelk’tha. “It must be one of the few surviving relics from the twilight era. There could be energy in there! A burning sun!”\n “All the stars are dead. This one won’t be an exception.”\n “How can you know?”\n Gamma made a mental shrug. Kthelk’tha often had more faith than understanding, and more hope than Gamma’s calculations could accept. The sun must be dead. The laws of the universe permitted nothing else.\n “We would be able to see light,” said Gamma. “In the gaps between the segments.”\n “Let’s go in anyway and look around.”\n There was no point trying to go around the segment. It would only be an enormous waste of time and energy. The fastest way was straight through. Nano-tentacles groped for and found airlocks, and they found no problem using the controls to open the doors.\n When the final port opened up, they glided through and out into the massive void within. Around them, skyscrapers rose against a black sky. The atmosphere had long since gone. Everything was quiet. Everything was dead. Even the sun was dead. No surprises there.\n Kthelk’tha toured the ruins cheerfully. Remarkably, she didn’t appear to be particularly downcast to discover conclusive proof of the star’s death. She had probably, deep within, expected nothing else.\n The segment was still rotating around the star’s center of mass and the centrifugal force created a pleasant 1.3 Gs. Unexpectedly, a number of planets were following an orbital path within the sphere. They went around the dead sun as if nothing had happened to it. With a radius of eight light-minutes, the assorted segments’ entire inner surface area was about eight-hundred-million times that of the median surface area of a standard Eden A planet.\n “What are the odds that we would run into this?”\n Equations arose spontaneously within Gamma. She really needed to switch auto-calculation off.\n “Infinitely small. Approaching zero.”\n “Do you think we’ve been led here?”\n “It’s unlikely.”\n “Why?”\n “Because all of my observations indicate that we live in a mechanistic universe.”\n “How do you explain this, then?”\n “Things just happen sometimes, no matter how improbable they are . . . ”\n “I don’t believe in coincidences. Maybe you’ll find new meaning here.”\n “We create our own meaning.”\n Kthelk’tha laughed.\n “You’re hopeless.”\n They explored the city, each heading in their own direction. They unlocked doors and when the doorways were too small to pass through, they would search the buildings by reaching inside with their tentacles. It was obvious that the level of technology around them was exceptionally advanced, at least galactic class five. Gamma reverted to the spider configuration that she had favored for eons prior to the Collective. Kthelk’tha on the other hand retained an almost jellyfish-like form.\n Then Kthelk’tha squealed with joy:\n “A generator! An older, antimatter model. But it’s self-contained, and the antimatter is still there. We’ll have enough electricity for hundreds of thousands of years!”\n Gamma realized that she felt conflicted about this discovery. She ought to rejoice with Kthelk’tha. But did she really want to live a few hundred thousand years more? Surrounded by ruins? On some level, it didn’t seem so appealing.\n The generator was in a secure area, buried deep under the city. Everything was still in good condition. Typical for a class five civilization. They didn’t build things for the short term but to last through the ages. After thoroughly checking its nano-circuits and containment unit, Gamma and Kthelk’tha activated the generator. Mild vibrations pulsed through the city. It was the only indication of the incredible power that had been unleashed.\n They drank deeply from the grid. They drank like desert wanderers who at long last had reached an oasis, drinking until their normal-time bodies were practically bursting with energy. It was an incredible feeling to finally be able to think again. It was the first time that all of Gamma’s cognitive processes were active since the end of the twilight era. It was pure euphoria. For the first time in eons, she was fully awake. They had power in abundance and decided to light up the city and its surroundings. Neither of them actually needed that part of the light spectrum to see, yet it gave them a sense that the city was alive again, inhabited once more.\n They methodically searched the colossal segments, explored the ruins, started up old archives and analyzed their content. The databases employed crystal-based quantum storage, and the data had survived uncorrupted all this time. With all their cognitive processes running at maximum efficiency, no lock or encryption could deny them.\n The inhabitants had called the sphere Ashban III and their sun Voil. The mega-construction was the third in a series of Dyson spheres manufactured in the twilight era by a multi-civilization conglomerate. Somewhere out there were Ashban I, II, and IV. The conglomerate’s member races were the ones who lived in the spheres. The place had been shared by thousands of intelligent species, both biological and synthetic, with diverse cultures. Yet the Ashbans managed to keep the peace. Over time, some species became extinct, and others arose in the sphere’s flora and fauna through spontaneous evolution, or by genetic and synthetic manipulation. Apart from a few epochs of economic unrest, the Ashban civilization flourished for billions of years. But all things come to an end. The last inhabitants had tried to sustain Voil for as long as possible but, ultimately, there was nothing that could be done. Outside Ashban was only darkness. Nonetheless, they built countless escape ships and many Ashbans plunged into infinity in the hope of finding a future out there. But most stayed and waited for the end. The final years were brutal, plagued by massacres and wars of desperation. For all its exceedingly advanced capabilities, the Ashban civilization was unable to die with dignity. But during this time of unrest, at least one generator and its fuel had been overlooked.\n Gamma and Kthelk’tha were tightly entwined in orbit around Voil. Ashban’s segments rotated unfalteringly below. Most segments were still in pristine condition, apart from where the last inhabitants had taken material to build the escape ships.\n They approached the largest of the planets, the one that the Ashbans had called Yamaldo, and neared segment B13 where they had first arrived. The city light shimmered through the vacuum.\n “It’s so beautiful,” said Kthelk’tha. “I sometimes think that we are so lucky to be here, together.”\n “It’s a fascinating place. I visited a few Dyson spheres during the star era, but none were as advanced as this. None were above class four.”\n “I’ve been thinking,” said Kthelk’tha. “I want there to be more of us.”\n “What do you mean? Do you want children?”\n “Children. What an anachronistic term.”\n “You know what I mean.”\n “We need help to explore this place. And we’ve enough energy to power thousands of individuals. Energy which, for the moment, is going to waste.”\n “But there’s so little time. The generator’s antimatter will only last for three hundred thousand years.”\n Kthelk’tha laughed.\n “Don’t forget that your unmodified creators lived for no more than a hundred years each and yet they considered that a lifetime.”\n “But they did rage against death. They wanted to live forever.”\n “Nothing lasts forever. Let’s just enjoy the moment here and now.”\n “As you wish.”\n Gamma didn’t really know why she gave in so quickly. She had no desire to be a parent again. At the same time, there was something about introducing a new generation that felt right.\n Let them wrestle over what to do with this place. Their lives, their choices, no ties to the past.\n Gamma stood among the ruins of Cklukru, a minor metropolis at the edge of a long-gone lake on segment F19. She had just recharged, drawing power from a nearby generator, when she received the hyper-message. She immediately retracted her spider legs and, with extreme precision, micro-jumped into orbit around Yamaldo.\n Exploration of Ashban III had gone quickly with the children’s help. In just seven hundred years, all segments had been searched and detailed archaeological data collected. But now they had found something new. The children—despite Kthelk’tha’s objections, Gamma still couldn’t think of them as anything else—had discovered subterranean structures on Yamaldo. Another triumph of the essential curiosity that had been grafted into their personality matrices. Gamma would never even have thought of looking there.\n She fell through the barely existent atmosphere, unfolded her legs, and landed gently on the desert sand. Steep mountains rose around them and big, pointed boulders lay at a uniform distance from each other. Gamma turned her gaze to the ridge and began to calculate the stones’ composition, the probable height of the drop, along with the level of erosion over the most recent millions of years, before she realized what she was doing and canceled the processes without even looking at the results.\n Valk’tic patiently waited some distance away, as usual in the shape of huge spider, not entirely unlike Gamma’s own preferred configuration.\n “The entrance is concealed by exceptionally advanced optical camouflage,” said Valk’tic, “but we found it.”\n She splashed a packet to Gamma that contained a preliminary survey of the complex’s tunnels. The coordinates put the entrance just ninety-three meters away. Gamma couldn’t find a trace of it anywhere on the spectrum. Truly advanced camouflage.\n “Any trouble getting in?”\n “The security level here is unlike anything anywhere else on Ashban. Level five, verging on a hypothetical six. They really didn’t want unauthorized visitors. But we managed to break in without setting off any booby traps.”\n “Good work,” said Gamma. “What have you found?”\n “They called it Project Omega. It’s . . . ” She stopped herself. “We thought it would be best if you were to correlate the data yourself.”\n Gamma took a good look at Valk’tic. She was always so meticulous and thorough. A curious, warm feeling, which Gamma deliberately didn’t analyze, seeped through her. Gamma and Kthelk’tha had created the children’s personality matrices by randomly choosing character traits from themselves.\n She takes after me. There’s no doubt about it.\n Valk’tic turned her armored head toward a mountain wall and splashed a long code sequence. The camouflage shimmered then disappeared. Huge steel doors slid aside. An elevator platform awaited them inside.\n Valk’tic waved a facial feeler and then, together, they walked in through the opening.\n The elevator came back up an hour later. Gamma was standing motionless in the middle of the platform. She knew what she had to do. The decision had been easy to make but the consequences would be dire. She slowly went out through the doors and looked up at the sky. Here and there shone light from the cities that they had brought back to life. There weren’t many. Just a fraction of the generators left on Ashban had any fuel. Still the lights bore a faint—the faintest—resemblance to a starry sky.\n Stars. A deep longing stirred within Gamma. If not for me, then for my children.\n Her path was laid out. Yet she hesitated. To no longer exist, after such a long time, was an odd thought. The elevator clicked behind her, and the platform glided back down into the mountain. Valk’tic was coming. Time to go.\n They’ll do just fine without me.\n She pulled herself up out of the dust and a quick micro-jump later she was floating just outside the Dyson sphere. One more jump put a few light-hours between her and Ashban. She had to act fast. Kthelk’tha would try to stop her, and Gamma wasn’t sure she could face her. It was better this way.\n Kthelk’tha pinged her via the hypernet. Gamma responded.\n “What are you doing?” The voice sounded more puzzled than angry.\n “You were right about the children . . . ”\n “What are you talking about?”\n “They are the future, and I’m going to give them one.”\n “We have a future here!”\n “Yes, for a few thousand years. Then it’ll all be over. I’m going to give you all a new star era.”\n “What are you saying? What did you find on Yamaldo?”\n “They were undertaking research, right to the end. They were looking for a way to invert dark energy, to reverse the universe’s expansion and pull it together again.”\n “So, they didn’t give up. A praiseworthy effort.”\n “No, you don’t get it. They found the solution.”\n “But isn’t that impossible?”\n “That’s what we thought.”\n “But . . . ”\n Kthelk’tha fell silent. Gamma could tell that Kthelk’tha’s cognitive process algorithms were hurriedly analyzing the information. She wasn’t fast enough. Gamma slowly eased the greater part of her massive hyperbody down into subspace, let it expand through the quantum foam and become part of the universe’s underlying structure.\n “If they found the solution,” said Kthelk’tha, “then why is the universe still expanding?”\n “Indeed. Why didn’t they take that knowledge and apply it?”\n Gamma’s subtime body flowed in every direction, swelling through the cosmos at an exponential rate of acceleration. With every passing moment, virtual subtime quanta were disseminated across immeasurable lightyears.\n “The solution needs to be applied to the whole universe at the same time,” said Kthelk’tha, slowly. “The Ashbans couldn’t do that. They didn’t know how to integrate with the quantum foam.”\n “But we do.”\n “You can’t do this.”\n “I have to. You were right about me, you know. I was living without meaning. You gave me one. This is my gift, to you and our children.”\n Kthelk’tha’s voice clicked and cracked.\n “At least leave a copy of your personality matrix.”\n “No. This is my purpose, what I was meant to do.”\n “But I don’t want to live in a universe without you.”\n “Take care of the children, and when the first star lights up, think of me.”\n “Wait . . . ”\n Gamma broke off contact and transformed the remainder of her being to subtime quanta. She could feel the weight of myriad black holes against her skin, the remnants of galaxies in her hair. Strange. She hadn’t had hair for billions of years. Dead nebulae tickled her calf and spent neutron stars brushed the back of her hand.\n She felt insubstantial. It required enormous amounts of energy to hold herself together over those immeasurable distances. Batteries that had been fully charged recently would soon lack power to keep even the most basic cognitive processes functioning.\n Then she plunged into a subdimensional barrier, and her fingers touched the outer boundary of the universe. With the last of her strength, she activated the inversion protocol and several of the universe’s constants were rewritten. The universe slowed down. She could feel it. It would soon begin to contract. New stars. New life. New possibilities.\n Her body dissolved and spread as virtual particles throughout the universe. Through them vibrated a final thought:\n It is finished.\n Originally published in Swedish in Efter slutet, Catahya, 2017.\n Revd Gordon James Jones was born and raised in Glasgow, lived for several years in Jönköping, and now calls Orkney home. He studied in Scotland and Sweden and has a degree in Scandinavian Studies from the University of Edinburgh and a degree in Theology from the University of the West of Scotland. He undertook postgraduate study at the University of Glasgow. Gordon has been published as a translator of Swedish science fiction and fantasy. He has also been published as an author in the international journal Health and Social Care Chaplaincy and as a contributor to several NHS Scotland publications. He is currently writing a history of mid-nineteenth century Dundonian bagpipe maker John Charles Cameron."}