{"fingerprint": "6HvfOsNZiZV4J2fJgNu1NTqJ4dA=", "sitename": "Clarkesworld Magazine", "title": "Seeking boarder for rm w/ attached bathroom, must be willing to live with ghosts ($500 / Berkeley) by Rahul Kanakia", "author": "Rahul Kanakia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kanakia_10_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Seeking boarder for rm w/ attached bathroom, must be willing to live with ghosts ($500 / Berkeley) by Rahul Kanakia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3750 words, short story\nSeeking boarder for rm w/ attached bathroom, must be willing to live with ghosts ($500 / Berkeley)\nFirst Listing\nI’m looking for a roommate, preferably a gay male, non-drinker, non-drug user, to share a comfortable Craftsman-style, three-bedroom, two-bathroom bungalow in Berkeley. Owner-occupied home has hardwood floors, skylights, fireplace, built-in bar-b-q, nice garden, washer and dryer. Clean and well maintained. Room is approximately one hundred eighty sq. ft and includes attached bathroom.\nThis is a quiet residential neighborhood, full of children and dogs. You must have your own telephone, but all other utilities shared. Place is wired for DSL. I want to build a comfortable home based on communication and shared responsibility. Share with owner (me), a sixty-one-year-old gay male and small business owner who works in the ectoplasmic removal / storage sector and has lived in the home for thirteen years.\nSole caveat: The living room, garage, basement, and third bedroom are used primarily for ectoplasmic storage. Don’t know if you’ve ever seen them, but ghost flasks are small, unobtrusive, and thoroughly safe. However, mine do emit a slight noise. The previous boarder, a twenty-seven-year-old medical student, is leaving due to excessive emotional involvement with the ghosts, and I’d prefer if my next boarder attempted to leave them alone as much as possible.\nThe rent is $500.00 per month with a $725.00 deposit.\nIt’s available immediately!\nPlease reply back to this ad or call 555-658-5109. Leave a message if I’m not at home.\nThanks!\nSecond Listing\nFirst of all, I’d suggest that potential boarders read this ad in its entirety before responding, because I’m a little bit tired of the look on peoples’ faces when they walk in here. I’m completely happy to talk to any and all prospective tenants who wish to come by. I love meeting people and I love shooting the shit. It’s just that, well, it’s not really very pleasant when a stranger takes one look at your home and then does their best to try to escape.\nAnd I am really tired of people trying to bargain me down by acting like they’d be doing me a favor if they took the room. You know, I understand its somewhat inconvenient to live with ghosts and that’s why the rent is already fairly low for this area.\nBut the inconvenience is not huge. If you’ve never seen a bottled ghost, please be aware that it’s nothing like a free-range ghost (which are usually as big as a person, can run a hundred miles per hour, shatter glass with a scream, chill skin with touch, etc). No, during the bottling process, the compression vac solidifies and sluggifies the ghost. Most squash down to a nugget that is only 2” tall and 0.5” thick, and they’re kept soaking in a solution that prevents expansion. They can move, and even speak, but only very slowly.\nMost ghosts in my home were removed ages ago. They were haunting someone who did not want to be haunted (though you’d be surprised by how many people actually don’t mind being haunted). And although I mostly don’t go on calls anymore (except for old, trusted clients), I am able to live very well on the small storage fee paid by various hauntees to keep their poltergeists bottled. They say that all ghosts have to do just one last thing before passing on . . . but sometimes that thing is awful inconvenient for those who are left.\nSome tenants have asked me whether the ghosts need to emit so much noise, or if they can’t be silenced somehow. The bottles are high-quality and rated to last for a hundred years. Sometimes they can be a bit noisy, I know. That’s because the last tenant riled them up a bit.\nHowever, when I say noisy, I am talking about more of a whisper than a shout. The bottles are thick. When they scream their loudest, they can just barely be heard. I just don’t want to be like those big, soulless, ectoplasmic storage companies with their desert warehouses: I would never deprive any person—even a dead person—of his or her voice.\nThe ghosts are not ordinarily this loud. My last boarder, a medical student who I’ll call “Chris,” paid perhaps a bit more attention to the ghosts than was merited. After another few months of benign neglect, I believe they will quiet down somewhat.\nThe problem was that he became too attached to one little fat girl—maybe twelve—who killed herself after being invited to a Facebook group called the ‘I Think Cynthia S_____ Is an Ugly B*tch’ Society. Her name happened to be Cynthia S____ and she just joined for a moment, in order to see how many other people were part of it (seems half the school was enrolled). But after joining, a picture was taken of the notification and, by the next day, everyone in school knew Cynthia S_____ had joined her own hate-club.\nChris would go down into the basement with a folding chair and sit in front of the girl’s bottle. It was only as tall as the last joint of his thumb, but Chris didn’t mind bending down very close in order to hear her shrieks. He’d sit there and not even try to wipe away the tears flowing down his face like lava. I really do think that he enjoyed being sad.\nSometimes he would come upstairs and ask me how we could get the little bastards who’d tormented CS.\nNow, I am not a hard man, but after the umpteenth repetition of this scene, I had to tell Chris, “Let’s not pretend like we don’t both understand the pleasure of destroying another person.”\n“What does that mean?” he said.\n“It’s not a judgment on you,” I said. “I just know that I’ve been in my share of various different sorts of ‘I Think Cynthia S_____ Is an Ugly B*tch’ Societies. And I’m sure the same is true of you.”\nHe got silent, as if I had said something startling and cruel. And then he retreated to his room.\nI don’t go out of my way to speak to the ghosts, myself. It wouldn’t be fair or right to ask them to tolerate me. I am not their friend and I’m not their avenging angel. I’m their jailer.\nI know this is not an appetizing story. I’m not trying to appetize you. All I am telling you is that, contrary to the insinuations of certain rights groups, some function is served by locking away these ghosts. They do have a certain presence to them that, to the wrong person, can be upsetting. However, if you simply leave them be, then you will be completely fine.\nIf this seems like a livable situation, please call or email. The home is a beautiful, well-maintained three-bedroom Craftsman. The neighborhood is wonderful and safe. The proffered room is large and has an attached bathroom. I’d prefer a gay male, but I’m open to others.\nThird Listing\nFrom the recent drop-off in the number of phone calls, I’ve intuited that many of you have seen a certain libelous listing for my address on the RentrBWare cellphone application. I considered hiring a lawyer to respond to that listing, but I decided against that, because I really do believe that if a person simply expresses himself cogently and clearly, then, if his listeners are right-minded people, they’ll sense the truth pouring out of him.\nDo I have a certain reserve? Yes. But I would not say that I am “flat of affect” or that I have “a pervasive pattern of detachment from social relationships.”\nI do not collect ghosts in order to feed “a narcissistic desire for a perpetually captive audience.” I do not collect them at all. I store them. And I do so because that is my livelihood.\nBut I am not pleased by them, and I do not enjoy their company.\nIn life, I’m sure I would have loved many of my ghosts. They’re often fascinating individuals, and they contain much potential for fascinating interaction. For instance, I have a whole shelf of men collected in ’84 from SF General’s AIDS ward. Chris once interviewed them for a well-received academic paper on patient attitudes re: experimental treatment.\nAs ghosts, they’ve been restored to their prime, with their slim moustaches and long bronzed legs. When they were alive, I would’ve hung around awkwardly at the edge of their orbits and tried to attract a glance from them. In fact, when they were alive, that’s what I did do. I came to SF out of Rapid City in ’67, as soon as I learned that there was a place for people like me. But even when I was eighteen and slim and smooth-skinned, those guys never really liked me. I don’t know why. I hung around in the same bars, the same bathhouses. But I never figured out how it was done.\nI guess there’s just some strangeness coiled up inside of me. There’ve been times in my life when I would’ve reached down through my throat and yanked that strangeness right out, if I’d only known what it was.\nStill, I suppose that thing is why I am alive, and they are dead.\nBut I don’t cry about it. I’m not lonely. I get out there. That reviewer would have you think I’m some John Wayne Gacy with a crawlspace full of bodies. Far from it! I belong to a vacation club: my choice of forty-six locations—plus reciprocal benefits at other clubs. Almost every month, I’m off somewhere. Every February, it’s Tahoe. Every March, it’s Hawaii. In August, I usually go to Mexico and see a guy who kind of acts as my boyfriend, when I’m around.\nIf those men down in my basement could see how that awkward kid turned out, I think they’d be proud of how I’ve put a life together.\nIf you live here, you won’t be bothered. Honestly, I hardly need a boarder. It’s just . . . I have so much in my life. I want to pass things along and help others. That’s why the rent is so low, really.\nThe neighborhood is good. The room is large. The house is airy and clean. Utilities (including Internet) are included. Please call or email. If I don’t answer, please leave a message.\nFourth Listing\nIt’s just as I feared. The poster on RentrBWare is none other than my former boarder, “Chris.” I had suspected that it might be him. But I had hoped that perhaps it was some business competitor or other less-than-gruntled individual.\nStill, this does not in any way alter my position as to the lack of veracity behind Chris’ reviews. It is false to its core, and I don’t care how much documentary evidence there might be. Those pictures of cockroaches perhaps might’ve been taken in my house. But the context is entirely missing.\nI know that I’m no saint. In my life, I’ve sometimes succumbed to hatred. But I do my best to hate things that deserve hatred. Like termites. I hate termites. I can understand hating termites. Termites damn near hollowed out my ceiling. Termites will bankrupt you and then bring your house down on top of you. But I don’t understand hating cockroaches. Do cockroaches come out at night and nibble your face off or something? Because I tell you, I don’t think a cockroach has ever killed a man. Or a woman, either. Cockroaches are harmless. They just wanna eat your garbage. You don’t want cockroaches? Don’t be like Chris and let the soy sauce dry out in the black stack of plastic take-out sushi bowls that rises higher and higher on your desk—just cause it’s hidden behind your computer monitor doesn’t mean the cockroaches can’t see it.\nNot that I am bothered by mess. I believe you can do whatever you want, so long as you are strong enough to bear up under the consequences of doing that thing. But if you leave out garbage and cockroaches come and eat it, then don’t act like they are the disgusting menace. And don’t act like I’m some monster because I won’t let you spray pesticide around like it’s perfume. That poison drains into our Bay!\nSometimes I think that the more harmless and defenseless something is, the more people want to destroy it. I swear to God, once I went into someone’s house while they were gone and I could not find the fucking ghost. I checked between the folds of every evening dress in their walk-in closet and clawed my way down to the bottom of the huge wooden chest full of Legos in their basement rumpus room.\nFinally, I gave up and called the homeowners and they said to look in the pool. And there she was, right down at the bottom: almost invisible, because her skin was blue as the water. Only the shimmering of her blonde hair gave her away. When I dived down to get her, she put a finger to her mouth and said, “Don’t tell. I need to stay hidden.”\nWhen I told this story to Chris, he became agitated. He started pacing back and forth in the kitchen and then he said, “Did you ask what she was hiding from?”\nI said, “I was underwater, son.’\n“But you vacuumed her into your machine.”\n“Of course I did,” I said. “I had to. That’s how I pay my mortgage. That’s how I live.”\nHe shook his head from side to side, and then he went into his room and slammed the door and put on his headphones and avoided me for ten or fifteen days. Chris was perpetually avoiding me. And if he wasn’t avoiding me, he was talking to me about borderline personality disorder or some such nonsense.\nChris never understood that you might be able to pull that crap out of a textbook, but none of it has anything to do with real life. Chris doesn’t know shit about the world and how hard it is to find your place in it. That’s fine, though. I’m sure I was the same way when I was his age.\nFifth Listing\nRoom for rent. Room has hardwood floors, plenty of light, and attached bathroom. Utilities (including cable and Internet) are included. House is a wonderful Craftsman-style, three-bedroom, two-bathroom bungalow in Berkeley. $400. Neighborhood is exceedingly safe. Close to Pixar headquarters and a number of fine eating and shopping establishments. Wonderful deal!!! Owner is fifty-seven-year-old professional w/ small business. Stores selected (very safe) ectoplasmic individuals on behalf of families / friends of deceased. Totally up to code. Never had any issues. If interested, please call or email any time! If I don’t answer, please leave a message!!!\nSixth Listing\nI’ve had boarders for more than a decade. No complaints. Never. I treat people fairly and I expect that they’ll treat me fairly. Some of you . . . I guess I can’t blame you. The Internet isn’t like the real world. On the net, people aren’t honest. But with the emails and calls I got . . . you’d think my last ad was an invitation to come over and get murdered, rather than an honest attempt to inform the public of a perfectly good living situation.\nI don’t know. Maybe I’m done. Maybe I just won’t rent out that room anymore. I don’t need the money. I’ll move the bottles from the living room into the extra bedroom. I’ll be able to watch TV in there again. The ghosts react oddly to TV: they bubble and bulge and press themselves to the edges of their bottles when they see the screen. It agitates them. Normally, they pass their lives in a sort of timeless state. But the flickering of that image shows them that time is passing, and their loves and hates are slowly leaving this world.\nThere’s one in particular that I would like to remove from my living room: it’s a baby. I actually have a number of babies on site. For awhile, I specialized in them. They bother most ectoplasmic storage specialists. But not me.\nChris once told me that human beings are hard-wired to feel an “urgent sense of distress” at the crying of a baby. Well, that’s not true. You know how many times I’ve gone down to the Kaiser Hospital over on Howe Street and sucked the ghost of a crying baby out of one of their incubators? Just maybe like two hundred times. Crying babies? That’s a Wednesday for me.\nBut this particular baby is worse than usual. This baby was—is—all turned inside out. Yeah. It’s all mottled and red and bloody, with the intestines poking out, and the skin all thick and lumpy on the outside. Looks a bit like a lizard. In the hospital, it cried and cried and cried and cried. I softened it up in a bath of silver nitrate and sucked it right into my holding tank. No problem. It’s on my living room mantle.\nThis baby. I don’t know. It was haunting that there neo-natal ward. If I hadn’t a taken it out, it’d still be there.\nMost of the time, it lays, gasping quietly, on the bottom of its bottle. But when the TV turns on, the baby’s misshapen head lolls back and it lets out that shriek from beyond the grave. And I turn and I look at it and listen. And you know why? Because I don’t flinch. That’s not who I am.\nWhy did this baby stay behind? What was it supposed to do? What is a little lizard-baby even capable of doing? And what will happen to it if it stays on my mantle? The scientists say that ghosts slowly boil away: if they don’t accomplish their aim, they lose half their substance every few hundred years. But when does half times half times half equal nothing? We still don’t know. We’ve only been bottling ghosts for fifty years or so. None have yet dwindled away to nothing.\nAll I know is that I came to this place as a boy. And I had no friends. No lovers. Nothing. No means of surviving. Most of the people who came here at the same time are now dead, but I did not die.\nI found a trade. And I practiced it. I built a business, and I bought a house. I took in boarders and I treated them well, and they treated me well. And years passed\nI liked Chris. And I think he liked me.\nHe moved out over such a tiny, simple thing. One morning, we were both in the kitchen. I was making an omelet, and he was brewing coffee. He had his favorite ghost—it was that little girl—sitting on the mantelpiece, and he was smiling at her and telling her about his day. And then I noticed him looking at me with a guilty, furtive look. And I stood up.\nHe yanked his hand away from the bottle. One quick glance showed that the bottle had been unscrewed a tiny little bit more. Not much. Not enough to let her go. But a few more turns and she’d have been free.\nAnd that’s when I decided.\n“It’s been good having you here,” I said.\n“The same,” he said.\n“You . . . you care about the ghosts, don’t you? I mean . . . that’s why you’ve stayed so long.”\nHe was clutching one of his hands with the other one. His eyes flickered back and forth, like I’d just bottled him.\n“I’ll leave them to you,” I blurted out. “When I die. I’ll leave them to you. In my will. My sister’s kids won’t want them. You can come here and let them go. It’ll take a day or so, but you can let them go. Maybe you could take them out into the woods or something, so they’d have more time to disperse. But you could let them go. I don’t know when I’ll die. But in twenty years, some of them, maybe, will still be able to do their thing.”\n“No, don’t do that,” he said.\n“I’ll give you the house, too,” I said. “By then, it’ll be completely paid off.”\nHe looked at the girl. She was beating against the walls of her bottle. And then he looked at his hand. “N—No,” he said. “I don’t . . . ”\n“By then, you’ll be making a lot of money,” I said. “You won’t need the storage fees. Right now I need them here. I live off them. Can you imagine what it’d be like for me if I were to let them go? Their next of kin would sue me. I’d go bankrupt. I’d lose my house. But you could do it. I’ll work the legal angle so that you’re not liable. You won’t own them or anything. You won’t be legally or morally culpable. All you need to do is come back here. Someday. Maybe twenty or thirty years from now, when you’re married and you’ve adopted three children. It’ll just take one day. And I think that after I’m dead, I’d really enjoy knowing that they were free.”\nHe shook his head and told me that he would think about it. Then he went off to his room, leaving the little girl there on the sill.\nThree days later, he emailed me his notice. His boyfriend came to move him out.\nIt was four weeks before I moved that little girl back into the basement.\nI don’t know why he left. I don’t know why he didn’t accept the offer. I thought I was giving him everything that he wanted. But I guess I was wrong.\nIt’s true that Chris wasn’t the first person to insinuate that there’s something wrong with me . . . I don’t know. I just don’t know.\nBut I do know that I don’t deserve to be alone.\nThat makes me sound awful needy, but it’s the truth. You’ve gotta sense that. I haven’t done anything that merits this kind of exile from humanity. I don’t want anything special from you. I don’t want you to be my friend or my confidante. I just want to occasionally come home to the sight of another living being.\nThe room’s $400. It’s big. It’s clean. It’s got a bathroom. You won’t find a better deal.\nPlease call (or email). Leave a message if I’m not at home. The reason for that is that the phone’s a landline, see? It doesn’t register missed calls, like a cellphone does. And if you don’t leave a message, I’ll never know that you ever even called in the first place.\nRahul Kanakia's first book, a young adult novel entitled Enter Title Here is coming out from Disney-Hyperion in Fall '15. Additionally, he has stories appearing or forthcoming in Clarkesworld, The Indiana Review, Apex, and Nature. He holds an MFA in Creative Writing from Johns Hopkins, and a B.A. in Economics from Stanford, and used to work in the field of international development. Currently, he lives in Oakland, CA and makes his living as a freelance writer and content creation consultant."}