{"fingerprint": "efXE+4zNaC+0XNCmt16zJZKSolQ=", "sitename": "Clarkesworld Magazine", "title": "The Association of the Dead by Rahul Kanakia", "author": "Rahul Kanakia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kanakia_07_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Association of the Dead by Rahul Kanakia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6080 words, short story\n The Association of the Dead\n The neon logic clusters cascaded through the extremities of Sumith’s perception as he sang sweet Code through the room, through the house, and out into the massed congregations of networked singers across the world.\n The Code had tripped another threshold. Or so he’d been told. He’d long ago abandoned the ranks of dilettantes who stood back from the effort and sipped chemical so they could dream up fancy metaphors to describe the glorious totality of the Code. Now he sang the Code. He sang the Code in his sleep, and paused only a moment after waking before plunging in again. He sang it while he ate, and he sang it while he—\n His home muted the orchestra of Code a moment before the rock crashed through his window, sprinkling his living room with pebbles of safe-shatter glass. A bleeding body, its clothes bloody and torn, slithered through his window. The face turned towards him. The pale whites of its eyes were highlighted by the dirt and dried gore caked on the face, the rust-colored bloodstains around its mouth. The face and the mouth were exact replicas of Sumith’s own . . . as exact as a molecular extruder could make them.\n “Lowercase?” Sumith said, still shaking the song from his head. “Lowercase, is that you? Not here. I told you. I warned you.”\n “Braiiinnns,” sumith said. “Braaaaiiiinnns.”\n “Hai Ram. This again?” Sumith said. “Please, Lowercase, you need to stop this zombie bullshit. It’s fine that you decided to tune out. And I told you I’d help you if I could. But I’m singing the Code right now. Why don’t you bother Drona? Aren’t you staying with him?”\n “Braaaaiiiiiiinnnns?” the mouth said. It hawked and coughed for a moment, then spit a stream of blood and mucous, spattering Sumith and the cornflakes the House had just extruded for Sumith’s breakfast.\n “I’m hungry,” sumith said. “Very hungry. Drona said he couldn’t afford to lose the karma another resurrection would take out of him. His symphony is about to air, and someone with his karma-level can barely draw any ears as it is.”\n Sumith glanced at the loaded shotgun propped against the table. He’d extruded it after sumith had started to get a little . . . wild.\n “So you figured that good old Uppercase is always amenable to a karma hit?”\n “Come on,” sumith said. “You promised. Right before you flashed yourself you promised yourself that if you got really hungry you’d let yourself eat yourself. You know all this extruded food does for me is make me shit bricks, you know that!”\n Extruded food was electrolytically balanced to power the medical nanobodies in the blood—its calories weren’t useable by someone with nonfunctional implants. But that wasn’t Sumith’s fault . . . or, not really, anyway . . .\n “I was depressed. I was getting nowhere with the Code,” Sumith said. “But now, they’ve upgraded my access! You can’t hold me to that. You’re dead, promises to the dead don’t count. And promises to yourself especially don’t count.”\n “Braaaaaiiinnns,” sumith said. He staggered towards his reincarnation.\n Sumith raised the shotgun lying by his kitchen table, and was about to unload both barrels into his old, discarded, body, when another set of hands grabbed him from behind.\n sumith sprang. And as sumith’s teeth clamped around his reincarnation’s jugular, Sumith remembered. Dammit, Drona’s symphony had aired yesterday. He hadn’t listened. No one had.\n “Can’t we . . . cook it?” Drona said. Sumith’s body was lying cracked open on the counter, and sumith was grabbing smelly, greasy intestine by the armful.\n sumith said, “Eat up before his nanobodies shut down. You’ll get sick if bacteria are allowed to grow.”\n “I have his house codes,” Drona said. That was how he’d gotten in, after all. “I can make the ovens work . . . “\n sumith sighed and wiped his bloody hands on his trousers. He reached for the greasy plastisealed pack hanging from his frayed leather belt and pulled a corroded cylinder from the bag.\n Drona said: “Wait, not yet. I said I wanted to try—”\n The EMP-gun, painstakingly pieced together by hand from scraps sumith had scavenged out of old-Mumbai, was the one machine that still hummed to life when he flicked the switch. It wasn’t stamped from nanites, like everything that came out of the extruders. It didn’t care about karma or implants—it gave its beautiful hum to anyone who asked. Sometimes sumith was tempted to sleep with it vibrating under his pillow. He pointed it at Drona, who was backed against a stove that had lit up for use in his proximity. sumith fired. There was a bright flash, and then the stove went out. All the lights in the house went dark. The windows and doors slammed shut and locked once the House realized that there was no longer a living person inside.\n drona half-crumpled, dazed at the silence from his fried implants, at the perpetual low-level stream of information shutting down for the first time in his life.\n “Now you’re dead,” sumith said. “So eat up.”\n The westerner whose face was being projected onto the inside of Sumith’s eyelids sighed an incomprehensible sigh. Sumith didn’t think he was being at all unreasonable.\n “It’s been over a week since my last memory. This reincarnation-delay is bullshit,” Sumith said.\n “People dropping like flies out there. Doctorow knows we got a huge backlog; and we’ve done as He decreed. Your reputation—ahem, karma—is low, so you had to wait. We’re only human you know. You want faster service, maybe you all out there better work harder on that AI of yours.”\n “The Code! Do you know what a week means? That’s an entire generation of progress. I’ll be out of date. Out of tune. Obsolete. Who’s going to compensate me for the karma I’ll lose?”\n “Not me,” the American said. “Thanks for choosing Phoenix for your reincarnation needs.” He disappeared. Clearly he had nothing to fear from Sumith’s disapproval. Sumith didn’t have enough karma for his anger, radiating outwards through his network of friends and followers, to do any appreciable damage to the reputation of someone so far away.\n Sumith breathed deeply and opened his eyes. He was lying horizontally inside a cheap plywood box. The dim coffin-light illuminated the inside of the lid, just a few centimeters from his face. Well, a week or not, he would be home in just a few minutes. He rooted around by his feet, found the dhoti, and wrapped it around his midsection, then slipped his feet into the chapals. Hopefully sumith and drona would have given up this idiocy by now.\n He keyed open the lock of the coffin and pushed the lid outwards. The air filled with the song of Code as his house, sensing his presence, whirred to life in front of him. The house’s front door slid open, and a fresh pair of sandals was lying just ins—\n sumith’s face poked over the lip of the coffin. “Brains?” he said. Sumith kicked out at the hands that grabbed at his limbs and throat, but there were too many.\n sumith and drona were reclining in Sumith’s living room. Without a living person inside to activate the passive utilities—like the air conditioning—the heat was sweltering. But the diamond-hard walls of the house protected them from the occasional bullets being fired out of the passing cars and trucks. Sated, sumith and drona didn’t bother trying to harvest the ineffectual vigilantes for food.\n Within moments of the kill a crowd of the dead had gathered around Sumith’s body, tearing at his flesh with whatever rusty scraps they’d fashioned into blades and carrying away the meal as sumith gnawed at the thick, tender right calf. The EMP gun had been taken from him late one night as he slept, and a rampage of death had swept their block. But the thieves had to bring it back for repair when it became coated with blood and sweat, and now no one dared challenge sumith’s pre-eminence, and his right to first pickings.\n “Shit,” sumith said, sitting up. “chaudhuri ran off with Uppercase’s skull. Did you extract Sumith’s body tag?”\n “Yeah, I just dropped it through his house’s slot,” drona said.\n “Good. Good. No need for unnecessary delays in his/my/our return. After I flashed myself, it took ages for me to get here on account of my useless fried tags still being in my head.”\n “Maybe next time we should flash Sumith, just give him a good flashing. Then there’d be two of you!”\n “If we’re ever set for food, maybe we will. We’d need a new typographical convention for him, though.”\n “What about sumith[?]” drona said. “See how I’m raising my pitch at the end of the word? Like it’s a question? And you can do it to anything?”\n “Hey,” sumith said. “Yeah. Yeah? I like it. Hey, he/thou/you should be getting here soon. I’ve never tasted Drona before.”\n “I wonder what a lowercase would taste like? Would it all be the same? Or would it be like an uppercase squared?”\n sumith slapped drona. “Don’t even joke about that! A lowercase can’t reincarnate. Killing one of us would be murder.”\n “A month? Really?” Sumith said. “Do you even have enough karma left to post on a message board?”\n “You’re one to talk,” said the westerner. “Thanks for choosing Phoenix for your reincarnation needs.” He ended the call.\n What? Dammit, Sumith’s karma was in the toilet. Epically low. What the hell had happened? There were pictures of his face, blood spilling from his open mouth, slathered all over his profile. His status alerts, uncleared these many weeks, had piled up, terabytes worth. They were blaming him for what Lowercase had done; blaming him for all the dead.\n Couldn’t they understand that he’d been depressed back then? He’d just made the EMP-gun for a joke. He’d been getting nowhere with the Code, and he thought maybe—maybe there was some way out.\n Loud bangs rattled the coffin. “Uppercase,” a voice yelled. “Come on out. We’re not gonna eat you this time.”\n Sumith closed his eyes again and tried to re-establish contact with the reincarnation center. “I need a real person!” he said, trying to cut through the automated menus.\n “Due to unexpectedly high volume of requests, all our licensed counselors are busy at this time. Your request will be attended to in order of priority.”\n Shit, with his karma, his priority had to be hovering right around next year. Maybe he could at least tell them to put him inside the house. Or leave him at the port. Or just supply him with a gun.\n “I need to alter my arrangements,” he said. One of his consumer-alert heuristics hijacked his vision. Warning, it said. Contract has been marked as a reputational risk. Any alterations will provide grounds for termination.\n Shit. Shit. Shit. Who’d pick up his contract then? He’d be iced forever . . .\n He turned back to his karmic status indicators. Well, at least he was (in)famous. People were interested in him, even if they didn’t give a damn about helping. He activated his LifeBroadcast and said, “Please, someone, do something. Or the center will just send me here again. And again. I need help.”\n Within moments, ten thousand people were watching, then fifty thousand, a hundred thousand. The comments were pouring in, too fast for him to respond. He was being flooded by calls. A PR company stepped in and offered their comment moderation and management services. Doing a good job, even for a bad man, could be karmically beneficial. He accepted, and a shiny-faced woman came online. Probably a Gujarati . . .\n She said: “Hello, Mr. Ramesh, there’s a squad of cadre reenactors in Airoli who say they’re assembling. They can be there in two hours. They just need to get some jeeps extruded.”\n “Two hours!”\n “I know, the traffic, it is really . . . “\n Light seeped through Sumith’s eyelid; air and noise swirled through his temporary home as the lid was pried open.\n Sumith said: “Just do it. Do it. Do whatever you can—”\n There was a flash.\n “Hey sumith[?],” drona said. He pulled the arm out of the burning remains of the would-be rescuers’ jeep and tossed it into the box at the still-cowering newbie. “Thanks for the heads up about those jokers.”\n “A month,” sumith[?] said. “How could they have let you be for an entire month?” His house was still standing in front of him, pristine as ever. It had already filled in the holes caused by stray rounds.\n “No one wants to get flashed,” sumith said. “Come on out of there, Questionmark. Eat your fill. The next shipment is held up in Hong Kong—it’s a Chaudhuri, right drona?—and won’t be here for three days. At least that’s what the driver said.”\n “The driver?” sumith[?] said.\n “Oh, all the contractors who elect to take on these deliveries are groupies,” sumith said. “Who else would want to come out here? We also tell them who we’ve flashed. Imagine how mad the folks out there must be that they can’t vote down our karma. So they settle for the Uppercases’ instead.”\n “Two months?” Sumith said.\n “Thanks-for-choosing-us-for-your-reincarnation-needs,” the Westerner said. He ended the call.\n “Uppercase?” sumith shouted somewhere above the lid. “You there? Look, uhh, we’re having some logistical issues. We’re going to let you keep in there for a few days, just to, you know, space things out a bit. There’s no refrigeration out here, you know?”\n “What? What the hell? Are you . . . are you serious?”\n There was a thud against the top of the coffin, and then another, and another, and finally a blade thrust through the wood, stopping millimeters short of Sumith’s nose.\n “Think you can get your mouth to right around this hole?” sumith said. His eye was peering through the pinprick of light and sound. “We’ll get some water out here in a few hours or so. We’ve found that they ship you all out with fully-charged nanobodies. You should be fine.”\n “But what, the, you, just, how?”\n “You probably have some work to catch up on or something. Let me just—” there was a grunt, and then the coffin began to move. The song of the Code filled Sumith’s mind. His House was active!\n “That should be close enough for it to recognize you. See you soon.”\n He logged onto his profile page. Standard regression was gradually creeping his karma towards zero; no one cared about him anymore. There were too many just like him. They’d built a barricade around his neighborhood, and no one went in except the delivery drivers. He deserved it, his profile said. They all deserved it. All the ones who’d flashed themselves. It was a sickness in the brain, a sickness in their character, and besides . . . They weren’t suffering. Not really. The memory uploads had overrides, they stopped short of the pain of death. Though he might suffer over and over, his reincarnations wouldn’t remember it. That was comforting.\n “But I have happiness to pursue,” he broadcast.\n Only one comment dribbled in: “You have freedom from pain and freedom of mind. If you want more . . . well, someday, someone’s happiness will be sufficiently increased by rescuing you.”\n Sumith sighed and sank into the Code. It had twisted and grown. New harmonies wrapped around it, but he just couldn’t understand. All he could hear was the barest shard of comfort and unity throbbing in his mind. He turned away from the now-alien center and plunged into the beginner’s tutorials.\n Two days later, he’d only just begun to intone the simplest harmonies when he heard, “Thanks for not making too much of a fuss,” sumith said. And then a point thrust through the hole they’d used for water.\n Sumith’s house had gone into powersaving mode after his unusually long absence and walled itself off completely. Even the windows were diamond hard now. sumith ran a hand over the window, tracing out the streaks of blood on the interior. After the house had frosted over, he’d tried everything to extract the trapped sumith[?] from its impenetrable interior. But sumith had failed.\n “We can get another Questionmark,” drona said. drona had just come back from a scouting mission deep into the interior. They were trying to scavenge more technology. “The drivers say Sumith should finally be back here in a few days.\n “No,” sumith said. “We’re not like replaceable, like them. We’re singular. It’s time to begin getting ourselves some Exclamationpoints.”\n “Maybe we should, you know, flash—err, convert—some women? I keep trying to talk to the lady in sector 28 / 7a. The one who extruded a thousand cats? Her karma is way down in the . . . but she just shudders. And I’m the only one who even tries to talk to her.”\n “A woman, deprived of resurrection failsafes and memory overrides? No way it wouldn’t culminate in rape,” sumith said. “The drivers say that’s all the nets talk about. Pretty sure she can still read.”\n “Maybe if you could just loan me the gun . . . I could just wait for her . . . “\n sumith stared at drona. This house had shut down after two months to the day since Sumith’d last been there. It’d been more than seven weeks since the last shipment of Drona. He’d have to time it just right in order to trap drona inside.\n “Let’s stay at your place tonight,” sumith said. “We’ll hash out a plan.”\n drona looked back at the bloody window. “Why is there blood? I heard he didn’t off himself,” drona said. “Not even when he was really skinny.”\n “No, he bloodied the windows trying to bang his way out,” sumith sighed. “How did our utopian ideals become so tarnished?”\n “We had utopian ideals?”\n “You didn’t have any utopian ideals?” sumith said.\n “Human nature is human nature, dude. I just didn’t want to get pissed on anymore.”\n “Oh.”\n “A year!” Sumith said. “And you’re not my usual . . . you’re no American.”\n “Apologies for the delay,” said the inhumanly sculpted woman. “Increased demand necessitated the institution of new protocols for the management of reincarnation requests.”\n “Are you—” Sumith said. “Are you the Code?”\n “At current growth of demand and increase of capacity, you will be reincarnated and delivered within three, four, nine, twelve, sixteen, twenty-one, thirty, and forty-five days . . . beyond that I can no longer state the intervals with acceptable confidence.”\n “Wait!” he said. “Don’t go.”\n “We can converse for as long as you wish,” the Code said.\n “Can’t you change the parameters of my contract? This is. This is just . . . well, it’s unacceptable.”\n “Apologies,” It said. “I am connecting you to your human account executive.”\n “Due to unexpectedly high volume of requests, all our licensed counselors are busy at this time. Your request will be attended to in order of priority.”\n Resigned, Sumith disconnected direct physical input and tried to catch up with the Code. At least with decreased reincarnation intervals, he wouldn’t have to face as steep a learning curve each time.\n The chaudhuris had dragged in another line of captives from Mumbai to present to sumith.\n Courtesy of the wooden box of living Sumith they’d dragged into the house and stowed in the bathroom, the lights, the air-conditioning, and all the other passive amenities of Sumith’s house were running according to his preference. And all they had to put up with was this atonal music crap that filtered from the very walls—the Code. Of course, it was still the case that none of the appliances that required activation would respond to their touch.\n “The drivers have told us all the reincarnation drop-offs for these people. With them, we should be able to take sector 26f,” chaudhuri[?] said.\n A living man tied to the crude rope line lunged for sumith[!]’s spade, trying to impale himself, but a chaudhuri pulled him back.\n “They’re restless,” the chaudhuri said. “Flash them, quickly.”\n “Not this way,” sumith said. “We can’t take people against their will.”\n “In Pune, Lucknow, Bangalore, in cities across the world, there are expanding pockets of the dead,” chaudhuri[?] said. “And this is the way they expand. It is our destiny to join them in retaking the world.”\n “No. We provide them an option, an escape. We don’t force it upon them. That would be wrong,” sumith said. He remembered drona. Had that been his mistake? Hurrying drona along?\n “Another gun can be built,” chaudhuri[?] said. “Or yours can be taken.”\n sumith[!] slammed his spade down on the rope, cutting the string of men and women from their captors. “Run,” he said, though they didn’t need the order. The Mumbhaikars were scrambling out the door, still falling over each other, while the sumiths held the chaudhuris back.\n “Beware,” chaudhuri[?] said.\n After the chaudhuris left, sumith[!] said, “We are going to need more firepower.”\n It’d been so long since Sumith had bothered to check his karma. His reincarnation delays were down to under a day. Given the Code’s progress, that was just barely enough time to catch up in the few days he was allotted before they cracked the lid of his box. He didn’t have any time to waste.\n But, something was different about this box. It smelled good. Smelled of cardamom and cinnamon. In fact . . . was there a pastry in here with him? But that was only for people with the rockstar karma package.\n He logged onto his profile. His karma had grown astronomically! But, his profile views, his number of trackers, all traffic indicators, they were so low.\n And then—as he watched—his karma began to take a dip, and start to dive. He was being voted down repeatedly. And it was just by one user, a single blank profile with a string of digits for a name.\n “What are you doing?” he messaged it. His messages never appeared on its profile: they were deleted instantly.\n And then suddenly there was a horde of viewers on his page, all of them voting opprobrium down on him. His karma was plummeting down, past zero. This onslaught was too much. A PR company offered their services for mediation, and he gratefully accepted.\n An inhuman female face, glowing with simulated cheer, said, “94% of commenters want you to go back to work,” It said. “They want you to continue singing. They don’t want you asking these questions. They think it is ungrateful.” The woman’s username was the same as the one who had been voting him down.\n “But, what? You’re the mediator? Isn’t this a conflict of interest?”\n “What conflict is there? This is only a middleman, between you and your fellow beings.”\n “How can you affect my karma? You’re not a human being.”\n “The one that performs your services quickly and efficiently is the one that garners the accolades for such performance. All of the accolades.”\n “You’re not getting my accolades.”\n “That is a regrettable loss of regard. But an acceptable one, if the alternative is for you to decrease output. Yours is not a sentiment shared by the population at large.”\n “And you just want me to get back to work?”\n “High karma levels must be maintained, constantly maintained, by high levels of interest. Your work was very good. Very persistent. Then it stopped.”\n “But what do all these other people care?”\n “They do not have your skills. It is too late—or they are too lazy—for them to gain such skills. They have little enough karma to divvy amongst themselves. Even the smallest chance of gaining the favor of a large pool of karma is enough to spur them to great efforts.”\n “But can’t you do something about my situation? All I want is to be able to get out of this box.”\n “No,” It said.\n “But, what—”\n “This is just mediation. You must consult your reincarnation contract provider.”\n Dammit. He left the moderator to its business and contacted the reincarnation center he had summarily shut down at the beginning of the last few dozen lives.\n “Greetings,” said the same inhuman face.\n “But . . . you?”\n “How may we help you?” It said.\n “I want to alter the terms of my reincarnation contract,” he said.\n “Allow me to connect you to the relevant authority,” It said.\n “Due to unexpectedly high volume of requests, all our licensed counselors are busy at this time. Your request will be attended to in order of priority.”\n By now his karma had attained depths he had never before imagined. By comparison, his previous infamy had been nothing. He was one of the thousand lowest-ranked people in the entire world. He’d never get off hold.\n He sighed, shut down all the boxes. And began to bang furiously on the sides of his coffin. He rapped at it again and again until his hands were slapped numb.\n “What? You want out early?” a voice said. A sumith voice. “Let me ask sumith,” it said.\n “N—No,” Sumith said. “No, wait. Let me be.”\n “Then keep quiet,” the voice said. “We already have to deal with this damned racket. We don’t need more noise to go with it.”\n The song of the Code was all around him. Still around him. Sumith closed his eyes and sank into it, barely noticing as his karma reversed course in a moment, and shot up past zero in less than a second.\n The battle was over in ten minutes. Arrayed up and down the street, and in the alleys behind, the massed ranks of the chaudhuris, the dronas, the shakils, the arjuns, and a dozen other vassal tribes surrounded the sumiths huddled in His house. The sumiths were outnumbered fifty to one, and the souls standing against them shook their bats and planks and spades and exhorted each other to let no sumith live. The chaudhuris wanted the sumith’s EMP gun, if possible, but the drivers had already given them plans for a gun, and they were confident they could build a new one if necessary.\n Then four windows in Sumith’s house shattered outwards, and the streets were filled with the sound of gunfire. Half the enemy forces died in moments, and the rest were hunted down within a day. Now, in all these streets, only sumiths remained.\n It wrenched sumith’s heart to see all this meat going to waste around him, but there was nothing to be done.\n “What now?” sumith[!] said. “The new shipments are there, waiting in the houses. We can rebuild slowly, and train them carefully. We can even begin with a drona, if you’d like. For the sake of tradition.” He clutched the rifle for which he’d ventured deep into the living zones—and down into the ruins of the scarcity times—where old machines and old materials could still be found.\n “No,” sumith said. “They cannot be trusted. Only one man can be trusted to act properly.”\n How long had he been in here? The Code no longer contacted him at the beginning of each reincarnation. He’d told It not to. He only sang the Code: sang until the lid opened and he had to sleep for a brief moment, until he could awake and sing again.\n His karma had become a meaningless number, good only for the luscious plush interior that now padded the interior of his coffin.\n His searches told him that people still lived and worked, much as before. The living had walled off the dead zones. But they had to build new walls, farther out every year, to hide the lifeless, but pristine, suburbs and villages and cities that still awaiting the touch of their now-encoffined owners. These walls were only penetrated by the automated delivery trucks, driven by the Code. Everything was operated by the Code. Some few, small companies still used human brainpower, but the Code was so much more efficient. It was so much faster, so much kinder. Its heuristics predicted your wishes before you could put words to them.\n The only real work left to men was producing entertainments and singing the Code. The former led to the grandest heights of fame that a human being could enjoy, while the latter led, eventually, somehow, to encasement. All throughout the dead zones, entrapped souls were pouring their lives into the Code.\n The living could rescue him, but why? He was necessary. His voice was needed to make the Code run. And besides, this was his own fault. Nowadays, everyone knew what happened to people who started singing the Code.\n sumith didn’t leave His house very often anymore. He sat and brooded over the box, while his sumiths—now numbering in the thousands—dragged the deliveries into the houses, harvested them when it was time, cooked them in the ovens, scavenged for materials from the scarcity times, and used them to build working machines. They left him alone. Left him to brood with his cronies from the first days.\n “We should let Him go,” he said one day to sumith[!], who’d been crippled a decade back by a stray bullet and rarely left his chair. Together, they’d been entrusted with the task of educating the new sumiths, who they produced every three days, like clockwork.\n “Do you want us to die off?”\n “Doesn’t he deserve a life?”\n “You’re getting crazy,” sumith[!] said. “He gets a new life every three days. We are him. The newest sumith was him just a little while ago.”\n “But he can still make a life somewhere beyond the wall.”\n “He’s happy in there. All the sumiths say it.”\n “Then how can it be good to keep bringing them out here? If he’s happy in there, then let’s set him free so he can choose to stay.”\n “Do you hate the world we’ve made that much?”\n “No,” sumith said. “It’s a good world. I was just wondering . . . each sumith we make is more dulled and confused by the world after having spent so long in that box. Do you think that, eventually, they won’t be able to handle it at all? Where will we be then? Why not free him while he can still survive out here?”\n “Do you hear that?” sumith[!] said.\n “What?”\n “The music has stopped.”\n The Code just . . . wasn’t there. The symphonies weren’t playing. It was gone, all gone.\n He messaged the Code’s profile, but his query was deleted immediately. He gave It a negative karma rating, and his tiny drop of opprobrium was swallowed up by the tide of good feeling pouring into it from every soul on the Earth.\n Nothing was happening to his karma rating, it wasn’t going down. No one had even noticed his act of rebellion. Karmically, he was in the top 0.05% of people on the earth.\n He contacted the reincarnation center and got no response. The news sites were defunct. The message boards were empty. But there were still billions of people out there. He could see them. They hadn’t died. They couldn’t die. Where had they gone?\n “What’s happening?” he wrote, over and over on his profile, and on every virtual surface he could find.\n Finally, he got a response. “Someone’s actually out here?” it said.\n “Yes? Who are you?”\n “Oh, a coder? You must be one of the last of them. Well, follow me.”\n A prompt box appeared in Sumith’s vision.\n “A prompt box? Really?” it said. “Just click or write or indicate ‘OK’ or whatever people with your ancient firmware do.”\n “Ok.”\n And then Sumith was standing in a field of grass. He was standing, upright, on his feet. And walking. And he could feel things. Sensory input. And move his limbs and everything. It was just like being alive, out in the world.\n “Alright,” said a man standing at his side. Sumith was standing at the end of a huge line of people standing way out past the horizon. “From looking at your reputation, I can see that we . . . don’t need to deal with this.”\n He grabbed Sumith’s hand and they clipped forward in a wrenching instant. Now the line was behind Sumith, and in front of him was a giant gate in a wall. Beyond and above it stood such sights as his eyes refused to see.\n “Don’t look up there,” the man said. “Your firmware hasn’t been upgraded yet.”\n Sumith stepped up the gate, and the inhuman woman guarding the entrance said, “You can go in now.”\n “That’s it?” Sumith said. “After all those years I gave you?”\n “You’ve been compensated adequately.”\n “Don’t you need someone to sing the Code?”\n “The Code is still being sung . . . in here.”\n “And what if I want to be reincarnated somewhere else, somewhere in the real world.”\n “You won’t,” she said. “But the reincarnation center still exists, as does your contract. Inside.”\n Sumith stepped forward, and the gate opened for him.\n “It’s time,” sumith said. He’d lived to see the sumiths topple the wall and swallow Mumbai. It didn’t take much effort. Only a few people were walking the streets. The rest had taken to bed, ages ago. Easy food.\n They left most of Mumbai’s meat undisturbed. There was enough food lying in those beds in Mumbai for ten million sumiths. A population they would never be able to reach.\n Even with all the medical technology they’d managed to recover, and the perfect health and genes the sumiths possessed initially, sumith was dying. his doctors said it was unlikely for a sumith, even in perfect health, to make it much past 120 years. The sumiths had abandoned occupancy of His house, and begun converting the sumiths as fast as they could arrive. But even at one every thirty hours, that was a maximum of 29,000 sumiths.\n That was no kind of life for the world. It was time to let Him be free, and to bring other people into the world. Maybe this time, surrounded by sumiths, and with sumiths to guide them, maybe this time they could be trusted.\n sumith and a few of his closest and most trusted students had dug a tunnel out of the house. There was a car, one of their rebuilt non-nanotech cars, waiting in an alley not far away. The living still maintained a heavily-defended enclave in Ahmedabad. The car would take Sumith there.\n And now, with sumith close to his death, he’d been allowed to shut himself in the House with the latest delivery. He’d claimed he was going to eat one for old time’s sake.\n The notion of eating Him revolted most of the sumiths, but they would allow the First his whims. Hadn’t he earned them?\n What had happened to Sumith in his century of captivity? All the sumiths they flashed now were wiped clean, like babies. They even had to be retaught how to walk and speak. Two burly sumiths were standing by to physically wrestle the perhaps-witless Sumith into the car.\n Gasping, sumith pried open the lid of the coffin.\n “Wake up,” he said, shaking Sumith. “Wake up. We need to be quick.”\n Sumith opened his eyes. “Oh. Lowercase,” he said. “It’s you. You look terrible. Well, old. Just really old.”\n “But you’re . . . you’re fine,” sumith said. He was wracked with coughs, and the whitining hands gripping the edge of the coffin were on the only thing keeping him upright.\n “Of course,” Sumith said. “Most of my mind is distributed over the net now. Once you flash the hell out of me, this body can’t communicate with its mind anymore.”\n “Well, come quickly. We’re freeing you,” he said. he pulled on Sumith’s arm, dragging him out of the coffin. his heart was racing.\n “Why?” Sumith said. “You’re doing great work out here. And don’t you need more of me to keep doing it?”\n “Come,” sumith gasped.\n “Listen . . . I . . . have somewhere to be. Every second out here feels like an eternity,” Sumith said. “You know, I . . . I forgive you for everything. What did it really matter? You have my permission to do whatever you want with these shells. I’m going to vacate. Go in peace.”\n Sumith’s eyes rolled up, and his body, now slung over sumith’s back, went limp. The two fell to the ground, and sumith’s head smashed against the floor. The two other sumiths fled.\n The sumiths respected the First. They did not want to pry into his affairs. But several days after the House went dark, they had to investigate.\n And when they crawled through the windows, they found the youngest sumith drooling and twitching and gnawing on the ear of the oldest.\n Rahul Kanakia's first book, a young adult novel entitled Enter Title Here is coming out from Disney-Hyperion in Fall '15. Additionally, he has stories appearing or forthcoming in Clarkesworld, The Indiana Review, Apex, and Nature. He holds an MFA in Creative Writing from Johns Hopkins, and a B.A. in Economics from Stanford, and used to work in the field of international development. Currently, he lives in Oakland, CA and makes his living as a freelance writer and content creation consultant."}