{"fingerprint": "QqeQEh96IWf5m8QRMlelHYP6XYA=", "sitename": "Clarkesworld Magazine", "title": "What Everyone Remembers by Rahul Kanakia", "author": "Rahul Kanakia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kanakia_01_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: What Everyone Remembers by Rahul Kanakia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3860 words, short story\nWhat Everyone Remembers\nI remember being with Maman in the cabin of her ship, anchored someplace where the wind was always howling, the temperature was always freezing, and fires were always dancing just beyond the horizon. I spent most of my time inside the mattress where she slept, burrowing as close as I could to Maman so that I could feel her solidity and heat spreading out above me without burrowing so close that I came in contact with the harsh light and cold air. It was a delightful spongiform environment, flecked with tinier insects—mites and flies and spiders—and with the crumbs of food and flakes of human skin on which the lesser creatures fed. Life was not hard for me there.\nBut Maman frightened me. When I emerged from the mattress, she would sometimes grab me, pinch my useless wings and interrogate me in front of bright lights. She’d put me in her nest of tubing and plastic cupboards and order me to run from one place to another as quick as I could. She would touch delicate golden wires to my various legs and my body would dance with strange impulses.\nUsually my days passed in total silence, except for the few occasions when Maman interacted with the other occupant of the ship, Uncle Frederick. These conversations were always initiated by Frederick, who would stare at her for a long time, then nod. They’d go onto the deck, shut the cabin door behind them, and talk in very low voices. On one of these occasions I oozed out through a crack in the doorway and tried to listen to them more clearly.\nThey were huddled together behind the wheel of the ship.\nFrederick said, “ . . .have to interact with her. Want all of her descendents to be poorly socialized?”\n“It is an insect,” Maman said. “Don’t anthropomorphize it. It can be anything it wants to be. Why should it carry all our human baggage? I want to give them a blank slate.”\n“And what about survivors? What if she finds more of us? Or if her descendents do? What will they think of us if we don’t at least try to be kind to her?”\n“I developed it. I know what is best for it.”\n“And I risked my life to keep her alive. Food is getting low. I’m not bringing more supplies unless I can get some sort of input.”\n“Fine, talk to it, if that will make you happy. But don’t involve me.”\nAfter this, there was one day when she did not pinch me. Instead, she called out, “You’ve been hiding from me.”\n“No,” I said. “I always come when I hear you calling for me. But sometimes I don’t hear.”\n“No more hiding. I’ve given the whistle to Frederick. You must go to him whenever he calls for you.”\n“Please, not the whistle,” I said, but she had already turned away.\nThe next day, my restless burrowing was interrupted by a sound that dragged hooks all across my body. Despite the pain, I tried to resist that insistent tootling. I stayed still for minutes, until the whistle had become near continuous, before I scuttled across the sticky deck of the cabin, up the stairs, and out into the freezing night.\nUncle Frederick lived in the cabin underneath the stairs. During the day he was largely quiescent: a vaguely human bulk that I sometimes perceived in the distance. But during the night he would lumber up the stairs and outside. He’d be wrapped up in seven layers of cloth and nylon and plastic. He’d seat himself down carefully on a mat, and stare up at the sky for hours.\nI insinuated myself into the folds of his jacket to avoid the buffeting blasts of wind.\nHis body rumbled with speech. “Took you long enough to get here, didn’t it?”\nAll along the horizon line, fires blazed just out of sight, filling the sky with a sunset glow, even though it was midnight.\n“You’re getting a good look aren’t you?” Frederick said. “It’s not so scary there. And it’ll be even less scary for you.”\n“You’re . . .you’re taking me to the shore?” I said.\n“Eventually. When your mother and I are gone, you’ll need to forage for food. Don’t worry, though, by then you’ll have help.”\n“Are there more people, then? On land?”\n“I meant that you’d have help from your own kind.”\n“Oh.” The prospect of meeting more of myself was disgusting. I thought of them scrambling all over Maman and felt slightly ill. “I would have liked to see more people.”\n“Well, maybe you will. What would you do if you saw them?”\nI nestled more deeply into Frederick’s jacket. “I wouldn’t ever bother them. I know that you and Maman don’t like to be bothered.”\n“No, no, there’s no need to be afraid of us. You should think of yourself as one of us.”\nI moved deeper into Frederick’s garments. He shuddered. His hand twitched and started scratching the places where I had been. “I’m sorry,” I said. “So sorry. I won’t touch you again.”\n“No, that’s my problem. I’m not used to people shaped like you. But you’re fine. You’re beautiful.”\n“When are there going to be more of me?”\n“Soon. When your egg case bursts, there should be forty or fifty more of you.”\nI shifted my egg case uneasily, pressing it against Frederick’s bulk as if to stop it from splitting open right there. I’d seen what happened to the mothers of the spiders and flies in Maman’s mattress.\n“Will I have to die, then?” I said\n“Die?” Uncle Frederick said. His body shook slightly. “No, never. You really don’t know, then? You’re never going to die. All your children will remember everything you remember. It will feel like closing your eyes to give birth, and then opening them in a new body. You’ll live forever.”\nAt the time, this was not a shock for me. I was too young to appreciate the gift that Maman had engineered into me.\nFrederick was silent for long moments after this. When I assayed a crawl up onto his face, I caught a brief glimpse of tear-stained eyes before an instinctive sweep of his hand dropped me to the deck with an exoskeleton-jouncing crash.\nI picked myself up off the damp, salty deck and scurried back to the safety of Maman’s mattress.\nFrederick and Maman were arguing again. I did not have to try hard to hear them, since the cabin hatches had been left open in order to air out the stale and dusty smells.\n“I told her,” Frederick said.\n“And you’ve put your own spin on it. Called it ‘immortality’ or some such nonsense. You won’t rest until you’ve fully humanized it, will you?”\n“You know that she thinks of you as her mother, don’t you?”\n“I’m no such thing.”\n“You are the only mother her species will ever have. All the millions and billions of her descendents will only remember one childhood: her childhood. You have to pay more attention to her psychology, to her development, to her socialization and her adjustment. Every interaction her species will ever have is going to be governed by the shadow of you.”\n“Don’t project,” Maman said. “I barely remember my own childhood.”\n“And why is that? Why are you so cold?”\n“You’ve made it clear that you have the upper hand here, Frederick, so I suppose I can’t stop you from telling it whatever you want. We can even decant another, if you think I’ve ruined this one. You can train the next one to call you papa.”\n“A second Eve?”\n“Sure, or two more, or three, or a hundred . . .whatever it will take to satisfy you.”\n“And have a hundred nations spring up to fight with each other, bomb each other, and create another disaster?”\n“It will happen eventually.”\n“You don’t understand. They won’t be like that. Not if we do our jobs, they won’t. They’ll remember this, every single one of them . . .they’ll look into each others’ eyes and see themselves. They’ll see that the good of everybody is the most important thing, and that if the race goes forward, then their memory will go forward, and they’ll live forever.”\n“I know that my survival depends on your survival,” Maman said. “But that hasn’t prevented me from developing a hatred for you. Why should they be different?”\nWhen Maman came in, she was smiling. She stared at the mattress for a long moment.\nShe was far away, too far to be able to catch me up, so I scrambled out of the mattress and called out, “Is my name ‘Eve,’ then?”\nMaman frowned. “No,” she said. “You don’t need a name.”\n“Why not?”\n“What is it that you call me?” Maman was creeping closer, and I skittered back slightly.\n“Maman.”\n“Where did you get that name?”\n“In the books that Frederick showed me, that is what the elephant called the woman who took care of him.”\n“You liked his idiotic books?”\n“Nnnnooo.”\n“Good. You don’t need them.” She crouched and spread her hands on the edge of the mattress, and looked at, past, through me.\n“Your memory is good,” Maman said. “I know that, from the mazes I had you run. Please. Try to remember my face. You must never forget me.”\nShe coaxed me up onto her hard, pitted hands—those hands that were like whole worlds to me—and lifted me up right in front of her face. This was my first good, long look at her. Usually, I only peeked at her with sidelong glances, in order to see if she was about to come after me.\nHer strangely-scented breath shivered right through my body, and I looked up with kaleidoscopic sight at her enormous face. Since then, I’ve seen many human faces. But, in my memory, there is nothing human about Maman’s face; it is a machine of snorting nostrils and slowly dilating pupils.\nThen she grabbed me by the wings and performed more tests on me.\nA few days later, Frederick motored away in the dinghy. He was heading off to the shore: to the fires. I was happy when he left, since I would not have that whistle tugging at me. But I was also sad. I crept into Maman’s workroom, where she was poking her head into and out of her refrigerator and other equipment. I was all alone with her. Now that Uncle Frederick wasn’t here to protect me, she could do anything.\nShe grunted as I crossed the threshold. She had not turned around. It was my first clue that she was always trying to sense where I was.\n“Is he ever coming back?” I said.\nMaman did not say anything. She played with her implements. As I waited, she picked up a very sharp tool that I had never seen her use before. I knew that she was not working. She was trying to scare me into running away.\n“Did you send him away because of me?”\nShe turned towards me and pursed her lips. “He’s left before. The last time was several months ago, when you were very young. He is going to get more food and gasoline.”\n“So he isn’t gone forever?”\n“Don’t worry. You’ll hear the whistle again, soon enough.”\nSeveral days later, when Frederick came back, I was still ecstatic at having had such a long and nonviolent conversation with Maman. She had not come for me since we’d spoken. I climbed up top and watched him unload the dinghy. Maman came out and helped him as he lifted things up.\n“What was the land like?” I said. “Did you walk into the fires?”\nMaman and Frederick exchanged a look. He handed her a satchel of cans. Everything in the boat was blackened with soot.\n“The forests are still burning, but the fires are mostly gone from the city,” he said.\n“Did you see any humans?” Maman said.\n“A good number,” he said. “They’re starting to emerge.”\nShe looked down at the cargo. “Did you have to fight?”\n“Some,” Frederick said.\nThey continued loading in silence, and didn’t respond to my increasingly chipper questions. I scurried back and forth across the length of the metal hand-rail, and barely avoided being inadvertently slapped under Frederick’s hand.\nI’d hoped that Frederick would be too tired from his journey to use the whistle, but as night fell, I heard its shriek. It was even more terrible than I remembered.\nI ran out and settled on his chest.\nHe was quiet for several moments, then said, “You’ll be kind to the people you find, won’t you?”\n“I won’t even bother them at all!” I said. “Except maybe when they’re sleeping would it be maybe okay if I went inside their mattresses?”\n“That’s not what I meant. I meant . . .will you help them? They won’t be having as easy a time as you. Will you tell them where food is? And not hurt them?”\n“Talk to them . . . ?” I said. “But . . .will they . . .will they have whistles?”\n“No, of course not. They don’t even know that people like you exist. They’ll probably be surprised to see you. But they’ll want your help. They’re hungry and they’re dying.”\n“Why don’t they get more cans?”\n“They can’t find them. And nobody is making more.”\n“Then why don’t they eat the spiders and the flies and the crumbs of . . . ”\n“They can’t. They’re not like you. You’ll need to talk to them, and ask them questions, and see what they need, and do what they want, just like you would for your mother.”\n“Just like Maman?” I said. “But Maman doesn’t need any help from me.”\n“If she needed it, wouldn’t you help her? These people will need your help very much.”\n“Okay.” I lay there on Frederick for a while, and then murmured, “But they won’t have whistles, will they?”\nAfter Frederick let me scurry into the warm insides of the ship, he called Maman onto the deck. I was too chilled to be willing to go farther than the door in order to listen to them.\n“ . . .more survivors than I expected . . . ” he said.\n“You knew there would be some,” Maman said.\n“But they’re starting to organize.”\nMaman didn’t say anything. I imagined her plucking up Frederick by the arms and running her tests on him while he kicked around uselessly.\n“Eve is terrified of human beings,” Frederick said. “I’m not sure what she’ll do when she encounters the survivors.”\n“It will do what it decides is right.”\n“It won’t do anything. It associates human beings with silence and neglect and electric shocks and tests.”\n“According to those tests, it is in good health. It’s ready for reproduction.”\n“I told you to pay attention to her socialization. You neglected her so much . . .I don’t think she’ll ever be able to interact normally.”\n“I told you to do what you thought was necessary. You are still free to try to cure the psychic wounds I supposedly inflicted on her. You brought enough supplies to buy you that.”\n“I had to kill a man in order to get these supplies. Next time, I doubt I’ll be lucky enough to find such a poorly defended cache.”\n“You brought enough for a few months. That is more than enough time.”\n“Or barely enough. If we have to start over.”\n“You want me to hatch another female?” Maman said.\n“We need to make the decision now. I think that Eve is too traumatized. She’s not going to be able to function. We need to start over. You won’t do any tests on the next one. I’ll take care of her. I’ll teach her all the things you held Eve back from: technology, art, literature, history, everything . . .Eve is such a fast learner . . .she really could have—”\n“She disgusted you,” Maman said. “You didn’t want anything to do with ‘that damned roach.’ Until it first spoke, you called this a crazy scheme.”\n“And how much earlier could she have spoken, if someone had been talking to her?”\n“Why should their language be English? Why not something better? Something more suited to them?”\n“You knew the kinds of things her mind was capable of. And you were still willing to drive her crazy, and stunt her forever. In fact, that’s pretty much what you did.”\n“Did our art and literature and history help us? No. If its descendents create a better world than ours, they will do so because of their inhumanity.”\n“That’s all moot now. There are too many survivors. That changes everything. This won’t be a post-human world. It’ll be a human one. The next Eve needs to be as human as possible.”\n“No,” Maman said.\n“I risked my life to keep this boat running! Risked it four times now. You’ve contributed damn all. I could have lived twice as long if I’d gone off on my own, without you.”\n“I’ll hatch another. But we won’t be ‘starting over.’”\n“Then the two of them will go to war eventually. Even you must see that there can only be one of them.”\n“I won’t destroy it. It is perfectly healthy. Billions of dollars and lifetimes of work were spent in creating it. But I will start decanting another progenitor tomorrow. This discussion is over.”\nThe two of them entered. I waited until Frederick had gone off into his cabin and Maman had settled down into bed. Then I crept up to her ear and softly whispered. “So I’ll have a sister, then?”\nMaman’s hand twitched and I skittered away. I heard a soft exhalation of air, and waited for the words that would come next, but she never said anything.\nI stayed in the mattress for hours, stewing in excitement and confusion. I hadn’t known that Frederick disliked me so much. I was sorry that he’d had to yell at Maman because I hadn’t given him the right answers. I knew that maybe Frederick wanted to be mean to me, but I was so happy that Maman had stood up for me and said such good things about me. I knew that she loved me, just like the elephant’s Maman had.\nBut, shortly before dawn, I felt the whistle. It was not the normal time for meeting with Frederick and I was especially lethargic. I lay in the mattress. The whistle cut through me again and again, but I didn’t want to move. Finally, I started to leave my burrow. The whistling was coming from Frederick’s cabin, where I’d never visited. I was on the edge of the mattress now, and was about to drop to the floor.\nSomething picked me up by the wings. “Wait,” said Maman.\nShe got up out of bed and dropped me onto the mattress. She walked into Frederick’s cabin, and I heard the sound of three slaps. When she came back, the whistle was in her hand.\nShe grabbed me and took me into her workroom, then locked the door behind her.\nFrederick pounded on the workroom door. “What the hell are you doing?” he said.\n“Stay back,” Maman called. “If you try to break down that door, I’ll destroy the rest of the specimens. Then you’ll never get your second chance.” Maman held me down with pressure against my back.\n“You don’t know how many people I saw out there,” he said. “There were hundreds of them, already organized into bands, tribes, and families. We’re going to make it through this catastrophe, you know.”\nThen I felt the worst pain I’d ever had in my life. All my legs tried to move at once, but they moved in different directions. I craned around, trying to look up, and glimpsed a metal syringe pulling away from my posterior.\n“That’s what I’ve been thinking about all night,” Frederick said. “About how humanity is going to endure. And how maybe it’s wrong for us to play God. Maybe the real catastrophe will be when all these creatures: so tiny, so intelligent, and so efficient, descend on the survivors. I’m wondering, I really am, if unleashing Eve—any Eve—is the right thing to do here.”\n“What’s happening?” I said. Maman didn’t answer. She sank back, against the door. Frederick kept pounding on it. I lay there in the shallow receptacle where she’d set me down. After a few moments, Maman got up and bustled around the workshop. Frederick kept saying things in the background, but I was no longer paying attention. What had Maman done to me?\nIt seemed like hours later when I heard a crashing noise. The door flew inwards, and Frederick charged. Maman was standing next to the door. She jabbed him with a needle. He turned towards her and slapped her on the face. He hit her again and again. She hit back at him, but it didn’t seem that she was hurting him very much. Finally he saw me on the table, and took a step towards me. He fell down. Maman got up, and looked at him for a few moments. She took him by the feet and dragged him out of the workroom.\nFor the next thirty days, it was just the two of us. Maman only spoke to me one time. She told me that I was carrying eggs, and that I would soon be hatching into fifty new bodies. And even though the bodies would think and feel different things, all of them would think of themselves as me. I lay in her mattress as the eggs swelled. Sometimes she plucked me up by the wings and examined me under a looking glass. I think she’d become afraid to run electricity through me.\nAfter one of the tests, she nodded to herself. She put me in a covered box and went out to the dinghy. I heard the motor start, and we traveled for several hours. I felt the boat hit something. I felt her pick up the box and carry it along with her. We were walking. Was I on land now? The box was still covered. I could not see where we were or where we were going. My abdomen was swelling. My body was aching. I felt a heavy pain along my back.\nFrederick had tried to kill me. Now Maman was abandoning me. Was I so disgusting? For a moment, I was very angry with them. I wanted to hurt them all. Then I realized how awful I was. The reason that Fred and Maman had hated me was because I’d been such a brat about the tests and the whistle. But I swore that I’d show them they were wrong about me. I’d help every human being I saw. I’d be their best friends. I would do anything they wanted and I’d never, ever shy away or complain.\nWhen the cover was taken off the box, I was in a dark alcove, like a cupboard or shelf made of stone. Warm air washed over me. I could see a light bobbing up and down in the distance. A door opened, and I saw Maman silhouetted against the light of the sun. I tried to run to her, but I couldn’t move.\nRahul Kanakia's first book, a young adult novel entitled Enter Title Here is coming out from Disney-Hyperion in Fall '15. Additionally, he has stories appearing or forthcoming in Clarkesworld, The Indiana Review, Apex, and Nature. He holds an MFA in Creative Writing from Johns Hopkins, and a B.A. in Economics from Stanford, and used to work in the field of international development. Currently, he lives in Oakland, CA and makes his living as a freelance writer and content creation consultant."}