{"fingerprint": "glQQkDz+NfwZXmEiWAk9MD11YZs=", "sitename": "Clarkesworld Magazine", "title": "One Sister, Two Sisters, Three by James Patrick Kelly", "author": "James Patrick Kelly", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kelly_10_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: One Sister, Two Sisters, Three by James Patrick Kelly", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8570 words, novelette\n One Sister, Two Sisters, Three\n This isn’t my story—I’m nobody. It’s my sister’s. Zana is the one who got away, leaving me on this sad little world where we were born. Where I’ll die someday, as the Divine Moya wills. Moya expects us to die, each and every one. That’s her plan for those who still follow the human way.\n We were born fraternal twins, Jix and Zana, separated by thirteen minutes—one of the holy numbers. We were conceived as Moya intended, mother clinging to father, sperm seeking egg. For the first years of our lives, we were close. We danced the moons and prayed the holy numbers and taunted the boys who went to our church. Later we kissed them. Father taught us to bake the cookies that we sold to the upsider tourists from the Thousand Worlds and Mother taught us to mind the money that they paid. Ours was a family of happy wallrats, living just outside the ruins.\n But we began to drift apart in our late teens. Zana had the precise beauty that only Moya can bestow. Her ratios were near the 1.618 of the Divine’s perfection, her curls tight, and her skin had a dark luster, like the midnight of the Jagged Spike. Her high forehead set off molten brown eyes. Zana wore her feelings like a consecration crown for all to see; transparency was part of her attraction. I wasn’t plain, but compared to my sister, my features were commonplace, so I found my own way. While Zana could be shy, especially with strangers, I was forward. While she pondered the right word to say, I let my tongue do the thinking. I didn’t mind what they said about us. Zana the pretty, Jix the witty. Maybe I talked too much for some boys, as Mother used to say, but too much silence made my lips twitch. And I had my share of flings, if not as many as my sister.\n Mother got sick when we were twenty, a year after we were consecrated to Moya. We’d been so busy that season that we missed all the signs. Tourists swarmed the ruins, so that we had no time to bake the extravagant cookies that Father favored. To keep up with demand, our family churned out stacks of Sugardrops, plain but as big as saucers, with just a scatter of raisins or sweetbark to provide interest. These were not our best work, but Zana and I found uses for the extra money they brought us. I was saving for a powerbike and she wanted to learn Anglic.\n Our stall was on the Roundabout, third down from Shellgate, hard against the western wall of the ruins left by the Exotics. Tourists would pause to admire her on their way in, while I sold them our goods. Even though they were all reps who had strayed from the human way, they still had stomachs like the rest of us. An appetite for sweets and an eye for beauty remain locked in our shared genome.\n The day everything changed, a persistent tourist lingered after he’d made his purchase. His companion, a woman from the Institute who was perhaps his minder, was eager to enter the ruins. I’d have been just as happy if she’d led him away, but Zana encouraged conversation. He was handsome enough, in that ageless replicated way, but nobody I’d have wasted breath on.\n He picked up my prayer puzzle while Zana wrapped the cookies. “Ingenious.” He manipulated the magnetic triangles of the pentagram to create Moya’s central upright pentangle. “And you use this how? As a meditation prompt?”\n “It predicts how much our customers will buy.”\n “Pay no attention to her.” Zana was embarrassed when I tweaked the tourists. “It’s Moya’s sacred geometry. We use it to pray the numbers.”\n The minder sputtered something in Anglic.\n “Please—we’re guests on their world.” The tourist scowled at her. “Let’s speak their language.”\n “Sanctuary was settled by a sect called the Moyans,” repeated the minder. “For years they kept the Exotic ruins secret. They believe close contact with us leads to sin.”\n “Sin, right,” he said. “I did look through the guide you sent.” He turned to Zana. “And the purpose of these . . . ” He removed triangles to create the upside-down pentagon.\n “They remind us of the presence of the Divine,” said Zana. I was surprised when she came around the counter with his purchase. “That Moya is everywhere.”\n “The local religion.” The minder harrumphed, “A strain of humanism.”\n The tourist dismissed her with a wave. “Please, go on.” He clicked puzzle pieces absently into place—another upworlder enchanted by my sister’s beauty.\n “The Divine’s ratio is the fingerprint of Moya. It teaches us to obey her laws and be true to our mortality.” They exchanged the puzzle for his cookies. For an instant, their hands touched. “We see it everywhere in her creation. In the spiral of galaxies and in the ancient buildings within those walls.” She nodded toward the Shells, but kept her eyes on his. “The petals of a flower. Your ear.” She brushed the back of her hand against his ear. “Even your DNA.” Her voice had dropped to a purr. “Everywhere the universe is imprinted with her holy numbers.”\n I couldn’t believe that she was flirting with an upsider. “Did you know,” I said, “that a DNA molecule measures thirty-four angstroms long by twenty-one angstroms wide for each full cycle of its double helix spiral?”\n “Really?” he said, although my words meant no more to him than the chitter of streetbots, or the sigh of our awning in the breeze.\n “Eight plus thirteen is twenty-one.” I thought praying the holy numbers might distract Zana. “Thirteen plus twenty-one is thirty-four. Twenty-one plus thirty-four . . . ”\n The guide leaned closer to the rep. “They worship the Fibonacci sequence.”\n “We worship the Divine.” Zana’s expression was dreamy. “The numbers point us toward her handiwork and her expectations of us.”\n “I’m Quin,” said the tourist. “What did you say your name was?”\n “Girls!”\n I’d been so astonished by Zana’s game of seduction that I missed Father hurrying down the Roundabout.\n “Time!” He was out of breath. “It’s time . . . to close . . . up.” What was so important to bring him from his kitchen at this time of day? And what he’d said made no sense. Close? The afternoon was before us. We had stacks of cookies to sell.\n “So early?” I said. A bus from the spaceport grunted to a stop. “Take Zana if you need help. She’s not doing anything here.” Tourists fresh from the hotels poured from its open slider.\n “I want you both. Home.” His voice cracked. “Now.”\n Zana hurried back behind the stall to stack unsold cookies into an empty basket.\n “Zana, is it?” The tourist leaned over the counter. “Zana, before you go, I’d like to ask —”\n “Leave those!” Father swiped at the basket, knocking cookies to the pavement. “Leave everything. We need to go!”\n “What’s happened?” I said. “Father?”\n “Your mother.” He dragged us by the hands past the busy stalls. “You mother has lost her mind.” Zana stumbled when she glanced back at her dumbstruck tourist, but Father caught her.\n Mother sat at the kitchen table, hair loose, face drawn, hands clasped around a cup of spice tea. She liked it thick and sweet; I still smell its terrible perfume when I remember that day. She stared as if surprised to see us, as if she’d forgotten that she had daughters. Then she said “I’ve just come from the clinic. I have Hrutchma’s.”\n She never cried, not once during that long afternoon. Neither did I. At first Zana threw herself at Mother’s neck, then wept into open hands and eventually rested her head on the kitchen table, shoulders heaving. Father’s tears were hot; only later did we realize what was behind them.\n Hrutchma’s was a disease we knew well. It caused something called lymphoid hyperplasia, a crazy increase of cells in the lymph nodes. Hrutchma’s began with enlarged nodes in the chest, squeezing the lungs and stealing the breath. I’d noticed her getting winded, although she’d joked it was because Father’s cookies were making her fat. As the disease progressed, it would wreck her immune system, leading to nerve damage, infections, withering fevers. That’s how Grandmother Deel, Father’s mother, had died—raving while she burned like a fast oven. According to the medical encyclopedia on the tell, Hrutchma’s is unique to Sanctuary. Some wallrats whispered that it came from a curse the Exotics placed on the old stones, but we couldn’t let that rumor spread. Tourists put the soup in our bowls.\n I remember sinking into a chair across from Mother, trying to imagine how I would fit into a world without her. I couldn’t, in part because I was too numb, in part because I was distracted by Zana. She settled beside me, sobbing and I felt guilty that I couldn’t summon tears. And then I was puzzled by the way Father hung back. I expected that he’d be grieving too. But no—he seemed angry.\n Zana saw it too. “Father, what’s wrong?”\n “Her.” He choked on a laugh. “She is.”\n “She’s sick!” Zana swiped at her wet face. “What—you blame her?” I wonder now if she had guessed what was coming. She knew Mother better than I.\n “Hrutchma’s I can accept.” He shook his head in disgust. “The other, no.”\n “You can accept that I’ll die?” Mother’s voice was sharp as a slap. “I’m forty-one years old.”\n “I accept the will of the Divine,” he said. “You should do the same. Our daughters are consecrated to Moya.”\n She turned from him to face us. “Your father doesn’t understand.” She met our gaze without hesitation or regret. “I’m going to Skytown.”\n “To live.” Father said it like an accusation, but she ignored him. “Go ahead, lie down with their machines. Betray everything we believe. Just remember—never come back to us.”\n “You’re going to upload,” said Zana. “Become a rep.”\n Mother shivered as if Zana had said something that she hadn’t yet realized. Then she nodded. “I’m not ready to die.”\n She left the next day.\n Father never spoke of her again. If anyone dared mention her, he’d withdraw, sometimes for days. He was a fool to think that his silence could erase her from our lives. All of our communion knew the shame she’d brought on our family and our church. Whenever Speaker Elb preached about straying from Moya’s way, of losing our humanity, everyone thought of her. I know I did. For months afterward, I was obsessed with her. I had nightmares about her ravaged and discarded body—where was it now? And what to make of the stranger who knew everything about our home, our family—about me? We’d been taught there was no real continuity of life between a human and the rep body created by the technology of the Thousand Worlds. The Divine taught that my mother was truly dead. But then who was the creature who lived in Skytown, the upsiders’ enclave on Sanctuary? Who still claimed to love me?\n I knew this because she tried to stay in contact with us, or at least with Zana and me. Zana showed me her first message, but I couldn’t finish reading it. However, Zana wrote back, despite Speaker Elb’s warning that our false mother would tempt her to sin. I had no idea how often they talked because I didn’t want to know. However, my sister insisted on telling me how she was doing.\n After her replication, Mother had found work as a janitor at the Institute of Exotic Archeology. She shared an apartment with three other roommates including her old friend Xeni Bluereed, who had left our communion three years ago to be replicated. Zana claimed there was a growing community of people like Mother and Xeni beginning new lives among the upsiders. Later, she got a job in a Skytown restaurant as a cook, which was ironic because the kitchen had always been Father’s domain. Mother’s new position paid well and I suspect that she sent Zana some of her wages, although I never saw any. But apparently Mother had money enough to visit the orbital and to buy a bot. She thought about us all the time, according to Zana, and yet supposedly she was happy. Although I envied her the luxuries of Skytown, I couldn’t imagine how that could be.\n Moya does not demand that we reject all upsider technologies, only those which make us less human. Yes, I’d own a bot and a printer and a car if I could afford them. I’d sample the drugs that make you stronger or smarter or happier. But Sanctuary is an exhausted world. That’s why our ancestors were able to claim it for the Divine. The Exotics had used Sanctuary up long ago, and their leavings are the last valuable things on it. We scratch a living from their dust. And while we’re proud of our ruins, there are other examples of the Exotics’ architecture scattered throughout the galaxy.\n As the months passed, our broken family adjusted to our new life. The press of tourists varied with the seasons, but we did well enough, especially now that there were only three of us. I bought my powerbike and a trailer to go with it. Not only did Zana get her Anglic lessons, she then paid for access to the Institute’s databanks, so that she could learn more about the Thousand Worlds. Her new language skills paid off in an unexpected way. Word spread through the hotels of the beautiful girl selling baked goods who could speak the common tongue. Tourists flocked to witness this marvel. They helped Zana with her accent until they claimed she could announce the news on Ravi’s Prize itself—not that either of us believed that. Of course, I understood not a word of their chatter, and when they dissolved into laughter I suspected that the joke was on me.\n Then Quin came back. Except, as it turned out, he’d never left.\n I was alone at the stall, which meant that, for a change, my view of the street wasn’t blocked by Zana’s admirers when I spotted Quin wandering along the Roundabout. It had been almost half a year, but I knew him as soon as I saw him. He paused at Twial’s stall, picked up a reproduction of Half Boat to check the price and then replaced it with a frown. He browsed Glif’s gaudy umbrellas and the new scent store, then walked faster as he got closer. He passed our stall with eyes down, as if scanning for cracks on the pavement. It was obvious that he was ignoring me. But then he stopped abruptly in the middle of the street, glanced past me to the blackened hulk of the Jagged Spike, and strode up to the counter.\n “You’re Jix.” He tried on a smile that didn’t quite fit.\n I agreed that I was.\n He reached for our most expensive cookie. “And this is a Brownbutter Velvet Block.”\n “With a ginger smear.”\n “Cut into a precise rectangle.” He held it to the light to examine it. “I’ve been studying your religion. Would I be right to say that the ratio of the length to the width is 1.618?” He seemed proud of himself for this guess.\n “I recommend that you buy at least two.”\n This wasn’t the reply he’d been expecting. He nodded, frowning.\n “Will there be something else?” I asked.\n “I know your mother. She used to work at the Institute.”\n “Really?” I wrapped two Velvet Blocks in takeout paper. “Did she send you?”\n “No.” He was surprised at the question. “I’m an archeologist, doing research on your Shells.”\n “They’re not mine.” I supposed he wanted me to ask about Mother. I handed him his purchase. “Three-fifty.”\n Instead of completing the transaction using our tell like every other tourist, he reached into his pocket and pulled out a handful of Moyan chits.\n “I like your money.” He fumbled for the exact change. “There’s so much of it.”\n “I like it too.” I rarely handled chits at the stall; only Moyans carry them and Moyans bake their own cookies. He watched me slip them into my pocket. Then I gave him his purchase and waited. He made no move to leave. I remembered then how he had lingered that awful day. “Maybe you were expecting to find someone else here?”\n “Zana, yes.” He blinked. “But I had no expectations.”\n “I’m sorry to hear that. Expectations are what get me through the day.” I spotted Zana headed up the street carrying a basket of cookies from home. “I like to guess what will happen next.”\n “You had a prayer puzzle,” he said. “May I see it?”\n Surprised that he remembered, I opened my bag and offered it to him.\n “Yes.” He pushed the magnetized shapes into new configurations with practiced motions. “It’s very definite, your religion. Did you know that the star polygon is one of the oldest symbols we have. From Earth, you know, the home world. It represented the sacred feminine as long ago as 4000 BCE.”\n “Really?” Of course he would condescend to a nobody; he was a tourist. Was common courtesy a trait that the upsiders’ technology couldn’t replicate?\n “So the so-called Golden Ratio . . . ” He was oblivious. “A fascinating mix of tradition and math. Take this pentagon and connect the vertices and you get a pentagram, a five sided star.” He pushed puzzle pieces. “Five is in the Fibonacci sequence. And the ratio of any diagonal of the star to any side of the pentagon is 1.618. Phi, the Golden Ratio. And you see it again here . . . . ” He fitted pieces into new configurations. “And here.” He drew a line with his forefinger; his nails clicked against the metal. “And you were saying how often the Golden Ratio occurs in the natural world. There’s actually support for that in the literature.”\n “We call it the Divine’s Ratio,” I said. “And it was actually my sister who was explaining that. Isn’t that right, Zana?”\n Quin started as she set her basket on the counter.\n “You remember Quin,” I said to her. “Turns out he’s from the Institute. An archeologist. And he knows Mother.”\n The looks they exchanged were not those of strangers.\n “So this isn’t news to you?” I reached for the basket to sort the new cookies she’d brought. “Are we keeping secrets now, sister?”\n “Oh, no secret,” said Quin. “We started exchanging messages what . . . ? Three months ago. I’d like to think we’ve become friends.”\n “Just over two months.” Zana was embarrassed. “And we’ve only met in person a couple of times.”\n “Which is why I thought to surprise you.” Quin seemed pleased with himself.\n “And did he tell you that he’s been studying our religion?” I replenished our supply of Shortbread Swaddled Truffles. “Perhaps you’re thinking of converting, Quin?” I wanted to see her squirm for keeping this from me.\n “No.” He set my prayer puzzle down as if it might burn him. “Not at all.”\n “It would be awkward, seeing as how you’re no longer in your first body. How many times have you been replicated, if you don’t mind my asking?\n “He does mind.” Zana’s cheeks colored. “That’s rude, Jix.”\n “Oh, sorry.” I bowed twice for good measure. “Sorry, Quin. It’s just that we get so few of your people taking an interest in us.”\n Quin blinked at us, as if he was having trouble following our conversation. “In any event,” he said to Zana, “I was just wondering when . . . if maybe . . . would you like to take that tour sometime? The one we were talking about.”\n “Tour?” I said.\n He glanced at me then nodded toward Shellgate. “I know you’ve lived here all your lives, but I have access to the monuments, even those that are closed. I could show you things that very few people have seen.”\n Zana shot me a stare that said I wasn’t invited. I let it bounce off me.\n “Zana and I are working girls,” I said. “We have tourists to feed, cookies to sell.”\n He nodded. “Shellgate closes at five. Don’t all the tourists leave for the hotels then? We could go after hours; I have unlimited access, you know. It stays light until almost eight.”\n “Great.” I held up the empty cookie basket and smiled at him. “We could pack a picnic dinner.”\n Zana wasn’t amused.\n “Father would explode if he knew you were seeing a rep.”\n “I’m not seeing him.” Zana was a darkness on the shadowy bed across the room. “He’s a friend, that’s all. And it’s all been messaging until recently.”\n “Except now you’re making dates to tour the ruins.”\n It was always sweltering in our house because of the ovens, even late at night after Father shut them down. In the summer Zana and I would sprawl on our beds, sweat prickling our skin. Most nights we kicked the sheets off, sometimes it was too hot for clothes. Unable to sleep, we’d talk of boys and dreams in the dank gloom, our conversation flickering like a candle.\n “He’s going to show you things nobody has seen.” I chuckled. “Where have I heard that joke before? He’s the tourist and you’re the baker’s beautiful daughter.”\n “That’s not what this is. Besides, now you’re coming too, even though nobody asked you.”\n “I’m only going to make sure that you don’t do anything stupid.” We never kept our flings a secret from one another, so this Quin worried me. “Okay, so maybe he’s not a tourist, but he’s not here to stay.” Zana was my twin, and even if we weren’t playmates anymore, she was the only one in our family I was close to. The silence was tickled by the scratch of slinks running up the walls and across the floor. In the warm weather the lizards stayed active at night, scavenging for crumbs and squeezing into the chinks in our stone walls.\n “You don’t think I can handle him?” said Zana. “I’m twenty-one years old.”\n “And he’s two hundred years old. Or maybe two thousand.”\n “Oh, stop it.”\n “He works for the Institute, Zana. You go squirting through wormholes for a living, you’ve got to allow for time dilation. People like him replicate what . . . ? Five, six times at least.”\n I heard her torturing her pillow into a new shape, but neither of us found much comfort that night.\n “He’s definitely got a look,” I said. “I understand the attraction.”\n The slats beneath her mattress creaked when she sat up. “You know the problem with living at home?” She was silhouetted against the window, her bare back to me. “I can never get away from you two.”\n “That’s not fair. When you bring a boy home, don’t I give you the room? Just like when I was with Bibby, you got scarce. And Father hasn’t a clue who we’ve had in here.”\n Silence.\n “I watch for you and you watch for me, remember? That’s what sisters do.”\n She gave an unhappy grumble.\n “But if sex is what you want, why not fuck a human? Moya knows, you can have your choice.”\n I ducked as her pillow sailed across the room.\n We didn’t pack cookies for the picnic. When you bake for a living, you lose the taste. Instead we brought salted cutthroat from the river and pickled figs. A cold squash soup. A round of cheese and a bottle of fay brandy. Quin insisted on carrying it at first, even though Zana and I had spent most of our lives lugging heavy baskets of fruit and flour and oils and spices.\n I couldn’t help but envy the way the tell built into his fingernail synced with the Institute’s security at Shellgate. A wave of his hand, and the projectors went dark; as soon as we passed through, solid blue light once again barred the entryway. I’d never seen communication tech that small. For a moment, Quin seemed magical.\n The ruins were part of our neighborhood, even though they were run by the Institute. We were threading our way around broken buildings back when we were toddlers. But that night, it was as if we’d stepped from Sanctuary onto one of the Thousand Worlds. We knew the structures by the names the first settlers had given them, but Quin identified the Grandmother Stones as Boundary Markers 11n through 11t. He explained that Half Boat and the Jagged Spike were part of a complex he called the Western Quadrant Early Classic Superstructure. When we insisted that Ellipsoidal Buildings 43, 58, and 70 were properly Bird Shell, Crazy Shell and the Bride, he chuckled. Giving commonplace names was how people coped with their terror of the alien, he claimed. A way of pretending we understood the civilization of the mighty Exotics.\n He had a talent for annoying me. “Maybe,” I said, “assigning them numbers is your way of coping.”\n Zana shot me a look but Quin nodded, as if considering what I’d said. “You may be right. Numbering the world is what we humans do, isn’t it?” We were standing on a parapet called Frost’s Overlook, gazing down at the three Shells. “They’re not buildings, you know. They’re sculptures.”\n “Sculptures?” I said. “Of what?”\n “We see similar construction in several other ruins. I stopped at Destination and Kenning before I came here. I’m certain that your Shells were never occupied. Nor were they even functional. My research leads me to the idea that they’re propaganda art on a monumental scale, like Ravi’s Tomb or the Lubinarium.”\n “The Statue of Liberty on Earth,” said Zana. This took me by surprise. Why was she learning trivia about that dead planet?\n “Not familiar with that one.” Quin hefted the picnic basket. “Most scholars claim that Ellipsoidal Sculptures are Post Classic, but I believe they’re actually from the end of the Persistent Era, just before the last of the Exotics disappeared.”\n “Sculptures of what?” I repeated. “And what kind of propaganda?”\n “I’ve heard that’s a particularly interesting view.” He aimed his chin at the opening at the top of the Bride. “Eat up there?”\n As we scuttled down the rubble-strewn grade, he told us about his work. Nobody knew what had become of the Exotics. The galaxy-wide culture that built the wormholes vanished between fifty and sixty thousand years ago. Judging from their enigmatic ruins, Exotic civilization had begun to hollow out in its Post Classic Era, which was followed by the long decline of the Persistent Era. Quin believed that Sanctuary’s shells might have been among the last things the Exotics ever built.\n The wind had died in the dusk and the sun-baked façade of the Crazy Shell radiated heat as we passed on the way to the Bride. “I think these shells were meant to persuade the Persistents who remained behind to follow their ancestors.” Quin set the basket down on the stump of a pillar and wiped sweat from his eyes. “Maybe to shame them into it because Exotic culture had moved on. What were they waiting for?” He’d been talking non-stop and was out of breath.\n I was enjoying the effect our summer heat had on this overconfident upsider. “This is the theory that says they all uploaded and went to where? Exotic toyland?”\n “The evidence does point to a massive departure over a very short time, with a longer period of stragglers hanging on. Some claim there was a mass suicide but yes, I’d like to think they went elsewhere. Maybe to somewhere else in our universe or to some designed reality.”\n Zana hefted the picnic basket. “I can’t imagine anyone could get bored sailing through wormholes.”\n He pretended not to notice that she was relieving him. “Not sure they got bored. One thing is certain, they were very tidy. They took great pains to erase themselves from their worlds.” He tugged at his shirt where it had stuck to his chest. “All their ruins are built of native materials, mostly stone and ceramics. Some metals. We’re pretty sure that no Exotics lived in them, but then we have no idea where they did live. We know nothing of what they looked like, their biology, what they believed. Were these structures ceremonial? Administrative? Religious?”\n “And this bothers you?” I asked. “Why? Because it’s not fair to archeologists?”\n “They might’ve done better by us.” He grinned. “I’d like to think there are answers out there, but maybe I’m just fooling myself.”\n Father said that before the Institute took over the ruins, Moyans had tried to clean them up: restacking stones, filling holes, pulling weeds, and cutting brush. The upsiders had stopped all reconstruction and limited public access to a handful of the structures. They said it was to preserve the archeological record; wallrats said it was to drive customers away. Whatever the truth, navigating the ruins was a challenge. The footing was uncertain, and the direct path to any given destination was often blocked.\n “So what does Moya . . . ” Quin was laboring again as we reached the base of the Bride. “ . . . have to say . . . to all of this?”\n “It’s not for us to know Moya’s mind.” Zana vaulted onto the fallen slab in front of the crude entrance someone had chiseled into the Bride.\n “Come on,” I said. “It’s obvious the Exotics knew the Divine’s ratio.”\n “Did they?”\n “Just look.” I gestured at the white whorls carved into the casing stones on the wall above us.\n “I suppose.” He gathered himself for the scramble. “It’s math, after all. But you Moyans . . . you see your ratio everywhere.”\n I offered a hand to help him up. “Don’t you?”\n He reached for me and missed. “I lack your stamina.” I caught his damp wrist and boosted him to my side.\n After he’d caught his breath, Quin insisted on telling us that the white limestone façade of the Bride had been quarried from Kunlun’s Crease, even though everyone knew this. The Bride resembled the Ivory Snails some wallrats harvested from the river for soup. The ones that tasted like dirty socks. The difference was that the Bride was enormous—some thirty meters tall—and was upside down. The mouth of the shell pointed up at the sky. We ducked through the makeshift entrance into the interior. The air was dank here and smelled like the inside of a well. A wooden scaffold climbed to the light. We crunched across a floor littered with broken tiles that had fallen off the walls, each decorated with a tessellated spiral flower pattern. Some wallrats believed that if you found an intact tile, whoever you gave it to would fall in love with you. Unfortunately, undamaged tiles were hard to come by since the ban on removing artifacts from the ruins. However, the Naras did a brisk trade in reproductions from their stall near Rivergate.\n I bent to retrieve a shard and showed it to Quin. It was hard to see detail in the feeble light from the opening above us, so he lit his fingernail.\n “The Divine’s ratio.” I traced several shapes. “In case you’re still in doubt about what the Exotics knew.”\n “Yes.” He waved his nail off. “That claim has been made. But it’s not quite 1.618, is it?”\n I bristled and let it fall to the floor. “So close you can hardly tell the difference.”\n “Right,” he said. “Especially in the dark.”\n “Quin likes to scoff,” said Zana. “Best to ignore him when he gets like that.”\n “Sorry,” he said. “Your sister has been teaching me manners, but I’m afraid I’m not much of a student.”\n I prayed the numbers while we climbed to calm myself. One, one, two, three, five, eight, thirteen, twenty-one, thirty-four, fifty-five . . . . By the time I got to seventeen thousand, seven hundred and eleven I was feeling more like myself. Quin heaved himself up the first two ladders in succession, but after that he had to rest on each platform. He took longer to recover the higher we went until he collapsed onto the tenth stage, gasping and as damp as if we had pulled him from the river. The planking was slick with mildew from exposure to the weather and left a smudge on Quin’s pants. Zana worried over him, but he reassured us that he was exhausted only because his last replication had been on a world where the gravity was 0.68 that of Sanctuary. “And I’m not good with heights,” he added.\n He revived once we climbed the last ladder to the wide stone lip at the top of the Shell. While Zana sat him down so the two of them could unpack our meal, I walked out to the edge and the view. It had been years since I’d made this climb. The shadowy ruins sprawled at my feet while the lights of our little village twinkled in the middle distance. Skytown was a glow on the horizon. Although the air was warmer up here, it was a relief from the sticky interior of the Bride. I took a deep breath and felt blessed to be able to take in my whole world at a glance.\n Zana was murmuring to Quin. I couldn’t make out what she was saying, but there was a note to her voice, at once innocent and earnest and tender, that made me shudder.\n What if this was more than a fling?\n Quin thought the cutthroat tasted too fishy but he raved about the pickled figs and asked to take a sample of Father’s squash soup for gastronomical analysis. He said the cheese was better than the framenthakler that the data monks on Encyclopedia printed from their secret recipe. We talked a lot about food. Zana pumped him for his favorite dishes but I knew she was more interested in hearing stories about the Thousand Worlds than she was learning about upsider cooking. He said that most reps preferred printed food, of which there was an infinite variety. Those who traveled the wormholes took little interest in local culture, but were passionately invested in trying the latest cuisines.\n “Nobody much cares about books and songs,” he said. “What sells on the upside are new menus.” He waved our brandy bottle at the sky. “Come up with a fresh taste with a new smell and you can write your own ticket to the stars.” When he offered me a refill, I covered my cup with my hand. “Take your cookies, for example. With the right marketing, they might pay your way off Sanctuary.”\n I waited for Zana to point out that we had no plans to leave home. She didn’t, so neither did I.\n I expected Quin would continue to do most of the talking, but he wanted to hear about us, or at least Zana. He asked about our schools and what we’d been told about the upside. Zana talked about what she’d learned using the Institute’s portal; he said it had good access but was by no means complete. He wondered what we thought about the controversies that flared continually between the wallrats and the Institute over management of the ruins. Then he got us telling stories about dumb things that tourists did.\n “I don’t understand why they need to haggle,” I said, “after what they spend to get here. We’d have to move a mountain of cookies just to get to the orbital.”\n “So we let them talk our prices down . . . ” Zana giggled, “ . . . and we then make up the difference in tax.”\n “Only there is no tax.”\n “Sure there is,” I said. “Stupidity tax.”\n We were all laughing now as Zana filled our cups with the last of the brandy.\n “Then there was that buzzy woman who wanted to buy all our takeout paper. Where was she from?”\n “She said it tasted better than our cookies.”\n “And then they ask the dumbest questions about the Divine’s ratio.”\n That earned me a sisterly glare until Quin raised his hand. “Guilty.”\n I didn’t want to start liking him, so I said, “You don’t believe in the Divine, do you?”\n When Zana hissed, it sounded like a seam ripping.\n “You know I don’t,” he said.\n Nobody was laughing now.\n “Or any god,” I said.\n Quin studied me. His silence was scary.\n “Why not?” I asked.\n “Jix!” Zana came to her knees, but I knew she wanted to hear his answer.\n “Have you ever heard of the God spot, Jix?” said Quin.\n “Doesn’t exist.” Zana said, as if to end the conversation.\n “No,” I said. “What is it?”\n “People used to look for the place in our brains where mystical experiences come from. Some tagged the right parietal lobe, others the dorsolateral prefrontal cortex. There was evidence that N,N-dimethyltryptamine levels in the pineal gland play a role. But over time they realized they’d got it wrong, and so they developed a different model. There’s no button in the brain that you push for instant spirituality. The neural correlates are scattered across the entire brain, systems that give rise to self-awareness, emotion, your sense of your own body.” He fumbled at the pocket of the shirt he was wearing. “And what’s interesting is that in order to have a religious experience, you don’t stimulate these brain systems.” He shook his head. “You suppress them. Inhibit those areas that create the illusion of self, and you open the door to transcendence.”\n “So?” I said.\n He pulled a pressure syringe from his pocket and showed it to us. “Want to see Moya?”\n Sometimes I wonder if Zana had poured our futures from a bottle of fay brandy. How could two drunken sisters hope to protect one another? Or maybe I was daring my sister even as she was daring me in some alcohol-fueled dance of sibling rivalry? Or it was simply that we each were trying to impress her upsider, in our own ways and for our own reasons?\n The syringe looked like a glass thumb, cylindrical but with a flat applicator pad to one side. “This won’t take long.” Quin pressed the syringe to the artery in Zana’s neck. “Say fifteen minutes to work past the blood-brain barrier.” The syringe left a faint pink swelling. “The actual experience comes and goes. Maybe five minutes, although it might feel longer subjectively.” He turned to me. “But everyone’s different. Some people feel like they’ve disappeared, some become one with everything.”\n I tilted my head. “And is it real?” The injection felt like being kissed on the neck.\n He laughed. “That’s for you to decide.” He injected himself last, then tucked the syringe back into his pocket.\n “You planned this,” said Zana.\n “We’ve talked about it,” he said, “haven’t we?”\n “I never said yes.”\n He smirked. “You just did.”\n “So what do we do now?” I said.\n He sat on the stone pavers facing the view and crossed his legs. “We wait for the elevator.”\n We arranged ourselves into a triangle and watched each other for signs. Zana settled back onto her heels. Her back was straight and she sniffed, nose pointed, as if she might catch Moya’s scent. I squirmed on the cold, hard floor. The silence made me more self-conscious, not less. Was my heart in the right place? Would this change my life? What was I supposed to do with my hands?\n Quin seemed to be enjoying himself. “I never asked you about boyfriends,” he said to distract us. “I’ll bet you both have plenty.”\n “Zana does.” I was relieved to hear the sound of my own voice. “She gets her share and half of mine.”\n “That’s not true.” She frowned. “You do well enough.”\n “They say I talk too much.”\n “Boneheads.” He patted my arm. “Stick with men as smart as you.”\n “And you?” said Zana. “You have people you care about?”\n “Yes and no.” He paused, deciding how much to say. “When you get replicated, relationships sometimes fall apart. You’re you, but now you’re somebody else as well. The body is different for one thing, sometimes very different. It wants what it wants. That old you, he’s like someone you read about. It was a really interesting book, and you remember vivid scenes, but you’ve read that last page.”\n “What’s it like?” I asked. “Being replicated.”\n “Like dying, only you wake up afterwards.”\n “You’ve died?” I shouldn’t have been surprised, but I was.\n “Every time,” he said, as if he was discussing a splinter. “Of course in a direct transfer you’re not dead very long. But these days they can still rep someone thirty minutes after cardiac and respiratory arrest with minimal information loss. After thirty, the brain really deteriorates. Something about ischemic injury.” He shivered in the heat. “So yes, Zana knows this already but I was in a flier crash that killed me just before I came here. Nobody’s fault, really. I was with someone I loved, but he didn’t make it. Rescue took too long to get to us. They say my rep was only ninety-six percent accurate. It was very sad, because I’d probably still be with him if his replication had been successful too.”\n Zana took his hand in hers.\n “So I’m still learning to be this new Quin in this new body.” His mouth smiled, but his eyes were sad. “But that’s what we all do, isn’t it?”\n When I saw that look on my sister’s face, one I’d never seen before, I knew that I’d been right to worry about this upsider. The love she felt for him glimmered from her perfect ratios, Moya’s gifts to her. The length of Zana’s face divided by its width. 1.618. Her smile divided by the width of her nose. 1.618. The width of her nose to the space between her nostrils. 1.618.\n I was so focused on my sister that I didn’t realize Quin was still talking until he said, “I’d do anything for you.”\n Zana shut her eyes. Was it imagination that they were so tight that they quivered? When she opened them she was staring at nobody, and 1.618 was Divinely revealed in the width of her eye divided by the width of her iris.\n “Don’t.” She stood—to get away from her lover? Or from Moya, who had made her in her image and likeness? The Divine was the reason that her height was 1.618 of the distance between her beautiful navel and her flawless hair. The holy numbers began praying themselves, one plus one sisters, two sisters, three, five, eight . . .\n Quin struggled to his feet and caught her in an embrace, spouting a stream of ardent and unintelligible Anglic. She replied in kind, only her voice was in ruins. More Anglic nonsense and more and then they were shouting. The argument made her so angry that she pulled away from him. His arm dangled and he shook it as if it had fallen asleep but it was too long, too long, his proportions were all wrong. When his fingers curled into a fist, that one nail glowed a sleepy, magical purple.\n Nobody said, “Speak Moyan!”\n Zana heard. “I do want that, yes, all of it, but I can’t.” She was crying. “It’s a sin. And how can I leave them?”\n “They can come too,” Quin said. “I’ll pay for the replication.”\n “Rep Father?” Her laugh turned sour, and her mouth twisted, and her ratios skewed. “I love you, Quin, but . . . ”\n Love, the voice said to nobody. Thirteen, twenty-one, thirty-four. She loves him.\n “Jix, what are you doing?” The upsider wasn’t condescending now. “Get away from her, Jix.” Who was he talking to?\n The voice was as cruel as stone, as sad as the wind. Fifty-five, eighty-nine, one hundred and forty-four.\n “Stop.” Zana tried to twist away, but she wasn’t fast enough. “No!”\n And then she was falling, perfect arms flailing, scream slashing the night. On her way to the Thousand Worlds. The truth is that nobody pushed Zana Ferenc to her death from the stone lip of the Bride.\n “Call rescue now,” said nobody. “You only have half an hour.”\n I hadn’t expected Mother to be beautiful. She was an only child but the rep they’d given her looked like some younger, sunnier sister. She reminded me of my own sister, the one I no longer had according to Father. She stood aside and smiled me into her apartment. The room felt deliciously cool after the hike from the church, like cannonballing into the river on a summer afternoon. This must be the air-conditioning we’d heard about.\n There were no real windows but the entire rear wall was a live image of the ruins as seen from Kai’s Chair. Our village peeked from the far corner.\n “Xeni and the others are out,” said Mother. “It’s just us.”\n “Xeni,” I said. “She’s your roommate, right?” I paused in the center of what was apparently just a sitting room. Two doors to my left, one to my right, the hall behind. Walls as blue as an egg. Mysterious light from the ceiling. I stared but saw nothing. I had so much to say, to ask, and I was tongue-tied.\n “I like your couch.” It was a silly thing to say, but it was all I could come up with. The couch was L shaped and covered with a ridged red fabric. I tried to estimate its cost in cookies as I ran a finger along the outside arm. The material was warm and felt like skin.\n “Sit for a minute.” Mother patted the back of the couch where she wanted me. “I’ll be right back.”\n I was so miserable that I considered running away as she passed from the room. But I couldn’t take another step carrying the weight of all those sleepless nights. I needed someone to talk to, so I sat. Mist curled from the vaporizer on the low table in front of me. I sniffed, some kind of ambient drug. It smelled green. Mounted on the wall was an antique bicycle wheel, rust eating through the chrome, the tread on the tire worn to a shiny black.\n “Xeni’s.” Mother returned, carrying a tray. “She races. Apparently that wheel was on some bike that won Omeo’s Climb, back who knows when.”\n She put the tray on the table and settled beside me. I glanced from it to her. “Am I staying?”\n “If you want.”\n She’d made my favorite treats: bittersweet clusters, cheese and figs on skewers, pickled cob, salami with tiny crowns of mustard.\n I reached for the bittersweets. “What, no cookies?”\n She had a way of snorting and laughing at the same time. “That’s your father’s specialty.” Hearing that intimate sound that only she could make carried me back to a sunny memory of the four of us on our boat on the river, Father rowing us home from church and Mother laughing as Zana and I pulled snack treasures from the picnic basket.\n “How is he?” said Mother.\n And then I was back in an apartment in Skytown, and our little family was in ruins. “Bitter,” I said. “I had to move out. I’m living in the church for now.”\n “It was past time, I think. You needed to be on your own.” She frowned. “But the church?”\n “Nobody knows what happened that night,” I said. “Nobody in the village, that is. They think it was an accident.” My tongue felt like a brick. “But you know.”\n She nodded.\n The silence stretched so tight, I thought I might snap. “I like your place.” Why was everything that came out of my mouth so trite?\n “You never visited.”\n “No. Sorry.” This was a reproach I’d feared, but somehow it wasn’t as awful as I’d thought it would be. “That was wrong.” Mother had every right to blame me; I didn’t know what I was doing or who I was anymore. “Did Zana?”\n Mother spoke an order in Anglic. I’d been taking lessons and picked up something about a holiday or a birthday. Then the wall displayed a picture of Mother and Zana sitting on the couch just as we were and with practically the same snacks in front. This was the Zana I knew, my sister. Not the other, the rep I’d never seen.\n “Did she say anything after she was repped?” I said. “About me, I mean?”\n “Not much.” Mother spoke as if she were tiptoeing around broken glass. “She didn’t know why you did it.”\n I should’ve said something—Mother expected me to. But I was back on the Bride, seeing it all again for the millionth time and still not understanding. I’d heard Moya’s voice, so how could I have sinned?\n “She left the orbital yesterday,” she said. “Should arrive at the wormhole’s insertion point next Friday.”\n “But no message? Nothing?”\n She sighed. “They say that a rep’s most vivid memories are her last moments. For me, it was just fog, but then I was a direct transfer. They put me to sleep, I died, they woke me up. But somewhere in between, I remember wrestling with . . . well, like I said. Fog.” She waved the mist wafting from the vaporizer toward her and breathed deeply. “It was like swimming, almost drowning, and I needed to stay upright except my feet kept sinking and I couldn’t pull free and it . . . it took a while, is all. I was ready for it to stop.” She shook her head as if to part that remembered fog. “Zana’s memories were more painful, I guess.”\n “I’m sorry.” I felt my throat close. How many messages had I sent my sister apologizing every which way I could think of? None of which she answered.\n Then I was crying, hot tears, choking sobs.\n Mother patted my arm. “I think she knows.”\n But it wasn’t only for my sister that I cried. I wept for Mother and Father and the life we all had lost. And for Moya, who answered to an upsider drug.\n I finally got myself under control. “He was telling us that he died in a flier crash,” I swiped at my eyes. “Quin, that night. So at least he knew what she went through. Maybe that was a help.”\n “I hope so.” She picked up a round of salami and examined it critically. “I didn’t like him at first. Too much the upsider, always talking about how we’ll have to give up our ways and become citizens of the Thousand Worlds. I think what he really wants is to chase down his Exotics, and go live with them.” The tip of her tongue licked the mustard crown and then she nibbled an edge the way she always did. “But he did right by her, paid her way to Ravi’s Prize. Says he’ll follow her there after he finishes his research. We’ll see. I think he means well.”\n “Is there a picture of her?” I said. “After, I mean.”\n She spoke in Anglic again. I recognized daughter.\n A woman stared at me from Mother’s wall—not quite a stranger. Her eyes were as deep as the night sky, just as I remembered her. But she had an ungodly pale complexion and her hair was cropped too short and the proportions of her face were all wrong. My breath caught when I realized that she looked more like me than herself. My twin.\n “I hope,” I said, “she’ll be happy someday.”\n “Yes,” said Mother. “I pray the numbers that she will.”\n James Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine."}