{"fingerprint": "W8sb6yFZUys6vpbXa41PXgU/HyY=", "sitename": "Clarkesworld Magazine", "title": "Soulcatcher by James Patrick Kelly", "author": "James Patrick Kelly", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kelly_05_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Soulcatcher by James Patrick Kelly", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3110 words, short story\nSoulcatcher\nAfter years of planning and scheming, of deals honest and not, of sleepless nights of rage and cool days of calculation, Klary’s moment arrives when xeni-Harvel Asher, the ambassador from the Four Worlds, enters her gallery.\nAs a concession to local xenophobia, the xeni is embodied as a human male. Of course, he is beautiful. Some liken the xeni to the faeries of Earth legend, their charisma so intoxicating that, at the merest nod, a groom will walk away from his new bride, a mother will abandon her infant. Is it telepathy? Pheromones? The lure of great wealth and power? No matter. Klary has steeled herself against the xeni’s insidious power. Ever since the Ambassador made planetfall, Klary has been on a regimen of emotion suppressants. Not that she really needs them. After xeni-Harvel Asher ruined her life, Klary has had just one emotion. No chemistry can defeat it.\nHer hopeless assistant Elloran makes a fool of himself groveling before the xeni. Klary slips behind a display case protecting a cascading sculpture of lace and leather and spun sugar. She is content for now to study her prey. The xeni is slight, almost childlike, but he commands the room with eyes as big as Klary’s fists, a smile brimming with wide teeth. Slender hands emerge from the drooping sleeves of his midnight jacket. His fingers are delicate enough to pluck the strings of a harp—or a woman’s heart.\n“Here at Hamashy’s Fine Textiles we have the best collection . . . ” Elloran is talking too fast.\n“Yes, this one is sure you do.” Asher cuts him off. “This one would speak with the owner now?”\nWhich means it’s time. But when Klary steps from her hiding place, she sees that her plan is going hideously awry. Dear, beloved, lost Janary, clone sister of her sibling batch, has followed her abductor into her gallery.\nEven though it has been fourteen years since they last saw each other, even though she has lost her name, her face, and her innocence, Janary knows her as her sister. How could she not? Her frightened stare pricks Klary’s shriveled heart. All is lost. Yes, a reunion was part of her plan, but that was for later. After this was over. Will she give Klary up? Can Janary even guess what her sister plans to do? But there is no turning back.\n“Ambassador.” Klary steps forward and bows. “You honor me. I am Klary Hamashy.” Despite the suppressants, she braces herself against the xeni’s fierce regard. It’s like leaning into a headwind. “Welcome, sir.”\nXeni-Harvel Asher inclines his head. “This one has heard tell of the local rug merchant, Friend Klary.” She is not sure whether he intends this as a slight. Hamashy Gallery sells native and off-world carpets, yes, but it’s no rug shop. Klary is too busy trying not to goggle at Janary to take offense. She has not changed since the xeni lured her away from their ancestral commune. Bitter years have aged Klary and she has taken steps to smudge her appearance, but Janary is still as striking as Klary once was. She has the rust-brown curls framing pale features of their genetic line. She wears a high-necked white gown, perhaps to satisfy some ancient bridal fetish. Her sister shows no signs of anger or sadness as she shies behind the Ambassador, as if she is afraid of Klary. Has she accepted her humiliation? Embraced it? Unthinkable. Klary tries to imagine herself in Janary’s place as her sister catches up the decorative glass chain that dangles from the choker around her neck.\n“What?” Asher notices her. “She won’t hurt you.”\nWithout a word, Janary presses the end of her chain into his hand.\n“One never knows what bothers the pet.” Xeni-Harvel Asher does not apologize. “It’s been skittish today.”\nKlary wants to yank the chain away, crush it in her bare hand until shards of broken glass bite her. “Not to worry,” she says. She addresses the xeni, not her sister. “She is safe in this place.”\n“A pleasant enough shop.” He gestures at the racks and display cases, the hangings and the shelves that line the walls. “Might one find a present for a good friend here? A unique present, perhaps?”\nKlary’s smile is tight. She knows why the xeni is here. Klary has paid an outrageous price to bait the trap, has discreetly encouraged the rumors about her illegal acquisition. But she must not rush; there is a scene to play before the final act. “Let me show you my treasures.” She tries to gesture for Elloran to peel Janary away, but her assistant is useless. Tomorrow Klary will fire him—if there is a tomorrow.\nThe xeni is not impressed with the life-sized nylon nudes wrapped around moveable skeletons nor does he appreciate the remarkable properties of nylon. “It’s semi-translucent,” says Klary, “so several layers of differently colored nylon produce the subtle skin tones. See how the artist’s needle modeling suggests wrinkles about the eyes?” Nor does he care for bowls made of taut coiled snuro or the hanging of cloth beads arrayed on glow-wires. He passes Tuktuk’s mixed-media tensioned fabric sculptures without comment. Klary stubbornly describes a French tapestry from the twenty-second century. “Notice the classic border filled with floral bouquets and architectural scrollwork, around very fine floating landscape scenes from old Earth. Depictions of Oriental life with courtiers seated on motorcycles, and see here, plants, birds, zombies . . . ” But Asher has already moved on, past an area carpet in the Tabriz style by master weaver Kumanen and the chain mail business suits; Klary hurries to catch up.\nHe flips through Fovian rugs hanging on a telescoping display like they were pages of a book he’s deciding not to read. “One wants something special for a special friend,” he says. Then he leans close—too close—and for a second his huge black eyes erase all Klary’s worries about her ruined plans. In that instant of domination, Klary feels something for her sister that she has never felt.\nEnvy.\n“There is more.” She twitches free of the xeni, gathers herself. “Work not yet priced. Items I had not intended to sell.”\n“Keep the best for yourself. A strategy to live by.” He chuckles. “Still, one might be interested to see, if not to buy.”\n“Of course, Ambassador. Although it might be best if your companion stayed with Elloran.” She raises her voice to rouse the bedazzled Elloran. “There may still be a way to salvage the plan, but Janary must not see what is to come.”\n“No.” Janary is trembling.\nThe xeni glances over his shoulder, as if he has forgotten that she is following them. “You’ve provoked the pet to speech, Friend Klary.” He gives her chain a tug and she doubles over, eyes downcast. “It’s not often so bold in public.”\n“Want . . . ” Her voice grates from disuse. “ . . . to come.” She raises her eyes just enough to meet Klary’s horrified gaze.\n“One is at a loss to explain this behavior.”\nWorried lest the xeni punish her, Klary babbles. “It’s fine. Not a problem, I just thought she . . . it would be more comfortable out here. I live here, you see, and my rooms are rather cluttered just now.” She gestures for them to follow and, when the xeni hesitates, she almost makes the mistake of putting a hand on the ambassador’s shoulder to steer him toward the rear of the gallery. “Please,” she says. “It would be my pleasure. Elloran, you can close up and go home.” The fewer witnesses the better. “Elloran.”\n“Most accommodating, Friend Klary.” Asher lets Janary’s chain go slack and then gives it a tinkling shake to get her moving. “Be assured that the pet will be on a short leash.”\nKlary has four rooms at the back of the gallery: bedroom, bath, galley kitchen and the office where she eats and connects. The office is half again as big as all the other rooms combined. Klary had planned for this visit and has removed all traces of her sister clones, their long-dead first, and the world she lost when the family chose her to retrieve Janary. She has replaced mementos of that former life with pix of men she has never met. Clothes they might have worn hang in her closet. There is an artful scatter of presents she might have given or received had she dared intimacy: a vase filled with the latest airflowers, a reproduction ship’s clock, a set of magma tiles that serve as trivets, kites and crystal and antique hubcaps. But what draws Asher’s attention is the art Klary has kept for herself. The xeni points at a chair and Janary sits. He coils the glass chain on her lap and she stares down at it glumly as if to read her fortune. Then he strides about the room inspecting the needle lace hamaca and Ringwell’s blood-stained War Quilt and Xary Merry Kari’s Wrapped Dog. He pauses in front of Kumanen’s Tabriz carpet, which hangs beside the bedroom door. “But you have this one hanging in the gallery,” he says.\n“A reproduction, Ambassador,” Klary says. “This is the original. Four hundred years old. Priceless.”\nAsher waves mention of money aside as if it were a bad smell. He is still not satisfied with Klary’s wares. She has taken a certain pride in the taste with which she has built her collection, even if it is only a ruse to conceal her true intentions. The contents of her gallery and this room are all she has to show for the life she has led since Janary left with her xeni, and none of it interests him. She wonders now if any of it really interests her.\n“One hears,” Asher says, “of a rug.”\nKlary can feel the swirl of events turning him to her purpose. “I have many rugs.”\n“Time passes, Friend Klary. One does not gladly waste it.” His voice changes and abruptly they are no longer speaking. Instead he is commanding. “A living rug. A soulcatcher.”\nKlary gasps as she experiences the full force of the xeni’s charisma. Can ecstasy hurt? She knows the answer. “That’s supposed to be a secret.”\n“Not secret enough, Friend Klary. Show.”\nKlary staggers to the edge of the carpet in the middle of the office, feigning submission. Decorated with a motif of leaves and flowers on a field of blue, it is a nineteenth-century reproduction of a seventeenth-century original that was mentioned in Pope’s Survey of Persian Art. She sinks to her knees, slips fingers underneath and rolls it up to reveal a containment sunk into the floor, three meters by five and half a meter deep. A sheet of x-glass, level with the floor, protects the contents.\nThe xeni purrs. “So it’s real.”\n“As you see, Ambassador.”\nKlary’s soulcatcher has no provenance, other than horror stories told to scare children. Created by the Moccen Collective as an instrument of punishment, it is not strictly speaking textile, although it began as a matlike colony of carnivorous plants. Genetically modified to assimilate those who refused collectivization, the rugs were the Moccan’s tool to control dissidents. Since the Collective was enlightened enough to ban capital punishment, those sentenced to incarceration in a soulcatcher were functionally immortal, as long as the colony survived. The Moccen Collective had collapsed some two hundred years ago, and Klary’s soulcatcher seems as healthy as the day it captured the first dissenter.\n“A closer look, Ambassador?”\nKlary points at the controller and, when the glass retracts, she presses both hands against the rug’s translucent skin. As always, the surface yields to her touch, warm and silky-smooth. Beneath, the heads seem to float in a clear yellow broth of amniotic fluid. Cheeks bump against her palms and sink away, filmy, calm eyes peer through her fingers, lips part, revealing dark, inert tongues. Tangles of veins and arteries, bruise-blue and red, squiggle as blood surges; hairy bundles of ganglia connect the minds of the colony of the damned.\nKlary has always found the pulse of the soulcatcher hypnotic. She has spent hours at its side, hoping for some sign from those within, listening not with her ears but with her fingertips. There have been nights when she has walked across it barefoot and one when, in despair at her wasted life, she lay naked on it and contemplated slicing the skin and submitting to capture. She believes that the captured know what has become of them, that they are restless but not in pain. Suddenly she is startled out of her dream of communion with the heads. Asher kneels next her and caresses the soulcatcher’s skin with his perfect fingers.\n“Alive?” croaks Janary. Without asking permission, she too has approached the open containment.\n“Yes,” murmurs the xeni. “But are they conscious?”\n“There is no way to know.” Klary sits back. “The stories say they are.”\n“They are singing.” The xeni muses dreamily. “Do you hear that?”\nSeeing that the xeni is transfixed, Klary dares a glance at Janary. Klary presses a forefinger to her lips and then nods at her sister’s kneeling abductor.\n“No,” Janary says.\nMisunderstanding, the xeni glares at her and she wilts back into her chair. “One feels for their plight. Name your price.”\n“It’s not for sale.”\nIt takes a moment for the xeni’s mouth to work itself into a smile. “Not?”\n“I mean, you don’t understand. This is a registered historical artifact. It’s against the laws of our world to sell anything on the list.”\n“Then how did it come into your possession?”\n“A gift, Ambassador, from a dear friend.” A dear friend, whom Klary had blackmailed. A parting gift that poor Terez had given as she and her husbands fled their creditors.\n“Then this one must hope for your friendship, Klary.”\nKlary realizes too late how close she is to the xeni. She tries to scoot away.\nThe xeni rests his hand on Klary’s shoulder. “Perhaps an exchange of gifts?”\n“Ambassador . . . ” The hand unlocks years of grief and anger, Klary’s blistering need for revenge. At the same time, she is so swollen with the xeni’s desire for the soulcatcher that her brain feels as if it’s pressing against the inside of her skull. What she wants and what xeni-Harvel Asher wants are so nearly the same—she must acknowledge their mutual desire. The xeni must have the rug, that is the plan, and Klary must have her sister. But the plan is broken, useless, there is no plan, and Asher is so powerful and she must say something or her head will crack, she must, she must.\n“Would I . . . I would . . . exchange.” How can she talk while a fist of blood is punching her chest, clutching at her throat? “I feel as if . . . .” She can’t stop herself. “Need help replacing Elloran . . . useless Elloran.” She gestures wildly at the gallery. “Help.” Now it is all she can do to point at Janary. “Her.”\nShe hears her sister’s strangled cry of anguish and then the xeni is across the room. Xeni-Harvel Asher thrusts a hand to Janary’s face, palm over her mouth, fingers splayed. “Nothing,” he says. “You are nothing.” She shakes beneath his grip. “Say nothing.”\nKlary reclaims her anger and flicks her forefinger to deploy the blade. She slices into the skin of the soulcatcher.\n“You want the pet?” says the xeni, who is still attempting to subdue Janary. His back is to Klary and the soulcatcher. “But humans can’t own humans.”\n“No, of course.” Klary’s nose fills with the sweet, yeasty smell of the amniotic fluid. “Why did I say that?” As if the xeni didn’t know. “But I did, didn’t I?” She doesn’t know what she’s doing, only that she must do something. She babbles again. “It’s true that Elloran is not the best. Not to own it . . . her. No, but I could train her, perhaps. As an apprentice?”\n“She’s yours.” Asher finally lets Janary go. He stoops until their faces are at the same level. “Nothing,” he whispers to her. Klary realizes this is his name for her. “As you worship and serve this one, Asher of Harvel, you will now serve that one, Klary Hamashy.” He breathes into her gaping, agonized mouth. “Your new friend.” Then he laughs.\nKlary shakes her head to clear it. Janary is free. Wasn’t that the most important part of the plan? She can stop now. But the price of all those years of suffering must be accounted for. Not only Janary’s, but hers. Their two wasted lives. She looks past the xeni at her sister, who meets her gaze with brutal reproach. She knows Janary then, knows that she is about to warn Asher, who has taken everything from them. The plan, you stupid bitch. The plan.\nShe hurls herself across the room, throws an arm around the shocked xeni’s neck and drags him back, kicking and gasping for air. Maybe he has something to say, a last plea for mercy, desperate words of command, but he is small and Klary’s anger is large.\n“Klary, stop!” Janary screams, but of course, she is nothing.\nShe thrusts Asher’s head through the skin of the soulcatcher into its roiling interior. Just then Klary hears the captured. They are singing. To her? The song is deafening as she feels the stings of many lashes. They want her too but she releases her hold and falls backwards. Her dripping arm is covered in purple welts. The soulcatcher appears to be swallowing the xeni whole, despite churning legs and flailing arms, but then it spits the headless body out. It slumps away, blood gushing over the rolled up carpet. Ruined.\nShe remembers the man who sold her that carpet. His name was Lann and they were lovers for almost a week before Klary felt herself becoming attached. Lann had the oddest collection of combs: silver and bone and glass and gold. She had never met anyone before who collected combs. She wonders what became of him. Of her life.\nThen she realizes that she is sitting in a puddle. She picks herself up. Janary stares at her.\n“I did this for you,” Klary says. “Our sisters chose me to rescue you.”\n“No.” Janary strangles on the word. “You don’t understand.”\n“I was going to buy you afterward, bring you home. You weren’t supposed to know about this. Nobody was.”\nThe wound she has inflicted on the soulcatcher is already healing. Asher’s head grimaces and turns away from them.\n“I had a plan, Janary. All this would have been a secret.” What is that in her sister’s eyes? Hatred? Horror? Fear?\nShe wonders then if anyone is coming to rescue her.\nJames Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine."}