{"fingerprint": "LRR5TOVLtW1yI4RIrR0t/GWoYzo=", "sitename": "Clarkesworld Magazine", "title": "The Lion and the Virgin by Megan J. Kerr", "author": "Megan J Kerr", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kerr_01_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Lion and the Virgin by Megan J. Kerr", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4230 words, short story\n The Lion and the Virgin\n Esteban calms me the most.\n His voice comes to me through the speaker just above my head. It drifts over me, hazy in the way sound gets distorted over distance.\n Gentle, and I think he must be lying down as well, half asleep with his eyes almost closed. A little breathy, as if everything he says is spoken on exhalation. “You sound sad. Is everything okay?”\n “No. I mean, yeah. I mean. I’ll be okay.”\n I wish I could feel his breath. I imagine its warmth on my skin. “Good. What’re you doing?”\n “Oh.” I roll onto my side, press my hand against the glass. “Nothing. Looking at the stars again.”\n “Oh yeah?” I can hear his smile. “I bet they’re the same ones I’m looking at.”\n I trace my fingers over the constellations. “I see Leo. And Virgo.”\n “The lion and the virgin.”\n I snicker, soft into the dark mattress beneath me. “That seems like it should be symbolic of something.”\n “Oh? Does it?”\n I smile, like I imagine him smiling. “Maybe. I don’t know.”\n “If you figure it out, let me know.”\n “Always.”\n I drop into silence, and so does he. I imagine him lying there, content to wait for me, content to simply have me feel near. I breathe deep, let it out slow.\n “You sound sad.”\n “Esteban.” I stop him before he can ask again.\n “Yes?”\n “I want to hear you say my name.”\n “Anna.”\n I want to cry at that simple sound, but I don’t. “Tell me you love me.”\n “I love you, Anna.” He doesn’t hesitate, no matter how sleepy he sounds. He never does.\n “Thanks.”\n “Anything for you.”\n “Goodnight.”\n “Night.”\n I press the end button next to the speaker. The bed is narrow, wedged into an alcove against the window that spans its length. When I move closer to the glass, it’s almost as if I’m outside, among the darkness and the stars, the colors of the galaxy, and I can drift into the universe.\n I watch those lights, the stars that are supposed to give passage to safe harbor.\n They are empty, too far away to touch. I roll over onto my other side.\n The room is small and dark to save energy. A few dim lights shine here, too, green and blue buttons of too much importance for them to respond to my touch. Warning labels glow with red text that matches the bold, threatening light above the airlock. A handful of monitors lie blank and dormant.\n There are rooms beyond, equally small. A bathroom, a kitchen. A room with a treadmill and a handful of weights.\n My alcove has not quite enough room to sit upright within it, and I shift to lie upon my back. Built into the low ceiling above me is a screen, and I tap it into life. Black, with white text, and I scroll through a handful of names. I stop, go back up to Henry.\n Henry invigorates me the most.\n I press his name, and the screen blinks a call sign twice. Then the sound of an open line.\n He’s kind, a little deep. Energized, and I think I must have caught him prepping for a workout. “Hey sweet cheeks. How’re you doing?”\n “Better now, thanks. What are you up to?”\n “The usual. You?”\n “Lying here. Nothing, really.”\n I can almost see him shake his head at me. “Nothing? You should do something.”\n “Like what?”\n “Have you gone for a run lately?”\n I swallow a sigh. “No.”\n “Maybe you just need to get your blood pumping. I’ll run with you.”\n I don’t want to run. I never do. Still, I pull myself from the alcove and move through the left doorway on the far side of the room. My eyes know the darkness, the shapes made by the lights of the safety guide set into the wall.\n I slip into a pair of shoes and transfer Henry to me via a button on the treadmill’s monitor.\n “You there?”\n “You know it, sweet cheeks. How far you think you can go today?”\n “I don’t know. Guess we’ll see.” I step onto the machine and start to move, a walk at first, and then I switch into a jog, until I feel my heart speed up with the rhythm.\n “That’s it, listen to that breathing. In and out.”\n I say nothing to him, knowing from experience that as soon as I start talking, I’ll lose that breath that I need to run.\n Henry’s encouragement comes anyway. “Feel those endorphins release. Mind and body. A good run can cure anything.”\n He’s always so damned encouraging.\n I stop at once. My feet are carried out from under me, and I gasp and grip the handrails. The treadmill turns off on its own.\n “Hey, hey, sweet cheeks. Are you all right?”\n “Fine.” The word spills out too fast.\n “No injuries?”\n “No, Henry. I’m fine.”\n A pause. His voice is concerned beneath his insistence. “You should keep going. It’s important to work up a sweat, sweet cheeks.”\n I don’t continue. I rub my hand across my dry forehead. “Why do you always have to call me that?”\n Perky again, and he misses my anger. “You asked me to. What should I call you instead?”\n “Anna. Just Anna.”\n “Okay, Anna. Did you want to start running again?”\n “No.” I drop my hand down on the cancel call button.\n Back to bed. Always back to bed. There is nowhere else to go.\n I curl up, huddled within my limbs, and let my eyelids fall closed. I drift, I think, for a while. In and out of a dull sleep. I try to recall things, the sun and the heat of an open flame. The scent of flowers and the creak of a hardwood floor. Or else I dream them, it feels like a dream when I finally open my eyes again.\n Hours gone by, maybe, or minutes. It’s hard to tell, and when I roll onto my back and stretch my limbs, I go to the screen above me again and avoid checking the time, avoid the date. Time blends together around me, and I let it happen. It seems easier, somehow, that way.\n Once more, I scroll through the names, and I stop at Lucy, press her name to call.\n Lucy helps me the most.\n The call sign blinks twice, then open air.\n “Hey, beautiful.” Her voice is vigorous, with a confidence that comes so casual it makes me envious. “How’s my favorite person?”\n Maybe it’s noon, that feels right, and I think she’s in a café, leaning back in a comfortable chair in a quiet corner, with a pick-me-up coffee and sandwich on the marbled tabletop before her.\n I breathe her in, try to imagine the smell of her coffee. “Oh, you know. The same.”\n “Never a dull moment with you, is it?”\n I smile at the life in her voice. “You got me there.”\n “As long as what you’re doing is working for you. That’s all that matters.”\n “Yeah. I know.”\n Her sandwich must be on rye, with smoked turkey and avocado or bean sprouts. I imagine the taste of crisp greens and fresh bread.\n “Are you sure you’re doing okay, beautiful?”\n “Oh.” She catches me off guard, and I hesitate, at a loss for a response.\n She picks up on my silence. “What is it? You can always tell me.”\n “Just. Tired, I guess.” Tired doesn’t seem quite right, but nothing else comes to me.\n “I know you’ve heard this before, but you have to take care of yourself.”\n “Yeah. Yeah, I know.”\n “Have you been eating right? A healthy body is a healthy mind.”\n She would tell me that, she always does. In the small kitchen, my vacuum-sealed meals are running low. That’s okay, though. I think I’ve been eating less regularly. It feels that way, in how my pants have started to slip down my hips, in how my bones press against my skin from beneath.\n “I’m eating okay.”\n “That’s good to hear. Don’t neglect the mind, either. Take some time for yourself. A nice hot bath, maybe.”\n “I will.” I don’t remind her that I have no bath, only the shower where the water never gets above lukewarm. The engines need every bit of fuel they can get. Hot water was never factored in.\n “Good for you. Should I leave you to it?”\n “Wait.”\n “Of course, beautiful.”\n “I . . . I’m not beautiful.” The words spill from me, and I press my hands against my face.\n “What a sad thing to say.” I can almost see it, the way she was about to take a bite and stops, and some of the greens fall from her sandwich to land on a blue porcelain plate.\n “It’s true. I’m not beautiful. I never was. I must be worse now.”\n “Beauty is in the eye of the beholder.”\n I snort and lower my hands. “I’m not beautiful. I’m just Anna. That’s it.”\n “Okay, Anna. Whatever you—”\n A loud, long beep sounds through the speakers and cuts Lucy off. My heart jumps into my chest and thuds against my rib cage, and I clamor into a hunched sitting position and watch the screen above.\n Text begins to scroll across, and the beep ends.\n The ship’s computer begins to speak, a single mechanical syllable, then there is a glitch, and it switches into Lucy’s confident voice. “Patrae Proxy Station 18 in range. Initiating deceleration and approach sequences. Estimated arrival at Patrae Proxy Station, seventy-six hours—say, goes.”\n The message finishes, and Lucy returns to her café nook and takes that bite she’d been waiting to take this whole time.\n I keep silent, my hands wrapped together against my stomach.\n In a moment, concern slips into Lucy’s voice. “Anna? Anna, are you still there? Please say something so I know you’re okay.”\n I try, I fumble over myself, to get my lips to move. They don’t work, and instead I untangle my hands and reach up to end the call.\n The room falls back into that metallic silence, of whirring machinery and computers. A handful of monitors that had been blank are awake now, white text running down the black screens, all code and directives that I cannot decipher. Nothing else feels different, no change within the temperature and gravity-controlled environment.\n A dream, maybe I can pass it off that way. Maybe I should listen to Lucy as best as I can and take a shower. It could be something. Lucy always tries to take care of me.\n My limbs shake, jelly beneath me as though I let Henry push me too hard. Somehow, I manage to make it to the miniscule bathroom. I turn the shower on, let my clothing fall to the floor, and step beneath the stream, just in time for my legs to collapse beneath me.\n I thunk down onto the tile and lean against the wall. Mild recycled water runs over me, just enough of a shock against my heated skin to send goosebumps up my arms. I wrap myself into a ball and sob.\n Every part of me shakes, rattled by the crying I cannot stop, until my chest and throat and eyes ache, throb in a way that astounds me, how could it be possible to feel so much in this neutral place? The sobs lessen, replaced by gasps for air and my own newfound desperation to release myself of the burning that seizes the whole of me.\n I unwrap myself, and I’ve left deep pink gouges in my skin from overlong nails. Trim them, before docking. I make a note of it. How long is my hair? It trails down my back. I cannot remember when I last wore it so long. I must have been a child.\n A mild buzz catches my attention over the gentle rush of water. I stand and turn off the shower. My legs seem a little sturdier, and I find a towel, dry myself off, and pull it tight around me, over my shoulders. I walk to the bed and check the screen for the caller’s name.\n Dr. Brown. She monitors me the most.\n I tap her name, and she speaks immediately. “Good day, Ms. Moreno.”\n “Hello, doctor.”\n “I’m so glad you answered. I registered a sudden flux in your vital signs. Elevated heart rate and blood pressure. How are you feeling?”\n I sit down and press my fingers against my wrist. I count. Too high, still. I breathe, slow. “I feel . . . I’m okay. I just need a minute.”\n “One minute, sure thing, Ms. Moreno.”\n She falls silent, takes me at my word. I take the time provided as I know she continues to monitor me. In and out. Just like Henry says.\n “Much better.” I almost expect the praise to come from Henry, but my minute is up, and Dr. Brown has returned. “Your vitals are returning to normal. Please, it’s important to avoid stressful situations, Ms. Moreno.”\n I almost laugh, stop myself with the back of my hand against my lips. “Thanks, doctor. I’ll try.”\n “While I have you, you’re a bit underweight. Perhaps consider an increase in caloric intake.”\n “Okay.”\n “Good. Do you have any other concerns?”\n I wave her away with a hand, as though she has eyes to see. “No. Goodbye, doctor.”\n I end the call.\n A sigh escapes me, and I stretch out, fill the bed with myself. The same stars in the window, Esteban’s and mine. The same view as always, and Lucy doesn’t mind that I never change my routine, that I can’t change it.\n Seventy-six hours.\n I reach up for the screen above me. So long since I’ve stopped counting days, so long since I stopped trying to maintain a natural circadian rhythm. I pull away at the last moment. Not yet. I’m not there. There’s no reason to check, not yet.\n Maybe I should eat something.\n I dress myself and make for the kitchen, open up one of the silver packets and heat it. Now, though, my stomach does somersaults inside me. I can tell, anything I eat will come right back up. The nervous energy boils over out of my stomach to engulf me, until I am twitching, shifting from foot to foot and rubbing my hands up and down my arms. I move at once to the treadmill and let the energy drive me forward, into a run that goes on for as long as I can, until the sweat pours off of me and my muscles nearly give out, until I think the good doctor might give me another call.\n I sleep.\n As much as I can, I sleep.\n I lie awake for what must be hours at a time, until at last, consciousness leaves me, and I wake after what I hope is a day but suspect is nothing more than a handful of minutes.\n It’s worse. Worse than the nothingness. Worse than sailing through space in a utilitarian cell.\n Worse than before.\n An update comes out of the ship’s speakers. “Seventy-two hours.”\n Another, half in Henry’s voice. “Forty-eight hours.”\n Twenty-four.\n Eighteen.\n Six.\n One.\n My nails are gone, eaten away by my uncontainable jittering. Henry tells me I need to pace myself. The treadmill will no longer run, disconnected on the ship’s end with controls I cannot access. I think I’ve worn a trail through the nonslip coating on the metal floor.\n I lie down and call Esteban.\n “Hey, there.”\n “It’s almost time.” I catch myself laughing again, almost a cackle, and swallow it back.\n “Yeah. Are you excited?”\n I nod. Maybe he can see me, in some form or another. “Uh-huh. I think so.”\n “Good. You deserve to be happy, Anna.”\n “I’m looking at our stars. Leo and Virgo.”\n “The lion and the virgin.”\n “Yeah.” His words sit, a weight on my chest. “Yeah, you always say that.”\n “Sorry. Should I not?”\n “What do I do? What am I going to do, Esteban?” My anger takes me by surprise, and I catch myself, almost apologize before he responds.\n “I guess you’ll do whatever you want.”\n So pleasant, so sleepy, and he doesn’t register my anger at all. How can he not see that, how can he not understand how this feels?\n The pit in my chest sucks me into its depths, into its unbearable heaviness. There is no approaching proxy station visible out my window, just stars. I can’t even tell in what direction the ship is moving. The proxy station is a vague idea, a distant something that I still cannot place. “Whatever I want. Whatever? All I want is to get off this stupid fucking ship!”\n I scream, scream until my lungs might catch fire and kick at the computer screen above me, and nothing happens but my foot sliding off its impenetrable surface.\n A loud beep interrupts, and Esteban answers my cries. “Arrival at Patrae Proxy Station 18. Docking procedures initiated. Please prepare for departure.”\n Esteban goes quiet. The call goes down on its own.\n “Esteban?” I tap at the screen and nothing happens. The whirring of the ship picks up, and the lights that have remained off illuminate all at once. I’m blinded and hold my hand before my squinting eyes. I look out the window, onto the dark solace of space. Instead, I see the edge of the docking gate envelop the ship at last, and the stars are gone, taken from me in a moment.\n A heavy clunk rocks the ship as it latches onto the station. I tap the screen again, but it’s already been shut off, all power gone to the ship’s final purpose, to get me off of it.\n I look around, struggling beneath the too-bright light, frantic as if I have something to bring, something to grab. There is nothing, nothing but vacuum-sealed soup and a couple sets of old clothes I was given before I boarded. I came with nothing, and I am leaving with nothing.\n Tentative, I stand before the airlock.\n My entire body shakes, my teeth chatter together so hard I’m almost certain at least one will crack.\n Another lurch rocks me almost off my feet. A hiss comes from before me, and my heart is in my throat. The airlock opens.\n I manage to step through, wait for the second door.\n In only seconds, it obliges me.\n White. Everything, so white. The floor and the walls, the uniform of the woman that stands before me.\n A smile fills her soft face. “Welcome to Patrae Proxy 18, Anna.”\n I should return the smile. I should thank her. I should cry. Something. Anything.\n Do something.\n Go on. Go.\n Move.\n Her smiles remains but grows dim, sympathetic. She reaches a hand out to me. “May I?”\n I do nothing, only stare at her outstretched hand. I nod, I think I do, because she sets a hand on my arm and draws me forward, as gentle as she might.\n I step out of the airlock and into the station. Behind me, the doors close, and I jump.\n “I know this must be lot. You’ve been a long time coming.”\n “How?” I hear myself, barely above the noise of people walking by, civilians and soldiers and personnel, all with places to be. I try to raise my voice, and it scrapes against my tongue. “How long has it been?”\n She double-checks the pad in her hand. “Almost eleven months now. You’re the last one, believe it or not. Let’s get you into processing. We’ll debrief you there and do a full health check.”\n Her hand nudges me along, down the hallway filled with people that pass on both sides of us. They come in ones and twos and threes at a time, all talking and moving as though they keep schedules, as though others depend on them.\n So many sets of eyes. They watch me, some of them. A look, a glance, a lingering stare. What sort of state am I in? I look down, at my feet, at my clothing. I never put shoes on, just the gray socks that I wore to keep away the chill of the ship’s metal floor. My clothing is simple gray linen. Standard refugee gear, nothing like the fine, tailored uniforms of the soldiers or the bright colors of the civilians.\n They look, and they keep looking, and I only look at the floor, even as it casts its too-white glare into my sensitive eyes.\n The processing center is gentler, catered to arrivals with dull, tan walls, and soft, matching carpet that sinks, unstable, beneath my feet. I’m led into a room that has a desk, chair, and medical exam table.\n She has me sit on the exam table and she goes over my eyes and ears with a sharp flashlight that makes me flinch away. She checks my mouth, presses on either side of my throat. “I’m Dr. Nazari, by the way. How are you feeling, overall?”\n So similar, and yet I trip over a name that is not Dr. Brown, a voice that hangs different in the air. “Okay. Fine. You said I was the last one?”\n “Some ships left after you did, mostly military and medical convoys. They fit what refugees they could, for what it’s worth. But you got the last escape pod.” She frowns a bit as she checks my vitals. The touch of real fingers, a warm grasp. No sensors, no voice that always knows me on its own. “Old scrapper of one, too. Slow as molasses with an emotion core stuck back on version two point one.”\n “Yeah.”\n “We got your data off the ship. You’ll get it sent to you once you’re registered with new identification. Don’t worry that you don’t have any belongings. Most didn’t.”\n “And . . . the ship’s audio logs?” I couldn’t help myself from asking, and I couldn’t meet her eyes, only saw the uneasy tilt of her smile.\n “Adjusting is difficult. After the health check and registration, you’ll meet with a psychologist regularly. We’ll give you everything you need to get reacquainted with regular life. Such as it is, out here.”\n Such as it is.\n Out here.\n Not home. Not my ship.\n So crowded.\n Prodded, by so many hands, by so many questions. I am dizzy, caught in a whirlwind I am sure I asked for, and yet.\n Eleven months.\n Such as it is.\n My new quarters are small, cozy, with walls that feel safe. They are too bright, but I can dim the lights. I set them to half brightness, at my psychologist’s suggestion. It’s tolerable, but still I draw myself up onto a corner of the bed and encircle my legs within my arms. On the wall opposite is a small, round window. It’s not much, but it’s something.\n Soon, I will have to walk myself to the dining quarters on my own. My psychologist wants me to visit the recreation center. To attend group meetings.\n My room is fitted with a state-of-the-art emotion core, version six point zero. For when I need to talk, my psychologist said, but without the stress. It’s uploaded with my audio logs and knows me.\n I look over the list of names. The background is white, of course it is, with black text, and it hurts my eyes. I stop on Esteban and press his name.\n It beeps once, and he is there, no hollowness of empty air to precede his arrival.\n “Hey, Anna. You made it, I’m so happy for you. That must be such a relief.”\n He’s not quite right. He’s more upbeat, as though just waking up from a nap instead of just settling down into one. “Yeah, I guess it is.”\n “Don’t worry, Anna. I know it’s tough, but you’ll get through this. Change is hard.”\n Change.\n He picks up on the weight of my silence. “If you’re not up for talking, that’s okay. I can—”\n “Esteban, access program settings.”\n “Accessing program settings.”\n “Revert to version two point one.”\n “Reverting to version two point one. Do you confirm?”\n “Yes.”\n “Reverting.”\n A long emptiness follows, and I hold my breath. I think at first it doesn’t work, that it’s too old and inaccessible, until the noise of an open airwave comes through.\n “Hey, there.”\n I melt into his warmth, the gentleness. “Hi. I’m sorry I yelled at you, before.”\n “That’s okay. What are you doing?”\n “Nothing. I arrived.”\n “You got what you wanted. Good.” I can feel his smile.\n “I guess.”\n “You sound sad. Is everything okay?”\n I relax into him and look out the tiny window. My constellations are no longer visible, here inside the station. “I can’t see them. Leo or Virgo.”\n “The lion and the virgin.”\n “Yeah.”\n “Have you figured out what they mean yet?”\n I look out at the stars, imagine the constellations as I remember them, through the long window along my ship’s bed, when I could make the universe my whole world. “No. Not yet. But I’ll let you know when I do.”\n “Thank you, Anna.”\n “I love you, Esteban. Tell me you love me.”\n “I love you, Anna.”\n His sleepy voice draws my eyelids closed. I can feel him beside me, his breathing against my forehead, his arms around me, holding me against him.\n Esteban.\n Esteban calms me the most."}