{"fingerprint": "JwU+uBHA44EaIdn3MArZrSRumeI=", "sitename": "Clarkesworld Magazine", "title": "The Pure Product by John Kessel", "author": "John Kessel", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kessel_12_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Pure Product by John Kessel", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8090 words, novelette, REPRINT\n The Pure Product\n I arrived in Kansas City at one o’clock on the afternoon of the thirteenth of August. A Tuesday. I was driving the beige 1983 Chevrolet Citation that I had stolen two days earlier in Pocatello, Idaho. The Kansas plates on the car I’d taken from a different car in a parking lot in Salt Lake City. Salt Lake City was founded by the Mormons, whose god tells them that in the future Jesus Christ will come again.\n I drove through Kansas City with the windows open and the sun beating down through the windshield. The car had no air conditioning, and my shirt was stuck to my back from seven hours behind the wheel. Finally I found a hardware store, “Hector’s” on Wornall. I pulled into the lot. The Citation’s engine dieseled after I turned off the ignition; I pumped the accelerator once and it coughed and died. The heat was like syrup. The sun drove shadows deep into corners, left them flattened at the feet of the people on the sidewalk. It made the plate glass of the store window into a dark negative of the positive print that was Wornall Road. August.\n The man behind the counter in the hardware store I took to be Hector himself. He looked like Hector, slain in vengeance beneath the walls of paintbrushes—the kind of semi-friendly, publicly optimistic man who would tell you about his crazy wife and his ten-penny nails. I bought a gallon of kerosene and a plastic paint funnel, put them into the trunk of the Citation, then walked down the block to the Mark Twain Bank. Mark Twain died at the age of seventy-five with a heart full of bitter accusations against the Calvinist god and no hope for the future of humanity. Inside the bank I went to one of the desks, at which sat a Nice Young Lady. I asked about starting a business checking account. She gave me a form to fill out, then sent me to the office of Mr. Graves.\n Mr. Graves wielded a formidable handshake. “What can I do for you, Mr . . . ?”\n “Tillotsen, Gerald Tillotsen,” I said. Gerald Tillotsen, of Tacoma, Washington, died of diphtheria at the age of four weeks—on September 24, 1938. I have a copy of his birth certificate.\n “I’m new to Kansas City. I’d like to open a business account here, and perhaps take out a loan. I trust this is a reputable bank? What’s your exposure in Brazil?” I looked around the office as if Graves were hiding a woman behind the hat stand, then flashed him my most ingratiating smile.\n Mr. Graves did his best. He tried smiling back, then looked as if he had decided to ignore my little joke. “We’re very sound, Mr. Tillotsen.”\n I continued smiling.\n “What kind of business do you own?”\n “I’m in insurance. Mutual Assurance of Hartford. Our regional office is in Oklahoma City, and I’m setting up an agency here, at 103rd and State Line.” Just off the interstate.\n He examined the form. His absorption was too tempting.\n “Maybe I can fix you up with a policy? You look like dead meat.”\n Graves’ head snapped up, his mouth half-open. He closed it and watched me guardedly. The dullness of it all! How I tire. He was like some cow, like most of the rest of you in this silly age, unwilling to break the rules in order to take offense. “Did he really say that?” he was thinking. “Was that his idea of a joke? He looks normal enough.” I did look normal, exactly like an insurance agent. I was the right kind of person, and I could do anything. If at times I grate, if at times I fall a little short of or go a little beyond convention, there is not one of you who can call me to account.\n Graves was coming around. All business.\n “Ah—yes, Mr. Tillotsen. If you’ll wait a moment, I’m sure we can take care of this checking account. As for the loan—”\n “Forget it.”\n That should have stopped him. He should have asked after my credentials, he should have done a dozen things. He looked at me, and I stared calmly back at him. And I knew that, looking into my honest blue eyes, he could not think of a thing.\n “I’ll just start the checking account with this money order,” I said, reaching into my pocket. “That will be acceptable, won’t it?”\n “It will be fine,” he said. He took the form and the order over to one of the secretaries while I sat at the desk. I lit a cigar and blew some smoke rings. I’d purchased the money order the day before in a post office in Denver. Thirty dollars. I didn’t intend to use the account very long. Graves returned with my sample checks, shook hands earnestly, and wished me a good day. Have a good day, he said. I will, I said.\n Outside, the heat was still stifling. I took off my sports coat. I was sweating so much I had to check my hair in the side view mirror of my car. I walked down the street to a liquor store and bought a bottle of chardonnay and a bottle of Chivas Regal. I got some paper cups from a nearby grocery. One final errand, then I could relax for a few hours.\n In the shopping center that I had told Graves would be the location for my nonexistent insurance office, I had noticed a sporting goods store. It was about three o’clock when I parked in the lot and ambled into the shop. I looked at various golf clubs: irons, woods, even one set with fiberglass shafts. Finally I selected a set of eight Spalding irons with matching woods, a large bag, and several boxes of Top Flites. The salesman, who had been occupied with another customer at the rear of the store, hustled up, his eyes full of commission money. I gave him little time to think. The total cost was $612.32. I paid with a check drawn on my new account, cordially thanked the man, and had him carry all the equipment out to the trunk of the car.\n I drove to a park near the bank; Loose Park, they called it. I felt loose. Cut loose, drifting free, like one of the kites people were flying that had broken its string and was ascending into the sun. Beneath the trees it was still hot, though the sunlight was reduced to a shuffling of light and shadow on the brown grass. Kids ran, jumped, swung on playground equipment. I uncorked my bottle of wine, filled one of the paper cups, and lay down beneath a tree, enjoying the children, watching young men and women walking along the footpaths.\n A girl approached. She didn’t look any older than seventeen. Short, slender, with clean blond hair cut to her shoulders. Her shorts were very tight. I watched her unabashedly; she saw me watching and left the path to come over to me. She stopped a few feet away, hands on her hips. “What are you looking at?” she asked.\n “Your legs,” I said. “Would you like some wine?”\n “No thanks. My mother told me never to accept wine from strangers.” She looked right through me.\n “I take what I can get from strangers,” I said. “Because I’m a stranger, too.”\n I guess she liked that. She was different. She sat down and we chatted for a while. There was something wrong about her imitation of a seventeen-year-old; I began to wonder whether hookers worked the park. She crossed her legs and her shorts got tighter. “Where are you from?” she asked.\n “San Francisco. But I’ve just moved here to stay. I have a part interest in the sporting goods store at the Eastridge Plaza.”\n “You live near here?”\n “On West Eighty-ninth.” I had driven down Eighty-ninth on my way to the bank.\n “I live on Eighty-ninth! We’re neighbors.”\n It was exactly what one of my own might have said to test me. I took a drink of wine and changed the subject. “Would you like to visit San Francisco someday?”\n She brushed her hair back behind one ear. She pursed her lips, showing off her fine cheekbones. “Have you got something going?” she asked, in queerly accented English.\n “Excuse me?”\n “I said, have you got something going?” she repeated, still with the accent—the accent of my own time.\n I took another sip. “A bottle of wine,” I replied in good mid-western 1980s.\n She wasn’t having any of it. “No artwork, please. I don’t like artwork.”\n I had to laugh: my life was devoted to artwork. I had not met anyone real in a long time. At the beginning I hadn’t wanted to, and in the ensuing years I had given up expecting it. If there’s anything more boring than you people it’s us people. But that was an old attitude. When she came to me in K.C., I was lonely and she was something new.\n “Okay,” I said. “It’s not much, but you can come for the ride. Do you want to?”\n She smiled and said yes.\n As we walked to my car, she brushed her hip against my leg. I switched the bottle to my left hand and put my arm around her shoulders in a fatherly way. We got into the front seat, beneath the trees on a street at the edge of the park. It was quiet. I reached over, grabbed her hair at the nape of her neck, and jerked her face toward me, covering her little mouth with mine. Surprise: she threw her arms around my neck and slid across the seat into my lap. We did not talk. I yanked at the shorts; she thrust her hand into my pants. St. Augustine asked the Lord for chastity, but not right away.\n At the end she slipped off me, calmly buttoned her blouse, brushed her hair back from her forehead. “How about a push?” she asked. She had a nail file out and was filing her index fingernail to a point.\n I shook my head and looked at her. She resembled my grandmother. I had never run into my grandmother, but she had a hellish reputation. “No thanks. What’s your name?”\n “Call me Ruth.” She scratched the inside of her left elbow with her nail. She leaned back in her seat, sighed deeply. Her eyes became a very bright, very hard blue.\n While she was aloft I got out, opened the trunk, emptied the rest of the chardonnay into the gutter, and used the funnel to fill the bottle with kerosene. I plugged it with a kerosene-soaked rag. Afternoon was sliding into evening as I started the car and cruised down one of the residential streets. The houses were like those of any city or town of that era of the Midwest USA: white frame, forty or fifty years old, with large porches and small front yards. Dying elms hung over the street. Shadows stretched across the sidewalks. Ruth’s nose wrinkled; she turned her face lazily toward me, saw the kerosene bottle, and smiled.\n Ahead on the left-hand sidewalk I saw a man walking leisurely. He was an average sort of man, middle-aged, probably just returning from work, enjoying the quiet pause dusk was bringing to the hot day. It might have been Hector; it might have been Graves. It might have been any one of you. I punched the cigarette lighter, readied the bottle in my right hand, steering with my leg as the car moved slowly forward.\n “Let me help,” Ruth said. She reached out and steadied the wheel with her slender fingertips. The lighter popped out. I touched it to the rag; it smoldered and caught. Greasy smoke stung my eyes. By now the man had noticed us. I hung my arm, holding the bottle, out the window. As we passed him, I tossed the bottle at the sidewalk like a newsboy tossing a rolled-up newspaper. The rag flamed brighter as it whipped through the air; the bottle landed at his feet and exploded, dousing him with burning kerosene. I floored the accelerator; the motor coughed, then roared, the tires and Ruth both squealing in delight. I could see the flaming man in the rearview mirror as we sped away.\n On the Great American Plains, the summer nights are not silent. The fields sing the summer songs of insects—not individual sounds, but a high-pitched drone of locusts, crickets, cicadas, small chirping things for which I have no names. You drive along the superhighway and that sound blends with the sound of wind rushing through your opened windows, hiding the thrum of the automobile, conveying the impression of incredible velocity. Wheels vibrate, tires beat against the pavement, the steering wheel shudders, alive in your hands, droning insects alive in your ears. Reflecting posts at the roadside leap from the darkness with metronomic regularity, glowing amber in the headlights, only to vanish abruptly into the ready night when you pass. You lose track of time, how long you have been on the road, where you are going. The fields scream in your ears like a thousand lost, mechanical souls, and you press your foot to the accelerator, hurrying away.\n When we left Kansas City that evening we were indeed hurrying. Our direction was in one sense precise: Interstate 70, more or less due east, through Missouri in a dream. They might remember me in Kansas City, at the same time wondering who and why. Mr. Graves scans the morning paper over his grapefruit: MAN BURNED BY GASOLINE BOMB. The clerk wonders why he ever accepted an unverified counter check, without a name or address printed on it, for six hundred dollars. The check bounces. They discover it was a bottle of chardonnay. The story is pieced together. They would eventually figure out how—I wouldn’t lie to myself about that (I never lie to myself)—but the why would always escape them. Organized crime, they would say. A plot that misfired.\n Of course, they still might have caught me. The car became more of a liability the longer I held on to it. But Ruth, humming to herself, did not seem to care, and neither did I. You have to improvise those things; that’s what gives them whatever interest they have.\n Just shy of Columbia, Missouri, Ruth stopped humming and asked me, “Do you know why Helen Keller can’t have any children?”\n “No.”\n “Because she’s dead.”\n I rolled up the window so I could hear her better. “That’s pretty funny,” I said.\n “Yes. I overheard it in a restaurant.” After a minute she asked, “Who’s Helen Keller?”\n “A dead woman.” An insect splattered itself against the windshield. The lights of the oncoming cars glinted against the smear it left.\n “She must be famous,” said Ruth. “I like famous people. Have you met any? Was that man you burned famous?”\n “Probably not. I don’t care about famous people anymore.” The last time I had anything to do, even peripherally, with anyone famous was when I changed the direction of the tape over the lock in the Watergate so Frank Wills would see it. Ruth did not look like the kind who would know about that. “I was there for the Kennedy assassination,” I said, “but I had nothing to do with it.”\n “Who was Kennedy?”\n That made me smile. “How long have you been here?” I pointed at her tiny purse. “That’s all you’ve got with you?”\n She slid across the seat and leaned her head against my shoulder. “I don’t need anything else.”\n “No clothes?”\n “I left them in Kansas City. We can get more.”\n “Sure,” I said.\n She opened the purse and took out a plastic Bayer aspirin case. From it she selected two blue-and-yellow caps. She shoved her palm up under my nose. “Serometh?”\n “No thanks.”\n She put one of the caps back into the box and popped the other under her nose. She sighed and snuggled tighter against me. We had reached Columbia and I was hungry. When I pulled in at a McDonald’s she ran across the lot into the shopping mall before I could stop her. I was a little nervous about the car and sat watching it as I ate (Big Mac, small Dr. Pepper). She did not come back. I crossed the lot to the mall, found a drugstore, and bought some cigars. When I strolled back to the car she was waiting for me, hopping from one foot to another and tugging at the door handle. Serometh makes you impatient. She was wearing a pair of shiny black pants, pink-and-white-checked sneakers, and a hot pink blouse.\n “ ’s go!” she hissed.\n I moved even slower. She looked like she was about to wet herself, biting her soft lower lip with a line of perfect white teeth. I dawdled over my keys. A security guard and a young man in a shirt and tie hurried out of the mall entrance and scanned the lot. “Nice outfit,” I said. “Must have cost you something.”\n She looked over her shoulder, saw the security guard, who saw her. “Hey!” he called, running toward us. I slid into the car, opened the passenger door. Ruth had snapped open her purse and pulled out a small gun. I grabbed her arm and yanked her into the car; she squawked and her shot went wide. The guard fell down anyway, scared shitless. For the second time that day I tested the Citation’s acceleration; Ruth’s door slammed shut and we were gone.\n “You scut,” she said as we hit the entrance ramp of the interstate. “You’re a scut-pumping Conservative. You made me miss.” But she was smiling, running her hand up the inside of my thigh. I could tell she hadn’t ever had so much fun in the twentieth century.\n For some reason I was shaking. “Give me one of those seromeths,” I said.\n Around midnight we stopped in St. Louis at a Holiday Inn. We registered as Mr. and Mrs. Gerald Bruno (an old acquaintance) and paid in advance. No one remarked on the apparent difference in our ages. So discreet. I bought a copy of the Post-Dispatch, and we went to the room. Ruth flopped down on the bed, looking bored, but thanks to her gunplay I had a few more things to take care of. I poured myself a glass of Chivas, went into the bathroom, removed the toupee and flushed it down the toilet, showered, put a new blade in my old razor, and shaved the rest of the hair from my head. The Lex Luthor look. I cut my scalp. That got me laughing, and I could not stop. Ruth peeked through the doorway to find me dabbing the crown of my head with a bloody Kleenex.\n “You’re a wreck,” she said.\n I almost fell off the toilet laughing. She was absolutely right. Between giggles I managed to say, “You must not stay anywhere too long, if you’re as careless as you were tonight.”\n She shrugged. “I bet I’ve been at it longer than you.” She stripped and got into the shower. I got into bed.\n The room enfolded me in its gold-carpet green-bedspread mediocrity. Sometimes it’s hard to remember that things were ever different. In 1596 I rode to court with Essex; I slept in a chamber of supreme garishness (gilt escutcheons in the corners of the ceiling, pink cupids romping on the walls), in a bed warmed by any of the trollops of the city I might want. And there in the Holiday Inn I sat with my drink, in my pastel blue pajama bottoms, reading a late-twentieth-century newspaper, smoking a cigar. An earthquake in Peru estimated to have killed eight thousand in Lima alone. Nope. A steel worker in Gary, Indiana, discovered to be the murderer of six prepubescent children, bodies found buried in his basement. Perhaps. The president refuses to enforce the ruling of his Supreme Court because it “subverts the will of the American people.” Probably not.\n We are everywhere. But not everywhere.\n Ruth came out of the bathroom, saw me, did a double take. “You look—perfect!” she said. She slid in the bed beside me, naked, and sniffed at my glass of Chivas. Her lip curled. She looked over my shoulder at the paper. “You can understand that stuff?”\n “Don’t kid me. Reading is a survival skill. You couldn’t last here without it.”\n “Wrong.”\n I drained the scotch. Took a puff on the cigar. Dropped the paper to the floor beside the bed. I looked her over. Even relaxed, the muscles in her arms and along the tops of her thighs were well defined.\n “You even smell like one of them,” she said.\n “How did you get the clothes past their store security? They have those beeper tags clipped to them.”\n “Easy. I tried on the shoes and walked out when they weren’t looking. In the second store I took the pants into a dressing room, cut the alarm tag out of the waistband, and put them on. I held the alarm tag that was clipped to the blouse in my armpit and walked out of that store, too. I put the blouse on in the mall women’s room.”\n “If you can’t read, how did you know which was the women’s room?”\n “There’s a picture on the door.”\n I felt tired and old. Ruth moved close. She rubbed her foot up my leg, drawing the pajama leg up with it. Her thigh slid across my groin. I started to get hard. “Cut it out,” I said. She licked my nipple.\n I could not stand it. I got off the bed. “I don’t like you.”\n She looked at me with true innocence. “I don’t like you, either.”\n Although he was repulsed by the human body, Jonathan Swift was passionately in love with a woman named Esther Johnson. “What you did at the mall was stupid,” I said. “You would have killed that guard.”\n “Which would have made us even for the day.”\n “Kansas City was different.”\n “We should ask the cops there what they think.”\n “You don’t understand. That had some grace to it. But what you did was inelegant. Worst of all it was not gratuitous. You stole those clothes for yourself, and I hate that.” I was shaking.\n “Who made all these laws?”\n “I did.”\n She looked at me with amazement. “You’re not just a Conservative. You’ve gone native!”\n I wanted her so much I ached. “No I haven’t,” I said, but even to me my voice sounded frightened.\n Ruth got out of the bed. She glided over, reached one hand around to the small of my back, pulled herself close. She looked up at me with a face that held nothing but avidity. “You can do whatever you want,” she whispered. With a feeling that I was losing everything, I kissed her. You don’t need to know what happened then.\n I woke when she displaced herself: there was a sound like the sweep of an arm across fabric, a stirring of air to fill the place where she had been. I looked around the still brightly lit room. It was not yet morning. The chain was across the door; her clothes lay on the dresser. She had left the aspirin box beside my bottle of scotch.\n She was gone. Good, I thought, now I can go on. But I found that I couldn’t sleep, could not keep from thinking. Ruth must be very good at that, or perhaps her thought is a different kind of thought from mine. I got out of the bed, resolved to try again but still fearing the inevitable. I filled the tub with hot water. I got in, breathing heavily. I took the blade from my razor. Holding my arm just beneath the surface of the water, hesitating only a moment, I cut deeply one, two, three times along the veins in my left wrist. The shock was still there, as great as ever. With blood streaming from me I cut the right wrist. Quickly, smoothly. My heart beat fast and light, the blood flowed frighteningly; already the water was stained. I felt faint—yes—it was going to work this time, yes. My vision began to fade—but in the last moments before consciousness fell away I saw, with sick despair, the futile wounds closing themselves once again, as they had so many times before. For in the future the practice of medicine may progress to the point where men need have little fear of death.\n The dawn’s rosy fingers found me still unconscious. I came to myself about eleven, my head throbbing, so weak I could hardly rise from the cold bloody water. There were no scars. I stumbled into the other room and washed down one of Ruth’s megamphetamines with two fingers of scotch. I felt better immediately. It’s funny how that works sometimes, isn’t it? The maid knocked as I was cleaning the bathroom. I shouted for her to come back later, finished as quickly as possible, and left the hotel immediately. I ate Shredded Wheat with milk and strawberries for breakfast. I was full of ideas. A phone book gave me the location of a likely country club.\n The Oak Hill Country Club of Florissant, Missouri, is not a spectacularly wealthy institution, or at least it does not give that impression. I’ll bet you that the membership is not as purely white as the stucco clubhouse. That was all right with me. I parked the Citation in the mostly empty parking lot, hauled my new equipment from the trunk, and set off for the locker room, trying hard to look like a dentist. I successfully ran the gauntlet of the pro shop, where the proprietor was telling a bored caddy why the Cardinals would fade in the stretch. I could hear running water from the showers as I shuffled into the locker room and slung the bag into a corner. Someone was singing the “Ode to Joy,” abominably.\n I began to rifle through the lockers, hoping to find an open one with someone’s clothes in it. I would take the keys from my benefactor’s pocket and proceed along my merry way. Ruth would have accused me of self-interest; there was a moment in which I accused myself. Such hesitation is the seed of failure: as I paused before a locker containing a likely set of clothes, another golfer entered the room along with the locker-room attendant. I immediately began undressing, lowering my head so that the locker door hid my face. The golfer was soon gone, but the attendant sat down and began to leaf through a worn copy of Penthouse. I could come up with no better plan than to strip and enter the showers. Amphetamine daze. Perhaps the kid would develop a hard-on and go to the john to take care of it.\n There was only one other man in the shower, the symphonic soloist, a somewhat portly gentleman who mercifully shut up as soon as I entered. He worked hard at ignoring me. I ignored him in return: alle Menschen werden Brüder. I waited a long five minutes after he left; two more men came into the showers, and I walked out with what composure I could muster. The locker-room boy was stacking towels on a table. I fished a five from my jacket in the locker and walked up behind him. Casually I took a towel.\n “Son, get me a pack of Marlboros, will you?”\n He took the money and left.\n In the second locker I found a pair of pants that contained the keys to some sort of Audi. I was not choosy. Dressed in record time, I left the new clubs beside the rifled locker. My note read, “The pure products of America go crazy.” There were three eligible cars in the lot, two 4000s and a Fox. The key would not open the door of the Fox. I was jumpy, but almost home free, coming around the front of a big Chrysler . . .\n “Hey!”\n My knee gave way and I ran into the fender of the car. The keys slipped out of my hand and skittered across the hood to the ground, jingling. Grimacing, I hopped toward them, plucked them up, glancing over my shoulder at my pursuer as I stooped. It was the locker-room attendant.\n “Your cigarettes.” He looked at me the way a sixteen-year-old looks at his father; that is, with bored skepticism. All our gods in the end become pitiful. It was time for me to be abruptly courteous. As it was, he would remember me too well.\n “Thanks,” I said. I limped over, put the pack into my shirt pocket. He started to go, but I couldn’t help myself. “What about my change?”\n Oh, such an insolent silence! I wonder what you told them when they asked you about me, boy. He handed over the money. I tipped him a quarter, gave him a piece of Mr. Graves’ professional smile. He studied me. I turned and inserted the key into the lock of the Audi. A fifty-percent chance. Had I been the praying kind I might have prayed to one of those pitiful gods. The key turned without resistance; the door opened. The kid slouched back toward the clubhouse, pissed at me and his lackey’s job. Or perhaps he found it in his heart to smile. Laughter—the Best Medicine.\n A bit of a racing shift, then back to Interstate 70. My hip twinged all the way across Illinois.\n I had originally intended to work my way east to Buffalo, New York, but after the Oak Hill business I wanted to cut it short. If I stayed on the interstate I was sure to get caught; I had been lucky to get as far as I had. Just outside of Indianapolis I turned onto Route 37 north to Fort Wayne and Detroit.\n I was not, however, entirely cowed. Twenty-five years in one time had given me the right instincts, and with the coming of the evening and the friendly insects to sing me along, the boredom of the road became a new recklessness. Hadn’t I already been seen by too many people in those twenty-five years? Thousands had looked into my honest face—and where were they? Ruth had reminded me that I was not stuck here. I would soon make an end to this latest adventure one way or another, and once I had done so, there would be no reason in God’s green world to suspect me.\n And so: north of Fort Wayne, on Highway 6 east, a deserted country road (what was he doing there?), I pulled over to pick up a young hitchhiker. He wore a battered black leather jacket. His hair was short on the sides, stuck up in spikes on top, hung over his collar in back; one side was carrot-orange, the other brown with a white streak. His sign, pinned to a knapsack, said “?” He threw the pack into the backseat and climbed into the front.\n “Thanks for picking me up.” He did not sound like he meant it. “Where you going?”\n “Flint. How about you?”\n “Flint’s as good as anywhere.”\n “Suit yourself.” We got up to speed. I was completely calm. “You should fasten your seat belt,” I said.\n “Why?”\n The surly type. “It’s not just a good idea. It’s the law.”\n He ignored me. He pulled a crossword puzzle book and a pencil from his jacket pocket. “How about turning on the light?”\n I flicked on the dome light for him. “I like to see a young man improve himself,” I said.\n His look was an almost audible sigh. “What’s a five-letter word for ‘the lowest point’?”\n “Nadir,” I replied.\n “That’s right. How about ‘widespread’; four letters?”\n “Rife.”\n “You’re pretty good.” He stared at the crossword for a minute, then rolled down his window and threw the book, and the pencil, out of the car. He rolled up the window and stared at his reflection in it. I couldn’t let him get off that easily. I turned off the interior light, and the darkness leapt inside.\n “What’s your name, son? What are you so mad about?”\n “Milo. Look, are you queer? If you are, it doesn’t matter to me but it will cost you . . . if you want to do anything about it.”\n I smiled and adjusted the rearview mirror so I could watch him—and he could watch me. “No, I’m not queer. The name’s Loki.” I extended my right hand, keeping my eyes on the road.\n He looked at the hand. “Loki?”\n As good a name as any. “Yes. Same as the Norse god.”\n He laughed. “Sure, Loki. Anything you like. Fuck you.”\n Such a musical voice. “Now there you go. Seems to me, Milo—if you don’t mind my giving you my unsolicited opinion—that you have something of an attitude problem.” I punched the cigarette lighter, reached back and pulled a cigar from my jacket on the backseat, in the process weaving the car all over Highway 6. I bit the end off the cigar and spat it out the window, stoked it up. My insects wailed. I cannot explain to you how good I felt.\n “Take, for instance, this crossword puzzle book. Why did you throw it out the window?”\n I could see Milo watching me in the mirror, wondering whether he should take me seriously. The headlights fanned out ahead of us, the white lines at the center of the road pulsing by like a rapid heartbeat. Take a chance, Milo. What have you got to lose?\n “I was pissed,” he said. “It’s a waste of time. I don’t care about stupid games.”\n “Exactly. It’s just a game, a way to pass the time. Nobody ever really learns anything from a crossword puzzle. Corporation lawyers don’t get their Porsches by building their word power with crosswords, right?”\n “I don’t care about Porsches.”\n “Neither do I, Milo. I drive an Audi.”\n Milo sighed.\n “I know, Milo. That’s not the point. The point is that it’s all a game, crosswords or corporate law. Some people devote their lives to Jesus; some devote their lives to artwork. It all comes to pretty much the same thing. You get old. You die.”\n “Tell me something I don’t already know.”\n “Why do you think I picked you up, Milo? I saw your question mark and it spoke to me. You probably think I’m some pervert out to take advantage of you. I have a funny name. I don’t talk like your average middle-aged businessman. Forget about that.” The old excitement was upon me; I was talking louder and louder, leaning on the accelerator. The car sped along. “I think you’re as troubled by the materialism and cant of life in America as I am. Young people like you, with orange hair, are trying to find some values in a world that offers them nothing but crap for ideas. But too many of you are turning to extremes in response. Drugs, violence, religious fanaticism, hedonism. Some, like you I suspect, to suicide. Don’t do it, Milo. Your life is too valuable.” The speedometer touched eighty, eighty-five. Milo fumbled for his seat belt but couldn’t find it.\n I waved my hand, holding the cigar, at him. “What’s the matter, Milo? Can’t find the belt?” Ninety now. A pickup went by us going the other way, the wind of its passing beating at my head and shoulder. Ninety-five.\n “Think, Milo! If you’re upset with the present, with your parents and the schools, think about the future. What will the future be like if this trend toward valuelessness continues in the next hundred years? Think of the impact of the new technologies! Gene splicing, gerontology, artificial intelligence, space exploration, biological weapons, nuclear proliferation! All accelerating this process! Think of the violent reactionary movements that could arise—are arising already, Milo, as we speak—from people’s desire to find something to hold on to. Paint yourself a picture, Milo, of the kind of man or woman another hundred years of this process might produce!”\n “What are you talking about?” He was terrified.\n “I’m talking about the survival of values in America! Simply that.” Cigar smoke swirled in front of the dashboard lights, and my voice had reached a shout. Milo was gripping the sides of his seat. The speedometer read 105. “And you, Milo, are at the heart of this process! If people continue to think the way you do, Milo, throwing their crossword puzzle books out the windows of their Audis all across America, the future will be full of absolutely valueless people! Right, MILO?” I leaned over, taking my eyes off the road, and blew smoke into his face, screaming, “ARE YOU LISTENING, MILO? MARK MY WORDS!”\n “Y-yes.”\n “GOO, GOO, GA-GA-GAA!”\n I put my foot all the way to the floor. The wind howled through the window, the gray highway flew beneath us,\n “Mark my words, Milo,” I whispered. He never heard me. “Twenty-five across. Eight letters. N-i-h-i-l—”\n My pulse roared in my ears, there joining the drowned choir of the fields and the roar of the engine. Body slimy with sweat, fingers clenched through the cigar, fists clamped on the wheel, smoke stinging my eyes. I slammed on the brakes, downshifting immediately, sending the transmission into a painful whine as the car slewed and skidded off the pavement, clipping a reflecting marker and throwing Milo against the windshield. The car stopped with a jerk in the gravel at the side of the road, just shy of a sign announcing, WELCOME TO OHIO.\n There were no other lights on the road, I shut off my own and sat behind the wheel, trembling, the night air cool on my skin. The insects wailed. The boy was slumped against the dashboard. There was a star fracture in the glass above his head, and warm blood came away on my fingers when I touched his hair. I got out of the car, circled around to the passenger’s side, and dragged him from the seat into the field adjoining the road. He was surprisingly light. I left him there, in a field of Ohio soybeans on the evening of a summer’s day.\n The city of Detroit was founded by the French adventurer Antoine de la Mothe, sieur de Cadillac, a supporter of Comte de Pontchartrain, minister of state to the Sun King, Louis XIV. All of these men worshiped the Roman Catholic god, protected their political positions, and let the future go hang. Cadillac, after whom an American automobile was named, was seeking a favorable location to advance his own economic interests. He came ashore on July 24,1701, with fifty soldiers, an equal number of settlers, and about one hundred friendly Indians near the present site of the Veterans Memorial Building, within easy walking distance of the Greyhound Bus Terminal.\n The car did not run well after the accident, developing a reluctance to go into fourth, but I didn’t care. The encounter with Milo had gone exactly as such things should go, and was especially pleasing because it had been totally unplanned. An accident—no order, one would guess—but exactly as if I had laid it all out beforehand. I came into Detroit late at night via Route 12, which eventually turned into Michigan Avenue. The air was hot and sticky. I remember driving past the Cadillac plant; multitudes of red, yellow, and green lights glinting off dull masonry and the smell of auto exhaust along the city streets. I found the sort of neighborhood I wanted not far from Tiger Stadium: pawnshops, an all-night deli, laundromats, dimly lit bars with red Stroh’s signs in the windows. Men on street corners walked casually from noplace to noplace.\n I parked on a side street just around the corner from a 7-Eleven. I left the motor running. In the store I dawdled over a magazine rack until at last I heard the racing of an engine and saw the Audi flash by the window. I bought a copy of Time and caught a downtown bus at the corner. At the Greyhound station I purchased a ticket for the next bus to Toronto and sat reading my magazine until departure time.\n We got onto the bus. Across the river we stopped at customs and got off again. “Name?” they asked me.\n “Gerald Spotsworth.”\n “Place of birth?”\n “Calgary.” I gave them my credentials. The passport photo showed me with hair. They looked me over. They let me go.\n I work in the library of the University of Toronto. I am well-read, a student of history, a solid Canadian citizen. There I lead a sedentary life. The subways are clean, the people are friendly, the restaurants are excellent. The sky is blue. The cat is on the mat.\n We got back on the bus. There were few other passengers, and most of them were soon asleep; the only light in the darkened interior was that which shone above my head. I was very tired, but I did not want to sleep. Then I remembered that I had Ruth’s pills in my jacket pocket. I smiled, thinking of the customs people. All that was left in the box were a couple of tiny pink tabs. I did not know what they were, but I broke one down the middle with my fingernail and took it anyway. It perked me up immediately. Everything I could see seemed sharply defined. The dark green plastic of the seats. The rubber mat in the aisle. My fingernails. All details were separate and distinct, all interdependent. I must have been focused on the threads in the weave of my pants leg for ten minutes when I was surprised by someone sitting down next to me. It was Ruth. “You’re back!” I exclaimed.\n “We’re all back,” she said. I looked around and it was true: on the opposite side of the aisle, two seats ahead, Milo sat watching me over his shoulder, a trickle of blood running down his forehead. One corner of his mouth pulled tighter in a rueful smile. Mr. Graves came back from the front seat and shook my hand. I saw the fat singer from the country club, still naked. The locker-room boy. A flickering light from the back of the bus: when I turned around there stood the burning man, his eye sockets two dark hollows behind the wavering flames. The shopping-mall guard. Hector from the hardware store. They all looked at me.\n “What are you doing here?” I asked Ruth.\n “We couldn’t let you go on thinking like you do. You act like I’m some monster. I’m just a person.”\n “A rather nice-looking young lady,” Graves added.\n “People are monsters,” I said.\n “Like you, huh?” Ruth said. “But they can be saints, too.”\n That made me laugh. “Don’t feed me platitudes. You can’t even read.”\n “You make such a big deal out of reading. Yeah, well, times change. I get along fine, don’t I?”\n The mall guard broke in. “Actually, miss, the reason we caught on to you is that someone saw you walk into the men’s room.” He looked embarrassed.\n “But you didn’t catch me, did you?” Ruth snapped back. She turned to me. “You’re afraid of change. No wonder you live back here.”\n “This is all in my imagination,” I said. “It’s because of your drugs.”\n “It is all in your imagination,” the burning man repeated. His voice was a whisper. “What you see in the future is what you are able to see. You have no faith in God or your fellow man.”\n “He’s right,” said Ruth.\n “Bull. Psychobabble.”\n “Speaking of babble,” Milo said, “I figured out where you got that goo-goo-goo stuff. Talk—”\n “Never mind that,” Ruth broke in. “Here’s the truth. The future is just a place. The people there are just people. They live differently. So what? People make what they want of the world. You can’t escape human failings by running into the past.” She rested her hand on my leg. “I’ll tell you what you’ll find when you get to Toronto,” she said. “Another city full of human beings.”\n This was crazy. I knew it was crazy. I knew it was all unreal, but somehow I was getting more and more afraid. “So the future is just the present writ large,” I said bitterly. “More bull.”\n “You tell her, pal,” the locker-room boy said.\n Hector, who had been listening quietly, broke in. “For a man from the future, you talk a lot like a native.”\n “You’re the king of bullshit, man,” Milo said. “ ‘Some people devote themselves to artwork’! Jesus!”\n I felt dizzy. “Scut down, Milo. That means ‘Fuck you too.’ ” I shook my head to try to make them go away. That was a mistake: the bus began to pitch like a sailboat. I grabbed for Ruth’s arm but missed. “Who’s driving this thing?” I asked, trying to get out of the seat.\n “Don’t worry,” said Graves. “He knows what he’s doing.”\n “He’s brain-dead,” Milo said.\n “You couldn’t do any better,” said Ruth, pulling me back down.\n “No one is driving,” said the burning man.\n “We’ll crash!” I was so dizzy now that I could hardly keep from being sick. I closed my eyes and swallowed. That seemed to help. A long time passed; eventually I must have fallen asleep.\n When I woke it was late morning and we were entering the city, cruising down Eglinton Avenue. The bus had a driver after all—a slender black man with neatly trimmed sideburns who wore his uniform hat at a rakish angle. A sign above the windshield said, YOUR DRIVER—SAFE, COURTEOUS, and below that, on the slide-in nameplate, WILBERT CAUL. I felt like I was coming out of a nightmare. I felt happy. I stretched some of the knots out of my back. A young soldier seated across the aisle from me looked my way; I smiled, and he returned it briefly.\n “You were mumbling to yourself in your sleep last night,” he said.\n “Sorry. Sometimes I have bad dreams.”\n “It’s okay. I do too, sometimes.” He had a round open face, an apologetic grin. He was twenty, maybe. Who knew where his dreams came from? We chatted until the bus reached the station; he shook my hand and said he was pleased to meet me. He called me “sir.”\n I was not due back at the library until Monday, so I walked over to Yonge Street. The stores were busy, the tourists were out in droves, the adult theaters were doing a brisk business. Policemen in sharply creased trousers, white gloves, sauntered along among the pedestrians. It was a bright, cloudless day, but the breeze coming up the street from the lake was cool. I stood on the sidewalk outside one of the strip joints and watched the videotaped come-on over the closed circuit. The Princess Laya. Sondra Nieve, the Human Operator. Technology replaces the traditional barker, but the bodies are more or less the same. The persistence of your faith in sex and machines is evidence of your capacity to hope.\n Francis Bacon, in his masterwork The New Atlantis, foresaw the utopian world that would arise through the application of experimental science to social problems. Bacon, however, could not solve the problems of his own time and was eventually accused of accepting bribes, fined £40,000, and imprisoned in the Tower of London. He made no appeal to God, but instead applied himself to the development of the virtues of patience and acceptance. Eventually he was freed. Soon after, on a freezing day in late March, we were driving near Highgate when I suggested to him that cold might delay the process of decay. He was excited by the idea. On impulse he stopped the carriage, purchased a hen, wrung its neck, and stuffed it with snow. He eagerly looked forward to the results of his experiment. Unfortunately, in haggling with the street vendor he had exposed himself thoroughly to the cold and was seized by a chill that rapidly led to pneumonia, of which he died on April 9, 1626.\n There’s no way to predict these things.\n When the videotape started repeating itself I got bored, crossed the street, and lost myself in the crowd.\n Originally published in Isaac Asimov’s Science Fiction Magazine, March 1986.\n John Kessel is the author of the forthcoming novel The Moon and the Other. His other novels are Good News from Outer Space and Corrupting Dr. Nice and in collaboration with James Patrick Kelly, Freedom Beach. His short story collections are Meeting in Infinity, The Pure Product, The Baum Plan for Financial Independence and Other Stories and The Collected Kessel. His fiction has twice received the Nebula Award, in addition to the Theodore Sturgeon Memorial Award, the Locus Award, and the James Tiptree Jr. Award. His play \"Faustfeathers\" won the Paul Green Playwright's Prize, and his story \"A Clean Escape\" was adapted as an episode of the 2006 ABC TV series Masters of Science Fiction. In 2009 his story \"Pride and Prometheus\" received both the Nebula and the Shirley Jackson Awards.\n With Kelly, he has edited six anthologies of stories re-visioning contemporary short speculative fiction, most recently Digital Rapture: The Singularity Anthology (2012) and Kafkaesque (2011).\n Kessel has taught American literature and fiction writing at North Carolina State University since 1982, helped found the NCSU MFA program in creative writing, and served twice as its director. He lives with his wife, the novelist Therese Anne Fowler, in Raleigh."}