{"fingerprint": "TAqwqRvRl77GmBONz+HZ/aQEhHs=", "sitename": "Clarkesworld Magazine", "title": "Breathe by Cassandra Khaw", "author": "Cassandra Khaw", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/khaw_05_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Breathe by Cassandra Khaw", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2640 words, short story\nBreathe\nBreathe.\nThe water is cold.\nBreathe.\nLightless, the ocean is without dimension, only a blackness unyielding. There is no sound, no movement. Nothing but the percussion of ventricles in labor and the frayed rasp of your breath as you suck in stale, processed air.\nBreathe.\nAh. There. You see it in the distance, a speckling of iridescence; indigo and motes of searing cyan, adrift on hoarfrost filaments no bigger than the width of a hair. Noctiluca Janus, the only color in this alien world and somehow, the only life.\nThe theory of its biology is faultless; unicellular simplicity, self-devouring, self-sustaining, both predator and prey, alternatively cryptobiotic and savagely proliferative, a perfect answer to an imperfect world. But it is still bizarre to you that nothing else exists in tandem. Not even a divergent subspecies differentiated by a single genome. Nothing but this gasp of cold light in that endless dark.\nBreathe.\nLike floating in God’s womb, Lisa had joked. The others laughed and you laughed with them, nervous, unwilling to admit to miscalculated bravado ten thousand light-years away from viable resolution. The truth is you’re terrified. No matter how hard you try, you cannot participate in the communion of your crewmates’ rapture, cannot decipher their willingness to plunge into the abyss, over and over, pirouetting like children unburdened by parents, or atheists untethered by scripture.\nBreathe.\nThe water is black, cold. Eternal.\nBreathe.\nYou glide fingertips over the equipment on your belt, enumerating them by touch: flash light, flare gun, nitrox analyzer, knives, strobe. Their presence is a benediction, the solidity of the rosary beads you abandoned with religion.\nYou breathe; you shudder.\nYou press a button on your com-unit, hear the rustle of static. It takes only a minute before the noise resolves into your communication officer’s clear, deep voice. You remember joking with him over tasteless mugs of warm, re-hydrated soup that he’d missed his calling as a radio host. You remember other things too: the way his laugh hummed against your skin, the texture of his fingertips on the juncture between your waist and hip.\nYou push those memories down.\n“This is Poseidon. What’s your status?”\n“Persephone-035573 . . . ” The numbers roll easily from your tongue. You won’t admit it to anyone, especially not after your lecture on the commercialization of Grecian myth, but you’ve developed a fondness for your call sign. Persephone, Hades’ grudging spouse, doomed to darkness by momentary weakness. Just like you. “Noctiluca Janus appears to have just initiated its breeding cycle. Everything looks on track. If current conditions hold, I estimate that we’d be able to begin harvest in six hours.”\n“Six hours,” an incredulous noise. “That thing moves fast.”\n“Yeah.” You consider a lie but dismiss it with the next breath. Bubbles knife through the water, obscuring your vision, and briefly, you’re wracked by a terror almost biblical in stature. You clench pelvic muscles, try not to piss your suit.\nBreathe.\n“When can I get out of here?”\n“Soon.”\nBreathe.\n“How soon is ‘soon?’ Two minutes? Three hours? Sixteen days? How long before I can get the fuck out of here?” The words thump hot against your throat, your skull, the basin of your eye sockets. Every syllable invokes another spasm of localized anguish, the pinpoint magnesium-white sparking of a migraine. Your throat swells with panic.\nBreathe.\n“Soon, okay? I promise. We’ll get you out of there before you know it. Just think about fuzzy blankets and hot cocoa. Talk to me. Come on. What’s the first thing you want to do when you get out of there?” he says. His voice is warm and rich, maple-smoke and summer nights; you wish you could spoon it into a jar, keep it on a table beside your bed so you could dole it out across a lifetime of three AM terrors, of waking up and realizing you’re alone.\n“A hot shower.” Your laugh cracks and your voice is thick and caked with dread, but it doesn’t matter. He swaddles you in the rolling cadence of his answering laugh, forest-scent, the muffled sweetness of your father’s old radio, an effortless thing that almost convinces you that everything will be okay.\nBreathe.\n“Really? You’d think that you’d be tired of being wet already? But I promise. Soon,” He says for the third time and you’re not sure if it is the mythic quality prescribed to the number three, or the fact you two shared a moment that does it, but something loosens in your ribs.\nYou breathe.\n“I don’t understand why I need to be out here.”\n“Because humans have something called ‘instinct’ and it’s far easier to have a surveyor present than to pick out through a thousand pages of dry, cold facts.” You hear the crinkle of plastic wrap and rhythmic mastication, teeth pulping chocolate-lined biscuits. It’s an incongruous, ludicrous noise, so domestic and out-of-place that you laugh, a bark of sound that cuts itself short on the knife of your desperate delight.\n“What’s so funny?” He asks and you hear the weight of a pout caught in the lower octaves.\n“Nothing.” Your attention diverts to the Noctiluca Janus, it’s denser now, no longer improbably ethereal, but a nebulae spiraling outwards, tendrils of variegated cyan outstretched in silent supplication. “It’s just—should you be eating that?”\n“I know it’s not the best lunch—”\n“No.” You laugh and this time, it is strong and clear and real. “God. You’re the absolute worst.”\nBreathe.\nIt staggers you as to how quickly you invoke his name, how easily it slips from your throat like the voice of a frightened child, naïve and needful, conscious that no one is listening but unable to resist the impulse to reach out. You might not be able to will a hope into existence but if you believe hard enough, perhaps you can keep it suspended between being and not-being.\nSchrödinger’s deity, you think, mouth clumping into a smile.\n“Am not,” He retorts, petulant, voice muffled, and you laugh out loud again. For the gap of a heartbeat, the water is not as cold as you recall, not as terrible.\nYou breathe.\n“Are too.”\n“Am not.” You hear a gulp, a sigh of pleasure, the noise of a table being resequenced for function; porcelain and plastic sliding over metal, paper being crumpled, the creak of an aging desk chair. “You know, I could probably do this all day.”\nBreathe.\n“Can not.”\n“Can too.”\n“How does it look?”\nBreathe.\n“Beautiful.”\nReverence chokes your lungs. It leaves no room for dread, no space for misgivings. There is only awe, cold and sharp, an austere worship like the cathedrals of your childhood. But where those were stone, Noctiluca Janus is life effervescent, enormous.\nEverywhere.\nYou scoop fingers through the teeming light and the algae pulses brighter, rivulets of turquoise and ultramarine. You close a fist. The strands disparate into motes, into starbursts; phantasmagoric shapes like a hallucination of heaven. It is the most incredible thing you’ve seen. It is the most terrible.\n“Cultivable state?”\nYou pause, riveted by the incandescence, transfixed by a single, sobering thought: what would happen if this gets loose? You picture the waters of Earth, the lakes and the tributaries, the streams and the seas, swelling with the luminous eukaryotes. Mid-way, your imagination mutates, and the rivers become arteries, become veins like blue-green fronds. You can see it clearly: the Noctiluca Janus carousing with red platelets, shading to teal in currents of plasma. Growing. Growing. Growing. Until it infiltrates every tissue, infests every tendon, invades every delicate, pustulant alveoli.\nBreathe.\n“Persephone-035573?”\nBreathe.\n“Persephone-035573. Report.”\nBreathe.\n“Alice!”\nThe sound of your name tows you back to awareness. Around you, the algae crowds closer, burns brighter. Your eyes water from their effulgence. And it is all you can do not to scream.\n“Alice? Are you there?”\nBreathe.\nInhale. Exhale. You count the seconds between each action, lengthen the intervals, slow the wheezing palpitation of your lungs. Inhale. Exhale. “Yes.”\n“What happened?”\n“N-nothing. Nothing at all,” Your voice quivers through the lie but he does not call you out. Instead, he grunts affirmation, falls silent. And then, a telomere of music drips through the com-link, too soft at first to decipher. But slowly, it clarifies into saxophone and bass guitar, the rhythmic thump of heel on wood, an old bluesman’s smoke-scratched voice. He’s singing about the deal he made with the devil and you can’t help but think you’ve walked that same mile too. “Line got cut.”\nBreathe.\n“Okay.” He cups the word in his mouth for a second before he lets go. “Well, if it’s any consolation, we’re about ready to start rolling out the welcome mat. You’ve done your time. You can come home now.”\nHome. The word is an ache in your ribs, is a hurt like a tumor wedged between your bones or the arms of someone who is no longer your own. The submersible is not home. The ship isn’t home. None of it is home in the way you know home to be. But you don’t argue. You’ve embarrassed yourself enough already. Instead, you grope for the line that tethers you to your drone and pull yourself along, fist over fist, a newborn retracing its pilgrimage from the womb.\nRelief boils as you make contact with the steel and you’re on the verge of popping open the hatch when you turn, clumsy in the skin of your suit, flesh prickling with unease. One last look around. One last check. You’re not sure what it is but something tugs like a hook in your lip. You scan the myriad of dazzling, scintillant blues, search it for clues. The algae has grown astronomically in the last few hours, seething and churning, mobilized by the ocean currents. Where once there was only blackness, now there is only light.\nWait.\nYour eyes adjust. You begin to pick out anomalies in the effulgent topology, fibrous tissue incongruent with your knowledge of the Noctiluca Janus. Slowly, too slowly, you assemble an epiphany out of the dangling cnidocytes, the clusters of ganglia, almost invisible against that backdrop of searing cyan.\nBreathe.\nYou were wrong.\nYou were all wrong.\nThere was another life here. There had always been another life, a predatory counterpart, nameless but no less dangerous for its anonymity. You arrive at this realization just as the communication channels are flung open and the shrill hysteria of the crew blares through the frequency. In horror, you watch as medusae gather like a funeral caul over the submersible, clotting engines and vents, a frenzy of glowing, diaphanous bodies.\nBreathe.\nThe world compresses into individual heart beats. Between every contraction, you make an inventory of your circumstances, of possible escape routes and survival plans. You turn them, over and over, dissect them, splay them, empty them in pursuit of a solution. But nothing satisfies. Your pulse roaring in your ears, you arrive again at the truth you’d known from the start: none of you will survive this.\nBreathe.\n“Alice! Alice? Are you there?”\n“Theo!” You scream back. “What is going on there?”\n“Fuck me—” A raw-throated shriek of rage. No, more a bellow, a foghorn challenge, still deep and percussive despite the madness. Metal screeches. Glass breaks. In the distance, the ship judders and convulses, fighting to disentangle from the creatures that are bearing it down, down, down into the blackness, pseudopods searching. “—fuck. Get the fuck off me! Fucking hell, you—Alice. Are you still listening!”\n“Yes!”\n“We’re—we’re dead here.” His voice, thinned to a knife-point, shakes. “The ship’s going down. But—but I think I can get something out to you. Supplies. It should be enough—god, you might need to eat your leg or something. But it’s a shot.”\n“No, no, no. You’re going to let those things in—”\n“So? Alice, we’re all—there’s no—” Another crash, another scream. “—point in trying to prolong the inevitable. We’re dead.”\n“No.”\nNo. The word repeats. No. No. No. Not after all these weeks of adjustment, these nights of flensing the desire from your affection, of learning to make holy a love that was once written in bare skin and salt-kissed heat and the tickle of his stubble against the cool of your skin. No.\nHe’s shouting at you now, firing trajectories, demanding calibration, intent on making you listen. But you refuse. There’s only a sixteen-percent chance, anyway, of you surviving long enough for a rescue to matter. You’re all going to die.\nBreathe.\nYou gulp air in quick, ragged bursts, but it doesn’t seem to be enough. Nothing seems to be enough. Desperate, you run your gaze over your drone, over the noose of tools around your waist. Not enough. Not enough. There’s not enough time to think, to feel, to plan. Not enough.\nNerveless, your fingers spasm close over the flare gun.\n“I have an idea.”\nYou have no idea if it will work. Theories like this are developed over months of meticulous research, of interpretation, of cross-checking and fact-checking, of scientific journals and peer review. But there is no time for anything but impulse and instinct and does it matter, anyway?\n“Tell the crew to kill everything they can. The engines, the lights, the—the breathing machines or, or whatever. Power down as far as you can go.”\n“This is fucking insane. What the fuck do you—”\n“They’re drawn by heat, right? Or light? They have to be. That’s the only way they could identify the Janus in the dark.” Inhale. Exhale. Inhale. Exhale. You try to not think about what you’re doing, what it means. If you linger too long on the ramifications of your endeavor, self-preservation will kick in. So, you don’t. You breathe instead. Inhale. Exhale. Inhale. Exhale. “I’m going to make an explosion. Hopefully, there’ll be enough time for them to drift over, and you’ll be able to get out—”\n“You’re kidding me—”\n“No. I haven’t been more serious about anything else in my life.”\n“You can’t—”\n“I love you.” The words dart free before you can stem their escape, and you can’t tell if the sound that follows is a laugh or a sob, only that it wrenches at your core like it’d turn you inside out. “I love you so much. And I wish everything that happened had not happened and you better fucking survive this and get out of here and have kids and grow old and—”\n“Alice.”\n“—and you better name this other shit after me and—”\n“Alice!”\n“And I love you. I love you, I love you, I love you. And oh, god. It feels so good to say that. I love you. I love you.”\nBreathe.\n“Goodbye.”\nThe world erupts into chemical fire.\nBreathe.\nEverything burns. Every sensory receptor, every atom of your being, every cell is alive with pain. You feel amorphous, formless, bereft of shape. There is no you that is not also agony, also the crisping of your skin, the cooking of your muscle. You are anguish. You burn.\nBreathe.\nExcept you can’t. You splutter and gasp, but there is no air to consume. Nothing but the water that floods your lungs, salt-taste in your nose and on your tongue. You choke.\nBreathe.\nYou hold that last imperative like a prayer. Your heart strains, sings it with every desperate contraction. Already, you can feel consciousness ebbing, your oxygen-starved brain writing haphazard paeans to a life adequately spent, neurons misfiring, recalling memories out of chronological order. A light grows, striated by humanoid silhouettes. What is that? You begin to think, only to stop yourself. No. No time for that. Focus on breathing. Inhale. Exhale. Inhale. Exhale. Focus on staying alive.\nBreathe.\nThe blackness closes in and for a moment, you think you feel a pressure around your wrist, arms about your body, and a voice that is not your own telling you to breathe, breathe, breathe.\nCassandra Khaw writes horror, video games, tweets for money, articles about video games, and tabletop RPGs. These are not necessarily unrelated items. Her work can be found in professional short story magazines such as Clarkesworld, Fireside Fiction, Uncanny, and Shimmer. Cassandra's first paranormal rom-com Bearly a Lady released this year. Her recent Lovecraftian Southern Gothic, A Song for Quiet, is a considerably different animal."}