{"fingerprint": "7eLrqCzgMpvHIbAf5w9sWXg/Nng=", "sitename": "Clarkesworld Magazine", "title": "Finding the Language I Need: A Conversation with Caitlín R. Kiernan by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kiernan_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Finding the Language I Need: A Conversation with Caitlín R. Kiernan by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Finding the Language I Need: A Conversation with Caitlín R. Kiernan\n Born in Ireland, raised in Alabama, Caitlín Kiernan now lives in Rhode Island. Each of these evocative locales has influenced her science fiction and dark fantasy novels and short stories. An early interest in paleontology, archaeology, and snakes led her to a career in paleontology and teaching.\n A love of reading led her to writing fiction.\n \"There's no way to come to writing unless one has first been a reader, and a careful, dedicated reader, at that. And one must remain a reader,\" said Kiernan. \"Everything about reading teaches me something about writing. What has it taught me in particular? Everything that I did not learn simply by living, that's what reading has taught me about writing fiction.\"\n Kiernan is the author of the recent The Red Tree, six other novels, and one novelization (of the 2007 motion picture, Beowulf). Her recent short story collections from Subterranean Press Tales from the Woeful Platypus and A is for Alien will be followed up with the forthcoming The Ammonite Violin & Others and Confessions of a Five-Chambered Heart.\n Her tales are populated with ghouls and changelings, demon-slayers and werewolves; they are as atmospheric as narcotic hallucinations, folk tales and nightmares. At the heart of most of her books are characters experiencing existential shock and characters sorting through messy relationships.\n Below, Kiernan and I talk about writing, paleontology, and finding the language she needs after all these years at the craft.\n What, ultimately, do you write about?\n I've written so much over the last eighteen years, this seems like an almost impossible question to answer. At least, it seems almost impossible to answer it concisely. But if I put my best reductionist thinking cap on, and try very, very hard, I suppose I would say that, ultimately, I'm writing about a relatively small number of things.\n The weight the past exerts on the present, that's a big one. Encounters with the Other, and the almost inevitably transformative nature of those encounters, that's another theme that's present in almost everything I've ever written. Also, the insignificance of humanity when faced with deep time and the vastness of the universe. No, never mind the vast universe. Humanity's insignificance when faced with the depth of the ocean, or the distance to the edge of our own solar system, or, inversely, the space between an electron and an atom's nucleus. Anyway, on a more personal level, I'm often writing about insanity, or at least the unreliability of perception and cognition. I write quite a bit about gender.\n So, what does this all add up to, ultimately? Sometimes I think of it as existential shock. I'm writing about existential shock, and by this I mean, simply, the shock that arises from the realization that the world is not only not what we think it is, but the realization that we can probably never arrive at conclusive answers about reality. Nothing is as it seems, and even if is it, there's probably no way to know.\n What do you enjoy about writing fiction?\n Typing \"The End.\" Getting paid. No, seriously, I'm not a writer who loves to write. Usually, I'm not even a writer who enjoys writing. Mostly, I find it a very disagreeable and treacherous way to make one's living. Sometimes, if I'm lucky, there are glimmers of satisfaction at having done the best I can do, the best at any given moment in time. Or, more rarely, I'll lose myself in a story I'm telling, and there's a certain joy in allowing it to buoy me along towards the conclusion, because I want to know how it all turns out. I rarely ever know why a story ends before I finish it.\n Lately, I've been more satisfied with my writing, with the pieces I do for Sirenia Digest, and with The Red Tree, and my two most recent collections, A is for Alien and The Ammonite Violin & Others. I feel like after all these years, after almost two decades of writing, I'm finally beginning to find the language I need.\n How has your understanding of the craft changed over the years?\n I don't know if it has. Maybe my understanding of the process — I never think in terms of craft — has been refined somewhat. Near as I can recall, it began as a search for voice, and has been a successive series of experiments in style and syntax. I look back at my early novels and short stories, and it's obvious that I was obsessed with tearing apart language and putting it together in new ways. I was infatuated with the Modernists, and with more contemporary authors like Kathy Acker, William Burroughs, and, well, it's a long list. But also with the earnest, wide-eyed wonder I'd seen in Ray Bradbury's work, and the lushness of Baudelaire and Angela Carter, the rusty edges of Harlan Ellison's prose. I wanted to find the secret to the soft-spoken madness of Shirley Jackson's work, and the cosmicism and mastery of mood I saw in Lovecraft, Lord Dunsany, Arthur Machen, and Algernon Blackwood. I wanted to create a mad fusion of voices, a distillation, of all these authors, that I could then wield to my own ends. But what has happened, instead, is that I've found my own voice, admittedly greatly influenced by these writers and many, many more. I feel as if I'm not answering the question you've asked, but I really don't sit around pondering process a great deal. For me, writing is a thing I do. And often I have no idea how I do it. I sit down and do it.\n Are there any similarities between the study of paleontology and writing fiction?\n Yes, in the sense that I'm motivated in both these endeavors by very similar needs and desires. I need a world filled with wonder, with awe, with awful things. I couldn't exist in a world devoid of marvels, even if the marvels are terrible marvels. Even if they frighten me to consider them. What would be the point of a world like that, a humdrum world of known quantities and everyday expectations? A lot of people don't grasp the importance of uncertainty to the scientific enterprise. A fact is only a momentary model of some aspect of the universe, backed by explanatory theory, waiting to be revised upon further study.\n Likewise, my stories rely upon uncertainty, the inscrutable nature of both the human mind and the fantastic. Also, just as science is an undertaking that requires endless revision in search of one ideal truth that will likely always lie beyond the grasp of the scientist, so my writing has passed through innumerable stages of reinvention. I'll think I have it all figured out. For example, when Tales of Pain and Wonder was first published in 2000, I thought, This is the best thing I'll ever write. I'll never get it more right than I have in this book. But now, I look at that collection, and despite whatever strengths it might have, I know that I wasn't even close.\n And as much as I love what I'm writing now, I expect I'll look back at it in a decade and wonder how I ever could have thought I was even close to getting it right. So, my writing and the work I've done in paleontology are alike in that they both require an acceptance of perpetual uncertainty in pursuit of unobtainable certainty, and they both require a willingness to tear down cherished constructions when something better comes along.\n Where do you feel the most comfortable — novels, short stories, or comics? And is comfortable necessarily a good thing?\n Well, no. Comfortable is never a good thing, for any sort of artist. You get comfortable and you stop growing. You stop growing and the work is dead. Stop growing and you're just typing. So, I'll answer this by saying that I seem to derive the most gratification from writing short stories. They're succinct. They're not so lashed by the tyranny of plot.\n I write novels, and sometimes I even think I write novels well, but I'm extremely frustrated at the need for such long novels. I sign contracts to write novels with a minimum word count of, say, one hundred thousand words. Nothing could be more inimical to good writing than forcing a story to be longer than it needs to be, in order to satisfy consumer expectations of how long a novel \"ought\" to be. I tend to find most novels are these vast unwieldy things. Too often, the inherently contrived nature of all fictional narrative is, in novels, forced to go on so long that the contrivances become exhausting, annoying, trite. That's one reason I look at The Red Tree and consider it my best novel yet. It's more like my short fiction, more concerned with mood and character and theme than with some clever, unwieldy plot.\n As for comics, that was an odd detour for me, I think. Some of the work I did on The Dreaming, I'm still quite fond of it, but some of it's a mess. And I think there's an inherently collaborative nature to doing comics — at least for a big publisher like DC — that I'm ill-suited for. It was never just me writing a script, or even just me working with an artist. It was me haggling with editors and their superiors about whether or not I could write what I wanted to write, and often I lost those arguments. It was an endless series of compromises. And I always had to consider so many other people in the chain of production — the penciler, the inker, the colorist, the letterer, and that was after navigating the maze of editors and executives. I'm better when I'm left to my own devices.\n And left to my own devices, I prefer to write short fiction and novellas.\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}