{"fingerprint": "k9/NobU5K5NiTffMDK7G8GJ/vAk=", "sitename": "Clarkesworld Magazine", "title": "Riding the White Bull by Caitlin R. Kiernan", "author": "Caitlín R Kiernan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kiernan_06_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Riding the White Bull by Caitlin R. Kiernan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11200 words, novelette, REPRINT\n Riding the White Bull\n “You’ve been drinking again, Mr. Paine,” Sarah said, and I suppose I must have stopped whatever it was I was doing, probably staring at those damned pics again, the ones of the mess the cops had turned up that morning in a nasty little dump on Columbus—or maybe chewing at my fingernails, or thinking about sex. Whatever. Something or another that suddenly didn’t matter anymore because she wasn’t asking me a question. Sarah rarely had time for questions. She just wasn’t that sort of a girl anymore. She spoke with a directness and authority that would never match her pretty artificial face, and that dissonance, that absolute betrayal of expectation, always made people sit up and listen. If I’d been looking at the photos—I honestly can’t remember—I probably laid them down again and looked at her, instead.\n “There are worse things,” I replied, which I suppose I thought was some sort of excuse or defense or something, but she only scowled at me and shook her head.\n “Not for you there aren’t,” she whispered, speaking so low that I almost couldn’t make out the words over the faint hum of her metabolic servos and the rumble of traffic down on the street. She blinked and turned away, staring out my hotel window at the dark gray sky hanging low above the Hudson. The snow had finally stopped falling and the clouds had an angry, interrupted intensity to them. Jesus. I can remember the fucking clouds, can even assign them human emotions, but I can’t remember what I was doing when Sarah told me I was drinking again. The bits we save, the bits we throw away. Go figure.\n “The Agency doesn’t need drunks on its payroll, Mr. Paine. The streets of New York are full of drunks and junkies. They’re cheaper than rat shit. The Agency needs men with clear minds.”\n Sarah had a way of enunciating words so that I knew they were capitalized. And she always capitalized Agency. Always. Maybe it was a glitch in one of her language programs, or, then again, maybe she just made me paranoid. Sarah and the booze and the fucking Agency and, while I’m on the subject, February in Manhattan. By that point, I think I’d have given up a couple of fingers and a toe to be on the next flight back to LA.\n “We hired you because Fennimore said you were sober. We checked your records with the Department of—”\n “Why are you here, Sarah? What do you want? I have work to do,” and I jabbed a thumb at the cluttered desk on the other side of my unmade bed. “Work for you and the Agency.”\n “Work you can’t do drunk.”\n “Yeah, so why don’t you fire my worthless, intoxicated ass and put me on the next jump back to Los Angeles? After this morning, I honestly couldn’t give a shit.”\n “You understood, when you took this job, Mr. Paine, that there might be exceptional circumstances.”\n She was still staring out the window towards the sludgy, ice-jammed river and Jersey, an almost expectant expression on her face, the sullen winter light reflecting dull and iridescent off her unaging dermafab skin.\n “We were quite explicit on that point.”\n “Of course you were,” I mumbled, half to myself, even less than half to the cyborg who still bothered to call herself Sarah, and then I stepped around the foot of the bed and sat down on a swivel-topped aluminum stool in front of the desk. I made a show of shuffling papers about, hoping that she’d take the hint and leave. I needed a drink and time alone, time to think about what the hell I was going to do next. After the things I’d seen and heard, the things in the photographs I’d taken, the things they wouldn’t let me photograph, I was beginning to understand why the Agency had decided not to call an alert on this one, why they were keeping the CDC and BioCon and the WHO in the dark. Why they’d called in a scrubber, instead.\n “It’ll snow again before morning,” Sarah said, not turning away from the window.\n “If you can call that crap out there snow,” I replied, impatiently. “It’s not even white. It smells like . . . fuck, I don’t know what it smells like, but it doesn’t smell like snow.”\n “You have to learn to let go of the past, Mr. Paine. It’s no good to you here. No good at all.”\n “Is that Agency policy?” I asked, and Sarah frowned.\n “No, that’s not what I meant. That’s not what I meant at all.” She sighed then, and I wondered if it was just habit or if she still needed to breathe, still needed oxygen to drive the patchwork alchemy of her biomechs. I also wondered if she still had sex and, if so, with what. Sarah and I had gone a few rounds, way back in the day, back when she was still one-hundred percent flesh and blood, water and bone and cartilage. Back when she was still scrubbing freelance, before the Agency gave her a contract and shipped her off to the great frozen dung heap of Manhattan. Back then, if anyone had asked, I’d have said it was her life, her decisions to make, and a girl like Sarah sure as fuck didn’t need someone like me getting in her way.\n “I was trying to say—here, now—we have to live in the present. That’s all we have.”\n “Forget it,” I told her, glancing up too quickly from the bloody, garish images flickering across the screen of my old Sony-Akamatsu laptop. “Thanks for the ride, though.”\n “No problem,” Sarah whispered. “It’s what I do,” and she finally turned away from the window, the frost on the Plexiglas, the wide interrupted sky.\n “If I need anything, I’ll give you or Templeton a ring,” I said and Sarah pretended to smile, nodded her head, and walked across the tiny room to the door. She opened it, but paused there, one foot across the threshold, neither in nor out, the heavy, cold air and flat fluorescent lighting from the hallway leaking in around her, swaddling her like a second-rate halo.\n “Try to stay sober,” she said. “Please. Mr. Paine. This one . . . it’s going to be a squeeze.” And her green-brown eyes shimmered faintly, those amazing eight-mill-a-pair spheres of fiber-optic filament and scratch-resistant acrylic, tinted mercury suspension-platinum lenses and the very best circuitry German optimetrics had figured out how to cram into a 6.5 cc socket. I imagined, then or only later on—that’s something else I can’t remember—that the shimmer stood for something Sarah was too afraid to say aloud, or something the Agency’s behavioral inhibitors wouldn’t allow her to say, something in her psyche that had been stamped Code Black, Restricted Access.\n “Please,” she said again.\n “Sure. For old time’s sake,” I replied.\n “Whatever it takes, Mr. Paine,” and she left, pulling the door softly closed behind her, abandoning me to my dingy room and the dingier afternoon light leaking in through the single soot-streaked window. I listened to her footsteps on the tile, growing fainter as she approached the elevator at the other end of the hall, and when I was sure she wasn’t coming back, I reached for the half-empty bottle of scotch tucked into the shadows beneath the edge of the bed.\n Back then, I still dreamed about Europa every fucking night. Years later, after I’d finally been retired by the Agency and was only Dietrich Paine again, pensioned civilian has-been rotting away day by day by day in East LA or NoHo or San Diego—I moved around a lot for a drunk—a friend of a friend’s croaker hooked me up with some black-market head tweaker. And he slipped a tiny silver chip into the base of my skull, right next to my metencephalon, and the bad dreams stopped, just like that. No more night flights, no more cold sweats, no more screaming until the neighbors called the cops.\n But that winter in Manhattan, I was still a long, long decade away from the tweaker and his magic silver chip, and whenever the insomnia failed me and I dozed off for ten or fifteen or twenty minutes, I was falling again, tumbling silently through the darkness out beyond Ganymede, falling towards that Great Red Spot, that eternal crimson hurricane, my perfect, vortical Hell of phosphorus-stained clouds. Always praying to whatever dark Jovian gods might be watching my descent that this time I’d sail clear of the moons and the anti-cyclone’s eye would swallow me at last, dragging me down, burning me, crushing me in that vast abyss of gas and lightning and infinite pressure.\n But I never made it. Not one single goddamn time.\n “Do you believe in sin?” Sarah would ask me, when she was still just Sarah, before the implants and augmentations, and I would lie there in her arms, thinking that I was content, and stare up at the ceiling of our apartment and laugh at her.\n “I’m serious, Deet.”\n “You’re always serious. You’ve got serious down to an exact science.”\n “I think you’re trying to avoid the question.”\n “Yeah, well, it’s a pretty silly fucking question.”\n “Answer it anyway. Do you believe in sin?”\n There’s no way to know how fast I’m moving as I plummet towards the hungry, welcoming storm, and then Europa snags me. Maybe next time, I think. Maybe next time.\n “It’s only a question,” Sarah would say. “Stop trying to make it anything more than that.”\n “Most of us get what’s coming to us, sooner or later.”\n “That’s not the same thing. That’s not what I asked you.”\n And the phone would ring, or I’d slip my hand between her unshaven legs, or one of our beepers would go off, and the moment would melt away, releasing me from her scrutiny.\n It never happened exactly that way, of course, but who’s keeping score?In my dreams, Europa grows larger and larger, sprouting from the darkness exactly like it did in the fucking orientation vids every scrubber had to sit through in those days if he or she wanted a license. Snippets of video from this or that probe borrowed for my own memories. Endless fractured sheets of ice the color of rust and sandstone, rising up so fast, so fast, and I’m only a very small speck of meat and white EMU suit streaking north and east across the ebony skies above Mael Dúin, the Echion Linea, Cilix, the southeastern terminus of the Rhadamanthys Linea. I’m only a shooting star hurtling along above that terrible varicose landscape, and I can’t remember how to close my eyes.\n “Man, I was right fucking there when they opened the thing,” Ronnie says again and takes another drag off her cigarette. Her hand trembles and ash falls to the Formica tabletop. “I’d asked to go to Turkey, right, to cover the goddamn war, but I pulled the IcePIC assignment instead. I was waiting in the pressroom with everyone else, watching the feed from the quarantine unit when the sirens started.”\n “The Agency denies you were present,” I reply as calmly as I can, and she smiles that nervous, brittle smile she always had, laughs one of her dry, humorless laughs, and gray smoke leaks from her nostrils.\n “Hell, I know that, Deet. The fuckers keep rewriting history so it always comes out the way they want it to, but I was there, man. I saw it, before they shut down the cameras. I saw all that shit that ‘never happened’,” and she draws quotation marks in the air with her index fingers.\n That was the last time I talked to Ronnie, the last time I visited her out at La Casa Psychiatric, two or three weeks before she hung herself with an electrical cord. I went to the funeral, of course. The Agency sent a couple of black-suited spooks with carefully-worded condolences for her family, and I ducked out before the eulogy was finished.\n And here, a few kilometers past the intersection of Tectamus Linea and Harmonia Linea, I see the familiar scatter of black dots laid out helter-skelter on the crosscut plains. “Ice-water volcanism,” Sarah whispers inside my helmet; I know damn well she isn’t there, hasn’t been anywhere near me for years and years, and I’m alone and only dreaming her voice to break the deafening weight of silence. I count the convection cells like rosary beads, like I was ever Catholic, like someone who might have once believed in sin. I’m still too far up to see any evidence of the lander, so I don’t know which hole is The Hole, Insertion Point 2071A, the open sore that Emmanuel Weatherby-Jones alternately referred to as “the plague gate” and “the mouth of Sakpata” in his book on the Houston incident and its implications for theoretical and applied astrobiology. I had to look that up, because he never explained who or what Sakpata was. I found it in an old book on voodoo and Afro-Caribbean religions. Sakpata is a god of disease.\n I’m too far up to guess which hole is Sakpata’s mouth and I don’t try.\n I don’t want to know.\n A different sort of god is patiently waiting for me on the horizon.\n “They started screaming,” Ronnie says. “Man, I’ll never forget that sound, no matter how many pills these assholes feed me. We all sat there, too fucking stunned to move, and this skinny little guy from CNN—”\n “Last time he was from Newsweek,” I say, interrupting her, and she shakes her head and takes another drag, coughs and rubs at her bloodshot eyes.\n “You think it makes any goddamned difference?”\n “No,” I reply dishonestly, and she stares at me for a while without saying anything else.\n “When’s the last time you got a decent night’s sleep?” she asks me, finally, and I might laugh, or I might shrug, and “Yeah,” she says. “That’s what I thought.”\n She starts rattling on about the hydrobot, then, the towering black smokers, thermal vents, chemosynthesis, those first grainy snatches of video, but I’m not listening. I’m too busy zipping helplessly along above buckled Europan plains and vast stretches of blocky, shattered chaos material; a frozen world caught in the shadow of Big Daddy Jupiter, frozen for ages beyond counting, but a long fucking way from dead, and I would wake up screaming or crying or, if I was lucky, too scared to make any sound at all.\n “They’re ready for you now, Mr. Paine,” the cop said, plain old NYPD street blue, and I wondered what the fuck he was doing here, why the Agency was taking chances like that. Probably the same poor bastard who’d found the spooch, I figured. Templeton had told me that someone in the building had complained about the smell and, so, the super buzzed the cops, so this was most likely the guy who answered the call. He might have a partner around somewhere. I nodded at him, and he glanced nervously back over his shoulder at the open door to the apartment, the translucent polyurethane iso-seal curtain with its vertical black zipper running right down the middle, all the air hoses snaking in and out of the place, keeping the pressure inside lower than the pressure outside. I doubted he would still be breathing when the sweeper crews were finished with the scene.\n “You see this sort of shit very often?” he asked, and it didn’t take a particularly sensitive son of a bitch to hear the fear in his voice, the fear and confusion and whatever comes after panic. I didn’t respond. I was busy checking the batteries in one of my cameras and, besides, I had the usual orders from Templeton to keep my mouth shut around civvies. And knowing the guy was probably already good as dead, that he’d signed his death warrant just by showing up for work that morning, didn’t make me particularly eager to chat.\n “Well, I don’t mind telling you, I’ve never seen shit like that thing in there,” he said and coughed. “I mean, you see some absolutely fucked-up shit in this city, and I even did my four years in the army—hell, I was in fucking Damascus after the bomb, but holy Christ Almighty.”\n “You were in Damascus?” I asked, but didn’t look up from my equipment, too busy double-checking the settings on the portable genetigraph clipped to my belt to make eye contact.\n “Oh yeah, I was there. I got to help clean up the mess when the fires burned out.”\n “Then that’s something we have in common,” I told him and flipped my vidcam’s on switch and the gray LED screen showed me five zeros. I was patched into the portable lab down on the street, a black Chevy van with Maryland plates and a yellow ping-pong ball stuck on the antenna. I knew Sarah would be in the van, waiting for my feed, jacked in, riding the amps, hearing everything I heard, seeing everything I saw through her perfectly calibrated eyes.\n “You were in Syria?” the cop asked me, glad to have something to talk about besides what he’d seen in the apartment.\n “No, I clean up other people’s messes.”\n “Oh,” he said, sounding disappointed. “I see.”\n “Had a good friend in the war, though. But he was stationed in Cyprus, and then the Taurus Mountains.”\n “You ever talk with him? You know, about the war?”\n “Nope. He didn’t make it back,” I said, finally looking up, and I winked at the cop and stepped quickly past him to the tech waiting for me at the door. I could see she was sweating inside her hazmat hood, even though it was freezing in the hallway. Scrubbers don’t get hazmat suits. It interferes with the contact, so we settle for a couple of hours in decon afterwards, antibiotics, antitox, purgatives, and hope we don’t come up red somewhere down the line.\n “This is bad, ain’t it?” the cop asked. “I mean, this is something real bad,” and I didn’t turn around, just shrugged my shoulders as the tech unzipped the plastic curtain for me.\n “Is that how it looked to you?” I replied. I could feel the gentle rush of air into the apartment as the slit opened in front of me.\n “Jesus, man, all I want’s a straight fucking answer,” he said. “I think I deserve that much. Don’t you?” and since I honestly couldn’t say one way or the other, since I didn’t even care, I ignored him and stepped through the curtain into this latest excuse for Hell.\n There’s still an exhibit at the American Museum of Natural History, on the fourth floor with the old Hall of Vertebrate Origins and all the dinosaur bones. The Agency didn’t shut it down after the first outbreaks, the glory spooches that took out a whole block in Philadelphia and a trailer park somewhere in West Virginia, but it’s not as popular as you might think. A dark, dusty alcove crowded with scale models and dioramas, video monitors running clips from the IcePIC’s hydrobot, endless black and white loops of gray seafloors more than half a billion kilometers from earth. When the exhibit first opened, there were a few specimens on loan from NASA, but those were all removed a long time ago. I never saw them for myself, but an acquaintance on staff at the museum, a geologist, assures me they were there. A blue-black bit of volcanic rock sealed artfully in a Lucite pyramid, and two formalin-filled specimen canisters, one containing a pink worm-like organism no more than a few centimeters in length, the other preserving one of the ugly little slugs that the mission scientists dubbed “star minnows.”\n “Star leeches” would have been more accurate.\n On Tuesday afternoon, the day after I’d worked the scene on Columbus, hung over and hoping to avoid another visit from Sarah, I took the B-Line from my hotel to the museum and spent a couple of hours sitting on a bench in that neglected alcove, watching the video clips play over and over again for no one but me. Three monitors running simultaneously—a NASA documentary on the exploration of Europa, beginning with Pioneer 10 in 1973, a flyover of the moon’s northern hemisphere recorded shortly before the IcePIC orbiter deployed its probes, and a snippet of film shot beneath the ice. That’s the one I’d come to see. I chewed aspirin and watched as the hydrobot’s unblinking eyes peered through veils of silt and megaplankton, into the interminable darkness of an alien ocean, the determined glare of the bot’s lights never seeming to reach more than a few feet into the gloom. Near the end of the loop, you get to see one of the thermal vents, fringed with towering sulfide chimneys spewing superheated, methane- and hydrogen-rich water into the frigid Europan ocean. In places, the sides of the chimneys were completely obscured by a writhing, swaying carpet of creatures. Something like an eel slipped unexpectedly past the camera lens. A few seconds later, the seafloor was replaced by a brief stream of credits and then the NASA logo before the clip started itself over again.\n I tried hard to imagine how amazing these six minutes of video must have seemed, once upon a time, how people must have stood in lines just to see it, back before the shit hit the fan and everyone everywhere stopped wanting to talk about IcePIC and its fucking star minnows. Before the government axed most of NASA’s exobiology program, scrapped all future missions to Europa, and cancelled plans to explore Titan. Back before ET became a four-letter word. But no matter how hard I tried, all I could think about was that thing on the bed, the crap growing from the walls of the apartment and dripping from the goddamn ceiling.\n In the museum, above the monitor, there was a long quote from H. G. Wells printed in red-brown ink on a clear Lexan plaque, and I read it several times, wishing that I had a cigarette—“We look back through countless millions of years and see the great will to live struggling out of the intertidal slime, struggling from shape to shape and from power to power, crawling and then walking confidently upon the land, struggling generation after generation to master the air, creeping down into the darkness of the deep; we see it turn upon itself in rage and hunger and reshape itself anew, we watch it draw nearer and more akin to us, expanding, elaborating itself, pursuing its relentless inconceivable purpose, until at last it reaches us and its being beats through our brains and arteries.”\n I’ve never cared very much for irony. It usually leaves a sick, empty feeling in my gut. I wondered why no one had taken the plaque down.\n By the time I got back to my room it was almost dark, even though I’d splurged and taken a taxi. After the video, the thought of being trapped in the crowded, stinking subway, hurtling along through the city’s bowels, through those tunnels where the sun never reaches, gave me a righteous fucking case of the heebie-jeebies and, what the hell, the Agency was picking up the tab. All those aspirin had left my stomach aching and sour, and hadn’t done much of anything about the hangover, but there was an unopened pint waiting for me beneath the edge of the bed.\n I was almost asleep when Sarah called.\n Here’s a better quote. I’ve been carrying it around with me for the last few years, in my head and on a scrap of paper. It showed up in my email one day, sent by some anonymous someone or another from an account that turned out to be bogus. Scrubbers get a lot of anonymous email. Tips, rumors, bullshit, hearsay, wicked little traps set by the Agency, confessions, nightmares, curses, you name it and it comes rolling our way, and after a while you don’t even bother to wonder who sent the shit. But this one, this one kept me awake a few nights:\n “But what would a deep-sea fish learn even if a steel plate of a wrecked vessel above him should drop and bump him on the nose?\n Our submergence in a sea of conventionality of almost impenetrable density.\n Sometimes I'm a savage who has found something on the beach of his island. Sometimes I'm a deep-sea fish with a sore nose.\n The greatest of mysteries:\n Why don't they ever come here, or send here, openly?\n Of course, there's nothing to that mystery if we don't take so seriously the notion—that we must be interesting. It's probably for moral reasons that they stay away—but even so, there must be some degraded ones among them.”\n It’s that last bit that always sinks its teeth (or claws or whatever the fuck have you) into me and hangs on. Charles Hoyt Fort. The Book of the Damned. First published in 1919, a century and a half before IcePIC, and it occurs to me now that I shouldn’t be any less disturbed by prescience than I am by irony. But there you go. Sometimes I’m a savage. Sometimes I’m a deep-sea fish. And my life is become the sum of countless degradations.\n “You’re not going down there alone,” Sarah said, telling, not asking, because, like I already noted, Sarah stopped being the kind of girl who asks questions when she signed on with the Agency for life plus whatever else they could milk her biomeched cadaver for. I didn’t reply immediately, lay there a minute or three, rubbing my eyes, waiting for the headache to start in on me again, listening to the faint, insistent crackle from the phone. Manhattan’s landlines were shit and roses that February, had been that way for years, ever since some Puerto Ricans in Brooklyn had popped a homemade micro-EMP rig to celebrate the Fourth of July. I wondered why Sarah hadn’t called me on my thumbline while I looked about for the scotch. Turned out I was lying on the empty bottle, and I rolled over, wishing I’d never been born. I held the phone cradled between my left shoulder and my cheek and stared at the darkness outside the window of my hotel room.\n “Do you even know what time it is?” I asked her.\n “Templeton said you were talking about going out to Roosevelt. He said you might have gone already.”\n “I didn’t say dick to Templeton about Roosevelt,” I said, which was the truth—I hadn’t—but also entirely beside the point. It was John Templeton’s prerogative to stay a few steps ahead of his employees, especially when those employees were scrubbers, especially freebie scrubbers on the juice. I tossed the empty bottle at a cockroach on the wall across the room. The bottle didn’t break, but squashed the roach and left a satisfying dent in the drywall.\n “You know Agency protocol for dealing with terrorists.”\n “They went and stuck something in your head so you don’t have to sleep anymore, is that it?”\n “You can’t go to the island alone,” she said. “I’m sending a couple of plain-clothes men over. They’ll be at your hotel by six a.m., at the latest.”\n “Yeah, and I’ll be fucking asleep at six,” I mumbled, more interested in watching the roaches that had emerged to feed on the remains of the one I’d nailed than arguing with her.\n “We can’t risk losing you, Mr. Paine. It’s too late to call in someone else if anything happens. You know that as well as I do.”\n “Do I?”\n “You’re a drunk, not an idiot.”\n “Look, Sarah, if I start scutzing around out there with two of Temp’s goons in tow, I’ll be lucky if I find a fucking stitch, much less get it to talk to me.”\n “They’re all animals,” Sarah said, meaning the stitches and meatdolls and genetic changelings that had claimed Roosevelt Island a decade or so back. There was more than a hint of loathing in her voice. “It makes me sick, just thinking about them.”\n “Did you ever stop to consider they probably feel the same way about you?”\n “No,” Sarah said coldly, firmly, one-hundred percent shitsure of herself. “I never have.”\n “If those fuckers knock on my door at six o’clock, I swear to god, Sarah, I’ll shoot them.”\n “I’ll tell them to wait for you in the lobby.”\n “That’s real damn thoughtful of you.”\n There was another static-littered moment of silence then, and I closed my eyes tight. The headache was back and had brought along a few friends for the party. My thoughts were starting to bleed together, and I wondered if I’d vomit before or after Sarah finally let me off the phone. I wondered if cyborgs vomited. I wondered exactly what all those agents in the black Chevy van had seen on their consoles and face screens when I’d walked over and touched a corner of the bed in the apartment on Columbus Avenue.\n “I’m going to hang up now, Sarah. I’m going back to sleep.”\n “You’re sober.”\n “As a judge,” I whispered and glanced back at the window, trying to think about anything at all except throwing up. There were bright lights moving across the sky above the river, red and green and white, turning clockwise; one of the big military copters, an old Phoenix 6-98 or one of the newer Japanese whirlybirds, making its circuit around the Rotten Apple.\n “You’re still a lousy liar,” she said.\n “I’ll have to try harder.”\n “Don’t fuck this up, Mr. Paine. You’re a valued asset. The Agency would like to see you remain that way.”\n “I’m going back to sleep,” I said again, disregarding the not-so-subtle threat tucked between her words; it wasn’t anything I didn’t already know. “And I meant what I said about shooting those assholes. Don’t think I didn’t. Anyone knocks on this door before eight sharp, and that’s all she wrote.”\n “They’ll be waiting in the lobby when you’re ready.”\n “Goodnight, Sarah.”\n “Goodnight, Mr. Paine,” she replied, and a second or two later there was only the ragged dial tone howling in my ear. The lights outside the window were gone, the copter probably all the way to Harlem by now. I almost made it to the toilet before I was sick.\n If I didn’t keep getting the feeling that there’s someone standing behind me, someone looking over my shoulder as I write this, I’d say more about the dreams. The dreams are always there, tugging at me, insistent, selfish, wanting to be spilled out into the wide, wide world where everyone and his brother can get a good long gander at them. They’re not content anymore with the space inside my skull. My skull is a prison for dreams, an enclosed and infinite prison space where the arrows on the number line point towards each other, infinitely converging but never, ever, ever meeting and so infinite all the same. But I do keep getting that feeling, and there’s still the matter of the thing in the apartment.\n The thing on the bed.\n The thing that the cop who’d been in Damascus after the Israelis’ forty-megaton fireworks show died for.\n My thirteenth and final contact.\n After I was finished with the makeshift airlock at the door, one of Templeton’s field medics, safe and snug inside a blue hazmat suit, led me through the brightly-lit apartment. I held one hand cupped over my nose and mouth, but the thick clouds of neon yellow disinfectant seeped easily between my fingers, gagging me. My eyes burned and watered, making it even more difficult to see. I’ve always thought that shit smelled like licorice, but it seems to smell like different things to different people. Sarah used to say it reminded her of burning tires. I used to know a guy who said it smelled like carnations.\n “It’s in the bedroom,” the medic said, his voice flat and tinny through the suit’s audio. “It doesn’t seem to have spread to any of the other rooms. How was the jump from Los Angeles, sir?”\n I didn’t answer him, too ripped on adrenaline for small talk and pleasantries, and he didn’t really seem to care, my silence just another part of the routine. I took shallow breaths and followed the medic through the yellow fog, which was growing much thicker as we approached ground zero. The disinfectant was originally manufactured by Dow for domestic bioterrorism clean-up, but the Agency’s clever boys and girls had added a pinch of this, a dash of that, and it always seemed to do the job. We passed a kitchenette, beer cans and dirty dishes and an open box of corn flakes sitting on the counter, then turned left into a short hallway leading past a bathroom too small for a rat to take a piss in, past a framed photograph of a lighthouse on a rocky shore (the bits we remember, the bits we forget), to the bedroom. Templeton was there, of course, decked out in his orange hazmat threads, one hand resting confidently on the butt of the big Beretta Pulse 38A on his hip, and he pointed at me and then pointed at the bed.\n Sometimes I’m a deep-sea fish.\n Sometimes I’m a savage.\n “We’re still running MRS and backtrace on these two,” Templeton said, pointing at the bed again, “but I’m pretty sure the crit’s a local.” His gray eyes peered warily out at me, the lights inside his hood shining bright so I had no trouble at all seeing his face through the haze.\n “I figure one of them picked it up from an untagged mobile, probably the woman there, and it’s been hitching dormant for the last few weeks. We’re guessing the trigger was viral. She might have caught a cold. Corona’s always a good catalyst.”\n I took a deep breath and coughed. Then I gagged again and stared up at the ceiling for a moment.\n “Come on, Deet. I need you frosty on this one. You’re not drunk, are you? Fennimore said—”\n “I’m not drunk,” I replied, and I wasn’t, not yet. I hadn’t had a drink in almost six months, but, hey, the good news was, the drought was almost over.\n “That’s great,” Templeton said. “That’s real damn great. That’s exactly what I wanted to hear.”\n I looked back at the bed.\n “So, when you gonna tell me what’s so goddamn special about this one?” I asked. “The way Sarah sounded, I figured you’d already lost a whole building.”\n “What’s so goddamn special about them, Deet, is that they’re still conscious, both of them. Initial EEGs are coming up pretty solid. Clean alpha, beta, and delta. The theta’s are weakening, but the brain guys say the waves are still synchronous enough to call coherent.”\n Temp kept talking, but I tuned him out and forced myself to take a long, hard look at the bed.\n Sometimes I’m a deep-sea fish.\n The woman’s left eye was still intact, open very wide and wet with tears, her blue iris bright as Christmas Day, and I realized she was watching me.\n “It’s pure,” Templeton said, leaning closer to the bed, “more than ninety-percent proximal to the Lælaps strain. Beats the fuck outta me why their brains aren’t soup by now.”\n “I’m going to need a needle,” I muttered, speaking automatically, some part of me still there to walk the walk and talk the talk, some part of me getting ready to take the plunge, because the only way out of this hole was straight ahead. A very small, insensate part of me not lost in that pleading blue eye. “Twelve and a half max, okay, and not that fife-and-drum Australian shit you gave me in Boston. I don’t want to feel anything in there but the critter, you understand?”\n “Sure,” Templeton said, smiling like a ferret.\n “I mean it. Whatever’s going through their heads right now, I don’t want to hear it, Temp. Not so much as a peep, not even a fucking whisper.”\n “Hey, you’re calling the shots, Deet.”\n “Bullshit,” I said. “Don’t suck my dick, just get me the needle.”\n He motioned to a medic, and in a few more minutes the drugs were singing me towards that spiraling ebony pipeline, the Scrubber’s Road, Persephone’s Staircase, the Big Drop, the White Bull, whatever you want to call it, it’s all the same to me. I was beginning to sweat and trying to make it through the procedure checklist one last time. Templeton patted me on the back, the way he always did when I was standing there on the brink. I said a silent prayer to anything that might be listening that one day it’d be his carcass rotting away at the center of the Agency’s invisible clockwork circus. And then I kneeled down at the edge of the bed and got to work.\n Sarah sent the goons over, just like she’d said she would, but I ducked out the back and, luckily, she hadn’t seen fit to have any of Temp’s people watching all the hotel’s exits. Maybe she couldn’t pull that many warm bodies off the main gig down on Columbus. Maybe Temp had bigger things on his mind. I caught a cash-and-ride taxi that took me all the way to the ruins along York Avenue. The Vietnamese driver hadn’t wanted to get any closer to the Queensboro Bridge than Third, but I slipped him five hundred and he found a little more courage somewhere. He dropped me at the corner of Second and East Sixty-First Street, crossed himself twice, and drove away, bouncing recklessly over the trash and disintegrating blacktop. I watched him go, feeling more alone than I’d expected. Overhead, the Manhattan sky was the color of buttermilk and mud, and I wished briefly, pointlessly, that I’d brought a gun. The 9mm Samson-L4 Enforcer I’d bought in a Hollywood pawnshop almost four years before was back at the hotel, hidden in a locked compartment of my suitcase. But I knew it’d be a whole lot worse to be picked up crossing the barricades without a pass if I were carrying an unregistered weapon, one more big red blinking excuse for the MPs to play a few rounds of Punch and Judy with my face while they waited for my papers and my story about the Agency to check out.\n I started walking north, the gray-blue snow crunching loudly beneath my boots, the collar of my coat turned up against the wind whistling raw between the empty, burned-out buildings. I’d heard security was running slack around the Sixty-Third Street entrance. I might get lucky. It had happened before.\n “Yes, but what exactly did you think you’d find on the island?” Buddhadev Krishnamurthy asked when he interviewed me for his second book on technoshamanism and the Roosevelt parahumanists, the one that won him a Pulitzer.\n “Missing pieces, maybe,” I replied. “I was just following my nose. The Miyake girl turned up during the contact.”\n “But going to the island alone, wasn’t that rather above and beyond? I mean, if you hated Templeton and the Agency so much, why stick your neck out like that?”\n “Old habits,” I said, sipping at my tequila and trying hard to remember how long it had taken me to find a way past the guards and up onto the bridge. “Old habits and bad dreams,” I added, and then, “But I never said I was doing it for the Agency.” I knew I was telling him more than I’d intended. Not that it mattered. None of my interview made it past the censors and into print.\n I kept to the center lanes, except for a couple of times when rusted and fire-blackened tangles of wrecked automobiles and police riot-rollers forced me to the edges of the bridge. The West Channel glimmered dark and iridescent beneath the late February clouds, a million shifting colors dancing lazily across the oily surface of the river. The wind shrieked through the cantilever spans, like angry sirens announcing my trespass to anyone who would listen. I kept waiting for the sound of helicopter rotors or a foot patrol on its way back from Queens, for some sharpshooter’s bullet to drop me dead in my tracks. Maybe it was wishful thinking.\n Halfway across I found the access stairs leading down to the island, right where my contact in Street and Sanitation had said they would be. I checked my watch. It was five minutes until noon.\n “Will you tell me about the dreams, Mr. Paine?” Krishnamurthy asked, after he’d ordered me another beer and another shot of tequila. His voice was like silk and cream, the sort of voice that seduced, that tricked you into lowering your defenses just long enough for him to get a good peek at all the nasty nooks and crannies. “I hear lots of scrubbers had trouble with nightmares back then, before the new neural-drag sieves were available. The suicide rate’s dropped almost fifty percent since they became standard issue. Did you know that, Mr. Paine?”\n “No,” I told him. “Guess I missed the memo. I’m kind of outside the flow these days.”\n “You’re a lucky man,” he said. “You should count your blessings. At least you made it out in one piece. At least you made it out sane.”\n I think I told him to fuck off then. I know I didn’t tell him about the dreams.\n “What do you see down there, Deet? The sensors are getting a little hinky on me,” Sarah said and, in the dreams, back when, in the day, before the tweaker’s silver chip, I took another clumsy step towards the edge of the chasm created by hot water welling up from the deep-sea vents along the Great Charon Ridge. A white plume of salty steam rose high into the thin Europan atmosphere, blotting out the western horizon, boiling off into the indifferent blackness of space. I knew I didn’t want to look over the edge again. I’d been there enough times already, and it was always the same, and I reminded myself that no one had ever walked on Europa, no one human, and it was only a dream. Shit. Listen to me. Only a dream. Now, there’s a contradiction to live by.\n “Am I coming through?” Sarah asked. “Can you hear me?”\n I didn’t answer her. My mouth was too dry to speak, bone dry from fear and doubt and the desiccated air circulating through the helmet of my EMU suit.\n “I need you to acknowledge, Deet. Can you hear me?”\n The mouth of Sakpata, the plague gate, yawning toothless and insatiable before me, almost nine kilometers from one side to the other, more than five miles from the edge of the hole down to the water. I was standing near the center of the vast field of cryovolcanic lenticulae first photographed by the Galileo probe in 1998, on its fifteenth trip around Jupiter. Convection currents had pushed the crust into gigantic pressure domes that finally cracked and collapsed under their own weight, exposing the ocean below. I took another step, almost slipping on the ice, and wondered how far I was from the spot where IcePIC had made landfall.\n “Deet, do you copy?”\n “Do you believe in sin, Deet?”\n Nor shapes of men nor beasts we ken—\n The ice was all between.\n Sarah sets her coffee cup down and watches me from the other side of our apartment on Cahuenga. Her eyes are still her eyes, full of impatience and secrets. She reaches for a cigarette, and I wish this part weren’t a dream, that I could go back to here and start again. This sunny LA morning, Sarah wearing nothing but her bra and panties, and me still curled up in the warm spot she left in the sheets. Go back and change the words. Change every goddamn day that’s come between now and then.\n “They want my decision by tomorrow morning,” she says and lights her cigarette. The smoke hangs like a caul about her face.\n “Tell them you need more time,” I reply. “Tell them you have to think about it.”\n “This is the fucking Agency,” she says and shakes her head. “You don’t ask them for more time. You don’t ask them shit.”\n “I don’t know what you want me to say, Sarah.”\n “It’s everything I’ve always wanted,” she says and flicks ash into an empty soft drink can.\n Are those her ribs through which the Sun\n Did peer, as through a grate?\n I took another step nearer the chasm and wished that this would end and I would wake up. If I could wake up, I wouldn’t have to see. If I could wake up, there’d be a bottle of scotch or bourbon or tequila waiting for me, a drink of something to take the edge off the dryness in my mouth. The sun was rising behind me, a distant, pale thing lost among the stars, and the commlink buzzed and crackled in my ears.\n “If it’s what you want, take it,” I say, the same thing I always say, the same words I can never take back. “I’m not going to stand in your way.” I could tell it was the last thing that Sarah wanted to hear. The End. The curtain falls and everyone takes a bow. The next day, Wednesday, I’ll drive her to LAX-1, and she’ll take the 4:15 jump to D.C.\n We are more alone than ever.\n Ronnie used her own blood to write those six words on the wall of her room at La Casa, the night she killed herself.\n My boots left no trace whatsoever on the slick, blue-white ice. A few more steps and I was finally standing at the edge, walking cautiously onto the wide shelf formed by an angular chaos block jutting a few meters out over the pit. The constant steam had long since worn the edges of the block smooth. Eventually, this block would melt free, undercut by ages of heat and water vapor, and pitch into the churning abyss far below. I took a deep breath of the dry, stale air inside my helmet and peered into the throat of Sakpata.\n “Tell me, what the hell did we expect to find out there, Deet?” Ronnie asked me. “What did we think it would be? Little gray men with the answers to all the mysteries of the universe, free for the asking? A few benign extremophiles clinging stubbornly to the bottom of an otherwise lifeless sea? I can’t remember anymore. I try, but I can’t. I lie awake at night trying to remember.”\n “I don’t think it much matters,” I told her, and she started crying again.\n “It was waiting for us, Deet,” she sobbed. “It was waiting for us all along, a million fucking years alone out there in the dark. It knew we’d come, sooner or later.”\n Sarah was standing on the ice behind me, naked, the wind tearing at her plastic skin.\n “Why do you keep coming here?” she asked. “What do you think you’ll find?”\n “Why do you keep following me?”\n “You turned off your comms. I wasn’t getting a signal. You didn’t leave me much choice.”\n I turned to face her, turning my back on the hole, but the wind had already pulled her apart and scattered the pieces across the plain.\n We are more alone than ever.\n And then I’m in the pipe, slipping along the Scrubber’s Road, no friction, no resistance, rushing by high above the frozen moon, waiting for that blinding, twinkling moment of perfect agony when my mind brushes up against that other mind. That instant when it tries to hide, tries to withdraw, and I dig in and hang on and drag it screaming into the light. I hear the whir of unseen machineries as the techs on the outside try to keep up with me, with it.\n I stand alone at the edge of Sakpata’s mouth, where no man has ever stood, at the foot of the bed on Columbus, in the airport lobby saying goodbye to Sarah. I have all my cameras, my instruments, because I’ll need all that later on, when the spin is over and I’m drunk and there’s nothing left but the footwork.\n When I have nothing left to do but track down the carrier and put a bullet or two in his or her or its head.\n Cut the cord. Tie off the loose ends.\n “Do you believe in sin, Deet?”\n Instead of the cross, the Albatross . . .\n “It’s only a question. Stop trying to make it anything more than that.”\n “Do you copy?” Sarah asks again. “Global can’t get a fix on you.” I take another step closer to the hole, and it slips a few feet farther away from me. The sky is steam and stars and infinite night.\n I followed East Road north to Main Street, walking as quickly as the snow and black ice and wrecks littering the way would allow. I passed through decaying canyons of brick and steel, broken windows and gray concrete, the tattered ruins of the mess left after the Feds gave Roosevelt Island up for lost, built their high barricades and washed their righteous hands of the place. I kept my eyes on the road at my feet, but I could feel them watching me, following me, asking each other if this one was trouble or just some fool out looking for his funeral. I might have been either. I still wasn’t sure myself. There were tracks in the snow and frozen mud, here and there, some of them more human than others.\n Near the wild place that had once been Blackwell Park, I heard something call out across the island. It was a lonely, frightened sound, and I walked a little faster.\n I wondered if Sarah would try to send an extraction team in after me, if she was in deep sharn with Templeton and the boys for letting me scoot. I wondered if maybe Temp was already counting me among the dead and kicking himself for not putting me under surveillance, trying to figure out how the hell he was going to lay it all out for the bastards in Washington. It took me the better part of an hour to reach the northern tip of the island and the charred and crumbling corpse of Coler-Goldwater Hospital. The ragtag militia of genetic anarchists who had converged on Manhattan in the autumn of ’69, taking orders from a schizo ex-movie star who called herself Circe Nineteen, had claimed the old hospital as their headquarters. When the army decided to start shelling, Coler had taken the worst of the mortars. Circe Nineteen had been killed by a sniper, but there’d been plenty of freaks on hand to fill her shoes, so to speak.\n Beneath the sleeting February sky, the hospital looked as dead as the day after Armageddon. I tried not to think about the spooch, all the things I’d seen and heard the day before, the things I’d felt, the desperate stream of threats and promises and prayers the crit had spewed at me when I’d finally come to the end of the shimmering aether pipeline and we’d started the dance.\n Inside, the hospital stunk like a zoo, a dying, forgotten zoo, but at least I was out of the wind. My face and hands had gone numb. How would the Agency feel about a scrubber without his fingers? Would they toss me on the scrap heap, or would they just give me a shiny new set, made in Osaka, better than the originals? Maybe work a little of the biomech magic they’d worked on Sarah? I followed a long ground-floor hallway past doors and doorways without doors, pitch dark rooms and chiaroscuro rooms ruled by the disorienting interplay of shadow and light, until I came to a row of elevators. All the doors had been jammed more or less open at some point, exposing shafts filled with dust and gears and rusted cables. I stood there a while, as my fingers and lips began to tingle, the slow pins-and-needles thaw, and listened to the building whispering around me.\n “They’re all animals,” Sarah had sneered the day before. But they weren’t, of course, no more than she was truly a machine. I knew Sarah was bright enough to see the truth, even before they’d squeezed all that hardware into her skull. Even if she could never admit it to herself or anyone else. The cyborgs and H+ brigade were merely opposing poles in the same rebellion against the flesh—black pawn, white pawn—north and south on the same twisted post-evolutionary road. Not that it made much difference to me. It still doesn’t. But standing there, my breath fogging and the feeling slowly returning to my hands, her arrogance was pissing me off more than usual. Near as I could tell, the biggest difference between Sarah and whatever was waiting for me in the bombed-out hospital that afternoon—maybe the only difference that actually mattered—was that the men and women in power had found a use for her kind, while the stitches and changelings had never been anything to them but a nuisance. It might have gone a different way. It might yet.\n There was a stairwell near the elevators, and I climbed it to the third floor. I hadn’t thought to bring a flashlight with me, so I stayed close to the wall, feeling my way through the gloom, stumbling more than once when my feet encountered chunks of rubble that had fallen from somewhere overhead.\n On the third floor, the child was waiting for me.\n “What do you want here?” he barked and blinked at me with the golden eyes of a predatory bird. He was naked, his skin hidden beneath a coat of fine yellow-brown fur.\n “Who are you?” I asked him.\n “The manticore said you were coming. She saw you on the bridge. What do you want?”\n “I’m looking for a girl named Jet.”\n The child laughed, a strange, hitching laugh and rolled his eyes. He leaned forward, staring at me intently, expectantly, and the vertical pupils of those big golden eyes dilated slightly.\n “Ain’t no girls here, Mister,” he chuckled. “Not anymore. You skizzled or what?”\n “Is there anyone here named Jet? I’ve come a long way to talk to her.”\n “You got a gun, maybe?” he asked. “You got a knife?”\n “No,” I said. “I don’t. I just want to talk.”\n “You come out to Stitchtown without a gun or a knife? Then you must have some bangers, Mister. You must have whennymegs big as my fist,” and he held up one clenched fist so I could see exactly what he meant. “Or you don’t want to live so much longer, maybe.”\n “Maybe,” I replied.\n “Meat’s scarce this time of year,” the boy chuckled and then licked his thin ebony lips.\n Down at the other end of the hallway, something growled softly, and the boy glanced over his shoulder, then back up at me. He was smiling, a hard smile that was neither cruel nor kind, revealing the sharp tips of his long canines and incisors. He looked disappointed.\n “All in good time,” he said and took my hand. “All in good time,” and I let him lead me towards the eager shadows crouched at the other end of the hallway.\n Near the end of his book, Emmanuel Weatherby-Jones writes, “The calamities following, and following from, the return of the IcePIC probe may stand as mankind’s gravest defeat. For long millennia, we had asked ourselves if we were alone in the cosmos. Indeed, that question has surely formed much of the fundamental matter of the world’s religions. But when finally answered, once and for all, we were forced to accept that there had been greater comfort in our former, vanished ignorance.”\n We are more alone than ever. Ronnie got that part right.\n When I’d backed out of the contact and the techs had a solid lockdown on the critter’s signal, when the containment waves were pinging crystal mad off the putrescent walls of the bedroom on Columbus and one of the medics had administered a stimulant to clear my head and bring me the rest of the way home, I sat down on the floor and cried.\n Nothing unusual about that. I’ve cried almost every single time. At least I didn’t puke.\n “Good job,” Templeton said and rested a heavy gloved hand on my shoulder.\n “Fuck you. I could hear them. I could hear both of them, you asshole.”\n “We did what we could, Deet. I couldn’t have you so tanked on morphine you’d end up flat lining.”\n “Oh my god. Oh Jesus god,” I sobbed like an old woman, gasping, my heart racing itself round smaller and smaller circles, fried to a crisp on the big syringe full of synthetadrine the medic had pumped into my left arm. “Kill it, Temp. You kill it right this fucking instant.”\n “We have to stick to protocol,” he said calmly, staring down at the writhing mass of bone and meat and protoplasm on the bed. A blood-red tendril slithered from the place where the man’s mouth had been and began burrowing urgently into the sagging mattress. “Just as soon as we have you debriefed and we’re sure stasis is holding, then we’ll terminate life signs.”\n “Fuck it,” I said and reached for his Beretta, tearing the pistol from the velcro straps of the holster with enough force that Temp almost fell over on top of me. I shoved him aside and aimed at the thing on the bed.\n “Deet, don’t you even fucking think about pulling that trigger!”\n “You can go straight to Hell,” I whispered, to Templeton, to the whole goddamn Agency, to the spooch and that single hurting blue eye still watching me. I squeezed the trigger, emptying the whole clip into what little was left of the man and woman’s swollen skulls, hoping it would be enough.\n Then someone grabbed for the gun, and I let them take it from me.\n “You stupid motherfucker,” Temp growled. “You goddamn, stupid bastard. As soon as this job is finished, you are out. Do you fucking understand me, Deet? You are history!”\n “Yeah,” I replied and sat back down on the floor. In the silence left after the roar of the gun, the containment waves pinged, and my ears rang, and the yellow fog settled over me like a shroud.\n At least, that’s the way I like to pretend it all went down. Late at night, when I can’t sleep, when the pills and booze aren’t enough, I like to imagine there was one moment in my wasted, chicken-shit life when I did what I should have done.\n Whatever really happened, I’m sure someone’s already written it down somewhere. I don’t have to do it again.\n In the cluttered little room at the end of the third-floor hallway, the woman with a cat’s face and nervous, twitching ears sat near a hole that had been a window before the mortars. There was no light but the dim winter sun. The boy sat at her feet and never took his eyes off me. The woman—if she had a name, I never learned it—only looked at me once, when I first entered the room. The fire in her eyes made short work of whatever resolve I had left, and I was glad when she turned back to the hole in the wall and stared north across the river towards the Astoria refineries.\n She told me the girl had left a week earlier. She didn’t have any idea where Jet Miyake might have gone.\n “She brings food and medicine, sometimes,” the woman said, confirming what I’d already suspected. Back then, there were a lot of people willing to risk prison or death to get supplies to Roosevelt Island. Maybe there still are. I couldn’t say.\n “I’m sorry to hear about her parents,” she said.\n “It was quick,” I lied. “They didn’t suffer.”\n “You smell like death, Mr. Paine,” the woman said, flaring her nostrils slightly. The boy at her feet laughed and hugged himself, rocking from side to side. “I think it follows you. I believe you herald death.”\n “Yeah, I think the same thing myself sometimes,” I replied.\n “You hunt the aliens?” she purred.\n “That’s one way of looking at it.”\n “There’s a certain irony, don’t you think? Our world was dying. We poisoned our world and then went looking for life somewhere else. Do you think we found what we were looking for, Mr. Paine?”\n “No,” I told her. “I don’t think we ever will.”\n “Go back to the city, Mr. Paine. Go now. You won’t be safe after sunset. Some of us are starving. Some of our children are starving.”\n I thanked her and left the room. The boy followed me as far as the stairs, then he stopped and sat chuckling to himself, his laughter echoing through the stairwell, as I moved slowly, step by blind step, through the uncertain darkness. I retraced my path to the street, following Main to East, past the wild places, through the canyons, and didn’t look back until I was standing on the bridge again.\n I found Jet Miyake in Chinatown two days later, hiding out in the basement of the Buddhist Society of Wonderful Enlightenment on Madison Street. The Agency had files on a priest there, demonstrating a history of pro-stitch sentiment. Jet Miyake ran, because they always run if they can, and I chased her, down Mechanics Alley, across Henry, and finally caught up with her in a fish market on East Broadway, beneath the old Manhattan Bridge. She tried to lose me in the maze of kiosks, the glistening mounds of octopus and squid, eel and tuna and cod laid out on mountains of crushed ice. She headed for a back door and almost made it, but slipped on the wet concrete floor and went sprawling ass over tits into a big display of dried soba and canned chicken broth. I don’t actually remember all those details, just the girl and the stink of fish, the clatter of the cans on the cement, the angry, frightened shouts from the merchants and customers. But the details, the octopus and soba noodles, I don’t know. I think I’m trying to forget this isn’t fiction, that it happened, that I’m not making it up as I go along.\n Sometimes.\n Sometimes I’m a savage.\n I held the muzzle of my pistol to her right temple while I ran the scan. She gritted her teeth and stared silently up at me. The machine read her dirty as the gray New York snow, though I didn’t need the blinking red light on the genetigraph to tell me that. She was hurting, the way only long-term carriers can hurt. I could see it in her eyes, in the sweat streaming down her face, in the faintly bluish tinge of her lips. She’d probably been contaminated for months. I knew it’d be a miracle if she’d infected no one but her parents. I showed her the display screen on the genetigraph and told her what it meant, and I told her what I had to do next.\n “You can’t stop it, you know,” she said, smiling a bitter, sickly smile. “No matter how many people you kill, it’s too late. It’s been too late from the start.”\n “I’m sorry,” I said, whether I actually was or not, and squeezed the trigger. The 9mm boomed like thunder in a bottle, and suddenly she wasn’t my problem anymore. Suddenly she was just another carcass for the sweepers.\n I have become an unreliable narrator. Maybe I’ve been an unreliable narrator all along. Just like I’ve been a coward and a hypocrite all along. The things we would rather remember, the things we choose to forget. As the old saying goes, it’s only a movie.\n I didn’t kill Jet Miyake.\n “You can’t stop it, you know,” she said. That part’s the truth. “No matter how many people you kill, it’s too late. It’s been too late from the start.”\n “I’m sorry,” I said.\n “We brought it here. We invited it in, and it likes what it sees. It means to stay.” She did smile, but it was a satisfied, secret smile. I stepped back and lowered the muzzle of the gun. The bore had left a slight circular impression on her skin.\n “Please step aside, Mr. Paine,” Sarah said, and when I turned around she was standing just a few feet behind me, pointing a ridiculously small carbon-black Glock at the girl. Sarah fired twice and waited until the body stopped convulsing, then put a third bullet in Jet Miyake’s head, just to be sure. Sarah had always been thorough.\n “Templeton thought you might get cold feet,” she said and stepped past me, kneeling to inspect the body. “You know this means that you’ll probably be suspended.”\n “She was right, wasn’t she?” I muttered. “Sooner or later, we’re going to lose this thing,” and for a moment I considered putting a few rounds into Sarah’s skull, pulling the trigger and spraying brains and blood and silicon across the floor of the fish market. It might have been a mercy killing. But I suppose I didn’t love her quite as much as I’d always thought. Besides, the Agency would have probably just picked up the pieces and stuck her back together again.\n “One day at a time, Mr. Paine,” she said. “That’s the only way to stay sane. One day at a time.”\n “No past, no future.”\n “If that’s the way you want to look at it.”\n She stood up and held out a hand. I popped the clip from my pistol and gave her the gun and the ammo. I removed the genetigraph from my belt, and she took that, too.\n “We’ll send someone to the hotel for the rest of your equipment. Please have everything in order. You have your ticket back to Los Angeles.”\n “Yes,” I said. “I have my ticket back to Los Angeles.”\n “You lasted a lot longer than I thought you would,” she said.\n And I left her there, standing over the girl’s body, calling in the kill, ordering the sweeper crew. The next day I flew back to LA and found a bar where I was reasonably sure no one would recognize me. I started with tequila, moved on to scotch, and woke up two days later, facedown in the sand at Malibu, sick as a dog. The sun was setting, brewing a firestorm on the horizon, and I watched the stars come out above the sea. A meteor streaked across the sky and was gone. It only took me a moment to find Jupiter, Lord of the Heavens, Gatherer of Clouds, hardly more than a bright pin-prick near the moon.\n Originally published in Argosy Magazine, January-February 2004.\n Caitlín R. Kiernan is a two-time recipient of both the World Fantasy and Bram Stoker awards, and the New York Times has declared her \"one of our essential writers of dark fiction.\" Her recent novels include The Red Tree and The Drowning Girl: A Memoir, and, to date, her short stories have been collected in twelve volumes, including Tales of Pain and Wonder, A is for Alien, The Ammonite Violin & Others, and the World Fantasy Award winning The Ape's Wife and Other Stories. Currently she's editing her thirteenth, fourteenth, and fifteenth collections—Beneath an Oil Dark Sea: The Best of Caitlín R. Kiernan (Volume 2) and Cambrian Tales (Subterranean Press) and Houses Under the Sea: Mythos Tales (Centipede Press). She has recently concluded Alabaster, her award-winning, three-volume graphic novel for Dark Horse Comics. She will soon begin work on her next novel, Interstate Love Song, based on \"Interstate Love Long (Murder Ballad No. 8).\" She lives in Providence, Rhode Island."}