{"fingerprint": "NYfwVylu+KiOoxSNz/cpiftKCr4=", "sitename": "Clarkesworld Magazine", "title": "The Ape's Wife by Caitlin R. Kiernan", "author": "Caitlin R Kiernan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kiernan_09_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Ape's Wife by Caitlin R. Kiernan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8990 words, novelette\n The Ape's Wife\n Neither yet awake nor quite asleep, she pauses in her dreaming to listen to the distant sounds of the jungle approaching twilight. They are each balanced now between one world and another—she between sleep and waking, and the jungle between day and night. In the dream, she is once again the woman she was before she came to the island, the starving woman on that other island, that faraway island that was not warm and green but had come to seem to her always cold and grey, stinking of dirty snow and the exhaust of automobiles and buses. She stands outside a lunch room on Mulberry Street, her empty belly rumbling as she watches other people eat. The evening begins to fill up with the raucous screams of nocturnal birds and flying reptiles and a gentle tropical wind rustling through the leaves of banana and banyan trees, through cycads and ferns grown as tall or taller than the brick and steel and concrete canyon that surrounds her.\n She leans forward, and her breath fogs the lunch room’s plate-glass window, but none of those faces turn to stare back at her. They are all too occupied with their meals, these swells with their forks and knives and china platters buried under mounds of scrambled eggs or roast beef on toast or mashed potatoes and gravy. They raise china cups of hot black coffee to their lips and pretend she isn’t there. This winter night is too filled with starving, tattered women on the bum. There is not time to notice them all, so better to notice none of them, better not to allow the sight of real hunger to spoil your appetite. A little farther down the street there is a Greek who sells apples and oranges and pears from a little sidewalk stand, and she wonders how long before he catches her stealing, him or someone else. She has never been a particularly lucky girl.\n Somewhere close by, a parrot shrieks and another parrot answers it, and finally she turns away from the people and the tiled walls of the lunch room and opens her eyes; the Manhattan street vanishes in a slushy, disorienting flurry and takes the cold with it. She is still hungry, but for a while she is content to lie in her carefully woven nest of rattan, bamboo, and ebony branches, blinking away the last shreds of sleep and gazing deeply into the rising mists and gathering dusk. She has made her home high atop a weathered promontory, this charcoal peak of lava rock and tephra a vestige of the island’s fiery origins. It is for this summit’s unusual shape—not so unlike a human skull—that white men named the place. And it is here that she last saw the giant ape, before it left her to pursue the moving-picture man and Captain Englehorn, the first mate and the rest of the crew of the Venture, left her alone to get itself killed and hauled away in the rusty hold of that evil-smelling ship.\n At least, that is one version of the story she tells herself to explain why the beast never returned for her. It may not be the truth. Perhaps the ape died somewhere in the swampy jungle spread out below the mountain, somewhere along the meandering river leading down to the sea. She has learned that there is no end of ways to die on the island, and that nothing alive is so fierce or so cunning as to be entirely immune to those countless perils. The ape’s hide was riddled with bullets, and it might simply have succumbed to its wounds and bled to death. Time and again, she has imagined this, the gorilla only halfway back to the wall but growing suddenly too weak to continue the chase, and perhaps it stopped, surrendering to pain and exhaustion, and sat down in a glade somewhere below the cliffs, resting against the bole of an enormous tree. Maybe it sat there, peering through a break in the fog and the forest canopy, gazing forlornly back up at the skull-shaped mountain. It would have been a terrible, lonely death, but not so terrible an end as the beast might have met had it managed to gain the ancient gates and the sandy peninsula beyond.\n She has, on occasion, imagined another outcome, one in which the enraged god-thing overtook the men from the steamer, either in the jungle or somewhere out beyond the wall, in the village or on the beachhead. And though the ape was killed by their gunshots and gas bombs (for surely he would have returned, otherwise), first they died screaming, every last mother’s son of them. She has taken some grim satisfaction in this fantasy, on days when she has had need of grim satisfaction. But she knows it isn’t true, if only because she watched with her own eyes the Venture sailing away from the place where it had anchored out past the reefs and the deadly island, the smoke from its single stack drawing an ashen smudge across the blue morning sky. They escaped, at least enough of them to pilot the ship, and left her for dead or good as dead.\n She stretches and sits up in her nest, watching the sun as it sinks slowly into the shimmering, flat monotony of the Indian Ocean, the dying day setting the western horizon on fire. She stands, and the red-orange light paints her naked skin the color of clay. Her stomach growls again, and she thinks of her small hoard of fruit and nuts, dried fish and a couple of turtle eggs she found the day before, all wrapped up safe in banana leaves and hidden in amongst the stones and brambles. Here, she need only fear nightmares of hunger and never hunger itself. There is the faint, rotten smell of sulfur emanating from the cavern that forms the skull’s left eye socket, the mountain’s malodorous breath wafting up from bubbling hot springs deep within the grotto. She has long since grown accustomed to the stench and has found that the treacherous maze of bubbling lakes and mud helps to protect her from many of the island’s predators. For this reason, more than any other, more even than the sentimentality that she no longer denies, she chose these steep volcanic cliffs for her eyrie.\n Stepping from her bed, the stones warm against the toughened soles of her feet, she remembers a bit of melody, a ghostly snatch of lyrics that has followed her up from the dream of the city and the woman she will never be again. She closes her eyes, shutting out the jungle noises for just a moment, and listens to the faint crackle of a half-forgotten radio broadcast.\n Once I built a tower up to the sun,Brick and rivet and lime.Once I built a tower,Now it’s done.Brother, can you spare a dime?\n And when she opens her eyes again, the sun is almost gone, just a blazing sliver remaining now above the sea. She sighs and reminds herself that there is no percentage in recalling the clutter and racket of that lost world. Not now. Not here. Night is coming, sweeping in fast and mean on leathery pterodactyl wings and the wings of flying foxes and the wings of ur-birds, and like so many of the island’s inhabitants, she puts all else from her mind and rises to meet it. The island has made of her a night thing, has stripped her of old diurnal ways. Better to sleep through the stifling equatorial days than to lie awake through the equally stifling nights; better the company of the sun for her uneasy dreams than the moon’s cool, seductive glow and her terror of what might be watching from the cover of darkness.\n When she has eaten, she sits awhile near the cliff’s edge, contemplating what month this might be, what month in which year. It is a futile pastime, but mostly a harmless one. At first, she scratched marks on stone to keep track of the passing time, but after only a few hundred marks she forgot one day, and then another, and when she finally remembered, she found she was uncertain how many days had come and gone during her forgetfulness. It was then she came to understood the futility of counting days in this place—indeed, the futility of the very concept of time. She has thought often that the island must be time’s primordial orphan, a castaway, not unlike herself, stranded in some nether or lower region, this sweltering antediluvian limbo where there is only the rising and setting of the sun, the phases of the moon, the long rainy season which is hardly less hot or less brutal than the longer dry. Maybe the men who built the wall long ago were a race of sorcerers, and in their arrogance they committed a grave transgression against time, some unspeakable contravention of the sanctity of months and hours. And so Chronos cast this place back down into the gulf of Chaos, and now it is damned to exist forever apart from the tick-tock, calendar-page blessings of Aeon.\n Yes, she still recalls a few hazy scraps of Greek mythology, and Roman, too, this farmer’s only daughter who always got good marks and waited until school was done before leaving the cornfields of Indiana to go east to seek her fortune in New York and New Jersey. All her girlhood dreams of the stage, the silver screen and her name on theater marquees, but by the time she reached Fort Lee, most of the studios were relocating west to California, following the promise of a more hospitable, more profitable climate. Black Tuesday had left its stain upon the country, and she never found more than extra work at the few remaining studios, happy just to play anonymous faces in crowd scenes and the like, and finally she could not even find that. Finally, she was fit only for the squalor of bread lines and mission soup kitchens and flop houses, until the night she met a man who promised to make her a star, who, chasing dreams of his own, dragged her halfway round the world and then abandoned her here in this serpent-haunted and time-forsaken wilderness. The irony is not lost on her. Seeking fame and adoration, she has found, instead, what might well be the ultimate obscurity.\n Below her, some creature suddenly cries out in pain from the forest tangle clinging to the slopes of the mountain, and she watches, squinting into the darkness. She’s well aware that hers are only one of a hundred or a thousand pairs of eyes that have stopped to see, to try and catch a glimpse of whatever bloody panoply is being played out among the vines and undergrowth, and that this is only one of the innumerable slaughters to come before sunrise. Something screams and so all eyes turn to see, for every thing that creeps or crawls, flits or slithers upon the island will fall prey, one day or another. And she is no exception.\n One day, perhaps, the island itself will fall, not so unlike the dissatisfied angels in Milton or in Blake.\n Ann Darrow opens her eyes, having nodded off again, and she is once more only a civilized woman not yet grown old, but no longer young. One who has been taken away from the world and touched, then returned and set adrift in the sooty gulches and avenues and asphalt ravines of this modern, electric city. But that was such a long time ago, before the war that proved the Great War was not so very great after all, that it was not the war to end all wars. Japan has been burned with the fire of two tiny manufactured suns and Europe lies in ruins, and already the fighting has begun again and young men are dying in Korea. History is a steamroller. History is a litany of war.\n She sits alone in the Natural History Museum off Central Park, a bench all to herself in the alcove where the giant ape’s broken skeleton was mounted for public exhibition after the creature tumbled from the top of the Empire State, plummeting more than twelve hundred feet to the frozen streets below. There is an informative placard (white letters on black) declaring it Brontopithecus singularis Osborn (1934), only known specimen, now believed extinct. So there, she thinks. Denham and his men dragged it from the not-quite-impenetrable sanctuary of its jungle and hauled it back to Broadway; they chained it and murdered it and, in that final act of desecration, they named it. The enigma was dissected and quantified, given it’s rightful place in the grand analytic scheme, in the Latinized order of things, and that’s one less blank spot to cause the mapmakers and zoologists to scratch their heads. Now, Carl Denham’s monster is no threat at all, only another harmless, impressive heap of bones shellacked and wired together in this stately, static mausoleum. And hardly anyone remembers or comes to look upon these bleached remains. The world is a steamroller. The 8th Wonder of the World was old news twenty years ago, and now it is only a chapter in some dusty textbook devoted to anthropological curiosities.\n He was the king and the god of the world he knew, but now he comes to civilization, merely a captive, a show to gratify your curiosity. Curiosity killed the cat, and it slew the ape, as well, and that December night hundreds died for the price of a theater ticket, the fatal price of their curiosity and Carl Denham’s hubris. By dawn, the passion play was done, and the king and god of Skull Island lay crucified by biplanes, by the pilots and trigger-happy Navy men borne aloft in Curtis Helldivers armed with .50 caliber machine guns. A tiered Golgotha skyscraper, one-hundred-and-two stories of steel and glass and concrete, a dizzying Art-Deco Calvary, and no resurrection save what the museum’s anatomists and taxidermists might in time effect.\n Ann Darrow closes her eyes, because she can only ever bear to look at the bones for just so long and no longer. Henry Fairfield Osborn, the museum’s former president, had wanted to name it after her, in her honor—Brontopithecus darrowii, “Darrow’s thunder ape”—but she’d threatened a lawsuit against him and his museum and the scientific journal publishing his paper, and so he’d christened the species singularis, instead. She played her Judas role, delivering the jungle god to Manhattan’s Roman holiday, and wasn’t that enough? Must she also have her name forever nailed up there with the poor beast’s corpse? Maybe she deserved as much or far worse, but Osborn’s “honor” was poetic justice she managed to evade.\n There are voices now, a mother and her little girl, so Ann knows that she’s no longer alone in the alcove. She keeps her eyes tightly shut, wishing she could shut her ears as well and not hear the things that are being said.\n “Why did they kill him?” asks the little girl.\n “It was a very dangerous animal,” her mother replies sensibly. “It got loose and hurt people. I was just a child then, about your age.”\n “They could have put it in a zoo,” the girl protests. “They didn’t have to kill it.”\n “I don’t think a zoo would ever have been safe. It broke free and hurt a lot of innocent people.”\n “But there aren’t any more like it.”\n “There are still plenty of gorillas in Africa,” the mother replies.\n “Not that big,” says the little girl. “Not as big as an elephant.”\n “No,” the mother agrees. “Not as big as an elephant. But then we hardly need gorillas as big as elephants, now do we?”\n Ann clenches her jaws, grinding her teeth together, biting her tongue (so to speak) and gripping the edge of the bench with nails chewed down to the quicks.\n They’ll leave soon, she reminds herself. They always do, get bored and move along after only a minute or so. It won’t be much longer.\n “What does that part say?” the child asks eagerly, so her mother reads to her from the text printed on the placard.\n “Well, it says, ‘Kong was not a true gorilla, but a close cousin, and belongs in the Superfamily Hominoidea with gorillas, chimpanzees, orang-utans, gibbons, and human beings. His exceptional size might have evolved in response to his island isolation.’”\n “What’s a super family?”\n “I don’t really know, dear.”\n “What’s a gibbon?”\n “I think it’s a sort of monkey.”\n “But we don’t believe in evolution, do we?”\n “No, we don’t.”\n “So God made Kong, just like he made us?”\n “Yes, honey. God made Kong.”\n And then there’s a pause, and Ann holds her breath, wishing she were still dozing, still lost in her terrible dreams, because this waking world is so much more terrible.\n “I want to see the Tyrannosaurus again,” says the little girl, “and the Triceratops, too.” Her mother says okay, there’s just enough time to see the dinosaurs again before we have to meet your Daddy, and Ann sits still and listens to their footsteps on the polished marble floor, growing fainter and fainter until silence has at last been restored to the alcove. But now the sterile, drab museum smells are gone, supplanted by the various rank odors of the apartment Jack rented for the both of them before he shipped out on a merchant steamer, the Polyphemus, bound for the Azores and then Lisbon and the Mediterranean. He never made it much farther than São Miguel, because the steamer was torpedoed by a Nazi U-boat and went down with all hands onboard. Ann opens her eyes, and the strange dream of the museum and the ape’s skeleton has already begun to fade. It isn’t morning yet, and the lamp beside the bed washes the tiny room with yellow-white light that makes her eyes ache.\n She sits up, pushing the sheets away, exposing the ratty grey mattress underneath. The bedclothes are damp with her sweat and with radiator steam, and she reaches for the half-empty gin bottle there beside the lamp. The booze used to keep the dreams at bay, but these last few months, since she got the telegram informing her that Jack Driscoll was drowned and given up for dead and she would never be seeing him again, the nightmares have seemed hardly the least bit intimidated by alcohol. She squints at the clock, way over on the chifforobe, and sees that it’s not yet even four a.m.. Still hours until sunrise, hours until the bitter comfort of winter sunlight through the bedroom curtains. She tips the bottle to her lips, and the liquor tastes like turpentine and regret and everything she’s lost in the last three years. Better she would have never been anything more than a starving woman stealing apples and oranges to try to stay alive, better she would have never stepped foot on the Venture. Better she would have died in the green hell of that uncharted island. She can easily imagine a thousand ways it might have gone better, all grim but better than this drunken half-life. She does not torture herself with fairy-tale fantasies of happy endings that never were and never will be. There’s enough pain in the world without that luxury.\n She takes another swallow from the bottle, then reminds herself that it has to last until morning and sets it back down on the table. But morning seems at least as far away as that night on the island, as far away as the carcass of the sailor she married. Often, she dreams of him, gnawed by the barbed teeth of deep-sea fish and mangled by shrapnel, burned alive and rotted beyond recognition, tangled in the wreckage and ropes and cables of a ship somewhere at the bottom of the Atlantic Ocean. He peers out at her with eyes that are no longer eyes at all, but only empty sockets where eels and spiny albino crabs nestle. She usually wakes screaming from those dreams, wakes to the asshole next door pounding on the wall with the heel of a shoe or just his bare fist and shouting how he’s gonna call the cops if she can’t keep it down. He has a job and has to sleep, and he can’t have some goddamn rummy broad half the bay over or gone crazy with the DTs keeping him awake. The old Italian cunt who runs this dump, she says she’s tired of hearing the complaints, and either the hollering stops or Ann will have to find another place to flop. She tries not to think about how she’ll have to find another place soon, anyway. She had a little money stashed in the lining of her coat, from all the interviews she gave the papers and magazines and the newsreel people, but now it’s almost gone. Soon, she’ll be back out on the bum, sleeping in mission beds or worse places, whoring for the sauce and as few bites of food as she can possibly get by on. Another month, at most, and isn’t that what they mean by coming full circle?\n She lies down again, trying not to smell herself or the pillowcase or the sheets, thinking about bright July sun falling warm between green leaves. And soon, she drifts off once more, listening to the rumble of a garbage truck down on Canal Street, the rattle of its engine and the squeal of its breaks not so very different from the primeval grunts and cries that filled the torrid air of the ape’s profane cathedral.\n And perhaps now she is lying safe and drunk in a squalid Bowery tenement and only dreaming away the sorry dregs of her life, and it’s not the freezing morning when Jack led her from the skyscraper’s spire down to the bedlam of Fifth Avenue. Maybe these are nothing more than an alcoholic’s fevered recollections, and she is not being bundled in wool blankets and shielded from reporters and photographers and the sight of the ape’s shattered body.\n “It’s over,” says Jack, and she wants to believe that’s true, by all the saints in Heaven and all the sinners in Hell, wherever and whenever she is, she wants to believe that it is finally and irrevocably over. There is not one moment to be relived, not ever again, because it has ended, and she is rescued, like Beauty somehow delivered from the clutching paws of the Beast. But there is so much commotion, the chatter of confused and frightened bystanders, the triumphant, confident cheers and shouting of soldiers and policemen, and she’s begging Jack to get her out of it, away from it. It must be real, all of it, real and here and now, because she has never been so horribly cold in her dreams. She shivers and stares up at the narrow slice of sky visible between the buildings. The summit of that tallest of all tall towers is already washed with dawn, but down here on the street, it may as well still be midnight.\n Life is just a bowl of cherries.Don’t take it serious; it’s too mysterious.At eight each morning I have got a date,To take my plunge ’round the Empire State.You’ll admit it’s not the berries,In a building that’s so tall . . .\n “It’s over,” Jack assures her for the tenth or twentieth or fiftieth time. “They got him. The airplanes got him, Ann. He can’t hurt you, not anymore.”\n And she’s trying to remember through the clamor of voices and machines and the popping of flash bulbs—Did he hurt me? Is that what happened?—when the crowd divides like the holy winds of Jehovah parting the waters for Moses, and for the first time she can see what’s left of the ape. And she screams, and they all think she’s screaming in terror at the sight of a monster. They do not know the truth, and maybe she does not yet know herself and it will be weeks or months before she fully comprehends why she is standing there screaming and unable to look away from the impossible, immense mound of black fur and jutting white bone and the dark rivulets of blood leaking sluggishly from the dead and vanquished thing.\n “Don’t look at it,” Jack says, and he covers her eyes with a callused palm. “It’s nothing you need to see.”\n So she does not see, shutting her bright blue eyes and all the eyes of her soul, the eyes without and those other eyes within. Shutting herself, slamming closed doors and windows of perception, and how could she have known that she was locking in more than she was locking out. Don’t look at it, he said, much too late, and these images are burned forever into her lidless, unsleeping mind’s eye.\n A sable hill from which red torrents flow.\n Ann kneels in clay and mud the color of a slaughterhouse floor, all the shades of shit and blood and gore, and dips her fingertips into the stream. She has performed this simple act of prostration times beyond counting, and it no longer holds for her any revulsion. She comes here from her nest high in the smoldering ruins of Manhattan and places her hand inside the wound, like St. Thomas fondling the pierced side of Christ. She comes down to remember, because there is an unpardonable sin in forgetting such a forfeiture. In this deep canyon molded not by geologic upheaval and erosion but by the tireless, automatic industry of man, she bows her head before the black hill. God sleeps there below the hill, and one day he will awaken from his slumber, for all those in the city are not faithless. Some still remember and follow the buckled blacktop paths, weaving their determined pilgrims’ way along decaying thoroughfares and between twisted girders and the tumbledown heaps of burnt-out rubble. The city was cast down when God fell from his throne (or was pushed, as some have dared to whisper), and his fall broke apart the ribs of the world and sundered even the progression of one day unto the next so that time must now spill backwards to fill in the chasm. Ann leans forward, sinking her hand in up to the wrist, and the steaming crimson stream begins to clot and scab where it touches her skin.\n Above her, the black hill seems to shudder, to shift almost imperceptibly in its sleep.\n She has thought repeatedly of drowning herself in the stream, has wondered what it would be like to submerge in those veins and be carried along through silent veils of silt and ruby-tinted light. She might dissolve and be no more than another bit of flotsam, unburdened by bitter memory and self-knowledge and these rituals to keep a comatose god alive. She would open her mouth wide, and as the air rushed from her lungs and across her mouth, she would fill herself with His blood. She has even entertained the notion that such a sacrifice would be enough to wake the black sleeper, and as the waters that are not waters carried her away, the god beast might stir. As she melted, He would open His eyes and shake Himself free of the holdfasts of that tarmac and cement and sewer-pipe grave. It could be that simple. In her waking dreams, she has learned there is incalculable magic in sacrifice.\n Ann withdraws her hand from the stream, and blood drips from her fingers, rejoining the whole as it flows away north and east towards the noxious lake that has formed where once lay the carefully landscaped and sculpted conceits of Mr. Olmsted and Mr. Vaux’s Central Park. She will not wipe her hand clean as would some infidel, but rather permit the blood to dry to a claret crust upon her skin, for she has already committed blasphemy enough for three lifetimes. The shuddering black hill is still again, and a vinegar wind blows through the tall grass on either side of the stream.\n And then Ann realizes that she’s being watched from the gaping brick maw that was a jeweler’s window long ago. The frame is still rimmed round about with jagged crystal teeth waiting to snap shut on unwary dreamers, waiting to shred and pierce, starved for diamonds and sapphires and emeralds, but more than ready to accept mere meat. In dusty shafts of sunlight, Ann can see the form of a young girl gazing out at her, her skin almost as dark as the seeping hill.\n “What do you want?” Ann calls to her, and a moment or two later, the girl replies.\n “You have become a goddess,” she says, moving a little nearer the broken shop window so that Ann might have a better look at her. “But even a goddess cannot dream forever. I have come a long way and through many perils to speak with you, Golden Mother, and I did not expect to find you sleeping and hiding in the lies told by dreams.”\n “I’m not hiding,” Ann replies very softly, so softly she thinks surely the girl will not have heard her.\n “Forgive me, Golden Mother, but you are. You are seeking refuge in guilt that is not your guilt.”\n “I am not your mother,” Ann tells her. “I have never been anyone’s mother.”\n And then a branch whips around and catches her in the face, a leaf’s razor edge to draw a nasty cut across her forehead. But the pain slices cleanly through exhaustion and shock and brings her suddenly back to herself, back to this night and this moment, their mad, headlong dash from the river to the gate. The Cyclopean wall rises up before them, towering above the tree tops. There cannot now be more than a hundred yards remaining between them and the safety of the gate, but the ape is so very close behind. A fire-eyed demon who refuses to be so easily cheated of his prize by mere mortal men. The jungle cringes around them, flinching at the cacophony of Kong’s approach, and even the air seems to draw back from that typhoon of muscle and fury, his angry roars and thunderous footfalls to divide all creation. Her right hand is gripped tightly in Jack’s left, and he’s all but dragging her forward. Ann can no longer feel her bare feet, which have been bruised and gouged and torn, and it is a miracle she can still run at all. Now she can make out the dim silhouettes of men standing atop the wall, men with guns and guttering torches, and, for a moment, she allows herself to hope.\n “You are needed, Golden Mother,” the girl says, and then she steps through the open mouth of the shop window. The blistering sun shimmers off her smooth, coffee-colored skin. “You are needed here and now,” she says. “That night and every way that it might have gone, but did not, are passed forever beyond even your reach.”\n “You don’t see what I can see,” Ann tells the girl, hearing the desperation and resentment in her own voice.\n And what she sees is the aboriginal wall and that last line of banyan figs and tree ferns. What she sees is the open gate and the way out of this nightmare, the road home.\n “Only dreams,” the girl says, not unkindly, and she takes a step nearer the red stream. “Only the phantoms of things that have never happened and never will.”\n “No,” says Ann, and she shakes her head. “We made it to the gate. Jack and I both, together. We ran and we ran and we ran, and the ape was right there on top of us all the way, so close that I could smell his breath. But we didn’t look back, not even once. We ran, and, in the end, we made it to the gate.”\n “No, Golden Mother. It did not happen that way.”\n One of the sailors on the wall is shouting a warning now, and at first, Ann believes it’s only because he can see Kong behind them. But then something huge and long-bodied lunges from the underbrush at the clearing’s edge, all scales and knobby scutes, scrabbling talons and the blue-green iridescent flash of eyes fashioned for night hunting. The high, sharp quills sprouting from the creature’s backbone clatter one against the other like bony castanets, and it snatches Jack Driscoll in its saurian jaws and drags him screaming into the reedy shadows. On the wall, someone shouts, and she hears the staccato report of rifle fire.\n The brown girl stands on the far side of the stream flowing along 5th Avenue, the tall grass murmuring about her knees. “You have become lost in All-at-Once time, and you must find your way back from the Everywhen. I can help.”\n “I do not need your help,” Ann snarls. “You keep away from me, you filthy goddamn heathen.”\n Beneath the vast, star-specked Indonesian sky, Ann Darrow stands alone. Jack is gone, taken by some unnamable abomination, and in another second the ape will be upon her. This is when she realizes that she’s bleeding, a dark bloom unfolding from her right breast, staining the gossamer rags that are all that remain of her dress and underclothes. She doesn’t yet feel the sting of the bullet, a single shot gone wild, intended for Jack’s attacker, but finding her, instead. I do not blame you, she thinks, slowly collapsing, going down onto her knees in the thick carpet of moss and ferns. It was an accident, and I do not blame anyone . . .\n “That is a lie,” the girl says from the other side of the red stream. “You do blame them, Golden Mother, and you blame yourself, most of all.”\n Ann stares up at the dilapidated skyline of a city as lost in time as she, and the vault of Heaven turns above them like a dime-store kaleidoscope.\n Once I built a railroad, I made it run, made it race against time. Once I built a railroad; now it’s done. Brother, can you spare a dime? Once I built a tower, up to the sun, brick, and rivet, and lime; Once I built a tower, now it’s done. Brother, can you spare a dime?\n “When does this end?” she asks, asking the girl or herself or no one at all. “Where does it end?”\n “Take my hand,” the girl replies and reaches out to Ann, a bridge spanning the rill and time and spanning all these endless possibilities. “Take my hand and come back over. Just step across and stand with me.”\n “No,” Ann hears herself say, though it isn’t at all what she wanted to say or what she meant to say. “No, I can’t do that. I’m sorry.”\n And the air around her reeks of hay and sawdust, human filth and beer and cigarette smoke, and the sideshow barker is howling his line of ballyhoo to all the rubes who’ve paid their two-bits to get a seat under the tent. All the yokels and hayseeds who have come to point and whisper and laugh and gawk at the figure cowering inside the cage.\n “Them bars there, they are solid carbon steel, mind you,” the barker informs them. “Manufactured special for us by the same Pittsburgh firm that supplies prison bars to Alcatraz. Ain’t nothing else known to man strong enough to contain her, and if not for those iron bars, well . . . rest assured, my good people, we have not in the least exaggerated the threat she poses to life and limb, in the absence of such precautions.”\n Inside the cage, Ann squats in a corner, staring out at all the faces staring in. Only she has not been Ann Darrow in years—just ask the barker or the garish canvas flaps rattling in the chilly breeze of an Indiana autumn evening. She is the Ape Woman of Sumatra, captured at great personal risk by intrepid explorers and hauled out into the incandescent light the 20th Century. She is naked, except for the moth-eaten scraps of buffalo and bear pelts they have given her to wear. Every inch of exposed skin is smeared with dirt and offal and whatever other filth has accumulated in her cage since it was last mucked out. Her snarled and matted hair hangs in her face, and there’s nothing the least bit human in the guttural serenade of growls and hoots and yaps that escapes her lips.\n The barker slams his walking cane against the iron bars, and she throws her head back and howls. A woman in the front row faints and has to be carried outside.\n “She was the queen and the goddess of the strange world she knew,” bellows the barker, “but now she comes to civilization, merely a captive, a show to gratify your curiosity. Learned men at colleges—forsaking the words of the Good Book—proclaim that we are all descended from monkeys. And, I’ll tell you, seeing this wretched bitch, I am almost tempted to believe them, and also to suspect that in dark and far-flung corners of the globe there exist to this day beings still more simian than human, lower even than your ordinary niggers, hottentots, negritos, and lowly African pygmies.”\n Ann Darrow stands on the muddy bank of the red stream, and the girl from the ruined and vine-draped jewelry shop holds out her hand, the brown-skinned girl who has somehow found her way into the most secret, tortured recesses of Ann’s consciousness.\n “The world is still here,” the girl says, “only waiting for you to return.”\n “I have heard another tale of her origin,” the barker confides. “But I must warn you, it is not fit for the faint of heart or the ears of decent Christian women.”\n There is a long pause, while two or three of the women rise from their folding chairs and hurriedly leave the tent. The barker tugs at his pink suspenders and grins an enormous, satisfied grin, then glances into the cage.\n “As I was saying,” he continues, “there is another story. The Chinaman who sold me this pitiful oddity of human de-evolution said that its mother was born of French aristocracy, the lone survivor of a calamitous shipwreck, cast ashore on black volcanic sands. There, in the hideous misery and perdition of that Sumatran wilderness, the poor woman was defiled by some lustful species of jungle imp, though whether it were chimp or baboon I cannot say.”\n There is a collective gasp from the men and women inside the tent, and the barker rattles the bars again, eliciting another irate howl from its occupant.\n “And here before you is the foul spawn of that unnatural union of anthropoid and womankind. The aged Mandarin confided to me that the mother expired shortly after giving birth, God rest her immortal soul. Her death was a mercy, I should think, as she would have lived always in shame and horror at having borne into the world this shameful, misbegotten progeny.”\n “Take my hand,” the girl says, reaching into the cage. “You do not have to stay here. Take my hand, Golden Mother, and I will help you find the path.”\n There below the hairy black tumulus, the great slumbering titan belching forth the headwaters of all the earth’s rivers, Ann Darrow takes a single hesitant step into the red stream. This is the most perilous part of the journey, she thinks, reaching to accept the girl’s outstretched hand. It wants me, this torrent, and if I am not careful, it will pull me down and drown me for my trespasses.\n “It’s only a little ways more,” the girl tells her and smiles. “Just step across to me.”\n The barker raps his silver-handled walking cane sharply against the bars of the cage, so that Ann remembers where she is and when, and doing so, forgets herself again. For the benefit of all those licentious, ogling eyes, all those slack jaws that have paid precious quarters to be shocked and titillated, she bites the head off a live hen, and when she has eaten her fill of the bird, she spreads her thighs and masturbates for the delight of her audience with filthy, bloodstained fingers.\n Elsewhen, she takes another step towards the girl, and the softly gurgling stream wraps itself greedily about her calves. Her feet sink deeply into the slimy bottom, and the sinuous, clammy bodies of conger eels and salamanders wriggle between her ankles and twine themselves about her legs. She cannot reach the girl, and the opposite bank may as well be a thousand miles away.\n In a smoke-filled screening room, Ann Darrow sits beside Carl Denham while the footage he shot on the island almost a year ago flickers across the screen at twenty-four frames per second. They are not alone, the room half-filled with low-level studio men from RKO and Paramount and Universal and a couple of would-be financiers lured here by the Hollywood rumor mill. Ann watches the images revealed in grainy shades of grey, in overexposed whites and underexposed smudges of black.\n “What exactly are we supposed to be looking at?” someone asks impatiently.\n “We shot this stuff from the top of the wall, once Englehorn’s men had managed to frighten away all the goddamn tar babies. Just wait. It’s coming.”\n “Denham, we’ve already been sitting here half an hour. This shit’s pretty underwhelming, you ask me. You’re better off sticking to the safari pictures.”\n “It’s coming,” Denham insists and chomps anxiously at the stem of his pipe.\n And Ann knows he’s right, that it’s coming, because this is not the first time she’s seen the footage. Up there on the screen, the eye of the camera looks out over the jungle canopy, and it always reminds her of Gustave Doré’s visions of Eden from her mother’s copy of Paradise Lost, or the illustrations of lush Pre-Adamite landscapes from a geology book she once perused in the New York Public Library.\n “Honestly, Mr. Denham,” the man from RKO sighs. “I’ve got a meeting in twenty minutes—”\n “There,” Denham says, pointing at the screen. “There it is. Right fucking there. Do you see it?”\n And the studio men and the would-be financiers fall silent as the beast’s head and shoulders emerge from the tangle of vines and orchid-encrusted branches and wide palm fronds. It stops and turns its mammoth head towards the camera, glaring hatefully up at the wall and directly into the smoke-filled room, across a million years and nine thousand miles. There is a dreadful, unexpected intelligence in those dark eyes as the creature tries to comprehend the purpose of the weird, pale men and their hand-crank contraption perched there on the wall above it. Its lips fold back, baring gigantic canines, eyeteeth longer than a grown man’s hand, and there is a low, rumbling sound, then a screeching sort of yell, before the thing the natives called Kong turns and vanishes back into the forest.\n “Great god,” the Universal man whispers.\n “Yes gentlemen,” says Denham, sounding very pleased with himself and no longer the least bit anxious, certain that he has them all right where he wants them. “That’s just exactly what those tar babies think. They worship it and offer up human sacrifices. Why, they wanted Ann here. Offered us six of their women so she could become the bride of Kong. And there’s our story, gentlemen.”\n “Great god,” the Universal man says again, louder than before.\n “But an expedition like this costs money,” Denham tells them, getting down to brass tacks as the reel ends and the lights come up. “I mean to make a picture the whole damn world’s gonna pay to see, and I can’t do that without committed backers.”\n “Excuse me,” Ann says, rising from her seat, feeling sick and dizzy and wanting to be away from these men and all their talk of money and spectacle, wanting to drive the sight of the ape from her mind, once and for all.\n “I’m fine, really,” she tells them. “I just need some fresh air.”\n On the far side of the stream, the brown-skinned girl urges her forward, no more than twenty feet left to go and she’ll have reached the other side. “You’re waking up,” the girl says. “You’re almost there. Give me your hand.”\n I’m only going over JordanI’m only going over home . . .\n And the moments flash and glimmer as the dream breaks apart around her, and the barker rattles the iron bars of a stinking cage, and her empty stomach rumbles as she watches men and women bending over their plates in a lunch room, and she sits on a bench in an alcove on the third floor of the American Museum of Natural History. Crossing the red stream, Ann Darrow hemorrhages time, all these seconds and hours and days vomited forth like a bellyful of tainted meals. She shuts her eyes and takes another step, sinking even deeper in the mud, the blood risen now as high as her waist. Here is the morning they brought her down from the Empire State Building, and the morning she wakes in her nest on Skull Mountain, and the night she watched Jack Driscoll devoured well within sight of the archaic gates. Here’s the Bowery tenement, and here the screening room, and here a fallen Manhattan, crumbling and lost in the storm-tossed gulf of eons, set adrift no differently than she has set herself adrift. Every moment all at once, each as real as every other, and never mind the contradictions, each damned and equally inevitable, all following from a stolen apple and the man who paid the Greek a dollar to look the other way.\n The world is a steamroller.\n Once I built a railroad; now it’s done.\n She stands alone in the seaward lee of the great wall and knows that its gates have been forever shut against her and all the daughters of men yet to come. This hallowed, living wall of human bone and sinew erected to protect what scrap of Paradise lies inside, not the dissolute, iniquitous world of men sprawling beyond its borders. Winged Cherubim stand guard on either side, and in their leonine forepaws they grasp flaming swords forged in unknown furnaces before the coming of the World, fiery brands that reach all the way to the sky and about which spin the hearts of newborn hurricanes. The molten eyes of the Cherubim watch her every move, and their indifferent minds know her every secret thought, these dispassionate servants of the vengeful god of her father and her mother. Neither tears nor all her words will ever wring mercy from these sentinels, for they know precisely what she is, and they know her crimes.\n I am she who cries out,and I am cast forth upon the face of the earth.\n The starving, ragged woman who stole an apple. Starving in body and in mind, starving in spirit if so base a thing as she can be said to possess a soul. Starving, and ragged in all ways.\n I am the members of my mother.I am the barren oneand many are her sons.I am she whose wedding is great,and I have not taken a husband.\n And as is the way of all exiles, she cannot kill hope that her exile will one day end. Even the withering gaze of the Cherubim cannot kill that hope, and so hope is the cruelest reward.\n Brother, can you spare a dime?\n “Take my hand,” the girl says, and Ann Darrow feels herself grown weightless and buoyed from that foul brook, hauled free of the morass of her own nightmares and regret onto a clean shore of verdant mosses and zoysiagrass, bamboo and reeds, and the girl leans down and kisses her gently on the forehead. The girl smells like sweat and nutmeg and the pungent yellow pigment dabbed across her cheeks.\n “You have come home to us, Golden Mother,” she says, and there are tears in her eyes.\n “You don’t see,” Ann whispers, the words slipping out across her tongue and teeth and lips like her own ghost’s death rattle. If the jungle air were not so still and heavy, not so turgid with the smells of living and dying, decay and birth and conception, she’s sure it would lift her as easily as it might a stray feather and carry her away. She lies very still, her head cradled in the girl’s lap, and the stream flowing past them is only water and the random detritus of any forest stream.\n “The world blinds those who cannot close their eyes,” the girl tells her. “You were not always a god and have come here from some outer world, so it may be you were never taught how to travel that path and not become lost in All-at-Once time.”\n Ann Darrow digs her fingers into the soft, damp earth, driving them into the loam of the jungle floor, holding on and still expecting this scene to shift, to unfurl, to send her tumbling pell-mell and head over heels into some other now, some other where.\n And sometime later, when she’s strong enough to stand again, and the sickening, vertigo sensation of fluidity has at last begun to fade, the girl helps Ann to her feet, and together they follow the narrow dirt trail leading back up this long ravine to the temple. Like Ann, the girl is naked save a leather breechcloth tied about her waist. They walk together beneath the sagging boughs of trees that must have been old before Ann’s great great grandmothers were born, and here and there is ample evidence of the civilization that ruled the island in some murky, immemorial past—glimpses of great stone idols worn away by time and rain and the humid air, disintegrating walls and archways leaning at such precarious angles Ann cannot fathom why they have not yet succumbed to gravity. Crumbling bas-reliefs depicting the loathsome gods and demons and the bizarre reptilian denizens of this place. As they draw nearer to the temple, the ruins become somewhat more intact, though even here the splayed roots of the trees are slowly forcing the masonry apart. The roots put Ann in mind of the tentacles of gargantuan octopi or cuttlefish, and that is how she envisions the spirit of the jungles and marshes fanning out around this ridge—grey tentacles advancing inch by inch, year by year, inexorably reclaiming what has been theirs all along.\n As she and the girl begin to climb the steep and crooked steps leading up from the deep ravine—stones smoothed by untold generations of footsteps—Ann stops to catch her breath and asks the brown girl how she knew where to look, how it was she found her at the stream. But the girl only stares at her, confused and uncomprehending, and then she frowns and shakes her head and says something in the native patois. In Anne’s long years on the island, since the Venture deserted her and sailed away with what remained of the dead ape, she has never learned more than a few words of that language, and she has never tried to teach this girl nor any of her people English. The girl looks back the way they’ve come; she presses the fingers of her left hand against her breast, above her heart, then uses the same hand to motion towards Ann.\n Life is just a bowl of cherries.Don’t take it serious; it’s too mysterious.\n By sunset, Ann has taken her place on the rough-hewn throne carved from beds of coral limestone thrust up from the seafloor in the throes of the island’s cataclysmic genesis. As night begins to gather once again, torches are lit, and the people come bearing sweet-smelling baskets of flowers and fruit, fish and the roasted flesh of gulls and rats and crocodiles. They lay multicolored garlands and strings of pearls at her feet, a necklace of ankylosaur teeth, rodent claws, and monkey vertebrae, and she is only the Golden Mother once again. They bow and genuflect, and the tropical night rings out with joyous songs she cannot understand. The men and woman decorate their bodies with yellow paint in an effort to emulate Ann’s blonde hair, and a sort of pantomime is acted out for her benefit, as it is once every month, on the night of the new moon. She does not need to understand their words to grasp its meaning—the coming of the Venture from somewhere far away, Ann offered up as the bride of a god, her marriage and the death of Kong, and the ascent of the Golden Mother from a hellish underworld to preside in his stead.\n The end of one myth and the beginning of another, the turning of a page. I am not lost, Ann thinks. I am right here, right now—here and now where, surely, I must belong, and she watches the glowing bonfire embers rising up to meet the dark sky. She knows she will see that terrible black hill again, the hill that is not a hill and its fetid crimson river, but she knows, too, that there will always be a road back from her dreams, from that All-at-Once tapestry of possibility and penitence. In her dreams, she will be lost and wander those treacherous, deceitful paths of Might-Have-Been, and always she will wake and find herself once more.\n Caitlín R. Kiernan is a two-time recipient of both the World Fantasy and Bram Stoker awards, and the New York Times has declared her \"one of our essential writers of dark fiction.\" Her recent novels include The Red Tree and The Drowning Girl: A Memoir, and, to date, her short stories have been collected in twelve volumes, including Tales of Pain and Wonder, A is for Alien, The Ammonite Violin & Others, and the World Fantasy Award winning The Ape's Wife and Other Stories. Currently she's editing her thirteenth, fourteenth, and fifteenth collections—Beneath an Oil Dark Sea: The Best of Caitlín R. Kiernan (Volume 2) and Cambrian Tales (Subterranean Press) and Houses Under the Sea: Mythos Tales (Centipede Press). She has recently concluded Alabaster, her award-winning, three-volume graphic novel for Dark Horse Comics. She will soon begin work on her next novel, Interstate Love Song, based on \"Interstate Love Long (Murder Ballad No. 8).\" She lives in Providence, Rhode Island."}