{"fingerprint": "EB1xtPCuf84ZMMn377RxCfatRBc=", "sitename": "Clarkesworld Magazine", "title": "The Massage Lady at Munjeong Road Bathhouse by Isabel J. Kim", "author": "Isabel J Kim", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kim_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Massage Lady at Munjeong Road Bathhouse by Isabel J. Kim", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4660 words, short story\n The Massage Lady at Munjeong Road Bathhouse\n Kim Jinah has worked at the Munjeong Road bathhouse for six years. She’s scrubbed the tiles of the large baths. She’s manned the counter that sells squeeze packs of shampoo, baked eggs, and cold drinks. Jinah is now a massage lady. It’s not a glamorous job.\n Jinah stands in her old underwear and scrapes the future from women’s skin. Their scales fall to the floor. The women sit up scoured red and smooth.\n The scales are impossible to see unless you’ve learned how to look, but impossible to miss once you’ve learned how to see them. They’re translucent, shimmering, and colorful. They look too beautiful to be what they are—chrysalises for concrete lives, locking in a course of action for the person they’re attached to. Once the scales turn opaque, they become impossible to remove.\n It’s curiously satisfying to scrub the immature scales away with the rough washcloth. They dissolve when they fall on the wet floor.\n Jinah’s fingers are always wrinkled. Even when she dries off and slathers lotion over her skin, there are lines that take hours to un-crease. Her daughter likes to run her chubby fingers across them.\n “That’s what happens when you grow up,” Jinah tells her daughter, who sits in Jinah’s lap while they watch children’s cartoons. Yebin presses her hand against Jinah’s, and Jinah cups her fingers around Yebin’s whole hand.\n The faintest shimmer of scales brocades Yebin’s skin, a contrast to the nearly opaque tessellation across the back of Jinah’s hands, running up her arms like little gleaming pebbles. Sometimes Jinah picks a few off in the bathroom and watches them melt away in the sink. The scales take a few days to grow back, coming in pale and near-transparent. It eases something in Jinah’s chest to be rid of them, even if the majority remain.\n “I’m never going to grow up,” Yebin says. Jinah drops a kiss on her daughter’s head and wonders how many other little girls have said the same thing with the same confidence, how many other little girls live inside the women whose scales she scrapes away.\n Jinah has regulars at the massage table. There’s an old lady who comes in every two weeks, complaining about everything under the sun. An office lady with poor circulation, who has the coldest feet Jinah has ever felt. Jinah has recommended traditional medicine, but the office lady never listens. Then there’s Lee Injung, who has the sort of body that people pay money for and a nicotine tremor in her hands.\n “Hey, Jinah,” Injung says. “Same as last week, please.”\n Jinah gestures for her to get on the massage table. Injung slides on and turns onto her front. Injung is one of those people who are always trying to outrun their future, covered in scales so dense it almost looks like snakeskin. Sometimes Jinah wonders if Injung can see them, and that’s why the woman is practically religious about having her limbs scrubbed raw and red. Or maybe it’s just that Injung considers Jinah a friend.\n “I’m thinking about quitting my job,” Injung says.\n “Again?”\n “What do you mean, again?”\n “You quit your last job, too—what was it, hairdressing?—to work at that makeup store.”\n “Hairdressing was boring! Everything’s boring! I thought selling makeup would be interesting, but it turns out that it’s the same as selling everything else.”\n “Of course it’s like everything else—it’s still just products,” Jinah says.\n “I just thought . . . ” Injung trails off wistfully. “Hey, how do you like your job?”\n “You don’t want my job,” Jinah says, scrubbing at a particularly stubborn patch of scales on Injung’s lower back. Her arms ache with the effort.\n “Yeah, but how do you like it?”\n Jinah pauses, unbends, slaps Injung’s thigh. Injung shrieks.\n “How do you think I like it?” Jinah says. “Hey, you think I would be doing this if I wasn’t getting paid? If my husband wasn’t dead? If I didn’t have a kid to raise?”\n “Ow, I’m sorry, Jinah! You know I didn’t mean it like that,” Injung whines.\n “Don’t talk about things you don’t know about,” Jinah says, rubbing Injung’s thigh in apology. A few scales flake off.\n Injung is quiet. Jinah concentrates on removing the rest of the scales from Injung’s back. The sound of rushing water from the showerheads and the fake waterfall fade into the background.\n “There must be something you like about it,” Injung says. Jinah sighs. Injung, the terminal optimist.\n “Well, it really gives you a new perspective on people’s bodies,” Jinah says, scraping the last scale from Injung’s skin.\n “Mm,” Injung says, sounding thoughtful. “Well. I’m going to quit the makeup job. I’ve decided.”\n Jinah couldn’t see the scales until she had worked at the bathhouse for months. It had been hard. She’s grateful to have landed at the bathhouse, after her husband’s death—there are so many more unsavory outcomes. But it was physical work, and Jinah had gone from being a high schooler to a college dropout to a housewife. She adjusted. She cleaned the bathhouse. She took care of her daughter. She put balm on her sore limbs and waterproof bandages over her blisters. She asked for more responsibilities at work.\n Kang Yuna, the owner-manager, had nodded and said, “I knew I did the right thing, taking a chance on you,” and told Jinah that one of the massage ladies was retiring. So Jinah learned how to scrub flesh into submission.\n For the first few months, Yuna occasionally worked alongside her, which Jinah found strange because Yuna, as the owner of the entire bathhouse, has better things to do with her time. Seemingly arbitrarily, Yuna would say, “I’m taking care of this one,” and wave a woman over to her table. There didn’t seem to be a uniting factor to the customers Yuna chose, and Yuna scrubbed their dead skin away with the same brisk efficiency she scrubbed everyone else’s. Jinah watched Yuna work, trying to find a pattern, but all she saw was her boss, the rough washcloth, and the skin.\n Then one afternoon, Jinah noticed a glimmer across a customer’s arm. She assumed it was some sort of body glitter, or a trick of the light on wet flesh. Then the next week she saw the perfect curves of the scales that were flying off while Yuna scrubbed. Jinah’s eyes kept being drawn back to the way the scales sparkled as they melted on the wet floor.\n When Jinah looked up again, Yuna—who now seemed to be covered in green, semitranslucent iridescence—was watching her back. Jinah’s face must have betrayed some sort of surprise, because Yuna raised her eyebrows and pointed her chin, gesturing for Jinah to look around the bathing room.\n Jinah glanced at the other women, washing their hair, soaking in tubs, and was amazed to see that nearly three-quarters of the women there had similar glimmering scales, of varying colors and opacities. She looked down at her own hands and saw that their backs were covered in translucent blue.\n “What is—”\n “You can see them, yeah?” Yuna cut her off. “We’ll talk after work.”\n Jinah just nodded, not entirely trusting that this wasn’t a hallucination. But Yuna explained in her office with the door closed, and the scales never left Jinah’s field of vision.\n The scales are the calcification of choices. Some people have more of them than others—the world having been less forgiving, or their personalities less flexible. Eventually everyone has them, and eventually they grow opaque. It takes a manual touch, at that point, to rid a person of the future they don’t want. To allow them to change.\n “Don’t ask me why you can see them,” Yuna said, in the office after work. “It’s probably because the bathhouse is cursed.”\n “The bathhouse is cursed?”\n “Okay, it’s not cursed,” Yuna had said. “It’s just the massage lady position that’s cursed.”\n Yuna went into a tangent after that. Something about the way the physicality of the job contributes to a sort of cosmic sensitivity, something about acupuncture pressure points and energy pools, how Yuna had been pretty skeptical but there’s been a “one-hundred-percent correlation between scales and choices, and it makes the job way more interesting, so it’s good that you can see them, Jinah.”\n “Just use your best judgement on whose scales to scrape,” Yuna finished with. “You can kind of tell when people are happy with their lives and when they’re not.”\n “Are you sure?” Jinah said, frowning.\n Yuna waved a dismissive hand. “If you’re worried, just scrape everyone who comes for a massage. They lay down for a massage, they must be stressed enough to need a change, anyway.”\n They didn’t talk about the scales on Jinah’s arms, the scales crawling up Yuna’s neck. Jinah diligently scrapes the scales off of every client who lies on her table. She’s not sure it’s the most responsible choice. It makes her feel powerful, though, to scrape away the future without her client’s knowledge.\n Sometimes Jinah fantasizes about really getting in there with the rough washcloth and scraping every last scale off her own body. If she scrubbed deep enough, maybe she could stop being Yebin’s mother. Maybe she could stop making all her decisions with Yebin in mind. Then she could be awful to Yebin, who was an accident, who forced her shotgun marriage, whose name is derived from the word that means to be beautiful.\n They’re ugly thoughts. Jinah is ashamed of them. They’re why she restricts herself to plucking a few scales from her skin at a time. Why she restricts herself to scraping the scales off customers. Jinah’s afraid of what she’ll do if she’s given options. Better to stay where she is.\n On school holidays, Jinah takes Yebin with her to the bathhouse. She brings Yebin’s strawberry shampoo, and Yebin brings her mermaid Barbie. Jinah helps Yebin wash with a soft washcloth as Yebin squirms.\n “You have to be clean to get into the pools,” Jinah tells her daughter. Yebin is always so excited to get to play in the baths before any customers arrive.\n “I’m clean,” Yebin protests. Jinah finishes soaping her up and tells her to go rinse before getting in the pool, and yes, Barbie needs to rinse too. Yebin stands under a showerhead, and Jinah wipes down the massage tables and scrubs the stone basins before the bathhouse opens. Maybe a better mother would keep a closer eye on Yebin, or would have the money for a babysitter. Jinah taught Yebin to doggy paddle at the nearby public pool and has always impressed the importance of not running on wet tile.\n She watches out of the corner of her eye as Yebin picks up her Barbie and slides into the cold pool, kicking around in the water. Yebin looks happy. Even from across the hall, Jinah can see the faintest shimmer of scales on Yebin’s skin as she splashes. She looks like a little fish.\n Jinah used to want a lot of things from life. She wanted to go to a good college. Then she wanted a happy marriage. Now she wants to have enough left over after rent-bills-food every month. She wants a better job. She wants Yebin to have the opportunities that Jinah tossed aside because she didn’t know what she wanted.\n She wonders what her customers want when they get on the massage table. They don’t know what Jinah is doing. Removing the scales isn’t magic. It’s just the byproduct of physical labor. Returning their capability for change doesn’t necessarily mean that the women will change, or that they want to change. Jinah figures on average, she’s doing a net-neutral in the world. She doesn’t know enough about the women she scrapes down to say whether she is doing good. Jinah sometimes speculates based on the conceptual idea of the woman who regularly gets a massage, the woman who wants a massage that hurts, that leaves the skin feeling flayed. That seems like a woman who wants to change, who wants to believe in the inherent superiority of renewal.\n Halfway through her sixth year working at the bathhouse, Yuna asks Jinah to stay late. Jinah’s heart sinks. Yes, she’s worked here six years, but the economy is terrible, and this must be the moment that her luck runs out. Yuna must be firing her. Jinah has half a college degree and a schedule bounded by her daughter. Finding a new job is going to be a nightmare.\n Jinah walks into the manager’s office with clenched hands so that they won’t tremble. Yuna smiles at her. Over the years, Yuna’s scales have darkened to a near-opaque emerald, like a very strange and colorful jacket.\n “You should stop picking off your scales,” Yuna says. “You look all patchy.”\n “No one can see them.”\n “I can see them,” Yuna says, and then shakes her head. “Look. Jinah. Are you happy here?”\n “Yes,” Jinah says quickly. There’s no other answer you can give when your boss asks you that question.\n “Then stop picking off your scales,” Yuna says. “I have a proposition for you.”\n Relief washes over Jinah’s psyche. “You’re not firing me?”\n Yuna laughs. “What? Why would you think that? You’re our hardest worker. I’m asking you if you want a promotion. I’ve run this business ever since my husband died—that’s something we have in common, did you know that?”\n Jinah nods. It’s why Yuna has been so sympathetic to her position.\n “And if I stay here longer, soon it’ll be impossible for me to leave. Look at the color of these things.” Yuna gestures down her arm at the shiny green coating. “So here’s what I propose. You scrape these off of me. I hand over the bathhouse to you.”\n “I—” Jinah begins, clamping down the rest of the sentence, which ends with don’t want to work here forever. Yuna smiles as if she can hear Jinah’s unspoken thoughts.\n “Just think about it, Jinah,” Yuna says. “It’s a great opportunity. There are worse lives.”\n Then why don’t you live this one, Jinah thinks but doesn’t say, and tells Yuna Thank you, and I’ll think about the offer seriously before leaving to pick up her daughter from school.\n Too agitated to cook, Jinah takes her daughter out for dinner at Lotteria. Yuna’s proposition rolls around in her head like a stone. Yebin doesn’t notice her distraction, preoccupied by dipping chicken nuggets in ketchup.\n “What are you going to be when you grow up?” Jinah asks her daughter.\n “An Olympic swimmer,” Yebin says. “Or an astronaut. Or I’m going to sell snacks at the bathhouse and eat them all day.”\n “Where did you learn about the Olympics?” Jinah asks, surprised out of her self-rumination. Yebin is six and a half.\n “From school,” Yebin says. “When we were learning about world cultures.”\n Jinah has no idea what world cultures means for first graders. Yebin puts three french fries in her mouth. Jinah wipes a smear of ketchup from Yebin’s cheek. Yebin’s skin is still baby-soft. When Jinah concentrates, she can feel the seams of the scales overlaying it, but it’s still just the barest whisper of a concrete future.\n She doesn’t know why Yebin already has scales. Jinah doesn’t know if this is somehow her fault. Maybe Jinah is not providing for Yebin in a way where Yebin feels able to change. Sometimes Jinah wants to scrub her daughter raw.\n “I can’t take the job,” Jinah says the next morning, walking into Yuna’s office. “I really appreciate the opportunity, but I can’t take over running the bathhouse. You’ll have to ask someone else.”\n Yuna puts her paper cup of coffee down. “That’s not the answer I was expecting. Why ever not?”\n “I just . . . it’s too much responsibility.”\n “You’re the most responsible employee I have. Next.”\n “I can’t be around all the time, I have to take care of Yebin.”\n “Keep bringing Yebin to work with you—it’ll be your business. What else?”\n “I don’t even have a college degree. How am I supposed to manage this place?”\n “You’ve done every single role here. Now you’re just making excuses—what’s the real problem?”\n “I don’t want to work here forever, Yuna!”\n Yuna laughs. “Is that all? So run it for a couple of years and build some savings, train someone else to take over, sell it to someone new. For god’s sake, Jinah, it’s not a death sentence—it’s a business opportunity!”\n “I know,” Jinah says. “But I can’t. I just can’t.”\n “Oh, just like I can’t leave until you scrape these off me?” Yuna says, gesturing to her scales.\n Jinah looks down at herself. The scales on her own arms gleam in the light.\n “I get it, okay?” Yuna says, voice softening slightly. “I can’t picture leaving. But I can imagine picturing leaving, and I like the idea of it. Think about it. My offer’s still open until I go opaque. I don’t want to leave this place without an owner.”\n Injung visits the bathhouse that afternoon. It’s only two. Jinah’s arms are tired. The rush of the faux waterfall crashing into the cold pool, the bubble of the water jets in the hot bathtubs, all of this is exacerbating her tension headache. Injung lies down on the table with a big sigh.\n “Long week?” Jinah asks, looking over the cascade of scales creeping down Injung’s shoulder blades.\n “The longest!” Injung says and shifts her head to look at Jinah. “You don’t look so good either. Maybe you should be the one lying here.”\n “Sure, let’s trade places,” Jinah says. Injung laughs, which rattles her scales in a sinuous shiver. Jinah gets to work scrubbing.\n “I’m job hunting again,” Injung says. “Maybe I’ll go back to hairdressing. Or maybe I’ll finally get that office job. I’m sure it’ll work out this time, maybe.”\n “That makes one of us.”\n Injung twists around to stare at Jinah. “You alright?”\n “Yuna offered to give me the bathhouse.”\n Injung sits up, batting Jinah’s hands away. She gestures at the bathing hall. “You mean thisbathhouse? The whole thing?”\n “The whole thing,” Jinah says. “She told me she was tired of running it, and that she wanted to retire. That’s crazy, right? I can’t accept this.”\n “Why not? It’s a great opportunity.”\n “I never thought I’d work here forever!” Jinah says, her voice rising two octaves.\n “No, you wouldn’t be working, managing is totally different from working,” Injung says, authoritatively. “I’ve done both, I’d know. Don’t accept it if you don’t want to, but I think you should say yes.”\n “Lie back down,” Jinah says. Injung rolls her eyes and lies back down. Jinah scrubs at the scales on Injung’s left bicep furiously.\n She knows the arguments that Injung might articulate. If Jinah’s the owner, that’s respectability, responsibility, financial stability. She wouldn’t be a massage lady anymore. She could hire a new massage lady. She’d be the boss, and she’d have more money, more savings, more resources for Yebin.\n “It’s just that there feels like there’s a catch.”\n “Sometimes good things happen, Jinah. This could be a good thing.”\n “I already told her no,” Jinah admits. “Not that Yuna accepted it.”\n “See? Yuna knows that you should say yes, too. You should leave right now and go tell her, ‘Sorry Yuna, I don’t know what I was thinking earlier, I’d love to own this entire bathhouse.’”\n “I’ll talk to her after work, okay, Injung?” Jinah says, just to make Injung subside. The optimism that Injung brings with her is sometimes exhausting. It reminds Jinah of herself when she was younger, or the young woman she’d be without Yebin and the dead husband.\n Jinah finishes the day. She doesn’t talk to Yuna about the offer. She picks Yebin up from school, and they walk to the park together while Yebin chatters about her day. Yebin is the center of her own universe, and Jinah probably shouldn’t encourage that, but it’s so much nicer to hear about what Yebin did at recess than it is to tell Yebin anything important. Jinah’s dreading the day Yebin starts asking about her dad.\n Yebin makes a beeline for the playground, and Jinah settles on a bench to wait. When Yebin glances over, Jinah smiles and waves. Yebin beams back, waves energetically before returning to chasing another little girl around.\n There are other kids and parents here. Jinah watches them idly. The parents almost all have scales winding up their arms in varying stages of color and translucence. Some of them are perfectly opaque, but their bearers don’t act any differently than those who don’t have any scales. The parents push their kids on the swings. Hand out juice boxes. Mostly everyone at the park seems happy.\n Jinah always wonders what happens to her clients. The scales always grow back. But some of them, Jinah never sees again, and she wonders if their absence is because of her ministrations. She doesn’t know if the future she scraped from their skin was one they wanted.\n Yebin comes running over, throwing herself into Jinah’s lap. Jinah ruffles her hair. Yebin needs a haircut, it’s starting to tangle. “All done playing?”\n “All done!” Yebin says, into Jinah’s shirt, before peeking up. “I’m hungry.”\n Jinah gently moves Yebin and opens her backpack to pull out the packaged gimbap, which she opens before giving to her daughter.\n “Thank you,” Yebin says, and stuffs a gimbap in her mouth.\n “Chew slowly,” Jinah says, taking a water bottle out. “Don’t choke.”\n “You’d miss me forever if I choked,” Yebin says, muffled because she’s talking with her mouth full. “You’d be so sad.”\n “I’d be so sad,” Jinah agrees. “Don’t talk with your mouth full. I love you.”\n “I love you too,” Yebin says, still with her mouth full. She eats two more gimbap in quick succession.\n Jinah pours water on a washcloth. “Here, let’s clean your hands off.”\n Yebin holds out her hands. Jinah wrings the wet towel and slides it over Yebin’s palms. The scales shimmer in the light. Jinah presses harder. She turns Yebin’s hands over, and scrubs, scraping the near-transparent scales from Yebin’s skin.\n “Ow, ow,” Yebin says, trying to pull her hands away.\n “Almost done,” Jinah says, holding Yebin tight and cleaning up Yebin’s forearm.\n “Ow, mom,” Yebin complains again. The scales fall to the ground, little glittering fragments that dissolve in the damp grass. Her forearms and hands are raw and pink. Jinah releases her daughter.\n “Yebin, what do you want to be when you grow up?” she asks.\n Yebin hums thoughtfully, tunelessly, used to the whims of adults and their non sequiturs. “I don’t know! I want to be a swimmer, but last week we learned about snorkeling. Can we go snorkeling?”\n “Maybe when you’re older,” Jinah says, feeling absurdly relieved. “Go play, Yebin.”\n Jinah thinks while she’s hanging the laundry, while she’s doing the dishes, while she’s getting ready for bed and washing her face. The scales climb up her cheek, little flakes of indigo that obscure the skin underneath. Jinah catches sight of herself in the mirror and winces. She scrubs her hand across her jawline and the scales cascade into the sink. She examines her face afterward. The skin is an angry red, breaking the symmetry of her face. It’s tender to the touch.\n In a way, the scales are like armor. A promise that the woman who exists in this space can do so for the rest of her life, that she doesn’t need to worry about the tender uncertainty of what-ifs anymore.\n It’s the what-ifs that keep Jinah up at night. What if she scrapes the scales from her skin and agrees to take over the bathhouse, runs it forever, and uses the extra money to buy Yebin swimming lessons, nicer clothes, after-school tutoring? Or what if Jinah scrapes the scales from her skin and doesn’t take over the bathhouse? What if instead, she abandons her daughter, abandons the bathhouse, buys a midnight bus ticket to Busan, crushes her phone under the heel of her shoe, and changes her name and never comes back? The dream of leaving is bitter and addictive, like her coffee every morning, a ritual built into her life with routine. She wonders how much of this is innate, and how much of this is a calcification.\n She steps into her rarely used shower stall with washcloth in hand. The spray of the showerhead hurts against her abraded cheek. The heat feels good against the knots in her back.\n Jinah can’t imagine a beautiful future, standing in her shower stall. Yuna can’t imagine leaving the bathhouse but still imagines the possibility of imagining leaving. Injung imagines that every new future will be brighter than before, rides each choice with certainty so strong that it needs to be scraped off. Jinah wants that sort of optimism. Jinah wants to love her daughter wholeheartedly. She wants the love to be innate. She wants to believe in brighter futures. She can’t imagine ever changing.\n She presses the washcloth against her forearm and scrapes. The scales slough off and melt into running water. It doesn’t feel any different to have the scales removed from one arm. She thinks about Yebin cautiously, like prodding at a sore tooth. She thinks she still loves her daughter. She thinks she still wants Yebin to have swimming lessons because Yebin would enjoy them. Jinah’s arm hurts. She puts the rough washcloth to her skin again and repeats the process on all her limbs, her torso, up her cheeks. It leaves the skin red underneath. When she’s done, she’s left breathing heavily in her shower, the hot water stinging against her abraded skin.\n She towels off. She dries her hair. She puts on her pajamas. She reads Yebin a story before bedtime. Then she makes two calls and puts her phone on the nightstand before she goes to sleep. She doesn’t dream.\n Jinah walks into the empty bathhouse to find the two women she had contacted sitting in the massage area, their respective scales glinting like jewels under the light. Injung is gesturing, and Yuna is laughing, and Jinah smiles a little to see it because it means that she read their personalities correctly.\n “Good morning,” she says, and the women look over at her. Injung beckons her over.\n “What’s this big secret you wanted to talk to me about? Is this about your new job? Oops—am I not supposed to know about that?”\n “You’re looking very fresh,” Yuna says, giving Jinah a long glance over her body, eyes lingering on the long swathes of clean skin.\n “I feel very fresh,” Jinah says. “Now that you’ve met, I have a counterproposal, Yuna. You should give the bathhouse to Injung.”\n Yuna stares at her. Stares at Injung. Looks back at Jinah. “Are you insane? Did you scrub away all your good sense, too?”\n Jinah shakes her head. “No. Let me finish. Give the bathhouse to Injung but let me manage it first. I’ll teach Injung how the business runs. She already has customer service experience, retail experience, managerial experience, and she’s a regular client here, so she already knows the feel of the place. I’ll show her the ropes, and she’ll be a wonderful manager, in a year.”\n “But what do you get out of this?” Injung says, as if her acceptance is already a foregone conclusion.\n Jinah takes a deep breath. “In return for my support, I’d like you and the bathhouse to support me while I finish my degree.”\n “Of course,” Injung says.\n “I haven’t agreed to this yet,” Yuna says, but she doesn’t sound angry.\n “If you’ll permit me,” Jinah says, and bows shallowly, the barest dip of her head. “Before you make a decision, I’d like to give you that massage you asked for.”\n Isabel J. Kim is a Korean-American science fiction and fantasy writer based in New York City. When she’s not writing, she’s practicing law, and when she’s not doing that, she’s co-hosting Wow If True, a podcast about internet culture. Her work has been published in Clarkesworld, Lightspeed, and Beneath Ceaseless Skies."}