{"fingerprint": "otKK87qIvfDKaJGHtEGW12wA0wQ=", "sitename": "Clarkesworld Magazine", "title": "Homecoming is Just Another Word for the Sublimation of the Self by Isabel J. Kim", "author": "Isabel J Kim", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kim_03_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Homecoming is Just Another Word for the Sublimation of the Self by Isabel J. Kim", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6240 words, short story\n Homecoming is Just Another Word for the Sublimation of the Self\n You are waiting for your instance in the basement of the Shinsegae Department Store. This was as good as an amusement park when you were a kid; it was a wonderland of delicious food stalls and a typical weekend haunt because your grandfather lived two blocks away.\n Your grandfather is dead. Your instance gave you the news: a phone call in the dead of night that woke you from a dead sleep.\n “Hello?” you said, accented with slumber.\n “Is this Soyoung Kang?” your own voice said, accented with Korean.\n “Yes,” you said. The only people who still call you Soyoung are family. Everyone else calls you Rose.\n “Harabeoji’s dead,” your instance said. You dropped the phone in shock.\n You hadn’t heard from Harabeoji in a decade and a half. For a while there were phone calls on your birthday, his voice tinny from the other side of the world. He would say happy birthday, and you would say thank you, and he would ask how’s school, and you would say it’s okay. Then you would ask how is Soyoung in Korea? because you remembered the little girl on the other side of the immigration checkpoint, wearing your clothes and your face and your memories.\n Your instance.\n Your-her grandfather would say she’s fine! She and her mother came to visit me yesterday. Her mother. Your other mother. The instance of your own mother standing next to you and pretending not to listen to your conversation.\n Okay, you would say. Harabeoji never told you anything interesting about the other Soyoung. You eventually stopped asking, because you had homework, field hockey practice, college applications—you were happy living your American adolescence.\n This is what you remembered, when your instance told you that harabeoji was dead. His silence about her. As if her existence was anathema to yours.\n You picked your phone back up again and listened to your instance. She spoke to you in complete banmal, no formal suffixes for her other self. Grandfather’s dead. He wanted to see you before he died, but he died before we could email you about it. Yes, we saw it coming.\n You don’t have to come to the funeral, but he said he wanted you here.\n She said nothing about what she wanted, or why she was the one calling instead of an aunt or a cousin. She said nothing about how she felt about Harabeoji’s death, but you could guess her emotions based on the first ten years of being the same person. Maybe her sadness was like a foreign shore, which was how your sadness felt. You couldn’t imagine how she felt about talking to you.\n “Okay,” you told your instance, in the dark warmth of your bedroom. “I’ll be there when I can.”\n You arranged plane tickets. You arranged time off from work. You arranged a cat-sitter for Doctor Crouton. And now you are in Seoul, in a basement ripped from your memories, waiting for your instance to find you.\n An instance is a duplicate self-cleaved mitosis-like from the original—though the duplicate and the original are both referred to as “instances” in modern vocabularies. To become an instance is to instantiate; in the present tense, instancing.\n The oldest clear reference to instances is a line in Hammurabi’s Code translated as the foreign brother-self will receive no inheritance.\n Different cultures refer to instances with a technicolor diversity: the sibling-self, the changeling, the one-who-does-not-return. The first requirement for instancing is a settled culture, though traditionally instances appear specifically in seafaring cultures. Through most of history, the ocean formed a natural division between the familiar and the foreign.\n The second requirement is intent. Sailors throughout history are recorded as sailing from their home ports without instancing for decades, until one morning they boarded their ship and looked back to see their instance standing at the docks. Something must have shifted in their heart, some secret admittance that their leave-taking is permanent, that their families have become foreign to them.\n There is a folktale that is repeated in Japan, Korea, and coastal China, of a fisherman who is coaxed into following a water spirit into an undersea court, where he drinks and dances with the beautiful merfolk. But the night grows long, so the fisherman asks the water spirit to take him back to his home. The spirit warns him that time flows differently underwater, but the fisherman repeats that he wants to go home.\n The spirit nods and sadly takes the fisherman back to the shore. When the fisherman’s feet touch dry land, he ages thirty years instantly. When he walks into his house, he finds himself already inside, asleep with his wife.\n A border is an artificial thing with practical consequences: the severing of the self from the self.\n Your catch sight of your instance weaving through the crowds like a ship cutting water. You stare at her as she approaches. Here is your sister-self, your shadow-could-have-been, the woman you are in another country. Here she is, looking you over with your eyes in her face, and the lines in her face are not the lines in your face, but you could have been her: twenty years winds back to when one of you stepped onto the plane and the other stayed.\n She stops a careful three feet away. “Did you get here okay?” she asks in Korean.\n “Pretty well,” you respond in kind. “Thanks for picking me up.”\n “Of course,” she says. “We’re family, after all.”\n “Are we?” you ask, and she laughs, and you laugh. It feels something like release.\n “Let me get you a coffee or something,” you say. “What do you want?”\n “You don’t have to,” she says.\n “No, I’m putting you to enough trouble,” you say. She smiles a bit at that, the same way you smile when something is funny but not happy. You can read her thoughts in that instant: it’ll make her feel better to buy me a coffee, I want a coffee and she wants to buy me a coffee, let’s skip the posturing, I know that she knows that I know.\n “Vanilla latte, with an extra pump of sugar,” she says. You nod to hide your surprise. You’ve always taken your coffee black.\n The distance between you and your instance is manufactured, not inherent. You know this. Your instance knows this. You both share in the creation of the space between the two of you, between yourself and your mother, between yourself and her-your Korean aunts and uncles, between her and her mother, between your mother and her mother. The only thing not your fault is the relationship between your mother and your-her grandfather.\n Your instance and her mother get Korea, her-your aunts and uncles, your-her grandfather. They get the physical presence. They get Chuseok. They get your-her grandmother’s grave. They get stationary stores and E-mart and working public transit, they get the ajumma selling ginkgo nuts and roasted chestnuts at the foot of the hiking trails.\n You and your mother get America.\n You could call this fair trade. You could call this the inherent outcome of your mother’s feud with your-her grandfather, a tender wound not your own, which you never completely probed. You could have researched your instance—you know her name, her birthday, her school history until you left the country. You could have contacted her through your aunts. But you didn’t.\n It’s not like you have anything against instances in the abstract. Your best friend from college split into instances nearly a decade ago after transferring to the German branch of her company. She hadn’t expected to instantiate, but Caroline’s heart apparently thought her future lay across the Atlantic.\n You love both Carolines. The last time the two of you spoke, German Caroline told you she was planning on returning to America.\n “It’s been fun,” she said to you. “But I’m ready to come home. I think I want to dis-instantiate. Don’t tell Caroline, yet.”\n “She doesn’t know?” you said, cradling the phone between your shoulder and ear as you rinsed dishes in your sink.\n “No,” German Caroline said. “I haven’t told her, it’s not like we’re psychic.”\n “That’s kind of a big thing,” you said. “Dis-instancing. I didn’t think people really did that.”\n “It’s not a big thing in the States,” she agreed. “That’s why I want to talk to her first.”\n “Sure,” you said. “It’ll be nice to see you again.”\n “What are you talking about?” Caroline said. “You see me all the time. You guys get brunch like, every Sunday.”\n Here is the second half of the sailor’s folktale:\n The sailor returns home and finds his instance asleep in bed with his wife. He looks down at their bodies, the slow rise and fall of his instance’s chest. The way his instance’s arm curls sweetly around his wife’s waist. He forgets the endless beautiful night he spent in the underwater court, he remembers only that thirty years of his life have been erased.\n A great and terrible anger rises in him. How dare his other self be content. How dare his other self have three decades with his wife.\n He picks up his instance’s knife from where it hangs on the wall. He kneels above his other self.\n He plunges the knife into his other self’s breast.\n His instance wakes in a great gasp. He claws at the air. He screams. His wife, waking, beats at the sailor’s chest. Husband! she shouts. The sailor’s instance grasps at his jacket, at his sleeves. The sailor holds the knife down.\n His instance tears the wet fabric. He manages to grab the sailor’s bare wrist.\n And then there is a single man lying there, bleeding from his breast wound, his own hand holding the knife in place. The sailor and his instance having merged, falling into a single self like a collapsing waveform.\n In some versions of the story, the sailor survives his self-inflicted wounds. In others he does not.\n The message remains the same in either version of the story: Intention does not matter in homecoming. There is no requirement of desire to return for de-instancing. What matters is the physical action, the touch of skin against skin.\n Your instance weaves the two of you over to the parking garage where her small silver car is parked. She opens the trunk for you, but doesn’t help with your suitcase, which you struggle to lift.\n “Sorry,” she says. “I just don’t want to risk—”\n “Yeah, I get it,” you tell her, and grunt as you push the suitcase in. You don’t want to touch her either. You get in the car. She turns on the engine. “Where are we going?” you ask, pretending not to glance around the car. It reminds you of your mother’s old car, not so much in appearance but in the smell of it. There’s a car seat in the back. You didn’t know your instance had a kid.\n Your instance sighs. “The plan is for you to stay with me tonight, unless you want to stay with keunimo, but I think she’s busy with arranging everything. You missed the funeral home bits. But he’s being buried tomorrow. So, we’re just going home tonight, unless there’s anything you want to do. Do you want to get dinner?”\n You don’t know if there’s anything you want to do. You want to go to the kalguksu place near your old apartment, the restaurant where they would bring out huge pots of simmering clam broth and noodles. You want to go to a 7-11 and get an ice cream bar and a banana milk. You want to go back inside the Shinsegae basement and buy yourself jun, mandu, twigim, and eat all of it at the food court in a feat of decadence your mother never would have allowed.\n You wish you were home in your apartment in Fort Lee, heating up a single serving of rice and leftovers, your cat purring by your side. You wish your grandfather wasn’t dead, that you were not here in this country.\n “I’m hungry,” you say. “Let’s get dinner.”\n The English word nostalgia derives from the Ancient Greek nostos, which refers to a genre of epic literature involving safe homecoming by sea. Nostos can be contrasted against kleos, the glory earned through great deeds. The two are not necessarily mutually exclusive—Odysseus’ nostos is his kleos. His return to his wife, meeting his son, and the acceptance of his instance are simultaneously his triumph against Poseidon, his wife’s suitors, and his own self-doubt.\n In the narrative, Odysseus dislikes the man his instance became after he left for Troy—weak willed and unable to stand up to his wife’s suitors. Only by leaving, by fighting for ten years at Troy and spending another decade attempting to return to Ithaca, does Odysseus become a man he recognizes as himself. Yet it is the embrace of his own faults that allows him to finally return home, completely and wholly.\n Odysseus’ story is an outlier—no other epic focuses so heavily on the relationship between instances, or creates the sort of conflict that Odysseus has between himselves. And in reality, instances don’t tend toward conflict—they know too much about each other, and it’s too easy for them to anticipate each other’s actions. What they want is often too similar to be separated.\n Your instance takes you to a local barbecue place, where you meet up with your cousin who you haven’t talked to in two decades, your instance’s husband, and your instance’s daughter. She’s an adorable four year old who stares at you surreptitiously.\n “Are we drinking?” your cousin—Jungwon—asks. He’s sitting next to you, and had given you a big hug when he walked into the restaurant. He used to be your favorite cousin. He’d grown up in the time you were gone.\n “Please, yes,” you say, and Jungwon orders a few green bottles of soju for the table.\n “Really?” your instance’s husband—Taehyung, but call me Tae, haha, yeah, like the band member—says, with amusement in his voice. You’ve been trying not to think about how he’s handsome. How he has nice hands.\n “It’s what Harabeoji would have wanted,” Jungwon says. “Just a few toasts. We gotta honor his memory.”\n “You’re just saying that, you drunk,” your instance says with a smile on her face that mirrors your own.\n Jungwon gasps in mock offense.\n “What’s a drunk?” the daughter says, and everyone laughs. “It’s not funny!”\n “Just grown-up teasing,” your instance says, giving her kid a kiss on the cheek that the kid squirms away from halfheartedly. You can’t stop staring at the way the kid fits in your instance’s lap like she belongs there.\n “Why’d Harabeoji want me to come, do you know?” you say, tamping down the discomfort bubbling in your chest. “We haven’t talked in years.”\n “He talked about you a lot,” Jungwon says. “Before he died. You and your mom.”\n “Family was important to him,” Tae says. “I learned that when I wanted to marry Soyoung. He was a big ‘duty and loyalty’ sort of guy.”\n “War generation,” Jungwon says sagely. “I think not knowing about what happened in the north kind of haunted him.”\n “I think he always hoped you’d come back,” your instance says. Your eyes snap up. You want her to explain, but she’s looking away now, busy moving the kid to her own seat.\n “What’s living in the States like?” Tae asks.\n “Well, everyone speaks English,” you say, and everyone laughs. Then the food begins to arrive, and it’s a scramble to clear the table so that the plates of banchan, meat, lettuce, rice in metal bowls, and kimchi can all fit around the grill. Conversation turns to cooking meat, pouring drinks.\n “To the old man,” Jungwon says, and you all clink shot glasses. This at least is easy. Like slotting into a life you had forgotten living.\n What’s living in the States like?\n America is Costco and Starbucks and freeways; America is H Mart and boba and FOBs and bananas and first gen, second gen, third gen. America means KSA and APSA in college, and it means clicking the box that says “Asian/Pacific-Islander” on the job applications and the census, America means being asked so, where are you from? and nobody meaning New Jersey.\n America means not knowing which of your friends are instances.\n In 1776, the Constitution granted full rights to white, male, landowning instances—unheard of in Europe at the time—and not much to anyone else, until amendment after amendment chipped away at the assumptions underlying it. There’s still a lot to carve away.\n Instancing exploded globally from the eighteenth century onward. Colonization duplicated people across the globe. Immigration through Ellis and Angel Islands created vast swathes of instanced communities across the coasts. This is the legacy of the west: a mitosis-like duplication of the self across lands already peopled.\n Instancing is written into America’s blood, into the story it tells itself: Here is where instances immigrate. Give us your tired, your poor, your hungry, give us your copies and let them be fruitful and multiply, let them homestead, let them become titans of industry, let them and their non-instanced children build cities and towns and railroads.\n America assumes instances will stay forever.\n Here is a free state for those who want to leave, America says, ignoring the fact that the land was already peopled, that the borders were brought to them unwillingly. Ignoring those brought in force in chains. Ignoring the deportations at the border. Ignoring the fact that intention to leave actually just means acceptance of situations beyond your control.\n Living in the States means that you’re blank-American. Korean-American. Mexican-American. African-American. Indian-American. Native American. America assumes instances leave their original country permanently and defines them by the self left behind.\n Halfway through dinner, Jungwon and you take a smoke break outside. Cold air, warm nicotine. It’s nice. It’s strange to watch Jungwon and your instance together, the familiarity between them, more like sister and brother than cousins. Good strange.\n “So, what’s she like? Soyoung, I mean,” you ask Jungwon. You remember him being honest. “She seemed pretty high-strung during dinner.”\n Jungwon waves a hand in the air, trailing smoke. “Eh. She’s having a rough time of it. You’re not seeing her at her best,” he says. “You know how it is, Harabeoji’s last words to her was about wanting her to dis-instance, you know, all of that. That was pretty shitty of the old man.”\n You stop, cigarette halfway to your lips. “What?”\n Jungwon stops. “She didn’t tell you?”\n “No, she didn’t tell me! All she told me was that Harabeoji wanted me to come to the funeral. Jesus Christ, did he really ask her that? Dying wish, ask her to dis-instantiate?”\n You are abruptly reevaluating how much you knew about your-her grandfather. You know Harabeoji was born before the Korean War. You know your family is from the north. You know your grandmother died when you were very young. You know Harabeoji liked to watch baseball and that he kept sweet jelly cup snacks in his cupboard for you and your cousins.\n “Yep,” Jungwon says, looking uncomfortable. “Look, you should talk to her about it, not me. I probably shouldn’t have told you about it if she didn’t tell you?”\n “No, you should have told me sooner! That’s so fucked up. Who asks that sort of thing?”\n “Well, Harabeoji did.”\n You know your grandfather was bitterly opposed to your mother moving to America. You know him and your mother had a blowup fight two nights before you moved, screaming at each other while one of your older cousins hustled you and Jungwon out of the apartment. You know your grandfather drove you and your mother to the airport anyway, but didn’t speak except to tell you to be good for your mom, Soyoung-ah.\n You’re pretty sure him and your mother-in-America never spoke again.\n The Korean Armistice Agreement was signed in 1953, creating the demilitarized zone that splits the peninsula into north and south. The Republic of Korea has the tenth largest nominal GDP in the world, globally consumed entertainment exports, and a remarkably high percentage of plastic surgery among its populace. The Democratic People’s Republic of Korea has nuclear weapons, a fascist dictatorship built around a cult of personality, and a thriving black market for international media. The two countries never formally ended the war. Both countries post soldiers on their side of the DMZ, blank-faced men with mirrored sunglasses.\n Crossing a border creates an instance. Creating a border manifests the capability for instances.\n For a short time during the Korean War, it was possible to cross the DMZ with the right papers. The DMZ wasn’t quite a border yet, not coalesced in the hearts and minds of the people as a border. So much had happened to Korea in the past decades. Japanese occupation, name changes, comfort women, the phasing out of the Korean language. The theft of thousands of cultural artifacts. Global war, local war, foreign powers playing toy soldiers with foreigners, ideologies grappling in Korea before they moved to Vietnam.\n Soyoung’s grandfather crossed a border-becoming-a-border. He didn’t look back at who he might be leaving behind.\n The next morning, your instance drives you to the gravesite. It’s rush hour in Seoul, and you both sit uncomfortably in your black clothing. Your instance’s husband and daughter will be coming later in the day, but you almost wish they were here now. You try not to watch your instance, but her visage reflects off the passenger window.\n Seoul crawls past in fits and bursts. Storefronts selling fish cake and twigim and ddukbokki, 7-11s with cardboard K-Pop stars advertising soft drinks and soju.\n You have never more desperately wanted to initiate a conversation. A dialogue. An interrogation. You want to ask about Harabeoji’s last request to her, how she feels about it, what she wants to do. You want to ask her your questions without fear of the answers, except you know that the moment you ask is the moment she will refuse to speak. Because you would refuse to speak. It would scare you, to talk. It scares you now.\n You know that she knows that you are scared. So, you can’t ask.\n You watch the scenery instead. High-rise apartment buildings, signs for after-school tutoring facilities, bus stops and subway stations. Dozens of coffee shops. You don’t remember this route. You hadn’t expected Seoul to change so much—the Seoul in your memories was static, a snow globe of 1998. You feel like a foreigner. Like an American.\n Your family has lived in Seoul for two and a half generations. Your grandfather relocated here after the war, and your mother and her sisters were born here, and you were born here, and you could have lived your whole life in this city. Your grandfather died here.\n “It was old age, right?” you ask. “Not a heart attack or cancer or anything.”\n “He was eighty-seven,” your instance says. “Isn’t everything old age at that point?”\n “Sure,” you say. It always surprises you when your instance says things you wouldn’t. It surprises you more when she says things you would.\n “We kind of saw it coming,” she says, looking straight at the road. “I mean. Eighty-seven, right?”\n “Right,” you say, daring a glance at her. She looks perfectly calm. “Were you close? I remember I used to spend a lot of time at his apartment as a kid.”\n She shrugs. “I don’t know. He’s just . . . Harabeoji, right? Mom would park me at his place on weekends. Sometimes he’d call you when I was over. It was like seeing me reminded him that you existed.”\n “I didn’t know that,” you say. “He never said anything about you, no matter how much I asked.”\n “Well, here’s how you should picture it,” she says, rolling to a stop at a red light. “He’s on the phone, sitting on the sofa, half-watching me and half-watching the baseball game. And I’m sitting at the kitchen table doing some homework I didn’t finish at hagwon. And he’s talking to you, and you’re talking to him, and I’m doing my best to be really quiet with my pencil so I can hear what you’re saying.”\n You can picture the apartment with the clarity of a reconstructed childhood memory. The smooth glass tabletop. The creased leather couch. The way it smelled a little like smoke, even though harabeoji only ever smoked outside. You can imagine Harabeoji holding the old landline against his ear. You can imagine yourself sitting at the kitchen table doing homework. Listening.\n “I don’t know what to do with that,” you say, after a long pause.\n “Well. I didn’t either,” your instance says, and it feels like you’re circling back around the conversation again, taking a derivative and never quite managing to meet the x-axis.\n In many ways, it is easy for the man in the folktale. He never had to talk to his other self. And besides, what is three days compared to thirty years? One beautiful, strange night in a foreign country subsumed under thirty years of eating dinner with his wife, raising his children, taking his boat across the glittering shore and casting his nets. Time polishes the memory of the undersea court to a pearl, something carefully tucked away under the rough cloth of his weekday worries.\n Or he dies, bleeding out through the self-inflicted wound.\n A traditional Korean funeral is held over three days, ending with the burial. Traditional Korean graves are earthen mounds on mountainsides, with nearby stone markers on which Chinese characters are written.\n Most people are cremated now. Korea is a very small country, and it has only so many mountains. But your grandfather is traditional, and his burial plot has been purchased for decades—ever since your grandmother’s death.\n The gravesite is familiar. A hill on the outskirts of Seoul, a clearing in the middle of the forest underneath the blue sky. This is why you’re wearing black hiking boots instead of heels.\n Family and friends and strangers in black, dry eyes, wet eyes, your aunts and cousins exclaiming over you. You must be so tired from the travel! It’s so good to see you again! How’s your mother? You speak Korean and stumble over your syllables.\n The burial happens. The coffin. Shovels. Dirt and sod.\n Your grandfather’s grave is a large mound of earth, encased in a stone foundation with a shiny black granite marker. Your chest hurts to look at it, the sort of bone-deep dull sadness when a part of you that you thought was already dead dies. You didn’t realize what it would mean to miss your grandfather until this moment.\n Your instance walks over to you. You glance up as she approaches. She had been standing near her husband and daughter, while you stood near Jungwon and your other cousins, who had all exclaimed to see you.\n “It’s weird being here when it’s not Chuseok,” your instance says. Her eyes are red-rimmed.\n “Oh you think it’s weird to be here?” you respond, and she laughs and you laugh and the laughter feels like a thin soap bubble film stretched across your words.\n “Don’t laugh,” Jungwon says, without any heat. “The aunts will get mad.”\n “Sorry,” you say. “It’s just that, you know. This still doesn’t feel real.”\n Jungwon peers at you. “Are you okay?”\n Two days ago you were home in Fort Lee. Your biggest emotional hurdles were making sure you did the laundry before you ran out of socks, or deciding whether to get dim sum or American brunch with Caroline over the weekend. You hadn’t thought about your instance, your family in Korea, your grandfather, in months, and even when you thought of them it was in passing, as if they were a dream you only vacantly remembered, something tamped down and buried.\n A beat of silence that stretches too long. Your instance laughs. You do not laugh.\n “Shit, oppa, of course she’s not okay!” your instance says. “She just learned Harabeoji died two days ago, and now she had to fly all the way here for the fucking funeral, which she missed, what were you expecting?”\n “Uh—” Jungwon says. Your instance’s voice spiraled into a shout. Everyone’s staring.\n “Are you okay?” you cut in, staring at your instance. Her face has gone all blotchy under her makeup.\n “I’m—I’m going to get some air,” she says, and you almost reach for her when she turns on her heel, but Jungwon catches your hand instead.\n “Let’s give her a moment to cool off,” he says, but you chase after your other self anyway.\n A plethora of related terminology borrows the terminology of instancing. For instance, software development. When Soyoung “Rose” Kang, in her real-true-American-job, downloads a copy of her company’s repository from the cloud, that’s called instancing, the same way the three steps across the immigration gate was instancing. A perfect copy is duplicated in a new location.\n When Soyoung “Rose” Kang is done making her changes to the file, she will de-instance it, merging the file with the original on the server. The changes slot into the original, and the new copy becomes the official version on the server. The original copy without the changes is overwritten by the instance. Integration of the other into the self.\n You catch up to your other self. She’s come back to where the car is parked, and she’s leaned against the side, pretending not to wipe her eyes.\n She looks askance at you. “What do you want.” A statement. Her voice your voice. Her hurt unlike your hurt. You feel like a stranger all of a sudden, so far removed from the way she sounds, unable to understand the way she feels.\n “I don’t know,” you say. Plain banmal. “I was tired of talking around things. I’m sorry you’re having a tough time. I’m sorry that Harabeoji asked you to de-instance.”\n She smears a finger under her eye, blotting a tear. “Jungwon told you, I’m guessing?”\n “Yeah. Last night. He told me to talk to you about it. But I thought you would bring it up if you wanted to talk about it.”\n “When have we ever brought anything up?” she says. You laugh. She laughs. Neither of you are happy.\n “I could be someone direct,” you say. “America changes people.”\n “Does it?” she asks. “Have you changed that much?”\n Time, space, the American public school system. You don’t know if change is something that happens to you all at once, or if you could chart your life in millimeters and that maybe years ago you could have understood each other.\n “I didn’t know you had a kid,” you say. “I didn’t know you had a husband, or that you drank your coffee sweet. I didn’t know I could be that sort of person. I didn’t know that Harabeoji could be someone to ask so much of you. I don’t think you should do anything you don’t want to do. I don’t want to do anything you don’t want to do.”\n She looks at you. And now you finally recognize the expression in her face. Hunger.\n “I want to,” she says.\n The English word nostalgia is derived from Greek word algea, the plural personification of pain.\n Your surprise naked on your face. Her hunger tucked away again behind her blank mask.\n “I guess you didn’t expect that,” she says.\n “Why didn’t you dis-instantiate me, then?” you ask. She had the opportunities. When you bought her coffee. When you were in the car. When you sat near her in the restaurant. When you slept, defenseless, on her pullout futon. Dis-instancing is about physical contact, not about mutual desire.\n “You said it. I don’t want to do anything you don’t want to do,” she says, echoing your American accent, your inflected Korean. It sounds strange through her mouth. That must be how it sounds through your mouth. She smiles at you, a sarcastic twist of the lip. “Could I live with myself, if I did that?”\n Maybe you should be glad there is no instance of you that is cruel.\n Instances cannot read each other’s minds.\n “But I want to,” she says again. “I’ve always wanted to know what it was like, to live somewhere else. To be the one to leave. To be American. I wondered about you. When I had to take suneung. When I would fight with mom. When I was getting married. Did you ever wonder about me?”\n You did. You thought about your other self when you picked your college major. When you fought with your mother. When it was Chuseok and you were alone in your dorm room, eating dduk that your mother mailed you.\n “I did,” you say. You want to know how she loves her husband. How she loves her daughter. How she talks with her-your cousins and how she goes to work in her silver car and how she orders at restaurants in Korean and how she speaks in Korean and dreams in Korean and how she misses Harabeoji as more than a crumpled memory.\n “I guess it’s selfish, to want to know two lives,” she says. “But I can’t help what I want.”\n Soyoung’s grandfather always regretted not looking back across the border.\n “I know it’s a lot to ask,” your instance says. “And it was cruel of Harabeoji to ask me, and it would be cruel of me to force you. But I’m telling you that I’m happy here, and I love my husband, and I love my daughter, and I don’t know who you love, but you could love who I love. I could love who you love. If that changes your decision, at all.”\n Your heart thumping in your chest. Your dry mouth. Your instance standing a scant three feet away, smiling at you.\n “So, let me know what you want,” she says.\n The three keystrokes it takes to push a de-instancing request to the server.\n You want to take your other self’s hand and fold her into your existence. You want to hide in your apartment with the soft warm weight of your cat in your arms. You want to call Caroline in Germany and commiserate. You want to smoke outside barbecue restaurants with Jungwon. You want to go back to your grandfather’s grave and apologize for taking so long to visit.\n You want to pick up your instance’s daughter and have her be your own. You want to have grown up in Korea. You want to have grown up in America. You want there to be only one of you. You want your other self to be happy. You want to fulfill your grandfather’s last request. You want to be happy. You want to stop wanting. You want to go home.\n Filial piety never rested easy against American exceptionalism.\n “It’s not that easy,” you say. Your instance’s face crystallizing in her smile. You can’t look at this, because even if it’s not your feelings, you understand the way that disappointment feels in her heart.\n “You’ll remember, if we dis-instantiate. You’ll remember, and I’ll remember, but it’s not going to make you happier. It won’t make Harabeoji and Umma make up retroactively, and it won’t stop me from having left, and maybe it’s selfish, but I have a life. I have a job, and I have a cat, and I have friends, and they could be ours, but then they wouldn’t be mine. And it won’t make Harabeoji happy, because he’s dead, and what he wants can’t be more important than what I want, and I’m sorry about that but it’s true. And I wish there was a way for me to have everything—for you to have everything—but there isn’t. I can’t live my life and live yours at the same time.”\n You are suddenly achingly homesick. Home like your grandfather’s apartment, twenty years ago. Home like falling asleep in the back seat of your mom’s car. Home like waking up in your childhood bedroom. You won’t ever get any of that back, and losing that wasn’t your choice, but you can choose how to live with the loss of all the people you used to be.\n “If we dis-instantiate, America becomes a memory for you. For me. Just like Korea is a memory for me. You’ll remember, because I’ll remember, and you’ll regret, because I’ve regretted. I know you will. I know about regret. I miss Korea, sometimes. I’d miss America more,” you say.\n You don’t know how to explain the way you feel about the States to your instance, who has never had to leave home. How she-you will long for worlds that no longer exist, for countries that only exist in your memories, how you’ve had years to come to terms with the tension that sits in your belly when you think about the homes you’ve left behind, how you have changed enough to miss America, now, and you can bear the loss of one homeland but not two. How to explain she would become a foreigner. How to explain to her how you are Korean-American. How you are American.\n “I don’t want that for you,” you say instead. “Or for me.”\n Your other self’s smile melts into something less cracked. You smile back in relief.\n “If it’s only regret,” she says, and reaches for your hand and you—\n The knife in the heart, held by the fisherman’s hand.\n Isabel J. Kim is a Korean-American science fiction and fantasy writer based in New York City. When she’s not writing, she’s practicing law, and when she’s not doing that, she’s co-hosting Wow If True, a podcast about internet culture. Her work has been published in Clarkesworld, Lightspeed, and Beneath Ceaseless Skies."}