{"fingerprint": "Z6LvHEUN5Kj6D6VM+arYhEc+Ybc=", "sitename": "Clarkesworld Magazine", "title": "Ghost Island by E.E. King", "author": "E E King", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/king_11_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ghost Island by E.E. King", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3180 words, short story\n Ghost Island\n “I got my orders today,” said Sergeant Riku. His normally pale skin had faded until it was lighter than the inside of an unroasted almond.\n “They are sending me to Yūrei Island.”\n “Yūrei Island,” Hana’s skin also paled, “The ghost island, the place of hungry spirits.”\n “Do not say such things,” Riku replied. “Those are superstitions for the foolish.”\n “It’s no superstition that something happens to many of the soldiers who go there. The ones who return all whisper the same tales. They cannot all be wrong. They say that some men wake up with new memories, memories that can’t be true. They describe places that could only exist in the imagination. They remember lovers who aren’t real and forget the ones who are. They conceive of sons and daughters, somehow sprung from their loins instead of from the lab, and they believe it. They never recover. They never return.”\n “I don’t believe it,” said Riku, but his eyes looked worried and his almond-pale skin faded to the underground slickness of a grub.\n “I can call it radiation or chemicals if it makes you more comfortable, but what kind of chemical causes a man to recall an alternate life? What type of fallout gives the brain different recollections?”\n Riku is silent. He cannot answer rumors.\n “How long before you go?” asked Hana.\n “I go tonight,” he said.\n “Noooo,” she wailed. Tears poured from her eyes like a woman forgotten. “You will never come back to me.” She clung to him, knowing he could not refuse an order. Fearing she had already lost him. Fearing it was as final as death.\n “Shhh,” he stroked her hair. “I could never forget you, Hana. No more than I could forget to breathe. No more than I could forget myself. You are a part of me.”\n Yūrei Island had been built long ago, before the last war, before the one people. It had probably been constructed to lay claim to the minerals, natural gas, and oil, as well as the myriad forms of life proliferating in the sea in those ancient times. Now, the island was used as a center for processing the algae and purifying the water The City needed to survive. Of course Yūrei had been refurbished after the war, sealed with new metals and covered with a hard-acrylic shell to keep out the atmosphere. It had been easier to restore these outposts of concrete and steel than to deal with contaminated organic matter.\n Yūrei lay like a dab of mercury, shining and contained on the Jelly Sea. It seemed an unlikely place for spirits to wander. There were no crumbling archways, or deserted corridors, no secret nooks or hidden alcoves. Nothing about Yūrei was enchanted or otherworldly. Every room was sterile and metal-bright. Each space served its purpose and nothing more. Nonetheless, as soon as the first men returned home, strange stories began drifting about The City, like restless winds. Tales of men who remembered fantastic, unbelievable places. Places where the sun set in a clear, blue open sky. Places where sun shone warm, not burning. Places where no fires raged outside the shell of the world. Places without a ceiling over the land. Places where huge towers rose, towers not of metal but of odd substances called stone and rock. Places where biological families lived together. Places of beauty and of chaos.\n Some of the possessed remembered a nonexistent sweetheart so intensely that they could never again care for their lover or wife, so getting sent to Yūrei Island became a fate possibly worse, but definitely more uncertain, than death. Especially for those left behind.\n The words of soldiers who returned rippled through the city like a tide, beating back and forth against the thick, domed, semi-translucent acrylic cover that shielded The City from the fires beyond. The City had been built above the earth on a thick metal disk supported by solid pillars so that nothing touched the soil. Over thirty-five thousand people lived in The City, residing in sùshès, the residences that housed up to twenty men and women.\n Children were made in the lab as needed, and raised in the bǎobǎo sùshè, the baby dorms, learning whatever they needed to know to ensure The City’s survival. Everyone lived to serve The City. It was the only way to endure. Oh, there was still love, love and sex, no war, no matter how devastating, could put an end to that most basic instinct and desperate need, but there were no offspring. The fallout had made everyone sterile.\n Riku and twenty-five of his comrade soldiers departed at midnight. They marched through the acrylic tunnels that joined the airship launch to The City. Their feet tap-tap-tapping in unison, as if they were one man, making perfectly ordered echoes. It was calming somehow, this precision. It sounded like stability, like security, like continuance. Surely no ghosts or spirits could infiltrate such a perfect system.\n They journeyed over the Jelly Sea, to the island, that lay on the water glittering like a gigantic, flawless ball bearing. It took less than an hour, though it seemed a world away. The airship connected to the island’s protective cover, acrylic mouth suctioned to acrylic mouth with a vacuumed-sealed kiss. Riku and his troop were marched to their quarters.\n There were twelve in his dorm. Riku took a top bunk. He had never slept so far above the ground before. Though the cot was hard, and he could clearly feel taut springs coiling into his spine like an unforgiving lover, he enjoyed the feeling of drifting above the earth. Drifting into the kiss of a beautiful woman. She wore strange clothes. Her hair was long, loose, and not at all practical. She smelled of salt and other things, things Riku could not imagine. His mouth watered.\n “I am Emi,” she said. The freshness of her breath made Riku feel as if he’d never breathed before.\n “Now you know me,” she said.\n The alarm sounded. The light increased. They dressed in their Cladophora algae uniforms. Cladophora was rich in cellulose. Its branched filaments were composed of large cylindrical cells that grew over molded forms, cell fusing to cell to create pliable structures that retained their shape.\n They strapped on their boots of metal toes and jelly soles.\n They cleansed their mouths with the tiny jellies that sucked the debris from their teeth and the bacteria from their tongue in thirty seconds. It was important not to leave the jellies in longer, or they would start to draw deeper, ingesting skin and tissue, leaving gums bleeding and loosening teeth.\n Riku wondered who had discovered that jellies could clean teeth. Who had tested and tried, probably at the expense of teeth and tissue, how long the jellies should be been left in before sanitation turned to blood.\n It was a strange thought, a new thought. That life had not always been thus, that after the war people, individuals, had needed to experiment with each jelly and every alga, testing for toxicity and protein and strength. Riku could not imagine such courage and innovation. He had never tried to. He shook his head, trying to dislodge these odd and discomforting ideas.\n He joined the rows of men marching to The Hall of Meeting where they sang the song of work and belonging.\n “We will work together,\n Strain each muscle and every tether.\n For power of the whole,\n For the wellness of the all.\n We will work to feed The City.\n And each citizen’s committee.\n We are one.\n We are survivors.\n We will follow the advisors.\n We will persevere,\n From year to year,\n Until the end.”\n They sang loudly and without harmony, then left for their stations.\n Riku and Haruto, his lower bunkmate went to tend the great vats of Azolla algae that would feed the city. Azolla could be manipulated by light, temperature and additives to produce protein, or fat, or calcium or carbohydrates. It was a perfect food, wholly balanced, with no danger of inducing overindulgence. It was not pleasant to eat, but that was of no matter. Taste was a facet of olden times, the forgotten world, a time when pleasure was more important than survival.\n Riku swallowed. He shook his head. The dream scent, it lingered on his tongue. He blinked as he inhaled the tang of the fermenting Azolla. His nostrils flailed. His stomach twisted in revulsion. His eyes closed. The ground teetered. He swayed, feeling as though he’d lost his center of gravity.\n “You okay, man?” Haruto was holding his arm.\n Riku shook himself. “What happened?”\n “Everything alright here men?” Colonel Masuka snapped.\n “Fine, Sir!” They saluted.\n Colonel Masuka’s lower eyelids rose, though the rest of his face remained immobile. Riku tried not to watch him peering over his lids at them, squinted with cold, pin-sharp eyes as through a missing window slat.\n He glanced at Haruto. They each gripped their handles and began cracking the Azolla, rotating the shelves smoothly so that each cell would get an equal distribution of light.\n The Colonel walked away.\n “Are you alright?” Haruto asked. Riku nodded.\n “Then what are you doing? You could get us killed.” But there was more concern than anger in his low, even tone. Riku marveled at his generosity.\n For the first time Riku truly feared Hana’s ghosts, not her spirits of the dead, but unknown senses that were germinating inside him. Smells he could almost taste. Dream women whose breath he could feel.\n At noon, insulated by protective air suits grown from brown algae, which was more impermeable, though less comfortable than their Cladophora kaki, they pulled up barrels of seawater and drained it, first of jellies, the only creatures that survived and even thrived in the toxic waters, then of the chemicals and waste from the time before. One hundred vats yielded one cask of potable liquid. It was thirsty work.\n That night Riku lay in his bunk above the world, scared to sleep, yet anxious to dream. But Emi did not come. She had no chance. Just as Riku began to drift away he heard a cry, so real it could not be a phantom’s.\n In the center of the cement floor Haruto stood, frozen in a halo of diffused light that filtered through the acrylic celling. A wide smile was plastered on his motionless face. His arm extended sideways, rounded as if supported by something, though nothing was there. He wavered, like a pole in a gale, stiff but unstable. He tottered, back and forth, back and forth.\n Riku climbed out of his bunk. He reached for Haruto, just as he crashed backwards onto the floor. His body did not bend, every joint remained locked and rigid.\n Riku looked up. Twenty eyes gleamed at him from the bunks, watching silently.\n Riku dragged Haruto back to his bed. He pulled and shoved the unbending, unmoving body into the cot. He lay his ear against Haruto’s chest, listening to the faint, but steady rhythm of his breathing. Haruto’s skin was cool, his eyes were open, but unseeing. They glistened in the faint ambient light, like distant suns. His lips remained parted, teeth bared in that constant grin.\n Riku climbed back up into his berth and waited till morning. He didn’t remember falling into sleep, but he must have, for he was wakened by a shriek.\n Haruto had sprung from bed. His sheets were tangled around his naked feet. His eyes were wild, open so wide, a white sea surrounded each frantic iris. His head twisted from side to side. Riku had never seen a face so filled with fear and confusion and loss. They were not things of this world, his world, where everything was ordered.\n “Where am I?” screamed Haruto. “Where is Yumiko?”\n “Who is Yumiko?” Riku asked.\n “Who are you?” cried Haruto. “Where am I?”\n “You are on the island, as you have been for three days. I am Riku, your bunkmate.” Your bunkmate who you protected, even though you did not know me, even though it gained you nothing, and put you in harm’s way, he wanted to say but did not.\n “What is this place? Where are the mountains and the lake? Where is Yumiko?”\n “What are mountains?” Riku asked. “What is a lake?”\n Haruto seized Riku’s shirtfront, “What have you monsters done with Yumiko? Where have you taken me?”\n Haruto collapsed onto the hard, gray floor. His body, so unyielding last night, now seemed devoid of bones. Colonel Masuka stood over him with a metal baton.\n “He is gone,” Masuka said. “It happens sometimes.”\n “Gone?” Asked Riku, though he knew. The tales were true.\n “Gone. His memories have been taken—taken, or perhaps replaced is a better word. We don’t know why it affects some that way.”\n Masuka knelt down and injected Haruto with a small syringe. “It will put him quietly to sleep,” he said. “Better that way.”\n Riku blinked. He would not weep. He could not. He wondered if Haruto had gone to that land of dreams. He had never believed in such things before, but now . . .\n That night Kaito arrived to fill Haruto’s empty bunk. Riku wondered what had been done with Haruto’s tangled sheets? Had they been washed? Was Kaito even now covering his own, warm body with them, or had they been shredded to be used for straining the algae or removing the jellies from the sea? He did not really know Haruto. Why was this loss so difficult?\n Two days later, when Riku entered his room he found Kaito, standing frozen in the center of the room, his arm extended, a smile frozen on his face.\n “Wait,” Kaito cried, suddenly springing into motion, “I have a better idea.”\n He raced from the room, toward the outer door that lead to the airships. Riku and his companions sped after him. Instead of opening the door to the enclosure with the airships, Kaito ran to the outer wall and began punching it with his fists.\n “Let me out,” he cried. “I want to climb to the peak. I want you to . . . ”\n The shot was almost silent, just a tiny pop. Kaito collapsed, blood gushed onto the metal floor.\n “He would have kept trying until he breached the shield,” Masuka said. He nodded to the others.\n “Clean it up.” His voice was dead, his lips tight, his eyes had the sorrow of too much experience and not enough understanding. He felt a failure. These were his men, his charges, but he could do nothing against spirits. He could try to keep them safe from the toxic atmosphere, and the poisoned sea, but how could he fight invaders of the soul, and thieves of memory?\n Riku blinked awake. He was standing with his arm encircling Emi, his wife. She leaned against him, laughing. She smelled like green tea and vanilla and lilacs. Her skin was warm from the sun and the hike. Behind him Alpine peaks rose, rich with the scent of pine and summer flowers. He had never felt this alive, this joyous, with his feet on earth, and the earth growing around him.\n “Smile,” someone said.\n And he did. They had planned this trip for so long. Leaving their three kids with Emi’s parents and spending two weeks in Switzerland, just the two of them. A second honeymoon. And now, this nice stranger had agreed to snap their photo, just one of the millions of pictures they had taken to memorialize this vacation.\n Even though the day was bright, the camera’s flash was blinding. Riku blinked, trying to clear his eyes.\n He was in a strange place; a room made of metal and concrete. Men in uniforms surrounded him. There was something familiar about them, as if he had dreamed them.\n “Where am I?” he cried. “Where is Emi?”\n He ran toward the open door. The strange yet familiar men grabbed at him, but he evaded them.\n He raced toward the light, toward the sky, toward the open air, but when he got there, the world was cut off from him by a plastic bubble that surrounded everything. He heard boots clanging on metal. He was being pursued. He removed his shoes and looked desperately around.\n Somewhere in some dark passage of his cerebral cortex a memory whispered. He looked down. At his feet, there was a square lid with a latch, a trapdoor into the heart of island. It had been built so that caretakers could be sure that the columns supporting the island were intact. They must be certain that no water had seeped into the acrylic pillars, stuffed as they were with the debris of centuries.\n Riku lifted the hatch, saw a small stairway and slid in. It was dark in the tunnel. He pressed on his small flashlight and continued descending. The stairs wound down in concentric circles snaking around each and every pillar. The pillars were made of hard, strong, clear plastic. They were jammed with millions and billions and trillions of squares of shiny paper, landfill from the time before.\n He turned his light onto one of the tubes. Millions and billions and trillions of minute faces beamed out at him. Faces no bigger than his thumbnail.\n He paused, scanning them. Scrutinizing them. Some were black and white, others were in color. Colors that Riku had never imagined, greens more varied than alga, blues and purples and violets more intense than the flickering pigments of jellies.\n As he circled each pillar, stepping softly, balancing on his toes so as not to make a sound, an image caught his eye. It grabbed his heart. It twisted his soul. It was him and Emi, smiling against a backdrop of purple rock alpine peaks. Next to it was a square containing his entire family, his two sons, his baby daughter, his parents.\n He banged on the pillar. He clawed at the column, breaking his nails, cutting the ends of his fingers. The blood left reddish streaks on the clear acrylic. It stained the familiar faces. Tears coursed down his cheeks. He would give anything to hold those squares. They were the only things that seemed real.\n Next to his family, jammed in among all the images, were other squares, but these were not glossy. No one grinned out from them. They were white with stamped letters and words that had no meaning, Fuji, Kodak, Nikon.\n Riku crumbled onto the step, reaching toward Emi. Reaching toward the past.\n He could see her, trapped behind the acrylic pillar in a small red and white swimsuit, azure waves pounding against the back of her calves, laughing into the camera, one brief moment captured forever on celluloid. He saw his children on their birthdays, smeared with sugary icing. His parents dressed in the robes of ancestors.\n He would never know, how could he, that the pillars supporting Yūrei Island were stuffed with old photos. Photos of a people and a world long gone. Photos that had become only memories, memories searching for a home and finding one, temporarily, in the shells of lonesome soldiers.\n E.E. King is a painter, performer, writer, and biologist. She’ll do anything that won’t pay the bills, especially if it involves animals.\n She’s been published in over a hundred magazines and anthologies, including Clarkesworld, Daily Science Fiction, Chicken Soup for the Soul, Short Edition, and Flametree. She’s published several novels and has been nominated for a Rhysling, and several Pushcart awards. Ray Bradbury called her stories, “marvelously inventive, wildly funny and deeply thought-provoking. I cannot recommend them highly enough.”\n She’s shown at paintings at LACMA, painted murals in LA, and is currently painting a mural in Leap Lab in San Paula, CA.\n She is also the co-host of The Long Lost Friends Show on Metastellar YouTube and spends her summers doing bird rescue."}