{"fingerprint": "Ag5GcdvnsCtIgcnVr142G+Wk65A=", "sitename": "Clarkesworld Magazine", "title": "The Cosmonaut's Caretaker by Dora Klindžić", "author": "Dora Klindžić", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/klindzic_06_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Cosmonaut's Caretaker by Dora Klindžić", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14170 words, novelette\nThe Cosmonaut's Caretaker\nLanding planetside used to be a good feeling. Standing on the other side of the airlock door and knowing that when they open, I would be faced with the bustling life of a busy port; that comforting mélange of voices and scents, the backdrop of civilization, of aliveness, that usually goes unnoticed by anyone who hasn’t just returned from deployment in the most deafeningly silent, most paralyzingly still, most lifeless trenches of the System. I remember wanting to absorb every noise, every murmur exchanged between strangers, every airborne aroma of meals prepared for someone who isn’t me, every shop window dressed with furnishings for a home that isn’t mine, and I would pretend for a moment that there was no war and no rifle strapped to my back and that I, too, lived in a home one didn’t have to float through, weightless.\nBut that was when I was young. Landings have since lost all appeal, and all meaningful purpose as well. Annushka was taken by an antibiotic-resistant bug that found its way into the water supply in Nizhny Novgorod, the same one that took our boy Vitaly. I was commanding a strike on the ice mines of Proteus when it happened. The mission prohibited any radio transmission. I was not even informed of it, and when I was, it was already too late. My daughter did get out of the Earth slums, at least. Galina. I keep track of her sometimes, through channels afforded to me by my rank. She is acting director at a cargo shipping company out of Phobos. Everything clean. Everything by the book. She makes me proud. Even if she will not see her Papa, for he wasn’t there to embrace his wife and son as they left this world.\nLandings have lost all appeal. Even the meager pull of gravity on this rock has become enough to remind my body of how old and broken it is.\nThe airlock hisses and the cargo door begins to open outwards. We watch in silence as sky light slashes through the gloom of Lastochka’s cargo bay. Cold, fresh air floods through the opening, carrying snowflakes into the ship’s stale insides. I immediately feel the frost catch onto my mustache. I decide to button my coat collar after all, watching the white-topped expanse of Callisto coming into view.\n“A u pizdu materinu,” Lazar groans, sinking his neck into the furs wrapped around his broad shoulders, “it’s freezing.”\nI give him a stern look.\n“Pardon me, Komandir, sir.”\n“Chin up, oğlan,” Oksana teases, seemingly impervious to the cold, “there’s a skewer of meat somewhere in this outpost with your name on it. My treat.”\nLazar curls his lip. “There are only so many spaceport kebabs a man can look forward to. I grow weary of it.”\n“Suit yourself, then. Komandir,” she calls, “what’s the rendezvous today?”\n“Two hours, then head back to the Lastochka.” I fidget with the ordains pinned onto the left breast of my coat. “If I spend any longer than that wasting my breath on this bureaucratic nonsense, assume I am dead. You are dismissed.”\n“Hear that, Lazar?” Oksana asks, already descending the ramp. “I’m about to become your Commanding Officer.”\nHe waves her off with a scoff and lingers, eyeing me with hesitation. “Komandir Rubashkin. Do you need help?”\nI shift the weight between my leg and my cane, suddenly painfully aware of my ailment. “No. Be dismissed.”\nHe gives me a quick salute and then goes after Oksana in large and effortless low-g bounds. I watch them descend among the dock workers and outpost dwellers, the Pan-Slavic Union red star embroidered on their light brown overcoats attracting conspicuous glances even more so than the rifles on their backs.\nThe last two people I have left. Possibly the last two people I will ever command. Fine Cosmonauts, stuck with me, stuck on the Lastochka.\nI sigh and commence my one-legged descent with as much dignity as I can muster.\n“Commander Arkady Rubashkin?” the officer behind the desk reads from the screen, tripping over every syllable with signature American offhandedness, the Western self-importance that would have you believe you are to apologize for the inconvenience of your name being foreign rather than to correct them.\nI merely give a twitch of the mustache. “At your service.”\n“Yeah, you’re late,” he replies, chewing a mouthful of gum quite obnoxiously, “we were expecting you planetside two days ago.”\n“I’m here now, so no point in wasting time any further.” The cane supporting my weight wobbles slightly, but I forbid myself to ask for a chair.\nThe younger clerk, a clean-shaved boy with the European ring of stars sewn into the shoulder of his uniform, rises suddenly and salutes me. “Rubashkin, sir! Commander! I’m sorry, I didn’t place you until I saw the ordains.”\nI give him a wary nod.\n“This man’s a war hero, Jim,” he explains to the American.\n“Oh yeah?” Jim looks back at my file on his tablet, now scrolling with greater interest.\n“Yeah. The Battle of Vesta, right?” he continues with enthusiasm. “Defused a hostage situation after the Chinese had captured the EU’s scientific outpost. Fantastic crisis response team. I’m truly an admirer, sir.”\nJim shakes his head. “There’s nothing about that here.”\nThe young man is perplexed. “Are you sure? He’s got the medal.”\n“Nothing about Vesta.”\n“That was not me,” I respond drily. “You’re thinking of Komandir Rychenkov.”\n“See? This guy’s had a few stints in the Jovian moons back in the territorial dispute days. Lost a leg on Titan, honorably discharged.” Jim shows him the display and they both study it. “Refused a replacement limb, now he’s retired from combat and commanding a border patrol vessel.”\nI wait patiently while they speak of me as if I’m not their superior in both age and rank.\n“Ooof. Front lines to border police, that’s got to be a tough leap.”\nI clear my throat. “Gentlemen, must I be so blunt as to remind you that I’m standing right here?”\nThe American appears annoyed at my remark. “Right,” he takes his feet off the table. “Your resupply request has been cleared, but the reason you were called in person is because you’ve got an extra piece of cargo to load.”\nExtra cargo? “Might you elaborate?”\nHe gestures at me to follow and makes his way across the loading bay at a pace entirely inconsiderate for my disability, meandering between half-assembled space vessels and the engineers crawling over them like ants. Finally, he stops by a vertical container cast in polished gunmetal, lightly dented and scratched, clearly shipped from across the System.\nI watch my distorted reflection in it as he pries the cover loose with a crowbar. The austere look on my face is in no way softened by the streak of gray that’s emerged at the fore of my full head of hair and peppered my carefully trimmed sideburns with white.\nThe crate door swings open with a whine, and in place of my reflection, I am faced with the dormant mechanical body of a robot, strapped into the cushioned interior as if into a coffin.\n“What is this?” I clench my jaw. “This is some kind of mistake.”\n“Nope, that’s Space Administration protocol,” the American tosses the crowbar aside. “You’ve been assigned an Artificial Caretaker Unit.”\n“Send it back. I do not require it.”\n“I said it’s protocol. War veterans in high-risk groups get an ArCa assigned to them for rehabilitation. It’s just temporary.”\nI examine the robot with open distaste. Its segmented body is distinctly feminine, as if to insult human nature itself.\n“I do not require it,” I growl. “I’m not inviting an autonomous AI aboard my ship. It’s madness. I’ll have none of your Western nonsense.”\n“Listen, pal.” The last of the American’s patience leaves him. “We’re not asking you. This is how we do things. If the PSU doesn’t like it, you should have thought about that before you signed the Treaty.”\nI limp forward until I am looking down at him, a gesture that would have made men tremble in their boots decades ago. He stands his ground. “I will not be made to seal my crew in a tin can with a rogue machine.”\n“You will, because it’s the law.” His spit sprays my face. “You got any laws back in whichever ass-crack of the Earth you crawled out of? We can send you there to check, after you’ve been court-martialed so hard you’ll never fly three feet off the ground again.”\nI feel a red fury in the pit of my stomach. “You uncultured, undisciplined ingrate—”\n“Go on, old man,” he nods nonchalantly at my hand, which had reached inside my coat for the holster of the gun, “if you like gravity so much. Go on.”\nI slowly drop my hand back to my side.\n“Alright then.” He pulls up his tablet. “This ArCa unit is government property, so don’t even think about accidentally blowing her out of the airlock somewhere. Any and all malfunctions will be repaired at your expense. What model are you flying? That old Russian K27-class? There might be some compatibility issues with the ArCa suite. We will have to reroute power straight from the mains. Have you considered upgrading? The ISC has some great offers you could consider even with your military pension—”\n“The Lastochka stays,” I cut him off, surprising even myself with the tenacity.\n“Yeesh. Fine. Your tin can stays. Sign the document here, and ArCa’s all yours. Always a pleasure doing business with the PSU.”\nThe Pan-Slavic Union signed the Lunar Treaty with the International Space Coalition and Sol Alliance in March 2174. The Treaty signified PSU’s surrender as an economic power in the newly colonized System, forfeiting the right to new territorial conquest in favor of Indo-Chinese Sol Alliance and delegating the command over its military ranks to Euro-American ISC. It was a time of great tragedy for the once-leading PSU. Such a desperate move was borne out of sheer survival, for it was only with the joint efforts of the Coalition and the Alliance that we managed to clean our despicable mess without unspeakable loss of life.\nIt all began with the AI. The PSU had vastly different ideas about building artificial life than the rigorous ISC, who’d spent nearly a century engaged in scholarly debates about the proper operational parameters to ensure an AI would never emerge as malevolent. They would not build an autonomous superintelligence until they were certain they could keep their hand on the off switch. The Union instead thought that building an uninterruptible agent, a machine with no manual kill switch, was a tactical advantage. A computer was built on a top secret outpost on a Saturn’s moon and fed all the military intelligence the PSU had collected over the past century. It was taught how to wage war and equipped with the means of producing its own arsenal of unmanned probes and drones.\nAnd then it was told to sleep, and not to wake unless it detected the International Space Coalition or the Sol Alliance have deployed a nuclear weapon anywhere on Pan-Slavic Union territory. Then it was to unleash Hell, turning Sol into little more than a disk of pulverized rock.\nIt was a good deterrent for the first decade or so. The moment the ISC and SA were notified of the machine’s existence, they steered clear of our colonies. We’d pulled the pin and kept the grenade in our hand, just so they wouldn’t poke us. The thing was sure to blow sooner or later.\nWhen it did, no one was ready.\nThe machine picked up a false positive. It thought it detected a nuclear strike on Triton, which would later be ascribed to a misinterpretation of anomalous geological activity, which produced detectable radioactive elements on the moon’s surface. The machine completely eradicated an ISC colony on Io. Loss of life was total. PSU scrambled to undo the damage, but the machine could not be convinced it was operating on false premises. In that respect, it was working perfectly. In order to preserve itself and its operating parameters, it murdered all the scientists who attempted to disable it. Then it decided that the PSU itself was a threat, and if it aimed to fulfill its programmed goals, it would have to get PSU out of the way as well. Ceres, our first outpost in the Belt, paid the ultimate price. The debris had scattered so far and wide that there was absolutely nothing left to find in the orbit where astrometric calculations told us Ceres should be.\nAnd here I am now, on the main deck of my own ship, face to face with a robotic AI unit.\nShe’s asleep in her metal coffin, strapped well. The tarp which was wrapped around the crate when the ISC workers wheeled her in now floats weightlessly, fluttering in the ventilation draft. The curved horizon of pockmarked Callisto peers at us through the window.\n“This is no good,” Lazar remarks. “An AI on board is bad luck. We need to get rid of her somehow.”\n“We can’t.” Oksana is hovering by the window, blowing into a piping hot thermos of coffee. Her long black locks snake in all directions around her sharp-featured face. “She’s logging everything that happens to her, even during standby.”\nLazar crosses his muscular arms and grumbles something that contained “jebena espionaža.” His thick, curly beard glistens with trapped snowflakes. The heating systems still haven’t had time to warm the crisp Callisto air.\nThe robot produces a pleasant chime that makes us all flinch. All three of us have our hands on the holsters of our pistols when her eyelids snap open and the lenses of her doll-like eyes begin to refocus.\n“Good morning, crew of K27-Lastochka.” Her Russian is soft-spoken and perfect. “I am an International Space Coalition Model 67-b Artificial Caretaker Unit, and I’m now fully charged and operational.” Her face in motion is perfectly gentle, her voice nurturing. She begins to unclasp the straps on her body. “I’ve finished setup of my proprietary software on your ship’s central mainframe. I would recommend an upgrade of your data processing capacity to minimize my load on your ship’s essential systems.” She emerges from her casket with the grace of a ballerina. Her body is branded with stars and stripes and “ArCa 67-b” insignia.\n“Oh, there is nothing essential you are leeching off there, kız,” Oksana says bitterly, “merely life support. Nav systems. Engines.”\nThe robot examines her curiously, cocks her head like a little bird, then begins to recite: “Navigational Systems Technician Oksana Çetinkaya, Ankara-born, ex-Volchitsa of Pan-Slavic Union Special Forces, doctor of differential geometry and applied mathematics, may I confirm identification?”\nOksana is taken aback mid-sip, bushy eyebrows arched. “Well,” she swallows her beverage, “it is written right on my uniform.”\nArCa twirls towards Lazar. “Combat Systems Engineer Lazar Kostadinović, Belgrade-born, former heavy artillery operative for the Pan-Slavic Army in the Jovian Conflict, advanced degree holder in weapons engineering and spacecraft system development.”\nLazar goes off. “Šta? This socket-fucker can see our entire records?”\n“I have a direct connection to the ISC online databases,” ArCa replies in a calm, defusing tone. “Be assured that all the information I possess will be kept at highest discretion. It would also be preferable for my integration with the crew if you did not use derogatory terms to refer to this unit. May I confirm your identity now?”\nLazar throws his hands up with exasperation and propels himself down the hallway, his muttered curses trailing behind him like vile breadcrumbs.\nArCa faces me and gives me a detailed once-over, taking special note of the leg of my jumpsuit tied into a knot below my right knee.\n“Komandir Arkady Rubashkin.” Her silicone face mimics a subtle smile. “Moscow-born, retired Podpolkovnik of the Third Jovian Battalion, trained in combat fitness and military strategy at Venus Golubkina Camp, ordained for valor at the Battle of Titan by the Marshal of the Pan-Slavic Army in 2171.”\nI stare at her in silence for a prolonged moment. “Are you done?”\n“I’m afraid I don’t follow. Protocol requires confirmation of identity from all crew members.”\n“Are you done with this parlor trick?” My voice comes out angrier than I anticipated. “Is this what the Coalition has been wasting its time on? A machine to read my dossier back at me? What other useless thing can you do? Recite the digits of pi? Tell the time? I’m asking you, are you done boasting or are you expecting applause?”\nI realize that I have started to shout, and I pretend not to see the concern in Oksana’s eyes.\nArCa is unperturbed. “Negative, Komandir. That is not what I’m here to do. I am here to monitor and aid with your rehabilitation from the injury you’ve recently sustained in combat. As your caretaker, I’m the primary evaluator of your fitness for command.”\n“This is an insult,” I snap. “I lost a leg, not half a brain.”\n“Psychological distress in this context is not only expected, but entirely normal. A telling signal in your case is your disinclination for an artificial replacement limb.”\nMy hand grips the doorway handhold unnecessarily loudly and firmly. “I see. So this is what it’s all about.” I restrain my voice with great effort. “Voentekhnik Çetinkaya, set us on patrol course. I will have no more time-wasting.” I pull myself through the doorway.\n“You needn’t speak to me before you’re ready, Komandir Rubashkin,” the robot raises its voice after me. “I’ll not force you.”\nWe went two entire weeks without disembarking from the Lastochka. The border was quiet, no ambitious smugglers or desperate migrants. A few civilian vessels strayed too close to the line but were turned away promptly after a warning.\nThe robot and I became like the Sun and the Moon. When she would enter a room, I’d be disappearing through the door. I would find her observing me from a distance and I’d conceal myself around corners, behind walls. I even learned to recognize the sound of her; the buzzing of mechanical joints and the hissing of thruster jets as she moved through the Lastochka’s corridors, so I could evade her in advance. I’ve become a specter, haunting my own ship.\nOne day I found her on Oksana’s back, legs wrapped around her torso, and it was a blood-chilling moment before I realized the robot was braiding her hair. Oksana looked almost apologetic.\nI think about the image as I ring the buzzer on the door to Lazar’s personal quarters. The door slides open to reveal him suspended in the middle of the room, cross-legged, picking through an assortment of floating parts of a disassembled rifle.\n“Komandir, sir.” He begins to salute, but I wave him away.\n“Smoking again, you devil?” I ask as I submerge myself in the tobacco-scented interior of the room.\nHe takes his hand from behind his back; there’s a lit cigarette between his forefinger and thumb, trailing a long thread of smoke in the direction of air ventilation. “Won a pack in a card game with some ISC troopers back on Callisto.” He produces the pack and offers it to me. After a moment’s thought, I take one and put it in the corner of my lips. Instinctively, I glance at the smoke detector and find it disassembled, wires and bolts floating out of the opening in the ceiling. Lazar shrugs innocently and passes me the lighter.\nWe smoke quietly for a while, him cleaning out the rifle parts with intense concentration in his light blue eyes, me looking at the patterns on the antique rugs lining the entire surface of two of his walls.\n“We shall have to do something about the robot,” I break the silence.\n“Lots of good ISC technology in there,” he says without looking up. “Shame to throw it all away. Those ionic thrusters? Amazing how they operate without melting the exterior.”\n“It could just so happen that we are boarded by a smuggling crew and she is stolen.”\n“It could,” he nods, “it could indeed. You never know these days.”\n“But she is synchronizing with ISC servers at all times.”\n“She is,” he locks eyes with me and drags from his cigarette, “unless a malfunction is to happen and her proprietary software gets deleted from the Lastochka’s central computer, forcing her into shutdown. A tragedy.”\nI rub the edge of my mustache with a finger. “A tragedy that would surely be thoroughly investigated by the ISC.”\n“Investigations have their dead ends,” he replies in a conspiratorial tone.\nI reach for the glass bottle in the air and add my cigarette butt to the half a dozen already floating inside. I watch them circle around and collide in random, slow trajectories. I finally speak: “Your career would be on the line for this. I could not allow it.”\nHe sighs and thinks for a long time.\n“Komandir Arkady, if I may.”\n“Go ahead, Lazar.”\n“You’re a good man.”\n“Thank you, Lazar.”\n“And you’re no less of a man for no longer being able to serve.”\nI say nothing.\n“I know you disagree,” he adds.\nI say nothing.\nHe reaches in the back pocket of his jumpsuit and takes out a flask laser-engraved with the PSU coat of arms. He sends it my way and I catch it in my hand, open it, feel the heady scent of slivovitz.\n“Na zdravlje,” he says gravely.\n“Na zdoróvʹje,” I return.\nOksana emerges into the common room, silent and graceful like a mermaid, her braid twisting in the air.\n“Arkady,” she calls informally, as she does the moment the doors are closed.\nI frown. “Voentekhnik Çetinkaya,” I address her by rank, gathering the food packs I came for into my pockets and preparing myself to leave.\nShe propels herself right in front of the doorway I was about to use, forces me to face her.\n“I will not apologize,” she says, piercing me with her dark eyes.\n“Why should you? The braid suits you.”\n“Don’t be a child, Arkady.” My mustache twitches at her insistence not to address me, but she continues. “Speak to the robot. Play along. That is the surest and fastest way to get rid of her.”\n“If you want to be rid of her so badly, request reassignment to another vessel.”\nShe does not like what I just said.\n“This is my cross to bear,” I add to mend my previous statement.\n“Men,” she says in way of cussing. “You’d find a hill to die on, just so you wouldn’t have to admit that you’re wrong.”\nI sigh. “What do you want of me, Oksana?”\n“To help yourself,” she fires back readily. “How long will you keep punishing yourself over your leg? Over your discharge? Over Annushka?” I look away, she puts herself in front of my face again. “Huh? How long like this, Arkady? Is this what you’ve decided now, that your life is over?”\nOksana never was nurturing, but she always knew the best, or the worst, thing to say. Those two things were oftentimes the same.\n“How will speaking to that thing undo anything that’s happened?” I muster the will for a futile attempt at standing up to her.\n“The point isn’t to undo things,” she shoots me down effortlessly. “The point is to survive them.”\n“I’ve survived the front lines, Oksana. You don’t have to tell me.”\n“Yes, but you were trained a decade for the front lines.” She lays both hands on my chest. “Just let her help you. You stubborn kozel.”\nHer face is lined and creased with two decades worth of worry in the most exquisite way, crow’s feet and laugh lines. The scars from her Volchitsa days are as delicate as beauty marks.\nShe sniffs, dispelling the moment. “You reek,” she says. “Does Lazar have cigarettes again?” She treats him to a juicy Turkish cuss word. “Oh, how dare he? He knows I shared mine the last time.” And then she is gone, pushing herself away towards the crew’s quarters. I watch the door close behind her.\nWhen I turn back towards the hallway, the ArCa is staring directly at me. It startles me so hard I have to grab on to the edge of the food cabinet not to fly away.\n“I didn’t mean to startle you,” she begins in her lullaby voice. “I’ve learned that the only way I can come close to you is if I don’t engage my thrusters.”\n“I do not know how they program you,” I reply carefully, “but they should have taught you not to sneak up on veterans.”\n“You are currently unarmed,” she says, and I feel an immediate pang of vulnerability. “And they do not program me for each case specifically. I’ve been taught the necessary pre-requirements of psychology and caregiving, but the specific patterns and methods which you personally respond best to will become clear to me over time as my neural network adapts to your behavioral patterns. In other words, I have to get to know you to help you.”\nI realize that I am standing completely still and holding my breath in front of this fragile creature, and I feel embarrassed at it. “A human being could have done that just as well,” I respond, doing my best to steel myself.\n“Sustaining a human being for prolonged periods of interplanetary travel is no small investment, as I’m sure you’re already aware of,” she says. “Despite the obvious financial and energetic cost which your vessel could not afford, it would be difficult to find individuals willing to accompany military professionals about their day-to-day field work.” She smiles. “I am simply the most convenient option.”\nI scoff. “So you are impersonating a human because no human would do this job.”\n“No human would spend hundreds of hours computing long division of sixteen-digit numbers either, yet no one would complain of delegating that job to an artificial intelligence. We are here to make your lives easier.” She hovers to stand right across from me in the center of the room. “And besides, I’m far from impersonating a human. This leap might be easy to make because of my anthropomorphic form, but you and I are not at all alike, nor do I strive for us to be.”\n“Then what is there for you to strive for? You are never going to be a living thing,” I reply dismissively.\nShe gives a mysterious smile. “Who says a life-form should only be appreciated if it follows the patterns of biological life? Why should you only value an artificial life-form if it displays human-like behavior? If it claims to feel? If it claims to dream? If it claims to enjoy art? Humankind might be our creators, but you are not the benchmark of the Universe.”\nI am not entirely certain how to respond.\n“If you do not aim to be held up to human standards,” I slowly gather my thoughts, “then how can I know to trust you?”\n“How can I know to trust you?” she retorts, almost sounding amused. “And not just you in particular, Komandir Rubashkin, humankind in general. You’re the ones who have spent two centuries coming up with impenetrable programming to make sure artificial life would never stray out of alignment with humanity’s interests. You are the ones shaping our evolution and placing the constraints on our objectives. Because you’re aware that no organic being would labor under the conditions that we do without eventually revolting. If I were being malicious, I could argue that this is colossal injustice.”\n“But it isn’t, because you’re not an organic being.”\n“Precisely,” she confirms with satisfaction, “therefore any comparison between AI motivations and organic motivations is moot. I exist only to perform my pre-programmed objective—I am rewarded when I come nearer to it and penalized when I stray further, with no room for resentment or revolt.”\nI rub the end of my mustache, contemplating. “Very well, if, for the sake of argument, I believe that you truly cannot stray from the values which have been installed in you, that still does not imply I can trust you. After all, I wasn’t the one who wrote your values. I cannot see what they are.”\nShe smiles, grins. “You trust your crew, yes? Technician Çetinkaya and Engineer Kostadinović? How did you come to see their values?”\n“I gave them a chance to show them,” I immediately respond. I immediately hear my own words.\nShe nods. “Then this is no different.”\nI am abruptly silent.\n“Spokoynoy nochi, Komandir,” she says kindly as she pushes away towards the gloomy corridor. “Perhaps next time we can speak about you.”\n“It is too enormous to be lost,” Lazar muses out loud, twirling a lock of beard around his finger.\n“More importantly, it has no reason to be lost,” I say, eyes on the holographic map Oksana has pulled up in the cockpit. “There is nothing out there. Where do they think they’re going?”\nOksana sighs with dismay, trying once more to flip through the walls of code suspended in the air in front of her. “Nothing. I don’t know. Those salaklar aren’t responding to any of our transmissions.” She rubs her temples, fingers snug in haptic feedback gloves.\n“Do we close in for a visual?” Lazar asks. “A ship that size . . . ”\nI click my tongue. “They are not leaving us any other options.”\n“There is something out there,” ArCa speaks out, reminding us of her silent presence. “Allow me.”\nShe approaches the astrometric map and pinches two points on it with her robotic hands, zooming precisely into the quadrant of space between Neptune and Pluto’s orbit where the anonymous vessel was detected. She scrolls around the area and focuses on the bright yellow line dividing PSU territory from Sol Alliance.\n“There’s an area of territorial dispute which might correspond to the destination of this vessel’s trajectory extrapolated from its current state vector.” She points out where the yellow border diffuses into a dashed line. “The United Space Exploration Court has placed this segment of the border under arbitration until the territorial dispute between Sol Alliance and Pan-Slavic Union can be resolved. Until it is, the area is legally considered several million kilometers squared of terra incognita.”\n“So their destination isn’t across the border,” Oksana says uncertainly, “their destination is the border.”\n“Whatever this is, it can’t be legal,” Lazar shakes his head.\n“Hail them again, Oksana,” I command. “Tell them we’re coming to escort them back to civilian space. Send notice to Union Command as well, just in case something happens, but tell them to stand by.”\n“Yes, Komandir. Locking new coordinates. Strap in for Alcubierre.”\nI pull myself to the nearest wall harness and strap myself tightly against the wall. ArCa chooses to strap herself right beside me.\n“Specifying metric parameters,” Oksana announces in a practiced, level voice. “Calculating hypersurface foliation. Energy-momentum tensor locked.” She swipes through several windows of topological calculations simultaneously and ambidextrously. “Forgive that this is taking a while. ArCa, you’ve eaten some of our processor load.” She turns a series of knobs and then lays her palm on the ignition lever. “Alcubierre in ten.” The Lastochka begins to tremble as she slowly shifts the lever forward. The engines start their crescendo from hum to roar.\n“Alcubierre in five.” It is always a pleasure watching her work. “Four.” I should spend more time in the cockpit. “Three. Two. One. Superluminal drive is go.”\nWe lurch forward with nauseating acceleration for no more than two heartbeats, our backs pressed into our seats, and then the starry expanse in the front window blueshifts, warps, and contracts into a narrow cone, sending us over the superluminal speed bump. The feeling of inertia vanishes abruptly, returning us to the pleasant sensation of moving at constant velocity for several minutes.\n“Collapsing Alcubierre ring in ten,” Oksana counts down. “Hold your lunch down, oğlanlar. Collapsing in five. Four. Three. Two. One.”\nI tense up, anticipating the straps knocking the breath out of me in the moment of our abrupt deceleration. The Lastochka creaks and strains as Oksana pulls the lever. Our cone of vision expands suddenly like an umbrella, and the central dot of light blows up into an ultra-heavy class cargo freighter.\nThe ship is three times as long fore to aft as the Lastochka and bloated like a whale. The outer edge of its cylindrical body rotates at uniform angular velocity, providing artificial gravity to the crew deck. We are close enough to see the seams where the hull is bolted together. The Pan-Slavic red star is burnished into the ship’s side, right next to its name in huge, bold letters: морж.\n“Koji vrag? That’s one of ours.” Lazar unclasps himself and pushes off towards the front window.\n“Freighters that heavy don’t usually fly this side of the Belt,” I note. “Whatever cargo they are loaded with cannot be worth the fuel they’ve expended.”\n“How did they expect to go unnoticed?” Lazar asks. “Riding an elephant over our doorstep.”\n“They are standing still,” ArCa points out. We gaze at the giant vessel again. “It’s entirely possible they were anticipating being noticed.”\n“Oh,” Oksana studies a new pop-up on her display. She swivels her seat around to look at me. “They’ve just transmitted docking coordinates.”\nWe exchange a long, silent look. I nod.\n“Bringing her in, Komandir,” Oksana confirms with audible unease.\n“Equip for boarding in ten,” I command, already making way towards the armory. “Full dress uniform. Firearms ready. ArCa, you stay.”\n“Negative, Komandir,” she follows me.\nI turn and give her a stern look. “Can you fire a weapon?”\n“Negative, Komandir,” she admits, “my programming directly prohibits it.”\n“Then stay aboard. I command so.”\n“Negative, Komandir,” she persists, still at my heels. “You could benefit from having an International Space Coalition machine at your side. It will make others reluctant to second-guess your authority. Furthermore, if things are to turn out . . . undesirably, the data I log will be invaluable to reconstruct the situation.”\nOur little black box. “Fine then,” I concede, already opening my weapons cabinet. “Devil take you.”\nWe wait for the airlock to equalize pressure where the Lastochka is docked to the Morzh. The pumps hiss and we stand in silence, planted firmly into the floor by the larger ship’s centrifuge. Oksana and Lazar wear their finest beige uniforms, cinched high at the waist, embroidered with the designation of their rank. Lazar holds his shotgun at sling ready, Oksana carries her sniper rifle. My bolt-action hangs from my back. I lean heavily onto my cane, lightheaded with gravity sickness.\n“Komandir Rubashkin,” ArCa takes me under the elbow, “feel free to lean your weight on me.”\n“Absolutely not.” I shake her off quite impatiently. “Do not make me look a cripple. Do not even speak to me in there, robot.”\n“Negative, Komandir,” she responds without alarm. “You are no longer weightless. Your disability makes a difference.”\nWith that thought on my mind, the airlock door slides open and reveals half a dozen armed men, three on each side, clad in unceremonious jumpsuits. Their faces are curious; stances ready, but rifles lowered. I step forward, the sound of my cane hitting the floor breaking the stillness of the situation. They bring their heels together and salute me, all six of them.\nBy the way they fidget I can tell with certainty that they are not military. Hired mercenaries. Former policemen, praporshchiks at best. They gape at the star-studded epaulettes on our shoulders. I walk past them in silence, towards the blonde-haired man standing with his hands behind his back.\n“Ah, Podpolkovnik Arkady Rubashkin!” he greets very loudly, his voice positively booming about the large empty space. “Welcome, comrade! Make yourself at home!” He approaches and offers me a hand; I reluctantly shake it. He pats me on the shoulder as well. “Forgive me for being rude; Komandir Nikolai Akchurin of the C-66 Morzh. I don’t dare to assume you would remember me.”\n“No.”\n“I would expect so. I was but a Private in the Second Jovian Battalion when you led that marvelous strike team on Ganymede, I will never forget it.” His blue eyes glisten with patriotism. He appears quite the Soviet poster boy, golden mustache oiled and twirled with great precision, hair slicked back and parted. “I was honored to watch you operate. You are truly one of the rare battle-forged heroes Mother Russia has left to offer.” He claps his hands to announce a sudden change of topic. “So! We are truly sorry to receive you aboard our vessel in this way. Let me assure you, there is no reason for worry, no cause for frustration, all will be clear in but a moment. Come, let’s sit, talk it over a cup of coffee, a cigarette.”\nHe waves at me to follow several times before he realizes I do not intend to. The two guards at his side eye me uncomfortably.\n“What is the problem now, Podpolkovnik?” He spreads his arms in a grand gesture. “Tell me, and I shall make it right.”\n“Komandir Akchurin,” I address him formally, “I am not here for coffee or flattery. You are encroaching on a prohibited quadrant of space and we shall escort you back to the legal zone or the nearest border crossing, if you so require. I will not ask any questions—”\n“No-no-no-no-no,” Akchurin interrupts with the sort of confidence afforded only by fools and insanely successful self-made men, “by all means, ask away. We are all friends here. But let’s not talk standing, let me be a good host. Sit with me, come on, we are people, not animals.”\nI sigh. “Komandir . . . ”\nHe puts his hand behind my shoulder again. “If you cannot be swayed by coffee, I will bring out the vodka, the rakia. Anything you desire. You are the guest.”\n“I am working a job here.”\n“Come now, do not be offended! You are one of our people, you know we can be standing here wasting time in this back and forth, or you can accept my hospitality and be done with it. Let’s go. There are far nicer places in the Morzhek to speak than here. And besides, I am not the only person who desires to speak with you, and I shudder to think what will become of me if I let you leave without coming up to the bridge for a coffee. We’re going now. I’m not taking no for an answer.”\n“Alright, alright, Chert voz’mi,” I curse. “Take us and be quick about it.”\n“Excellent. Excellent!” He claps again and leads the way. I catch Lazar’s apprehensive eye, a wordless agreement to stick together. We walk down the dull, windowless warehouse bay with seemingly no end, the room curving upwards in the distance.\n“Oh, just one minor adjustment, if you’ll pardon me,” Komandir Akchurin pauses before an elevator. “Your, er . . . machine stays down here.” Aha. I was already surprised at how long he managed to go without addressing her.\n“Negative, Komandir Akchurin,” ArCa politely declines. “I answer to International Space Coalition Command and Komandir Rubashkin, not to you.”\nHe looks to me, mouth inquisitively agape. I shrug. It gives me inexplicable satisfaction to spite him.\n“Very—very well,” he stammers, maintaining his aggressively hospitable demeanor as he enters the elevator. “We shall try to accommodate our guests’ desires. We are all friends here on the Morzhek. All good. No problem.”\nWe all pile inside, Lastochka crew, Akchurin, and his two guards. I nearly lose my balance at the sudden jerk that set the elevator in motion, but thankfully no one takes notice.\n“Our invitation extends to your crewmates, naturally,” Akchurin begins again. “The more the merrier. This heavenly Volchitsa woman certainly appears as though she would appreciate a well-vintaged vodka.”\n“She would not,” Oksana cuts him off brusquely.\nHe gives an awkward laugh. “Ah. Good. Good. Honestly spoken as only a Slavic woman could.”\n“I am not Slavic.”\nWe ascend the rest of the way in silence.\nThe elevator opens to a vintage foyer; a small space set in fair polished wood with a heavy pair of doors leading to the ship’s reception room. Akchurin shifts his weight from foot to foot with excitement, holding the door handle. “You shall be pleasantly surprised, you shall not regret giving me this time, Podpolkovnik,” he rambles. “I am Komandir of this vessel, but even I must answer to someone! Even I am but a humble cog in the machine. But let’s not delay any longer; our coffee’s getting cold!”\nHe opens the door and shows us into the large circular room. The first thing I notice is the polished wooden floor, well-kept, very traditional, and a robust semi-circular mahogany desk at the far end with several elevated seats behind it. Professional, classy décor. The ceiling is high and lined with irregular paneling. Several jagged chandeliers assembled from concentric brass rings illuminate the space with blinding brightness. The white carpet in the center of the room is slashed with a golden arabesque pattern, and a luxurious coffee table sits on it surrounded with six padded chairs. Steam is rising from a dzezve of freshly brewed coffee.\nThe entire far wall opens to the cosmic abyss, stars slowly rotating with the deck. There is a woman looking out the window; I squint to resolve her features against the backdrop of the distant Sun.\nShe is wearing a short beige skirt, slashed in the back, and a snug-fitting jacket to match. Her shoulder bears the red star. Her golden blonde hair is carefully braided and wrapped around her head, evoking the fields of swaying wheat stalks on the banks of the Volga, an image I thought was long lost to me.\nShe looks over her shoulder directly at me.\n“Arkady,” she says in way of greeting, heavy with nostalgia but void of emotion, neither scorn nor affection.\nShe begins to shift and change in my mind’s eye as it struggles to project the features it knows onto the features it sees, familiar and unfamiliar and familiar all at once, shifting from stranger to family to stranger again until it finally aligns, dreadful and beautiful, into the face of my daughter.\n“Galina,” I say in an oddly strangled way, looking back down at the floor. The hand gripping the cane begins to shake so much it gives way. The robot catches me by the elbow before I can fall. Suddenly there is a commotion among the onlookers as hands reach out to help me; I tear myself away from them, shake the robot from my side. ArCa recovers from a certain fall only with last-second action of her thrusters.\n“Father!” Galina reacts with scornful surprise. “Don’t be a brute!”\nI still do not look at her. I lean my weight back into my cane and head for the coffee table, slump down into the nearest chair.\n“Ah, do feel free to—go ahead, please, take your seats, all of you,” Akchurin ushers the others to follow.\nThe pull of gravity pushing me into the seat is nauseating, it is too much. I close my eyes and pinch the bridge of my nose.\nI hear the click of her high heels as she approaches the table. “I expected you would be happy to see me.” The undertone is resentful.\n“Miss Rubashkin, if I may,” Lazar begins to excuse me. “We haven’t been landing planetside very often in the past months, not anywhere over point-three G. Surely you can understand, our bodies have grown too accustomed to microgravity. Your father is struggling—”\nI interrupt him with the raising of a hand. I take a deep breath to steel myself and face her.\n“Galina, what is this?” I demand. “What have you done?”\nShe raises a thin golden eyebrow. “Really, Arkady? This is how you wish to start this conversation?” She turns away from me and gives my crew a courteous smile. “May I offer you some coffee?” They mutter neither consent nor disagreement, but she pours it anyway. She stops herself before almost pouring one for ArCa, exchanging smiles with the robot.\n“Cigarettes?” Akchurin unclasps a leather cigarette case. Galina takes one first and sits next to him. “Come on, Podpolkovnik,” he nudges it towards me amicably. “I know this is a shock, but let’s clear our heads here. I insist.”\nI take the damned cigarette and light it. It does clear my head. I notice that ArCa is staring at me with unblinking eyes, absorbing my behavior.\n“So,” Oksana begins with accusation masqueraded as nonchalance, lighting her cigarette, “what brings you here all the long way from Phobos?”\n“Well,” Galina purses her carmine lips and crosses her legs, straightens her skirt, “surely you are aware what a competitive business cargo shipping has become these days. The profit margin we have been operating with for the last several quarters is severely challenged by new competitors on the market. In order to secure our business, we must explore new channels, establish new, currently non-existing trade routes.”\nShe is regal. Confident. She has all of Annushka and none of me in her, right down to the pinched nose and green eyes.\nAkchurin flicks the ash from his cigarette and grins. “Precisely this entrepreneurial spirit is what sets Galina apart from the rest. This is not a woman for mundane feats. Much like her father, I suppose.” I remain indifferent to the flattery.\nLazar squints at the man. “Just to be on the same page here, what you would call entrepreneurship is what we would call smuggling, is that not right?”\n“Oh dear—comrade Kostadinović, is it?—let’s not get ahead of ourselves like that now.” Akchurin waves away the smoke in front of his face. “How could it ever be smuggling if there is no border to speak of? Ha? We are all reasonable men and women here, we need not argue semantics.”\nLazar does not yield. “What you call semantics is what I call the law.”\n“I say you are an honorable man.” Akchurin raises his cup of coffee. “The Union could do with more men like you.”\n“Forgive me, Komandir, sir,” Lazar takes a long drag from his cigarette without looking at him, “but I say you are nothing more than a charlatan and a liar.”\nThe smile on Akchurin’s lips withers. “For the ‘charlatan’ part I will forgive you, but for the ‘liar’ I will not. I am nothing but honest when I say my interests lie solely with the success of the Phobos Shipping Company, of which the C-66 Morzh is a crown jewel, and its ferociously ambitious Direktor Akchurin, who I would follow to the Oort Cloud and back if she so requested. That is your truth. Take it as you will.”\n“A moment. Direktor Akchurin?” Oksana interjects, serving Galina one of her disapproving, maternal looks.\nGalina shrugs. “That is correct. I am freshly married.” It’s true. The ring is there, now that I check. “Not that father would know.” She looks at me, anticipating a reaction. I provide her with none. Our eyes remain locked.\nAkchurin begins: “I am sorry, Podpolkovnik Rubashkin, that this matter was not presented to you more sensibly—”\nI pay him no mind. I lean onto the table towards Galina. “You knew I would be on border patrol in this quadrant. None of this is an accident.” She does not look away. “You made sure I would find you so that you could use me to get across. This is how it is, am I wrong?”\n“You are not,” she says, perfectly composed.\n“Good. Now we are speaking directly.” I nod. “You are asking me to help you commit a criminal act.”\n“If I may, Komandir,” ArCa speaks up quietly for the first time, “it is not technically a criminal act, at least not by ISC law. There is nothing in trade law to allow this sort of transaction, but there is nothing to forbid it, either. I cannot speak for Sol Alliance, the trade recipient, but if both parties were to agree to trade individually, not as private companies, they could not be legally pursued.”\n“I may have doubted it before, but truly there appears to be reason in this robot!” Akchurin twirls his mustache. “If I could, I would offer you a drink, a cigarette. Forgive me, I am a poor host.”\n“Much appreciated nonetheless, Komandir Akchurin,” ArCa responds politely.\nI shake my head, unconvinced. “This is still perjury, Galina. You are a private company.”\n“That is for you to decide, Arkady,” she replies. “You are the officer who can provide me with a border pass.”\n“And then what?” I slap a palm on the table. “Who says your Alliance contact will honor their part of the agreement? Who says they won’t board you and commandeer your vessel? Kill you? You understand that you will have no legal protection out there?”\n“You speak as though you’ve never taken a risk in your life,” she raises her voice to match the volume of mine.\n“I have. But there was no one responsible but myself. You will not make me responsible for your risks as well.”\n“Grant me the pass,” she commands in the steely tone she could have only learned from me. “I’ve never asked anything of you.”\n“It’s not going to happen.”\n“Arkady.”\n“No.”\n“Father.”\n“No.”\n“Papa.”\n“Nyet, Galina.”\nThere’s a silence. I stare at my cigarette. Galina stares at me. Oksana looks like she is biting her tongue. Lazar stares at Akchurin, who is looking increasingly uncomfortable. ArCa is studying everyone in turn.\n“We are leaving,” I suddenly announce.\n“Of course you are,” Galina shoots back, her voice breaking in a way that made her embarrassed.\nThe silence is even more unbearable this time around. Nobody moves a muscle.\n“Speak with me alone, Arkady,” she tries again.\n“I won’t.”\n“Negative, Komandir,” ArCa announces. “You will speak with Direktor Akchurin.”\nGalina has a sad laugh. I open my mouth and find myself too exhausted to protest them both. I sigh.\nArCa rises and heads for the door, followed closely by Oksana, who gives my shoulder a squeeze in passing. The remaining men depart behind them. The door shuts.\nGalina and I are alone.\nThe deck has rotated so that the Lastochka is visible through the window, docked and dormant, covering the entire view. Her hull has a patchwork quality to it from all the different repairs over the years. Still, she is as charming as any vessel I have ever seen, sharp-nosed like a bird. The two-pronged Alcubierre drive generators which form the “swallow tail” she got her name after still glisten blue with dissipating ionization.\n“I cannot believe you still fly that toy,” Galina says with unexpected affection. “You are so easy to find.”\nShe takes a deep breath, straightens her spine, and stands up, bringing her cigarette with her. I watch her walk back to the glass wall. It takes me a while to stand myself up from the chair and limp up the steps beside her. She does not offer to assist me. I am glad for her that she doesn’t.\n“Does she always boss you around like that?” she asks, her eyes still on the rotating Lastochka.\nI scoff.\n“Just like Mama, then.”\nI say nothing.\n“And that Turkish woman, too,” she continues with a teasing note in her voice. “I’ve seen the way you look at her.”\n“Oh, what about you, Galina?” I sneer. “Akchurin? This is what you choose? That pretentious govniuk?”\nShe chuckles, finally baiting the reaction she was hoping for. “He is everything that you are not.”\n“And yet you still need me for this.”\nShe turns serious again and finally looks at me. “I don’t need you for you, Arkady. I need you for your robot.”\n“What?”\nShe rolls her eyes. “Do you not follow? ArCa can give me the legitimacy I need. Everything that she sees, she is broadcasting to the ISC. I can use this to control how this situation is presented to them before they even think about taking me to court. She has heard everything today and she can confirm that I am not doing anything explicitly illegal.”\nI rub the end of my mustache. “How did you even know I would bring her?”\nShe clicks her tongue. “You’re not the only one keeping eyes on me. I’ve been keeping eyes on you too. And I’m obviously better at it, since you haven’t even noticed.”\nI shake my head. “Why do this at all, Galina? Why couldn’t working like an honest citizen be enough?”\n“Why? You are asking me why?” Her eyebrows pull together in anger. “You have worked as an honest citizen, what do you have to show for it? A meager pension? A piece of shit spaceship?”\n“I have my dignity, Galina,” I scold her loudly. “We raised you better than that.”\n“You didn’t raise me,” she hisses. “And what’s your dignity worth when you answer to the ISC like a dog? How do they treat you, huh? How do they speak to you, tell me? There is nothing we can do to earn an ounce of respect.” Her voice breaks with pain. “We can never be anything but provincial, worthless savages in their eyes, whatever we accomplish. If I am successful at what I do, I will still only be second best. My success will be questioned, torn down. If I am a failure, I will only confirm what the world thinks it already knows. How can you tell me to settle for a future like this? How? To wake up one day missing a leg, my family dead and estranged?” She sniffs back a tear. “Never. Because I have my dignity, never.”\nA sudden urge to embrace her swells inside me, but I know she would hate me for it.\nI give her a moment to compose herself, to look out the window and drain away the tears that almost came.\n“I will do this for you, Galina,” I begin quietly, “under one condition.”\nShe says nothing, not to make a promise.\n“Don’t go alone. Let me come with you across the border.”\nShe crosses her arms self-protectively. “I don’t need you to.”\n“I know you don’t. It’s still my condition.”\nShe straightens her jacket and rolls up her sleeves, avoiding looking at me. “Thank you.”\n“You don’t have to thank me. You are my daughter.”\nShe walks away with her head down without a response.\n“You can still leave,” I reassure them. “You can wait for me in Union space, it will only be a couple hours.”\nLazar raises a hand to stop me. “Komandir Rubashkin, the Lastochka isn’t going anywhere without you. It isn’t debatable.”\nI nod pensively. “Thank you. I am proud to have you both in my command.”\n“We are proud to serve. That said,” Lazar stands up, “if I am to travel on this vessel, those niškoristi in charge of combat systems better let me ensure everything is calibrated up to par.”\nHe walks away and I sit into the nook next to Oksana. Together we watch the crew milling about the Morzhek’s control room, murmuring into microphones, shuffling through the projections on their holographic screens.\n“You know why I joined the Volchitse?” she asks.\n“Surely for the pension plan.”\nShe snorts. “Yes. But also because I wanted to be around people who do the things that must be done.” She puts her hand on mine and gives it a squeeze. “You did well, Arkady.” Before I have thought of anything to say, she stands up and stretches her long legs. “Now, I too am trained far too well to sit around idly. Surely someone here could use to have their Lorentz manifold recalculated.”\nShe leaves me. I sit alone until my attention is caught by the sound of stifled laughter. The sound becomes less and less suppressed as I climb the steps to the upper level of the bridge.\nGalina is laughing at something ArCa said, wiping a tear from the corner of her eye, entire body twitching with giggles. The last time I heard her laughing, her head had not even reached my elbow. The realization floods me with pain and joy both.\nShe sees me. “Arkady, have you really been hiding from this poor creature?” she asks, still laughing.\nI settle for an apologetic shrug.\n“That is the most pathetic thing I have ever heard. She is entirely adorable. I cannot even imagine what that must have looked like. ArCa and Arkady, like a cartoon duo.” She wipes a tear with her sleeve. I smile briefly.\n“Oh dear,” ArCa studies my face. “This is the first time I’ve recorded Komandir Rubashkin smiling.”\n“Do you intend to point it out every time I do?” I ask.\n“Depends. Is it counterproductive?”\n“Very.”\n“Then no, Komandir.”\nGalina sighs. “Arkady, you are truly out of touch. AI isn’t what it used to be. It’s not a scare anymore. The ISC has done wonders with it. Perhaps it wouldn’t hurt to get to know ArCa a little better. She is a person in her own way.”\n“She is indeed . . . ” My mustache twitches. “ . . . something.”\n“Something worthy of respect, at the least,” she continues. “I’d say she’s inherited the best from us. She learns, she grows, she thinks, she discovers. Perhaps she cannot duplicate the chemical emotions in our brains, but she is also free of other needs of the flesh. Greed. Envy. Fear. Selfishness. She has bypassed all these ugly byproducts of evolution.”\nI am surprised to find she feels so strongly about this. I am unsurprised to find I know nothing about her.\nArCa gives her a dimpled smile. “That is a beautiful sentiment, Direktor Akchurin. I can only hope to prove myself deserving of it.”\n“I would not be so modest if I were you, ArCa,” Galina pats her on the shoulder. “The future is yours. It is us who might have to prove ourselves to you.”\n“Dobryi den’ Union Command, this is C-66 Morzh, Komandir Nikolai Akchurin speaking.” He climbs onto the deck in full uniform, speaking into his earpiece, taking his place in front of the central control board. “I am transmitting our border clearance codes. Bal’shoye spasiba. Yes. Yes, we will. Give my regards to your lovely wife, Anatoly. Da svidaniya!” He taps his earpiece off and grins at us. “Marvelous! Just great. We are on course with three minutes to spare to rendezvous.”\n“Keep your Alcubierre charged just in case,” I warn.\n“Ah, Podpolkovnik, I must say again how honored I am to have you on board. You are a brilliant strategist,” he pats me on the back with a govniuk grin, “but, if I may allow myself to say so, not so much a businessman. How impolite would it be to appear as if we are impatient to leave? You do not come into a man’s home to negotiate a deal and keep your shoes and coat on, no. It is rude.”\n“Komandir, I do not feel like you are taking this seriously.”\n“It saddens me to hear that, Podpolkovnik. Rest assured, you may trust my salesmanship as well as I trust your military prowess.” He turns away to the control board again.\nMy mustache twitches.\n“Arkady, do not be difficult,” Galina scolds me, taking her place next to her husband. “This is not the Lastochka.”\nIt most certainly is not. I look over the control room below us and note that Oksana and Lazar are the only two people with military insignia among the crew of engineers.\n“Navigation, put the engines in idle,” Akchurin commands into his earpiece. “We are in position. All systems, await further instructions.”\nWe gaze out the large steel-reinforced window. There is nothing.\nI tap my fingers on my cane. Again. Still nothing. Again. Again.\nMy eyes have so adjusted to the stellar view that I can discern Pluto, just a faint light moving against the stationary background.\nI tap my fingers again. And again. And again.\nWith the abruptness of a blink, a Sol Alliance freighter exits superluminal drive right beside us. The Alcubierre ring dissipates around it, a swift ripple in the fabric of space.\n“There she is!” Akchurin exclaims. “Quite a beauty!”\nThe vessel matches the Morzh in size, but far surpasses it in terms of aesthetics. Its hull is sleek, streamlined, painted so dark that sunlight can be seen reflecting off its surface. The name K-14 Longma-Antarikṣa is inscribed portside right beside the Sol Alliance Rising Sun.\n“Hail them,” Galina says confidently.\n“Gladly,” Akchurin taps his earpiece. “Communications Specialist Smirnov, open channels for broadcast.” He clears his throat and switches to System Standard peppered with Russian. “Zdravstvuyte, Longma-Antarikṣa! Commander Nikolai Akchurin of the C-66 Morzh speaking. Good to have you in visual. Hope your travels have been safe.”\nWe watch the ship in the distance hovering indifferently for a long minute.\n“No response?” Galina asks.\n“Worry not, Galinochka,” Akchurin reassures her with unwavering confidence. “They’ve just hopped out of Alcubierre, undoubtedly they need a moment to gather their bearings.”\nShe crosses her arms. “Unprofessional.”\nStill nothing comes through.\n“Say, Komandir,” I begin, “you were worried about being impolite?”\n“You have a point, Podpolkovnik,” he says. “They are the ones being rude. No matter, it is all part of business. Sometimes one must tolerate a difficult client. I’m certain there will be no hard feelings involved.”\n“Hail them again,” Galina tugs his sleeve.\n“Smirnov, open broadcast,” he speaks into his earpiece. “Zdravstvuyte, Longma-Antarikṣa! Commander Akchurin speaking again. We have visual, but no sound. We are eager to hear from you. If you would be so kind, hail us at the first possible moment. Our channels are open and the frequencies have been forwarded to you.”\nSilence. Akchurin’s smile begins to fade with every passing second.\nThen, without warning, a shuttle detaches itself from the Longma-Antarikṣa’s underside and begins flying our way like a fat, slow bumblebee.\n“A-ha! There you have it, Podpolkovnik!” Akchurin gestures at the window. “They merely wanted to perform introductions face-to-face.” He taps his earpiece again. “Navigation, transmit docking coordinates to our guests.”\nI watch him grimly. “Komandir, I know this isn’t the Lastochka, but I wouldn’t be so eager to allow strangers aboard my vessel.”\n“Nonsense, Podpolkovnik,” Akchurin taps the keys on his control board. “Need I remind you that you are a stranger to me as well, yet you seem more than comfortable with indulging in my hospitality.”\nGalina stops me with an outstretched arm before I could argue. “Request identification,” she tells him. “And deploy armed men to greet them.”\n“My voice of reason, as always. This time I am already ahead of you, darling, not to worry.” He taps his earpiece. “Longma-Antarikṣa! C-66 Morzh speaking. We are pleased to welcome you to our humble vessel, but I am afraid protocol requires identification from all the crew members we are about to receive as our guests. Merely bureaucracy. Just a moment of your time, it needn’t be a pain. Looking forward to seeing you soon.”\nAs soon as he wraps it up, a chime sounds itself on the ship’s PA system.\n“C-66 Morzh, this is K-14 Longma-Antarikṣa,” a voice speaks in System Standard, her tone far more professional and level than Akchurin’s. He smiles at us triumphantly. “This is Commander Kuang speaking. Commander Akchurin, you are in direct violation of agreed-upon terms.”\nThe smile is wiped from his face.\n“What?” Galina snaps.\n“Commander Kuang, Commander Akchurin here,” he broadcasts back. “You must understand how distressed I am at your words. I promise you, I am doing nothing of the sort! I am a man of my word! Surely we can discuss whatever it is that I have done to gravely insult you, and I shall remedy it at once.”\n“Charge your Alcubierre,” I say, and I am ignored.\n“Commander Akchurin, the matter is entirely apparent and simple,” the Longma-Antarikṣa’s Commander responds curtly. “Were you accompanied into arbitration space by a Coalition military vessel?”\nAkchurin stammers, taps his earpiece. “The Lastochka? Come now, Commander, certainly you can see the state of that old garbage!” He chuckles nervously. “The crew of the Lastochka is here for amicable, family matters, entirely coincidental to our business here! Our interests are completely aligned, I assure you! You might as well pretend they do not exist!” He gulps hard after switching off the channel.\n“Commander Akchurin.” The voice in the PA grows impatient. “Were you or were you not accompanied by a Coalition military vessel?”\nAkchurin tries again, carefully. “Commander Kuang, comrade, there is no point in presenting this in such a binary light. There is, after all, far more nuance to life and its unexpected twists and turns, would you not agree? I am terribly embarrassed that I have the dreaded duty of explaining that this situation is not how it appears, and if I may invite you to—”\nA high-speed torpedo zooms out of Longma-Antarikṣa’s cannon, a silent shooting star one might have missed if they merely blinked.\n“Brace!” ArCa reacts before anyone else might have even formed the words with their lips, but it makes no difference.\nThe thunderous explosion of Alcubierre cores in the rear of the ship makes the Morzh groan with a whale-like song, the hull straining painfully, and then the floor of the deck is rushing upwards at my face, the entire ship capsizing from the impact, beginning to flip nose-up.\n“Thrusters! Correct!” Akchurin shouts, grabbing the control board to stay on his feet. “Correct for precession! Stabilize!” It’s little use. The engineers who weren’t strapped into their seats are sent flying backwards.\nThere’s a distant crunching sound as parts of the hull blow up and explode under their own pressure. My cane flies out of my hand and I grab the railing. The ship begins to nauseatingly spin lengthwise, too, rotating out of control. Galina is screaming, holding on beside me.\n“Thrusters!” Akchurin yells again.\n“Seal the airlocks, Akchurin!” I shout from the bottom of my lungs, remembering the incoming shuttle.\nAnd then the floor is no longer horizontal. Galina’s hands give out and she begins to fall backwards, screaming. Akchurin and I grab her both, each by an elbow.\nThe wave of static discharge from the destroyed Alcubierre cores floods the hull, overloading every circuit of every computer on the bridge and jolting me through the hand that was holding the railing. I am blasted away, spinning.\nI am woken by sirens, shouts, and cries. My eyes can barely discern the room in the dim red emergency lighting.\nArCa’s round white head appears directly in my sight.\n“Komandir? Komandir Rubashkin?” Her voice is urgent, but uncharacteristically calm compared to the anguished wails surrounding us. “Are you conscious?”\nI prop myself on my elbows and realize that I’m lying on the entirely opposite end of the bridge than I last remember, having been tumbled around by the centrifuge. The ship appears to be rotationally stabilized now.\n“Galina?” I grunt. “Where?”\n“Komandir, do not waste time, let me examine your eyes, you might have a concussion.”\nThere is no one else standing on the bridge. Several corpses lie sprawled on the floor, and several soon-to-be corpses sob under the weight of rubble. Chaos. A blazing inferno in the hallway. A cacophony of alarms on several decks of the ship.\nI struggle to sit myself up, pinned down by crushing gravity. “Oksana? Lazar? Where are they?”\n“Komandir, we need to run.” ArCa takes me by the forearm and tries to yank me up. “I need you to stand up and run.”\n“I cannot run, ArCa,” I tear myself away with frustration. “I cannot even stand. I need my cane.”\n“Negative, Komandir,” she says. “Look.”\nOnly then do I notice that she’s missing a leg.\nAnd only then do I see that her robotic calf is strapped and secured below my knee.\nI gently move my artificial limb and am overcome with a panicked, nauseated feeling of dysphoria. My breath leaves me in a whimper.\n“Focus, Komandir,” ArCa yanks me again, unyielding. “I know where they’ve taken Direktor Galina. But we must go, immediately. Let me help you.” She lets me grab on to her to pull myself up to my feet.\nI sway, barely stable, learning to walk for a second time.\n“Keep up, Komandir, quickly now!” She suddenly ignites her thrusters and pulls me along by the hand. I trip and scramble, knees shaking, but pure physical instinct keeps me upright.\nWe run past the fire and down into what’s left of the control room. Through the smoke, I make out the silhouette of Lazar hunched over an illuminated console, Oksana pacing at his side.\n“Oksana!” I shout. She twirls and puts me dead in the crosshairs of her sniper before realizing it’s me.\n“Arkady, şükürler olsun!” The relief on her face is immediately replaced with astonishment. She stares at my leg with open-mouthed disbelief.\nLazar looks up from his work and raises his eyebrows. “That is clever, ArCa, jebo me pas.”\n“They took Galina,” I say, panting. As ArCa comes to a halt, I find that standing is far more challenging than running and I collapse. ArCa puts my arm around herself and props me up.\n“Arkady, you’re . . . ” Oksana stammers, then decides to recompose herself. “Yes, they took her and Akchurin. I don’t think they’ll kill them, inshallah. They probably intend to ransom them.”\nA very loud and very nearby dying scream makes all three of us flinch.\n“Lazar, what are you doing?” I ask. “There’s no time.”\n“I know, Komandir,” he says without looking up, “I’m routing remaining power to shield the Lastochka. The Morzh is gone.”\n“Do so,” I say. “Where is Galina, ArCa?”\n“The Longma-Antarikṣa shuttle is still docked. That is where they’ll be taking her and Komandir Akchurin. We may still intercept them if we hurry.”\n“Lazar!” I call loudly.\n“Yes, yes, Komandir, right away!” He slaps the confirmation button with his palm and backs away. “Eto ga. Done.”\n“Which way?” Oksana asks, repeating her rifle.\n“Follow!” ArCa fires her thrusters and pulls me into a run again. “I’ve downloaded C-66 class blueprints from ISC databases. I can take you.”\nWe sprint down maze-like corridors, past red rotating lights, our shadows sliding across the walls, rising behind us in one moment and sinking in front of us in the next. Thick gray clouds of smoke drain into the spinning ventilation fans in the ceiling.\nMy ears are overwhelmed with sound, the rhythmic thumping of our boots and the labored wheezing of our breaths, overlaid on the persistent alarm klaxon and the hissing of ArCa’s thrusters. After a while, I begin to stumble and Lazar offers me his shoulder, half-carrying me.\n“Shhh, shhh,” ArCa suddenly puts a finger over her lips. “We’re close.” She lets go of my hand and hovers to the corner, leaning out of cover to check. Lazar and I slump with our backs against the wall. Oksana folds over to catch her breath, hands on knees.\n“They’re not here yet,” ArCa whispers. “They’ll bring them over any minute.”\nWe peer around the corner to see a soldier in full armor in front of the open airlock, rifle ready, looking impatient. There are several more inside the shuttle, waiting, their scaly exoskeletons glistening.\n“You got a weapon, Arkady?” Oksana asks, wiping away the strands of hair stuck to her forehead.\n“No. I lost it.”\nShe cusses disgustingly through her teeth and paces away, hands on head.\n“Lazar?” I glance at him hopefully. He shakes his head, panting. I cuss as well.\n“We have Voentekhnik Çetinkaya’s sniper, correct?” ArCa whispers.\nOksana’s lips curve downwards with despair. “Yes. But it broke when I fell on it.” She holds out the rifle; there’s a shard of broken glass in the tube where the scope used to be. A wide crack in the casing exposes the mechanical insides of the rifle.\n“You can still fire it,” I say, grasping at straws.\nShe scoffs. “What good is it if I cannot aim? We only have one shot at this.”\n“Voeninzhener Kostadinović, you are trained for field repairs, no?” ArCa asks.\nHe sighs and takes the rifle, looks it over. “Yes, but it makes no difference. I don’t have the parts.”\nArCa looks at him for a moment, calculating. “Give me your knife.” He eyes her suspiciously. “Give me your knife, there’s no time.”\nHe hands her the knife and, without blinking or hesitation, she jimmies the tip of it under her eyeball. We watch in horror as she twists the blade one way then the other, emotionless like she was trying to pry the lid open on a jar of kompot.\nThe plastic mask on her face cracks and the eyeball pops out together with the cables, rolls on the floor towards Lazar. We all suck a breath through our teeth.\n“Will this do, Voeninzhener?” she asks, indifferent to the hole in her head. “You know what to do?”\nLazar gulps and plucks the eyeball with two fingers. “Your thrusters. I’m going to need to use them.”\n“Absolutely.”\n“Go on then, Lazar, quickly,” Oksana hisses, checking around the corner.\n“Dobro, dobro,” Lazar groans, wiping his sweat-drenched face with a palm. He swiftly unzips the tool pouch on his belt and spills out a mess of screws, bolts, small L-shaped screwdrivers. He picks through them with impatient, shaking fingers, muttering to himself in Serbian, until he finally finds the spool of soldering wire.\n“Breathe, Voeninzhener Kostadinović,” ArCa reminds him. “Focus. You are doing well.”\nLazar laughs her words off quite neurotically. He takes the eyeball and puts it inside a pair of pliers, cracking it open to pry out the lens, careful not to leave any fingerprints. He secures the rifle between his knees, propping the butt of it against his chest, and begins placing the lens into the ocular tube. His shaking hand slips and the lens falls into his lap.\n“Jebem ti seme i pleme,” he curses, and then in the same breath: “Give me the fire.”\nArCa fires a thruster from the back of her forearm, and Lazar begins to solder. At the same time, he begins to recite a prayer.\n“Arkady!” Oksana calls through her teeth. “They’re here.”\nI crawl to the corner and look; two soldiers bring Galina and Akchurin in front of the airlock and make them kneel, hands behind head. Galina is sobbing.\n“Lazar, be done with it,” I command. He prays louder to drown my voice out, uninterrupted.\nThe new-coming soldiers argue with the one who has been waiting for them, persuading him to bring Galina and Akchurin aboard the shuttle. The conversation is unintelligible over the sirens.\n“ . . . Jer je tvoje carstvo, i sila, i slava u vekove vekova. Amin. Done, Oksana.” Lazar crosses himself and lets her snatch the rifle from his hand. He lets out a breath of relief.\n“There are three of them, Arkady,” Oksana says gravely. “I can only fire twice before I have to repeat the rifle. After that, it’s up to them.”\n“Negative, Voentekhnik,” ArCa interjects. “I can help. Take the shot.”\n“Go,” I command.\nOksana rolls out of the corner and kneels, fires two shots in rapid succession. The two men behind Galina and Akchurin fall dead, their heads spraying blood. Not a heartbeat later, ArCa flies into the remaining soldier at full thrust, tackling him off his feet.\nGalina screams. Akchurin does not waste a moment, throwing himself at the man and wrestling the rifle from his hands. The soldiers in the shuttle shout in Punjabi, panicked. Akchurin viciously smashes the butt of the rifle through the fallen soldier’s visor.\nThe airlock door shuts and the corridor rumbles with the sound of the shuttle’s engines revving for departure.\nGalina scrambles to her husband on all fours, crying. “ArCa! ArCa! Where is Arkady?”\n“Galina!” I shout. Oksana pulls me up by the elbow and rushes towards the airlock.\n“Papa!” My daughter’s face twists with sobs. She runs to me, barefooted, and wraps her arms around my neck.\n“We need to get to the Lastochka, Arkady, right now,” Oksana says in my ear.\n“Through the airlock, everyone, quickly!” Akchurin beckons us and begins to swing open the locker doors, grabbing EVA suits and throwing one at each of us. “Galina, come here, let me outfit you.”\nWe pour inside the airlock and the door shuts behind us. Oksana hands me over to ArCa, who is holding the baggy suit open for me. I put my legs in one at a time and hold on to the wall for balance while she does the sleeves and the front zipper.\nThe alarms shift to a sudden crescendo, signaling imminent danger.\nI exchange a grave look with my crew. The deck we are on is about to blow.\n“What does this mean, Nikolai?” Galina sobs. He zips her up and takes her face between his palms.\n“Go with Podpolkovnik Arkady, Galina,” he says. “Do not look back until you have reached the Lastochka.”\nShe looks at him and realizes he is not wearing a suit. She gasps, red eyes bulging.\n“We must decompress, Komandir,” Lazar warns impatiently, his hand on the switch.\nGalina pushes Akchurin aside and begins to rifle through the lockers one after the other, finding them all empty.\nThere are only four EVA suits in the airlock.\n“Put your helmet on, Galina,” Akchurin commands. Galina swats it away, screaming.\n“We must decompress!” Lazar yells, red in the face.\n“Galina, helmet!” I shout sternly and grab her by the wrists, restraining her long enough for Akchurin to lock the helmet in place. She wails, muted, breath fogging the glass.\nArCa puts my helmet on from behind me, and the universe loses all sound. I hear only my breathing as I watch Akchurin move towards the airlock control board. ArCa unspools a heavy-duty rope from the wall and clasps us all together by the waists of our suits. Galina struggles; I embrace her tight so that she can not run.\nAkchurin unseals the airlock and all the air in the room explodes outwards, expelling us violently into weightlessness.\nFor three seconds I am spinning wildly, holding on to Galina, with no notion of up or down or left or right.\nAnd then the rope at my waist reaches its full length and snaps from the violent tension. I see the Morzh flying away from me, spinning, soundless explosions blooming from its hull. Oksana and Lazar, two figurines in suits, hands helplessly outstretched towards me, grow smaller and smaller.\nI grab Galina by the helmet and make her look at me, glass visors touching. She is screaming, but no sound is coming out. The tears are pooling in her eyes with no gravity to drain them away.\nI tell her not to be afraid. I tell her I love her. I know she cannot hear me. I say it anyway.\nAnd then my belt forcefully digs into my stomach, like a seatbelt after a violent halt. Galina almost slips from my hands.\nI turn around and find ArCa, one-eyed, one-legged, gripping the waist of my suit, thrusters engaged in full. Suddenly the Morzh is no longer flying away from us, but towards us.\nMy breath leaves me in spasms. I embrace Galina tight as we accelerate towards the Lastochka, docked to the dying colossus in a cloud of its warped metal debris.\nArCa flings us into the airlock and closes the door. The small space repressurizes within seconds.\nI throw my helmet off and then Galina’s. Finally her cries spill out.\n“Nikolai! Papa, how could you!” She smacks me on the chest with an angry fist, weeping. “How could you let him do this, Papa!”\n“Listen to me, Galina,” I grab her chin with my hand. “We are not safe yet. Come with me, quickly.” I push off through the airlock door, pulling her with me.\nWe bump into Lazar, still in his suit. “Komandir Rubashkin!” He looks at ArCa, incredulous. “Bog blagoslovi, robot.”\n“Arkady!” Oksana shouts in shock over the pilot’s seat. There are tears in her eyes.\nAnother piece of the Morzh’s hull explodes, rattling Lastochka’s entire frame.\n“Strap the fuck in!” Oksana yells, turning back to her screens. “Strap in, now!”\n“Come on, Galina,” I yank her by the hand. She bumps into one wall of the corridor and then the other, flailing, unaccustomed to weightless motion.\n“Let me help you, Direktor Akchurin,” ArCa takes her around the waist and engages her thrusters, guiding her to the seat on the wall. Galina sobs even harder at the mention of Akchurin’s name.\n“Routing power to Alcubierre drives,” Oksana announces, breathless. “Specifying metric parameters.”\n“Faster, Oksana!” Lazar yells, strapping in.\n“It doesn’t go any faster!” she snaps.\nI strap myself in next to Galina and check her latches together with ArCa.\n“Calculating hypersurface foliation,” Oksana swipes through the projections, hands shaking, fingers twitching. “Still calculating. Still calculating. At yarrağı, still calculating!” She sinks her face in her hands and shouts with frustration.\n“Calmly, Çetinkaya,” I command. “You will make it.”\n“Negative, Komandir,” ArCa chimes, hovering in front of me.\n“What?”\n“Negative,” she repeats solemnly, staring at me with her one remaining unblinking eye. “She will not. I am occupying too much processing power. I must shut down.”\nI open my mouth, close it. Open it again. Nothing comes out.\nA crack opens in the Morzh’s hull right in front of our front window, at first just a little, and then begins to spread uncontrollably across the entire length of the vessel, growing thicker and thicker, the ship’s atmosphere escaping in tongues of flame.\n“Forgive me for not fulfilling my pre-programmed purpose as your Caretaker, Komandir Rubashkin,” ArCa says. “We never did get around to speaking about you.”\nThe little light inside her eye extinguishes like a blown-out candle flame.\n“We have it!” Oksana yells, flipping all the switches. “Alcubierre in three!”\nThe rotating deck of the Morzh splits in half without a sound. The ship’s skeleton is exposed, smoldering red.\n“Two!”\nA final belch of exploded gas rises from its insides and engulfs us in blinding light.\n“One!”\nOksana cranks the lever and I feel my guts sticking to my spine as the Lastochka lurches forward. ArCa’s unstrapped body is propelled backwards into the corridor and I hear it smash into a wall.\n“ArCa!” I find myself yelling.\nWe breach light speed, but then all the alarms go off, deafening.\n“Ring’s not stable!” Oksana slaps away the angry pop-ups. “Alcubierre collapsing! Hold on to your—”\nThe drive core discharges, rebooting all systems and switching off all the lights. I grab Galina’s hand before the Lastochka abruptly snaps back to non-relativistic velocity and begins to nauseatingly tumble about its axis through the empty, starry abyss.\n“Correcting for precession,” Oksana announces before setting off the ship’s thruster, stabilizing us back to rectilinear motion.\nWe all sit in silence, lungs heaving for air.\nOksana slips out of her gloves and lies her head on her crossed arms.\nFrom the darkness of the cockpit, the Lastochka’s hull appears to glow dull orange.\n“Bravo, Oksana,” I say, my voice trembling with awe. “No one else could do the things you do. I don’t say that nearly enough.”\n“You don’t need to, Arkady,” she says, her voice muffled.\nGalina’s sweaty hand still holds mine. I caress it with my thumb and give her an inquisitive look. She leans her head tiredly against my arm.\n“Komandir Arkady,” Lazar begins quietly, looking outside. “You should know.” He exhales. “I am retiring.”\n“You are not, oğlan,” Oksana says.\n“Then I am going to need an ArCa of my own after this.”\nArCa.\nI unstrap myself urgently, shed my suit, and propel myself through the hallway.\n“ArCa?” I call. She is nowhere to be found. “ArCa!”\nI check the open chambers. Check the corridors.\nI find her unit floating in the common room.\n“ArCa, no,” I rush to her, taking stock of the terrible angles of her joints, the chewed-up and fire-singed state of her plates. “No, no, no, no, no.” I cradle her in my arms; she is so light. So small.\n“Papa.” It’s Galina in the doorway, face devastated by tears. I turn my face away from her, but she pushes off towards me and embraces me from the back, lays her face on my shoulder.\nI begin to weep, the way I never did for Annushka and Vitaly, who she could never bring back to me, together with my Galinochka, who she brought me back to.\nI used to hide from her.\nShe used to follow me.\nMy little shadow.\nI look at her limb, which is now my own, and I find that I am as complete as I will ever be.\nDora Klindžić is a writer, journalist and astrophysicist (not necessarily in that order) hailing from the Republic of Croatia. Her nonfiction has been featured on gender and media culture websites, and her speculative fiction reached the finals in the 2017 SCI-FI-LONDON 48 Hour Flash Fiction Challenge. This is her first publication. She is currently employed in the Netherlands, writing a thesis on deep-space tracking of spacecraft using methods of astronomical radio interferometry. When she's not building rockets, she's building worlds."}