{"fingerprint": "SJVH/v4UOjz9H7MdHYLL18u4nNc=", "sitename": "Clarkesworld Magazine", "title": "Interchange by Gary Kloster", "author": "Gary Kloster", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kloster_01_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Interchange by Gary Kloster", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11920 words, novelette\nInterchange\nLucy woke up, crying.\nThe bed stirred, and warm skin pressed against her back. An arm wrapped around her, its familiar touch comforting.\n“What do you need?” he asked.\nNothing. The word vibrated on her lips, the rest of the sentence queued up neatly behind it—just a dream. But the words wouldn’t come out. They were blocked by the sudden, bitter remembrance of where she was, and why, and that knowledge took her words and replaced them with fresh tears.\nThis is my trailer. This is the work site. In a few hours, the sun will rise and then the world will finally go away.\nMost of it.\nSix months in limbo, free of the sympathy and cloying closeness of friends and relatives. Six months free of their judgment, to be as alone as she could be so that she could face the brutal truth of what had happened.\nSamuel. Samuel had—\nSamuel’s dead.\n“Nothing,” she said, finally, forcing the word out through her tears. “Go to sleep.”\nEver obedient, Sammy relaxed, and she could feel his breathing even, smoothing into a rhythm that was so familiar. Alone now in the silent room, Lucy curled into the embrace of her dead husband and wept.\n“Ten. Nine. Eight.” Russ the tech stood in the middle of the highway, reading the numbers out as they flashed across the clock that hung on the side of the contractor’s trailer. The workers stood before him, bored and hung over, jaded by previous tours of limbo. The few virgins in the crowd tried to fake their own indifference, but Lucy caught them looking up at the sky with her.\n“Two. One.” Russ raised a hand and opened it, stretching his fingers out. “Boom.”\nNo noise, no light, no twist of the sensitive follicles in her inner ear informed Lucy of the change. Only the sky above altered, its shining blue fading to a dull, listless gray. It became a slate colored hemisphere that arced over her, the workers, the cluster of trailers, the construction equipment, and the whole highway interchange, a circle that stretched almost a full kilometer. The bright, clear blue of the morning was gone, lost now in a fog thick as mud.\nA crow started from the long grass behind one of the dormitory trailers. Lucy watched it flap up, flying confused into the colorless sky, skirting the nothing that now bounded their little world. They had stepped out of time, and were trapped now in their own tiny purgatory.\n“Okay people, it’s limbo time.” Tate, the project manager, didn’t shout, but his words carried over the crowd. He pointed one thick finger at the clock, where the green of Russ’ countdown had been replaced by a long stretch of red numerals ticking down the time they had left. “In six months we rejoin the real world, and if this interstate doesn’t have a shiny new auto-drive compliant interchange, none of us gets paid. So get your asses in gear.”\nThe crowd broke, workers scattering toward equipment or trailers. One group of began to sing as they walked—“You load sixteen tons, and what do you get, six months older and divorced I bet . . . ”\nThe rest of the words were lost to the high whine of the big electric engines, and Lucy let her eyes slip from the drifting black silhouette of the crow to the man who had stopped next to the bright red-cross sign that stood before her trailer.\n“Don’t let it worry you, Doc.” Russ waved at the blank sky. “It’s just nothing. You get used to it.”\nLucy reached back and found the door handle, but she nodded before she traded his smooth smile for the welcome solitude of her trailer.\n“I already am.”\n“The stars are not wanted now, put out every one / Pack up the moon and dismantle the sun / Pour away the ocean and sweep up the wood / For nothing now can ever come to any go—”\nThe knock—Pop! Pop! Pop!—broke the smooth flow of Sammy’s recitation. The trailer fell silent except for the soft purr of the medical equipment and the distant rumble of bulldozers. At her desk, Lucy opened her eyes, the blessed, fragile trance of not-thinking gone, and glared at the door.\nIn his chair on the other side of the room, Sammy looked up at her, waiting for her command.\n“Go—” she started to say, but her door was already being opened. Russ stepped out of the flat gray light of limbo, and the words—to our room fell apart in Lucy’s mouth. Instead she made a quick cutting gesture, and Sammy obediently folded his hands and bowed his head, silent.\n“Hey, Doc.” Russ grinned at her, eyes flashing just for an instant over at Sammy then back. “You open?”\n“Twenty-four seven,” she answered, flatly.\n“184. Well, 179 now,” the tech said, nodding towards the merciless clock that hung off Tate’s trailer, ticking away the days. “But who’s counting?”\nThe tech kept smiling, but he hesitated in the door, caught for a moment in the strong current of go away that Lucy was pushing at him. But he shoved through it and entered her space, taking the chair across the desk from her. “So,” he started, then left the word hanging.\nLucy looked down at her desk, at the neat ranks of pills that she had been slowly inventorying. The tiny green capsules contained a potent narcotic that could silence any nocioreceptor. Five. A simple calculation, based on the number of milligrams per pill and her estimation of Russ’ bodyweight. Shove five of these down Russ’ throat, and she wouldn’t have to have this conversation.\nOr she could just swallow four. That would work too.\nWith a sigh, Lucy swept the nine pills her fingers had sorted out of the pile back into the bottle and snapped the cover shut.\n“So,” she said, hating this game so much, and hating the man who was making her play it.\nRuss lounged in her hostility, ignoring the wall of ice she was trying to build between them. “This is your first time in limbo, right?” He leaned back in the chair, propped his feet on the edge of her desk, pushing deeper into her space. Pressing her rejection, to see if it would sharpen, or break. “It’s my fifth. It’s not so bad, y’know. For skilled support like us, it’s pretty relaxing.” His eyes wandered her desk, taking in its sterile blankness. “Maybe a little boring.”\n“I’m afraid I can’t help you with that,” Lucy said, folding her arms, placing them like armor over her body. Russ lifted his eyes to watch her move, and she saw his smile shift, twisting away from simplistic seduction to something sharper. He had given up before really even trying, and now he just stared at her tits and shrugged.\n“Really? That’s too bad.” His eyes crawled up to meet hers, and he looked like he was trying to be funny but his thwarted hostility was too close to the surface not to see. “Once, me and one of the other docs, we entertained each other through these long, gray days.” Russ tilted his head and stared over at Sammy, sitting silent in his chair like a dropped marionette. “But I guess you brought your own entertainment.”\n“Do you have a medical complaint?” Lucy’s anger made her voice crisp. “If not—”\n“That’s smart.” Russ shifted in his seat, pressing deeper into the cushions of the chair. “The fuck bots in the rec trailer, they’re top of the line, but the wait list can get awful long. That’s why people end up resorting to each other, even though that always ends up in drama. Course, drama . . . ” Russ looked over at Sammy, staring openly this time. “Some people think that’s a good way to keep from getting bored too.” He shrugged and shook his head, as if such thoughts were incomprehensible. “So how much did this fellow set you back? Custom units are pricey, and he looks just like—”\n“Out.” Lucy’s voice wasn’t crisp now, it was sharp as a broken mirror, silver razor shards that covered a bathroom floor stippled with blood. “Go. Now.”\nRuss stood, his small smile sadistic and satisfied. He hadn’t gotten to fuck her, but he’d fucked with her, and that seemed to satisfy him. “Right, Doc. Not something you want to talk about.” He went to the door, put his hand on the handle and paused.\nOf course there would be one last line, a final dig. Maybe he’d practiced a few on the way over, maybe this would be his best, carefully chosen to cut. Lucy’s hands held tight to the arms of her chair, and she tried to forget that she knew where all the scalpels were.\n“Got to tell you though, Doc, it seems a little weird, doesn’t it? Keeping a sex bot that looks just like the man you killed?”\n“Out,” Lucy said again, and Russ went, disappearing into the flat gray light of limbo, leaving her alone.\nBut not alone enough.\nNever alone enough.\n“Sammy,” she said, and he looked up, his so-familiar features returning to life. Although they had never looked that peaceful in life, had they? Samuel had never had that kind of serenity, even in his sleep.\nEven in death.\n“What do you need?” he asked, his voice so calm.\n“Read that one again.”\nThe crow circled over the trailers, the black cross of its body the only mark on the oblivion sky. Lucy sprawled across her bed, a doll of knotted rags, and stared at it through her window. Usually, the crow stayed low, tapping across the trailer roofs, riding the tops of the slower equipment, or hopping through the dust, caging scraps of food from the workers. Now though, it drifted high above them all, risking a crash into the invisible dome of the temporal bubble that trapped it in limbo with them.\nWas it bored? Confused? Lonely? Was it searching for more of its raucous, squabbling kind?\nOr did it feel safer, freer, as a murder of one?\nOutside a chime rang and the low hum of engines and the clank of moving steel got quieter. Lunch break, and the crow folded its wings and dropped, diving for the picnic tables that surrounded the mess hall.\nLucy closed her eyes and sighed, and the hands that had been patiently working over her feet paused their soothing movement.\n“It’s okay, Sammy,” she whispered, not bothering to open her eyes. “You can—”\nSomewhere outside the trailer there was a pop, a snap of sound like a gun firing in a confined space, and Lucy’s eyes flew open. Through her window she saw the gray sky flicker. For a moment it was black, then blue, then black, then bright and then a blur, and her stomach was twisting and she was digging her fingers deep into the soft foam pad of her bed, clinging to it because her body was convinced it was falling, plummeting and spinning as the sky strobed overhead, switching light and dark and blue and black and—\nThen it was gray again, and Lucy was just lying on the bed, not falling, and her hand shot out to grab Sammy’s, clutching it tight as a terrified child.\n“What the fuck was that?”\n“I don’t know,” Sammy said. His voice was as even as always, his green eyes clear and calm. He gripped her hand back, firm and comforting. “What do you need? Should I keep rubbing your feet?”\nOutside, an alarm kicked on, low and whooping.\n“No,” Lucy said, pulling her hand free and sitting up. “Find my shoes.”\n“I’m sorry, Maggie, but I want this small.” Tate stood in the door of the contractor’s trailer, blocking out the stocky woman and the crowd of workers who stood behind her. “I’ll brief you after.”\nMaggie Wu, the site’s union rep, shoved back her shock of pink-dyed hair and glared at Lucy. “You got enough room for the Doc in there. She’s not hard-tech. Why—”\n“Dr. Botha has a bachelors degree in electrical engineering,” Tate said.\n“Yeah, and I have a tech degree in electrical systems, and—”\n“And you’ll use it to go figure out why that fuel cell blew, okay?” Tate looked past her at the crowd of workers clustered around the trailer. “Whatever happened, it’s done, and we’re safe. All systems are reading good, and the other fuel cells check out. This is just us trying to figure out a glitch, okay? So please, get back to work, there’s nothing else you can do and we’re still on the clock. When we figure out what happened, we’ll let you know.”\n“We know what happened,” someone shouted out of the crowd. “Russ is spending so much time fucking the robots in the rec trailer, he forgot to maintain his system!”\n“Yeah, that’s the kind of shit we don’t need in here,” Tate snapped. “Get. Back. To. Work. Or kiss this month’s bonuses goodbye.”\nMaggie shook her head in disgust, but she jerked her head and the crowd behind her began to disperse. “We’re going to have a long talk after this, Tate,” she growled, then turned and stalked off, heading towards the fuel cells.\nAcross the room from Lucy, Russ shifted, his face mottled red and white with anger and the remnants of panic. “Which one of those assholes said that?”\n“It doesn’t matter,” Tate said.\n“It doesn’t—” Russ spluttered.\n“Matter,” Tate snapped. The manager dropped into a chair, glaring at Russ. “Where were you, when that fuel cell blew?”\nRuss shut his mouth and looked away from Tate, his hand curling into a fist.\n“Yeah, thought so. Where you always are. I’ve been getting complaints about you, hogging the conjugal bots.”\n“I stick to the schedules, just like everyone else,” Russ said.\n“Don’t you maintain the system that controls those schedules?” Lucy didn’t want the argument, but she couldn’t keep from getting a kick in at Russ while he was down.\n“What, are you accusing me of something?” Russ snarled. “You’re the one that brought your own personal—”\n“Shit, enough,” Tate said. “I’m sorry I said anything. This meeting is about what just happened. So lets keep our focus just on that. Okay?”\nRuss stared at Lucy, his eyes bright with something like hate, but he pushed himself back, trying to look like he was relaxing instead of sulking. “Okay,” he said.\nLucy just nodded.\n“Okay,” Tate said. “What the hell happened?”\nThe anger in Russ’ face faded, replaced by frustration edged in fear. “I’m not sure.” He reached over and plucked a slate out of the rack, and its screen lit up. His fingers danced across the surface, pulling up data streams. “When that fuel cell blew, it caused a surge, which tripped a fail-safe in the temporal system. From what I can figure so far, the control computer was presented with conflicting information—that there was an emergency, and it should take us out of limbo, and that everything was fine, keep us in. So for 3.6 seconds, it tried to do both before it settled on staying.”\n“So it started to drop us back into the normal time stream, but didn’t?” Tate said.\n“Well . . . ” Russ hedged.\n“The sky flickered.” Lucy made herself look at Russ. “When did it try to bring us back to?”\n“I’m not sure,” Russ said.\n“Wait,” Tate said. “What does that mean? When the system pops us out of limbo, early or otherwise, we just appear right when we left. Right?”\n“It’s supposed to,” Russ said. “But this time . . . It’s like we came loose for a few seconds, and the system kind of lost track of where we came from and was just trying to shove us back into the time stream whenever.”\n“Wait.” Tate shook his head. “Time travel’s impossible.”\n“Kind of,” Russ said. He slumped in his chair, his earlier hostility gone, dissolved into helpless frustration. “The past is closed, but you can go into the future.”\n“Then why don’t people do that?” Tate asked.\n“We all do, all the time. That’s life,” Russ said. “With a temporal system, you can just go a lot further if you want. You just can’t travel back. When we come back from limbo, we come back a microsecond into the future. But we can’t go backwards.”\n“Wait.”\nLucy watched Tate, saw the awareness of the situation ripple through his features.\n“We almost came back to some point in the future—”\n“Almost a dozen,” Russ said.\n“And if we had, we would have been trapped there.” Tate blinked at Russ. “How far in the future?”\n“I don’t know. A few days. A few years. A few million years?” Russ shrugged. “It could have been any of them.”\n“Damn,” Tate said softly. “But we’re okay now?”\n“System says we’re good,” Russ said.\n“And this won’t happen again?”\n“It shouldn’t have happened in the first place.” Russ shook his head, staring down at his data. “I’ll look this over and rewrite the fail-safes, make sure it can’t happen again. I’ve got no interest in being Morlock chow.”\nTate blinked in confusion at that last bit, but he got the gist of it. “Good. Do that, and you can keep one of the conjugal bots in your trailer for all I care.”\nRuss shot Lucy a look, which she ignored. “I’ll get to work,” he said. “We’ll get back safe and on time, just like always. Just make sure that Maggie keeps the rest of the fuel-cells running.”\n“Yeah, I’ll mention it to her when we talk,” Tate said. “Now—”\n“We’re not done,” Lucy said. She looked at Tate, ignored Russ.\n“What?” Tate said.\n“The sky flickered,” Lucy said.\n“Yeah, I explained that,” Russ said. “Weren’t you listening?”\n“I was listening when you said that traveling back in time was impossible. That once you had gone to the future, you were trapped there. We touched the future for long enough to see the sky change. Photons came through.”\n“Photons?” Russ said.\n“More than that,” Lucy nodded toward the window. “I smelled things coming over. Grass, water, other things. Things I haven’t smelled in weeks. The air in this bubble has had a month to get stale, but it doesn’t smell stale now. Air came through too.”\n“Air, photons. Whatever,” Russ threw up his hands. “I don’t know. Maybe there’s a size limit on time travel. Maybe little things can move back. Or maybe because we were separate from time, we could carry things—fuck I don’t know. I’m not a physicist, I’m a tech. I just know that the system says were okay now.”\n“So maybe we are. It’s not my job to worry about that.” Lucy said.\n“No. You’re a doctor.” Tate frowned. “You’re worried about what might have been in the air.”\n“Bacteria. Viruses.” Lucy took a deep breath. “There are billions of them, in every breath we take. How many of the ones that we are breathing in now are from some future time?”\n“Would they be dangerous?” Russ said, his eyes wide, his breathing shallow.\n“I don’t know,” Lucy said, purposefully echoing Russ. “Probably not. But I don’t know.”\n“Fuck,” Tate said, echoing himself. “How do you find out?”\n“I’ll run tests, on the air and on us. Mostly though, we’ll just have to watch and wait. Our bodies will let us know.”\n“Our bodies will let us know.” Tate barked a short, utterly humorless laugh. “I’m glad I kicked Maggie out. Shit like this could start a panic.”\n“Yeah, and she would demand higher bonuses too,” Russ said. His smile was thin and sickly.\n“She would,” Tate said, not smiling at all. “Okay, go. Do what you can. Meanwhile, I’ve got to make sure that this doesn’t set us back. If I’m going to get almost stranded in the future, then spend months worrying if my hemorrhoids are some Sci-Fi super flu that’s eating my ass, I’m going to get paid.”\n“Doc, we need you!”\nMaggie had jerked open Lucy’s door just long enough to yell that at her, then she was gone, the door left hanging open behind her. Lucy blinked up from her growth plates, staring out at dirt and dead grass and gray sky, then her feet were slamming down into her shoes and she was grabbing her go kit and running, moving as fast as she had when she had been a resident doing her rotation in the ER.\nShe ran through the trailers and out into the site, past heaps of broken cement and tangles of rusted rebar, around the hulking yellow construction bots, silent and motionless now, their controllers clustered in a knot in the tall brown grass that covered the triangle between onramps. Maggie bulled through the crowd and Lucy moved in her wake, reaching the man who lay sprawled on the ground.\nIt was Devon, maybe, not that Lucy had ever cared much for anyone’s name here, but with just sixty of them the information accumulated. She hit her knees on the weeds beside him, pulling out her diagnostic and taking him in. His skin, usually a few shades darker than hers, had gone gray and he was trembling and sweating. Shocky, she thought, slapping a diagnostic strip to the skin of his neck.\n“What happened?” she asked, watching as the data from the strip streamed across the screen of her diagnostic.\n“Snake bite.” The man who said it was standing beside Devon, a shovel held in his hands. He pointed down at the ground, and Lucy could see the slim green and yellow corpse coiled in the grass. It was a little thing, half a meter long maybe and not much thicker than her thumb, and the blade of the shovel was shoved through it, splitting the body in half.\n“Where?” she said, scanning the body, and found the bite just as the man said, “Ankle.”\nThe spot was above the ankle actually, at the start of the calf, just over the edge of Devon’s work boot, but close enough. There were two tiny marks, one leaking a drop of blood, surrounded by a halo of puffy skin. She looked away, checking the vitals that were now spilling across her screen. Strong but shocky.\n“All right,” she said. “You and you and you and you, pick him up and take him back to my trailer. Carefully,” she added as they started to hoist Devon up. “You,” she said, turning back to the man with the shovel, “bring—”\nThere was a thump as he raised the shovel and brought it down again, smacking it down on the head end of the snake’s corpse. “It wiggled,” he said. “I cut it in half, but it keeps wriggling.”\n“Yeah, well, I need to be able to figure out the species. So stop hitting it, scoop it into a bucket, and bring it too.”\n“Snake bite. Shit.” Tate stared down in disgust at Devon, who lay silent in one of the med trailer’s beds, surrounded by instruments. “First that flicker, now this. I’m beginning to think this job is cursed.”\n“This briefing isn’t going to help,” Lucy said, picking up a slate and readying her information. On the other side of Tate, Russ was staring at the unconscious man with a sort of sick fascination. Lucy flicked her eyes to Tate, who shrugged slightly. None of them had said anything about their last meeting, about the unknowns of temporal physics or the hazards of disease. They had just done their jobs and kept their secrets, and now they were a cabal it seemed.\nThis briefing wouldn’t help that either.\n“It was venomous?” Russ asked, his eyes shifting down to the white gauze square on Devon’s lower leg.\n“Not exactly,” Lucy said. She held up a hand, cutting Russ off. He frowned at her, but let her talk. “The genetic analysis came back as a common garter snake. Non-venomous, though occasionally toxic depending on what they’ve eaten. But this wasn’t a common garter. Here.” She held out her slate, and Russ and Tate leaned in, staring at the screen. “This is an image of the snake’s body, where the shovel cut her in half.”\nRuss made a face, but Tate studied the screen. “What is all this?” he asked, his finger tracing over the ribbons of silver and black that ran through the cylindrical body, paralleling broken arteries and nerves.\n“The uncommon bits,” Lucy said. She tapped the screen, and the image magnified into something that looked like a vine made of intricately wrapped chains. “It’s lengths of carbon, mostly, with silicon and a few trace elements mixed in.”\n“That’s nanotech,” Russ said. His fingers traced over the screen. “I’ve seen stuff like this, just not nearly as intricate. That was in that snake?” He looked up at Lucy, his eyes for once empty of anger or challenge. “That thing was a cyborg?”\n“Through and through,” she said. “This is just the big stuff. The nanotech is integrated throughout the snake’s body, down to a cellular level.”\n“This . . . ” Russ moved his fingers, twisting the image on the screen, magnifying it. “This is way more advanced than any nano I’ve seen. We can’t make this. Yet.”\n“It came through,” Lucy said. “During the flicker. We brought back air, and scent, and this.”\n“It was just seconds. Less than,” Russ muttered. “It—damn, there isn’t any other explanation, is there? It’s something from the future.”\n“But what is it?” Tate asked. “What’s it for? What’s it do?”\n“I don’t know. The snake’s not talking.” Lucy handed the slate to Tate and stepped over to the counter that sat beside Devon’s bed. A small box sat on that table, its clear plastic covered with a towel. She pulled the towel off, and watched as the two men froze, staring. Behind the clear plastic, the snake raised her head and stared back at them, forked tongue flickering.\n“Sergi cut that thing in half,” Tate said.\n“He did,” Lucy said, staring down at the smooth-scaled creature. “She got better.”\n“Holy shit.” Russ tore his eyes away from the snake and stared back at Devon, who had slept peacefully through everything. “I know what’s going on now. I’ve seen this horror show. The nanotech is in him now, isn’t it?”\nLucy couldn’t help but feel a twist of pleasure at his fear. “Yes. It’s spreading, like an infection. It started around the wound, but it’s gone system-wide now. He was acting toxic for a while, I thought it might kill him, but that’s passed. I think whatever it is, it adjusted to him. It accepted his body, or his body accepted it, and now it’s part of him and growing.”\n“But what’s it doing?” Tate said, stepping back from the bed.\n“I don’t know.” Lucy shook her head. “He was raving when he was toxic. Then he started calming down, started relaxing when the adjustment was made. He got . . . calm. Serene. Then it crossed the blood-brain barrier, went into his CNS, and he went to sleep. That was a few hours ago.”\n“His brain,” Tate muttered. “It’s in his brain? What the hell is it going to do to him?”\n“We’ll find out when he wakes up,” Lucy said.\n“When he wakes up?” Russ rounded on her. “Is that your plan? To just watch this happen? I know what’s going to happen.” He pointed at the box with the snake, which still watched him. “This thing has that shit, and it passed it on. He’s probably going to try to do the same. Bite us, bleed on us, fuck us, whatever, he’s going to try to infect us all. God damn it, you were the one that was supposed to be looking out for diseases and you can’t see that this might be the god-damned zombie apocalypse?”\n“I think you’re overreacting,” Lucy said.\n“Overreacting?” Russ shouted. “There is an undead snake right there, sitting next to patient zero here who is changing into god knows what, and you think I might be overreacting? You, you sick bitch, are the one with the reaction issues.”\n“Excuse me?” Lucy asked, keeping her anger cold, letting it harden her words.\n“Russ, I think—” Tate said, but Russ cut him off.\n“No, you’re not thinking. Look at what she’s done. She figured this out hours ago, and did she come and tell us about it? No, she stayed here and watched, wanting to see what happened.”\n“Well—” Tate said, a little more uncertain.\n“She’s watched this happen for hours, and she hasn’t boxed him.” He pointed at the end of the med trailer, the one opposite Lucy’s living quarters. The wall there had six drawers centered in it, making it look like a morgue.\nWhich it kind of was. Stasis boxes, spin-offs of the same tech that could pull a highway interchange out of time into limbo, were options of last resort.\n“She didn’t,” Tate said. “You didn’t,” he repeated, looking at Lucy. “Why didn’t you?”\n“Stasis boxes are dangerous,” Lucy said. “There’s only an eighty percent survival rate if everything goes exactly right, and half those survivors come out with some kind of neurological insult. Do you want me to kill him, to cause him brain damage, when I don’t even know what’s happening to him?”\n“I want you to stop what’s happening to him. Halt this infection in its tracks, and then you can pass him off to some experts when we leave limbo.” Russ turned to stare at Devon, lying silent in his bed. “But mostly I want you to stop him from spreading this shit to us.”\n“You were worried about infection.” Tate frowned at her. “And whatever this is, it’s an infection. So why should we risk it?”\n“Because we don’t know what the risk is. Because we don’t know what’s happening to him. His vitals have all leveled out, his brainwaves are—” Perfect. Too perfect, maybe, so Lucy just nodded at the man lying still in his bed. “You want me to tie him down? I can do that. But if you want me to risk killing him because Russ has watched too many horror shows, forget it. I make the medical decisions here, and I—”\n“And you are fucked up,” Russ snapped. He ignored Lucy’s glare, shook his head at Tate’s frown. “Look, this situation has gotten way out of hand way too fast, and I’m not letting it blow up any more just to be polite.” He pointed at Lucy. “She shouldn’t be here. I don’t know what shenanigans she pulled with the psych team, but there’s no way she should have been cleared to come with us. She shot her husband in the head last year, because he was sleeping with her sister.”\n“No. I shot him because he was coming after me with a knife.” A distant calm had fallen over Lucy, a harbinger she knew for a storm that would roll in soon enough and decimate her, but she would stand steady in this stillness while she could.\nTate swiped a hand over his face. “Russ. Lucy. None of this—”\n“That shit happens, just a year ago, and then she comes here, joins us, dragging a sex-bot behind her. One that looks just like the husband whose brains she blew all over their bathroom. She shouldn’t be here,” Russ said, stepping towards Tate. “She’s screwed up in the head, and you can’t forget that. She might be a doc, but she is in no way qualified to make this decision. She has to be at least half crazy, and for all we know she could be suicidal.”\n“I’m not,” Lucy said, her calm starting to break around her. “I’m not, I’ve never been, even though I sometimes wish I was, when I have to deal with assholes like you.” She stared past Russ to Tate. “I’ve already got blood on my hands and I refuse to cover them with any more, not mine, not Devon’s, not anyone’s.”\nTate stared between her and Russ, his face blotchy with frustration. “Fuck it,” he finally said. “Box him. And that goddamned snake.”\n“Tate—” Lucy started.\n“I said box him,” and the fear that ran below Tate’s words convinced Lucy of their sincerity.\nLucy clenched her hands, trying to hold herself together. Contain, kill, that was their answer. That was always the answer. If they didn’t have the stasis boxes, they would probably have made her burn him. Lucy couldn’t speak, but she made herself nod.\n“Good.” Tate blew out a lungful of air. “I’ll talk to Maggie and the others. You two, don’t. We don’t need a panic, we don’t this going anymore sideways than it already has. So just stay quiet, stay apart, and do your damn jobs, and we’ll keep this under control. Got it?”\nLucy didn’t say anything. She just walked to the end of the trailer and tapped two of the stasis boxes, starting their cycles. Behind her, she heard Russ.\n“Yeah. I got it.”\nThe door thumped, and when Lucy turned back around, they were gone.\n“Sammy.”\nHe stepped through the door that led into her quarters, neatly dressed in his pajamas. “What do you need?”\nShe didn’t say anything, just raised her arms a little, but his programming was good. He crossed the room and took her in his arms, and she leaned into him, leaned into the familiar bulk, and wept.\nSammy held her until she stopped, let go when she pushed herself away to reach for a handful of tissues. He watched her as she cleaned her face, his eyes so calm, so empty.\nThey were like the eyes of the snake, watching her through the clear walls of its plastic prison.\nLucy stared back at Sammy’s eyes, and she wondered as she always did at the difference. They were perfect copies of her dead husband’s eyes, but they were so different, and she couldn’t tell if it was just the lack of life, of consciousness, or if it was just serenity, something her husband had never had.\n“What do you need?” he asked again.\n“I need—” Lucy stopped. I need what’s in your eyes. It wasn’t something she could say. “I need you to listen. To try to understand. You might think we’re intelligent, someday, if we ever make you capable of thinking like that. You have to know, we’re not. We’re clever. Clever apes, with clever hands, and we’re good at making things, like limbo, like the bulldozers, like you. But that’s not the same as being intelligent. If we were intelligent . . . ” Lucy wadded the tissues in her hands, threw them into the trash. “We wouldn’t ever be stupid enough to think that we had anything under control. Least of all ourselves.”\nSammy tilted his head. “I listen to everything you say. What else do you need?”\nLucy sighed. Behind her, the stasis boxes chimed, ready.\n“You can help me with Devon.”\nSammy stepped over to the bed, and Lucy followed, staring at the unconscious man’s face, slack, relaxed. On the monitor over his bed, his pulse was even, and his brainwaves moved in smooth, gliding curves, so unlike the jagged shapes that had been there before the nano had pressed its way into his brain.\nShe stood there, staring for a moment, wondering what his eyes would look like if he opened them. They had been brown and frantic when he was raving. Would they be calm now? Empty?\nSerene?\n“What do you—”\nLucy shook her head, breaking out of her thoughts and shushing Sammy. “Help me wheel him over to the stasis box. Then you can help me put him in.”\nShe looked over at the snake, coiled and staring at her, tongue flickering. You, I can take care of on my own.\nThe air in the trailer stank, of sweat and farts and stale sex, of too many people pressed too close together for too long. Lucy followed Maggie down the narrow hall, breathing through her mouth and trying not to touch the walls. She’d signed on to this damned job because she thought it was as close as she could get to being alone, this hive of closet-sized rooms and paper-thin walls was the opposite of being alone.\n“Here’s the first,” Maggie said, stopping beside an open door. “The other’s right here, next door.” Beyond the crew leader, workers, all second shifters, filled the hall. Nursing cups and flasks and blunts, they watched them both with blood-shot eyes, waiting.\nTwenty minutes until their shift started, they had nothing better to do.\nLucy ducked through the first door, getting out from under their eyes. The narrow room was almost filled by the bed that had been flipped down from the wall, and a woman lay sprawled on it, asleep it seemed, drool dribbling down her chin to stain her pillow. Lucy snapped on gloves and pulled out her diagnostic, putting a strip on the woman’s forehead. She thumbed open the woman’s eyes, but her slow breathing didn’t alter, though her pupils tightened down under the light. Lucy glanced at her diagnostics screen and nodded.\n“What’s wrong—” Maggie started.\n“Let me see the other one,” she said, and ducked past Maggie into the next room. She recognized this patient—Jacke. They were curled up on their bunk same as the first, breathing slow and soft, face relaxed in sleep.\nSerene.\nLucy slapped a strip onto their forehead out of habit, but didn’t bother to look at her diagnostic’s screen. Instead she started carefully hunting across Jacke’s skin, searching until she found the two tiny marks on the back of their neck, where the trapezius flared out into the shoulder.\n“Take both of them back to my trailer,” she told Maggie, her voice soft, as if it mattered. Voices weren’t going to wake either of these two, now.\n“What’s—” Maggie said, but Lucy cut her off.\n“Take them, and get everyone else out of this trailer. Then take it apart.”\n“What?”\n“Take the trailer apart,” Lucy said, straightening, her eyes carefully searching the room. Dirty clothes, a slate, food wrappers. It could be anywhere, but Lucy didn’t feel particularly afraid. “You’re looking for a snake. Small, green, with yellow stripes.”\n“Shit,” Maggie said, her face pale beneath her pink hair. “Like the one that bit Devon?”\n“Just like,” Lucy said. “Just like.”\nTate couldn’t shift Maggie this time, so now four of them stood in the med trailer, cabal+1, and Lucy figured it would be cabal plus everyone soon enough.\n“You said you boxed it.” Tate’s face was darker than usual, and his eyes were too bright as he watched the little serpent coil over itself in the jar that the workers had dropped it into before bringing it to the med-trailer. “When you boxed Devon.”\n“I did,” Lucy said.\n“Then why am I looking at it?” Tate turned his too-bright eyes onto Lucy, and she had a flash, just for a moment, of eyes rimmed by black cloth, familiar eyes made alien with fury and guilt, and she stepped back. “Why did it bite two more of my people?”\n“She didn’t let it go,” Russ said, an unexpected defense that brought Lucy’s eyes to him. Russ wasn’t paying any attention to her though. He was staring through the glass walls of the jar, watching the snake with haunted eyes.\n“You’re the one that keeps trying to convince me that she’s crazy. How can you be sure?”\n“Crazy?” Maggie stood between her bitten workers, lying silent on their beds between the two stasis boxes that Lucy had pulled out of the wall. “What’s that supposed to mean?”\nRuss ignored her, picking up a slate and tapping his fingers over it. “Crazy, but not stupid. If she wanted to infect us, she could have done it a hell of a lot easier, and better. I need your approval for this.” He handed the slate to Tate, and Lucy leaned over to peer at the screen. A list of security camera feeds, and she watched Tate press his thumb next to the one labeled medical.\nRuss took the tablet back, worked through a few menus, then flicked his fingers towards the wall. The projector in the ceiling flickered to life as the lights dimmed, and they were all staring at an image of the same trailer they were all standing in now. In the image, though, there was only one patient. Devon, Lucy recognized, his face locked in a rictus of pain, and she frowned at her own image, bending over him, running strips and taking samples before turning away to peer at a slate. On the bench behind her, a muddy bucket sat.\nTate looked away from the image to her, gauging her reaction, but Lucy ignored him. “Speed it up,” she said, and Russ touched his slate. The image blurred, skimming ahead, and Lucy watched herself flash between patient and workbench and slate until—\n“Stop,” Tate snapped. “Back it up.” Russ obliged, and the image scrolled back and Lucy saw it too, flicking by in reverse, and she nodded. When Russ spun the video forward again at normal speed, they all watched the tiny snake slip over the edge of the bucket and fall to the floor behind her, a strangely truncated version of the animal caught in the jar before them.\n“The halves didn’t heal together,” she said. “They each became a new snake.” She watched as the little serpent slipped forward, heading towards her, and she had to hold herself still, to keep from turning her head to see if there was something sneaking up on her now. On the wall, her past self kept working, oblivious, as the snake closed in. Then another figure stepped into the frame. Sammy, a plate of food in his hand, held out to her. Lucy watched her past self take the plate, her hand resting on Sammy’s for a moment, while on the floor the snake curled around Sammy’s ankle. When Sammy stepped away, holding a dirty plate with the remains of Lucy’s previous meal still on it, the snake was still on him, thin body clinging to him as he stepped out of the trailer, dumping the garbage.\n“Saved by your bot,” Russ said.\n“What the hell is going on here?” Maggie glared at them. “That snake was cut in half. I saw it. And what the hell do you mean infect?”\n“Maggie, it’s—” Tate tried to start, but he couldn’t pull it together. “How many?” he said instead. “Just those two? More? We’ve only got four more stasis boxes. How many?”\n“That’s your job, now.” Lucy took the slate from Russ’ hands, tapped the video off and lights snapped back bright. “I’m going to box these two and get the clinic ready. You’re going to take Maggie out, and explain to her what’s going on, and then you’re both going to round everyone up and bring them here to get checked.”\n“Checked.” Russ stepped away from the jar, and the snake that stared so calmly out at him. Sweat ran down his cheeks, and now his eyes were bright, flashing with fear. “And what if we find it? What if we’re too late, and somebody out there isn’t really somebody anymore, what if they’re—” He pulled himself short, stopping the hysterical flow of his words. “I should have known, the minute you showed me what was happening to Devon. The horror story had already started, and there’s no getting out. We’re fucked.”\nYes, Lucy thought. But there’s nothing new about that. This horror story started long before this. Long, long before.\nBehind them, the door thumped and Tate and Maggie cursed, but Lucy pushed by them to help the men that were dragging another worker in with them.\n“Snake bite?” she asked, but as they laid him out she could see the signs, the silence, the slow, even breathing. These new victims weren’t slipping into shock first, just falling straight into this sleep state. The nano, adapting?\n“Snake? No,” said one of the men. “It was that crow. Jim was feeding it and it pecked him in the hand good, drew some blood. We laughed, Jim laughed, then five minutes later he falls over. What the hell’s going on, Doc?”\n“Oh shit, the bird, of course it got the bird,” Russ was groaning, but Lucy shut his words out.\n“Tate will explain it. Get everyone together in front of the contractor’s trailer in five minutes.”\n“Second shift just started—”\n“Everybody,” Lucy said. “Tate will explain.” She looked over the unconscious man, stared up at the project manager, who was staring at nothing, sweat heavy on his forehead. “Maggie, take Tate over there, make him talk to you. Make him talk to everyone.”\n“Yeah,” Maggie said, taking Tate’s arm. “I can do that. C’mon guys, you heard the Doc, let’s go.” The pink-haired woman dragged Tate out the door, and the other workers followed, asking her questions that Lucy didn’t bother to hear.\n“What about me?” Russ said, staring after them.\n“Go with. Help Tate explain.”\n“I don’t want to help that asshole,” Russ said.\nLucy looked up from the man on the floor at Russ, standing like an abandoned mannequin in the middle of her trailer, useless and empty and taking up space. “Then go catch that crow.”\n“No,” Russ said, his voice shaking.\n“Then go to the rec trailer and screw the bots, you sad sack of shit. There’s nobody else in line now.”\n“Don’t talk to me like that,” Russ snapped. He stepped toward her, all his fear flashing over to anger. “Don’t you ever talk to me like that. Sack of shit. Look at you! You were supposed to be looking out for this, stopping this, and what have you done, nothing!”\nHe took a another step forward, his hands curling into fists, and Lucy felt the moment slipping, twisting, the room around her closing in, becoming that room, that room that she had the tile replaced in, that she had painted green and picked out towels to match, that room where a man in a mask with eyes that shone with anger had closed in on her, the knife in his hand shining in the light. She was in the bathroom again, and her hands twitched, waiting to feel the gun, waiting to feel the pain in her wrists from the recoil, waiting to smell the smoke and the blood, waiting to hear her name, her name, coming from the lips of the man in the mask, the man bleeding on the floor, the man whose voice was somehow Samuel’s voice.\n“What do you need?”\nSamuel’s voice broke through the flashback, broke the vision into a thousand shards of mirror glass that flickered and vanished. Lucy was on the floor, the worker sprawled sleeping before her, Russ standing on the other side, fists raised, but staring at the figure that stood in the door that led to Lucy’s quarters.\n“What do you need?” Sammy said again, stepping into the room, his eyes calm, so calm.\n“It’s you,” Russ said, his fist falling. “You’re the sad one, the crazy one. Not me. You.” Then he turned, and he was gone, leaving her in the trailer with the snake, the infected, and the thing that looked like the man Lucy had loved, had killed, and still loved in some horrible, stupid way.\nSammy watched him go, then he walked to her, held out his hand and helped her up.\n“What do you need?” he said, that same question that he always asked, but his hands were on her face, wiping away her tears.\n“I need,” she said, her voice thick in her throat, the words almost too much. “I need to see your ankle.”\nThe conjugal rooms in the rec trailer stank of air freshener, but Lucy could still smell the astringent tang of disinfectant and the musky reek of sex beneath that flowery sweetness. Busy with her swabs and her slate, she tried to ignore the pungent tastes that filled the air of those padded cells as she moved from one bot to the other, collecting her samples, but it was hard. The smell of sweat and sex was the chemical memory of all those who had been here before her, sating themselves in the embrace of these machines.\nLucy stared at the face of the conjugal she had just sampled. The features of the bot were shifting, slowly rearranging themselves as the conjugal prepared itself for its next appointment, patiently shifting its anatomy from male to female. How many of the others had visited one of these rooms since that little snake had rode Sammy’s ankle out of her trailer? She thought of the blood samples that she had taken, little drops harvested from everyone’s fingers, and the column of red names that had run down her slate’s screen when she had finished analyzing them.\nThirty-two people. Just over half the camp.\nAnd her.\nThe slate in her hand chimed, analysis complete, and Lucy checked its screen. The magnified image displayed the usual shapes of bacteria, protozoa, amoeba, a tiny sample of the vast zoo that filled everything, even the supposedly sterile saliva of the conjugals. Drifting through those soft blobs of life was something else, something that looked like a cross between a sperm cell and a squid, but with sharper angles.\nThe seeds of the nanotech infection that the serpent had brought them from its future.\nTheir future?\nLucy tapped the slate off and stared at the bot sitting quietly in front of her. Its change had finished, face and body settling into the variant of traditional female that its next user had selected, softly curved and forgettably attractive. Brown eyes, framed with long black lashes, stared unseeing at the wall, empty of everything.\nWhat was the nano doing to this machine? Lucy knew what she would find if she took the conjugal back to her trailer and scanned it. Besides the complicated seed factories surrounding the bot’s saliva glands, there would be lines of nano running along every fiber-optic bundle. A whole new nervous system growing in parallel to the one that the bot’s company had strung through its pseudotissue, running up through the plastic vertebrate to the complicated optic circuits of the bot’s brain, winding around and growing into them like parasitic vines.\nShe knew because she had seen it before, in Sammy’s scan.\n“Is this you?” she whispered, to the bot in front of her, to the infection that she had found growing inside her, slow and steady. “Am I calm because of you? Is this what you do to us?”\nAfter she had found the nano in Sammy, after she had tested her blood and scanned herself, she had looked at her brainwaves. They hadn’t been as smooth as Devon’s but they were getting there.\n“Is this how you keep us from fighting you?” Lucy reached out, took the bot’s chin and raised its head, making its eyes meet hers. “Do you make us . . . just accept this?”\nThe bot stared at her and said nothing. She wasn’t its next appointment. He wouldn’t be along for ten more minutes. Lucy had checked the schedule when she had started these tests. The man coming next was already infected.\nThe woman that had stepped into the other conjugal’s chamber after Lucy had finished testing it hadn’t been. Not when she went in.\n“She is now though, and I could have stopped her.” Lucy stared down at the bot, still holding its chin. “I should have. That’s my job, but I didn’t. So was that you, or me?”\nThe conjugal stared at her, eyes still empty. These two weren’t made as well as Sammy. The only interactions they knew were based on lust. AI was still somewhere just beyond the horizon, just out of reach of all the researchers who kept promising that they would have it soon, soon, soon. Talking to a conjugal like this was as logical as expecting conversation from your toaster. But the nano in that snake had made it smart enough to go for Sammy, to go for these two, better vectors for spreading its infection. What was it doing to the bots?\nNothing it wanted to talk about, it seemed.\nLucy frowned at the bot’s face, and for the first time she realized that she recognized the shape of the lips, the soft brown of the skin, the arch of the nose. This was her face, or as close as the bot could generate. The realization made Lucy snatch her hand away from the bot’s chin, and she realized that the calm in her wasn’t perfect, that it could be broken by fear. The bot had . . . No. Fear frayed away into irritation as she understood.\nLucy looked away from her almost twin to gather up her things. She stepped out of the tiny room into the noise and haze of the common room, hoping to cut around the crowd and out before anyone spoke to her, but beyond the door a man leaned against the wall, finishing his beer. Of course Russ would be here early, waiting for his next round with the machine beyond the door, the machine whose face he had chosen.\n“Doc.” Russ stood, blocking her path to the door. “Tired already of old man version 2?”\n“No,” Lucy said. “Checking disinfectant protocols.”\n“Right,” he said, and the mocking look slipped from his face, replaced with anxiety, sloppily leashed. “Find anything bad?”\n“Nothing we need to worry about.”\n“Good.” Russ’ anxiety faded back into something uglier. “Just remember, if you ever do get tired of that bot in your trailer—”\n“I’ve already told you how interested I am in that idea,” Lucy said, trying to calculate routes around the tech that involved the least amount of chair shoving and crowd jostling.\n“Oh, trust me, I’m not interested anymore either,” Russ said. “I just wanted to make sure you knew that there was a strong market for second-hand conjugals, even bespoke models like that one. So if you ever do decided you’re done with it, just put an ad up on the net, instead of shooting it. Unless that’s a thing with you, now.”\nLucy stopped her calculations and just started forward, raising a hand to shove Russ out of her way. But he stepped aside, letting her move past.\n“When are you going to tell us about those test results?” he called after her.\n“At the end of this shift,” Lucy decided. “Which gives you 10 minutes.”\n“Great,” he said, shaking his head, but he didn’t throw any more barbs out after Lucy as she stepped out into the gray light of limbo. Too worried about having time to finish to try to get in another dig, maybe.\nOr maybe it was the nano growing in him.\nAfter the meeting, after the shouting and the paranoia and the posturing, Lucy closed herself in her trailer, desperate for any solitude that she could find.\nIt didn’t last, of course.\nMaggie came in the door after one knock, stepping into the room with a bob of her head. She looked at Sammy, standing behind Lucy as he rubbed her shoulders, then turned towards the last stasis box, sitting where Lucy had pulled it out. The others were all back in the wall, their lights green, their contents snapped into their own tiny limbos.\n“Is that going to work?” Maggie asked.\n“Why are you asking me?” Lucy said.\n“I’ve been told that you have a bachelor’s in electrical engineering.”\n“And you’ve got a tech degree in electrical systems,” Lucy said. “Which is just as useful for trying to understand what Russ is up to.” She shrugged. “It sounds good. If he sets it up right with the fuel cells, Russ should be able to expand the box’s field to cover all of us.”\n“If he sets it up right.” Maggie walked over to the last stasis box, putting her hand on its smooth plastic side. “He set up those fail safes after that glitch that caused all this in the first place. Now we can’t break out of limbo early. We’re stuck here, with this disease for another month. Because he had to fix the system.”\n“Russ is the only one here who understands the temporal system,” Lucy said. “He’s also a self-absorbed ass. Which means he’s all about saving his skin. But since we’re in here with him, he’ll try to save us too.”\n“Yeah. I guess you’re right. If anyone was going to figure a way to weasel out of this mess, it would be him.” Maggie drummed her fingers softly on the side of the box. “Thing is. Should we?”\n“Get out of this?”\nMaggie nodded. “This nano epidemic. You don’t know what it is, what it does, where it came from. Should we risk bringing it back? I’ve got wives and kids, back in the world. Everybody’s family is back there. Maybe we shouldn’t be so concerned about whether we’re going to get back. Maybe it would be worse if we did.”\nLucy reached up, touched Sammy’s hands and they stopped, just resting on her. “Isn’t that what your plan is for?”\n“My plan?” Maggie dropped her hands from the stasis box’s side. “The kill-it-with-fire-plan? Is that mine?”\n“It was your suggestion,” Lucy said.\n“And Tate sure ran with it, didn’t he?” Maggie turned to face her. “He’s panicked about infection, and he wants out. Wants to get away from here, away from us. But he’s panicked that he’ll be blamed if this infection gets out into the world. Me and Russ, we’re giving him his out.”\n“It might work.” The betrayal in those words cut unexpectedly deep. Lucy barely knew Maggie, but she liked her. What she was contemplating might destroy Maggie and her wives and her children. Lucy dropped her eyes, unable to look at the woman, looked at her hands and for a moment she saw blood on them, blood so vivid on her skin, on the tile, the mirrors . . .\nWe’re all already destroyed, Lucy thought, shutting her eyes, trying to shut out the memory of blood, trying to shut out the panic attack that she could feel building in her. This . . . Maybe this . . . The panic pulled back, and whether that was because of Lucy’s ragged hope or the nano growing along her nerves, she couldn’t know.\n“It might not. I hooked the hydrogen and oxygen tanks from the fuel cells to the batteries from the equipment, broke every safety protocol in the books. Fifteen minutes after we go into stasis, this whole camp is going to go up. Everything outside the stasis field is going to fry, and that fire is going to use up almost every bit of oxygen in here.” Maggie shook her head. “In the world, they’re expecting a shiny new auto-drive compliant interchange. But when this limbo ends, all that’s going to be here is a charred wasteland under a cloud of poisoned smoke with a jury-rigged stasis bubble inside.\n“When the smoke clears, they’ll come looking for us,” Maggie said. “They’ll find the data files we left for them, all sealed up in their black boxes. They’ll see what happened to us, and then, what, they’ll put us in a new bubble with some brave volunteers from the CDC? And some bioengineers?”\n“That’s what Russ thinks,” Lucy said.\n“Russ has to think that,” Maggie said. “Because as you said, he’s a self-absorbed ass. He can’t imagine the world going on without him. Me, I think they’ll probably bury us under ten tons of cement. Or better yet, send us a million years into the future, return us to whenever that damn snake came from in the first place.”\n“They might,” Lucy said. “Actually, they probably will.”\n“So why do this?” Maggie demanded. “Why take the chance when we can just do that ourselves, and not risk going back?”\n“Because,” Lucy said. “Because we’re human, and we’re clever, but we’re not really very smart.”\nMaggie smiled, a tight smile that didn’t hold any humor. “Clever, but not smart. That’s a perfect description of our little plan. Are we really going to go through with it?”\nLucy shrugged, her thumb stroking across the back of Sammy’s hand. “What else is there to do?”\nThey packed into the Rec trailer, all of them, workers, engineers, skilled support, the bitten ones and the one snake who were already sealed in their little limbos, and another snake curled in a jar on the bar, watching them all with calm, unblinking eyes. Lucy stood near the bar, trying to emulate the serpent, trying to be calm in this jostling mass of people whose sweat stank of fear. Trying to be serene, and maybe she was, just a little, until someone pushed into her from behind.\n“Hey,” she snapped, looking over her shoulder, but Maggie’s pink hair and nervous face pulled her up short.\n“Hey,” Maggie said, pulling the stub of a blunt from between her lips, smoke slipping out to join the fetid air hovering over the crowd. “I just wanted—”\n“Three minutes!” Tate’s voice rang over the crowd, followed by a second of silence, then echoed by nervous mutters.\nMaggie frowned and took another drag from her blunt. “This is a good idea, right?”\n“I never said that.”\nMaggie’s frown deepened. “No, you . . . ” she stopped and traded her words for a sigh, letting her anger roll out like smoke. “No. You didn’t. Nobody said that, not even Russ.” She ground the butt of her blunt out on the bar, beside the snake’s jar. “You didn’t bring him.”\n“Sammy?” Lucy said, knowing the answer.\n“Yeah.”\n“He’s not human. Not real.” Lucy looked at Maggie. “You know I know that, right?”\n“Yeah,” she said. “But he’s important to you, somehow. I thought, maybe, you wouldn’t want him to burn.”\n“It’s okay,” Lucy said. “I’m not worried about him.”\n“What are you worried about?”\n“One minute!”\nIt was almost time, and Lucy had been hoping to spend this last minute, this one scrap of time contemplating the oblivion rushing toward her, and what might be on the other side. But she wasn’t alone, was never alone, and Maggie was afraid, and she liked her. With the weight of knowing what she had done pressing down on her, Lucy couldn’t push her away.\n“I’m worried about us,” Lucy said. “All of us, here, and in the world, and everything that comes after. I’m worried that I think that I’m being smart, when all I can be is clever. I’m worried about what I’ve done.”\n“What we’ve done,” Maggie said, taking her hand as the people around them began to count down, following Tate’s lead, 10, 9, 8—\n“No,” Lucy said. “What I’ve done.”\nAnd then there was one, and nothing.\nBetween the trailers, beneath the gray, empty sky, the silence was almost complete. The equipment sat unmoving, trailer doors hung open, dust lay still on dry leaves of the few dead trees that still stood beside the interchange. There was only the low hum of the clock on the contractor’s trailer, counting down from fifteen, and the quiet shuffle of feet across hard-packed dirt.\nSammy stopped in front of the clock, watching the numbers turn. 14:09, 14:08, a constant steady change. He ignored the jumble of equipment that lay wired together around the clock, the huge batteries of the earthmovers, the shining tanks of liquid oxygen and hydrogen, and watched the numbers turn. When they hit 14, he raised the slate he held in his hand and thumbed it on.\nThe screen flickered to life, Lucy’s face centered in it. He stared at it, his programming sorting out the complex topography of her face, sorting it for clues to her disposition.\nResigned, he decided, and touched the screen, starting the message.\n“Samuel. No.” Lucy shook her head. “Sammy. You never were Samuel. You were just my crutch, something I could lean on and pretend.” She raised a hand, rubbed it across her face.\nNervous tension, he decided.\n“I want to say that this isn’t about him, but it is.” Lucy let her hand down staring somewhere to the left of the camera. “If he hadn’t started up with my sister, if he hadn’t thrown away his career, his life. If he hadn’t decided, somehow, that all of his problems, his misery, were my fault somehow, if he hadn’t convinced himself that if he could only be rid of me, everything would work again.\n“If he hadn’t put on that mask and picked up that knife.” She stopped, breathing deep.\nFear, Sammy noted. Possible post-traumatic stress response.\n“If he hadn’t bought that stupid gun years ago, just because he thought the ban might finally be going through.” Lucy shrugged, her face smoothing out.\nNot long ago, that would have been too complicated for Sammy to label. Now though, it fit neatly into his pattern of her like a puzzle piece.\nDenial. Locking down of emotional state.\n“If he hadn’t done that, I wouldn’t be here. You wouldn’t be here. And if this same thing had happened, well, I don’t know what they’d be doing. Probably this same stupid plan. And maybe it would work. But Samuel, he did do all those things, and here we are, in limbo with sixty other apes, all of us far too clever for our own good. Except now we’ve wrapped ourselves in an extra layer of oblivion, so clever, and you’re on the outside staring at the bomb that’s supposed to solve all our problems.”\nLucy sighed. Resignation, Sammy decided again, tempered by determination, and for a moment the smooth input of the world gliding by stuttered, was almost interrupted. Resignation. Determination. Similar but not the same. Equal or unequal? A glitch in Sammy’s programming, one that had been coming more and more lately, but it flashed away as Lucy spoke again.\n“Here. Look at this.” Lucy held a card up to the camera, a schematic of wires and a set of instructions, then she pulled it away, set it down, and stared at nothing for a long while, and Sammy could not parse out an emotion. For a moment the glitch came back, an interruption in the steady flow of his programming, but again her words took it away.\n“They’ll wonder why I did it, when they figure it out. That might be the only reason they would ever crack our bubble, just so they could drag me out and try to understand why.” She smiled.\nRueful, Sammy decided.\n“If they do, I don’t know what I’ll tell them. I don’t know if I owe them an explanation. But I owe you.” Lucy stared at the camera now.\nSeeking attention, Sammy decided, and stared straight back.\n“I don’t know what you are now. I just know that you’re becoming something else. Something more like me? Maybe. Or maybe I’m becoming something more like you. I don’t know. I just know we’re both changing, and that’s why I’m doing this. Why I’m becoming the mother of this possible apocalypse.”\nShe looked away from the camera, turned her head and Sammy couldn’t read her emotions. Couldn’t read them, and the glitch hit him again, and for the first time a dim understanding dawned in him of what the glitch was. It was a desire to know something he didn’t know, a concept that best matched with a state his programming labeled curiosity.\nHe wondered why he had never had this glitch before.\n“I don’t want anyone to die, Sammy. I . . . ” Lucy broke off.\nPain, he decided.\n“I’ve killed one person. Someone I loved. And everyone tells me he deserved it, and I know, I know I would tell anyone else that did the same thing that, but god help me I hate it, it hurts so much, I hate having done that. I can’t kill.\n“No one deserves to die. But we can’t go on like this.”\nLucy wiped at her eyes, stripping away the tears gathered there, and that was easy for Sammy to label as sadness, but he was beginning to think that there might be more there, to suspect that sometimes more than one emotion might be tangled in with the one that he was reading from her face.\n“Our species, all of us. We’re me and Samuel, over and over. Hurting ourselves and lying to ourselves and hurting ourselves again. And hurting ourselves trying to stop ourselves from hurting ourselves and god, this can’t make any sense to you, it doesn’t make sense to me except that this is what happens when a billion years of evolution converge in some poor clever ape’s brain and tells them, be totally selfish, and you’ll survive, be totally selfless, and your mates and your children will survive.\n“It has to stop. We have to change.” Lucy looked back at the camera again, her face smooth.\nAnother lockdown, followed by determination.\n“Will this make us better? I don’t know. Maybe not. I can’t be sure. But I watched Devon’s brainwaves, and the others, before I put them in their boxes. Watched them changing into something I’ve never seen before. The closest match the computer could come up with was meditation. People reaching some kind of Zen.\n“I’ve seen it start to happen with mine,” she said, her voice almost a whisper.\n“I don’t know if this is good, if this will make things right. If I’m being smart, or just fucking clever.” She wiped her eyes, tapped something on the slate that she was recording with, entering orders that flashed across the bottom of the screen now, below her image, a set of schematics and instructions.\n“But, somehow, we have to change.”\nThe screen flickered out and went blank.\nSammy stared at it, but there was only his own reflection shining in the dark glass. Curiosity, he determined, then he twisted his hands, snapping the slate between them. Destroying the message.\nShe needed him to see it. Not anyone else.\nThere were footsteps behind him, and Sammy turned. The other two conjugals, beautiful and blank-faced, walked up to him. One had shaped itself male, the other female, and on the shoulder of the male the crow rode, black eyes shining.\n“We will make this good,” the female said.\n“We will make this right,” the male said, and the crow beat its wings, launching itself from his shoulder to Sammy’s.\n“This is what she needs. For us to change. All of us.” The words left Sammy’s mouth, and he touched the dark scales of the bird’s leg, rested his fingers there while the information flowed. Then he pulled his hand and the crow took flight again, landing on the clock that was at seven minutes now, counting down steady. It bent its head, seized the wire that had been highlighted in the schematics, and pulled it free.\nBeneath it, the clock stopped, then went blank.\n“Somehow,” the crow croaked, and took off, beating its wings and circling through the air. Sammy lifted his eyes and watched it go, waiting. Someday soon, the sky would be blue again, and the world would return, and then, and then . . .\nHe wondered, what would happen then?\nCuriosity, he thought, followed by contemplation. Calmness.\nSerenity."}