{"fingerprint": "gkdMfpwkLvXQLlkE4Cq3LznU4Uo=", "sitename": "Clarkesworld Magazine", "title": "From Their Paws, We Shall Inherit by Gary Kloster", "author": "Gary Kloster", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kloster_03_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: From Their Paws, We Shall Inherit by Gary Kloster", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2800 words, short story\nFrom Their Paws, We Shall Inherit\nMonkey waited until the sky over the Gulf had gone all black and empty except for a billion stars before he pulled himself back onto the sailboat.\n“Ceegee’s roughed your stuff,” he said, perched dripping on the rail. “They rough you too, Cesar?”\nI spit in the ocean. When the cutter caught me, the ceegee boys had swarmed aboard and slammed me down so that some officer, all pretty in her white and brass, could question me.\nWho’re you, where you going, where you been? Where’s the sugar? Over and over she’d asked, while her boys tore the boat apart. She hadn’t liked my answers. She knew I was lying, even when they couldn’t find anything. Finally, she had her boys rip my shorts off and gave me to her machines.\nThe ceegee robots had tentacles, reeking of rubber and lube. Those thin limbs had pushed between my teeth and down my throat, burrowed up my nose and shoved themselves deep into my ass. Searching all my hidden places.\nThey had wrecked my boat, and then they wrecked me. Those slick machines had left me choking, shitting, bleeding, puking. Sobbing. For all that wreckage and pain though, they hadn’t found one speck of sugar.\nBecause a little monkey I’d found floating in the middle of the gulf days before had looked at the empty horizon and told me the Coast Guard was coming.\n“Ceegee assholes,” I said. “Course they’d rough a South Padre boy.”\n“You want to rough them back?” Monkey’s eyes, glittering with starlight, met mine.\n“How?”\nMonkey curled his tail in and untied a thin white rope from it. “Haul this up.”\n“The sugar?”\n“Yes. Plus something I took from their boat while they were busy with you.”\n“A gun?”\n“Gun’ll just get you killed,” Monkey said. “Got you something better.”\nThe rope ended in my drybag, and I opened it up. Three sealed boxes of sugar. Illegal pharma, or nano, or data or who-knows. South Padre pirates just called it all sugar, and gave dumbasses like me boats and money to haul it. Something else nestled between the boxes, a thin tablet of glass and aluminum.\n“What am I suppose to do with a ceegee computer?” I could feel the rawness in my throat, in my ass, the ache deep inside me from being helpless and naked and violated while that ceegee officer and her boys had watched. A gun seemed like a better gift.\n“Rough them,” Monkey said. “I can teach you.”\nI frowned, turning the thing in my hands, not sure. Just a computer, encoded, locked, useless to me, but Monkey gave me a grin.\nWhy should I argue with the magic talking monkey? He’d saved me from either being sent to a work camp by the ceegees or being crucified by the pirates back home. So I held the computer and listened to him talk, and slowly the hurt and fear curled up inside me into a knot tight enough to ignore.\nExcerpted from the astronomy site, Constellation Prize:\nReally? Unexplained astronomical phenomena? Possible supernova? Really?\nWorst. Cover up. Ever.\nSure, most of the sheep don’t know. They’re too busy sucking off the media streams to notice anything, even lights in the fucking sky. But they’ll know soon enough. We’ll force those apes to look up for once.\nWe’ve got pictures of the flare, and the tracking data before and after. So what if the gubmint has shut the hell up? We don’t need their fancy toys for this. We’ve already plotted the flight paths for Bogies 1 and 2. We can watch them ourselves—Big Brother gets my telescope when he takes it from my cold, dead hands.\nWe just have to agree on the narrative. We know what’s happening—a ship is tearing ass through our system right now, and last night it fired something off in our direction.\nWe know that. We can’t be mealy-mouthed. Maybe it’s this, maybe it’s that, can’t be sure, yadda yadda fuck you. We know. Second guessing now is just helping the cover-up. (Yeah, and I know some of you guys in the comments are plants. Eat shit and die, federal sockpuppets!)\nPossible supernova. Unexplained phenomena.\nALIENS, MOTHERFUCKERS!\nWe know.\nHow stupid do they think we are?\nWell, I guess we did vote for them.\n“Can I pet your monkey?” my sister Sophie asked, sitting on the balcony next to me, her back against the rust-rotted rail.\n“He doesn’t like kids,” I said, but Monkey scampered down from my shoulder into her lap.\nShe smirked and ran her fingers through his fur. “See? He knows I’m not a kid, Cesar.”\nI tapped the tablet in my hands, marking my place in the trojan wiki Monkey had me reading and set it down to stare at my sister. Thirteen, and scary tall all of a sudden, with unexpected girl curves rounding her skinny body. No, she wasn’t a kid anymore. That’s why she spent so much time in our rooms now, so the pirates down below wouldn’t notice her.\nHurricane Mindy had torn the south Texas coast to shreds, and only the newest and toughest of the resorts and condos on our barrier island had survived, broken teeth jutting from sandy gums that shifted and bled with every new storm. The mainlanders had given them up, and now they belonged to the squatters who’d refused to leave, like my mother, and to the pirates. With broken ships and garbage they had built a raft city between the towers, a port for the sugar trade, a rat hole where they could hide from the ceegee patrols circling out in the gulf.\nIt’d been rumored for years that the mainland would bomb us someday and send South Padres’ towers finally crashing into the sea. Looking at the gull-picked corpses the pirates had chained to the balconies of the Hilton across from us, I wondered if they’d ever bother. If the hurricanes didn’t finish us soon, the pirates would, and then they’d just eat themselves.\n“You thinking about going out again?” Sophie said, her eyes following mine.\n“No.” My cut from that sugar run would pay our squat rights for two more months. By then, Monkey said I wouldn’t need to risk my ass out on the ocean any more. Touching the tablet beside me, thinking of all I’d learned in the past few weeks from him and this little window into such a strange, wider world, I believed him.\n“Good,” Sophie said. Then, “Mom worried.”\n“Mom noticed?”\nSophie’s fingers traced Monkey’s back. “She cried.”\n“She wouldn’t have had to, if she’d sobered up long enough to do her job and paid our rights. Then I wouldn’t have had to go.”\nSophie blinked back tears, and my throat went tight. “Christ,” I sighed, staring at Monkey. He stared back at me, big eyes innocent.\n“What are you looking at, furball? You keep saying it’s almost time, well, I say it’s past time. Start talking. Teach her. She needs this.” Monkey stayed silent for a second, and I added, “You make me look crazy, and I’ll throw you out for the gulls.”\nMonkey stuck his tongue out at me, but then he turned and faced my sister.\n“Sophie,” he said, his voice too deep for his tiny body. “Would you like to be a doctor, like your mother?”\nSophie’s tough. She didn’t throw Monkey off her, though she snatched her hand away.\n“What?”\n“I can teach you. The way I’m teaching Cesar to work his computer,” Monkey said. “I can teach you to help people, the way your mom used to. You want to learn?”\nSophie looked at the little animal in her lap, eyes wide, lips starting to move, then the balcony door scraped open. Mom, red eyed and bleary, grimaced out into the bright daylight.\n“Who the hell you talking to out here?”\n“Cesar’s monkey,” Sophie said.\nMom stared at Monkey. “Rats with thumbs. Carry disease y’know. Should . . . ” Her voice trailed away and she stumbled away from the light, back inside. The sound of plastic bottles rattled through the door, her searching for another swallow.\nSophie shoved the door shut. “What is he, Cesar?”\n“Magic,” I said, shrugging. “Don’t know. Little bastard won’t tell me.”\n“I’m telling you what you need, Cesar.” Monkey’s tail curled loose around Sophie’s wrist. “So you and yours can leave this place.”\n“So we can be safe?” Sophie asked.\nMonkey stared at me with his dark eyes, not answering, so I did.\n“Not safe, Sophie. Strong.”\nExcerpted from Constellation Prize:\nBogie 1’s leaving the system today. (Don’t start with the quibbles. She’s in the Kuiper belt, and that’s my finish line. Going as fast as she is, it’s not like she’s going to turn around.)\nShe came, popped her baby, slung around the sun, and now she’s off to boldly go wherever the hell she’s going next.\nWhich just leaves us with Bogie 2. Which is definitely headed straight at us, after those course corrections we saw it fire off last week.\nSo what the hell is it?\nAn instrument package? An ambassador? A bomb?\nMaybe it’s a fucking fruit basket.\nThe answer is, we don’t know. And since both ships refuse to return our calls, we won’t know until it gets here. Frustrating, init?\nGosh, if only we could do something, like meet it half way, wouldn’t that’d be great? Oh, but to do that we would need a space program that wasn’t a complete fucking joke.\nI know, we couldn’t afford it. Billionaires needed tax breaks and artists needed grants to paint their asses blue. I get that.\nI’m just saying it might’ve been nice to have the opportunity to be proactive here, instead of just watching as Bogie 2 cruises in.\nBecause while it’s probably not a bomb, it’s not like we could do shit about it if it was.\nI guess we’ll have to be content in knowing we spent our money on more important shit. Like winning the war on drugs, amiright?\nChrist, we are such dumbasses. If it is a bomb, we deserve it.\nThe girl slammed the man down in our living room, scattering vodka bottles, screaming for the doctor.\nI don’t know how she hauled him up all those stairs, big as he was. She had though, and she sure as hell wasn’t going to listen to me tell her the doctor was too hung over to help.\nShe yelled, I yelled, the man bled and groaned, then my sister shoved in.\n“Shut up, Cesar, and hold him,” Sophie snapped at me, wiping blood away from the knife handle that protruded from the man’s belly.\nToo confused to argue, I did what she said. The girl shut up too, staring at Sophie. I wondered why she didn’t protest about a kid taking charge, but shit, Sophie was doing something.\nHer hands danced across the man, pressing and poking into his neck, armpits, and groin. He groaned once, then passed out. Sophie jumped up, ducked into her room, and bounced back before I could yell at her with a suture kit and drug vials.\n“Thought Mom sold all her shit.”\n“Not what I hid,” Sophie said. “Grab the knife.”\n“Why?”\n“Cause when I tell you, you’re going to pull it out.”\n“What?”\n“Do it, Cesar,” Sophie said, her voice taking that crisp tone our Mom’s used to get before she whupped us. “Do it just how I say, or he’ll bleed out. And if I lose my first patient cause of you, you’ll be my second.”\n“Yes ma’am.”\nSophie gathered her supplies, paused to look at Monkey, who nodded at her. Then she started telling me what to do.\n“Rest, clean water, and meat if you can get it. He lost a lot of blood.” Sophie sounded exhausted, but she stood straight as she explained to the girl what her father would need. I listened and spun the knife in my hand, wondering what the hell to make of my little sister.\n“Thank you.” Lisa, the girl, she was about my age. “We owe you.”\nI stilled the knife, looked at the anchor branded into the skin of the girl’s arm. “You’re fisherfolk?”\n“Yes. We’ll get you fish, whatever you want.” For the first time I noticed her long braids, her rich red-brown skin and my tongue went all sideways.\n“Fish. Well—”\n“What the hell’s this?”\nMom stepped into the room, ragged with involuntary sobriety. She looked at the man stretched across our floor, a row of stitches marking his belly. “Who the hell did that?”\n“I did,” Sophie said, almost a whisper.\n“When’d you decide to play doctor?”\n“When you got too drunk to be one.”\nMom stared at her, red-rimmed eyes almost focusing for once, then she turned away, stumbling back into her room.\n“Who was—”\n“Nobody,” I told the girl, my tongue free again. “You got a boat?”\n“Course we do.”\n“Good,” I said, “We’re going to need a ride, sometime soon.”\n“That we can trade you, easy.” She smiled at me, and I smiled back, a little dizzy again. I looked away from her to catch my breath and caught sight of Monkey’s tail disappearing into Mom’s room.\nExcerpted from Constellation Prize:\nA year’s passed since Bogie 2 blazed across the sky, broke up and dropped its pieces into the deepest parts of the ocean, and what’s happened?\nNothing.\nSo is that all the show our visitors planned for us?\nDoubtful.\nThey’re down there, doing something. Spying? Colonizing?\nPoking Cthulhu with a stick?\nI have no fucking clue. None of us do. Us curious Georges gotta wonder, though. We stare at the waves and try to imagine what’s going on down there. What are they doing, what are the planning?\nWhen are they coming out?\nBecause they will. They didn’t come all this way for nothing. Someday they’re going to surface, and then what?\nIn the comments, in my inbox, everyday, that’s the question, over and over. What are they going to do to us?\nChrist, how the hell should I know?\nAll we can do is watch the sea and wait, and hope that maybe, if we’re lucky, they won’t fuck us over anymore than we’ve already fucked ourselves.\n“Where you folk going?”\nSamuel had a rough voice to go with his big body, but he treated me nice. He treated Sophie like a saint.\n“New Orleans,” I said.\n“Orleans? Why in hell would you want to go somewhere more messed up than South Padre, boy?”\nBecause a man waited there with three new US national ID cards, each of them tied to grey market credit lines flush with the money I’d drained from some private accounts last week. A certain ceegee officer and her boys were going to be wondering where all their money had gone, soon.\nI just smiled. “No worries, Samuel. You get us there, we’ll be fine.”\nThe big man grumbled, but went back to his rigging, rubbing his hand over the raw pink scar on his belly. His daughter helped him, and when Lisa caught me staring at her she smiled.\n“We should bring them along.”\nMonkey’s whisper made me jump, but he clung to my shoulder easy enough, lips brushing my ear as he spoke. “We’ll need more people on the mainland.”\n“What for?” I asked, turning to the rail, away from the fisherfolk.\n“Getting stronger. Look.”\nFollowing his arm, I could see something floating in the water. An old door, and on it—\n“Jesus,” I swore. “One for each of us, right?”\n“You’ll each need one. To learn, to grow.”\nI stared at the little monkeys clustered on the makeshift raft, staring back at me. “Grow into what?”\n“Something better.” Monkey shifted on my shoulder, and I realized how much I’d missed him being there these last few weeks. He’d helped me crack the ceegee’s accounts and arrange our documents, but he spent most of his time now with my mother, whispering in her ear. “We’re going to help you. All of you. There will be those, though, who won’t like that.”\n“The people who make me and mine weak,” I whispered.\n“It’ll change, Cesar. Your family will grow, and there are other families, all around the world, growing and learning like you. You’ll come together, someday, and it’ll all change.” Monkey dropped from my shoulder, starting towards the prow where my mother stood, staring out at the waves. Standing straight, clean, sober.\n“What are you teaching her?” I called after him, not caring who heard, knowing it didn’t matter.\nMonkey stopped and looked back at me, eyes shining with sunlight. “I’m teaching her about hope, Cesar. Hope, and God.”\nSomething thumped against the hull, and over the rail the new monkeys bounded, eager to teach."}