{"fingerprint": "4OULDqyJe83lYEzHKET4P+btHQ4=", "sitename": "Clarkesworld Magazine", "title": "White Girl by Alethea Kontis", "author": "Alethea Kontis", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kontis_09_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: White Girl by Alethea Kontis", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nWhite Girl\nBack in the heyday of the science classes I adored, I learned something very important about the color white: it isn’t actually a color. It’s the combination of all the colors in the visible light spectrum. Now I’m talking light here, not pigment. Mix all your paints together and you get that green army sludge of frogs’ legs and primordial soups. The color—if one can even call it a color—of a six-year-old prodigy’s disappointment that her Crayola army, thus united, produces such a disgusting mess.\nI used a slightly less-eloquent version of that same analogy in the tenth grade for my paper on A Separate Peace. I made a D. My mom took me to the bookstore the next week to buy Cliff Notes, in an attempt to force my brain to think the way my English teachers wanted me to think, to translate my thoughts in a world where no one cared that Army dress uniforms were the disappointing color of primordial soup, especially if a fourteen-year-old pointed it out to them.\nBut what did it matter what “they” thought? In the privacy of my home, my room, my mind, my words were my own. They were always the right words for me, if not for everyone else. And eventually, if I wrote enough of them, maybe some would accidentally get published. Some did. There was a picture book, an anthology, some short stories, some essays. Whenever I got an offer to do a strange and exciting project, I had the freedom to say “yes!”\nAnd then at the ripe-old age of thirty-one events conspired to bring me something I hadn’t planned for: hitting the New York Times bestseller list with Sherrilyn Kenyon’s Dark-Hunter Companion. It spent two weeks in the same position, at number thirty-one, appropriately enough.\nI don’t doubt that I deserved it; I had gone through a huge learning curve, a year’s worth of work, and several boatloads of stress. What puzzled me was why I couldn’t appreciate it. I’ve always been The Writer, as if I was born with a pen in my hand and an Elvish tattoo on the back of my neck. But I’ve never written for “them.”\nI took a sample class during my audition for the Governor’s School for the Arts—a summer school of “intensive arts training” in South Carolina—where the instructor had gone on for an hour about “truth” and “slice of life.” (Whenever I hear that term I think of pie.) I will forever remember the sneers at the interview, as they looked down their noses at my writing sample—a ten-page section of the climax of my fantasy novel—and said, “Is this indicative of all you write?”\nWould that a moth-winged fairy had descended from the clouds at that moment and bestowed upon me a sparkling tiara with “GENRE FICTION WRITER” written in pink rhinestones across the front. Alas, there were no luminescent bubbles or tinkling bells or showers of magic dust, only the bitter taste of failure in the back of my throat and the compulsion to continue doing something at which I was doomed to never be successful. I imagined myself a twenty-first century Emily Dickinson, ahead of my time, destined to be posthumously famous after the trunks filled with my scribblings were discovered by a distant relative who miraculously cared enough to unlock them. And I was okay with that.\nWhen I got the Governor’s School rejection, I took it out in the side yard and burned it. “If the writing doesn’t pan out,” I told my parents, “I can always go back to acting.” They were not okay with that. So I turned to science.\nIn physics, despite its own dependence on certain self-evident principles and impossible optimal conditions, the answers to most questions were pretty non-negotiable. The speed of light was always c. Diamonds were just trumped-up graphite. A mole was simply a mole, and it was far easier to assume a vacuum than to assume Thoreau was right and you were wrong. There was no “they;” there were just numbers. Best of all, the rainbow was different here. Wavelengths ran from infrared to ultraviolet; there were slow colors and fast colors. Red and blue and green made up the primary palette. Green and red mixed to make yellow. The world reflected what it didn’t absorb. It all made perfect sense. And the entire spectrum, unified, created pure, blinding, perfect white. My little heart soared, and I was over the moon.\nIt was like scientists had always had this hidden, alternative, acceptable vision of the universe, and I had just learned their secret handshake. It intensified my fascination with the world. I questioned everything, because it was put on this earth to be questioned, and we were put on this earth to ask. I majored in Chemistry. My parents were happy. There was only one problem. I was a writer.\nMy father—in an effort to help me find a “real job”—got me in to see a friend of his at the environmental labs of South Carolina Electric and Gas. It was a beautiful trek through the woods, and the office was situated smack dab in the middle of a dam. I paid rapt attention when Dad’s friend explained to me the types of analysis they were doing, and their large-scale implications. And the second he brought me in to tour the lab, I was struck dumb. His voice faded to nothing as the whiteness of it all screamed in my ears. The walls were white; the ceilings were white; the countertops were white. The labcoats were white. White is important in a lab, because lives can depend on the second a liquid changes hue, or the location one drop of a highly reactive solvent is spilled. But it wasn’t beautiful white; it was industrial white. It was the white of a job that never changed, a white that bleached brains into zombification, a white that meant one pipette after another and another and another until your fingers blistered and your mind assumed that vacuum. The only thought in my head was: How long would it be before I snuck in at night and painted the walls rainbow colors? It wasn’t an if, it was a when.\nI moved out of the house and never considered a career in Chemistry again. And a little over a decade later, I was scrolling down once again to see my name on that magical list that tells everyone in the publishing industry how fabulous you are. How successful.\nThe interesting thing about hitting the list was not what happened directly afterward, but what didn’t happen. There was no fanfare or choir of angels. There were no dump trucks full of money on my doorstep (and there wouldn’t be, since I was paid a flat fee for the project). My closest friends lived forty-five minutes away. Not that I was even in the mood to party, having been hit with a major personal trauma the very morning before. But I had paid my dues; I deserved my celebration. I had thrown my heart and soul into this wonderful thing.\nAnd I hadn’t written a word in almost a year. Sometimes, when bad things happen to writers, they don’t write. Lacking that outlet for spontaneous catharsis, all that emotion builds up inside. It grows mold and starts to smell. I hadn’t lost the love for writing or the need to do it, but I had most certainly lost the romance. The motivation. What that bestseller list should have been was a confirmation of my talents, a reminder of how wonderful and special I was. I tried to see it that way. Oh, how I tried. Eleven months into a depression, no one expects to just snap out of it. I had been born with all this contagious enthusiasm—couldn’t I use it on myself? Surely my friends and family would cheer me on. I’d be out of this funk in no time.\nMy parents popped open a bottle of champagne and emailed me a picture of themselves toasting my achievement. I made them my desktop wallpaper, because they looked as happy as I knew I should feel. Then I bought myself a bottle of sparkling pear cider and went to bed early.\nI didn’t expect much at work—a major book distributor—but seeing as our department rolls out the full court press for everything from wedding announcements to thesis delivery, I kept one subtle eye on the congregational “snack shack.” It remained quiet and sheet-cake free. Perhaps people didn’t know? I just can’t assume that everyone in the book industry checks the New York Times list every week.\nOn Friday I printed out an 8x10 cover of Dark-Hunter Companion and pinned it to the wall outside my cubicle, with a little starburst that said, “New York Times # 31” in happy pink highlighter. I announced it as a postscript in Monday’s staff meeting, to which someone responded acerbically, “Just in case you haven’t walked by her office and noticed yet.”\nI took down the poster that afternoon.\nI have done the con circuit for years. I was used to performing to large groups, answering questions and fan mail, receiving gifts, embracing complete strangers, and signing for hours on end, but I was passed up for promotion because I was “just not there yet.” I threw myself into my work, as if I might somehow prove that I was good enough. I wished there was a Cliff Notes of the corporate world—not so I could think like “them,” but so I could assimilate just enough to be left alone. Unfortunately, I had left that possibility behind a long time ago.\nA few weeks ago, I was in a small meeting where I thought myself in safe enough company to make a self-deprecating remark regarding my copious use of the word “thingy” and that status on the New York Times. Five people laughed, but one said, “Aren’t you ever going to let that go?” I wasn’t aware that I was supposed to. It’s part of who I am now, like every Oscar Award winner on the planet. What do I have left to motivate myself to do great things if I let that go?\nJoe Lansdale scolded me this summer on a panel for muttering “newyorktimesbestseller” in the middle of my introduction; I am supposed to sit up straight and say, “Hi. I’m New York Times bestselling author Alethea Kontis.” The crowd laughed, and made me say it again for practice. Ellen Datlow later reminded me that everyone in that room wanted to be me—including Joe. It was a humbling thought.\nIt’s a surreal double life that I lead, but it’s mine, and I wouldn’t have it any other way. A psychic once told me that I was destined for greatness, and that I had an aura that shone like a rainbow. I am not a color; I am a combination of all the colors. Only . . . it seems that one half of me lives in pigment, and the other half in light. Forty hours a week I hike up my waders and make my way through the primordial muck I’ve created around me. The rest of the time, my soul reflects the pure, blinding, perfect white of an empty document or a blank piece of paper, begging me to refract it into stories. And you can bet your ass that the next time I hit that bestseller list, there will be fireworks.\nAlethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie."}