{"fingerprint": "RLIV/dnk3qvdpt0iM4Y1FgFd9ok=", "sitename": "Clarkesworld Magazine", "title": "Mars, Sextants, and Puppets: A Conversation with Mary Robinette Kowal by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kowal_interview_2018/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mars, Sextants, and Puppets: A Conversation with Mary Robinette Kowal by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nMars, Sextants, and Puppets: A Conversation with Mary Robinette Kowal\nMars is so close, yet it seems so far. The red planet has always been a mystery—inspiring scientists, authors, and stargazers. It may come as a surprise that we already have the tech to put people on that rust colored planet, but it simply comes down to will and wealth. For now, it’ll have to remain the only planet in our solar system populated solely by robots.\nBut what if we landed on the moon back in the ’60s and never stopped reaching?\nMary Robinette Kowal’s new alternate history novel, The Fated Sky pulls us back into the heyday of astronauts that she crafted in The Calculating Stars. After setting up shop on the moon, humanity set its sights on the red planet. It’s 1961 and Elma “Lady Astronaut” York joins the team of astronauts on the first mission ferrying humans to Mars. She must navigate treacherous personal and professional relationships while tackling the dangers of space.\nAuthor, professional puppeteer, voice actor, and collector of manual typewriters, Mary Robinette Kowal has earned the UNIMA-USA Citations of Excellence for her puppeteer work and Hugo, Nebula, and Campbell awards for her writing. Her newest novel The Fated Sky is available August 21 from Tor Books.\nScience fiction frequently looks to the future, but sometimes it analyzes the past through a different lens. What made you choose the latter with your newest novel?\nI’ve always been fascinated by how much we accomplished with the early space program. There’s a joke in the space industry that Mars is always thirty years away. Most of that comes down to funding. So, what would happen if we had continued to throw money at the space program at the rate we did during the Space Race?\nThe relationship between Nathaniel and Elma struck me as a lynchpin in each of the character’s lives. The relationship gives each person depth and makes them feel real. Do you feel that a character’s relationships, whether personal, professional, or romantic are just as important as their personality or motivations?\nI think that it’s impossible to separate the two. Who we have relationships with and the ways in which we maintain them are directly related to our personality and motivations.\nThe tiny technical details really bring this story of space exploration in an alternate 1960s to life. What research did you do find such wonderful details?\nI read a lot of astronaut autobiographies as well as engaging a couple of science experts. I worked with Stephen Granade, who is an actual rocket scientist, as well as being fortunate enough to have some astronauts, Kjell Lindgren and Cady Coleman, who were kind enough to offer their insight into what the job is like. I say, “offer their insights” but really what I mean is that I would often hit a scene where I understood the emotional arc and needed to have my character doing something that demonstrated competence. I would write things like, “The captain said, “[jargon]” as he [jargoned] the [jargon]” and then send it off to the appropriate expert to play Mad Libs with. Parts of this book were literally written by astronauts.\nHow much of the tech featured in your book existed in the 1960s and how much of it did you have to invent to make a lunar colony and a trip to Mars possible?\nIn 1947, Wernher von Braun, widely regarded as the father of modern rocketry, wrote a novel called Project Mars: A Technical Tale in which he posited a Mars mission using 1940s technology. I based the Mars mission on that. Now, his specific plans would have killed everyone on landing, because he didn’t know how thin Mars’ atmosphere was but if the mission had actually been approved, they would have sent probes and landers ahead of crewed spaceflight and modified their plans.\nIn other words, there’s a pretty good chance that we could already be on Mars.\nThe one thing that I made up is the refueling stations with Atomic Oxygen, but that idea was taken from an article proposed in the 1950s. How would it have worked in practical terms? No idea. Von Braun proposed a nuclear-powered ship. The exact propulsion of the First Mars Expedition is one of the few things that I hand-wave past.\nWhat might be minor occurrences on Earth can become life-threatening and mission critical in space. What is one mundane problem that people deal with regularly that becomes life threatening once we leave the planet?\nPretty much everything, honestly. If you lose power, you lose air circulation and can die of carbon dioxide poisoning, even if you have enough oxygen. A hole in your clothes is no big deal here. On a spacewalk, it’ll probably kill you. A backed-up toilet could allow globules of urine to float into the electrical system. A broken bone won’t heal right without gravity.\nThe sextant is a standout object in your novel. What is it about the apparatus that captured your imagination? Have you ever used one yourself to navigate?\nThat was straight out of Apollo-era navigation. In his autobiography, Carrying the Fire, Michael Collins—who piloted the Command Module on Apollo 11—talks at great length about learning to use one and the difficulties of sighting on stars. Astronauts today are still trained on using it as a backup device. I’ve held a sextant and taken a tutorial on how they are used, but never attempted to navigate by one.\nYou’ve spoken a bit about how puppetry has influenced your writing, but what about the other way around? Has your experience writing changed your work as a puppeteer?\nThe only time I’ve really noticed it was when I was taking an eight-week training course at the Jim Henson company. It was focused on improv and what I found was that my narrative brain gave me an understanding of what kinds of conflicts to introduce in a sketch. Other than that? The biggest influence is that I have less time for puppetry than before.\nIf you had to pick one episode of Writing Excuses podcast, which one do you think would be most valuable to new writers?\nThat is going to vary wildly from writer to writer. Everyone comes into writing with different strengths and challenges. So let me recommend Emma Newman’s episode “Fear and Writing” in which she talks about how to handle the fears that come as part of writing.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}