{"fingerprint": "SCxCsX7tlbtPKqcimtrqPM4kLJo=", "sitename": "Clarkesworld Magazine", "title": "To Save Ourselves: A Conversation with Nancy Kress by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kress_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Save Ourselves: A Conversation with Nancy Kress by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nTo Save Ourselves: A Conversation with Nancy Kress\nAfter the Fall, Before the Fall, During the Fall by Nancy Kress opens with a deformed teenage boy kidnapping a baby from a hysterical mother. The boy, Pete, has come from the future, using alien technology, to save the baby from the ecological disaster that will soon befall the world she lives in.\nPete is also stealing the child to bolster the gene pool of the future, to bring a fertile human into a time when 26 humans, most of them infertile, fight to keep the human race alive.\nThe 26 are lead by the brilliant McAllister and live in the Shell, which is sparsely furnished habitat created by the Tesslies, an alien race they believe to be responsible for the devastation of the world.\nThe novel weaves three timelines: 2013, 2014, and 2035. The 2013 story arc follows Julie Kahn, a mathematician consulting for the FBI. Along with Special Agent in Charge Gordon Fairford, Kahn has noticed a pattern to a series of kidnappings and burglaries and developed predictive algorithms. In 2014, there's unusual geological activity under the Yellowstone Caldera and in the Cannery Islands; K. planticola, a mutating bacteria, secretes too much alcohol and kills plants at the roots. In 2035, the majority of humankind is infertile.\nNancy Kress is the best-selling author of more than two dozen books. She has written novels, such as Beggars in Spain, Dogs, Probability Space, and Steal across the Sky, as well as short story collections and books about writing. Her next book, Flash Point, is due out from Viking in the fall.\nMany of Kress' stories, long and short, involve genetics and speculations about the near future. She blends scientific rigor with intensely human characters. The result is often intensely intimate, and always character-driven. Kress has won the Campbell, Hugo, Nebula, and Sturgeon Awards, among others.\nBelow, Kress talks about After the Fall, Before the Fall, During the Fall, writing, teaching, Gaia, and giving something back to the field. Be forewarned: Some events of the book will be revealed.\nIn the first pages of After the Fall, we meet Pete,who's kidnapping a baby. And yet it's easy to instantly sympathize with him. How did you do that?\n[Laughs.] I don't know. I got a review from a newspaper somewhere that compared McAllister to Fagin [from Charles Dickens' Oliver Twist], teaching this band of juvenile delinquents to steal and I thought, \"That's not exactly the book I wrote.\"[Pete and the other survivors] are trying to ensure the survival of the human race and also save these children from the destruction that they know is coming. And that's not exactly what Fagin is doing. Pete's basically a good kid. He has grown up with an odd set of morals. They're the morals that fit the situation and, from the outside, his actions probably look despicable, stealing a baby from a hysterical mother, but I wanted to show how it looks to him, on the inside. Maybe that's why he's coming across as sympathetic. I'm glad that he is, because I had a lot of sympathy for him. They're doing the best they can in an impossible situation.\nThe novel seems to hinge on McAllister's wanting Pete to not repeat the mistakes of the past.\nRight, that's part of it. The other thing is that I almost never—I was thinking about this the other day—I almost never write villains and there really aren't any villains in this book. McAllister and her band of \"juvenile delinquents\" are not villains. The Tesslies are actually trying to rescue what they can and keep this planet going on their own peculiar terms. Julie's not a villain. Gordon's not a villain. The only villain, I guess if you want to count it, is the planet, and it's just going to preserve itself by getting rid of whatever is making conditions [not conducive to] life and, in the moment, that's us.\nThen what do you bounce the protagonist off of?\nSometimes himself, sometimes the fact that humans being being what we are, want conflicting things, and you can't have both, clashes like love versus loyalty, duty versus love, those kinds of things. Sometimes it's bad guys. I won't say I never do villains. But the kind of pure evil villain that's so common in SF, I just don't buy. There's a couple of those guys in history, but not very many. Most people are doing what seems to them reasonable at the time.\nIt seems like McAllister does everything she can to prevent the kids from thinking in terms of villains. In the end, though, we find out that she has made an assumption about the Tesslies that casts them as villains.\nYes, she made a mistake. She, and everybody else in the Shell, thought the Tesslies had destroyed the earth, and it turns out, of course, that they hadn't. She has made a misassumption. The book is full of misassumptions. People have assumed the wrong thing in a number of places and that was one thing I was going for.\nWhere did you start After the Fall? What came first?\n[Laughs.] It started with the Gaia theory from James Lovelock which came out in the '70s, and which now has pretty much fallen into some disrepute, but I was always fascinated by it. I got his book and I read it, and his basic theory is that the earth can be considered as a large self-regulating, non-conscious entity adjusting itself endlessly to make conditions possible for life. For instance, with all the salt that's washed down into the ocean from the rivers over the millennia, it should be saltier than it is, but it isn't. There are mechanisms for removing the salt down on the ocean floor, and locking it up in a way that the ocean doesn't get too salty to support fish, to support life, so that cells don't burst. And this has turned around in my mind for 30 years now, and at one point it came to me, \"Well, if the earth is trying to remove conditions that are inimical to life, the thing on it right now that's the most inimical to life is probably us, with the climate change, pollution, and dead zones in the ocean.\" I thought, \"What if the earth started to fight back?\"\nAnd that's an idea, that's not a character. Usually characters come to me first. But in this case, the idea came to me first and it came through rational thinking. The part that did not come through rational thinking was Pete, because the characters never do. They sort of pop into my mind. I saw what he was trying to do. He was trying to get kids from the past. And the first scene, as often happens when I write, came almost full, and I wrote it down. After I get a first scene, I have to look at it and think, \"Okay, where does this go from here? How does this first scene and this idea become a story?\"\nDid Pete surprise you at all while you were writing After the Fall?\nAll my characters surprise me. I didn't realize he was in love in a 15-year-old-boy sort of way with McAllister, but that came out as I was writing. I didn't realize that he was going to have quite so many 15-year-old-boy sulks, but that came out, too, as I was writing. I grew quite fond of Pete.\nIt seems as though Pete and of Julie may be working at cross-purposes.\nWell, Julie is the grownup. Pete is the 15-year-old, floundering around, prey to his emotions, doing the best he can, making mistakes, flying off the handle. Julie makes rational decisions based on whatever information she has and she has the adult emotions of wanting to protect and care for her daughter [Alicia]. And Julie's reliable, which Pete certainly isn't. They're not really working at cross-purposes. Pete is trying to save his world and Julie is trying to save her daughter, which is all she can save as her own world.\nHow on earth does Julie make the decision to give up Alicia?\nAt first, she just intends to try to confront Pete and maybe stop him. Then as she realizes what is happening [in the natural world], she has to be try to get the truth. When she realizes what the truth is, she wants to go with him. And when she realizes she can't go, at least she can send Alicia. But her initial impulse is to take herself and Alicia, because our initial impulse is always to save ourselves and our children. Incidentally, if the Canary Islands ever did blow in that way, you would get a five-hour warning for a tidal wave that would roll across the Atlantic. I did a lot of research for this story. The science is reasonably accurate.\nAre there places where you had to tinker with the science a little, bend the rules?\nThe Canary Islands blowing is controversial. Half of it did sheer off at one point in history and it did cause a massive tidal wave. I moved the fault line a little bit, so that when the mountain sheers and slides, it does set off the kind of an earthquake that in turn sets off the tsunami. It's at least theoretically possible. So it isn't that I changed the science, but I took the most drastic possible view.\nI had known some of the science beforehand. As soon as I started writing and researching, I had a nice file of interesting material. The Canary Island tsunami was there; the fact that the Yellowstone Caldera could blow at any time was there. And in this file I also had the K. planticola, the bacteria that creates too much alcohol. It's a common form that is on plants already. They did try in Germany to create an alternate version that would convert plant waste to alcohol as a byproduct, and they found out that it would kill all the plants, so they obviously didn't do anything with it. It never got out of the lab. But because it was in my file, it was something I could do something with. I was thinking about it.\nAnd also, at the time I was writing this, Science News came out with a follow-up on the Iceland volcano. So I thought, \"Well, that's interesting, too. I can use more volcanoes like that.\" [Laughs.] So I looked around until I found information on that. Science fiction writers, they do two things. First of all, they take the things that don't ordinarily go together and stick them together. And secondly, they try the best they can to make a little bit of knowledge look like a lot of knowledge. Those are two completely necessary tools for science fiction writing.\nYou move among three time lines and points of view in After the Fall. Did you write each chapter in the order they appear?\nThe first part appears in the order I wrote it. And then, for the second half, I was going on a roll with Pete, so I set Julie aside and I wrote all of the rest of his sections up till the end. Then I went back and wrote all of Julie's sections up till the final scene. This is the way I always write. I never really know how things are going to turn till I'm halfway through. When I don't know where I'm going, I kind of have to follow along and try different paths.\nAre you ever going to return to these characters, to Pete and McAllister and Alicia and the rest?\nI haven't thought about it, but you never know. It's possible. There's a bunch of them now loose on the planet trying to restart civilization. Incidentally, one of the characters that I had most fun writing was Darlene: the acerbic and unrepentant Christian who keeps assuming that everything is Satan's work. [Laughs.] If you're going to pick up a random assortment of people, the way the Tesslies did, snatching whoever happened to be alone and available, you're going to end up with a couple strange people in the group. I could return to them, yeah.\nFlash Point comes out in the fall?\nYes. It's a YA science fiction set on near-future earth, and it's about teens who are involved in a reality show. That one started with a character. I had in my mind this really desperate teenage girl, in—it's not a dystopian U.S., but it's a U.S. in a bad economic slump, even worse than the one we are in—and her parents are dead, she has a young sister she's trying to support and a grandmother who was supporting them both and is now dying, and this girl desperately needs a job. So I started with her in a position where she's applying along with several hundred other girls for a job and the story went from there.\nWas writing YA terribly different than writing for an older audience?\nNo, it really wasn't. YA has changed so much that there really isn't much of a line anymore, except that the protagonists are teenagers. You're allowed sex, you're allowed violence, you're allowed all kinds of stuff.\nSounds like there's a similarity between the protagonist of Flash Point and Pete from After the Fall—desperation and the balancing of the needs of family and of the individual. Is there a lot of Pete in this new character?\nThis girl is much different. She's very smart. She's educated in terms of our world, anyway. She's much more worldly. She's much more knowledgeable than from Pete. And she's functioning in a world she understands.\nNot much sulking?\n[Laughs.] No, not much sulking. She doesn't have time to sulk. She's got too many problems to sulk.\nWhat are you working on now?\nI'm working on a new YA [book]. And I don't want to talk about it yet because I don't like to talk about work in progress. But the decision to write YA was simply, like all of my writing, sort of a non-decision. I kind of write when it comes to me. I know writers who say, \"Oh, I've got a million ideas and I just need to develop them.\" I'm not that writer. I don't get very many ideas that I'm excited about enough to write. And sometimes, there's a stretch of a month or two where there aren't any ideas I'm excited about to write, and that makes me really, really uneasy. Just before I started this book, there had been a month with no writing. And then this idea came to me. I'm always so grateful when I get one that I like. I can't write a synopsis. I've never sold a book on a synopsis in my life. I always write the whole book, because I don't know where they're going to go. I dive in and then plot as I go along. I don't even know if I can finish it.\nNow you just got back from a two weeks of teaching Taos Toolbox.\nI love to teach. And I do a lot of workshops here and there. I tend to rely heavily on critique workshops because I think the best way to learn to write is to actually write, and then get feedback on it, and then re-write it again. These workshops where you're given prompts and the ideas you're supposed to be inspired and all the rest of it, I don't much hold with those. Writing is not a matter of inspiration except for your initial idea. Writing is a matter of sitting down and doing it. And you have to do a lot of it to get publishable. I know Robert Silverberg sold his first story, but we can't all be Robert Silverberg now can we? You can't teach imagination, and you can't teach a feeling for English prose, but you can teach craftsmanship.\nNow with the books you've written about elements of craft, do you ever get tired of people asking you about viewpoint or talking about description or characterization? Does it ever get old?\nIt isn't that it gets old but after a workshop like Taos Toolbox, I get burned out for a while. I don't want to see a student manuscript for another couple of months. But that works out fine. Because the next one I do will be in October in Seattle, and by that time, I'll be ready again. I like teaching. I just would not want to do it full-time.\nDoes teaching feed the writing at all?\nNo. In fact, it probably takes the same parts of the brain. The thing about writing is that it's a solitary activity. It's you and your computer and a bunch of people who don't exist. And when you spend a lot of your day doing that, it's good to get out and talk with other people who are in your field. I like conventions. I like SF parties. I like teaching workshops. I like the contact with people. I'm married, so I see my husband, but he also has an actual job, and my kids are grown and gone. So I need this, and also I like it. I like giving back something to the field.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}