{"fingerprint": "4yJVjlqiDVTgNpVjXByyrcaTZ4E=", "sitename": "Clarkesworld Magazine", "title": "Little Animals by Nancy Kress", "author": "Nancy Kress", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kress_06_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Little Animals by Nancy Kress", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8710 words, novelette\n Little Animals\n 1.\n “I’ve got a signal,” Cora said. “Elena, come look!”\n I rushed to Cora’s bank of computers. For six long, working-into-the-evening days, we’d gotten only the faintest of quantum signals, nothing usable. Our grant only gave us three weeks on the TU Delft equipment. Cora complained that Americans somehow seem to never get as much quantum-tech time as anybody else, which wasn’t fair . . . but, then, what didn’t Cora complain about?\n I said, “Can you lock onto the signal? Is it strong enough?”\n “Yes! And—oh my gods you won’t believe this—the subject is looking into a mirror!”\n I didn’t know how she could tell that; the image on her screen was so watery and shifting it looked as if it were melting. Frantically Cora worked the amplifying equipment, her fingers flying over keys and buttons. If she couldn’t bring the image into sharper focus within the next few seconds, we’d lose this subject, too.\n The portrait emerged. Cora breathed, “The clothing is right, wool, simple cut . . . Come on, you fucker, focus!” And then, “Be Vermeer!”\n It wasn’t. The image sharpening on the screen was a plain-faced, middle-aged woman in an unadorned gray gown laced up the front, no trimming on the round neck of her chemise, who stood pulling her hair into a tight bun. As the shimmering image approached maximum resolution, she set a white cap with lappets on her head.\n Cora froze the picture, locking in the contact, and pounded her fist on the small table holding her coffee. The coffee cup jumped with each blow. “Fuck, fuck, fuck! It’s not him!”\n We’d been looking for Johannes Vermeer anywhere in mid-seventeenth century. It wasn’t that much of a long shot; Vermeer never left Delft and creative people put out the strongest signals. Unfortunately, that sometimes led to those who lived with creatives. Two other postdocs in my year, based at Great Neck on Long Island, New York, had locked onto F. Scott Fitzgerald’s gardener, who had never exchanged a single word with either Scott or Zelda and whose memories consisted largely of plant blight.\n I said to Cora, “Maybe it’s someone in Vermeer’s household? Catharina?”\n “Dressed like that? Don’t be stupid! And look at the time indicator—1687! Vermeer was already dead. Oh, just shoot me now.”\n She didn’t apologize for that remark. Probably she didn’t even see that she should. Disappointment always turned Cora nasty.\n She said, “Now we’re stuck with this, and from her clothing she’s a nonentity, neither servant nor creator. Well, get Jan.”\n “I already pinged him.” No apology for her nastiness; there never was.\n An initial signal, the only one with a time indicator, locked the equipment onto a subject. Otherwise, signals would not be reliable, or reliably accessed. Too many researchers never found anyone during their grant time; we could not afford to risk letting this subject go and starting again.\n Jan de Knuyt appeared in the doorway. An historian of seventeenth-century Europe, he spoke five languages plus Latin. His doctorate was granted last year, and while he searched for a university position, he aided whatever visiting brain researchers had been fortunate enough to gain time on TU Delft’s superb equipment. Slightly built, shy, and occasionally awkward, he had an excellent reputation as a thorough researcher.\n Jan smiled at me and said in his careful English with its Dutch accent, “Whom have you locked?”\n “God knows,” Cora said. “Anything you can tell us from the scan . . . it’s not fair! She’s probably nobody!”\n Jan studied the image frozen on Elena’s screen. “Yes and no. She is not a creative, but she may be rewarding.”\n I blurted, “You recognize her?”\n “I do. She is Maria van Leeuwenhoek, the daughter of Antonj van Leeuwenhoek.”\n “Are you sure?” Cora said.\n “Yes. There is only one known sketch of her, by the artist who made some of the drawings of Leeuwenhoek’s ‘little animals.’ Leeuwenhoek himself couldn’t draw, you know. His second wife was sickly, and so Maria ran the household and occasionally assisted her father as he founded the science of microbiology.”\n Jan smiled at me. “Elena, you may receive some quite interesting experiences.”\n The pairing of an engineer with a receiver is an art, not a science. I didn’t like Cora, and Cora didn’t like much of anybody, but I appreciated her skill. Cross-temporal brain research, too, is as much an art as a science, although not in Cora’s view. She was interested in equipment, results, and ambitious publication.\n For two centuries scientists have known that the brain exudes an electromagnetic field, and for nearly a century, that it operates on entangled quantum effects. The Chen equations upended brain research when the brilliant researcher Luuk Meijer showed that in conjunction with tachyons, the equations implied the theoretical possibility of entangling brains separated by centuries—but only in certain suggestible persons with certain brain-activity patterns. Ten years later, engineers at Technische Universiteit Delft had created the equipment, however imperfectly, and the Netherlands became the center of world research into Meijer entanglements.\n Nothing about a Meijer entanglement is certain.\n The subject is usually, but not always, a creative person, someone whose mind is as much concerned with what does not exist as with what does (Fitzgerald’s gardener wrote poetry, badly). The receiver must be a “sensitive and suggestible personality” and is usually, but not always, a borderline depressive. Memories drawn from the subject are usually, but not always, emotional recollections that made strong impressions on him or her. Memories are, usually but not always, clear enough to make sense of. The receiver can usually, but not always, remember the experiences copied from the subject’s mind and usually, but not always, sort them out from the receiver’s own life experiences: Did this happen to the subject or did it happen to me? Borderline depressives with intensive training and good real-world memories are best at this. No one knows why.\n I am a strongly suggestible, borderline depressive with a good memory and superb training.\n And unlike Cora or Jan or the professors in my very expensive education, I am beginning to think the entire process is unjust to everyone, in every time.\n The UT Delft campus, rebuilt in the Brutalist style decades ago when it was moved out of city, is a charmless collection of rectangular buildings in a charmless suburb. I had insisted on living in the old city, and not with Cora. I paid for my tiny apartment, expensive but worth it, by borrowing against the coming inheritance from my father. Just getting off the Hyper-Loop at Market Square lifted my heart. Against the sunset, Nieuwe Kerk’s magnificent bell tower stood shadowed over its lower third, golden above. Built in the fourteenth century, the cathedral housed the tombs of kings, queens, and princes of the House of Orange—and whose imagination would not be fired by that?\n Maria van Leeuwenhoek, going to market for her father, would have seen Nieuwe Kerk every day.\n As I hurried over a stone bridge spanning a canal, the tower carillon chimed a quarter to nine. I couldn’t be late with my phone call to Layla. She didn’t endure any deviation from routine as well as she had before . . .\n Just “before.”\n In the seclusion of my apartment, I poured a glass of scotch (“Dutch courage”—and where did that phrase come from? Jan would know.). I gulped a healthy mouthful and said to the wall screen, “Phone Layla McCarthy.” A second later the face of my beautiful younger sister appeared on the screen.\n Noon in California. Layla stood in glaring sunlight in our dead father’s bedroom. Chaos surrounded her: packing boxes, clothing, items pulled from closets or drawers, rug rolled into a haphazard cylinder, paintings pulled from walls. But today Layla seemed able to cope, unlike yesterday. She was out of her bathrobe; her hair was combed; her gaze met mine; no dead look in her eyes. She even managed a faint smile.\n “Morning, Ellie. This probably doesn’t look like progress, but it is. Those boxes there—” she pointed “—go to the Salvation Army. That big box is trash. The art I’m going to have appraised.”\n “You’re doing a wonderful job,” I said, as apprehension was replaced by guilt. I should be there helping Layla sort through our father’s things, put the house on the market, meet with the estate lawyer. On the other hand, maybe all this activity was good for Layla, taking her out of herself. I could still see tension in the way her body held itself, the tension that never really left her, but compared to yesterday’s monochrome lethargy, Layla looked okay.\n Oh, God, please let her be okay. Not like—say it, Elena, if only to yourself—not like Daddy.\n She said, “How’s it going in Delft?”\n Another good sign: interest in someone else.\n “We locked onto a subject. Not, however, Vermeer.”\n I told her about the lock, but only until I could see her interest drift away. It didn’t take long. We talked then about the house: who might buy it, what they might pay, what needed to be done before it went on the market, and who needed to be hired to do it. Layla didn’t talk long, but she did talk, and when she ended the call, I poured away the rest of my Scotch. I didn’t need it. Layla was functional, at least for the moment, and I could concentrate on tomorrow in the lab.\n The rest of the evening, I studied the file Jan sent me about Maria van Leeuwenhoek. Born in 1656, she was the only survivor of the six children Leeuwenhoek fathered with two wives. Maria’s mother died when Maria was eleven. She acquired a stepmother, Cornelia, in 1671, the same year that Leeuwenhoek began making microscopes, which put him on the path to discovering the astonishing worlds of his microscopic “animalcules.”\n Cornelia went into a deep depression after the death of her infant son and some authorities thought she left Leeuwenhoek’s home to live with her sister’s family. Maria assumed the running of the modest household. She may also have assisted her father with his work. She never married, never left his house. She buried Leeuwenhoek when he died, at age ninety, and sent some microscopes that her father had willed to the Royal Society of London For Improving Natural Knowledge. When Maria was eighty-three, she arranged to have a monument set up on his grave. Jan had translated into English the short inscription, although my immersive language training in Dutch could probably have caught the gist of the epitaph. Birth and death dates, membership in the Royal Society, and a poem by someone named Huibert Corneliszoon Poot, urging visitors to have reverence for Leeuwenhoek’s great age and “wondrous merit.” Maria was buried beside him, but without any poem; mere daughters didn’t get poems. She was ninety-five.\n And that was it—all the verifiable information that history had on Maria van Leeuwenhoek.\n Still, I was glad of Jan’s file. If you’re going to invade someone’s mind, it’s good to know whatever you can about who she might be.\n First contact with a subject is exciting and fearful both: an explorer’s voyage into a new world. I was experienced enough as a receiver to know my mind would not disappear irretrievably into the subject’s mind (it has happened). But Maria and I would become locked, and every time Cora hooked up the electrodes implanted in my brain to her complex equipment, it was Maria’s memories I would explore. She would, of course, never know I was there. Unlike the explorers to the New World during the Dutch golden age, I would alter nothing, an invisible presence.\n And her presence in my mind? Sometimes a Meijer Entanglement was sharp and yielded clear images and words. Other times, not so much. A researcher in Copenhagen had managed to lock onto Werner Heisenberg during his famous World War II visit to the Jewish physicist Niels Bohr, Heisenberg’s former mentor, in Nazi-occupied Denmark. However, the entanglement had yielded only the vaguest images and no dialogue at all. All the receiver had gotten was Heisenberg’s strong emotion of urgency—but about what? That Bohr should save his own life by joining the Nazi bomb effort? That he should try to get out of occupied Denmark if he still could? Historians of science reached epic heights of frustration over that one.\n “Ready?” Cora said to me.\n I lay on a cot, hooked to computers that included state-of-the-art deep-image reconstruction equipment, technology that had existed for fifty years but recently taken a punctuated-evolution leap. It would translate my brain waves into AI-enhanced images, but it could not capture words. Immediately after the session, I would record whatever was said by and to Maria, assuming the words were clear enough and my immersive training in Dutch extensive enough. Jan would help with that. I glimpsed him entering the room and standing respectfully at the back, behind the physician mandatory for all first contacts.\n I closed my eyes and said, “Ready.”\n The lab went away, and another room took its place, a room of wide-planked wooden floors, small-mullioned windows behind partially closed shutters, candles burning in wall sconces. Maria’s—now my—memories were shifty, not yet sharp.\n A woman lies on a curtained bed; she is clearly dead. Other people stand on the far side of the bed, although not Leuwenhoek himself. A tsunami of childish grief swells through my mind as I become accustomed to being Maria and move deeper into her/our memory.\n I kneel and touch the dead woman’s face. “Mutter!”\n Someone pulls me to my feet and gently leads me from the room and down a narrow hallway to Father’s workroom. Father sits reading a book. He looks up as I tell him that Mother is dead.\n The memory wavered again; I still hadn’t completely settled into Maria’s mind. Leeuwenhoek’s reply to her was too complicated for me to catch all of it, but I saw the brief and perfunctory look of sorrow on his face. And as he held up the book and babbled on, I heard a word in unexpected English.\n Then, abruptly, I was fully there.\n Anger rises in me, anger I must not show Father. I bow my head and back out from the room.\n Maria dissolved in my mind. I was myself again, the entanglement collapsed.\n I sat up even before the doctor could check my vitals or Cora disconnect my implants. “I couldn’t get all the Dutch when Leeuwenhoek was speaking. But I think he said he was sorry that Maria’s mother—he did not say ‘my wife’—had died, but most of what he said pertained to a book he’d been reading. And he said a word in English. ‘Microphagia.’”\n Jan’s eyes widened. “Yes? You are sure? Microphagia?”\n “I’m sure. What is that?”\n Cora said, “We need to record the dialogue before Elena forgets it!”\n “I won’t forget it,” I said.\n Jan said, “You were in 1666, the year Barbara van Leeuwenhoek died. The year before, Robert Hooke published Micrographia, the first book about items viewed through a microscope. It is speculated that the book was what started Leeuwenhoek thinking about how to build a much better microscope. But Leeuwenhoek couldn’t read English, so perhaps at this time he merely studied the pictures? Could you tell?”\n “No.”\n Cora said, “Record the damn dialogue!”\n We did. Afterward, Jan said quietly, “You are distressed. Because Leeuwenhoek was more interested in the book than in his wife’s death.”\n “Or his daughter,” I said. “She was eleven years old!”\n “Yes,” Jan said, and in his voice I heard the empathy that had been missing from Leeuwenhoek. “In all contemporary accounts Leeuwenhoek is portrayed as unemotional, even cold. His work mattered supremely to him.”\n “Oh, who cares what mattered most to him,” Cora said. “These images are okay for a first contact. If you can sharpen them as we go on, Elena, publication should get us both really good tenure-track offers! Are you up for a second session right away? Doctor?”\n The physician who’d taken my vital signs said in English that my degree of weakness was usual after a session but not excessive.\n Cora turned to me. “Doctor says you’re good to go!”\n I didn’t want to. Maria’s grief still pulled at my mind, as debilitating for me as my fatigue. It is draining to inhabit two minds at once, and not easy to shed feelings acquired from the mind not one’s own. But maybe the next session would be happier, dispelling the emotion of the previous one. That happened sometimes. But if the second session was also unhappy . . .\n Jan watched my face. “You are not required, Elena.”\n “No. I want to.”\n “Brilliant!” Cora said. “Let’s go!”\n This session was entirely different.\n I hurry along a canal edged with poplars, the Nieuwe Kerk bell tower receding behind me in the pink-and-gold dawn. Frost silvers the ground. I pull my shawl more tightly around my breasts. Bells chime, the sound clear but not as loud as the single word I whisper over and over—a song, a prayer—Willem, Willem, Willem . . .\n Willem?\n He waits beside the canal, leaning against a tree, straightening the moment he sees me and rushing forward. Then I am crushed against the full-skirted blue coat of his uniform. Our lips find each other, and sweetness blossoms in me, and I am so light, lighter than air, in a moment that I wish to last forever.\n He murmurs, “I love you,” and I murmur back, “Forever.”\n Between kisses, Willem tells me he must go, his something, and why, but he will return soon. “My father,” I say, and Willem answers that he will talk to my father, we will be together, we will marry. All when the war is over.\n The carillon in the city sounds again, and then he is gone. But my happiness remains, even as I hurry home, even as the bells chime that “forever” has been less than fifteen minutes.\n The entanglement collapsed as Maria’s emotion calmed. I was back in the TU Delft lab. No Willem, no bright dreams of youth, just the doctor running his instruments over my heart, head, and wrist as Cora cawed triumphantly.\n “Much clearer this time! Brilliant! What was the dialogue?”\n I repeated it all, including the Dutch words I didn’t know when Willem was explaining why he must leave. I looked inquiringly at Jan.\n He said, “Willem said his company was ready to march that day. He wore a fusilier’s uniform, probably from the Third Anglo-Dutch War.I will need to research more. If it is so, the year is between 1672 and 1674. Maria is sixteen or seventeen or eighteen. The war with England took place mostly at sea, but the Dutch Republic was also at war with England’s ally, France, and the land fighting took heavy casualties. Very heavy.”\n He did not need to say more. Maria van Leeuwenhoek never married, never left her father’s house. But I had not experienced Willem’s future death, if that was what had happened, only her happiness by the canal, and that happiness lingered in my mind like the scent of roses after one has left the garden.\n Maybe that residual, secondhand happiness showed on my face. Because Jan—shy, formal, awkward when not discussing history—stopped me in the corridor and asked me to dinner. And I might have said yes, even though two sessions had left me very tired, except that he added, “But I will understand if it is too soon after your father.”\n He knew. How much did he know? All of it? He was, after all, a researcher.\n “No,” I said, far too harshly. “No. I can’t.”\n I moved away from him.\n Borderline depressives learn to make themselves do the things they know will lift their mood. Mine had been crashed by my own unfair rudeness to Jan. So despite the fatigue of a double session, I walked much of the way home, the afternoon sun warm on my face. Poplars, straight and strong as soldiers, were doubled in the water of the canals. As I entered Market Square, the Nieuwe Kerk bell ringer began to play the carillon for a summer concert. The bells sounded fuller, richer than in Maria’s time; there were more of them. I sat in a café with a glass of wine, savoring it, and watched bicycles cross the square, tourists gawk at the cathedral, children chase pigeons.\n There are sometimes advantages to being a “suggestible person,” even if the “suggestions” come from oneself. I lost myself in the wine, the music, the lovely light on the face of the bell tower. I let them all wash me free of the seventeenth century, and of my own.\n 2.\n Cora said, “You’re late.”\n “Yes,” I said, “I’m sorry, the Loop was—”\n “I don’t care. Get ready for the session.”\n I glanced at Jan, who looked embarrassed. This third session seemed unpleasant even before it began.\n But not after I entered Maria’s brain. Then things were only strange.\n I stand beside Father, holding out my index finger. A sharp jab—he rams a small knife into my finger and bright red blossoms on the tip. Carefully, he fastens the pin to the platform of his latest small, single-lensed microscope, holds it to the light, and begins moving the screw that adjusted distance. I put my finger into my mouth and suck on it. “I may go now, Father?”\n “Certainly not. You will take notes. Pieter!”\n The elderly artist comes forward, carrying paper and pen.\n I say, “But I must go now. To . . . to church.”\n Father frowns up at me and says what he always says, “Domheid. Waanvoorstellingen. I need you here.”\n “But—”\n “Enough! Bring the book!”\n Resentment. Despair. Obedience.\n The entanglement collapsed.\n “Good enough, I guess,” Cora said grudgingly. “The images aren’t as sharp as yesterday’s second session. Don’t get sloppy on me, Elena!”\n “It’s not my ‘sloppiness,’” I said. God, I disliked her. “The session was . . . strange. Maria was distracted. Half her mind was filled with an image of Willem. I had the impression she was supposed to meet him at the church, until her father derailed that. Jan, what does ‘domheid’ mean?”\n “Stupidity.”\n “And ‘waanvoorstellingen’?”\n “Delusion. Which of them said that?”\n “Antonj, to Maria.”\n “About what?”\n “Going to church. She said—”\n “If the historian doesn’t mind,” Cora said, “maybe we could get Elena’s recollections of the conversation recorded before she forgets its sequence?”\n So it was Jan that she was furious with. Why?\n He smiled at me. “We will start from the beginning, then. But first, I will say only that Leeuwenhoek had the reputation of being—what is it you Americans say? A ‘stone-cold rationalist,’ scornful of the beliefs of anything supernatural. For him, there existed nothing he could not touch or see.”\n “I don’t think Maria was really going to church. I think she was supposed to meet Willem in Nieuwe Kerk.”\n “You think?” Cora said, “Don’t you know? You were there in her memories! God!”\n Jan said mildly, “Memories carry secondary impressions and emotion. Those are also information. In 1674 Leeuwenhoek wrote to the Royal Society about examining blood cells. So now we have the information that in that year Willem is not yet gone from Maria’s life. Yes, Cora, we will begin now.”\n My call to Layla’s cell was answered by our cousin Donna and cold slid down my spine.\n “Where is she?”\n “Back in the hospital,” Donna said. “Your father’s neighbor called me. I’m sorry, Elena.” But Donna’s voice held undertones of impatience. She had never said so outright, but I knew that at some level, Donna considered depression, even clinical depression, to be a selfish indulgence. She believed in the worst of brisk-people clichés: “Just snap out of it.” “Just get on with it.” “Don’t think about yourself so much.” Domheid. Waanvoorstellingen.\n I said, “What happened?”\n “Layla had an . . . an ‘episode.’ She climbed onto the roof and threatened to jump off. The police talked her down.”\n “I’ll get on a plane tonight if there’s a flight, be there by tomorrow.”\n “No. Don’t.” Donna held the phone closer to her face, as if that could better convince me. Two decades older than Layla and me, she suddenly reminded me of the middle-aged Maria of my initial lock, the woman whose memories I was plundering every afternoon.\n “Listen, Elena. You can’t do any good here. The doctor told me that Layla can’t have any visitors or other outside contact for at least a week. Part of the ‘treatment.’ You might better stay where you are and just get on with your research.”\n “We have twelve days left on the equipment.”\n “Take it all,” Donna said, even though I was sure she didn’t know what my research was and would not have approved of it if she had known: “How is that useful?” Donna might look like Maria van Leeuwenhoek, but inside she was more like what Jan had called Antonj: a stone-cold rationalist.\n I said, “Will you visit Layla as soon as it’s allowed and then call me right away?”\n “Yes. Do you want her doctors’ numbers?”\n “I have them.”\n “Of course you do,” Donna said, and in her voice I heard her knowledge of not only Layla’s previous stays in Briarcliff Hospital, but also of everything about my father’s death. Or was that just my “sensitive suggestibility”?\n “Thank you, Donna,” I said.\n Her face softened. “I’m sorry this is happening to you,” she said, and even though this time the words were genuine, I wanted to yell at her that it was not happening to me, it was happening to Layla, just as it had happened to Daddy, and neither of them could help it. Donna should be thanking any gods she believed in—probably none—that the wayward luck of the family genetic curse had spared her, as it had partially spared me.\n There is no accounting for genes.\n In the next day’s session, Maria wore the merciless black of mourning.\n “Wear . . . more of cheerful . . . ” Father snaps. I don’t answer, and he shakes his head and turns back to his everlasting work. I sit beside him and write down everything he says, measurements and procedures and descriptions. He will use my notes to write his letters to the Royal Society. Pieter waits on a stool for his turn to look through the microscope and make his drawings. Wood specimen, hairs from his wig, scum from his teeth—it all takes a long time.\n Someone halloos at the door.\n “ . . . not open,” Father says. “Intruders.”\n I rise and peer through a crack in the closed shutters. “ . . . the butcher’s boy, Father. He brings . . . ”\n “Receive the meat. Pieter . . . this—”\n I go to the door, receive the meat, give the boy his coins. I hand the meat to Jozefien, who bobs a curtsey. I pour a drink of water from the jug. I stand still, not drinking it.\n Again, the images in my mind were watery, half-formed, and I was catching only a few words of each speech. Maria was not paying attention to her own life. The image of Willem was almost as solid in her mind as the objects in the room, an image suffused with despair. Why had the older Maria remembered this day at all? It must have been like so many others of assisting her autocratic father with his work, mourning her lost soldier.\n “Maria! Come!”\n Excitement in Father’s voice. I hurry into the workroom, where Father holds up a tiny microscope, peering at something on the pin. “Look!”\n “I do not want—”\n “Look!”\n Resentfully, I do as I am told—and nearly drop the microscope in surprise.\n “Stupid girl! Take care!”\n “What is it?”\n Father—Father!—is grinning like a boy. Pieter rises, pen in hand, staring at both of us in bewilderment. Father speaks—\n —words that I, Elena, had carefully memorized in Dutch—\n —and says, “Little animals.”\n “Again, 1674,” Jan said when the long session finally ended. “That was the year Leeuwenhoek first saw his ‘animalcules’ in water from Lake Berkelse. No one, not even Hooke, had ever seen them before.”\n “Touchdown!” Cora exulted. “We got it!”\n Jan continued as if she were not capering grotesquely around the lab. “He sent descriptions and drawings to the Royal Society, saying that the motion of the ‘animalcules’ was ‘wondrous to see’ and also—Elena, are you all right?”\n “Headache.” I sat up on the cot, which only made the headache worse.\n “Record the dialogue before you forget it,” Cora said. “Now!”\n Jan said, “Elena—”\n “There are three of us in there,” I blurted. “Not just two.”\n “Three?” Jan said.\n “Me, Maria, and her memory of Willem. It’s so strong that it’s almost another presence. I’ve never experienced anything like it.”\n “The dialogue!” Cora said. “Now, or it won’t count as ‘immediately post-session’!”\n We recorded the dialogue. My headache grew worse. Jan’s warm brown eyes watched me with concern. That was almost as disconcerting as the session. I gave concern—for Layla, for Daddy. I didn’t receive it.\n Receive the meat—\n I leaned over the side of my chair and vomited on the floor.\n Jan insisted on taking me home in his tiny drivie. Cora watched us go, and as he put a hand under my elbow to guide me down the steps, I glimpsed Cora’s face. So that was why she had been so irritable with him yesterday, so cold today. She’d come on to him and he’d refused.\n As the car drove itself through Market Square, I said, “Please don’t come in. I’m fine.”\n “All right,” Jan said. “But you will phone me if you feel worse? I am listed with the university contacts.”\n “Yes, thank you,” I said, knowing I would not. Not phone him, and not get worse, either, because tonight I needed to talk to Layla’s doctor.\n I might not have bothered. Layla was “the same.” Nothing had changed.\n This is what happens when your last parent dies. There is a lot of paperwork; in the modern world, it is bureaucratically complicated to die. A funeral must be arranged. Neighbors bring casseroles and cakes and pans of lasagna, none of which you want. You and your siblings feel orphaned, no matter how old you are. Eventually at least one of you must deal with your dead parent’s clothing, furniture, house. If that person is not you, you feel guilty for not helping.\n This is what happens when your last parent turns a nine-millimeter Glock on first his beloved dog and then on himself in the back garden of an upscale suburb in which normally nothing violent ever happens. Police surround the property with yellow crime scene tape. Detectives question horrified neighbors. A forensic team photographs everything and measures all blood spatters that have not drained into the soil. Afterward, neighbors avoid you and your sister, but the press invades the sidewalk, tries for photos through windows, phones you for quotes. Because of the dog, social media explodes with information about your parent, with disinformation, with vicious attacks, with arguments about whether clinical depression can lead to violence or if that is slanderous prejudice. Even if you do not share your parent’s surname, you are suspect: Might you do the same thing? Do you own a dog? Has the SPCA looked into your dog’s welfare? If any offsprings’ medical records, laughably easy to hack, show a hospitalization for clinical depression, the offspring is treated as if they are a pet-murderer-in-waiting.\n And still someone must deal with the clothing, furniture, house. If it’s not you, it doesn’t matter. You—and many others—will blame you. Even if your excuse is a once-in-a-decade chance at a time slot on the planet’s most sophisticated neurological equipment for an emerging scientific discipline.\n I had gambled that Layla, who’d handled Daddy’s death better than I’d dared hope, would be all right alone for three weeks. I’d gambled that her depression would not rekindle. I’d gambled, and I lost. Worse, so had Layla.\n My fault.\n My guilt.\n 3.\n Early in the morning, I rebooked my flight home for the day after tomorrow. I informed the university that we would do three sessions today and two tomorrow, but those would be our last. Cora wouldn’t like it. She would have planned on more sessions. A growing body of research showed that received memories were always stronger and more detailed with at least one day of rest between sessions.\n Cora exploded. “No! Fuck it, Elena, that’s not fair to me! We’re coauthors here, don’t be so selfish!”\n “I’m sorry, but I have to—”\n “You have to fulfill the contract we signed with TU! What’s so important that it can’t wait an extra week? Another family shooting?”\n Instantly Jan was standing in front of Cora, his slight body somehow menacing. “Shut up, Cora,” he said, another Americanism that, despite everything, made me blink.\n Cora took a step backward, scowled, but managed a choked, “Sorry.” And in that atmosphere, we began work.\n I hurry home from Nieuwe Kerk, Willem strong in my mind. Father waits in the front hall, scowling. “Where were you?”\n I don’t answer, but as I take off my cloak and hand it to Jozefien, he stares at the tiny gold cross I now wear on a chain.\n “Church, Maria? Domheid. Waanvoorstellingen. They feed you lies: zielen, engelen. There is no ziel inside you, Daughter. The world is what you see, what I see in my lens. The rest is fairy stories.”\n I am confused. He speaks to me with kindness, with—no, not understanding, something else. Pity?\n I am more confused when he takes my hand and leads me into his study, Jozefien staring open-mouthed after us.\n Father hands me a microscope. “See what I have found, Maria. We must record this.”\n I look through the lens. Tadpoles with long, thin tails swim like eels, but these are far too small to be tadpoles. “What are they?”\n Father seems embarrassed, further confusing me. “They are from my . . . my seed. This is where life comes. In each of those animalcules is contained everything necessary to form a child.”\n “And the mother?”\n “She houses the growing child.” And then, as Jozefien brings in a tray with cheese, ale, and fragrant new bread for Father’s dinner, he adds whimsically, “The mother bakes the baby. She is the oven.” His voice changes. “You must begin work. Because you were not here to take notes, I have already written my letter to the Royal Society. Make a copy, please.”\n Willem. Willem. Willem . . .\n I sit at a table, draw toward me Father’s letter on his own handmade paper with the writing in dark brown ink, and begin to copy it into the book.\n “Her book of notes included copies of his letters!” Jan said before I could even speak. “That has never been found!”\n I said, “What does ‘zielen’ mean?”\n “‘Souls.’ Leeuwenhoek spoke of the soul?”\n “Only to tell Maria it is a fairy story. And ‘engelen’ is ‘angels’? He said those, too, are a fairy story.”\n Jan smiled. “Which is exactly what his neighbors, and even at first many of his English contemporaries, said about Leeuwenhoek’s ‘little animals.’ What was on his lens?”\n “His own semen.”\n “1677. Give me the dialogue to record.”\n I did. Cora watched the visual translations of my brain waves eavesdropping on Maria’s memories as I matched them with Maria’s and her father’s words. Cora said sourly, “He thought women were just baby ovens? What about our eggs?”\n Jan said, “Merely a storehouse of nutrients. Antonj thought eggs couldn’t be alive because they did not move.”\n She said, “Sexist bastard. Well, we’ve got a good enough match between action and speech, although the images are still pretty blurry. I suppose you want to wait until after lunch for the next session. Not that an hour off is enough time for you to get any sharper.”\n I said, “The images aren’t blurry because of me. They’re blurry because half of Maria’s mind is still filled with Willem.”\n “After three years? Then let’s hope she forgets him soon.”\n She didn’t.\n In my afternoon session, I finally saw what I should have already realized: Maria’s depression. It leaves a signature in the mind, a sort of unseen miasma, until now masked by the insistent, overwhelming, constant longing for Willem.\n Added to her longing and depression was a new emotion: fear. Leeuwenhoek was ill. He lay in bed, weak and nauseated, while Maria held cups of ale to his lips and poor Jozefien emptied and cleaned pan after pan of watery diarrhea. Maria was patient despite her fear, Leeuwenhoek was irritable, and I was glad that memories experienced in Meijer entanglements did not include the sense of smell.\n “Eww,” Cora said when the session ended.\n Jan said, “In 1680 Leeuwenhoek had a bout of giardia, a waterborne disease. Obviously, he survived. But it’s interesting that Maria knew both to keep him hydrated and to give him ale instead of more water.”\n “Did Maria get it, too?”\n “History doesn’t say.”\n Of course not.\n We recorded what I remembered of the dialogue, none of which showed Leeuwenhoek in a flattering light. Querulous, demanding, he assumed that Maria’s life existed to serve his.\n “Oh, yes,” Jan said.\n “Her fault,” Cora said. “She should have just left.”\n My anger startled me with its intensity. “Just left”—and gone where? With what money? Yes, Cora was an engineer, not a historian, but still—\n I said tightly, “Sometimes circumstances keep a person from walking away.”\n She didn’t reply. I didn’t think she even heard me.\n I lay on the cot the rest of the afternoon, gathering strength. Jan brought me takeaway for dinner. In the evening session, a pale but recovering Leeuwenhoek examined bits of his own feces, while Maria wrote down his observations in “the book” and Pieter took his turn on the microscope to draw what Leeuwenhoek’s magnification revealed.\n Afterward, Cora surprised me by actually asking an historical question. “Jan, did he see whatever caused his giardia—what is it, a bacteria, virus, what?”\n “Parasite. Yes, he described it in a 1680 letter to the Royal Society and included accurate drawings.”\n “So he was the first to say germs caused disease?”\n “No,” Jan said. “Leeuwenhoek has been criticized for never pointing out that connection.”\n “But he knew. He must have.”\n “Probably.”\n “Then why didn’t he—”\n I said, “Because he didn’t want the Royal Society to see his precious ‘little animals’ in a negative light. He cared more about them than about people. Including his daughter.”\n “What a bastard,” Cora said dismissively, as if a single pejorative could sum up a person. “Didn’t you tell us that he wouldn’t take any students and wouldn’t even show people his best microscopes?”\n “Yes,” Jan said.\n I felt weak enough to let him take me home. As his drivie calibrated the traffic and moved easily though it, I sat slumped against the back of my seat, eyes closed. There would be no call to Layla’s doctor tonight. By tomorrow night, I would be home in California, in the partially emptied house where Layla and my father had lived, facing the task of working with Cora from 9,000 miles away to ready our joint findings for publication.\n Neither Jan nor I spoke until we reached my building. Then he said, “Maria also loved her father, you know, and was proud of him. It was a . . . a complicated relationship.”\n “Yes,” I said. “I know.”\n 4.\n In the next morning’s session, Leeuwenhoek discovered microbes in water drawn from a local pond, the first person in the world to see bacteria. The memory meant enough to Maria for me to access it, although not because of the bacteria. I felt her astonishment at Leeuwenhoek’s joy, and then her sharing of it. Her pleasure lasted only one long moment before the image of Willem again turned everything else blurry, but that moment was real, and it yielded some sharp images that pleased Cora.\n “1686,” Jan said, and I did arithmetic in my head. Maria had been mourning her dead soldier for somewhere between twelve and fourteen years, without any lessening of longing for him. Was that love or pathological obsession? I didn’t know.\n I did know that she had been to church that morning, and had left halfway through the service, finding no comfort there. Did she no longer believe she would see Willem someday in heaven? I didn’t know that, either. Maria’s memories revealed her experiences and emotions, but her thoughts only as they occurred in the moment, and I had not been with her in Nieuwe Kerk. I couldn’t tell how her religious beliefs had evolved.\n And then, in my last session in Delft, suddenly I could.\n “Mistress Maria! More paper from heaven!”\n The neighbor girl holds out her palm. On it lies a blackened, brittle scrap of paper. The child’s small face shines with excitement. “They fall beside Visser’s Pond. I saw it! Messages from angels!”\n “I may see?”\n “Don’t touch, it will break. This one fell right to me!”\n I stare at the charred paper—blackened by its long fall from the skies? Old, faded memories of other people telling me about these messages, but not near Delft. The child runs off to show her treasure to someone else, and I snatch my shawl from its peg and start for Visser’s Pond, outside the city walls.\n The ground is low here, marshy when wet, but dry now under a hot sun. The water of Visser’s Pond lies low, choked with algae and weeds. Here is where Father obtained his animalcules for study. Insects hum in the wildflowers. I spread my shawl on the ground and sit on it, turning my face to the breeze ruffling the pond water. I wait.\n It is a long wait.\n But eventually, I see the paper drift down from the sky. It lands on my shawl, almost in my lap. Charred, lusterless—I cannot read anything written on it. But I don’t need to. Happiness rises in me like a fresh spring from dry earth, and I laugh out loud.\n This message came right to me. It is from Willem, it must be. So Heaven is real, souls are real, and instead of punishing me for doubting that, God in His infinite mercy has allowed Willem to send me this precious token of faith, and of love.\n I laugh aloud—how long since I have laughed? Then I cry, careful to not let my tears land on the fragile paper. I sit there and feel Willem’s love soak into me like sunshine.\n I am loved.\n When I finally lift the paper and hold it carefully on my palm, as the little girl did, the sun is low above the city. When I reach home, the smell of cooking comes from the kitchen and Jozefien has already lit candles in my father’s workroom. He glowers at me.\n “Where have you been?”\n “Look, Father. Please look. It fell from the sky near Visser’s Pond.” I hold out the paper.\n “Yes, yes, I know,” he says. “I have a specimen already—you didn’t need to get me one.”\n He says a lot more—\n —my Dutch wasn’t good enough to follow—\n —before he looks through one of his small microscopes, adjusts the distance of the pin from the lens. He hands me the microscope, and I look.\n All joy leaves me. I am empty, a shell. I crumple my message from Heaven and it falls in black gritty rain to the floor.\n I pulled the wires off my scalp, not waiting for Cora, who cried, “Hey!” Jan stared at the screen until it went blank. Then he looked at me.\n I could not force words through the tightness in my throat.\n Jan supplied the words. “In the seventeenth century, it was believed that occasional scraps of paper fell from Heaven, and they really did look like paper in composition and thickness. Leeuwenhoek examined one in 1687 and realized they were small sheets of dried algae, stiffened and burned by the sun, and light enough to be lifted and blown about by wind. He reconstituted some of the ‘paper’ with water and found algae. Then he reversed the process to make ‘messages’ by drying fresh algae. That’s what he showed Maria, isn’t it. Could you understand his explanation, Elena?”\n “No,” I said. All I could understand was her heartbreak. The worst kind: unexpected hope, suddenly shattered.\n Layla and I had thought my father was getting better.\n Cora said, “So no dialogue at all? Nothing?”\n “None,” I lied. I did not have the strength to recite the conversation with the child, and anyway, Jan had already explained everything.\n Cora said sulkily, “Well, if you don’t have any dialogue for this session, how about doing just one more tonight, you told me your plane doesn’t leave until almost midnight and so if you—”\n “Cora,” Jan said sharply, “no. Can’t you see how weak she is?”\n “And just who, Jan de Knuyt, appointed you research leader here? The last time I looked, you’re only attached to the project as long as Elena and I—”\n “Have you no sense of fairness toward Elena? She—”\n “Stop,” I said, raising my voice as much as I could. “I will do one more session tonight.”\n I had decided what I was going to do. About everything.\n Cora, sweet now that I was doing what she wanted, brought me sandwiches, cookies, coffee, and left it by the cot. I told her and Jan to not come back for three hours; I needed to sleep. I actually did sleep for an hour, setting my wrister to wake me.\n I called the airline and rebooked my flight for tomorrow evening, hoping I would be able to fly by then.\n There are many kinds of depression. Dysthymia, or persistent depressive disorder, often but not always runs in families. Science has just begun to discover the genetic causes. Dysthymia ranges from mild but chronic all the way to suicidal. It can, like Layla’s, vary in intensity with different occurrences.\n Situational depression, on the other hand, is caused by a specific situation. Often it can be eased by changes in the depressed person’s situation, by loving attention, or by just by the oldest of all cures, time.\n Time was not helping Maria van Leeuwenhoek. She took pride in being useful to her famous father, but feeling proud is not the same as feeling loved.\n Carefully, I hooked my brain to Cora’s machinery, turned it on, and lay on the cot.\n Carrying a small bouquet of wildflowers, I walk across Market Square, past Nieuwe Kerk. The bell tower chimes, but I don’t look up. Skirting the church, I enter the graveyard. Willem is not, of course, buried here; I will never know on what battlefield he died or who claimed his body, if anyone. I walk to my mother’s gravestone.\n I don’t really miss her; it has been so long, and I was only a child when she died. But this is a quiet place, where sorrow is not remarked on.\n Willem, Willem, Willem . . .\n Two more people stood in the graveyard, mourning their own dead. Maria hadn’t even noticed them. I waited until they left.\n If Willem had lived . . . if there had been no war . . . if the church were not just as Father said: domheid, waanvoorstellingen . . . Father is always right . . .\n What I was about to do was both forbidden and dangerous. Dangerous because in the earliest days of Meijer entanglements, three receivers had tried it. Two were fine afterward, if completely exhausted.\n I lay the flowers on my mother’s grave. When I straighten, Willem is standing before me. The world rocks on its foundation.\n For decades, science has known that the material brain operates at a quantum level. For over a century, science has known that quantum equations run independent of time. Backward, forward, it makes no difference. Since biblical times, people who knew almost nothing of science have known about brains that produce delusions their beholders believe are real. The delusions, the waanvoorstellingen, are usually produced by disease, an abnormal situation in the brain.\n I am an abnormal situation in Maria’s brain.\n Reversing—transferring her memories to my brain, transferring my images to her brain—it is not as difficult as it should be. Not if the created image is strong and both people are suggestible. It is forbidden because the past is supposed to be sacrosanct: Look, but don’t touch. Even the past in memory.\n “Willem?” I say.\n “I love you,” Willem says to me. His body wavers, shimmers; he is a ghost, an angel. I know this. It doesn’t matter. He is here. He has come to me.\n I take a step toward him, and he moves back.\n “No, Maria,” he says. And then, as if it takes every bit of will, he chokes out, “I wait for you.” And vanishes.\n I fall to my knees, sobbing in terror and joy.\n I could take no more. My heart hammered, my breath came so labored that I was afraid it wouldn’t come at all. I couldn’t get off the cot to turn off the equipment. I couldn’t even reach up to yank free my connecting wires. The third receiver of those who tried this had survived, but he was never the same again. I couldn’t breathe. I—\n Then the wires came free and there were arms around me, holding me tight. Jan said, “That was stupidity!”\n “Domheid,” I whispered, but he didn’t hear me.\n “What were you doing? Why . . . Godverdomme! Ben je helemaal besodemieterd! You were reversing.”\n “I can’t . . . help . . . Daddy . . . or Layla,” I whispered, and everything went black.\n 5.\n Jan drove me to the airport. I felt unsteady with the shakiness and brain fog of too little sleep, even though I had just slept for fourteen hours. Last night Jan carried me home, stayed with me, made me eat when I woke. At the lab he deleted the recording of what I had done. No one else will know. My career is safe.\n Ben je helemaal besodemieterd! he had said to me: are you out of your mind?\n Yes. Literally.\n “Jan,” I said just before I entered security, “I’m sorry I never had dinner with you. That I refused so nastily. That was rude and unfair. If I return to Europe, or if you ever come to California . . . ”\n “May I phone you? I mean, not just about the project?”\n “Yes. Please. I’d like that.”\n “What will you do now, Elena?”\n “Finish dealing with my father’s estate. Take care of Layla. Work on the entanglement paper long-distance with Cora. Incidentally, she’s after you.”\n “I know.” He actually blushed, hesitated, then said with awkward daring, “But it is not Cora that I am interested in.”\n I kissed him goodbye, and an unexpected sweetness rippled through me.\n Even though I would never know if it had made any difference, I didn’t regret the comfort I had tried to bring to Maria. I had not deserved Jan’s interest and kindness. The one researcher who’d failed at reversed contact did not deserve psychosis. Layla did not deserve to inherit our father’s dysthymia. Maria van Leeuwenhoek, faithful and devoted to her father, did not deserve either his self-absorbed neglect or Willem’s death in war. Life was not fair.\n Which is why human beings should try to be. We are not only little animals.\n Jan let go of me, and I walked toward the plane that would take me home.\n Nancy Kress is the author of thirty-five books, including twenty-seven novels, four collections of short stories, and three books on writing. Her work has won six Nebulas, two Hugos, a Sturgeon, and the John W. Campbell Memorial Award. Her most recent works are a stand-alone novella about genetic engineering, Sea Change (Tachyon, 2020) and an SF novel of power and money, The Eleventh Gate (Baen, 2020). Nancy’s fiction has been translated into nearly two dozen languages including Klingon, none of which she can read. She has taught writing SF at various venues including Clarion and the annual two-week intensive workshop Taos Toolbox with Walter Jon Williams. She lives in Seattle with her husband, writer Jack Skillingstead, and Pippin, a Chihuahua puppy who chews everything."}