{"fingerprint": "Gl6Lmb/aR9pQ945FWjih6a0KxMo=", "sitename": "Clarkesworld Magazine", "title": "Genetics, Spores, and Automation: A Conversation with Nancy Kress by Chris Urie", "author": "Chris Urie", "date": "2022-01-01 00:00:00", "source": "https://clarkesworldmagazine.com/kress_interview_2018/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Genetics, Spores, and Automation: A Conversation with Nancy Kress by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nGenetics, Spores, and Automation: A Conversation with Nancy Kress\nHumans have been mucking around with the genetics of animals and plants for thousands of years through artificial selection. But at what points have we gone too far? What happens when a team of zealots with PhDs in science utilize their knowledge to decimate the Earth using nothing but a microbe? That’s what Nancy Kress’ new novel explores.\nThe third and final installment of the Yesterday’s Kin trilogy, Terran Tomorrow starts with the return of a diplomatic mission from Earth to World, another habitable planet populated by similar aliens. During their twenty-eight-year journey back, they find an Earth completely changed and at war. A spore cloud plague has left only a few million survivors left on the planet and what they carry on their spaceship might help humanity rebuild civilization. Steeped in hard science, Terran Tomorrow is an exciting conclusion to the series.\nNancy Kress is the author of twenty-seven novels, four short story collections, and over a hundred works of short fiction. She has won six Nebulas, two Hugos, a Theodore Sturgeon, and a John W. Campbell Memorial Award. Her latest novel is Terran Tomorrow released November 13 from Tor Books.\nWhen did you know that you wanted to be a writer?\nMost of my career has been unplanned, including its start. I never actually decided to be a writer. I was a fourth-grade teacher, and then a full-time mother. I started writing during a difficult, isolating second pregnancy for something to do when my toddler was napping. Preferably something involving words of more than two syllables. At first, I didn’t take it seriously, but eventually the fiction burgeoned, taking over my life. Writing does that.\nDo you expect a coming environmental apocalypse?\nAlas, yes, depending on how you define both “coming” (years? decades? millennia?) and “apocalypse” (how bad does it have to be?) It could come from climate change, or the major worldwide plague that we are overdue for, or the nuclear war we’ve managed to put off for seventy-five years, or biological warfare. However, I don’t believe that any of those would wipe out everyone. Humans are tough and adaptable. Small bands of us, at a minimum, will survive. And if there are only small bands, the Earth will heal itself, even if it ends up looking much different from today. No species lasts forever, but I don’t think we’re near our run yet.\nThe science behind the weaponized disease in Terran Tomorrow is frighteningly believable. What research did you do into spores and viruses for the book?\nI always do a lot of research into the science of my books because I have to. I’m not trained in science. When I became fascinated by genetics, about twenty years ago, I began to read books, journals, online. The gene drive in Terran Tomorrow exists now and is being deployed now to try to control the mosquitos that cause malaria. The science in the novel is as real as I could make it—given that is a novel.\nDo you really think scientists would go rogue and become environmental extremists?\nI hope not. But it wouldn’t take very many of them to create a genetically altered pathogen that might radically change the environment “in order to save it” from the rest of us. Genetics is not like building a nuclear bomb. With the right talent, the equipment is readily available.\nDuring the course of writing Terran Tomorrow did you discover anything we could do on an individual level to help offset our own carbon footprints?\nThat information doesn’t require much research; it’s everywhere. Don’t drive so much, or at all. Eat organic (less fertilizer washing into the ocean). Use minimum plastic, including no disposable diapers. Be vegetarian (meat animals use much more resources than plants and leave a big carbon footprint). Get solar panels for your home. Recycle. The problem is that much of this advice is not practical for the busy, city-dwelling, carefully budgeted people that we are increasingly becoming.\nScience fiction novels frequently deal with alien visitors trading advanced technology with humans. But in your novel, all the advanced technology is just as incomprehensible to Kindred as it is to humans. Why did you make this choice?\nAliens who are way, way ahead of humans in tech have no real reason to trade with us at all. What can we offer them, besides a chance to study our life-form as we study, say, baboons? Otherwise, unless they are very altruistic (not impossible, I suppose), or particularly bloodthirsty (why?), I don’t see why any race so advanced that they possess FTL would regard us as anything more than curiosities. The power differential is too great. So, for the novel, I made Terrans and Worlders more equal.\nHow do you feel writing a trilogy is different from writing a stand-alone novel?\nEach of the first two books has to strike a balance between a story that complete in itself—or readers feel unsatisfied—and leaving enough loose ends that the next book follows naturally. In other words, there must be more story left to tell.\nHow did the series evolve as you crafted each book?\nThe characters change. The continuing characters, like geneticist Marianne Jenner, her son Noah, and her grandchildren Colin and Jason, grow over time (as, ideally, we all do). I don’t like series in which characters remain static. However, I didn’t feel that was enough, so each book adds new point-of-view characters. For If Tomorrow Comes, the addition was Army specialist Leo Brodie, who became one of my favorite characters in all my work, as well as Owen Lamont and Salah Bourgiba. For Terran Tomorrow, it was Lindy Ross and Jane.\nIn addition, of course, the setting evolves. Tomorrow’s Kin is set on Earth; If Tomorrow Comes on the alien planet; Terran Tomorrow back on an Earth very changed from when the protagonists left it decades earlier. One of the themes of this series is that everything evolves: people, planets, birds, human understanding.\nWhat inspired R. sporii? Is there anything similar in our world?\nMany scientists speculate that spores from space have affected, or even started, life on Earth. Organic compounds have been found in comets. If something like R. sporii did change humanity, it was probably in our distant prehistory.\nShould humans be messing around with the genomes of wild animals?\nProbably not; we already mess around with the genomes of domesticated species, which is much more useful. However, history tends to show that if a scientific thing can be done, eventually it will be. You can’t put the genie back in the bottle.\nWhat projects are you working on next?\nI’m writing a very long novella about political and financial changes in the United States due to automation. I hope the story turns out not as dull as that description sounds! But unemployment due to increasing automation is a real thing, affecting real people, and my novella is a thought experiment taking the situation to the extreme. And I really like my protagonist, Jennie Flint. Always a plus when you must spend hours every day with these fictional people.\nWhat is one piece of writing advice that has stuck with you throughout your career?\nIt came from Bruce Sterling, and it has been important to me. To paraphrase: When constructing a future or alien society, follow the money. Economics underlies everything else. After I received and pondered Bruce’s advice, which came during a devastating critique I received from him at a writers’ workshop, the next thing I wrote was Beggars In Spain (thank you, Bruce). I’ve tried to construct believable economics in my fiction ever since.\nIf you had to choose between living on a military base cut off from nature, or endure possible death and live outside, which would you choose?\nThe safer military base. I don’t rock climb, skydive, or even ski. All my risks are emotional. 🙂\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}