{"fingerprint": "oXGQsefzWS9dtjYLCdfQDvbWId8=", "sitename": "Clarkesworld Magazine", "title": "Cameron Rhyder's Legs by Matthew Kressel", "author": "Matthew Kressel", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kressel_11_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cameron Rhyder's Legs by Matthew Kressel", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6370 words, short story\nCameron Rhyder's Legs\nFive thousand young men and women crowd this music hall tonight, and one of them is the soul I must erase from existence. How many she has killed I cannot say. To suggest a number is a sin. How can we count those who no longer exist? I once had a family, a husband, eight children. A life and a future. But all this has been timelost, expunged from history. And so I will expunge her. Except I’ve no idea who she is. Or he, for that matter. In this Now, gender and dress make a difference.\nToday, I’m female. My boxy eyeglasses, fashionably retro, hide a rainbow of sensors. I scan their eyes for tells, hunt their mind-detritus for fear. It’s hard to see who’s just stoned and who’s got something to hide. My gold digital watch, also retro, holo-def hicodes what my eyes miss.\nI wear tight black jeans and a persistent smirk as if I’m entitled to things I don’t deserve. My body is average, my skin tawny-light, my black hair medium-length, nose unremarkable. I’m a mayfly, engineered to be forgotten. I scan their bodies for changes since their last instance in this Now as they glimpse, then immediately forget me.\nThey’re here for the Goo Globbers, the glammed-out rock quartet that howls like a synaptic re-write. The crowd applauds far too much at the end of the first song, which I gauge as a covert attempt to escape their unexpressed fears. Unlike me, they cannot know their future.\nThe singer Scott Mohl croons, “The day ends with the setting sun, the flower wilts, its colors run,” and the crowd swoons in a haze of marijuana smoke and purple spotlights. But the colored patterns flicker-flash too precisely to be Now-native. Someone’s using lustre-tech to coerce brain states, but this tech won’t exist for another fifty years.\nScott Mohl’s honied voice reverberates under my feet as I weave through dancing bodies, scanning, scanning. Their dilated eyes make my probes of their forebrains a cakewalk.\nI scan a young, fire-haired woman with leafy green eyes. Cat’s-eye glasses on the end of her nose twinkle with rhinestones. Her lips part as my retinal shines a maser deep into her pupils at frequencies attuned to her neurons, hijacking her brain and dumping her memories into mine.\nShe has been in this Now before, my Archives tell me, in nine hundred and eighty one instances. I scan her blackbody signature for aberrations.\nI find one, of course. When she was seven, a pebble got caught in her bicycle wheel, and she crashed and broke her leg. And because she couldn’t go outside, she hung around the house and listened to her brother’s music collection, which spawned an interest in the musical subgenre of alternative retro-punk-fuzz-fusion, which led her, eighteen years, five months and four days later to this Goo Globbers concert. She’s kept the pebble with her all this time, a totem to the gods of fate. Her hand fiddles with it in her pocket just now.\nAnd it was We, The Hands of Brahma, who placed the pebble two millimeters to the left from where it was the last time. And because of our Correction, her recovery lasted two days, seven hours longer, and her interest in retro-punk-fuzz-fusion solidified, and in this Now she arrived to this concert six minutes and nine seconds earlier. She took her place beside the bar, drinking her rum sours every nineteen minutes forty-one seconds, on average, as she always does. Her early arrival forced a tall male of South-Asian genetics to move one meter to the left and scratch his nose, which he has never done in any Nows before.\nI log this through Twitter, spread across hundreds of accounts, in a series of steganographically-encoded photographs I take with my camera-phone. My Tweets will find their way to the future via the Library of Congress Twitter Archive, where my superiors will read and dissect them nine hundred years hence.\nI flash the woman’s short-term memory and set her free two seconds after we’ve met eyes. I’m careful not to leave memories. To do so would risk not only my life but the Great Mission itself. Her cat’s-eye glasses sparkle as she moves on.\nThere may be hundreds of Anachronists hiding in the crowd. If they find me they’ll erase me from existence, or worse, rewrite my memories so I’ll fight and die for their sick cause.\nWe’ll do the same to them, of course. War is war, after all. But any timelost fool can see that what we’re doing is nothing short of saving the Cosmos from chaos, their ultimate goal.\nScott Mohl belts, “The shadows of our yesterdays fall across my face, who are we but dust and loam, adrift in inner space?” The audience sways blissfully as the stage lights let loose a spray of brain-calming frequencies. Someone wants this crowd wide open and suggestible. Us, or them?\nI scan and record Corrections by the thousand-fold. The dancing acne-faced kid with too much energy (a passing word from a stranger began the causal chain that led him here). The pink-haired girl typing into her phone and taking pictures of herself (a book left open to a particular passage). The brawny security guard with crossed arms and a dour expression (a can of soup, moved from one shelf to another). Even Scott Mohl, hopping around stage in his glittery cape and leather pants (a whiff of sunscreen on a winter’s day). All have been Corrected thousands of times. People native to this Now believe they live such insignificant lives. If only they knew their grand purpose, how we gently nudge them toward enlightenment one millimeter at a time.\nFor We, the Hands of Brahma, have sent countless operatives here, via circuitous and parallel Nows, though those histories, if I have ever known them, have been erased from my memory. (To break the Causal Chain is a sin; the True Time must be preserved.) Just the same, the Anachronists have sent myriad operatives here. Nearly a million times they have nudged, forced, and heaved this moment away from the True Time. And always, we push it back. It’s been a cat and mouse game for eons. In short, I’m not alone.\nNinety-quintillion qubit hours of b-tree analysis and billions of timelost souls point to an event here as Ultimate Cause. Something happens tonight—specifically what, we have not yet determined—which through a complex series of causally chained events, will bring about the end of the Varaha Kalpa, Brahma’s Day. Time as we know it will cease. Atoms will fly apart. Cause and effect will lose meaning.\nThe Cosmos will die.\nAnd oh, how I long for that moment with all my heart! For in that moment the Living Cosmos will be reborn. The timelost will be found. Death will end. Blessed is her name, Tat Tvam Asi, That Thou Art, who dies so that we may live! If I find and erase my target tonight, all this glory shall come to pass.\n“I’m told we have a guest here tonight,” Scott Mohl says to whoops and jeers from the crowd. “The lovely Cameron Rhyder.” He holds out a hand toward the VIP dais at stage right. “Hey, doll,” he says, “join us?”\nThe crowd turns to the disgraced former actress and one-time lover of Scott Mohl, Cameron Rhyder, sitting on the VIP dais. She leans forward in her seat and takes a sip of scotch, while on the dancefloor beside her, an olive-skinned man with a Van Dyke beard stares at her legs.\nThis is wrong. In four thousand previous Nows his gaze has never lingered on her legs for so long. As Ms. Cameron Rhyder slowly rises from her seat, I shove through the crowd and yank out my timeclaw.\nThe Brahma Brute smirks over me as she plucks a hair from my Van Dyke beard and puts it in a glass phial. She’s had me down deep, scoured my brain for secrets, and I’m all fogged up.\nShe adjusts her boxy eyeglasses, 21st-century retro, that hide an array of sensors and weaponry. Her gold watch not only tells time but helps her manipulate it.\nThese Brutes brainwashed Myra, my wife. She died in the Battle of Pendulum, fighting for them. I had to explain to Jacob, our son, why she sent us all those hateful messages, why she cursed our family to her last breath. And when Jacob asked me if he would one day hate me too, I knew I had to join the fight to save us all.\nI lay strapped to the Brute’s chair in this dark, humid cave, where crude paintings of violent hunts and antlered gods on the walls tell a story that might have happened last week.\n“This will hurt worse than anything you can imagine, 219,” the Brute says. These freaks switch bodies so often they don’t even use names.\nMy Goo Globbers t-shirt reeks of marijuana from the music hall. My temple throbs where she hooked me with her timeclaw and yanked me backward through time.\nTen blank-eyed Variants stand by the cave exit, their crisp white uniforms bright against the stone walls. The electric blue numbers on their breasts glow like a frozen stopwatch.\n“I’ll take whatever you got,” I say.\nMy thoughts stutter as hot red beams shine onto me from hanging panels. They yank out data written into my junk DNA by the petabyte: the number of times my genes have be rewritten (forty seven), my taste for sour sweets (borderline addictive), my fetish for women in yellow sports socks (admittedly weird).\n“You have a pocket of gas in your large intestine,” she says. “Twenty-first century polysaturated fats do not suit you.”\n“I could fart, if you want.”\n“You’ve turned off input from your sympathetic nervous system. But I can bypass your physical body and send thoughts directly into your mind.”\nSuddenly I can’t breathe: I’m being hung from a tree! The pain is obscene, but I’ve trained for this.\nShe stops the pain, and I try to gasp with dignity but fail.\n“That was nothing,” she says. “I can simulate being eaten alive by rats, falling from a great height onto stone, freezing to death in icy water, and other such horrors. But I’ve no desire to be cruel.”\nI silently repeat my trigger phrase, and the post-hypnotic suggestion calms my fear. But my calm is fraught. Jacob will grow up without parents, without someone to lead him through the dark. “I won’t let you destroy the universe,” I say.\nShe sighs. “Is that the best you have, 219? I expected more from an Anachronist. I can rewrite your memories, make you docile and obedient, like my Variants here.” She gestures to the blank-eyed souls surrounding us. I recognize two from my time at Buenos Aires bootcamp.\nDavey Blackwood had a wife and three daughters. Sandra Chatterjee was finishing her Ph.D. in Temporal Dynamics when she got drafted. Now they’d kill their own child if this Brute ordered them to.\nI try to muster confidence. “Do what you must.”\nA duplicate Variant 175—another Sandra Chatterjee—enters the cave. She appears in all ways identical to the Variant 175 standing by the cave mouth. The two meet eyes, exchange data. “I come from an instance seven minutes and forty-two seconds ahead of this Now,” the second says. “Madam Interrogator 991, please note that a forced neural rewrite will destroy any possible recovery of information from this patient. Your future self respectfully requests you try another method.”\nThe original Variant 175 waits until the duplicate has finished, then she heads for the cave exit to activate her timeclaw and close the loop.\n“You see how hopeless it is, 219?” the Brute says. “Our Variant will leap back in time at exactly seven minutes and forty-two seconds from the moment her future self arrived and she will repeat those words to me exactly as she has heard them, thus preserving the True Time. Though the original cause of the message is timelost, we have gained information from the Void. Such are the wonders of the great Tat Tvam Asi, blessed is Her Glorious Name, who Herself exists Without Cause!”\n“Your sick philosophy has murdered trillions.”\nVariant 293 runs into the cave and says, “I come from an instance two minutes and nine seconds ahead of this Now. Stop! Patient 219’s neural DNA is booby trapped with singularity bombs. In my instance, Variant 9641 emerged from the timestream charred and burnt from an explosion, which she said destroyed a significant portion of North America. She died immediately. Your future self kindly requests you do not scrub his neural DNA.” The original Variant 293 leaves the cave.\n“Again!” she says, “True Time is preserved, blessed is The Causeless One!” She smiles at me, her pupils like swirling black holes in the bright lights. “Do you understand yet?” she says. “Anything you do, we predict. We have Variants spread throughout history, ready to timeleap at a moment’s notice.” She smiles seductively. “Now, are you ready to talk?”\n“There’s nothing to say.”\n“I beg to differ.” I feel as if I’m being torn apart by wolves, stoned to death by an angry mob, hung upside down in a frigid river by my testicles. But this is just pain, and pain will fade. All will fade soon enough.\n“Now, what was your assignment in the music hall? Why did your eyes linger on Cameron Rhyder’s legs three point seven seconds longer than any previous instance?”\nI take several breaths to compose myself. “You will fail this interrogation, as you have always failed, and you know it. A Variant would have arrived by now with all the information, extracted from a future Now. That is how it works, isn’t it?”\n“No,” she says. “Because that information hasn’t arrived, the only answer is that this is the Now in which I extract information from you and which I later choose not to send back in time for reasons unknown to me now.”\n“You know that’s not true. As soon as you find out what I know, you’ll scatter the knowledge through time. But that has not happened because my task is already done. I’ve completed my assignment. We’ve already won.”\n“If the Anachronists have won, as you say, then why are you bound in a cave, on the same spot where the Goo Globbers will take the stage ten thousand years from today, and why are we still at war? In short, why do we exist? You cannot have won.”\n“We are here because this is how it happens.”\n“What happens, 219?”\nShe pushes my brain into an alpha state and ramps up my oxytocin sensitivity. Now when I look into her eyes I see a caring mother, only concerned with imparting love and securing my everlasting well-being. I’ve been trained to resist these coercions too. “What do you think will happen when Brahma’s Day ends?” I ask.\nHer eyes brighten. “With the close of the Varaha Kalpa, all will become One Glorious Unity. We will merge with the Blessed Tat Tvam Asi. There will be no more time, no more duality, no more separation of object and observer. We will become God.” The Variants by the door smile.\n“That’s a delusion. The end of Brahma’s Day will destroy everything. Nothing but chaos will remain. Energy will be unable to coalesce into matter because time no longer exists. You speak of a Golden Age, but of what, when, and where will this Golden Age exist?”\n“What, when and where are meaningless terms when speaking of the Blessed Tat Tvam Asi who has no substance, duration, nor place.”\n“But we are human beings who exist in space and time, with breadth and duration. Destroy that and you destroy us. All the galaxies and countless stars. All the worlds teeming with life. You destroy everything that has ever been.”\n“Not destroy, 219. Revert. The Cosmos will return to its primordial unity.”\n“You want to reverse billions of years of evolution for the sake of a delusion.”\n“We want to take evolution to the next step.”\n“You want to extinguish all life.”\n“You motives are transparent, 219. You attack my core beliefs in an attempt to find weaknesses to exploit.”\nI try to shake my head, but the straps don’t allow it. “No, I’m pointing out that our continued existence proves that you’re wrong, that we’ve already won and you’ve already lost. If time has no meaning to your Timeless God, then the close of Brahma’s Day has already occurred in some Now. If you have succeeded, then this Now could not possibly continue to exist.”\n“You lack understanding of our theology, 219. Because we exist, it is this Now where we succeed in closing Brahma’s Day. We believe we all live in the True Time, the fixed Now that will bring about the close of the Varaha Kalpa. The True Time, like the stem of a lotus flower, is long and seemingly endless. But at its eventual end the Glorious Unity of Brahma blossoms. If we exist, then we must be living in True Time, the last and ultimate reality that leads to the Godhead.”\n“Wrong again,” I say. Jacob floats before my closed eyelids, his hands grasping for me in the dark. “Because this moment will soon be timelost.”\n“There is no way you can be conscious of your own nonexistence.”\n“Oh, yes I can.”\n“And how is that, 219?”\nI swallow. What choice do I have? “Because no one has come to warn you this time. Oh, Jacob, forgive me.” Then I trigger the singularity bomb hidden in my brain stem.\nI scratch my three days of scruff and light a menthol cigarette as I stand beside the bar after the opening act ends. People rush to the bathrooms in droves before the Goo Globbers will take the stage. The air grows thick with smoke and the stank of beer. It’s too hot for my leather jacket, my boots make my feet blister, and my balls sweat.\nI hate pretending to be someone I’m not. Once, my Archives tell me, I composed Neo-Baroque symphonies at a conservatory that won’t be built for another four hundred years. I was world renown and in love with a young man from Nigeria. But this past has been timelost. The Anachronists washed away my joy into the sea of Has Never Been. I don’t remember his name or his face, but I know that when the Varaha Kalpa ends, I’ll embrace my lover again. We will all reunite with the timelost, and together we will write symphonies with the Godhead herself.\nMy phone vibrates in my pocket. Someone has tagged a picture on Instagram with my handle: it’s the line to the bathroom that I’m looking at now, except the queue has moved forward a few paces. The encoded data says the photo is from the future and that I took it. On the graffitied wall is a faded sentence written in Eurogeek, a language that won’t exist for two hundred years, but the words are spelled phonetically in ancient Akkadian. It’s overlaid with newer graffiti and dozens of band stickers and is at least ten years old in this Now. The words read, “The woman directly underneath these words is Agent 991 of the Hands of Brahma. Make contact with her and share all information. Blessed be Tat Tvam Asi.”\nThe queue moves so that it matches the photo exactly. Right under the Akkadian letters is a woman with black hair, boxy retro eyeglasses, a gold digital watch, tight jeans. I lift my phone, take a picture of the queue at the precise moment, and email it to a server in Togo, where through the blessing of the Timeless One it will find its way to the future. The Causal Chain must be preserved.\nI approach the woman and hold out an unlit cigarette. “Got a light?”\n“Don’t smoke,” she says.\nI flash my retinal maser into her eyes, and there’s a brief moment where we pass encryption keys, entangled photons, and subatomic handshakes to negotiate deeper levels of trust. She’s one of us, but I outrank her, thank the Godhead.\nI’m Agent 337, I transmit through the maser. I’ve been authorized to divulge all.\nWHY ARE YOU BREAKING COM SILENCE? she transmits.\nBecause I’ve found him.\nHim? Even through the maser I sense her disbelief.\nThe last Anachronist to stand in our way before the Glorious Unity. He’s beside the stage, next to the VIP section. He’s wearing a Goo Globbers t-shirt, has ruffled brown hair, brown-olive skin, and a Van Dyke beard. I transmit his DNA marker and black body signature to her.\nWhy come to me? she says. You could erase him yourself. She scans the people nearby. This dialog risks outing us. Making contact is not in my mission profile.\nIn my last instance in this Now, I say, a taxi killed me as I crossed the street outside this concert hall. The Anachronists are never so overt. They know that I know his identity, and they’re desperate. You see why I cannot erase him myself?\nIt could have been a true accident, she says.\nTrue? I hope you know better, 991. But, you’re right, there’s more. In your last instantiation of this Now you brought the suspect backtime to the year 10,981 BCE. You interrogated him, but were killed when he detonated a singularity bomb embedded in his lower brain stem. We let him destroy you so that the Anachronists would believe they have the upper hand.\nThis isn’t strange, she says. I’ve been killed hundreds of times. Without concrete evidence, how can I proceed?\nIt’s an order.\nAnd if we erase the wrong person based on your whim, eons of labor will be lost. We might end up infinitely farther from the close of Brahma’s Day. I’m sorry, but without confirmation, I cannot proceed. She lifts her phone, about to transmit a record of our conversation through Instagram.\nI’ve no time for this. I outrank her and have privileges over her retinal. I flash her short-term memory and write my orders onto her prefrontal cortex. I write twice, just to be sure.\nGot it, yes, sir, she says, lowering her phone. Suspect at stage right, male, twenty-six, olive-skin, Van Dyke beard, Goo Globbers t-shirt. Pursue and erase.\nI purge her memories of our encounter, and our conversation ends two point five seconds after it began. Outwardly she shows no signs of change. She’s one of them now, a civilian. She will follow my instructions without knowing it. “Maybe I will take that cigarette,” she says. I light it and she takes a drag, then thanks me before she saunters toward the stage.\nIt’s my turn to go and I enter a stall that reeks of weed and piss. As I close the latch I can’t stop smiling. Our greatest moment so close at hand! Brahma’s Day will end! The timelost will be found! Blessed is her name, Tat Tvam Asi, That Thou Art, who dies so that we may live!\nA fire-haired woman pushes into the stall, and the rhinestones on her cat’s-eye glasses twinkle like fairy dust. Her leafy-green eyes hold me a bit too long before I realize I’ve been hijacked.\n“Goodnight, honey,” she says, pressing her lips against mine.\nNo! Wait? What was I just thinking? What was I just doing?\nShe stares at me, this beautiful, beautiful creature. I’d do anything for her. I’d die for her.\n“Change of plans,” she says as she presses something tiny and hard into my palm. “A little gift for Ms. Cameron Rhyder.”\nCameron Rhyder is a stupid name, but I wear it proudly.\nThe suit greets me as I enter the backstage doors. “Ms. Rhyder, I’ll take you to your seat.” He doesn’t know he escorts the world’s last hope, the culmination of eons of labor. His smile is forced, perfunctory. I remember making it when I was in his body.\nRoadies wake from their stupor as I pass forests of lights and gear. Red cups pop like fruit from labyrinths of black boxes. Their cigarette smoke curls into vortices as I walk past them. It takes them a second.\nHoly fuck, that’s Cameron Rhyder, that chick from that movie, what’s it called? The Doggerel Star with Jimmy Everwood and Kristina Goodman.\nShit, what happened to her?\nI know their thoughts from other Nows, when I inhabited their bodies: how I got old but am still fuckable, how my career tanked after I got busted in the back of an RV parked beside that Brooklyn fish-packing warehouse while sniffing crushed oxy from a nineteen year old’s penis with forty thousand dollars of stolen coke hidden in the trunk. The coke wasn’t mine. The douchebag with the big cock stole it from his friend, who ratted him out so he wouldn’t get wacked by the mob. But try explaining that to a public who hates celebrities only slightly more than they adore them. They threw me to the wolves, then the wolves threw me to the scavengers.\nI suppose all of this would’ve mattered to the real Cameron Rhyder. That entity sleeps way down in the substrata of this body’s brain. I feel her try to wake every few minutes, as she has for the past two days I’ve been inside her mind. I nudge her back to sleep with sweet memories of douchebag inside of her.\nThe suited man smacks open the steel door, and the sounds of the audience explode in my ears. He throws aside a curtain to reveal a thousand wiggling faces, barely conscious worms tenaciously clinging to life. They’ve no idea they eat death, that they suffice on rot.\nThey call it nihilism. I call it genocide.\nThe suit leads me to a table third from the stage. The crimson-dressed two-tops rest on a VIP dais a meter above the dance floor, like a king’s court. But we’re not the highlight. That’s the stage, where all kings will abdicate their thrones tonight, where all subjects will shed their chains. I take my seat, order a single malt from a pimple-faced kid who notices then pretends not to recognize me.\nOthers do. People whisper and point and avert their eyes. They’ve seen me on a screen, a whole dimension flattened, and yet I’ve become larger in their eyes. But in person, in all three dimensions, I’m lessened, made human. That’s why they stare, because in seeing me lowered to a mere person they raise themselves up.\nI’m fine with that. Equal footing is what I’m after.\nThe lights dim and the crowd roars, raucous to the point of dangerous. They’re ready to pop. The bouncers straighten, check their earbuds. Under cover of the noise, shadows sneak onto the stage and take their positions. The roar grows.\nWhite spotlights flash onto the lead singer. The silver cape over his shoulders reflects a sky of constellations up the walls. Orion, Cassiopeia, Canis Major. Their positions match the sky outside just now. He slams a power chord and the cheers fade under the heavy crunch of distortion.\nAs the chord hangs he sings, “Where has my innocence run? Where is my peaceful weather? How sunny were the days, when days . . . they ran forever.”\nThe lights go up and it’s spectral chaos. The band joins in with a dominant seventh. It is fierce, the three-seven time, the swooning melody.\nDamn. Even after all these eons, after so much death and horror, their music still moves me. That’s why it had to be them, the Goo Globbers, the only band in Eternity who can thwart oblivion.\nI send a command to the stage lights, to the lustre-tech I embedded four years ago. They switch on full spectrum, and everyone’s mind is pried wide open, modulated by the lights and a thousand other methods. But I set the other manipulators in previous Nows; there’s no way to know for sure if all but the lustre remains unadultered.\nThe crowd writhes on the dancefloor beneath us. One young man with a Van Dyke beard, olive skin, and a Goo Globbers t-shirt points at me, his fingers only inches from my ankles. “Dude,” he shouts to his friend, “that’s Cameron Rhyder’s legs!”\nHis friend shakes his head, embarrassed.\nI ignore them and sip my scotch exactly as I have done four thousand six hundred and eighty times before.\nA cute guy two tables over smiles and gives me a sympathetic expression. When I was in his body in a previous Now I learned he’s got undiagnosed cancer of the prostate. He’ll be dead in eighteen months. The real Cameron Rhyder would probably have fucked him in a shitty hotel room nearby, crying afterward over how far she’s fallen from her glory days. My body warms instinctively at the thought of his body pressing into mine.\nThe song ends, bleeds into another. A bluesy, jazzing jam, lots of fuzz. The drummer sweats rivers.\nA smirking woman with dark hair, boxy eyeglasses, tight jeans, and a gold digital watch sidles up to the dancing men beside me. They gawk and stare at her body.\nEveryone’s mind is wide open. Impulses are laid bare. Privacy is a discarded piece of clothing.\nShe dances before the men, rubbing against them as the beat progresses. She’s flushed, shivering, overheated, her eyes rolled back into her head, all signs she’s orgasmic. It’s a side effect of the lustre. I count seventy-one men and women currently experiencing orgasm.\nDo they know to whom they sacrifice their lust, to what wiggling chaos of unborn nightmare they pray? They writhe mindlessly, their imagination dead. They dream others’ dreams and think them their own. Nihilism has been chosen for them because they haven’t learned how to choose for themselves.\nUntil tonight. Until me. I will get this right this time. I must.\nThe bespectacled girl moves behind the Van Dyke. She plays his chest like a guitar, brushes her hand over his crotch.\nThree bodies back, a man in a leather jacket and two days of scruff lights a cigarette and considers me coolly, as he always does. A roadie sneaks out from a curtain onto the VIP dais. He squats beside me and says, “Scott—” that is, Scott Mohl, lead singer of the Goo Globbers, “—heard you’re here. Would you do a duet?”\nMs. Rhyder had a brief post-acting career as a singer-songwriter. Until the drug bust. “What song?”\nHis breath reeks of cigarettes. “Autumn Days?”\nFrom their first album. “Too dreary. How about My Disposition?” It’s a poem I, in Cameron’s body, wrote when I left Scott for good one morning a thousand Nows ago. He recorded it under his name as a kind of revenge, turned it into a hit. And if we sing it tonight, we’ll be singing my words to the most important audience in history.\n“I’ll ask,” the roadie says.\n“When?”\n“I’ll signal you.”\nI nod, feign flattery and nerves as he walks back into the shadows. The latches have been set, the trap is ready.\nThe song ends. Scott makes obeisances to the crowd, sips from a water bottle. “How y’all doing tonight?”\nCheers erupt. Some awaken from trances to shock and fear at their loss of control. Six people are freaking out. Nine more quiver from orgasm.\nThe roadie whispers to the bassist, who says something off-mic to Scott.\n“I’m told we have a guest here tonight.”\nWhoops and jeers. Everyone knows of our little tryst.\n“The lovely Cameron Rhyder.” Lunchroom boos, cheers. The roadie’s waving at me. “Hey, doll,” says Scott, his hand outstretched toward me, “join us?”\nI stand to whistles and cheers. “Got any blow?” one screams. Another: “Cameron, we love you!”\nA spotlight, hot and blinding, swivels onto me as I step on stage. I can’t see, but just as well. “Hiya, Cammy,” Scott says off mic, then he gives me a hug. In private, he’d be just as likely to tell me off.\n“Ninth Division?” he says.\nThis is wrong. “How about My Disposition?”\n“I’m tired of it.” Then to the band, “Ninth Division, on four. One . . . two . . . three . . . ”\nAnd just like that we’re performing the wrong song. I fucked up, somewhere. Now I have to play along, to sing his thinly veiled polemic on the evils of the military industrial complex, told as a clichéd love story between two star-crossed lovers.\nScott knows I hate this song, but not for the reasons he thinks. Its angry baseline becomes the thing it criticizes: unchecked rage. Played for a crowd this open, it will solidify the destructive mentality. It promises freedom, but makes them slaves.\nI can’t allow this. I’ve worked too hard, too long to get here. I activate the nano I’ve placed in the bassist’s brain and ramp up his sensitivity to THC. The joint he smoked an hour ago and thought he was coming down from now gets fifty times stronger.\nHis timing skews. He misses notes.\nScott and I sing, “I can’t see above the wall, but I know you’re on the other side,” as the audience cringes at the bassist’s errors. They’re being programmed for sure, but it won’t be as deep.\nWe give the song a respectful end, bow, and the audience responds with a weak applause. We’re losing them.\n“What the fuck, man?” the drummer shouts to the bassist.\n“I’m good,” the bassist says, looking green.\nI use the lull and jump in. “My Disposition on four, ready? One . . . two . . . three . . . ”\nThe drummer pounds the kettles as Scott cocks his head at me and smiles wryly. He knows he’s been beaten. I drop the bassist’s high and ramp up the band’s dopamine. I need them at their best.\nAnd they’re so fucking together it’s magical. We’ve yanked the audience back from the abyss. I sing, “All of us, every one, have been the other, you know, at one time or another.”\nAnd Scott replies, “And the other, mother, sister, lover, would you know them by their cover?”\nOn the dance floor below my table the dark-haired girl in the boxy glasses and gold watch spins around and tongue-kisses the man with the Van Dyke. I ramp up the lustre-tech to max, flood the air with massive doses of oxytocin, coerce the frequencies of my voice to resonate blissfully with human sensory meridians. Their bodies in ecstasy, they’re open to anything.\nI step forward and belt, “I have been you and you have been me, all throughout Eternity. Don’t you get it? Don’t you see? You have been that one and that one is me.”\nThe guitarist riffs through the interlude, making amateurs of the greats. The drummer is picking out rhythms he didn’t know existed. The bassist is plucking chords in heroic timing. Scott’s voice is hitting notes birds can’t reach.\nAnd when I sing the next verse they will awaken to the stark truth. We’ve been fighting this war for so long, in so many variations that in this Now, in this moment, I, the entity that stands in Cameron Rhyder’s body, have been every one of them. I, who no longer have a name, remember them all.\nI have been the smirking bouncer, and I have been the bemused roadies. And I was Scott Mohl and every member of the Goo Globbers. And was the man who will die of cancer, and I have been both halves of the couple kissing beneath my seat.\nInside their fragile bodies I have traveled forward and backward through time. With their hands I have slaughtered and erased and destroyed. I have had my mind rewritten and reprogrammed more than a billion times. The words I sing to them are utterly true: I have been you and you have been me, all throughout Eternity.\nAnd when I sing my next verse, they will awaken to this truth. The Anachronists will see the futility of their cause. The Hands of Brahma will know that the Unity they seek is already here, in my body, this flesh of Cameron Rhyder. They have already become One. Brahma’s Day ends with me.\nAnd here I go, second stanza, moment of truth.\nI step forward, but something sharp jabs my left foot. There’s something in my shoe. The pain makes me stumble, and my heel catches a wire. I’m thrown forward, down and hard, over the edge of the stage.\nMy head slams into the floor. My neck cracks. The pain is obscene, so I switch it off.\nScreams, not my own. I can’t move! My heart rate spikes. My neck is broken. I’ll be dead in seconds!\nNo! All of this mustn’t be for nothing! I was so close to showing them the truth: when we kill each other, we kill ourselves. Don’t you all see? We’re maggots feasting on our own body!\nI was going to wake them up. I was going to inject this knowledge into them, so that for one instant we’d become a singular mind, one conscious entity, who could stop this madness forever.\nBlackness pours into my vision as people surround me. The scruffy man in the leather jacket photographs me with his camera phone. The young woman with cat’s-eye glasses and leafy green eyes leans over and checks my pulse. She reaches for my shoe, which has fallen off, and pulls out something tiny from the heel. A pebble. The same pebble that threw her/me/us off our bicycle so many years ago. She puts it in her pocket and smiles at me.\nHer pupils dilate rapidly, a sign of a hijack letting go. Whoever was in her has fled. She’s confused, frozen. Suggestible. Here’s my last chance.\nI activate my maser and write deep into her mind. I’ve only got seconds before death. On the way home, shaken and sickened by what she’s seen, she’ll hum “My Disposition” without realizing it. The words will be stuck in her head for months. She’ll never be able to think of the song the same way again.\nFor Arthur C.\nMatthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow."}