{"fingerprint": "xj3ZtTiPKrwLEvRnwJp0bGL/E3o=", "sitename": "Clarkesworld Magazine", "title": "First Principle by Nancy Kress", "author": "Nancy Kress", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kress_09_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: First Principle by Nancy Kress", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6810 words, short story, REPRINT\nFirst Principle\nHe was even bigger than I expected. All three of them were. Barb and I watched on the link screen as they waited for the transport bay to pressurize, as they climbed out of the rover. Dr. Langley, in his rotation as council leader, made a welcome speech. The parents managed exhausted smiles, but the boy scowled.\n“He’s so ugly,” Barb said. “And look at him—he hates us already.”\n“He’s scared,” I said. “Wouldn’t you be, if you got taken away to Earth?”\nBarb made a vomiting sound and folded her small arms across her chest. “Don’t be so good all the time, Gina. It’s wearying.”\nI didn’t answer her. I’m not “good,” just reasonable. If Mom had ever dragged me to Earth from Mars, I’d be just as scared as this boy looked. Not that anyone would be so insane as to leave Mars for Earth.\nBarb said, “They should stay where they belong. Hell, Gina, that reco we saw just last night!”\n“We don’t know that this kid watches that sort of reco.”\n“We don’t know that he doesn’t.”\nNow Dr. Langley and the “immigrants”—such a strange word, we haven’t had immigration to Mars in decades and never to Mangala—walked through the rover bay and into Level 1. More people to greet them, more speeches. I tugged on Barb’s hand, and we moved to the boy to do our part. “It would be nice if someone his own age were there to greet David Hansen,” my mother had said, in the tone that meant “You’re elected.” I’d made Barb go with me. Now that didn’t seem like such a good idea. She radiated contempt.\nMaybe David Hansen felt it. Or maybe he was just stupid. This was our world; he was the outsider, and he didn’t even try to fake good manners. After the adults’ introductions, while the officials chatted warily, stumbling over each other’s strange accents, David and Barb and I stared at each other, silent. But the message in his eyes was clear. You’re ugly, you’re deformed, you’re monsters, you’re not even human. Last night’s reco lay on my mind.\nDoes he have any idea how he looks to us?\n“Hello,” I said finally. “I’m Gina Mellit and this is Barb Fu. I understand you play chess.”\nHe wasn’t stupid. He had manners when he chose to use them, although even then a sneer underlay the polite phrases. He was a better chess player than I am, and I’d been Valles Marineris junior champion. He hated Mars, and I hated him.\nBut not at first. “He’s scared,” I said to Barb and Hai-Yan and Andre and Ezra until I was tired of saying it and they were tired of hearing it. David wasn’t scared, he was a sick, supercilious son-of-a-bitch. But at first he was just plain sick. They took his family down to Level 2 and gave them a room on the terrace—which Mom and I wouldn’t get until our rotation came up next year—and specially designated a bot to take care of him while his parents, who weren’t sick, went to work in the labs. And then they urged me to play chess with him.\n“Why can’t he play against the computer?” I said.\n“He can,” Mom said. “He does. But I’m sure he needs human company, Gina. Wouldn’t you, in his place?”\nI didn’t say, I’m not in his place. I didn’t say, I wouldn’t ever be in his place. I didn’t say, His place made those recos about us. All those things were true, but you didn’t say them to Mom, who was a Spiritual Guide when she wasn’t a geneticist. The First Principle was even stronger in our family than in my friends’, especially since my father was killed a year ago in an accident on the surface. So I didn’t say any of it. I went to play chess with David Hansen.\nThe bot let me in. I nodded to it and said, “Gina Mellit to visit David Hansen. Chessboard, please.”\nFrom his bed David said, “Why are so polite to it? It’s just a machine.”\n“Why not be polite?” I said.\nHe did something with his tongue that I knew from the recos meant extreme contempt. And because that kind of reco was the only Earth feed where I’d ever seen that tongue thing, I knew then that he watched them.\nThe bot handed me an old-fashioned chess set, carved of some heavy Terran wood. I put it on the table beside David’s bed, he sat up shakily, and I held out my closed fists. “Right one,” he said. It held the white pawn. He opened with the Sicilian, I responded, and we played in a thick, ugly silence. He was a romantic player, making bold attacks and sacrifices, and I should have been able to counter that style of play. But somehow the advantage eluded me. Two pawns down, I lifted my eyes from the board to rest them on Mars.\nThe terrace rooms on Level 2 have a wonderful view. Mangala, a fairly new settlement although I’ve lived in it my whole life, is built against a south-facing cliff. The cliff face is terraced in four levels, each set back from the one below, with steps on the outside that mean you don’t have to wait for the elevators if you don’t want to. Pots on the terraces hold genemod flowers designed by my mother, and at the bottom is the park, full of the genemod plants and trees that the wizards are always improving. The clear plastic of the shield slants down from the top of the cliff, Level 1, to the ground, and then beyond that is the shallow dome of the farm. From David’s bed he could see the green of the park and the farm, and beyond them the red landscape and glorious pink sky.\nDavid followed my gaze. “It’s so ugly.”\n“Ugly?” My and Mom’s current quarters were in the worst part of our rotation, at the back of Level 4 where the sound of the excavation bots droned, night and day, even through the stone.\n“You don’t even know how ugly it is, do you? You’ve never seen the ocean, or a beach, or mist at morning . . . .” He stopped, bent over the board, and coughed. My anger morphed into pity. Despite being so big—he must top 170 centimeters!— he looked frail. I was never sick.\nI said, “Did you live near an ocean? With mists at morning? I’ve seen recos.”\n“You’ve seen nothing. A reco can’t capture it.”\n“Maybe not. But I know that—”\n“You know nothing.”\nI stood up. “Finish the game by yourself.”\n“Leaving because you’re losing?” he taunted.\nI glared at him. But I sat down again.\nThe First Principle governs Mars. It’s a spiritual principle, not a legal one, and absolutely necessary for survival in any closed environment with limited resources: Put yourself in the other person’s place. David was sick, uprooted, longing for the pestilence that was Earth, despite how hard that was for me to imagine. I advanced my bishop.\nWe finished the game in silence. He won. I left without looking at him. But as the bot let me out, I heard him breathe behind me, so soft that maybe he didn’t mean for me to hear. But I think he did mean it.\n“Bug.”\nI didn’t turn around. Neanderthal, I wanted to say, but didn’t.\nDon’t be so good all the time, Gina. It’s wearying.\nWe don’t look like bugs. He does look like a Neanderthal. Too big, too hairy, too few arms.\nMy great-great-great-grandfather was on the initial genemod team. I’m proud of that, and why wouldn’t I be? On Mars there is no room for waste or excess or stupid ostentation. Form follows function. The beauty which that creates is so much better than any Earth beauty; it’s filled with unity and grace. We have softer colors—through a telescope Earth always looks to me too gaudy, all that bright blue and white. On Mars variations are fashioned with subtlety and for the beauty of perfect fit with the environment. My genes are exactly what they need to be for this gravity, this level of radiation, this type of light. And I am a pretty girl. I see it in the eyes of my friends, my mother, other people. The thick, short bones of my legs don’t lose calcium and strength in this gravity, as David Hansen’s will. My big arms, engineered for strength, could break his too-long neck. The flexible tentacles of my small arms can manipulate objects that his clumsy fingers would crush. The light green of my epidermal photosynthetic cells uses the weak Martian sunlight to augment the energy from my food intake. I can see farther than David Hansen, hear better, use fuel more efficiently. Who the hell is he to presume to condescend?\n“I’m not going to play any more chess with David,” I said to my mother. We were on our way to the women’s baths, walking along a corridor deep inside the Level 3 rock. I had my coming-of-age ceremony several weeks ago, and most of my friends have already moved into their adult quarters, but I’m in no hurry. I like my mother. It’s pleasant to have someone to come home to, and there’s no one yet that I’d like to set up a partnership with.\n“I wish you would continue the chess, Gina.”\n“No. He’s awful.”\n“He’s dying.”\nI stopped cold. She said it quietly, factually, the way she recites genetic data. I blurted, “Why would anybody bring a dying man all the way to Mars? Especially one who doesn’t even want to be here?”\n“David isn’t yet a man.”\n“He’s the same age I am!”\n“But it’s different there, you know that. David can’t make any decisions on his own and his parents wanted to be here. Earth is dying. You know that, too.”\nOf course I knew that. We all knew that. It was the reason immigration had resumed at all. Three generations of arrivals at Mars, five generations when Earth was in too much crisis to fund expeditions and we were left to become ourselves in peace. And now another desperate influx by people frantic to get away while they still could. A phrase from literature came to mind: rats leaving a sinking ship. But I had never seen a rat nor a water ship, and Earth literature mostly bored me.\nI said, “Mom—”\n“Put yourself in David’s place, Gina.”\nDavid’s place was watching bug recos. Vile, stomach-turning things. And the computer games were worse. Win points by pulling tentacles off the “bugs.” Crush them under big robotic feet. Hit them with “pesticides” that make that tough green skin blister and molt. Tie the girl bugs down and rape them. Pack them naked into a “bug jar” and see how many you can fit. But Mom didn’t know my friends and I had seen bug recos and bug games, and I couldn’t tell her. We had them off an illegal feed that Ezra, who was some sort of electronic genius, had cobbled together during a mapping expo in a surface rover and then narrow-beamed to his receiver.\nIn my opinion, Earth should die.\n“I think,” Mom said carefully, “that maybe there’s a little xenophobia going both ways here. Will you promise me to think about that, Gina?”\n“All right,” I said, without enthusiasm. “I’ll think about it. What’s David Hansen dying of?”\n“Brain blight.”\nShe had me, and she knew it. We’d all learned about brain blight. Earthers caught it from one of the microbes that had been engineered in the Second Bio Wars; it created neurotoxins that ate away at the cerebral areas that controlled basic bodily functions. You got weaker and weaker, until your heart or lungs just gave out for good. It was not contagious and not curable, not even by us. Mars has been far more daring in its genetic engineering than has Earth. We had to be, in order to survive, once the reinforcement ships stopped coming. And we’ve been incredibly lucky, with only minor failures or side effects. But much as we’d modified the human body, we still didn’t know enough to do much with the brain. David Hansen’s brain was essentially the same as mine, and it was killing him. He’d been in cold sleep for the voyage out and that had halted the blight, but now he couldn’t have much time left.\nPut yourself in his place. Eight years old—sixteen in E-years—and exiled, dying.\nI shuddered.\n“Don’t do it,” Barbara said. “You’re an adult, your mom can’t make you.”\n“My mom doesn’t make me do anything,” I said, which was true. “She only reminds me about the First Principle. Gently.”\n“That’s worse.”\n“Much worse.”\n“How many times did you play him?”\n“Six.”\n“How many did you lose?”\n“Six.”\nBarb grimaced. “Did he ever mention . . . you know . . . .”\n“The bug recos? No. He doesn’t mention anything, not directly. He just hints at nasty stuff. His parents are never around because they leave him alone all the time.”\n“I’d leave him alone, too. He’s shit.”\n“While we play he has the link screen on an Earther news feed. It shows disaster after disaster. Yesterday it was all these children dying in some settlement called Africa and the bodies just stacked in a huge pit—you can’t imagine how big—and set on fire to—”\n“Don’t tell me. The Earthers are all rotten, we already knew that. Gina, you should—oh, number three bot’s hit something!”\nWe were on excavation duty. First-year workers always do jobs in pairs, even when the job mostly consists of watching screens and adjusting bot performance. Barb and I sat in the dusty little Level 6 control room, deep underground, near the end of our shift. She had her boots up on the back of my chair. Two chairs and the control console nearly filled the space, but Barb had jammed in Jiji’s bed as well. The mebio lay asleep, his tail curled around him. I’d left FuzzBall at home. This was a work shift, after all; sometimes Barb can seem a little immature.\nThe excavation bots were a mile away, at the end of the new tunnels. Excavation goes on all the time on Mars. We dig out new rooms shielded by tons of rock from the planet’s yearly ten rems of radiation. We dig wells to the underground aquifers. But this particular project was a first: a ten-mile tunnel from Mangala to the nearest town, Kasei. Eventually the tunnel would have a little train running along it. Someday underground trains would connect all the settlements in the Valles Marineris.\nI studied the data from the bot. “Whatever it hit is harder than the surrounding rock. An igneous form we haven’t cataloged yet? Look at this Cixin-scale reading, it—”\nBarb’s boots left the back of my chair and hit the floor with a resounding thump! “Let’s go see!”\n“You know we’re not supposed to do that. For any anomaly we’re supposed to call Dr. Alvero and—”\n“Oh, for once don’t be such a good girl, Gina!”\nBarb’s eyes sparkled. Her comment rankled. And somewhere deep inside, I felt—even while knowing it made no sense—that I had already paid out enough goodness by playing chess with David Hansen. Besides, I was curious to go into the tunnel, too. I’d never seen it live. And it wasn’t as if we didn’t know everything about proper suiting up for unpressurized areas. We’d had that drill since we were five.\n“Okay,” I said, “but let me run the diagnostics first to make sure it’s not just a bot malfunction.”\nIt wasn’t. The bot had hit something too hard even to dent, although it kept on trying, its diamond-fiber arm scrabbling against the whatever-it-was. Excavation bots are pretty stupid. I turned it off and we took the suits from their closet. Behind the closet was a small air lock, and behind that the start of the tunnel.\nThe ceiling was higher than it looked on the control screen, and a lot dustier. Minuscule particles of rock choked the air. Fines, we called them on the surface, but I couldn’t remember if it was the same for underground particulates. All at once this didn’t seem like such a good idea.\n“Barb—”\n“Come on!” she said over her suit radio. She bolted forward, and I followed.\nThe tunnel was about three meters wide. The first part had been reinforced by a construction bot, which we passed, busily working, about two-thirds of the way along. After that the walls were rough rock, sometimes with different colored strata briefly lit by my headlamp before we moved on. My uneasiness grew, although I couldn’t have said why.\nA mile underground seems a lot longer than a mile on the surface.\nWhen we reached the end, we both stood silent until Barb breathed, “Look at that.”\n“It’s got to be a . . .” A what? Inspiration came to me. “A piece of exploratory junk from a few centuries ago. You know, Precollapse, when Earth was sending those piddly little bots to Mars and maybe one of them fell into a hole and then the tectonic plates shifted and it got squashed—”\n“Into a perfectly flat impenetrable wall?” Barb said scornfully. She uses scorn as a shield. She always has.\nThe excavation bot stood frozen in the position I’d turned it off, which somehow made it look as dumbstruck as we were. It had uncovered a square meter of metal. The metal, which should have been scarred by tectonic shifts and rusted by aquifer drips and canted by erosion, gleamed a smooth dull gold. Without thinking I put my glove on it. The gloves are heated, of course, but not as well as the suits, or they’d be too inflexible. Crisscrosses of heating element lace the supple metallic fabric. Through my glove I could feel the metal’s piercing cold.\nOf course it was cold. This was deep underground in the Martian autumn. Everything was cold.\nThis was colder.\nThat made no sense.\n“This makes no sense,” Barb said scornfully. “Is there some part of the tunnel project we weren’t told about?”\nThe tunnel project was open knowledge, like nearly every other project on Mars. You can’t build trust any other way among scientific groups, among settlements, among variations in Martian culture. That’s why we have the First Principle. Put yourself in their place.\n“I think,” I said, “we better go back and call Dr. Alvero.”\nFor once, Barb didn’t argue.\nMom wasn’t home when I got off shift, which is rare. She generally wants to hear about my day. Well, she would hear soon enough. Dr. Alvero had called half the xenologists on Mars and they were all rushing to the excavation tunnel by elevator or rover or dirigible. Those that were too far away were glued to the link.\n“Is it—what is it?” Barb had asked, and I was glad because I couldn’t speak myself.\n“How could we know yet?” Dr. Alvero said sternly. I could read that sternness; he was a friend of Mom’s, and I’d sat with him at dinner in the mess hall lots of times. He was excited and hiding it; he was insisting on proper scientific skepticism; he was aware that Barb and I had seriously violated regs during his shift as captain.\nBarb didn’t believe in proper scientific skepticism. She blurted, “Is it ancient Martians? Or aliens?”\nIrritation replaced sternness. “Don’t be premature, young woman. And don’t finish your shift; that’s not necessary now. Sign out and, please, don’t say anything to anyone about this, at least for now.”\n“But will you tell us if it turns out to be—”\n“Come on, Barb!” I said, tugging on her arm before Dr. Alvero could lose his temper. And if the smooth gold wall did mean aliens, everybody would know soon enough—\nAliens.\nHalfway back to our rooms, I stopped dead. The terraces around me seemed to waver. Aliens. Was that possible? Microbial fossils had been found on Mars, but only microbial fossils. Somewhere in the long distant past, life had started here, and then had shivered to a halt. Climate change or radiation or something—my mind had gone numb. The life on Mars was us. This was our planet, my home. Arrivals from Earth were bad enough. But aliens—\nIt was one of those ideas too big and all-encompassing for the mind to hold onto. Like one’s own death.\nI had stumbled the rest of the way back to our rooms, as if I were as clumsy in Martian gravity as David Hansen. Now I didn’t want to be alone. I scooped FuzzBall from her basket and squeezed her tight. But she didn’t like that and yelped. And anyway, a mebio wasn’t what I wanted. What did I want?\nI wanted my life to stay the same.\nMaybe it would. Maybe the smooth gold wall wasn’t anything that would change anything. After all, it had probably been there already for a long, long time, doing nothing. Maybe our life on Mars could just go on the way it always had, unlike life on Earth that just got worse and worse, rising oceans and dying oceans and too much CO2 and stupid ugly biowars and—\nPut yourself in their place. And I want things to stay the same.\nI went to play chess with David Hansen.\nThe first thing he said was, “What’s that?” Until he did, I hadn’t realized I was still holding FuzzBall.\n“Oh, hell, you might be allergic, I shouldn’t bring her in here, sorry . . . .”\n“No, let me see it. Bring it here.”\nI didn’t like his commanding tone but I brought FuzzBall to him anyway. David was out of bed, sitting in a chair with the chess set on a little table beside him. He’d been waiting for me. He looked stronger than last time. When he held out his arms for FuzzBall, I gave her to him.\n“What is it?”\n“A mebio. Part mechanical, part genetically engineered biological. Not a ‘bug.’” I thought he might react to that, but he was too busy petting FuzzBall, who purred in his arms, little traitor. Well, she was pretty cute, even to an Earther.\n“It looks sort of like a cat. Is it a cat?”\n“I don’t know what genes they started with, but DNA is amazingly adaptable. She eats fines.”\nHe looked up. I’d never seen that expression on his face before: open and gentle. He looked almost like a Martian. He said, “What are fines?”\n“The bits of dust that get into everything, no matter how hard you try to make a tight seal. Mebios keep it under control.”\n“You force her to eat dust?”\n“Nobody forces her to do anything. She’s engineered to lick them up, and the saliva-fines mass is shunted to the mechanical part of her crop, where it can easily be removed. Here, I’ll show you.”\n“No! Don’t!” Abruptly he dropped FuzzBall to the floor. She yelped in protest, then began licking the polished stone. “Get it out of here. It’s just another freak. Like you.”\nThe gentle look was gone. David stared at me like he hated me. I knew he was going to say it a full three seconds before he did.\n“Bug.”\nSomething inside me snapped. The find in the tunnel, the repulsive recos, even the chess games I’d lost, one after another. The big and the small all mixed up, and all sauced with David’s contempt and my fear. My vision went red. I picked up the chessboard and threw it at him.\nThe board struck the side of his head in a rain of pawns and rooks and bishops. FuzzBall ran for the door, snarling. But David smiled. Blood streamed down his neck and soaked into his shirt. He said quietly, “Too bad you couldn’t throw it harder.”\nI stared at him, stomped out, and burst into tears.\nWhen Mom finally arrived home from her lab, she rushed straight into my alcove. “Gina! Are you all right?”\nI hadn’t been able to sleep, but the sudden light disoriented me. Blinking, I tried to see if she knew about Barb and me breaking regs. Of course she knew. Her face wrinkled into dozens of concerned little crevasses.\n“I’m fine, Mom. And I know we shouldn’t have—”\n“But are you all right? I couldn’t leave earlier, the oocytes—”\nI held out my arms, like I was three years old again. She sat on the edge of my bed and held me. That was what I needed, what David Hansen didn’t have; someone who cared more about him than about work, or even about Mars. My voice came out thick. “Is it . . . aliens, Mom?”\nShe laughed, a strangled sort of laugh, but I understood it. The situation was too weird to be quite real—even though it was real. She said, “They don’t know. And I don’t think we’ll know for a long time. Maybe not ever.”\nThat hadn’t occurred to me. “Why not?” Mom was calmer now, and that made me calmer. I let go of her, a little ashamed of my lapse back into childhood.\n“Well, think about it, Gina. From its position, that thing has lain deep underground for a long time—we’ll know how long once we date the metal, if we can, or at least the rock seal over it. A very long time, and if it is alien, no aliens have emerged from it. So probably there’s nothing biologically complex in there, or there was once and isn’t anymore. But unless the thing spontaneously opens, we’re not going to open it. Would you? Who knows what contaminating microbes we might let out, or what effect they’d have? Our Mars is fragile, you know that.”\nI did. Humans didn’t evolve here—school studies constantly emphasized that, and so did everybody else—and we had to be careful. One slip and the “planet not indigenous to us” would snatch at a life, a town, the entire human population. I knew it, but I had trouble feeling it deep in my bones. Mars didn’t feel “not indigenous” to me. It felt like home.\nI said, “So the council will just leave the . . . the alien thing there at the end of the tunnel? Forever?”\nShe smiled. “Forever is a long time. But, probably, yes.”\n“Mom—”\n“Yes, honey?”\nBut all at once I didn’t want to tell her about David Hansen, the bug recos, throwing the chessboard. After all, I wasn’t really three years old. “Nothing.”\n“All right.” She hugged me and left.\nThe alien artifacts, or biologicals, or whatever they were, would stay sealed. David Hansen would not want any more chess, not after I’d clobbered him with the board. Dr. Alvero would, as shift captain, discipline Barb and me, but that was minor. Mom wasn’t angry. I was able to sleep.\nI was wrong about David. He called the next day. “You’re supposed to be here to play me.”\nMy belly sank.\n“Gina? Did you hear me? Your mother said.”\n“You sound like a baby when you say that.”\n“Get up here.”\nAnd I did. From guilt, from duty, from training: Put yourself in his place. The problem was, the First Principle was correct. It was the only way to make a Martian settlement work. But I didn’t have to like it.\nDavid looked stronger than I’d ever seen him. To my surprise, his elaborate chessboard was already in midgame. As usual there was no sign of either of his parents. I said, “You playing someone else?”\n“No, stupid. This is a famous game—the ‘Immortal Game’ between Adolf Anderssen and Lionel Kieseritzky hundreds of years ago. White to move. Go ahead.”\nDespite myself, I studied the board. “Pawn to d4.”\n“No. Anderssen played knight to d5.”\nThe move didn’t make sense. This unknown “Anderssen” was ignoring the upcoming threat to his rook. David grinned. “Want to see the rest of it?”\nI nodded. He played out the game. White gave away both rooks, his queen, and a bishop—and still got a checkmate, using only minor pieces. It was unexpected. It was beautiful.\nDavid said, “He used a suicide tactic. Kill everything he has to get all the way home.”\n“I can see that.”\n“Can you? Gina, I want you to do something for me. I think I might have been wrong about Mars. I want to see it. Take me outside.”\nTalk about unexpected! “I can’t do that.”\n“Yes, you can. You’re an adult here, and so am I. I researched it. We don’t need permission to suit up and go out, but I don’t know the way or the air lock codes. There are codes, aren’t there, so that little kids can’t get out by mistake.”\n“I’m not taking you outside. Ask your parents.”\nHe did that contemptuous thing with his tongue, and then a hand gesture I knew was considered really filthy on Earth. I hated that I was shocked. He said, as if the word was killing him, “Please.”\n“No.”\nHe started to curse me then, using some words I knew, some I’d only seen in bug recos, some I’d never heard. I was glad. His foulness finally dissolved my duty, set me free. Nobody ever has to put up with that kind of abuse. I shouted at the top of my voice, startling him, “I could never be in your place!”\nIn the momentary silence that followed, I left.\nThe dull gold artifact was measured, photographed, assayed, and put through every possible test to see what was inside. Nothing yielded any useful information, not even internal imaging, which revealed only indistinct shadows. Bots carefully scraped away the rock on the thing’s six sides, none of which bore any markings. A perfect cube, the artifact was made of a substance unknown to either Earth or Martian scientists. Geologists determined that rock around it had shifted several thousand years ago; before that the artifact had lain on or near the Martian surface. Images of it became the most accessed data in the solar system.\nOn Earth a rising ocean, clogged with the out-of-control algal blooms that had killed the rest of its marine life, broke through the levees around a major settlement called New York. The water rushed in. In the floods and panic and contamination, two million people died.\nI played and replayed the Anderssen-Kieseritzky Immortal Game, looking for something I could not have named. The stupid game even invaded my dreams. Knight takes g7 King to d8. . . Not that I was sleeping all that well anyway.\nI didn’t see David Hansen, but I heard about him. In a settlement as small as Mangala, gossip is as pervasive as fines. His mother was out on a long-explore; she would not return for the rest of the year. David’s father was in Mangala but spent all his days and most of his nights at the lab. After all, wasn’t his son supposed to be an adult, here on Mars? I looked up the Hansens on the link. They did not come from New York. They had lived somewhere called Illinois, a place that had undergone rapid desertification during the recent round of massive climate shifts. The link, calling up Earther feeds from its data base, showed me kilometer after kilometer of dry, cracked, withered ground leading to a barren lakeshore.\n“Gina,” Mom said one day over a very late dinner, just before mess closed down, “there’s talk of . . . of certain recos that have been fed illegally to Mars.”\nI picked up a forkful of soypeach and kept my gaze on it. Ordinarily I like soypeach.\n“You saw them,” Mom said flatly.\n“Yes.”\nShe put down her fork. “‘Bug’ recos.”\n“Yes.”\n“Why didn’t you tell me?”\nI shrugged. I was an adult; I didn’t have to tell her everything.\n“Vile, ugly, stupid things—that’s what those recos are. From ignorant and diseased minds.”\n“Yes,” I said for the third time, and finally I could look up at her. “I’m sorry.”\n“You’re sorry? Dear heart, you have nothing to be sorry for. It’s the people who made those recos who should be—is that why you’ve been looking so tense and preoccupied the last few weeks? I’ve been worried about you. Ever since you stopped playing chess with David Hansen—was it David who showed you those recos? Was it?”\n“No, Mom. I saw them before he even arrived.” All at once the tension in my head—and of course Mom had noticed it, she loved me—shot up several levels.\n“So David Hansen had nothing to do with it?”\nHow to answer that? It was too complicated. I said, “Mom—is the council really never going to open that alien thing?”\nShe stared at me. “What’s that got to do with David Hansen?”\n“Nothing—I just—never mind. How is he?”\n“Doing really well. His brain blight might even be in remission. There are a few rare cases of that on record. If he’s one, it’s a great chance for up-close study, maybe even to learn something significant about the immune system. DNA is infinitely adaptable.”\nMy linkcom sounded. When I accessed the message, David Hansen’s face stared at me, surrounded by waist-high plants. I recognized them: my mother’s genemod wheat, modified for nutrient-enhanced Martian soil. David was out in the farm.\nInstead of speaking, he used the linkcom’s text function, which no one ever does except for data transmission. I had to squint at the tiny letters: “Come right now and alone or bishop to e7.”\nI stood, my legs shaky, and said, “Barb wants me. See you later?”\n“Sure,” Mom said. “Have fun.”\nI made myself not run out of the mess. Bishop to e7 was the last move in Anderssen’s immortal game with Kieseritzky. David’s words filled my head: “He used a suicide tactic. Kill everything he has to get all the way home.”\nI raced along the underground tunnel from Level 5 to the farm, then up the stairs instead of taking the elevator to the air lock. The farm is pressurized, but the atmospheric mix is different from the town, with more CO2 to aid plant growth. People can breathe it, but just barely and not for too long. Suits hang along the wall beside the air lock. I hesitated, knowing I should put one on, but I didn’t want to take the time. Instead I just grabbed a helmet and rushed into the air lock. It filled agonizingly slowly with the farm air. Come on come on fill . . .\nDusk filled the hot air of the farm, steamy and rich with the scents of plants, loam, water. No one else was around at this hour, and without a suit I had no headlamp. It didn’t matter. I had played here, taken botany lessons here, done work shifts here my entire life. Mom was a plant geneticist. I knew every inch of the farm, and I raced sure-footed over the narrow paths between crop beds and mini-fields and hydroponic vats and dwarf fruit trees. The sky beyond the low plastic dome was clear, and Phobos shone above me amid the earliest and brightest stars.\nDavid stood, also unsuited, between two mini-fields of Mom’s wheat, where the path ended at the far dome wall. Beyond the dome the Martian surface, rock and fines, was shrouded in shadows. David’s back was to the wall. He held the detached cutting arm of a bot, sharper than any razor.\n“David,” I said softly, as if sound might somehow jar him into action.\n“Don’t try to stop me.”\n“You want me to stop you, or you wouldn’t have linked me. You’d have just done it.”\nHe laughed. The laugh shivered along my bones. “Is that what you think, Gina? You’re wrong. I linked you because I hate you, hate this place, hate all you bugs—do you know how repulsive you look to me? I can never belong here, never, and I can’t . . . can’t go . . . home . . .”\nHe started to cry. I moved faster than I have ever moved before. Somehow—how?—I knew that he could not let me see him cry.\nTime seemed to stop, quiver, slow down. I had the weird sensation of seeing us both from the outside, each movement as clear and distinct as a coming-of-age dance: Gina leaps forward. David thrusts the cutter behind him at the dome wall. Gina closes the distance between them. The wall of tough piezoelectric plastic rips and air rushes out. Gina is upon David. He screams and whips around the arm holding the cutter. He’s clumsy in this gravity. She clutches his body in her big arms, so much stronger than his. Her small arms grasp at the cutter. She feels it slice deep into her thigh before he drops it. Gina screams. They both drop to the ground.\nTime returned to normal. Alarms shrieked. A repair bot threw itself at the hole where the air whooshed out. With my small arms I clamped the helmet over David’s head and the emergency seal molded itself roughly to his shoulders. Then I saw my own blood streaming down my thigh, and everything went dark.\n“Shock,” Barb said. “Your mom said it was only shock.” Her face was as white as the sheet that lay over me in the infirmary. She was my first visitor except for Mom, but I knew all my other friends would come as soon as they were allowed.\n“David?” I croaked. My lungs needed more time to fully recover, but they would. You’re not supposed to run and fight and bleed while breathing that much CO2.\nBarb grimaced. “His father took the fucker to Kasei. They have psychiatric facilities there, you know, that we don’t. If you ask me, he doesn’t need psychiatric help, he needs—”\n“Don’t.”\n“All right.” She leaned closer. “But why did you do it, Gina? Why save his life? You could have been killed, and he’s worthless scum.”\n“No.” I couldn’t say more. So we sat in silence, my friend and I, and she held my hand, and I could still feel my mother’s arms around me from before she left for her work shift, and I knew why the aliens, or their biologicals, or their machines, stayed inside the dull gold artifact.\nIt’s the same reason we won’t ever open it: Whatever is inside might cause contamination because it does not belong here. No one else believes this theory. “Gina, sweetheart,” Mom said gently when I’d croaked this out to her an hour ago, “think. If that were true, the aliens wouldn’t have taken all the trouble to come here in the first place. They must have meant to establish some sort of presence on Mars, or why bother?”\nMy throat wouldn’t let me reply, but I think I know the answer. The aliens did mean to establish themselves here. But once they arrived, they discovered that they couldn’t. It was not home. It would never be home. They discovered that they were not as adaptable as they’d hoped, and so they committed a sort of suicide, an act of despair.\nOr maybe that isn’t it at all. Maybe it wasn’t an act of despair but of altruism. They landed and discovered they could not survive on Mars. Their craft was damaged, or there weren’t the right resources here, or they didn’t have the right science to adapt Martian resources to their needs. So they took the only kind of victory they could achieve: leaving Mars uncontaminated for those who could adapt to it. “A suicide tactic. Kill everything he has to get all the way home.” Maybe the aliens, too, gained a kind of win, that of doing the right thing for us, who would travel here from Earth so much later. Put yourself in their place.\nI don’t know which idea is true, anymore than I know what will happen to David Hansen. His mind is indeed diseased, but not with brain blight. Maybe they can fix his hatred of us, maybe not. Maybe fix is the wrong word. DNA might be infinitely adaptable, but I don’t know if human minds are. If he returns to Mangala, I’ll play chess with him and take him places and try to help him adjust. Carefully. However, no matter what any of us do, David might always feel like an alien on Mars.\nBut I am a Martian, and this is my home, and I am in my right place.\n“Oh, I meant to tell you,” Barb says, “the animal wizards have designed the next generation of mebios, and you won’t believe how cute they are.”\n“Yes,” I croaked. “I would.”\nOriginally published in Life on Mars: Tales from the New Frontier, edited by Jonathan Strahan.\nNancy Kress is the author of thirty-five books, including twenty-seven novels, four collections of short stories, and three books on writing. Her work has won six Nebulas, two Hugos, a Sturgeon, and the John W. Campbell Memorial Award. Her most recent works are a stand-alone novella about genetic engineering, Sea Change (Tachyon, 2020) and an SF novel of power and money, The Eleventh Gate (Baen, 2020). Nancy’s fiction has been translated into nearly two dozen languages including Klingon, none of which she can read. She has taught writing SF at various venues including Clarion and the annual two-week intensive workshop Taos Toolbox with Walter Jon Williams. She lives in Seattle with her husband, writer Jack Skillingstead, and Pippin, a Chihuahua puppy who chews everything."}