{"fingerprint": "uOSFH5Il+c6jQfSwuvJ3rlxCyLA=", "sitename": "Clarkesworld Magazine", "title": "The Dragon Project by Naomi Kritzer", "author": "Naomi Kritzer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kritzer_03_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Dragon Project by Naomi Kritzer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3860 words, short story\nThe Dragon Project\n“I want you to make a dragon for me,” the client said. “I need it ready to go by February first.”\nDragon, Feb 1, I wrote down on the paper pad I use to take notes during video meetings. Also to doodle. I’ve always had trouble paying attention in client meetings, which is why I’m the bioengineer and not the manager.\n“Because that’s Chinese New Year,” the client continued. “And it’s going to be the Year of the Dragon. And I want the dragon ready for the parade.”\n“It’s not going to be the Year of the Dragon,” I said. “That’s two years from now. This year is the Year of the Tiger.” I noticed, too late, that my business partner Jed was sending me a text saying shhhh Vivian shhhh.\n“I’m sure every year is the Year of the Dragon somewhere,” the client said confidently.\n“Sure,” said Jed. This was definitely wrong, but Jed sent me another chat message, this one saying SHHHHHH in all capital letters. Also, I’d realized that I’d rather make a dragon than a tiger.Probably Jed was having the same thought.\n“We’ve got a whole ad campaign planned around having a dragon,” the client said. “But we’re thinking we’ll roll it out at the parade in San Francisco. They have one of those dragon parade float thingies, right?”\nI let Jed handle that one and started quietly sketching out the plan for the dragon.\nI am a bioengineer working in living 3D printing. What I trained to do was make 3D printed organs for transplant. Those are more useful than custom-printed animals. But it turns out that not all that many people each year need a new kidney or a new heart, and organ transplants aren’t the sort of surgery anyone gets for fun. So by the time I had my degree, there were way more bioengineers than the 3D organ printing labs actually needed.\nSo I was happy when my college friend Jed suggested we go into business together making custom animals. Jed had majored in business communications, and he handled client management and all the stuff like “actually sending out bills for the work we did.” I did all the lab work. I made enough to pay for a very small apartment in San Jose, close to the lab. Jed didn’t have to come to San Jose in person all that often, so he bought a house in Modesto, which is a long drive from San Jose but cheaper.\nFor most of our first two years, we made hypoallergenic cats, clones of people’s dead pets, and occasional odd projects like a Chihuahua dog that looked like a tiny Siberian tiger if the tiger were also a dog. It was owned by a very rich lady who liked to pose with it and take pictures. Jed had been kind of hoping this would start a fad for tigerdogs, but no one else had hired us to make one.\nPeople had been asking for dragons for a while, but this client—I think he was a hedge fund manager who was starting a new entertainment streaming service, but possibly he was an entertainment streaming service CEO who was starting a hedge fund. Did I mention I’m bad at paying attention in meetings? Whichever it was, his company was called Imaginational Criterion. The client—whose name was Brody or Brayden or maybe Bryce—was the first person to come along with enough money to really kick the dragon development project into gear.\nI sat down with my sketchbook and started thinking about what a dragon ought to look like.\n“No,” the client said, looking at the dragon.\nMy dragon climbed down my arm to the keyboard and stretched out in front of my laptop camera, arching its back. “Oh, big stretch,” I whispered to it under my breath.\n“That thing doesn’t even have wings! Does it breathe fire?”\n“We discussed fire,” Jed said. “Specifically, we discussed the insurance requirements of a dragon that could actually breathe fire.”\n“Chinese dragons don’t breathe fire,” I said. “And they don’t have wings.” Although they do fly. This one didn’t fly. To fly for real, you need both wings and hollow bones; I thought it would be better to make a sturdy dragon.\n“Also, a dragon should be larger! That thing is the size of a squirrel?”\n“It’s bigger than a squirrel,” I said.\n“We discussed size parameters,” Jed said. “We agreed on a five-to-ten-pound dragon.”\n“I’m not paying for this!” Bryce said.\n“The contract clearly says . . . ”\nI stopped listening. The dragon also looked like it had stopped listening; it climbed down and started playing with my shoelace. Out of view of the camera, I dangled a mystery cable (does everyone accumulate mystery cables on their desk or is it just me?), and the dragon leaped up to grab it, clinging with all four feet. I’d given it little claws on its toes so it could cling pretty well.\nI suddenly realized that Jed was saying my name, and I tried to look like I’d been paying attention all along. “Vivian. Do you think that’s possible?” he asked.\n“Oh, definitely,” I said, and hoped I was telling the truth.\nThe “do you think it’s possible” turned out to be “grow another dragon by the deadline.”\nFor the second dragon, I was told to make it bigger, fiercer looking, and to give it wings.\n“Wings are inauthentic,” I said.\n“No one cares,” Jed said.\nThe first dragon was about the size of a cat, and since the client had refused delivery, I kept him. I fed him crickets and mealworms, shaved carrots and diced peppers, crunchy cat kibble, and occasional cans of sardines. The dragon grew plump, developed a habit of begging at the table, and shredded my sofa and curtains with his claws. He also liked to lie across the back of my shoulders when I was working, like a tiny scaly heating pad. (Despite the scales, he wasn’t a reptile; I had thought a warm-blooded dragon would have a more interesting personality. There are scaled mammals, like pangolins.) He ran around the house with a little galumphing hop.\nAs the second dragon gestated at the lab, I started calling the first dragon Mr. Long. (“Long” is Chinese for dragon; also, he was rather long.) Mr. Long started getting into things. First he figured out how to open up the cabinet where I stored the cat kibble. I kept his crickets and mealworms in a terrarium; he opened that up and set them free because he found it entertaining to chase them around the house. He figured out how to turn on the bathtub faucet, though not how to put the stopper in the drain to actually get himself a bath, and he discovered that my pillows were full of feathers that would blow all over the bedroom when ripped open.\nThis was fine. I switched to synthetic pillows, resigned myself to hearing the chirp of crickets from odd locations, and adjusted the water heater so that his impromptu bath parties wouldn’t leave him with scalds.\nI designed the new dragon with a face that showed off his teeth more, since they wanted “fierce,” and wings, as instructed, although basically the wings were a crest it could raise in display. Also, it would have feathers instead of scales. One of the Bryce’s complaints about Mr. Long was that he was tan instead of brightly colored, and colorful feathers are easy. (Actual reptiles come in a wide variety of colors as well, but scaled mammals are basically all shades of brown. I’m sure I could figure out how to make a colorful scaled mammal given time, but we were in a hurry.)\nLike a baby bird, the new dragon came out soggy, scrawny, and ravenously hungry. Unlike a bird, it had teeth. I took it home to feed it and give it time to grow. Mr. Long found it entertaining to help feed the new dragon, stuffing mealworms and canned tuna and peanut butter sandwiches into its mouth until it got less wobbly and more independent.\nOnce he’d plumped up a bit, I was really happy with the look of the new dragon. His feathers were red and gold and iridescent black. His face looked fierce, but he was just happy all the time, although he was definitely happiest when he was making a mess. Mr. Long would open cabinets for him, and he’d pull stuff out from inside and scatter it everywhere. He was also a fan of baths, and he figured out that if he put his butt right over the drain, the tub would start to fill up. Fortunately, he didn’t have the attention span to actually flood the bathroom.\nMr. Long used a litterbox like a cat, but the new dragon, who I’d started calling Timothy, really needed time outside, so I bought leashes for both dragons and started taking them out for walks. I probably should have expected what happened next, which was staring, questions, and requests for more information. Mostly about Timothy: Mr. Long preferred to ride on my neck, and if I pulled up my hood people didn’t notice him unless he wanted to be noticed. When people asked for business cards, I gave them Jed’s email address, since the last thing I wanted was to have to answer email from all the people who thought Timothy was a feathered dog with wings. “He’s a dragon,” I said repeatedly. I was pretty sure just from how often I was getting asked this question that the client was not going to be happy.\nI was right.\n“That’s not a dragon,” Bryce said. “That doesn’t look anything like a dragon.”\n“He has wings,” I pointed out.\nTimothy flopped down on the floor and used one of his back legs to scratch under his wing.\n“It’s a dog,” the client said. “That looks like a dog. With feathers and wings. It doesn’t even breathe fire.”\n“We’ve been over this,” Jed said.\n“I’ve trained this one for you,” I said. “This dragon is housebroken. Also, if you ask nicely, he will get things for you.”\n“You’re saying it plays fetch,” Bryce said. “Like a dog.”\n“If you want him to play fetch with you, he will play fetch with you,” I said.\n“That is a feathered dog.”\n“We sent you sketches,” Jed said. “Which you signed off on.”\n“You know,” I said, “When I’ve taken Timothy to the park, I’ve had dozens of people asking about buying a similar animal.”\n“You named it Timothy?” the client asked.\n“Just temporarily,” I said.\n“This is nothing like what I asked for, and I’m not paying,” the client said.\n“You know what,” Jed said, losing his temper. “We’ve now created dragons for you twice, you’ve had the opportunity to inspect our work at every step of the way, and both times you’ve refused to take delivery. Timothy is a very good dragon, and you don’t deserve him anyway. You’re fired.”\n“You can’t fire me!” Bryce screeched. “I’m the customer!”\n“You’re fired,” Jed said again, more loudly. “Good day.”\nIt turned out that Jed wanted Timothy, which was a relief because my apartment really was not big enough for a dog. A dog-sized dragon. Either one.\nOn the other hand, it was the perfect size for a scaly little cat. Or a cat-sized dragon, whatever. So I kept Mr. Long and bought childproofing locks for all my cabinets. Mr. Long was a little restless when his buddy went away, but then settled back into his routine of turning on the bathtub and getting into the cabinets and then sleeping on my pillow at night where his breath tickled my cheek. Sometimes on weekends I drove out to Modesto so he and Timothy could have a play date.\nWe thought we’d heard the last from the client. It turned out we were wrong.\nWhen “Fire at Imaginational Criterion HQ”crossed my news feed, I have to admit that my first thought was just, “Oh, I could cancel that news alert.” It was not, “Oh, Brent or Bryce or whatever his name was must have found someone to make him a fire-breathing dragon.”\nIt should have been, though!\nThe Chinese New Year parades had come and gone without any dragons other than Mr. Long, who was not in the parade but came with me as a spectator, riding on my shoulder. Jed had asked me nicely to leave my hood down and hand out business cards to anyone who expressed an interest, which I did since the cards all had his email address and not mine.\nWe were well into summer when the news story hit about our former client, and I didn’t think anything more about it until I started hearing rumors about a cryptid that everyone was calling the Palo Alto Hippogriff.\nHippogriffs are mythological beasts with the back end of a horse and the front end and wings of an eagle, and the thing about a cryptid walking around in the twenty-first century is that sooner or later someone will get a decent picture of it. I saw the picture, thought, “That doesn’t look like a hippogriff to me, it looks like a dragon,” and that’s when it hit me. Two minutes later, I was digging up everything else I could find about the fire, and about Imaginational Criterion, and I realized that one of the employees who got quoted—Kyle Crocker III—was someone I’d run into in my bioengineering program back in college.\nJed and I hadn’t shared a major in college; we’d met bashing each other with foam swords in a LARPing club. Kyle Crocker III had been a freshman when I was a senior, and I remembered him because at one point that year there was a talk with a reception after, and while I was drinking punch and eating a cookie in a corner, he came over and tried to explain DNA to me. Incorrectly. And when my advisor pulled me out of the corner to introduce me to the speaker, Kyle followed and tried to explain DNA to her, too.\nBut he did graduate from the same program I went to.\nAnd he and Brent were probably in the same frat.\nI looked at the picture of the cryptid again. Short legs, a barrel-chested body, a long neck. It had wings (but they were much too small to lift it). In the picture, I couldn’t tell if it had feathers or scales—just that the creature was dark gray, not brightly colored. I could kind of see why people thought it was horselike, even though the legs were not nearly long enough.\nMy first concern was for the poor domestic dragon stuck living in the woods. But the second thing that hit me: California is very flammable. Pretty much the whole state. We have serious problems with wildfires. I wasn’t sure what they’d done to make this dragon breathe fire, but any feral animal that breathed fire running around in the woods in California was a terrible idea.\nMost of the sightings had been in Palo Alto’s Foothills Park or one of the adjacent nature preserves. Dragons like to play, eat, and play with things they can also eat, which raised the question for me of what this dragon might like to eat. The people seeing him were thinking “horse,” so . . . maybe horse treats?\nMy college friend Nadia had grown up on a farm in Washington state and had a horse. One time I’d visited her during spring break, and she’d given me apples, carrots, and sugar cubes to feed her horse. So before I headed to Palo Alto, I went to a grocery store to stock up. I brought Mr. Long with me. He’d gotten along very well with Timothy; hopefully the new dragon would like him, too.\nI parked at a trailhead, loaded the food into my backpack along with snacks and water for me and Mr. Long, and hiked up the trail. I cut up apples and tried just dropping apple wedges occasionally as I went, figuring that if the dragon didn’t eat them, I’d make a squirrel happy. After a while, I started adding the occasional sugar cube.\nOn my shoulder, Mr. Long suddenly sat up with interest, and I slowed my steps and looked around.\nA big, squat, winged creature was on the path behind me, slurping up a sugar cube with his long tongue. He had scales, and in the shaft of sunlight I could see that they were a sort of dark iridescent green, not the gray I’d seen in the photo. He was designed to look like a western dragon instead of a Chinese dragon, but he was still really pretty.\nI’d been thinking I’d lead him back to my car, but looking at him in person, I realized that wouldn’t work. He was a lot bigger than I’d expected and would definitely not fit. He chomped down the apple, then sat up and belched noisily.\nMethane, I thought. That’s probably how they did the fire: he belches methane. Horses fart methane, so making a dragon who belched methane would have been relatively straightforward, and in a parade, you could send along a human with a lighter. Methane doesn’t usually spontaneously combust, but I could vouch for the many ways that dragons could make trouble; this guy might have broken into the kitchen to find a snack and turned on the stove by accident. Or maybe they’d overloaded a power strip and a badly timed burp had turned a smoldering circuit into a building fire.\nI took out my phone, got a couple of good pictures of the dragon, and then called Jed. “I need a horse trailer,” I said. “I’ve found their dragon.”\n“If it’s their dragon, why is it our problem?” he asked.\nI just sat there in silence for a minute.\n“Okay fine,” Jed said, heaving a sigh.\n“I should warn you, I think he burps methane,” I said.\n“Probably better not leave him running around, then,” Jed agreed.\n“Also, Mr. Long doesn’t want me to leave him.”\n“Of course he doesn’t. I’ll be there in a couple of hours.”\nI worried that I would run out of treats to keep the new dragon from running off, but like Timothy, he clearly viewed Mr. Long as a friend. Eventually, a sugar cube at a time, I led him back to the parking lot where Jed had arrived with a rented trailer.\n“What a monstrosity,” Jed said when we arrived.\n“Don’t you go insulting Sweetpea,” I said.\n“You named it Sweetpea?”\nWe loaded Sweetpea into the trailer and took him to Jed’s house in Modesto, since he definitely was not going to fit into my apartment. “Don’t tell my insurer about the methane,” Jed said.\nTwo weeks passed. We figured out that much like with cattle and horses, feeding Sweetpea a diet that was partly seaweed cut back significantly on the methane he burped up—that was good news. We were working on finding him a good home when Bryce and Kyle showed up and accused us of theft.\n“Don’t be ridiculous,” I said. “Why would we steal a bioengineered animal from you? Our work is better than yours.”\n“According to the news articles,” Jed said, “your corporate headquarters, and all contents, were completely destroyed. If you had made a creature similar to this one, it undoubtedly died tragically in the fire.”\n“Obviously it escaped,” Kyle said. “I know my work! My superior work, or you wouldn’t be so eager to keep it!”\n“I tell you what,” Jed said. “If you know the creature, then the creature presumably knows you. Let’s have you and Vivian stand at opposite ends of a basketball court, with the creature in the middle. You can each call him and see who he goes to.”\n“He’s going to bring treats,” I protested to Jed once Kyle was out of earshot.\n“Of course he’ll bring treats,” Jed said. “He wouldn’t have agreed to this if we’d set ‘no treats’ down as a ground rule, but it doesn’t matter, because Sweetpea will pick you.”\nWe had a neutral party lead Sweetpea out to the middle of the court. Jed and I stood at one end with a bag of apples. Kyle and Bryce stood down at the other with a giant bowl with a mix of fruit and candy in it.\nI was worried for a minute.\nBut only for a minute, because as soon as Sweetpea was off his lead, he turned his back on Bryce and Kyle and headed straight to me. I don’t think he even noticed I had apples, but I gave him one anyway, of course.\nKyle knew he’d lost, but Bryce came over, furious, and started yelling about lawsuits and “the animal’s choice is not legally significant” and something about “restitution without compensation.” I really don’t like it when people get in my space. It’s one of the reasons I like working with Jed: he doesn’t get in my space, and he deals with clients, so they don’t (usually) get in my space. I backed up, but Sweetpea was behind me, so I couldn’t back up very far.\nSweetpea looked at me, and looked at the client, and let out a delicate little burp. Such a little burp.\nAnd it ignited into a tiny little methane fireball that burned off Bryce’s eyebrows, some of his hair, and left him with a blister on his nose.\nWe had been assuming that Sweetpea couldn’t light his own fires—because we hadn’t seen him do it.\nWe’d assumed wrong. We just hadn’t given him reason to want to do it.\nBryce switched instantly from yelling about his property to yelling about an injury lawsuit, and he and Kyle got back into their fancy car and drove away, and that was that.\nSweetpea went to live with Nadia, who was a little disconcerted by the whole explanation but fell in love with Sweetpea as soon as she met him. She lives somewhere that gets plenty of rain, and I knew she’d be able to keep up with a dragon. The problem with dragons as pets was, they’re clever. And they like to make trouble.\nBut they will also drape themselves over your shoulders to keep you warm on chilly winter days, and once they learn what pillows are for they share them instead of destroying them, and they not only come when called, they come when they think they’re being talked about because apparently they like to eavesdrop.\nMr. Long has learned how to make tea. He’s not very good at it yet, but if I fill the electric kettle up at bedtime, he starts it in the morning and makes tea for me as I’m getting up.\nBut what we’ve started to learn, now that we’re making more of them: you have to be the right person to deserve a dragon.\nNaomi Kritzer has been writing science fiction and fantasy for over twenty years. Her YA novel Catfishing on CatNet (based on her short story “Cat Pictures Please”) won the 2020 Lodestar Award, Edgar Award, and Minnesota Book Award. Her latest book, Chaos on CatNet, came out from Tor Teen in April 2021. Naomi lives in St. Paul, Minnesota with her spouse, two kids, and three cats. The number of cats is subject to change without notice."}