{"fingerprint": "FqHHN0NPMW5ibh7+7rFXilCAE+0=", "sitename": "Clarkesworld Magazine", "title": "So Much Cooking by Naomi Kritzer", "author": "Naomi Kritzer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kritzer_11_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: So Much Cooking by Naomi Kritzer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8410 words, novelette\n So Much Cooking\n Carole’s Roast Chicken\n This is a food blog, not a disease blog, but of course the rumors all over about bird flu are making me nervous. I don’t know about you, but I deal with anxiety by cooking. So much cooking. But, I’m trying to stick to that New Year’s resolution to share four healthy recipes (entrées, salads, sides . . . ) for every dessert recipe I post, and I just wrote about those lemon meringue bars last week. So even though I dealt with my anxiety yesterday by baking another batch of those bars, and possibly by eating half of them in one sitting, I am not going to bake that new recipe I found for pecan bars today. No! Instead, I’m going to make my friend Carole’s amazing roast chicken. Because how better to deal with fears of bird flu than by eating a bird, am I right?\n Here’s how you can make it yourself. You’ll need a chicken, first of all. Carole cuts it up herself but I’m lazy, so I buy a cut-up chicken at the store. You’ll need at least two pounds of potatoes. You’ll need a lemon and a garlic bulb. You’ll need a big wide roasting pan. I use a Cuisinart heavy-duty lasagna pan, but you can get by with a 13x9 cake pan.\n Cut up the potatoes into little cubes (use good potatoes! The yellow ones or maybe the red ones. In the summer I buy them at the Farmer’s Market.) Spray your pan with some cooking spray and toss in the potatoes. Peel all the garlic (really, all of it!) and scatter the whole cloves all through with the potatoes. If you’re thinking, “all that garlic?” just trust me on this. Roasted garlic gets all mild and melty and you can eat it like the potato chunks. Really. You’ll thank me later. Finally, lay out the chicken on top, skin-down. You’ll turn it halfway through cooking. Shake some oregano over all the meat and also some sea salt and a few twists of pepper.\n Squeeze the lemon, or maybe even two lemons if you really like lemon, and mix it in with 1/4 cup of olive oil. Pour that over everything and use your hands to mix it in, make sure it’s all over the chicken and the potatoes. Then pour just a tiny bit of water down the side of the pan—you don’t want to get it on the chicken—so the potatoes don’t burn and stick. Pop it into a 425-degree oven and roast for an hour. Flip your chicken a half hour in so the skin gets nice and crispy.\n Guys, it is SO GOOD. Half the time I swear Dominic doesn’t even notice what he’s eating, but he always likes this dish, and so do I. If you make this much for two people, you’ll have leftovers for lunch. But we’re having guests over tonight, my brother and his wife and kids. So, I’m actually using two chickens and four pounds of potatoes, because teenagers eat a lot.\n And chicken has magical healing properties if you make it into soup, so surely some of them stick around when you roast it? And so does garlic, so eat some and stay healthy.\n xxoo, Natalie\n Substitute Chip Cookies\n So, we have some unexpected long-term house guests.\n My sister-in-law Katrina is a nurse at Regions Hospital. She’s not in the ER or the infectious diseases floor but let’s face it, it’s not like you can corral a bunch of airborne viruses and tell them they’re banned from OBGYN. Leo and Kat are worried that if this bird flu thing is the real deal, she could bring it home. Leo’s willing to take his chances but when I said, “Would you like to have the kids stay with me for a while,” Kat said, “That would make us both feel so much better,” so voila, here I am, hosting an eleven-year-old and a thirteen-year-old. Monika is thirteen, Jo is eleven.\n We have a guest room and a sofa bed. Monika got the guest room, Jo’s on the sofa bed, although we promised to renegotiate this in a few days if they’re still here. (It’s actually a double bed in the guest room but trust me, you don’t want to make my nieces share a bed if you don’t absolutely have to.)\n I went to the store today to stock up just in case we want to minimize the “leaving the house” stuff for a while. Apparently I wasn’t the only person who had that thought because (a) the lines were unbelievable and (b) I tried four stores and they were all completely out of milk and eggs. I did manage to get an enormous jumbo package of toilet paper plus a huge sack of rat food (did I mention that Jo has a pet rat named Jerry Springer? I didn’t? Well, my younger niece Jo has a pet rat named Jerry Springer. The rat was not actually invited along for the family dinner, but Dominic ran over today to pick the rat up because he thought Jo would feel better about the whole situation if she had her pet staying here, too.)\n The freezer section was also incredibly picked over but at the Asian grocery (store #4) I bought some enormous sacks of rice and also about fifteen pounds of frozen dumplings and you know what, I’m not going to try to list what I came home with as it would be too embarrassing. I’ll just stick to the essentials, which is, no milk and no eggs. I did manage to get some butter, but it was the super-fancy organic kind that’s $10 per pound so I was also a little worried about using up our butter reserve on one batch of cookies. And Jo really wanted chocolate chip cookies.\n Okay, actually: I really wanted chocolate chip cookies. But Jo was very willing to agree that she wanted some, too.\n You can substitute mayo for eggs, in cookies, and you can substitute oil for the butter. They’ll be better cookies if you happen to have some sesame oil to put in for part of the oil (or any other nut-related oil) and we did, in fact, have sesame oil. And as it happens, those four grocery stores were not out of chocolate chips.\n Here’s the recipe in case you are also improvising today:\n \n 2 1/2 cups flour\n 1 tsp baking soda\n 1 tsp salt\n 1 cup of vegetable oils (preferable 2 T sesame oil + canola oil to equal 1 cup.)\n 3/4 cup white sugar\n 3/4 cup brown sugar\n 1 tsp vanilla extract\n 6 tablespoons of mayonnaise\n 12 ounces of whatever sort of chips you have in the house, or chopped up chocolate\n \n Cream the sugar and the oil, then beat in the mayonnaise. I promise the cookies will turn out fine, no matter how gross the mayo smells and looks while you’re beating it in. Mix the baking soda, salt, and flour together, then gradually beat in the mayo mixture, and stir in your chips.\n Drop by rounded spoonfuls—oh, you know how to make cookies. You don’t have to grease your cookie sheets. Bake at 375F for about ten minutes and if you want them to stay chewy and soft, put them away in an airtight container before they’re all the way cool. If you like your cookies crunchy, well, what’s wrong with you? But in that case cool them before you put them away, and in fact you’ll probably be happier storing them in something that’s not airtight, like a classic cookie jar.\n I gave Dominic the first batch and he said, “you didn’t use up all the butter on this, did you?” I told him we’re not about to run out of butter. We are, however, about to run out of coffee. I may die. Even if I don’t get bird flu. Excuse me, H5N1.\n xxoo, Natalie\n Homemade Pizza\n So, how are things where you live?\n Where I live (Minneapolis) there have been 83 confirmed cases of H5N1. The good news (!!!) is that it’s apparently not as lethal in the human-to-human variant as it was back when it was just birds-to-human, but since it was 60% lethal in the old form that’s not really what I think of as good good news. The bad news is that there’s a four-day incubation period so those 83 people all infected others and this is only the tiny, tiny tip of a giant, lethal iceberg.\n Probably wherever you live you’re hearing about “social distancing,” which in most places means “we’re going to shut down the schools and movie theaters and other places where folks might gather, stagger work hours to minimize crowding, and instruct everyone to wear face masks and not stand too close to each other when they’re waiting in lines.” In Minneapolis, they’re already worried enough that they’re saying that anyone who can just stay home should go ahead and do that. Since Dominic works in IT and can telecommute, that’s us. I’d planned to go to the store today again to maybe get milk and eggs. If it had been just me and Dominic . . . I still wouldn’t have risked it. But I definitely wasn’t going to risk it with Jo and Monika in the house.\n I made homemade pizza for lunch. The same recipe I made last December right after I got the pizza stone for Christmas—but, no fresh mushrooms. We had a can of pineapple tidbits and some pepperoni so that’s what we topped it with. I thought about trying some of the dried shitake mushrooms on the pizza but on thinking about it I didn’t think the texture would work.\n We are now completely out of milk, which makes breakfast kind of a problem, and we’re also out of coffee, which makes everything about my day kind of a problem. Fortunately, we still have some Lipton tea bags (intended for iced tea in the summer) and that’s what I used for my caffeine fix.\n (Running out of coffee was pure stupidity on my part. I even remember seeing it on the shelf at the grocery store, but I’m picky about my coffee and I was planning to go to my coffee shop for fresh beans today. Ha ha ha! Folgers and Maxwell House sound pretty good to me now!)\n xxoo, Natalie\n Eggless Pancakes and Homemade Syrup\n In the comments on my last post, someone wanted to know about grocery delivery. We do have grocery delivery in the Twin Cities, but every single store that offers it is currently saying that they are only providing it to current customers. I did register an account with all the places that do it, and I’ve put in an Amazon order for a bunch of items you can have delivered (like more TP) and I’m hoping they don’t e-mail me back to say they ran out and cancelled my order . . . anyway, I don’t know if I’ll be able to order anything grocery-like anytime soon.\n Some of the restaurants in town are still delivering food and I don’t know how I feel about that. Dominic and I are very lucky in that we do have the option of staying home. That makes me feel a little guilty, but in fact, me going out would not make the people who still have to go out, for their jobs, even one tiny bit safer. Quite the opposite. If I got infected, I’d be one more person spreading the virus. (Including to my nieces.) Anyway, Kat has to go out because she’s a labor and delivery nurse, and people are depending on her. But I don’t know if a pizza delivery guy should really be considered essential personnel.\n In any case, no one delivers breakfast (which was what I sat down to write about) and no one’s going to bring me milk, so I made milk-less, egg-less, butter-less pancakes, and so can you. Here’s what you need:\n \n 2 cups of flour\n 4 tsp baking powder\n 1 tsp salt\n \n Blend that together and then add:\n \n 1/2 cup of pureed banana OR pureed pumpkin OR applesauce OR any other pureed fruit you’ve got around. I used banana because I have some bananas in my freezer.\n 1 1/2 cups of water\n 1 tsp vanilla extract\n 1/2 tsp cinnamon\n 1/2 cup sugar\n \n Whisk it all together. You’ll need to grease your skillet a little bit extra because this sticks more than pancakes that were made with butter or oil.\n We’re out of maple syrup, but it turned out we still had a bottle of blueberry syrup in the back of a cabinet and that’s what we had with them. There are recipes online for homemade pancake syrup but I haven’t tried them yet. Monika hated the blueberry syrup and just ate them with sugar and cinnamon. Jo thought the blueberry syrup was fine but agreed that maple (or even fake maple) would be better. (I’m with Monika, for the record.)\n xxoo, Natalie\n Miscellaneous Soup\n So, before we get to the recipe today, I was wondering if people could do a favor for one of my friends. Melissa is a waitress, and so far thank God she is still healthy but her restaurant has shut down for the duration. So, it’s good that she’s not going to be fired for not coming in to work, and she’s glad to stay home where she’s safe, but she really needs that job to pay for things like her rent. Anyway, I talked her into setting up a GoFundMe and if you could throw in even a dollar, that would be a big help. Also, to sweeten the pot a little, if you donate anything (even just a dollar!) I’ll throw your name into a hat and draw one reader and that lucky reader will get to have me make, and eat, and blog, anything you want, although if you want me to do that before the pandemic is over you’ll be stuck choosing from the stuff I can make with the ingredients that are in my house. And, I just drove a carload of groceries over to Melissa because she and her daughter were basically out of food, and the food shelves are not running, either. (So, if you were thinking that blueberry-glazed carrots or something would be good, you’re already too late, because she is now the proud owner of that bottle of blueberry syrup. Also, I’m out of carrots.)\n Anyway, go donate! If you’ve ever wanted me to try again with the Baked Alaska, or experiment with dishwasher salmon, now’s your chance.\n Today, I made Miscellaneous Soup. That is the soup of all the miscellaneous things you have lying around. I actually make this quite often, but I’ve never blogged about it before, because I just don’t think most people would be very impressed. Ordinarily, I make it with stock (boxed stock, if I don’t want to waste my homemade stock on this sort of meal), and some leftover cooked meat if I’ve got it, and whatever vegetables are in the fridge, and either some canned beans or some noodles or both.\n What I used today:\n \n 2 packets of ramen noodles, including their little flavoring sachet\n Wine (we are not even close to being out of wine. Too bad it’s not very good poured over breakfast cereal.)\n 1/2 pound of frozen roast corn\n 1/4 pound of frozen mixed vegetables\n 2 cups dry lentils\n 1/2 pound of frozen turkey meatballs\n \n I heated up 4 cups of water and added the flavoring packet, 1 cup of wine, and the lentils. From my spice drawer, I also added some cumin and coriander, because I thought they’d go reasonably well with the spice packet. I cooked the lentils in the broth. I thawed out the corn and the mixed veggies and threw that in and then cooked the turkey meatballs in the oven because that’s what the bag wants you to do and then I broke up the ramen brick and threw that in and added the meatballs. And that’s what we all had for dinner.\n Jo hates lentils and Monika didn’t like the frozen roast corn but after some complaining they ate it all anyway. And Andrea and Tom liked it fine.\n Right, I guess I should fill you in about Andrea and Tom.\n Andrea is a friend of Monika’s from school; they’re both in 8th grade. Monika found out (I guess from a text?) that Andrea was home alone with her brother, Tom, because their mother is so worried about bringing the flu home that she’s been sleeping in the car instead of coming home. Tom is only three. Also, they were totally out of food, which is why Monika brought this up (after I did the grocery drop off for Melissa.)\n I told her that of course we could bring some food over to her friend, but when I realized Andrea was taking care of a three-year-old full time I suggested they come over here, instead.\n So now Monika and Jo are sharing the double bed in the guest room, because sorry, girls, sometimes “shared sacrifice” means a shared bed. Andrea is on the sofa bed and Tom is on the loveseat. Well, he was on the loveseat last night. I think tonight he’s going to be on the loveseat cushions and those cushions are going to be on the floor so he’s got less far to fall if he rolls off again.\n Can I just say, this is not exactly how I’d imagined my February. But at least we’re all healthy and not out of food yet.\n xxoo, Natalie\n Ten Things I’m Going to Make When This Is Over\n Dinner today was hamburger and rice. I kept looking at recipes and crying, and Dominic wound up cooking.\n I kind of want to tell you all the things we’re out of. Like, AA batteries. (I had to track down a corded mouse from the closet where we shove all the electronic stuff we don’t use anymore, because my cordless mouse uses AA batteries.) Dishwasher detergent. (We still have dish soap, but you can’t put that in a dishwasher. So we’re washing everything by hand.) But you remember when we used to say, “first-world problems” about petty complaints? These are healthy-person problems.\n We got a call today that Kat is sick. She’s been working 16-hour shifts because some of the other nurses are sick and some of them were refusing to come in and they needed nurses because the babies have still been coming, because they’re going to just keep doing that. Literally everyone is in masks and gloves all the time, but—today she’s running a fever.\n Leo says she’s not going to go into the hospital because there isn’t anything they can really do for you anyway, especially as overloaded as they are. She’s just going to stay at home and drink fluids and try to be one of the 68% who’ve been making it through.\n So yeah, I wasn’t going to tell you about that when I sat down, I was going to tell you all about the things I’ve been craving that I’m going to make when all this is over but I guess what I really want to say is that the top ten things I want to make when all this is over are ten different flavors of cupcake for Kat, because Kat loves my cupcakes, and if you’re into prayer or good thoughts or anything like that, please send some her way.\n There’s still time to donate to Melissa and choose something to have me make. But, seriously, you’ll want to wait until this is over because there’s just not much in the house.\n Kale Juice Smoothies (Not Really)\n Dear crazy people who read my blog,\n I know—well, I’m pretty sure—that you’re trying to be helpful.\n But telling me that all my sister-in-law (the mother of my nieces!) needs to do to recover is drink kale juice smoothies with extra wheatgrass and whatever else was supposed to go in your Magic Immune Tonic? Not helpful. First of all, she’s sick with a disease with a 32% fatality rate. Second of all, even if kale or kelp or whatever it was was magic, have you actually been reading my blog? We are eating rice, with flavored olive oil, for fully half our meals now. Today we mixed in some dry Corn Flakes, partly for the textural variety but partly just because we could make less rice because we’re starting to worry that we’re going to run out of that, too.\n I can produce a kale smoothie for Kat like I can pull a live, clucking chicken out of my ass and make her some chicken soup with it.\n Also, this is a food blog, not a conspiracy theory blog. If you want to try to convince people that the government is infecting everyone on purpose toward some nefarious end, go do it somewhere else.\n No love,\n Natalie\n Rabbit Stew\n There are these rabbits that live in our yard. I swear we have like six. They’re the reason I can’t grow lettuce in my garden. (Well, that plus I’d rather use the space for tomatoes.)\n I am pretty sure I could rig up a trap for it with items I have around the house and bunnies are delicious.\n Pros:\n \n Fresh meat!\n \n Cons:\n \n Dominic thinks it’s possible we could get influenza from eating the bunny. (I think he’s being paranoid and as long as we cook it really well we should be fine. I could braise it in wine.)\n I have no actual idea how to skin and gut a rabbit, but I have sharp knives and the Internet and I’m very resourceful.\n Jo is aghast at the idea of eating a bunny.\n We’d probably catch at most one rabbit, and one rabbit split between all these people isn’t very much rabbit.\n \n It’s even more people now, because we’ve added another kid. (You can feel free to make a Pied Piper joke. Or a crazy cat lady joke. We are making all the jokes because it’s the only stress release I’ve got remaining to me.) Arie is twelve, and came really close to being driven back to his cold, empty apartment after he suggested we eat Jo’s rat. (If he were just out of food, we could send him home with food, but the heat’s also gone out, the landlord’s not answering the phone, and it’s February and we live in Minnesota.)\n Arie is Andrea’s cousin. Or, hold on, I take it back. Maybe he’s her cousin’s friend? You know what, I just didn’t ask that many questions when I heard “twelve” and “no heat.”\n xxoo, Natalie\n This is no longer a food blog\n This is a boredom and isolation blog.\n Also a stress management blog. Normally, I manage stress by cooking. Except we’re out of some key ingredient for like 85% of the recipes I can find, and also out of all the obvious substitutes (or nearly) and I’m starting to worry that we will actually run out of food altogether. I’ve pondered trying to reverse-engineer flour by crushing the flakes of the Raisin Bran in my food processor, like some very high-tech version of Laura Ingalls grinding up unprocessed wheat in a coffee mill in The Long Winter.\n My cute little bungalow is very spacious for me and Dominic. For me, Dominic, and five kids ranging in age from three to thirteen, it’s starting to feel a little cramped. Monika brought a laptop and she, Arie, and Andrea all want turns using it. (Jo doesn’t ask very often, she just sighs a martyred sigh and says no it’s fine she understands why the big kids are hogging the computer.) We are thoroughly expert on the streaming movies available on every online service but the problem is, if it’s appropriate for Tom to watch, the big kids mostly aren’t interested. We did find a few old-timey musicals that everyone could tolerate but now Tom wants to watch them over and over and Andrea says if she has to listen to “the hiiiiiiiiiills are aliiiiiiiiive with the sound of muuuuuuuuuusic” one more time she might smash the TV with a brick.\n We have a back yard and from an influenza infection standpoint it’s reasonably safe to play back there, but it’s February in Minnesota and we’re having a cold snap, like yesterday morning it was -30 with the windchill. (The good news: the cold temperatures might slow the spread of the virus.)\n So here’s what we did today: I had some craft paints in the basement, and brushes, so we pulled all the living room furniture away from the wall and I let them paint a mural. The good news: this kept them happily occupied all afternoon. The even better news: they’re not done yet.\n xxoo, Natalie\n Birthday Pancake Cake\n Today is Jo’s birthday, and everyone almost forgot. In part because she clearly expected that everyone had more important things on their mind and wasn’t going to bring it up. Monika, bless her cranky thirteen-year-old heart, remembered.\n I thought at first we were not going to be able to bake her a cake. (Unless I really could figure out a way to turn cereal flakes into usable flour, and probably not even then.) But—when I went digging yesterday for the craft paint in the basement, I found this small box of just-add-water pancake mix with our camping equipment. If I’d remembered it before now, I totally would’ve turned it into breakfast at some point, so thank goodness for absent-mindedness. We also still had a package of instant butterscotch pudding mix, un-used since you really can’t make instant pudding without milk.\n The other kids took a break from painting the mural and instead made decorations out of printer paper, scissors, and pens. (They made a chain-link streamer.)\n I think there’s got to be a way to turn pancake mix into a proper cake, but all the methods I found online needed ingredients I didn’t have. So I wound up making the pancake mix into pancakes, then turning the pancakes into a cake with butterscotch frosting in between layers. (To make butterscotch frosting, I used some melted butter—we still had a little left—and some oil, and the butterscotch pudding mix.)\n And we stuck two votive candles on it and sang.\n Jo did get presents, despite my cluelessness. The mail is still coming—some days—and her father remembered. A big box full of presents ordered from online showed up late in the day, signed “with love from Mom and Dad,” which made her cry.\n We’ve been getting updates on Kat, which mostly I haven’t been sharing because they haven’t been very good. We’re just trying to soldier on, I guess. And today that meant celebrating Jo’s birthday.\n It Feels Like Christmas\n You guys, YOU GUYS. We’re going to get a food delivery! Of something! Maybe I should back up and explain. The local Influenza Task Force arranged for the grocery stores with delivery services to hire on a whole lot more people, mostly people like Melissa whose jobs are shut down, and they’re now staffed well enough to do deliveries nearly everywhere. Everyone was assigned to a grocer and since we have eight people living here (oh, did I mention Arie also had a friend who needed somewhere quarantined to stay? We are full up now, seriously, the bathroom situation is beyond critical already and we’ve been rotating turns to sleep on the floor) we’re allowed to buy up to $560 worth of stuff and it should arrive sometime in the next few days. They’ve instructed us not to go out to meet the delivery person: they’ll leave it on our doorstep and go.\n Of course, the problem is that they are out of practically everything. Minneapolis is such a hot spot, a lot of delivery drivers don’t want to come here, plus things are such a mess in California that not much produce is going anywhere at all, so there was no fresh produce of any kind available. I was able to order frozen peaches—though who knows if they’ll actually bring any. Of course there was no milk or eggs but they had almond milk in stock so I ordered almond milk because at least you can use it in baking. They also warned me that in the event that something went out of stock they’d just make a substitution so who even knows, see, it’ll be totally like Christmas, where you give your Mom a wish list and maybe something you put on it shows up under the tree.\n I did include a note saying to please, please, please make sure that we got either coffee or something with caffeine. If I have to drink Diet Mountain Dew for breakfast, I will. I mean, we had a two-liter of Coke and I’ve been rationing it out and it’s going flat and I don’t even care. Well, I do care. But I care more about the headaches I get when deprived of my morning caffeine fix.\n Some of you were asking about Kat. She’s hanging in there, and Leo has stayed healthy. Thanks for asking.\n Someone also asked about the rabbits. So far I have not murdered any of the local wildlife, because maybe I’m slightly squeamish, and Dominic is definitely squeamish.\n xxoo, Natalie\n Rice Krispie Treats\n So, here’s what came in the box from the grocery store. In addition to a bunch of generally useful items like meat, oil, pancake mix, etc., we got:\n \n 12 cans of coconut milk\n 1 enormous can of off-brand vacuum-packed ground coffee THANK YOU GOD.\n 3 bags of miniature marshmallows\n 2 large cans of butter-flavored shortening\n 1 enormous pack of TP THANK YOU GOD. I am not going to tell you what we were substituting.\n 1 small pack of AA batteries\n A sack of Hershey’s Miniatures, you know, itty bitty candy bars like you give out on Halloween.\n 14 little boxes of Jell-O gelatin\n 1 absolutely goliath-sized sack of knock-off Rice Krispie look-alikes\n \n Most of this was not stuff we ordered. In a few cases, I could make a guess what the substitution was. I wanted flour, I got pancake mix. (That one’s not bad.) I wanted chocolate chips, I got Hershey’s Miniatures. (Again, not bad.) I ordered some grape juice concentrate because we’ve been out of anything fruit-like for days and days and although technically you can’t get scurvy this quickly (I checked) I’ve been craving things like carrots and I thought maybe some fruit juice would help. I think the coconut milk was the substitute for the almond milk.\n I have no idea why I got the Crispy Rice. I didn’t ask for cereal. We still even have some cereal. But! They also gave us marshmallows and butter-flavored shortening (if not actual butter) so you know what it’s time for, don’t you? That’s right. RICE KRISPY TREATS.\n I made these once when I was a kid without a microwave oven, and let me just tell you, they are a lot of work when you don’t have a microwave oven. You have to stand over a stove, stirring marshmallows over low heat, for what feels like two hours. They’ll still give you stovetop directions but I highly recommend microwave cooking for these.\n What you’ll need:\n \n 3 tablespoons butter (or margarine or butter-flavored shortening. You can even use extra-virgin olive oil! But, I do not recommend using garlic-infused extra-virgin olive oil.)\n 1 10-oz bag of marshmallows (or 4 cups of mini marshmallows or 1 jar of marshmallow fluff.)\n 6 cups rice cereal (or corn flakes or Cheerios or whatever cereal you’ve got on hand but if you decide to use bran flakes or Grape Nuts I’m not responsible for the results.)\n \n Put your butter and your marshmallows into a microwave-safe bowl. Heat on high for two minutes. Stir. Heat on high for another minute. Stir until smooth. Add the cereal. Stir until distributed.\n Spray or oil a 13x9 inch pan and spread the marshmallow mixture out in the pan. Not surprisingly this is incredibly sticky and you’ll want to use waxed paper folded over your hands, or a greased spatula, or possibly you could just butter your own hands but be careful not to burn yourself. Let it cool and then cut it into squares.\n Dominic came in while I was spreading the stuff out in my pan and said, “What are you doing?”\n I said, “I’m making Coq au Vin, asshole.”\n He said, “This is why I can’t have nice things.”\n Maybe you had to be there.\n For dinner tonight, we had minute steaks and Rice Krispy treats. And there was great rejoicing.\n xxoo, Natalie\n Katrina Jane, March 5, 1972 - February 20, 2018\n I’ve got nothing today. I’m sorry.\n My brother was coughing when he called to tell us the bad news, but said he wasn’t sick, didn’t have a fever, and definitely hadn’t caught the flu from Kat.\n Thanks for everyone’s thoughts and prayers. I know I’m not the only person grieving here, so just know that I’m thinking of you, even as you’re thinking of me.\n You Still Have to Eat\n Leo had Kat cremated but he’s going to wait to have a memorial service until we can all come—including her kids. Monika was furious and insisted that she wants a proper funeral, and wants to go, and thinks it should be this week like funerals normally are, and of course that’s just not possible. They can’t actually stop us from having gatherings but there are no churches, no funeral homes, no nothing that’s going to let you set up folding chairs and have a bunch of people sitting together and delivering eulogies.\n We finally talked Monika down by holding our own memorial service, with as many of the trappings as we could possibly put together. We made floral arrangements by taking apart the floral wreath I had in the kitchen with dried lavender in it. We all dressed in black, even though that meant most of the kids had to borrow stuff out of my closet. Then we put out folding chairs in the living room and Dominic led us in a funeral service.\n Monika had wanted to do a eulogy but she was crying too hard. She’d written it out, though, so Arie read it for her. I saved it, in case she wants to read it at the real memorial service. Well, maybe for her, this will always be the real memorial service. But there will be another one, a public one, when the epidemic is over.\n In Minnesota after a funeral, there’s usually lunch in a church basement and there’s often this dish called ambrosia salad. (Maybe other states have this? I haven’t been to very many funerals outside Minnesota.) I was missing some of the ingredients, but I did have lime Jell-O and mini-marshmallows and even a pack of frozen non-dairy topping and I used canned mandarin oranges instead of the crushed pineapple, and mixed all together that worked pretty well. We had ambrosia salad and breakfast sausages for lunch. (I don’t know why we got so many packs of breakfast sausages, but it’s food, and everyone likes them, so we’ve been eating them almost every day, mostly not for breakfast.)\n Monika asked if she could save her share of the ambrosia salad in the fridge until tomorrow, because she really likes it, and she didn’t feel like eating, and didn’t want anyone else to eat her share. (Which was a legitimate worry.) I put it in a container and wrote MONIKA’S, NO ONE ELSE TOUCH ON PAIN OF BEING FED TO THE RAT in sharpie on the lid. Which made her laugh, a little. I guess that’s good.\n Jo sat through the service and ate her lunch and didn’t say a word. Mostly she looks like she doesn’t really believe it.\n Stone Soup\n Arie informed me today that the thing I called “Miscellaneous Soup” is actually called “Stone Soup,” after a folk story where three hungry strangers trick villagers into feeding them. In the story they announce that they’re going to make soup for everyone out of a rock, and when curious villagers come to check out what they’re doing, say that the soup would be better with a carrot or two . . . and an onion . . . and maybe some potatoes . . . and some beans . . . and one villager brings potatoes, and another one brings an onion, and in the end, there’s a lovely pot of soup for everyone.\n I started to point out that I wasn’t tricking anybody, all this stuff was in my cabinet already, but then I realized that I didn’t just have dinner but an activity and all the kids came into the kitchen and acted out the story with little Tom playing the hungry stranger trying to get everyone to chip in for the soup and then throwing each item into the pot.\n Then they all made cookies, while I watched, using mayo for the eggs and dicing up mini candy bars for the chips.\n It was a sunny day today—cold, but really sunny—and we spread out a picnic cloth and ate in the living room, Stone Soup and chocolate chip cookies and everyone went around in a circle and said the thing they were most looking forward to doing when this was over. Monika said she wanted to be able to take an hour-long shower (everyone’s limited to seven minutes or we run out of hot water). Dominic said he wanted to go to the library. I said I wanted to bake a chocolate soufflé. Everyone complained about that and said it couldn’t be cooking or baking, so I said I wanted to go see a movie, in a theater, something funny, and eat popcorn.\n Tomorrow is the first of March.\n Hydration\n Dominic is sick. It’s not flu. I mean, it can’t be; we haven’t gone out. Literally the whole point of staying in like this has been to avoid exposure. It also can’t be anything else you’d catch. We thought at first possibly it was food poisoning, but no one else is sick and we’ve all been eating the same food. According to Dr. Google, who admittedly is sort of a specialist in worst-case scenarios, it’s either diverticulitis or appendicitis. Or a kidney stone.\n Obviously, going in to a doctor’s office is not on the table. We did a phone consultation. The guy we talked to said that yes, it could be any of those things and offered to call in a prescription for Augmentin if we could find a pharmacy that had it. The problem is, even though H5N1 is a virus and antibiotics won’t do anything for it, there are a lot of people who didn’t believe this and some of them had doctors willing to prescribe whatever they were asking for and the upshot is, all our pharmacies are out of almost everything. Oh, plus a bunch of pharmacies got robbed, though mostly that was for pain meds. Pharmacies are as much of a mess as anything else, is what I’m saying.\n I’m not giving up, because in addition to the pharmacies that answered the phone and said they didn’t have any, there were a ton where no one even picked up. I’m going to keep trying. In the meantime, we’re keeping Dominic hydrated and hoping for the best. I always keep a couple of bottles of Pedialyte around, because the last thing you want to do when you’re puking is drive to the store, and that stuff’s gross enough that no one’s tried to get me to pop it open for dessert. So I’ve got it chilled and he’s trying to drink sips.\n If it’s a kidney stone, Augmentin won’t do anything, but eventually he’ll pass the stone and recover, although it’ll really suck in the meantime. (I wish we had some stronger pain medication than Tylenol. For real, no one has Vicodin right now. Not a single pharmacy.) If it’s appendicitis, there’s a 75% chance that the Augmentin will fix it. (This is new! Well, I mean, it’s new information. There was a study on treating appendicitis with antibiotics and 75% of cases are a type of appendicitis that won’t rupture and can be treated with antibiotics! And if you get a CT scan they can tell whether that’s the kind you’ve got, but, well.) If it’s diverticulitis, and he can keep down fluids, the antibiotics should help. If he’s got the worse kind, and can’t keep down fluids, they would normally hospitalize him for IV antibiotics and maybe do surgery. But again, not an option.\n Oh, it could also be cancer. (Thanks, Dr. Google!) In which case there’s no point worrying about it until the epidemic is over.\n Cream of Augmentin\n I got an e-mail from someone who has Augmentin they’re willing to sell me. Or at least they say it’s Augmentin. I guess I’d have to trust them, which is maybe a questionable decision. They want $1,000 for the bottle, cash only. Dominic was appalled that I’d even consider this. He thought it was a scam, and they were planning to just steal the cash.\n Fortunately I also got through to a pharmacy that still had it, a little neighborhood place. Dominic’s doctor called in the prescription, and I gave them my credit card number over the phone, and they actually delivered it. While I was on the phone with them they listed out some other things they have in stock and in addition to the Augmentin we got toothpaste and a big stack of last month’s magazines. Shout out to St. Paul Corner Drug: we are going to get every prescription from you for the rest of our natural lives.\n I was hoping that starting the Augmentin would make Dominic at least a little better right away, but instead he’s getting worse.\n Possibly this is just a reaction to the Augmentin. It’s not as bad as some antibiotics, but it can definitely upset your stomach, which is pretty counterproductive when puking and stomach pain are your major symptoms.\n I had appendicitis when I was a teenager. I spent a day throwing up, and when I got worse instead of better my mother took me to the emergency room. I wound up having surgery. Afterwards I was restricted to clear liquids for a while, just broth and Jell-O and tea, which I got really tired of before they let me back on solid food. My mother smuggled in homemade chicken stock for me in a Thermos—it was still a clear liquid, but at least it was the homemade kind, the healing kind.\n If I could pull a live, clucking chicken out of my ass, like I joked about, I would wring its neck and turn it into stock right now for Dominic. Nothing’s staying down, did I mention that? Nothing. But it’s not like we have anything for him other than Pedialyte.\n I’m going to try to catch a rabbit.\n Rabbit Soup\n You guys, you really can find instructions for just about anything online. Okay, I’ve never looked to see if there’s a YouTube video on how to commit the perfect crime, but trapping an animal? Well, among other things, it turns out that the cartoon-style box-leaned-up-against-a-stick-with-bait-underneath is totally a thing you can actually do, but then you’ve got a live animal and if you’re planning to eat it you’ll still need to kill it. I wound up making a wire snare using instructions I found online in the hopes that the snare would do the dirty work for me. And it did. More or less. I’ll spare you the details, other than to say, rabbits can scream.\n You can also find instructions for gutting and skinning a rabbit online. I used my kitchen shears for some of this, and I worked outside so that Jo didn’t have to watch. My back yard now looks like a murder scene, by the way, and my fingers were so cold by the end I couldn’t feel them. I feel like I ought to use the fur for something but I don’t think Home Taxidermy is the sort of craft that’s going to keep the pack of pre-teens cheerfully occupied. (Right now they’re reading through all the magazines we got from the pharmacy and I’m pretending not to notice that one of them is Cosmo.)\n Back inside I browned the rabbit in the oven, since roasted chicken bones make for much tastier stock than just raw chicken, and then I covered it in just enough water to cover and simmered it for six hours. This would be better stock if I had an onion or some carrots or even some onion or carrot peelings, but we make do. The meat came off the bones, and I took out the meat and chopped it up and put it in the fridge for later, and I boiled the bones for a bit longer and then added a little bit of salt.\n The secret to good stock, by the way, is to put in just enough water to cover the bones, and to cook it at a low temperature for a very long time. So there wasn’t a whole lot of stock, in the end: just one big mug full.\n The kids have been staying downstairs, trying to keep out of Dominic’s way. Jo and Monika made dinner for the rest of us last night (rice and breakfast sausages) so I could take care of him. I saw Jo watching me while I carried up the mug of soup, though.\n The bedroom doesn’t smell very pleasant at the moment—sweat, vomit, and cucumber-scented cleaner from Target. It’s too cold to open the windows, even just for a little while.\n Dominic didn’t want it. I’d been making him sip Pedialyte but mostly he was just throwing it up again, and he was dehydrated. I pulled up a stool and sat by the edge of his bed with a spoon and told him he had to have a spoonful. So he swallowed that, and I waited to see if it stayed down, or came back up. It stayed down.\n Two minutes later I gave him another spoonful. That stayed down, too.\n This is how you rehydrate a little kid, by the way: one teaspoonful every two minutes. It takes a long time to get a mug into someone if you’re going a teaspoon at a time, but eventually the whole mug was gone. The Augmentin stayed down, too.\n I went downstairs and set another snare in the back yard.\n Something Decadent\n So, thank you everyone who donated to Melissa’s fundraiser. I put all the names in the hat and drew out Jessie from Boston, Massachusetts, and she says she doesn’t want me to wait until everything is over, she wants a recipe now. And her request was, “Make something decadent. Whatever you’ve got that can be decadent.” And Dominic is sufficiently recovered today, that he can eat something decadent and not regret it horribly within ten minutes, so let’s do this thing.\n We still have no milk, no cream, no eggs. I used the frozen whipped topping for the ambrosia salad and the marshmallows for the rice krispy treats (which aren’t exactly decadent, anyway).\n But! Let’s talk about coconut milk. If you open a can of coconut milk without shaking it up, you’ll find this gloppy almost-solid stuff clinging to the sides of the can; that’s coconut cream. You can chill it, and whip it, and it turns into something like whipped cream. We set aside the coconut cream from three of the cans and chilled it.\n I had no baking cocoa, because we used it all up a while back on a not-terribly-successful attempt at making hot chocolate, but I did have some mini Hershey bars still, so I melted the dark chocolate ones and cooled it, and thinned that out with just a tiny bit of the reserved coconut milk. It wasn’t a ton of chocolate, just so you know—it’s been a bit of a fight to keep people from just scarfing that candy straight down. But we had a little.\n Then I whipped the coconut cream until it was very thick and almost stiff, and then mixed in the dark chocolate and a little bit of extra sugar, and it turned into this coconut-chocolate mousse.\n When eating decadent food, presentation counts for a lot. We used some beautiful china teacups that I got from my great-grandmother: I scooped coconut-chocolate mousse into eight of them, and then I took the last of the milk chocolate mini bars and grated them with a little hand grater to put chocolate shavings on top. We also had some sparkly purple sprinkles up with the cake decorations so I put just a tiny pinch of that onto each cup. And I opened one of the cans of mandarin oranges and each of the mousse cups got two little orange wedges.\n And I tied a ribbon around the handles of each teacup.\n And then we set the table with the tablecloth and the nice china and we ate our Stone Soup of the day by candlelight and then I brought out the mousse and everyone ate theirs and then licked out the cups.\n Some days it’s hard to imagine that this will ever be over, that we’ll ever be able to get things back to normal at all. When everyone is sniping at each other it feels like you’ve always been trapped in the middle of a half-dozen bickering children and always will be. When you’re in the midst of grief, it’s hard to imagine spring ever coming.\n But Dominic pulled through, and Leo didn’t get sick. And tying the ribbons around the handles, I knew: this will all come to an end. We’ll survive this, and everyone will go home. I’m going to miss them, I thought, this pack of other people’s children I’ve crammed into my bungalow.\n “Can I keep the ribbon?” Jo asked, when she was done with her mousse.\n I told her, of course she could. And then she and Monika started arguing over whether she could have Monika’s ribbon, too, because of course they did, and that was our day, I guess, in a nutshell.\n xxoo, Natalie\n Naomi Kritzer has been writing science fiction and fantasy for over twenty years. Her YA novel Catfishing on CatNet (based on her short story “Cat Pictures Please”) won the 2020 Lodestar Award, Edgar Award, and Minnesota Book Award. Her latest book, Chaos on CatNet, came out from Tor Teen in April 2021. Naomi lives in St. Paul, Minnesota with her spouse, two kids, and three cats. The number of cats is subject to change without notice."}