{"fingerprint": "wWyYpl5nWDH6l6BaNGsTyI4IOuM=", "sitename": "Clarkesworld Magazine", "title": "Bits by Naomi Kritzer", "author": "Naomi Kritzer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kritzer_10_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bits by Naomi Kritzer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3990 words, short story\nBits\nFINALIST: 2014 WSFA SMALL PRESS AWARD FOR SHORT FICTION\nSo here is something a lot of people don’t realize: most companies that make sex toys are really small. Even a successful sex-toy manufacturer like Squishies (tm) is still run out of a single office attached to a warehouse, and the staff consists of Julia (the owner), Juan (the guy who does all the warehouse stuff), and me (the person who does everything else).\n(You are probably wondering right now if that includes product testing. I make it a habit not to talk about my sex life with strangers but Julia requires that everyone she hires take home a Squishie or a Firmie or one of the other IntelliFlesh products and try it out, either solo or with a partner. I pointed out that if she ever hired an alien—sorry, “extraterrestrial immigrant”—the neurology doesn’t match up, and does she want to admit she discriminates in hiring? But I didn’t argue that hard, because hey, free sex toy, why not? Frankly, I found it a kind of freaky experience, having this piece of sensate flesh that didn’t really belong there, and after a little bit of experimentation I stuck it in a drawer and haven’t touched it since.)\nAnyway, we outsource the manufacturing and the boxes of Squishies and Firmies get shipped to us on shrink-wrapped pallets and Juan breaks them down to re-ship in more manageable quantities to the companies that resell our products.\nThe original product were the Squishies, and Julia is not at ALL shy about people knowing about her sex life (we have an instructional video, and she’s IN it) so I don’t mind telling you that she came up with it because her boyfriend at the time had a fetish for really large breasts, we’re not talking “naturally gifted” or even “enhanced with silicone” but “truly impractical for all real-world purposes like breathing and using your arms,” and conveniently at the time she was working at a company making top-of-the-line prosthetics with neural integration. She made herself a really enormous set of breasts and after a lot of futzing with the neural integration she got them to be sensate. Then the boyfriend dumped her and she didn’t really need them anymore, but her friend who’d had a double mastectomy said, “why don’t you make me a smaller set?” and that, supposedly, was when it occurred to her that maybe she could make this product to SELL. She found a manufacturing facility and office space, hired me and Juan, and went into the Fully Sensate Attachable Flesh business.\nDepending on your predilections you may already be wondering why she started with boobs. IntelliFlesh is re-shapable, at least up to a point, and since I was the Customer Service department I started getting calls from people who wanted to reshape it into something longer, stiffer, and pointier.\n“Julia,” I said one day, taking off my headset, “You need to start making strap-on dicks.”\n“I can’t call those Squishies,” she said dismissively.\n“So? Roll out a new line. Hardies. Dickies. Cockies. If you go with Cockies you can say ‘like cookies, only better’ in the ads.” Maybe I should note that one of the few things Julia doesn’t let me do is write the ad copy.\nThe Firmies were an even bigger seller than the Squishies. Between boobs and dicks, we had most users covered, but every now and then I got a call from someone who wanted something a little more customized.\n“You’ve reached Afton Enterprises, home of Squishies and Firmies,” I said. “How may I help you?” (In addition to not getting to write the ad copy, I don’t get to decide how to answer the phone, judging from the fact that Julia shot down the greeting, “How may I improve your sex life today?”)\n“I’m thinking about buying either a Squishie or a Firmie, and I . . . had some questions,” the woman said, her voice hesitant. “They’re sort of expensive and I’m not sure which will meet my needs.”\n“Well, the Squishie is squishier,” I said. “It’s more malleable, but it also doesn’t tend to hold alternate shapes for very long unless you refrigerate it for a while before you get started. The Firmie arrives long and narrow, but if you want it to have a different shape—say, a curve or even a hook—you can gently heat it up and mold it.”\n“What I want is a prosthetic vagina,” the woman blurted out. “In a different spot.”\nYou’re not really supposed to say, “you want what?” to customers when you’re doing customer support for a sex toy shop. We are pro-sex, pro-kink, and anti-shame: there is officially no wrong way to have sex. So: “Which spot?” I asked.\n“Well, we’re not exactly sure. Part of the advantage of your products is that we can move them around. What if I bought two Firmies? Could I reshape those into two halves of a vagina, like maybe one could be the top of the, um, tube, and the other could be the bottom . . . are your products compatible with lubricant?”\n“There’s a special lube that we sell,” I said. “Other lubricants might void the warranty.”\n“That adds to the cost even more,” the woman said, clearly frustrated. “Is there any way to find out before I put down all that money whether it’s going to work for me? If they sold these at REI I would just buy it and figure I’d return it if I needed to, but nobody takes returns on sex toys.”\n“We do, under some circumstances,” I said. “Can you give me a little more information about what your goal is with our product?”\n“I want to have sex with my husband,” she said, impatiently, “real sex, or as real as it can get. And he’s a K’srillan male. Our God-given parts just don’t match up.”\nThe K’srillan—our “extraterrestrial immigrants”—made radio contact about a decade ago, and arrived on earth a year and three months ago. Juan periodically mutters about how no matter what they say, they might still be planning invasion and how would we even stop them? But they offered us suspended-animation technology in exchange for asylum (from who? was Juan’s immediate question, but we’ve been assured that they were fleeing the death of their sun, not some second wave of dangerous aliens) and a dozen U.S. cities wound up taking settlements. (They’re spread around. There are a bunch of others in other countries all over the world.) So far in the U.S. it was mostly okay, other than some anti-immigrant rioting in Kansas City. I hadn’t actually met any K’srillan—there was a settlement in Minneapolis but I live in St. Paul and don’t cross the river much—but from what I could tell they were all law-abiding and hard working and in general the sort of people you want to have come and settle in your city.\nThey also looked kind of like roadkilled giant squid. They don’t have faces, as such. I mean, they have eyes, seven of them, which are on stalks, and they have a mouth, which they use to eat and speak, but they’re not right next to each other the way you would expect in practically every earth species out there, from mammals to reptiles to fish. I mean, okay, we do have squids. But they don’t walk around the shopping mall. On tentacles.\nK’srillan do talk, but they aren’t physically capable of making the same sounds as us, so they carry a voice synthesizer for communication.\nThe thought of sex with, or marriage to, a K’srillan was completely baffling to me.\nEven, dare I say it, gross.\nBut we are pro-sex, pro-kink, and anti-shame, so I said, “Okay!” in as cheerful a voice as I could muster, and didn’t add, “Husband? You sure moved fast.” (I might not judge sex lives but I reserve the right to judge major life decisions.) “I don’t actually know that much about K’srillan sexual anatomy. So, um. He has a penis?”\n“Yes, we don’t need a Firmie for him,” the woman said, dismissively. “Your products don’t interface with K’srillan neurology anyway or we’d consider buying him a Firmie and having him use that instead of his own penis. He has a penis, but it’s eighteen inches long, and bifurcated.”\n“Bifurcated?”\n“Branches into two, basically.”\n“You’d need at least four Firmies,” I blurted out. “To make a vagina for eighteen inches of branched penis.”\n“That is a lot of money.”\n“Yeah, for that much you could practically get a custom order.”\n“Oh! You do custom orders?”\n“No. We don’t. But surely someone . . . ”\n“Do you think I haven’t checked?” the woman asked, exasperated. “There has been a lot of discussion of this in the Full Integration community. I am not the only woman looking.”\n“You aren’t?”\n“No!”\nWell, that changed things, maybe. A custom order was one thing. A prototype was potentially a whole different matter.\n“No.”\n“No? Just no?”\n“Would you rather I went with ‘no, that’s a repulsive idea?’ ”\nI stared at Julia. “I thought we were pro-kink and anti-shame?” To be fair, I’d had a similar reaction at first, but I was actively trying to get past my emotional reaction. Everyone involved was a consenting adult—okay, so the K’srillans had a different life span and developmental arc from humans, but I’d checked, and since the K’srillan males didn’t actually develop a penis until sexual maturity, clearly these were adults we were talking about. Anyway. “Did you know that there’s already a sector of the porn industry devoted to sex between human women and K’srillan males? Apparently an eighteen-inch bifurcated—”\n“Stop. I don’t want to hear about it.”\n“Did I ever say that about your ex-boyfriend’s fetish for massive boobs? No. Your kink is not my kink, and your kink is okay. Their kink is not our kink, but that doesn’t mean we can’t sell them stuff!”\nJulia threw down the silicone butt plug she’d been examining. (We’d been thinking about new ways to extend our line anyway. It’s not as if my suggestion had come completely out of the blue.) “Okay. Fine. You want to design something, we’ll test the market. But you are going to have to take the measurements, you are going to have to build the prototype, and you are certainly going to have to do the focus group and interviews because this is a repulsive idea.”\n“Fine!” I said. “Fine. I will handle—” I cut myself off. “I will deal with all of it. And we’ll see if enough people want this to make it viable.”\nThe woman who’d called was named Liz, and her husband’s name was Zmivla, and it turned out that Zmivla was part of the group that had settled in Minneapolis, so they lived less than five miles from my office. I drove to the high-rise apartment where so many of the new arrivals had moved in, and took an elevator to their apartment on the twelveth floor.\n“Come in,” Liz said when she answered the door. “I’ve made coffee.” She laughed nervously. “Do you drink coffee?”\nZmivla was lounging in the recliner, tentacles draped over both the arm rests and the foot rest. Two of his eye stalks swiveled to look at me when I came in and his speech synthesizer said, “Hello, Ms. Marshall.”\n“Call me Renee,” I said.\nLiz handed me a cup of coffee and I studied Zmivla, wondering if I should just whip out the tape measure and ask him to whip out his penis, or if we should have some more preliminaries first. When Julia started making the Firmies, I think rather than measuring actual penises she bought the dozen or so top-selling models of dildo and measured those. But there aren’t currently any K’srillan dildo models on the market, so we were going to have to go with some actual penises. I took a deep breath. “I should ask some sort of basic questions first, I think.”\n“Would you like to know how we met?” Liz asked, brightly.\nActually, I mostly wanted to know how K’srillan sex normally worked with another K’srillan but if she wanted to start with something a little less explicit I supposed that was a reasonable lead-in, so I nodded and drank my coffee while they told me their how-we-met story. I think it involved a conversation that started at the Powderhorn Art Fair but it’s possible I’m mis-remembering and actually that’s how my sister met her ex-husband. If you want to know the truth, all the cutesy “how we met” stories blur together for me. If you met your sweetie because he was third in line for the organized gang bang at the local dungeon and you really liked the shape of his dick, that I’ll remember. If he offered to help you carry your pottery in his tentacles while you kept your dog from bolting, I just don’t care enough to keep it in my head for more than fifteen minutes.\nLiz worked in a boring office and Zmivla had a boring job that was clearly beneath his talents and after they told me that Liz’s hobby was making still life paintings it was clear they were stalling, and I couldn’t entirely blame them, given that I was there to measure the guy’s penis.\n“I know this is a somewhat uncomfortable situation for all of us,” I said. “But we really probably should get down to business, okay?”\n“I just want you to . . . ” Liz hesitated.\nZmivla stroked the back of her hand with the tip of one of his tentacles, delicately. With one of the others, he brushed a strand of hair out of her face. “Liz and I appreciate your open-mindedness,” he said. “But it’s important to her that you see us as people first. As a couple who has a right to be together, to share the love that we do.”\n“You want me to think that you’re normal,” I said. I tried to keep the edge of sarcasm out of my voice, but I probably didn’t entirely succeed. “Just another Minneapolis family.”\n“I know we’re not like everyone else,” Liz said. “But we love each other and take care of each other. And that’s what’s important.”\n“Right,” I said. “But you didn’t call me to affirm your relationship. You called me to help you with your sex life. So let’s talk about that.”\nSo, among actual K’srillans, the female folds herself around the male; she does have a short channel that’s there all the time but a decent amount of her sexual passageway is constructed on-the-fly. I took notes. The actual sex involved friction, but some of it was accomplished by the same muscles that were used to fold the extended vagina into place; I wasn’t entirely sure whether the male K’srillan thrusted, or not.\n“You realize,” I said, “there is no way we can build an IntelliFlesh vagina that will do the folding thing. Or the rippling, or whatever. Maybe we could add a vibrator . . . ”\n“Older K’srillan females sometimes lose a certain amount of strength,” Zmivla offered. “There is a procedure that allows the female to fasten her channel into place, and when having sex with a female who has had this procedure, the male thrusts. It should work.” The tips of his tentacles turned pink and I wasn’t sure whether he was embarrassed, sexually aroused, or something else entirely. “Though this vibration option you mention . . . ”\nI had brought the tape measure but I wound up having Liz do the measurements. I made a sketch and had her call out the measurements as I noted them down. Eighteen inches was a rough estimate, it turned out: one branch ran 18.25 inches stem to stern and the other branch was 17.8 inches. Girth of the trunk portion was comparable to a soda can; the branches were a lot more slender and tapered toward the tip, like extremely long carrots. The K’srillan penis is blue, I noticed, or at least it’s blue when he’s sexually aroused, sort of a dusky violet-blue that would indicate in a human that he’s oxygen-deprived or possibly freezing to death. There are visible veins in the sides.\n“I don’t suppose you know how typical you are,” I said. “I mean, for a K’srillan male, are you on the large side or the small side, are you more or less asymmetrical than most, how does your girth compare . . . ”\n“I don’t know,” he said. “But I don’t think it would be too hard to find out. There are about a thousand K’srillans living in this apartment complex, after all, and I know two dozen others with human wives.”\nI spent two entire days measuring K’srillan penises.\nThe good news was that K’srillan penises turned out to be reasonably uniform. I mean, they ranged in length from sixteen inches all the way up to twenty, and they ranged in girth from pop can to coffee mug, and there were some penises where one branch was noticeably shorter, even by as much as six inches. But human penises also vary. I mean, the average length for an erect dick is about five inches, but the record holder was 13.5 inches long. (Not to overshare but that just sounds like it would be painful.)\nThe variety of sizing in human dicks has not prevented the successful marketing of any number of artificial vaginas (or “masturbation sleeves,” to use the technical industry term.) I mean, just like with dildos you can provide a set of different sizes but they are not all THAT customized, and given that IntelliFlesh is a lot more adaptable than silicone, I was pretty sure we’d be able to come up with something that would work.\nAnyway, that was the good news. The bad news was that I had to spend two entire days measuring K’srillan penises.\nFortunately, K’srillan men seem to be pretty secure in their masculinity. I mean, imagine the reaction if you came at the average human male with a tape measure. My former brother-in-law actually measured his own dick at some point and it was 4.5 inches long, so a whopping half-inch shorter than the average. My sister told absolutely everyone, after the divorce, but the problem wasn’t really his very-slightly-runty dick, it was the ways in which he compensated and the fact that he was a complete loser in the sack, one of those men who thinks that his penis is magic and if you can’t climax in two minutes just from him sticking it in you, you must be broken. One-half-inch-less than average length: not a problem. Complete boredom in the sack: definite problem.\n(Sorry. Very few people in my life seem to embrace my no-overshares policy.)\nAnyway. There was one K’srillan who shrank at the sight of the tape measure, but then he laughed (K’srillans actually have a physical response to humor, I found out, but the voice synthesizers are programmed to pick up on it and translate it into a ha-ha-ha sound) and said, “Give me just one moment” and swelled back up to full size within a few seconds. K’srillans all grew up in K’srillan society, which has its own set of gender roles and expectations that are absolutely nothing whatsoever like human gender stereotypes, and then they were plunged into human society and forced to adapt. One of the men noted, as I wrapped the tape measure around the trunk portion at the bottom, that in K’srillan society it is the woman who is expected to make the first move; a man who propositions a woman is shameless and forward, and he thinks human women like that, once we get used to the idea.\n“Maybe,” I said, and measured his length on the left-hand side: 17.85. “How’d you meet your wife, anyway?”\n“I thought they told you?” he said, a little mournfully. “I have not been so fortunate yet, but I volunteered for this exciting project because it will perhaps raise interest in our kind.”\n“Wouldn’t you honestly prefer to marry someone of your own species?” I said.\n“Among my own kind I am considered unattractive,” he said.\nI stepped back and took a look at him. Over the two days, K’srillans had stopped looking like roadkilled squid to me, but I still wouldn’t call any individual attractive as such. I finished the last measurement, wrote it down, and tossed my gloves into his kitchen trash can. “Thanks for your help,” I said.\nI was back in the office, finishing up my prototype design, when my phone rang.\n“You do us an injustice,” said a synthesized voice on the other end of the line.\n“I’m sorry,” I said. “Who’s calling, please?”\n“For days you come to our settlement and measure the male organs,” the voice said, distressed. “And now I find out it is so that you can make false female organs for human women.”\nI scratched my head, wondering how I’d gotten myself into this. “Look. You do realize that we specialize in false organs of all varieties for humans—both women and men.”\n“Yes!” the voice said, furious. “And I am a K’srillan female married to a human male. Why are you not going to make false K’srillan male organs? What is my husband supposed to do to please me?”\nSo in the end, I’m sure you’ll be shocked to hear, we made both. We made K’srillan vaginas: as I warned Liz, they’re not capable of the K’srillan pre-sex vaginal origami action, but they do simulate the muscle movements with the addition of an adjustable vibrator. We also made K’srillan penises, though due to limited market penetration at this point we have only one size and shape (pop-bottle girth at the bottom, 17.85 on the left-hand size, 18.1 on the right-hand side).\nWhat I find the weirdest these days are not the human/K’srillan couples. It’s the human/human couples that buy one from each set and have sex with the detachable genitals instead of the compatible set they already had. Or maybe it’s the porn of humans having sex with the K’srillan artificial genitalia. Or possibly the gay porn of humans having sex with K’srillan artificial genitalia. Or possibly the absolute weirdest is the porn of K’srillans having sex with artificial human genitalia—they can’t do that with IntelliFlesh (years of research into their neurology remain to be done) but there’s always the good old-fashioned strap-on option on one side, and an artificial vagina on the other.\nBecause really, there are two immutable laws of nature at work here: number one, love will find a way; and number two, if a sexual act can be conceived of, someone will pay money to watch it.\nI’ve been thinking a lot about that first rule, lately. Because I told my sister about the “unattractive” K’srillan and jokingly—I swear I was joking!—pointed out that at least she’d never be bored in bed. She jokingly—she claims she was joking—asked me for his number. I told her she could have it if she promised to never tell me the details of their sex life, and she pointed out that I already knew this guy’s penis size down to the quarter-inch . . .\nYeah, they’re dating. They’re not rushing into anything, so this story doesn’t end with, “And the wedding’s next week!” But I have to say—you do get used to the seven eyes looking at you over the after-dinner drinks and I’ve learned to spot the physical cues of the laugh even before the synthesizer goes “ha ha ha.” And Gintika (that’s his name) definitely doesn’t make me think of roadkilled squid anymore. He makes me think about how sometimes we have more in common with people than we realize; he makes me think about all the ways to form a connection. He makes me think about the look on my sister’s face when she talks about him. He makes me think, love finds a way, and hey, sometimes finding a way, finds you love.\nNaomi Kritzer has been writing science fiction and fantasy for over twenty years. Her YA novel Catfishing on CatNet (based on her short story “Cat Pictures Please”) won the 2020 Lodestar Award, Edgar Award, and Minnesota Book Award. Her latest book, Chaos on CatNet, came out from Tor Teen in April 2021. Naomi lives in St. Paul, Minnesota with her spouse, two kids, and three cats. The number of cats is subject to change without notice."}