{"fingerprint": "PezLsck023fLKCf08Ivtuzf2D/8=", "sitename": "Clarkesworld Magazine", "title": "Waiting Out the End of the World in Patty's Place Cafe by Naomi Kritzer", "author": "Naomi Kritzer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kritzer_03_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Waiting Out the End of the World in Patty's Place Cafe by Naomi Kritzer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4740 words, short story\n Waiting Out the End of the World in Patty's Place Cafe\n I ran out of gas in Belle Fourche, South Dakota, just two hundred miles short of Pierre, my goal. Pierre, South Dakota, I mean, I wasn’t trying to get to someone named Pierre. I was trying to get to my parents, and Pierre was where they lived. I thought maybe, given that the world was probably ending in the next twenty-four hours, they’d want to talk to me.\n I’d taken back roads almost the whole way from Spokane, hoping to avoid the traffic jams. I also figured that out-of-the-way gas stations would run out of gas less quickly. That turned out to be true for a while. The problem was that the back-roads gas stations weren’t getting deliveries, either. The last gas I’d found was in Billings. If they’d let me fill up, I might have been able to make it all the way to Pierre on that tank, but the owner, who was overseeing the line with a large gun hanging over his shoulder, was only letting people buy eight gallons per car. Admittedly, that was probably the only reason they weren’t completely out.\n I turned my car off and checked my map. Belle Fourche was just twelve miles from I-90. I didn’t know exactly how much gas I still had, but the low fuel light had been on for a while and I wasn’t sure I could make it that far. I tried calling the gas stations along the interstate, but of course no one was picking up. If you had sixteen hours left to live, would you spend that time working at a gas station?\n I rubbed my eyes, numb with fatigue and fear. If nothing else, maybe I could find somewhere in Belle Fourche to get coffee.\n Subway and Taco John’s had fallen victim to the “would you go to your job if you maybe had 16 hours left to live” problem, but I saw the lights on in Patty’s Place, a wood-framed building with a sign out front advertising REAL BBQ EVERYDAY, RIBS THURS NITE. The sign said to seat yourself. I looked around and finally spotted an empty spot in a corner by the window. Even just sitting down in a seat that didn’t have a steering wheel in front of it made me realize how exhausted I was. Possibly I should have taken a few more naps. Or a longer nap at some point.\n There was a TV in the corner with CNN on. The talking heads were arguing the asteroid’s projected trajectory, and whether the worst-case scenarios were actually too grim. The asteroid that killed the dinosaurs was probably 10 km across. This one was 4.36 km. Big enough to cause devastating damage, but the scientist on the left thought it might just wipe out coastal cities but allow the inland areas to rebuild. The other scientist thought that encouraging people to migrate inland before the strike was a terrible idea because people were dying in their desperate attempts to escape the coasts, and this was completely unnecessary if the asteroid missed us. And if it didn’t, anyone who survived the strike would die in the fifty-year famine caused by the dust cloud blocking out all sunlight. “Seriously, folks, just hunker down wherever and wait to see what happens,” he said. “And hey, if we survive this, maybe consider re-opening the Arecibo Observatory, if it hadn’t lost funding we’d be able to map the trajectory—” His voice was rising, furious.\n “Coffee, hon?”\n I looked up at the waitress. “Yeah, thanks. And thanks for coming to work.”\n She poured me a mug of coffee. “I’m actually Patty, the owner. I figured I might as well come in and feed people as stay home feeling sorry for myself. Do you know what you want? I should warn you we’re out of a few things.”\n “I think I feel like breakfast,” I said.\n “I can bring you a big plate of pancakes and syrup. We’re out of bacon and sausage. If you want eggs, we’re down to those cartons of just egg whites but we could make those into an omelet for you.”\n “Pancakes and syrup sounds good,” I said.\n “You come far?”\n “From Spokane. I’m trying to get to Pierre but I ran out of gas.”\n I leaned my head against the window and closed my eyes. Maybe someone else was heading east, and I could beg a ride from them. Maybe someone in town would sell me the gas out of the car in their garage. Maybe maybe maybe. I wasn’t really in any shape to drive any further. Pierre was just a couple hours away, and there was a Super 8 across the street; maybe I could get a room and nap for a few hours before I tried driving any further. It was probably just as well if I got home right before the impact, if I wanted Mom to talk to me.\n The coffee was exactly like I remembered South Dakota coffee. Dip a bean three times in the hot water and call it good.\n “Hon, can I put two more people at your table? Your food’s going to be a while but I’ll keep the coffee coming.”\n I opened my eyes and looked up at Patty, and the two people standing behind her. “Sure.” They slid into the booth across from me.\n They were an older couple. Well, middle-aged, I guess. The man had white hair; the woman had reddish hair.\n “You look like you’ve been driving for a while,” the woman said, sympathetically. “You can go back to your nap, if you want.”\n It felt a little too uncivilized to ignore people sitting across from me, and besides, Patty had refilled my coffee. “My name’s Lorien,” I said. “Or Kathleen. I mean, Kathleen’s the name my parents gave me.”\n The couple exchanged a look I couldn’t quite untangle, and I tried to sit up a little straighter. “I’m Robin,” the woman said, “And this is Michael. And if Lorien’s your name, it doesn’t really matter to me what your parents called you.”\n “It’s kind of out of Lord of the—”\n “You’re among nerds,” Robin said, “We got it.”\n Michael was looking at the menu. “I wonder if they’ll have the caramel rolls,” he said. “There was a picture of the caramel roll in one of the reviews, but I bet everyone’s wanted caramel rolls . . . ”\n “That seems likely,” Robin said. “Have you eaten anything here, Lorien?”\n I shook my head. “I ordered pancakes but they haven’t come yet.”\n Patty came by. They were indeed out of caramel rolls but they had a caramel bread pudding. They were also out of hamburger buns, although they could offer you a hamburger on sliced bread. Michael ordered a hot turkey sandwich, Robin ordered meatloaf.\n “I bet they made the bread pudding out of those hamburger buns,” Robin said when Patty had left.\n “That seems like a questionable business decision,” Michael said.\n “I bet they made the bread pudding out of those hamburger buns because someone in the kitchen thought, ‘screw good business decisions, I want to eat something sweet and comforting and we’re out of caramel rolls.’”\n “Are you heading east?” I blurted out. They seemed like really nice people. Like people who might give me a ride.\n “Oh, honey, I’m sorry,” Robin said. “We’re coming from Minnesota and heading to Yellowstone, actually.”\n “If you’re coming from the west, maybe you know where we could find gas?” Michael asked me.\n “I haven’t found gas since Billings, that was five hours ago, and they’re rationing,” I said.\n “Well, that’s promising,” Robin said, and pulled out her phone to look up the map. “ . . . Totally not on our way, though. Hmm.”\n “I was really hoping we’d find some here,” Michael said.\n “Why are you going to Yellowstone?” I asked.\n “We’ve never been there,” Michael said. “Figured we might as well go check it out.”\n “You didn’t want to be with family?”\n “We said goodbye to my family before we left,” Michael said.\n “And Michael’s family is my family,” Robin said. “Family 2.0.”\n I must have looked a bit shocked, because Robin glanced at Michael and shrugged a little. “This isn’t my first Armageddon,” she said. “You could say it’s my third.”\n Patty arrived with my pancakes, plus sodas for Robin and Michael. Once the pancakes were in front of me, I realized that I was ravenous. Someone had turned up the TV in the corner: a new scientist was on, a guy named Scott Edward Shjefte, who was reminding everyone that in cosmological terms, an asteroid passing between the earth and the moon was a “direct hit” and yet there were 363,104 kilometers for a 4.36 kilometer object to pass through. “Imagine throwing a penny at a football field and trying to miss the 30-yard line. You’d feel pretty good about those odds.”\n “Not so much if the world was going to end if the penny hit the 30-yard line,” the host said. “Besides, this asteroid’s already beaten the odds, being spotted so late.”\n “So it would have to beat the odds twice!” Shjefte said. He sounded committed to this idea, not like he was grasping at straws, but the host didn’t look at all convinced.\n They agreed again that everything would be better if the Arecibo Observatory was still running, since the radio telescope there could have determined the asteroid’s trajectory with actual precision, and also, that the President’s order to launch nukes at the asteroid wouldn’t have done anything even if they hadn’t missed.\n “Do you think I’m panicking over nothing?” I said.\n Robin looked me over. “How old are you? You look about twenty five.”\n “I’m twenty-three.”\n “My first Armageddon was when I was a little kid, back in the 1970s. Have you ever heard of the Jehovah’s Witnesses?”\n “Yeah,” I said. “They’re the people who knock on your door.”\n “I was raised in the Jehovah’s Witnesses, and when I was little, everyone at my church believed that the world was going to end in October of 1977. A lot of the adults sold their houses. My parents didn’t, but my father used up all his vacation time to take days off and knock on people’s doors.” She took a sip of soda and leaned back against her seat. “He used to take me around with him, because people are a little less likely to slam the door on a cute little kid. Only a little, though. It was hard. My Dad used to tell me ‘just keep walking, just keep knocking,’ that eventually people would listen. That actually stood me in good stead years later when I was trying to get jobs in theater.” She looked at me. “Did you grow up in a church?”\n “Yeah,” I said.\n “The kind that believed in the Rapture and stuff?”\n “Yeah, but we didn’t have a—a date, you know, when everyone thought it would happen. Just, like, soon.”\n “Are you still a member?”\n “No,” I said, and ducked my head over my pancakes. After a minute, Robin went on.\n “I am a male-to-female transsexual. When I was little, and people would talk about the earthly paradise, I knew I’d receive a resurrected body and anything wrong with it would be miraculously fixed, but I couldn’t ask, did that mean I’d get a girl’s body? Or that I’d stop wanting a girl’s body? Because both options were actually terrifying to me at that point. One meant that my parents would find out, since of course they’d be in paradise with me, and the other meant I’d somehow be someone else.”\n I had looked up when she said “transsexual,” looking her over without really meaning to. I’d met trans women before, back home in Spokane, and I was looking at her because I was wondering if this should have been obvious to me and I was just that tired. There are places where if you meet someone you know they’re queer, but a diner in South Dakota isn’t really one of them.\n “Anyway. The sun rose on November 1st, and all the adults pretended that no one had ever said the world was going to end the previous month. And that was my first Armageddon.”\n Robin’s and Michael’s food arrived. “I’m definitely going to want some of the bread pudding,” Robin told Patty, “when I’m done with this.”\n “We’ve also got a big pineapple upside-down cake that’s coming out of the oven right now,” Patty said.\n “Oh, excellent, I’ll have that!” Michael said.\n “Anyway, you can probably guess why Michael’s family is my family,” Robin said.\n “Did they disown you for being trans?” I asked.\n “No, they disowned me for leaving the Jehovah’s Witnesses and majoring in Theater and then when I came out as gay that would definitely have been the last straw, only they hadn’t spoken to me in years already at that point. Robin is actually my birth name, but I changed my last name after that. My last name is Raianiemi. It was the last name of one of my neighbors. The only lesbian in the town where I grew up.”\n I couldn’t really answer that at all. Patty had refilled my coffee again so I put the mug up where it sort of hid my face and drank coffee.\n “My second Armageddon was when I almost died from a mysterious infection about a decade ago,” Robin said. “I was in the hospital and they were giving me IV antibiotics but I wasn’t responding and they thought I was going to die. I thought I was going to die.”\n “I feel like calling that an Armageddon is kind of cheating,” Michael said. “You thought you were going to die. But in an Armageddon, everyone dies.”\n “I really think the biggest difference is the level of hassle,” Robin said. “Each individual thinks they’re going to die. The problem is that when it’s everybody, this means huge numbers of people don’t show up for work, so everyone runs out of gas just as they’re trying to make road trips to see loved ones or visit Yellowstone or whatever.”\n “Did they ever figure out what you had?” I asked.\n “Enough that they were able to treat me. But I spent a few days thinking about what I’d most regret, if I died that week, and I knew the thing I’d really regret was never living as my real self. Never living as a woman. The thing was, I had a partner—that’s what we called our spouses before we could get legally married, I don’t know if kids these days remember that—and I had no idea how he would react and he was the love of my life. Coming out the first time, as gay, that was scary. Coming out the second time, as trans? Made me realize just how much scarier it could be.”\n “But it was okay. Don’t forget to tell her that part,” Michael said, and squeezed Robin’s hand.\n “Yeah, it was all okay. Anyway, once you’ve survived Armageddon twice, a third one rolls around and you say to yourself, ‘What would I like to see in case this is it?’ and we knew we could get to Yellowstone so we gave all our nieces and nephews a big hug and hit the road.”\n I’d eaten the last of my pancakes and my coffee cup was empty. Patty hadn’t been by in a while.\n “We really thought we’d be able to find gas, though,” Michael said. “If we stuck to the back roads . . . ”\n “That was my theory, too,” I said. “It worked at first.”\n “So where are you headed?” Robin asked.\n “Pierre,” I said. “It’s where my parents live.”\n “Do they know you’re coming?”\n It was an odd question, and I knew I’d betrayed myself, listening to her story. “No,” I said. It came out in a whisper.\n “When was the last time you and them talked at all?”\n “After I graduated college, they were really mad that I wasn’t going to move back home.”\n “That was all it took, huh?” Robin asked.\n “Yeah. There’s a lot of other stuff they’d be mad about, but they just don’t even know about it, unless someone’s told them. Which maybe someone has.”\n “Listen,” Robin said. “There are a lot of people who will tell you that you have to reconcile with your family, that you only get one, that if you never speak to your parents again this is somehow on you, and I am here to tell you that this is crap. You don’t have to reconcile with your family. You can find a family that accepts you for who you are instead of trying to cram you into the box they think you’re supposed to live in. And if they choose to reject you, that’s on them.”\n “Yeah,” I whispered.\n Robin pulled some Kleenex out of her purse and handed it to me. I wiped my eyes and looked out the window at the sunny afternoon.\n “Just ‘cause they raised you, that doesn’t mean you have to give them the opportunity to slam another door in your face,” she said.\n “I didn’t have anyone else to go see,” I said. “My girlf—” I choked off the word, then checked myself. “My girlfriend and I broke up a few weeks ago and none of my friends out there are super close. I moved to Spokane for a job and I kind of hate it and I thought, ‘I should go see my family’ and so I went.”\n I had felt so alone, listening to the news in my little apartment. And I’d tried calling home, and they hadn’t picked up. So like everyone else, I’d blown off work and hit the road.\n What would I regret? “I would regret not reconciling with my family” seemed like an obvious answer, so I’d decided to try.\n “Did you pass through Yellowstone on your way east?” Michael asked.\n “No,” I said. “Even if I’d taken I-90 I’d have passed north of it.”\n “Want to come see Yellowstone with us?” Robin asked. “It has Old Faithful.”\n “And a supervolcano that could blow up at any time,” Michael said. “So even if the asteroid misses us completely we could still potentially die in a cataclysmic disaster today!”\n “You can still say no,” Robin said, “because we’re going to have to go door-knocking to try to find gas. You be the cute kid and we’ll split whatever we can find.”\n Robin was being generous, because Michael’s plan was to offer cash—$10/gallon for whatever they’d let him siphon out, and if they balked at that, he’d try upping it to $20. We walked around Belle Fourche, knocking on doors. Mostly no one answered. We did find one person who was also out of gas, which was the only reason she was still in Belle Fourche and not on her way to Cheyenne, Wyoming to see her granddaughter, and someone who had a full tank but flat-out refused to sell us any. (“Bank notes won’t be worth a damn thing if that asteroid hits. I need a full tank to get out of here, if I have to.”)\n “I think we’re stuck here,” Robin said, after we’d been knocking on doors for ninety minutes with no luck.\n “That’s not the attitude that got you theater jobs,” Michael said.\n “I’ll be honest. At this point, I’m thinking that what I’d like to do with my maybe-last-day-on-earth is not knock on doors all afternoon. Let’s see the local sights, if there are any.”\n Belle Fourche’s big thing, if you can call it that, is the Geographic Center of the United States, which was recalculated by the National Geodetic Survey after the addition of Alaska and Hawaii. (The center of the lower 48 is in Kansas, which is probably about where you’d expect it.) The actual technical true Geographic Center is about twenty miles out of town, but there was a Monument with a nice sculpture a mile walk from Patty’s Place, so we walked over to the Center of the Nation Monument and I took a picture of Robin and Michael together, and then they took a picture of me.\n One of the parks had a playground and there were some families there with kids and dogs. I wondered if the kids knew anything about what was going on. Even if their parents didn’t tell them about it, they were probably overhearing stuff from the TV and the radio. Still, they were running around and looking like they weren’t worrying about it.\n Robin and Michael decided to book a room at the Super 8 and encouraged me to book one, too. “When we don’t all die, everyone’s going to think, ‘oops, didn’t die, better find a room,’ and you’ll be glad you have one. And if we do all die, you won’t have to pay your Visa bill.” There was an older man working the front desk; I wondered if he was the owner, like Patty. He gave us our keys. I tucked mine in my pocket and then, for lack of anywhere else to go, we walked back across the street to Patty’s.\n Patty’s had gotten more crowded; people were getting tables and just camping out there. But there was an awkward little table for three in a corner she squeezed us into and we ordered more drinks and more food and settled in. “Probably for the duration,” Robin admitted.\n “A lot of people are doing that,” Patty said, looking around. “I’d say it’s about half people like you who got stranded here today when they ran out of gas, and half locals who don’t want to sit at home. People were coming and going for a while but now they’re just coming. No one wants to be alone tonight, I guess.”\n The asteroid was going to hit, or miss, at 9:34 p.m. Belle Fourche time. It took a little over 3 hours to drive from Belle Fourche to Pierre, so as the clock ticked toward 6 p.m., I knew my decision had more or less been made for me.\n But then Patty came bustling over, an older couple in tow. “Are you the girl who was trying to get to Pierre? Because these folks are going to Pierre to see their daughter and they have enough gas they’ll probably make it, they think.”\n “As long as you don’t mind dogs,” the woman said, “Because you’ll have to share the back seat with our two beagles.”\n “What’s the address in Pierre?” the man asked, and punched my parents’ address into his phone. “Yeah, that’s almost right on our way.”\n I imagined knocking on my parents’ door. Waiting for the answer, like we’d done with all the people we’d tried to buy gas from. My parents’ house had a peephole, and you could hear their footsteps inside so you knew they’d come to the door and were peering out at you, deciding whether to open up. I’d know Mom was looking at me, measuring me with her eyes, looking at my short-cropped hair, the frayed collar of my shirt, assessing whether I was penitent. Penitent enough.\n I could see myself standing on that front step, in the dark, these nice people waiting to see me safe inside, until I had to turn around and admit it wasn’t going to open.\n Or if it did . . .\n What I wanted was to see my parents smile. What I wanted was for them to welcome me.\n Did I really think that news of an impending asteroid would have changed who my parents were? Who they needed me to be?\n I turned and looked at Robin and Michael. They gave me hesitant smiles, like they didn’t want to discourage me from leaving, but like they were biting their tongues. I could see Robin furrow her brow, like she was imagining the same things I was and they worried her.\n I turned back to the people with the beagles. “No, thank you,” I said. “That’s a very kind offer, but I thought about it and I’ve decided to stay here for the night. Thanks, though.”\n They headed out. I settled back into my seat. Robin said, “I’m glad you’re staying.”\n “I’m glad I have someone to stay with,” I said.\n At 9 p.m. everyone went outside to the parking lot.\n It was dark out. Someone from the town had dragged out a box of fireworks left over from last year’s 4th of July and everyone took turns lighting them off, including me. (Mom had never let us have fireworks when I was a kid, because we might blow ourselves up, but if there was ever a time for YOLO, it’s when there’s a 4.3 kilometer asteroid on a collision course for earth.) Some of the stale fireworks fizzled and went out. Others shot up into the sky and gave us a shower of sparkles. Despite how nervous everyone was, things took on a weird, almost festive air. Maybe we were all going to die in a few minutes: might as well enjoy the show until then.\n “Do you think we’ll be able to see anything before it hits us?” I asked. “What’s it going to look like?”\n “One of the scientists on the TV said it would look like a tiny star and get bigger, if it was coming towards us. We’ll definitely see it coming. But it could hit the other side of the planet, and we’ll have no clue.”\n At 9:34, someone shouted, “There it is.”\n We could see something moving in the sky. It wasn’t very big, but it was definitely moving. Was it getting bigger? I realized I was holding my breath. For a second I thought it was getting bigger; a moment later I was sure it wasn’t. The slightly-bigger-than-average, slightly-blurry star moved across the sky and disappeared.\n There was a long pause, and then we ran back inside the restaurant to see what they were saying on CNN.\n The optimistic scientist Shjefte was either back on, or still on. He was jumping up and down—literally jumping up and down, clapping his hands—screaming “it missed, it missed, it missed, it missed, it missed!” So apparently all his optimistic talk about throwing pennies onto a football field was bravado. “I’m going to call all my friends, I’m going to write a book, I’m going to go see Petra,” he shouted, just before the TV got turned off.\n We could hear cheering from the town beyond the restaurant, and more people were setting off fireworks. Robin and Michael kissed like it was New Year’s Eve. Someone at the diner had chilled a bunch of bottles of champagne and Patty popped one open, and everyone drank it out of coffee mugs, and we were all a weepy mess for a while.\n And then there was a run on hotel rooms, and I was awfully glad that Robin and Michael had suggested I get one early.\n “Are you going back to Spokane?”\n The gas truck had come and gone: we’d waited until the line had dissipated, then filled up both our gas tanks. I must have been down to about the last quarter-cup, given how much gas I put in.\n I looked at Robin. “You know, I thought about how one of the things I’d really regret, if I died, was never seeing New York. My parents acted like it was some sort of den of sin and iniquity when I was growing up, but they were wrong about a lot.”\n “So wait, are you going to hit the road and drive the rest of the way east?”\n I laughed. “I kind of think I should go home and pack up my stuff, give notice on my lease, stuff like that. But I expect I’ll be coming back this way in a few months.”\n “Well, let me give you our address,” Robin said. “You can stay with us when you get to Minneapolis.”\n “This is kind of silly,” I said, “but do you mind going back to the Center of the Nation Monument for a minute?”\n Someone else was there, so I didn’t have to snap a selfie to get a picture of myself with Robin and Michael; they took it for me.\n The road west was wide open, and I listened to music my parents would have hated the whole way back to Spokane.\n Naomi Kritzer has been writing science fiction and fantasy for over twenty years. Her YA novel Catfishing on CatNet (based on her short story “Cat Pictures Please”) won the 2020 Lodestar Award, Edgar Award, and Minnesota Book Award. Her latest book, Chaos on CatNet, came out from Tor Teen in April 2021. Naomi lives in St. Paul, Minnesota with her spouse, two kids, and three cats. The number of cats is subject to change without notice."}