{"fingerprint": "wyJpvwZKVoZuKYAqAy9pV/g20ME=", "sitename": "Clarkesworld Magazine", "title": "Cat Pictures and Food Blogs: A Conversation with Naomi Kritzer by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kritzer_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cat Pictures and Food Blogs: A Conversation with Naomi Kritzer by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nCat Pictures and Food Blogs: A Conversation with Naomi Kritzer\nThe Internet seems to be fueled by feline antics. Everywhere you look, there’s a kitten stuck in a piece of toast, a tabby karate kicking a dog, or a Siamese cat rocking out to dubstep. If you peel back the layers of the Internet, you’re sure to find a cat tangled up in Ethernet wires right at the core.\n“Cat Pictures Please” by Naomi Kritzer first appeared right here in Clarkesworld Magazine and recently won the Hugo Award for Best Short Story. It revolves around a benevolent AI inserting itself into the lives of unsuspecting humans as long as they provide it with cat pictures. Not only does the story tap into the kitty core of the Internet, but also dives much deeper into the interesting and flawed humans that post those cat pictures. It’s a deceptive story full of humor and heart that rewards multiple readings.\nNaomi Kritzer’s short stories have been published in Asimov’s, Analog, The Magazine of Fantasy and Science Fiction, Realms of Fantasy, Strange Horizons, and Clarkesworld Magazine. She has numerous novels available from Bantam and two e-book short story collections out: Gift of the Winter King and Other Stories, and Comrade Grandmother and Other Stories. She has been nominated for the Nebula Award and won the 2016 Hugo and Locus Awards for “Cat Pictures Please.”\nCongratulations on winning a Hugo Award for “Cat Pictures Please!” How does it feel?\nAwesome! I’m still smiling.\nWhy do you think the Internet is obsessed with cats?\nProbably because people are obsessed with cats.\nI currently have three cats, by the way: Emilycat, a well-behaved tabby who’s the current senior feline in residence; Balto, a very large black cat who never got the “obligate carnivore” memo and has been known to rip open bags of sugar to snack on it; and Cassie Fluffypants, an extremely pretty longhaired cat who likes to sit behind my head and try to groom me like an errant kitten. I would post more pictures of them, but I have a cheap phone with a mediocre camera.\nWhat inspired you to write “Cat Pictures Please?”\nI carry an Android phone, and at some point Google started helpfully suggesting that this building I drove past daily was my workplace. (When I’d open the Google Now app they’d show me a little map of the building and ask, “Is this your workplace?” with a button I could click to say “oh yes, Google, you’ve found it!”) I did not work in this building, but after Google repeatedly asked me about it I went and looked up their job listings because I thought, huh, maybe Google knows something I don’t; maybe it should be my workplace. (I found no jobs I was qualified for.) Pretending that my phone’s random quirks were an attempt by an intelligence to manipulate me was really amusing. This combined with the observation that the Internet loves cat pictures, and I was basically off and running.\nWhen you’re trying to figure out what to write next, what is it that usually captures your attention about an idea and makes you want to expand it into a story? Is it an image or a character or a setting?\nI usually start with a scenario; the characters come next. The sense of having a full story is usually what propels me into writing. When I jump in without knowing where I’m going, usually I don’t end up going much of anywhere.\nHow many autographed cat pictures did you give away at Worldcon?\nTwo, I think. And in both cases I offered them to people who’d asked me to autograph books. People clearly liked the idea of signed cat pictures but didn’t ask for them.\nWhere do you keep your Hugo Award?\nIt is currently on the buffet in the dining room. The problem is, one of the cats (Balto) managed to knock a heavy stone sculpture off the mantelpiece yesterday. (Amazingly, the sculpture did not break, nor did it land on the cat. This is truly a heavy, stable, hard-to-knock-over sort of sculpture, but the cat managed it.) I really don’t want my Hugo to get broken, so I need to figure out a reasonably cat-proof location.\nI’ve noticed that you occasionally like to play with the format of short stories. “So Much Cooking” is a perfect example of this. What inspired you to write a story masquerading as a food blog?\nI get a lot of my recipes these days from food blogs. Food blogs tend to speak in a very characteristic voice: always enthusiastic, sometimes a little breathless, often reassuring (you can totally debone this chicken, followers! Sharpen your knives and I’ll talk you through it!). So I had that voice in my head just from scrolling through some of my favorite recipes. (Here’s an example: http://bevcooks.com/2014/01/crock-pot-chicken-tacos/—this recipe is basically “throw raw chicken into a crock pot with salsa and turn on the crock pot,” by the way, so you can see why I like it so much.)\nThe second piece of the idea came from the winter of 2014–2015, when Boston got about twenty feet of snow. My friends and relatives there kept digging out, barely, only to get snowed in again the next day. One of my friends posted to her blog about being out of almost everything but wine. This got me thinking about the sort of weird things my family might end up eating if we were being endlessly snowed in, and how a food blogger would talk about them (“I knew that sliced beef heart would come in handy eventually!”). Of course, “snowed in” is a fairly mundane emergency; a pandemic was a lot more compelling.\nWhat does your writing process look like? Do you spend a lot of time planning and mulling over a project before you start writing or do you dive right into the first draft?\nI often brainstorm and outline by hand in a notebook. I like unlined paper for this, so I buy myself small (5.5”x8.5”) sketchbooks. Drawing paper is also nice and thick so I can write on both sides without bleed-through. I couldn’t find my notes on “Cat Pictures Please” but I found some for the first draft of “So Much Cooking.” I outlined the blog posts like this:\n- roast chicken over potatoes w/lemon + garlic | defy the birds! eat them!\n- chocolate pecan pie with bourbon whipped cream | anxiety! live for today!\n- substitute cookies—mayo for eggs, leftover mix of chips | terror, holy shit, all going to die\nI was thinking in terms of both of the recipes and the emotional flow of the story. Interestingly, when I made this outline, I was thinking that the blogger and her husband were just alone for most of the epidemic; it’s not until the next page I wrote “has teen + pre-teen come stay with her,” and then I realized that bringing in two kids could rapidly lead to more. I actually stuck fairly close to the recipe outline I came up with, and the line from the outline, “this is no longer a food blog; it is a boredom and isolation blog” made it in. (Also “this is a food blog, not a disease blog . . . ”)\nOnce I have a complete first draft of a short story, I hand it out to my writers’ group. I revise based on feedback, let it sit for a week, re-read, revise again, and submit.\nWhen I’m writing a novel, I don’t draft the whole thing before handing it out for critique—I hand out a chapter or two at a time.\nWhat other projects are you working on?\nIn process and not yet done:\n- A short story that sprang from a note I made to myself when someone on a con panel groused about stories about little girls and wee little fairies. I wrote “little girls & wee little fairies” because I was convinced I could do something interesting and unconventional with it. Years ago I ran across a term coined by Children’s Literature scholar Anne Scott McLeod, “Caddie Woodlawn Syndrome,” for a pattern you see a lot in children’s lit for girls where the girl protagonist is allowed a wild, ungendered, tomboyish childhood but must give up her freedom and “become a lady” when she reaches a certain age. Frequently “becoming a lady” is framed as acceptance of maturity and responsibility—it’s her coming of age, essentially. In my Wee Little Fairies story, the fairies are both literally real, and a metaphor for this set of expectations. We’ll see if it works when I’m done with it.\n- I’ve had a series of near-future SF short stories published in F&SF about a character named Beck Garrison who has grown up on a sea-stead. (An artificial island built in the Pacific Ocean.) In the last published story, Beck was brought back to California by her mother, and the story I’m working on, “California Dreaming,” is about her experiences trying to attend high school in Pasadena. (Her problem-solving skills are not really appreciated by her high school vice principal.)\n- I started work on a short story that was an attempt at being a meta-ghost-story. I didn’t know where I was going and this story has refused to go anywhere but I’m not ready to just give up on it.\nWhat was the best piece of writing advice you were ever given?\nJoin a writers’ group.\nDid Neil Clarke pay you in cat pictures for your Hugo Award winning story?\nI am delighted to say that Neil pays in actual money! An AI can afford to take payment in cat pictures because it has no expenses. (If the programming team started charging it rent for its servers, it might change its tune very quickly.)\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}