{"fingerprint": "zvVFAo3CVSo/SQSBqEKAmGHFf6M=", "sitename": "Clarkesworld Magazine", "title": "Learning to Hate Yourself as a Self-Defense Mechanism by Andrea Kriz", "author": "Andrea Kriz", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kriz_01_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Learning to Hate Yourself as a Self-Defense Mechanism by Andrea Kriz", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2390 words, short story\nLearning to Hate Yourself as a Self-Defense Mechanism\nYour friend releases a virtugame. “You shouldn’t play it,” she says dismissively when you ask. “It’s not really your thing.” You listen, but it becomes impossible to ignore when, despite being ironically titled Best Game, it appears in glowing review after review from your favorite virtuTubers, which you avoid watching, in highly upvoted posts on the virtuforums you frequent, which you avoid reading, then on the list of Top Ten Indie VirtuGames of 2045. Finally, it’s about to win the inaugural Greatest Virtual Game Of All Time (GV-GOAT) Award. If it gets first, it’ll be streamed for free to every gamer with a set of VR goggles, billions worldwide. So even if it’s not really your thing, you’ve got to know what all the Best Game hype’s about—especially since your friend made it.\nIt’s a slice-of-life with light fantasy elements. Okay, popular genre, a bit overdone, you think as you spawn into the tutorial level. Not many mechanics either. It’s what critics usually call a “walking simulator,” so right off the bat you’re confused. You recognize the inspo immediately, of course. You play an aspiring virtugame developer. You don’t hold that against your friend at all. Even the most famous virtudevs make games that are veiled self-inserts. To learn the controls, you wander through a deconstructed version of the virtugame dev studio you and your friend spent so many happy afternoons coding in. The unicorn beanbag couches floating in one cube, the ivy overflowing the rusted windowsills splintered in another. You smile, wondering—why it’s been so long since you and your friend had virtual coffee together here?\nThen you step outside the tutorial and meet Best.\nThe virtugame’s levels consist of sequential scenes from your player character’s life. So you go back to grade school. COVID is never explicitly mentioned, but the adults don white opera masks that slowly consume their faces and the “before COVID-times” are metaphorically laced with whimsical fantasy elements (millennial gamers love that shit). Like wispy dragons struggling not to turn into clouds, orchids that grow thorns as your character “forgets” how to speak Mandarin, and dam walls looming over your little town, ready to burst. All your classmates run if you get within six feet of them. Save one. You tell yourself all the coincidences are incidental. A lot of kids are a bit overweight, a bit clingy, like Best, who gets her name one recess in the sandbox, anxiously wiping her nose and asking the player character, “Am I your best friend? Promise me. Really?”\nOf course you know by now, after being friends for twenty-odd years, that you and your friend aren’t best friends. It’s true, at one point you thought you might be—\nYour friend would brush it off if you asked. Don’t take it so personally. Artists can take inspiration from anything. But Best definitely isn’t you or anything! She might even offer to play through a few levels with you to show, how ridiculous you’re being! Even as your player character progresses through virtual high school group projects, virtual field trips, virtual prom at Best’s side. You and your friend went to prom together too, “just as a joke.” What you really did was program bots to control your avatars and, against your parents’ wishes, sneak out to meet each other in person. You went to the local ice-skating rink (pool, it never froze) and, drunkenly, pulled down your masks and kissed. Just as a joke, it was implied. You never talked about it. But it’s all pretty cliché now that you think about it. What pair of friends locked in a tiny social bubble hasn’t done the same thing throughout the pandemics, shutdowns, and reopenings? Then you get to level ten:\n“Welcome to the virtugaming club’s first playtesting group!”\nYour face burns as, within the player character, you look around the virtucollege classroom—exaggeratedly low-poly compared to the “real life” scenes—at Best standing in front of the assembled students. Beaming. You’re an aspiring virtugame dev too. As you say it, you realize you’ll always be aspiring. Unlike your friend, who’s released several virtugames before Best Game, all with rave reviews, who has summited with this one, which will no doubt soon win the GV-GOAT Award and be played by billions worldwide.\n“I’m so excited to have you playtest my game,” Best stammers, as everyone slips on their VR goggles. “I mean, it’s just an alpha, but I think it’s in a pretty good spot and it means so much to me, and I hope you enjoy it too . . . ”\nEveryone self-inserts to some extent but your friend does it skillfully, so everyone including those closest to her will forgive it as “inspiration.” While with Best’s game—your game—it’s clunky. Obvious. Your friend altered your virtugame just enough, of course, to differentiate it from the alpha you actually shared at that playtesting session. Except in the most essential ways. You see it now. All your games are the same, just with different skins. They’re always platformers. They always have that nostalgic Minecrafty voxel art style. Your player character—a sassy pirate, a bounty hunter, a space captain who came from dirt—always rescues a princess, a governor’s daughter, damsel in distress.\nAnd each time the damsel looks a little bit too much like your friend.\nHer thin, dark eyes.\nHer sleek, black hair.\n“Do you like it?”\nThe level fades into Best’s face—your face, changed just enough—a bit too close.\n“You didn’t say much during the playtesting session,” Best snuffles. “You know, it’s pretty hard for me to read expressions in general, especially virtual expressions, so I was just wondering . . . Did you get to the end? Did you like it?”\nThe dialogue options float before you:\nOption A: I did.\nOption B: I have to go. Give you feedback later.\nOption C: The princess.\nOf course, C is the only real one. When you pick the others, it loops back (after A, Best asks, really? What part did you like best?).You see now how uncomfortable this conversation made your friend, but think. Did this really have to be interwoven into an award-winning virtugame for billions to play?\n“Why is your princess Chinese?” your player character asks.\n“No—no,” Best splutters. “I mean. The princess. She’s supposed to—why do you have to make it a race thing?” Best is shouting now, she’s embarrassed, she’s never had to have a real-time conversation like this, let alone with someone she actually knew. “What, so now I can only make games with white characters?”\nYour face heats up in synch with Best’s. You apologized for your aggression the next day, pleading with your friend to please tell you if one of your playtests ever made her uncomfortable again. And your friend laughed it off. It was just a question! No need for you to get so worked up over it. I certainly didn’t. Of course that virtuchat made it into the game too, so you can’t even get mad at your friend for not including it. Anger soars within you. These are your exact private conversations, word for word. If your friend’s getting lauded for this game, then why shouldn’t you? You’ve seen the reviews, and now you blink open another window in the left eye of your VR goggles and actually read them:\nIn The Virtual Gamer: A stunning introspection of what it means to make friends in our virtualized world. Ninjutsu News: With her minimalist flair, the developer tackles our COVID-times head-on, masterfully dissecting how living virtually has brought us together—and torn us apart. Dodecahedron: Your player character’s relationship with “Best” serves as the perfect microcosm for gender dynamics in our evolving society. Left-Right-A-B-Start: Soul-crushing fetishization. Tilted Gaming Network: By giving you the illusion of choice, then ripping it away, Best Game shows how Race continues to haunt our supposedly neutral online environments . . .\nBut if you told your story, who would believe you? It’s not like you recorded those conversations. More importantly, who would take your side? You’ve seen the crowds in the virtuforums, seething around the socials screens, recording, vivisecting. So Best is real? They’ll say. Big surprise. She’s so full of herself. Imagine creating such a cringe power fantasy game and then ADMITTING you made it. The fact that it was an alpha version, that even if you’d released it, it would’ve sold a dozen copies at most, won’t save you. She should’ve known this would’ve happened. We all make bad games, sometimes we fuck up and make racist games, but to pressure your friend to praise it. She wanted attention, she can’t complain if that’s what she got. Especially if you contacted the GV-GOAT Award, tried to get Best Game withdrawn on the ground of copyright infringement (of what, your entire life?). She’s just jealous, another failed white virtudev who couldn’t bear to see her marginalized friend succeed . . .\nWorst of all, your friend didn’t discuss any of this with you. She tried to keep you away from it. So now all those cold responses you’ve been getting from the rest of your city’s virtudev group, their excuses not to be in the studio with you, not to meet up for virtual coffee, make sense. They’ve all known Best was you. If you speak up, or even if you don’t, eventually, the whole world will know she’s you. What you did was wrong, caused pain, but does it really deserve to be excoriated by the entire world? How many should dole out your compensatory pain? Ten thousand? A hundred thousand? A hundred million?\nHow much would change if the world knew about your past? Your soul-crushing childhood. How your parents used virtual school to control you. The lack of friendship, save for your friend, the lack of money, the anxiety, your eventual diagnosis . . .\nIt doesn’t matter.\nYou know you shouldn’t, but instead of abandoning Best Game then and there, you tear at a seam in the level, where a chair leg clips into the floor. You know the quirks of your friend’s coding: you tunnel into the remote server streaming the game to the masses, you find the dev tools. You break through the encryption around the source code, and you see what you shouldn’t, but what you couldn’t resist: the comments, meant only for your friend and her playtesters’ eyes.\nIn the margins of level fifteen, a memory that takes place at a virtugaming con:\nOMG she LITERALLY said that.\nThe playtester’s signature is that of a Big Name virtudev. You remember the scene differently now. The first in-person con you’d gained the courage to go to, at your friend’s encouragement (you thought). You found your friend only at the end of the first day, in a circle of Big Name virtudevs (you see now they’ve taken her under their wing), and you shouldered your way in, stammering, “I’m her friend,” and all the Big Names smiled (coldly). And somehow, after your friend nudged you, you started talking about the virtugame you were working on (probably standing too close to the person next to you), how it meant so much to you, and no pressure, but you could send them a copy . . .\nI REMEMBER THAT.\nLike, learn to take a hint!\nNot every group convo is the time to pitch yourself!\nThere are hundreds of comments of like that, sprinkled over dozens of levels. But that can’t be right. There has to be—you scroll and you scroll and you scroll and finally you find it. Or at least the closest thing to it that you can possibly find.\nYour friend: I feel kinda bad though? Like she legit thinks we’re good friends. But at this point I’ve basically only been hanging out with her to get inspo.\nHer Big Name playtesters: You have GOT to keep at it. She’s just a gold mine. Have you seen how much more attention your games have been getting?\nYour friend: It feels wrong, though.\nHer Big Name playtesters: But what you went through, your background—it’s your brand. You started off using her interactions as inspiration, but you changed it into so much more than that. You turned it into a story that truly means so much to so many players.\nYou don’t need to play to the end of Best Game because you know how it ends. But you explore every line of code, every unused asset, every data file, hoping against hope. And then, just as you’re losing hope, you find it. An unfinished scene. The player character sitting on one side of an untextured table. Best on the other. The only thing fully rendered is a virtugame cover, emblazoned with an orchid and an opera mask, askew between them. Before you know it, through the dev tools, you’re scripting Best. It’s only right, right? That for once the words out of her mouth should be ones you’ve chosen to share?\n“Hey. It’s me. I finally got around to playing your game.”\nThe player character is a placeholder model—to be filled in by the player’s avatar, by billions of people all across the world. Most will take a seat at this table thinking Best is fictional, a demented figment of your friend’s genius. That these words are meant just for them. You imagine your friend sitting across from you, but it’s not the same.\n“I’m sorry I was a shitty friend,” you say. “But that’s what I am—was. I’m not your NPC. I’m not your fucking entertainment.”\nThere should be something else. You know that from your dialogue writing courses (something you’ve also always struggled with). But it won’t come to you. You slip out of Best and inject the scene, new voice lines and all, into the end of Best Game, just as the security bots catch on and boot you out. Just as you knew they would. Your friend will get the notification of your unauthorized patch attempt, of course. You want it to be up to her. Will she approve it? After the GV-GOAT Award ceremony, will billions play this version of the game? Will they love the new scene? Will they criticize it for being too on-the-nose, a hammy, unnecessary epilogue? Or will it be so in-character for Best. Your friend could patch it right out, of course. Pretend it never existed.\nOr she could do something else. And as soon as you think it you know she will. Answer you, that is, for the entire world, rightfully sealing your fate:\nNeither am I.\nYou delete your socials and rip off your VR goggles. You go to the bathroom to wash your face and see your sniveling, self-pitying, reflection and break the mirror with your fist then a hairbrush then the heel of your shoe until every shard is glittered dust on the tile. Then you go outside. It’s Saturday. A cacophony of starlings has landed in the trees, and they are screeching and screeching, and you listen to them for hours, your hand bleeding, not thinking at all."}