{"fingerprint": "Jc/4qXKj//M8Jg+xlSiLsBGhX7o=", "sitename": "Clarkesworld Magazine", "title": "Diagram and Story: A Conversation with R.F. Kuang by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kuang_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Diagram and Story: A Conversation with R.F. Kuang by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nDiagram and Story: A Conversation with R.F. Kuang\nRebecca Kuang is one of those rare individuals who hit a home run right out of the gate. She wrote a book for herself as an experiment and it became a big hit. Kuang is a Marshall Scholar and a Chinese-English translator. She earned an MPhil in Chinese studies from Cambridge and an MSc in contemporary Chinese studies from Oxford; now she’s pursuing a PhD in East Asian languages and literatures at Yale.\nWhen she isn’t immersed in academia, she’s into birds, making pizza dough, and comic books. She has been going through all the original issues of Batman and Spider-Man, and is an ardent fan of Alyssa Wong’s Doctor Aphra series.\nKuang grew up in Dallas, Texas, having moved there at age four from Guangzhou, China. She studied history at Georgetown in Washington, DC. As an undergrad she took a year off to live in Beijing and teach debate to high school students. She worked on her first novel, The Poppy War, in her free time, and attended the Odyssey Writing Workshop in 2016.\nKuang has been a finalist or received nominations for The Kitschies, BFA, Nebula, World Fantasy, and Locus awards, and has won the Crawford Award, the Compton Crook Award, and more recently, the 2020 Astounding Award.\nWhat were some of the most important genre works for you when you were younger, what did you get from them, and has your view of those books changed over time?\nThis is a good question to ask when we’re all grappling with what to do with our Harry Potter memorabilia now that J. K. Rowling insists on being a TERF, isn’t it? We’ve chatted before about how foundational Ender’s Game was for me, and how difficult it’s been to figure out my relationship to the book as a queer writer after learning more about Orson Scott Card’s homophobia as an adult. His work is engraved in my storytelling bones; his plot twists are etched permanently in my understanding of how to write a good novel. You can directly trace The Poppy War’s structure back to Ender’s Game. I learned about writing political intrigue, massively high stakes, and zippy, clever dialogue from him. He also has a long history of bigotry, so.\nHow do you separate the art from the artist? Can or should you? How do you ethically engage with works by bigoted creators as a consumer, as a reader, or as a fellow creative? I don’t know. I don’t think anyone really knows the answer. I guess I’m grateful to Ender’s Game for setting me on my creative path, but I’ll aim to write something better.\nDoes the concept of “genre” have meaning, beyond marketing? Is it important to distinguish between “literary” and “genre,” for example?\nCan I clean up our definitions first? One sense of “genre” refers just to a category of literature, which is what I mean when I say “genre.” But we also use “genre fiction” as a shorthand for “popular fiction” (which is also a loaded term), which I think most commonly refers to things like science fiction, fantasy, thrillers, mystery novels, etc. And then there’s “literary fiction,” which we generally consider more prestigious, valuable, artsy, or well-written than “popular fiction.”\nI think we’ve been talking for a while now about how boundaries are porous; how many speculative fiction stories and novels are also “artsy, prestigious, well-written, etc.” whatever any of those descriptions mean, and how many “literary fiction” novels have elements of the speculative. So false distinctions and their attendant value judgments are tiresome and, I guess, pretty last decade. But I don’t think we can do away with the idea of genres entirely. A novel’s genre still tells me something vaguely about what I ought to expect.\nI think a better way to understand literary genres is through Wittgenstein’s concept of family resemblance—members of a group have overlapping characteristics that they share, but there is not necessarily one characteristic shared by all members of that group. Actually, while I was writing out my answer, I got curious and Googled “genre family resemblance,” and found an article by David Fishelov that gives a pretty good summary of my own thoughts. I like how Fishelov extends the concept of family resemblance to genealogy in literary traditions, which I think is often missing from genre conversations.\nSorry, I don’t think this is the direction you wanted from this answer—I just think theories about classification, definitions, and canonization are cool. Marketing labels fail us in numerous ways, and I don’t think we’ve worked out an alternative (authors being more outspoken on social media about what their book is actually about and the traditions they were intended to fall into probably helps, though; I’m thinking of Silvia Moreno-Garcia’s discussions of how to categorize Mexican Gothic.) I’m still going to head straight for the “Science Fiction & Fantasy” section of the bookstore when I want to read something fun, though.\nYour first book, The Poppy War, received a lot of awards attention, including winning the Compton Crook Award. More recently you received the Astounding Award. What sort of impact, if any, does being up for awards have on you or your writing?\nI don’t think awards have changed my writing process or outlook in any meaningful way. But obviously, writers are insecure and anxious creatures, so it’s nice to feel the validation. Awards are pretty meaningless as statements on quality—things like the Hugos and Nebulas are just popularity contests within a very specific demographic—but it’s still nice when those very specific demographics say, “hey, good work!”\nAwards are also, admittedly, good motivation. I didn’t win any of the big awards I was up for, probably because I didn’t deserve them, but I’d like to win and deserve them at some point. I’m still in the very early stages of my career. It’s good to have something to work toward.\nI do also think that awards recognition bumps sales. A lot more people started picking up the trilogy after the Astounding Award win. It’s a modest bump, but it helps jump-start some word of mouth spread, and that’s really what makes a book successful in the long run.\nYou recently had a short story in Jonathan Strahan’s The Book of Dragons called “The Nine Curves River.” What was the process of writing this story? Will readers be seeing more short fiction from you?\nMaybe. I don’t write short stories often—well, I don’t read short stories often, for weird reasons related to focus and attention span (reading a novel feels like an accomplishment, but reading a short story feels like procrastination), so I haven’t internalized the rhythm and structure of the form. I think the only people whose short stories I read regularly are Ken Liu, Ted Chiang, Liu Cixin, and Alyssa Wong.\nI don’t get a lot of short story sized ideas; I like big, sprawling, complicated novels. I said yes to The Book of Dragons because a) I wanted some cash, b) I thought it would a fun challenge, and c) because I did, for once, have a story kernel ready to go, since I’d been thinking about the source mythology for Nezha from The Poppy War trilogy and was pondering about ways stories can be told, retold, mistold, misrepresented, translated, etc. Man, I really love that kind of stuff. I could write an entire anthology that is just different interpretations of the same myth. Anyhow, “The Nine Curves River” explores an alternate version of what happened to Nezha, placed on a scaffold of family drama and sibling jealousies.\nI think I’ve convinced myself in the process of writing this answer that I enjoy writing short stories, actually. I got the opportunity to write a short story for Star Wars in the upcoming anthology From a Certain Point of View: The Empire Strikes Back, and I had a lot of fun with that. I like how the length restriction forces you to squeeze as much story and meaning as you can into a smaller amount of space. It’s like how shorter word limits for academic papers encourage stronger arguments, since you don’t have the luxury to dawdle. Maybe I’ll do more! I like writing to a theme, especially if it’s a theme I hadn’t anticipated working on. Anthology editors, you know where to find me.\nYou’ve said that you started writing The Poppy War, almost as an experiment, after discovering Scrivener; and that it was something that you’d originally written for yourself and for your family. But with the subsequent books, you are writing for an audience. Does this have an impact on the creative or craft processes?\nYeah, I think I felt a lot more pressure writing The Dragon Republic and The Burning God because I didn’t want to let readers down. I try not to let reviews or expectations dictate where I take my story, but I did feel like I had to step up the quality of my work so that no one came away feeling disappointed. Seeing people get attached to certain characters made me want to make sure I delivered on those characters’ fates. Seeing the strong reader reaction to Nezha’s character, for example, made me work harder to make him three-dimensional and complicated rather than just an asshole. But improving with each subsequent novel is something that writers should always aim for anyway, so that pressure was healthy.\nI’ve learned it’s important to shut out the noise when it comes to certain character arcs, though. Sometimes readers’ hopes for certain characters—particularly romantic hopes—run at odds with what the story demands. Some people are going to hate The Burning God because their favorite characters didn’t get a happily ever after, but I don’t really care. I made the argument I wanted to with the ending, and I’m proud I stuck to my vision. For this book, in this context, an HEA would be dishonest and unsatisfying. Wish fulfillment is for fan fiction.\nIn any case, I do feel a lot freer to do whatever I want now that I’m moving on to a completely new project. There’s no baggage. I have no foreshadowed promises to deliver on. Do you know how much it sucks to be tied to finishing story lines that a teenager came up with? My nineteen-year-old self was a terrible coauthor.\nIn a Locus interview, you said, “Being a writer was never my original career goal, and it still isn’t . . . My main passion in life is studying Chinese literature, but I think I’ll keep writing fiction on the side, because that’s just how I process things.” With one series behind you and work done on the next book, have your writerly goals or perspectives changed?\nNo, things have basically stayed the same. I deferred starting my PhD this year because of COVID-19, which means I was writing full time (until I started auditing classes), and I didn’t like it at all. The days just felt so empty and vapid. It’s a lot of talking to yourself; bouncing ideas off of yourself. But I’m only twenty-four, so I don’t have a lot of thoughts in my head, and any ideas that I generate on my own just bounce back and forth in this echo chamber of naïve silliness.\nAcademia is fun because you’re constantly being challenged by smarter people to revise and reinvestigate your opinions. Stories have to come from somewhere; for me, they come from whatever research questions are bothering me at the moment. Reading critical theory makes my fiction better because good, interesting fiction is mired in precisely the stuff critical theory addresses. Whatever depth or profundity makes its way into my work comes straight from people much smarter than me. I also just really enjoy research on its own terms. Argument construction is a lot of fun. So is burying yourself in all of the literature surrounding a very niche subfield.\nWriting a tight, clean, persuasive paper feels just as satisfying as finishing a short story or a novel. You get that same exhilarating feelings of chasing a tricky idea and wrestling it to the ground. I’m excited to do this for the next six or seven years, and I really hope I get to keep doing it forever. I could give up writing, I think, but I couldn’t give up research.\nI think the conflict between my two careers is really going to come to a head when I start my PhD studies in earnest, which means my output will likely slow way down starting in 2021. That’s okay; I’d rather not publish anything for three or four years than rush out something I’m not proud of.\nAre there important ways in which The Burning God changed from the time you started planning it to its final form?\nThe final form of The Burning God gives you more to chew on. Back in 2016, the version of TBG I had outlined was ethically, politically, and historically very flat. I think it would have been an entertaining read, but it wouldn’t have lingered with anyone after they turned the last page. Writing it would have felt like banging the same piano chord very hard, over and over again. (Is it rude to say that I don’t want to write something that disappears immediately from memory like the Game of Thrones finale? I feel like we talked about that for a day, and then it completely dropped off the cultural map.)\nI’ve finished many courses and attended many lectures on Chinese history and literature since then, and that’s influenced the questions I chose to raise with the ending. Now I think it’s still entertaining, but chomps at much more interesting questions about alternative futures and political systems. The new version questions our assumptions about path dependency rather than offering a basic pessimistic assessment of human nature and the inevitability of certain historical tragedies.\nWhat were some of the hardest things about writing The Burning God, and looking at the final product, what are you most proud of?\nI’m very proud of the last few chapters! A lot of things happened plot-wise and character-wise that required really deft handling—the book switches direction on the basis of a few simple words of dialogue or a single passage of interior monologue. Every word bears tremendous weight; every sentence has to accomplish multiple things. I rewrote those chapters so many times I’ve lost count. Now that I’ve gotten some distance from it, it feels good to go back and reread them. I think I really did manage to pull it off, and that feels good.\nDo you see yourself as a writer who will always address the darkness, the horrors, the heavy topics? Or do you see yourself as someone who might also write something fluffy, something that is, for the most part, just for fun?\nI think I’m really funny! Am I not funny?\nI’m not particularly drawn to writing about darkness. Writing about tragedy and trauma for the sake of tragedy and trauma makes me feel icky. It feels voyeuristic—sensationalist, is the word? Trauma as spectacle? I try not to do that. I’m just interested in stories about a range of topics that happen to involve a lot of darkness. I like books that teach me something or change the way I look at the world, so I don’t really enjoy reading for pure fun or escapism. I’m not able to distract myself from real world troubles with an entertaining story. Lots of people do, and that’s great for them! But I think we end up writing what we enjoy reading, so I guess that’s why I don’t write for pure fun or escapism either. I guess I just like truth, and truth is often sad.\nBut I also write what I love. I put a lot of my joy regarding reconnecting to my Chinese heritage into The Poppy War. All of the descriptions of food, festivals, myths, and inside jokes came from experiences I had with my family—for example, when Rin goes to the market with Kitay and deliberates buying a toy statuette of a urinating monk, or when they eat hot pot so spicy that it burns on both ends. And I’m putting a lot of happy memories into the Oxford novel—all those golden, halcyon school days come straight from this past year. I’m excited for my friends to read those scenes and see how I’ve interpreted those memories. Those come from a place of deep love.\nThe Publishers Weekly review for The Burning God calls it “a satisfying if not happy end to the series.” To my thinking, this is a massive accomplishment: so many series have disappointing or lackluster endings. What is the key to writing a satisfying ending, not just for a story or a book, but for a narrative spanning three books?\nIt’s a big relief that most people seem to have found TBG satisfying! I think one thing I did right was that the end was built into the beginning. As we both know from Odyssey, one of Jeanne’s favorite lines is that a good ending feels both surprising and inevitable. I think a lot about the geometry of stories. I like when narrative arcs are nice and symmetrical. I like when you can trace out the diagram of the story and make a pretty shape. My obsession with the TPW trilogy was triangles. You can map everything out to threes and nines. The ending probably feels satisfying because geometrically, it closes out the underlying structure.\nI think another idiosyncrasy I have that helps with writing satisfying third acts is that I always think of the ending before I come up with anything else. I can’t write from an outline and I don’t like doing too much planning, but the reason why I can “pants” my way to a coherent story is that I always have a clear end point in mind—I know where all the roads must lead. Every scene is written with the ultimate payoff in mind. The end is implied in the beginning.\nYour next book draws on your experiences at Cambridge and Oxford (“Oxbridge”) and dives into the horrors of Dark Academia. What can you tell readers about this work, or anything else you are working on, or that you might have coming up?\nThe Oxford novel has been a bigger challenge to write than The Poppy War trilogy in every way. I’m pushing myself to experiment with character, voice, chronology, and scope in ways I haven’t done before. It’s also more of a personal and introspective work, because it touches on anxieties and doubts I have about my own role as a student, and about the potential of the university as a site of political resistance as well as the dangers of the university as a site of violence and violent knowledge production.\nI’ve talked about it being a response to The Secret History, and it is that in an important structural sense, but at the heart of it I’m doing a riff of a Victorian bildungsroman in the tradition of Dickens and Thackeray by way of an anti-colonial critique. The bildungsroman, as classically understood, involves a socio-aesthetic process in which the main character becomes both an ideal bourgeois human being and a good citizen. But what happens when the protagonist cannot be a good citizen of the state because they are excluded by virtue of their race? The process of education here doesn’t just involve socialization into colonial Britain, but an awareness of the evils of colonial Britain and one’s complicity in imperial expansion.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}