{"fingerprint": "T54WDocpqNTa/9t7lpC/LgE76d0=", "sitename": "Clarkesworld Magazine", "title": "Time Reveals the Heart by Derek Künsken", "author": "Derek Künsken", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kunsken_03_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Time Reveals the Heart by Derek Künsken", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5800 words, short story\n Time Reveals the Heart\n Guo Lěi mounted the stairs to his mother’s apartment at seven in the morning. He hadn’t visited in two weeks; he never knew what he would find. It was early, but he had a launch today, maybe several, and no matter what, he tried to see his mother before every launch, just in case. When silence answered his knocks, he used his key.\n The curtains were drawn. The air was close and humid over an obstacle course of food delivery bags. Spilled huangjiu laced the air with the scent of dried alcohol. Rumpled clothes seemed to have rained on the floor and bed in his mother’s room. He found her on the kitchen floor. He shook her softly. She smelled of millet wine.\n “Mother.”\n She mouthed a sound of sleeping annoyance when he turned her over. Her lip was split. Dried blood spattered her chin and the floor. He sat her up.\n “Mother.”\n She pushed at his chest with the irritation of a resentfully waking child. Her skin was cool. They staggered to the sofa and laid her down. He wanted to leave. The senseless figure wasn’t the woman who’d raised him. He owed a duty to his mother, but he didn’t know this woman.\n He unlocked his phone. In cloud storage, he had an AI emulator linked to an icon with his mother’s smiling face. The frozen image grew to fill the screen and came alive, smiling. He always knew who he would see when he touched the icon.\n “My beautiful Lěi,” she said. “Happy New Year’s Eve.” This was the woman who’d raised him, fed him, taught him, fixed his cuts, helped him climb when he’d been small and unsure.\n “I’ve got a launch today, so I wanted to see you quickly.” He looked at the woman on the sofa.\n “You’re such a good boy,” the uploaded woman said. “I’m so proud.”\n He didn’t have enough time to wait for her to wake up. She was usually sober in the morning.\n “What’s wrong?” said the woman in the phone.\n “You didn’t get anything ready.”\n The face in the phone, the mother he remembered, reacted as he knew her. A moment of surprise preceded an expression of hurt.\n “What kind of a thing is that to say to your mother?” she demanded. “Have I ever missed a New Year? Did I ever offer you anything but the best?”\n The woman behind the icon, uploaded a year ago during a brief few months of sobriety, had not missed any New Years. She’d hidden a lot of her drinking over the years, indulging when he was at school or interning, usually with friends, but gradually on her own. Still, each New Year’s Eve, her apartment had been clean, hung with red banners, laid out with joss sticks, table set for them and ancestors with rice cakes, oranges, and noodles, a poster of the door god mounted outside.\n She didn’t react to the accusations. The upload only preserved the woman of the past. The memory devices holding the vast database of all her potential reactions could react to moments of the present, but the algorithms had been established before she’d deteriorated so much. The woman groaning on the sofa and the woman in the phone screen were barely the same person, and neither truly engaged with the present.\n “I remember your first violin recital,” she said.\n He smiled. They’d practiced together every night for months.\n “I’m as proud of you now as I was then, Lěi.”\n He closed the app. His mother snored unevenly on the sofa. He covered her with a blanket and surveyed the gloomy apartment from the door.\n “Happy New Year,” he said.\n Lěi entered the office at seven thirty with an eager step. The Chengdu Archaeological Portal Project occupied the top four floors of the Tongwei International Center. From here, they could reach thousands of years into the past to study their world as it had been. Wen Zuodong was waiting for him, lab coat off.\n “I thought I was going to miss you,” Zuodong said. “They’re switching out my shift early so I can catch my train to Chongqing, to be with my family. I hope you finish on your first jump so you can too.”\n “Yeah,” Lěi said.\n “Hey! Did you see the new recordings on textile dyeing? The Shu had a whole palette of colors we never knew about!”\n “Not yet.”\n “The raw photos are in the work-in-progress folders,” Zuodong’s excitement was infectious. Ancient textiles were exciting, but some of the equipment Lěi had set up had photographed previously unknown wood-and-gut musical instruments. He still hadn’t managed to record the music, but he dreamed of soon hearing songs of three millennia ago. “Take a look once you’re done. I’m heading home soon.”\n He followed Zuodong to the staging area. No other jumpers were scheduled today. The monitoring stations were shut down, but for Zuodong’s. He put the mission profile in Lěi’s hand, took his temperature, checked his ears and reflexes.\n The mission was simple. Another jumper, while setting up archaeological cameras and microphones in the past, had lost one. Lěi wouldn’t be setting up anything today, just finding and recovering a camera no bigger than a piece of gum. He wondered how much trouble the other jumper was in. The Archaeological Portal Project picked only the best for their jump teams. The thought of making a mistake and losing access to the past made him queasy.\n He didn’t make mistakes though. He was disciplined. And although history could change, it was often only in small ways. Societal and technological forces had their own inertia. And a lost piece of equipment or the death of a single person rarely influenced them. But even small changes carried risk, because no one knew quite what would change history, so they were all careful.\n The more personal danger to jumpers was accidentally surprising or frightening locals in the past. But the risks were worth it. To breath the air of millennia ago was moving. Seeing the ancient cities, hearing the linguistic variations, smelling millennia-old recipes and tracking architectural and technological developments inspired. It was like being an astronaut traveling to an alien world.\n Zuodong’s pills were open now at his workstation. Lěi’s palms itched at the sight of the gel capsules. The pills were the key to navigating time, but at high doses could become addictive. Zuodong put one in Lěi’s palm and inserted two others into a pocket on Lěi’s gear. He swallowed the pill and waited eagerly.\n The workstations . . . shifted, bent, as if upending. Zuodong examined his pupils.\n “It’s hitting you?” Zuodong said. His voice sounded like falling drops of water, shapeless, wobbling in free fall, transparent. Lěi nodded, causing the staging area to change colors, bluing and purpling.\n “Synesthesia started.”\n “Let’s check out your pilot AI,” Zuodong said, guiding Lěi to the launch plate in the room beyond the bulletproof glass. The walls seemed to be melting, solid to liquid, but never running down. Disconnected from gravity. Zuodong patted Lěi’s webbing and straps. “Your AI is ready. Thirty seconds. You ready?”\n “Yes.”\n Lěi’s head felt swollen, weightless, expanding, perceiving the world in transcendent ways Zuodong couldn’t imagine. Lěi floated in a euphoric perceptual kaleidoscope. At the mark, he hit the green button.\n The world clenched, compressing into a tight, tiny swirl. Then naked stars orbited Lěi, cold and white, stars of now, stars of tomorrow, stars of yesterday, a filigree of diamond dust splashed over the stacks of black velvet he sped through.\n The project had nearly automated travel into the past; machines injected and mediated the energy. But no rational mind could navigate all of it, nor any AI. No data set could teach an AI to see all the years in a stack of three-dimensional sheets, to find in all of them the right landing site. The human mind couldn’t either, not without a psychedelic drug that distended the mind. But under the influence of the drug, Lěi’s mind twisted out of shape, distended into swirls of logical eddies, expanded and folded like dough so that he could see through that miasma of unnatural simultaneity to find the pathway to a single year.\n The pilot AI followed Lěi’s thoughts to that year and ended their hurtling. Then Lěi stood in tall grass, catching himself on the rough bark of a looming tree. The air tasted of winter-dozing laurel and oak. Everything smelled electrically alive, resonant, meaningful. The stars slowed their pinwheeling. He felt . . . extraordinary. Big. Connected. At the edge of some immense realization.\n He had to take the antidote. To come down. He waited a moment longer, feeling the world in a way no one could ever feel it: tilting in nonsensical directions, brightly colored in darkness, silent scraping of grass stalk against grass stalk in a damp breeze that tasted of honey. He drew the antidote gel capsule from a pouch and swallowed it grudgingly.\n He lived for these moments of transcendence and waited out the last of them, mourning the shrinking of his consciousness as all of time and space, so clear moments before, became opaque, pitiless, hard as tree bark. He became small and the warm world became cold. Nothing naturally metabolized the navigator drug, so its effect could last two or three days, but extensive neurological damage could happen in just a few hours. The jumpers had to be disciplined enough to take the antidote on time.\n Lěi rested against the tree and took a long drink from his canteen.\n His dark vision goggles turned the black of the nighttime Chengdu plain into a low patchwork of farmers’ fields, dirt tracks, and wood and rammed-earth buildings. A sliver of moon hung high among the stars. A winding strip of the Jinsha River glowed a false green relative to the cool of the January evening. Dozens of kilns and ovens, banked for the night, throbbed a hotter green. The excitement of being here, of having been transported to a world of ancient wonder crept into him. The sleeping city in the distance was the capital of the Shu kingdom, 708 BC.\n “Happy New Year,” he whispered.\n He hugged himself as he ran his security check of his surroundings. He was alone. No thermal signatures, just the peace of ancient nighttime. The comedown was hitting him hard. It felt like ants crawling on his skin. He rubbed his arms, trying to shake off the creeping feeling.\n His palm brushed against the pouch containing two more pills, one to navigate the way back to the present, one as a spare. He thought of swallowing the spare and enjoying another high. A kind of expanded world beckoned in each of those pills, a world that was hard to let go. The pills tempted every jumper, but they all resisted.\n Lěi began his search, walking a raster pattern, probing the tall grasses with sensors. In ninety minutes, he’d covered the entire mission area, but didn’t find anything that wasn’t supposed to be there.\n Lěi landed back on the launch deck of the project. Mosses crawled the walls in his warped, euphoric perceptions. The deck was corrugated into waves. His jumper training already had the antidote in his hand, but he didn’t want to take it. Not yet. He loved this surreal world. He loved belonging to this vastness of strange colors and sounds and shapes, to a place where time didn’t matter. His training brought the antidote pill to his lips, and for long moments, he hesitated, drawing out the feeling, if only for a second or two. But even deep under the effects of the navigator pill, he knew waiting was wrong.\n He swallowed. Time contracted. Color drained from the world. Sound lost its richness. The walls were not covered in moss. The floor wasn’t a wave pattern. The world became plain. He became plain.\n He plodded off the launch deck. Normally the stage crews met him here. A woman swore in the staging area. Lěi came around the protective wall. A young woman hunched forward in her chair, headset on, controller in her hand, playing a video game on two of three big monitors.\n “Get him! Get him! Your six! Your six!” she said into her headset.\n Lěi neared. “You’re my stager?”\n “Hold on,” she said, firing at a bunch of monsters.\n Reluctantly, he took out the spare navigator pill. “I have to give you this.”\n “Leave it on the console,” she said. “No! No! No! Now your nine!”\n Her on-screen character swiveled and ducked and fired.\n Lěi put the pill in its box. Other boxes were there too. He might have taken one or more of the navigator pills and she might not notice.\n “Who are you?”\n She half-glanced, and grimaced as she twisted her controller. “Kù Yǒng. How was the past?”\n “Shouldn’t you be watching me?”\n She maintained a stream of fire with her left hand while tapping the right-hand monitor. The third screen showed his telltales. All green.\n “I skipped out on my family today because of your emergency jump,” she said. “Bosses said I could play my little cousins online if there wasn’t any work. They told me you don’t need much. Do you need anything? Shoot left! He’s on your five!”\n A monster burst in a flash of color and treasure.\n Kù Yǒng turned to him, smiling. “We done? Can we go home now?”\n “I couldn’t find the camera. I scoured the whole mission area.”\n “Ugh!” she said in exasperation. “Four more hours! I’m supposed to be at home with family.” She took off her headset and pushed past him. “I’ll reset the launch platform.”\n She bustled past the protective wall and he was alone with the pills. They were supposed to be controlled, counted, but she’d just left them out. Anyone could take one and expand their entire vision of the world, perceive its unseen dimensions, understand how space and time knit together. He picked one up and for a moment imagined slipping it into his pocket.\n He put it back and turned away abruptly.\n He stripped off his webbing and launch equipment and collapsed into one of the rest chairs. In theory, another launch could happen right away, but biochemistry held them back. It wasn’t safe to climb back into navigator perceptions while the antidote ran its course. Kù Yǒng came back.\n “Do you need anything?” she said, putting on her headset.\n “No.”\n “They could have done this another day and not ruined New Year’s Eve,” she said, restarting her game.\n Lěi leaned his head back, closing his eyes. Glimpses of that space-time vastness teased in visual memory. He used breathing exercises to come down, to bring the mind to rest. She was wrong, of course. It had to be now because of the location of the Earth. Time travel worked, but they couldn’t go anywhen. It had to be a time and a place, and the hardest part of time travel was finding the Earth in the immensity of space-time.\n The Earth hurtled around the sun at almost thirty kilometers per second in an elliptical orbit that precessed. If Lěi jumped back six months in time, the Earth would be at the other side of the sun and he would suffocate in space. And the sun traveled around the center of the galaxy at two hundred and fifty kilometers per second at an odd angle to the solar pole. These motions made a wide, misshapen helix line through four-dimensional space-time. Jumpers navigated that uneven spiral. In theory, the launch equipment could precisely push a jumper through space as well as time, but the navigation became unsolvable. So they jumped in units of a year, like leaping from wave crest to wave crest. Whenever they’d sent the first jumper, perhaps one or two years ago, it hadn’t been New Year. But the lunar calendar had made finding the lost camera a New Year problem.\n He thumbed open his phone and swiped to the icon with his mother’s smiling picture.\n “Hello, darling!” she said.\n Just like video chatting.\n “Hi, Mom.”\n “You look tired.”\n “Navigator drugs up, navigator drugs down,” he said. “I’ll feel better in a couple of hours.”\n “They work you too hard.”\n “It’s okay.”\n “Are you eating enough?”\n “Yes, Mother.”\n “Eat more noodles. If you don’t have time to cook, you can always make noodles quickly.”\n They’d lived variations of this conversation before. The algorithms running his emulated mother were already set, like the pasts he visited. She wasn’t reacting to new things, only to the stimulus of him, now, but it felt like the real her.\n “I should go get some food, Mom.”\n “Call soon.”\n “I will.”\n Her icon shrank to a thumbnail among many. Kù Yǒng’s video game rushed in colorful, tumbling, exploding battle.\n “I guess you’re missing family too, eh?” she called back.\n Lěi had dan dan noodles with minced pork delivered. As he ate, he stared out at the Chengdu skyline, low clouds gray over splashes of red and gold decorations in apartment windows. The city had transformed the river plain, erased the past he’d walked just two hours ago. Concrete and steel and alluvial silt and millennia of time obscured the solution to finding the lost camera.\n It wasn’t in the mission area. Previous scouting missions had already figured out how to get the most anthropological knowledge in the least intrusive and detectable ways. Risking detection recklessly wouldn’t teach them any more of their ancient ancestors. There was no reason to take a camera or microphone outside the mission area.\n No reason.\n What if he’d left without any reason? The navigator drug expanded the consciousness, stretched it beyond reason. Thoughts in that state existed above rational thinking and also in the intuitive layer beneath the rational. That was the only way for the human mind to find a way through the movements of planets and stars and perturbations of distant suns in four dimensions.\n Finding the way was exhilarating, sublime, like surfing starlight and cosmic dust, and it was hard to leave. Swallowing the antidote was an act of discipline. What if the other jumper hadn’t? What if he’d waited as long as he possibly could to take his antidote, staying in that higher state for twenty minutes, maybe half an hour, and then rushed through his setup mission with the remaining time? The project would never know. Unless he’d made a mistake, like losing a piece of kit.\n It was chilling.\n He hadn’t told Kù Yǒng his theory of the lost camera. She barely noticed him as he took the three pills he needed to jump: one to go pastward, one to return, and one spare. He slipped the first into his mouth with a trepidatious eagerness and put the other two into the special pouches. The first touches of the navigator drug prodded at the edges of his perceptions. Colors switched. Shadows brightened. Sound Dopplered. Touch tingled. The air tasted of steel and pepper. The world swelled, inflating like a balloon, in all the dimensions he knew and in directions the human mind could not imagine without help. And riding over all of this, euphoria.\n “Launch sequence clear,” Kù Yǒng said through a speaker.\n Her voice seemed far away, as distance became flexible and time came into sharp focus. On the platform, his hand hovered over the green launch button. He realized that he hadn’t called his mother. He’d spoken to the upload instead.\n “Launch sequence clear,” Kù Yǒng repeated.\n Lěi pressed the button and catapulted through the cosmos. Space was hot and bright, the sun hanging in the black, apparently unmoving while the Earth appeared and vanished like a strobe light. Sometimes the Earth came close. Sometimes Lěi was underground. Sometimes he hovered in blue sky. The pulsing throbbed like part of the cosmic heartbeat. His altered state of mind saw a pathway through the strobing, through the dizzying choices, in a way an AI could not, all the way to the ancient Shu kingdom of 708 BC.\n He appeared in the night’s dark. In the three hours since he’d left, clouds had jammed together, occluding the stars. The air chilled his lungs and smelled green, alive. So beautiful. So much more than real. He wanted to just experience it, but he needed these moments to try to understand what the other jumper might have done if he hadn’t taken the antidote. Lěi turned slowly, arms wide, head high, feeling the ancient night.\n The unwalled city lay a kilometer away, filled with sleeping people who fired ceramics and shaped bronzes and carved jade and ground millet, who existed and loved and laughed in this time and no other. Had the jumper sought them out in a whim of expanded consciousness? The quiet city was a small thing, a transient wink in the vastness.\n Lěi’s slow turn stopped to face low mountains at the edge of the river valley. In this feeling of connectedness, of imagining the world through time as well as space, the mountains seemed steadier, more meaningful. He’d never noticed it before, maybe because he’d never stayed in this state for long. The mountains possessed a weight beyond their hardness and size. They existed . . . differently.\n Unlike the winking, vanishing city, people, river, and trees, the mountains possessed an invariant solidity through time. Not just forward in time, but backward, before humanity. Their temporal immensity struck him in a way that few things had in the navigator’s perceptions. He’d never looked, because of his diligence, his duty, his discipline. He’d always taken his antidote right away, done his security sweep, and verified his location in space-time. The busyness of mission had prevented him from seeing something far more beautiful.\n Dewy grasses brushed his boots and pants, appearing to leave iridescent droplets. He came to the edge of the mission area. The mountains that would midwife Taoism beckoned with a kind of eternity. That timelessness was beautiful and meaningful in ways humanity hadn’t the tools to articulate, an art form of the very universe itself.\n Lěi activated the search sensor on his webbing and left the mission area, heading toward Mount Qingcheng. The euphoria strengthened. He’d never let the navigator drug go so long in his system. His heart beat like he’d drank several coffees and he sweat in the cool air. In the compelling, surreal perceptions of the navigator drug, a meandering pathway seemed to be guiding his feet. His boots didn’t seem to touch the grasses. They walked toward new states of being, each grander and more marvelous. Time swirled, pushing his legs like a river eddy. A sensor ping interrupted the dreaminess.\n His ocular implants formed an augmented reality halo around something in the grass, about eighty meters leftward. He followed the ghostly light and knelt in a darkness that frustrated his questing fingers. He risked a low red light. It revealed a snail-sized camera tangled under last season’s grass. He brushed off the muck. So much trouble for such a small thing. And the camera hadn’t even revealed the past. It had revealed the present, showing the weakness of a jumper who had decided to push into an altered experience for longer than he should have. For longer than Lěi should have.\n He was still connected to the world and cosmos in ways he could barely understand, veined into information so strange that in his wild imaginings he felt the heartbeat of the cosmos. And yet, he wanted this. He wanted this experience to continue, and he understood with a visceral certainty why the other jumper had concocted this plan. The temptation in that other jumper mirrored Lěi’s.\n He withdrew the antidote pill, dreading the smallness that would follow. He should take it, but when would he again be this deep into the truth of the world? Could he wait a few more minutes?\n The mountains in the distance, black against predawn clouds, extended in four-dimensional grandeur, three-dimensional moment by three-dimensional moment. Lěi could see them all the way forward and all the way back, all the slivers of all the presents stacked one against the other. And he wept with the ecstasy of knowing something so sublime.\n And yet even within that euphoria, fear slithered in. He shouldn’t have seen so far, gone so high in this transcendence. He was afraid he wasn’t strong enough to stop. And maybe he didn’t need to. He filled his lungs with the cool, moist air of the living past, feeling the colors and sounds hidden in the synesthetic smells, experiencing a kind of transfiguring godhood.\n The antidote touched his lips, on a trembling, uncertain palm.\n He swallowed.\n He descended. He diminished. He shrank.\n He hugged his trembling body and mourned for the world draining out of him.\n Lěi came into the staging area, loosening the straps on his webbing. Kù Yǒng half-stood, half-sat, her shoulders canted forty-five degrees, matching her tilted video game controller. “Take it! Die!” she said into her microphone.\n “Hi, Kù Yǒng.”\n She grunted, twisting her body the other way as she maneuvered her character. “Be right there . . . ” she gritted. She growled in frustration and tapped frantically at the firing controls until she swore and dropped the control in disgust. “So close!” She yanked off her headset. “How did it go?”\n He held out the dirt-encrusted camera. She took it. He also handed her back his spare navigator pill.\n “I didn’t report something I should have,” he said.\n He felt like he was at his first jump again.\n “Like from the launch?”\n He took off the webbing and handed it to her.\n “My mother . . . drinks. I never told the project in my medical forms. And I’m . . . ” He took a big breath. “I’m tempted by the navigator pills.”\n Kù Yǒng seemed unprepared and gaped for long seconds. “That’s heavy. I . . . umm. I probably . . . you know, have to ground you, right?”\n “Yeah. You do,” he said, a kind of lost resignation in his chest, like he was giving up any chance to hear ancient music again, to see vanished cities, people of the past living and breathing.\n She shook at the webbing, pouring her nervous energy with it. “Are you sure? I mean, is this a big deal? Do you want to wait a few days and report it to someone more senior? Maybe your mom just got into the holiday season. And you. I mean all the jumpers say they think about the pills.”\n He tried to smile reassuringly.\n “You better log it,” he said. “My mother’s problem isn’t new. By contract, I should have reported this a long time ago.”\n “That really sucks, man. I, uh . . . Good luck.”\n Kù Yǒng shook his hand awkwardly. He hadn’t imagined he’d be happy now, but maybe he’d been hoping for relief. But a single step, even a giant one, could not leap the whole journey.\n Small firecrackers popped in the street just after sundown, delighting the children who were too small to stay up late, but crackling against Lěi’s still-sensitive perceptions. His heart felt brittle too. The temptation of the navigator pill had shone a light on his weakness. He didn’t know who he would find in his mother’s apartment: the mother who’d raised him or the stranger she’d become. But yielding to temptation had shown him his own fear. Who would he be when he next took the navigator drug? A moment of carelessness might set him on a journey to a place he couldn’t leave.\n And he didn’t know what inside him made him want that journey. Was he trying to be larger than he was, growing into some belonging that had eluded him? Or was he fleeing something? He didn’t know how his mother had started her journey. Had she slipped? Or chased something down a path whose end she couldn’t see? Or had she run away from something she thought worse?\n His mother opened the door at his knock. She swayed slightly, but beamed a blurry smile. Maybe she hadn’t thought he would come back today. Or maybe she didn’t remember seeing him that morning? The door snow-plowed bags of garbage she’d collected. The lights in the apartment had lifted some of the oppressiveness.\n “My treasure,” she said in a carefully precise slur. She stroked his cheek with a hand smelling of rice wine. He pulled awkwardly away, moving to the kitchen. She noticed the boxes of food in his grocery bag. “Oh. Darling. Are you making us a New Year’s dinner?”\n The woman’s smile wasn’t his mother’s, nor was the slow swaying as she stood there. Rather than watching a stranger smile dully at him, he said “I’ll wash the dishes.”\n He laid the grocery bag in an uncluttered spot of counter and listened to her soft footsteps shuffle to the sofa, displacing bits of paper and recycling that ought to have been tidied on New Year’s Eve. He used his breathing technique; his heart still beat too fast. It might be hours before his body came down properly. But the world had already shriveled.\n He’d told Kù Yǒng part of the truth. He’d said the navigator pills tempted him. He hadn’t said the conclusion out loud, and maybe she wouldn’t connect all the dots. He was already fighting temptation, and he didn’t know how long it had been going on. He’d traveled partway down a path that might lead to places he couldn’t leave. Today, he’d stopped and turned, and begun to look for the way back. Could he lead his mother back too? He and she stood on distant hilltops, seeing each other, but separated like the years in space-time. Neither could see the way through the gloomy valleys that separated them.\n “Do you want some baijiu?” she said. “We should celebrate the new year.”\n His phone was close. It would be easy to return to the mother in the icon, like leaping across time to a sleeping city in the past. But the mother behind the icon wasn’t his mother at all. The upload was a simulation built of data arrays and prediction algorithms. The mother in the icon didn’t feel anything, didn’t love, couldn’t be the subject of love, couldn’t be owed a son’s duty. Nor could Lěi simply walk to the mother on the sofa. He couldn’t leap from one peak to another, crossing whatever psychological geography lay between. That was a magic of the pills.\n “Oh!” his mother said from the sofa. “I should order something for dinner.”\n The face in the icon, that portrait in electrons and magnetic fields, lived in a server, a painting in computer code of one of her best days, hyperreal and not real at all. Lěi had worked in paradoxes. He had navigated through time by temporarily accepting some paradoxes, but that didn’t make them real. Paradoxes were a scaffolding, a temporary step to get from one piece of solid ground to another. Present to past. Past to present. Truth to truth.\n “I brought food,” he said without turning.\n “You’re a good boy,” she slurred. A glass touched the table with a clumsy, sliding clink.\n His throat felt tight, but he thumbed away the icon of the mother-who-had-been and put his phone on the counter. The mother in the past was perhaps gone, but some form of her existed in the present, like the alluvial plain beneath the city. He’d let himself avoid both their problems, until here they were, reunited as strangers. He’d traveled at great risk into the past to learn about people who had vanished millennia ago, but he’d lost sight of his own mother. He was afraid of how much he might be like her, but maybe if she was like him, she could also take steps back. He sat beside her.\n “I left my job,” he said.\n “What?” She turned half-lucid eyes on him.\n “It’s a hard job.”\n “A prestigious job! With good money.”\n He picked up one of the fallen empties and set it on the table. Another had rolled under the sofa. He set it beside the first.\n “Leave the recycling!” she said with a tone of drunken irritation she’d perfected while he’d been in university. “Why did you leave your job?”\n Her hand was warm under his. He squeezed it, seeking something.\n “The pills I have to take for the job can be addictive,” he said. “I think about them when I’m at home. I think of them when at work. I want more, even though my job says I shouldn’t.”\n “That’s not right. You should talk to labor inspectors. You shouldn’t have to leave your job over conditions like that. They should make the job safer.”\n He found another empty beside the sofa and put it on the table. Her apartment was a study of her sickness. Like seashells and pottery, glass left traces that archaeologists could reconstruct into past lives.\n “It’s not the job, Mom. There are people who are good at resisting the temptation. I might not be one of them. I should have told them about this a long time ago. I didn’t. I wanted the job. I wanted to be one of the jumpers strong enough control it.”\n “You are!” she said, gripping his arm tight.\n “I just cleaned up the mess of another jumper who thought he could control the urges.”\n “You’re not him. My boy is better.” Her anger spilled out as tears on reddening cheeks. Her voice grew loud and accusing. “I didn’t raise you to be afraid!”\n She rose. He followed. He couldn’t reach her now, through her armor-hard pride. She wouldn’t hear that she was sick.\n “I haven’t been as attentive a son as I should. The evenings and weekends I gave to the project . . . some of those were yours.”\n “That’s what a son does! He works hard. Don’t worry about me!” She waved an arm emphatically, upsetting her balance and catching herself on the window as firecrackers popped in the street below. Happy popping. Delighted popping.\n “I’ve been worried about you, Mom. This morning I found you on the kitchen floor. I don’t know how long you’d been there.”\n “No, you didn’t!”\n “A good son would have taken care of his mother right away, and not worried more about his job.”\n “I’ll take myself to the doctor!”\n He stepped closer.\n “We didn’t mean to, but we grew apart. I want to know you again. Know you really.”\n Anger still reddened her neck and cheeks.\n “I’ll get another job. Maybe a better one. It won’t take long.”\n He came close and put a hand on each shoulder. This intemperate, furious stranger seemed fragile and small and it would have been such a relief to back away, to open the icon of the mother preserved in amber, petrified in glass.\n “I miss you,” he said.\n After leaving molecular biology, Derek Künsken worked with street kids in Central America before finding himself in the Canadian foreign service. He now writes science fiction in Gatineau, Quebec. His space opera heist novels The Quantum Magician and The Quantum Garden were published by Solaris Books. The first was a finalist for the Aurora, the Locus and the Chinese Nebula Awards. Solaris will also be releasing his \"Godfather in the clouds of Venus\" novel The House of Styx in August, 2020. He also writes a fun girl-jetpack-Flash Gordon adventure comic called Briarworld at Webtoons.com."}