{"fingerprint": "8gy8wooL/er39BqkTGi5ifEUAOg=", "sitename": "Clarkesworld Magazine", "title": "Shepherds by Greg Kurzawa", "author": "Greg Kurzawa", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kurzawa_08_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Shepherds by Greg Kurzawa", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4830 words, short story\n Shepherds\n The lioness ambushed Abel’s flock as he herded them down from the high pastures. Dropping soundlessly from a rocky ledge along the sheep path, she landed on a lamb not six months old. The flock scattered. Turning to confront Abel, the beast rose to her hind legs and opened her claws. Her ears lie flat, her tail thrashed. From her mouth hung the lamb, scrawny legs kicking.\n The first swing of Abel’s heavy crook caught the lioness low on a hind leg. She dropped back down to her forelegs to keep from toppling, her crippled limb drawn tightly up. A growl rose in her throat, but she did not release the lamb. Abel meant his second blow for her skull, but she caught the shaft of his crook with her clawed right hand. Abel pulled, and the lioness pulled back, nearly dragging him off his feet. He shoved the crook toward her, then pulled again as she rebalanced, bringing her stumbling forward. When she dropped the crook to catch herself, Abel thrust, penetrating her low in the gut. She scrabbled for purchase on the rocky path as he drove her back, finally pinning her to the rocks by the meat of her own flank.\n At last she bared her fangs to shriek, and the lamb fell in an awkward heap.\n With his free hand, Abel slipped the elk-bone cudgel from his belt just as the lioness broke the shaft of the crook with one downswing of her heavy arm. He stepped in to interrupt her lunge, and one blow from the cudgel caved the side of her skull. She faltered, head dragging, but too full of hate to die so suddenly.\n She shrieked again when Abel seized a ragged ear and twisted her head to the side, exposing her ruined face. Her slitted yellow eyes bulged at his raised cudgel. She lifted an arm as though to fend him off, and howled, “No!”\n Abel’s first blow silenced her; his second finished it.\n Discarding the broken crook, Abel stood over the dead lioness and the wreck of her victim. The lamb would die—there was no helping that. He knelt to smooth the bloodied fleece, and to offer what comfort he could. By the time the lamb died, the bravest of his rams had begun a hesitant return. Weary already, Abel drew his knife and pulled the lioness closer to him by her scruff. Where there was one, there were many; rebuke was necessary, lest they think him weak.\n The sheep kept their distance while Abel worked. He sliced the tongue from her mouth and the ears from her head. He removed liver, heart, and hands. These things he scattered across the path, a warning to the other abominations on the mountain that this shepherd was not too old yet to defend his flock.\n When Abel coughed—which was often, and for exhausting stretches—blood laced his sputum. He coughed more than usual that night by his fire in the cedar grove, and spat more blood than the day before. Between fits, he drank steaming broth from a wooden bowl.\n There were days, Abel remembered, when he would not have lost the lamb to the lioness, or to any other aberration. Days when no beast could take his crook from him. In those days, his first blow killed.\n These days, he couldn’t still the shaking in his hands.\n Abel considered those hands, a text of overlapping scars. Testament to his life on the mountain. He looked to the darkening heavens, where once he had seen infinite stars. Only the brightest shone for him now—no fault of theirs. He thought of the lioness he had killed, and of the other beasts with which he shared the mountains. They were braver than they had once been, and every season more capable.\n “You’re an old man,” Abel said to his fire. “You can’t stay here anymore.”\n And so it was that Abel decided to quit the mountain, and to go before the snows came. He did not think he would see another spring. He knew his time was on him, and had no illusions of prolonging his life. He only wanted to find a place where he would not have to suffer being devoured by beasts.\n Emptying his bowl into the fire, Abel reflected on the fact that he’d not seen another of his kind in a long while. He wondered if there would be anyone left to welcome him back.\n Abel took his time fashioning a new crook from a cedar limb. During that time, he decided to descend eastward. It wasn’t that he hoped to find any of the old roads that crossed those lands, or that he thought the cities—unlike those on the western plains—might still be populated. He knew only that he preferred to travel toward the rising sun, rather than away from it. The next morning he rolled his few possessions into a sheepskin blanket, which he secured across his back. Down from the high pastures and into the foothills he herded the flock, where they wandered for days. Every morning he collected rotten wood from rivulets and gullies, and burned it in the evenings. With his pillar of smoke roiling into the blue-black void, he leaned on his crook to watch the desolate plain. As night came, he imagined the clustered towers and sweeping bridges of ancient and abandoned cities far in the distance.\n “Hello,” he said to the fire, but his voice felt atrophied. He hawked and spat. “Hello,” he tried again. “My name is Abel. This is my flock.” The words were clumsy on his tongue. “They are everything I own. They can be yours. If only you let me die in your company.”\n More practice was needed, he felt, if he was to sound human.\n All night he conversed with the fire.\n Abel slaughtered a lamb the next morning, and made a stew over his guttering fire.\n The next day a bearded stranger came up from the plains, making no effort to conceal himself. Leaning on his crook beside his smoking fire, Abel watched him pick his way barefooted up the rocky slope in plain view. At a respectful distance, the stranger stopped to lean on a branch he’d been using as a walking stick. From there, he squinted up toward Abel and called, “Where from?”\n Abel touched his chest. “My name is Abel.” He swept an arm to indicate the three dozen sheep grazing among the boulders of the slope. “This is my flock.”\n The stranger contemplated the placid sheep. “And where did you come from, Abel? With your flock.”\n “Through the mountains.”\n The stranger shifted his squint up the slope—expecting more, Abel knew. But everything he’d planned to say before, now seemed ridiculous.\n “We saw your smoke,” the stranger prompted.\n “I didn’t want to descend without permission.”\n “You plan to stay?”\n Abel looked to the pot over his fire, then back. “Are you hungry?”\n Not long later, Abel had prepared flatbread on a rock, and was serving stew into shallow wooden bowls. He passed the first to the stranger, who called himself Levi. Accepting the bowl, Levi sniffed the contents before selecting a chunk of meat with finger and thumb. “How long have you been up there?” Levi asked before pushing the meat through his beard.\n “There were roads when I last came down,” Abel said.\n “There are still roads,” Levi said. He nodded south. “Some of the widest ones near the ruins aren’t overgrown yet.”\n Abel took his bowl and a round of flatbread, then crouched where he could watch Levi. They ate in silence for a little while, then Levi asked, “Are there still people on the other side of the range?”\n “Hardly.” Abel gestured with his bowl at the emptiness of the plains. “Like this. There are some in the mountains, but they’re not right in the head.”\n “Used to be, ten—fifteen years ago, there were settlements all up and down these foothills,” Levi said. “People came out of the plains, and some—” he aimed his chin at Abel, “like you, through the mountains. They called the biggest settlement Bastion. Built it up nice, too.” He snorted, perhaps at the futility of building, or that of naming. “It’s all rubble now.”\n Abel drank from his bowl, then wiped a sleeve across his mouth. “How many of you are left?”\n “About eighty. Less every year.”\n “No one comes out of the city?”\n “The ruins? Nothing comes out of the ruins. Not since long before I was made. You still find scavengers ranging about. They like the cities, but they’re as corrupt as the ones up in the mountains. Every one of them named Adam.”\n Abel nodded toward the plains. “What about out there?”\n “Caravans used to come up the old roads, but we haven’t seen one in a decade. If there’s anyone still out there, they don’t bother with us anymore.”\n Abel tore a chunk of flatbread to mop the dregs of his stew. When he looked up, Levi was watching him openly. “Are you human?”\n Abel lowered his bowl.\n “I’m sorry,” Levi said. “You look it. It’s just . . . ” he shrugged.\n “I’m dying,” Abel said, surprising himself with the sudden confession.\n As though to hide embarrassment, Levi looked to the plains. “You want the nunnery, then,” he said. “They’ve got an old sister down there. They say she’s over three hundred.”\n “Who says?”\n “The sisters. Everyone.”\n “You’ve seen her?”\n “No, but the sisters have taken to calling her Eve. If she lasts another fifty years I might start to believe it.” He dipped bread into bowl and ate. “That’s where all the women are—the nunnery. They come out, some of them—when they’re ready. But mostly they wait for us to come to them.” He looked at Abel with a measuring stare. “I can take you there. Tomorrow, if you want.”\n Abel started to reply, but was interrupted by a fit of coughing. His hand was bloodied when it subsided, and he wiped it in the grass. “Today?” he asked. “You can chose any one of my flock to keep: ram, ewe, or lamb.”\n Levi emptied his bowl and brushed his hands. “Or today.”\n For the remainder of that day they traversed the foothills on winding game trails and crooked paths. It wasn’t until the moon rose swollen and yellow that Levi halted to direct Abel’s attention into the plains. Looking down Levi’s extended arm into the middle distance, Abel saw what at first seemed a single squat building wrapped loosely around a central courtyard. Squinting to clarify his vision, he discovered that it was not one building, but a compound of various irregular structures connected by enclosed breezeways, rough additions, and mismatched roofs.\n “The nunnery,” Levi said. He claimed his lamb, and would go no closer.\n The convent’s well was set in damp flagstones at the center of the courtyard, and it was there that Abel waited the night. With his back to the well and his crook across his thighs, he sat facing the doors and slept not at all. And when the doors of the convent swung open with the rising sun, Abel pushed to his feet with the help of his crook to be noticed by the austere sister who emerged. Standing at the threshold, feet bare beneath her habit, she seemed unsurprised to observe her courtyard occupied by a flock of milling sheep. Striding across the courtyard, she halted a few paces from Abel, hands deep in her sleeves.\n “These animals are yours,” she said, less a question than an accusation.\n “It’s a good flock,” Abel said. “They’re all of them pure.”\n Her eyes passed over the sheep, and when her blunt gaze returned to Abel, she asked, “What do you want, shepherd?”\n “They’re a gift,” Abel said. “For you. For the convent.”\n The sister peered at him more intently. “And is the shepherd pure like his flock?”\n “I am, Sister.”\n “So you say.” She extended an impatient hand.\n When Abel offered his own hands to her, palms up, she seized them and pulled them closer to her. Her examination was quick and practiced. After she had studied his palms, she turned his hands over to inspect the nails, then dropped them. “Open your mouth,” she commanded.\n Abel obeyed, tilting back his head.\n She was a long time counting his teeth.\n “Shall I undress, Sister?”\n “Not yet,” she answered curtly. Taking his jaw in hand, she turned his face to either side, then peered into his eyes as though something were to be found there. With what seemed a begrudging satisfaction, she released him and started back toward the convent. “Follow me,” she said over a shoulder. “Sister Eve will want to see you.”\n Watching the sister walk away, Abel’s resolve faltered, and he found that he wished only to stay with his flock in the courtyard next to the well, where it was safe. As the sister mounted the steps to the convent doors, she turned to see him unmoving.\n Turning, she called, “She won’t come to you. Not out here. Not among your animals.”\n When Abel still didn’t move, the sister placed one hand on the banister and took one step back down. Some of her abruptness faded, and she seemed more forgiving, or at least kinder. “You came here freely,” she reminded him. “Yes?”\n “Yes, Sister.”\n “And you may leave freely. Now—or at any time.”\n Though uncertain of that, Abel crossed the yard and started up the stairs. Dying among the sisters was better than what would become of him if he went back to the mountains. As he passed the sister, she stopped him with a hand on his arm, and tapped his crook with light fingers. “You may leave this outside.”\n The convent was a place of well-swept spaces and dark corridors. Following the sister’s swishing habit, Abel found himself blinded in turn by light and darkness as they passed through bands of sunlight falling through thin windows. He knew there were other women; he heard muted laughter through closed doors, and spotted them clustered at the ends of corridors. He didn’t mean to stare, but he’d seen so few in his life.\n The sister abandoned him in a room partitioned by tattered linens draped from the ceiling. Peeking behind them, Abel found only a second door, narrower than the one he had passed through. On his side of the room was one window facing the eastern plains. Through this opening he fit an arm and part of his shoulder, but could go no farther. Should things go wrong, it would offer no egress. When the second door opened, Abel retracted his arm and turned to see the partitions breathing in a draft.\n “You are the one who brought animals to my home,” said a tired feminine voice.\n “A gift,” Abel said. “All of them are pure.”\n “A gift?” Slow currents dragged the sheets as the unseen speaker moved behind them. “You think there is something here to be bargained for, that you bring gifts?”\n “No, Sister. I just . . . they’ll need care when I’m gone.”\n “Then you should have left them in the settlement. We have our own flocks to tend. And pure or not, we keep our beasts outside the walls.”\n “Forgive me,” Abel stammered. “I saw no animals. I thought—” He stopped himself, suddenly sure that nothing he thought would matter to the sisters, certainly not this one. He frowned toward the narrow window.\n “Where did you come from, shepherd? Not from the settlement. I know all the men from the settlement.”\n “Through the mountains, Sister.”\n “Ah,” she breathed. “The mountains. One must be cautious of things which come from the mountains. And where are you going, shepherd, that you would abandon your flock to a convent of sisters?”\n Abel hesitated. It might not be too late to leave.\n “‘Even the fool seems wise when he shuts his mouth,’” the sister said. “Is that not so, shepherd? You would do well to remember that we already know why you came. I only want to hear you say it.”\n “I’m sick,” Abel told her. “Dying.”\n The sister’s cruel laughter sent ripples through the sheeting. “A waste of words, to tell me that,” she said. “Sick is the only kind of man there is. And dying the only kind that comes here. Trust me, shepherd, we smell it on you. We smelled you in the hills, and we smelled you last night by our well. Even over the stink of your animals, we smelled you. But sickness is your condition, shepherd. Not your desire. Why are you here?”\n Abel remembered the lioness on the mountain, her hands so nearly like his. “There are many abominations in the mountains, Sister. I would not add to their numbers.”\n The curtains huffed outward in agitation. “Men,” the sister scoffed. “You only think you know what you want. When your time comes your minds fail you, as well as your bodies. You grow restless.” She drew a sudden, luxurious breath. “You reek. But we women . . . don’t you remember what we become, shepherd, when our time is on us?”\n “No, Sister. I—”\n “We get hungry.”\n A vague, swollen shape pressed to the fabric, rippling upwards, creating an impression entirely wrong for one frail sister. It might only have been a draft. “You don’t know hunger like this,” she said. “You don’t know hunger like mine.”\n Too afraid to turn his back on the partition, Abel backed away. For the first time since entering the convent he cursed himself for leaving his crook outside, though he didn’t believe it would be of any use now.\n But as rapidly as she had risen up, the sister subsided. “No,” she declared in a voice deeper than it had been before. “I am only human . . . like you. Subject to the desires of the flesh. But I have not yet been tempted enough by any man to stand before me. Is this why you came, shepherd? To tempt me?”\n The idea shocked Abel. “No, Sister. Never.”\n “How many years have you lived?”\n “I don’t remember.”\n “No,” she agreed. “You would not be here if you did.”\n The sister then pulled a slow, savoring breath. “You’re afraid,” she said.\n “Afraid of you, Sister,” Abel admitted. “And afraid to die.”\n “All men are afraid to die,” the sister said, not unkindly. “Which is why you all seek us out, we who move our race toward its true home. We whose burden it is to ensure the purity of our generations. We who shape the final two who will stand before the god on the last day, not as a man and woman, but as Man and Woman. As vessels to carry us all to Paradise in the marrow of their bones. As long as they are not found wanting—as long as they are pure.”\n “I know the stories of Paradise,” Abel said. “But you must forgive me, Sister—I believe none of them.”\n “Yet here you stand. In a convent.”\n “I was wrong to come. If you allow it, I’ll go.”\n “Allow it?” the sister said. “Tell me, shepherd: when the wolf falls upon your flock, do you not rise up to fight, whatever the cost?”\n “I do, Sister,” Abel answered.\n “And when a lamb strays, do you not go forth and bring it back?”\n “I do, Sister.”\n There was silence for a little while, and when the sister spoke next, her voice had turned weary. “Where would you go, if not here?” she asked. “Back to the mountains? To the abominations waiting to devour you?”\n Abel looked to the thin window. “My flock—”\n “Will be cared for,” the sister told him. “For I, too, am a shepherd.”\n Abel heard the thin door on the Sister’s side of the partition open. “You fear needlessly,” she said in parting. “This is not a place of death, but of consummation. Fortunately for you, there is one here who will have you. To her you will cleave, and in her you will be sheltered. She is the one who will show you what you’ve come so far seeking, but are too afraid to ask for.”\n Abel was led to another empty room, where the sister to whom he had been given was already waiting. Like the rest of them, she wore a plain brown habit, but on her gaunt frame it hung as though on a rack of bones. Her hood was pushed back to reveal a shaved scalp and sallow complexion. One hand covering her mouth, the famished sister faced him eagerly.\n “You’re the shepherd,” she said through skeletal fingers.\n But it was the tapestry on the wall that captured Abel’s attention. Looking past her, he marveled at creatures large and small, things he’d never imagined. Here was all of Paradise in faded thread. And at its center, the hub around which all else revolved: a man and a woman. He stepped closer, leaning forward to see such tiny figures and what surrounded them.\n Following his eyes, the sister touched the weave. “Children,” she said.\n Abel pulled back, startled to realize how near to her he had come. Moving closer, she slipped an arm possessively through his, and Abel felt a terrible heat burning through her habit. Lightly, she touched the two figures at the center of the tapestry, who stood beside a tree from which vines draped to the ground. “Adam was the first father,” she explained. “And Eve the first mother.” Her fingers shifted to the smaller images around them. “They made little ones. Children. And from those children—” she waved her hand in the air, “all of this. From two we came; to two we shall return.”\n Abel was conscious of her eyes on him as he glanced down. Now that her hand was away from her mouth, she kept her lips pressed tightly together. Clutching his arm, she pulled his attention to another scene, showing him a child emerging from a bloated and suffering woman. “You see?” she said. “We were once capable of such things. Just like the animals. Just like your sheep.”\n Abel averted his eyes, disgusted. “Humans are not animals.”\n “No?”\n “There are no children,” Abel said. “There never were.”\n “Never? Then how did we get here?”\n “Not like this.”\n The sister smiled at the corners of her mouth. “If you could make a child, what name would you give it?”\n “I can’t make a child,” Abel said.\n “But if we could?”\n “Adam,” Abel answered. “As my father named me.”\n “A hopeful name,” the sister said with approval.\n “He would change it. As I did.”\n Without releasing her hold on his arm, the sister turned toward him, and her hands slid down his arm. Lifting his hand in both of hers, she pressed her cheek into his palm. Her skin felt taut and feverish. Eyes closed, she turned her face into his palm.\n Abel jerked his hand back when the sister bit him. Angrily, he shoved her away. He raised a hand to strike her—and would have—but that she cowered, face hidden and fingers once more covering her mouth. Abel looked at his hand. The double row of punctures left by her teeth on the heel of his palm were very small, and perfectly spaced.\n Abel found his crook exactly where he had left it beside the door, and seized it with relief. Rushing down the steps, he stumbled at the last and spilled into the courtyard. Even as he pushed up, he was whistling quick and sharp for his flock. The sheep hurried over themselves in their haste to follow their shepherd from the convent.\n The poison took hold beside a shallow creekbed in the long light of evening. Struggling for every breath, Abel stopped to stare into the setting sun, unable to go on. His mouth had gone dry, and his lips cracked with fever. His flock milled round him stupidly, bleating as he shivered. When his crook slipped from numb fingers, he hadn’t the strength to retrieve it. Not long later he sat heavily, slumped forward. Because they were there in his lap, he stared at his trembling hands—at the purple bruise from which the sister’s poison spread.\n He had enough strength to lift his head when she approached from the west, her habit rustling through the long grass. She knelt in front of him to measure his condition, and he offered no resistance when she took his shoulders and pushed him gently to his back. And there were the brightest of the stars, dim and quivering. He only wished he could see more of them. Leaning over him, the sister felt his forehead and caressed his cheek. She smiled for him, showing many sharp teeth.\n “I’m not mad that you ran,” she comforted him. “Men always run.”\n He wanted to speak, but she sealed his lips with a hot finger.\n She removed his clothes and folded them into a neat pile. She had brought a skin of water with her, and a rag, and used these to wash his body with great care. Her hands were kind, and she left no part of him unclean. This task complete, she produced two soft cords and bound him at the knees and ankles. Then she shrugged out of her habit, revealing a flushed and emaciated frame. She knelt by his feet and clasped them in her hands, head lowered as though to kiss his soles.\n “You mustn’t struggle,” she instructed him. “You’ll only hurt us.”\n But he did, and his resistance caused them both suffering. At his waist she found it necessary to crack his wrists to keep him from injuring her. Bit by bit, she forced him into herself with a starved determination. It took a long time, and he begged only a little at the last, just before his strength failed him.\n When it was done, she slept in the crushed grass there beside the creek.\n After two days beneath the open sky her distended skin began to harden. Bones bowed and flexed; organs surrendered their shape. Waking, she dragged herself toward softer ground to dig herself into a shallow pit with hands that no longer felt like her own. She pried rocks from the clay, and stacked them over her swollen body. Their weight pressed her down, and the chill mud sapped her warmth. Her thoughts slowed, and she gave them up readily to dissolve into the bloated shell of her old shape. There, she joined the new life already stirring in the muck.\n Naked and alone, Adam shouted into the darkness at the edge of the prairie. At first, he was frightened by the unfamiliarity of his own voice. As a result, his noises were timid. But there was strength in his chest, and in his back and thighs; and when it woke to him he was reassured. Arms thrown open to the vivid stars, he celebrated the fact of himself with triumphant whoops and wordless cries.\n When he had shouted his throat raw, he returned to stand over the shallow grave from which he had risen. At the bottom lay the offal of his birthing: the desiccated husk that had been his mother, the partially digested bones of his father. Looking on these things, he remembered consuming, and being consumed. He remembered the digging of the grave, and how hard it had been to breathe under so many rocks.\n “I will never forget,” he swore to the grave.\n Then he wondered if his father had once sworn the same.\n “I am not my father,” young Adam declared.\n By moonlight he bathed in the creek, marveling at the unblemished perfection of his skin. His hands were broad and strong, uncalloused from years of wielding the shepherd’s crook. He found the clothing his mother had folded and laid aside: the shepherd’s cassock, as well as her own habit. He made a fire and wondered whether he would keep the name his father had wanted for him—and almost immediately decided he would. It was, he remembered saying, a hopeful name—better for a son than for a father. When that was decided, he wondered where he would go. He would not return to the mountains from which he had come, nor to the convent for his sisters to fawn over. His way lie to the east, into the plains. He wanted the rising sun in his face.\n He slept close to the fire that night, his mother’s habit his only covering. In the morning, he kicked dust over the ashes and filled his grave with rocks. Dressed in his father’s cassock, he took up the shepherd’s crook and struck east. He did not know where he would go, or what he would find there, having resolved only to keep the convent forever behind him. He called for his sheep as he went. They were out there somewhere—not terribly far. They would be glad to see him, he suspected. They would know him."}