{"fingerprint": "oXKG5zeaI1s3jkNtCLC9hwo6/K4=", "sitename": "Clarkesworld Magazine", "title": "Vacant Spaces by Greg Kurzawa", "author": "Greg Kurzawa", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/kurzawa_02_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Vacant Spaces by Greg Kurzawa", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4950 words, short story\n Vacant Spaces\n Shepard ducked into the tug’s four-man cockpit, wincing at the strain on his knees. His assigned jockey for the day’s salvage was already hunched over his pre-flight checks at the console. Glancing up at Shepard’s entrance, he made a disappointed grunt before resuming his work.\n “Fantastic,” the jockey said. “I get the geezer.”\n “Hello, Caine,” Shepard said. “How deep today?”\n “You wouldn’t understand.”\n A jockey’s usual sentiment.\n Behind the chair, Shepard placed his hands in the small of his back and stretched. Soon enough, Caine folded up his charts and spun around. For a long moment he watched Shepard at his calisthenics. He asked, “You’re not going to complain about your knees again, are you?”\n “My knees are fine,” Shepard lied.\n “Because you did before. It was a lot of complaining.” He watched a moment more before shaking his head. “You’re too old for this.”\n “Better than obsolete,” Shepard said. “Don’t these things fly themselves?”\n “That’s what all the graybeards say.”\n Under Caine’s observation, Shepard leaned first to one side, then the other.\n “Are you done now?” Caine asked. “Can you be done? Because there’s work to do. You’re reminding me of that thing your dad always said.”\n “‘Do your work?’”\n “No, the other one.”\n “‘Don’t be stupid?’“\n Caine tapped his nose. “A wise man, your father.”\n Although mostly engine, the tug crawled from her dock as though incapable of mustering speed. She was an ugly sight, her flanks blistered from high-temperature encounters with unstable artifacts. She was scored with heat discoloration and pitted with impact scars. She had been a shuttle in a past life, before being retrofitted with scavenged alien engines and put to work hauling junk. These bulbous additions had been bolted on aft, and accounted for two-thirds of her mass. She looked unimpressive, but she hauled wreckage.\n Eighty kilometers above Earth’s moon, Caine and Shepard abandoned the cockpit for the tug’s passenger cabin. All but two facing rows of seats had been removed to make room for the biology of the engines. Like the roots of a tree, piping and conduits ran from floor to ceiling and all along the bulkheads. From inside, it seemed the engines had not so much been bolted to the tug, as grown into it. When stoked, they would sweat something like a mucus-blood mixture, which stank like burning fat, and sizzled on the floor.\n Strapping in opposite one another, Caine and Shepard made themselves as comfortable as possible in the limited space. For a little while, the only sound was the heating.\n “What’s it like to be you?” Caine asked with a shudder. “So old.”\n Shepard craned his neck toward the cockpit. “Did you forget to press start?”\n “Patience,” Caine admonished. “They’re warming.”\n Relaxing into the headrest, Shepard gazed at the ceiling. “You should check.”\n Reaching back, Caine banged the conduits over his head with a fist.\n Shepard winced. “That’s not—”\n The engines came alive with a slow lurch. Turbines began to spin in lazy revolutions, ramping up with no apparent sense of urgency.\n Caine grinned. “That’s why you need me.”\n As the reactors warmed and the turbines gained speed, a vibration crept over the edges of everything, shivering hard lines to obscurity and numbing Shepard’s extremities. Then the banging began, and the violence of it threatened to shake the little tug apart. Across from Shepard, Caine leaned forward to vomit expertly into the bucket between his feet. He came up grinning, his teeth red, blood coursing from both nostrils.\n Shepard mimed wiping his mouth.\n The jockey touched his lips and blinked at his bloody fingers. Then he bent forward and vomited again.\n The engines disengaged with a sudden concussion, jarring Shepard to the bones. Immediately afterward, the banging ceased, and the turbines began their slow unwinding.\n Shepard pressed the heels of his hands to his throbbing eyes. He felt as though he’d been ripped open and stuffed with tar. He felt sewn up with bootlaces. Tasting blood, he wondered if his teeth were cracked. Across from him, Caine remained leaning over the bucket, his mirth beaten out of him.\n Shepard tilted his head back and closed his eyes against waves of nausea. Around him, the tug creaked and groaned, as though relaxing into unfamiliar pressures. Only when the engines had fallen silent did Shepard allow himself to breathe deeply. Across from him, Caine seemed engrossed in the act of drooling blood into his bucket.\n Shrugging off his harness, Shepard pushed to his feet and went to the jockey. “Hey,” he said, nudging Caine’s shoulder.\n “Fuuuuu,” the jockey complained.\n Shepard put a hand to Caine’s forehead and lifted. The jockey gaped up at him with a vacant, startled expression.\n “Sngkaaa,” Caine muttered. Seemingly surprised by his own voice, he blinked rapidly, then sprayed blood on Shepard with a violent sneeze.\n “Damn,” Shepard replied, and let Caine’s head drop.\n In the cockpit, he switched on the external cameras. The array of monitors came alive with a dozen murky viewpoints of local space, all of them the same. Drifting through the exterior floods were thick flakes of what appeared to be snow, but which Shepard knew to be hydrogen. By this, he knew they had indeed traveled distances that he failed to understand. He flipped on the closed-circuit intercom while watching the hydrogen snow obscure his monitors. “Hello,” he said into the microphone. He heard his own voice ringing from the speakers throughout the tug. “We’ve arrived.”\n He paused to listen for a response. Thinking he might have heard a voice in the static, he raised the volume and leaned closer. “Hello,” he repeated into the microphone. “Hello?”\n He searched the whole tug. Everywhere he went felt as though someone had stepped out the moment before. He checked the stateroom, in which there were two bunks. He flipped the lights on and off rapidly, as though to wake a late sleeper. “Hello?” he said. “We’re here.”\n He stood in front of the mirror in the head, and through it peered into the corners. While doing this, the power flickered, and a tiny burst of static emerged from the overhead speaker. He looked up, and his own voice came through dim and crackling.\n “Hello?” it said. “We’re here.”\n Shepard passed Caine on his return to the cockpit. Still trapped in his harness, the jockey made a pathetic grab for him. “Nnga!” he said.\n “Patience,” Shepard soothed him.\n When he got to the cockpit, no one was there.\n Shepard sat with Caine in the passenger cabin, which reeked of vomit and auto-release disinfectant. The jockey reminded him of a newborn, baffled by its own flailing. Nothing worked like it was supposed to; everything had a mind of its own. His head rolled, and his eyes widened at every new thing in perpetual astonishment.\n Leaning forward, Shepard patted Caine’s knee. “You’re going to be fine,” he said.\n In fact, Shepard believed Caine would die. Such misfortunes were an accepted occupational hazard. They’d all watched the videos, all signed the papers.\n In a little while Caine stopped fighting with his harness, and took on a look of stern concentration. A dark smell pervaded the room, bold and foul.\n “You’ve shit yourself, haven’t you?” Shepard said.\n “Sssmmn,” Caine said dreamily. “Mmnaaaah.”\n Shepard braced his hands on his thighs as though to rise. “Here’s what we do,” he decided. “I’m going to leave you as you are, because you seem mostly comfortable. Are you comfortable?”\n Caine arched his back and rolled his head. He threw his free arm up in a grand, incomprehensible gesture.\n “Good,” Shepard said. “I’m going to go ahead and find the derelict and start the procedures without you. I’ll be—”\n Caine kicked out his legs and gave a wordless shout. It was clear to Shepard that he disapproved, but his arms and legs weren’t cooperating. The jockey slammed his head against the headrest, mouth gaping.\n “Hey now,” Shepard said. “Go easy.”\n When the fit subsided, Shepard continued. “I’ll be careful with the tug, I promise. After the derelict’s secure we’ll see about getting home. Okay?”\n “Mmfaugh!”\n “I know,” Shepard sympathized. “But I can’t do it. You’d only hurt yourself.”\n Caine banged his head again, straining against the confining harness.\n “It really is for the best,” Shepard said.\n Minutes later, Shepard had settled into the cockpit and was nosing the tug through the windless blizzard. He couldn’t see the derelict, but he knew it was close. Then it loomed in one of the monitors like the peak of a black mountain. The tug reported it as roughly wedge shaped, one hundred and thirty-seven meters long by twenty-two wide. Impressive, but not too much for the tug to manhandle.\n Having found his target, Shepard initiated a sequence of activities that, for the next twelve hours, involved him hardly at all. A swarm of softball-sized drones poured from the tug to descend on the derelict, intent on inspecting every square centimeter of her hull. Any evidence of life within—or breach without—and it was a hard abort. Either required teams with military-grade skills.\n Shepard relaxed into his chair to monitor the continuous feeds from the drones. A dozen angles of the derelict drifted by on the bank of screens, a landscape of sweeping features, protrusions, and the sudden, irregular angles of alien armaments. The husk showed no signs of life. Things so deep seldom did.\n “Hello?” said a crackling voice from the bank of monitors. The image of drifting hydrogen overlaid a version of his own face peering through at him. “Are you speaking now? Where have you been?”\n “Here the whole time,” Shepard said. “Is Caine with you?”\n “Somewhere,” his image said.\n “Something happened to him,” Shepard said.\n “Something?”\n “It looks bad.”\n The image twisted and rolled, giving way to static before solidifying again. “ . . . here,” it said.\n Shepard squinted at the screen. “What?”\n “He’s fine. He says to tell you that you look fatter. Older, too.”\n “Tell him something happened to him here. Tell him—”\n “You tell him.”\n The screen rolled, struggling with waves of persistent static. But when it stopped, there were only hydrogen flakes drifting over alien architecture. Shepard waited. Though he heard echoes of echoes and incomprehensible whispers through the air ducts and the intercom, no one reemerged.\n Hearing a voice in the cabin, Shepard went back to find Caine standing over himself. The jockey had fallen asleep leaning forward in the harness. The Caine that stood over him looked more disappointed than anything. Shepard kept his distance until Caine noticed him.\n The jockey pointed at the limp form in the harness. “This is terrible,” he said. His voice emerged from the ship’s speakers rather than his mouth. It was out of sync with the rest of him, which broke apart when looked at sideways.\n Shepard agreed: terrible.\n Caine gestured at himself in disgust. “Would you just look at this shit? What now? I can’t go back like this. Without a body. . . ” He gestured again, this time kicking his own foot. “Such shit,” he said.\n When Shepard didn’t reply, Caine looked in his direction, but not directly at him. “Are you still in here?”\n “Here,” Shepard said. But even after he waved a hand the jockey couldn’t seem to find him.\n Caine raised his voice, as though addressing someone in another room. “You could’ve at least moved me to a bunk.”\n “You shit yourself, Caine.”\n The jockey looked sharply in a direction that was not quite Shepard’s. “What?”\n “You’re fine in the harness.”\n Caine adjusted his gaze, but came no closer to finding Shepard. “What did you call me?”\n Shepard sighed and left the jockey alone with himself. It was easier to watch the slow progress of the derelict’s inspection than to argue with ghosts. When he returned forty-five minutes later, there was only one Caine, snoring contentedly and smelling like an open latrine. Shepard left him in his harness and retired to the stateroom. He locked the door behind him, though he knew it wouldn’t keep anything out, not this far from home.\n Because there was little else to do, Shepard slept. He hadn’t been at it long when he woke to someone sitting on the edge of his bed. The speaker in the ceiling hissed gently, and his own voice came through garbled and indistinct, as though filtered through a fathom of water.\n “I have a theory,” his voice said.\n Shepard threw an arm over his forehead and stared at the ceiling. “It’s my theory, too,” he reminded himself.\n “We have a theory then. It’s a decent theory.”\n Shepard didn’t feel he needed to vocalize his agreement.\n “It’s a matter of pressure,” his ghost continued. “Not physical pressure, like air or water. A different kind. Out here there’s not enough pressure to keep a body and soul together. It’s like bringing one of those crustaceans up from a deep-sea trench.”\n “Except they die,” Shepard said.\n “They die,” Shepard nodded in agreement. “But we don’t die. We get . . . this.” He opened his arms as though presenting himself for exhibition.\n “It makes sense,” Shepard said.\n “It does. But it also makes you wonder. If I can live without you, and you can live without me. . . . ” The ghost looked at Shepard over his shoulder.\n “But we don’t really know that,” Shepard said. “Long term, we don’t know. I might just be a soulless bag of meat remembering how humans are supposed to act. I might forget after a while. And you: you might just be a collection of memories too afraid to let go of the idea of being real. You’ll lose shape after a while.”\n “So we need one another.”\n Shepard shrugged. “It’s just a theory.”\n The Shepard sitting on the edge of the bed continued to stare down at the Shepard lying on his back. He said, “Caine’s right: you do look old.”\n Shepard turned to the wall.\n “We have a problem,” his ghost said a little later.\n “What problem?”\n “Caine’s dead.”\n Shepard looked over his shoulder. “You’re sure?”\n The ghost gave him a pointed stare.\n “Okay,” Shepard conceded. “How bad is it?”\n “He doesn’t want to go back. I wouldn’t either.”\n “He’s going to cause problems?”\n Shepard shrugged. “He’s just scared.”\n “He’s had a bad day. He’s allowed that.”\n “We need to talk to him.”\n Shepard got out of bed and stepped through the narrow door to the head. “You need to talk to him.” When he came back, still zipping up, the stateroom was empty.\n In the cabin he found Caine slumped in his harness, gaping at the ceiling while the little auto-injectors farted disinfectant from the corners.\n “Caine,” he said, as though to wake him. “Hey Caine.”\n He listened for any sound from the internal coms, then decided the wisest thing was to leave the corpse alone. Stepping into the cockpit to check the monitors, he saw an estimated nine hours remaining before completion of the integrity check. Had no one died, it would have fallen to Caine to set the course for home. Not that Shepard couldn’t—he’d been trained. It was just that the jockey had adopted a sense of ownership over the physics, and didn’t like to see anyone else handling them. The physics, he’d enjoyed saying, belonged to him. Now that the jockey was dead, Shepard hoped he would be willing to relax his possessiveness.\n Shepard sat at the bank of monitors and began to work out the details of the return trip. After a little while, a hazy image struggled to clarify on one the screens.\n “What are you doing?” it asked.\n “Hello, Caine. It’s good to see you.”\n “Is that my physics you’re doing?”\n “Someone’s got to.”\n The image rolled fretfully. When it steadied, Caine’s tone had turned scornful. “—cking longtooth,” it said, completing an insult Shepard hadn’t heard the start of. “What do you know about anything?”\n “I’m just doing my job, Caine.”\n “No. You’re doing my job.”\n “It’s easier than I thought,” Shepard said, and was immediately sorry.\n Caine’s livid response was lost in a burst of static. When the jockey perceived he wasn’t being understood, the intercom crackled, and his voice blared through the tug. “You’re a prick,” it said. “You were always a prick.”\n “I’m sorry, Caine. That was unfair of me.”\n “Unfair? No one says unfair.”\n “Okay, Caine.”\n “Taking us home will kill me.”\n “You’re already dead, Caine.”\n “I’m not fucking dead!” the jockey shrieked.\n “Try to relax,” Shepard advised. “We’re going home, and I know that upsets you. I understand that. But I can’t—”\n “You don’t understand.”\n “I can’t do anything about that now.”\n “You have no idea what this is like,” Caine said.\n “You’re right,” Shepard admitted readily.\n A long silence followed, during which they stared at one another through the monitor. It seemed there was nothing more to say. Then Caine gave a curt nod, as though a decision had been made.\n “Okay,” the jockey said. “If that’s the way you want it.”\n “That’s just the way it is, Caine.”\n “You’re right,” the jockey replied. “You’re always right.”\n Then his screens went dark, and Shepard was left eye to eye with a dim image of himself in the monitor. They had been right, he saw. He did look old. After a moment, he attended to the physics and tried not to dwell on the underhand tactics of slighted ghosts.\n Caine wasn’t gone long. The screens came alive while Shepard was still working, and he only glanced up before continuing. The jockey’s sullen image slid from one screen to the next, looking for the best vantage point from which to judge.\n “You’re doing it wrong,” Caine said.\n Shepard switched off that monitor, only to have Caine leak into another. “Let me help.”\n But Shepard knew better. Covering his work with an arm, he feigned deep concentration and pretended not to have heard. When he looked up at long last, Caine was gone, and the bank of monitors showed only obscure angles of fat snow and alien engineering.\n Shepard had fallen asleep in the jockey’s chair when a gentle chime sounded, and the calming female voice of the tug informed him that the derelict’s integrity was one hundred percent. More importantly: lifeless.\n For twenty minutes, Shepard nosed the tug around the perimeter of the derelict in search of a flat plane. Between an intake valve deep enough to park the tug and a cluster of blocky protrusions, he bumped against the hull and engaged the coupling links. A warm buzz vibrated the hull; the vessels were bound.\n Shepard switched on the intercom. “Homeward,” he announced. Without waiting for a reply, he initiated the return sequence and abandoned the cockpit. Back in the cabin, he settled in opposite Caine’s corpse while the engines struggled sluggishly toward an unknown speed. When they had attained a comfortable scream, he pushed a little deeper into his seat, knowing it would get worse before it got better. Outlines shivered as the engines sang. The air gelled, becoming difficult to breathe. He stretched his mouth wide in an effort to relieve the building pressure.\n And then something new. Something wrong. It manifested as the sound of marbles bouncing in an empty tank. In a matter of seconds, two became twenty, twenty became thousands. Barrels of marbles poured into the rotors. The pitch of the engines took an ugly turn, refusing to quit in the face of this new difficulty.\n Shepard popped the buckles of his harness and leaned forward to stand, but spilled out of his seat instead. Beneath him—all around him—the tug shook in the grip of the laboring engines. Shepard pushed to his feet. If he could get to the deck, if he could abort the return sequence and cut the engines . . . one step toward the cockpit and a monstrous bang kicked his legs from under him.\n He found himself on his back, breathless and gasping for air. A klaxon blared while strobes sprayed emergency lighting across the bulkheads. Somewhere, metal twisted in anguish. The last of the marbles were bouncing away. Shepard rolled to his feet and stumbled toward the cockpit.\n Everything had failed, or was in the process of doing so: internal atmosphere, hull integrity, flight coordination; all of it dying in front of him.\n “Alarm,” reported a soothing female voice.\n Shepard slapped off the audibles, silencing the klaxons. Amber lights raced up and down the deck, screaming for attention.\n “Assessment,” he said to himself in a failing effort to remain calm. “Step one: assessment.”\n “Alarm,” repeated the patient voice.\n “I know,” Shepard said, and directed his attention to the monitors, where reports from the exterior drones were beginning to post. The same drones that had scoured the derelict were now running looping circuits around the tug, relaying information back to the deck. Trying to watch everything at once, Shepard saw his atmosphere venting from a dozen torn seams. He felt empty space creeping in, forcing open rifts with icy fingers even as the auto-sealant blossomed outward like cancerous growths to stanch the hemorrhage. Things were at wrong angles. Other monitors were populating with overlays of the tug, helpfully directing his attention to malfunctioning systems.\n Shepard stood ready to act, but there was nothing for him to do but watch. Struggling to stabilize itself, the tug needed no help from the likes of him. After long moments, lights began winking off, whether from the passing of danger or an awareness of futility, Shepard didn’t know. In time, he realized that the tug would not turn inside out; he would live at least a while longer.\n He sank into the jockey’s chair, face in hands.\n “Alarm,” the gentle female voice reminded him.\n Shepard lifted his head to see what fresh disaster had visited.\n Out there in the blizzard, the derelict had come alive. The drones, with nothing more to report about the state of the tug, had turned their attention elsewhere, and found much of interest in the derelict. Racing up and down her length, they streamed continuous video back to the deck. Running lights underscored aggressive angles and matte black assets. Shepard saw the tug attached to its hull, a sucker-fish latched to the belly of a leviathan.\n One of the screens blinked shyly, drawing Shepard’s attention. Caine’s face was barely there, a ghost of an image all but lost in the snow.\n “Shepard, look at it,” Caine breathed. The jockey then turned an accusing glare on Shepard. “What did you do?”\n Affronted, Shepard sat erect. “I didn’t—I want to talk to myself,” he demanded. “Where’s me?”\n Caine looked offended. “I don’t know. Where do bluehairs go?”\n “Caine . . . ”\n “Am I my brother’s keeper?”\n A sick dread turned Shepard’s stomach. He couldn’t look at the jockey anymore, so moved his attention back to the derelict. The massive glory of the alien vessel filled the monitors, a landscape of bristling armaments and eldritch lights. It seemed endless and impossible—alive and awake.\n The heating didn’t work as well as it had before the incident, and the tug bled warmth into space at an alarming rate. Pulling the thin blankets from both stateroom bunks, Shepard wore them over his shoulders as he watched the derelict on the monitors. He slept for a little while in his chair, but woke suddenly to an ominous bang. He listened for a bit before deciding it had been imagined. For a little while, he tried to raise Caine and Shepard on the intercom, but found only static.\n Shepard knew something from outside had found its way into the tug when—all bundled in his blankets—he lifted the lid of the head and startled something that had come up through the drain to get comfortable in the bowl. With a splash, it pulled back down the pipes. Shepard slammed the lid and fled.\n Back in the cockpit, he turned the intercom all the way up. “Caine,” he said. “Shepard. Something’s in here with us. Something got in.”\n But the static wouldn’t talk back, and no one came to the monitors. Shepard called into the ventilation ducts. He tuned the com channels to empty space and listened for voices that weren’t speaking.\n A faint rhythmic pounding leaked from the ductwork, bringing him the shouts of an event taking place elsewhere. He thought maybe the cafeteria, so he started that way, but met something massive in the corridor. It blocked his way like a mass of bone-white webbing plastered to the walls, floor, and ceiling. It moved as though breathing. Shepard retreated to the cockpit and locked the door.\n He switched off the intercom and crawled beneath the panel, packing himself among the insulated cables and sweating conduits. He clutched his blankets tighter around himself, praying that whatever had come into the tug wouldn’t hear him breathing.\n During the initial hours of hiding, Shepard was haunted by the slow, agonized groaning of the tug. It penetrated the bulkheads and came up through the grating in the floor. It was the sound of something invasive working through the tug’s guts, forcing itself into and through all the private spaces. For a little while he heard faint voices from elsewhere, a terrified, incomprehensible litany that swelled and faded to the rhythm of unseen currents. “Oh God,” he heard it declare once in a tone both exhausted and horrified. It was hard to tell, but it sounded like Caine.\n Twelve hours later the internal temperature had dropped to minus five degrees Celsius. Having heard nothing for a long while, Shepard emerged from beneath the panel, blanket clutched around him. He felt stiff and burdened, as though bundles of wire had infiltrated his blanket to loop themselves about him. Painfully, he hauled himself up to peek over the panel, upon which a hard white frost had formed.\n Images of the derelict had been wiped from the screens, replaced by an unfamiliar face. Seeing him, it loomed closer. Shepard watched its mouth move before remembering he’d killed the sound. With stiff fingers, he tweaked the volume until the voice came through.\n “—ear me?” it shouted at him.\n “Shh,” Shepard whispered. “I hear you.”\n “Where have you been?”\n “Here. All the time here.”\n The face studied him. “Which one are you?”\n “Shepard.”\n “We’re on your port.”\n Shepard glanced at an exterior view. He saw a military frigate bathed in its own lights, dim in the deep hydrogen blizzard. “I see you.”\n “Where’s Caine?”\n “Dead.”\n “Both of him? How?”\n “I don’t . . . ” Shepard shook his head. “There hasn’t been any communication for a long time. The engines failed. Something—I don’t know what—something went wrong.”\n Having turned aside to read from another monitor, the jockey nodded absently. “I see that. The derelict didn’t want to move. Tug couldn’t handle it.” Looking back to Shepard, his expression changed.\n “What’s that?” the jockey said, pointing.\n “What?”\n “On your neck. There.”\n Shepard brought a hand out from under the blanket to touch a long, hard lump under the skin alongside his jugular. It had come up from under his collar, and retracted from his fingers like a living thing. With great apprehension, Shepard opened his blanket to assess himself.\n There were no bundles of wire around his legs, no cables or conduits. Pale white tendrils, like roots, had snaked up through the grating to coil intimately around his thighs. The larger ones had worked their way under his clothes; the smaller ones had already burrowed painlessly into his flesh.\n “What’s happening there?” the jockey asked, angling for a better view.\n Too quickly, Shepard snatched his blanket closed. “Nothing.”\n The jockey gave him a reproachful look.\n “It found me,” Shepard confessed.\n The jockey slumped. “Sit tight,” he said, and the screens went dark.\n Beneath the blanket, Shepard felt pale tendrils worming under his skin, pushing things aside to make room. He didn’t want to see what they were doing to him, but it afflicted him with a sickening heaviness.\n Having been gone hardly a moment, the jockey returned to all monitors at once. He didn’t seem to want to look at Shepard. He scratched behind an ear, looking truly regretful. “This is breach,” he said, then cleared his throat as though to read a prepared statement. “Standard operating procedures were probably violated. Mistakes were almost certainly made.”\n The jockey stopped to look at him directly. “I won’t lie to you. Yours is a bad situation.”\n Shepard swallowed thickly. “You’re leaving me here?”\n “No,” the jockey said, then again, but stretched out, as though Shepard were not simply wrong, but very wrong. “No, they want you back. You and your guest.”\n Relieved, Shepard struggled to his feet, tendrils weighing him down like shackles. “Please hurry.”\n “We need you to drop your coupling with the derelict.”\n With shaking hands on frigid controls, Shepard disengaged the links. A hollow bang echoed through the tug upon release.\n “Now get me out of here,” Shepard said. “Please.”\n “I’m afraid extraction at this point would only complicate things,” said the jockey.\n Shepard stared at the screen. “You can’t leave me here. I can’t be here with it when we go back. Where will it go?”\n “You should lie down,” the jockey said. “I think lying down would be best.”\n The tug shivered when the frigate took hold.\n “This wasn’t our fault,” Shepard objected.\n The jockey made a face to express that such matters were beyond his jurisdiction.\n Shepard felt the frigate’s grown-on engines bunching up. He felt it in his teeth, and in his groin. As the outlines of everything solid shivered away, others became clearer. A crowded latticework of bone-white webbing piercing the bulkheads, stretching through the fabric of the tug. He opened his mouth to protest, but the frigate’s engines banged, and both vessels were gone. Flakes of hydrogen swarmed to fill the vacant spaces."}