{"fingerprint": "RbUai6QXAzOFOg4pDUEo4Y7YRnw=", "sitename": "Clarkesworld Magazine", "title": "Something in the Mermaid Way by Carrie Laben", "author": "Carrie Laben", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/laben_03_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Something in the Mermaid Way by Carrie Laben", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1100 words, short story\n Something in the Mermaid Way\n 2007 Shirley Jackson Award Nominee\n As fall crept on and the storms got worse, the supply of monkeys ran low.\n At first, we actually prospered, because we were able to use the monkeys that the other shops could not. The best monkeys for making into mermaids, by most standards, were the suckling young—their skins were pliant and they were of a size that matched well with many common fish. But my mother, in her youth, had developed a process that let her shrink the larger monkey skins—even the full-grown monkeys who often died in defense of their young and whose rough pelts the hunters would part with for small coins—down to an appropriate size, without drying them out too much to work with.\n Thus we had survived ten years ago when the monkeys had been exterminated from Isla Scimmia, turning the name into a cruel joke that outlanders used to taunt the inhabitants for our dark coloring and the heavy hair on our arms. More than half of the families who made mermaids then had since left the island altogether, some for Rome, some for the New World or parts still more exotic. One notable family, a husband and wife and five daughters ranging from a twenty-five-year-old spinster to a toddling child, had all drunk arsenic.\n Mother was disgusted. She’d held the family in high regard before; along with her own, they’d been among the few original mermaid-making families to survive when the mermaids themselves went away, to weather the early storm of competition from Fiji, to cope with the way the fish seemed to shrink every year and the fickleness of the sailors who were always looking for some new novelty. The eldest daughter had been her particular friend.\n But these days, according to Mother, everyone was a degenerate. She announced it loudly as she ducked into the workshop, shaking the rain out of her loose dark hair. “Degenerates! Think they can sell me stinking half-rotten monkeys for twice, three times the usual price. They’d try to sell a shell to an oyster and ask for pearls in payment.”\n She held two packages—by the smell of them I could tell that she’d managed to find a few acceptable monkeys. She almost always did, even when Annagrazia and I came home empty-handed. I took one of the packets, wrapped in coarse oiled cloth, and untied the ends to reveal one of the small grey North African monkeys.\n “You got the good kind,” Annagrazia said, unwrapping the other bundle and laying it on the table beside her knives.\n “Too big,” Mother said, and fished out a packet of glass eyes from the pocket of her cloak. “It will take days to shrink them properly.” The shrinking process was Mother’s pride and our salvation, and she hated it—it was long, tedious, it produced smells that gave her headaches. To hear her talk she’d as soon never do it again. But she laughed at the women who came to try to buy the secret from her.\n Annagrazia picked up her knife and tried the blade carefully against the inside of a coarse-haired leg. The lower half of the monkey would be discarded, of course, but there was no need to cut it to ribbons—the fur could still be used to line boots or collars. “I like these grey ones though. They look the most like real mermaids.”\n “Like those white-eyed idiots at the docks would know a real mermaid from a hole in the fence.”\n “I don’t care if they know. I know.” She slid the knife along the inside of the leg, skirted the groin, and split the belly. I thought for a moment that she had cut too deep and the rotting intestines would spill, but the knife glided along and left the muscles in place. “Which reminds me. Did you get brown eyes?”\n “Blue eyes. The sailors like blue.”\n “There never was a mermaid with blue eyes,” Annagrazia said, as she had so many times before.\n “There never was a mermaid that was actually half monkey and half salmon either.”\n When Annagrazia finished skinning the monkey, I took the body away to clean and bone and see if any meat could be salvaged.\n Just before the storms finally broke, I noticed that Annagrazia was looking pale and sick. The quality of her work was falling off a bit too—not enough that I could see it, but enough that she cursed and wept at her tools before Mother patted her hand and told her it was good enough, it would still sell.\n Annagrazia threw her needle across the workshop and ran to the kitchen.\n Three days later, Mother sent me to the apothecary for pennyroyal.\n “You’ve left it too late,” she was scolding when I got back.\n “I haven’t. I had an idea. I can make a mermaid that looks real, Mama, when you see . . . ”\n “And your plan required fucking some sailor boy from the docks?”\n “A man from one of the island families would have been better, but it makes no nevermind. Our blood is thick. Anyway, my stupid sailor boy was able to give me some brown glass eyes.”\n “You and those eyes!” I thought for a moment that Mother might slap her. But Mother never slapped Annagrazia. She shook her head and snatched the pennyroyal from me and went for the kettle.\n The baby slipped out in a mess of bloody unnamable fluid, and never drew a breath before it was out of the world. Tradition called those babies the happy ones.\n “Let me hold it,” Annagrazia said, and I placed it in her arms. “There, look. The hair is so fine on the arms, and the eyes are brown.”\n Mother smiled. “You’re right. Our blood is strong. No sailor boy in that.”\n Annagrazia reached for the knife she’d kept by the bedside in readiness.\n When the mermaid was finished, it was indeed perfect.\n “The spitting image of my grandmother,” Mother said triumphantly. “This is the finest mermaid that has ever come out of any shop on this island since our ancestors died out. The price we can put on this—we could fool a ship’s doctor with it.”\n “We can’t sell it,” Annagrazia said. “It’s too perfect. This is the best thing I will ever do. I will keep it.”\n Then Mother did raise her hand to slap her, but Annagrazia was holding her skinning knife and they stood staring at each other for a long time.\n “I will keep this one,” Annagrazia said with a smile, “but I can make more.”\n Carrie Laben lives in Brooklyn with four cats, three rats, and one human. She currently writes software user manuals and other still more dire things for a living, but this is a big improvement over milking cows and selling used books to agitated mental patients. This is her first outing as a professional fiction author, but she has had several essays published in various books and periodicals that you haven't read if you haven't been to Ithaca, NY. In her spare time, she enjoys collecting books, looking at birds, and finding new and different things to eat."}