{"fingerprint": "tTpMDnh/YuxIwZ8xnqrP0Q4rYPk=", "sitename": "Clarkesworld Magazine", "title": "Torquing Vacuum by Jay Lake", "author": "Jay Lake", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lake_02_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Torquing Vacuum by Jay Lake", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5830 words, short story\nTorquing Vacuum\nSpanich had been up three shifts straight working on a drive alignment issue aboard ICV Mare Imbrium {13 pairs}. She was a charter—a rare thing, in a starship, which signified pockets deeper than planetary budgets—and the passengers reportedly wanted to lift out, but her pilot wasn’t lighting up without the alignment problem being solved. Spanich could get behind this. Faced with the choice of a well-monied tongue lashing or being smeared in rainbow quarks across a few dozen lightyears, he’d take the dressing down every time.\nBesides, he was the only drive tech on Estacada Orbital certified to work the finicky and bizarre paired drives that post-Mistake starships relied upon. Supraluminal travel was so sporadic that if the system got half a dozen outside visitors a year, it was considered busy. And most of them flew with their own maintenance crews as a matter of course. Mare Imbrium {13 pairs} was practically a yacht, the smallest starship he’d ever seen or heard of.\nThe shipmind kept whispering specs and test results to him in a voice that made the hairs on his arms prickle and stiffen. Fair enough. A man shouldn’t get too comfortable with the machines that kept him alive. Mistrust was healthy.\nThank the saints he wasn’t signed onto this bucket for this run. Their quantum bloc cross-processors weren’t piping temporal data flow correctly. No one had liked his suggestion to pull the whole rig and reconfigure on a bench back at the station. A week’s work, at a minimum. But Spanich wouldn’t trust his life to the jigger he’d been ordered to attempt in the name of expediency.\nHe sighed and focused on the circuit joins. Nose-to-panel, flat on his back, falling asleep with the smartprobe in his hand, Spanich knew he was still better off working here than back in the engineering pool rotation.\n“Domitian,” said the shipmind. “I think it’s time for you to stand down.”\n“What!?” Spanich snapped.\n“You’ve just probed the same shunt five times.”\nHe sighed, unclipped his instruments, and wriggled back into the engineering bay. That was only moderately less claustrophobic than the service accessway he’d just spent twenty hours in, minus breaks for pee and chow. “Home,” Spanich said to no one in particular, then began packing up.\nRibo thumped from the big speakers embedded in the floor of the Bar Gin. When the bass riffs hit, peanut shells danced across the table like cootch girls on payday. Most places used ambient nano to whisper music, but Bar Gin was so old school they probably hadn’t even invented reading, writing or differential equations back when the place had been founded.\nSpanich huddled in a booth and wondered why he hadn’t gone home to sleep. ‘Home’ being a two-point-two meter-long tube, a meter in diameter. He paid extra for rack space for his hardsuit, and extra extra to make sure parts didn’t vanish from it during off shifts. Still, sleep would have made more sense for him than crouching here over some of Bitter Jane’s homebrew algae beer listening to music which had been crap when he was a kid, and not improved since.\nThen Austen wandered into the joint, and Spanich’s world grew a little brighter. That boy just moved right. Cute enough kid, and buff in a way that kept the eye resting easy, and he smelled like heaven on a Friday night, but the way Austen walked sometimes kept Spanich up late, sweating.\nHe raised his hand, waved to Austen, but the kid’s gaze slid right over Spanich like he wasn’t there. Was it too dark back here in the booth? Maybe too much toke smoke in the air.\nWho the hell was he kidding?\nAusten No Last Name didn’t give a shit about Domitian Spanich. Sometimes the kid gave a shit about Domitian Spanich’s pay chitty, when the keycard was fat with local thalers, or more rarely, Imperial schillings. Except payday was seventeen shifts away right now, and Austen could scent ‘broke’ the way a sniffer could find a carbon dioxide breach in a scrubber tank.\nSpanich sank deeper into his algae beer and wondered why the hell he couldn’t ever fall in love with anyone available. There was no lack of available talent. Half the guys torquing vacuum here on Estacada Orbital swung his way. For his own part, Spanich knew he was decent enough looking, and a good lover—it didn’t take raging egotism to sort out those kinds of truths, not once you’d left teen hormones behind. But somehow he always tumbled for the pretty boys, the working kids, who’d roll over and whisper sweet nothings while they let him play their bodies like harps, but always ran off with each other for the real laughs or the quiet times.\n“Dommie,” said a voice for the second time.\nStartled, he looked up from his beer, slopping some of it onto the tabletop. A warning blinked with pixel-rotted irritation from beneath the greenish puddles, but he ignored that.\nAusten!\nSpanich tried desperately to stay cool. “Hey.”\nHis sometime-lover sat down. “Mind if I join you?”\nThat crooked smile always melted Spanich. “Uh, yeah. Let, let me get you something.”\n“I’m locked and stocked,” Austen said. Those violet eyes seemed to glitter in the bar’s lousy lighting. “Bitter Jane’s sending something over. Said she’d put it on your tab.”\n“I don’t have a—” Spanich managed to shut himself up before he looked any stupider. “Oh, right. Good. Happy to buy you one.” He tried to fight the goofy grin he could feel taking over his face. “Or more,” he blurted. Lots more.\nThank the pressure demons this place was so dark. Austen couldn’t see him blush, at least.\n“Don’t mind if I don’t.” The kid’s crooked smile flashed into an answering grin that looked so free, so easy, that Spanich wondered why he even bothered to try.\nHe kept himself cautious. Don’t hope, don’t hope, don’t hope. “So, uh, what’s up?”\nA drink arrived on a rollerbot, a cybernetic waiter converted from a level one security drone. For all Spanich had ever been able to tell, it might still be a kill platform. You couldn’t know, not with Bitter Jane in play.\nAusten picked up the long, graceful ceramometallic stem, frost sparkling diamond bright as mist curled off its sides.\nGreat, thought Spanich. One of Jane’s thousand-thaler cryoliquid specials. Someone here was pushing their luck. Spanich had a sick fear that he was the chump. There was his next pay chitty gone, and a decent portion of his liquid savings. So to speak.\n“Well . . . ” The kid took a long, slow sip, batting his eyelashes.\nFocus, focus.\n“You’ve been working on the Mare Imbrium, right?”\nSpanich winced. Austen even pronounced the old, old term wrong, as if he were speaking Classical English instead of Preclassical Spanish or Mayan or whatever language of lost Earth those words came from.\n“Mare Imbrium, thirteen pairs.” Spanich corrected the kid’s pronunciation and usage both. “And the shipminds are mighty picky about getting their numbers right.”\n“Shipminds,” Austen said. “Yeah. Whatever.”\nIn that moment, Spanich suddenly wondered what it was he’d found so alluring about Austen. Sure, the kid was smoking hot, like fire in an oxygen plant, but had he never noticed how dumb Austen was. Maybe some dirtball farmer wouldn’t know the difference, but how could anyone survive in an orbital habitat and be so ignorant of the basic etiquette of ships and shipminds? The kind of ignorant that got people spaced out an airlock, or their breathing license erased from the station records.\n“Look . . . ” Spanich felt obscurely deflated and betrayed. “Don’t worry about Mare Imbrium thirteen. There’s a charter riding her this trip, and I hear the woman is deep-fried trouble on a fuckstick, if you catch my datastream. Let’s have a drink and, I don’t know, go dancing. Forget about starships, kid. They never mattered to you before, did they?”\nAusten shrugged and smiled. The wattage seemed to have gone out of his expression, but maybe that was just Spanich. “I need something, Dommie. Something only you can help me with.”\n“Only me, huh?” The words just slipped out of his triple-shift exhausted mouth. “And that’s why you’re sucking down a thousand-thaler drink on my tab? To get in good?”\nThe ceramometallic stem hit the table with a click that would have cracked ordinary plastic. “Dommie, please . . . ”\nSpanich stood up. “I’m tired, I need to sleep, I’m going home.”\nAusten shot out of his chair, grabbing for Spanich’s rough, greasy hand with his own slim, manicured fingers. “At least let me come with you.”\nClose, with that smell, though he knew them both for idiots, Spanich couldn’t say no to that. Even if he’d been awake enough to stop this disaster before it got any worse, with Austen standing so close his hormones were kicking ass and taking names.\nHome they went, together.\nThe tube’s comm panel beeped him out of dreams into the reality of an itching belly—cum always dried that way on his skin—and a gently snoring Austen. Spanich nudged a crusty towel aside and punched the sleepshift override.\nThat didn’t stop the beeping.\nHe focused on the little display. Priority message, channel two. His blood chilled. Station ops.\n“What the . . . ?” He stabbed again, brought up voice-no-video mode. “Spanich.”\nAusten groaned, tucked in tighter to his side. Spanich patted the kid, trying to soothe him enough not to make noise on this call.\nThe speaker crackled, shitty cheap tech like everything his type ever got, other than the tools of their trade. “Engineering Supervisor Spanich?”\n“Yeah. ‘s what I said.” He blinked some sand from his eyes, and ignored hot memories of the most recent midshift here inside the comfortably tight confines of his sleeping tube.\n“This is Olivez Marquessa Inanometriano Parkinson sub-Ngome, Adjutant-Intendant of Estacada Orbital operations.”\nWhoa. Only flash brass used names that long. And most of the hypercrust didn’t bother to work for a living. “Alright. I’m impressed now.” Damn, he needed to be smarter.\nAusten stirred. “Whu . . . ?” Spanich jammed his fingers in the kid’s mouth. Reflexively, Austen began to suckle.\n“Your presence is requested and required at berth eleven, docking boom gamma.”\nShit on an airfilter! That would be the current hookup of ICV Mare Imbrium {13 pairs}. “I’m not due back til thirteen hundred hours.”\n“Requested and required, Engineering Supervisor Spanich. Would an escort facilitate your prompt presence?”\nShit! What was this about? “Ah, no. I’ll be there fast.”\n“Adjutant-Intendant out.”\nHis comm panel died with a definitive pop that suggested further conversation would not only be pointless, but impossible. Spanich looked down at Austin, who was busy slurping the last of their midnight passion off his fingertips.\nHe was the chump, alright. Flash brass played for fatal stakes. Not their lives, of course, but the lives of people like him. And people like Austen.\n“What the fuck did you want last night?” Spanich grabbed Austen’s hair, forced the kid’s head back until they were staring eye to eye. “What the fuck did you do?”\nAusten didn’t have a hell of a lot to say at first. Spanich poured some bulb-coffee into him anyway, on principle, while slamming a couple for himself. He didn’t let go of the kid, either, dragging him into the shitter, then the scrubstall.\nWhen the water hit them at 0.5 celsius, Austen sputtered into some fairly creative profanity. “You gruyere-scented douchenozzle, I’m going to kick your ass from the throat down, then yank your nuts—”\nSpanich slapped him. “Hush up, dearie,” he growled, dragging Austen’s face so close they might have been kissing again. Somehow, being naked and wet with the kid wasn’t doing much for him this morning. “You know how many times in my life flash brass has rung my bell?”\nAusten found his voice. “Th-they put their jocks on one strap at a time like everybody else.”\n“Maybe. And maybe they have platinum-plated jeweled nut sacks snapped on every morning by hermaphroditic dwarves. How the fuck would I know? Because never in my entire pressure-bleeding life have I had to take a call like that one.” He shook the kid hard, banging that pretty head against the scrubstall’s algaplastic lining. “And I’d bet my last gene scan you have something to do with it. You and your Mayor Eye-breye-um.”\n“Mare Imbrium.” This time he pronounced the name right.\n“That’s Mare Imbrium, thirteen pairs, to you, my friend. Shipminds are damned proud, and have very long arms indeed when they’re riled up.” Even talking about it here in the scrubstall made him nervous.\nSpanich dragged the shivering, naked Austen back to his tube, then forced the kid to dress by the simple expedient of bending his fingers back til he agreed. This one would run like a ball bearing if given the chance, and he figured on bringing Austen in as a kind of human shield for whatever it was the Adjutant-Intendant of Estacada Orbital had in mind for him.\nAll too soon for Spanich’s taste, they were off among the sweat-reeking passageways of the station’s guest-worker quarters. A person could get almost anywhere in this place without leaving oil footprints on the tourist walkways. Mostly he liked it that way, though if they’d dial the heat up even halfway to tourist standards, he’d have been a hell of a lot happier.\nAusten had given up even muttering, and let himself be dragged along like a second toolbag. Whatever fate was coming, Spanich was pretty sure it wasn’t a surprise to the kid.\nJust outside the lock array for docking boom gamma, Austen made his break. The kid stomped down hard on Spanich’s instep, or would have if Spanich hadn’t been wearing carbon-jacketed boots rated up to sixty gravities of pressure.\nHis second mistake was waiting until Orbital Security’s troopers had them in sight. Which was probably what panicked the kid, Spanich realized, as he knocked Austen down and went to one knee of top of the kid’s chest. “Don’t fuck around in front of the troopies,” he hissed.\nThe troopies were watching the scene with mild disinterest. Mild disinterest suited Spanich just fine. No hands on weapons, everybody stayed peaceful. He dragged an out-of-breath Austen back to both their feet, then manhandled the kid right up to the troopers.\nNow their interest was neither mild nor dis. “You guys feeling brave?” asked the right-hand cop. Spanich vaguely recognized him from the Bar Gin, dude with space-black skin and eyes that shade of violent green that said that one of his ancestors had come from Falkesen sometime post-Mistake. Nobody from a human norm gene line had irises that color.\nThe left hand cop, a fellow with nubbly skin and tight epicanthic folds, drew his stungun for emphasis. Bad cop, then.\n“Got a call-in,” Spanich said to the good cop, keeping his chin down, his lips closed and his tone quiet. “Adjutant-Intendant wants us up on Mare Imbrium, thirteen pairs.”\nAusten squirmed at that, but Spanich knuckled his collar tighter. The kid seemed to get the message.\n“You that Spinach guy?” green-eyes asked.\n“Span-ick. It’s Span-ick.”\n“Whatever.” The weapon was reholstered with the same bored air. Green-eyes gave Austen a long look, making no move to cycle the lock. “Who’s the cyclone ranger there?”\n“My lovely and talented assistant,” Spanich informed his feet.\n“Didn’t say nothing about no assistant.”\nHe looked up, caught the fellow’s green eyes. “Did anyone say I couldn’t?”\n“Hey . . . ” The cop spread his arms wide, letting go the responsibility. “You want to wave your dick around in front of flash brass, be my guest.” He glanced at his partner. “They tooled?”\nBad cop had the faraway gaze of someone reading a retinal implant. Finally he spoke, his voice like gravel in an airshaft. “Nothing out of profile.”\n“Your lucky day,” said green eyes. “No cavity search. Hell, not even a pat down.” He leaned close. “We got orders to run light and easy for now.”\nSpanich nodded vigorously. “Light and easy it is, sir.” Well, at least there hadn’t been a murder aboard the starship. Not of anyone important, at any rate. They’d be a lot more sealed up out here if so. He waited while bad cop punched in an access code—not one Spanich recognized—then waved them into the transition tube.\nWaiting for the outer lock to cycle, he leaned very close to Austen. “What are you so afraid of?”\n“You’re going to be sorry you asked,” the kid replied in a low whisper. His words sounded like a threat, but nothing in Austen’s voice, stance or stink of fear-sweat backed that up.\nNot murder then, but something worse?\nThey found another troopie at berth eleven. This one didn’t bother to shake out their suits—he just cycled open the lock and let Spanich and Austen go in, not saying a word. Spanich did note that the tote board alongside the berth’s lock had been blacked out. Which was both unsafe, and he was pretty sure, illegal. Not open-flame illegal, but still a safety violation waiting for a monitor to write a fine-and-dine.\nThe berth lock opened to the familiar accordion-walled transfer tube. Inside, Spanich’s breath damned near crystallized as he grabbed the lead lines. Air this stupid-cold meant someone had shut off the enviros, probably since he’d left Mare Imbrium thirteen’s deck a shift and a half ago. When there were no troopies guarding access, for one thing.\nAnd they hadn’t had the stuff back up long.\n“Dommie.” Austen’s voice was pleading as they approached Mare Imbrium thirteen’s hull lock.\nNo, Spanich realized, not pleading. Terrified. “Is this where you give it up?” He stopped them, floating in the tube’s microgravity. They had maybe a minute, tops, before whoever was expecting them onboard got unpleasant.\n“We don’t have to d-do this.” The kid’s teeth were chattering.\n“A little late now. You could have spoke up last night, instead of playing rolypoly with me for half a shift. Or anytime before now, even.”\n“You h-have no idea.”\nClose, so close that the kid’s smell began lighting up his backbrain once more, Spanich growled, “So give me a fucking idea, punk.”\n“That w-woman on board. She’s not just some charter tourist.”\n“Who is she, then?”\n“My mom.” The abject terror in Austen’s voice was frightening.\nThe little bastard knew this ship all along then. He’d been faking, before. Faking everything, then? Spanich didn’t see much point in asking who the kid’s mother was. “Family reunion time.”\nThey kicked off together, heading the last few meters to the hull lock. Spanich was surprised how graceful Austen had suddenly become, for someone who had seemed to know so little about starships and life in space.\nHe was even more surprised when the lock cycled at the touch of Austen’s fingertip on the bioscanner. Though, really, Spanich was starting to realize, he shouldn’t have been.\nAdjutant-Intendant Olivez Marquessa Inanometriano Parkinson sub-Ngome waited in the passageway beyond. There was no mistaking a flash brass—no one else dressed like them, or looked like them, or stood as if they owned the worlds of the Imperium Humana.\nWhich they as good as did, of course.\nThe Adjutant-Intendant stood about two meters, forty cents, but didn’t weigh above sixty kilos. It was all whipcord muscle, bred in through the better part of a thousand years of careful genetic planning, since the Mistake. Every schoolchild knew this, because every schoolchild was taught why the Familia Majora—flash brass—ruled over them all.\nHis skin was velvety black, similar to the guard outside. These were people who treated chromosomal radiation damage as a preventable disease on the par with influenza or head lice, after all. The Adjutant-Intendant’s eyes had the liquid silver look of someone whose optical nano bloom had been induced in utero, and carefully cultivated ever since.\nIf he’d had a few billion Imperial schillings, and some key Writs of Exemption, Spanich could have bought most of that package for himself. Adjutant-Intendant Olivez Marquessa Inanometriano Parkinson sub-Ngome wore it all like someone born to two dozen generations of that inheritance.\n“Engineering Supervisor Spanich.” His voice had the tone of a man finding a slug under a salad leaf.\n“Reporting, sir.”\n“Were you ordered to bring an accompanist.”\n“My assistant, Jim,” Spanich said, immediately regretting the stupid lie.\n“Jim . . . ?” The Adjutant-Intendant looked Austen over briefly. “Your wit is at least half misplaced, Engineering Supervisor.”\nSpanich wondered if that had been the flash brass equivalent of a joke. “Your comm was urgent, sir. I figured this might take an extra pair of hands.”\n“Hmm.” With a visible letting go—meant to be visible, Spanich was certain—the Adjutant-Intendant continued. “We are aboard because the Mare Imbrium shipmind has declared an emergency.”\n“Thirteen pairs, you cocksucker,” muttered Austen. Spanich could have backjacked the little bastard for that—referring to shipminds that was a prerogative of the highest aristos among the flash brass, a rank thing—but he didn’t want to make this agonizing scene that much worse.\nThe look in the flash brass’ eyes could have frozen helium. “Indeed. Mare Imbrium, thirteen pairs. I see why Engineering Supervisor Spanich values your services, Jim. As I was saying, the shipmind has declared an emergency, which it determined only you could resolve.”\n“I was coming back in half a shift, anyway,” Spanich pointed out. “I’ve spent a lot of time in this engineering bay, these past few shift-cycles.”\nThe shipmind’s voice echoed through the corridor, a whisper like thunder—pervasive and overwhelming, but not loud. “This seems an opportune time to redirect.”\nThe hair on Spanich’s arms prickled. Far more astonishing, even Adjutant-Intendant Olivez Marquessa Inanometriano Parkinson sub-Ngome looked surprised. Austen just groaned.\n“Please escort our new visitors to the wardroom, Markie,” the ambient voice continued.\nSpanich nearly choked. No one called flash brass by a nickname, not like that. Not even other flash brass. From the look of him, much like a man swallowing a live eel, the Intendant-General was no less surprised.\n“Of course,” he said, his voice in the perfect equilibrium that his facial expression had failed to retain.\nAusten groaned again. Spanich was beginning to mightily regret bringing the kid, and was already thinking hard about ways to get out of this alive and free.\nThe wardroom hatch slid open. Where the passageway had been utilitarian—hookfabric carpet, grab bars, emergency stations every five meters; all the usual details of space travel—the wardroom was astonishing in its simple, almost terrible luxury.\nA pond. A pond, on a starship. These people weren’t just wealthy, they were insane. The little pool of black water was walled around with rock, filled by a bamboo pipe serving as a fountain. The floor was pebbled like raked gravel, though Spanich’s engineering eye noted that was a texture, not half a ton of loose stone ready to break free in the event of a grav failure. The walls were of some woven reed matting, while the ceiling was draped with a rough, undyed fabric.\nAll highly illegal, according to any safety standards he’d ever been lectured about. Illegal, unsafe . . .\nNext to the pond was a low black lacquer table aggressively simple in its lines. A woman knelt behind it, her robes a coarse, raw fabric that almost matched the ceiling. She had an air of extreme age about her—not like the Befores, those crazed, dangerous immortals everyone whispered about, that Spanich had even met one once—but more like an ordinary person who’d lived an extraordinarily long time with very good medical care.\nAnd eyes like hull-cutting lasers. Eyes that happened to be the same pale violet as Austen’s.\n“Hello,” she said.\nSpanich knew where the Mare Imbrium thirteen shipmind had modeled its voice from. In those velvet tones, he could hear the armies march at a word, feel the bar emptying for a fight to the last man standing. He had to force himself not to kneel.\nAusten did go down on one knee. So did Olivez Marquessa Inanometriano Parkinson sub-Ngome. The Adjutant-Intendant gave Spanich a glance which should have fried skin off his bones.\nWhat the hells was he missing here?\n“He can be forgiven because he does not know,” the woman said.\nThe voice again. And her scent, in this room as subtle as atomized lubricant moving through an air duct. She and Austen were of a—\nHe broke off the thought, staring at the kid in horror.\n“Mother,” Austen finally said in a low voice so unlike his usual attitude that if the words had not come out of his mouth, Spanich wouldn’t have known.\n“Tranh Shankakini Clovis McVail Austen deLacey sub-Rachman sub-Nagona,” she replied.\nSomewhere in that welter of flash brass name, Spanich picked out the kid. He’d been fucking a runaway, and from the length of the name, one of the highest-placed runaways possible. How had the kid managed to seem so normal, instead of gene-modded to hell and gone like the Adjutant-Intendant?\nAusten bowed so low his head almost touched the floor.\nClovis, thought Spanich. She’d said Clovis. He nearly shit himself. These people were Imperial family! There should have been a battalion outside the lock, not two bored station troopers.\nNo wonder the Adjutant-Intendant had been glaring him to death. Clumsy, shivering, clammy with sweat, Spanich dropped to one knee as well.\n“Mare Imbrium tells me that you are working to set her drive to rights, Domitian Spanich.”\n“Ma’am. I’m . . . ” He didn’t know what to say. He wasn’t qualified to work on a starship carrying members of the Imperial family.\nThe shipmind spoke. “There is nothing wrong with my drives, Engineering Supervisor Spanich. But I thank you for your work.”\n“All a ruse, I am afraid.” Austen’s mother smiled at him. He was ready to lay himself at her feet if she’d just do it again. “Necessary to keep us in port without question while certain rumors were . . . traced.”\nSpanich glanced over at Austen. The kid was pressed to the floor, his voice a whisper when he asked, “Why tell me now?”\n“So you would understand what must happen to you next,” she replied, her voice now steel-hard. Austen took a sharp breath, then fell completely silent. The Adjutant-Intendant moved slightly, still on his right knee but shifting his weight in preparation for action.\nIn that moment, Spanich’s future became very narrow and very short. He stood, shaking off the spell of that voice, and reached slowly for his toolbag. Austen’s mother nodded slightly at the Adjutant-Intendant, who then spoke, his voice harsh. “What are you doing, Engineering Supervisor Spanich?”\nThe words slipped out of him like bullets dropping from an open clip. “Preparing to die like a man.” Truly, he had no idea.\n“Mother,” Austen said, his voice so low it was almost a squeak.\nShe gave Olivez Marquessa Inanometriano Parkinson sub-Ngome another significant look. Spanich took his cue and swung the toolbag hard, letting the strap pay out so fifteen kilos of metal and ballistic cloth took the bastard right in the temple. Two dozen generations of exquisite germline engineering dropped to the floor like a stunned drunk.\n“Guess you’ll have to kill me yourself,” Spanich said, breathing hard. Austen was splayed flat on deck, hiccuping or laughing or crying or something. “Or is it Princess?”\n“Is this how a man dies?” she asked, deceptively conversational.\n“Yes.” Spanich tried to catch up to his adrenaline, slow himself down. “On his feet, fighting for his life.”\n“Don’t,” moaned Austen.\n“Do you care for this man?” his mother asked, curiosity filling her voice. Spanich let the bag swing on its strap, but she ignored the makeshift weapon utterly.\n“No.” Austen whimpered, practically embracing the floor. Then, “Yes. No.”\nHer gaze met Spanich’s again, and he wondered how he’d ever confused this woman for human.\n“I’m very sorry, Engineering Supervisor Spanich, but my son does not seem to be speaking up for you.”\nHe expected to be shot in the back, but the hatch continued to fail to open, and hordes of guards bristling with armament did not leap into the room. “I can speak for myself, ma’am. I’m as much a citizen as you or he.”\n“Then go.” Her voice was almost a whisper now.\n“Just like that?” Spanich blurted.\n“Who would believe your story?” A laugh was hidden in her words somewhere.\nOn impulse, he reached down and grabbed at Austen’s shoulder without taking his eye off the old woman. “You coming, kid?”\n“I—”\nShe interrupted. “My son is not free to go.”\nFeckless impulse rose inside of Spanich on a red wave of anger. “He’s a citizen, too.”\nThe Adjutant-Intendant groaned, then stirred.\nAusten’s mother glanced at the man, then turned her attention back. “Walk away, Engineering Supervisor Spanich, with your unbelievable story. You’ve won that much in standing up to authority. Take your life and go.”\n“And what?” The anger poured out of him in a flood of words. “When Markie wakes up and gets onto comm, I’m a dead man. Station troopers will pinch me, and I’ll never be seen again. I’ve already committed two, maybe three capital crimes here! Talking directly to you is probably another one.”\n“How you keep your prize is not my trouble.” Her face narrowed, the first real expression he’d seen on her. “Now depart.”\nSpanich tugged at Austen’s shoulder, dragged the kid to his feet. “Come on.”\nAusten stood shaking. His mother slipped a small flechette gun from beneath her robes.\nAh, thought Spanich, and wondered why he wasn’t surprised.\n“Let’s go,” he hissed in Austen’s ear. “Nobody deserves to be pushed around like this.”\nThe flechette gun was unwavering. “Tranh Shankakini Clovis McVail Austen deLacey sub-Rachman sub-Nagona, you are coming home with me.”\n“Mother . . . ” The kid seemed so lost.\n“You already said that.” Spanich let his voice grow gruff, in his talking-to-idiot-techs tone. “Get a new line.” Gambling, he turned the kid with a hard tug on the shoulder and began walking him out like a drunk.\n“My son,” she said from behind them.\nSpanich tapped the hatch panel. At least that control was normal in this freakish room. With a hiss, the wall slid open.\n“Austen . . . ”\nHe propelled the kid out, marching him with an arm twist. Austen wasn’t stumbling, though, which meant the heart hadn’t completely gone out of him. The hatch hissed shut behind them, without the characteristic whick-whine of flechettes that Spanich’s ears were straining for.\n“Engineering Supervisor Spanich,” said the shipmind. Its voice was tentative, a tone he’d never heard from a starship.\n“Shut the fuck up,” he growled. “You’re part of this, too.”\nMare Imbrium {13 pairs} didn’t say another word as they left the ship, left the transfer tube, left the berth lock, left the docking boom, and made their way back into the oily, cold passageways.\nWell away from the locks-and-docks sector, he finally let go of Austen. Kid would be bruised for sure. “Alright then,” Spanich said. “You’re on your own.”\n“Wh-what?” Austen seemed dazed.\n“Snap out of it, kid. You’re free.” Spanich swatted him on the ass. “Now time to scoot.”\n“But I don’t know where to go.”\n“Sure you do. You’ve been living on Estacada Orbital for months.” Platinum-coated genetics or not, the kid had survived on his own. Hustling wasn’t the worst way to live.\nAusten glanced back they way they’d come.\n“Sure. Head back to Mare Imbrium thirteen if you want to.” Spanich leaned close. “But on your own terms.” Kid still smelled great. “And whatever you do, drop the stupid act. You got more education than anyone on this station who isn’t flash brass themselves. Damn well use it. At least be a smarter hustler.”\n“I didn’t think they’d find me,” he said.\n“Hah. You’re genetagged. Probably sniffed you out of the air recyclers, momma came running.” Spanich paused, then probed. “But the big dogs don’t know you’re gone, do they?”\n“I th-thought I’d got away clean.”\n“And that’s why she came with Mare Imbrium thirteen, instead of a battalion of special forces from the Household Guards.”\n“Right. No scandal.”\n“Yet,” said Spanich. “But you’ve been screwing the help, out here on big bad Estacada Orbital. Sullying yourself in the shallow waters of the gene pool.”\nAusten nodded. “Some things get erased.”\nSpanich thought about that, hard. “But not the entire labor force of a station. Too many of us know you, know you’ve been here a while.” He patted the kid’s arm. “I’m grabbing my kit and shipping out as an engineer’s mate in the next empty rack bound somewhere on the backside of this system. With a little luck I can get away before the Adjutant-Intendant puts out a warrant for my ass. You can stay here if you want, but you might consider the same.”\n“No . . . ” Austen stood firm. “I’m going back.”\n“After all the trouble I took to get you out?”\nThe kid grinned, that old, easy smile flashing. “Back on my own two feet, walking in to set what terms I can. Like you said. Besides, on Mare Imbrium I can do something about those warrants. Or Mother can, if I ask her nicely enough.”\nNow that Austen had outed himself, he didn’t seem to have any problem with the starship’s name. Spanich gave him a long, slow stare. “Then what, kid? You ran away from something? Sure you want to go back to it?”\n“No.” He looked around. “But what’s here? They won’t let me be. And you’re right. I can be traced anywhere I’m likely to be able to get.”\nFor a brief moment, Spanich consider inviting Austen to berth out with him. It would be harder to sign on two, but not impossible. He shook off the idiocy, pulled the kid close for a rough kiss that mostly proved they both needed to shave, then took a step back. “I’m going, then. Good luck.”\n“You’ll make it off Estacada Orbital,” Austen said behind him. “I’ll see to that.”\n“Then you’d better fucking hurry,” muttered Spanich, but not loud enough for the kid to hear. He picked up his pace. There were maybe only a few minutes of freedom left. At the next junction, as he turned, Spanich glanced back. It would be just like the kid to be standing there, staring.\nBut no. A couple of off-shift sanitation techs, a trundlebot loaded down with something lumpy, and no sign of Austen, prince of the Imperium Humanum.\n“What do you know?” he asked no one in particular. “Sometimes they grow up.”\nHe went for the rest of his tools and his gear. There was always room for a man who could torque vacuum, out here in the Deep Dark. All he had to do was live to not tell the tale.\nThe late Jay Lake was a highly talented and highly prolific writer who during his tragically short career seems to have managed to sell to nearly every market in the business, appearing with short work in Asimov's, Interzone, Tor.com, Clarkesworld, Strange Horizons, Aeon, Postscripts, Electric Velocipede, and many other markets, producing enough short fiction to fill five different collections: Greetings from Lake Wu, Green Grow the Rushes-Oh, American Sorrows, Dogs in the Moonlight, The Sky That Wraps, and, most recently, the posthumously released Last Plane from Heaven. Lake was also an acclaimed and prolific novelist, whose novels were Rocket Science, Trial of Flowers, Mainspring, Escapement, Green, Endurance, The Madness of Flowers, Pinon, and Kalimpura, as well as four chapbook novellas, Death of a Starship, The Baby Killers, The Specific Gravity of Grief, and Love in the Time of Metal and Flesh. He was the co-editor, with Deborah Layne, of the six-volume Polyphony anthology series, and also edited the anthologies All-Star Zeppelin Adventure Stories, with David Moles, Other Earths, with Nick Gevers, and Spicy Slipstream Stories, with Nick Mamatas. He won the John W. Campbell Award for Best New Writer in 2004. Lake died in 2014."}