{"fingerprint": "mP13O05+/AA3vcfr1dK4hV9Uaok=", "sitename": "Clarkesworld Magazine", "title": "Chewing Up the Innocent by Jay Lake", "author": "Jay Lake", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lake_02_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Chewing Up the Innocent by Jay Lake", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3720 words, short story\nChewing Up the Innocent\nAriadne’s a beautiful kid, you know what I mean? The kind of child that people stop and look at when we walk down the street, her little hand in mine. The Daddy hand, the cross-the-street hand, the I’m-worried hand that drops away the moment there’s a swing to be swung on or kids with jump ropes or chalk. Little fingers, not so little any more, but still they clutch at me with an echo of that infant monkey grip, don’t-drop-me-from-this-tree-Daddy firm until she runs shrieking into her future.\nAnd I don’t mean beautiful-pretty, either. Though God knows she’s cute enough. I mean charisma to turn your head and a thousand-watt personality that can hold a room full of people. It’s not the RSO’s on the county watch list I worry about. It’s what will become of her. All that raw go-go in one little head and one little heart. And only six years old.\nI’ve painted this kid half a hundred times, photographed her so much I’ve gone through two digital cameras. Elaine doesn’t get it. “Quit screwing around with that stuff,” she tells me.\n“Look, the way the light falls on her face.”\n“So turn on the lamp.”\n“That’s not what I mean, hon—”\n“Come on. Pay attention.” Then we’re off in some half-hearted argument about the cats or her friend Lynette’s divorce or who might have swiped the stone chicken out of the back garden and what the hell we could do about it anyway.\nUntil I’m down in the basement, developing black and white or sketching on sheets of foolscap taped to the walls. Ariadne, Ariadne, Ariadne. If I capture my daughter just right, maybe it will be okay to let her go.\nI never did get the point of art jams, not for years. My buddy Russell finally pushed me into one, about a year after my first montage ran in Oregon Alive! “Get out there, Jim. Take some fucking board and a sack of markers and go down to Speed Racer’s. It’s cool, man, I mean, just fucking cool.”\nHe’s a hippie forty years out of time, Russell, with long hair and a taste for women’s underwear—with or without the women still attached—and a sense of purpose when it comes to my life. His own, that’s a different issue, but Russell ain’t married with the most beautiful kid in the world looking him in the eye every day.\nRussell’s been kicking my tail since we were both in our twenties. I still remember sitting in a Denny’s out on I-5 somewhere, on our way to some party down in Salem I’d probably forgotten about before I got home that night. “Look, man, you’ve got a hand a lot of artists would kill for. I’ve seen you whip off napkin sketches of the waitress that got our tab lost. Work.”\nI laughed over the ruins of my Grand Slam. “You’re so full of shit, long-hair. Work, my ass. You wouldn’t know the meaning of the word if I fed you the dictionary.”\nHe got real serious for a moment. “I ain’t got your hand, either, Jim.”\n“Fuck my hand. I got projects due.” Marketing, bane of everyone’s existence. Someone’s got to write the scripts for those damned calls you get just when you’re sitting down to dinner. That was—and is—me. “Hello, Mr. Smith, I’m calling about your long distance service.”\nIf only we could wire our phones to your oven timers, John Q. Public, we’d have it fucking made.\nSo there went the party, and there went some years, and I won and lost a few girlfriends drawing good sketches of them. Some of those sketches a little too good. Elaine got interested after seeing me scribble on someone’s kitchen cabinets with a charcoal briquette one boring Labor Day cookout.\nShe was pretty, petite, cuter than anyone I’d seen in a while. “So,” this woman says to goofy me, “you draw anything besides roses?”\n“Sometimes.”\nSmiles traded back and forth, and the long slide into marriage began. Who needs an art jam when you’ve got love at home?\nYears come and years go, but children are forever.\n“Daddy,” she says to me one day. “I’m thinking about trees.”\n“Photosynthesis, baby. Big green air machines.”\n“You’re weird, Daddy.”\nOr this one: “Daddy, how do I know what I see is real? I know the light hits my eyes and goes into my brain, but is that sidewalk really there? What about that dog?”\nWhat the fuck do I look like, Socrates to her Plato? (See, a liberal arts education is good for something besides writing call scripts and training sales people.) Or maybe Aristotle to her Alexander. This kid’s going to conquer the world some day. Who the hell wouldn’t love her beyond reasonable measure?\nMy heart aches every time I see her. I don’t ever want her to have what I had. Or didn’t have.\nOr whatever.\nGod damn it, I’m an artist, screw the words.\nTimes like this, I go off and draw dark things with claws and teeth and distant eyes and mommy breasts. Then, sometimes, I roll them up, take them out in the yard when Elaine’s not around, and set them on fire.\nBut sometimes, sometimes, I sell them.\nWest Coast Design Review , last August issue. Fourteen hundred bucks for a illustration of my dreams of childhood. Lewis and Clark realized in a Geigeresque biomechanical mode, Sacajawea as a maternal ovoid.\nMost people have to pay for their God damned therapy. I get paid to perform my own.\nPaging Doctor Freud to the studio, there’s an aesthetic emergency in progress.\nRussell: “Draw more. Get out. Mix with the boyz and grrls.”\nMe: “I’m too old for this shit, got a kid to raise. Plus I got to run the early shift tomorrow since Shirl’s out at her aunt’s funeral.”\nRussell: “Jim, you’re going to be middle-aged toast soon. You’ve got a gift. Fucking use it.”\nElaine: “Family comes first.”\nThen I’m back in the basement drawing evil mommy eating her boy over and over again like some tragic Greek hero, and hiding the pictures from my wife until I can burn them.\nOr send them out.\n“Daddy, daddy, daddy, daddy, daddy, daddy, daddy, daddy, dad-”\n“What!?”\n“Look what I can do.” And she spins a one-handed cartwheel across the basement tile.\nFor the love of God, I’d have to go to the hospital if I tried that. Hell, I couldn’t do that when I was six. Walking in straight lines wasn’t exactly a specialty of mine. Screw cartwheels.\n“That’s terrific, sweetie.”\n“Will you teach me to walk on my hands?”\n“Uh . . . ”\nAnd she’s off. The phone rings, upstairs calling. It’s easier than shouting through the floorboards and scaring the cats. “Pay attention to her.”\n“I’m on deadline.” A piece for Columbia River Review, Woody Guthrie dying on the cross with his guitar in the hands of a Roman soldier. Not big money, but a nice commission. Could be seen by the right people in Seattle, San Francisco. Could get some prints out of it. I’d been thinking about getting into prints. Russell’s influence.\nThe exasperated sigh. The angry, ticking silence on the open line. The kid hurling herself against the basement door like some angry monomaniacal special ed student instead of the girl genius that she is.\n“I’m busy . . . ”\nAnd then I was alone, shit-heel number one for a couple of days around our house.\nSo we were down at Speed Racer’s. Everybody there who wasn’t a drop-in is either too young, cool and good-looking for me, or they were long-established, settled into the scene. I felt like a cross between the new kid on the block and a dirty old man. I mean, I’m sorry, but twenty-somethings in black minis are just too hot for me.\nWhere the fuck have the years gone?\nAt least I managed to get off a few million phone calls along the way. I could have started this stuff in my twenties and saved myself a lot of trouble.\nI would have left right then, but Russell had his fingers pressed hard into my elbow. He was wearing this sequined cocktail dress, which he actually looks pretty good in on account of his narrow ass and long legs, until you see the beard up front.\n“You’re sitting over here, Jim,” he says, like I’m the tard.\nThen somebody’s shouting out themes and there’s a fight between two Realists—I think, I never understood what they were screaming except that they both spoke shittier French than I do, merci beaucoup—and somebody was peeling off the biggest damned roll of butcher paper I’ve ever seen and the easels were out.\nSo I went deep. It was like surfing, finding that energy, riding that wave. Mommy’s in the basement, chewing up the innocent, look out boy, she’s gonna get you. Markers squeaking, memories squealing, spiders crawling out of their memory holes. After a while—a couple of hours maybe?—I look up from a place where my scalp’s been tingling and my sweat’s been pouring and I was shaking like I ain’t done since I got over a bad case of being fifteen, and there were about eight people standing in a semicircle behind my chair.\nRussell was just smiling, beer in his hand. The rest of them were . . . well . . .\nI looked down at my drawing board and jumped out of my chair.\n“Jesus,” I said, “that thing would scare a priest.”\nSome sweet young thing in a black mini hugged me and whispered something in my ear I didn’t catch. It was French, and I’m pretty sure so was her tongue. Then there was beer and someone taped my evil-Mommy into the middle of a kaleidoscope of politicians and helicopters and camels and we had a grand old party that went on way past my curfew.\nOn the way home, I wondered what the fuck had just happened to me.\nGranddaddy was an old man when I met him. I think he was born old. He had that tough Texas soul that didn’t give much of shit for anything but Jesus, plowing the hard red dirt, and saving four percent down at the Piggly-Wiggly by arguing the night manager into the ground.\nHe loved me, I know that. I know that like I know the wind loves the Cascade forests. And his love brought lightning from heaven and seven kinds of hell if I lied about who ate the last Hydrox, and the metal end of the belt for being too noisy after seven o’clock. God is watching you, boy. God loves you, but He’s got his eye on you.\nFamily comes first, boy. God took care of His boy, and I’m gonna take care of you the same way.\nFamily first.\n“Daddy, Paulie showed me his penis.” And she dissolved into giggles.\nA moment of panic. Elaine and I had talked about this a lot—we communicated pretty good, except when it really counted. Mommy’s in the basement, but Daddy’s in charge upstairs. “Hey, kid, you know that’s not talk we want to hear. His penis is private to him, and your vagina is private to you.”\n“Penis, penis, penis.” Another one-handed cartwheel.\n“Sweetie.”\n“Penis?”\nIgnore, ignore, ignore. “Sweetie, if he does anything like that again, you need to tell me or Mommy right away.”\n“Silly Daddy, all the boys do it.”\nSo I went and drew some more.\n“You’re spending too much time in the basement, Jim.”\nI shrugged. “Sorry.” There was a picture nagging me, a bull mammoth striding down Grand Avenue, stomping the busses and cars into the pavement. But the vehicles would all be brass, or maybe copper, shiny in some weird way that I couldn’t quite figure out yet.\n“Is this important? You know I’m really proud of you, but you need to spend more time with us.”\n“Okay.”\nThe next day, an hour of Lynette’s divorce and what the first grade mothers were up to and when I tried to talk about the problems of rendering metallics, a blank stare.\nWe never talk about my work. My love. My fire.\nThat and we haven’t had sex at all in eleven months. Not half a dozen times in two years or more.\nBut down at Speed Racer’s, the girls like me. And they care about art.\n“Family, boy,” my grandfather says, stomping his way down Grand Avenue. He’s tall as the Hawthorne Bridge’s draw towers, and he’s got that bulldog face I haven’t seen above ground since 1973. I can see Dad in him, too, the two of them wrapped together in one giant male ancestor.\nI must be dreaming, but I can’t find my fingers for the proverbial pinch.\nWhere the hell was my family when I needed them? Where the hell were the holding hands, keeping me out of the street and free from worry, those long-ago years when the monsters in the basement had gotten real in the life of some kid with my name and face?\n“Family, boy,” my grandfather says again, and the sky shakes with his voice. His teeth are the hoods of Cadillacs, and the turbines of Bonneville Dam spin in his eyes.\nWhen did Granddaddy become a force of nature, I wonder, as the winds blow me into dark, waiting mouths far below the pavement.\nI won the Meadows Prize. The pre-eminent competition for early-career illustrators. Judged out of Omaha, Nebraska of all places. Russell had badgered me to enter it. Elaine had cheered me on. Ariadne just thought it was funny.\n“We’ll be expressing you the prize money,” said a snippy-polite woman on the telephone. “I do hope you can make it out here to Omaha for the ceremonies.”\n“Yes, ma’am.” Omaha, center of the nation’s call center industry. What with my career in telemarketing, I’d been to Omaha a hundred times. Why couldn’t they hold the damned awards in Hollywood or something?\n“I’m so proud of you,” Elaine had said.\n“Daddy won an award surprise,” Ariadne had said.\nSmiling, we flew off to our eventual ruin.\nArt jams. Shows. An early gallery date at a place just outside downtown Seattle. Did you have enough? Did you do enough? Russell, finally dropping away from pushing me because my momentum had gotten ahead of my inertia. Who needs fucking telemarketing anyway? Other than my mortgage holder, I mean.\nAnd the commissions started coming in. People wanted to look at my pictures of the darkness.\nI stopped burning my illustrations.\nI started photographing, drawing, painting Ariadne more and more.\nElaine started complaining about the trips, the distraction, the ride.\nBut I kept getting the sweats and the tingles and that place inside me where light blazed up and cast a shadow on my drawing table until something burned into being. And sometimes that burned thing was good.\nEvery once in a while, it was damned good.\nWho the fuck ever knew I could do this?\nEleven years of marriage and I had to go fall off a cliff over someone else. What the hell was wrong with me? Thirty years in his grave and Granddaddy is shouting even now.\nI’d gone off to San Francisco for a big show on the strength of my Meadows win. My chance to be seen along with some of the great names in the illustration field. People whose work I’d been admiring since I was a kid.\nSome of whom knew my name these days.\nIt was glorious. Tuxedos and two-hundred-dollar bottles of champagne and the art press from New York and L.A. and even Tokyo. I mean, SoHo this ain’t, but there’s layers and layers inside every world.\nWho needs telemarketing?\nThe fire was hot inside me. The world loved me. And she came walking by.\nI won’t tell you who she is. An artist, like me. The rest of it’s nobody’s business but hers and mine. And we didn’t get up to any business between us, not serious business at any rate. I know better.\nBarely, at least on my end of the affair.\nBut I walked out with a flute of bubbly in my hand through a cascade of photo flashes into the Mission District night and wondered how the hell my heart had felt free to roam when my head knew far, far better.\nIt was a long drive back to Oregon. Lots of head time.\nThe fire burned in my head, in her eyes, in my hands trembling on the wheel as the miles clicked by and my thoughts spun.\nI called Russell from the car somewhere up around Weed. The hour was very, very small. “I’m hosed, buddy.”\nHe yawned. “Take a number, man. Aren’t you up a little late?”\nI’d thrown the champagne flute out the window a hundred miles ago, but my tongue was still loose. “I’m never going to sleep again. I don’t want to dream.”\n“What happened? You get arrested or something?”\n“I got success disease, Russell.”\n“Some people have all the luck. Go to sleep, man.”\n“Not at eighty miles an hour.”\n“Pull over. Call me tomorrow.”\nI got a room up at the state line, crashed out, didn’t sleep ten minutes the whole night. Four hours later, avoiding Elaine, I called Russell again.\n“I’m going to block your number, man, keep this shit up.”\n“Yeah, yeah.” How many nights had we drunk away his gender issues? “Look, what’s wrong with me?”\n“For one, you make too fucking many phone calls.”\n“Seriously. Russell, dude, I got the fire. The fire’s got me.”\nRussell knew from the fire. We’d talked about it enough. “Yeah . . . ?”\n“I either got to dive all the way in or quit this stuff.”\n“Uh . . . yeah?”\n“There’s a girl, Russell.”\n“You didn’t . . . did you?”\nI hated the way his voice rose. Almost hopeful. “No,” I snapped. “But I could have. And that scares me shitless.”\n“Um, man, look, this ain’t exactly a surprise.”\n“It is to me.”\n“Not to some of us. You’re going somewhere, man. This is your way of finally noticing it.”\nI hung up on him and got back out on the highway. Five more hours of blacktop should do me good.\nItem: I live in a house where I can sit in none of the chairs. They are dainty and lovely and not for me.\nItem: I live in a beautiful house.\nItem: Elaine won’t look at my work, or talk about it.\nItem: I am well-loved.\nItem: I am a fly trapped in tree sap, no longer happy to live in amber.\nItem: I am well-loved.\nItem: My life is on fire.\nItem: I am well-loved.\nItem: I can see those flames in her eyes.\nItem: I have a child. But I married my mother.\nItem: Family, boy. Family first, or you’ll feel the metal end of my belt.\n“So, how was your trip, Daddy?” Ariadne has her serious, I’m-talking-like-a-grown-up voice.\n“Busy, sweetie.”\nThe phone rings. Upstairs calling. There is strain in Elaine’s voice, irritation barely concealed at my wandering ways. The art jams, the conferences, the shows. San Francisco. “Could you come up here, please, and talk to me.”\nThe Mommy demons with their glittering teeth follow me everywhere now. I carry my basement in my head all the time, and my scalp prickles.\nSpeed Racer’s was pretty quiet on Tuesday morning. I’d skipped out on a loyalty program meeting and two quarterly account reviews.\nLike any of that stuff mattered.\nWaiting for Russell, I suddenly realized I’d been happy being a marketing monkey all these years. Happy until I’d set fire to my life with art.\n“Hey,” he said. My buddy was wearing a pink Hello, Kitty! top with cupped sleeves and one bra strap showing. This over Bermuda shorts and a pair of Docs so clunky he could have gone stevedoring in them. In Omaha that outfit would have gotten him beaten, then arrested. In Portland no one noticed.\n“Hey.” I couldn’t get much more than that out.\n“How’s the art fire?”\n“Burning.” I’d been doodling a chrome-steel breast on my napkin. The nipple had razor spikes barely sticking above the bumps. I pushed it over to him.\n“You need a date, man.”\n“I’m leaving,” I said.\n“I just got here.”\n“No, no. I mean, I’m leaving Elaine.”\n“Oh.”\nThere was a latte-punctuated silence that lasted quite a bit longer than our normal pauses. Finally he filled it. “Art or family, huh?”\n“Art or family. There is middle ground, I guess. Nothing but compromises.” I pushed my face into my hands, as if there were wisdom to be found at the junction between my knuckles and my cheekbones. Talking through my palms, I said, “Anything else will be endless negotiation. I’ve had years of practice stalling what I want and need.”\n“You’ve grown apart.” I could hear the rustle of his shrug. “It happens.”\nMy eyes stung. Thank God for concealing fingers. “Ariadne. It’s Ariadne.”\n“You’re not running out on your kid, man. You’re running into the fire. She’ll love you for it.”\nSomeday.\nLove yesterday, love tomorrow, love someday. But fire today.\n“Come here, boy.” Granddaddy always smelled of tobacco and sweat, and whatever that old man lotion is they sell down at the drugstore.\nI sat on his lap. It was like climbing a polyester cliff face. Hands bigger than my head closed around my thin wrists.\n“Family,” he hissed hot in my ear, this man who’d been married to the same woman for going on fifty years and never called her by her first name. “Family always comes first.”\nYou never knew the fire, Granddaddy. Or if you did, you walked away from it. And sir, with all respect to your seniority in the armies of the dead, I can’t tell you which of those things might be the more sad.\nThere’s never any reason to leave your family behind. When Mom and Dad did it to me and left me with him, I came to swear that I’d never do the same to any child of mine.\nEspecially that beautiful kid with her hand tucked between my fingers.\nNow Daddy’s in the basement, chewing up the innocent.\nThe late Jay Lake was a highly talented and highly prolific writer who during his tragically short career seems to have managed to sell to nearly every market in the business, appearing with short work in Asimov's, Interzone, Tor.com, Clarkesworld, Strange Horizons, Aeon, Postscripts, Electric Velocipede, and many other markets, producing enough short fiction to fill five different collections: Greetings from Lake Wu, Green Grow the Rushes-Oh, American Sorrows, Dogs in the Moonlight, The Sky That Wraps, and, most recently, the posthumously released Last Plane from Heaven. Lake was also an acclaimed and prolific novelist, whose novels were Rocket Science, Trial of Flowers, Mainspring, Escapement, Green, Endurance, The Madness of Flowers, Pinon, and Kalimpura, as well as four chapbook novellas, Death of a Starship, The Baby Killers, The Specific Gravity of Grief, and Love in the Time of Metal and Flesh. He was the co-editor, with Deborah Layne, of the six-volume Polyphony anthology series, and also edited the anthologies All-Star Zeppelin Adventure Stories, with David Moles, Other Earths, with Nick Gevers, and Spicy Slipstream Stories, with Nick Mamatas. He won the John W. Campbell Award for Best New Writer in 2004. Lake died in 2014."}