{"fingerprint": "Dq87II/1BO2gEQmPDGhvC3+em5E=", "sitename": "Clarkesworld Magazine", "title": "Rolling Steel: A Pre-Apocalyptic Love Story by Jay Lake and Shannon Page", "author": "Jay Lake; Shannon Page", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lake_04_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Rolling Steel: A Pre-Apocalyptic Love Story by Jay Lake and Shannon Page", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6160 words, short story\n Rolling Steel: A Pre-Apocalyptic Love Story\n Rough Beast slouched toward the Bethlehem steel mill. Tons of fresh hot metal in there, every cobber and new chum from the Allegheny to the Delaware knew that. Even Topper, the old cat-eyed bastard with steel cables for fingers and a brain stewed in barium-laced æther, knew which way the good stuff lay, for all that he couldn’t tell up from down on days ending with a /y/.\n He’s a bad man, our Topper. Used to run child-soldiers over the St. Lawrence to the Froggies during the Quebec-and-Michigan War. La troisième mutinerie, the Quebecoise called it in one of their endless prayers to St. Jude, for if ever a cause was lost surely it is theirs. Wolfe had put paid to their ambitions at the Plains of Abraham two centuries earlier, but no Frenchman ever born minded much dying for the romance of a shattered heart.\n And there was no heart so shattered as that of a patriot whose country has been brought to ground.\n And so we have Topper, driven bird-mad in the trenches of the Somme when it would have been kinder for him to have just died. Came home he did to the quack attentions of the New Friends of Sweet Reason, got caught up in the Technocracy movement as exhibit A, and finally fell apart as the country itself did in Roosevelt’s dying days.\n Now there’s Wehrmacht units on the loose from Nova Scotia to New Jersey, the South has risen again (and again), the Federals are barely hanging on in the Mississippi basin, issuing wireless dispatches from Washington-on-the-Rails while the Great Madness takes anyone stupid enough to be caught outside at night anywhere between the Wabash and Pamlico Sound.\n Only those who started mad can stand the stuff, and move faster by night than any prayerful man might by day. Especially Topper in his Rough Beast, which once upon a time was a machine meant to kill other machines before he made so much more of it, oh so much more.\n “Metal, my pretty,” he whispered, patting with a clattering crackle of steel the crawler’s upholstered dashboard between the engraving of Percy Bysshe Shelley and the platinum-dipped weasel skull with the rhinestone eyes. Only one of those two had he killed, Topper, and some days he knew the difference. He squinted into the depths of night through the prism that made up Rough Beast’s forward vision block, watching for the mill which loomed close, its fires never banked.\n Fate and fortune walked on the greased knuckles of Topper’s war machine, as never they had since Poland’s borders collapsed in the first of the lightning wars.\n I patrolled the unquiet streets south of the steel mill, cussing as I walked back and forth in my own precious allotted square block of turf, practically wearing channels in the concrete with my steel-heeled stilettos. “Bastards,” I muttered, thinking of the Best Sister and her Little Chums. Well, ‘bitches,’ technically, but I didn’t fancy using such a term of endearment when referring to their ilk.\n “Bastards,” I growled, as I turned the corner for the seventeen-thousand-and-thirty-second time, only this time I was thinking of my crib mates, the ones who had sniffed out some sort of rupture in my soul and handed me this godforsaken turf as my undue reward.\n “Bastard!” I screamed, jamming to a halt as the ferocious machine loomed before me. Hadn’t heard the fucker coming at all. My NKVD surplus large-bore riot gun was already raised and trained on the madman coming up from a top hatch, red-lacquered nail rattling against the trigger as my finger trembled with desire. Then I saw it was Topper.\n Which didn’t change my assessment of the situation, or my epithet. But I did lower the gun, and hike up my leather miniskirt an inch or two.\n The gibbering fool grinned down at me, leaning over the console in a halo of actinic light to stare down the front of my corset. I set my shoulders back to improve his view and leered right back up at him.\n “Going my way, big boy?” I called out.\n “Bethlehem, Bethlehem, Bethlehem!” he chanted, his eyes rolling in his head. Oops, there went the tiny whisper of sanity I’d detected a moment ago. I danced back a step, just in case the worms in his brain told him to gas up that monstrous vehicle and put paid to the sexiest thing he was likely to see all day—any day.\n My heels tapped on the sidewalk as I leaned against the wall of the foundry behind me. “And what are you going to do when you get there, mm?”\n “Steal,” Topper said, letting the word do its double duty. “Stable.” Another word doing double duty. He stared down at the woman. Someone from another lifetime, Topper knows with animal cunning and vestiges of functional memory.\n He has had many lifetimes, our Topper. Lived them all together inside one much-mended head, until his name has become legion because he is many. Swine out of Garaden could not be more multiplicitous than this man. But even through the palimpsest of his personality, this woman emerges like a slave ship out of an African fog bank.\n “Coming with?” Topper asked. He gunned his twinned diesels for emphasis. Rough Beast shivered like a dog about to piss. The woman looked scared but determined, a combination which even Topper cannot ignore.\n He locked down the upper hatch, set the brakes, pegged the clutches, disarmed the antipersonnel charges on the outer hull, and crawled back between the ammo cans and the fuel bags to undog the ventral hatch. As he twisted the clamps, Topper hoped the woman hadn’t run away or been jumped or something. He can’t protect her from up here. Rough Beast is made for salvage runs and fighting heavy metal, not personnel escort.\n Topper is confused about a lot of things, but he’s not confused about what his crawler does.\n The woman was still outside, armed and dangerous. And that was just her looks. Dark hair swept back from an aristocratic face. Pretty teeth, which Topper remembers from white rooms full of screams. She had a big gun, too, a riot weapon meant for stopping dogs or people caught in the Great Madness.\n “You’re going to the plant,” she said.\n It was not a question.\n “In,” Topper ordered by way of a non-answer.\n Indecision flicked across her face like a trout in a mountain stream, then she climbed the metal steps he’d dropped down for her. Rough Beast had ground clearance that would give an arborist’s ladder a bad case of envy.\n Distant gunfire echoed as Topper dogged the hatch, but the incoming wasn’t to their address. He wormed back up to the driver’s station, leaving the woman to follow or not as she chose.\n The crawler got moving with a shuddering lurch which foretold trouble for the portside throw bearings. He could rebuild. He just needed some high-grade ingots to trade out for the finished parts. That was how he took care of everything on this monster.\n A single man wasn’t meant to maintain and operate something like Rough Beast. Not even a single man as profoundly unalone as Topper.\n The woman squirmed into the radio operator’s seat behind him. That surprised Topper, he’d already forgotten about her. No radio, never had been one, but there was part of a sandwich rack out of an automat right in front of her face, as if she could plot their course in egg salad and bologna and trimmed crusts.\n “So.” Her gun thumped briefly against the floor. He noted she was smart enough to clip it to the seat pedestal. “When did they let you out?”\n Topper had to think that one over for a while. Finally he said, “Ain’t sure they have yet.”\n Call it boredom if you like. I won’t dispute it if you do, not at all. Boredom, ennui, a sense of adventure left unaddressed for far too long—any of that could explain why I left my post and crawled up into that oil-dripping beastie with the lunatic pilot.\n When I’m summoned before Best Friend and her bitches to explain myself, though—and you know I will be—we won’t be talking about any ennui bullshit. No, I’ll be spinning some tale about surveillance and undercover and getting on the inside of the enemy camp and all that sort of yak.\n To support this notion, and also because I was damned curious, I slithered up the ladder at the behest of the grisly creature. (Hey, don’t let it be said I never plan ahead.) I’d known Topper before, of course; knew him before he was the raving lunatic we’d all come to know and love in the Madness. Not that he was ever entirely sane.\n Who is, any more?\n I knew him because I’d been part of the crew that had taken him down, during the last round of the world-shifting adventures. We’d taken him hard, real hard, even before handing him over to the New Friends for, shall we say, readjustment therapy. I’d never expected to see him again. Which was shame, in its way.\n So here he was, grinding up my street on his way to god-knows-what kind of tomfoolery down at the plant. Didn’t even bother to deny it. Invited me aboard.\n How could I resist?\n I settled in behind him, looking around everywhere, trying to take it all in before he came to whatever shred of senses might have been left him by the New Friends and booted me out of there. Because, right, surveillance. Remember? I kept my right hand close to the NKVD riot gun in case Mr. Topper decided to get cute. But he had already started the monster rolling again, ignoring me completely.\n He answered my question well enough, I suppose. All things being equal, you never really do get out, do you?\n I fell silent after that, wishing the asylum refugee had thought to put windows back at my seat. What was I supposed to do with A-4 and D-0? I’d had a lovely lunch already, thank you very much. The rats are fat and sassy, this part of town.\n Oh, Jesus, just kidding. What do I look like? I don’t eat rats. You think this figure comes from eating street sludge like rats?\n Feral cats, now: that’s where it’s at. Yum yum, meow yum. Excellent diced and stir-fried, with tree ears and a sprinkling of hoisin sauce right at the end.\n After a particularly difficult highway crossing, Topper’s mind wanders back to the woman. She was muttering under her breath now. Something about rats and cats and someone named Hawser Ann. He could smell her breath even in the diesel-and-metal reek of the crawler.\n Cats was right in there. Topper cackled. He’d had a cat once, lived in the bed with him in the pale green room with the telephone that whispered secret vices in his ear-of-virtue, and blessings in his ear-of-vice. He knew what had happened to that cat too, every time he blinked his eye.\n Our Topper spent some quality time under the close personal care of Doctor Sergei S. Bryukhonenko, after the good doctor B. had fled the collapse of the Eastern Front and wound up under a New Friends of Sweet Reason ban working out of a former mental hospital in the quiet fields near Yellow Springs, Ohio. The fields were quiet then because of the gas pooling in the low-lying watersheds which killed off everything with a central nervous system.\n Dr. Bryukhonenko had been the beneficiary of good pressure seals and a number of human canaries chained to stakes in a three-mile radius around the hilltop facility. Our Topper had been the beneficiary of Dr. Bryukhonenko’s newfound health and safety.\n Until the psychosurgeries began.\n Now he saw in strange shades of gray, a world of movement and chiaroscuro, relying on childhood memories of paintboxes and flower gardens to fill in the colors. Topper still knows the curve of a woman’s breast from the rounded nose of a bullet—he’s not that far gone—but so much else slides past the greased corners of memory, electroshock therapy, and deep conditioning, as if he were a human carpet afflicted with flea’s eggs.\n “Food?” he asked the woman. A gap yawned before the crawler, smoke crawling up out of some nether hole in the Pennsylvania soil. Mine fire? Enemy attack? Wrath of God? He navigated around it while one of his inner selves listened to her answer.\n “Is that a request or an offer?” She began suggestively polishing the barrel of her riot gun.\n “Dunno,” Topper said. “Thought you might have some catsmeat.” He felt vaguely like a cannibal for asking. Then his attention was distracted by the towering stacks of the mill, his destination. Someone flew a small aircraft close above them. He resisted the urge to jump up into the air and swat at it.\n For all Topper knows, he might be able to do just that. Muscles he didn’t know he had creaked at the thought.\n “Rowr,” the woman growled.\n He wondered if she would purr, as well,\n “You don’t remember me, do you?” I asked the lunatic, after he’d failed to respond to my clever sally about the cat. I’d even growled to remind him. Good times. But I’m not even going to tell you about the look on his face when I did that, now.\n Suffice it to say, crazy or not, the man had a strange charisma. And not because I was hard up, either. Not that I was ready to hop into the sack with him. Not right then. Not even the floor of this machine, or up against the wall of the mill. Not me.\n The mill! A squinting straining gaze through what I could see of the forward view told me we were almost there, though Topper hadn’t even been paying attention to the road. “Road”—such as it was, of course. The route, more like.\n “Harridan Three, Harridan Three, do you copy?” a small voice crackled from my satchel. Damn, it must be one of the bitches in that plane buzzing overhead. Checking up on me. They don’t trust me to wipe my own ass, any more.\n Of course I couldn’t respond, not overtly. But if I didn’t send her on her merry way, she’d land that overgrown horsefly right in our path, and . . . well, let’s just say I didn’t fancy being two feet behind Topper when he was suddenly beset by Sisters in a well-armed aircraft, attempting to halt his forward progress.\n “Nice rig you got here, Topper,” I said instead. “I especially like the seats. Ooh, comfy.”\n He tore his attention away from peering up at the sky and stared at me. A droplet of slobber formed in the V at the lowest point of his lip and hung there. “Seats?” he finally asked.\n “Yep,” I said loudly, patting the foul cracked vinyl next to me. “These seats right here, in this-here vehicle you’re driving me around in. Yep. Love it.”\n “Harridan Three, we copy,” came the voice in my bag. It was Lena: bad news. And she was clearly pissed.\n But the drone of the plane engine faded, and then the mill loomed large.\n Too large.\n “Stop!” I screamed, just as this abortion of a tank crashed through the wall.\n Topper came round to paying attention to what he should be doing just after a few dozen tons of masonry bounced off the roof. That plane had buzzed off, but it had dropped him a present on the way out.\n He spun Rough Beast left, just to confuse anyone who might be sighting in on him. From the sound of things, the crawler was now taking out another portion of the mill’s outer wall. The hull pounded and shuddered, a brick rain.\n “Where’s the map?” he screamed over the deafening war.\n She shook her head. Useless bitch, he thought. Bring a girl on a picnic, she doesn’t even remember napkins. Topper keyed off the antipersonnel charges ringing the upper hatch and jacked his chair for a look. He let his feet do the driving.\n Thing about a cat’s eye is it sees in darkness. Not the pitch black of coal mines or a politician’s soul, but places where a human being would stand blinking and wondering which way to the egress. The very bad Dr. Bryukhonenko had built a neural jumper block so the input from the cat’s eyes jammed swollen and dry into Topper’s skull could be made sensible—sense-in-light for a man who lives in the endless nonsense of his own head.\n All of which meant that with the Bethlehem mill running on blackout except for the glow from the Bessemers further down the compound, only Topper could see what was going on. The defenders had to rely on triangulation and their own knowledge of the terrain. Topper was ignoring the terrain in favor of the direct approach.\n “Damned loading yard ought to be down here somewhere.”\n Rails had been torn up a long time ago—their fixed routes were useless in this age of rolling borders and continuous sabotage—but the rail yard was still useful space.\n Having gotten something resembling his bearings, Topper spun Rough Beast around. The wide open area had been behind him.\n A woman was screaming from down near his waist. She sounded familiar. He jacked the chair low and looked around.\n “Marie,” Topper said, pleased as hell to see her. “What are you doing here in San Diego?”\n The look on Marie’s face was almost frightening. The gun in her hand worried him more, though. When had she learned to shoot?\n Outside, the aircraft buzz had come back. Fucking spotters, he thought. “Whoops, got to go,” he said, “bad guys up above. Hold that fire til we need it, kiddo.”\n By the time Topper was back out of the hatch and heating up the solenoids in the remotely-operated turrets, he’d forgotten what he’d gone down for. Until a gunshot echoed from inside the hull of his crawler.\n Bastard flipped completely out on me after the impact. I mean, I shouldn’t have been surprised, but it wasn’t like I’d been having a peaceful day up till then, so I was a bit, well, off guard.\n Hey. It happens.\n Once the machine (not to mention Lena’s bomb) rendered the wall of the mill into so many smithereens, it lurched but didn’t stop, instead simply veering off to the left a bit. Or maybe that was Topper, yanking on the wheel. Anyway, that’s the part that rattled me more than anything else. I was airborne a good two seconds, then crashed to the slimy floor of the tank-thing at his feet.\n At least I held onto my gun.\n Which stood me in good stead once I’d recovered enough to think again. The freak was looming over me, again paying no attention to the road, or corridor, or whatever it was we were driving down at the moment . . . yeah, another wall, I think . . . interior wall. It was hard to tell, jammed underneath two hundred and fifty pounds of insane manflesh.\n I waved the gun at him. “Back off, Topper, I mean it!”\n He called me Marie.\n Oh god.\n Waving the gun again, I tried to look sufficiently menacing. This was no doubt undermined by his view down the front of the corset. He grinned, and mumbled something about San Diego. What the fuck?\n Maybe I was still screaming or something, because just then Lena decided she’d had enough. “Harridan three, we’re coming in. You’re relieved from duty effective immediately. Surrender your weapon to the personnel who will be approaching the tank once we bring it to a halt.”\n I almost laughed. How exactly were they expecting to do that?\n A burst of machine gun fire came from above, mixed in with the aircraft engine. Oh, that’s how. At least it got Topper’s attention. He yanked his eyeballs away from my girls and scrabbled up top.\n Unfortunately, I didn’t want Lena to take his attention. Nor did I want to “surrender” anything to any goddamned “personnel” inside Bethlehem. “Topper!” I yelled, but he was beyond hearing me.\n I took a shot in his general direction, careful not to aim for anything vital. Like around the middle. Riot loads weren’t supposed to be fatal.\n What? Just thinking ahead here. He’d cleaned up nicely once before. Who’s to say it couldn’t happen again? Girl can’t be too picky these days.\n Good. That got his fleeting attention once more. He slithered back down below and stood before me. “Marie?”\n “Not Marie,” I said. Then I reached down and toggled my radio to blessed silence so we could talk privately. “Grace, and don’t you forget it, you moron.”\n “Grace . . . ” The name slid off his pink tongue, making it sound dirty. “Graaace.”\n Oh good lord. We were in for a long night.\n Topper stuttered. That’s what the doctor had called it—not Bryukhonenko the surgeon, but that New Friends woman with three moles on her chin that always made him think of H. G. Wells’s War of the Worlds for some reason.\n Threes, all evil things came in threes. That’s why men and women stayed in pairs. That’s why a woman had two tits, a man had two nuts, everyone had two eyes, two ears, two hands, two legs, two nostrils, two lungs for the love of God.\n Threes. And the stutters always came in threes. Dr. Roseglove, that was her name, like she had thorns turned inward to her hands, tiny red-brown spikes to pierce the skin, an Orchidglove would have been a very different doctor indeed, or a Lilly-of-the-Valleyglove and when he stuttered he lost time, he lost control, he lost his marker in the place of life.\n Bad things. Threes. A woman named Marie, not Grace. But he’d known Marie? Had she been a twin? Or worse, a triplet? Was Grace her middle name, her secret name, her confirmation name, her gang name, her spymaster’s handle?\n She was shouting. Outside something was bombing. His thigh hurt like fucking hell where something bad had happened.\n Adrenaline, he thought, a moment of clarity amid the stutter. Adrenaline and a pressure bandage, before I die of assassination.\n Why would anyone want to kill our Topper? Even he cannot answer that. Well, other than all the people he’s killed over the years, of course, but very few of them have anything to say about it now. Dead is dead, and no one’s got relatives no more, not in this fragged world.\n She’s still yelling, this woman, but he’s ignoring her in single-minded pursuit of his wound. He doesn’t worry so much about the scattered pellets embedded in the flesh of his leg. They will either kill him or they won’t.\n Topper jacked up into his open hatch. Rough Beast wasn’t equipped for anti-air operations. An angry woman loose with a riot gun down below was a problem. Amplified voices and high explosives outside were a bigger problem.\n He left his stutter behind when he realized that his enemies had come to ground. Obliging of them. Rough Beast was very well equipped for anti-personnel operations.\n A beefy woman stood in the red glare between shadows cast by his own arc lights, shouting for someone named Jason Adair to stand down. Topper didn’t know any Jason Adair, not since before the wars began when he might once have answered to that name, so he activated the electrically controlled chin turret that looked like a fuel junction and could surprise an unwary, beefy woman and turned this one into a spray of blood and cloth.\n Then he ground the crawler straight toward the ducted fan aircraft grounded before him. Topper admired the engineering of the thing—innovative, frightening, probably stolen from the Germans—until Rough Beast crushed it to scrap.\n He wasn’t sure which was more annoying: Marie screaming from below or some woman screaming from the crushed cockpit of the aircraft. In either case it didn’t matter. The metal yard was ahead, and that was his purpose here.\n Okay.\n Fuck.\n Breathe. Just get hold of yourself: breathe, bitch.\n ‘Cause when Topper took out Lena and her bodyguard du jour, not to mention the whole fucking aircraft thank you very much, well, okay, it sent me into a bit of a spin.\n So maybe I shot him again. Just a little bit. I’m really not sure, frankly. Everything got kind of crazy and blurry there for a few minutes. Like maybe there were psychotic drugs floating in the air around Topper.\n No, I didn’t mean anti-psychotic drugs. That would have helped. I meant what I said. Pay attention, I’m not going to say it again.\n It didn’t make a damn bit of difference to his apparent sanity, or lack thereof. I mean the shooting-him-again part, if it happened. The drugs, I have no idea. That was just a metaphor kind of thing. I was making a comparison, one thing to another.\n Although who knows?\n Anyway, my sanity, however. Well . . . like I said, I lost a few minutes there. Once everything was tracking again, I saw that the aircraft was a pile of oily rubble behind us, and Topper was rolling the tank forward, muttering about Germans.\n He never stopped with the verbiage, that one. If only any of it made the smallest bit of sense. I’d love to see him across a poker table. Looked like every thought was immediately broadcast.\n Not that I was likely to be playing poker again any time soon. Anyway, Lena had my deck of cards. Probably they were ground into the mud behind us, too.\n Mud and oil and blood and . . .\n Don’t think about it. Don’t think about it!\n I clipped my riot gun back into the rack beside the seat, just in case I was tempted to use it again. Because the part of my brain that had been functioning throughout the little misadventure of the past few minutes had just presented me with the irrefutable fact that my fate was now tied to that of this overgrown monkey, the one now drooling and gibbering and steering this massive bit of machinery towards what had to be the biggest metal yard I’d ever seen.\n In other words: no more Sisters, not for me, not here, not now. By climbing aboard this contraption. I’d thrown my lot in with Topper.\n God, I hoped he still cleaned up nicely.\n I sidled forward in the cab, or at least something reasonably approximating sidling. Tough to do when the thing was rolling and grinding and rocking back and forth, throwing me from side to side like a hamster in a blender.\n “Marie!” he said, catching sight of me. He gave me a delighted smile.\n I fell into the copilot’s seat beside him, or whatever you’d call it. Jump seat. Small bit of cushioning in a vast expanse of well lubricated metal parts and pieces. “Grace,” I said, in a friendly and conversational tone.\n “Marie-Grace?”\n “Just Grace. Remember, sweetheart, how we went over this?” He kept staring at me. “Well—never mind that, anyway. Just watch where you’re driving, okay?”\n “Driving, doing, zooming, duckling,” he said. But his head wafted back in the general direction of forward.\n “Good boy,” I said. “Just keep doing what you’re doing.” Sooner or later, some of this was going to make sense. For now, he just had to keep us alive.\n “W-74,” Topper sang out. “Tungsten steel. Hard as a shield, cuts like a blade, keep it sharp, never be late . . . Burma Shave!”\n Marie-Grace Just Grace snorted at him. He was pretty sure she’d shot him a bit earlier, but she had a nice smile. Maybe he’d been wounded one of the dizzy bitches from that airplane.\n Bullets fell on Rough Beast’s hull like lead rain. The locals were getting to it. But now he was in the metal yard, the El Dorado of this Pennsylvania hellhole.\n “Here, Missy Marie-Grace Just Grace,” Topper said, handing her down a gas mask. “Wear this a while and don’t get nothing on your skin.” He paused, solicitous as a fragment from some long-forgotten safety briefing (back when “safety” and “briefing” were applicable concepts) emerged into his forebrain like pack ice on a midnight river. “You weren’t planning to have no children, were you?”\n “Not right now,” she squealed.\n Topper wasn’t sure that Marie-Grace Just Grace had taken the real point of the question, but duty had been discharged. He pressed the big red button labeled “DO NOT PRESS.” It was wired just below a portrait of Bing Crosby with a Hitler moustache.\n Several loud, ominous thumps echoed from the outside of the crawler’s hull. This was followed by a hissing noise. Topper belatedly remembered to pull on his own gas mask, then wondered what he’d done with the chemical suit.\n The part of him that was sane enough to keep the rest of the traveling circus alive watched the sweep second hand on the dashboard clock—Swiss timing in a genuine hand carved Chinese ivory casing, and possibly the most valuable thing aboard Rough Beast. Topper liked his treasures portable. He was a man who’d left more towns under more clouds than Seattle saw in a year.\n One hundred and eighty seconds later he bailed out into the dissipating yellow fog. Defending fire had stopped, except for the occasional stutter of a weapon discharged as a finger shriveled too tightly in death. That hardly counted, though Topper knew a bullet was a bullet no matter who had fired it.\n He wasn’t moving right. The dizzy bitch really had shot him. Couldn’t have been something too fierce, or his leg would be shattered. Riot gun with rubber loads, maybe? Who the hell would hang around a Pennsylvania mill town at night armed with sublethal munitions? That was like bringing a housewife to a bullfight.\n Ahead of Topper were thirty-six pallets of high grade tungsten steel. Finest kind, ready for shipment to the manufactories of Detroit and Fort Wayne. Or ripe for the jacking by an enterprising man with good intelligence and solid orders.\n Or woman, he reminded himself. Topper turned to stare at Rough Beast, wondering what he’d been thinking and which part of him had been thinking it. Her head poked up now, insect-eyed and blank-faced in the gas mask.\n An electric turret whined as she brought one of the Bofors to bear on him.\n “Screw you,” Topper shouted, and began dragging the cargo chains out. It was hijacking time. He didn’t have what it took to die again right now.\n After monkey-boy propositioned me a few times, I knew we were getting somewhere. Excellent. I could work with that.\n The discussion of children, however, was a tad premature. I almost said something, but then he pressed some big goddamn red button and all manner of excitement began.\n No, the other kind of excitement.\n That all changed once he’d killed everyone within a ten-mile radius of the tank. Or so it seemed, anyway, given the swath of destruction all around us. After that, he turned back to me, with a terrible, deeply insane look about him.\n I mean, he’d been insane all along. I knew that. You might have even said it was part of his charm. But I’d just watched him kill everyone I worked for, lived with, fucked and fought. Then I’d watched him kill everyone at the mill I was supposedly defending. Then he turned and looked at me.\n “Now or never, baby,” I said to myself, cranking one of his cannon turrets to point at him. That ought to put the fear into him.\n All he did was proposition me a third time, then turn away and start fooling with a tangle of chains.\n I threw my riot gun at him. Insane I can handle. Inconsistency: that makes me crazy.\n “Mary Grace Just Grace,” he babbled on, as he started spreading the chains out on the gravel in front of us. He ignored the riot gun completely, after glancing at it. I clambered down out of the tank and retrieved it, but it was too big to hold if I was going to help him get the pallets aboard.\n Sure, I helped him. He could barely move the damn things. I was in far too deep to back out now. Might as well get our business done in here and get the hell out. Then we could talk about children, or whatever the fuck he wanted.\n Men. Can’t live with ’em, can’t stake ’em out for the vultures. Though some of them might be improved. Including this crazy old bastard.\n He was my last ticket.\n Topper yanked the cold steel out of the charnel house of the mill one quarter-ton ingot at a time. The winches could handle the load, no problem—they were made for much heavier work than this, naval-grade hardware salvaged off a captured Kriegsmarine surface raider which had been broken in a gray-market yard hidden up the Rappahannock.\n The girl helped. She was small, and weak, and not half-rebuilt out of spare parts and Soviet medicine, but she was tough and smart. Topper wondered how he knew her. Good-looking, too, and not just in an any-woman-in-a-war-zone way.\n Somehow having his hands on all this hard-case metal was bring him back into himself. Memories spiraled in kaleidoscope paths to land in partially assembled chiaroscuros somewhere deep in our Topper’s head. Like how a real person might think, it occurred to him, coherent images and more than a little bit of focused recall stitching together into timelines.\n He wanted to turn away from some of them—deeply unpleasant, unpleasantly deep, or just infused with a stunning sadness for the boy and man someone with his name and face might once of have been.\n It was her, he realized. Not the metal. Not the dead. Not the distant thump of artillery and first drone of engines gone raiding in the cold, smoky sky. Not the screaming cats and bleeding eye sockets of memory. Not the white coats and wire-rimmed spectacles which had dominated so much of the intervening years.\n Her.\n Topper stepped closer, subtle as a pork roast in a synagogue, and sniffed.\n “What the hell are you doing, you cre-” she shouted, then stopped when she got a good look at his face.\n “M . . . Grace,” Topper said, and looked her full in the eyes. He could fall into that pooled, dark amber forever, he realized.\n Something was waiting to be born here beneath the shadow of Rough Beast, behind the walls of Bethlehem. He could feel it stirring inside him.\n A soul. Hope. Affection.\n Love?\n He closed his eyes and breathed her in. She struck him all the way down into the lizard brain, scent and smell wired by million years of evolution and a hundred thousand generations of hairless apes dropping from the trees to say, this one. This is the one.\n Before he could open his eyes again, she kissed him.\n Somewhere inside the shattered Japanese puzzle box of his head, he was made whole.\n “Let’s get the last of this stuff on board,” Topper said, rough but gentle as he drew her into his arms. “Then we’re gonna say screw it to the Sisterhood and the New Friends and the Federals and the Wehrmacht and go be alone together. There’s freemen in the Alleghenies would pay good money for our cargo, and hire us to raid for them.”\n His mind was dancing with visions of a quiet cabin, an open sky, and skin exposed for no purpose more sinister than a long slow trail of the tongue.\n God, it was like being a kid again.\n For the first time in his life, Topper had woken up.\n Yeah. So. Okay, I kissed him. Like I said, I’d kind of run out of options at that point.\n But it was more than that. Much more.\n When Topper turned and looked at me, really looked at me; when he got my name right; when the man that lived somewhere underneath all the layers of insanity our world had thrust at him suddenly bled through and took charge . . . I kissed him.\n And when he pulled me into his arms and I caught the scent of him—the real, true scent, beyond the oil and blood and gasoline and the rank sweat of fear and battle—it hit me right below the belt.\n Yeah, there. I meant what I said. How do you think things become clichés, anyway?\n “Right,” I said. “Last load and we’re out of here.”\n And we rumbled off into the sunset. Sunrise. Whatever: I’m telling the story here, okay? The light changed and took us with it into a different world.\n The late Jay Lake was a highly talented and highly prolific writer who during his tragically short career seems to have managed to sell to nearly every market in the business, appearing with short work in Asimov's, Interzone, Tor.com, Clarkesworld, Strange Horizons, Aeon, Postscripts, Electric Velocipede, and many other markets, producing enough short fiction to fill five different collections: Greetings from Lake Wu, Green Grow the Rushes-Oh, American Sorrows, Dogs in the Moonlight, The Sky That Wraps, and, most recently, the posthumously released Last Plane from Heaven. Lake was also an acclaimed and prolific novelist, whose novels were Rocket Science, Trial of Flowers, Mainspring, Escapement, Green, Endurance, The Madness of Flowers, Pinon, and Kalimpura, as well as four chapbook novellas, Death of a Starship, The Baby Killers, The Specific Gravity of Grief, and Love in the Time of Metal and Flesh. He was the co-editor, with Deborah Layne, of the six-volume Polyphony anthology series, and also edited the anthologies All-Star Zeppelin Adventure Stories, with David Moles, Other Earths, with Nick Gevers, and Spicy Slipstream Stories, with Nick Mamatas. He won the John W. Campbell Award for Best New Writer in 2004. Lake died in 2014.\n Shannon Page was born on Halloween night and spent her formative years on a commune in northern California's backwoods. A childhood without television gave her a great love of books and the worlds she found in them. She wrote her first book, an adventure story starring her cat, at the age of seven. Sadly, that work is currently out of print, but see the Fiction page of her website for current and upcoming publications. Shannon is a longtime practitioner of Ashtanga yoga, has no tattoos, and lives in San Francisco with nineteen orchids."}