{"fingerprint": "QJfsny19Deiin0Foxuy02WzmazA=", "sitename": "Clarkesworld Magazine", "title": "Jonas and the Fox by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_05_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Jonas and the Fox by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8580 words, novelette\nJonas and the Fox\nFor Grandma\nA flyer thunders overhead through the pale purple sky, rippling the crops and blowing Jonas’s hair back off his face. Fox has no hair to blow back: his scalp is shaven and still swathed in cling bandages from the operation. He knows the jagged black hunter drones, the ones people in the village called crows, would never recognize him now. He still ducks his head, still feels a spike of fear as the shadow passes over them.\nOnly a cargo carrier. He straightens up. Jonas, who gave the flyer a raised salute like a good little child of the revolution, looks back at him just long enough for Fox to see the scorn curling his lip. Then he’s eyes-forward again, moving quickly through the rustling field of genemod wheat and canola. He doesn’t like looking at Fox, at the body Fox now inhabits, any longer than he has to. It’s becoming a problem.\n“You need to talk to me when we’re in the village,” Fox says. “When we’re around other people. Out here, it doesn’t matter. But when we’re in the village, you need to talk to me how you talked to Damjan.”\nJonas’s response is to speed up. He’s tall for twelve years old. Long-legged, pale-skinned, with a determined jaw and a mess of tangled black hair. Fox can see the resemblance between Jonas and his father. More than he sees it in Damjan’s face when he inspects his reflection in streaked windows, in the burnished metal blades of the harvester. But Damjan’s face is still bruised and puffy and there is a new person behind it, besides.\nFox lengthens his stride. He’s clumsy, still adjusting to his little-boy limbs. “It looks strange if you don’t,” he says. “You understand that, don’t you? You have to act natural, or all of this was for nothing.”\nJonas mumbles something he can’t pick up. Fox feels a flash of irritation. It would’ve been better if Jonas hadn’t known about the upload at all. His parents could have told him his brother had recovered from the fall, but with brain damage that made him move differently, act differently. But they told him the truth. They even let him watch the operation.\n“What did you say?” Fox demands. His voice is still deep in his head, but it comes out shrill now, a little boy’s voice.\nJonas turns back with a livid red mark on his forehead. “You aren’t natural,” he says shakily. “You’re a digital demon.”\nFox narrows his eyes. “Is that what the teachers are telling you, now?” he asks. “Digital storage isn’t witchcraft, Jonas. It’s technology. Same as the pad you use at school.”\nJonas keeps walking, and Fox trails after him like he really is his little brother. The village parents let their children wander in the fields and play until dusk—it seems like negligence to Fox, who grew up in cities with a puffy white AI nanny to lead him from home to lessons and back. Keeping an eye on Jonas is probably the least Fox can do, after everything the family has done to keep him safe. Everything that happened since he rapped at their window in the middle of the night, covered in dry blood and wet mud, fleeing for his life.\nThey pass the godtree, the towering trunk and thick tubular branches that scrape against a darkening sky. Genetically derived from the baobobs on Old Earth, re-engineered for the colder climes of the colony. Fox has noticed Jonas doesn’t like to look at the tree, either, not since his little brother tumbled out of it.\nThe godtree marks the edge of the fields and the children don’t go past it, but today Jonas keeps walking and Fox can only follow. Beyond the tree the soil turns pale and thick with clay, not yet fully terraformed. The ruins of a quickcrete granary are backlit red by the setting sun. Fox saw it on his way in, evaluated it as a possible hiding place. But the shadows had spooked him, and in the end he’d pressed on towards the lights, towards the house on the very edge of the village he knew belonged to his distant cousin.\n“Time to go back, Jonas,” Fox says. “It’ll be dark soon.”\nJonas’s lip curls again, and he darts towards the abandoned granary. He turns to give a defiant look before he slips through the crumbling doorway. Fox feels a flare of anger. The little shit knows he can’t force him to do anything. He’s taller than him by a head now.\n“Do you think I like this?” Fox hisses under his breath. “Do you think I like having stubby little legs and a flaccid little good-for-nothing cock?” He follows after Jonas. A glass bottle crunches under his foot and makes him flinch. “Do you think I like everything tasting like fucking sand because that patched-up autosurgeon almost botched the upload?” he mutters, starting forward again. “I was someone six months ago, I drew crowds, and now I’m a little shit chasing another little shit around in the country and . . . ”\nA sharp yelp from inside the granary. Fox freezes. If Jonas has put an old nail through his foot, or turned his ankle, he knows Damjan’s little arms aren’t strong enough to drag him all the way home. Worse, if the ruin is occupied by a squatter, someone on the run like Fox who can’t afford witnesses, things could go badly very quickly. Fox has never been imposing even in his own body.\nWith his heart rapping hard at his ribs, he picks up the broken bottle by the stem, turning the jagged edge outward. Maybe it’s nothing. “Jonas?” he calls, stepping towards the dark doorway. “Are you alright?”\nNo answer. Fox hesitates, thinking maybe it would be better to run. Maybe some desperate refugee from the revolution has already put a shiv through Jonas’s stomach and is waiting for the next little boy to wander in.\n“Come and look,” comes Jonas’s voice from inside, faint-sounding. Fox drops the bottle in the dirt. He exhales. Curses himself for his overactive imagination. He goes into the granary, ready to scold Jonas for not responding, ready to tell him they are leaving right now, but all of that dies in his throat when he sees what captured Jonas’s attention.\nRoughly oblong, dark composite hull with red running lights that now wink to life in response to their presence, opening like predatory eyes. The craft is skeletal, stripped down to an engine and a passenger pod and hardly anything else. Small enough to slip the blockade, Fox realizes. So why had it been hidden here instead of used?\nFox blinks in the gloom, raking his eyes over and around the pod, and catches sight of a metallic-gloved hand flopped out from behind the craft’s conical nose. His eyes are sharper now. He supposes that’s one good thing. Jonas hasn’t noticed it yet, too entranced by the red running lights and sleek shape. He’s even forgotten his anger for the moment.\n“Is it a ship?” he asks, voice layered with awe.\nFox snorts. “Barely.”\nHe’s paying more attention to the flight glove, studying the puffy fingers and silvery streaks of metal running through the palm. It’s not a glove. Bile scrapes up his throat. Fox swallows it back down and steps around the nose of the craft.\nThe dead man tore off most of his clothing before the end. His exposed skin is dark and puffy with pooled blood, and silver tendrils skim underneath it like the gnarled roots of a tree, spreading from his left shoulder across his whole body. Fox recognizes the ugly work of a nanite dart. The man might have been clipped days or even weeks ago without knowing it. He was this close to escaping before it ruptured his organs.\n“What’s that?” Jonas murmurs, standing behind him now.\n“Disgusting,” Fox says.\nBut there’s no time to mourn for the dead when the living are trying to stay that way. A month hiding in the family cellar, then Damjan’s accident, the tearful arguments, the bloody operation by black-market autosurgeon. Uploading to the body of a braindead little boy while his own was incinerated to ash and cracked bone to keep the sniffers away. It was all for nothing.\nHis chance at escape had been waiting for him here in the ruins all along.\n“You can’t tell anyone about this, Jonas,” Fox says. “None of your friends. Nobody at school.”\nJonas’s nostrils flares. His mouth opens to protest.\n“If you tell anyone about this, I’ll tell everyone who I really am,” Fox cuts him off. He feels a dim guilt and pushes through it. This is his chance to get off-world, maybe his only chance. He can’t let anyone ruin it. He needs to put a scare into the boy. “Your parents will be taken away to prison for helping me,” he says. “They’ll torture them. Do you want that, Jonas?”\nJonas shakes his dark head. His defiant eyes look suddenly scared.\n“Don’t tell anyone,” Fox repeats. “Come on. Time to go home.”\nFox thought himself brave once, but he is realizing more and more that he is a coward. He leads the way back through the rustling fields, past the twisting godtree, as dusk shrouds the sky overhead.\nDon’t tell anyone. It’s the refrain Jonas has heard ever since the morning he came into the kitchen to find all the windows shuttered, their one pane of smart glass turned opaque, and a strange man sitting at the table, picking splinters from the wood. When he looked up and saw Jonas, he flinched. That, and the fact that his mother was scrubbing her hands in the sink as if nothing was out of the ordinary, made Jonas brave enough to stare.\nThe man was tall and slim and his hands on the table were soft-looking with deep blue veins. There were dark circles under his eyes and the tuft of hair that wasn’t hidden away under the hood of father’s stormcoat was a fiery orange Jonas had never seen before. Everyone in the village had dark hair.\nDamjan, who had followed him from his bunk how he always did, jostled Jonas from behind, curious. Jonas fed him an elbow back.\nTheir mother looked up. She dried her scalded red hands in her apron. “Jonas, Damjan, this is your uncle who’s visiting,” she said, in a clipped voice. But this uncle looked nothing like the boisterous ones with bristly black beards who helped his father repair the thresher and drank bacteria beer and sometimes leg-wrestled when they drank enough of it.\n“Pleased to meet you, what’s your name?” Jonas asked.\nThe man tugged at the hood again, pulling it further down his face. He gave a raspy laugh. “My name is nobody,” he said, but Jonas knew that wasn’t a real name.\n“What’s uncle’s name?” he asked his mother.\n“Better you don’t know,” she said, still twisting her fingers in her apron. “And you can’t tell anyone uncle is visiting us. Same for you, Damjan.”\nBut Damjan hardly ever spoke anyways, and when he did he stammered badly. Jonas was going to tell his new uncle this when the front door banged open. His uncle flinched and his mother did, too, cursing under her breath how Jonas wasn’t allowed to. He didn’t know what they were scared of, since it was only father back from the yard. He stank like smoke.\n“Burned everything,” he said. “The gloves too, I’ll need new ones.” His eyes flicked over to Jonas and Damjan, slightly bloodshot, slightly wild. “Good morning, my beautiful sons,” he said, crossing the room in his long bouncing stride to ruffle Jonas’s hair how he always did, to kiss Damjan on his flat forehead.\n“Wash first!” Jonas’s mother hissed. “Damn it. Wash first, you hear?”\nFather’s face went white. He swallowed, nodded, then went to the basin and washed. “You’ve met your uncle, yes, boys?” he asked, slowly rinsing his hands. “You’ve said hello?”\nJonas nodded, and Damjan nodded to copy him. “Is uncle here because of the revolution?” he asked.\nLately all things had to do with the revolution. Ever since the flickery blue holo-footage, broadcast from a pirate satellite, that had been projected on the back wall of old Derozan’s shop one night. The whole village had crowded around to watch as the rebels, moving like ghosts, took the far-off capital and dragged the aristos out from their towers. Jonas had cheered along with everyone else.\n“He is,” father said, exchanging a look with Jonas’s mother. “Yes. He is. A lot of people had to leave the cities, after the revolution. Do you remember when the soldiers came?”\nJonas remembered. They came in a roaring hover to hand out speakaloud pamphlets and tell the village they were Liberated, now. That they could keep the whole harvest, other than a small token of support to the new government of Liberated People.\n“Some of them were looking for your uncle,” father said. “If anyone finds out he’s here, he’ll be killed. So don’t talk about him. Don’t even think about him. Pretend he’s not here.”\nJonas’s new uncle had no expression on his gaunt face, but on top of the wooden table his hands clenched so hard that the knuckles throbbed white.\nAfter supper is over and Jonas goes to bed, Fox stays behind to speak to his parents. There is a new batch of bacteria beer ready and Petar pours each of them a tin cup full. It’s dark and foamy and the smell makes Fox’s stomach turn, but he takes it between his small hands. His cousin Petar is tall and handsome in a way Fox never was, but he has aged a decade in the weeks since Damjan fell. There are streaks of gray at his temples and his eyes are bagged. He slumps when he sits.\nHis wife Blanka conceals it better. She is the same mixture of cheery and sharp-tongued as she was before. In public she holds to Fox’s hand and scolds and smiles as if he really is Damjan, so realistic Fox worried for her mind at first. But he knows now it’s only that she’s a better actor than her husband, and more viscerally aware of what will happen if someone discovers the truth: that Damjan’s brain-dead body is inhabited by a fugitive poet and enemy of the revolution. She drinks the stinking bacteria beer every night, even when Petar doesn’t.\n“Jonas and I found something in the field today,” Fox says, hating how his voice comes shrill and high when he’s trying to speak of something so important. “A ship.”\nPetar was using his thumb to wipe the foam off the top of his cup, but now he looks up. “What kind of ship?” he asks.\n“Just a dinghy,” Fox says. “Small. One pod. But everything’s operational. It only needs a refuel.” He takes a swallow of beer too big for his child’s throat, and nearly chokes. “Someone was going to use it to break the blockade before a nanodart finished them off,” he says. “Now that someone could be me. If you help me again. With this one last thing.”\nHis chest is tight with hope and fear. Petar looks to Blanka.\n“You would leave,” Blanka says. “In Damjan’s body.”\nFox nods his bandaged head. “The transfer was a near thing,” he said. “Even if we could find that bastard with the autosurgeon again, trying to extract could wipe me completely.”\nThat isn’t true, not strictly true. He would probably survive, but missing memories and parts of his personality, the digital copy lacerated and corrupted. That might be worse than getting wiped.\n“So, we would have another funeral,” Petar says. “Another funeral for Damjan, but this time with all the village watching and with no body to bury.”\n“You can tell people it was a blood clot,” Fox says. “An after-effect from the fall. And the casket can stay closed.”\nPetar and Blanka look at each other again, stone-faced. People are different out here in the villages. Hard to read. It makes Fox anxious.\n“Then you can be at peace,” he says. “You don’t have to see . . . This.” He encompasses his body with one waving hand. “You just have to help me one more time. It might be the best shot I’ll ever have at getting off-world.”\n“Maybe the ship was put there as a trap,” Blanka says. “Did you think of that, poet? To draw you or other aristos out of hiding.”\nFox hadn’t thought of that, but he shakes his head. “They wouldn’t go to that much trouble,” he says. “Not for me or anyone else that’s left. All the important people digicast out before the capital fell.” He leans forward, toes barely scraping the floor. “I’ll never forget what your family has done for me.”\n“Family helps family,” Petar mutters. “Family over everything.” He looks up from his beer and Fox sees his eyes are wet. “I’ll need to see the ship,” he says. “You’ve been safe like this, in Damjan’s body. Maybe now you can escape and be safe forever. Maybe that is why Damjan fell. His life for your life.”\nHis shoulders begin to shake, and Blanka puts her arm across them. She pulls Fox’s beer away and pours it slowly into her empty cup. “It’s time for you to go to bed,” she tells him, not looking into his eyes—into Damjan’s eyes.\nFox goes. The room he shares with Jonas is tiny, barely big enough to fit the two quickfab slabs that serve as beds. Jonas isn’t asleep, though. He’s sitting upright with his blanket bunched around his waist.\n“You’re going to take the ship, aren’t you?” he says. “You’re going to go up into space and visit the other worlds and see all the stars up close. That’s what aristos do.” The penultimate word is loaded with disdain.\n“I’m going to get away from the people who want me executed,” Fox says.\nJonas slides down into his bed, turned away facing the wall. “Aristos go up and we sit in the mud, teacher says. Aristo bellies are full of our blood.”\n“Your teacher spouts whatever the propaganda machine sends him,” Fox says wearily. “Bellies bloated with the blood of the masses. That was my line. Bet your teacher didn’t tell you that.”\nJonas doesn’t reply.\nFox undresses himself and climbs into bed. He tries, and fails, to sleep.\nJonas doesn’t sleep right away either. He’s wary of bad dreams since the day he climbed the godtree. The day they learned, in school, about the smooth white storage cone embedded in the backs of the aristos’ soft-skinned necks.\nTheir new teacher was a tall stern man dressed all in black, replacing the chirping AI that had taught them songs and games, but everyone got brand new digipads so they didn’t mind. All the lessons were about the revolution, about the aristos who’d kept their boot on the throat of the people for too long and now were reaping the harvest, which made no sense to Jonas because the teacher also said aristos were weak and lazy and didn’t know how to work in the fields.\nOne day the teacher projected a picture on the wall that showed a man without skin or muscles, showing his gray skeleton, and a white knob sunk into the base of the skull.\n“This is where aristos keep a copy of themselves,” the teacher said, pointing with his long skinny finger. “This is what lets them steal young healthy bodies when their old ones die. It’s what lets them cross the stars, going from world to world, body to body, like a disease. Like digital demons.”\nJonas thought of his uncle who stayed in the basement, the hood he always wore. That, and his soft hands, his way of speaking that swallowed no sounds, made it obvious.\nHe was an aristo. It made Jonas frightened and excited at the same time. Had he lived in a sky-scraping tower in the city and eaten meat and put his boot on the throat of the good simple people? Had he skipped through the stars and been to other worlds?\nWhen Jonas came home from school, he tried to ask his father, but his father shook his head.\n“Whatever he was, he’s family,” he said. “Family over everything. So you can’t talk about him. Don’t even think about him. Promise me, Jonas.”\nBut it was hard to not think about. Especially hard to not think about the stars and the other worlds. Jonas knew the branches of the godtree were the best place to watch the stars from. To dream from. Sometimes they looked close enough to touch, if he could only climb high enough and stretch out his arms. Jonas was a good climber. Feeling electric with new excitement, he dodged his mother’s chores that day and went out to the fields.\nHe barely noticed Damjan following, how he always followed.\nFox is waiting outside the small quickcrete cube of a building that serves as the village school. The pocked gray walls are painted over with a mural, a cheery yellow sun and blooming flowers. All the children streamed out a few minutes ago, chattering, laughing. Some of them came over to touch Fox gingerly on the head and ask if he was better yet. Fox encounters this question often and finds it easiest to nod and smile vaguely. He knows Damjan was never much of a talker.\nBut the last of the children have gone home now, and Jonas still hasn’t come out. It’s making Fox anxious. He stands up from his squat—he can squat for ages now, Damjan’s small wiry legs are used to it more than they are to chairs—and walks around the edge of the building, towards the window. The smart glass is dimmed, and scratched, besides, but when he stands on tip-toe he can see silhouettes. One is Jonas and the other a tall, straight-backed teacher with his arms folded across his chest. The conversation is muffled.\nFear prickles in Fox’s stomach again, the fear that’s threatened to envelop him ever since a friend woke him in the middle of the night and showed him his face on the blacklist, declared an enemy of the Liberated People. The new government isn’t stupid. They know to start with the children. Jonas’s head is full of the vitriol Fox helped spark not so long ago, back when he’d fooled himself into thinking the violence of the revolution would be brief and justified.\nFox’s heart pounds now. He sees Jonas’s silhouette turn to leave, and he quickly darts back to his usual waiting place outside the main door. The boy comes out with a scowl on his face that falters, then deepens, when he catches sight of Fox. He gives only the slightest jerk of his head as acknowledgement, then goes to walk past.\nFox doesn’t let him. “What did you tell him?” he demands in a whisper, seizing Jonas’s arm.\nJonas wrests it away. His expression turns hard to read, like his parents’. Then a hesitant smirk appears on his face.\nFox feels the panic welling up. “What did you do?” he demands, grabbing for him again.\nJonas grabs back, pinching his hand hard with his nails. “Come on, Damjan,” he says with a fake cheeriness, tugging him along. “Home time, Damjan.”\n“You stupid little shit,” Fox rasps, barely able to speak through the tightness in his chest. “They’ll take your parents, you know that? They’ll take them away for helping me. You’ll never see them again.” He can already hear the whine of a hunter drone, the stamp of soldiers’ boots. His head spins. “The fall wasn’t my fault,” he says, with no aim now but lashing out like a cornered animal. “It was yours.”\nJonas’s face goes white. His hand leaps off Fox’s like it’s been burnt. “He followed me,” Jonas says. “I told him to wait on the low branch. But he didn’t.” He’s gone still as a statue. A sob shudders through him. “I didn’t tell teacher anything.”\n“What?” Fox feels a wave of relief, then shame.\n“I didn’t tell teacher about you,” Jonas hiccups, and then his eyes narrow. “I should have. I should tell him. If I tell him, they’ll forgive my parents. They aren’t aristos. They’re good. They’re Liberated People.”\nSuddenly, Jonas is turning back towards the school, his jaw set like his father’s. The red mark on his forehead is back.\n“Wait,” Fox pleads. “Jonas. Let me explain myself.”\nJonas stops, turns. Giving him a chance.\nFox’s mind whirls through possibilities. “The fall wasn’t your fault,” he says slowly. “And Damjan knows that.”\n“Damjan is dead,” Jonas says through clenched teeth. “His brain had no electric in it.”\n“But when they did the transfer,” Fox says. “You remember that, yes? The surgery? When they put my storage cone into Damjan’s brainstem, I got to see his memories. Just for a moment.”\nJonas’s eyes narrow again, but he stays where he is. He wipes his nose, smearing snot across the heel of his hand.\n“I saw Damjan wanted to follow you up the tree,” Fox says slowly, feeling his way into the lie. “Because he always wanted to be like you. He knew you were strong and brave and honest. He was trying to be like you, even though he knew he should have waited on the lower branch. And when he fell, he didn’t want you to feel bad. He didn’t want you to feel guilty.” Fox taps the back of his bandaged head, where the storage cone is concealed. “That was the last thing Damjan thought.”\nTears are flowing freely down Jonas’s cheeks now. “I wanted to go higher,” he says. “When I go high enough, it feels like I can touch the sky.”\nFox reaches up and puts his hand on Jonas’s shoulder, softly this time. His panic is receding. He has Jonas solved now. There’s a bit of guilt in his gut, but he’s told worse lies. He would tell a dozen more to make sure nothing goes wrong, not now that Petar has seen the ship and agrees it will fly. Not now that he’s so close to escaping.\nJonas’s father has forbidden him to go near the granary again, but he still goes out to the fields the next day. He has always bored quickly of the games the other children play, even though he can throw the rubber ball as hard as anyone and dodges even better. He’s always preferred to wander.\nHis nameless uncle is with him. It’s still hard to look at Damjan’s face and know Damjan is not behind it, but talking comes a little easier since what happened yesterday. When his uncle asks why he was kept behind after school by the teacher, Jonas tells him the truth.\n“We’re learning about the revolution,” he says. “About the heroes. Stanko was my favorite. He took the capital with a hundred fighters and he’s got an eye surgery to see in the dark. But yesterday the lesson changed on my pad.” He motions with his hand, trying to capture how the text all dissolved and then reformed, so quick he barely noticed it. “Now it says General Bjelica took the capital. It says Stanko was a traitor and they had to execute him. So I told teacher it wasn’t right.”\nDamjan’s face screws up how it does before he cries, but no tears come out, and Jonas knows it’s because grown-ups don’t cry. “I met Stanislav once,” his uncle says. “He was a good man. Maybe too good. An idealist.”\n“You met Stanko?” Jonas demands. “What did his eyes look like?”\nHis uncle blinks. “Bright,” he says. “Like miniature suns.”\nJonas stops where he is, the tall grass rustling against his legs, as he envisions Stanko tall and strong with eyes blazing. “Like stars,” he murmurs.\nHis uncle nods. “Maybe he got away,” he says. “There’s a lot of false reports. Maybe he’s in hiding somewhere.”\nJonas asks the question, then, the one that has been bubbling in the back of his mind for days. “The revolution is good,” he says. “Isn’t it?”\nHis uncle gives a laugh with no happiness in it. “I thought it was,” he says. “Until the bloodshed. Until cynics and thugs like Bjelica took over. After everything I did for their cause—all the rallies, all the writing—they turned on me. Ungrateful bastards.”\n“Why did you want the revolution if you’re an aristo?” Jonas asks plainly.\n“Because there weren’t meant to be aristocrats or underclass after the revolution,” his uncle says, with a trace of anger in Damjan’s shrill voice. “Everyone was meant to be equal. But history is a wheel and we always make the same mistakes. The only difference is who gets crushed into the mud.” He picks anxiously at a stalk. “The ruling families were bad,” he says. “The famines, and all that. But this is worse.”\nJonas considers it. The teacher told them that there would be no famines anymore. They would keep their whole crop, except for a small token of support to the government of Liberated People. “Did you lose many in the famine?” he asks, because it’s a grown-up question. “I had a little sister who died. And that’s why Damjan is different. Was different. Because mother couldn’t feed him well enough.”\nDamjan’s mouth twists. For a moment his uncle doesn’t respond. “No,” he finally says. “Not many.” Damjan’s face is red, and Jonas realizes his uncle is ashamed of something, though what he can’t guess. “I wrote a poem series about the famine,” he says. “Years ago. I still remember it. Do you want to hear some of it, maybe?”\nJonas hesitates. He doesn’t know if he likes poetry. But maybe if he listens to the poetry, he can ask more questions about Stanko and the capital, and then about the stars and the other worlds his uncle will soon go to.\n“Alright,” he agrees. “If it’s not really long.”\nThe week passes at two speeds for Fox, agonizingly slow and terrifyingly fast. Petar has spread word that the old granary past the edge of the terraform has broken glass and an old leaking oil drum inside it, to ensure the other parents keep their children away. Fox’s nights are spent poring over schematics with Blanka or else sneaking out to the ship itself with Petar.\nDuring the day, he spends most of his time with Jonas. The boy is bright and never runs dry of questions, and ever since Fox’s first recitation he’s been devouring poetry. Not necessarily Fox’s—he prefers it when Fox recites the older masters, the bolder and more rhythmic styles. He has even started scribbling his own poem using charcoal on the wall of their bedroom, which made Petar and then Blanka both shake their heads.\nHe reminds Fox a little bit of himself as a child. Too clever to get along with the other children, too brash and too stubborn, worryingly so. But Fox has other concerns. The ship is tuned and refueled and finally ready to fly, and the village’s weather probe predicts a rolling storm in a fortnight. That’s when Fox will launch, while the thunder and lightning masks the take-off. His days in the village, his days in Damjan’s body, are finally numbered.\nFox is in the cramped bedroom, laboring with a piece of Jonas’s charcoal. The boy’s favorite poem is a short one, but even so it takes a long time for Fox to transcribe it onto the clear stretch of wall. He’s only halfway finished the memento, his small hands smeared black, when he hears Jonas arrive home from the school. A moment later, he hears a shriek from Blanka.\nFox goes stiff and scared, ears strained for the thump of soldiers’ boots, but there’s nothing but Blanka’s angry voice and Jonas’s near-inaudible reply. He wipes his hands on his trousers and goes to the kitchen.\nJonas is standing sullenly with his shirt knotted in his hands. Blanka is in a rage, and Fox realizes why as soon as he sees the bruises on Jonas’s bare back.\n“That spindly bastard, I’ll snap him in halves,” she’s snarling. “What happened, Jonas? What happened, my beautiful boy?”\nJonas lifts his head. “Teacher switched me,” he says. “For telling lies.” He turns as he says it, and his eyes catch on Fox. He gives a smile that fills Fox with pure dread. Fox knows, somehow, what’s coming. “We learned about enemies of the revolution today,” Jonas says. “There was one aristo who tried to convince the Liberated People to let all the aristos go without getting punished. They called him the Fox because he had red hair.”\n“Oh, no,” Blanka murmurs. “Oh, Jonas. What did you say?”\n“I said he helped the revolution,” Jonas says defiantly, looking Fox in the eye. “I said he wrote the poem, the one about aristo bellies full of our blood.”\n“You should not have done that, Jonas,” Fox says, surprised he can speak at all. “That was dangerous. That was very dangerous.” His panic is welling up again, numbing him all over. “They have gene records. They know that I’m a cousin to your father.”\nJonas bites at his lip, but his eyes are still defiant. “I wanted to be brave,” he says. “Strong and brave and honest. Like Damjan thought I am.”\nFox feels adrift. He knows Jonas, no matter how sharp he seems, is still a child. There’s no way he can understand what he’s just done. Maybe it’s Fox’s own fault, for filling his head with all the poems.\nMaybe they’ll be lucky, and the teacher will keep Jonas’s transgression to himself. Fox has been lucky before.\nWhen father comes home mother tells him what happened, and his whole body seems to sink a little. Jonas feels the disappointment like he feels the welts on his back, and worse, he can tell that his father is scared. There is a brutal silence that lasts all evening until he goes to bed, lying on his stomach with a bit of medgel spread over his back. He knows he made a mistake. Even though he didn’t say his uncle was with them, he said too much.\nJonas tries to apologize to his uncle, who is lying very straight and very still, staring up at the ceiling, and Damjan’s voice mutters something about everything being fine and not to worry about anything. It doesn’t sound like he believes it. Between the aches in his back and the thoughts in his head, Jonas takes a very long time to fall asleep. Halfway through a bad dream, his mother’s hands shake him awake.\n“Up, Jonas. You, too, Damjan.”\nJonas wrenches his eyes open. It’s still dark through the window and he hears a high whining noise he recognizes coming from outside. A hover. Jonas feels a spike of cold fear go all the way through him.\n“I need to pee,” he says.\n“Later,” mother says. “There are some men here to speak with your father. To look around the house.” Her voice is strained. “If they ask you anything, think three times before you say anything back. Remember that uncle was never here.”\nThen she’s gone again, leaving Jonas alone with his uncle. In the light leaking from the hall, Jonas can see Damjan’s small round face is etched with terror, so much that he almost wants to take his hand and squeeze it. As if he really is Damjan, and not the Fox. Jonas listens hard to the unfamiliar voices conversing with his father. One of them sounds angry.\nLoud stomping steps in the hall, then the door opens all the way and two soldiers come in with mother and father close behind. They are not as tall as father but their black coats and bristling weapons make them seem bigger, more frightening, like flying black hunter drones that have turned into men.\n“Good morning, children,” one of them says, even though it is the middle of the night. He gives a small smile that doesn’t crinkle his eyes and raises one fist in the salute of the Liberated People.\nJonas returns it, and shoots his uncle a meaningful look, but Damjan’s little fists are stuck to his sides. Fortunately, the soldier is focused on him, not his uncle.\n“You must be the older,” he says. “Jonas, isn’t it? You told our friend the teacher something very strange today, Jonas. What did you tell him?”\nJonas’s mouth is dry, dry. He looks to mother, who is framed between the men’s broad shoulders, and she starts to speak but the second soldier puts a warning finger to his lips.\n“We want to hear from Jonas, not from you,” the first one says. “What did you tell your teacher, Jonas?”\nJonas knows it is time to be brave, but not honest. “I said that the Fox helped the revolution,” he says. “I was confused. I thought he was Lazar. Lazar makes the songs for the satellite to play.” He looks at both the soldiers, trying to gauge if they believe him. He lifts his nightshirt and turns so he won’t have to look them in the eye. “Teacher was mad and didn’t let me explain,” he says. “He just started to switch me. Look how bad he switched me.”\n“A few stripes never killed anyone,” the soldier says. “It’ll make you look tough. Your little girlfriends will like that, right? Turn around.”\nJonas drops his shirt and turns back, ready to meet the soldiers’ gaze again. His uncle gives an encouraging nod where they can’t see him.\n“Did you know that this Fox, this enemy of the revolution, is a relative of yours?” the soldier asks. “A cousin to your father?”\n“Yes,” Jonas says. “But we don’t know him. He’s never come here.”\nThe other soldier, who hasn’t spoken yet, barks a short and angry laugh. “We’ll see about that,” he says, in a voice like gravel. “We’ll have a sniff.” He pulls something from his jacket and fits it over his mouth and nose like a bulbous black snout.\nJonas has heard of sniffer masks—his uncle explained them when they were in the field one day, how each person born had a different odor, because of their genes and their bacteria, and you could program a sniffer mask to find even the tiniest trace of it—but he has never seen one before now. It makes the soldier look like a kind of animal. When he inhales, the sound is magnified and crackling and makes Jonas shudder.\nBehind the soldiers, mother has her hands tucked tight under her armpits. Her face is blank, but Jonas imagines she is thinking of all the scrubbing, all the chemicals she used anywhere uncle sat or ate. But uncle’s old body has been gone for weeks now, and the smells would be too, wouldn’t they?\nAs the sniffer moves around the room, the first soldier leans in close to the wall to look at the charcoal lettering. “What’s this?” he asks. “Lessons?”\n“Yes,” Jonas says quietly.\n“Good,” the soldier says, and Jonas sees his eyes moving right to left on it, instead of left to right, and realizes he’s like most of the older people in the village who can’t read. It gives him a small sense of relief.\nThat only lasts until he looks over and sees the sniffer has stopped beside his uncle. “What happened to the boy’s head?” the sniffer asks, voice distorted and grating.\n“He fell,” father says from the doorway. “A few weeks ago. He isn’t healed in the brain yet. He’s a little slow.”\n“Are you, boy?” the sniffer demands.\nJonas clenches his thumbs inside his fists. There is no part of uncle’s body left in Damjan’s, only his digital copy, his soul, but Jonas wonders if the sniffer might somehow be able to detect that, too.\nHis uncle looks up with a confused smile and reaches to touch the sniffer mask. The sniffer jerks back, then pushes him towards the door, more gently than Jonas would have expected, and continues searching the room. Jonas releases a breath he didn’t know he was holding.\nThe sniffer works through the rest of the house, too, and Jonas and his family drift slowly along with him to open doors and cupboards, to make sure there are no traps or surprises. The horrible sucking sound of the sniffer mask sets Jonas’s teeth on edge. It feels like a strange dream, a bad one. His eyes are sore and his bladder is squeezing him.\nWhen they finally finish with the cellar, the sniffer looks irritated but the other soldier is relieved. “We’ll be off, then,” he says. “Remember, if he ever contacts you in any way, it’s your duty to report him. He’s not one of us. He cut ties with you and with all decent people the day he had his storage cone implanted.”\nFather nods, his mouth clenched shut, and shows the soldiers out. Jonas follows, because he wants to make sure, really sure, that the nightmare is over. Father doesn’t send him back in. The soldiers are out the door and past the bushes when the sniffer suddenly stops. His mask is still on, and the sucking noise comes loud in the still night air.\nJonas remembers that the last charred bits of uncle’s old skeleton are buried underneath the bushes. His father is not breathing, only staring. The sniffer lingers.\nJonas braces himself. He reminds himself that he is brave. Then he darts away from the door before father can pull him back, jogging up behind the sniffer and tugging his arm. “Can I see the hover?” he asks loudly.\nThe sniffer whirls and shoves him backward. Jonas squeals, loud and shrill how mother hates it, and he lets his piss go in a long hot stream that soaks his legs, splatters the bushes and the soldier’s boots. It’s very satisfying. Especially when the sniffer yanks his mask down and curses.\n“I thought the other boy was the slow one,” he says.\n“He’s frightened,” father says, coming and gripping Jonas by the arm. “You frightened him. Please, just go.”\nAs Jonas watches, the soldiers climb into their hover. They go.\nThe instant the whine of the hover fades away into the distance, Fox tells Petar and Blanka that it has to be tonight. His heart is still pounding away at his tiny ribcage, so hard he imagines the bones splintering. He’s sweating all over.\n“That was too close,” he says. “Too close. I have to launch tonight.”\nEveryone is in the kitchen. Blanka is wetting a rag for Jonas to clean himself; Petar is standing behind a chair and gripping it tightly, rocking it back and forth on its legs. They all turn their heads to look at Fox.\n“There’s no storm tonight,” Blanka says, handing Jonas the rag. “Someone will see the exhaust burn. It’ll be loud, too.”\nFox shakes his head. “Nobody around here knows what a launch looks or sounds like,” he says. “And Petar, you told everyone there was oil in the granary, didn’t you?”\nHis cousin blinks. “Yes.” He pauses, then looks to his wife. “We could set fire to the granary. That should be enough to cover the noise and the light so long as he goes up dark.”\nBlanka slowly nods. “Alright. Alright. You’ll need help moving the ship out. I’ll come as well.”\n“I want to come,” Jonas says, wide-eyed, wringing the rag between his hands. Fox realizes he never did finish the poem on the wall.\n“Bring Jonas, too,” he says. “To say goodbye.”\nBare minutes later, they are dressed and out the door, moving quickly through the crop field. The night air is cold enough to sting Fox’s cheeks. Fear and anticipation speed his short legs and he manages to keep pace with Petar and Blanka, who are lugging the gas. Jonas skips ahead and then back, electric with excitement, already forgetting the fear.\n“I pissed on a soldier,” he whispers.\n“I saw from the window,” Fox grunts. “But a sniffer can’t read DNA from ashes and bone. He had nothing.”\n“Oh.” Jonas’s face reddens a bit. “I’ll do it again, though. I hate the soldiers as bad as the aristos. I want everyone equal, like you said.”\nBlanka puts a finger to her lips, and Jonas falls silent. Fox is glad to save his breath. They pass under the godtree, its twisted branches reaching up towards a black sky sewn with glittering stars. For a moment Fox dares to imagine the future. Slipping through the blockade and into the waiting arms of civilization. Telling his tale of survival against all odds. Maybe he’ll be famous on other worlds how he so briefly was here.\nAnd he’ll be leaving Jonas’s family to suffer through whatever comes next. The thought gnaws at him so he shoves it away. He reminds himself that Petar and Blanka are clever people. They know how to keep their heads down. They know how to keep silent and survive.\nAt the entrance to the abandoned granary, Fox switches on the small lantern he brought from the kitchen and lights the way for Petar and Blanka. They haul the tiny ship out on wooden sledges Petar made for it a day ago. Jonas puts his small shoulder into it and pushes from behind.\nFox checks everything he remembers, moving from the nosecone to the exhaust, then yanks the release. The ship shutters open, revealing the waiting passenger pod. Its life support status lights glow a soft blue in the dark. Ready. In the corner of his eye Fox sees Jonas staring up at the stars.\nThe ones who survive will be the ones who can keep their heads down. Fox knows it from history; he knows in his gut it’s happening here. Jonas isn’t one of those. Maybe he’ll learn to be, but Fox doesn’t think so.\nBefore he can stop himself, he turns to Blanka. “Jonas should go,” he says. “Not me.”\nJonas’s head snaps around, but Fox doesn’t look at him. He watches Blanka’s face. She doesn’t look shocked, the way he thought she would, but maybe it’s just that people are different in the village. Harder to read.\n“What do you mean?” Petar demands.\n“Jonas should take the ship,” Fox says, because why else would he have told them to bring Jonas? He must have known, in the back of his mind, that this was what he needed to do. One brave thing, and then he can go back to being a coward. “He’s already pissed off the teacher and pissed on a soldier,” Fox continues. “He’s going to keep putting himself in danger here. And the two of you, as well.”\n“You’re the one who put us in danger,” Petar snaps. “You would take another son from me now, cousin?”\n“He’s never fit right here, Petar,” Blanka says, and for the first time Fox sees tears in her eyes. “He’s always had his head up in the sky. We used to say that, remember?”\n“He would be safer somewhere else,” Fox says. “Let him take the ship. It’s all automated from here on in.” He pauses. Breathes. “Let him take the ship, then you can burn down the granary and say he was playing in it. You can use what’s left of my bones if you need proof.”\nPetar looks at his son. “Is this what you want to do, then, Jonas?” he asks hoarsely.\nJonas chews his lip. Turns to Fox. “Could I come back? Will I be able to come back?”\n“Not soon,” Fox says. He knows there are still too many factions scrabbling in the power vacuum, knows things will get worse before they get better. “But some day. When things stabilize. Yes.” He can feel himself losing his nerve. He almost hopes Jonas will refuse.\n“I want to go,” Jonas says solemnly. Petar gives a ragged cry and wraps him in his arms. Blanka hugs him from behind, putting her cheek against his cheek. Fox feels ashamed for watching. He looks away.\n“What about uncle?” Jonas asks, his voice muffled by the embrace. “Will he be Damjan forever?”\nFox swallows as his cousin straightens up, and tries to look him in the eye. “You could say I was in the fire, too,” he says. “That Damjan was in there. And I could leave again. Try my luck going north. You wouldn’t have to look at me and remember all the time.”\nPetar looks sideways to Blanka. Slowly, they both shake their heads. “You can never be Damjan and you can never be Jonas,” Blanka says. “But you are family. We’ve kept you safe this long, haven’t we?”\nFox dares to imagine the future again, this time in the village, slowly growing again in Damjan’s body. He did used to dream of retiring to the countryside one day. And he’s learned how to keep his head down. Soon the bandages will be off and his storage cone, shaved down and covered over with a flap of skin by the autosurgeon, will be undetectable.\nMaybe the violence will be over in a few years’ time. Maybe Damjan will become a poet, a better one than Fox ever was.\n“Thank you,” he says. “All of you.”\nHe stands aside while Jonas’s parents say their goodbyes. Jonas does his best to be sad, but Fox sees his eyes go to the ship over and over again, an excited smile curling his lips. He hugs his mother fiercely, then his father, then comes to Fox.\n“You can have my bed,” he says. “It’s bigger.” He raises his arms. Pauses. He sticks out one hand instead to shake.\nFox clasps it tight. “I’ll do that,” he says.\nThen Jonas is clambering into the pod, the restraints webbing over him to hold him in place during launch, and it’s too late for Fox to take it all back even if he wanted to. The ship folds shut. The smell of gas prickles Fox’s nose and he realizes Petar is dousing one side of the granary to ensure it burns. When he’s finished, Blanka takes his gas-slicked hand in hers, and takes Fox’s with the other. They walk the agreed-upon distance with a few steps extra to be safe.\nThe ship squats on the pale soil, rumbling through its launch protocols, and then the engine ignites. Fox feels it in his chest, vibrating through his bones. Riding a bonfire of smelting orange flame, the ship begins to rise, one fiery tongue catching the roof of the granary on the way up. The engine burns even brighter, stamping itself onto Fox’s retinas, and by the time he blinks them clear the ship is only a pinpoint of light disappearing into the sky.\nThe crackling flames leap high, consuming the granary and making it hard to see the stars. Fox can imagine them, though. He can imagine Jonas slipping through the blockade to freedom. In the corner of his eye, Petar lifts his hand high, but open, not the clenched fist of the soldiers.\nFox raises his arm. He does the same.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}