{"fingerprint": "wY/XBowJe4kRICRoIFaJFaKO/A0=", "sitename": "Clarkesworld Magazine", "title": "Octo-Heist in Progress by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_11_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Octo-Heist in Progress by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7460 words, short story\nOcto-Heist in Progress\nAs soon as Etta turned up the overgrown sidewalk to the house-turned-apartment, a redflag notification popped up over the crooked eaves troughs, rotating in the gray sky: two stabbings, one drug arrest, twenty-six noise complaints in the past month. Hey Etta! We found some sketchy stats. Are you sure you want to be here?\n“Nope,” Etta muttered. “I am zero sure. Zero, zero sure.”\nShe blinked the redflag off her lenses. The apartment’s lawn was a shin-deep jungle, tangled weeds and uncut grass that might have looked artsy or enviro except for the beer cans and blunt wrappers caught in the thicket. Part of the railing on the veranda had been smashed in, leaving it splintered and jutting like a broken bone.\nShe went up the steps and let herself into the entryway, passing under the dusty black bulb of an old security camera she doubted was even on. They had taken the mailboxes out, like most places did, but they hadn’t patched up the wall afterwards so it was all plywood and foam insulation. She saw something furry scurry through the slats and jumped.\n“So, just curio, do I have my rabies vaccination?” she asked the empty entry.\nHer medipal appeared on her lenses. No! Would you like to schedule a rabies vaccination?\n“Nah.” Etta checked, for the millionth time, the apartment number Quinton had given her, then tapped it into the door’s smeary touch screen. It had one of those nice soothing rings, like electronic raindrops. She waited. Fidgeted. Plucked a wiry orange hair from her jacket and rolled it between her fingers.\n“Yo.” The disembodied voice was sullen. “Speak.”\nEtta swallowed. “Thierry? Hey. It’s Quinton’s friend Etta. He told you I was coming.”\n“Whose friend?”\n“Quinton.” Etta could feel her palms prickling with sweat; she tucked them under her armpits but that was no good because she was sweating there too. “Skinny, black hair, kind of a prick.”\n“Man, I don’t know anybody called Quinton.”\nEtta gritted her teeth. “Q-boy,” she said.\n“Q-boy!” The voice pitched upward. “Ha! I love that little shit! You’re Q-boy’s side thing, right? Eden?”\n“Etta. I just said Etta.”\n“Swelly, swelly. Come on in, E.”\nThe door buzzed and rattled; Etta shoved it open and entered the hallway. The grayish faux-wood flooring was warped so bad it slanted. It gave her the impression she was on a listing boat. The air freshener in the ceiling made a sound like a robot choking as she walked underneath, but it didn’t seem to do much against the stale smoke stink.\nShe got to unit 108 and screwed the noise-activated plugs into her ears, then checked the howler in her pocket. She always had it on her, but she’d never actually used it before, not even that time a tweaker followed her for three blocks. She knocked. For a second she heard nothing, then there was a weird wet sound, slithery almost, and the door swung open. Etta blinked. She was looking down at a slick reddish-orange octopus, one of its tentacles still wrapped around the door handle.\n“Hi?” she managed.\nThe octopus turned slightly, fixing her with one eye. Its liquid black pupil swelled, then shrank to a slit, and a tremor ran through its body. It didn’t say anything back. Just stared. Etta stared back, now noticing a sort of Saran wrap coating around its body and a few swatches of graphene circuitry around its mantle, the ultrathin printed kind they used in smart clothes. A little cam under its eye socket glowed soft blue.\n“Thierry?” Etta whispered, feeling slightly stupid. “Is that you?”\n“He don’t actually talk,” someone said. “He’s an octopus.”\nEtta looked up, feeling fully stupid, and saw Thierry. He was maybe late twenties, tall but slouchy, with a long tattooed neck and sharp Adam’s apple and a swirly haircut slightly overgrown. He was wearing a fashionable onesie and thick gray wool socks. His eyes were hidden—old-school VR goggles instead of normal lenses—and he had custom smartgloves covering his hands.\nHe rotated his thumb and the octopus in front of her responded, taking its tentacle off the door handle and scuttling backward.\n“His name’s Pico,” Thierry said. “That means ‘peak.’ Because he is the peak of B-and-E technology. Also ‘beak,’ because he has a beak. Come in, shut the door.”\nEtta took a hesitant step inside, watching the octopus slide over the water-warped floor. The door clunked shut behind her. She stuck her hands in her pockets, partly to look relaxed, partly so she could roll the comforting shape of the howler between her fingertips.\nThe triangular apartment was tiny, but also immaculate. On her left was the kitchen, with gleaming pans and a knife set displayed up on magnetic strips, a big rotating spice rack and a pressure cooker on the counter. On her right there was a workbench with a couple gutted phones and circuit boards on it, a wheelie chair, a fold-down bed, and a tall rack of black plastic drawers. Neatly-pressed clothes were hanging from a rail in the ceiling.\nPico was heading straight for the back, where an aquarium about the size of a refrigerator was waiting. She watched him sucker his way up the glass and plop down inside with a splash. He stretched one tentacle to shut the lid after him.\n“You’re controlling him?” she demanded. “I thought they could only do that with bugs and stuff. Like, those little beetle drones.”\nThierry lifted his goggles. His eyes were bloodshot. “Same idea. Microtrode nerve stimulation. Swelly, right? But an octopus is, you know, way more complex. And way more useful. My aunt pinched him from a big biolab in Seattle.”\nPico flattened himself against the aquarium glass, rippling his suckers. Etta got her first look at his beak, hooked and sharp, almost like a parrot’s.\n“He gets bored when we aren’t working. Plays with the toilet a lot.” Thierry peeled off the smartgloves and set them carefully on his work bench. “So, you got a job for me, right?” He grabbed the wheelie chair and shoved it over. “You know the fee? Payment options?”\n“Quinton told me, yeah.” Etta caught the chair, but didn’t sit down, gripping the back in both hands. She swiveled it back and forth as she arranged her words. “I left something at someone’s house. After a party. And I need it back.”\nThierry raised his eyebrows. He yanked the fold-down bed off the wall and sank onto it, hands behind his head, one leg over the other. “Okay. Deet me the deets. I say deets for details. It’s shorter.”\nEtta moved the chair back and forth, back and forth. Then she sat down, took a deep breath, and deeted him the deets.\n“Okay so, I wasn’t even going to go out on Thursday, but Aline chatted me about this house party over in Westpointe and basically begged me, because there’s this boy from St. Anthony’s she’s been chatting since the start of the school year and he’s the one who dropped her the invite and she’s fully, fully wanting him.”\nEtta paused. Thierry was staring straight ahead at the wall opposite him, the animated stickman tattoo on his neck doing somersaults, but his eyes were narrowed in concentration and he nodded for her to continue.\n“Also, Aline needed me to come to the party, because, and she didn’t chat me this but I am hundred sure, Bessandra is still fully pufferfish from her orthosurgery. And I’m second strumpet. Backup bitch. But because I am her friend, I’m like, okay, okay Aline, tranq, I’ll come.\n“So I start getting ready. Nothing maxy, I mean, it’s a house party. But then Aline snaps me, and she’s fully glammed, she’s even wearing that bassclip that makes her hair bloosh—” Etta demonstrated the slow-motion rippling with her hands. “—all around like a jellyfish. And I don’t want to look like her subsy friend, or something, especially because she also sends me some of the party snaps that her boy obsession snapped her, and the house we’re going to is fucking palatial.\n“Then I think, oh, I can go maxy, I can upnotch this look, because my sister was working late, right, and she just got these stupid beautiful Louboutin Stablettos, you know, the lux kind with the gyros so you can’t trip no matter how drunk you get? And I knew she would be furio if I took them, but I couldn’t not take them, so I took them and dipped over to Aline’s.”\nThierry’s facial expression didn’t change, but the stickman crossed his arms in what Etta took to be a slightly judgmental pose.\n“I know,” she said. “But those shoes make you feel like a goddamn goddess. It’s like suddenly being a foot taller and also walking on clouds? I was feeling maxy. Maybe too maxy. Because we had good sounds on and Aline had vodka she needed finished and I got fully drunk before we even went to the house. Which was, whoa. Palatial.”\nThierry nodded wisely. “Westpointe.”\n“Westpointe,” Etta agreed, trying to not sound bitter. “The front had these nice little glowtrees on a rock lawn. We took some snaps while we were waiting for Aline’s boy to come let us in. One of them turned out really glam. And the inside was mad. They had a glass stream running through the floor with actual fishes in it.”\nThere was a rippling motion inside Pico’s tank; she glanced over.\n“How was the party?” Thierry asked.\n“Oh.” Etta made a face. “It was all St. Anthony’s crowd. Which normally I wouldn’t like, but I was fully defaced. Fully faceless. Aline had the party pills and her guy had scramblers. I’d never done a lens virus before, but it was sort of swelly. It made everything Neo-Cubic, so, thank fuck for the Stablettos, right? And there was booze. Much booze. Too much. Also, seven taquitos.” She ran her fingertip along her eyebrow. “Uh, most of this is from me watching my aftercams. I was not forming memories at this point. I was gone. Which is why I did the thing.”\nShe’d watched her aftercams this morning while hungover as shit and had resisted the temptation to immediately delete them. Part of it was because she knew it would be useful; part of it was just punishing herself.\n“I ended up in the master bedroom with the host, because he seemed fully sexy at the time and also because he had a pipe. The smoking kind. So, we smoke out of that and I feel a little gutsick, but it goes away and then we make out a little. Then he says he has to go to the bathroom because apparently bud always makes him feel warm in his groin vicinity and he always gets paranoid he’s going to whiz himself.\n“And while he’s in the bathroom, the taquitos come back out of nowhere. And he’s in the bathroom, right, so there’s nowhere to go.” She grimaced. “I spewed. Bad. I spewed all over the bed and all over the carpet and then I opened this thing I thought was a garbage can, but it turns out it was a laundry hamper and I spewed in there too. So the whole room is covered in this chunky orange up-gut-taquito-soup and he’s still in the bathroom trying to whiz, but also shouting, like, you better not be puking, are you puking?\n“So I dipped. Out the window. I mean, it was impressive. There was a nice hydrovine lattice and I climbed down it like a gecko woman and ordered a car home. All pure feral instinct stuff. But I couldn’t do it in the shoes—like, even my gecko brain knew that—so I stashed them under the bed first.”\nShe took a deep breath. It was good to get the whole story out in the air, instead of through chats with Aline, who was fully disappointed in her, or with Bessandra, who was fully covetous. Maybe that was what confessional booths felt like. She would ask a St. Anthony’s person except she could never be in contact with anyone from St. Anthony’s ever again in her life.\n“You want me to get a pair of shoes from under a bed,” Thierry said. “Because right now vomiting in a unit’s parents’ bedroom seems like the end of the world and because it’s high school so you can’t show your face there ever again.”\nEtta nodded, relieved that he’d gotten right to the crux of it. “And because my sister is going out for her friend’s birthday tomorrow night and will absolutely see the Stablettos are missing and know I pinched them. And then she’ll eviscerate me.”\n“Swelly.” The stickman on his neck did some jumping jacks. “Well, if you pay, I deliver.”\n“I can’t pay.”\n“You can’t pay?”\n“Not exacto.” Etta chewed her lip. She was about to upnotch the immorality. “The host, Jasper, he kept braggadouching about his parents’ safe, how he knew the code for it and pinched their drugs. That’s where the hash was from. He even opened it to show me. And there was something way more lux than hash in there.”\nThierry’s pink-threaded eyes lit up. “You have that cammed?”\n“Fully cammed.”\n“And it’s not biometric?”\n“Not biometric.” Etta shrugged. “He said his parents love retro shit.”\nThierry went back to his goggles to do what he called reconnaissance, which left Etta alone with Pico the octopus. At first she stayed over by the workbench, pretending to peer at the tangles of circuitry, but eventually she magnetized over to the aquarium where Pico was jetting back and forth, tentacles pinwheeling. He looked about as antsy as she felt.\nWhen she got close he stopped, drifting there in the blue-lit water with one bulgey orange eye fixed on her. There was something fully analytical about his way of staring that made him seem human and alien at the same time. One tentacle reached out and tapped the glass; Etta hesitated, then reached out and put her finger on the same spot so it looked like they were touching. A little ripple went through Pico’s soft body.\n“You’re not having a moment,” Thierry said. “He’s just hungry.”\nShe jumped. Turned. Thierry still had his goggles on but must have only been half in virtual. “Should you, uh, feed him?” she asked.\n“You should. I’m busy.” He waved his arm. “There’s shrimp in the fridge. Took me a minute to find a kind he’ll actually eat.”\nEtta went to the gleaming black fridge and pulled it open—it was one of those lux gel fridges, where everything was suspended in little airtight bubbles, and she wondered again why Thierry lived in such a shithole complex when he had so much money. Maybe it had to do with where the money came from. She found the big bag of Finn’s Frozen Shrimp and yanked it out with a slucking sound.\nPico flicked the lid of his tank open, staring expectantly as she approached with the bag. She groped out a cold slippery handful of half-defrosted shrimp and leaned over on tiptoe to drop them. The second they splashed down, Pico was feasting, his parrot beak snap-snapping, not unlike her when taquitos were in play.\n“They’re really smart, right?” Etta asked, eyeing the graphene circuits on Pico’s mantle.\n“Affirmative,” Thierry mumbled, tracing something in the air with his smartglove. “Scary smart. Not the way we are, but smart.”\nEtta felt a guilty churn in her gut. “So isn’t it kind of mean to make him into a big puppet?”\n“Nah, nah, nah.” Thierry spun in a circle, scanning his virtual surroundings. “They got that distributed gray matter. Like, one little brain per tentacle. That’s why the microtrodes work.” He dragged something bigger with his thumb and forefinger, peering intently into empty space. “Pico there is already on auto half the time. His tentacles are doing their own tentacle things. So it’s just like that. He can’t even tell the difference.”\nPico suckered the last shrimp to his tentacle-tip and whirled it slowly through the water, like he was thinking about something, then lifted it up out of the tank and held it out to her.\n“I think he’s full,” Etta said.\nThierry said nothing; she glanced over her shoulder and saw him mouthing words, subvocalizing a call to somebody.\nShe turned her attention back to Pico, who was shaking the shrimp in the air. “You want me to have one? Is this that?” She frowned and plucked it off the end of his tentacle. “Thanks, Pico. Or, thanks, Pico’s tentacle.” Then, because Thierry was still in his call, she leaned real close to the glass. “You know, I totally feel distributed sometimes. Like when I pinched the shoes. My brain was like, bad Etta, bad, and my hands were like, got ’em. Anyways. I appreciate you helping me get them back, and I’m not eating this.”\nBehind her, Thierry whooped. “We’re in business,” he said. “Someone already drone-scoped this house half a year ago and I just bought the deets. Looks like an easy in.” The stickman on his neck was flexing both biceps.\nEtta realized she still had the shrimp in her fist; she flipped it into the tank and wiped her hand on her shirt. “Tonight?”\n“Tonight,” Thierry said. “You can come if you like.”\nThe shrimp bobbed past Pico’s beak. He jabbed at it with one tentacle, gave Etta what she suspected might be a hurt look, and scuttled to the back of his tank.\nEtta didn’t know what to wear on a heist but figured she couldn’t go wrong with black. Black leggings, black sweater, even a black balaclava she rummaged out of the winter basket and hid under her shirt as she left her house. She’d managed to avoid her sister, who had a way of smelling guilt, and only popped in on their mom long enough to tell her she was going to go watch horror flicks with Bessandra and commiserate about her lingering facial puffiness.\nShe blinked away messages from Quinton, who wanted to know if she was really doing it, and from Aline, who was telling her about another party, and found Thierry’s latest. They had agreed to meet around the block from her house, which was good, because that way nobody would see her climbing into a food truck.\nIt was one of those modular rentables, fully self-driving with no steering column, fitted out with a sliding window and bright green holo sign advertising Thinsect seaweed wraps made with hand-raised crickets. She’d been expecting a big bank of microphones and cameras and old-fashioned spy shit, but when she stepped inside it was a regular kitchen plus Thierry and his backpack, which made sloshing sounds and had one tentacle poking out the top.\n“Swelly, right?” he said, instead of saying hello. “I got it for three hours, but we can re-up if we have to. We’ll be on the side street behind the cul-de-sac, close enough to have a strong signal.”\nEtta used both hands to pull the door shut behind her. “Uh, what if someone comes to the window?”\nThierry shook his head. “Nobody eats this shit.”\nShe eyed Pico’s flexing tentacle, which seemed to be trying to touch every part of the countertop cutting board. “I googled a bit,” she said. “And octopuses can only walk on land for like, ten minutes. They start drying out fast. And then they suffocate. I don’t know if ten minutes is enough time.”\n“Yeah, yeah, for your standard Octopus vulgaris it would be a problem,” Thierry grunted, opening his bag and pulling Pico free like a meaty rag. “But Pico’s got a semipermeable wet suit. That’s the shiny stuff. Retains enough water for his gills to get oxygen. Still lets him squirt if he needs to. Fill the sink, would you?”\nFeeling a little better, she thumbed the tap on and narrowly avoided the splash when the truck lurched into motion. It took a few minutes and half the water tank, but then Pico was bobbing peacefully in the sink as they drove. Now that it was really happening, now that they were on their way, she was a weird bubbling mixture of nervous and guilty and slyly excited.\nShe was helping commit a robbery, which was a crime, but they were pinching drugs, which were also a crime, from maxy rich people who wouldn’t miss them real bad. So it nearly cancelled out. Most importantly she was getting her sister’s Stablettos back, which would make it like she never took them in the first place and also make it so her sister didn’t disembowel her.\nShe watched out the window as they cruised along the old bypass, into the thick of the city and then out of it again to where the lux folk lived. The sign for Westpointe Drive was all class, a marble-looking thing illuminated by glowtrees, not cheap holos. They wound their way into the burb and right up to Jasper’s parents’ house, a Brutalist-style castle with smoked smartglass and hydroponic ivy creeping all over it in manicured mandalas.\nShe remembered the little shiver of excitement she’d gotten as she and Aline had pulled up the prior night. This time it was a full-on tremor.\n“Go time,” Thierry said, sliding the window open as the truck slowed, craning his head out to check up and down the street. “Grab him while I gear up.”\nEtta crossed to the sink, trying to remember where the sharp beak was under Pico’s mantle. “I appreciate you, remember?” she muttered.\nHis alien eye narrowed, which didn’t seem like an invitation, but Thierry already had his goggles on and was rummaging the smartgloves out of his backpack, so she reached into the sink. It was like trying to grab gelatin. Pico slid and squelched all over the place and for a second she thought he was intentionally fucking with her, but then the tentacles gripped her arms and he came up out of the water.\n“Okay,” Thierry said, calibrating his goggles. “Okay, okay, okay. Huck him out the window.”\nShe blinked. “What?”\n“Throw him.”\n“We’re still moving,” she protested, clutching Pico tighter to her chest on instinct.\n“Yeah, that’s the point,” Thierry. “Fucking throw him. He’s got no bones. We’ve done this before. Aim for the hedges.”\nEtta stumbled forward and leaned out the window like she was serving someone a seaweed wrap full of hand-raised crickets, but she realized she couldn’t just gently drop him straight down, because what if his tentacles got snagged and run over by the tires? She had to actually hurl him, which felt disturbingly like hurling a slimy baby.\n“I am so sorry,” she whispered, then took a step back, gathered momentum, and launched him right out of the truck.\n“Great arc,” Thierry said, and slid the window shut. The truck sped up again slightly, taking them around the block. Thierry was working the smartgloves, wriggling his fingers. “I’m taking him across the lawn,” he said. “Right now I’m only seeing one person. Downstairs. Streaming porn.”\n“How do you know that?” she demanded.\n“Everyone’s naked.”\n“No, like, how do you know someone’s home?” she asked. “And where they are?”\n“Lenses, man. You might as well still be lugging a phone around. Might as well have one of those chips they put in pet dogs. Your data is like, screaming.” He tapped his goggles. “Why do you think I use these?”\nEtta frowned. “Is whoever it is watching zero gravity stuff?” she asked.\nThierry nodded.\n“That’s the host. We had this big talk about how erections work in space. His parents must be away still.”\n“Unless it’s a familial interest,” Thierry said. “Here, I’ll tap you in.”\n“Uh, no, I’m good.”\n“Not the porn.” Thierry fiddled with his goggles. “The hud.”\nHe twinned them to her lenses and suddenly she was seeing what he was seeing. One side of her vision was a digital map of the house; the other showed a ground-level view of the rock lawn. The view slid forward with a slight bobbing, the tug-along of something orange and pebbly, and she realized she was looking through Pico’s little cam.\nIt was like watching living spaghetti. Every motion was wet and wobbly and she could hear the squelching noises of Pico’s tentacles, assumedly through a tiny mic. Thierry was steering him right over the rocks, right out in the open where anyone could see, and she felt a spike of anxiety in her throat. What if Jasper took a masturbreak and went upstairs and looked out the window? His first thought would not be octo-heist in progress but it would probably be I need some snaps with this octopus, which was equally problematic.\nThen Pico’s tentacles disappeared, mottling gray to match the rocks so perfectly it looked almost like a special effect. She’d forgotten they could do that.\n“How are we getting in?” she asked.\n“That drone-scope I bought showed some wear and tear on the north wall,” Thierry said. “They skimped a little on the ’crete and it got frost-heaved last winter. Should be somewhere around . . . Here.”\nEtta stared at the tiny tiny crack in the exterior wall, barely wider than her thumb. “Zero chance,” she said.\n“No bones, remember?” Thierry was grinning under his goggles. “If the beak and the cam can fit, he can fit. That’s why all the other hardware has to be graphene. Sexy flexy.”\nPico started feeding his tentacles into the crack. It reminded Etta of her Swiss grandpa stuffing dough into a spaetzle maker and she tried not to picture Pico’s tentacles getting sliced into noodles on the other side. There was zero, zero way he could fit. The view went orange and then black as the cam got pushed against Pico’s flesh. Etta clenched her hands at her sides, waiting for him to get stuck.\nThere was a drawn-out squelching sound, then a splurting sound, then Pico spilled out the other side, wriggling all his intact tentacles, and they were in the basement.\n“Swelly, right?” Thierry said.\nEtta grinned, relieved. “Swelly,” she agreed.\nThe basement was still a post-party apocalypse:\nSticky puddles of coagulated pop and beer, stained towels where half-hearted cleanup attempts were made, scattered empties and metal cups, the kind with anti-spill brims that sealed shut if you shook them too hard, but never fast enough, a small pyramid of beer bottles, someone’s shredded shirt, crusts from a Steel Wheels bulgogi pizza, blunt wrappers, mangled packaging from the stupid photoscarves of each others’ faces that a bunch of people had gotten drone-delivered in a fit of camaraderie.\nPico crawled through or over it all, and Etta could not help but feel guilty about her part in creating the knurly knurly mess. She remembered snatches of the party from her actual brain and snatches from the replay she’d watched on aftercams. Thierry steered Pico around the back of the vat-leather couch; Etta saw socked feet poking off the end but Jasper was fully in his lenses and didn’t stir. The lights were dusked hangover dim.\nFor a second she had a mad impulse like she wanted to see his face again, but then she remembered the spewing and didn’t want to see even his feet.\n“You dig him?” Thierry asked, conversational-like as he headed for the staircase.\n“Fuck no,” Etta said.\n“You dug him.”\n“Only the gecko brain did. Swear.”\nThierry laughed, and then a furry orange meteor struck. Etta was so wrapped into the virtual that she jumped backward and jarred her hip bone against the edge of the griddle. The view from Pico’s cam was rolling, somersaulting. She saw a blur of snapping teeth and writhing tentacles. Then there was a violent ripple, the sound of spraying liquid, and the dog or cat or whatever it was scampered backward, half-coated in oily black ink. It gave a wheezy coughing bark, shaking its snout.\n“Mania?” It was Jasper’s voice, tinny through the mic. “Fuck you doing, girl?”\nPico shot away, slinging up the stairs. Etta’s heart was pounding and she didn’t breathe properly until he’d flattened himself into a corner. His skin turned green with pinwheeling purple to match the artsy wall. Etta zipped the view shut so she could see the swelling bruise on her hip. She winced. Thierry was standing beside the cooler, stock-still with his smartgloved hands spread out in the air in front of him.\n“Is he okay?” she demanded. “Is Pico okay?”\n“He’s fine,” Thierry said, but his voice was shaking slightly and the stickman was doubled over, panting. “What the hell was that, E? You said he didn’t have a dog.”\n“He didn’t,” Etta blurted. “I mean, I never saw one. You watched my aftercams.” But then she remembered the wiry orange hairs she’d found on her jacket. She opened a window on the party footage, finding a slurred conversation, an unfamiliar word. She pulled up a definition and grimaced. “He said he was picking up his mom’s thylacine today. I thought it was a medication.”\n“Tasmanian tiger,” Thierry said. “Mania. Shit. They only just started cloning those again. That thing has to be worth double what’s in the safe.”\n“We’re not kidnapping their pet,” Etta protested.\n“Not with Pico, no.”\n“You said he’s okay?”\n“Still mobile, yeah. But I lost a tentacle—”\n“She bit off his tentacle?”\n“Lost control of it,” he clarified. “A few microtrodes must have got damaged. I need a mirror or something shiny to check. If the wet suit got punctured, that’s big problems.”\nEtta opened up Pico’s feed in her lenses again. “Kitchen’s to the left,” she said. “Oh, shit. He inked her, right? Jasper is going to see the ink and be like, what.”\n“His first thought won’t be octopus,” Thierry said bracingly. “It never is.”\nPico peeled away from the wall and scuttled toward the kitchen, following the glass-topped stream in the floor, which glowed eerie blue and had violet jellyfish squirting around inside. His one tentacle trailed along it, kind of wistfully, Etta thought, but Thierry kept driving him forward. They passed a rumbling autocleaner that was battling to digest a chunk of shattered statue Etta vaguely remembered getting knocked over during extreme liquor pong.\nPico crossed over onto grooved kitchen tiles and stopped in front of the shiny black oven. Etta stared at his reflection. Some of the graphene circuitry on his mantle had been scratched up by the thylacine’s blunt nails, but the slick wet suit itself looked intact. His free tentacle arched forward and stroked the glass.\nThierry breathed an audible sigh of relief. “Okay. Wet suit’s fine. But keep a fucking eye out for the tiger.”\nThey skipped the second staircase and went straight up the wall in a rolling wave of tentacles. Thierry was tense now, no talking, and the trip was silent apart from the soft suction-plop of Pico’s suckers. He squeezed through a twisty banister that looked grown instead of carved, and then they were in the familiar hallway that led to the master bedroom. Etta’s stomach churned up a little burp that tasted like taquito vomit.\nThe faux-shōji door to Jasper’s parents’ room was only half shuttered. She felt her dread increasing as Pico crept closer and closer to the scene of the crime. She knew the exact pattern of the spewing from watching the aftercams so many times: the ragged parabola across the bed and floor, the dribbling trail to the laundry hamper, the last heave onto the carpet before she climbed out the window.\nIt was a relief when Pico scuttled inside and the room was fully pristine. The autocleaner obviously had its priorities straight—apart from a few lingering swatches of blue bacterial foam on the floor, she could almost believe nothing had ever happened. She hoped it had found the stuff in the hamper too, but didn’t ask Thierry to check. She was here for the Stablettos.\n“Make sure the shoes are here first,” she said. “You promised.”\nThierry grunted, but he maneuvered Pico underneath the enormous slab of a bed. Etta’s breath caught in her chest. The kicked-off Stablettos were still there, still maxy, sleek and wicked and not a speck of gut stuff on them. Her sister would never know.\n“We’ll pinch them on the way out,” Thierry said. “Or re-pinch them. Whatever.” Pico climbed out from under the bed, up onto the sill, and used one tentacle to unlock the window and nudge it open. The view from the cam lurched as Thierry leaned him forward to inspect the drop. “Yeah, this’ll be our exit.”\n“Through the window?”\n“Worked for you.”\nPico went to the back of the bedroom, where the mirror-shiny safe was built into the wall. Etta and Thierry had watched the footage of Jasper opening it a dozen times, and Thierry had even run it through a machine learner that used the angle of Jasper’s shoulders to guess where his finger was contacting the pad during the few strokes where his arm had been in the way of her lenses. The first try would have something like 83% probability.\nPico stopped in front of the safe, faced with his reflection again. Thierry curled the very tip of one tentacle to about finger size and reached for the pad.\nAnother tentacle swept in and knocked it away.\n“Goddamn, Pico, don’t fuck with me,” Thierry muttered.\n“That’s the one you lost?” Etta demanded, watching the tentacle roam all over the shiny surface of the safe then start touching Pico’s mantle.\n“Yeah. Let me pin it.”\nTwo other tentacles surged upward and grabbed the offender, holding it still while Thierry returned his attention to the touch pad. He danced Pico’s tentacle-tip over a long string of letters and numbers and symbols. Etta bated her breath, trying to tranq. Then there was a familiar electronic chime and the door eased open.\nPico’s tentacle spasmed in a way that made her think Thierry had just pumped his fist. She peered through the cam into the safe. There was hash, but behind it was the really valuable shit: a frosty spiky chunk with a violet tinge that she knew from the flicks meant tetrameth. She wondered how rich you had to be to buy that much at a time.\nPico reached for it, but then his tentacle wavered. Stopped. It shot to the other side of the safe, snatched up a cute pink injector with a sharp needle poking out the end, and drove it into Pico’s head. Etta gave a yelp of alarm and so did Thierry. There was a deliberate twirl, a scraping sound. He was dragging the needle through the graphene circuits on his mantle, using the safe’s metal like a mirror.\n“You aquatic little shit!” Thierry yelled. Etta could feel the air from his waving arms in real life, in the back of the food truck. “Pico, don’t do me like this, Pico! Please!”\nShe halved the window so she could see Thierry, who was desperately jamming his finger against some kind of reset on his smartglove. “He’s wrecking the trodes? Like, on purpose? Whoa.”\nThierry yanked off both gloves and threw them onto the griddle. “Fuck,” he groaned. “I have zero tentacles. He’s freestyling now.” His stickman tattoo was curled up in the fetal position.\nEtta full-sized the feed from Pico’s cam. The octopus had dropped the injector but was still in front of the safe door, flexing and wriggling his tentacles with what had to be octopus happiness. Then he slipped two of them around the edge of the door, into the safe. They re-emerged cradling the tetrameth chunk.\n“Uh, Thierry?” Etta’s voice had done that thing where it got higher without her meaning it to. “Pico just grabbed the tetra.”\n“What?”\nPico slithered away from the safe, still holding the tetrameth aloft in two tentacles, and into the bathroom where Jasper had taken way too long trying to whiz. He oozed over the self-cleaning tiles and climbed up onto the edge of the toilet. It was one of those kinds with way too many buttons; he tapped one and it started playing soothing nature noises.\nThierry was not soothed. “Oh, don’t you do it. Don’t you fucking do it, Pico.”\nEtta watched, transfixed, as Pico positioned himself on top of the toilet tank. He pried the seat up, exposing the bowl. The tetrameth bobbed in front of the cam for a second, then disappeared with a dainty flicking motion. The splash was unmistakable. Pico’s tentacles slid over the buttons again, triggering the urinalysis program and then the seat’s heating pad and then, finally, the flush. The gurgling noise was almost drowned out by Thierry’s howl.\n“That was cold,” Etta said, impressed despite the whole plan going off the rails. “Fully, fully ruthless.” She paused. “Sorry.”\n“Nah.” Thierry’s voice was a croak. “Nah, it’s no big.”\nPico meandered back into the bedroom, stopping to touch stuff along the way, relishing his freedom. She remembered the article she’d skimmed and tagged about how octopuses were always escaping captivity and wondered if she should have brought it up earlier. Her heart sank as she realized Pico was going on the lam and the Stablettos were staying put. She’d done all this for nothing.\nThen Jasper’s mom’s thylacine sprang from the top of the modular dresser. They turned into a tangle of pebbly skin and wiry fur; Etta saw Mania’s nails rake across Pico’s tentacle and remembered what would happen if his wet suit got punctured. The thylacine was mad mad, still half-coated in sticky ink, and its flashing teeth were scalpel sharp. They snapped shut a micrometer from Pico’s cam.\n“Shit!” Etta flinched backward. “Thierry, do something!”\n“I can’t,” Thierry snapped. “He’s freestyling. He made his own seabed.”\n“Can’t he ink again?” she demanded.\n“He’s probably out.”\nIt all crystallized in her head for a blistery clear moment: the only reason they were at the house was because she’d told Thierry about the safe, which she’d only done because she needed her sister’s shoes back, and the reason she needed them back was because she’d stolen them, and the reason she couldn’t just go in and ask for them was because she’d made terrible taquito-and-alcohol decisions. So if Pico got killed fighting Mania the Tasmanian tiger, it would be her fault.\nShe found the shape of the howler in her jacket pocket and wormed it between her fingers. Then she grabbed the backpack Thierry used to carry Pico around and slid the straps over her shoulders.\n“I’m going in there,” she said. “I’m saving Pico.”\nBefore Thierry could stop her, she shoved the back door of the food truck open and hopped down. She’d spent too much of the past hour in her lenses; for a second she was totally disoriented on the dark street, vertigo spinning her head. It was raining and the black road was slicked with grainy yellow light from the glowtrees. They were on the side street behind the house, which meant the fence facing her was the one she’d climbed over last night.\nShe screwed her earplugs in with shaking fingers, yanked the balaclava over her face, then channeled her inner gecko woman and hauled herself up and over the fence. Her shoes slipped against the wet wood and she landed in a heap on the other side, making her bruised hip bone sing. But she was over, and now it was round two with the hydrovine lattice. She sped over the rocks and took a running leap at it, stuffing her hands back into the leafy mass to find the struts that she’d clung to the night before, fully certain that someone was already chatting the police about a very acrobatic intruder.\nClimbing up sober was somehow harder than climbing down faceless fucking drunk. The lattice lurched and swayed, but she didn’t have time to let it settle, just kept pulling herself on until she could jam her fingers into the window and jerk it all the way open. She tumbled through headfirst, remembering the somersault trick about aiming for your shoulders and tucking your chin way too late.\nUp off the floor. Pico had a bunched sheet in his tentacles, maybe to stuff between Mania’s snapping jaws, but now the thylacine turned to face the newest arrival to the party. She bared her teeth and hissed and Etta didn’t wait to find out if Tasmanian tigers bit people or not.\n“Sorry,” she said, and thumbed the howler in her pocket.\nEarplugs or no, the siren was piercing loud, drilling into her skull and raising goose bumps on her arms. The thylacine scrambled, and Etta gathered Pico up like he was her slimy baby and clutched him to her chest. He gave a little ripple, tentacles still clinging to the ball of sheets, so she stuffed the whole mess inside the backpack and zipped it mostly shut. She charged out of the bedroom, down the stairs, her heart skidding out of her chest.\nThe howler had sent the Tasmanian tiger running, but it had also gotten Jasper off the couch: he came barreling up from the basement just as she touched down on the main level. His face was a little less handsome than she remembered, and very surprised. She pelted past him to the front door and threw it open.\nShe had no plan apart from running like mad, but as she vaulted down the steps she saw a distinctive food truck rounding the corner. Thierry must have been watching her lenses. She felt a wave of relief and nearly laughed. Past the glowtrees, over the rock lawn, shoes slapping the wet sidewalk. Her fitpal popped up to congratulate her on the impromptu cardio; she blinked it away.\nShe was only meters away from the back of the food truck when she heard the zipper unzip and Pico dove out the top of the backpack. She doubled over to scoop him back up, but he was already on the move, wriggling over the wet pavement. She splayed out and managed to grab a tentacle just as he got to the storm drain. His bulgey orange eye stared at her for a second, black pupil swelling and contracting.\nOctopuses loved escaping captivity.\nEtta grimaced, feeling shitty instead of heroic, but she let go of his tentacle. “Okay. Adios.”\nPico squeezed himself through the gap and disappeared just as Thierry opened the back door of the truck, shouting for her to get in. She took a last look at the dark storm drain, then a last look at the big beautiful house where a confused Jasper was standing silhouetted in the open doorway. Then she clambered up into the food truck and they sped off.\n“Sewer escape,” Thierry said, once he’d slammed the back door shut. “Man. That’s, like, a classic.”\n“Can an octopus live in sewers?” Etta asked numbly. She slid the backpack off her shoulders and handed it over.\n“They’re not saltwater,” Thierry said. “But he’s got his wet suit. And he’s smart. Too smart. So, maybe.” The stickman on his neck was gripping its head in both hands. “What a fucking disaster. Least you got your shoes, I guess.”\nEtta’s stomach depthcharged. She’d been right up there beside the bed. It would have taken half a second to grope underneath and grab them. She pictured the Stablettos in her mind’s eye, the beautiful sinuous shape of them, and then pictured her sister stabbing her to death with one. Maybe she deserved it. Maybe it was time to start taking the heat for messes her hands and stomach made.\n“No. I forgot to re-pinch.”\nThierry frowned, rummaging inside his backpack. He pulled out the wadded bedsheet and her sister’s Stablettos tumbled to the floor of the food truck, as black and immaculate as the day Etta stole them. Her mouth fell open.\n“He was multitasking up there,” Thierry said. “Distributed intelligence and all that. Think he likes you.”\n“I think I love him,” Etta said. “Shit.” For a moment she was already imagining sneaking them back into place in her sister’s closet and fully denying they were ever gone. “But I’m still going to tell her I took them,” she said aloud, to make sure she would follow through. “Like, confessional. You know?”\n“Yeah?” Thierry was already in his goggles again, only half-listening. “You sure?”\n“Hundred,” she said. “Hundred, hundred sure.”\nThierry nodded vaguely. As the food truck whizzed past the Westpointe sign, Etta started searching up if it was legal to dump frozen shrimp down storm drains. She planned on doing it either way.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}