{"fingerprint": "UiQ0PhcBxUAaRlZNQdTeuo0FBEI=", "sitename": "Clarkesworld Magazine", "title": "Meshed by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_02_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Meshed by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4340 words, short story\nMeshed\nIn the dusked-down gym, Oxford Diallo is making holo after holo his ever-loving bitch, shredding through them with spins, shimmies, quicksilver crossovers. He’s a sinewy scarecrow, nearly seven foot already, but handles the ball so damn shifty you’d swear he has gecko implants done up in those supersized hands. Even with the Nike antioxygen mask clamped to his face, the kid is barely breathing hard.\n“He’s eighteen on November thirtieth, right?” I ask, cross-checking my Google retinal but still not quite believing it. I’m sick as anyone of hearing about the next Giannis Antetokounmpo, the next Thon Maker, but Oxford Diallo looks legit, frighteningly legit.\nDiallo senior nods. Oxford’s pa is not one for words; that much I already gleaned from the silent autocab ride from hotel to gym. Movie star cheekbones, hard sharp eyes. The stubble on his head has a swatch of gray coming in. He’s not as tall as his son, which is like saying, I don’t know, the Empire State Building is not as tall as Taipei 101. They’re both really fucking tall, and the elder’s got more heft to him, especially with the puffy orange fisherman’s coat he has on. I guess he’s fresh enough from Senegal that the climate-controlled gym feels cold to him.\nOn the floor, Oxford moves to a shooting drill, loping between LED-lit circles, catching and firing the ball in rhythm. High release, smooth snap of the wrist. The nylon net goes hiss hiss hiss. He makes a dozen in a row, and when he finally misses it jolts me, like a highlight compilation has somehow gone wrong. That’s how good the stroke is.\n“Form looks solid,” I say, because I don’t think his pa would understand if I told him watching his son shoot jumpers is like freebasing liquid poetry.\n“He works hard,” Diallo senior allows. “Many shots. Every day.” His retinal blinks ice blue. “Excuse me, Victor.” He picks a small plastic case off the bleacher and heads for the lockers. Normally I’d think it’s some kind of bit, leaving me alone to contemplate in silence, but he’s been doing it like clockwork since I picked him and his son up from the terminal at SeaTac. Some kind of lung condition. It’s not hereditary, so I didn’t bother remembering the name of it.\nI’m already sold, I’ve been sold for the past half hour, but Oxford starts to slam anyways. He launches the ball high for an alley-oop, hunts down the bounce and plucks it out of the air, lofting up, hanging hard like gravity’s got the day off. He swipes it right-to-left behind his back and flushes it with his offhand in one mercury-slick motion.\n“Fuck,” I breathe. “We have got to get this kid meshed.”\nI mean, seeing it is one thing. Being able to feel it via nervecast, feel that impossible airtime and liquid power, have the rim float towards you in first person while your muscles twitch and flex, is going to be something else entirely.\nAfter a few more goes at the rack, Oxford sees me waving and jaunts over, looping the ball between his lanky legs on repeat. He takes after his pa facially but his eyes aren’t as sharp yet, and when the antioxygen mask peels free with a sweat-suction pop, he’s got a big white Cheshire grin that would never be able to fit into Diallo senior’s mouth.\n“Oxford, my man,” I say. “How do you like the shoes?”\nHe curls his toes in the factory-fresh Nikes, flexing the porous canvas. The new thing is the impact gel, which is supposed to tell when you’re coming down hard and cradle the ankle, mitigate sprains and all that. But they also happen to look bomb as fuck, lime green with DayGlo orange slashes. I told my girlfriend Wendee I’m getting her a pair for her birthday; she told me she’d rather get herpes.\n“I like them well,” Oxford says reverently, but I can tell his vocabulary is letting him down. The look in his eyes says bomb as fuck.\n“Better make some room in your closet,” I say. “Because we’re going to get you geared up to here. All the merch you can handle. Anything you want.”\n“You want to sign me,” Oxford grins.\n“Oxford, I want you to eat, breathe, and shit Nike for the foreseeable future,” I tell him, straight up. “I would say you’re going to be a star, but stars are too small. You are going to be the goddamn sun about which the league revolves in a few years.”\nOxford pounds the ball thoughtfully behind his back, under his shinbones. “The sun is a star. Also.”\n“And a smartass, too,” I say. “Fanfeeds are going to love you.” I start tugging the contract together in my retinal, putting the bank request through. Sometimes the number of zeroes my company trusts me to wield still floors me. “We’ll want your mesh done for Summit, which might take some doing. Technically nerve mesh shouldn’t go in until eighteen, but technically it also has health-monitoring functionality, so with parental consent we should be able to bully in early. I’ll do up a list of clinics for your pa—”\nI stop short when I realize the grin has dropped off Oxford’s face and down some chasm where it might be irretrievable.\n“No,” he says, shaking his head.\n“No what?”\nHis eyes go hard and sharp. “No mesh.”\nWhat do you mean he’s not getting meshed? my boss pings me, plus a not unusual torrent of anger / confusion emotes that makes my teeth ache.\n“I mean he doesn’t want it,” I say, sticking my hands under the tap. “He says he won’t get the mesh, period.”\nI’m in the bathroom, because I couldn’t think up a better excuse. The mirror is scrolling me an advertisement for skin rejuvenation, dicing up my face and projecting a version sans stress lines. The water gushes out hot.\nDo they even know what it is? Did you explain?\n“They know what a nerve mesh is,” I say indignantly. “They’re from Senegal, not the moon.” I slap some water on my cheeks, because that always helps in the movies, then muss and unmuss my hair. The mirror suggests I try a new Lock’n’Load Old Spice sculpting gel. “But yeah,” I mutter. “I, uh, I did explain.”\nOnce Oxford’s pa got back to the bleachers, I gave both of them the whole wiki, you know, subcutaneous nodes designed to capture and transmit biofeedback, used to monitor injuries and fatigue and muscle movement, and also nervecast physical sensation and first-person visual to spectators. If we get our way, with a little swoosh in the bottom left corner.\nIt’s not something I usually have to sell people on. Most kids, even ones from the most urban of situations, have saved up enough for at least one classic nervecast of Maker sinking the game-winner for Seattle in the ’33 Finals, or Dray Cardeno dunking all over three defenders back when he was still with the Phoenix Phantoms. Most kids dream about getting their mesh how they dream about getting their face on billboards and releasing their own signature shoes.\nThe Diallos listened real intent, real polite, and when I was finished Oxford just shook his head, and his pa put a hand on his shoulder and told me that his son’s decision was final, and if Nike wasn’t willing to flex on the nerve mesh, another sponsor would. At which point I spilled some damage control, got both of them to agree to dinner, and bailed to the bathroom for a check-in with my boss.\nIt’s a zero-risk procedure now, for fuck’s sakes. You can do it with an autosurgeon. Change his mind. A procession of eye-rolling and then glaring emotes, all puffing and red-cheeked.\n“What if we just put a pin in the mesh thing and sign him anyways?” I say. “We can’t let this one get away. You saw the workout feed. We sign him unmeshed, let things simmer, work it into the contract later on as an amendment.”\nIf he’s playing at HoopSumm, he needs a mesh. That’s the coming out party. How the fuck are we supposed to market him without a mesh? Skeptical emote, one eyebrow sky-high. I thought you could handle this one solo, Vic. Thought you wanted that recommendation for promo. Am I wrong?\n“No,” I say quick. “I mean, you’re not wrong.” I yank a paper towel off the dispenser and work it into a big wad with my wet hands. I never elect biofeedback when chatting someone with the power to get me fired; if I did there would be some serious middle-finger emotes mobbing his way.\nFigure out if it’s him or the dad who’s the problem. Then use the one to get to the other. It’s not brain surgery. There’s a chortling emote for the pun, then he axes the chat.\nI’m left there shredding the damp paper towel into little bits, thinking about the promotion that I do want, that I absolutely do want. I’d finally be making more than my old man, and Wendee would be happy for me for at least a week, and maybe during that blissed out week I would get up the balls to ask her to move in.\nBut first, I have to get the Diallos to sign off on a nerve mesh. I’m not exactly bursting with ideas. That is, not until I go to toss the towel in the recycler and see a rumpled napkin inked with bright red blood sitting on top. Then I remember Oxford’s pa and his little plastic case. I shove it all down and head back to the gym, only pausing to order a tube of that new hair gel.\nI take them to a slick new brick-and-glass AI-owned bar, because taking them up the Space Needle would be too obvious. A little holohost springs up at the entry, flashes my retinal for available funds, and takes us straight to private dining. We pass a huge transparent pillar full of chilled wine, which I notice Oxford’s pa look at sideways. More important is Oxford himself staring at the shiny black immersion pods set into the back of the bar. I send them a subtle ping to start scrolling ad banners for some fresh League nervecasts while we settle in around the table.\n“Fully automated,” I say, as the waiter rolls up to start dispensing bread baskets, arms all clicking and whirring. “Not bad, right?”\nOxford’s pa nods his head, looking weirdly amused.\n“They have AI cafés in Dakar,” Oxford informs me, scrolling through the tabletop menu. “Since last year.”\nHe’s already put in an order for scallops, so I guess it’s too late to head for the Space Needle. Instead I ping the kitchens for oysters and a few bottles of whatever wine has the highest alcohol content, which turns out to be something called General Washington. I pull up a wiki about vintages to give Oxford’s pa some background, seeing how I can barely tell the difference between a white and a red.\n“To the Diallos,” I say, once me and him have our glasses filled and Oxford is nursing a Coke.\n“Cheers,” Oxford beams.\nWe make some chatter about the length of the flight, about the stereotype that it always rains in Seattle but how really it’s mostly just cloudy. My mouth is more or less on autopilot because I’m watching for Oxford to peer over at the immersion pods. When I catch him at it the third time, I give him a nod.\n“Have a go, man,” I say. “Company tab. We’ll grab you when the food is here.” Oxford grins and lopes off without any further convincing, leaving me with Diallo senior. I lean over and top off his wine glass. “You started off playing in the African leagues, isn’t that right, Mr. Diallo?”\nHe takes a drink and makes an approving glance at the bottle. “Yes,” he says. “Then Greece.”\n“You must have been a terror back then,” I say. “To drag Trikala all the way to the A1 finals.”\nOxford’s pa shrugs, but looks nearly pleased.\n“I watched a few highlight reels,” I say modestly. “Part of the job, isn’t it, checking out the pedigree.” I swish my wine back and forth and take a big gulp. “Oxford gets it from somewhere.”\n“From more than me or his mother,” Diallo senior says. “From who knows where. Maybe God.”\nBut he’s glad enough to talk about the stint in Greece for a while, about how he was nearly picked up by Cordoba in the Liga ACB before the bronchiectasis reared its head and suddenly he couldn’t run how he used to. I ping the kitchens to hold the food.\nWhen the bottle is gone and Oxford’s pa is finally slumping a bit in his chair, eyes a bit shiny, I spring the question. “Why doesn’t your boy want a mesh?” I say.\nOxford’s pa flicks his gaze over to the immersion pod where his son is jacked in. “His grandfather had a mesh,” he says. “My wife’s father. He was a soldier.”\nI kind of startle at that. I mean, I know, in theory, that the nerve mesh technology was military before it went commercial—so was Velcro—but I never thought about it getting use over in fucking West Africa.\n“They used them to track troop movements,” Oxford’s pa continues. “And to monitor the health of the soldiers. To monitor their anxiety.”\n“Ours do that, too,” I say. “Mental health of our players is a top priority.”\n“They did more than that.” Diallo senior empties his glass with a last gulp, then sets it down and looks over at the second bottle. “They wired them for remote override of the central nervous system. You have heard of puppeteering, yes?”\nI shake my head. I already know I’m not going to like whatever it is.\nOxford’s pa opens the new wine bottle with his big spidery hands, looking pensive. “It means a soldier cannot break ranks or desert,” he says. “A soldier cannot turn down an order to execute six prisoners taking up too much space in the convoy. Someone else, someone far away, will pull their finger to pull the trigger.” He sloshes wine into his glass and tops mine off, gesturing with his other hand. “A soldier cannot be interrogated, because someone far away will lock their jaws shut, or, if the interrogation is very painful, unplug their brainstem.”\nHe mimes yanking a cord with two fingers, and I feel suddenly sick, and not from the wine. “That’s fucking awful,” I say. “Christ.”\n“Not our invention,” Diallo senior says.\n“But that’s nothing like what we do with ours,” I say. “We don’t control anything. Not a thing. If you could help your son to understand that—”\n“Not a thing,” Diallo senior echoes. He snorts. “You think knowing a million people are going to be watching out of your eyes does not control what you do?”\n“If you’re talking about off-court fanfeeds, those are entirely optional,” I say, but I’m not sure that’s what he’s talking about. “The fans love them, of course,” I add. “But it’s not contractual.”\n“Oxford does not want you inside his body,” Diallo senior says. “He does not want you behind his eyes. He does not want the mesh.”\nThen his retinal blinks blue, and it’s a good thing, because I don’t have a good response. He excuses himself to the washroom with his kit, weaving just slightly on his way, which leaves me sitting with a full wine glass and the mental image of some mutilated soldier having his brain shut down by committee.\nBut that’s nothing like our mesh.\nI nab Oxford out of the immersion pod while his pa’s still in the washroom. He climbs out looking all groggy, craning his head to see where the scallops are at.\n“What’d you think?” I say. “You like the nervecast?”\nOxford nods, almost reverently. “I crossed up Ash Limner,” he says.\n“That could be you in there, you know,” I say, tapping the pod. “People would be paying to be you in there.”\nOxford gives the pod a look with just a bit of longing in it.\n“Everyone has a mesh,” I say. “Ash Limner is meshed. Dray Cardeno is meshed. Why not Oxford Diallo, huh?”\nOxford chews his lip. “I promised,” he says.\n“To your grandfather?” I ask.\nHe looks surprised. “Yes.”\n“But this mesh is different, Oxford,” I say. “We don’t call the shots. You call the shots. We’re just along for the ride.”\nOxford frowns. “He said the mesh is a net you never get untangled from.”\n“You said you liked the nervecast,” I say. “That’s kind of hypocritical of you, don’t you think? You enjoying someone else’s nervecast when you won’t get a mesh for yourself?”\n“No,” Oxford says simply. “They chose.”\n“They chose, yeah, of course,” I say. “It’s always a choice. But they made the right choice. Man, you have a gift. Your dad said it himself. You have a gift from God.” I put my hand on the pod again. “You owe it to the world to make the most of that gift. I’m never going to know what it’s like to slam how you do. I could barely dirty-dunk back in high school. Ninety-nine point ninety-nine percent of people are never going to know what it’s like. Unless you let us.”\nI can sense him wavering. He’s looking down at the pod, looking at his reflection in the shiny black mirror of it. I feel guilty in my gut, but I push right through, because this is important, getting this deal, and he’ll thank me later.\n“You owe it to us,” I say. “Your dad’s in the washroom. You know what he’s doing in there?”\nOxford looks up, startled. Nods.\n“Hacking up blood,” I say. “He’s never going to run again. Not how he used to. You don’t think he’d like a chance to feel that again? To hit the break? To get out for that big dunk in transition, pound up the hardwood, slice right to the rack, drop the bomb like wham.” I clap my hands together and Oxford flinches a bit. “You owe it, man,” I say. “You owe it to your dad. He got you here, didn’t he? He got you all this way.”\nAnd that’s when Diallo senior comes out of the washroom, and I couldn’t have done it any better if I choreographed it myself, because he staggers a bit against the wall and looks suddenly old, suddenly tired. Oxford looks at him, looks scared as hell. Maybe realizing, for the first time, that his pa won’t be around forever.\nI reach as high as I can and put my hand on his shoulder. “You know the right call, yeah?”\nHe hesitates, then slowly nods, and I want to bite off my tongue but I tell myself it’s worth it. Tell myself the both of them will thank me later.\nSupper is quiet. Oxford is obviously still thinking about what I said, stealing odd glances over at his pa, and his pa is trying to figure out what’s going on without actually asking. It’s a relief for everyone, I think, when the oysters are finished and we head back outside.\nThe Seattle sky’s gone dark and the air is a bit nippy. Oxford’s pa pulls on a pair of gloves while we wait for the autocab. When it pulls up, Oxford announces he’s not ready to head back to the hotel yet. He wants to shoot.\n“Yeah, alright,” I say. “Can head back to the gym. Got it rented for the whole day.”\n“No,” Oxford says. “Somewhere outside.”\nSo we end up doing loops through the downtown until GPS finds an outdoor court at some Catholic school ten minutes away. There’s no one else there when we show up, and the court has one of those weird rubbery surfaces, but Oxford doesn’t seem to mind. He zips off his trackies and digs his ball out of his duffel.\nHis pa keeps the gloves on to feed him shots, moving him around the arc, hitting him with nice crisp passes right in the shooting pocket. You can tell that this whole thing, this whole tableau, with him under the net and Oxford catching, shooting, catching, shooting, is something they’ve done a million times on a million nights. The bright white floodlights make them into long black silhouettes. Neither of them talk, but little puffs of steam come out of Oxford’s mouth as he moves.\nI watch from the chain-link fence, leaning back on it. Oxford’s form is still smooth levers and pistons, but when I get a glimpse of his face I can see he is not smiling how he smiled in the gym. I manage to lock eyes with him, and I give him a nod, then give him some privacy by walking down to the other end of the court. I hear him start talking to his pa in what my audio implant tells me is Serer.\nI’m thinking the contract is as good as signed, and I’m about to tell as much to my boss when I hear the ball slam into the chain-link fence, sending ripples all down the length. I turn to see Oxford’s pa shrugging off his orange jacket, face tight and livid mad. He looks right at me, the sort of look you give something stuck to the bottom of your bomb-as-fuck shoe, then turns to his son.\n“You think I cannot remember what it feels like to run?” he says. “You pity me?”\nOxford shakes his head desperately, saying something in Serer again, but his pa is not listening.\n“We will play, then,” he says, and I get that he’s talking in English so I’ll understand. “You beat me, you can get the mesh surgery. Yes?”\n“I did not want . . . ” Oxford trails off. He stares at me, confused, then at his pa, hurt.\n“It will be easy,” Diallo senior says. “I am old. I have bad lungs.” He scoops the ball off the pavement and fires it into Oxford’s chest. His son smothers it with his big hands but still has to take a step back, maybe more from the surprise than from the impact.\nOxford puts it on the floor and reluctantly starts his dribble. “Okay,” he says, biting at his lips again. “Okay.”\nBut he sleepwalks forward and his pa slaps the ball away, way quicker than I would have thought possible. Diallo senior bullies his son back into the post, hard dribble, fake to the right and then a short sharp jump hook up over his left shoulder. It’s in the net before Oxford can even leave his feet.\nThey’re playing make it take it, or at least Oxford’s pa is. He gets the ball again and bangs right down to another post-up, putting an elbow into Oxford’s chest. Oxford stumbles. The same jump hook, machine precision, up and in. The cords swish.\n“I thought you want it now,” Diallo senior says. “I thought you want your mesh.”\nOxford looks stricken, but he’s not looking over at me anymore. He’s zeroed in. The next time his pa goes for the hook, he’s ready for it, floating up like an astronaut and slapping the shot away hard. Diallo senior collects it in the shadows, brings it back, but the next time down on the block goes no better. Oxford pokes the ball away and dribbles it back to the arc, near enough to me that I can hear a sobbing whine in his throat. I remember that he’s really still a kid, all seven feet of him, and then he drills the three-pointer with his pa’s hand right in his face.\nAnd after that it’s an execution. It’s Oxford darting in again and again breathing short angry breaths, sometimes stopping and popping the pull-up jumper, sometimes yanking it all the way to the rack. He’s almost crying. I don’t know if they’re playing to sevens, or what, but I know the game is over when Oxford slips his pa on a spin and climbs up and under from the other side of the net, enough space to scoop in the finger roll nice and easy, but instead his arm seems to jack out another foot at least, impossibly long, and he slams it home hard enough that the backboard shivers. He comes down with a howl ripped out of his belly, and the landing almost bowls his pa over, sends him back staggering.\nDiallo senior gathers himself. Slow. He goes to pick up the ball, but suddenly his grimace turns to a cough and he doubles over. The rusty wracking sound is loud in the cold air and goes on forever. Oxford stands there frozen, panting how he never panted in the gym, staring at his pa, and I stand there frozen staring at both of them. Then Diallo senior spits up blood in a ragged parabola on the sticky blue court, and his son breaks the frieze. He stumbles over, wraps his arms around him.\nA call from my boss blinks onto my retinal, accompanied by a sample from one of the latest blip-hop hits. It jangles back and forth across my vision while I stand there like a statue. Finally, I cancel the call and take a breath.\n“You don’t have to sign right away,” I say.\nOxford and his pa both look up, remembering I’m there. I shouldn’t be.\n“You can think about it,” I stammer, ashamed like I’ve never been. “More. About the contract.”\nI want to tell them to forget the contract. Forget the mesh. We’ll make you famous without it. But instead I skulk away, out through the cold metal gate, leaving the Diallos huddled there under the floodlight, breathing a single cloud of steam.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}