{"fingerprint": "UawhuFNakigDYfFDqDaH23s+Kq0=", "sitename": "Clarkesworld Magazine", "title": "Travelers by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_07_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Travelers by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3150 words, short story\n Travelers\n The torpor pod is open, amber lights blinking in the gloom, intravenous and recycling systems still pumping like a slow heartbeat. Bubbly blue insulatory fluid pools on the floor, stamped with the malformed crescent of a bare footprint. A splattered blue trail leads from the pod to a status screen, where a woman is swaying, squinting at the blurred numbers.\n She is naked. Her skin is ruddy red and grainy with goosebumps; a tattoo of a swallow stutters up and down her ribcage, the animated ink working through cold capillary beds. Her hands and feet are swollen but when she straightens up the nodes of her spine show like a stray cat’s. She has been in torpor for a long time.\n She knows she should not be awake yet. Nobody else is. But the status screen shows an emergency thaw was triggered for reasons of health and safety. It shows color-coded charts of hormone cycles and energy consumption. It shows her the way to the medbay.\n There has been a glitch. That is the thought that pushes to the front of her fragmented head. But if she goes to the medbay and submits to the full scan, maybe the glitch will resolve. She presses her vein-webbed hand to her stomach and the corner of her mouth twitches.\n A drawer rolls open, revealing a burned-orange coverall. She dresses slowly, clumsily. The orange fabric swallows her like a shroud. She puts on the gel slippers; they hug slick and warm to her feet and undo the knot between her shoulder blades. She straightens up.\n Small swatches of hologram lead the way to the door, a trail of digital breadcrumbs. She watches them blink while she composes herself, drawing lungfuls of cold air through her nose, puffing them out her pursed lips.\n She knows you are not supposed to dream in torpor, but she feels as if she has had a nightmare. Pangs of fear and disorientation slice up through the fog in her head and disappear just as quickly. She reminds herself that it is not unusual. Extended torpor takes a toll on the brain.\n “How long til we arrive?” she whispers. Her voice has flaked away to almost nothing.\n The status screen flashes: 32 years, 49 +- 2 days to Pentecost.\n “Thank you,” she says.\n She follows the breadcrumbs.\n The ship’s interior lights are dusked down to conserve power, but the holographic trail glows a bright acid yellow in the dark. She follows it down the narrow corridors, walking in step with her own stretched shadows, sometimes pausing hands-on-head to catch her breath. She can hear her own labored breathing, her pulse battering her eardrums, the soft suction plop of her gel shoes against the floor.\n She can hear guitar notes. As she walks she tries to remember if extended torpor can cause audio hallucinations. The guitar grows louder, starting to strum. She knows the song. A smile drifts over her face and when the trail directs her left, she heads right, toward the music.\n The airlock’s inner door is open. Hullsuits dangle from racks in the ceiling like mannequins and there’s a man sitting underneath them, pooled to the waist in blankets. A heat lamp illuminates him. He has broad shoulders but a boyish face only dusted with beard. His eyes are half-closed as he plays the printed guitar cradled in his lap. He looks familiar, but the ship carries over a hundred refugees and most of them she did not meet in the panicked days before the launch.\n “You play pretty good,” she says.\n The man’s eyes fly open. The guitar tumbles from his hands. He stares at her like she might be a ghost, then his eyes gleam with tears.\n “Thank god,” he says. “I thought I was the only one.”\n He says his name is Derek and that he has been awake for nearly two months now. Like her, he was told it was an emergency thaw. Like her, he was directed to the medbay. But, as he shows her on the way to the mess, the medbay is sealed off. The locklight glowers red when he swipes his thumb; she tries it herself and gets the same result.\n “And we can’t go back to sleep?” she asks him.\n They are in the mess now, sitting at one of the cheery yellow tables that flexes up from the floor like a toadstool at their approach. The man brought the heat lamp with him. She leans into the warmth, rubbing her hands together.\n “Not without medbay approval,” he says, raking his hands through his hair. “It’s, it’s, it’s . . . ” He makes a loop in the air with his finger.\n “A catch twenty-two,” she says. She sets her fork and knife down and uses her fingers to pick up the last strands of vegetable. She folds them into her mouth, chewing slowly with sore jaws.\n “Did you like it?” he asks. There is an eager look on his face. “The vatmeat was ration, but the eggplant came from the hydrogarden. I got it up and running.”\n “I liked it,” she says. She was ravenous. She would have eaten anything. “It only took two months to grow that big? The eggplant.”\n “Genemod strain.” He shrugs. “Those scientists, they, they know their shit. The potatoes are gigantic.”\n “There must be an override,” she says. “To restart the torpor cycle.”\n The man hangs his head. “I’ve tried,” he says. “I’ve tried everything. But I was a plankton farmer, not a tech. Are you a tech?”\n “No,” she says. “What did the status screen say when it woke you up? What was the reason it gave?”\n “Irregular heartbeat, I think. I don’t remember.” He blinks. “What did it say for yours?”\n His hand is spread flat and calm on the tabletop. His fingertips are thick with calluses.\n “The same thing,” she says. “Thanks for the food.”\n She takes her plate and fork to the scrubber.\n Whatever error woke them early has been causing other problems, too. The oxygen stores are lower than they should be. Emergency lights are malfunctioning. Half the ship is sealed off by the same red locklights blocking the medbay.\n “Fifty years is a long time for a ship to run itself,” the man says. “Too long. They troubleshoot these things in virtual, you know, these self-monitoring systems, but reality is always trickier.”\n “Always,” she says. “At least we maintained trajectory.”\n Then she goes into the bathroom and vomits into the puckered mouth of the disposal unit. She tells herself it is only because she ate too much, too quickly, for her shrunken stomach to handle. The other possibility looms dark and jagged.\n She looks at her sunk-eyed reflection in the mirror and tongues a sliver of meat from between her teeth. She touches the cool molded handle in the pocket of her coverall.\n The man is waiting for her when she comes out, shifting foot to foot. “Sorry,” he says, sheepish. “It’s just, you know, two months without having anyone to talk to, it’s scary, you know? I’m half afraid I’m dreaming.”\n In the cramped space of the corridor, the man seems bigger. His arms and shoulders are layered with thick muscle. Nothing like her own atrophied limbs.\n She smiles for him, stretching her lips off her teeth. “I’m real,” she says. “Don’t worry.”\n He smiles back so wide.\n She has slept for years but is soon exhausted. Extended torpor takes a toll on the body. The man offers her the airlock and its nest of blankets.\n “It’s warmer,” he says. “And you can see stars sometimes, through the viewport.”\n “You’re not afraid of getting flushed?” she asks. “With everything else going haywire?”\n The man blinks. “I hadn’t thought about it.”\n She takes blankets to the mess instead, raising one of the tables to half-height and stretching out on top of it. She does not sleep. Instead she lies there in the dark and imagines the man’s calloused fingers roaming over her skin. She bites down on her knuckles hard.\n The guitar starts to strum again. The same notes, the same song. He plays it well, and as soon as the last note fades in the air, he starts over. She lies there listening as long as she can stand it, clutching at her belly. Then she slides quietly off the table and takes off her gel shoes.\n The corridors are pitch black and the cold floor bites her feet. She goes slowly, feeling her way along the wall, until she sees the red glow of the sealed medbay doors. Peering close, she can see now what the man obscured with his half-turned body: the locking circuitry has been tampered with. A drizzle of hardened epoxy marks where the panel was resoldered.\n She moves on. The guitar grows louder as she approaches the airlock. The man has his broad back to her, facing the viewport, looking out into black space as he plays. For a moment she imagines the inner door slamming shut, the exterior rushing open, the man spinning out into nothing.\n Then she pads past, heading back toward the torpor room. The door hisses open with a jet of cold air; she folds her arms around herself. The pods are in two long rows that stretch back into the dark. She can dimly make out the one that was hers, its shell sprung open. But she is not here to find her own pod.\n She goes to the status screen and pulls up the passenger directory. D-E-R-E and the man appears in grayscale photograph, clean-shaven, smiling so wide. Torpor pod number eighty-seven. She taps to see the pod’s health report, and sees there has been no input for nearly three years.\n Her heart stops. She goes back to the directory, viewing it as a top-down diagram of the torpor room, and finds there are other empty pods, teeth missing from a grin.\n “Couldn’t sleep?”\n The man is in the doorway, hands up on the frame. His face is all shadow.\n “There has to be an override somewhere,” she says. “To put us back in torpor. I was looking.”\n “You need to rest,” the man says. “Extended torpor takes a toll on the brain. You won’t be thinking clearly for a few more days.”\n She nods, keeping her half-turned body between him and the screen. He steps forward. In the dim illumination of the torpor pods, his eyes seem to gleam. They travel from her face down her body and back.\n “Can you piggyback me?” she says. “My legs are giving out.”\n The man shrugs. “Alright.”\n He turns and sinks to a crouch. She blanks the screen with a trembling finger. Then she reaches into her coverall pocket, wraps her arms around his thick neck, and places the edge of the knife up under the corner of his jaw.\n He freezes. Then he laughs. She can feel an artery bobbing against the blade.\n “Take me to the medbay,” she says.\n “I don’t think you want to see the medbay,” the man says.\n She tries to keep her voice from breaking. “Take me to the medbay, you sick fuck.”\n “Three years is a long time to be by yourself,” the man says. “After a few months, I started seeing things. Hearing things. Started to talk to myself.”\n “Just open the door,” she tells him. Her arms are still clamped around his neck, aching from the effort.\n “The hydrogarden didn’t produce for the first year and a half,” he says. “Emergency rations ran out after the first year.”\n He pushes a matte black keystick against the pad, and the locklight turns blue. The medbay door slides open, gushing icy vapor. He has the temperature dialed down even colder than the torpor room. She holds out her hand and he puts the keystick in it. Then he walks her into the room.\n Lights switch on, stark white halogens. Wine-red splashes stain the floor.\n A frost-furred autosurgeon hangs from the ceiling like an enormous spider with scalpels for limbs. On the table beneath it, there is most of a woman’s leg. The autosurgeon is frozen in its work, calipers peeling muscle back from bone, cubing the meat into neat portions.\n “She was already dead,” the man says. “She full flatlined in torpor. I needed to eat, didn’t I?”\n Her stomach heaves. “You fed me meat,” she says.\n “You said you liked it.”\n He throws her off; she tries to slash with the knife but her arm is still weak. She hits the floor hard and it slams the breath out of her. Her vision swims. When it clears the man is standing over her, fingering a bloody notch in his ear, grimacing.\n “They would understand,” he says. “We’re all survivors. That’s why we made it on board, you know? We all had to do things.”\n “How many?” she asks.\n He shakes himself like a dog. Instead of answering, he goes to the autosurgeon and switches it back on. It starts to pull and slice, monomolecular blades jittering through the frozen muscle, almost soundless.\n “I checked your pod,” he says. “I saw why it woke you. I didn’t know that would happen. I didn’t know it was possible.”\n She remembers how he looked at her belly in the torpor room. She clutches at it now with her fingernails, like she can tear it open. Her other hand scrabbles for the knife.\n “Maybe it’s a miracle,” the man says. “A sign. You’re carrying the first free child. First of the new generation. Try to think of it that way, maybe.”\n “Shut up,” she says. “Shut up.”\n “You don’t know what it’s like to be by yourself for this long,” he says. “At first I only looked at you. But then it got so I could hear you talking to me. Saying things. Saying what you wanted.”\n She sets the point of the knife to her belly button. “I’ll carve myself open,” she says. “Carve myself open and tear it right out.”\n “I don’t think you will,” the man says, watching the autosurgeon work, almost hypnotized by the flashing scalpels. “You’re a survivor. You’ll adjust.”\n “Did you even try to restart the torpor?” she says.\n He finally looks at her. “What?”\n “Did you even try to go back to sleep?” she says. “Or was this perfect for you? Your own little kingdom.”\n The man’s face is blank for a moment, then contorts. “You think I wanted this?” he says. “I never wanted this. I never wanted to do this.” He advances on her. “I spent six months trying to get back into that pod. Four months trying to get into someone else’s. It never worked.”\n She uses both hands to drive the knife into his foot. The blade jars against bone and she nearly loses her grip on the handle as he stumbles back, howling. She picks herself up off the floor, a tidal wave of adrenaline crashes through her aching body, and she runs.\n Remembering the hullsuits, she heads for the airlock. The cold stabs at her bare feet. She peels down the top half of her coverall as she runs; when she arrives she climbs out of it completely, holding the handle of the knife in her mouth so she can use both hands. Then she pushes through the dangling hullsuits and pulls the last one off its hook.\n She is trembling all over as she wrestles with the hullsuit, stuffing her coverall inside, letting one orange sleeve flap loose. Her reflection in the viewport is ghoulish, eyeless. Beyond it there is nothing but blackness. She slips the knife from between her teeth, and when she hears uneven footsteps approaching in the corridor, she worms the tip of the blade into the hullsuit’s pressurized knee joint.\n There is no time to hide around the corner. She bellies out on the floor and pulls one of the blankets overtop of her just as the man arrives.\n “I know my way around the autosurgeon now. If it’s what you really want, I could set it up to take care of the problem.”\n She bites down on her knuckles, willing herself stone. Unmoving, unbreathing. She hears the man come closer until he is standing almost directly over her. She can smell his grime and sweat and musk. She can feel his body radiating heat. Her hand is twitching and she is sure he will see it ripple the blanket.\n “I won’t touch you again,” he says. “Not until you’re ready. Thirty years is a long time. Humans, we’re adaptable. You know? We forgive and forget. Eventually we’ll forget all about this. We’ll live in the hydrogarden. We’ll play music. We’ll grow old together. Doesn’t that sound okay?”\n He sucks a sharp breath and she imagines the punctured joint of the hullsuit finally flexing, the tell-tale orange fabric of her coverall waving in the air. She feels him vault over her prone body. As soon as he does, she rolls the other way. Her heart hammers staccato in her chest. He shouts but she is already out of the airlock, already has both hands slammed against the control panel.\n He yanks his outstretched fingers back a nanosecond before the inner door thunks shut. His laugh comes hollow through the plastiglass. He pushes his forehead up against it, making a circular splotch of flesh, and she can see tears in his eyes again.\n “I didn’t mean for you to wake up,” he says, breath fogging his face like a mask. “If you’d have just stayed sleeping, everything would have been fine. You wouldn’t have ever had to know.”\n She keys the outer door. It doesn’t fly open how she imagined it. The airlock only starts to hiss, venting its atmosphere back into the ship, not a molecule of oxygen to be wasted.\n “I could have woken you,” the man says. His eyes are moving up and down her naked body, up and down, following the swallow tattoo. “Could have woken everybody. But I didn’t. I knew the ship couldn’t support it. I didn’t wake even one other person. I didn’t want to make them suffer how I suffer. I sacrificed.” A vein bulges in his neck and he slams his fist against the window. “Don’t you think I deserved something for that? Don’t you think I deserved something, you fucking whore?”\n “You’re getting it,” she says.\n The man thumps his forehead against the plastiglass. There are tears running down his cheeks. “I’m sorry,” he says. “I’m so sorry. Let’s start over, okay? Let me. Let me play you something.” He picks his guitar up off the floor and starts tuning it.\n As she staggers away, back toward the medbay and the whirring autosurgeon, he starts to play. She knows the song. She knows he will play it until his fingers are numb and his eyes slip shut.\n Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}