{"fingerprint": "/i96CDJM21qzV+04bNnKq/2iHcY=", "sitename": "Clarkesworld Magazine", "title": "Ice by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_10_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ice by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3780 words, short story\nIce\nSedgewick had used his tab to hack Fletcher’s alarm off, but when he slid out of bed in the middle of the night his younger brother was wide awake and waiting, modded eyes a pale luminous green in the dark.\n“I didn’t think you were actually going to do it,” Fletcher said with a hesitant grin.\n“Of course I’m going to.” Sedgewick kept his words clipped, like he had for months. He kept his face cold. “If you’re coming, get dressed.”\nFletcher’s smile swapped out for the usual scowl. They pulled on their thermals and gloves and gumboots in silence, moving around the room like pieces of a sliding puzzle, careful to never inhabit the same square space. If there was a way to keep Fletcher from coming short of smothering him with a blanket, Sedgewick would’ve taken it. But Fletcher was fourteen now, still smaller than him but not by much, and his wiry modded arms were strong like an exoskeleton’s. Threats were no good anymore.\nWhen they were ready, Sedgewick led the way past their parents’ room to the vestibule, which they had coded to his thumb in penance for uprooting him again, this time dumping him onto a frostbit fucking colony world where he was the only unmodded sixteen-year-old for about a million light years. They said he had earned their trust but did not specify exactly how. Fletcher, of course, didn’t need to earn it. He could take care of himself.\nSedgewick blanked the exit log more out of habit than anything, then they stepped out of the cold vestibule into the colder upstreet. The curved ceiling above them was a night sky holo, blue-black with an impossibly large cartoon moon, pocked and bright white. Other than Sedgewick and his family, nobody in New Greenland had ever seen a real Earth night.\nThey went down the housing row in silence, boots scraping tracks in the frost. An autocleaner salting away a glistening blue coolant spill gledged over at them suspiciously as they passed, then returned to its work. Fletcher slid behind it and pantomimed tugging off, which might have made Sedgewick laugh once, but he’d learned to make himself a black hole that swallowed up anything too close to camaraderie.\n“Don’t shit around,” he said. “It’ll scan you.”\n“I don’t care,” Fletcher said, with one of those disdainful little shrugs he’d perfected lately, that made Sedgewick believe he really truly didn’t.\nThe methane harvesters were off-cycle, and that meant the work crews were still wandering the colony, winding in and out of dopamine bars and discos. They were all from the same modded geneprint, all with a rubbery pale skin that manufactured its own vitamins, all with deep black eyes accustomed to the dark. A few of them sat bonelessly on the curb, laid out by whatever they’d just vein-blasted, and as Sedgewick and Fletcher went by they muttered extro, extros den terre. One of them shouted hello a few beats too late.\n“Should run,” Fletcher said.\n“What?”\n“Should jog it.” Fletcher rubbed his arms. “It’s cold.”\n“You go ahead,” Sedgewick said, scornful.\n“Whatever.”\nThey kept walking. Aside from the holos flashing over the bars, the upstreet was a long blank corridor of biocrete and composite. The downstreet was more or less the same plus maintenance tunnels that gushed steam every few minutes.\nIt had only taken Sedgewick a day to go from one end of the colony to the other and conclude that other than the futball pitch there was nothing worth his time. The locals he’d met in there, who played with different lines and a heavy ball and the ferocious modded precision that Sedgewick knew he wouldn’t be able to keep pace with long, more or less agreed with his assessment in their stilted Basic.\nOutside the colony was a different story. That was why Sedgewick had crept out of bed at 2:13, why he and Fletcher were now heading down an unsealed exit tunnel marked by an unapproved swatch of acid yellow hologram. Tonight, the frostwhales were breaching.\nMost of the lads Sedgewick had met at last week’s game were waiting at the end of the exit tunnel, slouched under flickering florescents and passing a vape from hand to hand. He’d slotted their names and faces into a doc and memorized it. It wasn’t Sedgewick’s first run as the new boy and by now he knew how to spot the prototypes.\nYou had your alpha dog, who would make or break the entry depending on his mood more than anything. Your right-hand man, who was usually the jealous type, and the left-hand man, who usually didn’t give a shit. Your foot-soldiers, who weathervaned according to the top three, ranging from gregarious to vaguely hostile. Then lastly your man out on the fringe, who would either glom on thick, hoping to get a friend that hadn’t figured out his position yet, or clam right up out of fear of getting replaced.\nIt was a bit harder to tell who was who with everyone modded and nobody speaking good Basic. They all came up off the wall when they caught sight of him, swooping in for the strange stutter-stop handshake that Sedgewick couldn’t quite time right. Petro, tall and languid, first because he was closest, not because he cared. Oxo, black eyes already flicking away for approval. Brume, compact like a brick, angry-sounding laugh. Another Oxo, this one with a regrowth implant in his jaw, quiet because of that or maybe because of something else.\nAnton was the last, the one Sedgewick had pegged for alpha dog. He gripped his hand a beat longer and grinned with blocky white teeth that had never needed an orthosurgery.\n“Ho, extro, how are you this morning.” He looked over Sedgewick’s shoulder and flashed his eyebrows. “Who?”\n“Fletcher,” Sedgewick said. “The little brother. Going to feed him to a frostwhale.”\n“Your brother.”\nFletcher stuffed his long hands into the pockets of his thermal and met Anton’s gaze. Sedgewick and his brother had the same muddy post-racial melanin and lampblack hair, but from there they diverged. Sedgewick had always been slight-framed and small-boned, with any muscle slapped across his chest and arms fought for gram by gram in a gravity gym. His eyes were a bit sunk and he hated his bowed nose.\nFletcher was already broad in the shoulders and slim-hipped, every bit of him carved sinew, and Sedgewick knew it wouldn’t be long before he was taller, too. His face was all angles now that the baby fat was gone: sharp cheekbones, netstar jawline. And his eyes were still reflecting in the half-lit tunnel, throwing light like a cat’s.\nSedgewick could feel the tips of his ears heating up as Anton swung his stare from one brother to the other, nonverbalizing the big question, the always-there question, which was why are you freestyle if he’s modded.\n“So how big are they?” Fletcher asked, with his grin coming back. “The frostwhales.”\n“Big,” Anton said. “Ko gramme ko pujo.” He pointed over to Oxo-of-the-jaw-implant and snapped his fingers together for support.\n“Fucking big,” Oxo supplied in a mumble.\n“Fucking big,” Anton said.\nThe cold flensed Sedgewick to the bones the instant they stepped outside. Overhead, the sky was a void blacker and vaster than any holo could match. The ice stretched endless in all directions, interrupted only by the faint running lights of methane harvesters stitched through the dark.\nBrume had a prehensile lantern from one of the work crews and he handed it to Anton to affix to the cowl of his coat. It flexed and arched over his head, blooming a sickly green light. Sedgewick felt Fletcher look at him, maybe an uneasy look because they’d never been outside the colony at night, maybe a cocky look because he was making a move, going to ruin something for Sedgewick all over again.\n“Okay,” Anton said, exhaling a long plume of steam with relish. His voice sounded hollow in the flat air. “Benga, benga, okay. Let’s go.”\n“Right,” Sedgewick said, trying to smile with some kind of charm. “Benga.”\nBrume gave his angry barking laugh and slapped him on the shoulder, then they set off over the ice. The pebbly gecko soles of Sedgewick’s gumboots kept him balanced and the heating coils in his clothes had already whispered to life, but every time he breathed the air seared his throat raw. Fletcher was a half-step behind the lot of them. Sedgewick resisted the urge to gledge back, knowing he’d see an unconcerned what are you staring for sneer.\nThinking back on it, he should’ve drugged Fletcher’s milk glass with their parents’ Dozr. Even his modded metabolism couldn’t have shaken off three tablets in time for him to play tag-along. Thinking even further back on it, he shouldn’t have had the conversation with Anton and Petro about the frostwhales where Fletcher could hear them.\nUnder his feet, the texture of the ice started to change, turning from smooth glossy black to scarred and rippled, broken and refrozen. He nearly caught his boot on a malformed spar of it.\n“Okay, stop,” Anton announced, holding up both hands.\nAbout a meter on, Sedgewick saw a squat iron pylon sunk into the ice. As he watched, the tip of it switched on, acid yellow. While Petro unloaded his vape and the other units circled up for a puff, Anton slung one arm around Sedgewick and the other around Fletcher.\n“Benga, aki den glaso extrobengan minke,” he said.\nThe string of sounds was nothing like the lessons Sedgewick had stuck on his tab.\nAnton shot a look over to Oxo-of-the-jaw-implant, but he was hunched over the vape, lips tinged purple. “Here,” Anton reiterated, gesturing past the pylon. “Here. Frostwhales up.”\nHe said it with a smile Sedgewick finally recognized as tight with amphetamine. He’d assumed they weren’t sucking down anything stronger than a party hash, but now that seemed like an idiot thing to assume. This was New fucking Greenland, so for all he knew these lads were already utterly panned.\nOnly one way to find out. Sedgewick gestured for the vape. “Hit me off that.”\nPetro gave him a slow clap, either sarcastic or celebratory, while he held the stinging fog in his lungs for as long as he could, maybe because Fletcher was watching. There was only a bit of headspin, but it was enough to miss half of what Oxo-of-the-jaw-implant was saying to him.\n“…is the area.” Oxo plucked the vape out of his slack hands and passed it on. “See. See there, see there, see there.” He pointed, and Sedgewick could pick out other pylons in the distance glowing to life. “Fucking danger, okay? Inside the area, frostwhales break ice for breathing. For break ice for breathing, frostwhales hit ice seven times. Den minuso, seven.”\n“Minimum seven,” the other Oxo chimed in. Anton started counting aloud on his gloved fingers.\n“Got it,” Fletcher muttered.\n“So, so, so,” Oxo-of-the-jaw-implant went on. “When the frostwhales hit one, we go.”\n“Thought you’d stay for the whole thing?” Sedgewick said, only halfway listening. The cold was killing off his toes one by one.\nAnton gave up at twenty and sprang back to the conversation. “We go, extros,” he beamed. “You run. You run. I run. He runs. He runs. He runs. He runs. Here…” He gave the pylon a dull clanging kick. “To here!”\nSedgewick followed Anton’s pointing finger. Far off across the scarred ice, he could barely make out the yellow glow of the pylon opposite them. His stomach dropped. Sedgewick looked at his brother, and for a nanosecond Fletcher looked like a little kid again, but then his mouth curled into a smile and his modded eyes flashed.\n“Alright,” he said. “I’m down.”\nSedgewick was a breath away from saying no you fucking aren’t, from saying we’re heading back now, from saying anything at all. But it all stuck on his ribs and instead he turned to Anton and shrugged.\n“Benga,” he said. “Let’s go.”\nThe handshakes came back around, everyone hooting and pleased to have new recruits. Fletcher got the motion on his first try. When the vape made its final circle, Sedgewick gripped it hard and stared out over the black ice and tried to stop shivering.\nSedgewick knew Fletcher was faster than him. He’d known it like a stone in his belly since he was twelve and his brother was ten, and they’d raced on a pale gray beach back on Earth. Prickling fog and no witnesses. Fletcher took lead in the last third, pumping past him with a high clear incredulous laugh, and Sedgewick slacked off to a jog to let him win, because it was a nice thing, to let the younger brother win sometimes.\nOccupied with the memory, Sedgewick was slow to notice that the eerie green pallor of the ice was no longer cast by Anton’s lantern. Something had lit it up from underneath. He stared down at the space between his boots and his gut gave a giddy helium lurch. Far below them, distorted by the ice, he could make out dim moving shapes. He remembered that frostwhales navigated by bioluminescence. He remembered the methane sea was deeper than any Earth ocean.\nEveryone tightened the straps of their thermals, tucked in their gloves, and formed themselves into a ragged line that Sedgewick found himself near the end of, Fletcher beside him.\nAnton waltzed down the row and made a show of checking everyone’s boots. “Grip,” he said, making a claw.\nSedgewick threw a hand onto Brume’s shoulder for balance while he displayed one sole and then the other. He leaned instinctively to do Fletcher the same favor, but his brother ignored it and lifted each leg precisely into the air, perfectly balanced. Sedgewick hated him as much as he ever had. He glued his eyes to the far pylon and imagined it was the first cleat of the dock on a rainy gray beach.\nUnder their feet, the ghostly green light receded, dropping them back into darkness. Sedgewick shot Oxo-of-the-jaw-implant a questioning look.\n“First they see ice,” Oxo mumbled, rubbing his hands together. “They see ice for thin area. Then, down. For making momentum. Then, in one by one line…”\n“Up,” Sedgewick guessed.\nOn cue, the light reappeared, rising impossibly fast. Sedgewick took a breath and coiled to sprint. His imagination flashed him a picture: the frostwhale rocketing upward, a blood-and-bone engine driven by a furious thrashing tail, hurtling through the cold water in a cocoon of bubbling gas. Then the impact quaked the ice and Sedgewick’s teeth, and he thought about nothing but running.\nFor two hard heartbeats, Sedgewick fronted the pack, flying across the ice like something unslung. The second impact nearly took his legs out from under him. He staggered, skidded, regained his balance, but in that split second Petro was past him. And Anton, and Oxo, and Oxo, Brume, Fletcher last.\nSedgewick dug deep for every shred of speed. The ice was nowhere near smooth, scarred with pocks and ridges and frozen ripples in the methane, but the others slid over it like human quicksilver, finding the perfect place for every footfall. Modded, modded, modded. The word danced in Sedgewick’s head as he gulped cold glass.\nThe green light swelled again, and he braced before the third frostwhale hit. The jolt shook him but he kept his footing, maybe even gained half a step on Oxo. Ahead, the race was thrown into relief: Brume’s broad shoulders, Anton’s thrown-back head, and there, sliding past gangly Petro for the lead, was Fletcher. Sedgewick felt hot despair churn up his throat.\nHis eyes raised to the pylon and he realized they were over halfway across. Fletcher pulled away now, not laughing, with that crisp bounding stride that said I can run forever. Then he glanced back over his shoulder, for what, Sedgewick didn’t know, and in that instant his boot caught a trench and slammed him hard to the ice.\nSedgewick watched the others vault past, Anton pausing to half-drag Fletcher back upright on the way by. “Benga, benga, extro!”\nThe fourth frostwhale hit, this time with a bone-deep groaning crack. Everyone else had overtaken Fletcher; Sedgewick would in a few more strides. Fletcher was just now hobbling upright and Sedgewick knew instantly he’d done his ankle in. His modded eyes were wide.\n“Sedge.”\nAll the things Sedgewick had wished so savagely in the night—that the doctor had never pulled Fletcher out of his vat, that Fletcher’s pod would fail in transit to New Greenland—all of those things shattered at once. He swung Fletcher up onto his back, how they’d done as kids, and stumped on with lungs ragged.\nThe fifth impact. Sedgewick’s teeth slammed together and fissures skittered through the ice. He spared only a moment to balance himself, then stumbled forward again, Fletcher clinging fierce to his back. At the far pylon, the others hurtled to the finish, whooping and howling from a dozen meters away now, no more.\nThey all seemed to turn at once as the sixth impact split the world apart and the frostwhale breached. Sedgewick felt himself thrown airborne in a blizzard of shattered ice, felt himself screaming in his chest but unable to hear it, deafened by the shearing boom and crack. Some part of Fletcher smacked against him in midair.\nLanding slammed the wind out of him. His vision pinwheeled from the unending black sky to the maelstrom of moving ice. And then, too big to be real, rising up out of the cold methane sea in a geyser of rime and steam, the frostwhale. Its bony head was gunmetal gray, the size of a bus, bigger, swatched with pale green lanterns of pustule that glowed like radiation.\nCracks webbed through the ice and something gave way; Sedgewick felt himself slanting, slipping. He tore his gaze from the towering bulk of the frostwhale and saw Fletcher spread-eagled beside him, a black shadow in the burning lime. His lips were moving but Sedgewick couldn’t read them, and then gloved hands gripped the both of them, hauling them flat along the breaking ice.\nOxo and Oxo made sure they were all pulled past the pylon before anyone got up off their belly. Sedgewick, for his part, didn’t even try. He was waiting on his heart to start beating again.\n“Sometime six,” Anton said sheepishly, crouching over him.\n“Go to hell,” Fletcher croaked from nearby, and in a moment of weakness Sedgewick choked up a wavery laugh.\nThey washed home on a wave of adrenaline, caught up in the rapid-fire conversation of the New Greenlanders who still seemed to be rehashing how close Sedgewick and Fletcher had come to getting dumped under. Every single one of them needed a send-off handshake at the living quarters, then they slunk off in one chattering mass.\nSedgewick couldn’t keep the chemical grin off his face, and as he and Fletcher snuck through the vestibule and then ghosted back to their temporary shared room, they talked in a tumble of whispers about the frostwhale, about the size of it, and about the ones that had surfaced afterward to suck cold air into massive vein-webbed bladders.\nSedgewick didn’t want to stop talking, but even when they did, climbing into their beds, the quiet felt different. Softer.\nIt wasn’t until he was staring up at the biocrete ceiling that he realized Fletcher’s limp had swapped sides on the way back. He swung upright, unbelieving.\n“You faked it.”\n“What?” Fletcher was rolled away, tracing the wall with his long fingers.\n“You faked it,” Sedgewick repeated. “Your ankle.”\nFletcher took his hand off the wall, and the long quiet was enough confirmation.\nSedgewick’s cheeks burned. He’d thought he had finally done something big enough, big enough to keep him on the greater side of whatever fucked-up equation they were balancing. But it was Fletcher feeling sorry for him. No, worse. Fletcher making a move. Fletcher manipulating him for whatever kind of schemes floated through his modded head.\n“We could have both died,” Sedgewick said.\nStill turned away, Fletcher gave his perfect shrug, and Sedgewick felt all the old fury fluming up through his skin.\n“You think that was a hologame?” he snarled. “That was real. You could have deaded us both. You think you can just do anything, right? You think you can just do anything, and it’ll fucking work out perfect for you, because you’re modded.”\nFletcher’s shoulders stiffened. “Good job,” he said, toneless.\n“What?” Sedgewick demanded. “Good job what?”\n“Good job on saying it,” Fletcher told the wall. “You’re ashamed to have a modded brother. You wanted one like you.”\nSedgewick faltered, then made himself laugh. “Yeah, maybe I did.” His throat ached. “You know what it’s like seeing you? Seeing you always be better than me?”\n“Not my fault.”\n“I was six when they told me you were going to be better,” Sedgewick said, too far gone to stop now, saying the things he’d only ever said alone to the dark. “They said different, but they meant better. Mom couldn’t do another one freestyle and to go off-planet you’re supposed to have them modded anyway. So they grew you in a tube. Like hamburger. You’re not even real.” His breath came lacerated. “Why wasn’t I enough for them, huh? Why wasn’t I fucking enough?”\n“Fuck you,” Fletcher said, with his voice like gravel, and Sedgewick had never heard him say it or mean it until now.\nHe flopped back onto his bed, grasping for the slip-sliding anger as it trickled away in the dark. Shame came instead and sat at the bottom of him like cement. Minutes ticked by in silence. Sedgewick thought Fletcher was probably drifting to sleep already, probably not caring at all.\nThen there was a bit-off sob, a sound smothered by an arm or a pillow, something Sedgewick hadn’t heard from his brother in years. The noise wedged in his ribcage. He tried to unhear it, tried to excuse it. Maybe Fletcher had peeled off his thermal and found frostbite. Maybe Fletcher was making a move, always another move, putting a lure into the dark between them and sharpening his tongue for the retort.\nMaybe all Sedgewick needed to do was go and put his hand on some part of his brother, and everything would be okay. His heart hammered up his throat. Maybe. Sedgewick pushed his face into the cold fabric of his pillow and decided to wait for a second sob, but none came. The silence thickened into hard black ice.\nSedgewick clamped his eyes shut and it stung badly, badly.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}