{"fingerprint": "xRxWYAubjEnEoighX47jhjYYVI0=", "sitename": "Clarkesworld Magazine", "title": "37 Rejections, Language Obsessions, and Dance: A Conversation with Rich Larson by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_interview_2018/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: 37 Rejections, Language Obsessions, and Dance: A Conversation with Rich Larson by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n 37 Rejections, Language Obsessions, and Dance: A Conversation with Rich Larson\n Quality and quantity are typically mutually exclusive. Bulk bought food is typically packed with partially hydrogenated filler while a uniquely tasty plate of haute cuisine is one of a kind. But sometimes, rarely, quality and quantity go hand in hand.\n Rich Larson’s Tomorrow Factory is his first collection of short fiction. It assembles the wide variety of stories that Larson has published over the past few years. From post-humans to cyberpunk junkyards and an asteroid prison break, this collection highlights Larson’s vast imagination and storytelling ability.\n Rich Larson was born in Galmi, Niger, has studied in Rhode Island, and worked in the south of Spain. He now lives in Ottawa, Canada. Larson has sold over a hundred stories, the majority of them in magazines like Analog, Asimov’s, Clarkesworld, F&SF, Lightspeed, and Tor.com. Tomorrow Factory was released by Talos in October.\n When did you get into writing?\n I’ve been into stories since before I could write—when I was five or so in Niger I told them aloud to my older sisters, who painstakingly transcribed a couple of them. I remember they involved pyramids, hot-air balloons, Spider-Man, savage forest babies, and lots of sword fights.\n I got into writing short stories in Canada, motivated by an annual short story competition held by the local library. The word limit was two thousand words and the prize was cash, so for half my life my conception of a short story was something written once per year, exactly two thousand words in length, that was then exchanged for money.\n I got into writing as a trade when I was nineteen, studying Creative Writing for one ill-fated year in Rhode Island. That was when I first started getting poems and stories published—literary stuff back then, no sci-fi—and I realized people were willing to pay me for them. The following summer my cyberpunk thriller Devolution was a finalist for the Amazon Breakthrough Novel Award.\n That, plus my general disenchantment with Creative Writing, steered me back towards genre fiction over the next couple years. I wrote a lot of stories and slowly knocked magazines off my list. Clarkesworld took “Meshed” in 2015 after rejecting thirty-seven prior submissions, and I’ve been on a bit of a roll ever since.\n You have a distinct way of creating imagery. Do you start with images for your stories first and work around them?\n I’m a visual person and the image comes first. I’ll use it as either the start point or end point for the story.\n How has your travel influenced your writing? You’ve been to places like Italy, Spain, and Portugal.\n I’ve been lucky enough to live in a few different places and pass through a bunch of others. Wherever I go, I like to jot down descriptions of what’s around me, and I’ll often use particularly memorable cities as settings. For example, while living in Spain I wrote several stories (“There Used to Be Olive Trees,” “Seawall,” and “Cupido”) set in various parts of Andalusia. People I get to know while traveling, whether for a week or only for a night, often inspire my characters.\n You’ve published over a hundred stories. How do you stay so prolific?\n I use this great all-natural berry extract that I sell for only forty bucks a bottle.\n But really, there are a few factors. I tend to write quick and clean, which means minimal time spent editing or revising before sending stories off to markets, and I’m also just constantly deluged with ideas that I want to take for a spin. I’ve likened it to being on a treadmill with the speed cranked up and trying not to fly off. Even when I’m writing as fast as I can, often the process of writing one story will give me ideas for two more.\n I’ll definitely die with a long list of things I never got to write, which sucks, but on the plus side my overactive idea gland gives me enough material to eke out a nonglamorous living as a short fiction writer even without my book deal or selling any options. In that sense I’m very fortunate.\n Character and voice are hallmarks of your stories. Do you find yourself inventing them completely or forming them from a pastiche of people you observe in reality?\n I have a few standard voices that I slip into easily, because they are variations on how I think in my own head, but often characters in my stories are based loosely on people I know in real life or on conglomerations of them. The secondary character in “Motherfucking Retroparty Freestyle” is one of my oldest friends from high school, no changes necessary, but even if I told him that I doubt he’d read it. He’s a bit of a bastard.\n How do you feel your process is different when working on short stories as opposed to longer works?\n I’m generally a lot happier working on short stories. They’re low commitment and low pressure. If you write a bad short story, you wasted a couple hours or a couple days. If you write a bad novel, you wasted half a year. I find my work limit is usually around the same for both forms, though. After a thousands words I sputter out unless there’s a madman like Derek Künsken around to keep me motivated.\n What was your favorite story to write in Tomorrow Factory? Why?\n One that stands out in memory as just a blast to actually write was “Let’s Take This Viral,” because it let me indulge my bad habit of inventing an avalanche of futuristic slang and plunging the reader into it headlong. Any story where I get to really play with language is fun to write.\n I can’t choose favorite finished products, though. It was hard enough to narrow things down to the twenty-three stories in the collection. They’re all in there because I love them.\n I’ve read that dreams sometimes inspire your stories. Are there any stories in this collection that were inspired by dreams?\n I do get inspired by dreams pretty often—I love how the subconscious can come up with weird new scenes or images for you with no extra effort required. “Your Own Way Back” was inspired by a dream about a family waiting in a green-painted hospital room, holding red balloons, standing around a machine that brought people back from the dead: sometimes for better, sometimes for worse.\n “Edited” was based off a very vivid dream I had in Spain, about three teenagers breaking into some sort of organic coral summerhouse in order to party. There was a nervous energy to the proceedings, because one of the three had changed somehow and the other two weren’t sure how to treat them. In the dream it wasn’t clear whether they were recovering from an accident, had been altered somehow against their will, or had done something surprising to themselves.\n That’s why the dream also spawned two other stories, “Spiked,” which appeared in Abyss & Apex and was shortlisted for the 2018 Sunburst Award, and “Masked,” which appeared in Asimov’s. I think dreams can be an incredibly rich resource.\n Being obsessed with languages, how do you think that has influenced your short fiction?\n As I mentioned previously, I love playing with language. One of my favorite things about science fiction is the freedom to invent new terms for new technologies or practices, as well as updating our constantly-evolving slang to suit a particular future.\n I also make use of other languages I speak or study: in “Razzibot,” for example, the dialogue is peppered with Spanish and Portuguese since the protagonist lives in Porto and has a sevillana mother. “You Make Pattaya” throws in the tiny bits of Thai I picked up there, and “Ghost Girl” uses a couple words of Kirundi.\n Apart from the stories in Tomorrow Factory, I have a story coming out in Asimov’s next year that uses some good old Québécois profanity—I meet a lot of French Canadians here in Ottawa—and there’s one being published by Tor.com that makes extensive use of Hausa, the main language where I was born in West Africa. I got a crash course in it this past January when I returned to Niger for the first time in fifteen years with my dad, and I loved being able to incorporate it into the story.\n You read widely. I saw that you were reading a side-by-side translation of Pablo Neruda’s poetry. Do you think this curiosity has kept your stories fresh and varied?\n It’s more honest to say that I read sporadically, and that when I do read I pick things up at random. I bought that Italian-Spanish translation in a used bookstore in Florence and used it to absorb some Italian grammar while I was there, so it was kind of mercenary. For actual entertainment I’m more likely to watch shows than I am to read. In the past few years I’ve really enjoyed Atlanta, Better Call Saul, and Bojack Horseman.\n What projects are you working on next?\n The sequel to Annex is currently with the publisher, so while I wait for editorial notes on that I’m taking full advantage of my free writing time. I’ve been tearing through my backlog of ideas and have written thirteen new stories since the start of October. Only a handful of them are over two thousand words—I’m back to my old library contest tricks—but that pace is still torrid.\n It’s partly because I’ve had so many ideas building up and partly because I feel like my novel publisher will get the crook around my neck and yank me off-stage any second now. I’ll have to revise the sequel and then when 2019 rolls around I’ll be working on the third and final novel in the trilogy. I’ll churn out some new short stories when I get the chance as well.\n Some unfinished stories I have bouncing around in my head right now: an art heist in futuristic Catalonia, Alien in an isolated monastery during the Middle Ages, and Tomb Raider in space.\n What is one piece of writing advice that has really helped you?\n Realizing that small changes can have big effects. I used to panic when editors said things like “this scene needs more tension” because I didn’t realize that often meant an addition as simple as one sentence that mentions the character sweating, or their heart pounding, or some other body function cliché. Even changes that seem big often only require a few sentences to enact.\n It’s a little trickier with novels, because those small changes then ripple throughout the whole manuscript and you have to go through with a fine-toothed comb to make sure everything lines up properly.\n Can you do any trick shots in pool?\n I can jump a ball okay, and I’m good for a massé once every hundred tries or so. Lately I’ve been a lot more into dancing than pool.\n Are you willing to teach anyone to dance kizomba?\n I’m willing to teach absolutely anyone to dance a little kizomba—it’s an Angolan partner dance that I’ve been fully obsessed with for over a year now. I liken it to tango, in that it’s a walking dance, but in the urban style it becomes very dynamic, with sharp and precise movements juxtaposed with ones so slow you’re barely moving. It’s all lead and follow, nothing patterned or choreographed.\n Am I allowed to enclose a link? These are two of my favorite dancers absolutely killing it: https://www.youtube.com/watch?v=bgaNxuMhfF8.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}