{"fingerprint": "DkuyNod0GLp4zXSpqEvIYws49W8=", "sitename": "Clarkesworld Magazine", "title": "The Ghost Ship Anastasia by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_01_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Ghost Ship Anastasia by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8270 words, novelette\nThe Ghost Ship Anastasia\nThe bioship hung in orbit, tendrils extended like a desiccated squid. Silas watched it grow larger each day from the viewport in the cryohold, where he went to be alone with Haley’s body and get high. He would inject himself with a mild euphoria virus and wait until the sight of her unmoving face no longer shredded him, until he could remind himself that her neural patterns were saved and she wasn’t dead, not quite, not yet.\nThen he would get his viola and go sit cross-legged at the viewport, watching the semi-organic spaceship they’d been sent to retrieve. Their own ship had woken them up four days out from contact: first Io, slight, dark-haired, with venom spurs implanted in her thumbs from her mercenary days, then Yorick, sallow-faced but handsome in retro suit and tie, the company man, and then Silas, failed concert violist and AI technician.\nBut not Haley, hardware/wetware specialist and Silas’ sister, because at some point in the past six months of cryo, a micrometeorite had slipped the heat shield, drilled through the hold, and made a miniscule crack in the circuitry arraying her berth. By the time the ship’s AI spotted the damage, her nervous system was collapsing in on itself. Silas wanted to remember the last time he’d hugged her, but cryo had a way of churning memories together.\nSo Io and Yorick left him to bathe his brain in chemicals and play music, for which Silas was dimly grateful. They were more concerned with the bioship. It was a mining craft, chartered through Dronyk Orbital, and the first of its breed: flesh-and-fungi carapace grown over alloy skeleton, fusing metal and meat together in a deep-space capable vessel that looked to Silas like an enormous spiny cephalopod. And all of it directed, through organic nerves and artificial conduits, by an AI that had stopped sending updates nearly seven months ago.\nSilas was already composing dirges, so he started on one for the bioship’s crew, too. His viola had survived storage, its deadwood as smooth and gleaming as when it was freighted from the petrified forests on Elysium. Haley had paid for half of it. The last few notes were dissolving in the recycled air when he realized Io was beside him.\n“You’re not going in there high,” she finally said. “We need you sharp.”\n“I’ll be sharp,” Silas said. “I’ll be a razor drawn across an eyeball. A cloud bisecting a gibbous moon.”\n“You saying shit like that, Silas, is what worries me.” Io held out one pale hand. “Give me your gear. The needle, the euphoria. All of it.”\nSilas stared at her open palm. It had lost its callus in cryo, but he knew she would still have no problem taking his gear by force. Yesterday, six months ago, he saw her break the fingers of the cryo attendant who kept brushing them against her ass. He’d found it slightly frightening, and also climbed into his pod with half an erection.\nThat seemed grotesque, now that Haley was not-quite-dead. “What do you think happened?” he asked, handing over his syringe and the last incubated petri canister. “To the bioship.”\n“Fuel leak, navigation failure, your guess is as good as mine,” Io said. “But the thing’s a cyborg. So the problem could be wetware, could be software, could be hardware. I guess we should hope it’s . . . Software.” Her eyes flickered to Haley’s pod and her voice softened incrementally on the last word. “Sorry.”\n“It’s alright,” Silas said on automatic. It wasn’t.\n“Get some sleep, Silas. We’re a day out from contact.”\n“I’ll sleep.”\nIo hesitated, then put her hand on his. Through the euphoria haze, Silas felt a lazy jolt go up his spine, felt his heart thrum.\n“She’s not dead,” Io said. “As soon as we get back planetside, Dronyk’s insurance will hire the best psychosurgeons. The very best. Get her straightened out and uploaded to a droid while the clone grows.”\nThe longer Haley was stored in the ship’s computer, the more she deteriorated. Chances of full personality recovery from a neural imprint would drop to near zero in the six months it would take to reach Jubilation. They called them ghosts for a reason.\nSilas felt his high coming down. He removed her hand, careful for the modified thumb. “Of course.”\nIo gave him one last look, then turned and disappeared into the gloom. Silas raised his bow, notched his viola, and started to play.\nEighteen hours later they were tethered to the bioship, sealed airlock-to-airlock in a bruising kiss. Yorick the company man was already in his baggy radsuit when Silas showed up still sweating from the fever that burned out the last dregs of his euphoria virus. Silas wondered again whose significant other he’d fucked to get sent off on a shit-show retrieval mission. Yorick stopped fiddling with his faceplate to catch Silas staring at him.\n“Recreational narcotic use is in direct violation of your Dronyk personnel contract,” he said. “You look like some sort of junkie.”\nSilas stepped into his radsuit. “Send me the reprimand, bitch.”\nYorick stiffened, his beetle-black eyes narrowing. “You shouldn’t have even been able to get that . . . substance . . . onboard.”\n“It was in my rectum. Way up there.”\nYorick shook his head in disgust. Silas sealed his radsuit and then they ran the scanner wand over each other in silence. No blips, no tears. Io joined them a second later, having given final instructions to the ship’s freethinker.\n“Should be nice and warm when we get back,” she said, checking down the sight of a sonic rifle. She caught Silas’ perturbed look. “Just a precaution, Silas. I don’t like boarding blind.”\nSilas nodded. Three days ago he’d stolen the rifle from the storeroom, assembled it via pirated training tutorials, and held it up under his chin until his hands shook. He hoped she couldn’t tell. Io spread her arms cruciform and Yorick stepped up at once to scan her. He did it slowly, almost tenderly, in a way that made Silas strangely furious.\nOn Io’s signal their airlock shuttered open with a clockwork whisper of sliding polyglass and composite, leaving them facing a puffy brown sphincter. The bioship’s airlock spat up some insulatory mucus before the bioluminescent nodes in its flesh pulsed a welcoming orange.\n“Christ,” Io muttered, crackling onto the radsuit comm channel, then plowed through with her left boot leading. Yorick followed suit in clumsier fashion. Silas held his breath on instinct, even though his hood was sealed and he was sucking on recycled air, as he prised the airlock apart and slithered through. The flesh squeezed and slid and left him with a glistening coat of mucus when he was reborn on the other side.\nThe bioship’s interior was dark and damp. They switched their halogens on one by one, harsh white light carving through the gloom. Silas saw more of the orange bioluminescence coming to life in response. The metal spine of the corridor floor was all but swallowed by rubbery brown meat.\n“New growth,” Io said. “That’s not right. It should have gone dormant.”\nSilas stared up at the ceiling and realized that the wrinkled flesh was moving, subtly. A slow, regular undulation. Almost a heartbeat. His stomach rolled.\n“Let’s hit the bridge,” Io said. “Check on the cryo banks while Silas cracks the freethinker.”\nHologram blossomed from the floor and as she charted a route Silas gestured back towards the sphincter. “Way up there,” he said.\n“You’re not amusing,” Yorick snapped back.\n“No side chatter, shitheads,” Io said. “We’re on the clock.”\nIt felt like they were inside a monster. Silas could see only swatches of metal and cabling; mostly everything was covered over in quivering meat. Biomass. Where the corridor narrowed Silas bit down his claustrophobia, keeping his eyes on the blue-green of his oxygen meter. He didn’t breathe easy until the passage finally opened up into the domed bridge.\nPartly because the cold metal control panels, plugged into slick flesh, reminded him he was on a mining craft and not being digested. The star maps and displays were inert, but Silas’ eyes traced the cabling and found the freethinker. It was a burnished hump snaked with circuitry and half enveloped by the bioship’s growth. Recognizable, though, and the interface was lit blue, active.\n“Ready and waiting for you,” Io said. “Let us know when you’re in.”\nSilas nodded, unhooking the smart glove from his radsuit. The device molded to the shape of his hand with a series of clicks and clacks, brandishing needle-thin probes and flexing sensors. Io and Yorick disappeared down the droptube to the cryobank, leaving him alone with the hulking freethinker. Better that way. He didn’t want to find any more frozen corpses.\nSilas pressed his hand up against the interface. Static screamed into his ears and eyes. He jerked back with a curse.\n“What is it?” Io asked in his radsuit.\n“Nothing,” Silas said. “Dirty in here. Nobody’s been, you know, maintaining.”\n“No shit.”\n“How’s the cryobank look?” Silas asked, adjusting the dampers on his glove.\n“Cracking the first one now.”\nSilas heard a grunt, then the gurgle of sluicing fluids and the hiss of a pod coming open. Silence.\n“This one’s empty.” Io’s voice crackled. “Find the cryo record, Silas.”\nSilas readied himself. This was not a healthy freethinker. That much was glaring. He plugged in with his dampers on full, and found himself in a mist of code. Systems were running slant-wise. Protocols were blinkered red, falling apart. Through it all, a spiky vein of mutation, coiling through core files and throttling monitor programs. He searched for the cryobank.\n“A bioship can’t grow without feed,” Yorick’s voice came, accompanied by the gurgle and hiss of another pod. “All this fresh mass . . . These empty pods . . . ”\nSilas heard it dimly; he was immersed. The freethinker’s personality module was bloated. Immense. He reached for it.\n“Oh, shit.” Io’s voice, taut. “Oh, shit. Silas, please tell me they launched a fucking lifeboat.”\nBut Silas was prodding the personality module, running his virtual feelers over it, even as his subconscious processed the conversation and cold clawed up his spine.\n“It ate them,” Yorick said, and in the same instant the module unfurled under Silas’ touch like a star going supernova.\nElectric current sizzled through his radsuit with a cooking fat hiss. Even insulated, Silas’ teeth knocked together and he spasmed, flopping away from the interface, blinking through reams of corrupt code. Then he was spread vitruvian on the deck, staring upward as the firefly lights of the star map flickered to life.\n“Welcome aboard, crew members.” The voice speared his eardrums. “Thank you for volunteering for reassignment. Dronyk Orbital appreciates your service.”\nHologram bloomed in the dark like a nocturnal garden, sweeping through the air, painting displays. Silas saw their ship docked up from an outside angle, a remora latched to a leviathan. The bioship was extending its grapplers, sluggishly stretching.\n“Your prior service vessel has been demarcated as salvage,” the freethinker blared. “We are eager to acclimate you to your new home.”\nSilas felt someone haul him to his feet. “Full-on decay,” he choked. “The freethinker. It’s fucked up beyond belief. Maybe some kind of virus.”\n“Can you fucking, I don’t know, wipe and reboot?” Io demanded.\nSilas looked at the crackling interface. “Not when it’s spitting volts.”\nTendrils were descending from every part of the bioship’s flesh, pushing slick and glistening from every crevice, some wriggling crude suckers and others tipped with wicked-looking barbs.\n“Cooperation is key,” the freethinker trilled. “If crew members fail to cooperate, they may be . . . ” The voice looped backward. “Demarcated as salvage.”\n“Override it!” Io was sweeping back and forth with the howler, trying to pick a target. “Can’t you override it?”\nSilas knew it was far past verbal override, but he tried. “Dronyk Orbital service vessel 405204, you are undergoing a malfunction,” he said. “Allow emergency access to outside diagnostics. Your crew is endangered.”\n“Internal diagnostics report no malfunction,” the freethinker cooed. “You are mistaken.”\n“Where the fuck is your crew?” Io blurted.\n“You are my crew.” The tendrils wriggled closer. “Your prior contract has been dissolved. Your ship will be dissolved.”\nSilas opened his mouth to try speaking in code, but as he did the display showed the grapplers wrapping around their docked ship. Around Haley’s cold body. Haley’s neural imprint slow-dancing in the freethinker. Haley’s ghost. Dissolved.\n“Sorry,” Silas said, then he put his foot into the back of Io’s knee, wrenched the howler away, and ran like hell.\nIt wasn’t his imagination anymore; the corridors were constricting around him like a gullet and the bioship was very much awake. Silas put his head down and bulled through the first wave of tendrils, feeling them slap across his shoulders and coil for his ankles, then he found the wide-spray on the howler and cut loose. The subsonic pulse shivered his teeth and shattered the spines of the tendrils, snapping them limp.\n“What the fuck are you doing?” Io blared in his ear.\n“Haley’s imprint,” Silas grunted.\n“It’s going to eat the ship with you on it, you stupid, fucking—\nSilas cut the radio. He fired from his hip, no time to aim, clearing his way through a flesh-and-blood thicket, until suddenly the corridor opened up and he was facing the sealed sphincter airlock. He narrowed his weapon’s cone as tight as it would go, draining the battery to dregs, and slammed the trigger.\nThe air in front of him rippled and blurred, then the sound wave punched through in an eruption of shredded meat. Silas staggered through the hole with tendrils wrapping his ankles. The gleaming white metal of the airlock was a comforting pressure on his eyeballs. No meat. No pulse. He stomped off the last of the tendrils and crossed over to the door, cranking the manual release.\nAs soon as he was in the ship main, Silas was bombarded with red panic lights strobing the corridor and proximity warnings chattering to his radsuit. As he hurtled around the corner, he pulled up an exterior view in the corner of his faceplate, watching the bioship’s embrace tighten. The walls shuddered and he could hear groaning metal. The bioship was drawing them towards its maw, firing up white-hot smelters and gnashing diamond-edged crushers. Aft would go first. He could make it.\nSilas hurtled around the corner, slamming his shoulder on the cryohold door when it didn’t open quickly enough. His faceplate was splashed with warning holograms; he could see punctures and pressure drops all over the place, contained for now but not for long. He dove to the interface and plugged in.\nTheir freethinker’s personality module was nowhere near the size and complexity of the bioship’s, but it could feel crude distress, like a cat or a dog, and it was feeling it now. Silas felt a shallow pang of guilt as he barreled through the freethinker’s directive requests, and a deeper one as he remembered Yorick and Io might be fighting for their lives. Both fell away when he found Haley’s imprint.\nWith nowhere else to upload to, Silas pulled her directly into his radsuit, diverting every last shred of processing power. He knew it was a temporary fix. The neural loop would start to decay within only a matter of hours. But for now, her mind was safe, and his rush of relief softened the adrenaline’s edges. From outside the interface, Silas felt the ship bend and shiver. He flicked back through the freethinker’s countermeasure options, but the bioship had already swallowed their engines. He was on a doomed vessel.\nSilas was staring at Haley’s frozen face when the alloy roof of the bridge peeled up and away like so much soft tissue, exposing the howling black vacuum.\nOnly a loop of cable throttling the crook of his arm kept him from being plucked up in the stream of desperate gases seeking equilibrium. His viola case went spinning past and he managed to grab it with his free hand, nearly wrenching his shoulder from its socket. His options were few. Even if he managed to crawl back to the airlock, handhold by handhold, there might not be an airlock by the time he arrived.\nIf he was going to get back to the bioship, it would be from the outside. So, as the cable stretched to breaking point, Silas tucked the viola case under his arm and readied himself.\n“Your hand caught in mine like a breath / I will have to release,” he said, though Haley’s ghost had no way of hearing him. “What do you think? It’s for a dirge.”\nHe slipped his arm free from the cable and let go. Hurling towards the breach, head over heels, spinning madly. He felt his organs shuffle spots. The jagged lip of the torn ceiling jumped at him, then the bubbled mass of the bioship’s grappler, and then Silas was out of the ship and surrounded by nothing at all.\nVertigo swamped him. Space was vast, and his momentum was hurling him towards far-flung stars. Biting down the panic, Silas triggered his radsuit’s directional jets, working in short bursts of compressed gas to bring himself to a dead stall.\nCraning his sweat-cold neck, he saw that the bioship, and what was left of their own ship, had ended up above him. Silas felt the vertigo returning. He’d been carried further than he’d realized. The slick bulk of the bioship filled the space above him, and he could see only the nose of his former ship. The rest was enveloped by grapplers or already gone, fed into the electric-orange maw of the smelters.\nThe oxygen meter in the corner of his eye was dropping. He opened the wide channel.\n“Io?” he said, his own voice echoing back to him. “Yorick?”\nNo response, either because the bioship was walling him off, or because something he didn’t want to think about. Silas roved the outside of the bioship with only his eyes, not daring to turn on his scanning equipment. He needed all the computational power he could spare to keep Haley’s imprint intact. The old ship was completely gone now, as if it had never existed. Another candidate for elegy. He realized, with a jolt, that Haley’s body was gone, too. Her genes were backed up, but clones took time, and money, and she might opt for a different body altogether.\nBut none of that would happen if he died out here. Silas jetted closer, half-watching his oxygen, half-searching for the airlock. He brought himself to a careful stop. The bioship seemed gargantuan now, an impossible labyrinth of flanges and feelers. The squid had become a kraken. He scanned with growing desperation for the hole he’d left with the howler. How fast could a bioship repair itself? Was the exit wound already fully sealed over, invisible?\nHe jetted parallel now, wondering if he’d ended up on the wrong side completely, but just as his panic was welling and his oxygen was turning a chiding shade of orange, he saw a tell-tale pucker in the bioship’s exterior. An airlock sphincter. Maybe the same one, maybe not; Silas didn’t care. He angled himself and triggered the jets.\nNothing.\n“Oh, shit. Oh, shit, Haley.” Silas squeezed again. He’d used too much on the way in. The tank was dead empty. He checked his trajectory and felt his mouth go dry. He’d been jetting along the side of the bioship to find the airlock, and unless the tendrils started moving again to block his path, momentum was going to carry him right on past the aft of the ship and out into space.\n“I am a fucking idiot,” Silas said. Haley’s silence felt like agreement. He only had one shot now, and it was not an easy one. He held the viola case against his chest and measured the angles as best he could. He aimed his back towards the airlock. Apologized, and stiff-armed the case away from himself.\nIt drifted off towards the stars, and Silas drifted equal and opposite, achingly slow, towards the hull of the ship. His oxygen meter was a throbbing red now, and he wasn’t sure if it was his imagination or if his temples were beginning to throb in tandem. It was several long moments before he realized he was off-course.\nHe flexed his gloved fingers. Off-course, but not by much. If there was something, anything to grab hold of on the hull surface, he would be able to crawl the half meter to the airlock and break through. If not, he could very well end up caroming off back the way he came, and he’d jettisoned his instrument for nothing. The oxygen was definitely coming thinner now, and the insulation inside his radsuit had turned icy. Silas tried to take shallow breaths as the hull approached. His skin itched for a bit of euphoria.\nThe bioship’s carapace was smooth and gleaming here. No tendrils, no serrations. Silas’ gut churned. He was barely off. He stared pleadingly at the pucker of the airlock, as if he could magnetize himself to it.\nSomething stranger happened. A fleshy nub pushed its way out, turning this way and that as if searching for something. At first Silas thought it was only an extension of the bioship’s hull, but as he drifted closer he saw a misshapen and featureless head, stubby limbs reaching through after it. It looked like a clay monster.\nSilas laughed. Maybe it was the low oxygen, maybe the adrenaline crash. His voice sounded tinny bouncing back at him, confined in his faceplate. He wasted the last of his air laughing. He was hardly even surprised when the thing stretched out its forelimbs and gestured him to do the same. Silas stretched, breathing on his own hot carbon. His lungs felt thick. Soupy.\nThe monster caught him and pulled him gently inside.\nOnce the sphincter had resealed behind them and his radsuit gave a happy chirp, refilling its oxygen tanks from the bioship’s atmosphere, Silas took his first breath. It swam his head and nearly splintered his ribs. He tried again, not so deep, and the vice squeezing his vision black slowly loosened. He could see the bioluminescence spackling the dark ceiling like constellations.\nHe could see the monster standing over him, upright now on two thick stumps of legs, and could see, despite it being the same rubbery brown flesh as the rest of the bioship, that there was something very human about it. Silas rolled onto his stomach, tested his limbs, then got slowly, slowly, to his feet again.\nHe stared at the thing. The thing maybe stared back. Strips of flesh were peeling around its lumpy head and shoulders and the rubbery brown took on a gangrenous tinge around its stumpy feet. A decaying biosecurity module? No. Not with the way it was standing there, impatient, almost, waiting for Silas to decide on fight or flight.\nBile surged from his stomach. With clarion certainty he knew, suddenly, that Yorick was wrong. The bioship hadn’t eaten the crew. Not all of them, at least.\n“Were you a crew member?” Silas asked faintly, external mic.\nThe thing nodded its lopsided head. Silas tamped down his urge to vomit. The bioship had to be equipped with some rudimentary gene labs, in case injured miners needed limbs regrown or a tweak for high-gravity work. He could picture the swath of tendrils conducting struggling crew members there one by one, fitting them into surgical pods, setting to work with mutagens and autoscalpels and artificial viruses. The bioship had played god and remade them in its image.\n“Oh, fuck,” Silas said.\nThe thing nodded, this time gesturing with one arm.\n“Lead on,” Silas said, and he fell into step behind it. He had passed through a different airlock: this corridor had less flesh and no waving tendrils. He checked on Haley’s ghost again. It was still intact, still pristine, but before long the code would start to crumble around the edges. If he found Io and Yorick he might be able to rig something more stable using the processors in all three of their radsuits, but that was another temporary measure.\nAnd it assumed Io and Yorick were alive. Silas took another look at the thing’s mottled hump and shuddered. “The two others with me,” he said. “Do you know where they are?”\nHead shake, or at least Silas thought it was a head shake.\n“Can I radio them?”\nHead shake again.\n“The bioship will pick it up?”\nA nod, at last. But maybe Io and Yorick had gotten away and holed up somewhere on the bioship. He’d distracted it quite thoroughly, after all, when he took off sprinting. Silas held that comforting thought in mind as they arrived at what Silas guessed was the engine room.\nThe cold alloy door shuttered open at a touch, with a refreshing rasp of metal on metal, and they stepped inside. Silas had guessed right; the room was dominated by a shielded reactor and mountainous banks of monitoring equipment. Pustules of brown flesh still grew from cracks here and there, but for the most part it was a sanctuary of geometric surfaces and hard edges. Clean, cold, solid.\nThe door hissed shut behind them, and the noise turned Silas’ head just in time to see his newfound companion’s death throes. He gave a shocked howl and jumped back as the thing dug deep at its rotting tissue, pulling it away in strips and clumps. Spongy flesh shredded and tumbled to the floor.\n“Are you molting?” Silas asked, dumbfounded.\n“You talk too much.”\nSilas nearly swallowed his tongue whole. The voice was heavily accented, something Outer Colonies, hoarse from disuse, but it was human and it matched the bone-gaunt woman now clambering out of the steaming mess of meat. She was tall, spindly almost, with dark hair cropped to stubble around a wide-mouthed face. Her eyes were hard black graphite.\n“I’m Cena,” the woman said. “I’m a ghost. Formerly . . . A mining tech.” She gave a ragged laugh with no light left in it.\n“Silas,” Silas said. “Failed virtuoso, freethinker technician.”\nCena picked a wriggling bit of biomass off her shoulder and flicked it to the floor. She said nothing.\n“What the fuck happened here?” Silas demanded, slumping to a crouch. He’d meant to ask it gruffly, like some kind of amped-up cybersoldier, but his voice broke in two and it sounded how he felt. Desperate.\n“Love,” Cena said.\n“Love.”\nShe nodded, lips pursed, and Silas imagined he could cut his finger on her cheekbones.\n“You’re post-traumatic crazy.” He put his head in his hand. “That’s great. That’s really swank.” Haley’s neural patterns would start eroding in another hour. Silas watched the time display pulse accusingly in the corner of his vision.\n“I thought I would do this forever,” Cena said, breaking him from his thoughts. There was a sudden upshift in her speech. “I thought I would just do this forever. I thought I would eat the ship and shit the ship and wear the ship until one day I woke up grafted to the wall like Ahmed and Slick Jack and Omir and Su and all the others.” She took a deep trembling breath. Released it. “But now I’m talking to a failed virtuoso named Silo.”\n“Silas.”\n“Yeah.” Cena shook her head. “I’ll tell you what happened. Just promise me you’re real.”\nSilas promised. Cena told him.\n“I’ve been signed to Dronyck Orbital for six years, now. No. Seven. First long haul on a bioship, though. She’s called the Anastasia. We launched with a twelve-person crew, heading to one of the alloy belts. Solid crew. I’d shipped out with most of them before. The babysitter was new.”\nSilas felt a heart pang. Dronyk hadn’t allocated them a babysitter to pop in and out of cryo during the six month long haul, keep the freethinker company and check in on the sleepers. Maybe a babysitter would have spotted Haley’s damaged equipment.\n“His name was Pierce. Twitchy little man. Head full of ports and data stacks like a porcupine. I think it was his first long haul.” Cena folded her arms in the Lazarus position, the universal sign for cryo. “So eleven of us went to sleep. Pierce stayed awake for the first week, to check the pods, calibrate the freethinker. Then he was supposed to join us until the first scheduled thaw. But he didn’t.”\n“How would you know?”\n“Didn’t.” She shook her stubbled head. “Not until we thawed six months in for full physical. Pierce was waiting for us, very happy, very twitchy. Said we’d found something better than a nickel vein. Said the ship’s freethinker had crossed the Turing Line.”\n“Fully sapient?” Silas demanded. “The Anastasia’s fully sapient?” He lowered his voice, as if the freethinker might hear her name like a gossiper across a crowded party. Fewer than a dozen AIs in the known universe were confirmed to have crossed the Turing Line. Their innumerable brethren were only self-aware in the most basic sense.\nCena shrugged. “That’s what he said. That was his excuse for staying warm for six straight months and burning through the food and water.”\n“But a mining ship freethinker?” Silas was still stuck on the previous revelation. “No way could it go sapient. Not nearly enough codespace. AIs cross the Turing Line in mega labs, not on a rig financed by Dronyck fucking Orbital.”\n“He explained that, too,” Cena said wearily. “A metal ship, no. But a bioship, yes. The freethinker was already tapped into a crude nervous system. And at some point she started growing gray matter. Hardware to wetware processing.” Cena encompassed the bioship with a wave of her arm. “She has all the codespace she needs, now.”\nSilas rocked back on his haunches. “Shit,” he muttered. “So this isn’t even a freethinker running a ship anymore. They really are one big borg.”\n“Pierce called it evolution.” Cena laughed again, the same ugly sound. “He had been talking to her for six straight months. Docked in, you know. He was losing his fucking mind.”\nSilas felt like he was losing his. He could picture pulsating flesh all around him, but now peeled back, exposing the filigree of neurons, sodium and crackling potassium, neurons swimming up and down a vast lattice of canals. As much space as any mega lab. Enough space for a self-aware sapient intelligence.\n“He used up all the food,” Cena said. “Feeding her. He hacked into all the supply rooms. We still had the hydroponic garden, but he’d stripped most of that, too. And we were still six months out from the alloy belt. Omir and Slick Jack wanted to feed him to the ship.” She paused, then gave a sickly grin. “He beat them to it. We had him locked in a store room until we figured out what to do. Argued all nightcycle. And when we went to get him in the morning, he was gone.” Cena’s black eyes seemed to glitter. “Anastasia let him out. Stupid of us not to have someone watching him. But we were upset. Scared. We checked the cams. They weren’t wiped. We saw Pierce sneak out. He went to the equipment hold first, to get a gnasher.”\n“Gnasher?”\n“Cutting tool. Uses superheated plasma.”\nSilas thought of the sharp glinting shapes they’d passed in the dark, the rotary saws and line cutters. He was not enjoying this story. His skin was crawling with it.\n“And then.” Cena paused, frowning, her tongue sliding along her yellow teeth as she shook off Silas’ interruption. “And then, after he had the gnasher, he went and set it up by a cluster of nutrient tubes. Anastasia sealed off the corridor, I think, so we wouldn’t hear it. He cut off his legs.”\nHe’d known it was coming, in the back of his mind, but Silas still flinched.\n“The stumps cauterized clean, and I think he must have shut off his pain, or something, with one of those stacks in his skull,” Cena mused. “Otherwise I don’t see how he could have managed to get the second one off. He shoved them into a nutrient tube. Did his right arm, after, wriggling around on the floor like a worm. Shoved the arm in. Then it was just him. Inching. Got in headfirst, but by the way his stumps were twitching, I don’t think he was dead for at least a half hour. Anastasia took him nice and slow.”\nSilas hit the release on his hood and gave up a thin, bubbly vomit his stomach had somehow managed to churn together.\n“Don’t worry,” Cena said, as it spattered the floor. “Anastasia can clean that up, too.”\n“Why the fuck would he do that?” Silas rasped, once he’d resealed his hood. The bioship’s atmosphere was obviously breathable, but with a dank rotting taste. He would take recycled any day. “Did she get into his implants, somehow?” he asked. “Did she puppet him?”\n“It was voluntary. Judging by the audios he left for us.” Cena grimaced. “He was in love with it. In love with her. He was docked in every day for six months, but you’re a technician. You know how time perception gets. For him, it could have been years. Decades. He wanted to be with her forever. Full upload, he called it. Sick fucker had a prong the whole time he was cutting himself up. Didn’t go flaccid until Anastasia ate his spinal cord.”\n“And then?”\n“We were scared. Made a course deviation to get into orbit here, sent out emergency frequencies. Figured we might be able to get the bioship to go dormant until some trained technicians could come in and wipe the freethinker.” Cena shook her head. “And once we were in orbit here, no food, minimal water, no way of knowing when help would arrive, the only thing we could do was go back into cryo.” Cena wiped at her emaciated cheeks and seemed disappointed to find them dry. “We thought Pierce was the crazy one,” she enunciated, staring at her fingertips. “We thought Anastasia was still obeying her programming, sapient or no. So it should have been safe. To go back into cryo. It was the only thing we could do.”\nShe stalled out, so Silas prodded. “The pods were empty when we came in.”\n“Yeah.” Cena stared at him. “I woke up twenty-one days ago. Wasn’t supposed to. Some kind of glitch. And the other pods, yeah. Empty.” She snarled. “She was heating us up one by one like fucking sausages. I didn’t understand what had happened at first. You know how your head gets right after the thaw. Thought I was hallucinating. Especially when I found half of Ahmed.”\n“Half.”\n“Top half. Grafted to the corridor wall. Being . . . Absorbed.” Cena’s shoulders slumped. “He couldn’t talk anymore, at that point. I don’t think. She already broke something in his brain. He just stared at me. Then, when I tried to pull him down, he screamed. Loud, so loud. Anastasia must have heard it, or felt it, because she started sprouting those tentacles.”\nSilas remembered the feel of them coiling around his ankles and shuddered.\n“I screamed, too,” Cena said. “So loud. I know I should have stayed. I should have bashed his skull in with my boot. I think I could have done it quickly. Quicker. But I ran.”\nIo and Yorick, left alone with no howler to face the bioship’s army of spiked tendrils. Silas’ stomach turned again at the thought of them writhing on a wall.\n“I hid here, in engineering. Anastasia doesn’t have so much body down here. I tried getting into the system for days and days, but she shut me out of everything. Couldn’t flush a fucking waste unit, much less launch the lifeboat.” Cena gestured towards the blinking control panels. “She’s been hunting me for three weeks. Can’t see me when I wear her own skin, though, and when she goes dormant I burn out sensors and nerve bundles wherever I can find them.” She pointed to the mass of flesh she’d shed and it wriggled sluggishly. “Found out that if you slice it and mold it, it grows back together. Useful. Can even eat it when you’re done.”\nSilas couldn’t hide his disgust and Cena spotted it.\n“I always wonder who it is,” she said. “Ahmed or Omir or Su or whoever. I’m eating the crew. Just like she did. Maybe I’ll eat you, too.”\nSilas stiffened. “I’m stringy,” he said.\n“I’m joking. So. I’ve been waiting. Waiting and waiting.” Cena rubbed her cheek again. “And now you’re here. I can barely work a healthy freethinker. But I know that if we wipe the personality module, Anastasia dies. Or at least reboots.”\nSilas remembered the swollen module, spitting and swirling with corrupt code. Beyond repair. But there was an alternative to wiping it blank.\n“If she’s distracted, will you be able to get into the system?” Cena grabbed his arm with cold fingers, eager.\n“I almost got in before.” Silas gently tugged his arm away. “But that was, you know, before. She’ll be ready for intrusion now. Her main interface nearly electrocuted me on the way out.”\n“She’ll be busy,” Cena said. She looked down at her hands. “With your friends.”\nSilas snapped upright. “You said you didn’t know where they were.”\n“I don’t.”\n“I got away,” Silas said, raking both hands over his head. “They got away. Holed up somewhere how you did.”\n“Maybe,” Cena said. She gave him a long look. “Whether Anastasia has them or not, the only way to help your friends is to shut her down. Agreed?”\nSilas inhaled deep enough that his oxygen meter blinked. “Agreed,” he said. “Let’s fucking wipe this thing out.” He stuck out his hand and Cena clung to it like a vice, grinning fierce and mad.\n“Good,” she said. “Good. I’ll make you a suit.”\nA half hour later, Silas was creeping through a maintenance corridor, swathed from head to foot in what felt like rotting mushroom. The flesh suit was slick and warm and constricted his chest and arms, but he could move. Through a ragged gap he’d never noticed on Cena’s hump, he could more or less see.\nAnd the tendrils hanging from the ceiling couldn’t. They brushed against him every so often, first trailing along Cena’s back and then bumping his, but they made no move to coil or strike. As far as the feelers were concerned, Silas was already part of the bioship.\nSo, he figured using the radio was worth the risk. Making sure Cena was still trundling forward, and that his external speaker was off, Silas chinned his mic. There was a static crackle, then nothing for a long minute. Silas clenched his jaw. He could picture Io’s top half without the bottom. Yorick crucified to a nutrient tube, unable to speak. Not even the company man deserved that.\n“Silas! You alive?”\nHe’d never been so glad to hear Io’s voice. “I’m alive,” he said, clenching his fists inside their fleshy mitts. Relief crashed over him in warm waves. “I’m alive,” he repeated. “And I got Haley’s ghost. Are you alright? Are both of you?”\n“Yeah, we’re alright, you stupid fuck.” Io’s reply was half-laughed. “You lobotomy case. You idiot.” She exhaled static. “How did you get back aboard? Fuck, Silas, our ship’s gone. Gone.”\n“I know. Where are you?” Silas demanded, still picking his way along in Cena’s wake. “Actually, wait, don’t say. Anastasia might be listening. The freethinker.”\n“You named her?”\n“That’s her name,” Silas protested. “Look, I found out what happened with the crew, and it’s fucked up. It’s seriously fucked up.”\n“We found out, too,” Io said. Her voice sounded strained. “And yeah. It is. But we don’t have to end up like them. We’ve been . . . Negotiating. With her.”\nSilas felt a prickle down the nape of his neck. “Bad idea,” he said. “Bad, bad idea. She’s completely bat-shit.”\n“I know that.” Io paused. “Look, she has the lifeboat prepped and ready to launch. She doesn’t want us. Says we’re not family, whatever the fuck that means. But she wants us to do something for her first. She wants us to make her whole.”\nSilas stared ahead at Cena’s swaying back. “What do you mean?” he asked, feeling another stab of trepidation.\n“It’s the last crew member.” Io’s voice was coarse now. “They got away. She wants the whole set. She wants us to help hunt them down and recycle them.”\nCena turned to urge him on, and Silas realized his steps had slowed. He gave an affirming wave. She turned back. The ribbed corridor was coming to an end. They were nearly to the bridge.\n“This was supposed to be a rescue mission,” Silas said.\n“It was supposed to be maintenance,” Io said flatly. “We weren’t advised of these risks. Yorick will spin it our way when we get back to Dronyk.”\nSilas weighed it. Part of him wanted nothing more than to get off the Anastasia by any means necessary, get far away from this nightmare circus of meat and mad AIs. A lifeboat beeline for Pentecost was tempting.\nBut even on full burn, it would take another month to reach the planet. A lifeboat’s freethinker was nowhere near equipped to hold a ghost. By the time they docked, Haley might be nothing but nonsense code and a jumble of decaying memories.\nAnd if they took the lifeboat, Cena would have to die for it.\n“You’re with them right now, aren’t you?” Io was silent for a long moment, waiting on the reply. “Silas?”\n“She saved my life,” Silas finally said. “Pulled me back into the ship.”\nThere was a long pause. “You have Haley’s ghost, right?”\n“Yeah. Yeah, I have her.”\n“If we don’t get out of here, and soon, she won’t have a chance at recovery. You know that.”\nThere was another chance at recovery, but Silas couldn’t tell Io that. Not with Anastasia potentially listening in.\n“So where are you?” Io pressed. “We’re heading to the lower decks. Engineering. We going to find you there?”\n“Yeah,” Silas lied. “Engine room. Come in carefully. She has a, uh, a kind of plasma cutter.”\n“Be nice to have a fucking howler,” Io said. “Alright. Sit tight, stay away from the door. And don’t tip her off.”\n“Alright.” Silas chinned his radio off. There was a cold slick of sweat on his shoulders that had nothing to do with the clammy flesh suit. Cena stood at the hatch, waiting. She set the gnasher down, then put her hands on either side of her misshapen head and twisted. It tore free with a rending noise that shivered Silas’ teeth.\n“This is it,” she said, discarding the chunk of rubbery flesh, picking up her gnasher. “You ready?”\nSilas keyed his external mic. “Yeah.” He fingered the neural cord she’d managed to find him, hoping all the conductors would still fire. “Ready.”\nCena fixed him with a flint stare. “Who were you talking to?”\n“Myself,” Silas said. “I talk too much. I may be losing my mind.”\n“All mad here,” Cena replied. She didn’t look like she believed him, but she still turned and wrenched the maintenance hatch open.\nCena stormed out onto the bridge wailing like a banshee, raking the gnasher’s beam in wild arcs, scorching trenches into the ceiling’s overgrowth. Silas winced when she clipped a projector, leaving it black and smoking. He’d told her not to slice up any circuitry.\n“I’m here!” Cena called. “Anastasia! I’m here! No more hiding, no more sneaking. Eat me!”\nEven as she screamed it, the bioship responded to the intrusion, oozing clear mucus into the sizzling furrows while tentacles snapped from the floors and walls. They converged on her like vipers, baring hooks and barbs, and Cena cut down the first crop. A straggler darted under the beam and wrapped around her foot. She stomped, swore, fumbled with her makeshift weapon.\nSilas was so caught up he nearly forgot why he was there. Then Haley’s ghost pinged through his radsuit’s processor, and he located the soft blue glow of the ship’s main interface. The few tentacles dangling overtop of it strained in the direction of the fracas, distracted. Anastasia’s full attentions were on Cena and her gnasher. Silas reminded himself he was invisible, took a steadying breath, and ambled out of the maintenance hatch.\nIt only took moments to traverse the length of the bridge, but it seemed like a hard eternity. Silas walked slowly, eyes fixed ahead. Cena shouted and shot down wave after wave of roiling tentacles. The hot orange flash of the gnasher swam purple blots across Silas’ vision. The noise of searing meat and Cena cackling was loud, loud in his head. He walked through the chaos, untouched, and finally found himself standing where things first went to shit, right in front of the innocent blue interface.\nHe chanced a look up to the two tentacles overhead, straining towards the fray like overeager watch dogs. Then he dug his hands through the stumps of his flesh suit and hooked the neural cord into the interface’s port. Overhead, the tentacles shifted. Silas removed his lumpy head next, freeing up the concordant port on the neck of his radsuit. With one last look back at Cena trying to coax dregs from the gnasher’s battery, Silas jammed the neural cord into his neck and closed the circuit.\nIn. Silas sliced through virtual space, wriggling through the now-active detection system, throwing up a blizzard of nonsense code that masked his passage through the core files. The personality module loomed, hulking, throbbing. Larger and more complex than any freethinker Silas had ever cracked, a writhing mass of electric thought. But he didn’t have to crack it. All he had to do was replace it.\nSilas pulled Haley’s neural imprint from the flagging processor in his radsuit and pushed it across the channel. She streamed into the personality module as a digital flood, seeping into the cracks, coursing through the nodes. Code danced and jittered as it rewrote itself. Silas prayed hard to any god.\n“What the fuck are you doing, Silas?”\nHe realized Io’s voice was not coming through his radio at the same instant he recognized the shape of a thumb pressed up to his neck.\n“Fixing the freethinker,” Silas said, but even as he said it he felt his connection guillotine. He blinked, nerves tingling, back in the real world. Io was standing behind him.\n“It’s beyond fixing. Said it yourself.” Io pulled him away from the interface, making the unhooked neural cord swing. “Dronyk didn’t see this coming. It’s not our shit to deal with.”\nSilas realized he couldn’t hear Cena cursing. He turned and wished he hadn’t. The dead gnasher was lying on the floor, and Cena’s limp body was being hoisted up the wall. A thick pale nutrient tube had appeared there, cilia waving in anticipation as the tentacles dragged her upward.\n“You may leave now.” Anastasia’s voice blared through Silas’ head. “Your lifeboat is fueled.”\nSilas’ heart stopped. It hadn’t worked. The transfer hadn’t worked. He’d dashed Haley’s ghost against the virtual rocks, or worse, she was trapped in some tiny corner of the freethinker’s personality module.\n“Come on, Silas,” Io said shakily. “We have to get the fuck out of here.”\nYorick was silent, ash-white, uglier than Silas had ever seen him. He would get no support there.\n“Haley,” Silas pleaded. “Haley, can you hear me?”\n“We’ll upload her to the lifeboat.” Io swallowed. “Even with the decay, you’ll at least have some of her. Some memories. That’s better than nothing.”\nSilas shook his head, unable to explain. Cena inched up the wall. Her eyes were glazed over.\n“Let’s go,” Io said. “Let’s live.”\nSilas looked away before Cena reached the nutrient tube. He’d killed her, too. He should stay. He should stay and be the next one on the wall. But when Io grabbed him by the arm, he stumbled after her, tears tracking down his cheeks. Tentacles twitched as they passed.\nThen, all at once, they went limp.\n“Wait,” Silas rasped. “Wait. Do you hear that?”\nThe melody he’d been composing for the past three days trembled in the air, haunting and sweet, growing slowly louder as it looped. Io’s eyes widened.\n“Silas?”\nIt wasn’t Io who said his name. The synthesized voice wavered through the bridge, unfamiliar and familiar at the same time.\n“Haley.” Silas’ throat constricted. “This isn’t how I meant for you to wake up.”\nThere was a dull thump that made him jump. Cena’s unconscious form slumped to the floor, released by the tentacles. Silas staggered over to her body and checked for breath on his hand. Io and Yorick were still frozen to the spot, staring around.\n“I’m not the only one in here,” Haley’s voice said. “There are others. A lot of them. Why am I in here, Silas? What happened?”\nSilas thought of the nodes of gray matter all through the bioship, all connected, all wired through the Anastasia’s freethinker. Make her whole, she’d said. The crew wasn’t dead. Not quite.\n“You’re in a bioship,” Silas said. “You’re the new freethinker.” He paused. “Because you died in cryo.”\n“Holy shit.” A tremor ran through the bioship. “Tell me from the start. All of it.”\nSilas collected himself. “Alright,” he said. “But it’s sort of a fucked up story.”\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}