{"fingerprint": "nkkOfWTHrNHoiIJ4aYa6I7hGTZo=", "sitename": "Clarkesworld Magazine", "title": "Death of an Air Salesman by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Death of an Air Salesman by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4640 words, short story\n Death of an Air Salesman\n Towering cliffs topped with bright lush greenery. Cold clean waves crashing against the stone below, sleek gray clouds swirling through the unbound sky above. A woman dances along the edge, her long hair and scarf whipped wild by the wind. Her bare face is enraptured, eyelids fluttering, nostrils flared, as she draws in breath after breath of Apex Air.\n Maya watches longingly until the holopackaging loops, then returns the air bottle to her refrigerated bag, slotting it beside the others. Sitting cross-legged, she stretches as best she can—straightening her back makes her head graze the hard plastic roof of the sleepstack. She has a sharp spiny kink in her neck from always stooping.\n It’s easier to just lie down. The sleepstack’s bottom is padded soft, though it sometimes leaks a sticky gel from unseen lacerations. The rest of the interior is all plastic-coated screen, gouged with graffiti here and there by bored renters.\n More often than she sleeps, Maya just lies there, staring up at the free entertainment a foot from her face, watching goretoons or sex feeds for hours and hours until her eyes are shrunken and stinging. Sometimes she pays for crashing waves and wide skies, like the ones in the Apex Air holo, but she can rarely afford it.\n A soft electronic chime: her rental expires in two minutes, thirty seconds. The number slides around her in circles, glowing a pale soothing blue that will turn red when the countdown hits zero. After that the chime turns into a yammering alarm, and they say five minutes after that teargas gets autopumped through the vent. Maya has never stayed inside long enough to find out.\n She finishes dressing, pulling on her patched black gloves, attaching her face mask. The weather display appears in the corner of her goggles. Cold. Smog. Lower visibility than yesterday, lower oxygen. A good day to sell. The bottles’ luminous blue-green holopackaging will make them look like life preservers bobbing in the dark.\n One minute, zero seconds. Maya puts on her tattered black coat and straps the bag to her shoulders. It hums against her back, the tiny refrigerator coil strumming her spine. She taps her finger against the side of the sleepstack and clears her viewing history.\n The sleepstacks are meant to do that themselves, but some of these older units are glitchy. Once the old woman who rents the unit’s other ten hours gave Maya a look as they were passing and tugged an imaginary cock, made a mewling sound. Maya thought about it for days afterward, dissecting it in her head, suddenly paranoid that she had watched too many sex feeds, or the wrong sorts, and that the woman knew somehow. Since then she has been careful to clear the history, and keeps her head turned away when they pass each other in the queue.\n The glow turns garish red and the sleepstack hisses open. Maya clambers out onto the narrow metal catwalk. Even through her coat, she feels the damp chill instantly. Her face mask filters what it can, but she still tastes the chemical haze. Countless sleepstacks tower into the dark sky over her head, row after row shifting and revolving as renters come and go. Neon purple vacancies slash through the brown smog.\n Maya joins the ragged queue of renters heading towards the Sun Street exit. She watches for the old woman and her grease-stained yellow coat and her face mask, which is a cheery cartoon rabbit left with jagged nubs where she sliced its wobbly plastic ears off. But she sees someone else.\n His scarf is bright bright red, somehow untouched by the soot and smog, wrapped like a pulsing artery around his neck. He walks slowly, a little stiffly. Tired from whatever variety of night work needs his long slender fingers and furrowed brow. When he pulls back his hood to scratch at his forehead, he has thick dark hair like from a transplant ad.\n Someone jostles her from behind. Maya bobs her head apologetically, then pins herself to the side of the catwalk to let people pass, making herself as small as possible. She has to keep watching him for as long as she can. There’s a goretoon where Dex swallows Bogey’s favorite toy, and Bogey slices him open to find it, pulling out his shiny pink entrails by the handful while Dex’s eyes bulge.\n Maya’s guts feel like that now, and she is sure her eyes are bulging, too, so it’s lucky her goggles are tinted. She watches him move hesitantly along the row of sleepstacks, checking against a holo on the palm of his glove. Her heart thumps hard as he slows down. She barely dares to believe it. He stops at unit 389—her unit—and levers himself inside.\n The sleepstack clicks shut and Maya stays there a moment longer, imagining him stripping off his clothes and stuffing them into the cubby, maybe ordering a dry shower. She feels guilty picturing his naked body, so instead she pictures him walking along the edge of the cliff, red scarf whipping wild in the wind, and she’s there too, both of them unmasked and laughing.\n She doesn’t know what her laugh sounds like. She would need to practice it first. Maybe she’ll practice today.\n The refrigerated bag hums against her shoulder blades and Maya finally remembers there’s work to do. Time to start slinging air.\n The city streets are a maze of neon and smog. Harsh blue LEDs slide through the pavement, guiding masked and hooded pedestrians along, turning red to stop them from stepping into the ghostly rush of automated traffic. Maya goes to the corner of Sun Street and searches for her first customer.\n There’s no use trying to sell to the richest ones, the ones with swarms of tiny filter droids swirling around their heads, with swathes of perfect skin left near-exposed, coated only in membrane. They get their air by drone delivery, not from street hawkers. She can’t sell to the poorest ones, either, who stump along in old model masks that make their breathing rasp and echo.\n Instead, Maya watches for a certain kind of in-betweener. The ones with bent heads and slumped shoulders who look like they’re on the verge of collapsing in on themselves. Scurrying between microjobs, perspiration fogging their goggles, anxiety building and keening in their throats. Maya can spot them because she knows the feeling exactly.\n They shouldn’t be buying designer air. They should save their bitcred, wait for their dole. But when they buy the bottle, plugging it directly into their masks and sucking down the cold clean rush of nitrogen-oxygen-argon, they buy two minutes of not feeling desperate. Instead they are twirling free along the edge of a seaside cliff.\n Maya is good at her job. She can tell which ones need the bottle shoved into their arms before they can think too long, which ones need it passed subtly underhand with a conspirator’s nod, and which ones need to see her turned away, distracted, the blue-green bottle trailing carelessly in her hand, so they can feel like they’ve come up with the idea themselves.\n She makes her way down Sun Street and onto the Flux, moving in a circuit through her usual sell spots, keeping her eyes peeled for the regular or semi-regular buyers she knows by mask or by body language. She used to monitor her efficiency stats and sell maps religiously, but she’s been slinging long enough now that she does it mostly by feel.\n Sometimes she sees other air salesmen, hawking dull black canisters of OxyPlus or the brightly-colored Lucky Lungful sacs that look so cheap to her. Maya is polite to them, but never stops to talk or share the dregs of a caffeine spray. Instead, she plans her route so she arrives near a food vendor right as her gurgling stomach is about to eat itself, then allows herself five minutes to choose a technicolored foil packet and dine in a standing booth where the recycled air tastes like old grease.\n After that, back to work.\n On good days she empties her bag and refills it twice at the Apex Air station that carefully scans her wrist implant before it deposits the fresh bottles into her bag one by one. Today, because of the boy with the red scarf, she is less focused. She only refills once, but once is still enough to keep her on top of the leaderboard and enough to put her name into the lotto again.\n Every week, the top Apex Air seller has their name put into the travel lotto, to go to the air farms. Maya has been dreaming of winning ever since she saw the promotional images: wide gray skies, rolling green hills dotted with bright white air tanks, clean-clothed employees checking the pressure displays with contented smiles on their bare faces. It can’t be far from the cliff where they recorded the holopackaging.\n The only strange thing about the lotto is that it offers two spots to the winner. Two seats on the suborbital, two hospitality passes. Strange, but then again, Apex Air is an international company. Maybe there are air salesmen in other cities who live in commune bubbles and have people to take with them.\n Maya assumed she would leave the second seat empty and go alone, but now she has another idea moving in the back of her mind.\n The last few hours of her shift pass too slowly. She starts gravitating back toward the sleepstacks early. She knows the boy with the red scarf might not be there. He might have only needed a couple hours of rest. But today, for some inscrutable reason, Maya feels lucky. So when she sees him slip out of unit 389 she is not surprised, and she is only slightly terrified.\n She moves to intercept him, all of the words she was planning to say to him breaking and colliding in her head, turning into nonsense. “Excuse me,” she says, but only mouthing it—no sound comes out and he’s already past her, walking loose now, spine straight. He’s as tall as she is; he must get the same ache in his neck.\n She flags. She should go back to the sleepstack. Her rental is beginning. She’s wasting clean air from the vent. But she has the image again, of his red scarf flapping in the wind, of both of them dancing.\n With her heart pounding, she hurries after him and taps his elbow. He turns around.\n “Excuse me,” he says.\n “Excuse me,” Maya says, echoing the words right back because she hadn’t thought of what to do if he said it first. His goggles are still down around his neck and his eyes are a brilliant pale blue. “Three-eight-nine?” she manages, nodding back towards the sleepstacks.\n “Yeah,” he says. “Yes.”\n Her mouth is so dry that her tongue and teeth seem to scrape like metal parts. If she can’t say the right thing, he will turn and keep walking and the next time they pass each other he will keep his gaze carefully averted how she does to the old woman.\n “The cushion leaks,” she says.\n His eyes crinkle, and she can tell—she can hope—that he is smiling under the filter mask. “I lay down the wrong way,” he says, illustrating with his slender hands. “Got it in my hair.”\n “You have to lie headfirst,” Maya says. “I mean. Head that way.” Feeling bold, she reaches up and reverses his hands in the air.\n He looks at them, then nods. “I have to go,” he says. “My name’s Dima, though. I have to go to work. Is what I mean.”\n “I’m Maya,” Maya says. She pulls down her goggles, so he can see her eyes, too, and hopefully tell that she is smiling under her mask.\n “Okay,” he says. “I’ll see you again, maybe. In the morning.”\n He walks away, and Maya walks back toward the sleepstack, each step lighter than the last like there is a helium pump inside her, filling her up. She climbs inside the unit and sheds her coat, her gloves, her mask, folding them up into the cubby.\n Dima did not wipe the sleepstack screen before he left, and as Maya suspected, the sleepstack failed to reset on its own. But there is no frozen sex feed or netgame above her head. Instead, he was using one of the most basic options, turning the screen into a blank white page and his finger into a paintbrush.\n She lies back and stares up at a smeary yellow orb cresting a bright green hill. Across the bottom of the hill, in sharp crackling black, there’s a series of jagged scribbles. It takes her a moment to realize it’s text, but not in the way she knows it. Here each letter is misshapen and unique. He must have used his fingertip to do it.\n Maya pulls up a little alphabet box, so she can compare the letters and puzzle out the words.\n Once upon a time, there was a sun. It was warm. Probably.\n She thinks it’s the longest and most beautiful thing she has ever read in text. She can imagine Dima reaching up and tracing out each messy letter, slow and solemn. He couldn’t have known she was going to read it, but he must have hoped someone would. Otherwise he would have wiped the screen himself.\n Maya saves the screen as is and slides it into her own files where it can stay pristine, untouched. Then, with a trembling finger, she selects the paintbrush.\n She finishes her paintbrushing with plenty of time left over to sleep, but when the lights flick on to wake her it looks so ugly and silly, she wants to delete it. Dima might not like it, or not understand it, or the sleepstack might shuffle his rental and instead the old woman will see it. Maya would hate that.\n She spends so long debating that the countdown is red before she has her coat and mask on. She barely beats the alarm, and it’s such a rush to get out of the sleepstack that in the end she forgets to wave her hand and wipe the screen. By the time she’s heading towards the Sun Street exit, it’s too late.\n Dima’s red scarf makes him easy to extract from the stream of night workers coming in to sleep. At first it seems like he will walk past her without slowing, and she wonders if she should do the same, but then his head swivels and he pulls down his goggles. His eyes are bloodshot now, but still blue.\n Maya pulls down her own goggles. “Excuse me,” she says. “Where do you work?”\n “Courier,” he says, and she notices his pebbly geckowrap shoes for the first time, one of them held together with a webbing of glue. “Where do you work? You have a bag.”\n Maya retrieves a bottle of air and balances it on her finger, a trick she does sometimes to make it look like the bottle is hovering, like the air inside is so pure it could float up and away. “Apex Air,” she says. “Breathe the best.”\n He makes a sound that she assumes is coughing at first, but there’s no phlegm or throat in it. Then he passes her, heading towards the sleepstacks, and Maya lets herself get caught up in the crowd exiting on Sun Street. Once upon a time, she thinks.\n She’s already sold three bottles by the time she realizes he was laughing. She finally practices her own as she walks down the Flux, quietly at first, then a little louder.\n She tries it out on one of her customers when she hands him the bottle: “What a beautiful day. Ha, ha, ha.”\n He hesitates, then taps his ribs, the sign for how-are-your-lungs. “Filter okay?” he asks.\n Maya grimaces behind her mask. “Filter okay,” she says. “Thank you.”\n She is thinking about Dima when she refills her bag at the Apex Air dispenser. She is thinking about him when she eats, slipping the greasy calzone from its foil and kneading it so the still-frozen parts meet the too-hot parts and thaw. She is thinking about him when she rides the tube uptown, scuttling from one piss-smelling compartment to the next, bottle balanced on her finger.\n But today it doesn’t slow her down. Instead, she sells faster than ever, livewired with a nervous energy. When it’s finally late enough to return to the sleepstack, her stomach feels full of wiggling fingers. For the past hour she has been trying to guess what the lower part of Dima’s face might look like, the slope of his nose, the width of his mouth, the shape of his chin.\n She arrives back too early. Unit 389 is still sealed up. She waits further down the catwalk, fidgeting foot to foot, wondering if she should leave and come back, to not look as if she’s waiting, but then what if she misses him?\n The quick-slow glide of hydraulics startles her. Unit 389 is opening. She takes such a sharp breath that her filter mask whines at her; her heart hammers.\n The old woman comes out, adjusting her rabbit mask, and Maya feels her whole body slump in on itself. Dima did not take the full-time allotment. And since he is a courier, he probably roves all over the city. He probably rents sleepstacks in every sector. He probably never rents the same one three times in a row.\n Or worse, he saw her message and it made him decide to switch.\n The old woman stares at her for a moment, head cocked to one side, then starts to walk. Maya scrambles after her. She has never spoken to the old woman, but now she needs to.\n “Excuse me,” she gasps. “Was there anything on the screen when you went inside?”\n The old woman keeps walking. Maya follows.\n “Excuse me, excuse me,” she repeats. “I need to know about the screen. In the unit. In our unit. In three-eight-nine.” She reaches gingerly for the old woman’s arm and gets slapped away, but at least it makes her stop and turn.\n “Oh, now you talk to me,” the old woman says, in a high raspy voice, distorted through an old filter.\n “Yes,” Maya says. “The screen? Was there anything on the screen when you went inside?”\n “I wiped it,” the old woman says.\n “But before you wiped it, what did it say?” Maya pleads.\n The old woman pulls down her mask and Maya sees discolored skin, scabbed lips peeled back off a wide grin. Her teeth are bright artificial white, stained coolant blue in places. The smile doesn’t crinkle her eyes. The old woman clicks her mask back into place and keeps walking.\n Maya sways there for a moment, feeling confused, feeling lost even though she knows exactly where she is in the city. Then she goes back to the sleepstack. As soon as she’s inside, she collapses. She scrabbles her mask off with both hands and breathes in, but the clean air doesn’t help, especially since Dima was breathing it only hours ago. It was so stupid of her to run after him and tap his elbow. Stupid of her to spend hours on the clumsy picture of them on the clifftop, his scarf a tiny daub of red.\n The screen above her is blanked to a black mirror, showing her mouth grimacing, her eyes swelling with tears. She reaches a hand up to cover her blurred reflection, hating it. Her fingers brush an unfamiliar divot in the plastic coating.\n Maya swallows her sob. She turns the screen white and drags out the paintbrush, selects black. With one trembling finger, she traces the divots in the ceiling, staying inside the carved furrows as best she can as letters and numbers start to emerge.\n Maya 083143 384 Dima.\n Maya is reminded of another goretoon, the one where Dex falls down and down an electric staircase, bouncing from one step to the next, except she feels like she is falling up and up instead. She pulls up a hologram keyboard so she can transcribe Dima’s contact code, punching each digit into the air with a triumphant fist.\n They meet three days later in Theta Plaza, where there are still the husks of dried-out vines and shrubs spilling from cracked concrete planters. When she was younger, Maya used to switch a green filter over her goggles and pretend they were still alive, a little jungle of her own. Today she barely notices them. She only notices Dima.\n As they walk through the maze of dead plants, she can’t stop looking at him, watching the way he moves his arms, the way he holds his head. At first the conversation is uncoordinated, stilted, with stretches of silence where she forgets whose turn it is to talk. But they fall eventually into a rhythm. His blue eyes always rove left when he speaks, but they always slide back to hers when she replies.\n Maya has never spoken so much in her life; it starts to ache her jaw.\n They talk about small things, about their favorite feeds to watch in the sleepstack and which food vendors sometimes glitch the right way to give out an extra drink pouch. Neither of them know their parents since both of them were born exosomatic, post-plague, but Dima says he has a gene brother on the other side of the city.\n He tells her about the things he transports in the night—food and alcohol sprays and sometimes intravenous sacks to people who are wired up in virtual reality or who just don’t want to leave their sleepstacks. Sometimes packets of amphetamine, and once a biogun, the kind that fires calcium spikes and dissolves after a few hours so it leaves no evidence behind.\n He tells her how powdered chalk and coolant mix to make a soft blue paste, and how he paints with it in the part of the metro tunnels where the autocleaners can’t climb, but not so much anymore because his wrists are always aching.\n She tells him about the work lotto and the leaderboard, and she says, without quite being able to meet his eyes, that they invite two people to the air farms, even though only one person wins it.\n “Can I come?” Dima asks plainly, and Maya feels so happy she might burst like Dex the time Dex accidentally climbed inside the pressure pot.\n They walk from the plaza down Cloud Street, and the backs of their gloved hands keep brushing against each other, but neither of them step away to keep it from happening. When his fingers reach out and clumsily wrap themselves into hers, her breathing quickens. She can feel the tension in his arm and imagine it all through his body.\n She can feel herself getting flushed, how she sometimes gets watching the sex feeds, and when they stop at a row of privacy pods she only hesitates for an instant before she puts her wrist to the scanner. He does the same on his side. Bitcred trickles away, and the outer door shutters open.\n Her heart is fluttering all around her rib cage as they step inside and the door seals shut behind them. They take off one item of clothing at a time, making it into a sort of game, and Maya finds she is trembling. She peels off her gloves, her coat, just as if she’s in the sleepstack—except here they can stand, and instead of a gel cushion there’s a sort of couch. She took a dry shower before she left the sleepstack, but now she can smell herself, her sweat and her sex.\n With each removal, she sees Dima a little clearer. Without his coat she sees the geometry of his torso, how his trunk connects his narrow hips to his rib cage, which pumps in and out, in and out, as his breathing quickens. Without his gloves she sees the bony length of his fingers that weave through hers like puzzle pieces. Without his mask she sees his face, the inchoate smile on his chapped lips and the warm black eyes half-hidden by heavy lids.\n She thinks he is more perfect than any real or simulated person she has ever seen on a sex feed. That in turn makes her wonder how many people are watching them from the sleepstacks, all those glazed eyes only inches from their naked bodies. It feels surreal. She knows there is a privacy option, if you pay an extra fee, but Dima has not mentioned it so she won’t either.\n They stumble into each other on the way to the couch, and the feeling of their bare skin colliding goes through her like live current. They fall entangled; Maya is grabbing at his back, his front, driven by a need she’s never felt before, as if her skin is coated in a million tiny hands grasping for a million tiny counterparts on his.\n A gasping sob runs all the way through her, but this time it’s sheer happiness, too much happiness, so much it might atomize her. The whole universe is Dima’s body and hers.\n Maya uses her position on the leaderboard to get Dima his first Apex Air contract. She worries that he will miss courier work, roving all over the city, seeing small slices of other people’s lives, but he says slinging air is easier on his joints and he would rather see all of her than a hundred little pieces of other people. They coordinate their sell shifts and start to rent a double-wide sleepstack.\n At first her numbers take a hit, because she sleeps even less than usual with the bony geometry of Dima’s body pushed up against her, but eventually she finds comfortable places for her head and her hands and his breathing becomes her lullaby. She wakes warm from his body heat. They help each other gear up and when they leave the stack they walk close, so their arms brush with bursts of joyful static.\n Once she sees the old woman with the rabbit mask, but she doesn’t seem to recognize her, maybe because lately Maya scurries less and walks more like Dima does, with long smooth steps. He sells to one end of the Flux and she sells to the other; they work their way toward each other in the middle and sometimes stage tiny arguments about whose zone is whose, which always make a few curious people stop and buy.\n Inside the sleepstack they lie wrapped around each other, sometimes imitating what they see on the sex feeds, sometimes watching goretoons. One night Dima paints crude versions of Bogey and Dex on the screen, but instead of dismembering each other they are holding hands. He calls them Bogey-Maya and Dima-Dex. Maya saves it.\n One night after they’ve each sold two full bags each, they celebrate with amphetamine tabs and visit the transit tunnel where Dima used to put his blue chalk-and-coolant drawings. In the lamplight she can see the ghostly murals up on the cracked concrete, swirling faces and millefleur limbs, and she holds Dima by his hip bones and tells him it’s beautiful and she hopes the autocleaners never, ever find it.\n They sell well together, hovering near the top of the leaderboard, sometimes Dima leading, usually Maya. Neither of them win the lotto, but eventually they save enough bitcred to make the trip on their own. The air farms don’t exist—instead they visit a squat gray cube in a city not so different from theirs, touring an air factory where the glowing bottles are manufactured by the millions.\n They live happily ever after, probably.\n Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}