{"fingerprint": "FjbCYBCxOkMW7EyNXnzYaL+wFmY=", "sitename": "Clarkesworld Magazine", "title": "You Are Born Exploding by Rich Larson", "author": "Rich Larson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/larson_12_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: You Are Born Exploding by Rich Larson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14130 words, novelette\nYou Are Born Exploding\nWhen Elisabeth takes the baby to the beach on Thursday afternoon, another shambler has got through the fence.\n“Stay ten meters back,” the guard says, his translucent face mask fogged with the heat.\n“Yes, yes,” Elisabeth says.\n“And the child. Ten meters.”\n“We’re fully inoculated,” Elisabeth says, annoyed.\n“Of course, ma’am.” He seems to be dissolving in the condensation, only his dark eyes visible. “This distance is so our staff can remove him efficiently and with good technicality.”\n“Him?” Elisabeth echoes faintly. She hates it when people anthropomorphize shamblers—it sets a bad precedent.\nThe guard doesn’t correct his error, so she punishes him by not smiling her beautiful laser-scoured smile as she pushes Jack’s pram through the biofilter. Jack barely squirms under the static tongue. He is accustomed. Elisabeth’s skin pebbles when she follows him through.\nThe guard cups a hand to the screen, to cut the glare. Results show clean blue. The gate sags on its pneumatics, then lurches open.\n“Ten meters,” he says again.\nElisabeth gives a curt nod, pretending to be distracted by Jack’s slipping-off nylon shoe.\nThe wind is strong today. It comes in plucking and slicing, Atlantic cold, and counteracts the bright pounding sunshine. The waves are like nesting dolls: massive glassy walls out past the buoys, chest-high in the vast sloped shallows, child-size by the time they throw themselves onto the surf. Jack’s pram lumbers along just out of their reach.\nThe flour-soft sand is shifty under Elisabeth’s feet; the pram is unbothered. Its treads are military grade—Benny showed her the same serial number on a still of a dusty Pakistani war drone. She sometimes wishes it had smart-bombs, too, for when the Rose-Kellermans’ big drooling dog comes bounding up to inspect it.\nSpeak of the devil, or rather of its owner: Alea Rose-Kellerman is posed on a black-and-white striped towel just ahead, the straps of her swimming costume slipped down off her perfect shoulders, her face half-swallowed by vaguely insectoid sunshades. Her human nanny is herding little Nils through the surf, maintaining herself between the toddler and the sea.\nAlea always rubs everyone’s nose in the fact that they rehired their nanny. Always urges everyone to do the same, even though the cost of keeping a nanny’s vaccines updated—especially since hired help hardly ever have base immunomods—is astronomical.\nNaturally, she looks up just as a particularly vicious gust of wind wraps Elisabeth’s hair around her face.\n“Hello, Liz,” she says. “How are you?”\n“Hello, Alea.” Elisabeth peels the hair from her mouth with great dignity. “Lovely day.”\n“Won’t you join us?” Alea asks. “This particular square of sand is really something.”\nAlea always has to be airy and clever like that, likely due to some buried insecurity that is owed in turn to a dark, loathsome secret.\nElisabeth smiles her laser-scoured smile. “It’s a pleasure.”\nShe has the pram hunker down and unfold its parasol, which struggles embarrassingly against the wind. The sea air has stirred Jack fully awake. His small sunbrowned face is alight with curiosity. She hefts him out and sets him in the quivering shade.\nHe points a fat finger down the beach. “Shambla, mumma? Is it? Shambla?”\nAlea coos and chirps. “They’re speaking now! Such fun.”\n“He’s speaking,” Elisabeth says, bristling. “Jack’s a boy unless he eventually decides otherwise.” She adjusts Jack’s hat. “He’s two now. Yes, Jack, it’s a shambler.”\nAlea settles back on her towel, with a curve to her lips that looks more amused than chastened. “I suppose you show him those government cartoons,” she says. “The safety cartoons.”\n“We do, yes.”\n“I try to explain both sides of it to Nils,” Alea says. “Even though it’s upsetting. They’re very empathetic, Nils.”\nA ways down the beach, a small knot of spectators has gathered about ten meters back from a distinctive shape. It’s crawling for the surf, red-and-blue flukes rippling from its bent back. A guard is busy zipping into a hazard suit, white with what looks like a gasoline stain across one knee.\nThe shambler seems to sense its time is limited; it scoots a bit faster now, dragging a wet furrow behind itself. The whole thing is quite macabre.\n“Is hubby back from his little trip?” Alea asks.\n“What?”\nThe ejection is more forceful than she intended it. She was distracted by the shambler, and by the sputter and whine of the buzzsaw the guard will use to dismember it.\n“Benjamin,” Alea clarifies. “Is he back from Australia?”\n“Not yet.” Elisabeth shifts her gaze to Jack, who is meticulously pouring fistfuls of sand onto his tiny knees. “My brother is coming to visit, though. He’s an artist.”\nAlea smiles dryly. “Here to freeload while he seeks inspiration, I suppose? Every family has one.”\n“He’s quite successful, actually.”\n“Oh.” Alea gives a pensive moue. “I think we’re all artists, in our own way.”\nElisabeth imagines gouging out her eyes and filling the holes with sand. “What a lovely thought,” she says.\nThey promise each other a grand succession of wine tastings and lunch outings, then Nils begins puling in a way the nanny cannot stopper, and Alea recalls her brow appointment. Elisabeth puppeteers Jack’s arm to wave the trio a cheery goodbye, then lets him go back to his rearranging of sediment. The pram has printed him a lime green spade.\nShe takes in his cherubic concentration, the blonde curls plastered to his forehead. She coos his name, so he’ll look up.\n“I digging away,” he says, with a squinty grin.\n“You’re digging away,” Elisabeth concedes. “Yes.”\n“Is it digging away?”\n“Yes, my baby.”\n“Is it mumma digging away?”\nElisabeth observes her shiny white nails. She feels, as she often does, that she is being surveilled. She imagines a semi-organic satellite prowling through low orbit, all its sensors and innocent blue eyes fixed on her, categorizing every action she takes: Good Mother or Bad Mother, the eternal exhausting ledger. It can be so hard to tell which is which.\n“Mumma’s digging away,” she agrees.\nShe plunges her immaculate hand into the wet sand. She scoops some of the trickly mud onto Jack’s bare knee. He giggles. That used to be the only sound she cared about, that small, delightful burble, but these days it’s a decaying isotope. It should mean more than it ever did, but instead it has diminishing returns.\n“I love you so much, little baby Jack,” she says, to make it truer. “Little bubba.”\nJack keeps digging, and his focus reminds her fleetingly of Benny. She is glad that he pays no attention to the sea, where a wobbling bridge of light now stretches from the scurrying foam all the way to a blue horizon. Looking at it gives Elisabeth a headache. She is glad that he pays no attention to the guards hauling the dead shambler past in a membranous bag.\nThe car carries them home, climbing the winding slope toward Elsie’s Peak until they reach the sleek ziggurat embedded halfway up. Elisabeth reads up and down the conversation thread with her brother, who has stopped responding, so might have already dropped his plan to come visit. Jack watches a cartoon in the smartglass window, a woman baking a cake.\nThe crusty metal gate slides open; the car parks itself and switches off. Elisabeth carries her son into the house, past the many bristling security systems that recognize them and turn away, suddenly embarrassed by their excessive zeal. The house is a bit of a fortress, in Benny’s words. The graceful warp of its architecture was calculated to create ideal angles for its hidden sensors, its nonlethal, but only recently legal, howlers.\nElisabeth knows that companies like her husband’s have had an absolute fucking field day since the shamblers started. She also knows that most of it is based in misdirection. Shamblers have no interest in outdoor pools or rain reservoirs, not here, where the saline ocean is near enough to smell. Shamblers have no interest in people or their habitations.\nBut security companies have always capitalized on fear, and at least it’s not paired with blatant racism this time around—she was planning to tell her brother that, to sound like she’s thought it all through. She sniffs Jack’s soft blonde head, trying for memory traces of his original baby scent, from back when his skull was hairless and oddly puckered, that scent she couldn’t stand to wash away for a whole week.\nShe sets him down on the playroom tiles; the nanny comes rolling out of its corner. Its belly screen is displaying the end of the cartoon from the car, the cake coming out of the oven with a big waft of steam. It does as good a job as a human nanny would. Perhaps better. Elisabeth adjusted its speech settings to throw in some Afrikaans and local idioms, so that’s the cultural bit taken care of. If Jack goes to school, he’ll fit right in.\nShe clears the smartglass window and looks out into the back garden. Most of it is gray cement swatched with carbon moss, but there’s also a square of bright green grass, lush and springy and barely big enough for two people to sit on. Beside that, the pool.\nIt’s been covered over for weeks now, ever since a stretch of cold misty mornings made her think the weather was finally turning. The heat overstayed, but the long summer daylight has gone. Even now, barely scraping four o’clock, the sky is darkening. A pale craterous moon hangs over the dusky sea.\nShe observes a dark blue insect stalking along the edge of the pool. Its opalescent wings flicker and retract. She thinks of a shambler’s colorful flukes, its branchia, and ringent pores. She recalls the whine of the buzzsaw and the dirt beneath her nails.\n“House,” she says. “Run me a bath, please.”\nCold water, as cold as she can stand it. She remembers a boyfriend in uni who swore by icy showers in the morning, something about activating the mammalian diving reflex, doubling oxygen intake to the brain. Back then she privately thought he was a lunatic. She preferred scalding showers, letting the jet beat a little tattoo at the top of her spine. She only varied her routine when a red semicircle of skin started to peel away.\nNow she slips into a tub that shocks the breath out of her and mottles her fingers purple. It shrinks her skin around her, knobbles it. She imagines the freezing bottom of the ocean, too deep for sunlight to touch. She shuts her eyes and holds her lungs and plunges her head under the surface. Her hair billows like anemone around her face.\nFor a moment, she pretends she is a shambler. Stripped of consciousness, purely limbic, a creature that drowns itself once and then disappears forever. It’s a dark heaven.\nJack’s warbling voice brings her back up. “Mumma? Where is you?”\nHe knows where she is; she told him and sat him outside the door with the nanny. “I’m right here, Jack,” she calls. “In the bathroom.”\nShe eye-traces her gleaming sanctuary: the polished vantablack floors, the prehensile jets of the shower, the small coves where harm-free towels and shampoo bars nest, each one lit from below with a soothing purple-blue light.\n“Mumma?” Jack’s voice is edged with a sob. “Is you inna bathroom?”\n“Yes, Jack,” she says. “I’m in the bathroom.”\nElisabeth values her privacy when she is bathing or shitting, and a mol of her relishes Jack’s predictable bouts of panic. His bafflement, when the center of his universe shifts out of sight. That makes her a Bad Mother.\n“Mumma is in the bathroom,” the nanny adds, a soft synthesized voice with a singsong Western Cape accent. “Okay, Jack?”\n“Is it inna bathroom?” Jack demands, seeking clarity, always.\n“Yes, Jack.” Elisabeth shuts her eyes. “Mumma inna bathroom.”\n“Come in?” Jack pleads. “Mumma?”\n“Of course,” she says, because she is a Good Mother. “Come in, my baby.”\nThe door unchokes and slides open. Jack toddles inside, his blue eyes bright, distress forgotten. “Wash you!” he orders. “Wash you, Mumma.”\n“Wash you, too, Jack,” she says.\nShe keeps her head above the water but makes herself stay in the tub until she feels pins and needles in her feet. Jack pushes a toy crocodile along the floor; its molded plastic feet click softly in the notches between the tiles. She shivers. Her teeth start to chatter.\nNights with Jack are long, fractured things. He rarely sleeps well, and when his dada is away it’s even rarer. Elisabeth marvels at this occasionally, the brutal mutation that Jack undergoes every evening, turning from a quiet angelic thing to a wailing monster. Sometimes it feels as though he is balancing his own ledger. Good Jack, Bad Jack.\nMore likely it’s the two-year sleep regression the nanny has warned her about. So she resigns herself to the dance:\nEndure the crying for a minute, two minutes, pad into Jack’s room, comfort, nurse, rock, leave, climb into bed, drift, startle awake at his screams, back to Jack’s room, comfort, rock, leave, wait, wait, climb into bed, drift, startle awake at his call, wait, wait, back to Jack’s room, comfort, nurse, no, not yet, rock, leave, wait, climb into bed, drift, half-sleep, half-dream, startle awake at nothing—\nIt would be easier to let the nanny handle it. It can soothe him just as well as she can, and it could nurse him, too, if she equipped it properly. There’s a little gene lab in District Six that does custom wet nurses, hairless cat-sized things grown from your own helices, sprayed down with your own sweat and gut flora to ensure full oxytocin release.\nElisabeth envisions Jack suckling at a pale disembodied breast, a lactating tumor. It still makes her shudder, so she’ll press on, even though his teeth can turn razorous when she shifts him. She lays him down in his seesaw crib for the fourth, maybe fifth time. His face is still flushed from exertion, but his eyes are shut. She creeps back to her bed.\nIt would be easier to stay in his room, to fall asleep on the chair with him on her chest, but children have to learn to be alone in the dark. It’s normal now, even if it was a death sentence ten thousand years ago. Elisabeth suspects this is why night terror calcified in the genome. All the babies who didn’t scream were carried off by leopards.\nShe rubs her face into her soft cool pillow and entertains the image, a serene little baby smiling up at a puzzled predator, who then shrugs its bony shoulders and swallows it whole. She thinks in cartoons lately, from watching the nanny’s screen so often. She is a Bad Mother for her sleepy giggle. Even animated violence against children should probably de-clench a deep maternal horror in her soul.\nJack is quiet for a long time, so long she is compelled to roll over and observe the undulating monitor that tracks his breathing. He is breathing. She drifts.\nSomeone is in the back garden. She hears it in her dream first—the scuffle of feet; a soft grunt—then the neural glacier calves and splashes into reality. She wakes up with every square inch of her skin prickling cold. She pictures a fully kitted-out technothief scaling the trellis, slamming some vicious new malware through the house security system, rendering all the sensors and howlers useless at once.\nShe gropes under the bed for a biolocked box. It tastes her fingers and slides open. The gun inside is an Amazon Shootist, supposedly small and easy to carry. The weight drags at the tendons in her wrist. She carries it in both hands as she slips toward the bedroom door.\nShe replays the sim in her mind’s eye, remembering the cheery ex-soldier who emphasized the importance of breathing, said the lungs are part of the mechanism, same as the muzzle and the trigger and the finger. Her lungs seem to have stopped working. That’s unlucky.\nThe smartglass in the hall shows no intruder detected. Her heart clubs her ribs. She vacillates between options: barricade herself in Jack’s room and call emergency services—will the call go through, if the house is hacked? Or go to the back garden, to increase the space between Jack and the intruder, and scare them away. Or shoot them. Either way, the decision has to hinge on Jack’s safety, in order for her to be a Good—\n“You’re fucking joking,” she mutters. The cam feed from the back garden shows a slender barefoot man with a gray duffel bag on one shoulder. He’s licking his thumb and rubbing it impatiently against the door to the detached guest room.\nElisabeth looks at the top right corner of the smartglass, and sees no intruder detected, but one guest logged. She is trembling. Her whole body is slick with sweat, enough to coat a dozen artificial wet nurses, though she doubts Jack would like this particular smell. She returns to her bedroom and puts the gun back in its biolocked box. Pries at the hinges, makes sure it’s sealed.\nShe goes to the garden door to let her brother in.\n“Oh,” Will says when he sees her through the window. His voice is muffled. “Hey, Eli.”\nShe slides open the metal grate and unlocks the door with her slimed thumb. She steps out into the garden. The carbon moss is cool and damp under her bare feet. Will must have taken his shoes off to wriggle his toes in it.\n“Here I was, trying so hard not to wake you and Jack,” he says. “Whoops.”\n“Whoopsie,” Elisabeth agrees, but she’s barely annoyed anymore. It feels good to see Will, gives her a rush of relief and familial chemicals.\nHe’s skinny and sunbrowned, how he usually was when they were kids, which means he is drinking less. He’s wearing lime green trousers with a baroque print and an unbuttoned gray shirt that matches his Swiss travel bag. He still corrects his crooked face by holding one brow up slightly, which in turn deepens the familiar crease on his forehead. His eyelashes are still long and dark.\nThe older he gets, the more he looks like their dead dad.\n“I took an earlier flight,” he says. “From Timisuara.”\n“You didn’t message me.”\n“I didn’t bring any tech,” he says. “I’m on a cleanse. But your gate remembered me, so I figured I could sneak straight to the guest bed.” He holds out his arms. “I’m fully inoculated. If you’d like a hug.”\nTheir family has never been much for physical contact. She wonders if the offer is related to his tech cleanse, and to the fact that his shoes are nowhere in sight, or if he’s microdosing MDMA again. She leans forward and hugs him badly, both arms overtop of his. He doesn’t cling back the way Jack does. He mostly just stands, while one trapped hand pats awkwardly at her hip bone.\nIt feels good anyway. She hasn’t touched anyone but Jack in ages.\n“Glad you could come,” she says, and pulls back.\n“Me too.”\nShe puts her thumb against the guest room door, then teaches it to remember Will’s as well. From inside the house, Jack starts to wail. The nanny’s alert skitters inverse across the window.\n“Good luck,” her brother says, rubbing at his bristly cheek. “Love you, Eli.”\n“Love you, Will,” she says back, on instinct.\nHe goes into the guest room and shuts it behind him. She stays in the garden a moment longer, relishing the cool breeze blowing in off the ocean, the scattered stars overhead. It’s important to crystallize these small moments where everything is going to be okay.\nShe wakes up the next morning when Will bounces into her room with a very nervous Jack stuck to his hip. Jack is still wearing the penguin onesie she bought in Simon’s Town; small animated rockhoppers waddle across the fleece fabric. Will is still wearing yesterday’s clothes.\n“All work and no Jack makes me a dull boy,” he sings. “Look how big he is!”\nJack squirms toward her, wriggling through the air, his anxious smile on the verge of breaking.\n“Last time he was just a little pupa,” Will says, with his chin-jutting grin. He dumps Jack onto her blanketed legs and steps back. “All he did was sleep and shit. Now he’s a little person, isn’t he? Aren’t you, Jack?”\n“No,” Jack says, and cling-wraps himself to her. She hauls him up her body, to her chest. He relaxes but doesn’t take his eyes off the interloper.\n“He recognized me,” Will says. “Knows me from pictures, I think.”\n“He knows all his animals,” Elisabeth says, rubbing Jack’s small hot back. “Don’t you, bubba? You know Uncle Willy?”\nJack gnaws softly at her shoulder, one of his ways of displacing nerves. “Unka Weedy,” he mumbles, then, emboldened: “Mumma? Is it Unka Weedy?”\n“Yes, my baby,” she says. “It’s Unka Weedy. He’s going to stay for a little bit.” She rearranges the blonde nimbus of Jack’s hair. “How long, do you think?” she asks.\nWill blinks. “However long you want,” he says. “I’m happy to work from here. Get a little sea, a little sun.”\nElisabeth hears Alea Rose-Kellerman’s small knowing sigh. She tries not to let it taint things. Nobody does anything altruistically. There is always some benefit, some Goldberg mechanism shuttling dopamine to the receptor.\n“This place is actually perfect,” Will says, folding his bony arms. “I saw cases are up here. And that’s what I’m into, lately.” He smiles down at Jack, but his eyes are elsewhere. “The shamblers.”\nThe word plunges Elisabeth into freezing saltwater. Her breath catches. She barely manages to come back up. “Oh,” she says. “Well. Plenty of them.”\nIt feels strange to have another person in the house, one who takes up roughly the same cubed air as Benny but in a radically different way. She doesn’t host often. Nobody does, these days. It adds another slick layer to her usual feeling of being monitored, scrutinized, as if her brother is a spy sent to evaluate her mothering in person even though he doesn’t know a fucking thing about it.\nShe packs away the paranoia and focuses on her schedule. Friday means doing Monday’s grocery order, rotating Jack’s toys, putting out the glass milk jars for the afternoon drone to pick up, working through another half of a therapy module, deep cleaning the guest bathroom, experimenting again with implementing an early quiet time for Jack, to counteract his bad nights, and exercising in the living room with a bubbly plyometrics instructor.\nThat, and a dozen other small things that have accumulated on the smartglass. Now that Will is here she feels more impetus to do them, the way she might feel on a stage with an audience. She has to keep reminding herself that Will doesn’t care if she is the Good Mother or Bad Mother, that Will is more concerned with his own ledger.\nFor instance: he has deduced his nephew’s favorite animal, and is now tracing beautiful purple pachyderms all across the playroom floor. Jack watches from a safe distance, one hand resting on the nanny’s puffy pneumatic arm, but he is no longer nervous. Will was always good with children.\nWill looks up. “Thought he was saying air vent, at first. Not elephant.”\n“They’re homonyms for him,” Elisabeth says, arranging the clanking milk jars in their box. “And he likes both.”\n“What else should we color, Jack?” Will asks.\nJack lurches forward, still holding onto the nanny. “Effen again,” he says, peering down at the playroom tiles.\n“You’re stifling my creativity,” Will says. “One more elephant, then something else. Okay?”\nElisabeth lugs the box outside, and when she returns there are silhouettes with rippling flukes and tendrils making their way across the floor.\nThe day evaporates and she barely thinks about Benny. Will slips away while she’s putting Jack to sleep for the first stretch of night—she hears the gate scrape. By the time Jack flicks out, and she emerges into the dim-lit hall, her brother is back with a bottle of wine clutched in each fist. She recognizes a Fat Bastard label. The other is a biodynamic imported from Greenland.\n“It’s not just a novelty anymore,” Will preempts. “These northern wineries, they grow good shit.”\nElisabeth puts a finger to her lips, then directs him into the kitchen. The nanny is cleaning crusted oatmeal off the floor. There is a drop zone beneath Jack’s highchair; its circumference has widened and shrunk as he adjusts to feeding himself. Will stows one of the bottles in the gelfridge and uncaps the Bastard.\n“There are proper glasses in the corner cupboard,” Elisabeth says, spotting the tumblers he’s grabbed for them. “Second shelf.”\n“We’re not proper,” Will says.\nThe chardonnay sloshes and swirls into the tumblers. Elisabeth has tried so hard not to drink around Jack, for fear of embedding some deep tragic memory of his mother as a stumbling lush, but now that doesn’t matter. And she needs to drink, so she can tell her brother why.\n“Cheers,” he says, and manages to clink glass before she raises it to her lips. She gulps the pale wine down. One swallow. Two. It feels like pouring water on parched soil; she imagines a dark bloom spreading then imploding on dry sand. Then the tumbler is empty, and she needs more. Will only looks startled for an instant before he refills her.\nShe isn’t tipsy yet; nothing’s been absorbed, but the act of drinking gives her permission on a symbolic level. Permission to be open and truthful. She stares hard at the space over Will’s narrow shoulder. She takes a deep breath.\n“I don’t think Benny is coming back,” she says. “We’ve been fighting and fighting. He was meant to come back last week.”\n“Fuck.” Will takes a deep drink. Some trickles off the corner of his mouth. “Is he sleeping around again? He went with Cora, right? Clara? Whatever her name is.” He grimaces. “That’s the only reason people do business trips in the flesh these days, isn’t it.”\n“It’s not that,” Elisabeth says. “Jack was misdiagnosed.”\nAnd hearing it in the air, in her own voice, opens a trapdoor in her stomach and puts her guts in freefall.\n“How?” Will asks, at an unusual pitch. “The meds were working, I thought. I thought that he’s been—hasn’t he been—”\n“They were working on one thing, but not on the underlying genetic condition,” Elisabeth says. “The labs have been busy. For obvious reasons. So we only just got the new diagnosis.” She drains her tumbler, swills it around her mouth for the faint sting. “One more good year, maybe, then his body starts in on itself,” she says. “Don’t ask about options. Please.”\nWill knuckles furiously at one eye. Gives a shaky laugh. “And Benjamin fucked off to Perth?”\n“Adelaide,” she says. “But it doesn’t matter, Will. He doesn’t matter. I just need to figure out what’s best for Jack.”\nShe takes the wine bottle by the neck and heads out to the garden.\nThey drink.\nShe shows Will the fig tree, squat and arachnoid, that deposits lumpy green spheres all across the cement. She tells him how Jack likes to pick them up and carry them to the rain gutter, and say that he’s making guava soup, because she thought it was a guava tree when it was first transplanted, and called it that, and Jack absorbed the wrong word into his spongey little brain.\n“He’s really clever, isn’t he?” Will asks, stepping over the death-shaped gap. He tips the dregs of the chardonnay into his mouth, emptying the bottle. “Verbal for his age. I think.”\nElisabeth pauses and listens for a thirsty cry, because speaking about Jack often seems to conjure him, but hears nothing. “Yes,” she says, stepping over the same gap. “Really clever, really verbal. Something something percentile.”\nWill nods, then points his chin at the pool. “Is it filled?”\n“It’s not heated.”\nHe rubs his feet against each other. “Filled, though?”\n“Yeah.”\nShe unlocks it for him, pushing her thumb to the sun-bleached screen. The cover folds up into itself, worming backward to reveal the turquoise water. The scent of chlorine wafts off the top. Will rolls his pant legs up his hairy shins and perches himself on the edge, slaps the spot beside him. She remembers they once snuck over a neighbor’s fence as children, to swirl their feet in a similar pool and whisper about their transgressions.\nShe joins him, but angled so she can see the smartglass window, where the nanny will send its notification if Jack wakes up. They talk about school days and swim meets, and then the conversation collapses inward, as all conversations do these days, toward the omnipresent black hole. It’s still better than talking about Jack, who will die, or Benny, who is a coward.\n“I saw them putting in new barriers in Muizenberg, all along the strand,” Will says. “Trying to plug up the whole coastline.”\n“There was one at the beach yesterday,” Elisabeth confesses. “It nearly made it to the water, right there with everybody watching. Which makes you wonder, doesn’t it.” She slurps from her tumbler. “How many of them do make it, where nobody’s watching.”\n“Many,” Will says. “But once they’re in, they’re hard to count, because they dive so fucking deep. They grow those—cavities.” He punches tiny holes in the air with his finger. “Lets them handle pressures that would burst us. Burst our organs.”\nElisabeth feels a delicious shiver up her spine, chining through her back. “What do you think they’re doing down there?” she asks.\n“I don’t know,” Will says, because no one does. “It’s possible they get eaten by colossal squid.” He kicks one foot out of the water, spraying drops toward the other end of the pool. They plink and ripple. “I like to think they’re building a city.”\n“They don’t have brains, though. That’s the first bit to go.”\n“They have something,” Will says. “They have big nerve bundles, at least.”\nThe pool becomes a temptation. She closes it, telling her brother that it will attract mosquitoes, then goes into the house to retrieve the other bottle of wine. She lingers at the smartglass for a moment, watches Jack’s small body breathing. When she returns to the garden, Will is dragging the two mesh folding chairs from behind the rain tank.\nShe wipes the spiderwebs off them, and they sit in the middle of the garden under a cloud-cloaked nebula. She feels drunk.\n“It was rude of them, wasn’t it?” She points one finger upward to indicate whatever species or mechanism or individual is to blame. “Dropping a tailored gene-virus on our heads, right when we were finally getting used to the homegrown sort.”\n“Could’ve been an accident,” Will mutters, and she realizes with mild distaste that he shares one of Alea Rose-Kellerman’s pet opinions. “Could’ve been them trying to say hello.”\n“Suppose,” Elisabeth says. “Do you know what some people are doing, though?”\n“Yes, I know,” Will says, eyes fixed to the dark sky.\nThey drink.\nBetween her usual bouts with Bad Jack, during which she feels she is more tender and loving than usual, which might mean she should drink more often, Elisabeth has wild and joyous dreams:\nIn one of them she attends a party at a baroque hotel whose occupants have been under quarantine for years. She attends arm in arm with Alea Rose-Kellerman, both of them attired in striped swimming costumes, their fictional enmity dimmed to a fictional annoyance.\nThe maître d’, who tries his best to keep everyone’s spirits up with these nightly parties, appears in triplicate. It is unclear whether he is an identical triplet, and shares his managerial responsibilities with his two brothers, or if he has somehow distributed his consciousness across three perfect vat-grown copies of his own body.\nThe party is a tired affair, as it’s been going for years, and Elisabeth plans her egress. She observes the festivities from a lofted gallery. She creeps toward the doors, which still project a hazard-yellow warning holo but have been thrown open to tempt the velvet breeze inside. A clearly underage girl looks up from her metallic wine glass.\nElisabeth darts for the exit. The maître d’ calls on his bumbling nephew to stop her; the boy hacks at the air with a knife but she feels no terror, only exhilaration, as she ducks around him and bursts out into the wet and windy night. The city is an architectural mishmash of Zaragoza and Luxembourg, wide cosmopolitan avenues and winding cobblestone alleys, all of it impaled by a diagonal canal.\nHer swimming costume needlessly becomes a wet suit as she dives in. The canal is shallow; she scrapes the silty bottom and her activity stirs microorganisms in the mud to glow a radioactive green. She prowls along the bottom, moving against a soft artificial current, and feels no tightness in her lungs. She revels in the escape, in the thrill of civil disobedience.\nThe canal is deep. She swims down, down, into the crushing cold. The microorganisms light her way, floating in orbit around her. She has no need to breathe. She swims through an ancient sea that teems with trilobites and stalk-eyed protofish, and then finds herself in another city altogether. Slantwise streets and crooked ziggurats, all hewn from the rocky seabed, arrayed around a volcanic vent.\nThe underwater city is empty, but she knows the shamblers have only just ducked out to get a few things, and intend to be back shortly, so—\nThey take a day trip out to Cape Point, since it was shut down the last time Will was here. The nanny plays Jack his shows while Elisabeth packs the diaper bag and fills two shiny red thermoses with Zimbabwean coffee. Will volunteers to make sandwiches. He lays two columns of puffy white bread on the countertop, alternates swoops of smooth peanut butter with smears of grape jelly, then slaps and stacks them.\nThe systematic motions make his bony hands look exactly like their mother’s. Elisabeth thinks they will probably talk about her the next time they drink.\nFor now, she bags the sandwiches and supplements them with hummus and sliced fresh cucumbers and a wedge of crumbling goat cheese. She fills a lidded cup with animal-shaped crackers, which include elephants, but no shamblers, to hold Jack over on the drive. She checks and rechecks the diaper bag.\n“You are born exploding,” Will says, triumphant.\nElisabeth hunts for the infant sunblock. “Pardon?”\n“By JJ Manks,” Will says. “That poem you were trying to remember the name of, the other night. ‘You Are Born Exploding,’ by JJ Manks.”\n“I don’t recall.”\n“You don’t recall trying to recall.”\nShe finds the infant sunblock stranded inexplicably on top of the fridge and adds it to the bag. “I don’t recall trying to recall,” she says, hoping she was not thinking of Jack when she asked about the poem. “Are you ready?”\nShe swoops Jack off the floor, and they load into the car, which is already switched on and purring. The bright white chassis lances early morning sun in all directions. She has a gnawing feeling as they pull away. She tries to guess, from its inchoate shape, which important task or object she has forgotten. There is always one.\nThe house seals up behind them. The armored gate rasps shut. Cams swivel on stalks. Hidden howlers prime for intrusion. It always feels as though the house is relieved by their departure and doesn’t want them back.\nThe drive is hemagogic, a beautiful winding pilgrimage around the mountain’s curve, a vantage point from which the waves seem like foaming munitions launched from across the world, streaking inexorably toward their targets through a blue-green sea. From above the beach barriers are plastic toys, barely worth noticing. No shamblers are visible.\nThen south, through Glencairn and Simon’s Town, south, plunging down the coast, sliding inland, outland. Lush wind-whipped grass gives way to an endless plain of scrub, purple-red punctured with tufts of acid green. The sky swells with no mountain to stop it. Elisabeth wonders why she doesn’t do this often, why she spends so much time immured.\n“Is it monkey?” Jack queries.\nThey are passing a sign that once warned of the presence of baboons, and now assures visitors that all baboons have been chipped. The diagram depicts an angular skull in black silhouette, a small radiation-yellow square inside it, even though Benny told her the actual chip is too small to see.\nThe cerebral modification that binds their behavior is a matter of nanosurgery: a little drone injects them with a little biobot, which nestles in the prefrontal cortex and inhibits aggression toward any human-shaped bipeds. Similar tech is now being trialed on prisoners of war and climate refugees.\n“Yes, clever Jack,” she says. “It is monkey.”\n“Fucking beautiful out here,” Will says. “So much sky.”\nThe car parks on a stretch of sand lined with empty cooking pits and picnic tables. She pulls Jack from his seat in a shower of crumbs, all the animal crackers pestled by his chubby fist and clumsy mouth. Will grabs the diaper bag and the cooler bag. Beyond the sand, there is a field of sea-slimed rocks. Beyond the rocks, there is a bobbing black carpet of seaweed. Beyond the seaweed, there is gray ocean marked by a single fishing boat.\n“Is that Lion’s Head?” Will asks, pointing his chin beyond the ocean, to a mountain half-digested by cloud.\n“Yes, clever Will,” she says. “That is Lion’s Head.”\nHe swings the cooler bag so it collides with her non-Jack hip. It feels good to amuse herself, to amuse someone else, to say things carelessly. Her ongoing conversation with Benny, which twines ambiguous texts with strained voice messages, feels like dissecting a thermonuclear bomb. She showed part of it to her brother when they were drunk. He called Benny a self-obsessed cunt, then apologized and changed it to self-obsessed anal polyp.\nThey sit at the splintery wooden picnic table and eat. Jack is more interested by the rocks. He points at them over and over, his insistent finger smeared with peanut butter, until Will volunteers to spot him so she can finish her meal for once. She allows it. When the cucumbers crack and gush between her laser-scoured teeth, she tries not to picture Jack’s small skull crumpling against wet stone.\nBut he’s a cautious baby, picking his way slowly and methodically across the convex obstacles, and Will is hovering behind him, ready to swoop the prongs of his hands beneath Jack’s armpits and lever him to safety. Elisabeth observes them from a distance while she eats two sandwiches.\nTheir exploration triggers an exodus of silverfish, swarming and scuttling. Jack gives a gleeful shout. He fears dogs and cats and often humans, but not insects. Her brother is less gleeful; his spine stiffens, and he scoops Jack into the air.\n“Eli!” he hollers, but now there is a hint of grin in his voice. “Come look at this!”\nShe pins the empty sandwich bag to the table with her thermos, so no sudden gust of sea breeze will send it dancing out of reach and add another atmosphere of pressure to her crushing enviroguilt, then she joins them on the rocks. It’s not so slippery as it looked. The tops are mostly dry, crusted bone-white by the sun.\nSilverfish scurry away from her every step, which means it is not the silverfish Will wants her to see. When she reaches the spot, the sea-stink is joined by something stronger, oilier, that crawls into her mouth and nose. Will and Jack look up. They share a single face: childish, delighted, fascinated.\nA beautiful carcass is strewn over the rocks. The half-shattered exoskeleton still holds its deep rich hues, indigo bleeding to crimson bleeding to violet. Fleshy tendrils trail from sundered sockets, connective tissue a familiar anatomy-book red. The dead flukes, reminiscent of an overgrown yam she once found in the back of the cupboard, sway and shiver in the salt air.\nJack points with his smeary finger. “Shambla, mumma,” he says.\nShe remembers that the baboons were updated to hunt them.\nIn the week that follows, the dead shambler intrudes upon her dreams. It becomes her companion on odd adventures, scenes spliced from Jack’s cartoons and older neural clutter.\nThey journey across a brilliant white super-surface inhabited by naked nomads. They go to the beach, but remain inside a striped canvas bathing machine so as not to alarm the other swimmers. They visit a carnival where the carousel mounts are real horses, dead and impaled, their bloated tawny corpses tacked to the mirrored floor like insect specimens.\nMost of the dreams dissolve and leave no trace, punctured either by Jack’s cries in the night or by spears of sunlight in the morning, but she feels the shape of their absence as she goes about her day, puts her fingers in the small private perforations. She starts to follow the news more closely. She observes the waves and wakes of the xenovirus, how she did in the early days, before the terror sluiced away, and the inoculation wetware shipped.\nEmergency measures have tightened again, which means the border is shut and Benny can’t come back even if he wanted to. She stops responding to his messages and rejects two of his calls. The third she answers by muscle memory, distracted, and only remembers their relationship has imploded when his flushed-red face appears. His nose hairs are snowcapped with coke.\nHe demands to see Jack, seeming surprised he has not thought of it before, so Elisabeth mutes him and takes him to Jack’s bedroom and shows him Jack, who is sleeping with a plastic orange sippie-cup of water clutched in his hand like a talisman. She shows him, not sarcastically, the regular pattern of Jack’s breathing on the smartglass. The digital undulation is always comforting.\nTears start streaming down Benny’s cheeks. He ends the call without saying goodbye.\nJust as Benny can’t reenter the country, Will can’t exit it, but her brother doesn’t seem to mind. He orders materials—vat-grown vellum canvas, turpentine, brushes—from a specialty shop in Constantia, then tracks their progress for a long afternoon, eyes fixed to the map, one bony hand wringing the neck of his shirt. The flock of delivery drones arrives intact, having successfully skirted a bushfire and two riots.\nWill is not precious or secretive about his painting, which Elisabeth has come to believe might be its own sort of affectation, but she has been exposed to the process enough times that the slow layering of color and shadow no longer interests her much. She goes for days without glancing at his canvas, which he usually establishes in the back garden but sometimes packs away for a climb up Elsie’s Peak.\nShe has her own concerns: adjusting the grocery order to account for an additional adult, replacing the air filters in Jack’s bedroom, researching and cataloguing superior therapy options to the gratingly algorithmic modules she abandoned, disposing of any bath toys with internal spaces that might harbor stagnant water and dangerous bacteria, writing at least one sentence each day in order to anchor herself in time. She often finds herself transcribing the news.\n“There are more and more of them,” she says one night, singing her finger along the edge of her wine glass. “These anthrocide cults.”\nWill stares at her. His swollen pupils strike her as magnetic seeds, pushed by thumb into yielding soil. “It’s a way of resuming control,” he says, setting his vapor pipe down, “of an uncontrollable situation.”\n“It’s mass suicide,” she says. “If they would just wait a bit longer, for the market cycle to bring wetware costs down—things will normalize. You know? They always normalize.”\n“Sure, Eli,” Will says. “But some of these people, they’ve lost it all already. Their whole family’s wandered off into the ocean. They’re angry, and they’re desperate, and nobody knows, really, what it’s like to be a shambler—”\n“Looks awful,” she says. “The way they crawl and gasp.”\n“Only until they get to the sea.” Will repacks his pipe, hands soft and methodical. “When they dive, it’s quite fucking beautiful, actually. There’s a spot—” He peers at his work. “Oh. These cartridges, they slot the other way.”\n“A spot?” Elisabeth echoes.\nWill blinks. “Yeah,” he says, suddenly secretive. “Yeah, you know how I’ve been hiking a bit? Just up that little mountain?”\n“Elsie’s Peak.”\n“Yeah.” He chews his inner cheek. “Well, there’s this overhang, up near the lighthouse. Stretches right out over the sea. And yesterday, I saw something.”\n“Shamblers,” Elisabeth guesses, with her heart pittering, palpitating.\n“A pair of them. Yes.” Will sucks at his pipe. Coughs. “They dropped off the end, and when I got closer, I saw them down below. In the waves. Swimming a little circle around each other. Then they dove down, and I lost sight of them.”\n“You should tell someone,” Elisabeth says. “Get that spot flagged and blocked.”\nWill wiggles his jaw. “I don’t think I should,” he says. “In fact, I sort of wish that we’d leave well enough alone. Let them get to the water. Let them dive. Let them do whatever it is they do in peace. If they’re gone, they’re gone, right?”\nShe pictures the aquatic metropolis.\nJack wails.\nThursday arrives and Elisabeth goes to the beach instinctively, in the way of migratory birds. The streets along the strand are dead empty. Menacing nanocarbon jellyfish drift overhead, security drones recommissioned from guarding empty warehouses in order to patrol the waterline. She coaxes the pram out of the back of the car and places Jack inside, even though lately Jack prefers to walk whenever possible.\nThe man at the gate is not pleased to see them. “Recreational use of the beach is not recommended,” he says, eyes over her shoulder, “for purposes of safety.”\n“But it’s permitted,” Elisabeth says, icily, “as we are fully inoculated.”\nThe biofilter shows uncontaminated blue. The gate staggers open to let them through. There are only two other people on the sand: Alea Rose-Kellerman and Nils, their human nanny conspicuously absent. Elisabeth is full of regret, but the gate has already wheezed shut behind her. She guides the pram forward and gives a jaunty wave.\nAlea flowers a smile. “Hello, Liz,” she says. “Awfully crowded today.”\n“Nightmarish,” Elisabeth says back.\n“How’s baby Jack?” Alea asks.\nJack hears and wriggles upright in the pram. “Hello?”\nAlea laughs, claps her hands together in delight like some sort of seal. “Hello, Jack,” she says. “Come play with Nils! They’re building a mud castle.”\nElisabeth lifts Jack out of the pram and deposits him beside Nils, whose new swimming costume is made to look like a starfish. The two stare for a moment, then ignore each other, each of them retreating to their own privately contracted mud projects. Elisabeth attempts something similar by unfolding her reader and fussing with the screen settings.\n“So poor Benjamin is still stuck in Perth,” Alea says. “Shame.”\nHer heart gives an adrenal jolt and stammer because there is no way for the Kellerman-Roses to know whether Benny is back or not. Then she recognizes the incorrect city, and realizes what has happened.\n“I met your brother,” Alea says, unnecessarily. “We chatted for a moment. He’s actually quite grounded, for a creative, isn’t he?”\nWill is always fucking meeting people. He has already met a depressed fashion model, while picking up coffee from one of Main Road’s last surviving cafés, and a retired sommelier, while hiking up to the derelict lighthouse. Now he has met Alea Rose-Kellerman, too.\n“I thought he would have a more interesting perspective on the world,” Alea expounds. “Maybe it all goes into his work and none is left over.”\n“Very possible,” Elisabeth says. “Where is your nanny?”\nAlea’s perfect face crumples. “Oh,” she says. “Oh, oh.”\nElisabeth wants to say did you only just notice or immunomods seem to be getting pricier and pricier, don’t they, but then she sees a wet gleam in Alea’s eyes, nearly as incongruous there as it was in Benny’s.\n“She was visiting family in Cape Flats,” Alea says, “and was infected. I honestly don’t know how to feel.”\nIt seems obvious to Elisabeth—she has always known how she ought to feel, even when the feelings do not arrive—but she waits. Jack reaches over and cautiously smears mud across Nils’ chest. Nils is amenable. Alea collects herself.\n“It was voluntary,” she says. “She was one of that crowd who stole boats and went out to sea and infected themselves with syringes. Which I suppose is horrible.” She pauses. “Can you keep a secret, Liz?”\nFor a moment Elisabeth inhabits a malformed quantum branch where she is Liz, Alea’s drab but dependable friend whose silences are due to lack of material, whose limited social circle makes her an ideal confidante. It’s unnerving.\n“I can,” she says. “Yes.”\nAlea takes a trembly breath. “Sometimes I wish I could do that. That I could be a shambler.” She snuffs out a laugh. “Mad, isn’t it?”\nA tenuous filament stretches between them, connecting them for the very first time. Alea Rose-Kellerman has said the words that make the rounds so often inside Elisabeth’s skull. This feels momentous. It might trigger a montage of friendship, romance, even criminality.\n“I know you’re quite happy where you are,” Alea says, wiping at her eyes. “With the hubby and the baby and whatnot. Which is lovely, Liz. Lovely. But me, I’ve always wanted something—grander.”\nYou fucking cartoon, Elisabeth says in her head.\n“That is mad,” she says in the air, making her voice kind and mild. “Wanting to be a shambler. And you ought to seek help, Alea.”\nAlea nods sadly. Elisabeth feels exhausted on a cellular level.\nWill posits it to her, and she agrees to invite the retired sommelier over the following evening. He is sunbaked and silver-haired and wears a daring romper open-chested. His puppy has a brief discussion with the Rose-Kellermans’ dog, then falls silent, content to chew at his graceful hand. They are drinking ciders in the back garden—Will refused to select a wine, saying it could only be a trap—while Jack collects fallen figs.\nThe air is fresh and electric, and it seems impossible that the world is ending, but that is where the conversation invariably leads.\n“You see, this is not like the other plagues and pandemics,” says the ex-sommelier, in a faint Romanian accent. “This is their photo negative. Their chiral opposite.”\n“Well, it came by artificial meteor,” Will says, with a buttery smile. “That’s quite unique.”\n“It came with purpose,” their guest says. “In my opinion, it’s a gift.”\n“How do you figure?” Elisabeth asks, more bluntly than usual.\n“In my opinion,” the man repeats, “humanity has been offered a way to save itself.” This prompts her to verify, again, that the front gate’s biofilter reported him clean. “To save itself from itself,” he continues, stroking the small bones of his dog’s head, “and this time, the downtrodden lead the way.”\nWill gives an alarmed smile. “That’s quite the idea.”\n“First shall be last, last shall be first, et cetera.” Their guest places the dog in his lap. “We left the poor behind, over and over, but now they finally get to leave us behind.”\n“By becoming monstrous eldritch crayfish things,” Elisabeth says. “Such luck.”\n“By growing iridescent armor and returning to our primeval birthplace,” the ex-sommelier says. “They are safe in the ocean while the old world burns. Or they would be, if we stopped senselessly hunting them down.”\n“Agreed on that count,” Will says. “It’s barbaric. The containment programs are barbaric.”\nThe dog whines. The ex-sommelier nods. “And who’s to say, what is monstrous or not monstrous? We only see their exteriors.”\n“Nobody knows what it’s like to be a shambler,” Will choruses.\n“Or perhaps they do know,” their guest says. His wrinkled eyes twinkle. “Perhaps they do know, those scientists who chop the metamorphized to pieces and run electrodes though their limbs, and they are madly jealous. Why else would we try so hard to halt this exodus?”\n“It’s not an exodus,” Elisabeth says flatly. “It’s a virus.” She scoops Jack into her arms. “The people who turn shambler are dead. Their bodies just get repurposed.”\n“Impossible to know!” the ex-sommelier crows. “The shamblers do not communicate with the unchanged, but they have been seen to act in cooperation, to move in groups—”\n“It’s Jack’s bedtime,” Elisabeth interjects. “It was lovely to meet you.”\n“And equally lovely to meet you, Elisabeth,” their guest says, beaming. “Goodnight, little Jack.” He swigs from his cider and turns to Will. “So, this painting. You will show me?”\nElisabeth imagines the scenario in which she putters away, puts Jack down, reemerges an hour later to hear drunken giggling, to see a silver head leaning close to Will’s dark one. She feels no obligation to help her brother get his cock in. She dislikes the idea of them discussing shamblers without her, maybe discussing her without her.\n“He won’t,” she says. “I need his help with Jack, you see.” She gives the ex-sommelier an eyeless smile. “You can leave through the garden gate.”\nTheir guest looks affronted for only a moment, then looks sad and wise instead, burdened by his own enlightenment. “Of course,” he says, gathering the dog in his arms, but before he reaches the garden gate, he performs an elegant turn and speaks over his shoulder. “We should not fear the metamorphosis,” he says. “Best of luck in the new world.”\nHe departs, and Elisabeth waits for Will to apologize for befriending a lunatic and bringing him over for ciders. Instead, her brother stares at the fig tree and wipes the moisture from the bottom of his bottle with one bunch-sleeved fist.\n“He makes some good points,” Will says mildly. “There is a certain allure. The unearthliness of it, I suppose. The mystery.” He gledges at her. “There has to be, or there wouldn’t be so many voluntary infections. All these people pouring into the sea.”\n“Goodnight, Will,” Elisabeth says in monotone. “Love you.”\nBefore she begins her nightly joust with Jack, who is one day closer to death, she detours to her brother’s room. His canvas is on the bed, and when she flicks on the light, she is hardly surprised to see the silhouette of a shambler, painted in meaty reds and purples, emerging through moon-slashed waters. It’s so beautiful her traitorous throat aches.\nA spike in the infection rate, accompanied by a spike in violent unrest, returns them to a full lockdown. Benny’s bristling house becomes a fortress becomes a prison, and Elisabeth fears it will become an asylum next. Her dreams are more vivid than ever. Sometimes they arrive in daylight, dorsal fins rising from her subconscious, circling. Brief flashes of something razorous beneath.\nWill is acting strangely. He stalks all around the house, a gaunt tiger in a menagerie, and gnaws at childhood memories Elisabeth has already forgotten. It gets worse when he drinks, and he drinks often now.\n“The game with the box,” he says, with febrile eyes. “The game we played in the basement. You don’t remember? We called it the change-you box.”\nJack is asleep. They are in the kitchen again, with a chilled bottle of pinot grigio erupting from the tabletop between them, turned symbolic by the fact that Elisabeth has decided not to drink with him anymore. An impassable landmark.\n“There was a saucer we would take down there with us,” he says. “We would sneak it out of the china cabinet. It had blue anemones on it. We would drink water out of that, say it was potions, then go underneath the change-you box.”\nHer brother’s words trigger neural sheet lightning, and she sees it: they are children, playing on a cold concrete floor in an unfinished basement with plywood ribs for a ceiling and bare bulbs tugged to life by string. They take turns going underneath a big cardboard box, and sometimes Will wants the both of them to go under together, but she doesn’t want to do that.\n“Blue flowers,” she says. “Not anemones.”\nSomething is wrong with Jack. His temperature is not elevated; his oximeter readings are normal, but he is pale, tetchy, easily upset, and when he throws his fits, he refuses to be comforted. A dozen digital consults tell her it is too early for his condition to be rearing its head. They assure her, over and over, that this is only a blip and not the beginning of the end.\nToday, instead of wailing his distress into her shoulder and trying to burrow inside her chest, he staggers to the corner behind the modular couch and huddles there.\n“Come here, little bubba.” She wedges herself behind the couch with him, holding out her arms. “Come here, my love. Is you thirsty?”\nJack shakes his golden head.\n“Mumma munk?” Elisabeth suggests, even though it is the afternoon.\nJack is briefly conflicted but shakes his head again.\nIt hits her in the gut. She knows that Jack is likely sponging up all her fear, observing it in the subtleties of her body language, tasting it in her milk. She knows dwelling on that will only make her more anxious, birthing an unstoppable feedback loop, and the prospect of entering that loop also makes her anxious.\nThe whole thing is fucked, and it’s because she is weak. Unstable. She is the Bad Mother.\nUnless it’s something else.\nThe suspicion is so horrible and enormous that she can’t look at it directly. She has to feel her way around the barbed edges, replaying every interaction between Will and Jack, replaying the half-forgotten games in the basement. The possibility numbs her. Dizzies her. Then it flenses her open, a raw scarlet pain in every part of her.\nShe backs away from Jack, her hands and knees trembling in tandem. She tells the smartglass to pull up every instance of Will and Jack together without her. She watches without breathing. Slowly, slowly, with each innocent interaction that passes, her suspicion is exchanged for guilt. She has done another bad thing.\nBut then, two weeks ago, Jack toddles inside Will’s room. Her brother is holding something in a bag. He notices the intrusion, laughs. The chuckle comes crunchy with static. No telling mumma, he says, and puts the bag under his pillow. Elisabeth feels a jolt of fear, another of fury. She told Will her secret, but her brother is keeping one from her.\nShe goes to the guest room, carried along on a crackling wave. Will is painting in the garden, so she can search in peace for—what? For what? She flips his sweat-stained pillow, finds nothing. She tears open drawers and unrolls his stacked shirts. Then she sees it, nestled in the crack between bedpost and wall.\nThe bag is dark blue plastic. She unseals it and smells the pungent oily smell of a shambler dismembered.\nElisabeth detours to her room first, to the biolocked box. Then she slips Jack’s lime green FrogFones over his ears, gives him a cupful of animal crackers, and goes to the garden to confront her brother. It’s a gray day. Fog has wafted in off the sea and swallowed the sky. Will is using a solar lamp to simulate a bit of sunshine. His canvas is a beautiful tangle of blood-bright vermeil and deepest blue.\n“The bag behind your bed,” she says. “Why the fuck would you do that?”\nWill blinks. His cheeks flush. “We’re all fully inoculated.”\n“Is it the one from Cape Point?” she demands.\nHer brother nods.\n“So it’s been in the house for weeks.” She feels the rage in her throat like an acid. “Weeks. Why would you even think to—”\n“The pigments,” Will pleads. He gesticulates with his blue-dipped brush. “I wanted the pigments, for the painting, same way I used to crush up seashells. That’s all, Eli.”\n“No.” Elisabeth sets the biolocked box on the concrete, crouches in front of it. Her voice is trembling. “No, this is something else. You’re as crazy as the sommelier. You’re trying to infect yourself, trying to infect us—”\n“No!” Will yelps the word. “No, Eli, never, I don’t—”\n“Why was it a secret?” she demands.\nWill’s mouth twists, how their mother’s used to twist, and it makes her even angrier. “Didn’t want to worry you,” he says. “Didn’t want to add stress.”\nElisabeth lets the box taste her thumb. Its catches click open. “I booked you a place on Main Road,” she says. Her dry mouth seems to rasp against itself. “You have to leave. Take the bag with you. Do whatever you want with it, but not here.”\n“Eli, come on.” Will has finally caught her anger, fed his own furnace. He looms over her, brows knit, teeth bared. “I want to infect myself? That’s fucking ridiculous. Fucking ridiculous. You’re the one who wants to turn shambler.”\nElisabeth feels something serrated pierce her chest.\n“The way you keep bringing up that game,” Will rails. “That game we played in the basement. The change-you box. You think I don’t know what you’re getting at?”\n“Fuck you,” Elisabeth says, and for the first time she means it.\n“I don’t blame you,” Will says. “Nobody would blame you for wanting that, with Jack—” He stops when he sees the Shootist pointed at his face. His voice tremors. “Eli, what the fuck is that? Is that Benny’s?”\n“Go, Will.”\nHis eyes dart from the gun to the window, where Jack is directing a digital train. “Can I say goodbye to Jack?” he asks, and she can hear the tears coming, thickening his sinuses. The tears everybody gets but her.\n“Later,” she says. “You can call later. Right now, you leave.”\n“Okay,” Will says, hollow, still staring at the window. “Okay.” He starts packing the canvas away. “Love you, Eli.”\nThe response becomes a ghost on her tongue.\nWill is gone, and so is the bag, but the scent of the dead shambler lingers. She changes the guest room bedding and sets the nanny to scrubbing the wall where the bag was once wedged between plaster and post. Antiseptic foam spills onto the floor, reminds her of cresting waves. Jack thinks the same. He slashes his hands through it and crows we atta beach, mumma, until she distracts him with one of his shows.\nHe asks after his uncle for the first few days, how he used to ask after his dada, but then Will’s departure seems to slip from his mind. They return to their most common configuration: a binary sun, just the pair of them winging through the dark. She puts all her energy into being the Good Mother, into constructing the pointless, perfect environment for growth and learning.\nOutside, entire countries are disappearing. China has been a digital black hole for months, but now despots in other places are following suit—Hungary and Poland have amputated themselves from the net and militarized their borders. The poorest coastal nations have begun to buckle and collapse in the face of rising numbers, overrun ports.\nHere, the president’s soothing gravel-throated addresses have become a nightly farce. Disturbed supply lines empty the supermarkets. Load shedding becomes even more erratic; for three days Elisabeth uses the house generator only. She dreams about a shambler emerging from beneath a cardboard box in a dim-lit basement.\nJack is gnawing at her shoulder again.\n“No eating mumma,” Elisabeth says. She says it by reflex; she is almost happy to feel his teeth, to feel him cling to her. They are sitting in the living room, windows opaqued and displaying a field of rustling sunflowers. A cartoon is playing on the nanny’s belly screen. The world is calm. Intact.\nJack’s blue eyes are suddenly mischievous. “No eating car,” he says.\n“No eating helicopters,” Elisabeth says, singsong.\n“No eating airplane!” Jack yelps.\n“No eating boats.”\n“No eating . . . ” Jack blinks. “Chair.”\n“You’re just looking at objects in the living room, now,” Elisabeth says. “You little stink.”\n“No eating chair,” Jack insists.\nShe lifts his chubby wrist to her mouth. “Yes eating Jack,” she says, and when he squeals and gasps with laughter she feels how she felt post-hospital, the same warm fizzing oxytocin rush, the assurance that nothing else matters. His small body shakes against her, particularly his left arm. Even when he stops laughing, it spasms, flops.\nSomething is wrong. They watch as his tiny hand curls into a trembling hook. Jack looks up at her, only slightly alarmed. “Mumma fix,” he says, as if his rebelling limb is a malfunctioning toy.\nElisabeth stares. Her lungs are full of barbed wire.\n“Mumma, is you crying?” Jack asks, incredulous, delighted.\nIt’s the beginning of the end.\nSix hours speaking in circles to medical AIs earns her twelve minutes speaking to a haggard specialist in Brno, who tells her the same thing more bluntly: Jack’s symptoms have appeared earlier than anticipated, and the descent will likely be swift. Elisabeth thanks her and ends the call, then uses the smartglass to order a swing set in bright primary colors, identical to the one Jack loved so much at the seawall playground in Cape Town.\nShe orders a cavalcade of action dolls, dinosaurs, building bricks. She scrolls in a fugue state. Some things she suspects she has already purchased, already stepped on, but she orders them again to be certain. She no longer has any fear of instilling materialism in her baby. Her only goal is endorphins. Every day until the end will be a holiday.\nA warning message blinks across the glass. Due to the ongoing xenovirus crisis, delivery may be delayed. They offer no time estimate.\nShe has Jack’s crib scuttle from his room to hers, installing itself beside her bed. The new arrangement is too exciting; he refuses to lie down, instead stands clinging to the bars, peering at her through the gap. Elisabeth hovers on the other side, in case his grip suddenly fails, and he slips forward and thuds his forehead against the reclaimed sea wood. She has to keep discomfort to an absolute minimum. She has to subtract tears.\nWhen Jack succumbs to sleep, she sends a two-word message to Benny: it’s started. There is no reply or notification of receipt. There has been no activity on any of his feeds for a week now. It might be due to mass grid failures in Australia. It might be due to suicide—she remembers him telling her, once, how when he drives manually, he feels a strong urge to swerve into the oncoming.\nOr maybe he’s a shambler now, one of the shining mass who spilled off Sydney’s piers and vanished into the ocean. When they dive, Will says in her head, it’s quite fucking beautiful, actually. She has an unclassifiable thought, one that vacillates between the poles of Good Mother and Bad Mother. She’s had it before, but only briefly and only in the coldest water.\nShe sleeps poorly.\nThe next day it takes her a while to notice Jack’s legs have stopped working. He’s played with his crocodile all afternoon, sliding it along the floor, singing a jumbled version of some Korean cartoon’s opening theme, and even though Elisabeth has been watching him the entire time, she only now realizes why he is so content to sit, only now realizes he is scooting around propelled by just his arms.\nBad Mother, Bad Mother, Bad Mother.\n“Is it owie?” she asks, smearing the question with artificial cheer. “Is Jack’s legs owie?”\n“Is it owie?” Jack echoes, confused.\n“Your legs, bubba.” She touches his knee with a trembly finger. “Do they hurt?”\nJack looks down at them.\n“Dead,” he says, and she knows that he knows that word in reference to toys and tablets only, to things with lithium that need charging, but it still feels accusatory. She is halfway into the pantry, groping for a dusty bottle of cream liqueur, before she can stop herself.\nShe pours a full mug of it, drinks it in sickly sweet gulps. She looks at the message she sent to Benny, then forwards it to Will, because she has somehow constructed an existence in which she has nobody else to suffer with her. His call is immediate. He’s already crying.\n“I’m so fucking sorry, Eli,” he says. “So fucking sorry.”\n“It’s okay,” she says, nonsensically.\nJack’s blonde head turns. “Is it Unka Widdy?” he demands, and she realizes his pronunciation has improved again, because he is so smart, so verbal for his age. All the people he will never be hurtle through her, a rush of pale gray ghosts. She has to sit down, before the foaming dark at the edges of her vision does it for her.\n“I’m still in town,” Will says. “I never left. No flights and all the roads are blockaded anyway. Anything you need—I know that’s a fucking cliché, Eli, but anything you need. Anything.”\nIt feels like months ago, their midnight conversation in the garden. Elisabeth braces herself for the unclassifiable. “The sommelier,” she says. “Do you still have his contact information?”\n“Haven’t been hanging around with him, I swear,” Will says.\n“His contact information, though.”\n“Yes.”\n“And that spot that you told me about, up on Elsie’s Peak.” She breathes in, out, makes her lungs part of the mechanism of the gun that is her mouth. “I need you to send me the geopin.”\nFor a long time, Will is silent.\nThe government collapses that weekend. Elisabeth sees in her feed that suburbs are sealing themselves off, placing spikes on the road, attaching scopes to guns and guns to drones as they act out some atavistic fantasy. But the baying horde of thieves and looters never arrives, and they only manage to murder an old man searching for garden work at the end of the world.\nOn Monday, she decides to take Jack to all of his favorite places. She loads him into his car seat while his pram climbs into the boot. He does not play with the straps; today both his hands fold awkwardly into themselves, which makes him whine and whimper. The medical AI has assured her, over and over, that there is no pain, only numbing nerves.\nThey drive down the hill to Main Road and walk from there. The sidewalks are overgrown and pitted in places, but the pram is a rough beast and slouches easily along them, keeping Jack level in its cushioned embrace. The morning air is finally chill enough to redden Elisabeth’s fingertips. She makes sure the pram’s heating pad is on.\nThe town that was never quite hers is now nobody’s. The streets are dead empty. The storefronts are locked behind their metal grilles. She passes only shuttered windows, man-made eyelids squeezed tight to block out disaster. Occasionally a security drone drifts up, takes a bioscan, and assesses their inoculation, then drifts away.\nJack’s favorite smoke shop is closed, but its main draw was always the bright yellow door and signage. He sits higher in the pram when he spots it. Tries to point to it with an uncooperative finger. Elisabeth wishes the shop were open, so she could get stoned enough to remove her bones and put her prone on the couch, unable to think a single sad thought. She has not done that in nearly a year.\nBut now is not the time. She guides the pram around the bend, past a small mountain of rotting garbage that reminds her the service was disrupted two weeks prior.\nIt takes Jack only a minute to recognize their route. “Is it go a fire trucks, mumma?” he hollers.\n“Yes, little bubba,” she says. “We’re going to see the fire trucks. What color is a fire truck?”\nShe regrets asking that, because she recalls complaining drunkenly to Will about the way adults are always asking children the stupidest questions, which is likely why children grow up mistrusting adults. Now she is a hypocrite, and also has to think about Will, who is likely holed up in one of the automated apartments nearby.\nBy the time they reach the redbrick fire station, it’s a beautiful day. The sun has scoured the sky to a clear blue in all directions, not a wisp of cloud, and the breeze carries salt smells off the ocean. Elisabeth has not walked much lately. Her lungs feel good and tight. Her calf muscles smolder pleasantly. When they round the final corner, giving Jack a view of two fire-rescue vehicles hunkered in their charging stations, he howls.\n“Fire truck, mumma! I see it? I see it?”\nShe has the pram trundle as close as it can to the gate, so Jack can peer through into the yard. They are only there for a moment before a human security drone—security guard, rather—appears. He is the sort of man Benny used to work with, lined and grizzled but still hauling steroid-swollen muscle about under an overly tight shirt.\n“Ma’am, you shouldn’t be out, ma’am,” he says, with an Afrikaner accent. “What are you doing out? We put it on all the town feeds: best to stay indoors.”\n“We’re fully inoculated,” Elisabeth says, by rote.\n“Not for bullets. Man was shot yesterday, did you not see? It was on all the town feeds.”\n“Yes,” Elisabeth says. “The man who used to do the Rose-Kellermans’ garden was shot by a drone. It was tragic.” She points to Jack, who is staring at the stranger with slightly horrified eyes. “May we come inside and touch a fire truck?”\nThe guard squints. “That’s not as I heard it,” he says. “I heard he was sneaking about with a list of houses. List of names, too.”\n“This is Jack,” Elisabeth says. “Could he possibly touch that nearest fire truck?”\n“No,” the guard says. “Best go home straight away.”\n“Go fuck yourself,” Elisabeth says mildly.\nThe man makes a noise in his throat, somewhere between a laugh and a gasp. But he doesn’t rail at her, or threaten her, which is a shame, because the pram would drown his eyeballs in capsaicin at her request. He only goes back inside the station, shaking his grizzled head. Elisabeth lets Jack observe the fire trucks a while longer. They leave.\nThere are ways of disabling immunomods, and she researches them in the bath. She crawls from one thread to another to another, observes the digital war, now waged mostly by bots, between those who call the xenovirus humanity’s final chance at salvation and those who call it a fire-and-forget colonization method. Who say the anthrocidists are suffering an undetectable secondary infection that alters the brain, like parasite-infested mice with no fear of cat piss.\nExodus or extinction. Gift or weapon. Elisabeth suspects she knows which, but she is not here to add her voice to the algorithmic chorus. She trawls for specifics, for bootstrap methods of disbanding her virophage army. She is not the first. People from all corners of the collapsing net have sought the very same escape, likely from their own small tragedies, and she follows now in their footprints.\nShe briefly imagines Alea Rose-Kellerman, in a much larger tub in the house farther up the hill, mirroring her every motion, and wonders what she needs to escape. Maybe boredom. Maybe Nils. Maybe herself.\n“Wash you knees,” Jack suggests.\nHe is sitting on the heated tile beside the tub. She can’t deny him, not so close to the end, not when his little limbs might give out at any moment. He’s playing with a bright red fire truck that used to be his favorite. The fact feels disproportionately important now. She feels the need to recall everything about Jack, every habit and preference. He has only been briefly alive, so it shouldn’t be difficult.\n“Wash you knees, mumma,” Jack says again.\nElisabeth rubs at her kneecap, feeling the gooseflesh around the bone. “Wash, wash, wash,” she sings. “Wash, wash, wash.”\n“Good washing,” Jack decrees, in an uncanny imitation of the nanny’s synthetic lilt. “Good job.”\n“Thank you, Jack. I thought so, too.”\nJack returns to his toy. Elisabeth reaches forward and drains the bath a bit, listening to the gasp and gurgle of exorbitant water waste, then adds a shot of hot water. She stirs with her hand until it’s tepid throughout. Climbs out dripping.\n“Jack,” she says. “Do you want to come inna bath, bubba? With your fire truck?”\nHe is momentarily suspicious, but the novelty wins out. He lets her peel off his clothes, hold him fruitlessly over the toilet, carry him back to the tub. He gives a squealing giggle when she skims his feet through the water, holding him under the armpits. She sets him down carefully and clambers in after him.\n“Lots of animals live in the water, Jack,” she says. “Should we play pretend?”\nShe thought the tub was warm enough, but Jack is shivering, clenching his tiny teeth.\nElisabeth writes messages to the following people:\nHer father, who is dead. He once told her that there are only ever two moves that can be made, the strong move or the weak move, but they can look like each other and so all of life is spent deciphering which is which.\nHer mother, who is a lush, or more accurately an addict. Elisabeth excised her nearly a decade ago, but she sometimes appears in dreams. She and Will never did end up discussing her.\nBenny, who she did love, if symbolically, for several years.\nThree friends, one acquaintance, one aunt—the last splinters of a social circle, people who she once felt connected or indebted to.\nAlea Rose-Kellerman, who may have the pram for Nils if she wants it, though she will likely find it too militaristic in appearance.\nHer brother, who she will be seeing soon.\nThe beach is still shut when Thursday morning arrives, but there are other ways to the water. Elisabeth has not slept in days. She puts caffeine in her bloodstream at five past five in the morning, then wakes Jack. He is limp while she dresses him. His head wobbles slightly. She holds him in her lap and feeds him the sugary cereal normally reserved for weekends. Milk dribbles out of his grin and streaks his small chin.\nThey drive to the head of the trail, the serpentine path that leads up Elsie’s Peak, and Elisabeth slides Jack into the carrier, a little fabric cocoon that snugs to her chest. They start to climb. Jack narrates for her, babbling about the grasshoppers darting past, the windiness of the day. She’s glad his tongue and mouth still work.\nWhen they crest the first plateau the rocks turn to sand, the same pale gray sand they walk on by the beach. It seems incongruous up here, transplanted, but Elisabeth doesn’t know enough about the natural processes of erosion and mountain-forming to be certain. The wind is stark, roaring past her ears and rippling the red-and-yellow gorse that stubbles the stone.\n“Is it windy day, mumma,” Jack says, not a question.\n“Yes, my baby,” she says. “It’s a very blustery day.”\nShe follows the splintery wooden sign for the lighthouse ridge, sticking to the path for now. She tries to savor the crunch of its sand under her shoes, tries to savor everything: the warm weight of Jack’s body against her thudding rib cage, the slow pulse of the Atlantic down below.\nSunshine is finally fraying the clouds, tattooing her neck. She pauses to adjust Jack’s hat, a pointless and vestigial act, protecting skin that will not exist much longer. He barely protests, too taken with the novelty of their surroundings. The multicolor clumps of vegetation seethe in the wind, as if trying to free themselves from the mountainside. Stone formations rise up here and there like massive cairns or crenellations; she remembers Will drunkenly detailing a perilous climb to the top of one.\nShe verifies the geotag he sent her and leaves the path. She moves carefully, double-tapping each placement of foot to ensure no shifting stone unbalances her. The geotag leads her along a smaller ridge, concealed by the larger, with a view of the sea. She can see the division where disparate currents meet, deep blue bruising itself against sun-dappled turquoise. The waves move slowly from up here, a wrinkle that can never quite be smoothed.\n“Beach,” Jack announces, in response to the sight of the ocean.\n“Yes, my love,” Elisabeth says. “Today’s a beach day. Yes.”\nWill is waiting for them at the overhang. He wears a dark windbreaker and carries a duffel bag. She can see from his puffy red eyes that he’s been crying again. She twists, so Jack can see his uncle; he is baffled but delighted. He shouts his name into the wind. Elisabeth hates her brother so badly for that, for sectioning Jack’s affections in this final critical moment. She also loves him more than she ever has.\n“I know you’re sure,” Will says, when she’s close enough to hear him. “So I won’t ask.”\nHe takes a small black canister out of the duffel bag, attaches it to a medical injector. They kill their immunomods first, a microneedle kiss. Jack is accustomed to medical evaluations. He barely flinches. Then comes the second canister, identical, but Elisabeth pictures a miasma of beautiful reds and blues and purples inside it.\n“Remember the bath game, little bubba?” Elisabeth asks, even as her throat winches shut. “When we pretended to be shamblers? Mumma shambla, baby shambla?”\n“What?” Jack is distracted, fascinated by the injector. “What, mumma?”\n“We are going to have a nap,” she says. “We are going to have a mountain nap. While we are napping, we are going to turn into a mumma shambler and a baby shambler. And then we are going to dive down, down, down into the ocean.”\n“Oh!” Jack blinks. “We going inna ocean.”\n“It’ll take a few hours,” Will croaks. “I’ll stay for it. Of course. I’ll stay until you go over the edge. It stretches right out over the water, well-clear of the rocks, and all the ones I saw, they all made it, so—” He breaks off. “Oh, fuck. Oh, fuck, Eli.”\nElisabeth can’t explain it to her brother, can’t explain the carousel she’s been on for so long, up and then down, questioning her questioning of her questioning of herself. Maybe she is succumbing to a brain-altering secondary infection, and selfishly taking Jack with her. Maybe she is succumbing to a biological drive, and pointlessly sacrificing herself with her child.\nMaybe she is escaping the end of one world to join another.\n“Here,” Will says, handing her the injector.\n“Thanks.”\nShe can’t tell if she is being the Good Mother or the Bad Mother, the Good Person or the Bad Person. She has never been able to tell. Either way, it will all be over soon. She puts the injector to her arm, and then to Jack’s chubby leg.\n“Love you, Will,” she says. “Love you, Jack. Little bubba.”\n“You a little bubba,” Jack says, because lately the name annoys him.\nShe tastes salt on her lips that is not from the sea. She sits down on a flat sunbaked rock, still cradling Jack to her chest. She waits for the end of a world.\nTwo iridescent shapes topple off the stone outcropping, plummet through a shrieking wind, plunge into the belly of the Atlantic with twin plumes of white foam. The shamblers are of disparate size, one so small its flukes are barely visible, but both of them carve through the water with eerie grace, circling each other, angling upward, downward.\nSomething draws them outward, away from the fortified coastline. They skim beneath the waves, under the wary electric eyes of the drones, moving deeper and deeper as they go. It is impossible to know if they are driven by thought or by instinct, if neural pathways have been converted into alien language or discarded entirely.\nBut when they are far from any shore, the smaller hooks itself to the larger. They dive together, toward a city that might exist.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS."}