{"fingerprint": "HUSryn12VQss6viVbDmKhDHRwfQ=", "sitename": "Clarkesworld Magazine", "title": "The Art of Brutal Prose: An Interview with Mark Lawrence by Peter Hodges", "author": "Peter Hodges", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lawrence_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Art of Brutal Prose: An Interview with Mark Lawrence by Peter Hodges", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nThe Art of Brutal Prose: An Interview with Mark Lawrence\nMark Lawrence is the author of the recent fantasy series The Broken Empire. There are two books in the series to date: Prince of Thorns and King of Thorns. Written in the same literary vein as Joe Abercrombie and George R. R. Martin, the story is a bleak portrayal of Prince Honorious Jorg Ancrath, scion of a noble family who has vowed to once again unite a group of disparate kingdoms into an Empire.\nThe prose is like a punch in the gut—visceral, simple, and evocative. He eschews the traditional wordiness of fantasists before him, instead letting the simple language convey harsh reality without mincing words. This style lends itself to fast pacing that draws the reader headlong through a world of brutality and evil, where goodness is a flickering shadow in the light of ambition and revenge. The construction of the story’s history has a number of truly excellent surprises, especially as the reader gradually comes to grasp the setting and the underlying rules of the universe.\nAs a scientist involved in researching artificial intelligence problems, what made you choose a fantasy setting over a science-fictional setting?\nI have to say I don’t really get it. Should a policeman write crime fiction, a lawyer pen about law firm shenanigans, a nurse put out medical dramas? Should we boffins get our dirty science boots off your fantasy carpet? I guess the easiest answer is that my love of fantasy pre-dates my love of science—my mother read me Lord of the Rings when I was seven—I cried when [spoiler] Gandalf died [/spoiler].\nWriting is more about people than setting in any event. I’m sure I could write science fiction and I’d probably enjoy it a lot. I just feel that I enjoy writing fantasy that little bit more.\nDoes working on problems related to artificial intelligence give you any insight into the nature and/or definition of consciousness? Have you had any (declassified) “aha!” moments, where you linked something in your research to human or animal cognition?\nShort answer, “no.”\nArtificial Intelligence is a fairly misleading umbrella term that I employ because the media popularised it and people feel they know what it means . . . a little. In truth very few scientists involved in the area will ever talk about their work in those terms. What we do is (as far as we know) a long way from issues of consciousness and revolves around rather dry and abstract Bayesian mathematics aimed at calculating inference from data in order to support decisions. Under controlled conditions these techniques are powerful and useful, but there’s a huge disconnect between those controlled conditions and the general messiness of the real world where only the tiniest of steps have been taken toward intelligent autonomous behaviour.\nWhat was your “elevator pitch” for A Prince of Thorns? Did you sell the manuscript first, or did it go through an agency?\nI don’t think I had an elevator pitch. When I finally got “bullied” into sending it out, years after writing it, I emailed four agents off a list. I noticed later that the agency that accepted me had on their submissions page instructions to include in the cover letter a paragraph describing the book. I must have missed that bit first time around. I just said, something along the lines of “hi, I’ve attached the first three chapters of my book” and mentioned a few places I’d had short stories published.\nThe agent passed the manuscript on to publishers. He told me not to expect to hear back any time soon. Then a few weeks later I had a three-book deal. I’m told every significant fantasy publisher in the UK bid for the rights.\nMany authors claim their “overnight success” was actually a journey of many years. Would you share your story on how you came to be published?\nWell I guess it was a journey of a kind, and did span many years, but it was never one that was aimed at publication. The only journey was the one on which I slowly acquired the writing skills and the interest to produce a book. I wrote for my own satisfaction and didn’t expect (or yearn) to be published.\nI started playing D&D very young when the UK’s first Games Workshop opened outside my school. I was always the Games Master, which exercised my creative side and entrenched an interest in fantasy. After university I spent a year helping to run a fantasy Play-By-Mail game and kept running my part as a hobby for the next decade. That exercised my writing skills more, requiring multiple storylines to be sustained and lots of description, intrigue, violence etc. When I moved to the States I didn’t have time to run the PBM game so I turned to writing short stories. I shared the short stories on online writing groups and improved through the process of critiquing and being critiqued. Short stories turned into longer stories turned into books. There.\nIn the reviews of your novels, some readers have expressed scepticism over the ability of such a young main character (Jorg Ancrath is barely a teenager when the action starts) to carry the narrative. What made you pick that background for the character?\nI have seen people complain that a person so young couldn’t achieve the physical feats described or exert such influence over his companions. That I dismiss.\nThe reasons for the choice of age are simple and several-fold. Firstly the inspiration for the book was Burgess’ A Clockwork Orange wherein the violent protagonist is of a similar age leading a gang of older reprobates. Secondly, and for quite possibly similar reasons to Burgess, I chose a young age to:\n- cloud the issue of guilt in his crimes.\n- highlight the matter of nature vs nurture\n- place the protagonist close to the events that have shaped him.\n- give him potential for growth.\n- explore the changes that are wrought in us through experience in contrast to those that occur through simply growing.\n- and to focus on the business of moving from childhood to adulthood even when the former has been stolen rather than discarded.\nIt’s interesting that you say “cloud the issue of guilt” in his crimes. I don’t think it’s a spoiler to say that Jorg does some pretty horrible things—is it up to the reader to decide his guilt? Is there room in his world for redemption, however far away it might seem?\nRedemption is the central theme to a vast swath of literature. Particularly in genre writing, but probably forming the core, in one or other form, in the majority of all fiction. It does seem a rather unsophisticated demand to make of a character study though, and the Broken Empire trilogy is in essence a study of one man.\nPrince of Thorns is a book that sets out to challenge the reader with a character—to make you think about a real (albeit unusual) person and about the issues of what makes us “bad.” It’s about what is and isn’t forgivable, what role nurture plays over nature, how we react when the badness is done by someone clever, intelligent, charming rather than a villain who has the good grace to look and act as expectation demands. And it doesn’t answer those questions. The trilogy as a whole stumbles toward an answer, but it won’t ever get there. It’s what we scientists call ‘an unsolved problem.”\nAnd yes, there’s a voice clamoring inside us, demanding redemption. Some part of us wants to see normality restored. Jorg can be forgiven anything so long as he repents, suffers, returns to the fold. It’s what we like to read. It’s the closure we’re comfortable with.\nThere is of course room for any ending and I’m ruling nothing out. However, I do like to avoid being too predictable!\nBoth novels in your series are written from a first person point of view, with some portions excerpted from the journal of another character. This, historically, is a challenging choice for fantasy authors because your accessibility to the world is severely limited. What made you pick this method? Do you have any regrets at this point? Is there something that you’ve wanted to show that you can’t?\nI don’t feel it’s a challenging point of view—even for fantasy authors. Your access to the world is personal, detailed, emotional, and immediate. The type of access denied is the swooping overview generated by hopping between many heads. If you’re telling a story about a person rather than some sprawling conflict then that’s no problem. I’m telling a story about one person—something closer in several ways to literary fiction than traditional fantasy.\nIt also has to be said that A Clockwork Orange is written in the first person and as my initial inspiration, setting finger to keyboard, I hit ‘I’.\nIs the lean prose your own personal style, or a style you’re intentionally using to reflect the world?\nI can write in various styles. Possibly I enjoy the one on offer in Prince of Thorns the most. I guess it reflects the character, Jorg, rather than the world he inhabits. I do know I’ve seen people who one or five-star Prince of Thorns, lambasting or lauding the prose, go on unknowingly to five or one-star things I’ve written under other names in different styles, reversing their opinion.\nI recently gave a bunch of short stories to an anthology that invited my participation so they could choose something suitable. The immediate feedback was that they liked them all but found them so varied in style and topic that they were amazed to know they were all written by the same person.\nI expect this is true of many writers and there’s a tendency and a will to pigeon-hole people for convenience. If a writer has the imagination to write fantasy it seems likely they have the imagination to vary the way they write. The publishing industry is a co-conspirator in this matter, insisting (for good commercial reasons) that an author produce ‘more of the same” and doing so for the simple reason that the majority of readers (whether they admit it or not) want to get more of the same from any given author. If they want something different they reach for a different author (or different pseudonym!).\nHas the sheer brutality in some parts of the book earned you any angry readers? Do you have any anecdotes about readers who either really like or really dislike a particular passage?\nI have more angry readers than a man can easily shake a stick at. I suspect a lot of the visceral reaction is generated by the peculiar power of “I” which makes the reading experience more immediate and intense. It also engenders in stupid people a close association between the character they’re reading about and the person who wrote him.\nTo my mind the violence in the trilogy is moderate to mild in the context of the genre. Certainly there are far more gruesome and unpleasant offerings in George R. R. Martin’s work. I feel it’s a combination of first person and the power of the descriptions that has prompted a reaction.\nProperly, brutality is measured against the facts. Peter stabbed Paul. The brutality is in the act of stabbing. If the information is conveyed in the line: Peter stabbed Paul—or in the line: I slid my knife into Paul’s eye socket—it’s no more brutal.\nMuch of the anger has actually been second hand from people who haven’t read the book and are simply piggy-backing off some extreme and misdirected feminist critiques in circulation.\nThere is, however, one scene in King of Thorns, that gets remarked on a lot. It’s an oddity that says interesting things about people’s perceptions and priorities. By the point that this scene is reached the reader will have breezed through multiple violent deaths of innocent and not so innocent men, women, and children. Here comes a dog . . . In fact the scene has generated my only piece of hate-mail.\nI really think you are one sick disturbed person. <snip> That sentence is seared into my brain and has given me nightmares. It might be fiction but it is just horrible. There is no excuse for this sort of thing. The torture of an innocent animal. <snip> I will never ever read another book by you as long as I live. I don’t know where all this darkness comes from with you but you are quite obviously disturbed. I don’t care if you are with 10 kids and 5 dogs. Sick sick sick . . .\nI consider it a minor triumph to have stirred such strong emotions within a reader. Particularly “That sentence is seared into my brain.” For someone who focuses as much on writing on the small scale, sentence by sentence, as on the large scale / story-level, “that sentence is seared into my brain” is writing gold.\nA more general observation is that people who condemn others for the products of their imagination simply don’t understand what imagination is.\nAs you begin to reveal the history of the world, you get glimpses of how history and fact become mythology. How do you go about weaving a consistent mythology through a multi-book series?\nI tend to wince slightly when admitting that I didn’t outline anything. I don’t plan. I just let the story flow as I write and generally have no idea where we’ll be at the bottom of the page. I’ve not noticed any problems keeping things consistent.\nYour magic system is revealed through the evaluations and reactions of Jorg Ancrath. How difficult is it to walk the tightrope between an “unreliable” narrator and maintaining internal consistency in your magic systems? Is internal consistency even necessary as long as magic and its use is kept to a minimum?\nI really don’t like the term “magic system” and if I ever pick up a book that starts explaining a magic system to me, as though I’m being instructed from the pages of a role-playing game’s rulebook, I put that book down again very quickly.\nI wouldn’t say minimal use of magic makes internal consistency unnecessary, just that it makes it easy. Consistency is important. Magic-systems are not.\nYou’re a father of four, a full-time researcher, and a gamer. Do you have any secrets about time management that you’d like to share?\nActually you’ve not listed the main draw on my time. I’m also a full-time carer for my very disabled little girl. When she comes home from school I hold her and feed/clean/entertain her until I’ve put her to bed at around 9 or 10pm. She can’t be left, she can’t do anything for herself, and my wife’s multiple sclerosis means I have to do it all. I only get to write between 10pm and 1am, or when a respite carer comes to the house for a three-hour session. I’m answering this review at the hospice we get to visit fourteen days a year. We’ve been here two days now and I’ve done a LOT of writing.\nSo, time management is tricky. Not sleeping does help. Also writing only once and not revising is a boon.\nWhen is your release date for the next book?\nThe release date for the last book in the trilogy is definite. Emperor of Thorns comes out in August 2013 and is available from Amazon.\nPeter Hodges has always loved science. When he discovered that people would actually pay him to mix chemicals and set things on fire, his career was set. Working as a chemist and project manager, Peter dabbled in writing throughout his early adult life. His desire quickened after attending Viable Paradise, an annual invitation-only writer's seminar. He finished three novels over the next four years and endured the slings and arrows of outrageous rejection."}