{"fingerprint": "MSKTymRlemZwbFFIV5k2oS4Uc1M=", "sitename": "Clarkesworld Magazine", "title": "Sapir-Whorf Must Die by Anaea Lay", "author": "Anaea Lay", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lay_11_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sapir-Whorf Must Die by Anaea Lay", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nSapir-Whorf Must Die\nWhat do telekinesis, brain hacking, and large scale cultural transformation have in common? The Sapir-Whorf hypothesis. Speculative fiction is full of stories that explore the potential of language to enhance, change, or control its speakers; to the point where the genre has a set of recurring tropes that are self-perpetuating long after current research has debunked and discredited the ideas that spawned them.\nModern discussions of the Sapir-Whorf hypothesis distinguish between the “strong” and “weak” versions. The original formulation, the “strong” version, posits that language controls thought. In a somewhat ironic quirk of history the Sapir-Whorf hypothesis is a bit of a misnomer—Whorf was Sapir’s student, but they never wrote a paper together and the theory bearing their name is based almost entirely on work done by Whorf alone. In fact, Sapir was skeptical of many of Whorf’s ideas. Nevertheless, the coinage stuck, and the idea entered the speculative canon where it took on a life of its own. The strong version of the hypothesis was later thoroughly debunked. Instead the idea that language influences thought, the “weak” version of the Sapir-Whorf hypothesis, enjoys a wealth of experimental support.\nIn the Beginning\nThe foundations for the school of linguistic relativity, which supported the early “strong” version of the Sapir-Whorf hypothesis, came from Whorf’s research on Hopi. The popular belief that the Hopi people have no concept of time dates to Whorf’s papers on the subject. Later research, particularly work by Malotki, refute Whorf’s assessment of Hopi.\nSyntax in native American languages is very different from the Indo-European languages with which Whorf and his contemporaries were familiar. This led their research to find “missing” elements that were present, but encoded differently.\nNevertheless, speculative fiction picked up Whorf’s early ideas and explored their implications. Jack Vance’s The Languages of Pao, originally published in 1954, takes a comparatively conservative approach. In his novel the people of Pao are passive and recalcitrant to the point where they won’t form an army to defend themselves even when conquerors from another planet are extracting expensive tribute from them.\nTo solve the problem, Palafax creates a new caste system for Pao. Each caste has a particular function in his new culture, and is tailored to cultivate the traits and functions needed for serving those functions. This not only works, but creates divides in the culture so deep that a special translator caste is required as a go-between. These tropes of controlling culture and perception through language are widespread in the genre, appearing everywhere from George Orwell’s 1984 (published five years before Vance’s novel) to Margaret Atwood’s Oryx and Crake.\nRobert Heinlein’s Stranger in a Strange Land explored several potential implications of the strong Sapir-Whorf hypothesis and spawned several of science fiction’s tropes around language. The most fantastic of these are the idea that learning Martian would unlock super powers ranging from telekinesis to instantly shifting objects, including obnoxious people, out of reality. But it also succinctly presents a concept that pervades later literature, as well as the popular understanding of how language and thought interact. Dr. Mahmoud, a Semantician, explains to the other characters that; “A verbalizing race has words for every concept and creates new ones or new definitions whenever a new concept evolves. A nervous system able to verbalize cannot avoid verbalizing.” (Stranger in a Strange Land, p223). The idea that the absence of a concept in a language is a sign of the absence of that concept for the people speaking it is a direct implication of the strong Sapir-Whorf hypothesis.\nMost famous of the speculative classics to examine the implications of the strong version of the Sapir-Whorf hypothesis is Samuel Delany’s 1966 novel, Babel-17. The novel’s protagonist, Rydra Wong, is functionally a Sapir-Whorf super hero. She cycles through the analytical powers contained in different languages effortlessly, and is the one person in the novel’s distant future setting capable of figuring out that the unbreakable code used by enemy saboteurs (the eponymous Babel-17) is actually a constructed language.\nBabel-17 is an analytically dense language which confers technical mastery on its speakers because of the way it encodes information. It also lacks any concept of “I” which leads to the trope most commonly repeated from the novel: brain hacking. Even as Rydra is hot on the trail of saboteurs who are causing problems for her side in the war, her exposure to Babel-17 has caused a psychological schism so dramatic that she unconsciously sabotages her own mission.\nThe brain hacking trope famously appeared again in Neil Stephenson’s Snow Crash, where computer hackers are specifically vulnerable to a linguistically transmitted “virus” and turned into computational zombies. While the trope was well established in the genre by 1992, the year it was published, the research that introduced the trope had been thoroughly discredited.\nCrumbling Foundations\nDefeat for the idea that perception and thought are controlled by language came in 1970 in the form of a feral child code named “Genie” by the researchers who worked with her. When she was found by authorities, Genie was thirteen years old and had been so isolated by her parents that she’d never learned any language. Even after years of work with therapists, Genie didn’t achieve fluency in language, though she did learn enough to be able to communicate effectively. As tempting as it is to draw conclusions about human limitations in post-pubescent language learning from Genie’s case, given the confounding factors of her early abuse and isolation, as well as the impossibility of knowing whether she might have had a congenital language deficit, such efforts are sketchy speculation at best.\nHowever, those same limitations strengthen conclusions based on what she could do. Genie not only had memories from before she was found by authorities, but after learning language she could talk about them and describe thoughts and feelings she had during that time. This would be impossible if language actually controlled thought.\nWell before other linguists did the research and analysis to argue with Whorf’s conclusions about Hopi, Berlin and Kay put the idea that the absence of a concept from a language implied the absence of that concept from the people speaking it to an experimental test.\nThey chose color perception because documented languages have a wide range of available terms for color, ranging from just two up to eleven. Then they created a board with chips of different colors evenly spaced across the spectrum. If the strong Sapir-Whorf implication so cogently popularized by Heinlein’s Martian linguist were true, then speakers of languages with only two terms for color should perceive the board differently from speakers of languages with a wider variety of color terms.\nThat’s not what they found. Instead, across nearly twenty languages, speakers classified the colors consistently. Additional investigation revealed that there was a robust pattern across the languages for which colors would have an explicit term based on how many terms exist in the language. They even found a strong correlation between how many terms for color a language contained and the industrialization of the area where the language was spoken.\nIn other words, rather than finding that language controlled thought and perception, they found that culture was driving language, the opposite of the strong Sapir-Whorf conclusion.\nIf you look closely, the problems with the strong Sapir-Whorf hypothesis show through even in Babel-17.\nWhile Rydra commands astonishing analytic super powers through her mastery of a variety of languages, she manages to explain her solutions to the people around her (and the reader) by using their common language. And she solves the psychological schism created by exposure to the language with no concept of “I” by introducing the concept. She calls her new creation Babel-18, versioning the original like a computer language, but what she’s actually done is force the constructed language to behave like all other human languages by changing to meet the needs of its speakers.\nThe Weak, the Robust\nWhile the strong version of the Sapir-Whorf hypothesis is fairly conclusively wrong, there is still plenty of room to explore the relationship between language, perception and thought.\nModern academia generally accepts the weak version of the hypothesis, the idea that language influences thought. This is obvious to anybody who has ever heard a radio commercial for French fries and consequently changed their lunch plans, but there’s a wealth of experimental evidence to be found from investigations into priming and framing.\nPriming is the phenomenon where exposure to a concept renders the subject likelier to return to the concept at a later time. For example, show a test subject a list of fifty multi-syllabic words. Then, several hours later, ask them to give you a word that begins with a syllable that is the first syllable of one of the words on the list. The test subject is highly likely to reply with the word from the list, even if they don’t consciously remember having seen it. Language the test subject was exposed to earlier has influenced their later response without the test subject’s awareness of the influence. (This also explains why sudden cravings for French fries are sometimes inexplicable.)\nFraming is a phenomenon known in everyday life as “tact” or “spin-doctoring.” It’s the idea that how a situation is presented will change the audience’s perception of the situation. Like priming, framing has a wealth of experimental data to support its existence. Framing experiments work like this:\nTwo groups of subjects are presented with a scenario where one thousand people are infected with a disease. The first group is given a choice between Treatment A, which will save three hundred people, or treatment B which has a 25% chance of saving all one thousand people and a 75% chance of saving nobody. The second group is given a choice between treatment A, which will allow seven hundred people to die, or treatment B which, again, has a 25% chance of saving all one thousand people and a 75% chance of saving nobody. Both groups have been given the exact same choice, but the first group has been presented with the positive frame while the second group has been given the negative frame. The first group is much more likely to choose treatment A, while the second group is much more likely to choose treatment B. The way language was used to present the situation changed how the subjects in either group evaluated the decision. Palafax of the Breakness Institute would be thrilled.\nThe Evolving Trope\nWhile Snow Crash his hardly the only example of speculative work that engages with the genre tropes around language without updating them in light of modern research and understanding, there’s a wealth of work which does better. The answer to Vance’s devastating cultural division in The Languages of Pao comes exactly twenty years later in Ursula LeGuin’s The Dispossessed.\nMuch like Palafax’s plot, the Utopian society of Anarres creates its own language as part of its self-isolation from the society of Urras. But where the linguistic isolation becomes absolute and controlling in Vance’s novel, LeGuin’s spends a great deal of time exploring the ways in which the intended isolation fails, from a direct carryover of vocabulary such as “damn” and “hell” even though the new society doesn’t have the concepts to which these words literally refer, to the way their informal social institutions wind up accidentally mimicking the structures of the society they’ve abandoned.\nStranger in a Strange Land’s thesis about verbalizing species and concepts gets put to good work in C. J. Cherryh’s 1994 Foreigner. The alien Atevi don’t have words in their language for concepts like trust, friend, or love because they genuinely lack the concepts.\nBren, the human protagonist of the novel, struggles at length to communicate these concepts within the limits of the Atevi language by doing everything from positing hypothetical situations and pointing out the differences in predicted human and Atevi responses, to using Atevi words for concepts that are analogous in human languages. Bren’s failure with the later tactic serves both as a fantastic illustration of how alien the Atevi are, and the differences between what you see when a concept is absent from language because the speakers have never gotten around to talking about it with each other, versus when it’s absent because the speakers genuinely don’t have it.\nChina Mieville’s, Embassytown from 2011 delivers a similar treatment to the brain-hacking trope. There we are once again presented with aliens who are cognitively different from humans in a way that affects their language, the Ariekei. Unlike the humans or other sentient species in the novel, the Ariekei do operate in accordance with the strong version of the Sapir-Whorf hypothesis.\nMieville introduces this concept and then promptly allows the book to question whether the Ariekei are properly sentient. Embassytown’s treatment of the brain-hacking trope doesn’t rely on the flawed brain-as-computer analogy, providing instead a compelling exploration of how lies interact with a language that is, functionally, thought for its speakers.\nSo Here We Are\nThe strong version of the Sapir-Whorf hypothesis which enjoyed so much popularity in classic speculative fiction is wrong. However, that doesn’t mean modern fiction must choose between using the tropes created by those early works and keeping in touch with modern research and understanding of language. The dialog between fiction, science, and genre history is ongoing, and there remains a wealth of ideas to be explored and examined. As our understanding of language and the human mind matures, the frontiers for our speculation will only grow more fascinating.\nAnaea Lay lives in Madison, Wisconsin where she sells Real Estate under a different name, writes, cooks, plays board games, spoils her cat, runs the Strange Horizons podcast, and plots to take over the world. Her fiction has appeared in a variety of venues including Apex, Lightspeed, Daily Science Fiction and Nightmare."}