{"fingerprint": "Z3tndWHwcuY7gY7SaZTNq2DmCj0=", "sitename": "Clarkesworld Magazine", "title": "Mountain Ways by Ursula K. Le Guin", "author": "Ursula K Le Guin", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/le_guin_03_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mountain Ways by Ursula K. Le Guin", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9520 words, novelette, REPRINT\n Mountain Ways\n Note for readers unfamiliar with the planet O:\n Ki’O society is divided into two halves or moieties, called (for ancient religious reasons) the Morning and the Evening. You belong to your mother’s moiety, and you can’t have sex with anybody of your moiety.\n Marriage on O is a foursome, the sedoretu—a man and a woman from the Morning moiety and a man and a woman from the Evening moiety. You’re expected to have sex with both your spouses of the other moiety, and not to have sex with your spouse of your own moiety. So each sedoretu has two expected heterosexual relationships, two expected homosexual relationships, and two forbidden heterosexual relationships.\n The expected relationships within each sedoretu are:\n The Morning woman and the Evening man (the “Morning marriage”)\n The Evening woman and the Morning man (the “Evening marriage”)\n The Morning woman and the Evening woman (the “Day marriage”)\n The Morning man and the Evening man (the “Night marriage”)\n The forbidden relationships are between the Morning woman and the Morning man, and between the Evening woman and the Evening man, and they aren’t called anything, except sacrilege.\n It’s just as complicated as it sounds, but aren’t most marriages?\n In the stony uplands of the Deka Mountains the farmholds are few and far between. Farmers scrape a living out of that cold earth, planting on sheltered slopes facing south, combing the yama for fleece, carding and spinning and weaving the prime wool, selling pelts to the carpet-factories. The mountain yama, called ariu, are a small wiry breed; they run wild, without shelter, and are not fenced in, since they never cross the invisible, immemorial boundaries of the herd territory. Each farmhold is in fact a herd territory. The animals are the true farmholders. Tolerant and aloof, they allow the farmers to comb out their thick fleeces, to assist them in difficult births, and to skin them when they die. The farmers are dependent on the ariu; the ariu are not dependent on the farmers. The question of ownership is moot. At Danro Farmhold they don’t say, “We have nine hundred ariu,” they say, “The herd has nine hundred.”\n Danro is the farthest farm of Oro Village in the High Watershed of the Mane River on Oniasu on O. The people up there in the mountains are civilised but not very civilised. Like most ki’O they pride themselves on doing things the way they’ve always been done, but in fact they are a wilful, stubborn lot who change the rules to suit themselves and then say the people “down there” don’t know the rules, don’t honor the old ways, the true ki’O ways, the mountain ways.\n Some years ago, the First Sedoretu of Danro was broken by a landslide up on the Farren that killed the Morning woman and her husband. The widowed Evening couple, who had both married in from other farmholds, fell into a habit of mourning and grew old early, letting the daughter of the Morning manage the farm and all its business.\n Her name was Shahes. At thirty, she was a straight-backed, strong, short woman with rough red cheeks, a mountaineer’s long stride, and a mountaineer’s deep lungs. She could walk down the road to the village center in deep snow with a sixty-pound pack of pelts on her back, sell the pelts, pay her taxes and visit a bit at the village hearth, and stride back up the steep zigzags to be home before nightfall, forty kilometers round trip and six hundred meters of altitude each way. If she or anyone else at Danro wanted to see a new face they had to go down the mountain to other farms or to the village center. There was nothing to bring anybody up the hard road to Danro. Shahes seldom hired help, and the family wasn’t sociable. Their hospitality, like their road, had grown stony through lack of use.\n But a traveling scholar from the lowlands who came up the Mane all the way to Oro was not daunted by another near-vertical stretch of ruts and rubble. Having visited the other farms, the scholar climbed on around the Farren from Ked’din and up to Danro, and there made the honorable and traditional offer: to share worship at the house shrine, to lead conversation about the Discussions, to instruct the children of the farmhold in spiritual matters, for as long as the farmers wished to lodge and keep her.\n This scholar was an Evening woman, over forty, tall and long-limbed, with cropped dark-brown hair as fine and curly as a yama’s. She was quite fearless, expected nothing in the way of luxury or even comfort, and had no small talk at all. She was not one of the subtle and eloquent expounders of the great Centers. She was a farm woman who had gone to school. She read and talked about the Discussions in a plain way that suited her hearers, sang the offerings and the praise songs to the oldest tunes, and gave brief, undemanding lessons to Danro’s one child, a ten-year-old Morning half-nephew. Otherwise she was as silent as her hosts, and as hardworking. They were up at dawn; she was up before dawn to sit in meditation. She studied her few books and wrote for an hour or two after that. The rest of the day she worked alongside the farm people at whatever job they gave her.\n It was fleecing season, midsummer, and the people were all out every day, all over the vast mountain territory of the herd, following the scattered groups, combing the animals when they lay down to chew the cud.\n The old ariu knew and liked the combing. They lay with their legs folded under them or stood still for it, leaning into the comb-strokes a little, sometimes making a small, shivering whisper-cough of enjoyment. The yearlings, whose fleece was the finest and brought the best price raw or woven, were ticklish and frisky; they sidled, bit, and bolted. Fleecing yearlings called for a profound and resolute patience. To this the young ariu would at last respond, growing quiet and even drowsing as the long, fine teeth of the comb bit in and stroked through, over and over again, in the rhythm of the comber’s soft monotonous tune, “Hunna, hunna, na, na . . . . ”\n The traveling scholar, whose religious name was Enno, showed such a knack for handling new-born eriu that Shahes took her out to try her hand at fleecing yearlings. Enno proved to be as good with them as with the infants, and soon she and Shahes, the best fine-fleecer of Oro, were working daily side by side. After her meditation and reading, Enno would come out and find Shahes on the great slopes where the yearlings still ran with their dams and the new-borns. Together the two women could fill a forty-pound sack a day with the airy, silky, milk-colored clouds of combings. Often they would pick out a pair of twins, of which there had been an unusual number this mild year. If Shahes led out one twin the other would follow it, as yama twins will do all their lives; and so the women could work side by side in a silent, absorbed companionship. They talked only to the animals. “Move your fool leg,” Shahes would say to the yearling she was combing, as it gazed at her with its great, dark, dreaming eyes. Enno would murmur “Hunna, hunna, hunna, na,” or hum a fragment of an Offering, to soothe her beast when it shook its disdainful, elegant head and showed its teeth at her for tickling its belly. Then for half an hour nothing but the crisp whisper of the combs, the flutter of the unceasing wind over stones, the soft bleat of a calf, the faint rhythmical sound of the nearby beasts biting the thin, dry grass. Always one old female stood watch, the alert head poised on the long neck, the large eyes watching up and down the vast, tilted planes of the mountain from the river miles below to the hanging glaciers miles above. Far peaks of stone and snow stood distinct against the dark-blue, sun-filled sky, blurred off into cloud and blowing mists, then shone out again across the gulfs of air.\n Enno took up the big clot of milky fleece she had combed, and Shahes held open the long, loose-woven, double-ended sack.\n Enno stuffed the fleece down into the sack. Shahes took her hands.\n Leaning across the half-filled sack they held each other’s hands, and Shahes said, “I want—” and Enno said, “Yes, yes!”\n Neither of them had had much love, neither had had much pleasure in sex. Enno, when she was a rough farm girl named Akal, had the misfortune to attract and be attracted by a man whose pleasure was in cruelty. When she finally understood that she did not have to endure what he did to her, she ran away, not knowing how else to escape him. She took refuge at the School in Asta, and there found the work and learning much to her liking, as she did the spiritual discipline, and later the wandering life. She had been an itinerant scholar with no family, no close attachments, for twenty years. Now Shahes’ passion opened to her a spirituality of the body, a revelation that transformed the world and made her feel she had never lived in it before.\n As for Shahes, she’d given very little thought to love and not much more to sex, except as it entered into the question of marriage. Marriage was an urgent matter of business. She was thirty years old. Danro had no whole sedoretu, no child-bearing women, and only one child. Her duty was plain. She had gone courting in a grim, reluctant fashion to a couple of neighboring farms where there were Evening men. She was too late for the man at Beha Farm, who ran off with a lowlander. The widower at Upper Ked’d was receptive, but he also was nearly sixty and smelled like piss. She tried to force herself to accept the advances of Uncle Mika’s half-cousin from Okro Farm down the river, but his desire to own a share of Danro was clearly the sole substance of his desire for Shahes, and he was even lazier and more shiftless than Uncle Mika.\n Ever since they were girls, Shahes had met now and then with Temly, the Evening daughter of the nearest farmhold, Ked’din, round on the other side of the Farren. Temly and Shahes had a sexual friendship that was a true and reliable pleasure to them both. They both wished it could be permanent. Every now and then they talked, lying in Shahes’ bed at Danro or Temly’s bed at Ked’din, of getting married, making a sedoretu. There was no use going to the village matchmakers; they knew everybody the matchmakers knew. One by one they would name the men of Oro and the very few men they knew from outside the Oro Valley, and one by one they would dismiss them as either impossible or inaccessible. The only name that always stayed on the list was Otorra, a Morning man who worked at the carding sheds down in the village center. Shahes liked his reputation as a steady worker; Temly liked his looks and conversation. He evidently liked Temly’s looks and conversation too, and would certainly have come courting her if there were any chance of a marriage at Ked’din, but it was a poor farmhold, and there was the same problem there as at Danro: there wasn’t an eligible Evening man. To make a sedoretu, Shahes and Temly and Otorra would have to marry the shiftless, shameless fellow at Okba or the sour old widower at Ked’d. To Shahes the idea of sharing her farm and her bed with either of them was intolerable.\n “If I could only meet a man who was a match for me!” she said with bitter energy.\n “I wonder if you’d like him if you did,” said Temly.\n “I don’t know that I would.”\n “Maybe next autumn at Manebo . . . ”\n Shahes sighed. Every autumn she trekked down sixty kilometers to Manebo Fair with a train of pack-yama laden with pelts and wool, and looked for a man; but those she looked at twice never looked at her once. Even though Danro offered a steady living, nobody wanted to live way up there, on the roof, as they called it. And Shahes had no prettiness or nice ways to interest a man. Hard work, hard weather, and the habit of command had made her tough; solitude had made her shy. She was like a wild animal among the jovial, easy-talking dealers and buyers. Last autumn once more she had gone to the fair and once more strode back up into her mountains, sore and dour, and said to Temly, “I wouldn’t touch a one of ’em.”\n Enno woke in the ringing silence of the mountain night. She saw the small square of the window ablaze with stars and felt Shahes’ warm body beside her shake with sobs.\n “What is it? what is it, my dear love?”\n “You’ll go away. You’re going to go away!”\n “But not now—not soon—”\n “You can’t stay here. You have a calling. A resp—” the word broken by a gasp and sob—“responsibility to your school, to your work, and I can’t keep you. I can’t give you the farm. I haven’t anything to give you, anything at all!”\n Enno—or Akal, as she had asked Shahes to call her when they were alone, going back to the girl-name she had given up—Akal knew only too well what Shahes meant. It was the farmholder’s duty to provide continuity. As Shahes owed life to her ancestors she owed life to her descendants. Akal did not question this; she had grown up on a farmhold. Since then, at school, she had learned about the joys and duties of the soul, and with Shahes she had learned the joys and duties of love. Neither of them in any way invalidated the duty of a farmholder. Shahes need not bear children herself, but she must see to it that Danro had children. If Temly and Otorra made the Evening marriage, Temly would bear the children of Danro. But a sedoretu must have a Morning marriage; Shahes must find an Evening man. Shahes was not free to keep Akal at Danro, nor was Akal justified in staying there, for she was in the way, an irrelevance, ultimately an obstacle, a spoiler. As long as she stayed on as a lover, she was neglecting her religious obligations while compromising Shahes’ obligation to her farmhold. Shahes had said the truth: she had to go.\n She got out of bed and went over to the window. Cold as it was she stood there naked in the starlight, gazing at the stars that flared and dazzled from the far grey slopes up to the zenith. She had to go and she could not go. Life was here, life was Shahes’ body, her breasts, her mouth, her breath. She had found life and she could not go down to death. She could not go and she had to go.\n Shahes said across the dark room, “Marry me.”\n Akal came back to the bed, her bare feet silent on the bare floor. She slipped under the bedfleece, shivering, feeling Shahes’ warmth against her, and turned to her to hold her; but Shahes took her hand in a strong grip and said again, “Marry me.”\n “Oh if I could!”\n “You can.”\n After a moment Akal sighed and stretched out, her hands behind her head on the pillow. “There’s no Evening men here; you’ve said so yourself. So how can we marry? What can I do? Go fishing for a husband down in the lowlands, I suppose. With the farmhold as bait. What kind of man would that turn up? Nobody I’d let share you with me for a moment. I won’t do it.”\n Shahes was following her own train of thought. “I can’t leave Temly in the lurch,” she said.\n “And that’s the other obstacle,” Akal said. “It’s not fair to Temly. If we do find an Evening man, then she’ll get left out.”\n “No, she won’t.”\n “Two Day marriages and no Morning marriage? Two Evening women in one sedoretu? There’s a fine notion!”\n “Listen,” Shahes said, still not listening. She sat up with the bedfleece round her shoulders and spoke low and quick. “You go away. Back down there. The winter goes by. Late in the spring, people come up the Mane looking for summer work. A man comes to Oro and says, is anybody asking for a good finefleecer? At the sheds they tell him, yes, Shahes from Danro was down here looking for a hand. So he comes on up here, he knocks at the door here. My name is Akal, he says, I hear you need a fleecer. Yes, I say, yes, we do. Come in. Oh come in, come in and stay forever!”\n Her hand was like iron on Akal’s wrist, and her voice shook with exultation. Akal listened as to a fairytale.\n “Who’s to know, Akal? Who’d ever know you? You’re taller than most men up here—you can grow your hair, and dress like a man—you said you liked men’s clothes once. Nobody will know. Who ever comes here anyway?”\n “Oh, come on, Shahes! The people here, Magel and Madu—Shest—”\n “The old people won’t see anything. Mika’s a halfwit. The child won’t know. Temly can bring old Barres from Ked’din to marry us. He never knew a tit from a toe anyhow. But he can say the marriage ceremony.”\n “And Temly?” Akal said, laughing but disturbed; the idea was so wild and Shahes was so serious about it.\n “Don’t worry about Temly. She’d do anything to get out of Ked’din. She wants to come here, she and I have wanted to marry for years. Now we can. All we need is a Morning man for her. She likes Otorra well enough. And he’d like a share of Danro.”\n “No doubt, but he gets a share of me with it, you know! A woman in a Night marriage?”\n “He doesn’t have to know.”\n “You’re crazy, of course he’ll know!”\n “Only after we’re married.”\n Akal stared through the dark at Shahes, speechless. Finally she said, “What you’re proposing is that I go away now and come back after half a year dressed as a man. And marry you and Temly and a man I never met. And live here the rest of my life pretending to be a man. And nobody is going to guess who I am or see through it or object to it. Least of all my husband.”\n “He doesn’t matter.”\n “Yes he does,” said Akal. “It’s wicked and unfair. It would desecrate the marriage sacrament. And anyway it wouldn’t work. I couldn’t fool everybody! Certainly not for the rest of my life!”\n “What other way have we to marry?”\n “Find an Evening husband—somewhere—”\n “But I want you! I want you for my husband and my wife. I don’t want any man, ever. I want you, only you till the end of life, and nobody between us, and nobody to part us. Akal, think, think about it, maybe it’s against religion, but who does it hurt? Why is it unfair? Temly likes men, and she’ll have Otorra. He’ll have her, and Danro. And Danro will have their children. And I will have you, I’ll have you forever and ever, my soul, my life and soul.”\n “Oh don’t, oh don’t,” Akal said with a great sob.\n Shahes held her.\n “I never was much good at being a woman,” Akal said. “Till I met you. You can’t make me into a man now! I’d be even worse at that, no good at all!”\n “You won’t be a man, you’ll be my Akal, my love, and nothing and nobody will ever come between us.”\n They rocked back and forth together, laughing and crying, with the fleece around them and the stars blazing at them. “We’ll do it, we’ll do it!” Shahes said, and Akal said, “We’re crazy, we’re crazy!”\n Gossips in Oro had begun to ask if that scholar woman was going to spend the winter up in the high farmholds, where was she now, Danro was it or Ked’din?—when she came walking down the zigzag road. She spent the night and sang the offerings for the mayor’s family, and caught the daily freighter to the suntrain station down at Dermane. The first of the autumn blizzards followed her down from the peaks.\n Shahes and Akal sent no message to each other all through the winter. In the early spring Akal telephoned the farm. “When are you coming?” Shahes asked, and the distant voice replied, “In time for the fleecing.”\n For Shahes the winter passed in a long dream of Akal. Her voice sounded in the empty next room. Her tall body moved beside Shahes through the wind and snow. Shahes’ sleep was peaceful, rocked in a certainty of love known and love to come.\n For Akal, or Enno as she became again in the lowlands, the winter passed in a long misery of guilt and indecision. Marriage was a sacrament, and surely what they planned was a mockery of that sacrament. Yet as surely it was a marriage of love. And as Shahes had said, it harmed no one—unless to deceive them was to harm them. It could not be right to fool the man, Otorra, into a marriage where his Night partner would turn out to be a woman. But surely no man knowing the scheme beforehand would agree to it; deception was the only means at hand. They must cheat him.\n The religion of the ki’O lacks priests and pundits who tell the common folk what to do. The common folk have to make their own moral and spiritual choices, which is why they spend a good deal of time discussing the Discussions. As a scholar of the Discussions, Enno knew more questions than most people, but fewer answers.\n She sat all the dark winter mornings wrestling with her soul. When she called Shahes, it was to tell her that she could not come. When she heard Shahes’ voice her misery and guilt ceased to exist, were gone, as a dream is gone on waking. She said, “I’ll be there in time for the fleecing.”\n In the spring, while she worked with a crew rebuilding and repainting a wing of her old school at Asta, she let her hair grow. When it was long enough, she clubbed it back, as men often did. In the summer, having saved a little money working for the school, she bought men’s clothes. She put them on and looked at herself in the mirror in the shop. She saw Akal. Akal was a tall, thin man with a thin face, a bony nose, and a slow, brilliant smile. She liked him.\n Akal got off the High Deka freighter at its last stop, Oro, went to the village center, and asked if anybody was looking for a fleecer.\n “Danro.”—“The farmer was down from Danro, twice already.”—“Wants a finefleecer.”—“Coarsefleecer, wasn’t it?”—It took a while, but the elders and gossips agreed at last: a finefleecer was wanted at Danro.\n “Where’s Danro?” asked the tall man.\n “Up,” said an elder succinctly. “You ever handled ariu yearlings?”\n “Yes,” said the tall man. “Up west or up east?”\n They told him the road to Danro, and he went off up the zigzags, whistling a familiar praise-song.\n As Akal went on he stopped whistling, and stopped being a man, and wondered how she could pretend not to know anybody in the household, and how she could imagine they wouldn’t know her. How could she deceive Shest, the child whom she had taught the water rite and the praise-songs? A pang of fear and dismay and shame shook her when she saw Shest come running to the gate to let the stranger in.\n Akal spoke little, keeping her voice down in her chest, not meeting the child’s eyes. She was sure he recognised her. But his stare was simply that of a child who saw strangers so seldom that for all he knew they all looked alike. He ran in to fetch the old people, Magel and Madu. They came out to offer Akal the customary hospitality, a religious duty, and Akal accepted, feeling mean and low at deceiving these people, who had always been kind to her in their rusty, stingy way, and at the same time feeling a wild impulse of laughter, of triumph. They did not see Enno in her, they did not know her. That meant that she was Akal, and Akal was free.\n She was sitting in the kitchen drinking a thin and sour soup of summer greens when Shahes came in—grim, stocky, weatherbeaten, wet. A summer thunderstorm had broken over the Farren soon after Akal reached the farm. “Who’s that?” said Shahes, doffing her wet coat.\n “Come up from the village.” Old Magel lowered his voice to address Shahes confidentially: “He said they said you said you wanted a hand with the yearlings.”\n “Where’ve you worked?” Shahes demanded, her back turned, as she ladled herself a bowl of soup.\n Akal had no life history, at least not a recent one. She groped a long time. No one took any notice, prompt answers and quick talk being unusual and suspect practices in the mountains. At least she said the name of the farm she had run away from twenty years ago. “Bredde Hold, of Abba Village, on the Oriso.”\n “And you’ve finefleeced? Handled yearlings? Ariu yearlings?”\n Akal nodded, dumb. Was it possible that Shahes did not recognise her? Her voice was flat and unfriendly, and the one glance she had given Akal was dismissive. She had sat down with her soupbowl and was eating hungrily.\n “You can come out with me this afternoon and I’ll see how you work,” Shahes said. “What’s your name, then?”\n “Akal.”\n Shahes grunted and went on eating. She glanced up across the table at Akal again, one flick of the eyes, like a stab of light.\n Out on the high hills, in the mud of rain and snowmelt, in the stinging wind and the flashing sunlight, they held each other so tight neither could breathe, they laughed and wept and talked and kissed and coupled in a rock shelter, and came back so dirty and with such a sorry little sack of combings that old Magel told Madu that he couldn’t understand why Shahes was going to hire the tall fellow from down there at all, if that’s all the work was in him, and Madu said what’s more he eats for six.\n But after a month or so, when Shahes and Akal weren’t hiding the fact that they slept together, and Shahes began to talk about making a sedoretu, the old couple grudgingly approved. They had no other kind of approval to give. Maybe Akal was ignorant, didn’t know a hassel-bit from a cold-chisel; but they were all like that down there. Remember that travelling scholar, Enno, stayed here last year, she was just the same, too tall for her own good and ignorant, but willing to learn, same as Akal. Akal was a prime hand with the beasts, or had the makings of it anyhow. Shahes could look farther and do worse. And it meant she and and Temly could be the Day marriage of a sedoretu, as they would have been long since if there’d been any kind of men around worth taking into the farmhold, what’s wrong with this generation, plenty of good men around in my day.\n Shahes had spoken to the village matchmakers down in Oro. They spoke to Otorra, now a foreman at the carding sheds; he accepted a formal invitation to Danro. Such invitations included meals and an overnight stay, necessarily, in such a remote place, but the invitation was to share worship with the farm family at the house shrine, and its significance was known to all.\n So they all gathered at the house shrine, which at Danro was a low, cold, inner room walled with stone, with a floor of earth and stones that was the unlevelled ground of the mountainside. A tiny spring, rising at the higher end of the room, trickled in a channel of cut granite. It was the reason why the house stood where it did, and had stood there for six hundred years. They offered water and accepted water, one to another, one from another, the old Evening couple, Uncle Mika, his son Shest, Asbi who had worked as a pack-trainer and handyman at Danro for thirty years, Akal the new hand, Shahes the farmholder, and the guests: Otorra from Oro and Temly from Ked’din.\n Temly smiled across the spring at Otorra, but he did not meet her eyes, or anyone else’s.\n Temly was a short, stocky woman, the same type as Shahes, but fairer-skinned and a bit lighter all round, not as solid, not as hard. She had a surprising, clear singing voice that soared up in the praise-songs. Otorra was also rather short and broad-shouldered, with good features, a competent-looking man, but just now extremely ill at ease; he looked as if he had robbed the shrine or murdered the mayor, Akal thought, studying him with interest, as well she might. He looked furtive; he looked guilty.\n Akal observed him with curiosity and dispassion. She would share water with Otorra, but not guilt. As soon as she had seen Shahes, touched Shahes, all her scruples and moral anxieties had dropped away, as if they could not breathe up here in the mountains. Akal had been born for Shahes and Shahes for Akal; that was all there was to it. Whatever made it possible for them to be together was right.\n Once or twice she did ask herself, what if I’d been born into the Morning instead of the Evening moiety?—a perverse and terrible thought. But perversity and sacrilege were not asked of her. All she had to do was change sex. And that only in appearance, in public. With Shahes she was a woman, and more truly a woman and herself than she had ever been in her life. With everybody else she was Akal, whom they took to be a man. That was no trouble at all. She was Akal; she liked being Akal. It was not like acting a part. She never had been herself with other people, had always felt a falsity in her relationships with them; she had never known who she was at all, except sometimes for a moment in meditation, when her I am became It is, and she breathed the stars. But with Shahes she was herself utterly, in time and in the body, Akal, a soul consumed in love and blessed by intimacy.\n So it was that she had agreed with Shahes that they should say nothing to Otorra, nothing even to Temly. “Let’s see what Temly makes of you,” Shahes said, and Akal agreed.\n Last year Temly had entertained the scholar Enno overnight at her farmhold for instruction and worship, and had met her two or three times at Danro. When she came to share worship today she met Akal for the first time. Did she see Enno? She gave no sign of it. She greeted Akal with a kind of brusque goodwill, and they talked about breeding ariu. She quite evidently studied the newcomer, judging, sizing up; but that was natural enough in a woman meeting a stranger she might be going to marry. “You don’t know much about mountain farming, do you?” she said kindly after they had talked a while. “Different from down there. What did you raise? Those big flatland yama?” And Akal told her about the farm where she grew up, and the three crops a year they got, which made Temly nod in amazement.\n As for Otorra, Shahes and Akal colluded to deceive him without ever saying a word more about it to each other. Akal’s mind shied away from the subject. They would get to know each other during the engagement period, she thought vaguely. She would have to tell him, eventually, that she did not want to have sex with him, of course, and the only way to do that without insulting and humiliating him was to say that she, that Akal, was averse to having sex with other men, and hoped he would forgive her. But Shahes had made it clear that she mustn’t tell him that till they were married. If he knew it beforehand he would refuse to enter the sedoretu. And even worse, he might talk about it, expose Akal as a woman, in revenge. Then they would never be able to marry. When Shahes had spoken about this Akal had felt distressed and trapped, anxious, guilty again; but Shahes was serenely confident and untroubled, and somehow Akal’s guilty feelings would not stick. They dropped off. She simply hadn’t thought much about it. She watched Otorra now with sympathy and curiosity, wondering what made him look so hangdog. He was scared of something, she thought.\n After the water was poured and the blessing said, Shahes read from the Fourth Discussion; she closed the old boxbook very carefully, put it on its shelf and its cloth over it, and then, speaking to Magel and Madu as was proper, they being what was left of the First Sedoretu of Danro, she said, “My Othermother and my Otherfather, I propose that a new sedoretu be made in this house.”\n Madu nudged Magel. He fidgeted and grimaced and muttered inaudibly. Finally Madu said in her weak, resigned voice, “Daughter of the Morning, tell us the marriages.”\n “If all be well and willing, the marriage of the Morning will be Shahes and Akal, and the marriage of the Evening will be Temly and Otorra, and the marriage of the Day will be Shahes and Temly, and the marriage of the Night will be Akal and Otorra.”\n There was a long pause. Magel hunched his shoulders. Madu said at last, rather fretfully, “Well, is that all right with everybody?”—which gave the gist, if not the glory, of the formal request for consent, usually couched in antique and ornate language.\n “Yes,” said Shahes, clearly.\n “Yes,” said Akal, manfully.\n “Yes,” said Temly, cheerfully.\n A pause.\n Everybody looked at Otorra, of course. He had blushed purple and, as they watched, turned greyish.\n “I am willing,” he said at last in a forced mumble, and cleared his throat. “Only—” He stuck there.\n Nobody said anything.\n The silence was horribly painful.\n Akal finally said, “We don’t have to decide now. We can talk. And, and come back to the shrine later, if . . . ”\n “Yes,” Otorra said, glancing at Akal with a look in which so much emotion was compressed that she could not read it at all—terror, hate, gratitude, despair?—“I want to—I need to talk—to Akal.”\n “I’d like to get to know my brother of the Evening too,” said Temly in her clear voice.\n “Yes, that’s it, yes, that is—” Otorra stuck again, and blushed again. He was in such an agony of discomfort that Akal said, “Let’s go on outside for a bit, then,” and led Otorra out into the yard, while the others went to the kitchen.\n Akal knew Otorra had seen through her pretense. She was dismayed, and dreaded what he might say; but he had not made a scene, he had not humiliated her before the others, and she was grateful to him for that.\n “This is what it is,” Otorra said in a stiff, forced voice, coming to a stop at the gate. “It’s the Night marriage.” He came to a stop there, too.\n Akal nodded. Reluctantly, she spoke, to help Otorra do what he had to do. “You don’t have to—” she began, but he was speaking again:\n “The Night marriage. Us. You and me. See, I don’t—There’s some—See, with men, I—”\n The whine of delusion and the buzz of incredulity kept Akal from hearing what the man was trying to tell her. He had to stammer on even more painfully before she began to listen. When his words came clear to her she could not trust them, but she had to. He had stopped trying to talk.\n Very hesitantly, she said, “Well, I . . . I was going to tell you . . . . The only man I ever had sex with, it was . . . It wasn’t good. He made me—He did things—I don’t know what was wrong. But I never have—I have never had any sex with men. Since that. I can’t. I can’t make myself want to.”\n “Neither can I,” Otorra said.\n They stood side by side leaning on the gate, contemplating the miracle, the simple truth.\n “I just only ever want women,” Otorra said in a shaking voice.\n “A lot of people are like that,” Akal said.\n “They are?”\n She was touched and grieved by his humility. Was it men’s boastfulness with other men, or the hardness of the mountain people, that had burdened him with this ignorance, this shame?\n “Yes,” she said. “Everywhere I’ve been. There’s quite a lot of men who only want sex with women. And women who only want sex with men. And the other way round, too. Most people want both, but there’s always some who don’t. It’s like the two ends of,” she was about to say “a spectrum,” but it wasn’t the language of Akal the fleecer or Otorra the carder, and with the adroitness of the old teacher she substituted “a sack. If you pack it right, most of the fleece is in the middle. But there’s some at both ends where you tie off, too. That’s us. There’s not as many of us. But there’s nothing wrong with us.” As she said this last it did not sound like what a man would say to a man. But it was said; and Otorra did not seem to think it peculiar, though he did not look entirely convinced. He pondered. He had a pleasant face, blunt, unguarded, now that his unhappy secret was out. He was only about thirty, younger than she had expected.\n “But in a marriage,” he said. “It’s different from just . . . A marriage is—Well, if I don’t—and you don’t—”\n “Marriage isn’t just sex,” Akal said, but said it in Enno’s voice, Enno the scholar discussing questions of ethics, and Akal cringed.\n “A lot of it is,” said Otorra, reasonably.\n “All right,” Akal said in a consciously deeper, slower voice. “But if I don’t want it with you and you don’t want it with me why can’t we have a good marriage?” It came out so improbable and so banal at the same time that she nearly broke into a fit of laughter. Controlling herself, she thought, rather shocked, that Otorra was laughing at her, until she realised that he was crying.\n “I never could tell anybody,” he said.\n “We don’t ever have to,” she said. She put her arm around his shoulders without thinking about it at all. He wiped his eyes with his fists like a child, cleared his throat, and stood thinking. Obviously he was thinking about what she had just said.\n “Think,” she said, also thinking about it, “how lucky we are!”\n “Yes. Yes, we are.” He hesitated. “But . . . but is it religious . . . to marry each other knowing . . . Without really meaning to . . . . ” He stuck again.\n After a long time, Akal said, in a voice as soft and nearly as deep as his, “I don’t know.”\n She had withdrawn her comforting, patronising arm from his shoulders. She leaned her hands on the top bar of the gate. She looked at her hands, long and strong, hardened and dirt-engrained from farm work, though the oil of the fleeces kept them supple. A farmer’s hands. She had given up the religious life for love’s sake and never looked back. But now she was ashamed.\n She wanted to tell this honest man the truth, to be worthy of his honesty.\n But it would do no good, unless not to make the sedoretu was the only good.\n “I don’t know,” she said again. “I think what matters is if we try to give each other love and honor. However we do that, that’s how we do it. That’s how we’re married. The marriage—the religion is in the love, in the honoring.”\n “I wish there was somebody to ask,” Otorra said, unsatisfied. “Like that travelling scholar that was here last summer. Somebody who knows about religion.”\n Akal was silent.\n “I guess the thing is to do your best,” Otorra said after a while. It sounded sententious, but he added, plainly, “I would do that.”\n “So would I,” Akal said.\n A mountain farmhouse like Danro is a dark, damp, bare, grim place to live in, sparsely furnished, with no luxuries except the warmth of the big kitchen and the splendid bedfleeces. But it offers privacy, which may be the greatest luxury of all, though the ki’O consider it a necessity. “A three-room sedoretu” is a common expression in Okets, meaning an enterprise doomed to fail.\n At Danro, everyone had their own room and bathroom. The two old members of the First Sedoretu, and Uncle Mika and his child, had rooms in the center and west wing; Asbi, when he wasn’t sleeping out on the mountain, had a cozy, dirty nest behind the kitchen. The new Second Sedoretu had the whole east side of the house. Temly chose a little attic room, up a half-flight of stairs from the others, with a fine view. Shahes kept her room, and Akal hers, adjoining; and Otorra chose the southeast corner, the sunniest room in the house.\n The conduct of a new sedoretu is to some extent, and wisely, prescribed by custom and sanctioned by religion. The first night after the ceremony of marriage belongs to the Morning and Evening couples; the second night to the Day and Night couples. Thereafter the four spouses may join as and when they please, but always and only by invitation given and accepted, and the arrangements are to be known to all four. Four souls and bodies and all the years of their four lives to come are in the balance in each of those decisions and invitations; passion, negative and positive, must find its channels, and trust must be established, lest the whole structure fail to found itself solidly, or destroy itself in selfishness and jealousy and grief.\n Akal knew all the customs and sanctions, and she insisted that they be followed to the letter. Her wedding night with Shahes was tender and a little tense. Her wedding night with Otorra was also tender; they sat in his room and talked softly, shy with each other but each very grateful; then Otorra slept in the deep windowseat, insisting that Akal have the bed.\n Within a few weeks Akal knew that Shahes was more intent on having her way, on having Akal as her partner, than on maintaining any kind of sexual balance or even a pretense of it. As far as Shahes was concerned, Otorra and Temly could look after each other and that was that. Akal had of course known many sedoretu where one or two of the partnerships dominated the others completely, through passion or the power of an ego. To balance all four relationships perfectly was an ideal seldom realised. But this sedoretu, already built on a deception, a disguise, was more fragile than most. Shahes wanted what she wanted and consequences be damned. Akal had followed her far up the mountain, but would not follow her over a precipice.\n It was a clear autumn night, the window full of stars, like that night last year when Shahes had said, “Marry me.”\n “You have to give Temly tomorrow night,”Akal repeated.\n “She’s got Otorra,” Shahes repeated.\n “She wants you. Why do you think she married you?”\n “She’s got what she wants. I hope she gets pregnant soon,” Shahes said, stretching luxuriously, and running her hand over Akal’s breasts and belly. Akal stopped her hand and held it.\n “It isn’t fair, Shahes. It isn’t right.”\n “A fine one you are to talk!”\n “But Otorra doesn’t want me, you know that. And Temly does want you. And we owe it to her.”\n “Owe her what?”\n “Love and honor.”\n “She’s got what she wanted,” Shahes said, and freed her hand from Akal’s grasp with a harsh twist. “Don’t preach at me.”\n “I’m going back to my room,” Akal said, slipping lithely from the bed and stalking naked through the starry dark. “Good night.”\n She was with Temly in the old dye room, unused for years until Temly, an expert dyer, came to the farm. Weavers down in the Centers would pay well for fleece dyed the true Deka red. Her skill had been Temly’s dowry. Akal was her assistant and apprentice now.\n “Eighteen minutes. Timer set?”\n “Set.”\n Temly nodded, checked the vents on the great dye-boiler, checked the read-out again, and went outside to catch the morning sun. Akal joined her on the stone bench by the stone doorway. The smell of the vegetable dye, pungent and acid-sweet, clung to them, and their clothes and hands and arms were raddled pink and crimson.\n Akal had become attached to Temly very soon, finding her reliably good-tempered and unexpectedly thoughtful—both qualities that had been in rather short supply at Danro. Without knowing it, Akal had formed her expectation of the mountain people on Shahes—powerful, wilful, undeviating, rough. Temly was strong and quite self-contained, but open to impressions as Shahes was not. Relationships within her moiety meant little to Shahes; she called Otorra brother because it was customary, but did not see a brother in him. Temly called Akal brother and meant it, and Akal, who had had no family for so long, welcomed the relationship, returning Temly’s warmth. They talked easily together, though Akal had constantly to guard herself from becoming too easy and letting her woman-self speak out. Mostly it was no trouble at all being Akal and she gave little thought to it, but sometimes with Temly it was very hard to keep up the pretense, to prevent herself from saying what a woman would say to her sister. In general she had found that the main drawback in being a man was that conversations were less interesting.\n They talked about the next step in the dyeing process, and then Temly said, looking off over the low stone wall of the yard to the huge purple slant of the Farren, “You know Enno, don’t you?”\n The question seemed innocent and Akal almost answered automatically with some kind of deceit—“The scholar that was here . . . ?”\n But there was no reason why Akal the fleecer should know Enno the scholar. And Temly had not asked, Do you remember Enno, or did you know Enno, but, “You know Enno, don’t you?” She knew the answer.\n “Yes.”\n Temly nodded, smiling a little. She said nothing more.\n Akal was amazed by her subtlety, her restraint. There was no difficulty in honoring so honorable a woman.\n “I lived alone for a long time,” Akal said. “Even on the farm where I grew up I was mostly alone. I never had a sister. I’m glad to have one at last.”\n “So am I,” said Temly.\n Their eyes met briefly, a flicker of recognition, a glance planting trust deep and silent as a tree-root.\n “She knows who I am, Shahes.”\n Shahes said nothing, trudging up the steep slope.\n “Now I wonder if she knew from the start. From the first water-sharing. . . . ”\n “Ask her if you like,” Shahes said, indifferent.\n “I can’t. The deceiver has no right to ask for the truth.”\n “Humbug!” Shahes said, turning on her, halting her in midstride. They were up on the Farren looking for an old beast that Asbi had reported missing from the herd. The keen autumn wind had blown Shahes’ cheeks red, and as she stood staring up at Akal she squinted her watering eyes so that they glinted like knifeblades. “Quit preaching! Is that who you are? ‘The deceiver?’ I thought you were my wife!”\n “I am, and Otorra’s too, and you’re Temly’s—you can’t leave them out, Shahes!”\n “Are they complaining?”\n “Do you want them to complain?” Akal shouted, losing her temper. “Is that the kind of marriage you want?—Look, there she is,” she added in a suddenly quiet voice, pointing up the great rocky mountainside. Farsighted, led by a bird’s circling, she had caught the movement of the yama’s head near an outcrop of boulders. The quarrel was postponed. They both set off at a cautious trot towards the boulders.\n The old yama had broken a leg in a slip from the rocks. She lay neatly collected, though the broken foreleg would not double under her white breast but stuck out forward, and her whole body had a lurch to that side. Her disdainful head was erect on the long neck, and she gazed at the women, watching her death approach, with clear, unfathomable, uninterested eyes.\n “Is she in pain?” Akal asked, daunted by that great serenity.\n “Of course,” Shahes said, sitting down several paces away from the yama to sharpen her knife on its emery-stone. “Wouldn’t you be?”\n She took a long time getting the knife as sharp as she could get it, patiently retesting and rewhetting the blade. At last she tested it again and then sat completely still. She stood up quietly, walked over to the yama, pressed its head up against her breast and cut its throat in one long fast slash. Blood leaped out in a brilliant arc. Shahes slowly lowered the head with its gazing eyes down to the ground.\n Akal found that she was speaking the words of the ceremony for the dead, Now all that was owed is repaid and all that was owned, returned. Now all that was lost is found and all that was bound, free. Shahes stood silent, listening till the end.\n Then came the work of skinning. They would leave the carcase to be cleaned by the scavengers of the mountain; it was a carrion-bird circling over the yama that had first caught Akal’s eye, and there were now three of them riding the wind. Skinning was fussy, dirty work, in the stink of meat and blood. Akal was inexpert, clumsy, cutting the hide more than once. In penance she insisted on carrying the pelt, rolled as best they could and strapped with their belts. She felt like a grave robber, carrying away the white-and-dun fleece, leaving the thin, broken corpse sprawled among the rocks in the indignity of its nakedness. Yet in her mind as she lugged the heavy fleece along was Shahes standing up and taking the yama’s beautiful head against her breast and slashing its throat, all one long movement, in which the woman and the animal were utterly one.\n It is need that answers need, Akal thought, as it is question that answers question. The pelt reeked of death and dung. Her hands were caked with blood, and ached, gripping the stiff belt, as she followed Shahes down the steep rocky path homeward.\n “I’m going down to the village,” Otorra said, getting up from the breakfast table.\n “When are you going to card those four sacks?” Shahes said.\n He ignored her, carrying his dishes to the washer-rack. “Any errands?” he asked of them all.\n “Everybody done?” Madu asked, and took the cheese out to the pantry.\n “No use going into town till you can take the carded fleece,” said Shahes.\n Otorra turned to her, stared at her, and said, “I’ll card it when I choose and take it when I choose and I don’t take orders at my own work, will you understand that?”\n Stop, stop now! Akal cried silently, for Shahes, stunned by the uprising of the meek, was listening to him. But he went on, firing grievance with grievance, blazing out in recriminations. “You can’t give all the orders, we’re your sedoretu, we’re your household, not a lot of hired hands, yes it’s your farm but it’s ours too, you married us, you can’t make all the decisions, and you can’t have it all your way either,” and at this point Shahes unhurriedly walked out of the room.\n “Shahes!” Akal called after her, loud and imperative. Though Otorra’s outburst was undignified it was completely justified, and his anger was both real and dangerous. He was a man who had been used, and he knew it. As he had let himself be used and had colluded in that misuse, so now his anger threatened destruction. Shahes could not run away from it.\n She did not come back. Madu had wisely disappeared. Akal told Shest to run out and see to the pack-beasts’ feed and water.\n The three remaining in the kitchen sat or stood silent. Temly looked at Otorra. He looked at Akal.\n “You’re right,” Akal said to him.\n He gave a kind of satisfied snarl. He looked handsome in his anger, flushed and reckless. “Damn right I’m right. I’ve let this go on for too long. Just because she owned the farmhold—”\n “And managed it since she was fourteen,” Akal cut in. “You think she can quit managing just like that? She’s always run things here. She had to. She never had anybody to share power with. Everybody has to learn how to be married.”\n “That’s right,” Otorra flashed back, “and a marriage isn’t two pairs. It’s four pairs!”\n That brought Akal up short. Instinctively she looked to Temly for help. Temly was sitting, quiet as usual, her elbows on the table, gathering up crumbs with one hand and pushing them into a little pyramid.\n “Temly and me, you and Shahes, Evening and Morning, fine,” Otorra said. “What about Temly and her? What about you and me?”\n Akal was now completely at a loss. “I thought . . . When we talked . . . ”\n “I said I didn’t like sex with men,” said Otorra.\n She looked up and saw a gleam in his eye. Spite? Triumph? Laughter?\n “Yes. You did,” Akal said after a long pause. “And I said the same thing.”\n Another pause.\n “It’s a religious duty,” Otorra said.\n Enno suddenly said very loudly in Akal’s voice, “Don’t come onto me with your religious duty! I studied religious duty for twenty years and where did it get me? Here! With you! In this mess!”\n At this, Temly made a strange noise and put her face in her hands. Akal thought she had burst into tears, and then saw she was laughing, the painful, helpless, jolting laugh of a person who hasn’t had much practice at it.\n “There’s nothing to laugh about,” Otorra said fiercely, but then had no more to say; his anger had blown up leaving nothing but smoke. He groped for words for a while longer. He looked at Temly, who was indeed in tears now, tears of laughter. He made a despairing gesture. He sat down beside Temly and said, “I suppose it is funny if you look at it. It’s just that I feel like a chump.” He laughed, ruefully, and then, looking up at Akal, he laughed genuinely. “Who’s the biggest chump?” he asked her.\n “Not you,” she said. “How long. . . . ”\n “How long do you think?”\n It was what Shahes, standing in the passageway, heard: their laughter. The three of them laughing. She listened to it with dismay, fear, shame, and terrible envy. She hated them for laughing. She wanted to be with them, she wanted to laugh with them, she wanted to silence them. Akal, Akal was laughing at her.\n She went out to the workshed and stood in the dark behind the door and tried to cry and did not know how. She had not cried when her parents were killed; there had been too much to do. She thought the others were laughing at her for loving Akal, for wanting her, for needing her. She thought Akal was laughing at her for being such a fool, for loving her. She thought Akal would sleep with the man and they would laugh together at her. She drew her knife and tested its edge. She had made it very sharp yesterday on the Farren to kill the yama. She came back to the house, to the kitchen.\n They were all still there. Shest had come back and was pestering Otorra to take him into town and Otorra was saying, “Maybe, maybe,” in his soft lazy voice.\n Temly looked up, and Akal looked round at Shahes—the small head on the graceful neck, the clear eyes gazing.\n Nobody spoke.\n “I’ll walk down with you, then,” Shahes said to Otorra, and sheathed her knife. She looked at the women and the child. “We might as well all go,” she said sourly. “If you like.”\n Originally published in Asimov’s Science Fiction, August 1996.\n Ursula K. Le Guin is probably one of the best-known and most universally respected SF writers in the world today, having won, in addition to many Hugo and Nebula Awards, the National Book Award, a Pushcart Prize, The Harold D. Vursell Memorial Award of the American Academy of Arts and Letters, a Newbury Honor, and the World Fantasy Award for Lifetime Achievement. Her famous novel The Left Hand of Darkness may have been the most influential SF novel of its decade, and shows every sign of becoming one of the enduring classic of the genre. Le Guin's other novels include The Dispossessed, Planet of Exile, The Lathe of Heaven, City of Illusions, Rocannon's World, The Beginning Place, A Wizard of Earthsea, The Tombs of Atuan, Tehanu, The Farthest Shore, Searoad, and Always Coming Home. She has had six collections: The Wind's Twelve Quarters, Orsinian Tales, The Compass Rose, Buffalo Gals and Other Animal Presences, A Fisherman of the Inland Sea, and Four Ways to Forgiveness. She's also written many novels for children as well as much non-fiction. Her most recent books are a novel trilogy, Gifts, Voices, and Powers, and two big retrospective collections, Where On Earth: Selected Stories, Volume One and Outer Le Guin, Mountain Ways, 28 Space, Inner Lands: Selected Stories, Volume Two. She lives with her husband in Portland, Oregon."}