{"fingerprint": "p2fyJMBmAbT3SxCduQkcxuePDAY=", "sitename": "Clarkesworld Magazine", "title": "The Hexagonal Bolero of Honeybees by Krista Hoeppner Leahy", "author": "Krista Hoeppner Leahy", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/leahy_11_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Hexagonal Bolero of Honeybees by Krista Hoeppner Leahy", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4770 words, short story\n The Hexagonal Bolero of Honeybees\n Hum\n “For so work the honeybees . . . The sad-eyed justice with his surly hum Delivering o’er to executors pale The lazy yawning drone.”—Shakespeare, The Life of King Henry the Fifth\n We cannot tame vibration, much as we long to suss its purpose.\n Are there those among us who fly only to mate and then die? Some who work perpetually, some who are queens? Or is it more that we are each—we are all—the hive? The honeycomb and the bees? The sticky-sweet-surly hum a chorus we cannot hear, only sing?\n Pluck a sunbeam, a bee sings.\n Pluck an oceanwave, the earth rings.\n But whose hand is doing the plucking?\n And what hum signals tomorrow’s fall of the executioner’s blade?\n Hope\n “The keeping of bees is like the direction of sunbeams.”—Henry David Thoreau\n Ciro loved his daddy, and loved painting flowers like a bee. Daddy said he was better than a bee, but Ciro didn’t think that was true, ‘cuz bees made honey. Ciro couldn’t make honey, but he could climb the highest, licking his paintbrush in between painting the teeny-tiny flowers. Yummy, but not as yummy as honey. Sometimes after he crept along the tallest branches, Daddy would say “Fly, bee, fly” and Ciro would back flip down into his daddy’s waiting arms. Maybe Daddy wasn’t his real daddy, and maybe Ciro would never be a real bee, but none of that mattered when it was just Ciro painting flowers.\n Hunger\n “To make a prairie it takes a clover and one bee,. . . revery alone will do,If bees are few.”—Emily Dickinson, Complete Poems\n The atrium air was warm, impossibly warm compared to the frozen tundra outside, and redolent of blooms delicious as forgotten dreams. The cross-latticed Sunglass atrium was separated from the body of the greenhouse by mechanical sally ports, but the bees could smell enough of the Allmond orchards beyond to pulse with anticipation—of course some ventilation would be required, even with the closed loop geothermal heating system. Mishka’s bees crawled through her honeycomb crown, tickling her scalp, as they sussed for the source of the fragrance. She ignored the tickling and the damnable itching of her nectarways and focused on the hand-pollinator’s bid. Gabhan was the competition, she reminded herself, never mind the boy he wore on his shoulders, like an accessory proclaiming his innocence.\n “ . . . hand-pollination offers more control, more finesse, more flexibility, more artistry—the human touch will honor your trees, Arborist. We cradle your Allmond blooms as only a human hand can. Isn’t that right, Ciro?”\n “Right-ee-o!” The boy, who had to be younger than four, smiled; the boy’s crinkled eyes echoed the curve of his mouth—a triple grin!—and he looked as pleased as if he had invented human hands himself.\n Mishka refused to smile back. No doubt Gabhan had coerced the boy to make him perform with such utter charm. She breathed in through her nose, out through her mouth, soothing her itching as best she could. The boy’s charm—forced or not—could only hurt her chances, and she couldn’t afford to be distracted.\n Gabhan lifted his hands towards the vaulted Sunglass ceiling, adding, “Of course, if you care to risk your crop with the unregulated wildness of hiver bees,” he laughed, and was that a wink he aimed at Mishka? Unbelievable. “Who am I to convince you otherwise?”\n Mishka didn’t trust Gabhan, with his easy laugh and bear-like chest, his way of spreading his fingers wide into the air, as if he had nothing to hide, as if he were offering ease and naturalness and health, when in truth hand-pollination was laborious, only partially effective and as unnatural as her own symbiont nature. Natural pollination had died out when the climate chilled, no matter how he waxed poetic about the gentle artistry and power of the human hand.\n Hands hands hands. If only she could stop thinking about her hands itch itch itching across her forearms and knuckles and palms. Withholding nectar intensified itching all along her altered nerves, even though the nectar production was restricted to her torso.\n There was the rub. The damning, itching rub. The one the apiarists had warned Mishka about, that her latent eczema might be triggered by the symbiont grafting—that for her becoming a hiver might involve more sacrifice than most.\n Small price to pay for becoming a pollinator. For nurturing 60,000 bees and securing her own livelihood with one profound surgery. Not to mention solving the world hunger problem. Wry joke. Her father’s joke. Back when her father joked. Back when her father lived. Back when folks had the luxury of worrying about a world hunger problem, not just their own grumbling ping-panging middles. Back when there was a world, not this archipelago of greenhouses rock-skipped across the continents.\n And in this greenhouse—warmest in North America, floored with sequoia felled to escape becoming another forest of frozen stalagmites, latticed in Sunglass to amplify sun, and plugged deep into the hum of geothermal heat fueling the geysers of Yellowstone—Mishka sweated and the more she sweated, the more she itched, and the more the bees pulsed, triggering histamines, opening altered nerveways, and Mishka’s nectar began to pump, pooling internally, preparing to let down, to cascade amidst prickling skin . . . oh the urge to scratch. From the soles of her sweating feet to her honeycombed scalp and pulsing hive of a crown, Mishka itched itched itched until she could barely hear Gabhan’s closing bid.\n “ . . . not child slavery rather child freedom.” This last punctuated by the boy performing a double back flip off Gabhan’s shoulders, landing as lightly as a flower himself before sinking into a graceful kneel, and offering up a single perfect blush and cream bloom in his cupped hands.\n Mishka seethed at Gabhan’s dismissal of the child labor question as nothing but a philosophical imbroglio best answered with a circus trick. Thankfully the Arborist didn’t take the bloom, even when Gabhan knelt as well. She still had a chance at the bid, but that loose bloom was making the itching worse, making it even harder to concentrate.\n Of course, once the bees fed, the itching would subside, but she couldn’t afford a feeding now, not while the Arborist was deliberating which pollinator—hand or hiver—to award the orchard contract. The bees would nuzzle into every nectar crevice of Mishka’s bosom, throat, abdomen—all the easiest nerveways for the apiarists to alter, near the milk-production zone, why all hivers were female—and after having postponed the bees this long, they would suckle with scavenging force. While the Arborist was no doubt more open-minded than most, and hopefully tempted by the hivers’ bargain fees, she doubted They would award the hivers the Allmond orchard contract—the largest protein and medicinal crop of North America—after witnessing her bees swarm her torso as she moaned and swooned to the dusky red sequoia floor.\n What was taking the Arborist so long? Yes, Arborists were part gardeners, part mechanics, part monks, and often of the neuter gender as this one was, but why did the monk part always seem to hold sway when there was a decision to make?\n The Arborist only nodded slightly in response to Gabhan’s speech. Work-worn hands still held in prayer, They seemed distracted, squinting first at the Sunglass above, then glancing at the doors leading to Their private chambers, the Orchard entrance, and the exits to the waiting sleds, as if uncertain where to stand. Did They need to be perfectly positioned to make Their decision?\n The Arborists had a reputation for demanding absolute perfection—gift and curse, but a necessary trait in running as delicate and critical an ecosystem as a greenhouse—but Mishka hadn’t thought Their perfection extended to physically positioning Themselves in a room. Gabhan and the boy still knelt, bloom proffered up, as if awaiting a king’s command. Damned if she would be the one to move and betray discomfort, not for the itching, nor the heat. Did her bees pulse more, the longer the bloom waited? Or was it her imagination? She just needed to hang on until she won or lost the bid; then she could return to her solo sled, begin the journey back to the hiver community, and let the bees feed themselves into a frenzy, privately.\n A rotten egg smell filled the chamber as gas vented from a duct near the Arborist, ruffling Their cellulosic robes as they scurried away. They began Their squinting, shuffling routine all over again, this time closer to the Allmond orchard entrance. Mishka almost felt sympathy, for the duct near her felt positively volcanic, but why couldn’t the Arborist just monk out Their decision? And They had better not open those orchard doors, for if They did, nothing Mishka did could stop the hive from rising. The boy’s one bloom had teased her bees, but an orchard of blooms? Once her bees smelled real food, real pollen, not the synthetic nectar Mishka produced—which they subsisted on when in sled transit between greenhouses—nothing would keep them hived.\n She was using every breath control and muscle control and mind control and fuck control she could think of to keep the hive calm, to send the message all along her honeycombed curves and blooming nerves that patience was the price to pay for bliss, that calm would win, to stay close to the big queen, stay close to her, queen bee, queen hiver, queen Mishka who cared for and loved these bees as fiercely as if they were her own milk-babies. But the hotter it got the more she itched and she could feel her control slipping, and which would be worse, her forager bees suddenly swarming from the stress? Or a feeding frenzy of the nurse bees erupting, in their mania to tend the little queen and the brood housed in the honeycomb necklace cradled between Mishka’s breasts?\n At least the sulfur smell was gone, and a new sweetness reigned in the air. Thank the honey. But the heat, surely they could retire to a cooler chamber?\n She risked a glance at Gabhan, and saw him cradling Ciro, poor tired boy, fading in the heat, and her concentration slipped, as a bead of nectar dripped down her sternum, and her favorite nurse bee—the one Mishka had stupidly named SingSongSun, right after the surgery, back when she’d been drunk on her own histamines and honey-high, when Singsong’s sweet buzz and guzzle and sun-colored thorax had seemed like a miracle rivaled only by the ongoing persistence of the human spirit—Singsong peeked her antennae out of the honeycomb necklace, and hummed, as if she were answering a question that Mishka hadn’t heard—buzzing delicately but probing with indescribable delicacy, and Mishka couldn’t keep herself from humming the melody of that old father tune she’d loved as a child, and then, of course, the hive rose, unable to resist the cloying sweetness of the air any longer, and her knees guillotined to the sequoia floor—knock knock, knock down—oh oh oh she was in trouble.\n Heat\n “I’m bringing home a baby bumblebee,Won’t my mommy be so proud of me . . . ”—Traditional Children’s Song\n SingSong waited, long as she could. She smelled fear on big queen. She smelled strangeness. She knew to wait, to hide, to keep the hive quiet. But then earth queen hummed, a wrong song, and a strange nectar fell, and little queen buzzed and big queen hummed the birth song she’d sung when Singsong hatched out of her cell, and even fighting the wrongness of the earth hum, Singsong was helpless against the lure of her birth song, its wafting, waggling, pure love calling her and her sisters out out out to forage the world and for once there was nectar enough for all, nectar enough to bathe in, to dream in, to drown in, and the air was its own nectar, wet and warm, so warm, such heat pulling the bees up up up up into the air out of their precious comb, away from big queen, but what treasures they would bring her, such nectar they would find her, and then little queen and big queen could taste of the molten nectar which must be molten, mustn’t it, for the air itself felt like smoke, her Singsong wings were glowing with flame, she must be near the sun, what would big queen give her, supping of the sun?\n She tried, tried to waggle the dance that would tell her sisters how to find the sun. Delectable. Scorching. Glory. Does fire scream? Or was Singsong learning to speak like big queen at last? Where where where was her big queen? She buzzed SingSongSun, SingSongSung, SingSongSun, SingSongSung, which way was up and which way was down?\n No no no. How could she nurse the brood if she couldn’t waggle the dance to the food? The wrong earth queen hum was gone, why couldn’t she think?\n The hive would swarm if she waggled too hard a dance.\n Simple simple, not up, not down.\n Waggle smells. Nurse the brood.\n First find flower. Second find sun.\n Harvest\n “Eat honey, my son, for it is good . . . ”—Proverbs 24:13, The New International Bible\n Ciro didn’t want to open his eyes. That seemed like a bad idea. Even closed, his eyes really, really hurt. And his ears hurt. And his nose. Everything hurt.\n But it couldn’t be that bad, could it, if he was breathing? As long as he was breathing, he could imagine his daddy was breathing, and the bee-woman who’d tried so hard not to smile at him, and even the sad Arborist. As long as Ciro just listened to his breathing, he could pretend everyone was breathing and everything was fine.\n He listened to his own breath, inhaling and exhaling, with a soft “huh.” And then a soft “ha.” And again. Over and over again sounds that started with “h” but didn’t mean as much as Ciro needed them to mean.\n Inhale, exhale, “Huh.”\n Inhale, exhale, “Ha.”\n He couldn’t get rid of the “h” quite, was that okay? But he could stretch the other sound. Wasn’t that how you made words?\n “Huuuuunnnnhh.” No that wouldn’t work.\n “Heeee.” Closer. “Heeeeeelllp.” Right-O.\n That was what he wanted. Help. For something was wrong. He couldn’t move. And he couldn’t feel his hands. Just a burning where his hands should be. When he tried to move the burning, it hurt so much he couldn’t breathe anymore. So he stopped trying to move the burning. No hurting. Just breathing. Make these “huh ha hee” sounds. One more time, he tried.\n “Heeeelllp.”\n Then, far away, there was crawling stickiness, so faint in the burning. Then the crawling became his fingers, his burning fingers. Hurting but he could now breathe. Still burning, but at least fingers again. Then, yummy yummy stickiness on his lips and in his nose and something in his ears, and a tickling all across his skin. Tickling everywhere. Bees! The bees were alive!\n Things must still be okay if the bees were alive and coming to cover him in honey. They must know he’d always wanted to be a bee. Bees were wise like that, he figured. He wanted them to know he loved them, so he said what his daddy always said to him. “Fly, bee, fly.”\n And then the floor hummed away from him, and he felt himself go up up up and Ciro opened his eyes, for he didn’t want to miss learning to fly.\n Hubris\n “He is not worthy of the honey-comb, That shuns the hives because the bees have stings.”—Shakespeare, The Tragedy of Locrine (contested attribution)\n Once the pollinator’s sled departed, the Arborist retreated into the relative safety of Their private chambers. At last. What a terrible day. A terrible duty. They were so tired of making these decisions. Would life only ever subsist of this, choosing the slower way to die? Every year, a worse pollination rate. And now the hivers wanted to try? Ridiculous.\n Now at least, it did not matter. The greenhouse might last long enough for pollination, but by harvest time, there would be no greenhouse left. The internal report was clear. Under the strain of increased seismic activity, the closed loop geothermal system was breaking apart, and no amount of repair or patching could keep the system in place when the real quake came. And in the meantime, toxic gases—hydrogen sulfide, methane, boron, radon, the list went on—were being vented into a greenhouse never equipped for such open-loop toxic gas venting. The accident today might have killed the Arborist, the pollinators, and perhaps that accident could have been averted. But the coming accident, the killing of all those trees, all those stomachs going empty without the Allmonds to feed them, that accident there was no averting.\n The greenhouse was no longer stable, and no human intervention could save them. What could humanity do in the face of seismic waves, pummeling through ocean and land, their hums buckling the very earth? Today’s events had clarified Their mind. They saw again the child Ciro flying through the air with such faith and grace, and landing without a care in the world. Soon that grace would be a ghost too.\n Like the boy’s hands, burned beyond recognition, beyond use, in spite of the healing properties of the unexpected hiver honey, and Their healing skills and silver-soaked antiseptic bandages. Nothing could save the boy’s hands, and nothing could save the greenhouse.\n Better not to prolong this sacrilege of false gardens and failing gardeners. Better to let the world fall again, as God ordained every time. There were some choices They could still make. Some perfections were still attainable. Standing on the Mission table They had once used as a desk—a reminder that life was service and life without service, no life at all—They looped a rope around the exposed pine log bracing the ceiling, pulled tight below Their larynx, and right before kicking the table out, They said the oldest prayer They knew: Please please please.\n Home\n “Thus, I can understand how a flower and a bee might slowly become, either simultaneously, or one after the other, modified and adapted in the most perfect manner to each other, by the continued preservation of individuals presenting mutual and slightly favourable deviations of structure.”—Darwin, Origin of the Species\n “You’re safe, don’t worry.” The voice was familiar, and seemed concerned, despite the reassuring words.\n She felt the familiar swaying of a sled beneath her, but not her sled, surely. Too much darkness, and too much room. And the smell of pickled vegetables—beets maybe? So not her sled, but one equipped for long distances. Where was she?\n “My bees, ow . . . ” Mishka’s throat scraped, as if she’d swallowed sandpaper. Her eyes were tearing so much she couldn’t see, nor could she smell. Why couldn’t she smell anything? And where was the warm, pulsing, crawling comfort of her bees?\n “There was an accident.”\n Could that be Gabhan? Was he the blurry figure hovering over her? This must be his sled. Of course a hand-pollinator’s sled would be equipped with its own sustenance for cross-continent travel.\n “Sulfur explosion. We did the best we could. We were all knocked unconscious, but once I woke, I pulled you clear. You were almost on top of the duct when it blew, and last I’d seen you’d fallen to your knees, well . . . we didn’t know if you were still alive. I should have been suspicious when Ciro fainted.” His voice narrowed, an open road squeezed into a too small tunnel. “Apparently there have been quakes for quite a while. The Arborist told us that, at least, before ordering us to evacuate, but . . . he should have told us sooner. Should have told a lot of people. We could have transplanted the orchard, re-rigged the closed system into a bouncer, converted it to an open geothermal unit with enough time, something . . . ”\n “Bouncer?” She still couldn’t focus. She was nauseous, and he wasn’t making that much sense. But, at least she was no longer itching. Oh no. She couldn’t feel her bees, and she couldn’t feel the itching—had she lost everything? But no, when she touched her throat it was still reassuringly sticky with nectar. Pressing down her torso, she felt rivulets of undrunk nectar. But what solace would there be in being a hiver, if the bees she’d changed her very nature for had died? “I’m sorry. My bees? Where are my bees?” She struggled to get up.\n “Please. Don’t try to move yet. I’m afraid most of your bees are gone. I thought it best to evacuate you with us. Your sled was damaged in the blast and Ciro, well—” He coughed. The tunnel of his voice tightened further. “I was knocked out for a while, and then when the Arborist was bandaging Ciro . . . I’m sorry, I was distracted. Most of them flew away. I didn’t see where.”\n She couldn’t blame them for swarming to a new hive. Not when she’d just been knocked silly by a gas explosion. And they wouldn’t have swarmed to the sled if it had been damaged. The sled could be replaced. The bees couldn’t. They couldn’t all be gone, could they? “They all flew away?”\n “A few we found on the floor around you, not moving and we hoped they were only stunned. Once it was cool enough, I retrieved them. And your necklace, we have that.”\n Thank the honey. “Where is it?”\n “Ciro has it. I hope you don’t mind. He—he burned his hands.” The tunnel of his voice squeezed shut.\n She didn’t understand. “His hands? Why is he wearing my necklace? What happened?”\n “The bees saved me.” Now the boy, his voice lighter but somber. At least her ears still worked.\n “What?”\n “They saved me. They fed me honey and put honey in my ears and then I flew with them. Then a bunch of them left, but the rest crawled into your necklace.”\n “That’s right, son. Quite a lucky little bee you are.”\n For a minute, talking to Ciro, there’d been some hint of the Gabhan from the atrium—his voice full of assurance and warmth—but then he whispered in her ear, and his voice caved-in, shutting out hope. “The boy’s been through a lot. Breathing that much gas and fourth-degree burns can cause hallucinations, especially in one so small. I think the bees were drawn to the flower, to him. He probably had traces of pollen on his hands and mouth. He used to lick his paintbrush and fingers, no matter how I scolded.\n “No scolding anymore, right, Ciro?” The hearty assurance was back, but all she could hear were the cracks.\n “But it’s true, the bees did save me! I’m sorry so many of them died, but these are alive. They were worried about you.” His voice trembled, and in spite of the pain and the nausea, Mishka smiled. He wasn’t feigning now, whatever had happened, he believed the bees had saved him.\n “Look!” He thrust something right in front of her face.\n She blinked, her vision clearing a bit. Against the gauzy white of his limbs, she could distinguish a fist-sized smudge of sun-yellow, catching her breath with its promise. Her honeycomb necklace—heart of her hive.\n “Here!”\n She cradled the necklace as gently as she could, her fingers delicately tap-tap-tapping against the comb—a hum answered, and tears blossomed in her eyes.\n Her little queen, her nurses, some of her brood were alive. She would be able to rebuild her hive. There were other greenhouses, other bids. All was not lost.\n “Will you teach me to feed the bees? Like you do?”\n And here in front of her was this injured child, looking at her with such hope.\n “It’s not that simple, I’m afraid.”\n Ciro’s smile slipped. “But I think this one likes me. He’s been feeding me honey the whole time.”\n “She. The bee is a she.”\n “Oh.” A pause. “But it has a penis. Look!”\n And he thrust a bee right under her nose, a slightly larger than average bee, golden as the sun. Of course Singsong would have survived, possibly even nursed the boy with honey. What a miracle she was.\n “See?” He pointed to Singsong’s stinger. “I told you he has a penis!”\n Mishka couldn’t help but laugh and even Gabhan chuckled, as they both tried to explain what exactly a stinger was and why all of Mishka’s bees were girls, and the laughter brought hope with it, as it always does.\n “Please teach me to help the bees, okay? I’ll do anything.”\n But no amount of laughter would make it possible for a male to become a hiver, even if he would do anything. Gabhan was a hand-pollinator; he must know that hivers had to be female. “Gabhan, hivers all have to be—”\n “He needs something to think about while he waits for the bandages to come off.” The words were quick as cuts, quick enough to cut her sentence off forever, but light as pollen blown by the wind, as if by keeping his tone light, the words would never land, and never landing, time would cease, and those bandages would never have to come off. For what would happen when the bandages came off? What would a hand-pollinator do without hands? If Gabhan couldn’t face those questions yet, she couldn’t blame him.\n She inhaled deeply. What a mash of smells in the warm sled. Pickled beets. The honey of her bees. Gabhan’s scared fierce musk. Her own fear-sweat and sweet-nectar, clouding the terrible burned smell of what remained of Ciro’s hands. What agony for the boy—she was sure he’d become coerced into hand-pollination, and that coercion had led to catastrophe. What could she say? Singsong at least seemed to have picked the boy. That counted for something. Maybe right now, that counted for everything.\n “Okay. I’ll teach you what I can. Come here.”\n The boy whooped. “I knew you’d help. I just knew it!”\n Carefully, finally, after hours of not itching, Mishka gently, gently scratched her clavicle—at last! Even in the midst of catastrophe, a surge of joy welled as fresh nectar began to flow, and Singsong suckled. “Do you see her tongue? It’s a kind of straw. We call it her glossa, or proboscis.”\n “What does she call it?”\n Mishka chuckled. Even Singsong seemed to buzz a honeybee laughter. “I don’t know, Ciro. Maybe you’ll be the one to find out.”\n And for a moment, it seemed as if in spite of the whole disaster, everything was going to be all right. Who knew what apiarists could do, with a nurse bee and a devoted four-year-old boy?\n Mishka wouldn’t be the one to say no, nothing is possible. Say no today, and there may not be a tomorrow. Maybe the Allmond greenhouse was doomed. Maybe all the greenhouses along the fault line were doomed. Or maybe they’d sled back tomorrow and find the Arborist was dead wrong in Their catastrophic doomsaying. But there were other continents, and other ways of heating greenhouses.\n For as long as Singsong could fly and find flowers, and for as long as there were Ciros willing to do anything they could to help the bees, there could be a tomorrow. And as long as there could be a tomorrow, there was a chance. A chance that humanity could adapt. Keep calling this place home. Wasn’t that what they’d always wanted, even back when Earth was called Eden?\n Honeycomb\n “This we have now/is not imagination . . . This/ that we are now/created the body, cell by cell,/like bees building a honeycomb./The human body and the universe/grew from this, not this/from the universe and the human body.”—Rumi, The Essential Rumi\n SingSong waited. She wanted to save little queen, save big queen, save earth queen.\n But all she could do was see if the child would wake. Taste the honey. Tend the honey.\n Every night, the same wait. The boy had survived. But each darkness she doubted if he would breathe come dawn.\n She could always go impale herself on a frozen branch of a petrified tree, suss the ice nectar of a forgotten species, call that consummation.\n But for now she would wait. If the child woke, they would begin again. Pollinate one flower. Waggle one dance. Nurse one bee. Didn’t matter boy child or girl child, it was a child. And children could learn. Create. Mate. Come awake.\n Humans were not earth queen, able to change the hum on a whim—but maybe she and big queen and little queen and the child could make a new hive, and survive the whims and untamed hums of earth queen.\n Breathe with me, she buzzed.\n Ravish today; make us a tomorrow.\n Krista Hoeppner Leahy is a writer and actor. Her work has appeared in ASIM, Farrago's Wainscot, Lady Churchill's Rosebud Wristlet, Shimmer, Tin House, The Way of the Wizard, The Year's Best Science Fiction and Fantasy 2014, and elsewhere. She attended the Odyssey Writing Workshop in 2007 and lives in Brooklyn with her husband and two children. She also loves and worries about the bees of our world. Check out www.honeylove.org and www.thehoneybeeconservancy.org if you do too."}