{"fingerprint": "6sFnuSzcr6/4+HHFhap5PGVx/Ts=", "sitename": "Clarkesworld Magazine", "title": "Distant Stars by P H Lee", "author": "P H Lee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lee_04_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Distant Stars by P H Lee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3240 words, short story\n Distant Stars\n “Spin me, mommy, spin me!”\n You are four years old and in the afternoon sun in the backyard of our collapsing New Brunswick rental. Martha’s at work and I’m supposed to be watching you and studying for next month’s quals, so I’m sitting in a plastic lawn chair making a half-hearted attempt to outline Wald’s General Relativity.\n “Mommy’s got to study for her test,” I say without looking up. “Can’t you spin yourself?”\n You’re supposed to be playing by yourself. We’d made an agreement. But you’re four and you’re bored and agreements don’t matter.\n “Don’t wanna spin myself.”\n I look up and see the tantrum brewing on your face.\n You’re four years old and it’s a beautiful afternoon and what the hell. I bookmark Wald and get up from my lawn chair. “Okay, kid. You got me. Let’s spin.” Your whole face lights up and I think about quals next month and hope to whomever that I’ve made the right decision.\n You hold up your hands. I walk over to you. I grab your wrists; you grab mine. I lift you up. “Oof, kid, you’re getting kinda heavy for this.”\n “Spin me!” you demand, and I do, slowly at first, then faster, faster. Your feet lift off the ground, flying out from us, and you look at me and begin to laugh. It’s the most beautiful thing in the world, that moment, you laughing there in our overgrown backyard in the afternoon sun while the whole universe spins around us.\n I smile, then grin, then I start to laugh, which makes you laugh more, which makes me laugh more. I spin you around and around and I don’t let go.\n When you spin around, your arms fly out to your sides.\n Everyone knows that. But here’s the problem: no one knows why.\n Linear motion—back and forth—is relative. From a physical perspective, you can’t tell if you’re the one moving or if the world is moving around you. Circular motion—orbits, say—is relative as well. But spinning is, for some reason, absolute. If you spin, with your arms flying out to your sides, it seems to you like the whole world spins around you. But if you put every object around you on a circular track, and make them spin around you, your arms don’t fly out to your sides, no matter how fast they spin around.\n That’s not how physics should work. Motion should be relative, not absolute. But no amount of theory can explain it away. Anyone can test it, even you, four years old in our overgrown backyard behind the half-collapsed wooden fence: you spin around; your arms fly out to your sides.\n Einstein theorized that rotation is with respect to “the distant stars”: When you spin at night the stars spin around above you. That’s how you can tell it’s you spinning and not the room. Einstein called this idea “Mach’s principle,” because Einstein knew better than to put his name on a shameless kludge.\n When you spin around, your arms fly out to your sides. No one knows why. One hundred and fifty years ago, we put a name on our ignorance, and we’ve learned absolutely nothing about it since.\n It’s after your bedtime, so Martha and I are fighting again.\n “It was a good job! Tenure track!”\n “It’s a shit job and I wasn’t going to get it. Do you know who gets tenure track jobs? Straight guys from Princeton named Chet!”\n “Oh, so now it’s the patriarchy’s fault?”\n “I’m just saying that—”\n “You’re so full of shit, Sar! Why won’t you take this seriously?”\n “I am taking this seriously!”\n “Oh, really? Because I just see you sitting on your ass binging Netflix while I’m working two jobs and raising our son.”\n “That is not fair! I have been—”\n “I don’t really give a shit what you’ve been doing. I supported you through grad school and you were going to get a job. That was the deal!”\n “If I could just publish a paper, I mean a real one—”\n “If you could just publish a paper? You knew that no one was interested in Mach’s principle when you started! Dr. Treuer told you it was a career killer! He used those exact words!”\n “So now you’re an expert on general relativity?”\n “Fuck off, Sarah. If you think I’m going to keep dragging your ass—”\n “It’s just a terrible job market—”\n “I don’t give a shit if it’s a terrible job market! I give a shit that you can’t even bother to apply. I mean, Jesus Christ, we can’t live like we’re in our 20s anymore. We’ve got bills to pay, a son for God’s sake—”\n “I’m not the one who wanted to have a kid while I was applying to grad school!”\n That’s when I see the white tail of your Eevee pajamas sticking out from behind the couch.\n “Kid?” I ask in the softest voice I can manage. Caught out, you dash back toward your room. Martha practically deflates and starts crying.\n “Sweetie, honey,” I run after you, talk through your door. “Honey, I didn’t mean it like that. I love you so much, I promise.”\n Why should the motion of your arms, spinning around in the light of a backyard afternoon when you were four years old, depend on the motions of galactic clusters ten billion years ago and ten billion years away? It’s infuriating. It’s unreasonable. The universe shouldn’t work like that. And yet, no matter how infuriated or reasonable we get, it still does.\n If you lock some physicists in a spinning room, where we can’t see the distant stars, we shouldn’t be able to tell whether we were in a spinning room or a gravity field. We wouldn’t, if spinning made sense. But we can, because gradually, over time, the spinning will make objects curve away from us. Slowly at first, but accelerating, faster and faster, always further away.\n I’m cramped into our front room with your granddad’s old roller suitcase. I’m dripping with summer sweat and crying and trying to remember what I forgot to pack. I’m not surprised by the divorce—I’m devastated, but at least I’m not surprised.\n Martha is standing in the kitchen door, watching me with her arms crossed, doing her very best not to yell and not to take me back. You’re hiding behind her, nine years old and overwhelmed. I crouch down and meet your eyes.\n “Hey, kid,” I say, “come here and give your mom a hug.”\n Slowly, tentatively, you come out from behind Martha and walk over to me. I hug you tight and you let me.\n “I know this is hard,” I say, as if I’m not the one bawling my eyes out. “And it’s just going to be you and Mama for a while.”\n You nod against my shoulder.\n I want to tell you that it’s not my fault. I want to tell you why: that my name isn’t on your birth certificate, or that Martha’s parents got her a better lawyer. I want to tell you that not having custody rights doesn’t mean I love you any less.\n “Remember that I love you,” I finally say. “I love you more than anything, and I promise I’ll see you again soon.”\n You lean over and whisper in my ear. “I love you too, Mom.”\n Martha taps her watch and it takes all I’ve got not to scowl at her. “Okay, kid. Take good care of Mama. See you soon.”\n “See you soon,” you say, and smile, but I know you don’t mean it.\n Back in the nineteenth century, when physicists didn’t understand something, they called it a principle. Here in the twenty-first century, we call it “Dark”: Dark Matter and Dark Energy and Dark whatever they come up with next.\n Dark Energy, particularly, isn’t really dark and isn’t really energy. It’s a way of saying this: we expected, when we looked at distant galaxies, that they’d be moving away from us. But we didn’t expect that they’d be moving away from us faster and faster. Dark Energy means that the entire universe is accelerating away from us. And it means that we have no idea why.\n Or, at least, we had no idea why. Until I got an idea.\n It’s stupid of me to even try. I’m in my fourth year on the job market, not that I’m applying to anything, adjuncting out of a tiny apartment in south Seattle, five different courses at five different colleges for pennies an hour, sending Martha whatever fraction for child support I have at the end of the month. But I’ve finally got an idea, a real one, and I can’t just let it go.\n I title the paper “Dark Energy in Non-Inertial Reference Frames.” I don’t even bother submitting it to journals—who was going to take a paper from some failure of an adjunct?—and just upload it directly to arxiv.org.\n No one responds in the first week.\n No one responds in the second week.\n Then, in the third week, I get an e-mail. From an actual professor at an actual university, and not just any university, the UCSB Institute. “Fascinating article,” it says, followed by a series of corrections to my tensor models.\n By the time I’m finished reading it, I have five more e-mails. MIT, UChicago, the works. By the time I’m done with those I have a dozen. And then I have a hundred.\n You’re at home—with Martha and her new wife Kyla—and we’re talking on the phone. We usually only talk on the phone on Sundays. Martha doesn’t like it when we talk, no matter what she says otherwise. But it’s a special occasion and I’m calling on a school night.\n “Oh, honey, I can’t believe you’re graduating high school already. I’m so proud of you. You know how proud of you I am, right?”\n “I know,” you say. “It’s not that big a deal.”\n “Graduating at 16 is a pretty big deal!”\n “It’s really not. Classes are easy. Mom says—” you call Martha “Mom” now even though I was always Mom and she was Mama—“that at least I got my brains from you.”\n “I’d really love to be at your graduation, I’m so sorry—”\n “Mom! It’s fine!”\n “Or you could come with me! I know it’s late but I can spring for a plane ticket.”\n “Mom. We already talked about this. Kyla doesn’t want me to go. She’s worried about the plane.”\n Kyla is worried about a lot of things. I have my suspicions, but I know better than to say anything.\n Finally, I just say, “I’m going to miss you.”\n “Mom: I know. It’s okay. Go enjoy the freaking Nobel Prize dinner.”\n After the Nobel Prize, I get a lot of e-mails. Most of it is cranks and I don’t answer. But this morning I’m in a good mood—probably because you just got accepted into the NASA training program—so when I get one of those e-mails I decide to read it.\n “I have been reading your theories with interest,” it begins, “and I think there is a method to test your theories.” It goes on in some detail about gyroscopes and magnets and space-like curves, and I can’t follow it. But it’s signed Wu Hsi-ing, Tsing Hua National University.\n Tsinghua is a big deal. I call and the phone rings three times before I remember that it’s still the middle of the night in China and it’s too late to hang up.\n “喂?” says a groggy voice at the other end of the line.\n “Dr. Wu? This is Sarah Levy. I got your e-mail.”\n “Ah,” she says, uncomfortable in English. “Dr. Levy.”\n “I wanted to ask you a few questions about it.”\n By the time she tells me that she’s not at Tsinghua University in Beijing, but Tsing Hua National University in Taiwan, we’re already well underway.\n I’m in Hsinchu for yet another meeting with Hsi-ing when you call.\n It’s Martha. She just collapsed in the middle of the day. Nothing to be done. The doctors say she wasn’t even conscious when she hit the ground. No pain. Could have happened to anyone.\n “Oh God. I’m so sorry. I’ll fly back right away.”\n “You really don’t have to.”\n “You’re going to need help. There’s so much to deal with. Probate and funerals and—”\n “M—Sarah. I’ve got it. And Kyla’s here to help me. It’s okay. Keep doing your research.”\n “This is important, though. This is family.”\n You laugh nervously.\n “What is it?” I ask.\n “Well,” you say, not willing to say it.\n “What?”\n “It’s just that—Kyla’s already here. And if you show up—you know how she is. It’ll be a whole thing.”\n “But I want to be there.”\n “I know you do, and I appreciate it, but I really think that it’d be easier for everyone if you didn’t come.”\n My stomach.\n “Are you okay?” you ask.\n “I’m fine,” I lie. “I love you.”\n A pause. “I love you too.”\n And then I’m alone in my hotel room in the middle of the night in Hsinchu and Martha’s dead and I can’t even bring myself to cry.\n Hsi-ing’s idea is simple. If the reason for Dark Energy is that the universe is spinning (technically: is a non-inertial reference frame), then there should be a way for us, ourselves, to stop spinning along with the universe. If we did that, we would exist in an entirely different space-time frame—not expanding, not contracting, but simply existing in flat relative motion.\n Her experimental apparatus—an array of very accurate gyroscopes and counter masses—is designed to do exactly that. They’re brilliant because she’s brilliant. To be honest, I don’t fully understand the mechanics.\n One of the side effects of this is that objects within the apparatus seem to disappear and then reappear elsewhere nearly instantaneously.\n Once the media gets a hold of it, it’s a circus. IFLScience.com dubs her experiment the “Wu-Levy Drive.” (It’s not a drive. It’s doesn’t even go anywhere, or move through space at all. Not that that stops the endless wash of clickbait across my Facebook feed every morning.)\n To work well and safely, the experiment should be conducted in as flat a space-time as possible, away from any significant source of gravity. It should be conducted in space. Which means that to test this, we’re going to need to work with NASA.\n NASA is happy to work with us. Thrilled.\n I only agree to the press conference because I know you’re going to be there. I hate press conferences so much that I’ve cultivated a reputation as a recluse to avoid them. But NASA loves to make headlines, and “Astronaut son of Sarah Levy to test pilot the Wu-Levy drive” will certainly get them some headlines.\n I bet that they asked you to change your last name. So we’d match. I’m so glad you didn’t.\n I’m sitting in the green room at Two Independence Square. Everyone is moving around me, fussing, fixing, and they’ve slathered me in more makeup than I’ve worn for the past twenty years combined.\n I see you, coming out of your own room, right behind the press agent who is telling me, again, to make sure I look into the cameras. I lift my hand to wave, but you’re already on your way and you don’t see me.\n The press conferences goes okay. You’re perfect—“perfectly safe” “been tested on drones and bats and monkeys and even a particular chinchilla” “very excited” “the team on the ground are the real heroes, I just go where I’m sent.”\n When it’s my turn to speak, though, I forget to look into the cameras.\n After the press conference, I ask if you want to get dinner, but you already have plans.\n I think about you every day. Is that surprising? But of course I think about you. I love you. I still love you.\n Something, somewhere, went wrong. Somehow, for some reason, this distance between us keeps growing and growing. I want so much to understand it, to confront it, to reverse it. To hug you and hold you close and just to talk, about anything at all. I want, I hope, but I know it can’t happen. I just don’t know why.\n My love for you feels like an incomplete theory. I have all the pieces, but I just can’t put them together into any kind of understanding. And at the end of all my work, all I have is this shameless kludge: I love you. I still love you. I never stopped.\n I’m with you at Vandenberg on launch day. NASA would never let us miss a photo op. So while you’re walking out toward the rocket, while the press is gaggling all around us, I take your hand and squeeze it. You squeeze back and smile at me.\n I hug you. The press loves it—we can both hear all the shutters.\n “I love you, kid,” I say, although I’m not sure that you can hear me.\n “I love you too, Mom,” you reply. Your voice is uncomfortable and strained, but of course there’s the whole mission in front of you.\n I don’t know if you mean it. But I tell myself you do.\n Once upon a time, we thought that the expansion of the universe, braked by gravity, would slow down, stop, and reverse. Once upon a time, we thought that the distant stars and galaxies would one day return to us, that we would, in some distant future, be together again.\n But now we’ve learned. Now, we know better. Any contraction, any reunion with the distant stars we left behind at the beginning of the universe, is impossible. The space between galaxies is accelerating. There is no reunion in our future, only distance, and more distance, and finally isolation.\n We’ll spin further and further apart, faster and faster, until we all become completely isolated, until the space between us is unbridgeable and there is no clue for each of us that the other was ever there at all.\n The phone rings at four in the morning and I think maybe it’s you and I pick it up.\n “Dr. Levy?” asks the voice on the other end. It’s not you. My stomach.\n “Yes?”\n “Dr. Levy. We just thought . . . There’s been an . . . We’re not sure . . . We’re trying everything we can. We recovered the machine, but he was . . . that is . . . We just wanted you to know before it hit the news tomorrow.”\n You were four years old in our overgrown backyard, and I held your hands and spun you around, and you started laughing, and I started laughing, and I never let you go.\n “We’re trying everything we can. But we may not get him back.”\n By the time Martha got home, she found us both still laughing, flat on our backs, exhausted and dizzy, looking up at the sunset clouds through the tall grass. She frowned at us, and we tried to explain, but we both kept laughing until it was dark and she was laughing too and none the wiser.\n “Dr. Levy?”\n We walked hand in hand—me on the left and Martha on the right and you in the middle—down the block for pizza. You announced that you were going to get pineapple, and Martha threatened jalapeños. I made a face. In the night sky above us, the universe and all its galaxies spun themselves away from us, never to return.\n P H Lee lives with the rose bushes behind an old walnut tree down a dead-end road out past the highway. Their other writing has appeared in Uncanny Magazine, Visions Magazine, Worlds Without Master, and Four Ways to Die in the Future. Their hobbies include cooking and translating Classical Chinese texts."}