{"fingerprint": "68oF5Rl+u8b7SLGbHAiAVMmcDw0=", "sitename": "Clarkesworld Magazine", "title": "Blue Ink by Yoon Ha Lee", "author": "Yoon Ha Lee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lee_08_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Blue Ink by Yoon Ha Lee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2700 words, short story\n Blue Ink\n It’s harder than you thought, walking from the battle at the end of time and down a street that reeks of entropy and fire and spilled lives. Your eyes aren’t dry. Neither is the alien sky. Your shoulders ache and your stomach hurts. Blue woman, blue woman, the chant runs through your head as you limp toward a portal’s bright mouth. You’re leaving, but you intend to return. You have allies yet.\n Blue stands for many things at the end of time: for the forgotten, blazing blue stars of aeons past; the antithesis of redshift; the color of uncut veins beneath your skin.\n This story is written in blue ink, although you do not know that yet.\n Blue is more than a fortunate accident. Jenny Chang usually writes in black ink or pencil. She’s been snowed in at her mom’s house since yesterday and is dawdling over physics homework. Now she’s out of lead. The only working pen in the house is blue.\n “We’ll go shopping the instant the roads are clear,” her mom says.\n Jenny mumbles something about how she hates homework over winter break. Actually, she isn’t displeased. There’s something neatly alien about all those equations copied out in blue ink, problems and their page numbers. It’s as if blue equations come from a different universe than the ones printed in the textbook.\n While her mom sprawls on the couch watching TV, Jenny pads upstairs to the guest room and curls up in bed next to the window. Fingers of frost cover the glass. With her index finger, Jenny writes a list of numbers: pi, H0 for Hubble’s constant, her dad’s cellphone number, her school’s zip code. Then she wipes the window clear of mist, and shivers. Everything outside is almost blue-rimmed in the twilight.\n Jenny resumes her homework, biting her nails between copying out answers to two significant figures and doodling spaceships in the margins. There’s a draft from the window, but that’s all right. Winter’s child that she is—February 16, to be exact—Jenny thinks better with a breath of cold.\n Except, for a moment, the draft is hot like a foretaste of hell. Jenny stops still. All the frost has melted and is running in rivulets down the glass. And there’s a face at the window.\n The sensible thing to do would be to scream. But the face is familiar, the way equations in blue are familiar. It could be Jenny’s own, five ragged years in the future. The woman’s eyes are dark and bleak, asking for help without expecting it.\n “Hold on,” Jenny says. She goes to the closet to grab her coat. From downstairs, she hears her mom laughing at some TV witticism.\n Then Jenny opens the window, and the world falls out. This doesn’t surprise her as much as it should. The wind shrieks and the cold hits her like a fist. It’s too bad she didn’t put on her scarf and gloves while she was at it.\n The woman offers a hand. She isn’t wearing gloves. Nor is she shivering. Maybe extremes of temperature don’t mean the same thing in blue universes. Maybe it’s normal to have blue-tinted lips, there. Jenny doesn’t even wear make-up.\n The woman’s touch warms Jenny, as though they’ve stepped into a bubble of purloined heat. Above them, stars shine in constellations that Jenny recognizes from the ceiling of her father’s house, the ones Mom and Dad helped her put up when she was in third grade. Constellations with names like Fire Truck and Ladybug Come Home, constellations that you won’t find in any astronomer’s catalogue.\n Jenny looks at her double and raises an eyebrow, because any words she could think of would emerge frozen, like the world around them. She wonders where that hell-wind came from and if it has a name.\n “The end of the world is coming,” the blue woman says. Each syllable is crisp and certain.\n I don’t believe in the end of the world, Jenny wants to say, except she’s read her physics textbook. She’s read the sidebar about things like the sun swelling into a red giant and the universe’s heat-death. She looks up again, and maybe she’s imagining it, but these stars are all the wrong colors, and they’re either too bright or not bright enough. Instead, Jenny asks, “Are my mom and dad going to be okay?”\n “As okay as anyone else,” the blue woman says.\n “What can I do?” She can no more doubt the blue woman than she can doubt the shape of the sun.\n This earns her a moment’s smile. “There’s a fight,” the blue woman says, “and everyone fell. Everyone fell.” She says it the second time as though things might change, as though there’s a magic charm for reversing the course of events. “I’m the only one left, because I can walk through possibilities. Now there’s you.”\n They set off together. A touch at her elbow tells Jenny to turn left. There’s a bright flash at the corner of her eyes. Between one blink and the next, they’re standing in a devastated city, crisscrossed by skewed bridges made of something brighter than steel, more brilliant than glass.\n “Where are we?” Jenny asks.\n “We’re at humanity’s last outpost,” the blue woman says. “Tell me what you see.”\n “Rats with red eyes and metal hands,” Jenny says just as one pauses to stare at her. It stands up on its hind feet and makes a circle-sign at her with one of its hands, as if it’s telling her things will be all right. Then it scurries into the darkness. “Buildings that go so high up I can’t see their tops, and bridges between them. Flying cars.” They come in every color, these faraway cars, every color but blue. Jenny begins to stammer under the weight of detail: “Skeletons wrapped in silver wires”—out of the corner of her eye, she thinks she sees one twitch, and decides she’d rather not know—“and glowing red clocks on the walls that say it’s midnight even though there’s light in the sky, and silhouettes far away, like people except their joints are all wrong.”\n And the smells, too, mostly smoke and ozone, as though everything has been burned away by fire and lightning, leaving behind the ghost-essence of a city, nothing solid.\n “What you see isn’t actually there,” the blue woman says. She taps Jenny’s shoulder again.\n They resume walking. The only reason Jenny doesn’t halt dead in her tracks is that she’s afraid that the street will crumble into pebbles, the pebbles into dust, and leave her falling through eternity the moment she stops.\n The blue woman smiles a little. “Not like that. Things are very different at the end of time. Your mind is seeing a translation of everything into more familiar terms.”\n “What are we doing here?” Jenny asks. “I—I don’t know how to fight. If it’s that kind of battle.” She draws mini-comics in the margins of her notes sometimes, when the teachers think she’s paying attention. Sometimes, in the comics, she wields two mismatched swords, and sometimes a gun; sometimes she has taloned wings, and sometimes she rides in a starship sized perfectly for one. She fights storm-dragons and equations turned into sideways alien creatures. (If pressed, she will admit the influence of Calvin and Hobbes.) But unless she’s supposed to brain someone with the flute she didn’t think to bring (she plays in the school band), she’s not going to be any use in a fight, at least not the kind of fight that happens at the end of time. Jenny’s mom made her take a self-defense class two years ago, before the divorce, and mostly what Jenny remembers is the floppy-haired instructor saying, If someone pulls a gun on you and asks for your wallet, give him your wallet. You are not an action hero.\n The blue woman says, “I know. I wanted a veteran of the final battles”—she says it without disapproval—“but they all died, too.”\n This time Jenny does stop. “You brought them here to die.”\n The woman lifts her chin. “I wouldn’t have done that. I showed them the final battle, the very last one, and they chose to fight. We’re going there now, so you can decide.”\n Jenny read the stories where you travel back in time and shoot someone’s grandfather or step on some protozoan, and the act unravels the present stitch by stitch until all that’s left is a skein of history gone wrong. “Is that such a good idea?” she asks.\n “They won’t see us. We won’t be able to affect anything.”\n “I don’t even have a weapon,” Jenny says, thinking of the girl in the mini-comics with her two swords, her gun. Jenny is tolerably good at arm-wrestling her girl friends at high school, but she doesn’t think that’s going to help.\n The woman says, “That can be changed.”\n Not fixed, as though Jenny were something wrong, but changed. The word choice is what makes her decide to keep going. “Let’s go to the battle,” Jenny says.\n The light in the sky changes as they walk, as though all of winter were compressed into a single day of silver and grey and scudding darkness. Once or twice, Jenny could almost swear that she sees a flying car change shape, growing wings like that of a delta kite and swooping out of sight. There’s soot in the air, subtle and unpleasant, and Jenny wishes for sunglasses, even though it’s not all that bright, any sort of protection. Lightning runs along the streets like a living thing, writing jagged blue-white equations. It keeps its distance, however.\n “It’s just curious,” the blue woman says when Jenny asks about it. She doesn’t elaborate.\n The first sign of the battle, although Jenny doesn’t realize it for a while, is the rain. “Is the rain real?” Jenny says, wondering what future oddity would translate into inclement weather.\n “Everything’s an expression of some reality.”\n That probably means no. Especially since the rain is touching everything in the world except them.\n The second sign is all the corpses, and this she does recognize. The stench hits her first. It’s not the smell of meat, or formaldehyde from 9th grade biology (she knows a fresh corpse shouldn’t smell like formaldehyde, but that’s the association her brain makes), but asphalt and rust and fire. She would have expected to hear something first, like the deafening chatter of guns. Maybe fights in the future are silent.\n Then she sees the fallen. Bone-deep, she knows which are ours and which are theirs. Ours are the rats with the clever metal hands, their fingers twisted beyond salvage; the sleek bicycles (bicycles!) with broken spokes, reflectors flashing crazily in the lightning; the men and women in coats the color of winter rain, red washing away from their wounds. The blue woman’s breath hitches as though she’s seeing this for the first time, as though each body belongs to an old friend. Jenny can’t take in all the raw death. The rats grieve her the most, maybe because one of them greeted her in this place of unrelenting strangeness.\n Theirs are all manner of things, including steel serpents, their scales etched with letters from an alphabet of despair; stilt-legged robots with guns for arms; more men and women, in uniforms of all stripes, for at the evening of the world there will be people fighting for entropy as well as against it. Some of them are still standing, and written in their faces—even the ones who don’t have faces—is their triumph.\n Jenny looks at the blue woman. The blue woman continues walking, so Jenny keeps pace with her. They stop before one of the fallen, a dark-skinned man. Jenny swallows and eyes one of the serpents, which is swaying next to her, but it takes no notice of her.\n “He was so determined that we should fight, whatever the cost,” the blue woman says. “And now he’s gone.”\n There’s a gun not far from the fallen man’s hand. Jenny reaches for it, then hesitates, waiting for permission. The blue woman doesn’t say yes, doesn’t say no, so Jenny touches it anyway. The metal is utterly cold. Jenny pulls her fingers away with a bitten-off yelp.\n “It’s empty,” the blue woman says. “Everything’s empty.”\n “I’m sorry,” Jenny says. She doesn’t know this man, but it’s not about her.\n The blue woman watches as Jenny straightens, leaving the gun on the ground.\n “If I say no,” Jenny says slowly, “is there anyone else?”\n The blue woman’s eyes close for a moment. “No. You’re the last. I would have spared you the choice if I could have.”\n “How many of me were there?”\n “I lost count after a thousand or so,” the blue woman says. “Most of them were more like me. Some of them were more like you.”\n A thousand Jenny Changs, a thousand blue women. More. Gone, one by one, like a scatterfall of rain. “Did all of them say yes?” Jenny asks.\n The blue woman shakes her head.\n “And none of the ones who said yes survived.”\n “None of them.”\n “If that’s the case,” Jenny says, “what makes you special?”\n “I’m living on borrowed possibilities,” she says. “When the battle ends, I’ll be gone too, no matter which way it ends.”\n Jenny looks around her, then squeezes her eyes shut, thinking. Two significant figures, she thinks inanely. “Who started the fight?” She’s appalled that she sounds like her mom.\n “There’s always an armageddon around the corner,” the blue woman says. “This happens to be the one that he found.”\n The dark-skinned man. Who was he, that he could persuade people to take a last stand like this? Maybe it’s not so difficult when a last stand is the only thing left. That solution displeases her, though.\n Her heart is hammering. “I won’t do it,” Jenny says. “Take me home.”\n The blue woman’s eyes narrow. “You are the last,” she says quietly. “I thought you would understand.”\n Everything hinges on one thing: is the blue woman different enough from Jenny that Jenny can lie to her, and be believed?\n “I’m sorry,” Jenny says.\n “Very well,” the blue woman says.\n Jenny strains to keep her eyes open at the crucial moment. When the blue woman reaches for her hand, Jenny sees the portal, a shimmer of blue light. She grabs the blue woman and shoves her through. The last thing Jenny hears from the blue woman is a muffled protest.\n Whatever protection the blue woman’s touch afforded her is gone. The rain drenches her shirt and runs in cold rivulets through her hair, into her eyes, down her back. Jenny reaches again for the fallen man’s gun. It’s cold, but she has a moment’s warmth in her yet.\n She might not be able to save the world, but she can at least save herself.\n It’s the end of the school day and you’re waiting for Jenny’s mother to pick you up. A man walks up to you. He wears a coat as grey as rain, and his eyes are pale against dark skin. “You have to come with me,” he says, awkward and serious at once. You recognize him, of course. You remember when he first recruited you, in another timeline. You remember what he looked like fallen in the battle at the end of time, with a gun knocked out of his hand.\n “I can’t,” you say, kindly, because it will take him time to understand that you’re not the blue woman anymore, that you won’t do the things the blue woman did.\n “What?” he says. “Please. It’s urgent.” He knows better than to grab your arm. “There’s a battle—”\n Once upon a time, you listened to his plea. Part of you is tempted to listen this time around, to abandon the life that Jenny left you and take up his banner. But you know how that story ends.\n “I’m not in your story anymore,” you explain to him. “You’re in mine.”\n The man doesn’t look like he belongs in a world of parking tickets and potted begonias and pencil sharpeners. But he can learn, the way you have.\n Yoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators."}