{"fingerprint": "aWsdVxOjBV7UExqCHndxDSoyiZk=", "sitename": "Clarkesworld Magazine", "title": "Effigy Nights by Yoon Ha Lee", "author": "Yoon Ha Lee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lee_01_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Effigy Nights by Yoon Ha Lee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5030 words, short story\n Effigy Nights\n 2014 Nominee: World Fantasy Award for Best Short Story\n They are connoisseurs of writing in Imulai Mokarengen, the city whose name means inkblot of the gods.\n The city lies at the galaxy’s dust-stranded edge, enfolding a moon that used to be a world, or a world that used to be a moon; no one is certain anymore. In the mornings its skies are radiant with clouds like the plumage of a bird ever-rising, and in the evenings the stars scatter light across skies stitched and unstitched by the comings and goings of fire-winged starships. Its walls are made of metal the color of undyed silk, and its streets bloom with aleatory lights, small solemn symphonies, the occasional duel.\n Imulai Mokarengen has been unmolested for over a hundred years. People come to listen to the minstrels and drink tea-of-moments-unraveling, to admire the statues of shapeshifting tigers and their pliant lovers, to look for small maps to great fortunes at the intersections of curving roads. Even the duelists confront each other in fights knotted by ceremony and the exchange of poetry.\n But now the starships that hunt each other in the night of nights have set their dragon eyes upon Imulai Mokarengen, desiring to possess its arts, and the city is unmolested no more.\n The soldiers came from the sky in a glory of thunder, a cascade of fire. Blood like roses, bullets like thorns, everything to ashes. Imulai Mokarengen’s defenses were few, and easily overwhelmed. Most of them would have been museum pieces anywhere else.\n The city’s wardens gathered to offer the invading general payment in any coin she might desire, so long as she left the city in peace. Accustomed to their decadent visitors, they offered these: Wine pressed from rare books of stratagems and aged in barrels set in orbit around a certain red star. Crystals extracted from the nervous systems of philosopher-beasts that live in colonies upon hollow asteroids. Perfume symphonies infused into exquisite fractal tapestries.\n The general was Jaian of the Burning Orb, and she scorned all these things. She was a tall woman clad in armor the color of dead metal. For each world she had scoured, she wore a jewel of black-red facets upon her breastplate. She said to the wardens: What use did she have for wine except to drink to her enemies’ defeat? What use was metal except to build engines of war? And as for the perfume, she didn’t dignify that with a response.\n But, she said, smiling, there was one thing they could offer her, and then she would leave with her soldiers and guns and ships. They could give her all the writings they treasured so much: all the binary crystals gleaming bright-dark, all the books with the bookmarks still in them, all the tilted street signs, all the graffiti chewed by drunken nanomachines into the shining walls, all the tattoos obscene and tender, all the ancestral tablets left at the shrines with their walls of gold and chitin.\n The wardens knew then that she was mocking them, and that as long as any of the general’s soldiers breathed, they would know no peace. One warden, however, considered Jaian’s words of scorn, and thought that, unwitting, Jaian herself had given them the key to her defeat.\n Seran did not remember a time when his othersight of the city did not show it burning, no matter what his ordinary senses told him, or what the dry pages of his history said. In his dreams the smoke made the sky a funeral shroud. In waking, the wind smelled of ash, the buildings of angry flames. Everything in the othersight was wreathed in orange and amber, flickering, shadows cinder-edged.\n He carried that pall of phantom flame with him even now, into the warden’s secret library, and it made him nervous although the books had nothing to fear from the phantoms. The warden, a woman in dust-colored robes, was escorting him through the maze-of-mists and down the stairs to the library’s lowest level. The air was cool and dry, and to either side he could see the candle-sprites watching him hungrily.\n “Here we are,” the warden said as they reached the bottom of the stairs.\n Seran looked around at the parchment and papers and scrolls of silk, then stepped into the room. The tools he carried, bonesaws and forceps and fine curved needles, scalpels that sharpened themselves if fed the oil of certain olives, did not belong in this place. But the warden had insisted that she required a surgeon’s expertise.\n He risked being tortured or killed by the general’s occupation force for cooperating with a warden. In fact, he could have earned himself a tidy sum for turning her in. But Imulai Mokarengen was his home, for all that he had not been born here. He owed it a certain loyalty.\n “Why did you bring me here, madam warden?” Seran said.\n The warden gestured around the room, then unrolled one of the great charts across the table at the center of the room. It was a stardrive schematic, all angles and curves and careful coils.\n Then Seran saw the shape flickering across the schematic, darkening some of the precise lines while others flowed or dimmed. The warden said nothing, leaving him to observe as though she felt he was making a difficult diagnosis. After a while he identified the elusive shape as that of a girl, slight of figure or perhaps merely young, if such a creature counted years in human terms. The shape twisted this way and that, but there were no adjacent maps or diagrams for her to jump to. She left a disordered trail of numbers like bullets in her wake.\n “I see her,” Seran said dryly. “What do you need me to do about her?”\n “Free her,” the warden said. “I’m pretty sure this is all of her, although she left a trail while we were perfecting the procedure—”\n She unrolled another chart, careful to keep it from touching the first. It appeared to be a treatise on musicology, except parts of it had been replaced by a detritus of clefs and twisted staves and demiquavers coalescing into a diagram of a pistol.\n “Is this your plan for resistance against the invaders?” Seran said. “Awakening soldiers from scraps of text, then cutting them out? You should have a lot more surgeons. Or perhaps children with scissors.”\n The warden shrugged. “Imulai Mokarengen is a city of stories. It’s not hard to persuade one to come to life in her defense, even though I wouldn’t call her tame. She is the Saint of Guns summoned from a book of legends. Now you see why I need a surgeon. I am given to believe that your skills are not entirely natural.”\n This was true enough. He had once been a surgeon-priest of the Order of the Chalice. “If you know that much about me,” he said, “then you know that I was cast out of the order. Why haven’t you scared up the real thing?”\n “Your order is a small one,” she said. “I looked, but with the blockade, there’s no way to get someone else. It has to be you.” When he didn’t speak, she went on, “We are outnumbered. The general can send for more soldiers from the worlds of her realm, and they are armed with the latest weaponry. We are a single city known for artistic endeavors, not martial ones. Something has to be done.”\n Seran said, “You’re going to lose your schematic.”\n “I’m not concerned about its fate.”\n “All right,” he said. “But if you know anything about me, you know that your paper soldiers won’t last. I stick to ordinary surgery because the prayers of healing don’t work for me anymore; they’re cursed by fire.” And, because he knew she was thinking it: “The curse touches anyone I teach.”\n “I’m aware of the limitations,” the warden said. “Now, do you require additional tools?”\n He considered it. Ordinary scissors might be better suited to paper than the curved ones he carried, but he trusted his own instruments. A scalpel would have to do. But the difficult part would be getting the girl-shape to hold still. “I need water,” he said. He had brought a sedative, but he was going to have to sponge the entire schematic, since an injection was unlikely to do the trick.\n The warden didn’t blink. “Wait here.”\n As though he had somewhere else to wait. He spent the time attempting to map the girl’s oddly flattened anatomy. Fortunately, he wouldn’t have to intrude on her internal structures. Her joints showed the normal range of articulation. If he hadn’t known better, he would have said she was dancing in the disarrayed ink, or perhaps looking for a fight.\n Footsteps sounded in the stairwell. The woman set a large pitcher of water down on the table. “Will this be enough?” she asked.\n Seran nodded and took out a vial from his satchel. The dose was pure guesswork, unfortunately. He dumped half the vial’s contents into the pitcher, then stirred the water with a glass rod. After putting on gloves, he soaked one of his sponges, then wrung it out.\n Working with steady strokes, he soaked the schematic. The paper absorbed the water readily. The warden winced in spite of herself. The girl didn’t seem capable of facial expressions, but she dashed to one side of the schematic, then the other, seeking escape. Finally she slumped, her long hair trailing off in disordered tangles of artillery tables.\n The warden’s silence pricked at Seran’s awareness. She’s studying how I do this, he thought. He selected his most delicate scalpel and began cutting the girl-shape out of the paper. The medium felt alien, without the resistances characteristic of flesh, although water oozed away from the cuts.\n He hesitated over the final incision, then completed it, hand absolutely steady.\n Amid all the maps and books and scrolls, they heard a girl’s slow, drowsy breathing. In place of the paper cutout, the girl curled on the table, clad in black velvet and gunmetal lace. She had paper-pale skin and inkstain hair, and a gun made of shadows rested in her hand.\n It was impossible to escape the problem: smoke curled from the girl’s other hand, and her nails were blackened.\n “I warned you of this,” Seran said. Cursed by fire. “She’ll burn up, slowly at first, and then all at once. I suspect she’ll last a week at most.”\n “You listen to the news, surely,” the warden said. “Do you know how many of our people the invaders shot the first week of the occupation?”\n He knew the number. It was not small. “Anything else?” he said.\n “I may have need of you later,” the warden said. “If I summon you, will you come? I will pay you the same fee.”\n “Yes, of course,” Seran said. He had noticed her deft hands, however; he imagined she would make use of them soon.\n Not long after Seran’s task for the warden, the effigy nights began.\n He was out after curfew when he saw the Saint of Guns. Imulai Mokarengen’s people were bad at curfews. People still broke the general’s curfew regularly, although many of them were also caught at it. At every intersection, along every street, you could see people hung up as corpse-lanterns, burning with plague-colored light, as warnings to the populace. Still, the city’s people were accustomed to their parties and trysts and sly confrontations. For his part, he was on his way home after an emergency call, and looking forward to a quiet bath.\n It didn’t surprise him that he should encounter the Saint of Guns, although he wished he hadn’t. After all, he had freed her from the boundary of paper and legend to walk in the world. The connection was real, for all that she hadn’t been conscious for its forging. Still, the sight of her made him freeze up.\n Jaian’s soldiers were rounding up a group of merry-goers and poets whose rebellious recitations had been loud enough to be heard from outside. The poets, in particular, were not becoming any less loud, especially when one of them was shot in the head.\n The night became the color of gunsmoke little by little, darkness unfolding to make way for the lithe girl-figure. She had a straight-hipped stride, and her eyes were spark-bright, her mouth furiously unsmiling. Her hair was braided and pinned this time. Seran had half-expected her to have a pistol in each hand, but no, there was only the one. He wondered if that had to do with the charred hand.\n Most of the poets didn’t recognize her, and none of the soldiers. But one of the poets, a chubby woman, tore off her necklace with its glory’s worth of void-pearls. They scattered in all directions, purple-iridescent, fragile. “The Saint of Guns,” the poet cried. “In the city where words are bullets, in the book where verses are trajectories, who is safe from her?”\n Seran couldn’t tell whether this was a quotation or something the poet had made up on the spot. He should have ducked around the corner and toward safety, but he found it impossible to look away, even when one of the soldiers knocked the pearl-poet to the street and two others started kicking her in the stomach.\n The other soldiers shouted at the Saint of Guns to stand down, to cast away her weapon. She narrowed her eyes at them, not a little contemptuous. She pointed her gun into the air and pulled the trigger. For a second there was no sound.\n Then all the soldiers’ guns exploded. Seran had a blurry impression of red and star-shaped shrapnel and chalk-white and falling bodies, fire and smoke and screaming. There was a sudden sharp pain across his left cheek where a passing splinter cut it: the Saint’s mark.\n None of the soldiers had survived. Seran was no stranger to corpses. They didn’t horrify him, despite the charred reek and the cooked eyes, the truncated finger that had landed near his foot. But none of the poets had survived, either.\n The Saint of Guns lowered her weapon, then saluted him with her other hand. Her fingers were blackened to their bases.\n Seran stared at her, wondering what she wanted from him. Her lips moved, but he couldn’t hear a thing.\n She only shrugged and walked away. The night gradually grew darker as she did.\n Only later did Seran learn that the gun of every soldier in that district had exploded at the same time.\n Imulai Mokarengen has four great archives, one for each compass point. The greatest of them is the South Archive, with its windows the color of regret and walls where vines trace out spirals like those of particles in cloud chambers. In the South Archive the historians of the city store their chronicles. Each book is written with nightbird quills and ink-of-dedication, and bound with a peculiar thread spun from spent artillery shells. Before it is shelved, one of the city’s wardens seals each book shut with a black kiss. The books are not for reading. It is widely held that the historians’ objectivity will be compromised if they concern themselves with an audience.\n When Jaian of the Burning Orb conquered Imulai Mokarengen, she sent a detachment to secure the South Archive. Although she could have destroyed it in a conflagration of ice and fire and funeral dust, she knew it would serve her purpose better to take the histories hostage.\n It didn’t take long for the vines to wither, and for the dead brown tendrils to spell out her name in a syllabary of curses, but Jaian, unsuperstitious, only laughed when she heard.\n The warden called Seran back, as he had expected she would.\n Seran hadn’t expected the city to be an easy place to live in during an occupation, but he also hadn’t made adequate preparations for the sheer aggravation of sharing it with legends and historical figures.\n “Aggravation” was what he called it when he was able to lie to himself about it. It was easy to be clinical about his involvement when he was working with curling sheets, and less so when he saw what the effigies achieved.\n The Saint of Guns burned up within a week, as Seran had predicted. The official reports were confused, and the rumors not much better, but he spent an entire night holed up in his study afterward estimating the number of people she had killed, bystanders included. He had bottles of very bad wine for occasions like this. By the time morning came around, he was comprehensively drunk.\n Six-and-six years ago, on a faraway station, he had violated his oaths as a surgeon-priest by using his prayers to kill a man. It had not been self-defense, precisely. The man had shot a child. Seran had been too late to save the child, but not too late to damn himself.\n It seemed that his punishment hadn’t taught him anything. He explained to himself that what he was doing was necessary; that he was helping to free the city of Jaian.\n The warden next had him cut out one of the city’s founders, Alarra Coldly-Smiling. She left footsteps of frost, and where she walked, people cracked into pieces, frozen all the way through, needles of ice piercing their intestines. As might be expected, she burned up faster than the Saint of Guns. A pity; she was outside Jaian’s increasingly well-defended headquarters when she sublimated.\n The third was the Mechanical Soldier, who manifested as a suit of armor inside which lights blinked on-off, on-off, in digital splendor. Seran was buying more wine—you could usually get your hands on some, even during the occupation, if your standards were low—when he heard the clink-clank thunder outside the dim room where the transaction was taking place. The Mechanical Soldier carried a black sword, which proved capable of cutting through metal and crystal and stone. With great precision it carved a window in the wall. The blinking lights brightened as it regarded Seran.\n The wine-seller shrieked and dropped one of the bottles, to Seran’s dismay. The air was pungent with the wine’s sour smell. Seran looked unflinchingly at the helmet, although a certain amount of flinching was undoubtedly called for, and after a while the Mechanical Soldier went away in search of its real target.\n It turned out that the Mechanical Soldier liked to carve cartouches into walls, or perhaps its coat-of-arms. Whenever it struck down Jaian’s soldiers, lights sparked in the carvings, like sourceless eyes. People began leaving offerings by the carvings: oil-of-massacres, bouquets of crystals with fissures in their shining hearts, cardamom bread. (Why cardamom, Seran wasn’t sure. At least the aroma was pleasing.) Jaian’s soldiers executed people they caught at these makeshift shrines, but the offerings kept coming.\n Seran had laid in a good supply of wine, but after the Mechanical General shuddered apart into pixels and blackened reticulations, there was a maddening period of calm. He waited for the warden’s summons.\n No summons came.\n Jaian’s soldiers swaggered through the streets again, convinced that there would be no more apparitions. The city’s people whispered to each other that they must have faith. The offerings increased in number.\n Finding wine became too difficult, so Seran gave it up. He was beginning to think that he had dreamed up the whole endeavor when the effigy nights started again.\n Imulai Mokarengen suddenly became so crowded with effigies that Seran’s othersight of fire and smoke was not much different from reality. He had not known that the city contained so many stories: Women with deadly hands and men who sang atrocity-hymns. Colonial intelligences that wove webs across the pitted buildings and flung disease-sparks at the invaders. A cannon that rose up out of the city’s central plaza and roared forth red storms.\n But Jaian of the Burning Orb wasn’t a fool. She knew that the effigies, for all their destructiveness, burned out eventually. She and her soldiers retreated beneath their force-domes and waited.\n Seran resolved to do some research. How did the warden mean to win her war, if she hadn’t yet managed it?\n By now he had figured out that the effigies would not harm him, although he still had the scar the Saint of Guns had given him. It would have been easy to remove the scar, but he was seized by the belief that the scar was his protection.\n He went first to a bookstore in which candles burned and cogs whirred. Each candle had the face of a child. A man with pale eyes sat in an unassuming metal chair, shuffling cards. “I thought you were coming today,” he said.\n Seran’s doubts about fortunetelling clearly showed on his face. The man laughed and fanned out the cards face-up. Every one of them was blank. “I’m sorry to disappoint you,” he said, “but they only tell you what you already know.”\n “I need a book about the Saint of Guns,” Seran said. She had been the first. No reason not to start at the beginning.\n “That’s not a story I know,” the man said. His eyes were bemused. “I have a lot of books, if you want to call them that, but they’re really empty old journals. People like them for the papers, the bindings. There’s nothing written in them.”\n “I think I have what I came for,” Seran said, hiding his alarm. “I’m sorry to trouble you.”\n He visited every bookstore in the district, and some outside of it, and his eyes ached abominably by the end. It was the same story at all of them. But he knew where he had to go next.\n Getting into the South Archive meant hiring a thief-errant, whose name was Izeut. Izeut had blinded Seran for the journey, and it was only now, inside one of the reading rooms, that Seran recovered his vision. He suspected he was happier not knowing how they had gotten in. His stomach still felt as though he’d tied it up in knots.\n Seran had had no idea what the Archive would look like inside. He had especially not expected the room they had landed in to be welcoming, the kind of place where you could curl up and read a few novels while sipping citron tea. There were couches with pillows, and padded chairs, and the paintings on the walls showed lizards at play.\n “All right,” Izeut said. His voice was disapproving, but Seran had almost beggared himself paying him, so the disapproval was very faint. “What now?”\n “All the books look like they’re in place here,” Seran said. “I want to make sure there’s nothing obviously missing.”\n “That will take a while,” Izeut said. “We’d better get started.”\n Not all the rooms were welcoming. Seran’s least favorite was the one from which sickles hung from the ceiling, their tips gleaming viscously. But all the bookcases were full.\n Seran still wasn’t satisfied. “I want to look inside a few of the books,” he said.\n Izeut shot him a startled glance. “The city’s traditions—”\n “The city’s traditions are already dying,” Seran said.\n “The occupation is temporary,” Izeut said stoutly. “We just have to do more to drive out the warlord’s people.”\n Izeut had no idea. “Humor me,” Seran said. “Haven’t you always wanted to see what’s in those books?” Maybe an appeal to curiosity would work better.\n Whether it did or not, Izeut stood silently while Seran pulled one of the books off the shelves. He hesitated, then broke the book’s seal and felt the warden’s black kiss, cold, unsentimental, against his lips. I’m already cursed, he thought, and opened the covers.\n The first few pages were fine, written in a neat hand with graceful swells. Seran flipped to the middle, however, and his breath caught. The pages were empty except for a faint dust-trace of distorted graphemes and pixelated stick figures.\n He could have opened up more books to check, but he had already found his answer.\n “Stop,” Izeut said sharply. “Let me reshelve that.” He took the book from Seran, very tenderly.\n “It’s no use,” Seran said.\n Izeut didn’t turn around; he was slipping the book into its place. “We can go now.”\n It was too late. The general’s soldiers had caught them.\n Seran was separated from Izeut and brought before Jaian of the Burning Orb. She regarded him with cool exasperation. “There were two of you,” she said, “but something tells me that you’re the one I should worry about.”\n She kicked the table next to her. All of Seran’s surgical tools, which the soldiers had confiscated and laid out in disarray, clattered.\n “I have nothing to say to you,” Seran said through his teeth.\n “Really,” Jaian said. “You fancy yourself a patriot, then. We may disagree about the petty legal question of who the owner of this city is, but if you are any kind of healer, you ought to agree with me that these constant spasms of destruction are good for no one.”\n “You could always leave,” Seran said.\n She picked up one of his sets of tweezers and clicked it once, twice. “You will not understand this,” she said, “and it is even right that you will not understand this, given your profession, but I will try to explain. This is what I do. Worlds are made to be pressed for their wine, cities taste of fruit when I bite them open. I cannot let go of my conquests.\n “Do you think I am ignorant of the source of the apparitions that leave their smoking shadows in the streets? You’re running out of writings. All I need do is wait, and this city will yield in truth.”\n “You’re right,” Seran said. “I don’t understand you at all.”\n Jaian’s smile was like knives and nightfall. “I’ll write this in a language you do understand, then. You know something about how this is happening, who’s doing it. Take me to them or I will start killing your people in earnest. Every hour you make me wait, I’ll drop a bomb, or send out tanks, or soldiers with guns. If I get bored I’ll get creative.”\n Seran closed his eyes and made himself breathe evenly. He didn’t think she was bluffing. Besides, there was a chance—if only a small chance—that the warden could come up with a defense against the general; that the effigies would come to her aid once the general came within reach.\n “All right,” he said. “I’ll take you where it began.”\n Seran was bound with chains-of-suffocation, and he thought it likely that there were more soldiers watching him than he could actually spot. He led Jaian to the secret library, to the maze-of-mists.\n “A warden,” Jaian said. “I knew some of them had escaped.”\n They went to the staircase and descended slowly, slowly. The candle-sprites flinched from the general. Their light was almost violet, like dusk.\n All the way down the stairs they heard the snick-snick of many scissors.\n The downstairs room, when they reached it, was filled with paper. Curling scraps and triangles crowded the floor. It was impossible to step anywhere without crushing some. The crumpling sound put Seran in mind of burnt skin.\n Come to that, there was something of that smell in the room, too.\n All through the room there were scissors snapping at empty space, wielded by no hand but the hands of the air, shining and precise.\n At the far end of the room, behind a table piled high with more paper scraps, was the warden. She was standing sideways, leaning heavily against the table, and her face was averted so that her shoulder-length hair fell around it.\n “It’s over,” Jaian called out. “You may as well surrender. It’s folly to let you live, but your death doesn’t have to be one of the ugly ones.”\n Seran frowned. Something was wrong with the way the warden was moving, more like paper fluttering than someone breathing. But he kept silent. A trap, he thought, let it be a trap.\n Jaian’s soldiers attempted to clear a path through the scissors, but the scissors flew to either side and away, avoiding the force-bolts with uncanny grace.\n Jaian’s long strides took her across the room and around the table. She tipped the warden’s face up, forced eye contact. If there had been eyes.\n Seran started, felt the chains-of-suffocation clot the breath in his throat. At first he took the marks all over the warden’s skin to be tattoos. Then he saw that they were holes cut into the skin, charred black at the edges. Some of the marks were logographs, and alphabet letters, and punctuation stretched wide.\n “Stars and fire ascending,” Jaian breathed, “what is this?”\n Too late she backed away. There was a rustling sound, and the warden unfurled, splitting down the middle with a jagged tearing sound, a great irregular sheet punched full of word-holes, completely hollowed out. Her robe crumpled into fine sediment, revealing the cutout in her back in the shape of a serpent-headed youth.\n Jaian made a terrible crackling sound, like paper being ripped out of a book. She took one step back toward Seran, then halted. Holes were forming on her face and hands. The scissors closed in on her.\n I did this, Seran thought, I should have refused the warden. She must have learned how to call forth effigies on her own, ripping them out of Imulai Mokarengen’s histories and sagas and legends, animating the scissors to make her work easier. But when the scissors ran out of paper, they turned on the warden. Having denuded the city of its past, of its weight of stories, they began cutting effigies from the living stories of its people. And now Jaian was one of those stories, too.\n Seran left Jaian and her soldiers to their fate and began up the stairs. But some of the scissors had already escaped, and they had left the doors to the library open. They were undoubtedly in the streets right now. Soon the city would be full of holes, and people made of paper slowly burning up, and the hungry sound of scissors.\n Yoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators."}