{"fingerprint": "TLBAqarPStGy3qhbtmUIAoGfduw=", "sitename": "Clarkesworld Magazine", "title": "Leaving Room for the Moon by P H Lee", "author": "P H Lee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lee_01_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Leaving Room for the Moon by P H Lee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2800 words, short story\n Leaving Room for the Moon\n By the time we arrived at the court of the Emperor of All Space and Every World, our entire family was dead. We knew this; of course we knew it; sixty thousand years is so very long; we had prepared for it; but it was still horrible. When you go to sleep, you know it will happen, but until you wake up, until you read the tightband transmission logs, you have in your heart some fragment of hope. You do not even realize it is there, until you read the last words in your language, the last words by your people, the last words that will ever be written, and see the course of history continuing right past it, oblivious and destructive and awful. You do not realize the hope you held until you feel it evaporate under the unending torrent of time.\n It was not just our parents, or our brothers and sisters. It was all their children and their children’s children and so on. Our entire people were gone. The two of us were the only Tehu that remained in the entirety of the cosmos. We still lit the ancestral candles and spoke the ancestral prayers out loud in a language that we barely knew, alone in our cell in long-term quarantine. Of course we did. It didn’t matter anymore, but we did it anyway. What’s the point of a ritual, unless it doesn’t matter?\n When you are a child—as we were, when we arrived at the court of the Emperor—you hear the stories about the Emperor of All Space and Every World. You hear stories about his court, and its splendor, and you imagine it, palaces within palaces, each room finely appointed with the tapestries of every people and every world, every feature clad in gold and iridium carved in particular styles, the very space folded in upon itself to hold the totality of its grandeur. You imagine the court itself, with representatives from every people on every world, the Emperor flanked by his ministers of state, and each audience accompanied by eight rows of beautiful yi dancers. You imagine the majesty, the grandeur, the intrigue, the tasteful opulence.\n But when, out of quarantine at last, we arrived at the court of the Emperor of All Space and Every World, we found a dusty, dry complex, mostly outfitted in stucco. It was the sort of house a merchant might buy if she had come into more money than she could wisely spend. Much of it was completely disused—a palace only for rot and spiders. And there was little to recommend what remained. The imperial yellow of the walls had faded to an unpleasant brown. The gold and iridium fixtures had worn or been stolen away long since. Even the twists and folds of the palace’s space-time were somehow shallow, mere mirrors and murals with nothing behind them but a few thin echoes.\n How long did we wander in those endless and disappointing halls, before we saw the Emperor? It must have been years. But every day in them new children came as new tributes for even this decrepit ruin was still the Emperor’s palace and the man within it still the Emperor. What were we, if not for him? Only more mouths to snatch food from nooks and crannies, more senseless tributes from dead peoples, useless and meaningless and little else at that.\n It must have been years. We went to sleep as children, and by the time we were called to the Emperor’s residence we were nearly at our twelfthyears. I remember, because it was the night before the haro festival, and the haro festival was a week before our call-day. Do you remember the haro festival? You would stay up with grandmother and she would set you on her lap and guide your hands in making the bimi buns. She would tell us the story about the missing moon, as you folded the buns over and over. “You have to fold them just so,” she’d tell you. “You have to leave a little triangle for the moon.”\n I was always jealous of you for that, your time on grandmother’s lap, listening to her stories just for you. But you were the girl, and grandmother would only let me watch. Let her grandson make the bimi buns? She would sooner fly between the moons, she always said, so I had to content myself with watching.\n (We flew between the moons, on the way to the ypnository. I looked out the window and held your hand because you were afraid of heights. It doesn’t matter.)\n “Make the bimi buns,” I would tell you. How I counted the days and the years, I cannot begin to say, but I always knew the night before the haro festival. You would sit, and I would lie on the ground next to you, and watch your hands struggle through the motions, but there are no bimi buns for you to make. “You have to fold them just so,” I say to you. “You have to leave a little triangle for the moon.”\n I see your hands hesitate—was it a left twist or a right fold?—you cannot remember, and it does not matter anyway. Where would we begin to find the flours for them, the ovens for them, the neighbors to bring them to while singing the limpid songs of haro night? (Most of us had no idea what the words meant, anymore, but we only sung them all the louder.) It has been 60,000 years. Even if our people survived—and they have not survived—how could it be that they would still eat the same bimi buns that our grandmother folded with you on her lap?\n It was then, one of those times, my head in the ground, looking up toward you folding no more bimi buns, that a solitary yi dancer (Alone! What is an yi dancer alone, in not even a single row, no less eight? Not an yi dancer!) came to summon us to audience. She did not speak, she barely moved her gracious ball-joints, but why would an yi dancer approach us if not to summon us to imperial audience? Even now, after these however many years, we still remember that part of the stories, that part of our practice.\n The imperial throne room was no better than the rest of the place. No throne, no carpet but the white filigree of mold along the ceiling, too high for the pillars to illuminate. No better room, that, just the same old stucco marked by the ghosts of gold and iridium, but there was a table. And behind that table the Emperor sat in a thick red robe and his traditional bull’s head, just a man, sitting at the table like our father waiting for his breakfast, except in front of him, like so many sugar dishes, are all the orbs of state, and corner to him is not his half-brother (who never liked us), but the Empire’s Chief Minister, more fashionably frocked by photosynthetic fronds.\n “Children,” said the Emperor of All Space and Every World, and then he coughed, a long rasping cough that smelled like mildew. The yi dancer signaled our approach. “Come here and let me have a look at you.”\n We weren’t children anymore, or we wouldn’t be, not soon, but we didn’t say anything, even when his breath smelled like mildew. You tried not to look at the white dogs nesting feral in the corner.\n The whole wall behind the Emperor of All Space and Every World was black, and as you looked at it you realized that it is the Great Window, showing the whole of space, the whole of the Emperor’s possessions, so vast and dark that the stars were near invisible against it. You took my hand and tried to show me, but I was transfixed on the Emperor’s blunt and crooked teeth.\n “And where are you from?” asked the Emperor as he inspected us.\n You curtsied, still holding my hand so that I’d remember to curtsy as well.\n “We are Tehu, if it pleases Your Majesty.”\n “And where is Tehu?” He glanced disinterested at the Great Window for a moment.\n I spoke before I thought better of it. “It is gone, sir. There is nothing left.”\n The Emperor looked at me again, and his wide bull-eyes met mine. “Nothing left?”\n “There is only us, sir. And we are here in Your Majesty’s court.” As I said it, my voice rose; began to crack. You heard me and you started to cry, and then me in turn. The Chief Minister glared at us to no good. If we could have stopped crying, we would have.\n “Oh children,” said the Emperor, “there is no need to cry. In our palace there are truly all things. Nothing has been lost to you that cannot be returned.”\n We stared, terrified, transfixed.\n One of the orbs of state rolled off the table and cuh-clanked to the floor. A white dog came growling from the corner to investigate it.\n “We have in this palace all things and every thing, and in amongst those things we have in our employ—” he turned to the Chief Minister, who made a sour face—“do we? Yes, yes, we do—a certain demiurgist. Whatever it is that you miss, whatever world you have left behind, she can surely create for you in every detail. No need for tears, then, my girls.” (We did not correct him.) “No need for tears! Chief Minister, you will show them the way, of course?”\n (Much later, I realized that he had been trying to be kind. It does not matter.)\n The Empire’s Chief Minister soured their face again, but stood up and walked us to the folds of the wall we’d entered by. Just outside, they turned to face us, glaring down from amidst their undulating fronds.\n “Just so we’re clear, you little bits of tribute, I’m not taking you anywhere. I am an important being; I have important matters before me; I have no time to run around on the Emperor’s—” they said the word exactly like a curse—“whims and follies. Get out of here! Get out of mine eyes! I do not care if you go to the demiurgist or to the devil, so long as I nor the Emperor ever lays sight on you again!”\n (They did not actually say “to the devil.” They say “out to Maranis.” But we understood their meaning.)\n Things were different after that. Oh, we still had to scavenge for scraps of food and cloth, and we still lit our candles and mumbled our way through the prayers in that ancient language we had barely learned. I still counted the days as well as I managed to count them. But we knew that our state was only a temporary embarrassment. “The demiurgist,” we said to each other whenever we could not remember, whenever we made a mistake, or dropped a day, “the demiurgist.” Because we held in our hearts the Emperor’s promise, and we knew that when we found the demiurgist we would be once more made whole.\n It took us months of careful searching—was it even years? I do not know, in truth I lost count—but at last, at the very end of the palace, we found a dusty old corner room at the edge of a rotten library, and in the room a woman in the particular head of an owl. An owl! She could only be the demiurgist. I rush toward the open doorway, but you hold me back. You point toward her: look! As she delicately draws her night-pen across the thinness of a palimpsest. Look! As a tender kite-jay flies from her page, chirping excitedly. Look! With another stroke and two, she draws forth for it a dully-feathered mate.\n “Excuse me?” You step forward. She looks up sudden and at once, her great owl eyes scanning back, forth, then straight toward our hearts. “Are you the Emperor’s demiurgist?”\n “I am a demiurgist,” she replies, “in the Emperor’s employ.”\n “He told us . . . ” you begin. “That is to say. He said that if . . . ” but you have begun to cry again.\n I step forward. “Can you make us home, Ms? Can you make it just as it was before?”\n The demiurgist cocks her head and smiles. “Oh children,” she says, “within only the bounds of space and time I can make all and every thing.”\n “Then can you make us bimi buns?” I ask. “Because tomorrow will be haro night.” (Actually, I do not know if it will be haro night. Somewhere in these many months I have lost my count of days. But. But. But.)\n “Of course I can make your bimi buns,” says the demiurgist. “There is nothing that I cannot make and make exactly. But you must show me.” She gestures to her drafting table.\n “Show her?” I ask you, because grandmother never taught me. You climb up into her lap and you sit with her, just like she was our grandmother, but now you show her the folds and twists as she traces them, first in ink, then with her night-pen, and in the end there is a bimi bun, and then another, fresh and hot and steaming as if from our own oven.\n You look at the bimi bun, and squint. “It’s not right,” you say. “It doesn’t go like that.”\n “What do you mean it’s not right, child?” says the demiurgist, her voice concerned and condescending. “That is the very picture of a bimi bun.”\n You pout and squirm your way out of her lap. “It’s not right,” you say. “The twists are wrong. They should be in triangles, not crosses.”\n You’re right. I remember what our grandmother always said, to leave a little triangle for the moon. But I don’t say anything. This is the craft of the demiurgist! How could it be wrong?\n The demiurgist frowns, blinks her great yellow eyes at the buns, then frowns again. “That’s not so, child.”\n “It is!” you say. “You have to leave a little triangle for the moon!”\n She stalks out into the library proper, returning with a worm-eaten old device bound in dry crystal and marked with an Imperial seal. She sets the device down on her table and turns it to a specific page. “Here,” she says, and hands it to you. “It is the imperial rescript of all the days of Tehu.” The device shows, clear as can be, a bimi bun, with the folds in tight crosses, with no space between them.\n “That’s not right!” you shout, in tears. “It’s not! It’s not how my grandmother taught me! I remember! She always said to fold it just so!”\n I hold you and rub your back and sing a quiet song that I do not remember the words for. I try not to think. I know that if I think, I will begin to cry.\n “Ahah,” says the demiurgist. “That must be the issue. My craft can make you a bimi bun, child, just as it was. But I cannot make the bimi bun that you remember, because you have remembered it so many times that you no longer remember it at all. You remember only the times you have remembered it, a material as insubstantial as it is fickle. Against the irregularity of memory, any art can only strive in vain.”\n You cry more. I look up at the demiurgist. “What do you know about it anyway?” I yell, angry. “You never knew our grandmother! You never sang away a moonless haro night!”\n The demiurgist kneels down on her inverse legs until her owl’s eyes, each the size of my head, are level with mine. “It is written in the rescript, child. Just as it always was.”\n “I don’t know anything about any rescript!” I shout. “But I remember! I do!”\n “I can draw you your home, child,” continues the demiurgist, her voice as kind as she can make it. “Or at least I can draw you all the things within it. But I cannot fulfill your sorrow. Nothing can do that.”\n What can I do? I scream. I run and you run after me.\n Later, in a disused bedroom, we will lie together in the must of some old cushions, the last two Tehu, and yet not even that. For what half-remembered songs in a half-remembered language can make a Tehu? What does it matter to our twelfthyears, or was it even them by which we counted?\n What are we, then? Are we only our memories in a palace that has long ago forgotten even itself?\n We will weep, together, through the night. We will not ask each other questions that we will not answer.\n P H Lee lives with the rose bushes behind an old walnut tree down a dead-end road out past the highway. Their other writing has appeared in Uncanny Magazine, Visions Magazine, Worlds Without Master, and Four Ways to Die in the Future. Their hobbies include cooking and translating Classical Chinese texts."}