{"fingerprint": "Tz54BZ1WMkLurw5oM+mpQQIb0k4=", "sitename": "Clarkesworld Magazine", "title": "The Battle of Candle Arc by Yoon Ha Lee", "author": "Yoon Ha Lee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lee_10_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Battle of Candle Arc by Yoon Ha Lee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7960 words, novelette\n The Battle of Candle Arc\n General Shuos Jedao was spending his least favorite remembrance day with Captain-magistrate Rahal Korais. There was nothing wrong with Korais except that he was the fangmoth’s Doctrine officer, and even then he was reasonable for a Rahal. Nevertheless, Doctrine observed remembrances with the ranking officer, which meant that Jedao had to make sure he didn’t fall over.\n Next time, Jedao thought, wishing the painkillers worked better, I have to get myself assassinated on a planet where they do the job right.\n The assassin had been a Lanterner, and she had used a shattergun. She had caught him at a conference, of all places. The shattergun had almost sharded Jedao into a hundred hundred pieces of ghostwrack. Now, when Jedao looked at the icelight that served as a meditation focus, he saw anywhere from three to eight of them. The effect would have been charming if it hadn’t been accompanied by stabbing pains in his head.\n Korais was speaking to him.\n “Say again?” Jedao said. He kept from looking at his wristwatch.\n “I’ll recite the next verses for you, sir, if that doesn’t offend you,” Korais said.\n Korais was being diplomatic. Jedao couldn’t remember where in the litany they were. Under better circumstances he would have claimed that he was distracted by the fact that his force of eleven fangmoths was being pursued by the Lanterners who had mauled the rest of the swarm, but it came down to the injuries.\n “I’d be much obliged, Captain,” Jedao said.\n This remembrance was called the Feast of Drownings. The Rahal heptarch, whose faction maintained the high calendar and who set Doctrine, had declared it three years back, in response to a heresy in one of the heptarchate’s larger marches. Jedao would have called the heresy a benign one. People who wanted the freedom to build shrines to their ancestors, for pity’s sake. But the Rahal had claimed that this would upset the high calendar’s master equations, and so the heretics had had to be put down.\n There were worse ways to die than by having your lungs slowly filled with caustic fluid. That still didn’t make it a good way to die.\n Korais had begun his recital. Jedao looked at the icelight on the table in front of them. It had translucent lobes and bronchi and alveoli, and light trickled downward through them like fluid, pale and blue and inexorable.\n The heptarchate’s exotic technologies depended on the high calendar’s configurations: the numerical concordances, the feasts and remembrances, the associated system of belief. The mothdrive that permitted fast travel between star systems was an exotic technology. Few people advocated a switch in calendars. Too much would have to be given up, and invariant technologies, which worked under any calendar, never seemed to keep up. Besides, any new calendar would be subject to the same problem of lock-in; any new calendar would be regulated by the Rahal, or by people like the Rahal, as rigorously as the current one.\n It was a facile argument, and one that Jedao had always disliked.\n “Sir,” Korais said, breaking off at the end of a phrase, “you should sit.”\n “I’m supposed to be standing for this,” Jedao said dryly.\n “I don’t think your meditations during the next nineteen minutes are going to help if you fall unconscious.”\n He must look awful if Doctrine was telling him how long until the ordeal was over. Not that he was going to rest afterward. He had to figure out what to do about the Lanterners.\n It wasn’t that Jedao minded being recalled from medical leave to fight a battle. It wasn’t even that he minded being handed this sad force of eleven fangmoths, whose morale was shredded after General Kel Najhera had gotten herself killed. It was that the heptarchate had kept the Lanterners as clients for as long as he remembered. Now the Lanterners were demanding regional representation, and they were at war with the heptarchate.\n The Lanterner assassin had targeted Jedao during the Feast of Falcon’s Eye. If she had succeeded, the event would have spiked the high calendar in the Lanterners’ favor. Then they would have declared a remembrance in their own, competing calendar. The irony was that Jedao wasn’t sure he disagreed with the Lanterners’ grievances against the heptarchate, which they had broadcast everywhere after their victory over Najhera.\n Korais was still looking at him. Jedao went to sit down, which was difficult because walking in a straight line took all of his concentration. Sitting down also took concentration. It wasn’t worth pretending that he heard the last remembrance verses.\n “It’s over, sir,” Korais said. “I’ll leave you to your duties.” He saluted and let himself out.\n Jedao looked at his watch after the door hissed shut. Everything on it was too tiny to read the way his vision was. He made his computer enlarge its time display. Korais had left at least seven minutes early, an astonishing concession considering his job.\n Jedao waited until the latest wave of pain receded, then brought up a visual of Candle Arc, a battledrift site nine days out from their present position and eleven days out from the Lanterners’ last reported position. The battle had taken place 177 years ago, between two powers that had since been conquered. The heptarchate called the battle Candle Arc because of the bridge of lights that wheeled through the scatter-hell of what had once been a fortress built from desiccated suns, and the remnants of warmoths. The two powers probably had called their battle something else, and their moths wouldn’t have been called moths either, and their calendars were dead except in records held locked by the Rahal.\n Some genius had done up the image in shades of Kel gold, even though a notation gave the spectrum shift for anyone who cared. Jedao was fond of the Kel, who were the heptarchate’s military faction. For nearly twenty years he had been seconded to their service, and they had many virtues, but their taste in ornamentation was gaudy. Their faction emblem was the ashhawk, the bird that burned in its own glory, all fire and ferocity. The Shuos emblem was the ninefox, shapeshifter and trickster. The Kel called him the fox general, but they weren’t always being complimentary.\n The bridgelights swam in and out of focus. Damnation. This was going to take forever. After pulling up maps of the calendrical terrain, he got the computer algebra system to tell him what the estimated shifts looked like in pictures. Then he sent a summons to the moth commander.\n He knew how long it took to get from the moth’s command center to his quarters. The door chimed at him with commendable promptness.\n “Come in,” Jedao said.\n The door opened. “You wished to see me, sir,” said Kel Menowen, commander of the Fortune Travels in Fours. She was a stocky woman with swan-black hair and unsmiling eyes. Like all Kel, she wore black gloves; Jedao himself wore fingerless gloves. Her salute was so correct that he wanted to find an imperfection in her fist, or the angle of her arm.\n Jedao had chosen the Fortune as his command moth not because it was the least damaged after Najhera’s death, which it wasn’t, but because Menowen had a grudge against the Shuos. She was going to be the hardest commander to win over, so he wanted to do it in person.\n The tired joke about the Kel was that they were strong, loyal, and stupid, although they weren’t any more prone to stupidity than the other factions.\n The tired joke about the Shuos, who specialized in information operations, was that they had backstabbing quotas. Most of the other factions had reasonable succession policies for their heptarchs. The Rahal heptarch appointed a successor from one of the senior magistrates. With the Kel, it was rank and seniority. The Shuos policy was that if you could keep the heptarch’s seat, it was yours. The other tired joke was that the infighting was the only reason the Shuos weren’t running the heptarchate.\n One of Menowen’s aunts had died in a Shuos scheme, an assassin getting careless with secondary casualties. Jedao had already been in Kel service at the time, but it was in his public record that he had once been Shuos infantry, where “Shuos infantry” was a euphemism for “probably an assassin.” In his case, he had been a very good assassin.\n Menowen was still standing there. Jedao approximated a return salute. “At ease,” he said. “I’d stand, but ’up’ and ’down’ are difficult concepts, which is distressing when you have to think in three dimensions.”\n Menowen’s version of at ease looked stiff. “What do you require, sir?”\n They had exchanged few words since he boarded her moth because he had barely been functional. She wasn’t stupid. She knew he was on her moth to make sure she behaved, and he had no doubt her behavior would be exemplary. She also probably wanted to know what the plan was.\n “What do you think I require?” Jedao asked. Sometimes it helped to be direct.\n Menowen’s posture became more stiff. “It hasn’t escaped my notice that you only gave move orders as far as the Haussen system,” she said. “But that won’t take us near any useful support, and I thought our orders were to retreat.” She was overenunciating on top of telling him things he knew, which meant that at some point she was going to tell him he wasn’t fit for duty. Some Kel knew how to do subtlety. Menowen had an excellent service record, but she didn’t strike him as a subtle Kel.\n “You’re reading the sane, sensible thing into our orders,” Jedao said. “Kel Command was explicit. They didn’t use the word ’retreat’ anywhere.” An interesting oversight on their part. The orders had directed him to ensure that the border shell guarding the Glover Marches was secured by any means possible.\n “Retreat is the only logical response,” Menowen said. “Catch repairs if possible, link up with Twin Axes.” The Twin Axes swarm was on patrol along the Taurag border, and was the nearest Kel force of any size. “Then we’d have a chance against the heretics.”\n “You’re discounting some alternatives,” Jedao said.\n Menowen lifted her chin and glared at him, or possibly at his insignia, or at the ink painting over his shoulder. “Sir,” she said, “if you’re contemplating fighting them with our present resources—” She stopped, tried again. The second try was blunter. “Your injuries have impaired your judgment and you ought to—”\n “—let the senior moth commander make the sane, sensible decision to run for help?” Jedao flexed his hands. He had a clear memory of an earlier conversation with Commander Kel Chau, specifically the pinched look around Chau’s eyes. Chau probably thought running was an excellent idea. “I had considered it. But it’s not necessary. I’ve looked at the calendrical terrain. We can win this.”\n Menowen was having a Kel moment. She wanted to tell him off, but it wasn’t just that he outranked her, it was that Kel Command had pulled him off medical leave to put him in charge, instead of evacuating him from the front. “Sir,” she said, “I was there. The Lanterners have a swarm of at least sixty moths. They will have reinforcements. I shouldn’t have to tell you any of this.”\n “How conscientious of you,” Jedao said. Her eyes narrowed, but she didn’t take the bait. “Did you think I had some notion of slugging it out toe-to-toe? That would be stupid. But I have been reviewing the records, and I understand the Lanterner general’s temperament. Which is how we’re going to defeat the enemy, unless you defeat yourself before they have a chance to.”\n Menowen’s mouth pressed thin. “I understand you have never lost a battle,” she said.\n “This isn’t the—”\n “If it’s about your fucking reputation—”\n “Fox and hound, not this whole thing again,” Jedao snapped. Which was unfair of him because it was her first time bringing it up, even if everyone else did. “Sooner or later everyone loses. I get it. If it made more sense to stop the Lanterners in the Glovers, I’d be doing it.” This would also mean ceding vast swathes of territory to them, not anyone’s first choice; from her grim expression, she understood that. “If I could stop the Lanterners by calling them up for a game of cards, I’d do that too. Or by, I don’t know, offering them my right arm. But I’m telling you, this can be done, and I am not quitting if there’s a chance. Am I going to have to fight you to prove it?”\n This wasn’t an idle threat. It wouldn’t be the first time he had dueled a Kel, although it would be frivolous to force a moth commander into a duel, however non-lethal, at a time like this.\n Menowen looked pained. “Sir, you’re wounded.”\n He could think of any number of ways to kill her before she realized she was being attacked, even in his present condition, but most of them depended on her trust that her commanding officer wouldn’t pull such a stunt.\n “We can do this,” Jedao said. He was going to have to give this speech to the other ten moth commanders, who were jumpy right now. Might as well get in practice now. “All the way to the Haussen system, it looks like we’re doing the reasonable thing. But we’re going to pay a call on the Rahal outpost at Smokewatch 33-67.” That wasn’t going to be a fun conversation, but most Rahal were responsive to arguments that involved preserving their beloved calendar. And right now, he was the only one in position to stop the Lanterners from arrowing right up to the Glover Marches. The perfect battle record that people liked to bludgeon him over the head with might even come in handy for persuasion.\n “I’m listening,” Menowen said in an unpromising voice.\n It was good, if inconvenient, when a Kel thought for herself. Unlike a number of the officers on this moth, Menowen didn’t react to Jedao like a cadet fledge.\n “Two things,” Jedao said. “First, I know remembering the defeat is painful, but if I’m reading the records correctly, the first eight Kel moths to go down, practically simultaneously, included two scoutmoths.”\n “Yes, that’s right,” Menowen said. She wasn’t overenunciating anymore. “The Lanterners’ mothdrive formants were distorted just enough to throw our scan sweep, so they saw us first.”\n “Why would they waste time killing scoutmoths when they could blow up fangmoths or arrowmoths instead? If you look at their positions and ours, they had better available targets.” He had to be careful about criticizing a dead general, but there was no avoiding it. Najhera had depended too much on exotics and hadn’t made adequate use of invariant defenses. The Kel also hadn’t had time to channel any useful formation effects, their specialty. “The scoutmoths weren’t out far enough to give advance notice, and surprise was blown once the Lanterners fried those eight moths. What I’m getting at is that our scan may not be able to tell the difference between mothdrives on big scary things and mothdrives on mediocre insignificant things, but their scan can’t either, or they would have picked better targets.”\n Menowen was starting to look persuaded. “What are you going to do, sir? Commandeer civilian moths and set them to blow?” She wasn’t able to hide her distaste for the idea.\n “I’d prefer to avoid involving civilians,” Jedao said coolly. Her unsmiling eyes became a little less unsmiling when he said that. “The Rahal run the show, they can damn well spare me some engines glued to tin cans.”\n The pain hit him like a spike to the eyes. When he could see again, Menowen was frowning. “Sir,” she said, “one thing and I’ll let you continue your deliberations in private.” This was Kel for please get some fucking rest before you embarrass us by falling over. “You had some specific plan for punching holes into the Lanterners?”\n “Modulo the fact that something always goes wrong after you wave hello at the enemy? Yes.”\n “That will do it for me, sir,” Menowen said. “Not that I have a choice in the matter.”\n “You always have a choice,” Jedao said. “It’s just that most of them are bad.”\n She didn’t look as though she understood, but he hadn’t expected her to.\n Jedao would have authorized more time for repairs if he could, but they kept receiving reports on the Lanterners’ movements and time was one of the things they had little of. He addressed his moth commanders on the subject to reassure them that he understood their misgivings. Thankfully, Kel discipline held.\n For that matter, Jedao didn’t like detouring to Smokewatch 33-67 afterward, but he needed a lure, and this was the best place to get it. The conversation with the Rahal magistrate in charge almost wasn’t a conversation. Jedao felt as though he was navigating through a menu of options rather than interacting with a human being. Some of the Rahal liked to cultivate that effect. At least Rahal Korais wasn’t one of them.\n “This is an unusual request for critical Rahal resources, General,” the magistrate was saying.\n This wasn’t a no, so Jedao was already ahead. “The calendrical lenses are the best tool available,” he said. “I will need seventy-three of them.”\n Calendrical lenses were Doctrine instruments mounted on mothdrives. Their sole purpose was to focus the high calendar in contested areas. It was a better idea in theory than practice, since radical heresies rapidly knocked them out of alignment, but the Rahal bureaucracy was attached to them. Typical Rahal, trusting an idea over cold hard experience. At least there were plenty of the things, and the mothdrives ought to be powerful enough to pass on scan from a distance.\n Seventy-three was crucial because there were seventy-three moths in the Kel’s Twin Axes swarm. The swarm was the key to the lure, just not in the way that Commander Menowen would have liked. It was barely possible, if Twin Axes set out from the Taurag border within a couple days’ word of Najhera’s defeat, for it to reach Candle Arc when Jedao planned on being there. It would also be inadvisable for Twin Axes to do so, because their purpose was to prevent the Taurags from contesting that border. Twin Axes wouldn’t leave such a gap in heptarchate defenses without direct orders from Kel Command.\n However, no one had expected the Lanterners to go heretical so suddenly. Kel Command had been known to panic, especially under Rahal pressure. And Rahal pressure was going to be strong after Najhera’s defeat.\n “Do you expect the lens vessels to be combat-capable?” the magistrate asked without any trace of sarcasm.\n “I need them to sit there and look pretty in imitation of a Kel formation,” Jedao said. “They’ll get the heretics’ attention, and if they can shift some of the calendrical terrain in our favor, even better.” Unlikely, he’d had the Kel run the numbers for him, but it sounded nice. “Are volunteers available?”\n Also unlikely. The advantage of going to the Rahal rather than some other faction, besides their susceptibility to the plea, was that the Rahal were disciplined. Even if they weren’t going to be volunteers. If he gave instructions, the instructions would be rigorously carried out.\n The magistrate raised an eyebrow. “That’s not necessary,” he said. “I’m aware of your skill at tactics, General. I assume you will spare the lenses’ crews from unnecessary harm.”\n Touching. “I am grateful for your assistance, Magistrate,” Jedao said.\n “Serve well, General. The lenses will join your force at—” He named a time, which was probably going to be adhered to, then ended the communication.\n The lenses joined within eight minutes and nineteen seconds of the given time. Jedao wished there were some way to minimize their scan shadow, but Kel moths did that with formations, and the Rahal couldn’t generate Kel formation effects.\n Jedao joined Menowen at the command center even though he should have rested. Menowen’s mouth had a disapproving set. The rest of the Kel looked grim. “Sir,” Menowen said. “Move orders?”\n He took his chair and pulled up the orders on the computer. “False formation for the Rahal as shown. Follow the given movement plan,” he said. “Communications, please convey the orders to all Rahal vessels.” It was going to take extra time for the Rahal to sort themselves out, since they weren’t accustomed to traveling in a fake formation, but he wasn’t going to insult them by saying so.\n Menowen opened her mouth. Jedao stared at her. She closed her mouth, looking pensive.\n “Communications,” Jedao said, “address to all units. Exclude the Rahal.”\n It wasn’t the first speech he’d given on the journey, but the time had come to tell his commanders what they were up to and brace them for the action to come.\n The Communications officer said, “It’s open, sir.”\n “This is General Shuos Jedao to all moths,” he said. “It’s not a secret that we’re being pursued by a Lanterner swarm. We’re going to engage them at Candle Arc. Due to the Lanterners’ recent victory, cascading effects have shifted the calendrical terrain there. The Lanterners are going to be smart and take one of the channels with a friendly gradient to their tech most of the way in. Ordinarily, a force this small wouldn’t be worth their time. But because of the way the numbers have rolled, Candle Arc is a calendrical choke: we’re arriving on the Day of Broken Feet. Whoever wins there will shift the calendar in their favor. When we offer battle, they’ll take us up on it.”\n He consoled himself that, if the Lanterners lost, their soldiers would fall to fire and metal, honest deaths in battle, and not as calendrical foci, by having filaments needled into their feet to wind their way up into the brain.\n “You are Kel,” Jedao went on. “You have been hurt. I promise you we will hurt them back. But my orders will be exact, and I expect them to be followed exactly. Our chances of victory depend on this. I am not unaware of the numbers. But battle isn’t just about numbers. It’s about will. And you are Kel; in this matter you will prevail.”\n The panel lit up with each moth commander’s acknowledgment. Kel gold against Kel black.\n They didn’t believe him, not yet. But they would follow orders, and that was all he needed.\n Commander Menowen asked to see him in private afterward, as Jedao had thought she might. Her mouth was expressive. Around him she was usually expressing discontent. But it was discontent for the right reasons.\n “Sir,” Menowen said. “Permission to discuss the battle plan.”\n “You can discuss it all you like,” Jedao said. “I’ll say something if I have something to say.”\n “Perhaps you had some difficulties with the computer algebra system,” she said. “I’ve run the numbers. We’re arriving 4.2 hours before the terrain flips in our favor.”\n “I’m aware of that,” Jedao said.\n The near side of the choke locus was obstructed by a null region where no exotic technologies would function. But other regions around the null shifted according to a schedule. The far side of the choke periodically favored the high calendar. With Najhera’s defeat, the far side would also shift sometimes toward the Lanterners’ calendar.\n “I don’t understand what you’re trying to achieve,” Menowen said.\n “If you don’t see it,” Jedao said, pleased, “the Lanterners won’t see it either.”\n To her credit, she didn’t ask if this was based on an injury-induced delusion, although she clearly wanted to. “I expect Kel Command thinks you’ll pull off a miracle,” she said.\n Jedao’s mouth twisted. “No, Kel Command thinks a miracle would be very nice, but they’re not holding their breath, and as a Shuos I’m kind of expendable. The trouble is that I keep refusing to die.”\n It was like the advice for learning the game of pattern-stones: the best way to get good was to play difficult opponents, over and over. The trouble with war was that practicing required people to die.\n “You’ve done well for your armies, sir. But the enemy general is also good at using calendrical terrain, and they’ve demonstrated their ruthlessness. I don’t see why you would pass up a terrain advantage.”\n Jedao cocked an eyebrow at her. “We’re not. Everyone gets hypnotized by the high fucking calendar. Just because it enables our exotics doesn’t mean that the corresponding terrain is the most favorable to our purpose. I’ve been reading the intel on Lanterner engineering. Our invariant drives are better than theirs by a good margin. Anyway, why the hell would they be so stupid as to engage us in terrain that favors us? I picked the timing for a reason. You keep trying to beat the numbers, Commander, when the point is to beat the people.”\n Menowen considered that. “You are being very patient with my objections,” she said.\n “I need you not to freeze up in the middle of the battle,” Jedao said. “Although I would prefer for you to achieve that without my having to explain basics to you.”\n The insult had the desired effect. “I understand my duty,” she said. “Do you understand yours?”\n He wondered if he could keep her. Moth commanders who were willing to question him were becoming harder to find. His usual commanders would have had no doubts about his plan no matter how much he refused to explain in advance.\n “As I see it,” Jedao said, “my duty is to carry out the orders. See? We’re not so different after all. If that’s it, Commander, you should get back to work.”\n Menowen saluted him and headed for the door, then swung around. “Sir,” she said, “why did you choose to serve with the Kel? I assume it was a choice.” The Shuos were ordinarily seconded to the Kel as intelligence officers.\n “Maybe,” Jedao said, “it was because I wanted to know what honor looked like when it wasn’t a triumphal statue.”\n Her eyes went cold. “That’s not funny,” she said.\n “I wasn’t being funny,” he said quietly. “I will never be a Kel. I don’t think like one of you. But sometimes that’s an advantage.”\n She drew in a breath. “Sir,” she said, “I just want to know that this isn’t some Shuos game to you.” That he wasn’t being clever for the sake of being clever; that he wouldn’t throw his soldiers’ lives away because he was overeager to fight.\n Jedao’s smile was not meant to reassure her. “Oh, it’s to your advantage if it’s a game,” he said. “I am very good at winning games.”\n He wasn’t going to earn her loyalty by hiding his nature, so he wasn’t going to try.\n It was even easier to win games if you designed the game yourself, instead of playing someone else’s, but that was a Shuos sort of discussion and he didn’t think she wanted to hear it yet.\n The eleven fangmoths and seventy-three calendrical lenses approached Candle Arc only 1.3 hours behind schedule. Jedao was recovering the ability to read his watch, but the command center had a display that someone had enlarged for his benefit, so he didn’t look at it. Especially since he had the sneaking feeling that his watch was off by a fraction of a second. If he drew attention to it, Captain-magistrate Korais was going to recalibrate it to the high calendar when they all had more important things to deal with.\n The crews on the lenses had figured out how to simulate formations. No one would mistake them for Kel from close range, but Jedao wasn’t going to let the Lanterners get that close.\n “Word from the listening posts is that the Lanterners are still in pursuit,” Communications informed them.\n “How accommodating of them,” Jedao said. “All right. Orders for the Rahal: The lenses are to maintain formation and head through the indicated channel”—he passed over the waypoint coordinates from his computer station—“to the choke locus. You are to pass the locus, then circle back toward it. Don’t call us under any circumstances, we’ll call you. And stick to the given formation and don’t try any fancy modulations.”\n It was unlikely that the Rahal would try, but it was worth saying. The Rahal were going to be most convincing as a fake Kel swarm if they stayed in one formation because there wasn’t time to teach them to get the modulation to look right. The formation that Jedao had chosen for them was Senner’s Lash, partly because its visible effects were very short-range. When the Rahal failed to produce the force-lash, it wouldn’t look suspicious because the Lanterners wouldn’t expect to see anything from a distance.\n “Also,” Jedao said, still addressing the Rahal. “The instant you see something, anything on scan, you’re to banner the Deuce of Gears.”\n The Deuce was his personal emblem, and it connoted “cog in the machine.” Everyone had expected him to register some form of fox when he made brigadier general, but he had preferred a show of humility. The Deuce would let the Lanterners know who they were facing. It might not be entirely sporting for the Rahal to transmit it, but since they were under his command, he didn’t feel too bad about it.\n “The Rahal acknowledge,” Communications said. Jedao’s subdisplay showed them moving off. They would soon pass through the calendrical null, and at that point they would become harder to find on scan.\n Commander Menowen was drumming her fingers on the arm of her chair, her first sign of nervousness. “They have no defenses,” she said, almost to herself.\n It mattered that this mattered to her. “We won’t let the Lanterners reach them,” Jedao said. “If only because I would prefer to spend my career not having the Rahal mad at me.”\n Her sideways glance was only slightly irritated. “Where are we going, sir?”\n “Cut the mothdrives,” Jedao said. He sent the coordinates to Menowen, Communications, and Navigation. “We’re heading there by invariant drive only.” This would probably prevent long-range scan from seeing them. “Transmit orders to all moths. I want acknowledgments from the moth commanders.”\n “There” referred to some battledrift, all sharp edges and ash-scarred fragments and wrecked silverglass shards, near the mouth of what Jedao had designated the Yellow Passage. He expected the Lanterners to take it toward the choke. Its calendrical gradient started in the Lanterners’ favor, then zeroed out as it neared the null.\n Depending on the Lanterners’ invariant drives, it would take them two to three hours (high calendar) to cross the null region and reach the choke. This was, due to the periodic shifts, still faster than going around the null, because the detours would be through space hostile to their exotics for the next six hours.\n Reports had put the Lanterners at anywhere from sixty to one hundred twenty combat moths. The key was going to be splitting them up to fight a few at a time.\n Jedao’s moth commanders acknowledged less quickly than he would have liked, gold lights coming on one by one.\n “Formation?” Menowen prompted him.\n There weren’t a lot of choices when you had eleven moths. Jedao brought up a formation, which was putting it kindly because it didn’t belong to Lexicon Primary for tactical groups, or even Lexicon Secondary, which contained all the obsolete formations and parade effects. He wanted the moths in a concave configuration so they could focus lateral fire on the first hostiles to emerge from the Yellow Passage.\n “That’s the idea,” Jedao said, “but we’re using the battledrift as cover. Some big chunks of dead stuff floating out there, we might as well blend in and snipe the hell out of the Lanterners with the invariant weapons.” At least they had a good supply of missiles and ammunition, as Najhera had attempted to fight solely with exotic effects.\n The Kel didn’t like the word “snipe,” but they were just going to have to deal. “Transmit orders,” Jedao said.\n The acknowledgments lit up again, about as fast as they had earlier.\n The Fortune Comes in Fours switched into invariant mode as they crossed into the null. The lights became less white-gold and more rust-gold, giving everything a corroded appearance. The hum of the moth’s systems changed to a deeper, grittier whisper. The moth’s acceleration became noticeable, mostly in the form of pain. Jedao wished he had thought to take an extra dose of painkillers, but he couldn’t risk getting muddled.\n Menowen picked out a chunk of coruscating metals that had probably once been some inexplicable engine component on that long-ago space fortress and parked the Fortune behind it. She glanced at him to see if he would have any objections. He nodded at her. No sense in getting in the way when she was doing her job fine.\n Time passed. Jedao avoided checking his watch every minute thanks to long practice, although he met Captain-magistrate Korais’s eyes once and saw a wry acknowledgment of shared impatience.\n They had an excellent view of the bridgelights even on passive sensors. The lights were red and violet, like absurd petals, and their flickering would, under other circumstances, have been restful.\n “We won’t see hostiles until they’re on top of us,” Menowen said.\n More nerves. “It’ll be mutual,” Jedao said, loudly enough so the command center’s crew could hear him. “They’ll see us when they get that close, but they’ll be paying attention to the decoy swarm.”\n She wasn’t going to question his certainty in front of everyone, so he rewarded her by telling her. “I am sure of this,” he said, looking at her, “because of how the Lanterner general destroyed Najhera. They were extremely aggressive in exploiting calendrical terrain and, I’m sorry to say, they made a spectacle of the whole thing. I don’t imagine the Lanterners had time to swap out generals for the hell of it, especially one who had already performed well, so I’m assuming we’re dealing with the same individual. So if the Lanterner wants calendrical terrain and a big shiny target, fine. There it is.”\n More time passed. There was something wrong about the high calendar when it ticked off seconds cleanly and precisely and didn’t account for the way time crawled when you were waiting for battle. Among the many things wrong with the high calendar, but that one he could own to without getting called out as a heretic.\n “The far terrain is going to shift in our favor in five hours, sir,” Korais said.\n “Thank you, good to know,” Jedao said.\n To distract himself from the pain, he was thinking about the bridgelights and their resemblance to falling petals when Scan alerted him that the Lanterners had shown up. “Thirty-some moths in the van,” the officer said in a commendably steady voice. “Readings suggest more are behind them. They’re moving rapidly, vector suggests they’re headed down the Yellow Passage toward the choke locus, and they’re using a blast wave to clear mines.”\n As if he’d had the time to plant mines down a hostile corridor. Good of them to think of it, though.\n Menowen’s breath hissed between her teeth. “Our banner—”\n His emblem. The Kel transmitted their general’s emblem before battle. “No,” Jedao said. “We’re not bannering. The Lanterners are going to be receiving the Deuce of Gears from over there,” where the Rahal were.\n “But the protocol, sir. The Rahal aren’t part of your force,” Menowen said, “they don’t fight—”\n That got his attention. “Fledge,” Jedao said sharply, which brought her up short, “what the hell do you mean they’re not fighting? Just because they’re not sitting on a mass of things that go boom? They’re fighting what’s in the enemy’s head.”\n He studied the enemy dispositions. The Yellow Passage narrowed as it approached the null, and the first group consisted of eight hellmoths, smaller than fangmoths, but well-armed if they were in terrain friendly to their own calendar, which was not going to be the case at the passage’s mouth. The rest of the groups would probably consist of eight to twelve hellmoths each. Taken piecemeal, entirely doable.\n “They fell for it,” Menowen breathed, then wisely shut up.\n “General Shuos Jedao to all moths,” Jedao said. “Coordinated strike on incoming units with missiles and railguns.” Hellmoths didn’t have good side weapons, so he wasn’t as concerned about return fire. “After the first hits, move into the Yellow Passage to engage. Repeat, move into the Yellow Passage.”\n The fangmoths’ backs would be to that damned null, no good way to retreat, but that would only motivate them to fight harder.\n If the Lanterners wanted a chance at the choke, they’d have to choose between shooting their way through when the geometry didn’t permit them to bring their numbers to bear in the passage, or else leaving the passage and taking their chances with terrain that shaded toward the high calendar. If they chose the latter, they risked being hit by Kel formation effects, anything from force lances to scatterbursts, on top of the fangmoths’ exotic weapons.\n The display was soon a mess of red lights and gold, damage reports. The computer kept making the dry, metallic click that indicated hits made by the Kel. Say what you liked about the Kel, they did fine with weapons.\n Two hellmoths tried to break through the Kel fangmoths, presumably under the impression that the Rahal were the real enemy. One hellmoth took a direct engine hit from a spinal railgun, while the other shuddered apart under a barrage of missiles that overwhelmed the anti-missile defenses.\n “You poor fools,” Jedao said, perusing the summaries despite the horrible throbbing in his left eye. “You found a general who was incandescently talented at calendrical warfare, so you spent all your money on the exotic toys and ran out of funding for the boring invariant stuff.”\n Menowen paused in coordinating damage control—they’d taken a burst from an exploding scout, of all things—and remarked, “I should think you’d be grateful, sir.”\n “It’s war, Commander, and someone always dies,” Jedao said, aware of Korais listening in; aware that even this might be revealing too much. “That doesn’t mean I’m eager to dance on their ashes.”\n “Of course,” Menowen said, but her voice revealed nothing of her feelings.\n The fangmoths curved into a concave bowl as they advanced up the Yellow Passage. The wrecked Lanterner hellmoths in the van were getting in the way of the Lanterners’ attempts to bring fire to bear. Jedao had planned for a slaughter, but he hadn’t expected it to work this well. They seemed to think his force was a detachment to delay them from reaching the false Kel swarm while the far terrain was hostile to the high calendar, and that if they could get past him before the terrain changed, they would prevail. It wasn’t until the fourth group of Lanterners had been written into rubble and smoke that their swarm discipline wavered. Some of the hellmoths and their auxiliaries started peeling out of the passage just to have somewhere else to go. Others turned around, exposing their sides to further punishment, so they could accelerate back up the passage where the Kel wouldn’t be able to catch them.\n One of Jedao’s fangmoths had taken engine damage serious enough that he had ordered it to pull back, but that left him ten to work with. “Formation Sparrow’s Spear,” he said, and gave the first set of targets.\n The fangmoths narrowed into formation as they plunged out of the Yellow Passage and toward five hellmoths and a transport moving with the speed and grace of a flipped turtle. As they entered friendlier terrain, white-gold fire blazed up from the formation’s primary pivot and raked through two hellmoths, the transport, and a piece of crystalline battledrift.\n They swung around for a second strike, shifting into a shield formation to slough off the incoming fire.\n This is too easy, Jedao thought coldly, and then.\n “Incoming message from Lanterner hellmoth 5,” Communications said. Scan had tagged it as the probable command moth. “Hellmoth 5 has disengaged.” It wasn’t the only one. The list showed up on Jedao’s display.\n “Hold fire on anything that isn’t shooting at us,” Jedao said. “They want to talk? I’ll talk.”\n There was still a core of fourteen hellmoths whose morale hadn’t broken. A few of the stragglers were taking potshots at the Kel, but the fourteen had stopped firing.\n “This is Lieutenant Colonel Akkion Dhaved,” said a man’s voice. “I assume I’m addressing a Kel general.”\n “In a manner of speaking,” Jedao said. “This is General Shuos Jedao. Are you the ranking officer?” Damn. He would have liked to know the Lanterner general’s name.\n “Sir,” Menowen mouthed, “it’s a trick, stop talking to them.”\n He wasn’t sure he disagreed, but he wasn’t going to get more information by closing the channel.\n “That’s complicated, General.” Dhaved’s voice was sardonic. “I have an offer to make you.”\n “I’m sorry,” Jedao said, “but are you the ranking officer? Are you authorized to have this conversation?” He wasn’t the only one who didn’t like the direction of the conversation. The weight of collective Kel disapproval was almost crushing.\n “I’m offering you a trade, General. You’ve been facing General Bremis kae Meghuet of the Lantern.”\n The name sounded familiar—\n “She’s the cousin of Bremis kae Erisphon, one of our leaders. Hostage value, if you care. You’re welcome to her if you let the rest of us go. She’s intact. Whether you want to leave her that way is your affair.”\n Jedao didn’t realize how chilly his voice was until he saw Menowen straighten in approval. “Are you telling me you mutinied against your commanding officer?”\n “She lost the battle,” Dhaved said, “and it’s either death or capture. We all know what the heptarchate does to heretics, don’t we?”\n Korais spoke with quiet urgency. “General. Find out if Bremis kae Meghuet really is alive.”\n Jedao met the man’s eyes. It took him a moment to understand the expression in them: regret.\n “There’s a nine-hour window,” Korais said. “The Day of Broken Feet isn’t over.”\n Jedao gestured for Communications to mute the channel, which he should have done earlier. “The battle’s basically won and we’ll see the cascade effects soon,” he said. “What do you have in mind?”\n “It’s not ideal,” Korais said, “but a heretic general is a sufficient symbol.” Just as Jedao himself might have been, if the assassin had succeeded. “If we torture kae Meghuet ourselves, it would cement the victory in the calendar.”\n Jedao hauled himself to his feet to glare at Korais, which was a mistake. He almost lost his balance when the pain drove through his head like nails.\n Still, Jedao had to give Korais credit for avoiding the usual euphemism, processed.\n Filaments in the feet. It was said that that particular group of heretics had taken weeks to die.\n Fuck dignity. Jedao hung on to the arm of the chair and said, as distinctly as he could, “It’s a trick. I’m not dealing with Dhaved. Tell the Lanterners we’ll resume the engagement in seven minutes.” His vision was going white around the edges, but he had to say this. Seven minutes wouldn’t give the Lanterners enough time to run or evade, but it mattered. It mattered. “Annihilate anything that can’t run fast enough.”\n Best not to leave Doctrine any prisoners to torture.\n Jedao was falling over sideways. Someone caught his arm. Commander Menowen. “You ought to let us take care of the mopping up, sir,” she said. “You’re not well.”\n She could relieve him of duty. Reverse his orders. Given that the world was one vast blur, he couldn’t argue that he was in any fit shape to assess the situation. He tried to speak again, but the pain hit again, and he couldn’t remember how to form words.\n “I don’t like to press at a time like this,” Korais was saying to Menowen, “but the Lanterner general—”\n “General Jedao has spoken,” Menowen said crisply. “Find another way, Captain.” She called for a junior officer to escort Jedao out of the command center.\n Words were said around him, a lot of them. They didn’t take him to his quarters. They took him to the medical center. All the while he thought about lights and shrapnel and petals falling endlessly in the dark.\n Commander Menowen came to talk to him after he was returned to his quarters. The mopping up was still going on. Menowen was carrying a small wooden box. He hoped it didn’t contain more medications.\n “Sir,” Menowen said, “I used to think heretics were just heretics, and death was just death. Why does it matter to you how they die?”\n Menowen had backed him against Doctrine, and she hadn’t had to. That meant a lot.\n She hadn’t said that she didn’t have her own reasons. She had asked for his. Fair enough.\n Jedao had served with Kel who would have understood why he had balked. A few of them would have shot him if he had turned over an enemy officer, even a heretic, for torture. But as he advanced in rank, he found fewer and fewer such Kel. One of the consequences of living in a police state.\n “Because war is about people,” Jedao said. “Even when you’re killing them.”\n “I don’t imagine that makes you popular with Doctrine,” Menowen said.\n “The Rahal can’t get rid of me because the Kel like me. I just have to make sure it stays that way.”\n She looked at him steadily. “Then you have one more Kel ally, sir. We have the final tally. We engaged ninety-one hellmoths and destroyed forty-nine of them. Captain-magistrate Korais is obliged to report your actions, but given the numbers, you are going to get a lot of leniency.”\n There would have been around 400 crew on each of the hellmoths. He had already seen the casualty figures for his own fangmoths and the three Rahal vessels that had gotten involved, fourteen dead and fifty-one injured.\n “Leniency wasn’t what I was looking for,” Jedao said.\n Menowen nodded slowly.\n “Is there anything exciting about our journey to Twin Axes, or can I go back to being an invalid?”\n “One thing,” she said. “Doctrine has provisionally declared a remembrance of your victory to replace the Day of Broken Feet. He says it is likely to be approved by the high magistrates. Since we didn’t provide a heretic focus for torture, we’re burning effigy candles.” She hesitated. “He said he thought you might prefer this alternative remembrance. You don’t want to be caught shirking this.” She put the box down on the nearest table.\n “I will observe the remembrance,” Jedao said, “although it’s ridiculous to remember something that just happened.”\n Menowen’s mouth quirked. “One less day for publicly torturing criminals,” she said, and he couldn’t argue. “That’s all, sir.”\n After she had gone, Jedao opened the box. It contained red candles in the shape of hellmoths, except the wax was additionally carved with writhing bullet-ridden figures.\n Jedao set the candles out and lit them with the provided lighter, then stared at the melting figures. I don’t think you understand what I’m taking away from these remembrance days, he thought. The next time he won some remarkable victory, it wasn’t going to be against some unfortunate heretics. It was going to be against the high calendar itself. Every observance would be a reminder of what he had to do next—and while everyone lost a battle eventually, he had one more Kel officer in his corner, and he didn’t plan on losing now.\n Yoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators."}