{"fingerprint": "sfxAJtnlbG1GhjAoobu2sBEAWDU=", "sitename": "Clarkesworld Magazine", "title": "55 Plaque by Isabel Lee", "author": "Isabel Lee", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lee_03_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: 55 Plaque by Isabel Lee", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7670 words, novelette\n55 Plaque\nThere aren’t actually fifty-five plaques. I’ve found this to be a pretty common misconception in children, especially when parents neglect to talk about it at home. That’s why it’s one of the first points I go over when we begin our unit on the Didacts. There are only nine plaques that have arrived on Earth so far; 55 comes from the number of years between the ninth plaque and this coming tenth one, a number that follows a very special pattern called the Fibonacci sequence.\nFibonacci, I say again slowly, spelling it out in big letters on the whiteboard. The first numbers in the sequence are 1 1 2 3 5. Can someone tell me the next number?\nI pass out sheets of graph paper and together, we draw the spiral. I show them how to draw each box in pencil so that they nestle together perfectly, and then everyone uses their black marker to trace the quarter-circles that connect to form the conch-shell curve. In each box, we write the Plaque number and the year in which it arrived. I start the math from the beginning: The Alpha Plaque arrived in 1879. One year later, the Beta Plaque arrived in 1880. The 2 Plaque arrived in 1882, then the 3 Plaque in 1885, then the 5 Plaque in 1890. By the time we get to 34 Plaque, the box already creeps off the sheet, and barely any of the last box fits in the sliver of paper that is left. Still, I tell them to fit a big 55: 2021 in the edges of the sheet.\n2021. This year seemed so far away when I first started teaching, nearly six years ago. But now, the future is here, and the government predictions are putting the Arrival sometime next month. Isn’t that amazing, folks? How lucky are we to be alive right now?\nThen the kids get to color the spirals however they want, and by the time that’s over, we’ve usually hit recess. The spirals are collected, cut out, and laminated, then hung from the ceiling of my classroom until our Dinosaur unit in December. Today, though, the universe throws a wrench into my lesson plan. I can sense it—someone is about to cry. I turn from the whiteboard and scan the room, and sure enough, Alya is sniffling at her desk. Connor’s right next to her, of course. I make a mental note about the seating chart as I walk over. “Alya, honey, what’s wrong?”\nAlya wipes pearls from her eyes, her dainty features contorted with anguish. “C-Connor said the sky’s gonna become pink,” she whimpers. “And then it’s gonna get really bright and loud, like the world’s ending. But that’s not true, right, Ms. Ore?”\nI crouch down, assembling my answer. The 34 Plaque video isn’t shown until later in the unit, when we think we’ve prepared the kids enough. Connor’s undoubtedly seen it, though: rivulets of light streaking the rose-tinted sky over a trembling Earth, all in that grainy sixties film glory. The most watched video in human history, probably. Pink Sky has been recorded with every wave, but only for the last was color film possible. “The world’s not going to end,” I say gently. I give Connor a stern look and he squirms in his seat. “It might feel scary at first, but that’s why we’re learning about it in school. So when 55 Plaque comes, you’ll know how important and amazing it is.”\nAlya shakes her head. “But none of it is real,” she mumbles. “The Didacts, Pink Sky, 55 Plaque, all of it. My dad told me so.”\nHer words siphon all the pre-rehearsed Didactology responses from my head and leave me speechless. Even Connor gives her a stunned, bug-eyed look. I purse my lips. “I think he might be a little confused about that,” I manage, and then touch her spiral lightly. “I like the checkerboard pattern you’re drawing, Alya. Keep it up.”\nThe situation seems adequately diffused, and I straighten up. Other kids call for my attention, and Alya’s words fall to the background of marker disputes, Joey’s paper ripping down the middle. In the silence that follows recess dismissal, though, I sit in my empty classroom and stare at the blank space hovering on top of my inbox, unsure of how to start. In between cursor blinks, I realize I’ve been wondering when I’d have to write this email for a long time.\nAfter school ends, I take the train all the way to the Bronx. As we rumble out of Harlem, I put in my earbuds and stare out at the usual murals. The imagery is obvious, if you know what you’re looking for. The most famous one depicts a little girl iconically holding a sunflower, the center engorged with meticulously staggered seeds. Other commonalities are the nautiluses, pine cones, and spiral galaxies that dot the brick edifices all the way home.\nI’m reminded of a manga Mom showed me in middle school, where an entire town becomes supernaturally obsessed with spirals. People drive themselves to insanity as they begin to see spirals in their hair, the sky, creeping into the walls of their homes. It makes me wonder if I’m doing something like that, too, every September when I teach this unit. Because once you understand the Fibonacci sequence, the golden ratio it manifests in, you can never unsee how often it appears around you. It’s as if the world has committed it to memory, etched it into its bones. We’re listening, it wants to say. We’ve understood.\nI get off the train and walk the two blocks to my apartment. I’ve had my own place for years now, but I remember when Mom would come up for the week and take the spare bedroom, to meet friends or run special errands. It’s been nearly two years since she passed, but sometimes when I open the door, I still think she’ll be in the kitchen waiting for me, dinner already warm on the stove top. As always, though, all I arrive to today is darkness and an unstocked fridge. I root around the pantry and decide to make curry, one of my staples nowadays. It reminds me of better times, when I wasn’t really living alone. It’s also stupidly easy.\nMy phone buzzes as I start to dice onions and carrots, and I pick up after I see it’s Dad. “Hello?”\n“Hello, Sam? It’s Dad.” His voice is tinny and muffled, and I can imagine him hunched over the kitchen table in his apartment, speaking to the cell phone I gave him five years ago.\nI turn on speaker and prop my phone on the counter. “I know, I have Caller ID.”\n“Hey, how’ya doing? You said you were coming up this weekend, right?”\nI stop cutting and rack my brain, wondering when I told him I was heading upstate at all. “Sure, I can come Saturday, if that works,” I tell him all the same. All we have is each other, as Mom would say. She said that a lot near the end.\nDad says good, see you then, and then I hang up. I start to peel a potato, already dreading the drive up. Lately, there’s been massive construction projects on major highways, to ensure our infrastructure is intact in the unlikely scenario that 55 Plaque bequeaths itself upon New York. Thanks to some feat of Didact engineering, Plaques have never landed in urban areas, but shards of its protective capsule have been known to break apart in the atmosphere and disperse across continents. Practically, this means that traffic is just always terrible. Then I remind myself that I don’t see Dad nearly as often anymore. My parents used to live much closer to the Bronx, but after Mom passed, we sold my childhood home and I helped Dad move into a smaller apartment. Since then, my visits have grown much more infrequent.\nAs I wait for the water to boil, I try to not think about the drive or my aging, lonely father. Instead I run through the lessons I’ll give later this week. Tomorrow I’ll describe the Didacts themselves, the bread crumb messages they’ve left for us to follow with each new Plaque.\nSomeone always asks: What’s on the Plaques? They’re all different, I’d reply, but each teaches us something new about science or mathematics. 21 Plaque taught us universal laws of physics, and 34 Plaque gave us major breakthroughs in chemistry and medicine. The knowledge they’ve given us has saved millions of lives. But why are the Didacts telling us these things? We don’t know for sure. But scientists think that the Didacts want our help. Right now they’re giving us the information we need to develop as a civilization. One day in the future, they’ll leave their planet and come to Earth, and we’ll save them. There are plenty of other theories, of course, ones that are much scarier and arguably more plausible. But those aren’t in the curriculum.\nAnd then the hard one: When exactly are they coming? To this I have to take a deep breath and say, we still don’t know, but most likely far in the future. Some scientists believe the Didacts plan to send 13 Plaques in total. If that’s true, then we have hundreds of years left to wait. That’s a bummer to a lot of kids: No Didact meet-and-greets at birthday parties anytime soon. No, we will spend our entire lives in the in-between.\nWhen I tell people I teach first grade, they like to bemoan how challenging these conversations must be, how hard it is to get kids to understand the entirety of the Didacts and their plan. Honestly, I don’t think it’s that bad. Kids’ brains are so malleable; they can wrap around almost anything. Besides, my job is just to simplify things we’ve known for decades. Later on in the unit, I’ll tell my kids to imagine themselves as Ngô Chí Thiện, the Vietnamese farmer whose rice paddy was the landing site of the Alpha Plaque in 1879. Imagine witnessing Pink Sky for the first time and thinking that the world is ending. Imagine being on the first team of scientists to excavate the Alpha Plaque, to decipher their etchings and realize the artifact’s implications. These things are harder than any lesson I could ever teach.\nThe water is boiling, and I slide in my vegetables, lost in thought. In 55 Plaque’s advent, who knows how the world will change? The knowledge it brings will surely alter our understanding of reality, though scientists won’t come to an official consensus for years. I drop blocks of curry roux into the water and use a wooden spoon to crumble them into pieces. Caramel color seeps into the stock, filling the apartment with warm, rich fragrance, and I sigh. I almost envy my kids in this way. They’ll take 55 Plaque in stride, come of age within the new world order it brings. I doubt the rest of us will fare as well.\nAlya’s parents tell me they’re available Thursday after school, and so at 3:30 p.m. they sit across from me in the empty classroom while she’s in ballet. Alya’s father, large and stoic, wears a thick vintage bomber jacket that’s sizes too big for him. Alya’s mother, tiny like her child, fidgets with her fingers, her face creased with concern. “I’m sorry, but didn’t the other child make Alya cry? So why . . . ?”\nI nod. “That’s correct, Mrs. Fahri. But we worked out the situation, and it’s actually something Alya said after that caught my attention.” I look to Mr. Fahri, who glowers back. “Alya mentioned that you had . . . expressed your disbelief in Didactology, and it was causing a little confusion.”\nThe Fahris exchange glances. Mr. Fahri leans toward me, matte fabric bunching around his shoulders. “Look, ma’am, all I’m doing is raising my child to accurately assess the world around her. And I think it’s my own right to do so.” He rests his elbow on the desk, his palm open to the sky. “In all honesty, I think I should be the one questioning you. Do these unproven theories really belong in schools? Aren’t you twisting the narrative for our kids?”\nOn his hand, I see what he unmistakably wants me to see: a thick brass ring, striped by a powder-blue line. A quick glance at Mrs. Fahri’s hands reveal she’s playing with an identical item, and my stomach twists. Of course they’re Humanists. I could have told you as much from Alya’s words alone, but something about how brazenly the Fahris display their rings deeply unsettles me. Growing up, this organization was considered fringe, extremists in tinfoil hats at the outskirts of society. But like a Fibonacci spiral itself, the Humanist movement has exploded in size within the last few years. Nowadays they clog up news cycles and infiltrate school boards across the country, demanding Didactology be removed from the curriculum and replaced with human-centric explanations for the Plaques. Their rings, traditionally used in ceremony, signal both their level and their most important tenets—blue like the seas for followers, verdant greens for evangelists, sunny gold for their leaders. They refuse to believe that anything could be more important than Earth, than us.\nI force myself to maintain eye contact and muster a placid grin. “Mr. Fahri, this is what every child in America must learn by law. Rest assured that we only teach the most supported theories and give students plenty of evidence—”\nMr. Fahri scoffs. “Evidence that was forged by our government, come on!”\nMrs. Fahri looks between me and her husband nervously. “Albi, let’s not—”\n“No, I think I’ve heard enough.” Mr. Fahri gets up and stands over me, smug. “I see the crap Alya has to deal with at school. At this rate, we might as well take her out.” With those words, he walks out of the classroom. Mrs. Farhi hovers in her seat for a second, then mumbles something apologetic and runs off after him.\nThe door swings shut, and I sit there for a while, tense. Finally, I exhale and cradle my head in my hands. Parent-teacher conferences are often taxing, but this one leaves me especially disturbed. For years, I’ve watched Humanist discourse bloom into a movement and tried to shield my kids from the worst of it. But how can I stop the seeds budding in their own houses? There’s no way I can protect them from everything, nor tell them that the life they know and the people they love are wrong. What keeps me up at night is that I don’t know who will.\nIt’s Saturday, and I stand outside my father’s apartment complex, lingering a little longer than usual. The air is cooler and clearer in Poughkeepsie, and flame-tinged foliage crowns the sky above my head, filtering in light in layers.\nDad opens the door on my second knock and lets me in. His apartment is always a little mustier than I remember. I hand him a bag of low-sodium cashew clusters as I enter, my usual offering. The doctor says his diet needs more Omega-3, and these are the only things I know he’ll eat. “Traffic real bad today?” he asks, ripping open the bag and popping one in his mouth.\n“Awful,” I say, cracking my back and glancing around. “Could I have some coffee, Dad?”\nWhile the coffee machine is brewing, I sit at the kitchen table and sort through the teetering pile of junk mail, giving him the usual mundane updates. Dad bumbles around the apartment, stacking dirty dishes and closing drawers, things I’m sure he meant to do before I arrived. When Mom died two years ago, it wasn’t like Dad’s life had just fallen apart. He kept on top of bills and ran miles each morning, too prideful of his own agency to allow himself to slip. But it’s the small things, like Mom having fresh-cut fruit ready every time I visit, that he can’t account for, and that I miss the most.\n“How are the kiddos?” Dad asks as the coffee machine chimes. He pulls a mug from the drying rack and starts to pour.\n“They’re good. I swear they get rowdier every year.” I roll my eyes. “Don’t get me started on the parents, though. Some of them are genuinely crazy.”\n“Well, I’m sure they’re just trying to do what’s best for their child,” Dad says mildly, setting the mug down. I make a face and say nothing, studying all the paper on his table. On second glance, I notice the vast majority are branded with the same emblem, a sun surrounded by small inky letters that read Hallowed Sky Ministries.\nI pick up a flyer and read it, feeling the thick, glossy paper between my fingers. “You guys are doing potlucks now?” It comes out sounding more derisive than intended, and I wince. I know in my heart Hallowed Sky is good for him. He found the community shortly after he moved to Poughkeepsie, and it gave him something to do, a fresh start in a new place. But we never went to church when I was a kid, never as much as dressed up for Christmas. I still can’t fathom the thought of my father bowed in prayer.\nDad nods good-naturedly. “Yep, they’re a new thing, but turnout has been really good so far. You should come to the one this Wednesday, Sammy—we always do these things in Glenn Park.” He points to the address printed on the bottom.\nI put the flyer down and sip my coffee, stalling. He invites me offhand to church events every once in a while, though lately they feel more and more frequent. “Um. Maybe not on a work night.”\n“There’s always the Hallowed Sky branch in the city, too. I’ve heard they have a great local pastor,” Dad adds enthusiastically. I shrug, and he falls silent, his eyes shifting to the table. “I know this is unfamiliar,” he says, his voice soft. “Believe me, I know. But . . . I think you’d be really surprised if you tried it.” He picks up the flyer again and pushes it into my hands. “We all need assurance, don’t we? Now more than ever.”\nThe flyer wavers, outstretched in front of me. A memory rushes to mind: my father handing me a pair of batteries in our garage, when I was no older than six. He had modified one of my dolls, a fairy, and sewn tiny lights in her delicate wings. I clunked the batteries into place, and she had started to shimmer instantly, the lights tracing intricate swirls. I had gasped at the magic I thought I created, but really, it was all him. An electrical engineer for forty years, Dad would wire up my toys whenever I got bored with them. He was eight in 1966 and witnessed 34 Plaque from his backyard in Jersey. When it streaked across his sky, on its way to a remote field in Zimbabwe that’s now considered sacred, he wasn’t inspired to pursue Didactology or astrophysics like other kids who witnessed the same event. No, my father saw Pink Sky and never got over the lights.\nI take the flyer and slip it into my purse wordlessly, and he smiles. Neither of us mention the topic for the rest of the visit, and soon I find myself hugging him at the door, assuring him I’ll come up again soon. On the way back to the car, I pass a trash can and feel the paper crease in my purse, briefly consider what would be too easy. I can’t bring myself to do it.\nSome things, I tell my kids, we have to trust are really there even if we can’t see them. I say this to Juliet during indoor recess on Friday, when she asks why we talk so much about the Didacts when they live so far away. This answer doesn’t seem to satisfy her, but she shrugs anyway and goes back to coloring her Rainbow Fish. She’s filling in the scales with circles, from the inside out.\nWe’ve been having indoor recess a lot these days, which is a real bummer. The start of October is when brilliant golden foliage shrouds our blacktop, when the air is sweet and cool and not yet prickly with ice. But like every day for the past two weeks, the Humanists are holding a rally in the park next to school, so like every day for the past two weeks, we’ve been ordered to stay inside. The kids basically do whatever they want in the classroom for twenty minutes, while I miss half my lunch break. It’s a deal none of us want.\nI spot Alya and Connor sitting together at the Moon Sand table and immediately start to gravitate toward them. To my surprise, they seem to be getting along, each absorbed in their creation. Alya perks up when she spots me nearing. Her dad’s threats to take her out of school have proven to be empty so far, thankfully. “Ms. Ore, look! I made a doggy,” she says, showing me the lumpy mound in front of her. I smile and nod. Moon Sand is the bane of my existence, but the kids love it so much I can’t bring myself to get rid of it.\nConnor crushes his own malformed lump with his fist. “Ms. Ore, I’m bored,” he sighs. “When can we play tetherball ousside again?”\nI’m not sure what to tell him. The government has set the Arrival period to start next Monday, after which every day is fair game. The Humanists will surely be rallying until then; they’ve already moved mountains to land the permits they need to stay in the park, somehow slithering out of any noise complaint or city appeal the school has thrown at them. “A little while longer, bud,” I say. “These people won’t leave until after 55 Plaque comes.”\nConnor groans. “I hate the people yelling in the park,” he tells me. “My mom says they’re dumber than dirt.”\nIn the edges of my vision Alya stares at her sand dog silently. “We don’t hate others,” I tell Connor sternly. “You know better than that.”\nI smile faintly at Alya, but she shows no reaction to Connor’s comment. Instead, she’s fixated on the sand, tracing lines surrounding her dog that spiral out to the edges. She hums as she works, until she notices me watching.\n“Do you like it?” she asks, and I nod tightly. The alarm erupts from my desk, and I get up and call five minutes to the class.\nAt the end of the school day, I remind people about permission slips for next week’s museum field trip as everyone’s packing up. “They were due today, so if you didn’t bring it in, make sure to remind your adults first thing when you get home,” I stress over the chatter and backpack-zipping. My expectations are not high. First graders are notoriously bad at this.\nThe room clears out and I sit at my desk, debating whether or not to try to catch the earlier train. I realize I’d have to run, which decides things. I check my phone instead. Dad has sent me a long email that looks suspiciously like spam, and then I double-check the subject line. This Week at Hallowed Sky, it reads, and my finger hovers for a second before marking it as read.\nI lean back in my chair as an eruption of voices tremble through my window. The Humanists’ protests usually disappear underneath the classroom noise, but in the silence I can make out their chants from across the blacktop. No Didacts! No Lies! The People Need To Open Their Eyes!\nThis chant in particular is one of their favorites, though they’re all pretty nonsensical, just like the beliefs they stand for. Any normal person would tell you Humanist rhetoric is ungrounded and inconsistent, with countless factions all claiming their own insane things. The main message is the same, though: that the Didacts aren’t real, that the Plaques were made by the government in order to sell a narrative and control of the public, that humans are in fact the dominant (and only!) species of the universe. Depending on your flavor, you also might believe that people who believe in the Didacts are devil-worshippers, or that Abraham Lincoln masterminded this plot back during the Civil War, or that the Plaques are manufactured below Disney World. Regardless, it’s all obnoxious. Outside, I can hear chants crescendo and bubble over into loud cheering, and I wonder how they can stand to protest for so long. Maybe they work in shifts.\nSoon, though, the protests become buried underneath familiar rambunctious noise. I crane my neck toward the blacktop, where lines of kids squeal and dart around each other as they head toward the buses in the parking lot, blissfully unaware of the brewing storm just a few yards away from them. They’re chaperoned by aides, a new safety precaution since the protests started. The aide who leads my class passes into view and I recognize the forms of my kids: Jacob in his puffy camouflage coat, Natalie and her hot pink boots. I make out Alya near the back of the line, skipping to keep up with her peers. Before they all disappear behind the trees, I swear I see her gaze out toward the park, hover for a moment, and then wave.\nDad calls when I’m frying gyoza and watching the Monday night news. It’s already a precarious setup; my hand is stinging from hot oil splashes, and I’ve accidentally flipped one off the pan while my eyes were glued to the screen. But I pick up. “Hello?”\n“Hi Sam, it’s Dad.”\n“Hi, Dad,” I say, nearly sending another gyoza overboard. I grab the remote and turn down the volume, then turn on the CC’s. The breaking story tonight focuses on statements released by Humanist groups about their plans upon the Arrival. The news anchors talk with experts, who try to dissect the phrases buried in their vague threats: Revoke society. Secede. Start anew. No one is sure what they actually mean, it seems.\n“Did you end up going to Hallowed Sky in the city yesterday?” Dad asks. I freeze. I spent yesterday eating Oreos and looking at dogs up for adoption on my laptop, before concluding I have neither the time nor the money nor the facilities to own one.\n“Uh—” I say, switching my phone from one side to the other, “—yea, actually, I did.”\n“Really?” His voice brightens and I feel guilt punch me in the chest. “How did you like the guest speaker? Wasn’t he something?”\n“Yea,” I agree, grimacing. “His message was . . . really convincing.”\nThere’s a pause from Dad’s side, and for a moment I’m sure he knows I’m lying. “So you truly believe what he says, Sam?” he asks softly.\nI suck in my breath. “Oh. Uh, I mean, it’s all so new, and . . . ”\n“Right, right,” Dad says hurriedly. “Well, it’s good that you went, that you heard his teachings.” A silence seeps in between us, and I imagine him on the other end of the line, grasping for words about life and truth and God. What can’t he say to his daughter?\nFinally, I change the subject. “The Arrival is coming so soon,” I state. In the classroom, I usually effuse this sentiment with excitement and hope, but to Dad I can only feel their weight. I think about the economy crashing in ’32, about the food shortages my parents lived through in ’66. I think about what they’re saying this time, that it may be worse. “Make sure you’re locking your doors, okay? Who knows what’s going to happen.”\nDad chuckles. “You don’t have to worry about me, honey.” He pauses. “You’ll be coming, right?”\n“Hm?” I catch a whiff of something burning, and I look down at the stove top. “Oh, shit—yea, Dad, I’ll come up soon. I gotta go.” I hang up and drop the gyoza on a plate, and then smother the smoking pan in the faucet sink. Steam billows into my face and I hold my breath, praying that my apartment’s temperamental smoke alarm keeps its chill today. A few moments of silence pass, and I exhale slowly. Then the blaring starts.\nIt’s everyone’s favorite day—field trip day. We’re gathered in the rotunda with what feels like every other class in the city. A giant clock looms above us, chimes reverberating as it hits 9 a.m. My kids swarm around, practically vibrating with excitement, and I lose head count twice before our tour guide finds us and herds the group into a long, empty hallway. The kids hush immediately in the sudden darkness, enraptured by the array of eerie nature dioramas. The guide begins a spiel on beavers, and from the back I tally twenty-four and breathe a sigh of relief.\nWe visit exhibit after exhibit throughout the morning, the kids gasping in delight with each new hall we step into. We go to the Museum of Natural History every year, so by now I know what will be hits; the dinosaur hall is always a crowd-pleaser, as well as the room with enormous prehistoric bugs they can mount like horses. This year, the mummy chamber spooks the hell out of Louis, and I spend twenty minutes calming him down outside the bathrooms.\nThe best exhibit is always saved for last, though. After lunch, the guide leads us through the solar system hall, where planets and asteroids shine like ghosts. At the end of the hallway, we turn a corner into a large, open foyer, sunlight streaming through glass panels on the peaked ceiling. This room is always busy, but it’s especially packed this time, and my kids advance eagerly through the crowds. In the middle of the room stands a wide stone slab, and mounted on the surface is a small, golden disk. It’s only a few feet in diameter, barely taller than my kids. Above the disk, letters have been etched into stone: THE ALPHA PLAQUE (1879).\nAs I approach, waves of light ripple across the surface, grooves glinting and revealing the intricate patterns. I’ve shown this image before in class, projected it onto the whiteboard and explained the meanings of each cluster of symbols. But it’s so different when it’s really in front of you; it never gets old. I find myself brushing against the velvet ropes, drinking in every detail.\nA trio of circles convene in the Plaque’s midpoint, around which smaller ones trace dizzying epicycles. This is their solar system of origin. From there, large swooping curves draw your eyes from the center to the outer edges; on the top, the Didacts have etched lines like soldiers, establishing scale and units of distance. Strange ellipsoids filled with hatched characters fill the bottom edge, representing the Didact’s atomic models, hydrogen and helium and carbon. Other symbols fill in the rest of the space, communicating their number system, their written words for Didact, Earth, Star, Human. The fifth word was something we didn’t figure out until 13 Plaque. Wait.\nThese are the fundamentals, simple concepts that unfold into grander ideas in later Plaques. Everything’s placed here for a purpose. When the Didacts eventually try to teach us how to achieve light speed travel, or harness energy for the sun, or whatever it is they truly want us to know, I wonder if we’ll be able to put all the pieces together. I wonder how different we’ll be.\nI look over at my kids, who have wormed their way to the front of the crowds and lean against the ropes. I catch sight of Alya’s face, lit up in wonder, and I feel something in my chest ache. They soak all of this up so effortlessly, never believing for a second that we’d ever lie to them. Here, in this big, bright room, in the presence of a truth much larger than any of us, I want so badly to believe that we don’t.\nWhen we step out of the museum, the world rushes to greet us as it always has. The kids who bought souvenirs flash them off to their friends, the chatter subdued after a day’s worth of exhaustion. As we descend the stairs and head toward the bus, I look across the open street, toward the city’s skyline. It’s still midafternoon, but the sky seems duller than normal, like the back of an old spoon. Then I notice the color.\nI stop, basking in the slight hue, like red watercolor under the tap. Other people around me have noticed, too; some take pictures, while others speak on the phone with faces creased like paper. “Oh my god,” I whisper.\nIt’s not long until some of my kids catch on. They gape with me, at the sky that is barely smidgened pink, at the siren screams that have begun to quietly emanate from the ground. I look around, suddenly panicked, and imagine the worst. How long until crowds gather here on the stairs, yelling and fighting? How long until our bus can no longer pass through the packed roads?\nI usher kids toward the waiting bus, gently pushing backpacks and holding hands as we descend, murmuring let’s go home let’s go home let’s go home guys all the way down.\nWe get back before the worst, and I pull out a sign-out sheet printed on pink paper from my desk and hand it to the aide. She’ll follow a special protocol for release today, making sure every parent signs their kid out in person or calls her directly. Once my kids leave, I sprint to catch my own train. The other passengers are restless. They flick upward at their phones, in an endless state of refresh. We are three days early to the Arrival Period, the official government prediction, and we’re all waiting to hear them confirm what we already know. I try calling Dad, but his phone goes straight to voicemail. The train passes under a tunnel, orange shadows leaking into our cars. It’s just bad service, I try to assure myself.\nWe shoot out of the darkness, and my leg bounces as I look out the window. The train bisects avenues and exposes them for an instant, each a blast of noise and light. I catch glimpses of people who have spilled onto the street, climbed out of their apartment windows, and craned their necks to the sky with the same stunned expression. We’ve all been told of this event our entire lives, but now that it’s here, it’s like none of us know what to do.\nI hustle back to the apartment, and then try to call Dad again. It still goes to voicemail, and I feel my chest twist with anxiety; he should be home. I leave him a message and drum my fingers against the table. Against my better judgment, I turn on the TV and flip to the news. The anchors sweat and speak loudly, their eyes darting around the teleprompter, charting the world’s reactions in real time. A coup in Laos was apparently timed to start during the Arrival, and the camera pans to ragtag armies in the street, swarming the capitol. They brandish flags with the Didact word for Humans painted in drippy black strokes. My phone buzzes and I jump, but it’s not Dad. I look at the name of the school principal—my boss—and pick up in a daze.\nShe gets straight to the point. This is about Alya, the principal says. Her parents were calling earlier and were reportedly very angry. They want to know why Alya was taken somewhere against her will and taught information that is not true.\nI dig my nails into my palm and tell her, as calmly as I can, that they signed the permission slip. I can show them.\nAlya’s parents were not aware the trip would focus so heavily on the Didacts, she says.\nMelissa, for the love of God help me out here, I say.\nThere’s a long pause on the other end. Then the principal informs me that Alya was never signed out according to the special protocol today, that she left when the aide was with another family and that no one can get in touch with her parents anymore. She doesn’t know anything concrete yet, but she wanted to know if Alya had said anything during the trip.\nI think back to our trip and say no, I can’t think of anything.\nThanks, Samantha, the principal says. You really should have told me about Alya’s parents earlier. I stew in her silence, and then she hangs up.\nDad still hasn’t returned my calls. I sit at the table with my phone upturned while the TV flashes images of the faint pink sky, broken windows and ransacked stores, cars streaming out of the city on packed bridges. Then the anchor interrupts with a breaking story—all over the East Coast, large groups of people are reported to be migrating to upstate New York, fleeing when the sky had just started to turn. The reasons for doing so are still unknown, though the anchor notes these people all seem to be connected to various Humanist organizations. A block of innocuous-sounding names fill the screen, and he rattles some off. Sacred Planet Community, PeopleForPeople, Our Children’s Earth. Then I stop listening—my eyes fixate on a name in the bottom right and my stomach drops to the ground. Hallowed Sky Ministries.\nWith trembling hands, I pick up my phone again. I open the web browser and start typing. Suggested terms populate immediately: Hallowed Sky Humanists, Hallowed Sky legit, Hallowed Sky cult. I shut my phone off.\nI rack my brain, wondering how I could have missed this. Our last phone call plays in my head and I feel dread creeping up my limbs like frostbite. I shake it off, forcing myself into action. I reach for my purse and dig out the flyer I hadn’t bothered to throw out. A quick Google Map tells me the park address printed near the bottom is near Dad’s apartment—barely a ten minute drive, if someone had wanted to swing by and pick him up.\nI pause and look out the window. The sky is now unmistakably pink, and though the world isn’t trembling yet, I know to expect it. I reach for my car keys, stuff the flyer into my purse, and locate my coat. I check my phone again; no new calls. I head out the door.\nThe roads are absolutely packed, and what’s usually a forty-five minute drive with construction takes me nearly two hours. The evening darkens, but not into a familiar indigo; instead, the sky burns like a potent, eternal sunset, suffocated with smoke. When I finally pull up to the address that was scribbled onto the flyer, it’s almost eight. I stare at the small, derelict building I’ve been brought to in confusion. Then I notice the open field behind it, where fuzzy black masses move in the surreal twilight. A crowd. I know I’ve arrived.\nI park my car in the lot and stumble into the field. There’s a musical hum that comes from the crowd, a sort of harmonic resonance. As I reach the edges, I notice the long, flat stage in front, where several figures stand slightly elevated. They all wear long, red robes, with golden stripes accenting their sleeves and collars. A shiver runs down my spine. I’ve only seen the full Humanist getup in documentaries and photos.\nThese figures press their mouths onto the microphone and speak in reverential tones. “ . . . So many faithful here, such a wonderful sight . . . He has given us all this great blessing,” I catch. The sound booms from speakers on the ground and comes out a little muddled. Around me, plain-clothed men, women, and children murmur and clutch their blue-striped rings.\nPeering through the darkness, I spot my father’s face near the front of the crowd. I weave toward him, grasping his arm as soon as I can reach. “Dad!”\nHe turns. “Samantha!” he exclaims. His face is a mosaic of shadows, unrecognizable as he smiles. “You made it. I knew you’d come.”\n“Dad, what are you doing here? We need to leave,” I say, tugging on him. His shirt is silken, and it’s only then that I glance down and see his robes, the color of blood.\n“Sam, honey, it’s okay,” he says. “Calm down.” It’s the same tone of voice he used when I was five, when I had woken him up in the middle of the night because of a bad dream, crying in his arms while he comforted me. His voice makes me want to cry, now, too.\n“Dad,” I plead, but then don’t know how to finish my sentence. Too much should have been said before, and now it’s too late. Finally, I ask in a small voice, “What is this?”\n“They didn’t tell you the specifics at service?” he asks, frowning. “We’re leaving, Sam. Renouncing this world.”\nI meet his gaze and it’s like a spell is broken, and for the first time we can see through each other’s facades. His eyes harden, his expression closing. “I’m sorry,” I say, hearing my own voice tremble, “but Dad, this is real.”\nHe looks away, saying nothing. His eyes seem to be staring past the stage, toward the darkness in the distance. “How can we ever be sure?” he murmurs.\nI look around frantically, searching for any way to get us out of this. My gaze lands on a familiar-looking bomber jacket. I look up to its wearer. Mr. Fahri stands hardly twenty feet behind me, fervently nodding and bouncing on his heels, a ring-clad fist thrust high in the air. Mrs. Fahri stands next to him, her expression set ablaze. Nestled into her parent’s legs like a baby penguin and shivering, Alya catches my gaze. She looks at me with wide, wet eyes. I stare back, unable to breathe.\nDad’s sleeve slips out of my grasp, snapping my attention back. He steps onto the stage, and I grasp for his fingers, but they slide out of reach. I’m left holding the ring I’ve pulled from his hand. The stripe, I observe in the lantern-light, isn’t blue but instead golden, like the accents on his robe. His eyes flicker back to mine for an instant, filled with something I can’t catch—regret? disgust?—and then he joins the others on stage. He takes the mic. “What a great turnout we have tonight, folks,” he says, as if he’s just hosting a weekly bingo night and it’s time to draw the first numbers. “How blessed we are to gather here. We have been called to such holy, righteous action.”\nI stand there, dumbstruck, as the crowd starts to advance forward, drawn by some invisible magnetism. Someone jostles my shoulder hard—I see Mr. Fahri emerge from behind on my left, his eyes glued to the stage. Mrs. Fahri follows him, and they walk like insects to light.\nI look behind me. Alya stumbles a few feet behind her parents, unable to keep up with the rush. She sees me and I shoulder my way to her. “Ms. Ore!” she cries.\nI crouch down and grasp her shoulders tightly. “We need to go now,” I tell her.\nAlya hesitates for only a moment, and then I watch her mouth harden into a line, her head barely dipping in a nod. It’s all I need. I gather her into my arms and spring up, sprinting through the darkness toward the fluorescent-lit parking lot. She’s surprisingly light, and as I cradle her into my chest, I think I can hear her heartbeat, or mine, or both. I reach the parking lot, panting. Behind me the microphone booms: “Alright, folks, let’s take a moment to look around us . . . we’re getting word of some folks who have become separated from their kid . . . ”\nI rip open the back seat door and place Alya in the car, then get into the driver’s seat. As I’m pulling out, my phone lights up with Dad’s contact photo, and my ringtone starts to blare. With shaking hands, I silence the call. The map resurfaces on the screen, lighting a path to civilization. I attach my phone to my dashboard and follow it out, accelerating down long, unlit roads, praying that we reach the highway.\nBehind us, the roaring undulates and trembles, and in the rearview mirror I think I see small lights, blurry dark figures. I speed ahead, trying to gain as much distance as possible. The stoplight a hundred feet ahead of us turns yellow, and I try to floor it before realizing there’s no chance we can make it. I slam on the brakes. Alya lets out a whimper from the back seat as we screech to a stop. I stare out the windshield, stricken by the blazing sky. Rivulets of light streak across our view now, white-hot like stars.\n“It’s so pretty,” Alya says.\n“I know,” I breathe. No video or written account could have prepared me for this; in its final stage of transformation, the sky is not just pink, but orange and white, mixed like melted glass. It shines incandescently, terrifyingly beautiful. The Earth is black below it. I imagine my father underneath a sky like this fifty-five years ago, deciding to dedicate his life to creating light. I think I understand.\n“Ms. Ore?” Alya asks, breaking me out of my trance.\nI look behind me and see it all shimmering in her eyes. “Yes, Alya?”\n“The light’s green,” she says.\nI turn around; it is. “Oh, yea,” I say. I hit the gas, and then we’re going.\nIsabel Lee is a writer, artist, and creative technologist from Chicago, Illinois. Her interests include exploring the intersections between code, art, and fiction, and you can find her work online at isabellee.me. She also enjoys painting and watching Korean thriller movies. Isabel is currently a senior at Yale University. This is her second publication; her first story can be found in the September 2020 issue of Clarkesworld."}