{"fingerprint": "Zx4kWyHhjsiIzu7P8TaBs2R5a7M=", "sitename": "Clarkesworld Magazine", "title": "Hard Points of View: A Conversation with Stina Leicht by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/leicht_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Hard Points of View: A Conversation with Stina Leicht by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Hard Points of View: A Conversation with Stina Leicht\n When Stina Leicht was small, she wanted to grow up to be like Vincent Price—or so her website says. Instead, she grew up to be a writer who has impressed fans and critics alike.\n Stina Leicht (“Pronounced ‘Steena.’ Think of it as Tina with an extra-added S. My last name is pronounced ‘Lite,’ like the beer.”) was born in St. Louis, MO. She went to Sam Houston State University and the University of Houston; and studied 3D animation at Austin Community College. Leicht has worked as a bookseller, a graphic designer, and in the gaming industry. She has been a full-time writer and freelancer since 2005.\n Leicht’s debut novel, Of Blood and Honey, came out in 2011 with Night Shade Books, to strong reviews and acclaim, including landing as a finalist for the Crawford Award for best first fantasy. A historical fantasy set during the Troubles in 1970s Northern Ireland, it was followed by sequel And Blue Skies from Pain in 2012—fans placed Leicht on the finalist list for the Astounding Award (then called the Campbell Best New Writer award) in both 2012 and 2013.\n In 2015 and 2017 Leicht published The Malorum Gates duology with Saga Press: Cold Iron and Blackthorne, books that received praise from venues such as NPR and Barnes & Noble; the latter book appeared on the Locus Recommended Reading list.\n Her forthcoming title is “an enjoyable and thrilling read” according to Library Journal; Persephone Station, due from Saga Press in January of 2021.\n Stina Leicht lives in central Texas. During the pandemic, she has been working on the next book and a few short stories. After more than a decade of not doing anything with her animation and graphic design skills, she has made a recent return to art, saying, “My mother and I started painting together over Zoom. It’s pretty great.” She plays Rock Band with husband Dane Caruthers. “My instrument of choice is the drums. I’m taking French lessons too. (Even if I’m dyslexic, go figure.)”\n What was breaking in for you, how did it happen? Were there struggles or has it been a fairly easy journey?\n Is anyone’s journey easy? I doubt it. Although honestly, my story is kind of weird.\n I’ve wanted to be a writer since I was in the seventh grade. However, my father actively discouraged me. So, I stopped writing.\n In 2001, I was working as a well-paid graphic designer. However, the dot com bust happened and I was laid off on the day of my wedding. Not being able to find another graphic design job forced me to rethink my career. The only work available was minimum wage retail or coffee shop gigs. I decided on a bookstore. If nothing else, it was indirectly related to publishing and sounded fun. Going from making a substantial salary to less than minimum wage was depressing to say the least. Two months later, I found out I had breast cancer. It was at that point I decided it was time to start writing with the intent of becoming a professional. Why not? What was left to lose? (I’m totally fine now. Hurray for modern medicine!) Ultimately, writing was what kept me sane.\n Also, I married well in the sense that my husband is amazing. We’ve been through so much together and we’re still going strong. Anyway . . .\n The bookstore (BookPeople) proved to be exactly the right place for me to be. I learned a lot about the publishing process. I practiced elevator pitches all day long (hand selling books), spoke with book reps, and met famous authors and sometimes their agents—Jeff VanderMeer, Holly Black, Neil Gaiman, Anne Rice, and Jasper Fforde to name a few. I also attended SlugTribe meetings (a local free writers’ group for newbies) and signed up for ArmadilloCon’s Writers’ Workshop.\n Then my husband was laid off. Financially, life totally sucked. We were so broke. But we had one another and I stayed focused on writing. During the second Writers’ Workshop the guest editor, Jim Minz, liked my story so much he asked for my novel. While that was amazing, in the end he rejected it. (He was right to do so.) I learned how to bounce back from rejection. A very useful skill!\n In 2009 Jeff VanderMeer asked me to contribute to Last Drink Bird Head. Amazingly, he took the story. That was my first big break. That same year I finished Of Blood and Honey and asked Holly for agenting advice. (She’s such a kind and patient person.) She introduced me to Joe Monti. When Joe read my OB&H draft, he asked for some major changes. (I threw away 66,000 words of that first draft.) By the end of the year Joe became my agent. He sold my first novel to Night Shade Books that December.\n I worked very hard to become the best writer I could. I studied. I read. I took classes. I listened to anyone who would speak to me about publishing. (I still do all these things.) Money was a struggle the whole way. At the same time, I’ve also been extremely lucky—as long as I’ve focused on writing. No other job situation worked out. That’s what’s weird. It’s like the Universe stepped in and said, “Enough of that. Time to write.”\n On your site you describe Persephone Station as a “feminist SF novel.” Were you always writing feminist works, even back in seventh grade when you were putting down words for your first novel? Or was there a process of shifting into feminist writing?\n Interestingly enough, that first novel did have some feminist ideas. Mind you, they weren’t well thought out, and I wasn’t aware of what I was doing. I also wasn’t a feminist, let alone an intersectional one. And that’s why my first novels are mainly about straight white cis men. I’d absorbed the ridiculous idea that stories about other genders just weren’t Important. I wanted to be taken seriously. Internalized misogyny is such a bitch. I suppose a lot of women have this problem. Like Madge in the Palmolive commercials, we’re all soaking in it.\n That’s why writing female point of view characters is hard for me. It took years to understand that not writing women was an issue. Joe wouldn’t stop asking why, bless him. So, I relented. I eased into it with Cold Iron and Blackthorne.\n At the exact same time, I raged about films that lacked women as characters. Some didn’t even have women in the background. When women are portrayed, often they’re minor, non-plot-affecting characters, or they’re the love interest who gets killed off before the next movie. That’s another thing that bugs me. Have you noticed how often women in films sleep with their male coworkers? It’s rarer for them not to in movies and on TV. That’s so not reality.\n I didn’t see how hypocritical it was to complain of stories not containing women and not writing stories about women. I bring this up because I feel it’s important to learn, change, and grow. I’ve made some terrible mistakes. Everyone does. It’s important to own them, though. You can’t learn from mistakes you don’t own. Hell, I wasn’t even an intersectional feminist until around 2006. I learned. I continue to learn. I also continue to make mistakes, but I also improve as a person. I wish more Americans were okay with changing their minds. Being able to learn, apologize, and change our behavior is a positive trait.\n One last thing: if no one demands to know the worldbuilding reason why there are no women in a story or film, then frankly no one needs a worldbuilding reason for why there are no men. For the record, there are men in Persephone Station. They’re in the background. Some even have a line or two of dialogue.\n Some even sleep with their coworkers.\n How do you personally define space opera, what is the appeal of space opera to you, and what do you think is the appeal to readers?\n For me, space opera is the fun stuff. It’s Star Trek and Star Wars. It’s a band of intergalactic criminals stuck on a living starship, having to learn how to cooperate in order to survive. The emphasis is adventure and interesting characters set against a vast backdrop. Actual science is a bonus. In the case of Persephone Station, most of that science is in the artificial intelligence aspects of the story. I do like to put something factual in my work. It’s also good to encourage readers to think for themselves.\n That said, I think escapism is what readers are looking for. They want Fun with a capital F—particularly now. It isn’t fair that straight white cis men get all the stories. So, I’m writing for the rest of us.\n There have been discussions in the field lately around “comps” (comparative descriptions of one work to other works), with many authors saying the comps assigned to their books by publicity teams weren’t accurate. Persephone Station comps are The Mandalorian and Cowboy Bebop—do you feel like these are accurate? What are the important similarities between your book and those shows? Or are there better comps to draw on—and why?\n The Mandalorian is a spaghetti western plus Lone Wolf and Cub set in space. I’ve only ever seen a few episodes of Cowboy Bebop, but it’s an ensemble cast, and it too is influenced by Westerns. So, I think they’re both good choices.\n As you know, literature has a long history of riffing off of other genres. If you read Heinlein, Norton, Bradbury—any of the early “Golden Age SF” canon—you’ll see the Western genre influence. Firefly wasn’t the first, not even close. Even Gene Roddenberry pitched Star Trek to the TV executives as “a wagon train to the stars.” Just listen to the opening: Space: the final frontier . . . I’m not even the first to take a Western genre film and transpose its plot into SF. Have you seen Outland? It’s brilliant! The scriptwriters set High Noon in a space mining colony. Sean Connery plays the sheriff. I highly recommend it. Doctor Lazarus is one of my favorite female characters in a SF film.\n You received a lot of recognition from your debut series, Fey and the Fallen: nominations two years in a row for the Astounding Award and short-listed for the IAFA William L. Crawford Fantasy Award. What, for you, was the impact of that attention?\n I’m so grateful that happened. It was every bit as amazing as you’d imagine and extremely stressful at exactly the same time. I went from being a total unknown to having George R. R. Martin mispronounce my name on an international stage. The imposter syndrome was awful—particularly since the book I thought I’d written wasn’t serious. (How hilarious is that?) I didn’t see myself as a literary writer at all. I had it in my head that literary writers had degrees in literature. I definitely don’t. It was confusing. There was so much pressure to write something new that did as well as that first novel. Oh my god, the sophomore slump is no joke. Poor Joe. He had to put up with me crying all over the front of his shirt. He really is the best. I’m so very lucky to have him in my work life. He gets my work. He’s incredible—really one of my favorite people.\n Are there important similarities and differences in your approach to narrative, structure, or other elements, between that first series and Persephone Station? Has your writing changed in significant ways?\n As an artist, I was trained to paint in different styles. Having range as a writer is a good thing, I think.\n With Of Blood and Honey I was obsessed with replicating a Northern Irish voice. So, I read a number of northern Irish crime writers’ works. Some, like Adrian McKinty’s, I read and reread so I could get the rhythm of the prose right. I allowed myself a certain flowery-ness in my language. It’s expected in fantasy because fantasy, specifically urban fantasy, is more surreal, more dreamlike.\n Fear was also a big part of how I wrote those books too. I was terrified of getting it wrong. I honestly didn’t want to cause more harm. But I could only get so much information on The Troubles here in the US and most of that is written from . . . let’s just say a decidedly not Catholic Nationalist perspective. The situation isn’t much different from listening to a Trump supporter’s version of events at a BLM march. I’m not saying that The Troubles is a Good vs. Evil dichotomy. Far from it. It was a civil war and human beings were involved. Humans are complicated beasties. At the same time, the victors definitely write history. That made research tricky. I also had to rely upon old photographs—black and white news photographs even—because I couldn’t afford to go to Ireland. I was working at the bookstore for less than minimum wage, after all. So, I interviewed people who lived through it and that helped a lot. I spent so much time at the Ulster University CAIN website (cain.ulster.ac.uk). But there were holes in my research. There always will be in situations like that. Finding firsthand accounts of certain events was almost impossible to find. Life in The Maze prison for example. Unionists don’t want to remember things like that. They erase it. (Or in the case of The Maze, bulldoze it.) Nonetheless, thanks to Ian MacDonald and Brian Magee, my friends in West Belfast, I was able to find most of what I needed. It still felt spotty. So, the plot jumps to different moments that I’m comfortable telling—kind of like stop-motion. It had the added advantage of replicating certain aspects of repeated trauma upon a victim’s memory.\n Persephone Station was its own adventure. I feel science fiction requires more direct language. It’s an entirely different animal and the prose has to reflect that. So, I kept my prose as clean as possible. The action is punchy and over the top. The car chases are dog fights. The dialogue is quippy.\n Overall, I like to think I’ve become a better writer. I’ve certainly learned more about writing than I ever thought I would. And yet, there’s so much more to learn. Isn’t that wonderful?\n Back to the idea of Persephone Station as a “feminist SF novel.” Why is the “feminist” distinction still important, and what does it mean specifically in terms of this work?\n I’m a Star Trek fan. I definitely want to live in that future. If we are to create a world based upon equality, we must imagine it first. Diverse characters—all genders, all races need representation. Such casts reflect reality. But if that isn’t enough to underscore the importance of diversity, studies have proven that reading helps people develop empathy. If there’s one thing we need more of right now, it’s empathy for people who aren’t exactly like us. It’s the only way humanity can save itself from destruction.\n Everyone deserves a future.\n For the record, when I use the word women I mean for it to include trans women. Trans women are women. Period.\n Anyway, science fiction has a reputation as being written only by white cis men for white cis men. In my experience, readers don’t much care for surprises. So, for Persephone Station, the feminist distinction is important. The novel is not only female-focused, its metaphors are femme-oriented as well. The weather reflects the feeling of a world that is hostile to the characters simply for being. The aliens display typical feminine qualities. They’re invisible except when they have something those in power want. They’re passive. They’re diplomatic. They’re groomed to conform to another’s expectations to the extent that they become different people than who they really are. There’s a lot of thought put into it.\n Several reviews talk about this book as being fast paced. Craft-wise, what is the key to writing a fast-paced novel?\n A tight outline is vital. I’m saying this, and I’m an organic writer. Ironic or what? In short stories, your words must serve multiple purposes due to limited space. The same is true for fast-paced novels. Don’t waste words.\n I tend to build upon the characters and setting at the start. Readers need to know when and where they are as soon as possible. (Unless it’s your intent for the reader to feel lost.) Give readers hooky characters. This is key, in my opinion. It does no good to write punchy action if no one cares who the action is happening to. The scene will feel intense and fast if the reader is emotionally invested.\n Lastly, movies aren’t novels. It’s important to know how many details are too much. I prefer to keep the prose short and punchy for action scenes. Get to the point. Use juicy adjectives. Remember the human brain can only track a certain amount of information in an emergency—and fights certainly count as emergencies. Some things will slip and that’s okay. Remember that brains behave differently on adrenaline. So does the body. I recommend reading about the science of perception. The human brain is weird.\n Is there anything else you really want readers to know about the book, beyond the blurbs and the reviews? What is special about this one for you?\n We need more stories about women working together in groups, being smart, being friends, doing things that require courage and strength. I’m not talking about the Strong Woman trope. Women need to be people in stories, not a cis man’s ideal of what a woman should be. We almost never see other genders in these relationships and situations—only straight cis men. I mean, romance is fine. I have a wonderful partner that I love. I get it. But there’s more to life than being in a romantic relationship. Other genders need to see themselves living those options too. Also? Enough with the “There can be only one [fill in the blank non-cis white male].” routine already. That’s why I wrote this book.\n What was the most challenging aspect of writing this book, and how did you deal with the challenge?\n For a start, I had to overcome my fear of writing SF. All my life I’ve heard about how women don’t write science fiction. I’ve always secretly wanted to, but it’s understood that fantasy is where women belong—particularly YA and urban fantasy. That’s total bullshit, but it’s the truth. I have this thing about “authorities” telling me that I can’t do something. Mind you, it took a while to change gears, but I did it. I focused on the science that interested me—artificial intelligence, biology, and psychology. It’s what male authors do. Why couldn’t I?\n Writing seven female characters, several of them as point of view characters, was a challenge too. To make it easier on myself, I took several of my favorite male characters and borrowed certain qualities from them. Then I approached the crew as women. What sorts of traditionally femme things do they like? What do I like? And it took off from there. I suspect that’s why they’re each such distinct people. What’s the saying? Make your weaknesses your strengths?\n You also have a Patreon. Is Patreon a good model for authors, is it the future of publishing? Or is it a platform some will find hard to utilize to significant effect?\n I’m leery whenever anyone uses the expression “the future of publishing” in reference to anything electronic. If the computer age has proven one thing, it’s its own impermanence. I can’t tell you how many files I’ve lost over time because they’re stored on Jazz drives or floppies or whatever software program that’s no longer in use. The computer industry, in its race to programmed obsolescence (because PROFIT), has neglected to maintain its past. I could go on, but I won’t.\n Yeah. Yeah. I’m a GenX cynic.\n Back to the subject, I do think Patreon is a great platform for artists. Just less so for writers. As with anything, there’s no one solution for everyone. A lot of it depends upon how much you put into it. Also, Patreon doesn’t tell you that you need to be already established. Building from scratch is extremely difficult.\n For myself, I wasn’t actually sold. I’m still not, not really. But I was tired of putting so much work into my blog for nothing. Sure, Feminist Monday is important work. The idea was that people—mainly male people—never saw the bigger picture. They’d maybe read one article and think that was all there was to that issue and move on, but feminism is more complex. It affects everyone everywhere, yes, even men. As my audience grew, I began to see results. Men wrote me to say they’d never thought about this or that aspect of our culture that way before. If you want a real mind bender, read Invisible Women by Caroline Criado Perez.\n Sorry. Once a bookseller, always a bookseller.\n Anyway, it was so much work. I got tired. K. Tempest Bradford talked me into starting a Patreon. It’s not much, but it pays for itself as well as my website. That’s enough for me. Of course, if I didn’t have an extremely supportive partner, my priorities would be different. Naturally.\n You have over a hundred posts on your Patreon. What can readers and fans look forward to if they become patrons?\n I still do feminist posts, but not as often. Politics these days are so exhausting. I tend to post my artwork, talk about any new stories that get published, and discuss tarot cards. During October, I recommended horror comedies and matched them with songs.\n What else are you working on, what else do you have coming up that you’d like readers to know about?\n I’m working on a new space opera called Loki’s Ring. It’s another group of women working together—only this time they’re an emergency response team. I’ve also got a story in Evil in Technicolor, a Horror anthology edited by Joe McDermott. And I wrote a humorous short story for my friend Martin Wagner for his BookTube channel.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}