{"fingerprint": "8P2/NQw1VHlJYUg88VeC9CTY0WA=", "sitename": "Clarkesworld Magazine", "title": "The Direction of Clocks by Jess Levine", "author": "Jess Levine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/levine_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Direction of Clocks by Jess Levine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7710 words, novelette\nThe Direction of Clocks\nBefore the mechanics of stellar travel seemed remotely achievable, humanity had already devised many names for the perimeter beyond explored space. The deep, the ether, the black, the void—an ever-expanding collection of inapt metaphors. Even with the farthest stars finally within reach, humankind had yet to coin a phrase that truly captured the nature of being lightyears away from all known sentient life. This was unsurprising, as few would suffer the degree of isolation necessary to comprehend the experience.\nStill, Cameron cursed whoever had labeled it “the infinite.” It was the promise of the infinite that drew her to this post, and what those who had invented that euphemism did not convey—what she had not understood when she volunteered—is that no matter how long you flew, you were only as far away as you traveled. It was always possible—in theory, if not in practice—to reverse course and return to echoes of the lives you’d left behind. If the far regions of space were truly “the infinite” that Cameron was promised, she should have been able to—by some miracle of time and velocity—leave all her problems behind. But that was not the nature of the universe. The harsh realities of physics were always there to remind you that no matter how distantly you wandered, you were always tethered to the point from which you left, like debris caught in orbit.\nOr so she guessed. She reflected on this as she took her forehead off the frosty viewport. Technically, her journey had yet to take her beyond the rim. But how different could it be? Caught in the wandering time bubble of travel at relativistic speeds, wasn’t all of space the same? Anything not traveling at relativistic speeds swirled into an inchoate blur, a vortex of nonentities and nonimages. She imagined that the loneliness of the voyage ahead would be indistinguishable from her last few years. Travel had already failed to detach her in the ways she had hoped. Perhaps it’d come with time. She’d spent so little of it—clocking just three years in transit—while those behind had surrendered so much. She wasted a few more moments staring into the rainbow streaks outside before meandering back to the pilot’s seat.\nShe wondered if it was anticipation of her destination that had brought on this awful melancholy. After three years of repetition, shouldn’t she be desperate for change? But there was comfort in the monotony of her world-outside-of the-world—cruel safety to her isolation. Soon, she’d arrive at Starbase Orion VI and a station officer would offer her a summary of the ninety years she had wriggled out of through this assignment. The government-mandated prep course said most pilots took it hard. But wasn’t the time slip why she did this in the first place?\nAn advocacy movement had sought a ban on travel at relativistic speeds for exactly such reasons—and worse ones. Behavioral scientists formed an unstable coalition with religious groups and activists whose loved ones had disappeared into the ether of time. But it was too useful for the state and its ruler-beneficiaries to relinquish, so a compromise was struck: the use of solo missions to minimize involved personnel, always preceded by psychiatric evaluation. The solitary nature hadn’t concerned her—there was a certain appeal—and the second was a formality. Everyone who volunteered for a near-c mission was at least a little unwell; candidates and graduates simply shared the work of deriving correct answers. Anyone applying already knew what to say.\nYes, I understand what I’m getting into. No, I have no dependents. No, nothing left unsaid. Yes, I understand what I’ll lose. I’ve participated in the preparatory programs and planned strategies for coping with grief. I’m confident it’s the right decision. In fact, I’m excited for a fresh start and the opportunity to serve humankind.\nShe figured that by now, the psychiatrists knew as well as the candidates that the answers were routine. Scripted. They were, after all, also just people with jobs. Why trouble themselves with concern for these self-sabotaging misfits? Better to check the boxes, keep moving, go home. Cameron could understand the desire to keep moving, if not the sensation of home.\nHome. She ran her hand over the nav-con, rechecking her deceleration trajectories. Slowing without fuel left to burn necessitated an intricate web of orbital grav-brakes. The route was preplanned, but even space was subject to entropy and every pilot needed to nudge their flight pattern at least once. Missing a brake could add decades to your trip—cut from the world outside of your bubble, of course. Readouts . . . green. No work to do. She sighed. She’d have to think of home, then.\nFunny that she still called it that. If anything, this ship seemed a better candidate for the term. But just as your birthplace was always your “hometown,” she unavoidably associated the word with her planet of origin. Earth. The farthest departure point from which you could leave for the rim. Nine decades, or just about—a couple years were within the margin of error at speeds of this scale. Enough time that everyone capable of remembering her would be gone. For the better, right? For them, and her.\nShe thought of her biological family—an easy way to avoid more difficult subjects. Her parents were probably furious when they heard. They had still dreamed of a relationship, one day. But they’d made their choices, and she’d made hers. Her brothers hurt worse. She had written to them, before the end. She struggled with how much it resembled a different sort of note—a type she had also drafted many times. She hoped this had been less painful to read. She reassured herself that near-c disappearance must be softer than death. Cameron maintained a curiosity about their reactions but was in-flight before anyone’s replies would have arrived—quite on purpose. Otherwise, could she have followed through?\nFriends flitted through her mind, but none felt important enough to dwell on. Who had even been left? With luck, they’d never have learned of her leaving. From their perspective, she disappeared years before her departure, either pushed out or run from, vanishing to sabotage different relationships, distant enough to leave them unaffected. Or so Cameron had planned. (Don’t tell the psychiatrists.)\nFinally—after considering coworkers, teachers, acquaintances, and anyone else she recalled—she had exhausted the buffer that shielded her from thoughts of Melissa. First: the two of them in bars and basements and the meetings and sick visits, which Mel had sailed through in an endless chain. A whole room laughing at some grim joke Cameron cracked. These were the nice memories—but they didn’t last. Her departure was like a black hole. Its gravity pulled her in.\nSomeone must have told her. Maybe Melissa even investigated it herself, in some moment of weakness. Cameron felt embarrassed that she treasured the idea. She’d spent enough time darting stealthily over established boundaries to harm herself with knowledge of her ex’s new life. Was it unfair that Melissa would never know about her’s? Cameron’s so-called “fresh start”? Did Mel purse her face in concern when she learned of Cameron’s plans? Her lips curling the same way they always did? Or had years worn away that mannerism, or proffered enough detachment that Cameron’s outlets for self-destruction no longer distressed Melissa enough to—\nThe vidscreen flashed yellow. Cameron creased her lips in a grim approximation of a smile. Her final grav-brakes were approaching and, gracefully, the nav-con was concerned that stellar flares would interfere with instruments enough to compromise her flight path. Monitoring and possible intervention would be necessary. Despite the danger, she felt grateful for the attention it demanded. She’d have enough time to dwell when the station sent her arrival dossier. She wanted another focus until then. A wish mercifully granted.\nLeaving the ship, her eyes wandered, appraising the novelty of a view deviating from the walls of her ship and the way the horizon neglected to blur with motion, instead painting a static portrait from which she could pinpoint the finest details. She stood captivated until the bay attendant exited his booth and welcomed her. A human voice, addressing her directly. How strange.\n“Hello, Commander Klein, welcome to Orion VI. Before you apologize, it’s fine if your small talk leaves something to be desired. I’ve greeted plenty of arrivals, and I know a couple years alone leaves your conversational skills rusty.” He offered a sheepish smile. She found the playfully rude greeting endearing—though he benefited from the desperation for conversation left by three years of solitude.\n“Hi, uh . . . ” She checked his nameplate and epaulettes. “Specialist Reno. Thanks for the, uh, warm welcome. I’ll try to put together something interesting to talk about.” She grimaced. He was right. Playful banter seemed to have exited her wheelhouse.\n“Don’t worry about that, I won’t be around long. Temp lodging is around the corner, and you’ve got a room reserved. Pilots usually want their dossiers right away. We like to have private space ready.” He gave her a look of sympathy. She found it frightening.\n“About that . . . I didn’t receive the advance copy after my last grav-brake. That doesn’t match protocol. Did something go wrong?”\n“Oh, not at all. Let’s see, when did you leave . . . wow, 2067? You must’ve come all the way from Earth. Yeah . . . protocols have changed. We discovered it’s better that pilots are landed before we allow a peek. Happened around . . . ’126? Believe me, it’s hard enough to take it this way. Some other pilots can tell you what it was like before.” He shuddered. “We even lost a few that way.”\nShe bit the inside of her lip. You always underestimate how it is going to impact you, she heard her preparatory course instructor repeating. She ran his statement back, raising a cascade of other questions. Some she could answer; “why?” seemed evident enough. You don’t want a pilot trying to land while grieving whoever they cared about back home. Some questions, though, stumped her.\n“If protocol changed in 2126, how would I ask a pilot? There’s no way they’d get back from a rimward boomerang in only . . . ” She trailed off, realizing she hadn’t yet asked—\n“Thirty-six years,” he replied, answering what she left unspoken. She added in her head. It was 2162. Five years over. Not bad. “To your other question . . . well, the timing of your dossier isn’t the only protocol that’s changed. I, uh . . . I think it’s better you start there, then we’ll talk mission, ok?” His hand offered a data drive. She could tell he was struggling to hold something back. He was too emotive a person to keep a straight face. Her curiosity about his gift, however, outweighed her desire for an immediate answer.\n“Just around the corner, you said?”\n“Room number Hotel Seven, Commander.”\n“Hotel, that’s kinda—”\n“Yeah, I’ve heard that one before.” He chuckled, but it was empty. His jovial manner had disappeared. Quickly. Her brow furrowed. She didn’t like whatever that implied.\nJoseph Klein - Deceased age 90\nRachel Klein - Deceased age 86\nBen Klein - Deceased age 34\nAaron Klein - Deceased age 92\nAlexis Klein - Deceased age 86\nHannah Klein-Sherman - Age 71\nTara Klein-Sherman - Age 68\nRachel Klein-Sherman - Age 42\nThe names and numbers told a series of stories, laid before her like a weird novelization of the peripheries of her life. She wondered avoidantly what it was like to prepare these dossiers. She imagined they were hand-assembled; how would a computer sieve through a century and determine what in a person’s life was important enough to highlight from their absence? Cameron’s finger hovered over each name, but reaching the end disinterestedly, she was forced to confront the desire she had been orbiting all along. A name that would appear nowhere in her dossier—the state never had impetus to recognize their relationship. She swiped out of the meticulously prepared document.\n“Melissa Serwer.” The search results were endless.\n“Melissa Erin Serwer,” cut infinity in half, down to infinity.\n“Melissa Erin Serwer 5/12/2038.” Funny how easily Cameron remembered her birthday. Haha.\nWe mourn the passing of Melissa Erin Serwer, age 89—\nEighty-nine, Cameron repeated as she paused, eyelids falling. She pictured Melissa at eighty-nine. The tan of her skin cracked with age. Her hair, once black, now gray. Or had she dyed it? Back to black? Neon again, in imitation of youth? She didn’t know. She could probably find a picture. That wouldn’t really solve it though. She still wouldn’t understand why that choice. How could she even be sure that this Melissa was really the same Melissa she had known—\nShe exhaled sharply, clenched her teeth, and resumed.\n. . . who passed peacefully on September 30th, 2127.\nGood. She deserved that.\nShe was a pillar of her community, and her presence will be sorely missed.\nCameron smiled mournfully. Yeah, the same Melissa.\nWe dedicate in her honor the Melissa Serwer Municipal Creditary, which will continue to shelter those who she no longer can take under her wing.\nCameron didn’t understand what exactly a “municipal creditary” was, but on the face, it seemed like a proper honor for the person she had known. She read on, through a familiar recounting of the woman’s childhood, then the records of her plentiful efforts to provide communal care.\nMelissa is survived by her wife Olivia—\nOh. She had married. Of course. Who wouldn’t have wanted to—\n. . . her wife Olivia Aral Bennett—\nWait, Olivia Bennett? Liv? The chuckle broke open her pursed lips. Reunited with her ex, huh? Funny, Cameron wouldn’t have thought it possible to—The chuckle hiccupped, fractured by the labored breathing of a sob, and she tossed the tablet across the bunk. It bounced and collided with the wall, and she swore. This was—She couldn’t—She needed air. She pressed off the bed and out the door.\nBlundering down the hallway, it took Cameron three steps to collide with another resident. As they tumbled to the floor, she realized it was her most intimate human contact in years and laughed at herself out of pity. While they disentangled, she inspected the thorough wrinkles on the woman’s dark skin. Great, her first act on the station was to injure an old woman. She turned upward and found the stranger staring back with odd fascination. Her face was unfamiliar, but something about the shape of the eyes and their particular shade of brown nagged Cameron’s memory like a glitched notification.\n“Cameron?” the woman asked, voice thick with trepidation. Cameron, for her part, stumbled back onto the floor. How did this woman recognize her? Maybe it was procedure now to distribute a photo of new arrivals, so you could greet them?\nThen she placed the eyes. Dragged her gaze down the jawline, accounted for sagging skin, adjusted height for the spinal compression of age . . .\n“Robin?” Cameron replied, her question beset by disbelief. The woman laughed heartily. It was earnest, and familiar.\n“Nobody has called me ‘Robin’ in quite some time, kiddo. I’m usually Ms. Walker. Wow, it’s really you, isn’t it? You haven’t aged a day.”\nThe woman’s voice was frail and wavering. That was different. The Robin she’d known was resolute, full of confidence and bluster. And . . . “kiddo”?\n“Three years, actually, but people always said I seemed young for my age,” Cameron offered, unsure of the protocol for meeting a friend who appeared to have gained fifty years on you since you last saw them, say, four years ago.\n“So basically a day then,” Robin said and repeated that familiar laugh. Cameron felt warm. “My, it’s really you. What are the chances? For heaven’s sake, what does that matter?” She paused just a moment too long. “I’ve lost too much to be anything other than thankful. Just c’mere.” The old woman pulled Cameron into a bear hug.\n“It’s . . . ” Cameron tried to find words, but her specialty had always been humor, not the heartfelt. “It’s so good to see you, Robin. Or, uh, Ms. Walker? What do you . . . I don’t really know how you’re supposed to do this . . . ”\nRobin smiled. “None of us do. That’s what passes for excitement around here. Just Robin, please. It’s strange to hear that title on your young lips. Oh, you look just the same . . . except paler, somehow.” She grabbed Cameron’s cheek with leathery finger pads, and Cameron’s brow furrowed. She found the mannerisms surreal. Unquestionably her old friend, now her old friend. How long had Robin been aboard the station? And why? Robin cut into the shocked silence.\n“Make sure to spend some time in the dome, where the sun’ll reach you. The radiation can’t be any worse than the godforsaken dark of near-c!” She struck Cameron’s practically blanched forearm playfully.\n“I’m not sure I’ll have a chance. I’m planning to head out for my boomerang as soon as they’ll authorize it. Which brings me to the real question . . . why the hell are you here?” Robin regarded her with suspicion. No, confusion? Her brows were knit tight, searching for something. Then they broke into an expression of pure pity—Cameron wanted to hide. Robin spoke softly.\n“Oh, space . . . ”\n“Space” was a swear now?\n“ . . . you haven’t heard, have you?”\n“Haven’t heard what?” Cameron replied, now heavy with anticipation.\n“I told Archie to move the world history section before family, but noooooo . . . ” She drew out the “o” sarcastically. The artifact of an argument exhaustively rehearsed. She continued mockingly. “The pilots will just skip it and move on to their families anyway. Well at least preserve the possibility that they won’t!” Cameron wrapped her fingers around Robin’s knobbly wrist insistently.\n“What haven’t I heard?” Cameron locked her gaze onto the woman’s, now sure that it was Robin. Her eyes were unmistakable, untouched by the strange wonders of time.\n“Relativistic travel has been banned. No one ‘boomerangs’ anymore.”\n“What?”\nCameron staggered. She blinked repeatedly, and her friend broke Cameron’s grip and grasped Cameron’s shaking hands. The look on Robin’s face was one of comfort—or was it pity again? Robin continued.\n“Or at least, rimward relativistic travel. You can still fly near-c toward the core. Once. They don’t usually give a second authorization.”\nCameron simply kept blinking. She couldn’t make sense of it. The boomerang was the whole reason she’d come out here. To go! To leave! To escape this awful system and everything it tangled her up in! Her family, her lovers, her so-called “friends”—and for what it was worth, that very fucking much included Robin Walker! “No,” she mouthed.\n“No,” she sputtered breathlessly, and pulled herself out of the old woman’s feeble grip. The footfalls of her escape echoed painfully off the metal. The world blurred again.\n“Cameron, where are you going?” her old friend—ex-friend?—called out. “Cameron, don’t run away! There’s more to it, just let me—” Cameron didn’t stop. She was nearly out of earshot and couldn’t get there fast enough. She’d find the CO’s office and sort this out immediately. “Cameron! Cameron, just—don’t run!”\nShe ran.\nThe engraving on the wall plate read “Lt. Archibald Richards” in stark lettering. A thick coat of rust enveloped it, cut by telltale lines of ineffective scouring long since given up. She burst through the door angrily before she could inspect anything else.\n“Lieutenant, I need authorization for a rimward near-c, and I don’t honestly give a flying fuck what policies have changed, I was promised a—”\nThe man looked up from underneath the balding crown of his head, peering over his spectacles. His quiet reply interrupted her demand. It managed to cut her off, despite the volume.\n“I don’t give a flying fuck what you give a flying fuck about, Commander. Would you like to try that introduction again?”\nThe hunched, sour-looking man sat behind a desk the same steel-gray as the station. A tacky Newton’s Cradle sat motionless next to his tablet on the desk’s otherwise barren top. Cameron stamped a foot and tried to screw her head back on.\n“Yes Sir, sorry Sir. It’s just . . . a big shock, Sir. And frankly, it’s unfair. I gave my fucking life for this mission. They can’t just strand me out here in limbo—”\nHe cut her off again, with the same steady calm.\n“I think you’ll find, Commander, that ‘they’ can do whatever they damn well please. This ‘limbo,’ as you call, it is my home—gods be damned—and as you’ll soon accept, yours too.” The look on his face wasn’t quite reproach. He regarded her more like a minor annoyance. A fly, buzzing too close to his ear.\n“You can’t be serious, Sir! This is just a fucking truck stop! You can’t live here! I have somewhere to be! I was promised!” She knew she shouldn’t swear like this to a commanding officer. She knew her temper was out of control, but who could expect anything else from her under the circum—Wait, commanding officer? He was a lieutenant! His demeanor had put her off balance, but he wasn’t her superior! She should be giving the orders! “And as a matter of fact, I outrank you. So prepare my launch. That’s an order, Lieutenant!”\n“Listen up, Klein, and listen well, as I don’t like to repeat myself, because ‘repeating’ is all I ever fucking do here. Welcome to Orion VI, one of many ‘truck stops’ the Union has left abandoned to rust on the edge of human civilization. There’s no travel rimward. Hasn’t been for thirty years. Just after the start of my tenure, of course. There’s no travel coreward without authorization, either. There’s a hab-dome, complete with seventy-eight trees and as many treadmills as you damn well want. The sights are beautiful, I’m told. I suppose they were, for a few years. Speaking of years, even with the latest communicators—which of course, we don’t have out here—it takes a decade to get a databurst back and forth from Representation on Earth. Oh, you probably remember them as Command. Regardless, you’ll hear from them maybe . . . ”\nHe paused to inspect her, adjusting his cartoonishly small glasses, then continued “ . . . five times, before you die. That’s your chain of command. If you have an issue with my orders, take it up with them. Of course, it’ll stop being relevant long before they get back to you, so you can think of me as your Representation. Or, if you prefer, you can think of me as God. Not much difference out here. I’ve run Orion for thirty years, and just because they’ve repeatedly declined to use their precious communiques for an overdue promotion doesn’t mean I have to take shit from some upstart Commander who just tripped out of their twenty-first century clunker. My word here is law, and worth a lot more to the people on this station than the stripes on your shoulders. You’ll get used to it, ‘Commander.’ You’re not the first angry pilot to march in here.\n“By all damnable accounts, you’ll be the third from last. The last pilot they’ve imprisoned me to wait for is estimated to arrive, oh, about five years after the actuaries predict that I’ll be dead. That’s my ‘service to humankind.’ Now, I recommend you leave this room, cool off, and attempt this conversation another day. Try the hab-dome. Meet your new family. I’m sure the other seven will be enthused to see you. I’ve certainly had an exciting morning. Enjoy Orion VI, Lieutenant. Get out of my sight.” He looked back down to the tablet, returning to a simple game in which you bounced balls off a paddle to break blocks. The screen was worn where a finger would drag to move the paddle. She looked at him.\n“But Sir—”\n“Out,” he replied forebodingly, and she turned, trying not to let him see her huff—more out of pride than good sense. She left.\nThe hab-dome was beautiful. Beeches and maples formed a thick green canopy. Sitting along the dirt paths underneath, it would have almost been possible to forget that she was on a metal space station lightyears from any habitable planets. Cameron didn’t want to forget, and so she leaned against the wall at the rim of the dome, staring up through the glass hexagons at the off-white glow of the moon towering overhead. She sat on the floor, elbows on her knees in the resigned posture of a woman with all of her anger spent. She couldn’t deny the view was breathtaking, but it didn’t comfort her.\nRobin approached with caution and silently lowered herself to the floor alongside Cameron. Her bones creaked as she struggled to the ground. She set her head on Cameron’s shoulder.\n“I’m glad you took my advice. The trails are nice, but you need sunlight—however many times it bounces to get here.” Robin rapped Cameron’s skin with her knuckles, but it was half-hearted. Cameron didn’t respond. The older woman tried a different tack.\n“You’ll get used to it, I promise. It’s not all bad here.”\nCameron exhaled sharply. “Don’t try to comfort me.”\n“OK. Stop moping then,” Robin replied with a sparkle in her eye. Cameron turned to look at her.\n“My one plan to escape got crushed by some unknown bureaucracy while I camped out in a metal box for three—one hundred—whatever years.”\nRobin looked directly at her.\n“To escape what?”\nCameron turned away.\n“C’mon. You know.”\nShe felt Robin shift and could feel the gaze on the back of her head.\n“Indulge an old woman. It’s been a long time.”\nIt was so easy to forget that.\n“Just going as far as Mel wanted me to, y’know.”\nWhen Robin scoffed, Cameron turned to her with her face knitted in shock and as much fury she could muster. Her question was raw: “What?”\n“Is that really what this was about, Cameron?”\n“Of fucking course it was! Is! Don’t you know, I’m not safe to be around. Can’t be trusted to take care of myself. Refuse to change. Refuse to take help. I lash out and drag others down with me. If Melissa fucking Serwer is done with me, what goddamn hope is there? You should know, you dropped me like a hot wrench when she went public with it!”\nRobin sat up. The movement clearly took effort. She settled her gaze on the younger woman.\n“Melissa Serwer is dead, Cam.”\n“I know. Exactly how I wanted it. They’re all dead. I’m dead, as far as they were concerned. Mel started it. I just took it to the logical conclusion.”\n“Cameron Klein, the poster girl for logical thinking.” The sarcasm felt nice. More familiar than the unexpected empathy and worse yet, pity, which had oozed from the woman since their reunion. “You think Melissa wanted you dead?”\n“I mean, not—she wouldn’t—what was I supposed to do? I lost everyone.”\n“You were supposed to get better.”\n“Yeah, how the hell was I supposed to do that alone?!”\nRobin was perfectly calm as she stared, unblinking, at Cameron. Her voice was level.\n“You weren’t. It wasn’t a good idea. Or fair to you.”\nCameron sat, stunned into silence. Blinked, pursed her lips, then pursed them differently. Words came and went without ever passing her throat. Robin spoke into the space.\n“You’ve never heard that, have you? It feels so long ago to me. I just assumed . . . that’s silly of me.”\n“I—” Cameron stopped, and suddenly she was furious. Tears streamed from her eyes and her words were split by rasping breaths. “Why didn’t you fucking say it to me while you had the chance?!”\n“You left before any of us thought to. Before we could learn better. That part’s on you.”\nCameron closed her mouth again, face flushed and embarrassed. She turned back toward the moon, placing the crown of her head against the wall and closing her eyes. She spoke without opening them.\n“What do you mean, we?”\n“Do you think Melissa died angry at you?”\nCameron had never considered this question—she, too,had assumed. Robin watched her and replied to the unspoken words.\n“One of life’s cruelest lessons is that time heals more wounds than just about anything else. It leaves a scar of course, but people grow as well as skin. I don’t think anyone left that planet thinking about what a bastard Cameron Klein was. Now, don’t think we forgave you. You don’t get off that easy. You didn’t stay long enough to earn it. Still . . . I’d bet plenty of us regretted how we handled it, when we thought about it . . . I did, eventually.”\nCameron’s vision tunneled.\n“Why would you have been thinking about me, Robin?” she asked with defensive hurt.\n“Because I lied to you earlier.”\nCameron finally opened her eyes and leaned forward, legs crossed, palms flat on the cold floor.\n“I knew this was too good to be true.”\nRobin shook her head, pityingly.\n“Not about that, Cam. About . . . not expecting to see you.”\nCameron recoiled backward and inhaled.\n“Wait, did you . . . follow me?”\n“Not exactly. Kind of. I . . . wish I could say I’d done it just to give you this overdue apology, but . . . you’re not the only one who wanted to leave, Cameron. Not the only one boneheaded enough to try, either.”\n“But why me? You didn’t—we weren’t even friends anymore. Not really.”\n“Honestly, I didn’t have a lot of options. Because I . . . also wanted to make myself disappear. But I chickened out. Couldn’t. I got to the end and couldn’t stand the thought of being alone forever. I needed something to tether me. Someone. I saw the records. There aren’t many near-c pilots, but . . . there was your name. I had one way to leave it all without leaving it all. So I took a route through Orion VI. Didn’t do me much good, of course. I didn’t think through the margins of error, how much shorter my trip would be given advances in relativistic travel . . . thirty-one years is a long time to undershoot. It’s been lonely, but I’ve made do with the people here, and learned a lot about what it means to spend time with yourself. Back to your question, though. Sorry, but I made a tool out of you, Cameron. I wanted a lifeline. Someone to find me while I . . . ” She paused, consternation visible. Searching for proper words and giving up.\n“ . . . while I lay bleeding out in the tub.”\nCameron didn’t know what to say. She shook, unbelieving. Time seemed to dilate. She felt like she was back on her ship, in her bubble outside the world. After an indeterminate while, she spoke one word. The same question. “Why?”\n“Why did I do it?”\nCameron nodded, face bewildered. Now Robin turned upward, moonlight brightening her cheeks.\n“I lost someone. Got ’em killed, maybe. And you think you carry sins . . . ” The old woman trailed off and took a centering breath, clearly practiced. “Thought I could run from it. Thought I couldn’t live without her. Wrong on both counts, of course. Y’know why they banned near-c?”\nCameron didn’t respond.\n“When suicide prevention groups collated the numbers, it was clear who these missions preyed on. After the revolution, Representation decided that even collectively, we weren’t wise enough to handle the responsibility of deciding who should and shouldn’t get to disappear forever. They were right, too.”\nCameron opened her mouth to snap angrily, but Robin put her hand up and kept speaking.\n“Thirty-five isn’t that much older than twenty-four, in the end. I was closer to your age than mine when I decided there was no reason worth staying. Thirty-seven when I got here. The last three decades have given me a long time to think. But clocks go one way, even if they move at different speeds. I can never rearrange it and do all that processing before the moment I made the decision.”\nCameron laughed rudely.\n“Processing. Melissa liked to ‘process.’ Didn’t make her ‘grow’ any faster. Didn’t change her mind before I—”\nRobin cut her off.\n“Before you chose to give up on her. On all of us. Most of all, on yourself. As far as Melissa’s growth, you don’t know anything about it. You weren’t there. You don’t know that it didn’t help. You didn’t stay to find out. Neither of us did, for our own disasters. I know you’re hurting, and it’s fresher for you. But you’re not the only one who screwed this up, or the only one hurting. I can give you time, Cam—however much I have left. But eventually you gotta take yourself out of the center. For the lord’s sake, I just told you I got someone I love killed and all you can do is whine about Mel. I’ve waited a long time to talk to someone who remembers even some of our world, but our relationship has to be a two-way street. If you can’t get out of your own little universe, you’re just gonna burn this one up, too.”\nCameron huffed. She regretted it immediately, but it was too late. She stood. Her shadow fell over the woman, moon bright behind her.\n“No. No. I—this wasn’t—it can’t be like this. I have to go, Robin. That was the whole point. Sorry I can’t be what you want me to be. I’m sorry, and . . . thanks, and—I have to go.” Cameron didn’t look down. She hadn’t since she stood.\n“I don’t want you to be anything anymore. I just want someone to talk to. I didn’t exactly pick the people here, and they’re not—I miss the sort of people we surrounded ourselves with. Miss having anyone like me. You can still make this work, Cam.”\n“Clocks go one way,” Cameron muttered, and turned to leave. The frail woman looked upward again and waited for the moon to move. She remained for a while.\nRobin barely saw the younger pilot for a month. Given the size of the Orion VI, that couldn’t be an accident. Cameron’s arrival at her door was an inevitable surprise.\n“Hello. Good to see you again.”\nCameron didn’t reply—at least not directly. She glanced back and forth furtively, inspecting the hallway. “Can I come in?”\nRobin raised an eyebrow questioningly but nodded. Cameron slipped in quickly and Robin shut the door behind her.\n“So—”\n“I’m leaving, Robin.”\nRobin kept her face impassive, with notable effort.\n“There are no boomerangs anymore. You know that. I know you’re angry and lost, but don’t try to—”\nCameron interrupted her again.\n“I’m not. I’m going home.”\nRobin inspected her young friend, then took a seat at her desk.\n“Why? Home isn’t even there anymore.”\n“Do you have to ask? I guess . . . you’ve been here a while. You’re used to it. But I’m not waiting for anyone. There’s no one coming for me. This—” Cameron gestured around, “isn’t a life. I’ve spent a month surrounded by people from a world that might as well be an alien planet and who’ve basically turned into, well . . . zombies—” Cameron looked at Robin and winced. “Sorry. It’s just—no one here is changing, right? They’re all . . . static. They’ve accepted that this is forever. They don’t even really see me. At least, not my life, or what’s left of it. I’m lonelier here than I was on my ship.”\nRobin regarded her with suspicion.\n“Then why not come see me?”\nCameron hid her face.\n“Because I was embarrassed. Because you were right, about one thing at least. Maybe two. You were right that this was a stupid idea that I didn’t think through, and right that I shouldn’t mope. But just because you’re old and wise or whatever doesn’t mean you understand me. Home’s just a word, and I never felt like I had one. I’m not going back to find something, but to . . . build it. Figure out what this whole ‘revolution’ is about. Donate to the Melissa Serwer Municipal Creditary, whatever the hell that is. I may have fucked up and disappeared on everyone I cared about but . . . there’s still something, and I’m not gonna make the same mistake twice.”\nRobin offered a wistful smile and took a moment to appreciate that her world could still contain surprises. Then, she grimaced. “I’m proud of you. Really, I am. But . . . ” She paused, trying not to shy away from the expectant woman’s gaze. No. She was too old to hold words like these back. “I’ll be lonely here without you. I’ve waited a long time.”\n“That’s why I’m here. To get you to come with me.”\nRobin clenched her jaw. She should’ve expected that. She supposed Cameron was right; she had grown used to this. Thoughts of leaving had simply stopped occurring.\n“I’m too old for that sort of thing. And it’s not bad to be used to things.”\nCameron hadn’t sat down. She tapped her foot.\n“What’s being all wise and shit worth if you can’t do anything with it. You will be lonely here. Just come with me. We can build something together. I can do all that growing you’ve been talking about. Don’t just sit here. I can’t. And I . . . ”\nCameron fidgeted nervously and glanced to the side before continuing.\n“I don’t want to do it alone, either. I was wrong, okay? Wrong. It sucks. There. I grew. Now . . . will you just come with?”\n“You don’t need me. You’ll meet people. And you’ll figure yourself out, just like I did, ’cause you have the most important resource of all: time.”\n“It’s not about need. I don’t want to lose you! Or lose anyone, again. And I don’t think you really want to stay, either.”\nRobin’s head swiveled, searching. She took stock of the paintings—her own—and the gifts from the station’s few inhabitants. Her lone instrument. The sheafs of paper containing countless unfinished drafts. She’d tried a lot of hobbies during her stay. She’d formed disappointingly few relationships—but some, at least. She sighed and thought about a place she hadn’t been in so long. About a life with more people, more surprises. About what Cameron said. The people here are static. She considered the realistically few years she had left. There was no one here who even cared to hear about her life anymore. No one to pass it on. She’d die here among half-written novels, and so would the ghosts of the life she had stupidly thrown away. She stared at Cameron and imagined her fading into the final ghost. No. She’d thrown away too many lives. She shook herself and tried to think through the offer.\n“What’s your hurry? Even coreward, we need authorization. I’m sure Archie told you, it takes a while to hear from Representation.”\n“Oh, he did. His exact words were something like, ‘You can wait your full five years like everybody else, you impatient brat. If you want to steal one of the only decent people in my life, I’m gonna make you live the same bureaucracy that’s been ruining mine for the last thirty.’ There was a lot of spittle.”\n“Steal? Wait, Cameron, did you already ask about me?”\n“Yes. He didn’t like ‘by the time they get back to me, she might be fucking dead’ either!” The young woman was animated, throwing her hands through the air. This was the Cameron that Robin remembered. The familiarity was welcome. Not everything about Cameron needed to change. At least, not immediately.\n“That’s a morbid take on my life expectancy.”\n“I was bargaining.”\n“It’s rude to use your friends as chips.”\n“So we’re friends again?”\nRobin gave a sorrowful smile.\n“Yes, Cam, we are.”\n“Then come with me.”\nRobin paused again, considering what it’d be like to spend a couple of years alone with her young friend, recounting the precious decade of Earth-time that Robin had over Cameron. Stories of community. Age. Growth. She tried to picture what Cam would do with it, back on this new Earth she’d heard many conflicting opinions on. Did she really want to die here? What was left, no longer waiting for the arrival of a connection to her rashly discarded past?\n“Give me time for goodbyes.”\n“If you say goodbyes, that asshole will hear about it. Also, he’s gonna notice I stole his authcard pretty soon.”\n“I can’t just—”\n“Don’t think about it. I know not thinking is how we both landed here in the first place, but the flip side is no miracle cure either. You can sit here in indecision until you end up like ‘Archie,’ or you can come with. You’ve still got time, if you hurry.”\nRobin couldn’t feel confident that life on Earth would be better, but . . . she’d excised so much of herself from the world by leaving. She could let the rest of it dissipate into the vacuum out here, or she could reattach her cable to whatever was left.\n“If I do this . . . you can’t leave again. Promise me that we’ll stick it out. Together.”\n“Fine. Yes. I—”\n“Really,” Robin replied, with gravity. “Promise.”\n“I promise you, Robin Walker, that I’m not running again. I’ve seen how much running sucks, and . . . you’re proof that at least sometimes, shit gets sorted out. I want to do this. You want to do this, I know it. Let’s just go.”\nCameron looked at her with characteristic ferocity. Gone was the resigned melancholy the young woman walked onto the station with. Robin felt glad. You only grew if you failed. You only failed if you tried. Damn, she thought.\nRobin nodded and stood. The alarm blared.\n“Shit,” Cameron spat, and took off for the hallway.\n“Cameron, I’m not twenty-seven, I can’t run like this!” Robin called to the woman as she ran down the hallway, stumbling, then bracing herself against the wall and panting. Cameron spun back around, wild-eyed.\n“I’ve gotta beat him to the docks! If we can get on my ship with the authcard before he reaches it, he can’t stop us! Then we can rest!”\n“S’not a question of desires! I can’t run,” Robin shouted between pants.\nCameron sighed, gears spinning in her brain.\n“Then I’ll go. I’ll meet you.”\n“Meet me?!” Robin cried with confusion, but Cameron was already running again.\n“Get a hab-suit on! Airlock 6! I swear, this is the only time I break my promise!”\nRobin smiled. She wasn’t naïve enough to believe that was true, but by the proclamation alone, she knew Cameron was trying. That was enough. She gritted her teeth and made for an emergency locker.\nCameron punched the card just as the lieutenant stumbled onto the docking platform. She could see him screaming but couldn’t make out what he was saying. She didn’t much care. She hefted a nearby wrench and smashed the control panel, then ran for the ramp of her ship, careening into the cargo hold. Home sweet home. She jammed the button labeled “SEAL” and the ramp closed with a whoosh just as the sour old man ambled into view. She might regret how she treated him, someday. She hoped he’d regret how he’d treated her. She realized with grim reflection that she wouldn’t be around to find out. The last time, she promised herself again.\nShe sat, hands working the controls automatically. Engines ignited, and she lifted off the surface before he could re-enable the docking clamps. As the ship rose and spun, she looked over the hab-dome from the exterior and realized she’d miss the canopy of trees. Robin would probably miss it more. Oh well. There were plenty more beeches and maples where they were going. She sped away from the platform and angled the joysticks to drift toward Airlock 6. She could see Robin floating, attached by a cord to the station, waiting for Cameron to sweep her into the ship’s airlock in a ridiculous but possible stunt. Multitasking, she gestured over to the nav-menu to queue the route for their jump—she’d spent all week perfecting it.\nOnly then did the freedom beneath Cameron’s fingertips occur to her. She looked rimward through the viewport. Nothing could stop her. It was still out there, waiting. Quiet, black, and endless. She could leave Robin behind, cut the last cord—accomplish what she’d come here for in the first place.\nNo, she couldn’t. Not really. She had known that when she touched down on Orion. She was still tethered. Always would be. There were threads wound through her, shaped like memory, and time tugged mercilessly on them wherever she went. Clocks only go one way. She wouldn’t get anywhere continuing to fight them. She turned back to face Robin. The airlock stood open. The ship sailed closer, and Robin disappeared into it. She watched the now-detached cable drift rimward, like a fishing line into a sea of pitch. Cameron selected the route. Stood. Pressed. Confirmed. The world outside blurred. It was like she could feel the temporal shift. Watch the timelines stretch into winding rivers. She envisioned the delta where they all met, relentless and nurturing, a gathering of currents running away in every direction but meeting here, in this ship. She turned toward the cargo bay and its contents and left.\nJess Levine is an author, musician, kindergarten teacher, and communist organizer. On the side, she also writes and designs tabletop roleplaying games. Her diverse creative interests are united by one consistent theme: lesbians. She resides in Philadelphia, on the occupied land of the Lenni Lenape people. Her music and non-fiction writing have been featured in the magazine Blood Knife."}