{"fingerprint": "Q018d7BNNvvm6wqxtF8Tv3ZCJcA=", "sitename": "Clarkesworld Magazine", "title": "A Future Far Too Bright by Yosef Lindell", "author": "Yosef Lindell", "date": "2022-01-01 00:00:00", "source": "https://clarkesworldmagazine.com/lindell_12_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Future Far Too Bright by Yosef Lindell", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5260 words, short story\nA Future Far Too Bright\nNovember 24, 2038\nDear Dad,\nI’m in third grade and the teacher is Ms. Babayev. She’s from Azerbaijan which must be in outer space. She told us to write a real letter with stamps to someone we miss.\nI know you’re a time traveler. Is that why you never come home?\nJesse\nMarch 2, 2039\nJesse,\nI’m sorry it’s taken me so long to reply. I didn’t get your letter until we got back from the future. The post office doesn’t have its own time machine—not yet at least!\nBut I suppose that what I just wrote won’t make much sense to you, because I haven’t explained what it’s like to be a time traveler. So let me try.\nBeing a time traveler is a privilege. Thousands applied, and few were selected. It’s also a big secret. Our research is called “temporal self-determination.” That’s a lot of hard words, but the idea is really very simple. You know how you shiver when you’re cold and sweat when you’re hot? Well, the theory is that sudden changes in time have measurable effects on the human body, just like changes in temperature. So our time machine takes us thirty years into the future, where the scientists run tests to see how our bodies handled the time shift. Then we return to the present to rest before shifting ahead thirty years again and running more tests.\nMore later.\nLove,\nDad\nJuly 4, 2039\nDear Dad,\nHow come you never wrote again like you said? I want to know about your time machine. Is it yellow? Does it have wheels? Do you have to pedal? Holden has a bicycle but Mom says I don’t get one.\nJesse\nSeptember 7, 2039\nDear Jesse,\nI’m sorry I’ve been a poor correspondent (which means someone who answers letters), but I can only send letters to you when we’re in the present.\nBut I’m glad you asked about the time machine. When you get older, you’ll probably read a book by H.G. Wells. It’s a good story, but the time machine in it is much too small. You see, Mr. Wells never saw a real time machine, because they hadn’t been invented yet.\nOur time machine is so large it fills several buildings. In fact, it’s not really a “machine” at all. We have laboratories, dormitories, and a control center filled with workers and computers. The truth is that the whole complex is an eyesore. The buildings are made of ugly brown brick and cement, and carefully hidden behind walls and fences to make sure they stay secret.\nAlso, the time “machine” doesn’t actually “move” like a car or bicycle. Thirty years in the future, there are scientists with better technology working in this same complex of buildings. These scientists know how to bring our “time machine” to their time. We call their complex the receptor building. When we time-shift, our complex merges with the complex in the future. The scientists make sure that our complex and their complex stay exactly the same, as I’m told even a minor difference between them could mess up the time-shift. I also think this is why we can only go forward thirty years and then come back, and never further forward or backward. I don’t really understand the science behind it because I’m just a test subject. But it’s such an honor to be part of this work. Some of the discoveries we’ve made are crucial to the success of the Mars colony ships launching in a few years.\nI’m sorry you can’t get a bicycle. Maybe you can use your imagination. There’s no limit to that.\nHow’s school by the way?\nLove,\nDad\nSeptember 27, 2039\nDear Dad,\nI hate school! It’s so boring!! It’s fourth grade now, and the teacher always says things about multiplication and stupid chapter books. She never talks about fun things, like the new Mars ships or time travel. So I draw bad guy spaceships on my desk and then I pretend you come in your time machine and blow them up so I say “Pow!” and scribble them out and even though it’s only a whisper the teacher hears and makes me stay after class and erase everything. It makes my arm hurt.\nThe other kids laugh at me a lot. I tell Mom but she doesn’t do anything. When she comes and picks me up from Grandpa her eyes are all sleepy, so she mostly just kisses me and tells me to go to bed. She works so much at her jobs. She works at Columbia Presbyterian on 168th in the morning and Key Food on Broadway at night.\nI wish you were here, Dad. I know you would set the other kids straight.\nLove,\nJesse\nOctober 16, 2039\nDear Jesse,\nWe’re shifting again soon, so I will be brief. I know school often isn’t much fun. But it’s so important. An education can take you anywhere. It’s even better than imagination. Think: if you go to college, you could be a scientist who operates a time machine, not just a test subject like me!\nBy the way, could you send me a pocket calendar with your next letter? I’m not allowed to have anything electronic, because it will interfere with sensitive equipment, so it’s awfully hard to keep track of time here. 🙂\nLove,\nDad\nDecember 1, 2039\nHey Dad,\nLet me tell you about Julia May. She’s in my class. Her hair’s in pigtails. Can you believe it? Pigtails! Even though she’s already nine years old!\nHer nails are yucky too. One is blue, four are pink, and the rest are green. When she showed me, I covered my eyes and pushed her hand away.\nWhen I told her about you, she waved her finger at me like I was a bad boy. “There’s no such thing as time travel,” she said.\n“Oh, yeah?” I said. “Tell that to my dad.”\nI told Mom, “Girls are trouble.”\nShe just smiled. “I always said the same thing about boys.”\n“Then why do people get married sometimes?” I asked her.\nShe sighed, and the corners of her eyes looked sad. “I’ve often wondered that too,” she said.\nI think she looked sad because she misses you. I miss you too.\nMy birthday is soon. Maybe you can come home for it.\nLove,\nJesse\nP.S. Since you’re in the future sometimes, can you tell me what I’m getting for my birthday?\nP.P.S. Am I married to Julia May in the future? ‘Cause I sure hope not.\nJanuary 5, 2040\nJesse,\nThere’s some things about time travel I need to tell you.\nWe’re not allowed to find out what happens in the future, at least not any specifics. You see, we don’t want to change the future. Changing the future is called cross-temporal contamination, and the scientists warn us about it all the time. Let’s say I told you that you were married to Julia May. Then let’s say you did everything you could to make sure it didn’t happen. That would create paradoxes I don’t even want to think about.\nIt’s better this way, but I do wish they let us go outside more. When we go into the future, they lock all the doors to the complex, because they don’t want us to go out and accidentally damage the timeline. At least there are windows. When I look out on the horizon, sometimes I catch a glimpse of the sun setting on the Hudson River, like droplets of fire swimming in the water. In those moments, I think of you.\nI’m sorry I can’t come home for your birthday. Not yet.\nLove,\nDad\nJanuary 17, 2040\nDad,\nI had my tenth birthday without you. Without Mom too, because she has a new boyfriend. His name is Keith. He’s ok, but he smells like chewing gum and his hands are sticky when he pats my hair.\nI stole Grandpa’s cigarette lighter and a candle and a stale Dunkin’ Donut from the fridge. I went to the tiny park on Broadway at 188th that’s just a fence around a hill and sat on a stump. As I lit the candle, I thought about what it would be like to build my own time machine and come and find you. Maybe I already built one. Time travel’s confusing like that. No one here even believes me when I talk about your time machine. I wish it didn’t have to be such a secret. It’s stupid to hide good things. When I thought about that, my eyes started crying a little, and I hated it. And then when I used the lighter I accidentally burned the donut a little. But I still ate it.\nAt school, I got something else for my birthday too. A kiss from Julia May. I don’t know if it was yucky or not.\nJesse\nApril 9, 2040\nDear Jesse,\nYou won’t believe what’s happened! It’s so incredible that I can barely keep my hand from shaking as I write.\nSeventeen days ago, when we were in the future, the scientists took me to the Phase Variance Laboratory. There were some other scientists there wearing white coats who I had never seen before.\n“This might surprise you,” they said.\nI almost laughed. I’ve traveled through time, seen a brave new world. What could surprise me anymore?\nThen I saw you seated in a metal chair. I knew it was you because your hair was still curly. And a father always knows his son.\nHow well you were dressed! You wore a dark suit and checkered tie with a matching pocket square. Your shoes were newly shined.\nI was nearly delirious with joy, and for sure there were tears in my eyes. I hadn’t seen you since you were three years old.\nYou broke into a broad grin, and handed me a brown paper package.\nI held the package and looked at the men in the white coats, but they didn’t say anything, so I opened it. Inside were all our letters, including ones that had not yet been written.\n“I wanted you to be sure it was me,” you said.\nI just nodded in a daze. Then I turned to the white coats again. “How is this ok?” I spluttered. “You always said no contact with anyone. And now you bring my son?”\nOne of the men nodded quickly. “The parameters have changed,” he said.\n“You have reached the next phase,” said another, as he curled his lips.\nThen the scientists attached electrodes to my arm.\n“Can I shake your hand Jesse?” I asked you when they finished.\nWhat a grip!\nWe talked for a long time. You told me about home and Mom and how Grandpa was still hanging on despite his emphysema. You said you worked for Wall Street as an investment banker. You described how your office overlooked the floor of the stock exchange, where brokers and traders race among four-story stock tickers, and a holographic bull and bear are locked in never-ending combat above a rotating holo-globe. You said that the toughest decisions and the biggest deals were yours.\nIt was getting late, and the scientists had left. I touched your arm, and your suit felt very fine. “Tell me,” I said, nearly in a whisper, “did they ask you to come?”\nYou shook your head. “No. I applied for this. I’ve been waiting a long time.” You hesitated for a moment. “I’ve missed you, Dad.”\nI choked up. “Me too.”\nYou stood. “I have to go now, Dad.”\n“Will you come again?”\n“If they let me.”\nBut at the door to the laboratory, you turned around and walked back. You took my hands tenderly in yours. “You don’t need to worry about me anymore, Dad,” you said. “Things were difficult when I was young. You know. But that’s over now. I went to college, and I worked hard. My future is here, and I’m glad I can share it with you.”\nYou came every night after work for almost two weeks. You said goodbye before we returned to the present, but you promised you would come see me again when we were back in the future.\nI may not have been able to make it home for your birthday, but this was a true gift. You see Jesse, your future is bright. Now I know it in a way no one else can.\nLove,\nDad\nMay 16, 2040\nDad,\nCool. What else should I say? I mean, it’s great you met me, Dad, but does that mean we don’t meet for thirty years? It’s just too long to wait.\nI’ll tell you something that’s made me think a bit. Julia May and me, we went to the park on Saturday. We went up the steps to the river, and down the stairs to the lawn where you can see the huge castle on the hill. Julia May said it’s a museum called the Cloisters, and you didn’t have to pay money to go in, but we would have to lie and say we were twelve. I didn’t want to go at first, but she said it’s cool because parts of the building were in a stone abbey a thousand years ago in France, and now they’re here in New York. I agreed to go because it sounded a little like your time machine. But when I told her my reason, she just frowned.\nAnyway, inside there were a lot of crosses and pictures of unicorns. And then there’s this room with sculptures of dead people with their hands pressed together carved on the lids of stone coffins.\nJulia May took my hand.\n“They look creepy,” she said.\n“Yeah,” I replied.\nShe gripped my hand a little tighter. “Do you think the Mars colonists will have to go in boxes like that?”\n“Does it matter?”\n“Not really,” she said, but her hand trembled.\nI told her I didn’t think they would need to go in boxes. Then I said to her that if the Cloisters were like a time machine, and the dead people its time travelers, they must not have made it through alright, and now they couldn’t tell us what things used to be like long ago. This time she smiled just a little and touched my shoulder. I trusted Julia May. So I told her all about your time machine and our letters and how much I missed you.\nBut after I was done, she just looked at me sadly. “You don’t really still believe all that, do you Jesse?” she said.\nI turned away because I felt the tears coming, and I didn’t want Julia May to see me cry.\nI so wanted to prove her wrong. I went to the library. When I asked for books on the Mars colony ships, the librarian sent me to the encyclopedias. But when I asked about time travel, she took me to the science fiction section. I don’t have an eyeglass portal like some of the other kids, so I spent a lot of time after that using the library’s Internet terminal. I poked around on websites, and joined message boards and asked questions. Everyone said time travel was impossible, just like Julia May did. But then I found the top-secret government stuff: Area 51, the Philadelphia Experiment and the Montauk Project, the Horizon Ripple of 2028. But other sites said these were all made up. I didn’t know what to believe.\nBut you always write back. And you’ve told me so much about the future already. It’s got to be true. Right, Dad?\nLove,\nJesse\nJuly 19, 2040\nDear Jesse,\nI’m so sorry. A lot has changed, and it’s been hard to write.\nYou see, when we returned to the future, you didn’t visit again. When I asked, the scientists told me there was nothing to learn from more visits.\nI told them it was cruel to bring you here and then send you away. But the scientists have little heart. They only care about their calculations, or the effects of minute quantum fluctuations, or maybe the paradoxes of relativity.\nWhen I could no longer bear it, I went to find you myself.\nI waited till dark. All the doors were locked, but I had watched the scientists go in and out so many times that I had memorized the code. At first it was easier than I expected. There was no alarm. The night was still and silent, and there was only a sliver of moon. No one followed me, but I kept low to the sweet-smelling grass to avoid the searchlights. Before long I had crossed the walkway above the rail line and found the wall.\nI placed my hands on it, trying to feel the freedom of the river that lay beyond. I heard the rush of the water. But when I looked up, the concrete towered over me, and I saw razor wire strung across the top. There was no way out.\nI had known that all along really, but, you see, I had to try.\nI snuck back across the complex and crossed the tracks again.\nThey were waiting for me by the door to the dormitory, wearing their white coats.\nI knew they would punish me, but I was not afraid.\nYet one of the scientists waved, as if in welcome. As her red hair reflected the wan moonlight, I realized I had never seen her before. “Congratulations,” she said. “You are ready to proceed with further testing.”\nShe told me she came from the future, thirty years ahead of where I was, sixty years from where you are now. She works in the same time machine complex. They were ready to transport parts of the complex to her time, and run further tests on select individuals to see how they responded to the sixty-year time shift. She told me that I was among those selected.\n“Why?” I must have asked.\n“You tried to escape,” she replied, “which shows initiative and resolve.”\nThe scientist must have seen the doubt in my eyes. “Come with me,” she said.\nIt was a command.\nWe climbed the ladder to one of the abandoned guard turrets together. When I looked out the window, I saw the Manhattan skyline for the first time since I arrived here, a sparkling, seething mass of light and color. Silent, but awake.\nAnd then the scientist told me of the New York City she knew, the New York of my future. The air was cleaner, she said. Its skyscrapers rose ever higher. Airships of gold and chrome float on the skies, graceful as birds. And she said that sixty years was only the beginning. Soon, we would push further into the future. Ninety years. One hundred and fifty years. There was no limit to where we could go. She told me how lucky I was to glimpse a brighter future.\nBut when I looked out at the city, all I could think about was you, and how much further apart we would be.\nJesse, I am back in the present now, but we are going soon. Every day, the scientists take me to their labs to run more tests. They draw blood, they poke and prod me with strange instruments I have never seen before. They give me special orange clothes to wear for the shift. When I go, I do not know when I will be back.\nJesse, you asked me if all of what I’ve told you is true. If only my current predicament were not real. If only it were a nightmare from which I would soon awaken. My only comfort is these letters, which have brought us together despite everything. I fear it may be a long time before I can write again. But I will when I can. I promise.\nYou’re in my heart,\nDad\nAugust 17, 2040\nI was really scared when I got your letter. I must have showed it to Julia May half a dozen times. “My dad needs help,” I said. “Let’s go.”\n“But where is he?” she always replied, shaking her head, not really believing me.\n“Nearby. By the Hudson River. North of the city. Maybe in the Bronx.” I realized how silly I sounded. I didn’t know how to find you.\nThen, three Thursdays ago, when I came home from the library, Mom was sobbing in the corner of her bedroom, her makeup running down her face. The room was a mess, clothing thrown about. All of Keith’s stuff was gone.\nI quietly started cleaning up. As I picked up papers and a deodorant stick that had fallen from the trash can, I noticed a torn envelope addressed to me. The return address had your name on it, followed by a number. Below the number, it read, “Sing Sing Correctional Facility.”\nI took the envelope back to my room. Your last letter, and its envelope, fit inside.\nThe truth tore me up inside. I couldn’t sleep. I kept thinking of all the promises you had made and broken. Most of all, I just couldn’t understand why you would do this.\nI showed the envelope to Julia May the next day. Her eyes widened. “Oh,” she said, and she put her hand to her mouth. Then she put her arms around me.\n“I want to go there,” I told her as we held each other. “Come with me.”\nShe shook her head and her hair tickled my face. “We’re just kids,” she said, “we can’t go by ourselves. And we still don’t know where the prison is.”\n“I need you Julia May.”\nShe didn’t say anything right away. Then she sighed and put a finger on my lips. “Ok, but my parents are going to kill me.”\nWe went to the library to figure out where Sing Sing was. By the end of the day, we were on Metro North’s Hudson Line heading toward Poughkeepsie. I didn’t tell Mom, of course.\nThe track goes along the river and the white cliffs called the Palisades. We passed the old nuclear power plant. Then, right after the train announced Ossining, we went right through your machine. I saw the walls, the turrets, and the bridge above the tracks. I pressed my face against the window pane and my tears slid down. Julia May reached out to touch my shoulder, but I shrugged her off.\nWhen the train pulled into Ossining, Julia May touched me again. “It’s our stop, Jesse. Remember, the prison’s a ten minute walk from here. Let’s go.”\nBut I didn’t move.\nShe grabbed my hand. “Come on! This is what we’re here for!”\nI shook my head.\n“He’d want to see you,” Julia May pleaded. “He wouldn’t have written all those letters if he didn’t care about you.”\nI felt so angry. “He’s a liar,” I shouted. “A fucking liar! I hate him!”\nThe conductor came round because we had missed our stop and he heard the shouting. “Where are you going?” he asked. “Where are your parents?”\nI let Julia May do the talking.\nWhen we got to Croton-Harmon, the conductor firmly took us both by the hand and put us on the train back to Grand Central.\nI felt so small on the way back. Julia May didn’t say anything, and I didn’t want her to. When we rode through the prison again, I wanted to shout, but I knew you wouldn’t hear me.\nWe got back around midnight. Mom was waiting up, and the police were there in their cars. I think they took Julia May home. Mom slapped me hard across the face, but I can’t remember much of what she said. I just remember sobbing, and trying to squirm away from her, yelling, “I don’t want you anymore!” because Mom was part of the lie too.\n“So you want your dad?” she yelled back. “That good for nothing! He’s been lying since the day I met him!”\nThen why didn’t you tell me the truth? I wanted to ask her, but I didn’t, because I can’t talk to Mom the way I talk to you.\nEventually, we collapsed on the worn orange sofa, clinging to each other through our anger and tears, until we fell asleep.\nDad, I’m telling you all this because I want you to know how badly you’ve hurt me. I don’t think I can ever forgive you.\nBut there’s just something I’m turning over again and again in my head. I just don’t understand. Why did you do it? Why did you lie?\nJesse\nSeptember 5, 2040\nI don’t know how to begin, but I must. You’re right of course. I’ve lied to you. I kept getting in deeper until I couldn’t stop.\nI know you’re wondering why I lied, Jesse, and I’m not sure I have a good answer. I could tell you about my own childhood, and how my lies allowed me to survive the streets, but that would not justify what I’ve done to you. So I will not make excuses, which are themselves half-lies, because then I would not be honest with myself.\nBut try to imagine how happy I was when I received your first letter two years ago. I wanted so desperately to have a relationship with you. I wanted to be different from my own father. In your innocence, you called me a time traveler. It seemed harmless enough, so I played along. But then the lies ballooned, and got away from me. You see, Jesse, when you reached out, I had to do everything I could to keep you, because you were all that I had. I needed you.\nJesse, much of what I’ve told you isn’t true. But that doesn’t mean it couldn’t be. God knows people like you and me gotta hold onto our dreams and fantasies, because sometimes they’re the only place that others let us be.\nYou see, I really do believe you have a bright future. To me, it’s as real as my orange jumpsuit, the walls around me, the river I cannot often see. So make me proud. Make it the best future you can, because your future, unlike mine, is still yours to make.\nI hope you write again, even though I don’t expect you to forgive me. Whatever happens, I want you to know that my love for you is also real.\nAnd that’s no lie.\nDad\nJanuary 5, 2041\nDear Jesse,\nIt’s hard when you’re one of the only dads in prison not getting a card for the holidays.\nI suppose I didn’t really expect a card or a letter this year. You’re upset, and you have every right to be. I just wanted you to know that I’m sorry. I don’t know if I said that in my last letter. Maybe we can start over. Perhaps you could give me another chance.\nLove,\nDad\nJanuary 15, 2041\nDear Dad,\nWhen I was young and I was bad, Mom always sent me to the corner to stare at the wall. Once, when the living room window was open just a crack, I reached through to the planter outside and picked geraniums for her. When she saw, she squeezed me tight and said, “Oh Jesse sweetie, you’re just like your father, always trying to fix the past to make a better future.”\nI think that’s why I thought you were a time traveler.\nI’m not going to send you this letter. I don’t care that you feel left out. I don’t care if you miss me. I don’t know why I’m even writing another letter. Maybe I thought telling you how it began would make me feel better. Surprise—it doesn’t.\nJesse\nMay 28, 2041\nDear Dad,\nLike you always used to tell me, things have changed.\nNear the end of April, I went to visit Julia May because she asked me to. We hadn’t seen each other in a long time. We kinda went separate ways after the train ride. I guess I didn’t really know how to share that part of myself, the part about you, with anyone else. It doesn’t matter. There are a lot of other pretty girls in fifth grade.\nI found Julia May outside her apartment building on 174th, sitting cross-legged on a mound of black trash bags and cardboard boxes. She was wearing a sleeveless yellow dress with polka dots, and her arms shone in the hot sun.\nI asked her about the mess.\nShe came down and hugged me. Then she started to cry. “I never told you, Jesse. It was too hard. But my family’s going to Mars.” She gestured toward the trash. “Look at all this shit. Each person can only bring forty-five pounds. I’ve had to throw out almost everything.”\nI felt like I had been punched in the gut. “Why are you going?” I asked.\nShe sniffed and dried her eyes on my shoulder. “So we can have a new life, I guess. A brighter future.”\nI thought about you and your lies. “It’s not possible to start over,” I said. “Not really. There’s always the things we did, the choices we made. They can’t be undone.”\n“I guess not,” she said. “But we can make new choices.”\nWe got to talking for a while, and she asked whether you and I have been in touch.\nI shook my head.\n“What do you really know about your dad?” she asked.\nI told her I didn’t care anymore. But it wasn’t true.\n“Jesse,” she said, “a person’s more than the bad things they’ve done, even if they’ve done a lot of bad things.”\n“But his letters . . . ”\n“I know. Lies. But they were hopeful lies.”\nSaying goodbye to Julia May was harder than I expected.\nA few weeks later, when the rockets were ready to go, I got Mom, and we held hands and squinted at our crummy old TV as the rockets rose into the sky. Then I sat and thought about the hopes for a bright new future that rode with those brave people, until the fires winked out and all that was left was a trail of smoke and dreams. There was this pit in my stomach because I’ll miss Julia May, and honest to God I hope she makes it, just like I hope I make it too—wherever it is I choose to go.\nBecause you were right, Dad. My future’s up to me, and I’d better make it a good one. And now, when I read your letters again, I realize that’s what you’ve been telling me all along, because the stories you invented were not lies, but dreams. They’re about us, and they’re mostly good stories, and I don’t want them to end.\nSo I’m coming to visit. Mom’s going to take me, although she doesn’t want to. I don’t want to think about what it’ll be like too much, in case all the thinking makes me change my mind. But this much I know. When I come, I’ll bring a package with me. It will be no more than 18 inches by 14 inches, because it’s got to meet prison regulations. After I walk through the gates at Sing Sing and the metal detector, I’ll get to the visiting area outside the cell block, and we’ll look at each other awkwardly for the first moments. “The future is here,” I will say, as I show you my package of letters, this one among them.\nJesse\nYosef Lindell is a lawyer, writer, and occasional historian. His short fiction has previously appeared in Beneath Ceaseless Skies. Yosef has lived in Los Angeles, Philadelphia, and New York, and now resides in an unincorporated part of Maryland just outside of Washington, DC with his wife and son."}