{"fingerprint": "UMUCypNtcDyBvxmodO4/fGNPJOY=", "sitename": "Clarkesworld Magazine", "title": "The Plasticity of Youth by Marissa Lingen", "author": "Marissa Lingen", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lingen_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Plasticity of Youth by Marissa Lingen", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3010 words, short story\nThe Plasticity of Youth\nThe warning light went on as soon as Jess started the car. Low tire pressure. The obstetrician expected her in forty-five minutes, and it was a half-hour drive. She got back out to look at the tires, sighing with what little lung capacity she had in her cramped, shared body.\nThe passenger’s side front tire was completely shredded. Jess swore, then apologized to the baby, then swore again. The baby would have to get used to it anyway. She would have expected to remember a tire blowout of that size—would not have expected to make it into the garage without noticing—but there it was, half the rubber missing.\nThere was a noise behind her.\nShe turned, her center of balance far enough off to make it a production. There was a raven sitting on the housing of the rear passenger’s side tire, ripping merrily away at it.\nAnd swallowing the shreds.\n“Go, shoo!” she said, flapping at it. “Get away!” The raven hopped a few feet away from the tire, but it refused to go even so far as the sidewalk, much less any more-reassuring distance away. “That can’t be good for you,” she told it.\nThe raven cocked its glossy head and regarded her with bright eyes, apparently in complete disagreement about the health effects of eating tires.\n“Okay, fine, I’m not your mom,” said Jess, and she got out her phone to call for a ride. Brendan was supposed to meet her there, coming from work at the last minute, so she ended up making polite conversation with the rideshare driver, who didn’t find the corvid as disgusting as she did.\n“Birds, ya know? They’ll eat whatever.”\n“I don’t think that’s true,” said Jess, but the discomfort and indignity of her appointment at the end of a long and difficult day washed away her sense that this was important, something to focus on.\nAnd when she found a reeking tarry deposit on the front walk, she assumed that it was her hormone-heightened sense of smell playing havoc with her senses. The previous day had been her last day at the architectural firm before parental leave, and the waves of congratulations had been sweet but exhausting. She left Brendan a note asking him to please, please clean it up, hugs, kisses, and went in for a nap.\nThe last days of a pregnancy and the first months of a newborn are infinite while they’re happening, the blink of an eye in retrospect. Neither Jess nor Brendan remembered that specific stinking poo in the face of so much more of it. The crow eating the tires was mostly memorable for the fact that they had to replace the housings and wheel rims of the car as well as the tires.\nWhen they put their heads up again, Christa was four months old and strident in some actual opinions about important human things like baths (maybe okay, maybe the worst) and clothing (fundamentally terrible, worth resisting with all the tiny flails at her disposal), and the world looked different. Specifically, it had holes in it.\nBite marks. Pointy, beaky bite marks in the plastic mailbox pole. Little toothy bite marks in the arms and back of the patio furniture. What was left of the flowered upholstery on it might have had bite marks, if there had been enough of it left to see, but it was completely shredded. Nylon, Jess thought blankly, and polyester. What would eat that?\n“It can’t be good for them,” she said out loud, staring at the tatters of their yard. And then she hauled the unusable chair to the trash and went back inside to wash more of the baby’s clothes. And blankies. And innumerable burp cloths.\nThe neighborhood social media had some kind of meeting announcement, but Jess was too consumed with baby stuff to make it. Other people had trouble with their patio furniture, too, and some lawn ornaments or flowerpots or something Jess could not bring herself to care about. One of the neighbors kept making posts about moss. “Do you know what’s up with the moss dude?” Jess asked Brendan, on one of the days when Christa had let them sleep almost reasonably.\nBrendan shrugged. “I think the same person was obsessed with coyotes last year.”\nJess rolled her eyes. “Coyotes have been here longer than we have.”\n“Word,” said Brendan. “They’re pretty bold now, but it’s not like we were going to leave the beepus out on the yard by herself overnight anyway.” He tickled her under the chin. “Don’t run away with the coyotes yet, beepus! Don’t become their queen!”\nAmong the astonishing range of noises Christa produced was a honk that sounded remarkably like their car. At least, Jess was pretty sure it was what the car had sounded like. They mostly tried not to drive it except when it was absolutely needed now. Too many friends—and too many news reports scrolling by on their neglected social media feeds—had weird stories about damage to plastic and rubber parts. It was amazing how many plastic and rubber parts a car had. It probably felt like a bigger change to everyone else, Jess thought, who had not had their lives completely turned upside down by eight ( . . . thirteen . . . twenty . . . ) pounds of adorable screaming and pooping, and who were having to figure out what normal might look like anyway.\nBy the time Christa was two, they had settled into a routine of sorts. They were mostly back to work, they were mostly figuring out the parenting thing, until Christa hit another milestone and upended all their ideas of what would and wouldn’t work for her, for all of them together. They managed most of the things that absolutely had to be done. Many of them, anyway. Some of them, some weeks. They survived, they glowed, they saw more sunrises than college students with late projects. Christa grew, the world turned.\nThey were trying to make some kind of order of the chaos that had become their back garden one evening when Jess looked over to find Christa eating some of the moss that had grown on the remains of the plastic sheeting.\n“Salad!” she chirped.\nJess moaned, “No, god no, honey, not salad! Ucky! Bleh!”\n“Salad,” Christa said complacently, taking another bite of moss before Jess could pry it out of her fingers. The green drool ran down her chin.\n“I’ve got a container,” sighed Brendan. “Baby’s first trip to poison control.”\nBut Christa remained energetic—exhaustingly energetic—and in shriekingly high spirits for the hours they waited in the emergency room. She had no fever, no vomiting, no lethargy, no signs that the moss had harmed her in any way. She was mildly annoyed at the blood draw they took to test whether her liver enzymes were normal, but no more so than she was on any other doctor visit.\nShe finally fell asleep with her little diapered butt in the air and her head in Brendan’s lap before the doctor returned to the cubicle. “So . . . we’re not seeing any of the usual signs of poisoning,” the doctor said, frowning thoughtfully at her tablet. “I would say that kidney and liver function are both normal. There are some very novel compounds in Christa’s bloodstream, however. I don’t have any idea if that has anything to do with the moss consumption. I’d like to send it out to an external lab for further testing. Good thinking, bringing it in.”\nJess smoothed a lock of Christa’s hair away from her face. “What kind of novel compounds?”\n“I’m really not at all sure, that’s what makes them novel,” said the doctor. “We’ll call you.”\nBy the time they had processed all the paperwork, it was the small hours of the night. Jess heard rustling outside as they closed the garage door. “What animals are awake at this hour?” she murmured.\nBrendan carefully slung Christa over his shoulder, but she didn’t even twitch in the transfer from car seat to bed. “Lots of them. I don’t know. The door’s wood, it’s fine.”\n“Animals can gnaw wood,” Jess muttered, but she was already face-planting into the pillow.\nAnimals could gnaw wood. There were even rhymes about it—Jess tried to teach the entirely untraumatized Christa about woodchucks chucking wood, but Christa was unmoved. Meanwhile the tests kept pouring into Jess and Brendan’s inboxes, listing compounds in both the moss and the toddler that neither of them recognized. There was a request for a follow-up scan in another month.\nThe results left them baffled.\n“Most babies in our culture have a lot of microplastics in their gut,” said the doctor. “This isn’t particularly great, but it’s what we’ve got. They accumulate just from the world around us. Christa . . . Christa doesn’t have that.”\n“Well, that’s good, right?” said Brendan, looking anxiously at Jess. “We’ve always tried to keep our house clean, and . . . ”\nJess pressed her lips together, thinking of the unknown sticky patch she’d cleaned off the sofa just the previous day, the mystery substance on the floor of the back seat. Whatever was going on with Christa, it was definitely not because they were paragons of cleanliness with a toddler.\n“Microplastic is not something you take in from just your family’s home,” explained the doctor. “It’s everywhere, in everything, soaps, the lint from your clothes, all of it. It’s part of dust now. So no, we don’t think that it’s possible that Christa just hasn’t taken any of them in. From what we’re seeing in the blood tests, it’s a lot more likely that her system has learned to process them out again. To . . . digest them. Do you find that her bowel movements have an odor?”\nJess cocked her head. “You’re asking me if her . . . if her poop smells. Do you ever get parents who are like, no, not my baby, her diapers are like the finest perfume?”\nThe doctor laughed. “Okay, fair. We’re going to want stool samples, we’re going to want to keep an eye on this, but honestly, Christa seems really healthy. I think she might have hit the jackpot here. We’re seeing a number of mutations, some of them beneficial and some otherwise. If you don’t mind enrolling Christa in a study, we think that could be useful.”\nBrendan and Jess looked at each other. “Involving what?” asked Brendan.\n“Mostly blood samples, stool samples,” said the doctor. “Noninvasive scans of the type she just had—less than once a year unless a problem arises. But honestly, she seems to be doing great. I wish they were all like Christa.”\nChrista chose that moment to shriek at a high enough pitch that it was barely audible to human adults and attempt to grab the doctor’s stethoscope. “Yeah, she’s perfection,” Jess laughed, disentangling the baby from the medical gear. But in her heart, she thought, yes, she is, she’s doing just what she’s supposed to do. Keep being two, little one, keep sticking things in your mouth and yelling and doing all the things, and to hell with the microplastics.\nBut the ravens and the moss and all the others who were not toddlers, all the quick biting and slow rending mutations, had finally made their presence felt enough that Jess had to deal with it at work. The architectural firm held seminar after seminar about which materials had plastic coatings and had to be replaced, which were hosts to new biofilms, and which were fodder for mutated organisms.\nIronically, most of the materials she was learning to substitute were technically edible as well. Hypothetically they were more edible than plastics—edible to a wider range of creatures. But as the parent of a toddler, she was entirely aware that “you can technically eat this” and “this will definitely get swallowed in bulk, yum yum” were two separate questions—apparently at least as much so for mutant mosses as for little girls. Concrete was fine. Metal was fine. But many of the fine details that made a design worth the architect’s time, she had to learn again.\nThere was a part of her that kept expecting it to change back. That kept expecting everything they were dealing with to be over, to return to a toddler—a preschooler—who wasn’t part of a study, a world that wasn’t reshaped. That kept wanting a return to normal, and that just didn’t happen. Instead, there were protests outside government buildings more or less at random, because someone needed to do something, never mind what. Instead, there were rifle shots in broad daylight: neighbors arguing about shooting at the ravens, arguing about calling the police on each other. Jess shuddered and made sure Christa played inside that day.\n“Well, that part’s the same,” said Brendan that night as they prepared supper, Christa playing at their feet. “You think if they get sheep with this mutation, they’ll produce synthetic wool?”\nJess shook her head wordlessly.\n“Gonna be a problem at the farm with the chickens who lay the plastic Easter eggs, though, those will all get digested.”\nShe stared at him.\nHe set down the wooden spoon he’d been stirring the soup with and put an arm around her. “Okay, I know it’s not my best material ever, but come on, not even a smile? What’s wrong?”\n“What if they find out? That she’s like those birds?”\n“She’s not.”\nShe tossed her head, unable to even articulate her profound disagreement.\n“They’re not mad because the birds digest the plastic, Jess, they’re mad because the birds ate their lawn chairs. Hell, I’m mad because the birds ate our lawn chairs. I’m mad because the birds ate our damn tires. We’ll teach the kiddo not to eat the neighbor’s tires, come on. I feel like that’s parenting 101.”\n“That was three years ago.” She paused. “They’re mad because the birds are different from them.”\n“They’re birds, they were always different from them.”\n“Different from before.”\nBrendan sighed and hugged her closer. “Jess. Love. Nobody is going to shoot at our little girl because the doctor looks at her poop. I promise. Even humans are not that bad.”\n“Even humans,” Jess repeated sadly. She wasn’t sure she believed it. She wanted to mute “protests” on her news feed, but she didn’t feel like she could; there were too many things she might miss that way. Including things that might affect her little girl.\nSomeone dumped acid on a patch of moss at the park the next week, leaving a twisted, burned hole in its wake. Jess couldn’t tell if it was the sort of moss that ate into the plastic or if the trails that were eaten away were the result of the impromptu acid bath. Christa squatted down on her little haunches and wanted to poke her fingers into it. Jess let her look but not touch.\nChrista watched with big eyes as all the neighbors’ recycling and compost bins were gradually replaced with specially lined wood and metal ones. Not only her mother but her grandmother had played with a plastic bucket and shovel in a sandbox, but hers were smooth wood and careful tin. It was a small enough thing that by itself Jess could almost pretend that it was their choice, a green choice, using fewer plastics on purpose. But it was not by itself, it was combined with everything, the scans, the ravens, the seminars, everything.\nJess eyed her preschool classmates, looking for signs that another of the kids was like Christa. None of them had her daughter’s forthright curiosity, but that didn’t have to be microplastics in their guts, it could be anything. It could just be that her fierce maternal sense that her daughter was amazing was actually correct, though Jess tried to discount that. Gradually she came to appreciate a quiet little boy whose questions were shyer than Christa’s demands, a little girl who didn’t so much ask things as experiment with them. Maybe Christa would find other kids like herself after all.\nOne week Jess noticed that Christa was complaining that the quiet boy, Liam, was gone day after day, so she asked the head teacher, not wanting her little mutant to lose the beginnings of connections with others like her. “Liam isn’t feeling well,” the teacher replied, leaning down to Christa. “Don’t worry. He’ll be back next week.” To Jess she said, “He has a sensitivity to certain environmental triggers, and he needs special medical care from time to time. It’s genetic. Something to do with plastics. They clear out his system as best they can so that he can join us at school again.”\n“Ah,” said Jess, looking down at Christa, who had heard “back next week” and was wrapped around her mother’s leg and singing to herself about bears, all worry forgotten.\nThe teacher smiled her reassurance at Christa, though Jess was the one who needed it. “But he’ll be fine. We’re all made differently, aren’t we?”\nJess tangled her fingers in Christa’s hair. She wouldn’t have made the mistake of thinking that “like her” was about genes before she had a child who had a genetic difference; she would have to try not to make it again. She managed to say, “I suppose we always have been.” She steered Christa toward the door and then stopped, turning to ask, “Do you know if Liam’s parents are on the class contact list?”\n“I can check,” said the teacher.\nBeing genetically opposite didn’t bother the kids a bit when they were playing, Jess thought. And maybe Liam’s doctors had already told his parents about kids like Christa. But she hadn’t known about kids like Liam. Better to put their heads together, see if they could learn anything to help each other. Both of their kids were growing up in a very different world than they’d expected. Maybe it was time to lean into that."}