{"fingerprint": "0hg4Wb8l7w1ZxLy28gBvClht+fw=", "sitename": "Clarkesworld Magazine", "title": "Wagon Train to the Arctic by Andrew Liptak", "author": "Andrew Liptak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/liptak_04_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Wagon Train to the Arctic by Andrew Liptak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Wagon Train to the Arctic\n The history of space opera is one that prizes exploration and discovery; of finding new worlds and new civilizations or sights that human eyes have never encountered. Science fiction authors, tech visionaries, and science communicators have highlighted humanity’s long history of expeditionary travel as a sign that it’s our destiny as a species, one that will eventually lead us out into the depths of space where we’ll eventually thrive.\n Those arguments have been picked up by experts like Carl Sagan, and are exemplified by science fiction—look no further than Erik Wernquist’s phenomenal short film from 2014, The Wanderers, which depicts human explorers visiting the wonders that the solar system has to offer. “We invest far-off places with a certain romance. This appeal, I suspect, has been meticulously crafted by natural selection as an essential element in our survival,” Sagan croons as we see spaceships exploring Jupiter and as a space elevator drops down to Mars.\n It’s a beautiful and polished short film, but it’s one that leans heavily into the long-standing idea that humanity is destined to explore these frontiers, drawing on the assumptions of colonialist tendencies while underselling the harsh realities that space exploration will bring. We might end up on worlds other than Earth, but the reality won’t be like the exploration of the American west; but that of Antarctica.\n In 1960, John F. Kennedy accepted the nomination for President at that year’s Democratic National Convention, and in his acceptance speech—now known as “The New Frontier”—he spoke about the challenges that faced the country.\n He was arriving at the beginning of a contentious period in American history. The war in Vietnam had raged for five years, the Civil Rights Movement was in full swing, and both the United States and the Soviet Union had begun to take their first steps into space, first with Sputnik 1 in 1957 and the Explorer 1 satellite in 1958. In his speech, Kennedy positioned his candidacy, and the Democratic Party, as the one to best approach the new era that the US was about to enter—highlighting the changing geopolitics in the ongoing Cold War and how new technological changes were changing the way of life for people around the world. In doing so, he evoked an emblematic image of American progress. “I stand tonight facing west on what was once the last frontier,” he said, proclaiming now that there was a New Frontier, one that he described as “not a set of promises—it is a set of challenges.”\n Two years later, he would again invoke the imagery in a speech at Rice University, in which he spoke about the need for the country to advance its efforts into space, to try and outflank the USSR, as each sought to control the ultimate high ground in their ongoing arms race. “What was once the furthest outpost on the old frontier of the West will be the furthest outpost on the new frontier of science and space,” he told the crowd. “Many years ago, the great British explorer George Mallory, who was to die on Mount Everest, was asked why did he want to climb it. He said, ‘Because it is there.’ Well, space is there, and we’re going to climb it, and the moon and the planets are there, and new hopes for knowledge and peace are there.”\n The language of space exploration and science fiction has long been tied up with the romantic imagery of the American west. The history of American literature is full of stories about intrepid (white) explorers who ventured into the unknown (to them) for the economic and geopolitical benefit of the growing United States. Their exploits were fodder for the pulp writers filling the pages of magazines like Western Story, Ace-High, Cowboy Stories, Frontier, and others.\n Westerns were soon joined by others: pulp science fiction magazines such as Amazing Stories, Astounding Science Fiction, and Weird Tales, all of which drew in influences and writers from those western stories. If the American frontier ended at the Pacific Ocean, the technological advances brought by new scientific fields delivered a new frontier: the endless horizons of as many planets as authors could imagine. Authors like C. L. Moore, Philip Francis Nowlan, and others incorporated the imagery of the American west into their stories, bringing the tropes and feel of those older pulp stories into the future.\n In 1941, fan and author Wilson Tucker brought the two concepts together with a descriptor: “Space Opera,” which he wrote “In these hectic days of phrase-coining, we offer one. Westerns are called ‘horse operas,’ the morning housewife tear-jerkers are called ‘soap operas.’ For the hacky, grinding, stinking, outworn space-ship yarn, or world-saving for that matter, we offer ‘space opera.’”\n Derisive as it is, the term and subgenre has proved to be durable: not just because of the imagery that those stories provided, but their core essence: the possibility of exploration and seeing the unknown.\n For decades, the western has been an integral part of space opera’s source code, deeply embedded in the stories that followed. When pitching Star Trek, Gene Roddenberry described the show as a “wagon train to the stars”—that the USS Enterprise was exploring the frontier of space much like those original wagon trains and explorers of yesteryear. Since then, the association has endured in the public’s mind, thanks to movies and shows like Star Wars and Firefly, which have leaned into that imagery without expressly examining the tropes that underpin it.\n In 2008, private space firm SpaceX successfully launched Falcon 1 into orbit. It was an enormous milestone for the company: The first time that a private company had launched its own vehicle into space. The moment was something that CEO Elon Musk had long envisioned: the first step toward establishing a permanent human foothold in space, with the eventual goal of setting up colonies on Mars.\n It’s an ambitious goal, and Musk has spoken about his love of science fiction as an influence, with books like Isaac Asimov’s Foundation series and Douglas Adams’ Hitchhiker’s Guide to the Galaxy helping to cement the idea that humanity was vulnerable if it only had one place to call home. In major presentations before the International Astronautical Congress, he outlined the steps that he and his company would need to take to set up such an initiative: massive rockets that could deliver hundreds of people to Mars, as well as the infrastructure to refuel and resupply them. Others have joined him, like Amazon founder and CEO Jeff Bezos, who set up Blue Origin in 2000 as a venture to develop reusable hardware to bring down the costs to get into orbit.\n It’s a plan that could have been ripped from the pages of a science fiction novel, and Musk’s plans, imagery, and talking points mirror those of many space advocates, leaning into the romance of exploration and discovery, and how humans marching into the stars will further our destiny as a planet.\n But while the imagery of the American western provides useful inspiration for writers and space advocates, it’s an analogy that doesn’t hold up when it comes to depicting the harsh realities of interplanetary exploration. There are other historical periods and activities to draw from, like the exploration of Antarctica, that would be better suited for grounding one’s narratives.\n In his 2010 paper for the Journal of Cosmology, The Problem of Human Missions to Mars, Dr. Michael F. Robinson highlighted that historical analogies brought to the field of exploration, noting that “when we peel away the ancillary arguments for human spaceflight (e.g. benefits to spinoff technology, employment, or national soft power) we find that core arguments rely heavily upon the use of historical analogies,” and that those associations rely on certain assumptions—that humans have always been explorers, citing examples of how our ancestors have migrated across the world throughout history.\n But there’s little evidence to support that line of argument, Robinson argues. “The lesson from history appears to show the reverse: that humans have sought out an increasingly settled lifestyle based upon agriculture and industry, foregoing the risks of nomadic travel.” Furthermore, the explorations out of Europe and Asia throughout the global age of exploration weren’t undertaken in the name of romantic discovery: they were for the purpose of commerce, either by discovering new riches to exploit, or by marking out more efficient paths upon which trade could flow. Indeed, even our expeditions into orbit and to the Moon weren’t initially shouldered out of the goal of scientific knowledge: they were demonstrations of American (and Soviet) technological prowess in the midst of a long-term, global arms race.\n Robinson spoke at a conference a decade ago where he noted that the exploration of Antarctica is a more relevant analog for trying to accurately anticipate extraterrestrial exploration. A trip into the American west was something relatively easy for someone to take on: they could count on being able to find food and supplies on the way, and some sort of economic reward at the end. Expeditions to the South Pole are a far more costly endeavor, one that requires considerable planning, logistics, and supplies to survive in the harsh environment. The South Pole is the only place on Earth without an indigenous population, and is only home to people (anywhere from fifty to two hundred) in research facilities.\n Genre literature often plays a role in shaping the perceptions of how we view the universe and our place in it—to the point where the use of bad science can misinform viewers and readers. The genre’s earliest authors drew on the stories of exploration for which they were already attuned: the expansion into the American West, focusing on the thrill of adventure, because it made for salable stories. Stories are important tools when it comes to approaching the future, and fully understanding the depth of the roots of those stories is equally important when using them as a rationale for moving forward.\n Recent works have departed somewhat from the pulpy possibilities of space travel, due in part to new scientific discoveries, and an appetite for realism from readers. Science fiction authors have imagined and depicted the harsh realities of other worlds. Andy Weir’s The Martian pits astronaut Mark Watney against the inhospitable terrain of Mars when he’s left behind by his fellow crew, James S.A. Corey’s The Expanse series has depicted the harsh realities of life on settlements throughout the solar system, and Kim Stanley Robinson brings the passengers on a generation ship to a moon of Tau Ceti e, in Aurora. There, they find an inhospitable landscape with some deadly extraterrestrial life, where the passengers face the prospect of generations of difficult terraforming or a lengthy trip back to Earth.\n These stories in part draw on the picture that scientific exploration has painted of the solar system and beyond: worlds that are certainly reachable by humans, but which are cold, distant, and expensive to reach. Building self-sustaining human colonies on those far-flung bodies is certainly within the realm of possibility, but settlers should first look not to the science fiction that influenced the men trying to bring us to those worlds, but to our own world’s polar regions, and ask themselves if they should try that first, instead."}