{"fingerprint": "X1r9jWfFtokiq7MrBmVU4rUI+24=", "sitename": "Clarkesworld Magazine", "title": "Commencement Address by Arthur Liu, translated by Stella Jiayue Zhu", "author": "Arthur Liu; Stella Jiayue Zhu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/liu_03_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Commencement Address by Arthur Liu, translated by Stella Jiayue Zhu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3560 words, short story\n Commencement Address\n . . .\n The first step to decoding memory is the insertion of liquid nanoprobes, which travel through blood vessels and membranes via interstitial fluid until they are evenly distributed along the body’s central nervous system and form a sensor network. Their dense surveillance enables the brain to transform into an intricate server that decodes requests and codes responses.\n Just picture some Wednesday two years ago, that old pal who had just left the pub will come back on the monitor; soon as the question stirs in the mind—where were the keys left before bed?—loud tumbles from laundry room resound. We have finally discovered, as we open the door to our brain, how rich and crystal-clear the cerebral archive is. Moonlight reverses its course from the break of dawn and retraces the decade foregone: waves that crashed into foam under our feet when we were children, the strolls we took and games we played on the beach . . . until we draw our last breaths.\n Computers have strived to emulate human brains. Quantum computers excel at the task by storing these fragments of our memory.\n Corporations quickly understood the potential of this technology, whereas scientists detected its weakness even faster. Politicians began legislation. Intellectuals squabbled over its ethical ramification. Until finally, a comprehensive service to meet our eternal, unchanging needs was born in the very same international lab that invented this piece of tech.\n When we die, we nestle in the memory of others, obtaining immortality therein.\n And this system, so named “Erstwhile,” saves a day from eternity to recreate striking visions in the virtual world.\n Some people are restored from the depth of despair with its help, even though all it weaves are illusion, and the dead do not come back to life.\n Others bemoan that it cheapens memory, because the cost of recovering and storing a day is a scant twenty thousand dollars a year.\n . . .\n On Tomb-Sweeping Day, conciliation commenced in the rain. Two girls shook hands in forgiveness by a headstone. Four months ago, one had rallied a crowd against the other and called her a “bastard.”\n At your classmate’s mother’s funeral, I saw two versions of you. She who represented you from the past was in anguish. When she saw you, panic colored her tear-stricken face.\n Your teacher was the one to extend the invitation. During one of her home visits to us, she learned of my role in the research and development of Erstwhile. I said yes, so the girl’s mother might appear once again with the vivacity of her lifetime. I brought a beta test augmented reality device and gave the girl a chance to bid farewell to her mother.\n The spirit of the dead shall eventually rise. Now that they had finally parted ways, the father clasped his daughter, while she burst into tears.\n Then, she saw you. Standing face-to-face, your eyes alighted on each other.\n At that moment, you stepped forward and pulled her into an embrace.\n According to Sister Zhang who lived next door, the best part about gardening was watching seedlings sprouting from soil and flower buds starting to open.\n On our way back from school, you told me that you forgave her because you saw your younger self in her.\n “Of course.” I nodded. The memories were still fresh and return vividly to mind, no decoding necessary. You’d run back home from school crying and told me that someone called you a motherless child. You’d been grieving among phantoms, having just spent twenty thousand dollars . . . but four months were long enough to make for the biggest turnaround in life.\n Now, the same girl, sitting in the back seat, vouched that she would not allow the same thing to happen twice, that she would protect her classmate.\n A while later, you looked out the window and began reciting a poem by Du Mu.\n Drizzles of rain on Tomb-Sweeping Day, pull at the heartstrings of journeyman . . . the heartstrings of journeyman . . . the heartstrings of journeyman . . . you repeated the end of the couplet, brows knitted in concentration.\n Entreating . . . I reminded you, tentatively. You groaned, complaining that I got in the way.\n Once I dropped you off at school, I watched you walk away under an umbrella in the rearview mirror and caught my own reflection smiling on the window.\n I wept.\n Seeds nestle in soil and absorb nutrients. Once tender shoots leave the protection of seed coats, they scrape against gravel and grime until, finally, bruised cotyledons break through the ground.\n That same year, I paid an additional twenty thousand dollars to write this day over those painful memories of losing your mother. The clock had finally started turning again. My daughter was growing up. This very day—a gift from you—was my happiest since your mother passed away.\n . . .\n History progresses in self-repeating patterns, like stitches in a sweater if God too can knit.\n Upon reflection on the history of the development of software engineering, it is not hard to see that dream architects are but a different kind of programmer. Operating systems were first introduced for computational services. Then, they flourished thanks to the emergence of API and GUI. Following Microsoft and Apple, Linux and Android rose to success with the help of open-source software and developer communities, which, furthermore, turned GitHub into a fertile ground with future promises. Another half-century later, quantum computing disposed of integrated circuits, whereas Dream OS became the new DOS. The company that made Erstwhile assembled all its research findings and extracted from them an operating system that uses the human brain as its kernel. Through rise and fall, the wheel of history turned another full circle.\n According to introductory textbooks on computer science written at the turn of the century, application programs are born on operating systems.\n As the first application program, Erstwhile’s success opened a new venue in the research and development of brain application software for developers who had been struggling through another AI winter. Game engines, social networks, crowdsourcing and computing, light and heavy industries . . . the applications market burgeoned. Laws and policies aside, the only thing holding engineers back from transforming the world was the limit of their own imagination.\n History progresses in self-repeating patterns, like stitches in a sweater if God too can knit.\n Fifty years ago, programmers were going from zero to one at the cutting edge of technology.\n Fifty years later, thirty thousand dream architects unlocked the age of dream-building in the mindscape.\n . . .\n You took after your mother in every way—her good sense, her quick wit, her smile.\n “Dad, come here, I wanna show you something.” I took you on a vacation to Yantai after you graduated from middle school. In the depth of night, against heaves of the ocean, you pulled me out of the wood lodge and asked me to switch my brain to AR mode.\n “I don’t see anything.” Following your instruction, I looked up and around. The night’s sky was decorated with countless stars. The silhouettes of palm trees swayed to the wind.\n “Take your time, think of something happy.” You sounded like you were shaking.\n Just then, a shooting star rose from the sea and burst into giant, pink fireworks in the air.\n I froze, then turned toward you.\n “Did you make that?”\n “Yep, it’s a small tool for psychotherapy. I project emotions to the vector space and use the Dusk engine to visualize them with corresponding graphic representations. It’s not complete yet. Right now, the fireworks are all there is.”\n You squeezed my hands and looked me in the eyes.\n “I want to be a dream architect just like you, Dad.”\n Afterward, we took a long walk along Seaside Road. You suspended your teenage defiance while I pushed down my parental instinct for control. We talked until daybreak.\n You told me how your decision was born on a Tomb-Sweeping Day many years ago. It was on that day you had realized that helping others was a form of salvation for the self. These days, becoming a dream architect was the best way to live out your conviction.\n “Tell me how you came up with the design.” I urged you.\n So, you recalled the upsets I had put you through with my reprimands. As it turned out, this was how a child, in her quest to break free from her father’s tether, might find an outlet for her misery. The fireworks on the horizon dwindled into pale lavender crumbs as I digested the fact that you had to console yourself of grievances that I failed to notice.\n “Don’t feel bad.” you said, confiding to me that the same purple clouds had also appeared to you that one time you messed up my watch.\n “When you are done, I will help you with marketing.” This was how I chose to express my remorse.\n You kept on talking, now about your expectation for your work. There was unmistakable pride and excitement in the way you spoke. I listened on as you drew aesthetic parallels between the W3C standard set of colors and the alignment between stars. Then you told me which applications on the market you rated. In the distance, dark purple fireworks slowly brightened into ribbons of a brilliant blue, and soon transfigured into heartening, red comets. Before I realized that tears were running down my cheeks, pink fireworks once again blossomed right in front of my eyes. One. Two. Three.\n “Dad? What’s the matter?”\n You were just delineating how the reallocation of computing resources scales time in the virtual world.\n “Nothing. I am happy,” I hurried to wipe away my tears, “happy that I have an exceptional successor, that you enjoy my line of work.”\n “Of course,” you smiled, “there is nothing dream architects can’t do.”\n Another firework went off, perfect, in full bloom.\n You were yawning. I sent you back to bed before returning to the beach and continuing my walk.\n In the cold gray light of dawn, fireworks were still going strong. Soon, the sun was dancing with the moon while stars traveled through a light mist.\n During our long talk through the night, I told you that your mother had once said something similar. It was right before a major performance. The director had torn into me for an uninspired design of special effects. It was your mother who spurred me on with her ardor for change and innovation.\n What I didn’t tell you is this: it was on that starless night when I met your mother for the first time.\n On that day, I was just a regular guy, and she was still an apprentice dream architect.\n I came to a halt—\n Down by the estuary, fireworks dazzled like flowers. Under gleams of light tinted the color of cherry blossoms, your eyes sparkled just as your mother’s had.\n . . .\n Extremes meet—it is upon the height of glory that ruin must fall.\n Informational security is the cornerstone of the era of dream architects. Yet, a single vulnerability is enough to dismantle it all.\n Sandboxes, firewalls, secure channels . . . humanity during the age of dream architecture has written them all into the brain. But in comparison to a computer, the human mind is a far more delicate machine. As a result, the ramifications of damage are likewise far more devastating. The first few years after the introduction of first-generation products saw carnage erupting in battles between black- and white-hat hackers.\n It only came to a stop when a specialized security R&D start-up procured a joint authorization from labs and governments. Then, at the cost of countless lives of death row inmates, the start-up came forth with a formidable security suite for the brain.\n But maximum security does not mean absolute security according to modern cryptographic theories.\n A short golden age had ensued after dark times. Dream architects were born in the golden age.\n Yet God spun the wheel of fortune and turned its double-edged sword. Darkness descended once again.\n . . .\n My plane was already in trouble when you came on the phone, speechless from excitement.\n “I got it!” In the video, you were holding an offer from Horizon, the company that founded this era—my employer from many years ago.\n Your commencement ceremony was set in two days. I was invited by MIT to give the commencement address as the father of an honors student representative. Before connecting through to you, I had been reminiscing about the past with the director whom I worked for before retirement. Modern medicine has contributed to the increase in life expectancy and health improvements. He had been your mother’s advisor. Now at the ripe old age of eighty-eight, he was still active in the profession.\n “I will bring up your first design for live demonstration.” I chuckled.\n “It wasn’t very sophisticated though . . . ” You sounded nervous.\n “Don’t worry. You should be proud of everything you’ve done.” I reassured you.\n At that very moment, with a loud bang, the right-hand engine exploded. The plane started plummeting.\n The smile froze on your face.\n “Dad, what’s going on?”\n “Nothing. Some rowdy kids throwing a tantrum.” I waved my hands. It was spinning like hell in the cabin. An electric pen flew from the front row and hit me in the face. Blood oozed out. You couldn’t see any of it, because I launched a video correction program in the telecommunication process the moment the engine collapsed. Soon, the accident would be all over the news. But for now, I wanted to safeguard this happy moment before you and me.\n “Do you still remember, when you said to me, that there is nothing dream architects can’t do?” I clutched my seat and pressed the oxygen mask against my face. “I intend to examine this very topic the day after tomorrow because, truth be told, I disagree.” Someone was crying. The ejection system had failed. Our last hope was gone.\n “I do remember. We argued about it too. You even made appeals to the finality of death but, of course, we are already reassessing that notion.” You had resumed your composure and started outlining what the old man had just been telling me about: uploading consciousness, digital personhood, immortality.\n You looked proud—the way I was when I was younger. All our arguments in the past had exhausted me. We had never been able to persuade each other.\n Yet, despite our opposing beliefs, both of us made plenty progress. And, to be completely honest, judging from the series of projects that had put you where you were, your contribution had been more remarkable.\n So, I told you that I had good reasons, which I only needed time to articulate, and that we should talk when I got off the plane.\n “Sure, I will see you tonight at the airport. I made roasted sunflower seeds for you, seasoned with Chinese five spices.”\n “You know me best, dear daughter. I will see you later.”\n As soon as I ended the call, the cabin ripped open. My seat frame snapped in an instant and threw me into the wild blue yonder.\n Earth expanded beneath me. Forty-one years ago, I had experienced the agony of a high-altitude plunge in virtual reality.\n Yet, at this moment, I was unfazed—not only because I’d activated the compulsory tranquilizer procedure, but also because I finally knew how to deliver my counterargument to you.\n You talked about using the distribution of computational resources to change the scale of time in virtual reality. I had often done it myself to be more efficient in learning new things. Now, as I was passing through a cloud, I switched my brain, again, to the virtual reality mode, which isolated the world of illusions from that of reality. I had about three days before I hit the ground.\n When I left Horizon, the director had promised me free access to partial services as a former employee benefit. I entered my custom virtual space and raked through the data I’d saved here. First, memories of the Tomb-Sweeping Day that I exchanged for twenty thousand dollars. Then, the night of fireworks I shared with you. They took two of the three days I had. This is the final luxury of my life.\n At last, I arrived at the final day.\n Many years ago, I told you that your mother died from a car crash just as your classmate’s mother did.\n I am sorry, my daughter, to protect your dream I lied to you.\n Because she too lived for a dream and died from its calling.\n The Red Locust Virus was released by a notorious cyberterrorist group. It took six million lives upon outbreak and is now remembered as the Red Locust Incident.\n The government had preventively detained the group’s leadership but found itself in a stalemate because they had encrypted their brain. The tragedy unfurled as they planned. I won’t continue speaking of this period as if I were documenting it—our own family were casualties of the attack.\n I don’t work in security, and don’t know how the virus invaded the process dispatcher. I have only learned from a pop science article widely circulated on the Internet that the Red Locust is a variant of the historic computer worm. Once it invades an information system, the virus continues self-replicating until it eats all the system resources.\n You mother sacrificed her life battling the virus. The NGO she founded was the first to endeavor to crack it.\n One day, a boy was sent to the tent she oversaw.\n I was at work when it went down. So, I only learned about what happened in the virtual world by looking at 3D visuals afterward. At the start of the eighteen hours, she connected into the boy’s consciousness. There, the virus manifested as red locusts. She found the fractured kernel of his mind, but it was too late. Their hypothesis for the virus’ structure turned out false, so the shield she had written for herself did not work. No longer able to exit that world, she took the boy with her and ran for their lives.\n When she realized that running was futile, she stopped, reallocated their remaining brain resources, so she could adjust the scale of time. She managed to gain five virtual years for the boy and gave her all to create, for him, a world that was practically identical to the real one.\n Because it is impossible to achieve the same scale here, I can only recreate their last day. It was a sunny morning, and the boy turned eighteen. She attended as his mother. When the party ended, the boy—long been aware of how this chapter would end—waved his hands and erased the phantasm. Locusts hopped onto the dining table. She walked over to him. They embraced each other.\n Finally, the images disappeared. A vicious red overtook the screen. I stood in another space-time, a handwritten last will clutched in my fist.\n “Take care of our daughter.” It was the night before your birthday party. You mother was sobbing at the cusp of dawn.\n “I am sorry.”\n “It’s alright.”\n At the end of the audio track, I heard your mother’s last words.\n Then, blood poured out of ruptured cerebral arteries and quenched the spirit in the boy.\n A few seconds later, the same fate dawned on her.\n At last, my panorama of the past ended. There are seventy minutes left.\n So, with the rest of my time, I am writing down this commencement address, in hopes that you’d speak on my behalf at the ceremony.\n By now you probably know that there are things dream architects can’t do. I could not hold back your mother, just as she could not save the boy from the tragedy. And you cannot stop me from plummeting three thousand kilometers away.\n Humans will always be fragile. Despite advancements in science and technology, despite the fact that we have become omnipotent in the virtual world and capable of creating universes to our liking, when we return to reality and confront our destiny, as individuals we remain isolated points in the vector space—grains of sand in a sea of stars. The director was well-attuned to the fact that humans outlive machines by a long stretch. In the foreseeable future, still more challenges will rise against the digital immortality technology you envisioned.\n Yet, humans are also strong, because we have lived experiences and can use them to endure what fate has in store. Our emotions, memories, our material and spiritual yearnings—they enable lonesome individuals to continue traveling and set civilizations in constant motion.\n My scarce few words may fail to compel you, so I am leaving these three files in your custody too. When you give the address, remember to change the personal pronouns.\n My daughter, I am sorry I cannot stay with you and see the day your dream comes true.\n But I believe in you.\n I love you.\n Originally published in Chinese in the 2017 Science Writers Hunting Project (Ranked as Outstanding).\n Translated and published in partnership with Storycom.\n Arthur Liu (杨枫) is a Chinese SFF writer & translator based in Beijing. His works have been published in Science Fiction World, Non-Exist, and SF Stave, among other Chinese SF magazines. As a computer engineer, he founded the Chinese Science Fiction Database, serving as its chief architect. He wishes to be a cyber crawler."}