{"fingerprint": "3AiAgh0yasTi94OiH2ACbJG9c3E=", "sitename": "Clarkesworld Magazine", "title": "Yuanyuan's Bubbles by Liu Cixin, translated by Carmen Yiling Yan", "author": "Liu Cixin; Carmen Yiling Yan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/liu_12_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Yuanyuan's Bubbles by Liu Cixin, translated by Carmen Yiling Yan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7310 words, short story\n Yuanyuan's Bubbles\n 1\n Many people become enraptured by something or other from the moment of their births, as if they came into the world just for the delight of its company. In this way did Yuanyuan become enraptured by soap bubbles.\n Yuanyuan was born with an apathetic expression on her face. She even seemed to cry as if she were discharging an obligation. The world was disappointing her greatly, it appeared.\n Until, at five months old, she saw soap bubbles for the first time.\n Immediately, she began to wave and kick in her mama’s lap, her little eyes alight with a radiance that outshone the sun and stars, as if this was the first time she had truly seen the world.\n It was noon in the northwest of China, many months since the last rain. Outside the window, the sun-scorched city billowed with dust. In this world of abnormal drought, the gorgeous apparitions of water drifting through the air were truly creatures of utmost beauty. That his little daughter could recognize their beauty gladdened Baba, who’d blown the bubbles for her. Mama, who was holding her, was very happy too. She had waived her remaining month of maternity leave; the next day, she would return to her lab for work.\n 2\n Time passed. Yuanyuan entered the big kid class of preschool, and she still loved bubbles.\n This Sunday, she was on an outing with Baba. She had a little bottle of bubble fluid in her pocket: Baba promised he’d have Mama take her up on her airplane to blow bubbles. This wasn’t play-pretend; they really did go to the crude airfield on the city outskirts. The plane Mama used for her aerial seeding research was parked there.\n Yuanyuan was quite disappointed. It was a battered agricultural biplane, probably from the Soviet days. Yuanyuan thought it must have been built out of old wood planks, like the hunter’s hut in the forest from fairy tales. She doubted it could fly at all. But even so, this shabby plane was off limits to Yuanyuan, according to Mama.\n “Today’s her birthday!” said Baba. “You’re already working overtime here instead of at home with her. At least let her ride on the plane. Give her some fun and excitement!”\n “What fun and excitement? She weighs so much already. How many tree seeds will I have to leave on the ground?” Mama said, hauling another heavy plastic sack into the cargo hold.\n Yuanyuan didn’t think she was all that heavy. She screwed her face up and wailed. Mama hurried over to comfort her daughter, taking a strange object out of one of the big plastic tarp sacks on the ground. It was about the same size and shape as a carrot, pointy-headed and streamlined behind it, with a pair of cardboard tail fins stuck on its butt. It looked like a little airplane bomb, only transparent.\n This might be fun. Yuanyuan reached out and touched it, only to immediately draw back: it was made of ice.\n Mama pointed to a black speck at the center of the little bomb. She told Yuanyuan that it was a tree seed. “The plane drops these ice bombs from way high up, and when they fall to the ground, they stick into the soil. When spring comes, the ice melts. The water it forms helps the seed sprout and grow. If we drop lots and lots of these ice bombs, the desert will become green, and the sand won’t blow into Yuanyuan’s face anymore when she plays outside. Mama’s research project will double the aerial afforestation survival rate in the Northwest drought areas—”\n “What does a kid know about survival rates? Sheesh. Yuanyuan, let’s go!” Baba picked Yuanyuan up and marched off. Mama didn’t try to keep them, only quickly cupped her daughter’s face in her hands one quick last time.\n Yuanyuan could feel that Mama’s hands were much rougher than Baba’s.\n From Baba’s shoulder, Yuanyuan saw the “hunter’s hut” take to the air with a rumble of engines. She blew a string of bubbles toward the plane and watched it disappear into the sandy ether.\n Baba carried Yuanyuan out of the airfield to the roadside bus station. As they waited for a bus back into the city, she suddenly felt Baba shiver.\n “Baba, are you cold?”\n “No . . . Yuanyuan, didn’t you hear something just then?”\n “Hmm . . . I don’t think so.”\n But Baba had heard it. There had been a low explosion, far off in the direction the plane had been flying, so distant that perhaps he registered it with a sixth sense. He jerked his head around to look back the way they’d come. In front of him and his daughter, the drought lands of the Northwest stared pitilessly toward the vault of heaven above.\n 3\n Time flew onward. Yuanyuan entered elementary school, and she still loved bubbles.\n She and Baba visited Mama’s grave on Qingming Festival. Like always, she’d brought along her bottle of bubble fluid. As Baba set his flowers in front of the plain tombstone, Yuanyuan blew out a string of bubbles. Baba would have erupted, but her next words left his eyes wet with tears.\n “Mama will see them!” Yuanyuan said, pointing at the bubbles floating past the gravestone.\n “Child,” Baba said as he hugged Yuanyuan, “you have to grow up to be like your mother, with her sense of duty and mission, with a high-minded purpose like hers!”\n “I already have a high-minded purpose!” Yuanyuan yelled.\n “Tell it to Baba?”\n “Blow—” Yuanyuan pointed at her bubbles, already flown far into the distance—“big—biiiig—bubbles!”\n Baba smiled sadly, shaking his head, and led his daughter away. They weren’t far from where the plane had crashed a few years ago. That year, the seeds in the ice bombs dropped from the sky really did survive, growing into saplings, but the final victor had still been the endless drought. The aerially seeded forest had died to the last tree in the dry, rainless second year. Desertification marched inexorably onward.\n Baba turned to look back. The setting sun stretched a long shadow behind the gravestone. The bubbles Yuanyuan had blown were all gone now, like the dreams of the woman in the grave, like the beautiful delusion of the Western Development Project.\n 4\n Time flew onward. Yuanyuan entered middle school, and she still loved bubbles.\n Today, Yuanyuan’s young homeroom teacher had come for a home visit. She handed Baba a flashy, novel-looking toy gun. The physics teacher had confiscated it from Yuanyuan for playing during class, she explained. The gun had a fat barrel and a ring like an antenna loop attached to the muzzle. Baba turned it over in his hands, puzzled as to its appeal.\n “It’s a bubble gun,” said the homeroom teacher, taking it and pulling the trigger. With a low whirr, a long string of soap bubbles shot from the small ring on the muzzle.\n The teacher told Baba that Yuanyuan’s grades were always the best in her year. Her biggest strength was her robust sense of creativity; the teacher had never seen such a lively-minded student before. He should cherish this seedling, she told him.\n “Don’t you feel that the child is a bit . . . how do I say this, a bit effervescent?” Baba asked, hefting the bubble gun.\n “Hey, all the kids today are like that. Quite honestly, in this new era, being on the light and airy side isn’t necessarily a flaw.”\n Baba sighed, cutting off the conversation with a wave of the bubble gun. He didn’t think he and the homeroom teacher had much to say to each other. She was barely more than a child herself.\n Once he saw the homeroom teacher off, leaving just the two of them, Baba decided to have a talk with Yuanyuan about the bubble gun. But immediately he encountered a new source of displeasure.\n “You bought another one?” he said, pointing to the cell phone hanging from Yuanyuan’s neck. “But you already got a new one this year!”\n “No I didn’t, Baba, I only changed the case! See, it keeps things fresh for me.” Yuanyuan took out a flat box as she spoke. Baba opened it, revealing a row of colorful rectangles. At first glance, he thought they were a set of paints. Only upon further examination did he discover that they were twelve cell phone cases in twelve different colors.\n Baba shook his head and set the box aside. “I wanted to talk to you about this . . . tendency.”\n Yuanyuan spotted the bubble gun in his hand and snatched it over. “Baba, I promise I won’t bring it to school again!” She shot a string of bubbles at him.\n “That’s not what I wanted to talk about. The problem goes far deeper than that. Yuanyuan, look, you’re a big girl now, and yet you still like to blow soap bubbles—”\n “Is that wrong?”\n “Oh, no, there’s nothing wrong with that in and of itself. It’s just that, like I said, your fondness reflects a certain, hmm, mental tendency.”\n Yuanyuan stared blankly at her father.\n “It demonstrates your tendency to chase after pretty, novel, superficial things. You easily lose yourself in mirages. Being so ungrounded in reality will lead you in the wrong direction in life.”\n Yuanyuan looked at the soap bubbles filling the room, seeming even more puzzled. The bubbles swam tranquilly in the air like a school of transparent goldfish.\n “Baba, let’s talk about something more interesting!” Yuanyuan leaned against Baba’s shoulder and adopted a confidential tone of voice. “Do you think our homeroom teacher is pretty?”\n “I didn’t notice . . . Yuanyuan, what I was saying was—”\n “She’s totally gorgeous!”\n “I guess . . . I was about to say that—”\n “Baba, you have to have noticed the way she looked at you just then, when you were talking. She was really into you!”\n “Child, I swear, can’t you leave off thinking about these silly things?” Baba irritably peeled his daughter’s hand off his shoulder.\n Yuanyuan sighed dramatically. “Oh, Baba, you’ve turned into one of those people who are grumpy about everything. What’s the point of living if you never have anything new or interesting or exciting? You should be embarrassed, trying to be a life coach for other people.”\n A soap bubble drifted in front of Baba’s face, then burst. He felt a puff of moist air, almost impossibly faint, and yet the ephemeral little misty drizzle granted him a moment of bliss. It made him think of his distant southern homeland, of all things. He sighed imperceptibly.\n “When I was young, I chased after fantasies too. Your mother and I came here from Shanghai, so naive as to think that the Northwest would be a place where we could show the world our worth. In an unimaginably short time, we architects raised an entire, brand-new city out of the wasteland. We thought it would be our life’s achievement. After we left this world, this city would stand as proof that we didn’t live our lives in vain. Who could have imagined that we’d devoted our best years, and even our very lives, to nothing more than a soap bubble?\n Yuanyuan was astonished. “What do you mean, Silk Road City is a soap bubble? It’s right here, rock solid. There’s no way it’s going to vanish with a pop, right?”\n “It’s about to disappear. The central government has approved the province’s report and suspended all new projects to divert water to Silk Road City.”\n “Do they want us to die of thirst? The taps only work once every two days already, an hour and a half each time!”\n “They’re working out a ten-year evacuation plan right now. The entire city will be dismantled and relocated. Silk Road City will be the first city in today’s world to disappear due to water shortages, a modern Loulan . . . In truth, the entire Western Development Project that once had us aflame with passion has already devolved into a nightmarish Western Mining Project. Who knows, that might be an ever bigger soap bubble.”\n “Wow, that’s great!” Yuanyuan cheered. “We should have left this place ages ago! It’s so boring here, I really can’t stand it! Let’s move! Move to a brand new place and start a brand new life! It’s going to be amazing, Baba!”\n Baba looked at his daughter silently, then stood and walked to the window. He gazed dumbly outside at the city amid yellow sand. His drooping shoulders made his silhouette suddenly appear much older.\n “Baba,” Yuanyuan called softly, but her father didn’t respond.\n Two days later, Yuanyuan’s father took office as the last mayor of the fading city.\n 5\n Yuanyuan got second place in science on her province’s college entry examinations. Baba, truly overjoyed in a way that he rarely was, magnanimously asked his daughter if she had anything she wanted as a reward, even something absurd. Yuanyuan stuck her open hand, fingers spread, in his direction.\n “Five . . . five of what?”\n “Five bars of Diao brand clear soap.” She stuck out her other hand. “Ten bags of Tide laundry powder.” She flipped her hands over. “Twenty bottles of White Cat dish detergent.” Last, she took out a piece of paper. “Most importantly, I need these chemicals. Buy them in the amounts I listed.”\n Getting the chemicals took work on her father’s part. He had to ask a bureau deputy director going on a business trip to Beijing, who spent a whole day finding them all.\n Once she had everything, Yuanyuan holed herself up in the bathroom for three busy days, filling a big washtub with some sort of liquid whose smell permeated into every room in the house. The fourth day, two classmates came over to deliver a custom-made hoop object more than a meter in diameter, shaped from a long piece of metal pipe pricked with small holes.\n The fifth day started with a group of visitors. There were two cameramen from different news stations, and the mayor recognized an attractive lady as the hostess of an entertainment program on the provincial channel. There were also two garishly dressed fellows calling themselves adjudicators from the China branch of Guinness World Records, flown in from Shanghai the previous day. One of them said in a hoarse voice, “Mr. Mayor, your daughter—” he broke off, coughing. “The air’s awfully dry here. Your daughter is about to set a world record!”\n The mayor followed the others onto the apartment building’s flat rooftop, where he found his daughter and several of her classmates already there. Yuanyuan was carrying the big hoop. The washtub stood in front of them, filled with the liquid she’d mixed. The two adjudicators went to work erecting two posts with unit markings along their length. Only later did the mayor learn that they were used for measuring the diameter of soap bubbles.\n Once the preparations were done, Yuanyuan dipped the hoop into the washtub. When she lifted it out, it was filmed with bubble fluid. She carefully fastened the hoop to the end of a long pole, walked to the building’s edge, and waved the pole so that the hoop drew a wide circle in the air, blowing an enormous soap bubble. The bubble shimmered and undulated in midair as if it were dancing. Later, he learned that it was an incredible 4.6 meters in diameter, breaking the Guinness world record of 3.9 meters previously held by Kaj Loos of Belgium.\n “The composition of the bubble mixture is important, but the real trick is in this hoop,” Yuanyuan said in response to the TV hostess’s questions. “The guy from Belgium used an ordinary hoop to blow his bubble, while mine was made by drilling holes along the length of a piece of metal pipe, then bending it into a circle. The pipe is filled with bubble fluid, and as the big bubble forms, the fluid continuously seeps from the little holes, so that as much fluid is available to the bubble as possible. That naturally allows me to blow bigger bubbles.”\n “Then, do you think you can blow even bigger bubbles in the future?” asked the hostess.\n “Of course! It would take research into several important factors in bubble formation, including viscosity, malleability, rate of evaporation, and surface tension. For forming super-big bubbles, the last two need the most work. Rate of evaporation needs to be lowered, since evaporation is the main reason why bubbles burst. As for surface tension . . . do you know why you can’t blow bubbles with pure water?”\n “Because the surface tension is too small?”\n “It’s actually the opposite. The surface tension of pure water is too high to trap air. For my next question, what’s the relationship between a bubble’s surface tension and its diameter?”\n “Well, from what you’ve said, the smaller the surface tension, the larger the bubble?”\n “Nope! Once the bubble is formed, as the bubble increases in size, it actually needs higher surface tension to maintain its walls. You can see the problem here: the surface tension of a fluid is fixed. In that case, if we want to blow really big bubbles, what problem do we need to solve?”\n The hostess shook her head, lost. She was the type hired more for charisma and ease with words than for deeper comprehension. Yuanyuan seemed to realize this. “Never mind, let’s blow some more big bubbles for our audience!”\n And thus, several more four- and five-meter bubbles drifted in the wind high above the city. In this dry, dust-suffused world, they seemed terribly surreal, like mirages of another world.\n One week later, Yuanyuan left the Northwest city of her birth and childhood for the best school of engineering in the country. She was studying nanoscience.\n 6\n Time flew ever onward, but Yuanyuan didn’t blow soap bubbles anymore.\n Yuanyuan completed her bachelor’s degree, master’s degree, and doctorate, upon which she built a business with a speed that dizzied her father. Using a technique from her doctorate thesis as a starting point, she invented a new type of solar cell that could be manufactured at a tiny fraction of the cost of traditional monocrystalline silicon cells and adhered in mosaic fashion to completely cover the surface of a building. In just a few years, her business grew to hold assets in the hundred million range, one of the wildly successful entrepreneurships whisked along by the Nanotech East Wind.\n Yuanyuan’s father thus found himself in an awkward situation. In terms of career success, the daughter was now a higher authority than the father. It looked like Yuanyuan’s homeroom teacher from back then was right: being on the light and airy side in thinking and personality wasn’t necessarily a flaw. This was an era to make his generation grit their teeth. Success nowadays took overwhelming creative thinking; experience, hard work, a sense of purpose, and so on were no longer decisive factors. Moreover, single-mindedness and solemnity now looked like foolishness.\n “I haven’t felt this way in a long time,” said the mayor to his daughter, standing on the broad exit terrace in front of the National Center for the Performing Arts. “That was the best performance I’ve ever heard. The singers really were better than the big three of the olden days.”\n Yuanyuan knew that opera was one of her father’s few pleasures. She’d taken advantage of his business trip to Beijing to invite him to hear a performance by the world’s three best tenors of the new generation, given in honor of the impending Olympics.\n “I’d have bought the best seats in the house if I’d known. I was afraid you’d call me profligate again, so I just bought two medium-range seats.”\n “How much did they cost?” Baba asked offhandedly.\n “They were much cheaper than before. I think they were 28,000 yuan each.”\n “Ah . . . wait, what?!”\n Seeing her father’s wide-eyed, slack-jawed expression, Yuanyuan laughed. “If they made you feel in a way you haven’t for a long time, even 28,000 yuan was worth it. Look at this performance center. Why would the government have invested billions in it, if not to help people achieve or recover some kind of emotion through art?”\n “Maybe you’re right, but I still hope you can spend your money in more meaningful ways. Yuanyuan, I want to talk to you about something related to Silk Road City. Can you invest in one of its municipal projects?”\n “What is it?”\n “We want to build a large-scale water treatment plant. It’ll raise the city’s water recycling efficiency by an enormous amount. In addition, it will use solar power to desalinate water from the salt lakes. If this system can be realized, Silk Road City will be able to survive on a reduced scale. It won’t have to disappear entirely.”\n “How much will it cost?”\n “By our preliminary plans, about 1.6 billion yuan. We have sources for most of the required funds already, but we can’t get our hands on the money for a long time. I’m afraid it might be too late by then. That’s why we need you to make an initial investment of about a hundred million.”\n “Baba, I can’t. That’s all the liquid assets I have right now, and I wanted to use them for a research project—”\n Father raised a hand to break off his daughter’s words. “Never mind, then. Yuanyuan, I don’t want to hurt your business one bit. To be honest, I hadn’t wanted to ask you in the first place. Your investment would break even, guaranteed, but the profit would be miniscule.”\n “Hah, I wasn’t thinking about that, Baba. My project would be even worse. Never mind profit, there’s no way it would even earn back the investment!”\n “Are you doing theoretical research?”\n “No, but it’s not practical research, either. I’m doing it for the fun.”\n “ . . . ”\n “I’m going to develop a super-surfactant. I’ve come up with the name already, FlySol. Its viscosity and elasticity will be orders of magnitudes better than any liquid existing, and its rate of evaporation will be just a fraction of a percent of glycerin’s. And this surfactant will have a special superpower—its surface tension will change depending on the thickness of the liquid layer and the surface’s degree of curvature, anywhere between one hundredth and ten thousand times the surface tension of water.”\n “What is it for?” asked Father in horror. He already knew the answer, but he was afraid to believe it.\n The young multi-millionaire put an arm around her father’s shoulder. “To blow—big—biiiig—bubbles!”\n “You’re joking, right?”\n Yuanyuan looked at the lights of Chang’an Avenue, silent for a long time. “Who knows? Maybe my entire life is a big joke. But, Baba, I don’t think there’s anything wrong with that. For a person to use their entire life for a joke is a sort of purpose too.”\n “Spending a hundred million yuan blowing bubbles? Is there any point?” her father spoke as if he were in a dream.\n “There’s no point. It’s fun, that’s all. I’ve got to say, though, compared to the city your generation spent tens of billions building, only to have to tear it down, my extravagance doesn’t amount to much.”\n “But you can save the city right this moment! It’s your city too. You were born there. You grew up there. But you’re using that money to blow soap bubbles! You’re—you’re really too selfish!”\n “I’m living my own life. Selfless sacrifice isn’t always enough to change the path of history. Your own city proves it!”\n Father and daughter remained in silence until Yuanyuan steered their car onto Chang’an Avenue.\n “I’m sorry, Baba,” Yuanyuan said softly.\n “These days, I keep remembering the past, leading you by your tiny little hand. It was such a wonderful time.” In the light, Father’s eyes glimmered, as if damp.\n “I know I’ve disappointed you. You always wanted me to be someone like Mama. If I could live two lifetimes, I’d use one of them to do what you want, give everything for duty and mission. But, Baba, I only have this one life.”\n Father didn’t reply. Near the end of the silent drive, Yuanyuan took out a large envelope and handed it to him.\n “What is it?” Father asked, uncomprehending.\n “Housing deeds and a key. I bought you a villa by Lake Tai. You’ll be able to go back to the south after you retire.”\n Father gently slid the envelope back in her direction. “No, child, I’m going to live out the rest of my life in what remains of Silk Road City. Your mother and I have buried our youth and dreams there. I can’t leave.”\n Beijing glittered to its heart’s content in the summer night. Gazing at the gorgeous sea of lights, Yuanyuan and her father both thought of soap bubbles. What was this boundless radiance trying to show to them: the weight of a life, or the weightlessness?\n 7\n One day, two years later, the mayor received a call in his office from his daughter.\n “Happy birthday, Baba!”\n “Ha, Yuanyuan, is that you? Where are you?”\n “Not far from where you are. I’ve brought a birthday present!”\n “Hey, it’s been years since I remembered my birthday. Come home at noon, then. It’s been a month since I’ve gone home myself. There’s just the housekeeper there to keep an eye on things.”\n “No, I’ll give you the gift right now!”\n “I’m at work. The weekly city council meeting’s about to start.”\n “Not a problem! Open the window and look up!”\n The sky today was clear in every direction, a limpid blue, rare weather for the area. The rumble of an engine came from the air; the mayor saw that an airplane was slowly circling in the sky above the city, striking against the blue backdrop.\n “Baba, I’m on the plane right now!” Yuanyuan shouted through the phone.\n It was an old-fashioned, propeller-driven biplane. In the sky, it looked like a giant bird gliding lazily. Time flashed backward; a familiar sensation struck the mayor like lightning. He shivered all over, as he had done twenty years ago. His daughter had asked him if he was cold.\n “Yuanyuan, what—what are you doing?”\n “Here’s the gift, Baba, pay attention to the bottom of the plane!”\n The mayor had noticed earlier that a big hoop hung from the body of the plane. Its diameter was greater than the length of the plane; clearly, it had unfolded into position only after the plane took to the air. Taken together, the plane and the hoop looked like a flying ring. Later, he’d learn that the hoop was constructed like the one Yuanyuan had used to break the Guinness World Record, made of a tube of lightweight metal filled with the nigh-supernatural FlySol. A film of FlySol stretched across the hoop, and innumerable small holes allowed FlySol to continuously flow out of the thin tube that formed the hoop.\n An astounding sight appeared. Behind the giant hoop, a bubble was emerging! Refracting sunlight, its form wavered at the edge of visibility. The bubble swelled rapidly; soon, the plane compared to it was only a sesame seed on top of a transparent watermelon.\n In the marketplace below, everyone had stopped to look up. People were starting to run out of the city government headquarters building to watch.\n The plane circled slowly above the city, tugging the enormous bubble behind it. The bubble had slowed in its growth, but not completely. Gradually, it came to occupy half the sky. At last, it broke loose from the hoop beneath the airplane, floating independently in the air.\n “This is my present, Baba!” Yuanyuan shouted excitedly through the phone.\n Huge patches of light shimmered in the blue heavens, as if the entire sky were a slick piece of cellophane being crinkled by invisible hands under the sun. On close inspection, the flashes of light delineated an enormous, transparent sphere that took up most of the sky. The people below had to turn their heads nearly one hundred and eighty degrees to see it in its entirety. It looked as if the mirror of heaven were casting a crystalline reflection of the Earth below.\n The city began to grow agitated. Traffic jams formed in the thoroughfares.\n The enormous bubble slowly descended from the sky. Once it was at a sufficiently low altitude, the people below could even see the city’s skyscrapers mirrored on the bubble’s surface; as it undulated in the wind, the buildings twisted and distorted, like a kelp forest under the sea. The broad bubble membrane pressed down inexorably. People instinctively shielded their heads with their arms. When the bubble touched the ground, those exposed outside felt a brief itch on their faces as their bodies passed through the membrane.\n The bubble hadn’t popped. Instead, it had formed a spherical dome nearly ten kilometers in diameter with the ground. The city and the surrounding industrial plants were now trapped in the bubble!\n “It wasn’t on purpose, it really wasn’t!” Yuanyuan said into the camera. “Under normal conditions, the bubble would have floated away in the breeze. Who knew today’s wind would be so much weaker than usual? That’s why it fell and covered the city!”\n The mayor watched the emergency report, which had interrupted the city television station’s normal programming. He saw that his daughter was wearing a leather aviation jacket, open at the front to reveal a blue work uniform underneath. Beneath her was the old-fashioned biplane . . . time flashed backward again. So alike, they look so alike . . . the mayor’s heart melted, tears spilling from his eyes.\n Two hours later, the mayor and the newly established emergency team drove to the bubble wall at the city outskirts. Yuanyuan and several of her engineers were there, well ahead of them.\n “Baba, isn’t my superbubble amazing?” Yuanyuan had lost her earlier panic, her face alight with inappropriate excitement.\n The mayor paid no mind to his daughter, raising his head to consider the bubble’s surface. The vast sheet of membrane shimmered in rainbow colors under sunlight, intricate patterns of diffraction on its surface shifting and morphing hypnotically in a bewitching sea of all the universe’s colors. The membrane was transparent, so that the outside world seen through it was coated with a layer of iridescence too. A certain distance up, the iridescence disappeared; from the air, it would be impossible to see the membrane.\n The mayor reached out a hand and carefully touched the superbubble. The back of his hand itched, very faintly: it was already on the other side of the bubble. The membrane might only be a few molecules thick. He drew his hand back through; the membrane instantaneously returned to its original form. The pattern of iridescence there was unchanged, as if it had never been interrupted.\n The others also began to touch the membrane, then waved their hands in an attempt to tear it, then at last devolved into flailing punches and kicks . . . but none of it made a difference to the membrane. Every assault passed through the bubble without resistance, after which the membrane restored itself perfectly. With a wave of his hand, the mayor halted everyone’s futile efforts. He then pointed to the highway in the distance; the others saw that the traffic on the highway was passing through the membrane undisrupted, even at their high speeds.\n “It’s like a soap bubble membrane: solid objects can pass through, but not air,” said Yuanyuan.\n “Air not being able to pass through is the problem. The air quality in the city is rapidly deteriorating,” the mayor said, glaring at his daughter.\n Everyone looked up and saw that an enormous white dome-shaped cap had appeared in the sky above the city. The membrane was trapping the smoke from the city and industrial plants in the mold of the superbubble. If one were to observe the city from a distance right now, perhaps they’d be seeing a towering hemisphere of milky white.\n “We may need to shut down the power plant and the chemical plant to slow down the rate of pollutant release,” said the leader of the emergency team. “But the most serious problem is the rising temperatures inside the bubble. Right now, the city is effectively inside a sealed greenhouse without air exchange with the outside world. It’s the middle of summer, and the heat from the sun is building up quickly. According to our calculations, the temperature inside the bubble will eventually peak at sixty degrees Celsius!”\n “Up to now, what methods have we tried for destroying the superbubble?” asked the mayor.\n “An hour earlier, we had army aviation people fly their helicopters through the top of the bubble, trying to use the propellers to tear it open, but it didn’t work,” answered an officer from the local garrison. “Then we set explosives where the bubble met the ground. The explosion only made the bubble ripple a while, without causing any damage. Even more incredibly, the membrane instantaneously extended down into the blast crater, traveling right along the bottom without any gap!”\n “How long will it take for the bubble to burst naturally?” the mayor asked Yuanyuan.\n “Bubble rupture is primarily caused by evaporation of the fluid membrane. This substance has an extremely slow rate of evaporation—even with sunny weather, the bubble will take five or six days to pop,” Yuanyuan answered. To her father’s outrage, she sounded full of pride.\n “Then we’ll have to evacuate everyone,” the leader of the emergency team said, sighing.\n The mayor shook his head. “I won’t take that step until we absolutely have to.”\n “There’s another way,” said an environmental specialist. “Hurry and have a lot of long tubes made, the wider the better. Place the tubes with one end outside the bubble and a high-power ventilation fan on the other end, and we can exchange air with the outside world.”\n “Haha—” Yuanyuan started to laugh, startling everyone around her. Surrounded by angry looks, she was laughing so hard she couldn’t stand upright. “That idea’s—that’s hilarious! Haha—”\n “This is all your fine work!” the mayor thundered. “You’re going to take responsibility and pay back all the losses you’ve caused the city!”\n Yuanyuan looked up at the sky and stopped laughing. “I know, I’ll pay up. But I just thought of a simple way to pop the superbubble—burning. Dig a trench one to two hundred meters long where the bubble meets the ground, pour it full of fuel, then light it. The fire will make the membrane evaporate much faster. The bubble should burst after about three hours.”\n The mayor ordered the emergency team to do as Yuanyuan explained. A wall of fire more than a hundred meters long sprung up on the city outskirts. As the row of furious flames licked at the bottom of the superbubble, strange colors and shapes shimmered in the membrane. The patterns of color revealed that the FlySol from other parts of the bubble was rushing over to replace what had evaporated from the fire, as if the portion being burned had become a giant whirlpool, sucking gorgeous, beguiling floods of color from every direction to disappear into the flames. Their black smoke pressed upward along the bubble’s inner surface, gathering into an enormous black hand pressing down, terrifying the millions of city-dwellers within the superbubble.\n Three hours later, the bubble popped. People in the city heard a soft tinkle of breaking in the space between heaven and earth, crisp and clear and echoing for a long time after, as if a string in the instrument of the universe had been very gently plucked.\n “It’s weird, Baba, you didn’t blow your top like I thought you would,” Yuanyuan said. She and her father stood on the roof of the city government headquarter building, watching the superbubble burst.\n “I’ve been considering something . . . Yuanyuan, I’d like you to answer a few questions for me seriously.”\n “About the superbubble?”\n “Yes. I want to know, since the bubble membrane is impermeable to air from the outside, would the superbubble also be able to retain moist air on the inside?”\n “Of course. In fact, toward the end of FlySol’s development, I thought of a possible practical application for the superbubbles: giant greenhouses. They could form miniature climate zones in winter, providing temperature and humidity levels suitable for crop growth over large areas. Of course, that would require longer-lasting bubbles.”\n “The second question: can you make a superbubble float a long way on the wind, for, say, a few thousand kilometers?”\n “Not a problem. Heat from the sun accumulates in the bubble, so the air inside expands and creates buoyancy like a hot air balloon’s. The superbubble today fell only because it was formed too low in altitude, with too weak of a breeze.”\n “The third question: can you ensure that the superbubbles burst after a specific length of time?”\n “That’s doable. We’d only need to adjust the concentration of one of the ingredients to change the solution’s rate of evaporation.”\n “The last question: given enough investment money, can you blow millions, or even billions, of superbubbles?”\n Yuanyuan’s eyes widened in surprise. “Billions? Heavens, what for?”\n “Picture this in your mind: above the faraway sea, countless superbubbles are forming. Propelled by the strong winds of the stratosphere, they’ll set sail on a long journey to ultimately arrive in the sky above northwest China, then burst in unison, scattering the humid ocean air they formed around into our dry air . . . yes, with superbubbles, we can bring in moist air from the seas to the Northwest! In other words, we can bring in rain!”\n Shock and emotion left Yuanyuan speechless for a time. She could only look at her father, stunned.\n “Yuanyuan, you gave me a glorious birthday present. Who knows, today might prove the birthday of the Northwest too!”\n The cool wind of the outside world was blowing over the city. Without the superbubble to confine it, the white dome of smog above was slowly coming apart in the breeze. In the eastern sky, an odd rainbow had appeared. When the superbubble burst, the FlySol in the membrane had scattered into the air to form it.\n 8\n The enormous engineering project to aerially divert water into western China took ten years.\n In these ten years, vast sky-nets were built in China’s southern waters. The nets were constructed from thin tubes covered in tiny holes. Each eye in the net was hundreds, even thousands, of meters in diameter, similar to the hoop that had blown the superbubble ten years ago, and each net had thousands of such apertures.\n There were two types of sky-net: land-mounted and aerial. The land-mounted sky-nets were placed along the coastline, while the aerial sky-nets hung from giant tethered balloons at high altitude, several kilometers above. In the South China Sea and the Bay of Bengal, the sky-nets ran continuously for more than two thousand kilometers along the coast and above the sea, and were nicknamed “The Bubble Wall of China.”\n The day the aerial water diversion system started up for the first time, the thin tubes in the sky-net filled with FlySol, forming a membrane of fluid over each aperture. Strong, moist sea wind blew into the sky-net, forming countless superbubbles, each kilometers in diameter. The bubbles broke loose from the sky-net one after another, rising in droves to higher skies. Ascending into the atmosphere, they followed the air currents onward, even as more bubbles steadily blew forth from the sky-net. Great flocks of superbubbles glided majestically inland, wrapped around the humid air of the seas. They drifted past the Himalaya Mountains, past the Greater Southwest, into the skies of the Northwest. Between the South China Sea and Bay of Bengal, and northwest China, two rivers of bubbles thousands of kilometers long had formed!\n 9\n Two days after the aerial water diversion system began full-scale operation, Yuanyuan flew from the Bay of Bengal to the capital of a Northwest province. When she stepped off the plane, she saw only a round moon suspended in the night sky: the bubbles that had set out from the ocean had yet to arrive. In the city, crowds were out under the moonlight. Yuanyuan got out of the car at the central square, squeezing her way into the crowd too, to wait fervently along with them.\n Even when midnight came, the night sky remained unchanged. The crowd began to disperse as it had the previous two days, but Yuanyuan didn’t leave. She knew the bubbles would arrive tonight for certain. She sat on a bench, at the edge of sleep and wakefulness, when she suddenly heard someone cry out.\n “Heavens, why are there so many moons?”\n Yuanyuan opened her eyes. She really did see a river of moons in the night sky! The countless moons were the reflections in countless massive bubbles. Unlike the real moon, they were all crescents, some curving up and some curving down, all of them so translucent and jewel-like that the real moon seemed plain in comparison. Only by its unchanging location could it be distinguished from the mighty current of moons crossing the sky.\n From that point on, the sky over northwest China became the sky of dreams.\n During the day, the drifting bubbles were hard to see. There were just the reflections off the membranes, everywhere in the blue sky, that made it look like the surface of a lake rippling under the sunlight. On the ground, enormous but faint shadows traced the slow passage of the bubbles. The most beautiful moments were at dawn and dusk, when the rising or setting sun on the horizon would limn the river of bubbles in the sky with radiant gold.\n But these lovely scenes didn’t last for long. The bubbles above popped one after another. More bubbles were rolling in, but clouds were beginning to gather in the sky, obscuring the bubbles.\n Next, in the season that had been driest of all in previous years, a slow, steady drizzle drifted down from the sky.\n Amid the rain, Yuanyuan arrived at the city of her birth. After ten years of evacuation, Silk Road City had become quiet and empty. Unoccupied skyscrapers stood silently in the rain.\n Yuanyuan noticed that these structures hadn’t truly been abandoned; they were well-preserved, the glass in the windows unbroken. The whole city seemed to be deep in slumber, waiting for the day of revival it knew would come.\n The rain tamped down the dust, leaving the air fresh and pleasant. Raindrops tickled deliciously cool on the face. Yuanyuan strolled along streets she knew well, streets through which her father had led her by her small hand countless times, on which countless soap bubbles she’d blown had scattered. A childhood song resounded in Yuanyuan’s heart.\n Suddenly, she realized that she really could hear the song. The sun had set now, and in the city descended into night, only one window shone with light from within. It belonged to the second floor of an ordinary apartment building, her home, and the song came from there.\n Yuanyuan stopped in front of the building. The surroundings were clean and well-kept. There was even a vegetable patch, the plants in it growing heartily. A tool cart stood to one side, fitted with a big metal bucket, clearly used to carry water from elsewhere for the plants. Despite the obscuring darkness, one could sense the breath of life here. In the dead silence of the empty city, it beckoned to Yuanyuan like an oasis in the desert.\n Yuanyuan climbed the well-swept stairs and gently pushed open the door to her home. Her father was reclining on the couch, his hair grizzled under the lamplight, contently humming the old children’s song. He held the little bottle that Yuanyuan had used to carry bubble liquid as a child, and the little plastic hoop, and he was blowing a string of multicolored bubbles.\n Originally published in Chinese in Science Fiction World, 2004.\n Translated and published in partnership with Storycom.\n Liu Cixin is a representative of the new generation of Chinese science fiction authors and recognized as a leading voice in Chinese science fiction. He was awarded the China Galaxy Science Fiction Award for eight consecutive years, from 1999 to 2006 and again in 2010. His representative work The Three-body Problem won the 2015 Hugo Award for Best Novel, finished 3rd in 2015 Campbell Awards, and was a nominee for the 2015 Nebula Award.\n His works have received wide acclaim on account of their powerful atmosphere and brilliant imagination. Liu Cixin's stories successfully combine the exceedingly ephemeral with hard reality, all the while focusing on revealing the essence and aesthetics of science. He has endeavoured to create a distinctly Chinese style of science fiction. Liu Cixin is a member of the China Science Writers' Association and the Shanxi Writers' Association.\n Born in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest."}