{"fingerprint": "5enpyT2cblc9woU1dnE3nXY13A4=", "sitename": "Clarkesworld Magazine", "title": "A Thousand Words You Can Hear All at Once: An Interview with Todd Lockwood by Nayad A. Monroe", "author": "Nayad A Monroe", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lockwood_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Thousand Words You Can Hear All at Once: An Interview with Todd Lockwood by Nayad A. Monroe", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nA Thousand Words You Can Hear All at Once: An Interview with Todd Lockwood\nTodd Lockwood’s illustration work has appeared on NY Times best-selling novels, magazines, video games, collectible card games, and fantasy role-playing games. It has been honored with multiple appearances in Spectrum and the Communication Arts Illustration Annual, and with numerous industry awards. Always known for the narrative power of his paintings, Todd now turns his hand to writing, and is working on a novel to be published by DAW Books. You may view his art at his website, toddlockwood.com, keep up with him at tolo.biz, or get chummy at facebook.com/artoftoddlockwood.\nIn the bio on your website, you say that the artists who have influenced you most are Michael Whelan, Frank Frazetta, NC Wyeth, Walt Disney, Spike Jones, Brom, Jeff Easley, and your dad. What are some of the characteristics you enjoy in their work? Have you tried to incorporate methods they use to create their images?\nWell, I think it’s safe to say that Frazetta and Whelan between them probably influenced most of the artists in this industry to one degree or another. I kind of view them as the left brain and right brain. Michael’s very thoughtful and cerebral. His paintings are always really deep, and you can think about them forever, whereas Frank Frazetta is raw emotion. There was a documentary made about him called Painting with Fire, which describes it really well. If I could blend the two of them together somehow I’d feel like I had accomplished something.\nNC Wyeth is the father of modern illustration and we all grew up with Walt Disney. One of my earliest memories is Maleficent turning into the dragon in Sleeping Beauty. Spike Jones: that’s half a joke, but it’s also true that his music is eclectic and wacky and fun and I enjoy that.\nThen the others: Brom, Jeff Easley, John Foster, Scott Fischer, Greg Manchess, Donato, and a great many more I could come up with who are influential now. There are so many good artists out there, always keeping me on my toes. My dad was an artist, even though he never worked as one. Another one of my earliest memories was sitting on his knee while he drew funny cartoon animals for me.\nWhere do you find inspiration in the real world?\nThat’s a short question with a really broad range of answers. I mean, inspiration is everywhere. I think I’m always looking at things. I always see perspective and light, I think I always have. I also enjoy everything from politics to science to history, and religion—I love Joseph Campbell’s studies. Nature shows: National Geographic, NOVA, all that stuff. It’s all grist. It’s all useful.\nThen you somehow take that stuff and turn it into more outlandish ideas. How does that go?\nI have the benefit most of the time of a manuscript to read, which provides a certain amount of material automatically. Making it look good is a matter of taking advantage of every source of reference possible, and a lot of it’s stuff I enjoy anyway.\nAnimal anatomy figures heavily into making fantastic creatures that are believable, and some knowledge of the history of costume, armor, and weaponry can help when inventing stuff that you’ve never seen in the real world.\nWhen you begin an artistic project for yourself (as opposed to a commissioned piece), how do you decide what you’re going to draw or paint?\nI haven’t done very much for myself. There are three pieces I can think of on my website and they all came to me sort of fully formed, even though they’re really detailed, out of myth and religion. I enjoy reinterpreting that stuff. I’m fascinated by the way human beings relate to their universe, and it all comes out in mythology. Like “Cerberus,” “Kali-Prakriti,” and “War of Angels;” and while they’re really dense with detail, the idea of them is simple\nDo you have emotional themes that you return to frequently in your work?\nI think that’s more in the line of looking for narrative. Often I’m painting action scenes, so there’s always conflict or movement, and the emotion there is the range of stuff you feel in those fight-or-flight moments: anger, fear, determination. I look for some nobility in my people. Every once in a while I get to paint something tender. It’s really a matter of putting yourself into the characters, and bringing out what they feel or finding that inside yourself.\nIs it easy for you to get started on your work for the day?\nIt’s hard for me to get started sometimes. It occasionally involves playing a game of Spaceward Ho! just to empty the brain out. Silly old game, but you can finish in twenty minutes. Especially in the early stages of a piece, it can be challenging. The very first part, the thumbnails, when you’re finding the energy and the direction, is not so difficult, just laying down the basic composition and the ideas. Depending on the job—sometimes that can be really frustrating.\nFor example, C.J. Cherryh’s books, while I enjoy them a great deal and the politics of the world are fascinating, there are a lot of people sitting around drinking tea and talking politics. Sometimes finding a visual hook for those books is a challenge, but it’s always there. Usually I know by a third to halfway through a manuscript what the cover needs to be, partly because I don’t want the cover to give away anything that happens in the second half of the book if I don’t have to. The last cover I did for C.J., Intruder, I didn’t know what the cover was until I’d read the very last page. And of course with my own book, which I’ve been working on for eight years, I still don’t know what the cover is.\nCover Art for Intruder\nHow did you get started with writing fiction, and how is it going?\nWell, I’ve always written, all my life. I learned to draw by making my own comic books. In my mind, I was drawing movies or TV shows. I would have happily gone either way, but art had more momentum. I just happened to fall into art first, and more deeply, but the last eight years, I’ve been working on a personal project and doing seminars and workshops.\nI’ve worked with Nancy Kress, Greg Frost, and some other authors. I had a short story published entitled, “Between”. It came out in an anthology called Tales of the Emerald Serpent, which got good remarks, and was a lot of fun to write. Lou Anders of Pyr books gave me a very nice write-up in a review, and I really appreciate that.\nI have another short story coming out soon in another anthology called Unfettered, which is a really fun project, in that it goes to help a friend, Shawn Speakman. He’s the blogger for suvudu.com, and he’s Terry Brooks’ continuity editor. He runs his own business called The Signed Page, selling signed editions of books, which is how we met. Shawn had two bouts with cancer, and he beat them both, but he was left with humongous bills. Terry Brooks suggested that a short story he had kicking around could be offered online with the proceeds going to help Shawn pay his bills. Other authors have since joined in the benefit anthology which will include stories by Patrick Rothfuss, Robert Jordan & Brandon Sanderson, Jacqueline Carey, Tad Williams, and more.\nI’m very happy with this short story. It’s set in the prehistory of the world of my novel, which I sold to DAW books last Easter. Betsy Wollheim had read it initially just as a friend, to tell me whether it was good or not and if it was good, who I might want to consider offering it to. When she’d read it, she said, “I want it.” So I’m very excited about that because I’m in very good hands. Betsy is a great editor, and she’s a good friend.\nCover art for Tales of the Emerald Serpent\nCover Art for Unfettered\nWhat’s your book called?\nIt’s called The Summer Dragon; it’s the first of a trilogy. I haven’t quite pinned down the trilogy title yet, and of course titles are subject to change, but I think that’s the appropriate title. It’s a young adult fantasy, which began really as anger management during the G.W. Bush years. It became a story that insisted I tell it. You know how it is, because you write. You start with the germ of an idea and suddenly it’s telling itself.\nHow does writing compare to painting?\nEither one of those things is a lifelong process. There are rules to writing, or painting. It’s not the same for everybody. Nancy Kress can’t work from an outline or she loses interest, whereas I have to work from an outline, because that’s the way I work.\nThat’s the way I paint: start with thumbnails, and then you work towards the details. An outline is kind of the same thing in terms of structure. The structure is narrative, narrative rules both illustration and writing. If you’re building a house, you don’t build the walls and then try to put a foundation under them.\nI think writing is much lonelier than painting. You spend a lot of time sitting alone, and feedback is not immediate. You can turn a painting around and ask “What do you think?” and somebody can say, “I like it,” or “It’s too red,” or whatever. To get feedback on a chapter, somebody has to take time out of their day to read it and then get back to you. A picture may be worth a thousand words, but you receive them all at once.\nCover Art for In the Shadow\nNayad Monroe writes science fiction, fantasy, and horror stories. She toiled in the slush mines at Clarkesworld Magazine for three brutal years before her unique combination of cunning, trickery, and\ndeviousness brought her the opportunity to interview innocent people who never dreamed that such a thing could happen to them. She also blogs intermittently and oppresses children and cats in her spare time. You may read her strange pronouncements on Twitter, if you dare, by following @Nayad."}