{"fingerprint": "KR28grMIikOBZNTMmhte+fgB6BY=", "sitename": "Clarkesworld Magazine", "title": "Always a New World: A Conversation with Karen Lord by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lord_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Always a New World: A Conversation with Karen Lord by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAlways a New World: A Conversation with Karen Lord\nA man emerges from the sea with news of death. “Our home is no more,” he says.\nIt’s that simple, at first. Complete catastrophe; total loss. But it’s not the end for the characters in Karen Lord’s The Best of All Possible Worlds. It’s merely the beginning, as the men of a once powerful culture, decimated and humbled, must reach out to people they think of as inferior.\nLord wrote The Best of All Worlds while struggling with a sequel to her award-winning debut, Redemption in Indigo, which was a re-imagining of a Senegalese folktale.\n“Most SF readers detect that Redemption in Indigo is influenced by another literary tradition,” said Lord, who was born in Barbados. “The Best of All Possible Worlds is sci-fi familiar, maybe too familiar, and genre readers will have expectations. I am a West Indian writer; my purpose and my style are different in ways that aren’t always apparent. There will be surprises, but I can’t reliably predict what readers will find unusual.”\nThe situation might be “sci-fi familiar” but Lord’s focus isn’t. More relaxed, but no less moving or eloquent than Redemption, The Best of All Possible Worlds is not a tale of cultures clashing and wars breaking out. The Sadiri and Cygnian cultures do not come together with armies and space ships, guns blazing; they come face to face as individuals trying to comprehend and adapt to new lives.\nThere is Grace Delarua of Cygnus Beta and Dllenahkh from the Sadiri settlement, and they must first understand themselves and their relationship to each other before they can grasp the greater implications of their respective situations.\nThroughout The Best of All Possible Worlds, Lord’s prose is subtle, witty, and vivid. She knows, as the narrator of Redemption might say, how to really “seize the tale.”\n“A rival of mine once complained that my stories begin awkwardly and end untidily,” says the same narrator. “I am willing to admit to many faults, but I will not burden my conscience with that one. All my tales are true, drawn from life, and a life story is not a tidy thing. It is a half-tamed horse that you seize on the run and ride with knees and teeth clenched, and then you regretfully slip off as gently and safely as you can, always wondering if you could have gone a few meters more.”\nWhile the lives of Lord’s characters may be untidy, the writing is anything but. Below, Lord and I talk about travel, writing, and her new novel.\nWhy’d you make us wait so long? Okay, that sounds a wee bit selfish and melodramatic. When did you start working on The Best of All Possible Worlds and what is the story behind the creation of it?\nI started the first draft in summer 2009. I was working on the sequel to Redemption in Indigo (still am, getting close) and had a bit of writer’s block, so I created another world for the purpose of writing exercises. Then I got attached to my new characters, so when the sequel began to get grim and bloody, I could retreat and relax with Delarua and Dllenahkh and the rest. I was thrilled when the manuscript won the 2009 Frank Collymore Award (Redemption in Indigo won the 2008 Colly). I added some tweaks and rewrites after that.\nThe long wait happened because I wanted to have an agent negotiate my second book’s contract. I held onto the manuscript for almost a year before I found Sally Harding of the Cooke Agency. I made the right choice. I’m extremely pleased with the support I’m getting from Sally and her colleagues.\nAnd in what ways did you stretch yourself, artistically, in the writing of The Best of All Possible Worlds?\nI experimented with voice and précis, and I played a bit with time and motifs.\nDelarua’s voice isn’t literary. She loves words and language, film and stage, but she’s not overly elegant when expressing herself in writing. I allowed her a certain level of clichéd speech—uncommon enough to show her wit, but familiar enough to be close to conversational norms. Dllenahkh’s voice is the voice of someone who is suddenly immersed in a foreign language, but by the end he is so comfortable that he can be more colloquial and playful. There are other ways in which his character’s development is revealed in the evolution of his voice, but I don’t want to spoil the story.\nTime—a brief play with non-linear narrative in the first person proved an interesting experiment. Motifs—some symbols are obvious, some are subtle.\nPrécis—I allotted myself a certain number of words and fraction of plot per chapter and I stuck to it. In some ways this book is tighter than Redemption in Indigo and with both books if you skim you’ll miss out. Everything is there because it is meant to be.\nHow do you determine what’s “meant to be”? I guess this is a question about editing but also about . . . instinct?\nPure instinct. You might back up each choice to cut or add with theory and research, and seek justification for that sense of “rightness”, but there’s a point at which writing is more music than maths. You cultivate an ear for it instead of calculating frequencies.\nAs novelist Kate Elliott says, The Best of All Possible Worlds “breaks out of the typical conflict-centered narrative paradigm to examine adaptation, social change, and human relationships.” What’s at the heart of the book for you--what questions did it force you to ask or help you to answer?\nThe book is entirely about the balance of power in relationships between individuals and between groups. The former is illustrated in the interactions between the two main characters, and the latter in the encounter between Sadiri and Cygnian cultures, particularly in the vignettes of the taSadiri diaspora. What makes a culture consider itself superior, and what makes a person believe that they are strong? What happens when the things that you think make you superior and strong are taken away or warped?\nDid you build the cultures and then put them in conflict or did you start with the conflicts and build the culture? How did these to cultures shape each other?\nThat’s a very linear question. As creator of this universe, I don’t have to be linear. I can create a culture with characteristics that will naturally lead to a particular kind of conflict, but I might also desire a particular kind of conflict to occur and go back and add a cultural quirk that will support those consequences. I prefer to start with the culture then tweak until I get the conflicts the plot requires rather than imagine the conflicts then form cultures around that. Conflict as the main inspiration for culture doesn’t sound sustainable or realistic.\nHow much of world-building is about planning and how much is about surprise and spontaneity?\nThat’s not an easy question because not everyone will have the same approach, nor will the same approach work every time. For now I like to start with scaffolding and gradually fill in the gaps, all the while leaving myself open to the creative opportunities provided by surprise and spontaneity.\nWhich of the characters in The Best of All Possible Worlds reveals the most about you?\nI believe Dllenahkh and Lian show most of my personality!\nCan you elaborate on that?\nA non-Barbadian reader commented on Dllenahkh’s speech. “Who talks like that!” Well, I do! Not all the time, but I do, and many of my friends do too. He goes on retreats, meditates, and would rather talk than fight (though he can fight too). He takes the role of mentor seriously but he can sometimes be a little impatient. A lot of my teacher-days are distilled into Dllenahkh’s character.\nLian was my avatar for moments when I wanted to laugh at my characters, disapprove of their actions, or just give them a hug.\nIn what ways (if any) are writing and traveling similar for you? And how are they different?\nThey are similar in that you have to be alert. You’re no longer surrounded by the familiar. You have to observe and analyze, see how things fit together and figure out the unspoken rules. The difference is that with writing you have to pay even more attention because the conscious and unconscious levels of your brain are working to make your created world into something believable and navigable.\nWhat does home look like (and feel like) to a “global nomad”?\nExtremely minimalist! You can’t carry much with you and if you stay any place long enough to accumulate stuff, you’ll have to throw out a lot of it when you move on. To a certain extent, you learn to carry a sense of ‘home’ with you: for example, particular foods, rituals or music you can’t do without. (Please note, food is never a burden to carry and rituals and music weigh little or nothing.)\nCan you expand a little more on the rituals? Are there any writing related rituals? Also, I’d think the imaginary worlds you create would offer a certain stability as you move from place to place.\nI’m constantly reinventing my rituals so I don’t become dependent, but they can be as simple as regular mealtimes and bedtime, exercise, sunlight and conversation with friends.\nI don’t rely on my imaginary worlds for stability! There’s always the next book and a new world.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}