{"fingerprint": "4T+5RrznKMSEpNCnSomx9eXJwik=", "sitename": "Clarkesworld Magazine", "title": "Mother Tongues by S. Qiouyi Lu", "author": "S Qiouyi Lu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/lu_02_19_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mother Tongues by S. Qiouyi Lu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3590 words, short story, REPRINT\nMother Tongues\n“Thank you very much,” you say, concluding the oral portion of the exam. You gather your things and exit back into the brightly lit hallway. Photos line the walls: the Eiffel Tower, the Great Wall of China, Machu Picchu. The sun shines on each destination, the images brimming with wonder. You pause before the Golden Gate Bridge.\n“右拐就到了,” the attendant says. You look up. His blond hair is as standardized as his Mandarin, as impeccable as his crisp shirt and tie. You’ve just proven your aptitude in English, but hearing Mandarin still puts you at ease in the way only a mother tongue does. You smile at the attendant, murmuring a brief thanks as you make your way down the hall.\nYou turn right and enter a consultation room. The room is small but welcoming, potted plants adding a dash of green to the otherwise plain creams and browns of the furniture and walls. A literature rack stands to one side, brochures in all kinds of languages tucked into its pockets, creating a mosaic of sights and symbols. The section just on English boasts multiple flags, names of different varieties overlaid on the designs: US English—Standard. UK English—Received Pronunciation. Singaporean English—Standard. Nigerian English—Standard . . . Emblazoned on every brochure is the logo of the Linguistic Grading Society of America, a round seal with a side view of a head showing the vocal tract.\nYou pick up a Standard US English brochure and take a seat in one of the middle chairs opposite the mahogany desk that sits before the window. The brochure provides a brief overview of the grading system; your eyes linger on the A-grade description: Speaker engages on a wide variety of topics with ease. (Phonology?) is standard; speaker has a broad vocabulary . . . You take a quick peek at the dictionary on your phone. Phonology-linguistic sound systems. You file the word away to remember later.\nThe door opens. A woman wearing a blazer and pencil skirt walks in, her heels clacking against the hardwood floor, her curled hair bouncing with every step. You stand to greet her and catch a breath of her perfume.\n“Diana Moss,” she says, shaking your hand. Her name tag also displays her job title: Language Broker.\n“Jiawen Liu,” you reply. Diana takes a seat across from you; as you sit, you smooth out your skirt, straighten your sleeves.\n“Is English all right?” Diana asks. “I can get an interpreter in if you’d prefer to discuss in Mandarin.”\n“English is fine,” you reply. You clasp your hands together as you eye Diana’s tablet. She swipes across the screen and taps a few spots, her crimson nails stark against the black barrel of the stylus.\n“Great,” she says. “Well, let’s dive right in, shall we? I’m showing that you’ve been in the US for, let’s see, fifteen years now? Wow, that’s quite a while.”\nYou nod. “Yes.”\n“And you used to be an economics professor in China, is that correct?”\nYou nod again. “Yes.”\n“Fantastic,” Diana says. “Just one moment as I load the results; the scores for the oral portion always take a moment to come in . . . ”\nYour palms are clammy, sweaty; Diana twirls the stylus and you can’t help feeling a little dizzy as you watch. Finally, Diana props the tablet up and turns it toward you.\n“I’m pleased to inform you that your English has tested at a C-grade,” she says with a broad smile.\nYour heart sinks. Surely there’s been some kind of error, but no, the letter is unmistakable: bright red on the screen, framed with flourishes and underlined with signatures; no doubt the certificate is authentic. Diana’s perfume is too heady now, sickly sweet; the room is too bright, suffocating as the walls shrink in around you.\n“I . . . ” you say, then take a breath. “I was expecting better.”\n“For what it’s worth, your scores on the written and analytical portions of the test were excellent, better than many native speakers of English in the US,” Diana says.\n“Then what brought my score down?”\n“Our clients are looking for a certain . . . profile of English,” Diana says, apologetic. “If you’re interested in retesting, I can refer you to an accent reduction course—I’ve seen many prospective sellers go through the classes and get recertified at a higher grade.”\nShe doesn’t mention how much the accent reduction course costs, but from your own research, you know it’s more than you can afford.\n“Ms. Liu?” Diana says. She’s holding out a tissue; you accept it and dab at your eyes. “Why don’t you tell me what you’re trying to accomplish? Maybe we can assist you.”\nYou take in a deep breath as you crumple the tissue into your fist. “My daughter Lillian just got into Stanford, early decision,” you say.\n“Congratulations!”\n“Yes, but we can’t afford it.” C-grade English sells at only a fraction of A-grade English; you’d rather keep your English than sell it for such a paltry sum that would barely put a dent in textbooks and supplies, never mind tuition and housing.\n“There are other tracks you can consider,” Diana says, her voice gentle. “Your daughter can go to a community college, for instance, and then transfer out to Stanford again—”\nYou shake your head.\n“Community colleges in the San Gabriel Valley are among the top in the nation,” Diana continues. “There’s no shame in it.”\nYou’re unconvinced. What if she can’t transfer out? You and Lillian can’t risk that; a good education at a prestigious school is far too important for securing Lillian’s future. No, better to take this opportunity that’s already been given to her and go with it.\nDiana stands and goes over to the literature rack. She flips through a few brochures.\n“You know,” Diana says as she strides back to you, “China’s really hot right now—with their new open-door policy, lots of people are (clamoring?) to invest there; I have people calling me all the time, asking if I have A-grade Mandarin.”\nShe sets a brochure down on the desk and sits back in the executive chair across from you.\n“Have you considered selling your Mandarin?”\nYou trace your hands over the brochure, feeling the embossed logo. China’s flag cascades down to a silhouette of Beijing’s skyline; you read the Simplified characters printed on the brochure, your eyes skimming over them so much more quickly than you skim over English.\n“How much?” you ask.\nDiana leans in. “A-grade Mandarin is going for as much as $800,000 these days.”\nYour heart skips a beat. That would be enough to cover Lillian’s college, with maybe a little bit left over—it’s a tantalizing number. But the thought of going without Mandarin gives you pause: it’s the language you think in, the language that’s close to your heart in the way English is not; it’s more integral to who you are than any foreign tongue. English you could go without—Lillian’s Mandarin is good enough to help you translate your way around what you need—but Mandarin?\n“I’m . . . I’m not sure,” you say, setting down the brochure. “Selling my Mandarin . . . ”\n“It’s a big decision, for sure,” Diana says. She pulls a small, silver case out from the pocket of her blazer and opens it with a click. “But, if you change your mind . . . ”\nShe slides a sleek business card across the table.\n“ . . . call me.”\nYou decide to go for a week without Mandarin, just to see if you can do it. At times, the transition feels seamless: so many of the people in the San Gabriel Valley are bilingual; you get by fine with only English. Your job as a librarian in the local public library is a little trickier, though; most of your patrons speak English, but a few do not.\nYou decide to shake your head and send the Mandarin-only speakers over to your coworker, who also speaks Mandarin. But when lunchtime comes around, she sits beside you in the break room and gives you a curious look.\n“为什么今天把顾客转给我?” she asks.\nYou figure that you might as well tell her the truth: “I want to sell my Mandarin. I’m seeing what it would be like without it.”\n“卖你的普通话?” she responds, an incredulous look on her face. “神经病!”\nYou resent being called crazy, even if some part of you wonders if this is a foolish decision. Still, you soldier on for the rest of the week in English. Your coworker isn’t always there to cover for you when there are Mandarin-speaking patrons, and sometimes you break your vow and say a few quick sentences in Mandarin to them. But the rest of the time, you’re strict with yourself.\nConversation between you and Lillian flows smoothly, for the most part. Normally, you speak in a combination of English and Mandarin with her, and she responds mostly in English; when you switch to English-only, Lillian doesn’t seem to notice. On the occasions when she does speak to you in Mandarin, you hold back and respond in English too, your roles reversed.\nAt ATMs, you choose English instead of Chinese. When you run errands, “thank you” replaces “谢谢.” It’s only until Friday rolls around and you’re grocery shopping with your mother that not speaking in Mandarin becomes an issue.\nYou’re in the supermarket doing your best to ignore the Chinese characters labeling the produce: so many things that you don’t know the word for in English. But you recognize them by sight, and that’s good enough; all you need is to be able to pick out what you need. If you look at things out of the corner of your eye, squint a little bit, you can pretend to be illiterate in Chinese, pretend to navigate things only by memory instead of language.\nYou can cheat with your mother a little bit: you know enough Cantonese to have a halting conversation with her, as she knows both Cantonese and Mandarin. But it’s frustrating, your pauses between words lengthy as you try to remember words and tones.\n“干吗今天说广东话?” your mother asks in Mandarin. She’s pushing the shopping cart—she insists, even when you offer—and one of the wheels is squeaking. She hunches over the handle, but her eyes are bright.\n“Ngo jiu syut Gwongdungwaa,” you reply in Cantonese. Except it’s not exactly that you want to speak Cantonese; you have to, for now. You don’t know how to capture the nuance of everything you’re going through in Cantonese, either, so you leave it at that. Your mother gives you a look, but she doesn’t bring it up again and indulges you, speaking Cantonese as the two of you go around the supermarket and pile the shopping cart high with produce, meat, and fish.\nYou load the car with the groceries and help your mother into the passenger seat. As you adjust the mirrors, your mother speaks again.\n“你在担心什么?” she asks. Startled, you look over at her. She’s peering at you, scrutinizing you; you can never hide anything from her. Of course she can read the worry on your face, the tension in your posture; of course she knows something’s wrong.\n“Ngo jau zou yat go han zungjiu dik kyutding,” you respond, trying to communicate the weight on your shoulders.\n“什么决定?” Ma replies.\nYou can’t find the words to express the choice you have to make in Cantonese. Every time you grasp for the right syllables, they come back in Mandarin; frustrated, you switch back to Mandarin and reply,\n“我要用我的普通话来赚钱去送Lillian上大学。”\nYou expect your mother to scold you, to tell you about the importance of your heritage and language—she’s always been proud of who she is, where she’s from; she’s always been the first to teach you about your own culture—but instead her expression softens, and she puts a hand over yours, her wrinkled skin warm against your skin.\n“哎，嘉嘉，没有别的办法吗?”\nYour nickname is so tender on her tongue. But you’ve thought through all other avenues: you don’t want Lillian to take out loans and be saddled with so much debt like your friends’ children; you don’t want her to bear such a burden her entire life, not while you’re still paying off debts too. You can’t rely on Lillian’s father to provide for her, not after he left your family and took what little money you had. And although Lillian’s been doing her best to apply for scholarships, they’re not enough.\nYou shake your head.\nThe two of you sit in silence as you start the car and drive back to your mother’s place. The sun sets behind you, casting a brilliant glow over the Earth, washing the sky from orange to blue. As you crest over a hill, the sparkling lights of the city below glitter in the darkness, showing you a million lives, a million dreams.\nWhen you get to your mother’s house, you only have one question to ask her.\n“如果你需要做同样的决定,” you say, “你也会这样做吗?”\nYou don’t know what it would have been like if you were in Lillian’s shoes, if your mother had to make the same decision as you. But as your mother smiles at you, sadness tinging the light in her eyes, the curve of her lips, you know she understands.\n“当然,” she says.\nOf course.\nThe waiting room is much starker than the consultation room you were in before: the seats are less comfortable, the temperature colder; you’re alone except for a single TV playing world news at a low volume.\nYou read the paperwork, doing your best to understand the details of the procedure—for all you pride yourself on your English, though, there are still many terms you don’t understand completely:\nThe Company’s (proprietary?) algorithms (iterate?) through near-infinite (permutations?) of sentences, extracting a neural map. The (cognitive?) load on the brain will cause the Applicant to experience a controlled stroke, and the Applicant’s memory of the Language will be erased. Common side effects include: temporary disorientation, nausea. Less common side effects include partial (aphasia?) of nontarget languages and (retrograde?) amnesia. Applicant agrees to hold Company harmless . . .\nYou flip over to the Chinese version of the contract, and, while some of the terms raise concern in you, you’ve already made your decision and can’t back out now. You scan the rest of the agreement and sign your name at the bottom.\nThe lab is clinical, streamlined, with a large, complicated-looking machine taking up most of the room. An image of the brain appears on a black panel before you.\n“Before we begin,” the technician says, “do you have any questions?”\nYou nod as you toy with your hospital gown. “Will I be able to learn Mandarin again?”\n“Potentially, though it won’t be as natural or easy as the first time around. Learning languages is usually harder than losing them.”\nYou swallow your nervousness. Do it for Lillian. “Why can’t you make a copy of the language instead of erasing it?”\nThe technician smiles ruefully. “As our current technology stands, the imaging process has the unfortunate side effect of suppressing neurons as it replicates them . . . ”\nYou can’t help but wonder cynically if the reason why the neurons have to be suppressed is to create artificial scarcity, to inflate demand in the face of limited supply. But if that scarcity is what allows you to put Lillian through college, you’ll accept it.\nThe technician hooks electrodes all over your head; there’s a faint hum, setting your teeth on edge.\nAs the technician finishes placing the last of the electrodes on your head, certain parts of the brain on the panel light up, ebbing and flowing, a small chunk in the back active; you try to recall the areas of the brain from biology classes in university, and, while different parts of your brain start to light up, you still don’t remember the names of any of the regions.\nThe technician flips a couple switches, then types a few commands. The sensation that crawls over you is less of a shock than a tingling across your scalp. Thoughts flash through your mind too fast for you to catch them; you glance up at the monitor and see light firing between the areas the technician pointed out, paths carving through the brain and flowing back and forth. The lights flash faster and faster until they become a single blur, and as you watch, your world goes white.\nThe technician and nurse keep you at the institute for a few hours to monitor your side effects: slight disorientation, but that fades as the time goes by. They ask if you have anyone picking you up; you insist that you’re fine taking public transportation by yourself, and the technician and nurse relent. The accountant pays you the first installment of the money, and soon you’re taking the steps down from the institute’s main doors, a cool breeze whipping at your hair.\nThe bus ride home is . . . strange. As you go from west Los Angeles toward the San Gabriel Valley, the English-dominating billboards and signs starts to give way to Chinese. Although you can still understand the balance of the characters, know when they’re backwards in the rearview mirrors, you can’t actually read them—they’re no more than shapes: familiar ones, but indecipherable ones. You suck down a deep breath and will your heart to stop beating so quickly. It will take time to adjust to this, just as it took time to adjust to being thrown into a world of English when you first immigrated to the United States.\nA corner of the check sticks out of your purse.\nYou’ll be okay.\nYour family is celebrating Chinese New Year this weekend. You drive with Lillian over to your mother’s senior living apartment; you squeeze in through the door while carrying a bag of fruit. Your mother is cooking in the tiny kitchenette, the space barely big enough for the both of you. She’s wearing the frilly blue apron with embroidered teddy bears on it, and you can’t help but smile as you inhale the scent of all the food frying and simmering on the stove.\n“Bongmong?” you say in Cantonese. It’s one of the few words you can remember—as the days passed, you realized that some of your Cantonese had been taken too, its roots intertwined and excised with your Mandarin.\n“(???). (???????),” your mother says, gesturing toward the couch. You and Lillian sit down. A period drama plays on the television. The subtitles go by too fast for you to match sound to symbol; Lillian idly taps away on her phone.\nA few moments pass like this, your gaze focused on the television as you see if you can pick up something, anything at all; sometimes, you catch a phrase that jogs something in your memory, but before you can recall what the phrase means, the sound of it and its meaning are already gone.\n“(???)!”\nLillian gets up, and you follow suit. The small dining room table has been decked out with all kinds of food: glistening, ruby-red shrimp with caramelized onions; braised fish; stir-fried lotus root with sausage; sautéed vegetables . . . you wish you could tell your mother how good it looks; instead, you can only flash her a smile and hope she understands.\n“(?????????), (?????????),” your mother says.\nLillian digs in, picking up shrimp with her chopsticks; you scold her and remind her of her manners.\n“But (??????) said I could go ahead,” Lillian says.\n“Still,” you reply. You place some food on your mother’s plate first, then Lillian’s; finally, you set some food on your own plate. Only after your mother’s eaten do you take a bite.\nLillian converses with your mother; her Mandarin sounds a little stilted, starting and stopping, thick with an American accent, but her enthusiasm expresses itself in the vibrant conversation that flows around you. You stay quiet, shrinking into yourself as your mother laughs, as Lillian smiles.\nYou’re seated between Lillian and your mother; the gap across the table from you is a little too big, spacing the three of you unevenly around the table. As the syllables cascade around you, you swear the spaces between you and your mother, between you and Lillian, grow larger and larger.\nAfter dinner, as your mother washes up the dishes—again, she refuses your help—you and Lillian watch the Spring Gala playing on the television. An invited pop star from the US, the only white person on the stage, sings a love ballad in Mandarin. You don’t need to know what she’s saying to tell that she doesn’t have an American accent.\n“I bet she bought her Mandarin,” Lillian says. It’s an offhanded comment, but still you try to see if you can detect any disgust in her words.\n“Is that so bad?” you ask.\n“I don’t know; it just seems a little . . . (appropriative?), you know?”\nYou don’t know. Lillian doesn’t know. You were planning on telling her the instant you came home, but you didn’t know how to bring it up. And now . . . you want to keep your sacrifice a secret, because it’s not about you—it was never about you. But it’s only a matter of time before Lillian finds out.\nYou don’t know how she’ll react. Will she understand?\nLillian rests her head on your shoulder. You pull her close, your girl who’s grown up so fast. You try to find the words to tell her what you’d do for her, how important it is that she has a good future, how much you love her and want only the best for her.\nBut all you have is silence.\nOriginally published in Asimov’s Science Fiction, January/February 2018."}