{"fingerprint": "XbH6SGHtYQ1/PwLtFZLn1jrXDdE=", "sitename": "Clarkesworld Magazine", "title": "The Foodie Federation's Dinosaur Farm by Luo Longxiang, translated by Andy Dudak", "author": "Luo Longxiang; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/luo_09_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Foodie Federation's Dinosaur Farm by Luo Longxiang, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8270 words, novelette\nThe Foodie Federation's Dinosaur Farm\n1\nA Lei was a young worker at the 045 Meat Union factory on Continent Three in starship Rhea. When the dinosaur uprising overwhelmed the factory, he used a hunting rifle to drop two great beasts that got in his way. He climbed over their corpses and fled deeper into the factory, toward the shuttle launch silos—but he was too late. The six shuttles were gone. Only their exhaust remained, suffusing the air.\nA Lei shouted a torrent of abuse at his faithless coworkers. The racket of a collapsing assembly line drowned out his obscenities. A dinosaur more than five meters long jumped in front of him. He fired his rifle from the hip, but the creature nimbly evaded. The shot pierced a cooling pipe, and liquid nitrogen sprayed in torrents of white mist. The dinosaur’s movements slowed. A Lei squeezed the trigger again, but nothing happened. He was out of ammo. He abandoned the weapon, turned, and fled.\nHe squeezed between two silos, the gap only a meter wide and about fifteen deep. This nook had survived countless launch-shock waves, never collapsing. It would temporarily shelter him from this dinosaur sneak attack. Now he needed a weapon, but all he found was canned dinosaur meat scattered about. He had no choice but to snatch a few cans. It was better than being empty-handed.\nA pair of lantern-like eyes appeared at the gap entrance. The crimson eyes fixed on A Lei, making his scalp tingle, and heavy breathing filled his ears. The beast struck at a silo wall, long mouth clamping down, sharp teeth piercing, and a metal wall plate came off with the sound of a gunshot. A monstrous tooth landed near A Lei’s foot. The canine, as long as his hand, stank of blood and made him retch.\nThe monster withdrew a few steps, swaying its large head. It peered into the gap at A Lei, seemingly loathe to abandon him. He saw it clearly now: a draconis sapiens over five meters long, from the largest-bodied dromaeosauridae branch, fast and deadly, cousin to the famous velociraptor, but with a much higher IQ. Some had brain volumes comparable to humans. They set traps and imitated other species to attract prey. Some witnesses claimed they emulated human tool use, and even parroted human speech. This was the most dangerous species of dinosaur. Almost every time livestock rebelled, dracopiens were involved. Their delicious flesh was widely known. At every supermarket counter in the Starship Alliance, dracopien was the most popular meat. Their weighty brains were used to make Dragon Brain Soup, a delicacy to rival Shark Fin or Swallow’s Nest.\nThis dracopien wore a fine necklet. The inlaid nameplate identified its master, the researcher Ai Li-ke, and below that the creature’s name, Steel Teeth.\nIt turned and moved off, seeming to give up. A Lei’s sigh of relief was cut short when the monster picked up a hoisting jack and returned. It placed the jack in the gap and leisurely cranked, widening the entrance, metal squealing and giving way.\nA Lei grew desperate and shouted, “Don’t bother! I’m just skin and bones, not tasty at all!”\nSteel Teeth’s throat rumbled ominously. In crude tones it said, “I just ate a few. Humans really do taste awful. And I am full. That is not why I am doing this. It is exercise. Is that not a good enough reason?”\nIt wasn’t surprising that this dracopien could talk. In addition to its developed brain and formidable intelligence, its larynx anatomy closely resembled a parrot’s.\nIt showed no sign of stopping with the jack. A Lei’s fight-or-flight impulse kicked in. He made his way into a deeper, narrower place. “So you’re full,” he said, squeezing in. “We might as well sit down and chat. Maybe even make friends?”\nSteel Teeth’s strength was extraordinary. After the jack had done its work, the monster bit its way forward, as if burning excess vigor, tearing away pipes and wires, clawing apart metal plating. A Lei crawled further in, frantic and ratlike, relying on memory to seek the butchering-mecha storage facility.\nHe crawled out of a ruptured industrial runoff pipe. Less than three meters away reclined a mecha suit, a butchering model about the size of a dracopien. The cockpit was open. The suit, which might have held its own against a T.Rex, had been abandoned. He had no time for this mystery. Rousing his courage, he took a deep breath and charged toward the armor. The foul stench of industrial runoff was like a chemical weapon, nearly overwhelming him. He covered his nose and reached for the mecha.\nThe runoff pipe was trampled flat with a thunderous crash. Steel Teeth’s talons stabbed the floor right in front of A Lei. They could disembowel a T.Rex, and they’d come centimeters from tearing open his throat. Steel Teeth was like a cat toying with a mouse. Such a nimble killing machine couldn’t miss like that. If it wanted A Lei dead, he’d already be slashed to ribbons.\nA primal ferocity stirred in A Lei’s heart. He dove into the cockpit. An impact rocked the canopy, Steel Teeth’s claw a step late, screeching across the transparent shell. A Lei was soaked in cold sweat. He’d nearly been decapitated.\nNow ensconced in the mecha, A Lei felt a dangerous pride. To suppress dinosaur uprisings, many mecha packed serious firepower, six-barrel Gatling machine cannons. He pulled a joystick. The mecha shivered, stood, extended manipulator arms toward the dracopien. Panels opened on the arms. A Lei cackled in his pride, eager to blow Steel Teeth to pieces.\nBut his smile froze.\nHis new arms were not sprouting cannons like he’d hoped. Instead, meter-long soup ladles emerged. He threw switches, retracting the ladles, extending giant tongs. A Lei stared, dumbfounded, switching tools in a frenzy. Forks, hooks, egg whisks, and other implements came up in succession, like a rotating lantern-carousel of paper horses. Against all reason, there was nothing like a useful weapon. Steel Teeth saw his frustration and collapsed with hissing laughter. “You foolish thing!” it said. “If this mecha had weapons, why would its former master have abandoned it?”\nA Lei saw his chance and took it. He drove the mecha, trampling over the prone dinosaur and charged at a window. He smashed through, leaping out of the 045 Meat Union factory. Then he was falling, crashing through canopies of massive treelike ferns, more than twenty meters down, and into flea-bitten mud.\n2\nThe Starship Alliance was nicknamed “The Foodie Federation” because its citizens had long ago grown dissatisfied with dull, flavorless foodstuffs synthesized in labs. Like their distant ancestors, they craved natural, pollution-free food, meat from species that grazed over vast territories, organically. The foodies were insatiable. They wanted exquisite variety, minced delicacies, food that took ten or even a hundred times more energy to raise and prepare than it provided. Such uneconomical practices were rare among nomadic space civilizations. To feed their strange addiction, the foodies constructed specialized agricultural starships. These immense man-made worlds provided grazing land, artificial sunlight, fertile soil, whole biospheres in the service of the foodies’ appetite. All kinds of crops and livestock were raised, under natural Earthlike conditions. The yield was harvested or slaughtered after maturation, sent by freighter to every starship with megacities, to restaurants and supermarkets, meeting the demands of countless gluttons.\nA few hundred years ago, the Starship Alliance returned to its origin world, Earth, seeking the fragments of its ancestral civilization. They took nearly everything of value from the ruins: cultural relics, dilapidated landmarks, specimens of flora and fauna, and fossils of extinct organisms. The dinosaur fossil payload came to megatons, and included many previously undiscovered species. Among the latter was the astonishing draconis sapiens.\nBiologists conceived an idea: create a starship with a Cretaceous Earth habitat, resurrect paleo-organisms, including dinosaurs, so as to research the era. But the cost of the project would be massive. It wasn’t easy to persuade stingy legislators to allocate funds, but after many rejections, they found someone who was interested.\n“Just leave it to me,” said the Venerable Madam Zheng Qingyin, president of the Alliance Foodstuffs Federation—in business circles known as Grandma Foodie—leaning on her dragon head cane in the Bio Research Institute’s paleo-organism department.\nAn astonishing foodie carnival was staged at that year’s congressional budget conference. AFF freighters crowded the Congressional Plaza. “Distinctive Prehistoric Delicacies” were handed out, free of charge. AFF-owned celebrities performed on stage. Billboards shouted slogans:\n“Make any dinner table more sumptuous!”\n“T.Rex leg burgers, steamed diplodocus, savory and spicy pterosaur wings!”\n“Take your place at the Starship Alliance’s luxurious banquet table!”\nThe Venerable Madam Zheng, white-haired, ruddy-complexioned, hale and hearty, walked with vigorous strides into the Capitol Building, deploying her dragon head cane to great dramatic effect. She carried a draft resolution in her other hand. She didn’t use lengthy speeches to subjugate the legislators. Instead, she made sure they each had samples of dinosaur meat to try. When the few vegetarian legislators furrowed their brows and refused, she tantalized them with an equally delicious ancient pteridophyte banquet.\nThe Capitol Building had become a mansion of delicacies.\n“I won’t lecture you,” the Venerable Madam said, “on the importance of a diverse diet to human well-being. There’s no need, am I right?”\nHer scientists were arrayed behind her, ready to hold forth on the topic for months, if called upon. She’d prepared truckloads of technical data on the proposed starship and its Cretaceous habitat. Its cost would dwarf that of traditional agricultural ships. It would allow biologists to research extinct life, but of course this was really about the foodies, and eating.\nShe got through the proposal effortlessly. When she emerged at the top of the Capitol steps, smiling and satisfied, a multitude of gluttons erupted with applause. Alliance TV broadcasted everything. The Venerable Madam had been wild in her youth. Now she felt that old wantonness return. Raising her dragon head cane, she cried, “Our slogan is . . . !”\nThe crowded square gave its booming reply: “Eat everything on two legs except people! Eat everything on four legs except stools!”\nBuilding the new starship would take over a hundred years. Grandma Foodie Zheng Qingyin wouldn’t live to see it completed, but her draft resolution would profoundly change the Starship Alliance dining table. After DNA fragments had been extracted, and paleo-organisms were coming back to life species by species, scientists noted that dracopiens were intelligent organisms. There was extensive debate: the resurrection of a dinosaur with human-equivalent IQ was no small matter. But in the end, the foodies’ argument was simple and persuasive: Are dracopiens delicious? If so, resurrect!\n3\nThe Cretaceous habitat was wildly unsuitable for humans. The world outside the factories was verdant, a wetland teeming with reptiles. People accidentally stepped on crocodiles and other beasts quite often. Dense fern canopies blotted out sky and sun. This primeval forest was bathed in a luxuriant mist, and the air, at over forty Celsius, was suffocating. It was like being in a giant food steamer. The pteridophyte fauna, lacking the structure and root systems of woody plants, needed the moist surroundings to survive. Some of the treelike ferns reached thirty meters tall. This world was so saturated that living people could molder.\nA Lei made his mecha sit up. Luckily the interior was climate controlled, or he would already have been steam-cooked by the atmosphere. He hadn’t driven a few steps before the mecha slipped into a bog, and he had to get upright again, this time with difficulty. This factory mecha was not suited to Cretaceous mud.\nA Lei glanced back at the factory, which resembled a massive spider, several hundred meters wide, lying sprawled upon the earth. Normally it advanced like a bulldozer, gobbling up fern forest. Ground effect vehicles, like great dragonflies, would be dispatched from their tarmac on the roof, and in great swarms hunt dinosaurs. The conveyor belts would hurtle forward continuously, processing all kinds of dinosaur meat products. There were many of these roving factories in starship Rhea. The fern forests grew fast and weed-like in the warm, moist environment, and could be harvested regularly. The tender pteridophytes were rich in carbohydrates and protein. Most of a pteridophyte was edible, unlike flowering plants with their limited offerings of fruits, seeds, and certain leaves. The stunningly fast growth of Cretaceous flora was a clear demonstration to scientists of how the colossi, the dinosaurs, had been fed. Gourmands were pleasantly surprised at how fast the dinosaurs reproduced in this blistering climate—so much for the assumption of slow reptilian birthrates. Brood after enormous brood, breeding faster than rats: it turned out that Rhea was twice as productive as traditional agricultural starships. It seemed dinosaurs wouldn’t have to be domesticated. Hunting was sufficient.\nAs A Lei carefully observed his surroundings, Steel Teeth rushed down the nearly-vertical factory wall and dashed across fern roots and muck, leaving no trace. A Lei was reminded of its awful cousin, the swift and violent velociraptor, and he failed to react. It felt like a hundred-ton truck hit him. His mecha was like a kite with its string cut, airborne, beyond control, then crashing through tree-fern saplings—and finally, mecha-face down in the mire.\nSteel Teeth’s talons pressed down on the machine. Its teeth scraped, seeking purchase, but it couldn’t get the cockpit open. It gave up grudgingly. A Lei came to, feeling like all his bones had been shattered. Luckily, he’d landed in spongy marshland. If it had been solid stone, he might have been crushed inside the mecha.\nSteel Teeth had been slower in the factory, where it was 20 or so degrees Celsius. Although dinosaurs were considered warm blooded, their capacity for body temperature regulation was inferior to that of mammals and birds. Out here in the damp heat, at over 40 degrees, it was ideal dinosaur weather. Below 10 degrees, most dinosaurs lost their mobility, or even died en masse.\nA Lei sat the mecha up, and again Steel Teeth knocked it down. A Lei raised both hands and said, “Okay buddy. We’re both intelligent creatures. How about we sit down for a nice chat?”\n“Okay,” Steel Teeth replied. It was at its wit’s end, after all. The mecha was a conundrum. The last attack had consumed the dinosaur’s strength, and it needed a rest, just like A Lei. It sat down much like a hen, stomach to the ground. The dinosaur kinship with birds was plain.\n“You seem familiar with humans,” A Lei said. “Surely you were raised and trained by someone . . . ”\nThe creature said, “My foster father Ai Li-ke was a researcher of extinct life, living in solitude. He gave me human knowledge.”\n“And what happened to him?”\nSteel Teeth laughed, displaying its keen incisors. “He was not very good. His meat was old. Too many bones. Hurt my teeth.”\nA Lei was shocked. “You ate him?”\n“Humans have strange defects,” Steel Teeth said. “You like domesticating house pets, believing you can imbue them with human feelings and reason. With dogs, horses, and other such social animals, long domestication can render them docile. But as for solitary animals . . . no matter how good you are to me, good enough to make me see you as kin, well, one mountain cannot brook two tigers. And we kill our own kind. The mother snake lays a brood and then just leaves. The eggs hatch and the young must fend for themselves. There is no familial emotion or attachment in the snake brain, no sense of friendship. How can you domesticate that? Change fundamental brain structure? No matter how good you are to creatures like us, we only see you as prey.”\nThis great reptile’s words resonated with A Lei. It seemed the dracopien, for all its mental development, was no more affectionate or friendly than a snake. A Lei said, “I’ve never met such a wise and farsighted dinosaur.”\n“Thank you,” Steel Teeth said, lying prostrate on the ground. “You can call me Mister Wise and Farsighted Crouching Dragon.”\n4\nGetting rid of this dracopien wasn’t going to be easy. It became clear to A Lei as he watched the beast kill a T.Rex. Steel Teeth cleverly enraged its prey, luring the massive creature into soft mud, where it became stuck, and the hunter easily prevailed.\n“I don’t understand,” A Lei said. “Your kind is quite rare, for a late Cretaceous apex predator. We’ve found so many T.Rex fossils, but few dracopien fossils. Actually, we found none until the SA returned to Earth.”\nSteel Teeth bit off a chunk of T.Rex flesh and devoured it. “We dracopiens do not lay many eggs. And we like to kill each other, so our numbers are naturally low. But, I have a dream. I see a great dinosaur civilization. I see dracopiens destroying humanity, and replacing it.”\nA dinosaur with a dream: this was a day of firsts for A Lei. He chose to dampen the creature’s enthusiasm: “Establishing a civilization isn’t easy. Mastering fire would be step one. We’ve never found a trace of fire production from the dinosaur age. Can you friction-drill?”\nSteel Teeth lifted its head and gazed about. The dense fern forest hid much of the sky, while enveloping fog made a salted egg yoke of the westering sun. The dracopien leapt up, and came down on a tree fern, smashing it to the ground. It seized half the trunk in its mouth and flung it before A Lei. “Drill for fire?” it said, in a rage. “With this saturated fern material, in this saturated world, show me fire-drilling! Suirenshi, last of the Three August Ones, legendary inventor of fire, would be at his wit’s end in this place!”\nA Lei had stepped on Steel Teeth’s tail with this problem of fire. Lack of fire production was dinosaur evolution’s biggest flaw. Humans had come into the universe a mere three-million years ago, while draconis sapiens, from birth to asteroid strike, may have been around a good deal longer, yet never mastered flame. They never expanded their food options with cooking, or smelted metal, or created advanced tools. There had never been a dinosaur civilization.\nA Lei’s stomach growled as he sat in the cockpit and watched Steel Teeth gorge itself.\nHe drove the mecha, stepping away, but the beast leapt and knocked him down. After several thwarted attempts, A Lei knew he was trapped. He was meant to starve here. “You said your dream was to replace us,” he said. “But do you understand human civilization?”\n“I understand a bit,” it said. “We have gathered much data on humans.”\n“And you comprehend it all?”\nThe beast cocked its head. “Most of it . . . no.”\n“Then you shouldn’t have eaten your foster father. He would have been happy to help, I imagine.”\n“Just so. I immediately regretted it, after devouring him.”\nA Lei finally understood. A dracopien’s appetite overrode its rational faculty. Having eaten its fill, reason returned. When its belly growled, it became an unthinking, ferocious beast. A Lei saw an opportunity. “You must be in dire need of someone who understands human civilization. If I may be so bold, I could fill that role. I could help you decipher what you mean to annihilate.”\nSteel Teeth returned to the factory and went inside. It soon returned, carrying a flamethrower. It was impossible to friction-drill in this moist world, but a flamethrower was another matter. A Lei watched the dracopien roast the T.Rex meat, puzzled. This sort of carnivore didn’t normally like cooked meat.\nSteel Teeth tossed a well-done T.Rex leg in front of the mecha. It opened its bloody, fearsome mouth and said, “You are welcome to join us.”\n“Us? There are others?” A Lei cautiously opened the canopy as the mecha forked a fragrant chunk of meat and brought it up.\nSteel Teeth looked up and gave a long, ominous roar that made the ground tremble. Moments later, a group of dracopiens emerged into view. Steel Teeth extended its arms and said, “Welcome to the Steel Teeth tribe.”\n5\nThe dracopiens had always tried to imitate human civilization. Rhea employees talked about this often enough.\nA Lei came to the so-called Steel Teeth tribe’s home, a simple, crude structure hidden between a mountain range and a river. On the doorway was an upside-down sign: “Ai Li-ke, Research Facility.” Steel Teeth had seized the place and turned it into a fortress. The surrounding area was piled with hewn-down tree ferns. It seemed the dracopiens had meant to build a stockade with them, but they’d found the material too flexible and abandoned the project. They’d hunted down large dinosaur skeletons instead, using a mixture of stone and bone to construct a gruesome and intimidating city wall.\nA Lei knew that primitive human tribes had built enclosing walls to repel wild beast incursions. He didn’t understand why apex predators like dracopiens needed such protection. Perhaps they were just imitating human behavior. Tree fern shanties stood here and there between the wall and the lab, a solemn little primeval town. The dracopiens had learned the human concept of shelter, but not human construction standards. The shacks were made of broad tree fern stalks and leaves. The roofs were slapdash, barely qualifying as shelter. Still, these dracopiens were far more advanced than other dinosaurs. Some gathered in front of huts to polish hunting implements. From a technological perspective, the tools were close to human Neolithic level, but they weren’t made of stone. Discarded human machine parts served instead—machine arms from dismantled factories, iron pipes, and the like, all ground down to points and made into javelins, lances, and other primitive weapons.\nThere were many such primitive tribes in starship Rhea. Although Cretaceous era dracopiens had humanlike IQs, they’d never entered the tribal era on Earth. These tribes in Rhea had clearly resulted from human influence. All kinds of plundered posters covered the fort, many of them SA city scenes, or steampunk-style space factories, and wide shots of spacecraft swarms like stellar multitudes. But most were illustrations of delicacies from various SA regions. On each of these, a graffito had been scrawled, in characters like roaches crawling across the image: “Our goal is a sea of food!”\n“I thought your goal was to destroy human civilization,” A Lei said, “to remove and replace us.”\n“Just so, but our ultimate goal is to eat. Humanity has many tasty delicacies. My foster father used to share them with me, fine foods from other starships, even from alien civilizations. For the sake of gourmet dining, humans have spanned thousands of lightyears, and returned to Earth to excavate fossils. You made this Cretaceous environment, this high-quality grazing land . . . the audacity! Foodies are the most powerful force in the universe. If we conquer humanity, all that wonderful food will be ours!”\nIn the final analysis, these dracopiens were mouth-straight-to-heart foodies. Steel Teeth did nothing to conceal its yearning. A Lei hadn’t expected these primitive dracopiens to be pursuing something higher than mere destruction.\nEntering the stronghold, he saw most of the lab instruments had been demolished for weapon parts. Books lay scattered on the floor, most of them rotted by the climate. The few intact volumes were ancient human histories.\n“They say humans progressed from primitive tribes to tribal coalitions,” Steel Teeth explained. “On that foundation they established nations. Before we establish our own great tribal alliance, the latter part of human history is useless to us.”\nThese fragmentary histories outlined tribal warfare in remote human ages. Steel Teeth said, “We have run into a bit of a problem.”\n“What’s that?”\n“I threw away all the weapons materiel Foster Father left to me. At the time, I believed they could not compare with sharp teeth. But during our battles with the tribe on the other side of the river, their flame catapults were ferocious. We suffered grievous losses.”\n“That’s why you attacked the factory?” A Lei said. “To find better weapons?”\nSteel Teeth led A Lei outside, to a captured enemy catapult. Made of fern tree, and using oil rendered from dinosaur fat, it was a crude machine. Its only real virtue was the human-made flamethrower lashed to it, which lit the dino-oil payloads. A Lei, staring at Steel Teeth’s deadly incisors, said, “You should learn to peacefully coexist. You’re all dracopiens. Infighting is pointless.”\n“Enough of that useless rubbish!” Steel Teeth said. “In ancient times did you humans not make rivers of blood? Without big and powerful tribal alliances, would human civilization have been possible? Did not those powerful human war chiefs, like Odin or Emperor Yan, become deities worshipped by later generations? Does your Starship Alliance not have a battleship named the Emperor Yan?”\nThese dracopiens were naturally despotic. A Lei worried about debating and infuriating Steel Teeth. The prudent choice was to shut up.\nSteel Teeth went vigorously about its leadership duties, handling tribal affairs big and small. It delegated a host of technological problems to A Lei. Luckily, these dracopien tech issues were of the simple Neolithic variety: find abandoned human metal fit for weaponry, develop new techniques for making sharper arrows, learn how to fling fire in this moist environment, and how to process tree fern material into something harder and wood-like.\nWhen he knew he was unobserved, A Lei relaxed and breathed in the mecha. He wanted to contact headquarters, but didn’t know how. Despairing, he glanced down, and saw a hand device on the floor of the cockpit. It must have been dropped by the previous pilot. A Lei smacked himself upside the head in a fierce self-rebuke. If he’d seen the device earlier and called for help, he might have avoided his current predicament.\n6\nHe huddled in the cockpit with the device in his hands. His trembling finger entered the wrong number several times, but he finally connected to the 045 Meat Union factory assistant director’s office. “Director!” he shouted. “It’s A Lei! I’m trapped in Rhea!”\n“A Lei?” The assistant director sounded frightened. “You’re still alive?”\n“If not, who are you talking to?”\n“We all assumed you’d been eaten, so we didn’t arrange a rescue team. But on the bright side, financial affairs offered their condolences. They paid for the funeral, and the accidental death insurance has paid out to your parents. Quite a sum!”\nA Lei had to stop himself from smashing the hand device. “So my family’s quite happy with everything then? You were worried about further losses if you dispatched rescue, is that it? Why eat more financial loss when you can just write me off? Well let me tell you . . . you’ve got bigger problems. These dracopiens aren’t merely lashing out at the factory. They’re conspiring to revolt. They mean to establish a huge tribal coalition. They want to overthrow human civilization and replace it. We need to sound the alarm. Better yet, we need to report this to SA government. We need the Marines if we’re going to suppress these fucking lizards!”\n“So you want to smash everyone’s rice bowls,” the assistant director said, growing incensed himself. “You know if Accidents and Safety inspects, all Union factories have to shut down and reorganize. What’s everyone supposed to eat? The Northwest Wind? Now wait . . . if you’re really saying the dracopiens are conspiring to overthrow humanity . . . Just hold on, I’ll report it to the higher-ups and call you right back.” The assistant director disconnected.\nA few minutes later, the device buzzed in A Lei’s hand, and he answered. An old, dignified voice came through, claiming to be the AFF executive director in charge of Rhea.\n“Executive d-director.” A Lei was low-level, a Union factory worker. He was talking to the man in charge of all food enterprises in Rhea.\n“Young man,” the old voice said, “tell me frankly . . . what’s happening there?”\nA Lei dared not hold anything back. He recounted the whole disaster, systematically and in full detail.\n“That’s quite a story,” the old man said. “You’re sure my friend Ai Li-ke was eaten?”\n“Y-yes.”\nThe old man sighed. “No wonder I haven’t heard from him in so long. Ai Li-ke was an outstanding researcher for us. He played an important role in constructing the dinosaur pasturelands. And he was a skilled cook! Specialized in dinosaur eggs. Do you have anything of his? Keepsakes? If so, bring them back to me, and I’ll reward you well.”\nA Lei sifted through the materials he’d collected. “There’s only fragments of his notebooks left, and a few memory chips. Sir, you must think of a way to rescue me from Rhea. Otherwise I have no way of getting this stuff to you.” He had to prioritize his own little life.\n“You’re sitting in a mecha now?”\n“Of course. Otherwise I’d have been eaten.”\n“So it would seem the dracopiens also don’t know what to do with you. You have two options . . . sound the alarm and report to the police, getting a rescue team dispatched. That’s the safest way, but you’d be letting a once-in-a-lifetime opportunity slip through your fingers.”\nThat cut through A Lei’s fear. “And the other option?”\n“Cut a bloody path out of there, escape on your own, and bring me Steel Teeth’s head. You would have a hero’s welcome, and a promotion. How does deputy captain of a hunting squad sound?”\nA Lei did some quick mental calculations. “I’d be equal to an assistant factory director.”\n“Satisfactory?”\n“Yes! Ten thousand times yes! If you’ll keep your promise . . . ” He could struggle half a lifetime and never climb that high. He grinned, seeing money, glittering futures, his current danger forgotten.\nAfter the old man had disconnected, A Lei sat there fantasizing. A grim voice like a thunderclap brought him back to the Cretaceous: “Who were you talking to?”\nA Lei panicked. He’d forgotten that dinosaur hearing was far keener than his. Steel Teeth had probably heard the entire dialogue.\n7\nAfter that fateful call, A Lei spent every day in fear. Steel Teeth seemed to know its severed head was the price for a deputy captain throne. A group of fearsome dracopiens always watched him, and he was never alone with their chieftain. Sometimes he had to fight the urge to sound the alarm, but the lure of promotion always won out. Steel Teeth had him designing various weapons for the coming tribal wars. A Lei knew nothing of weapon design, but he knew how to research Stone Age weaponry on the hand device. In the course of one hectic month, he designed many weapons for the tribe.\nA Lei understood well enough that if Steel Teeth really wanted him dead, there were many ways. It couldn’t bite through the mecha, but it could starve him. It could slow-cook a stegosaurus leg right in front of him, wait for him to go mad with hunger and leave the cockpit, then casually devour him. But as long as A Lei produced weapon designs, it seemed Steel Teeth would refrain from harming him.\nHe was confined to the castle, but he heard dracopiens speaking of their chieftain’s conquests. Steel Teeth was vanquishing tribe after tribe, consolidating power. He also heard the 045 Meat Union factory was back in business. No one seemed to care about one low-level worker’s whereabouts.\nIt was getting harder to find new data for weapons designs. The decisive moment was fast approaching.\nHe brought up Steel Teeth’s domestication record for the hundredth time, a series of videos shot by Ai Li-ke.\nDracopien reproduction was much like certain turtles’. Parental involvement ended when an egg was laid. Little dracopiens hatched ready to hunt. Like many fish, amphibian, and reptile species in times of scarcity, siblings devoured each other. When Ai Li-ke discovered Steel Teeth’s nest, the little dracopiens were at war. Finally, just one hatchling remained. Ai prepared cow milk and chicken eggs for it, but the fierce little creature only snarled at its new benefactor. Ai Li-ke found this charming, and named it Steel Teeth.\nA montage followed, Ai patiently teaching Steel Teeth to read. Raising this emotionless, reptilian thing was far more difficult than raising a mammal. Mammals come with emotional attachment software preinstalled. Much of the time, Ai had no choice but to administer electric shock to make little Steel Teeth learn obedience. The other method was feeding. Young Steel Teeth learned to curry favor with Ai in order to enjoy the great variety of human food. A sumptuous banquet flowed from Ai’s hand, and Steel Teeth grew very fast, ending up much larger than a wild dracopien.\nNaturally, Steel Teeth’s knowledge far exceeded its wild cousins’. This, combined with its superior size and vigor, allowed it to easily defeat other dracopiens in combat. By the time Ai Li-ke was seventy, Steel Teeth had become the alpha of a large dracopien pack. Tribalism was something new for the species, a new world in which Steel Teeth was the grim hegemon.\nIn Steel Teeth’s eyes, A Lei’s usefulness was drawing to a close. One day it brought some trusted followers into the fortress, where A Lei was hard at work measuring a section of excavated tree fern rhizome, which was meant to become a mortar cannon. A Lei puzzled over two problems: how to produce and use gunpowder in this moist world, and how to make tree fern material strong enough to endure the force of discharge.\nRhea was, in the end, merely the human approximation of a Cretaceous environment. It differed from the real thing. To prevent flowering angiosperms from squeezing out pteridophytes, humans strove to eliminate higher plants from the ecosystem, not to mention maple, birch, and metasequoia. Thus, hard building materials were difficult to come by.\nSteel Teeth brought a taloned foot down, smashing the nascent mortar to pieces. “Stop tinkering with such nonsense. This is not Earth. We have bypassed the Iron Age.”\nA Lei went pale. He knew he couldn’t make a mortar. He’d been going through the motions of research, to keep death at bay. Now Steel Teeth had seen through this. He feared the moment of truth had come.\nSteel Teeth’s followers dragged the mecha toward a large gathering of dracopiens. A Lei was deposited on a massive, crude contrivance of tree fern, a kind of war chariot. Looking down upon the wide expanse of dracopiens, A Lei reckoned the alliance was now ten tribes strong. A solemn Steel Teeth reviewed its army. There were many other war chariots, lashed to domesticated stegosaurs and ceratopsians. A vanguard of dracopien-driven T.Rexes, armored in bone and teeth, rushed toward the battlefront.\n“I have unified all the tribes of the Yellow River’s north shore,” Steel Teeth said to A Lei. “Today we unite with the south shore tribes, at long last. Behold, this world’s highest lord.”\nSteel Teeth’s “Yellow River” was the great waterway of the region. A hundred kilometers of dracopien deforestation had led to erosion, turning the river into a yellow, turbid flow. “If the name Yellow River gets around,” A Lei said, “many Earthlings might have objections. Can you change it?”\nSteel Teeth snorted. “The chief of the south shore alliance is named Chiyou, God of War.”\n“Really?” A Lei said in amazement.\n“That is really my nickname for it.”\nThis joke fell flat, but Steel Teeth’s knowledge did more to kill any possible levity. It knew the hazards of a cross-river military campaign. It had chosen to launch its offensive in the enveloping fog of early morning, to obscure numbers and movement. A Lei noticed strange little vehicles among Steel Teeth’s forces, tree fern constructions with crude but clever gears driven by the wheels. No matter which way they turned, their indicator rods always pointed across the river.\nSteel Teeth’s dracopiens were armed with metal weapons burnished by stone and bone. Garlands of some pteridophyte, blooming with primitive flowers, were bound to their heads. The plant was a favorite edible among dinosaurs, resembling Chinese cabbage. To A Lei these advancing dracopiens were comical, a group of hooligans with cabbage hats, but the Steel Teeth tribe knew what it was doing. The headdresses would distinguish friend from foe. If a dracopien emerged from the fog of war without one, it was an enemy, and must be put to the hatchet.\nThe campaign opened with a salvo of burning missiles, dinosaur oil and pteridophyte kindling bundled around large rocks and flung from catapults into the mist. The clamor of impacts and howling enemies traveled across the water. Dracopiens ignited torches bound to the tails of their T.Rex and stegosaur mounts, and drove these beasts charging toward the opposite bank. Many enemies were caught unawares, panicking in the fog, and were hewn down. As others took up arms, Steel Teeth’s main force reached the south shore. With sharp claws and cold steel, they conducted a ruthless slaughter.\n“I am very grateful to you,” Steel Teeth said to a dumbstruck A Lei. “All your hard work has paid off. Now, I should send you back to your place of origin.”\n“You mean the Starship Alliance?”\nSteel Teeth knocked the mecha prone. Several dracopiens poured dinosaur oil from fern leaf receptacles onto the mecha, and one used a factory flamethrower to ignite it. The mecha burst into flames, and A Lei realized the war chariot was actually a massive catapult. Steel Teeth slashed the restraining rope with a claw swipe, and A Lei, with his several tons of mecha, was airborne and trailing fire. He had become ammunition.\nSteel Teeth watched him fly toward the far shore. “Godspeed,” it said, “on the reincarnation road!”\n8\nThis was the largest dinosaur conflict A Lei had ever seen. As he came to, his broken body shot through with pain, cockpit life support showed he’d been unconscious for two days. He had a broken rib, two broken legs, and the ground shook as immense dinosaurs clashed all around him, and on top of him, trampling the mecha as they vied for position. The machine was pounded into the riverbank marsh. Starving and dehydrated, he was forced to drink the foul water and dinosaur blood leaking through a crack in the cockpit. Most of the time he didn’t dare to move, waiting, still and quiet, for the war to end. On the third day of this vigil, there was finally silence above. The dracopiens were no longer fighting at close quarters. He touched a joystick, and the mecha sat up. Dinosaur corpses lay piled all around. He stared in amazement. The Yellow River had been dyed red.\n“Life is strong in you.”\nIt was Steel Teeth, behind him. He turned to find the great warlord lying prone, and gravely wounded, on a burned-to-carbon catapult.\n“I’m not strong. This mecha is. After all, it’s a high-tech SA product. With a hundred-and-fifty-million-year technological lead, how can you lose?” Every word he spoke was a stab from his broken rib. Steel Teeth only heard him thanks to the brainwave converter in the cockpit, synthesizing speech and amplifying it.\n“I have not lost,” Steel Teeth said, “but neither have I won. This enemy chief was raised by a human, like me. It was big like me, knowledgeable like me. I nicknamed it Chi You in my desire to defeat it. A pity I am not the Yellow Emperor.1 Chi You is dead, but I will soon follow it.”\n“Wait, you mean there are others like Ai Li-ke?”\nSteel Teeth moved its massive head with great effort. “This was humanity’s plan all along. Resurrect us, educate us, lure us toward humanlike development, toward tribes and alliances, toward building the foundation of a society through hand-to-hand combat. No intelligent species can resist trying to make a civilization, even if they know they are a moth darting toward a flame. How can we turn away from war? Every dracopien dreams of becoming an apex foodie. We dream like you dream. We want to make a world according to our desires. We long to satisfy our craving for endless, delicious variety.”\n“We humans don’t just dream of food. We pursue higher things. Moreover, I plan to become a vegetarian.” Watching tributaries of blood flow into the red river, A Lei thought he would never want meat again.\n“Eating is always the first priority!” Steel Teeth growled. “All life must eat. Hunger is the eternal constant. No food means no life. No life means no dreams, no realization of dreams. Even a superintelligent species is, in the end, biological. Whether you eat animals or plants, you are eating living things. Humanity is just another living thing. Better to admit this. I see through your hypocritical compassion. It is pathetic.”\nA Lei walked the mecha over, meaning to stop Steel Teeth’s bleeding. The beast lashed out, its great mouth ripping the already-cracked canopy to pieces. A Lei, now sitting unprotected in his much-abused machine, stared into a gaping mouthful of teeth, and said, “You don’t want me to save you?”\n“Why should I want that? And how can you save me? It is eat or be eaten, the primal law of the natural world. Plants devour inorganic matter and sunlight. Herbivores eat the plants, and carnivores eat the herbivores. Even high and mighty humans, apex predators that you are, must one day rot and become meal for plants. This is the way of things, the cycle. As intelligent life nurtured by the natural world, your duty is not to destroy this law of nature that brought you about, but rather to protect it. You humans created this world of Rhea. To we dracopiens, you are gods. Gods should preserve natural laws. Gods should maintain nature’s balance, not destroy it.”\nA Lei was confused. “You revere humanity as gods, yet wish to replace us?”\nSteel Teeth seemed to grin broadly. “We want to become gods ourselves, revered, with unlimited food! But this is impossible. Rhea is not old Earth. It is not free and unrestrained. There is no coal here, no oil, for industry. Even if humans allowed us to develop freely, we still could not establish a civilization comparable to yours. But we strive, nevertheless. We cannot even reach the Iron Age, but we strive, and lay down our lives without regret.”\n“I still don’t understand. Why is humanity imparting knowledge to dracopiens?”\n“For more delicious, higher-quality dining, and more developed brains. For your supermarkets and restaurants. For minced meat and Dragon Brain Soup! Foodies as discerning as humans are no longer satisfied with mere free-range meat. You crave carnivores that rush about and fight hand-to-hand. I thought you understood this.”\nA Lei contemplated Steel Teeth for a long time. “You’re the most wise and farsighted foodie I’ve ever met.”\nSteel Teeth laughed, coughed up blood. Lying prone on the burned wreckage of the catapult, it said, “Please call me Mister Wise and Farsighted Crouching Dragon.”\nSteel Teeth’s laugh was like quaking thunder. “Do not be ashamed of being a foodie. You humans have advanced far enough to break from the natural world, and you thrive. If you followed this timid, benevolent morality you speak of, and ate only foods synthesized in your labs, hundreds of starship biospheres would not exist. The countless animals depending on your pastureland habitats would not exist. We Cretaceous organisms would still be mere fossils. Dracopiens think this way . . . if humans do not eat it, it cannot possibly survive. Dracopiens have never resented your cultivation and hunting of our kind. You humans think so highly of yourselves, but your time will come. Are you not destined to become a feast for microorganisms and plants?”\nA squad of ground effect vehicles appeared in the distance. Steel Teeth gave a mighty roar, and slowly rose. Wounds pouring blood, it faced A Lei in the unprotected cockpit.\n“I have devoured much prey in this lifetime, but I never tormented my victims. My kills were swift, and I am proud of this. Humans brought us into this world, and we delighted in combat, to realize an impossible dream. We are born and have only a few dozen years, but that is enough. And now I tell you one last thing . . . respect your food. I know you mean to take my head and become a captain. We abide by the laws of nature. Let us see who shall eat, and who shall be eaten. Come now. Fight!”\nThis would be a fair duel. A Lei, his canopy gone, was no longer impervious to sword and spear, while Steel Teeth, with its injuries, was neither stronger nor faster than the mecha. Roaring, the dracopien lunged. A Lei touched a joystick. The only thing in the mecha’s arm that might grudgingly be called a weapon—an oversized meat skewer—popped up. Steel Teeth’s deadly bite clamped shut centimeters from A Lei’s face. The skewer stabbed, sinking deep into Steel Teeth’s heart.\n“Thank you,” A Lei said, “for teaching me wisdom, Wise and Farsighted Speaker.”\n“Please call me Mister Wise and Farsighted Crouching Dragon.” Steel Teeth’s lantern-like eyes slowly closed, the barest trace of regret marring its satisfaction.\n9\nWhen danger and opportunity coexist, courage is the key to deciding one’s fate. If A Lei had chosen to raise the alarm, he would have remained a common worker. He would have spent his life in the stink of the 045 Meat Union factory, perhaps retiring before he could attain the career summit of foreman.\nWhen he brought Steel Teeth’s head back to the company, the hero’s greeting left him dumbfounded. There was adulation and praise for this young person, so composed, so calm as he faced the lights and cameras, calm as a mountain. Only A Lei knew this was a façade. It was fear that kept him unmoving. After the uprising, the AFF needed a model hero to redeem its image. Despite his lack of qualifications, A Lei was decorated and adorned at the public relations department, and made into an optimal spokesperson.\nAt 22, A Lei became the youngest-ever deputy captain of a hunting squad. This promotion broke several rules, and he knew his qualifications and abilities were being discussed, and found wanting. The higher-ups wanted an experienced hunter. They were waiting for him to wash out. The smallest error could get him demoted, so he was cautious, devoted, and energetic in his work. He couldn’t let this opportunity slip through his fingers.\nHe was very young for such a position. Most of the other deputy captains were of his parents’ generation, and he was higher up than most of his contemporaries. After five years at the job, he got married and enjoyed conjugal bliss. He was promoted, step by step, and ended up the AFF executive director in charge of starship Rhea. By the time his career ended, there were more than a thousand others in the AFF of his rank: pasture habitat executive directors, farming colony planet managers, or exploration team chiefs seeking new foods throughout the cosmos. But A Lei never left Rhea.\nFor most of his life, A Lei sat upright in a tall building, watching his expanse of Cretaceous land, watching dracopiens clash in war after tribal war. Both humans and dracopiens knew what it was all about. Hunting dracopiens was still dangerous work, and although hunting squads were brave, hazarding their lives to kill all types of dinosaurs and deliver them to dining tables, dracopiens were the exception. Better to watch their battlefields, and wait, and harvest warriors on the verge of death. That was how you got the delicacy Dragon Brain Soup.\nMany higher-ups in the hunting squads had dinosaur skulls decorating their offices, and A Lei was no exception. His massive dracopien skull had an engraved plaque beneath it: “Mister Wise and Farsighted Steel Teeth, a truth-speaking friend who changed my life.”\nWhenever he encountered problems, and felt irresolute, A Lei would swivel his chair and look up at Steel Teeth’s skull. He tried to imagine how Steel Teeth, the determined warlord, would handle the thorny issue. A Lei’s subordinates feared and respected him. They called him “master who thinks deep, like a dinosaur.”\nOne day, A Lei sat in his office contemplating a dracopien egg he’d collected after a tribal war. Thinking of Steel Teeth, he began planning his retirement. He would hatch this egg, build a secluded house here in Rhea, and teach the little dinosaur Steel Teeth’s wisdom. He would raise it to be the next generation’s dracopien leader. After much thought concerning its name, he settled on Steel Teeth the Second.\nPerhaps, someday, Steel Teeth the Second would eat him, as the First had eaten Ai Li-ke. Or perhaps it wouldn’t be interested in human meat, and A Lei would die a natural death in Rhea, in the little house, and become food for bacteria and plants. Neither ending was bad, as far as a pious foodie was concerned.\nFOOTNOTES\n1 - The Yellow Emperor is one of the three legendary Chinese rulers and culture heroes. Often regarded as the originator of Chinese civilization, he is said to have defeated Chiyou, God of War and another of the legendary three.\n2 - Zhuge Liang, or Kongming, was a Chinese military strategist and inventor during the Three Kingdoms period. His reputation only grew when he lived in seclusion, earning him the nickname “Crouching Dragon” or “Hidden Dragon.”\nOriginally published in Chinese in Science Fiction World, 2015, issue 10.\nTranslated and published in partnership with Storycom.\nLuo Longxiang was born in 1981, deep in the mountains of Guangxi province on the China's southern border, where he studied Chemical Engineering at Guangxi University. After publishing his first sci-fi story in 2003, his fans began to refer to the mysterious author as \"Master Luo,\" in reference to his hermit-like existence far away from the crowded cities of the coast and northern plains. Of the eleven stories he was written over the past decade, six have earned a Milky Way Award. His works are known for their massive scope, dealing almost exclusively with the question of humanity's eventual survival in space. Since 2007, he has been working to complete the Planetship Alliance series--an epic space opera recounting the tragic history of mankind's colonization of the universe.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}