{"fingerprint": "0DLq0M1ryjV122YvzkPhdsv6tDg=", "sitename": "Clarkesworld Magazine", "title": "The Devonshire Arms by Alex Dally MacFarlane", "author": "Alex Dally MacFarlane", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/macfarlane_05_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Devonshire Arms by Alex Dally MacFarlane", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2580 words, short story\nThe Devonshire Arms\n1. The door, welcoming.\nThe door closed behind Ambri with a click.\nA candle burned.\nThere was a sword by the heavy wooden door, and a coat made of raven feathers. The leather on the sword’s hilt was faded from long use. The coat had holes at the elbows and armpits.\nOverhead hung a chandelier of amber and glass. The walls were dark, and fabric-covered lights hung over the counter. Windows admitted the murky rainlight of day’s fade. In high-sided booths made of leather like the finest dark shoe, murmurs and laughter passed from mouth to ear, mouth to glass.\nWith a swish of her dark red skirts, Ambri swung onto a stool and asked for a whiskey with lemonade. The painted man behind the counter nodded and mixed the drink, moving his hands with the surety of one fluent in the language of bottles and taps. Ambri watched him. A map of the London Underground had grown on his skin, and when he shifted she saw the blues of Victoria and Piccadilly merge into one, the yellow of Circle split into two circles, four circles: an irreal mitosis of helical tracks.\nA strange never-told story, Ambri thought.\nWith a word of thanks and an exchange of coin, she received her drink.\nShe looked at it sitting on the counter, one amid many low, broad glasses stomach-full of liquids light and dark, and she sucked from the thin black straw. When the alcohol-laced sweet coldness slid down her throat, she smiled.\nIt is so good to be back here.\nShe smiled over and over.\n2. The walls, dark like cushions\nAmbri had put her sword by the door many times in the century and a half since finding the pub, since that day when she had stepped inside with shoulders aching like the un-oiled joints of a suit of armor and she had seen a woman made of smoke and fire napping in a chair.\nMany times since, she had seen new solid faces between the wispy, unfocused shapes of the short-lived people. She had been the woman the solid people saw at the counter, in a chair, talking at a naval-high table—the woman they approached, saying, “This place! Are you here often? Do others like us come here?”\n“This place is very new,” the woman made of smoke and fire had said when Ambri woke her with those words. “It is my first visit. But I think I will return.”\nHer voice had sounded like spices and sun-baked bricks.\n“Welcome.”\n“Welcome,” Ambri later said to Esnan, who wore a gold ring in his eyebrow that winked like a courtesan. “Welcome,” Ambri later said to the earth-skinned and sun-haired epicene, calling hirself Aus in these times, who had created cassowaries and platypi in hir youth. “Welcome,” Ambri later said to others.\nAnd afterwards she often saw them in the pub, resting between their work, between the hard steps of their lives.\n“Welcome,” Ambri said to the girl who could not tolerate rhythms, the first time they met.\n3. The plates, hot like embraces>\nIn a booth of blue leather Ambri found her friends: Esnan, mixing trickeries with the fortunes he sold and talking to Aus, who practised hir next creations with napkins and straws. Idjinna smouldered in the back.\n“Ambri! Good to see you!” Esnan stood up so that she could slide to the back of the booth. “How are you?”\n“Busy.”\nHer sword, with well-worn leather on its hilt, rested by the door.\nAus flicked dark fingers, and a marsupial bird made of folded napkins crumpled into sleep.\n“Yes,” Ambri said, laughing, “I would like that. But I’ll relax, first.” A four-legged cactus with cocktail sticks for spines walked across the table, guided by Aus’ other hand.\n“This one is possible,” the epicene said.\n“I like it.”\nEsnan pushed his half-finished plate of fish across the table. The warm ceramic pressed against Ambri’s arm. “You’re in the right place for relaxing.”\n“Yes, I am.”\nThe fish was light and lemony over her tongue, tinted with a taste she could not identify—like the pub itself. Ambri had never found a place quite like it.\nA place built over a century and a half ago, by short-lived people who had not known what it would become: a place for those longer-lived, with different tasks and difficult lives.\nShe ate the plate bare and reclined against the dark blue leather, letting her lids slide shut until she saw only the faint glows of lamps above and Idjinna at her right. Laughter speckled the air. Idjinna’s skin crackled and flared, as if she was made of small twigs catching alight one after the other. “How are you?” Ambri murmured, reaching out to touch Idjinna’s arm.\nHer fingertips pinkened.\n“There was a bronze bowl,” Idjinna said.\n“Ah.”\nIdjinna’s voice sounded like burning as she told Ambri of a merchant who found a way to trap her, to carefully tap her wishes through the latter years of his life. Medicine gardens flourished around his house and the murals stayed fresh. Idjinna could not escape. The bronze bowl singed around the edges. But the merchant died, eventually, and the bowl among many of his other possessions fell to the care of a young Englishman who took it to auction. As the auctioneer’s assistant held it high, his hand tremored and it fell.\n“I was angry and happy all at once, and so I danced: it is what I do best.” She twirled dark, smoky fingers through the flames on her head. “The auction house was made of wood.”\nAmbri laughed through a yawn.\n“They are such a nuisance, these people who cannot even see me but who know how to trap me,” Idjinna said.\nTo Ambri and Idjinna and the rest of the group around the table, short-lived people were wispy, unfocused shapes, talking and drinking and unaware that there were others in their midst. If they even noticed Idjinna, they probably saw a dark woman wearing orange, or wearing a t-shirt painted with flames, or covered in too many tattoos. Only some of them, sometimes, knew a little more—but the man with a map of the London Underground on his skin had ways to keep them out.\nIdjinna twined her fingers with Ambri’s and sighed. “I am particularly tired of crockery.”\nAs the four-legged cactus creature made of napkins and cocktail sticks marched across the table, examined at every step and turn by Aus and Esnan, the two women curled together in the back of the booth. Idjinna quietened her flames, and Ambri lay with her back against that hot chest and her legs linked with smoke and ember. Her skin did not burn.\nThey slept.\n4. The chandelier, amber-eternal>\nThe girl was a kaleidoscope, a patchwork quilt, a mosaic pieced together from tiles of multiple sets. So Ambri had thought, fifty years ago when they first met at the liquid-limned counter.\nThat first time, the girl’s hair drew Ambri’s eye before anything else. Part-stained pale with lemons, part-stained black with soot, with a streak tinted brown-red and smelling of a spice market, her hair hung in disorderly lengths over her broken nose, her bare left shoulder, her left ear with its seven piercings and her right ear with its one glass sphere dangling from the edge of the lobe. Then Ambri noticed her clothes: a blue skirt chopped to uneven lengths and a left trouser leg beneath it that fell to her grubby ankle; the right sleeve of a green dress; a waistcoat covered in beads and oddments. Among them Ambri saw empty-centered coins from China and Denmark, bright red beads from the Serengeti, ivory and jade amulets. Rings, and the finger of a black velvet glove on her right thumb, covered the girl’s pale hands. Her eyes were one-blue, one-amber, like those of certain cats.\n“Stop,” she had said to Ambri, who tapped her fingers to a popular tune on her thin-stemmed glass of water flavored with wine. “Tha-at annoys me, stop it!” Her voice dipped into half a dozen accents, like bread into a platter of oils: Scottish and Indian, Russian and Thai, Turkish and Moroccan. “Fingers. Fi-ingers are too loud!”\nShe pulled the glass out of Ambri’s hands.\n“You were tapping.”\n“Good evening,” Ambri said, bemused.\n“Too many rhythms. Pat-terns. I don’t like them.”\nAmbri turned to the man behind the counter and said, “Can I have a glass of water, please, with the rim of the glass chipped for a third of its curvature, and with unevenly chopped pieces of carrot floating in it.”\nWhen Ambri looked back at the girl, she was staring, her mouth ajar like a door.\n“Here,” Ambri said, giving her the drink. “I hope you like this.”\n“You . . . ” Six of her fingers curled tightly around the glass. “No one has ever . . . ”\nAmbri smiled. “You are far from the strangest person to find your way inside this pub.” Less than a minute later she said it, after inviting the girl to sit down, take a long around, stay: “Welcome to the Devonshire Arms.”\n5. The booths, soft like beds>\nThey woke, and Ambri met for the second time the girl who could not tolerate rhythms.\n“Do either of you want a drink?” Ambri asked Idjinna and Esnan.\n“Feathers and kindling.”\n“Just a glass of apple juice,” said Esnan, back at his phials mixing fortunes and trickeries and a hint of vanilla.\nAs she shuffled out of the booth, Ambri asked where Aus had gone.\nRed and pearl-hued liquids mixed like different colored hairs in a breast-round phial; a drop of something yellow turned the potion monochrome teal. “Something about needing to make the spines poisonous,” Esnan said without looking up.\nLaughing at Aus’ intent, Ambri went to the counter and ordered three drinks from the map-covered man. Hammersmith & City snared Metropolitan like bind weed around a drooping branch, magenta into pink. The grey of Jubilee wriggled. With one hand the man took feathers from under the counter and mixed them in a metal tumbler with cocktail sticks; with the other, he poured hot blackberry liqueur into a wine glass.\nMovement to her left caught Ambri’s attention.\nAt the far corner of the counter, a young woman scattered dried peas in un-patterned intervals. “Good,” she said when one nudged an empty glass; when three peas bounced off each other and one fell on the floor, she muttered, “Irreg-lar,” in a different accent. Another time she just smiled: a slow, lopsided curve of her thin lips.\nThis time fishnet covered the young woman’s left arm, and strips of a CD hung in hair that was chopped and dyed in more ways than Ambri could count. Seven of her fingernails were orange and two were white; pink and beige swirled on the tenth. Her shirt was made of newspaper clippings.\n“You’re still enjoying it here?” Ambri asked, pitching her voice above the murmurings of the wispy people.\nThe young woman looked up. “Hello,” she said, and her smile broadened.\nWhen they met for the first time, the girl had said that a name always remained the same and she didn’t want that, but giving herself a new one whenever she wanted meant no one would remember what to call her. Easier to have none at all.\nAmbri wrapped her hand around her wine glass of liqueur, putting each finger a different space apart. “You’re older than when I first saw you.”\nThe young woman watched Ambri’s fingers. “I don’t age in a pattern, ye-ar by year. Never have. Parents didn’t like that. I was born under Victori-ah.” With her bi-colored eyes she looked up. “You don’t change at all.”\n“I never have. I do not remember my birth, but I have heard many stories: that I was cut from the side of a wasp; that I was molded from bone and metal; that I grew to this size in a womb and in tearing free from it killed my mother, the first death for me to collect.” Ambri inclined a brown shoulder in a shrug. “All I remember is doing my job.”\n“That’s a long time to al-aways do the same thing.”\n“It is.” She thought of her sword, resting by the door. “Though I am made for longevity, it is a long time. It is wearying.” But some of the tightness had left her shoulders, eased away by Idjinna’s heat; and her hands were warm from her glass, not exertion. “That is why I come here, from time to time.”\nThe young woman nodded, and two CD strips tapped each other.\n“Idjinna and Esnan are in a booth. I think you’ve met them?”\n“Once.”\n“Do you want to sit with us?”\nNodding more—up-and-down or sidewise gestures, unevenly spaced—the young woman gathered up her dried peas and slid off her stool.\n“You’re always solid, you and the oth-ers,” she said on the way to the booth. “You always see me and you never stare, you ne-ever look at me like I left the circus.”\nAmbri looked over her shoulder at the young woman. “I know.”\n“You try not to make rhythms.”\n“Hello!” Esnan cried, seeing them. “Sit down! Now, what do you think’s the best color mixture? Thanks for the drink, Ambri.”\nThe young woman settled down in front of the phials arrayed chaotically across the table and stared at them all in turn, playing with the peas in her hands. Eventually she dropped a pea in a phial of cinnabar liquid and said, “That one.”\nEsnan laughed. “I know exactly what that one’s for! Thank you, wonderful lady. Now tell me, where have you been travelling? Your shirt comes from all over the world.”\n“I went to Malawi and Uruguay, and in a bo-at to Cyprus . . . ”\nAs the young woman related her journeys, Ambri leaned against Idjinna and smiled. This is why we come here.\n6. The floor, made for standing still\nWhen they parted for the second time, the young woman told Ambri that she would travel with Esnan.\n“To markets and sites of misfortune,” the man said. “You can find us there, if you wish.”\n“Or he-ere.”\nThe young woman grinned up at Ambri, who climbed out of the booth with her cheek singed from Idjinna’s farewell and walked to the door, who took up her sword, fastened the belt and scabbard around her waist. One hand on the hilt, Ambri said over the early afternoon quiet, “I’ll be back here, of course.”\n“We all will be back here,” said the young woman with phials in her hands. “Eve-entually.”\n7. The door, welcoming\nGlasses and plates slid on and off tables like a brocade cloth. In high-sided booths, dark blue like the late-night sky, friends and the newly met chewed and swallowed, sipped and smiled. With dried peas on their tongues they exchanged their lives.\nThe door creaked open and another entered: swamp-skinned and broad; or reptilian, ancient, the first creature ever to lay an egg in a nest; or tall and pale, dressed in scraps, wanting a drink from her begged coins and finding a booth full of people she saw plainly. They made space for her. The young woman with mismatched clothes and an intolerance for rhythms offered half a plate of chicken and couscous.\nA candle burned.\n“Welcome,” the young woman said.\nAlex Dally MacFarlane lives in London, where she is pursuing an MA in Ancient History. When not researching narrative transmission in the Alexander Romance traditions, she writes stories, found in The Other Half of the Sky, Heiresses of Russ 2013: The Year's Best Lesbian Speculative Fiction, Beneath Ceaseless Skies, Shimmer and Zombies: Shambling Through the Ages. Poetry can be found in Stone Telling, The Moment of Change and Here, We Cross. She is the editor of Aliens: Recent Encounters (2013) and The Mammoth Book of SF Stories by Women (forthcoming in late 2014)."}