{"fingerprint": "3v9+Qy/Vg+FsUVVuCZTZlQ0786M=", "sitename": "Clarkesworld Magazine", "title": "Found by Alex Dally MacFarlane", "author": "Alex Dally MacFarlane", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/macfarlane_08_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Found by Alex Dally MacFarlane", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5790 words, short story\n Found\n Star Anise\n Star anise was the contents of one drawer in my spice cabinet: was worth one good energy cell—or three not-so-good ones, or six bad ones, or eight that provided barely any power at all.\n I had never traded for just one energy cell. None remained.\n At this last asteroid, I had not traded for any. I had found its interior spaces open and airless, blast-marked, most of its equipment broken or gone, debris—shards of metal, rock, old synth materials, blackened bits of bone—still lodged in some deep crannies. In such a small asteroid, a sudden equipment failure could be unsurvivable. I knew this.\n It shook me to see it true, after the changes and losses and accidents we had adapted to.\n As I confirmed my trajectory and fired my small thrusters two times, once to get clear from the asteroid and once to push me to the next asteroid—just a bright dot in the distance, lost among the stars like another granule of salt—I couldn’t stop myself thinking: What if Aagot had lived there?\n Bay\n I placed a bay leaf on my tongue.\n I maneuvered my craft carefully into the landing crater: a process as natural, as easy as an asteroid’s spin. Still, I sighed with relief when my craft hooked into place. It wouldn’t survive a crash.\n After triple-checking the integrity of my suit, I drifted out onto the asteroid’s surface with my spice cabinet.\n Cut into another part of the asteroid was a landing bay built for spacecraft far bigger than mine: craft that would have arrived to collect platinum and iron and enough liquid hydrogen to fuel their onward journeys. A story. A dream of the past. If I could land in the landing bay, I wouldn’t have to go outside for the meters it took to reach the small airlock—outside, where the stars waited like teeth for my suit to fail—but its use required too much energy.\n When the people from Cai Nu arrived, would they be welcomed into the asteroids’ landing bays?\n I winced. I wanted to think of something else.\n I pressed the bay leaf to the roof of my mouth.\n The people of this asteroid had barely opened their mouths before the words ‘Cai Nu’ fell out. They gathered around me in the small communal room, wanting my words even more than my spices. “I have cardamom,” I said. “We managed to get it growing again.” And a few people sighed longingly, before one of them asked what people were saying privately, face-to-face—instead of on the inter-asteroid comms—about the impending arrival of the Cai Nu people. Almost everyone who lived in the asteroid was holding onto the poles running along the room’s rock walls. I counted over twenty people. Though I recognized many of the faces, not one was Aagot’s. “I don’t know much more than what’s on the comms,” I said, reluctant to admit that I rarely listened to the messages my craft picked up between the asteroids. I knew that the Cai Nu people would arrive in less than a year. I knew that our lives in the asteroids would end.\n The questions continued to come.\n Eventually they realized that I could tell them nothing. Disappointed, a few people drifted away. Others spoke: explaining how many energy cells they could give me, asking what spices that was worth.\n “What would you like?” I asked, touching the gray drawers of my cabinet. Etched into the iron were the names of the spices: star anise, cardamom pods, cloves, chilies, cinnamon bark, peppercorns, fennel seeds, coriander seeds, dried coriander leaves, dried sage leaves, juniper berries, lemongrass, dried makrut leaves, cumin seeds, dried mint leaves, dried bay leaves, sprigs of thyme and rosemary, flakes of galangal, flakes of turmeric. Flavor. Some people said that word like a plea at a shrine. Spices made our food—synthetic, completely nourishing, completely tasteless—alive, made it something we wanted to share with each other. Chewing a cardamom pod brought tears to people’s eyes. A sage leaf provoked joyous laughter.\n Nouf Kassem, who did most of this asteroid’s trade, began to point to drawers. I opened them one by one, withdrawing pouches. The items of our trade hung in the air between us. When I had given ten bad energy cells’ worth, Nouf didn’t release the handle of her box.\n “You trade as if you’ll be able to reach all the asteroids before the Cai Nu people arrive,” she said. “As if you’ve got a whole year. I hear that on Cai Nu the strips of cinnamon are as tall as the tallest woman, that they grow parsley and rose and sumac. I hear there are mounds of spices in powders. Are your family saving these spices for then?”\n Silence surrounded us, sharp as space.\n I wanted to say: What makes you think everyone’s leaving the asteroids?\n I wanted to say: Why?\n I hadn’t thought of trading all our stock, I hadn’t thought of sending a message to my mothers asking whether I should make more generous offers. I hadn’t—\n “Just a few more pouches of cumin and mint,” Nouf said.\n I gave them to her.\n In past visits, I had spent time with the people of the asteroid. I had invented stories with them. I had kissed a man called Ammar, laughed when he shrieked with joy at the bay leaf on my tongue—I had, years ago, chosen a spice per asteroid and placed that same spice on my tongue at every visit—and then I had kissed him again, shared the flavor between us. I had listened to the elders of the asteroid and played with the children and eaten turmeric-soaked food. How bright! How bitter!\n How soon until these memories would not be renewed.\n I slipped away, outside, into my craft and the space between the asteroids. The bay leaf’s taste lingered. We would not.\n Juniper Berries\n The first story Aagot gave me, with juniper berries crushed on our tongues, was one created by Aagot as a child. I couldn’t linger on that asteroid. I met Aagot there—one conversation on my trade visit, three hours of stories more precious than fuel cells.\n Aagot told me of a child who needed a name: a new name, not the birth-name that lingered at their ears like the whine of a faulty air processor, as ill-fitting as ‘girl,’ as ‘boy.’\n I remembered Aagot’s voice, saying: When the spice trader comes, they bring flavors and news and new people from other asteroids. But there’s one thing they don’t bring: new names. There’s no drawer in the spice trader’s cabinet for that. For one child, this meant never finding one that fit. But the spice trader in the story—like spice traders in many stories—took the child as an apprentice between the asteroids and there the child found their name: in the herb they most loved handling, crushing, coating their fingers with its scent. Thyme.\n I remembered Aagot’s voice, full of longing like a drawer of thyme.\n I left.\n Thyme\n I finally realized, two years later, chewing thyme on an outlying asteroid where six people stubbornly survived, that I was like Thyme: ill-suited to ‘boy’ or ‘girl.’\n Juniper Berries\n When I returned to the juniper berry asteroid—when I realized how much I needed to speak to Aagot again—Aagot had left, bought passage a year after my visit on one of the rare other craft that still functioned. There were only nineteen asteroids—eighteen, now, with the disaster in the star anise asteroid—but I didn’t visit every one annually, I didn’t undertake every one of my family’s trade journeys, I didn’t see Aagot again.\n I retold Aagot’s story to myself between the asteroids.\n Cinnamon\n One of the earliest messages sent to us by the Cai Nu people had explained our abandonment: Two hundred years ago we were too ambitious. We overextended ourselves. We should have focused on our settlements on Cai Nu, but we wanted the asteroids, we wanted the other habitable planets and moons of this solar system. So we established settlements in the Liu Yang asteroid family. Then, almost immediately, a health crisis struck and led to widespread social upheaval, in which much was lost, including knowledge of your continued survival. Now that we have recovered and grown our population, and rediscovered you, we can’t leave you living in such poor conditions.\n Cumin\n I approached the next asteroid on my trade journey. Plans traveled faster: communications sent between the asteroids. Questions. Debates. My name was mentioned often. “Lo Yiying can help bring people here.” “What’s the maximum amount of passengers and cargo that Lo Yiying’s craft carries?” “Lo Yiying, how long until you reach Iskander? Can you collect us all?” “Aside from Lo Yiying, who can fly a craft to bring people to the Lo family’s asteroid?”\n I heard, for the first time, a firm date for the Cai Nu people’s arrival: twenty-two weeks.\n I would not have my spacecraft, I would not fly spices between the asteroids, I would not drift through the corridors of asteroids with my cabinet behind me and the taste of bay or cumin or thyme in my mouth.\n Everyone would gather at my family’s asteroid. A message was sent to the Cai Nu craft, telling them the asteroid’s current co-ordinates so they could track it and adjust their approach accordingly. They confirmed its convenience for their current trajectory and fuel supplies.\n My purpose changed: to reach the next asteroid—Iskander, cumin—and collect its inhabitants and turn, like a crooked stem, back to my family’s asteroid. Sissel Haugli, who lived on the outermost asteroid at this end of the group, had already begun her journey towards the center, gathering the families I would not reach. Two people at other points in the asteroid group were also underway.\n Trade was no longer important. My cabinet’s drawers would remain unopened.\n Still I journeyed, the next asteroid gradually growing from a mote to a seed—comm-conversations not once suggesting that anyone would remain behind after the Cai Nu people arrived, very few people discussing the difficulties we would face on Cai Nu—and then, the asteroid a spinning, dark rock, I concentrated on landing.\n The landing bay door slowly opened. I carefully maneuvered my shuttle into the bay, where multiple lights shone: a brightness I rarely saw in any asteroid. The bay door closed. The unit on one wall restored air.\n It was unusual, to arrive like this.\n I instinctively went to my spice cabinet and picked up its harness.\n I entered the asteroid without it, feeling not myself—though people greeted me, entering the landing bay in family-clusters, towing their possessions, saying “Lo Yiying!” and “Thank you for coming here!” as if I brought spices and news. “Do you think you’ll be able to fit all of these boxes on your shuttle?” asked Inas Kassem, who had done most of the talking for this asteroid. “We’ve packed only important things: all of our fuel cells, the racks of moss so we can help keep your shuttle’s air fresh. We’ve got food and water tanks. And some small things. Qurans, small shrine statues, old family journals, a few personal ornaments.”\n No one else came through the small door from the asteroid. Everyone hung in front of me, looking at me, at my shuttle, at the walls—the last part of their home they would see.\n No Aagot.\n “Shall we begin loading?” asked Inas.\n “Yes.”\n I had crunched cumin seeds between my teeth before leaving my shuttle. The taste faded as we worked: arranging boxes in the cargo area of my shuttle, setting up the moss racks, deciding how people would sleep. Then we were ready. No one spoke as I closed my shuttle’s door, as Inas showed me what signal to send to open the landing bay door. It creaked, in the moment before sound was lost. Beyond, the stars gleamed—and the ones that were not stars: asteroids, Cai Nu’s planet, Cai Nu itself, smaller than a fragment of peppercorn. I didn’t know what to say. Nor did anyone. So I began our journey.\n Several people started to cry. Others talked, others remained silent, others sang: a braid of emotions in three languages, passed from mouth to mouth, lasting hours.\n I cooked.\n From the spice cabinet, secured beside my chair, I took cumin seeds and sprigs of thyme and peppercorns and cardamom pods and makrut leaves and lemongrass stalks and galangal. I cooked pot after pot, sometimes mixing spices, sometimes using just one, and passed carved chunks of the finished meal around the cargo area of my shuttle, where the people of the cumin asteroid had tethered themselves to the walls and their boxes.\n On Cai Nu we would eat food we only knew from stories: rice, noodles, dumplings, bread, meat, vegetables, sweets. Spices wouldn’t be the only flavors.\n When people started discussing this, I retreated to my seat.\n Two women followed. I knew Ma Wanlu, Inas’ daughter. The other was introduced as her wife, Bilge Yılmaz, who wanted to see Cai Nu.\n “It’s nothing,” I said. “A small dot.”\n “Our home,” Bilge murmured, rapt at the sight: as if I’d offered her a handful of cumin seeds.\n I looked away.\n “What troubles you?” Ma Wanlu asked.\n “We won’t be able to go outside. We won’t be able to work. We’ll die in that place they’re building for us, forgotten by our children, useless. Who will we be?”\n Ma Wanlu frowned. “Well, what are we now?”\n “We work—your family works on the fuel cells.”\n “Work!” Ma Wanlu almost choked on the word. “Work. Oh, we work. We desperately work to get a little more life from our dwindling resources.”\n “We are all trapped in our asteroids,” Bilge said, “working every day to ensure our habitat is still intact, that our oxygen-exchange mosses aren’t dying, that our fuel cells haven’t stopped. When my cousin’s pregnancy went wrong, what could we do? When my father got cancer, what could we do? Who will we be on Cai Nu? Not dying like this.” Bilge’s voice shook; she looked out of my craft, out at the stars and the bright dot of Cai Nu’s planet. “And we try to move between asteroids, to keep from inbreeding, and people like my mother never see their parents and siblings and aunts and uncles and grandparents again, only hear them, just hundreds of thousands of kilometers away but it’s as if they’re on a rock around that star, or that one.”\n I thought of Aagot, lost among just eighteen asteroids.\n “Here,” Ma Wanlu said, “our children will die, gasping for air.”\n “When the Cai Nu people talk about never having to worry about energy supplies,” Bilge said, “or medicine or food, I think of . . . I . . . ”\n Silence drifted between us like dust.\n “I don’t know if I want to go,” I murmured: an admission I’d made only to my spice cabinet, to the stars.\n Ma Wanlu and Bilge stared.\n Finally Ma Wanlu said, “Your family’s asteroid really must be better than all the others. I thought that was just a story.” She maneuvered herself back into the cargo area. Bilge followed. I sat alone, staring at that small dot.\n Cinnamon\n I remembered the Cai Nu people’s first message, sent in ten languages. I remembered shock and wonder. Questions. Possibilities. To know that there were people beyond the asteroids!\n I had never believed those stories.\n I had joined, as a child, in a ten-year Sending: a message flung towards the bright light we knew to be a planet and the smaller light of its moon. We had eaten cinnamon-flavored food and stayed awake for four hours, eight hours, long past the time when a reply could have come.\n We live on the moon Cai Nu, the reply had come, six years after the most recent Sending. We received your messages. Do you truly live in the asteroids?\n Somewhere on my latest trade journey, the possibilities had drifted away like carelessly handled cloves.\n They had started with questions.\n How many people live in each asteroid? How do you ensure a supply of fresh air and water? How do you celebrate New Year? What do you eat? What languages do you speak? Have you built shrines inside the asteroids? Mosques? Temples? What is your life expectancy? Your infant mortality rate? How has your bone density withstood little or no exposure to gravity? How has—\n I had tried not to think about the questions, I had tried not to think about what I knew: that our ancestors’ genes had been modified for low-gravity habitats, that it hadn’t been enough, that the people of Cai Nu were far healthier than us.\n That we wouldn’t adapt well to the 0.8G of Cai Nu.\n We have reviewed the information you’ve given us, one of their messages had said, just sixteen weeks ago. Team Leader Hu Leyi, whose voice we knew the best, had sent it: her speech carefully crafted to convey sorrow and hope. We agree that you cannot survive in the asteroids much longer. We cannot, at this point, invest in improved infrastructure in the asteroids, which means that we must bring you to Cai Nu and from there decide how and where you will live. Reassurances had followed. When you reach Cai Nu, we will ensure that there are doctors who speak all of your languages. We will build a place where you can live comfortably while we find ways for you to adapt to life on Cai Nu. We will also find ways for you to use your current skills and gain new ones. We want your futures to be prosperous.\n Reactions had fallen from my craft’s comm panel: loud, tearful, questioning, accepting.\n And there were other conversations, a mass of them like a drawer of star anise and fennel seeds.\n Team Leader Hu Leyi had asked, before their decision about our futures: Our records indicate that an experiment in agricultural production was established in the asteroid XI-258. Is that experiment on-going?\n To that, Jidarat Chanprasert—the family head of one asteroid, where I placed a sliver of galangal on my tongue—had replied: The Lo family inhabit an asteroid where spices are grown.\n How interesting! Several people here are very excited to hear this and would very much like to know more about what species have proved successful. Later, Team Leader Hu Leyi had talked of samples to be brought to Cai Nu.\n Jidarat had replied: Perhaps one of the Lo family would like to talk to Team Leader Hu Leyi about this.\n Later, I had heard Older Mother’s voice take over, giving Team Leader Hu Leyi the full history of our fields, our production methods, our trade with the other asteroids. I imagined Older Mother walking among the fields inside our asteroid with Younger Mother at her side, talking as they worked.\n Sometimes individuals—not heads of an asteroid’s family, not important, knowledgeable people—got onto one of the comm units. One child asked: How many classes are there at your schools?\n Team Leader Hu Leyi—or one of her colleagues—replied to every question. There are many classes: mathematics, science, agriculture, history, literature, music, many different types of engineering, many languages.\n A day later, the girl said: I want to make plants!\n A colleague replied: We have a great interest in bioengineering at the moment, as we progress with the terraforming of the still-unnamed third planet in the system. It is a very exciting field.\n Can I do that?\n Of course! We will provide an education for all of the children and any adults who want it. We want you to do work that fulfills you, whether it is in bioengineering or finance or poetic composition.\n The Cai Nu person sounded delighted by the girl’s interest, but the conversation did not turn to our adaptation. Perhaps it would be easier for children. Perhaps the Cai Nu people didn’t know how much could be achieved with their technology.\n In my comm’s chiming I had heard excitement. I had heard joy: to listen to stories of millions of people, stories of great temples and mosques, stories of New Year celebrations that filled thousands of streets with food and color and people, and religious festivities and Landing, the anniversary of arriving on Cai Nu from a different star system, and birthdays in families of over a hundred relations—to listen to this was to marvel, to disbelieve, to hope.\n Two days before my arrival at the cumin asteroid, Team Leader Hu Leyi had finally admitted what I had feared: It will be very difficult for you. Your bodies have adapted to the absence of gravity. You will not be able to step from the landing craft onto the surface of our world, but we are building you a zero-gravity habitat, we are already researching the possibilities of technologically-assisted adaptation. However you are able to live here, we will strive to ensure comfort. You will never hunger, never lack medicine, never lack people to talk to. And your children will have every possibility laid out before them.\n I had replayed this message until I knew it as well as Aagot’s story.\n Thyme\n I feared many things, but this was what stuck in me like a blockage in an air supply pipe, like a star anise’s point in a throat: what if people didn’t understand me. I imagined people like Thyme being so rare that they laughed. I imagined the people whose languages used gendered pronouns insisting that I choose male or female. I imagined every one of these one million people needing to be told that I was un-gendered, a different gender—if I didn’t even know what to call myself, how could I expect to be taken seriously?—the way I had needed to tell everyone I knew in the asteroids when I was younger. I imagined giving up.\n I told myself to stop being foolish. How could one million people have only two fixed genders?\n But the only other person like me in all the asteroids was Aagot, who I couldn’t find.\n Fields\n It was not quite the last time I would approach my family’s asteroid: that pitted, dark peppercorn-shape, orbited by a moon only three kilometers in diameter, that landscape at the heart of my personal stories. Home. No, it was not quite the last time I would approach it, but I hurt enough to believe it was.\n “Big Cousin!” my youngest cousin’s voice came in over the comm. “We’re opening the smaller landing bay for you. Bring everyone in!”\n A hole slowly opened in the asteroid’s side.\n I wordlessly landed my craft, waited for the bay doors to close and the air to return, waited for the signal to unlock my craft’s door. Unloading began. My family emerged from the corridors to help: to organize the storage of possessions, to lead people to places they could sleep and spend time until the Cai Nu people arrived.\n I slipped away to the fields.\n They filled four vast rooms: stacked shelves holding soil and spice-plants. I drifted above them, perpendicular to their ends, looking along each shelf at sage bushes, carefully stunted cinnamon trees, red-fruited chilies, long fennel stalks fronded with white flowers, clusters of bay and berry-heavy juniper and green-leafed plants hung with the star-seeds of anise. So many smells: green and sharp and sweet. Home-smells.\n Many plants had been recently harvested: leaves thinned out—taken for drying—and seeds picked. Others soon would be. Our last harvest.\n I went to a cluster of star anise plants.\n The light gravity generator in the shelf pulled me to the soil. Clods between my toes. Glossy leaves against my legs. The weight of my body startled me, pulled me to my knees. I steadied myself. It was always uncomfortable, returning to the fields after a long journey. Soon—no. I sat. I placed an unripe seed—green, eight-pointed—on my tongue, I dug my fingers into the soil. My skin already smelled of the fields: green, earthy. Home.\n Would I ever work in a field on Cai Nu? Would I ever adjust to that much gravity?\n I wanted to think of nothing but star anise against my tongue, against my skin.\n Younger Mother’s voice cut through the air. “Oldest Child? Is that you?”\n “Yes.”\n Boots clanged on metal: she climbed down from far above me, shelf to shelf, until she appeared at the end of mine and swung herself onto the soil with an ease I lacked. A bag of cinnamon hung from her shoulder. She walked towards me with bark-stained fingers and bare feet—and the way she walked, straight-backed and sturdy, reminded me suddenly of the pictures of the Cai Nu people.\n “I didn’t hear you working,” I said.\n “I was thinking about, well, a lot of things.” She crouched at my side, smiling. “Why are you in here?”\n “I wanted to sit in the fields, as we’ll be abandoning them soon.”\n My voice was as brittle as a dried cardamom pod.\n Younger Mother’s smile faded.\n I looked away, at the soil, at the star anise, as my mother quietly said, “It will be better. For everyone. Just—just imagine the fields there! Real fields, laid flat across the ground not stacked like this, like shelves because we don’t have to room to do it any other way—and sunshine!”\n “I see the sun regularly,” I murmured.\n Above our heads, the underside of the next shelf held UV lights that replicated the sun for the plants: a constellation of hundreds across the fields.\n “I’ve read about rain and snow in a thousand poems,” Younger Mother said, “but to see them! To feel them on my skin!”\n We—I—wouldn’t. I had grown up in the fields, gravity on my bones, but I had spent so much of the past ten years among the asteroids. I loved it: the cumin or clove or galangal on my tongue, the spice cabinet doors sliding open, the happiness I brought, the stories shared. But I doubted my body was much healthier than those of the people I traded with.\n Would my field-working family adapt quickly? Would they work in real fields?\n “And they will have new spices there,” Younger Mother said, running her fingers over the star anise’s leaves. “New flavors. New—so much.”\n New spices.\n “It will be better.”\n “And difficult,” I said. “No one seems to want to talk about that.”\n “What else can we do? You know this, you see the other asteroids and everything that’s broken and old in them.”\n I remembered the star anise asteroid, broken open like a seed casing, all its contents—its people, who I had once known—spilled out.\n “I need to get back to harvesting,” Younger Mother said. “I know there won’t be much need for all this on Cai Nu, but it would be a shame for it to go to waste.”\n “I’ll eat it.”\n She smiled, then left me among the star anise plants, their seeds hanging around me like the view from an asteroid’s surface. I couldn’t imagine any other view.\n I returned to my craft, to my journey—not a trade journey, any more.\n Cinnamon, Turmeric, Rosemary, Cloves, Galangal, Sage\n I started to forget to place spices on my tongue as I arrived at each asteroid, collecting its people—bringing them closer to the Cai Nu people’s arrival. I started—slowly, reluctantly—to think of the ways life on Cai Nu would be better for them, for me.\n Found\n Everyone gathered. Everyone. Who had ever imagined such a sight? So many people holding onto the walls or drifting carefully, so many bags and boxes tethered with them, so many voices all at once—people who had never seen each other, only spoken over the comms, suddenly able to talk unending, to shyly smile and embrace and unhesitatingly kiss. A wonder. A hundred people, another hundred, another. A community, not stretched out like sparse flowers on an ill chili plant but here, together, one. Everyone.\n I couldn’t deny my excitement. I couldn’t subdue my fear.\n I looked and looked for Aagot.\n Older Mother had set up comm units throughout the large loading bay, so that her voice could be heard everywhere in that vast space, among so many people. Periodically she said, “The Cai Nu craft is now two hours away!” and, “The Cai Nu craft is continuing its steady course, only an hour away!” until, suddenly, too soon, “The Cai Nu craft will enter the landing bay in ten minutes.” I drifted through the loading bay. Around me, people drew in breath together, a long silence before new conversations streamed out like air into space.\n Then—so soon—we heard the grinding as the landing bay doors opened for the first time in over a hundred years. We heard nothing, nothing, noise lost in vacuum—then a gentle set of metal-on-metal sounds. The Cai Nu craft landing. I drifted, unseeing. I only knew sounds. Arrival. The landing bay doors closing again. The first set of airlock doors between the two bays opening. I didn’t breathe, I didn’t speak—no one did. I reached a wall. I held.\n The second set of airlock doors opened.\n The people—five of them—wore dark blue suits and helmets with clear visors, but I was too far away to see their faces. Into our silence they slowly entered, using the handrails that spread across the wall like roots. They removed their helmets. They looked at us with cautious smiles. One said in Mandarin, “I am Team Leader Hu Leyi. It is a pleasure to finally be here and meeting you all.”\n Older Mother drifted forward, saying, “I am Lo Minyu. On behalf of everyone: welcome. You are very welcome here.”\n The other four Cai Nu people looked around the loading bay, as if trying to match faces to the voices they had heard over the comms.\n “Are you all here?” Hu Leyi asked.\n What did they think of us? What did they—\n I saw, then, a long, thin braid of hair with a circular metal ornament fixed to its end.\n I remembered: etched with a person crouched inside the shape of a bear.\n “Aagot!” Then fear reached my tongue and I couldn’t talk. Was this Aagot? Was this some other person, who did not know me, did not want to talk to me—\n The person turned.\n “Aagot,” I managed.\n A slight frown. “Ecralali, now.”\n Now. A name-change—a reason I hadn’t been able to find Aagot Fossen, who no longer existed.\n “Did we meet when I was younger?” Ecralali asked.\n “Yes. Yes. I am Lo Yiying.”\n Quietly, Ecralali said, “I know you.”\n “Years ago, we talked about—” One or two people were interested in our conversation. I wanted privacy. I wanted no one to judge our words unimportant, irrelevant. Most of all, I wanted Ecralali to remember me. “We talked about Thyme and gender and—” I might as well have bared my skin in the space between the asteroids. “It was the most important conversation I’ve ever had.”\n Ecralali’s face changed: astonishment and delight. Unless I interpreted wrongly, unless I imagined—\n “I remember,” Ecralali said, “I remember telling you about un-gendered Houyi—”\n “I’d only ever known Houyi as a woman before then,” I said, as full of wonder as if I was hearing the tale of Chang E and Houyi for the first time. “That’s how my mothers always tell the story.”\n “—and the story of the stars, whose lives are not measured in gender.”\n “Thyme,” I said, fennel-foliage soft, “who is like me.”\n “Yes.”\n Hu Leyi and her colleagues were still talking: moving among us, taking names, inventorying possessions, dividing us into groups.\n “I know more stories now,” Ecralali said.\n “I—I would like to hear them.”\n “I know about Cai Nu—the founder, not the moon—I’ve read everything in our records, listened to every story. A lot of them tell that Cai Nu was fluidly gendered.”\n “The founder was . . . ”\n Ecralali’s smile was as rich as a whole cabinet of spices.\n I half-heard announcements. We would have a room for each family on the Cai Nu people’s spacecraft, as well as several communal spaces, connected by a long corridor. I thought of stems. I thought of floating above the spices still growing on the shelves of my family’s fields. They would shrivel and die and I would never again be Lo Yiying the spice trader. I would be far from my home. Then we would reach Cai Nu. Gleaming. Strange. Skied.\n Storied.\n “I want to know what stories are told there,” Ecralali said.\n “I would listen to every one.”\n It hadn’t occurred to me—\n I had needed to explain myself to my family, to people among the asteroids. Before that—to myself. That had taken almost twenty years. I had only found myself in the stories that fell from Ecralali’s—once-Aagot’s—mouth like star anise. To even imagine that I might be found in other stories—\n I hadn’t.\n “My favorite stories,” Ecralali said, “are those that say ‘Cai Nu’ is a chosen name.”\n One of Hu Leyi’s colleagues reached us. As Ecralali said, “Ecralali Fos,” and pointed to just one small bag, I thought of my own name: a gift from my mothers. Could I—No. I still wanted it. It had clung to me, all these years, like a grain of soil under a fingernail: a welcome reminder of my family on the long journeys between the asteroids. It fit me.\n Below us, the first group passed through the airlock doors to the spacecraft.\n “Lo Yiying,” I said, and my voice was almost steady. “My possessions are with my family—Lo Minyu and Xu Weina are my mothers.” I didn’t think I needed to list the rest of my family—brother, cousins, aunts, uncles, a single grandfather. They all waited together, with the spice cabinet—full of the final harvest—between them.\n The man made a note on the translucent screen that hovered in front of him, then moved on.\n “I should go to my family,” I said, though I couldn’t imagine moving, couldn’t imagine any of what would happen next.\n “We have months of journeying ahead of us,” Ecralali said. “Plenty of time for telling stories.”\n Thyme\n The fourth story Ecralali gave me, with thyme on our tongues, was of Cai Nu: working on a team of scientists identifying planets and moons suitable for human settlement, finding the moon that would eventually bear their name, spending decades preparing the team for the long journey and the tireless tasks at the other end—then, being invited to join the team despite their advanced age.\n Cai Nu lived a year on the moon before finally dying. They are remembered forever: their vision of people living on this moon, their hard work making it more than a story.\n Their name, chosen in the same year that they first saw a promising moon in their data.\n I pressed the thyme to the roof of my mouth.\n I was not alone.\n Alex Dally MacFarlane lives in London, where she is pursuing an MA in Ancient History. When not researching narrative transmission in the Alexander Romance traditions, she writes stories, found in The Other Half of the Sky, Heiresses of Russ 2013: The Year's Best Lesbian Speculative Fiction, Beneath Ceaseless Skies, Shimmer and Zombies: Shambling Through the Ages. Poetry can be found in Stone Telling, The Moment of Change and Here, We Cross. She is the editor of Aliens: Recent Encounters (2013) and The Mammoth Book of SF Stories by Women (forthcoming in late 2014)."}