{"fingerprint": "vGROhepoi6g4wmXG/qFBmqIuMXI=", "sitename": "Clarkesworld Magazine", "title": "Eyes of the Crocodile by Malena Salazar Maciá, translated by Toshiya Kamei", "author": "Malena Salazar Maciá; Toshiya Kamei", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/macia_02_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Eyes of the Crocodile by Malena Salazar Maciá, translated by Toshiya Kamei", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2450 words, short story\n Eyes of the Crocodile\n My return to our ancestral roots began with a crocodile’s eye that sprouted on my right breast. It felt like a grazing kiss from a razor-sharp bamboo tip, or the sting of the cold current of a river that once flowed on the ruined Earth. I chewed on bitter, nameless herbs to soothe my pain. Still, I wasn’t bleeding.\n I’d spotted the eye when I undressed to bathe. The bump was still swollen and tender to touch. It stared at me from my shivered, erect areola. Another eye hadn’t yet appeared. It was a matter of time.\n Our memory nanobots were programmed to instill in us the traditions handed down from our ancestors many millennia ago. Our rituals survived even humanity’s hunger for technology.\n Years ago, I’d have been delighted to have obtained, by chance, modification nanobots, because it meant that the history of my people was going to live with me. I’d have worn our past with pride. Even better if the nanobots had carved into my skin geometric shapes that exalted my feminine traits.\n However, I wasn’t supposed to have a crocodile’s eye. The ritual scarification was meant for men. Besides, in recent years, the ceremony had come to bear ominous tidings.\n The nanobots originally designed to watch over the meager remains of humanity no longer kowtowed to their creators.\n Thus, when I found the crocodile’s eye on my right nipple, I knew the universe had condemned me. My husband, Chioke, was a crocodile man. His scarification ceremony took place at the shelter where we’d taken refuge. When it was complete, he bled to death.\n I broke the rules. As Chioke bled, my tribemates turned away and bit their lips, their arms pressed tightly against their sides. Nobody tried to stop the blood spewing from his scars. I laid him on my lap and sang for him until every trace of warmth had vanished from his body.\n The following day, another eye sprouted on my left breast. This time, I didn’t bleed either. The swelling on my right breast had gone down. The skin looked darker, showing signs of necrosis. The nanobots didn’t mark my skin as fast as they did with Chioke. They seemed to have woken from hibernation because of the radioactive contamination in the domed shelter.\n I put on an airtight suit and left behind the place I called home, albeit briefly. Home? I wasn’t going to need it anymore. I made my sentence public and unleashed panic among my tribe.\n “Your sentimentality will get us all killed!”\n “You could’ve said goodbye to Chioke without touching him.”\n “I wouldn’t trust that suit. It may have a leak!”\n “Who else had physical contact with you, Mandisa?”\n “Sacrifice! Before it’s too late! Sacrifice! For the rest of us! For our survival!”\n “You shall have that,” I declared, as the infrared lenses on my visor revealed the nanobots creeping under my skin. They began carving scales on my shoulders. “I need to leave here—before the nanobots evolve and infect all of you. Give me a hovercraft and let me go to the Tree. After all, I’m already doomed.”\n “If you succeed, you’ll survive,” a woman shouted as her mouth twisted in contempt. “But you’ll be scared. You won’t be able to get rid of the nanobots. What if everything starts again? You’ll tread among us with that dormant curse! The death-bearer!”\n “On Earth, the ceremony was the highest honor a warrior could receive.” I raised my hands, like the mother goddess in the files we kept during our flight. “It’ll be a mark of triumph! I’ll find a way to remove the nanobots from my body. The Tree will do the work.”\n I didn’t need to insist. They didn’t want me around the shelter, where anyone could touch me by accident. I needed to go somewhere else, a place where no one could see me and recall the fall of civilization. The nanobots pricked my shoulders like a pin. They grazed my nerve fibers for a fraction of a second, long enough to spread numbness through my body. None had torn my skin. They refined their technique after doing a botched job with my beloved Chioke.\n In a hangar located on the edge of the shelter, my tribemates left everything I asked for: provisions, a hovercraft, and a chip with the new program for the Tree. When the sensors confirmed that there was no biological form near the limits of the dome, I was allowed to leave. I didn’t look back, but I heard the gates creak shut behind me.\n I snuck into the part of the planet abandoned to its fate, a pasture of runagate medical nanobots. The bones of biological forms, cloned from terrestrial DNA reserves, populated the wasteland in large numbers and in great variety. Below me was a whitish forest of rigid structures. The earth began to crack, affected by the toxic chemicals mishandled by the nanobots. Puffs of dust rose beneath the hovercraft.\n The disaster that led the planet to ruin broke out because alarms didn’t go off until it was too late. The Tree was corrupt and didn’t detect the danger harbored by the free-rein nanobots: swimming through our bloodstreams, plucking small genetic traces, nibbling tiny bits of discarded food. They created, for the sake of perpetuating themselves, copies of themselves. Each copy contained several corrupt lines, errors from its original program.\n The ones that controlled the flu rebelled. The insulin generators and psychoactive drug liberators followed suit. They released, with immediate effect, more medicine than necessary, without limits. What was supposed to be salvation became death. The antivirus was too late. The nanobots had rewritten themselves to become immune. The only way to eradicate them from the human body was to undergo a risky electroshock session to fry the circuits.\n Calm descended upon those of us who survived. But not for long. The nanobots took shelter in other biological forms. They analyzed. They rewrote themselves. And they started invading their original hosts again, determined to take their lives away. We humans gave up ground. We lost contact with animals. We now interacted without physically touching each other. The nanobots didn’t spread by air or land. Only through physical contact.\n When the star of this planet slid beneath the horizon, the darkness of the night engulfed me. Spending so much time in stress took its toll on me. I missed sleeping under open skies.\n I stopped the hovercraft and stepped onto the ground, on a path carpeted with bones that once belonged to a herd of mammals.\n I felt no fear. It no longer mattered what would happen to me. I crawled out of the airtight suit and remained naked. A faint breeze caressed my thighs, hardened my nipples, and fiddled around the crocodile’s eyes. The dormant nanobots on the skeletal remains woke up. A swarm of them started snaking between my toes, producing a sharp pinprick pain.\n A sudden shiver shook me. I was alive. My entrails trembled. I took a deep breath and stretched my arms above my head, reaching into the vastness off-limits to us. After all, leaving the planet meant spreading the disease to the rest of the universe. We, the scarified ones, were doomed to solve the problem on our own.\n Now wide-awake, the memory nanobots shot a mixture of rituals into my mind, into my mouth. I mumbled and hummed a tune.\n “Omi omo Yemayá!” My body trembled, twisting in elegant, haughty gestures. I looked back over my shoulder, turned my head, and mimicked the flow of the current, rivers, and the seas. Of Earth, which was long ago my ancestors’ home, so lost in time.\n I stroked the invisible waves with my hands. My fingertips touched the wet foam. I shook my womb and watered fertility over the bones scattered along the path.\n “Odò Ìyá!” I changed the rhythm of my dance, surrendering myself to a euphoric ecstasy, to join the thousands who came before me. I rowed a boat. I raised my arms. I shook them, covered with imaginary copper bracelets. I thought I heard the rattle of copper.\n “Ore Yèyé o!” I was a tapestry of history. My skin was embroidered with crocodile scales. The eyes on my breasts glanced over the dying planet.\n The following morning, I woke up shivering with cold. I curled up on the pile of crushed bones. I rose and felt burning pain in my joints. The nanobots kept up with their task of carving my back. My scarification was almost complete. I didn’t want to know how close they were to making a fatal error. They could certainly tear my scales open and make me bleed, like what happened with Chioke. I didn’t know what to make of the new nanobots, which, eager for a new biological organism, had seeped through my feet.\n I slipped into the airtight suit just as the fever began to curl up in my head. I returned to the hovercraft and continued on my way to the Tree. When we fled to the shelter, we began developing programs to find a way to prevent codes from being corrupt. We did it. I took part in the creation of a patch. The one I carried on the chip.\n The city was silhouetted in gray against the clear, decaying sky. Ruins of buildings were more serious obstacles than pieces of bones scattered across the wasteland. An aborted terraforming station was swallowed by the natural environment of the planet. Nature recovered, little by little, what once it possessed. Gray moss spread wherever green vegetation would have proliferated.\n I ditched the hovercraft when the path narrowed. The nanobots crawled across my back, tireless weavers. For a few minutes, I forgot them and recalled bamboo cane tips. Together with their co-conspirators, the memory nanobots plotted a deceptive farce. The cramp in my thighs let me know how close they were to completing their task. How close I was to death. Fear lodged in my chest.\n Hobbled by pain, I trod among the ruins of the city. I had to reach the Tree and place the chip. Saving my tribe. Saving myself. Shutting them up. Becoming a crocodile woman in honor of my Chioke. Showing that we wore our scales with pride. Carrying history in our skin, the future of the human race, so dispersed through the known universe.\n The building that housed the Tree soared tall and straight in the middle of the city. It was the only one with no signs of degradation, as if hosting its own swarm of nanobots that kept it unpolluted. The place looked anachronistic in the midst of chaos.\n It was locked. I thought I might have to kick the door down, but a tingling sensation gathered in my fingertips resting on the structure. The glass door slid open silently.\n When I lumbered into the deserted hall, the hum of auxiliary photovoltaic generators reached my ears. The Tree had to be asleep, just as the modification nanobots were in my blood.\n The elevators were out of commission. When I trudged up the stairs, the first scale tore and blood began to trickle into my airtight suit. The same thing happened to Chioke. Despite the cramp, anxiety, sweat, and nausea that threatened to tip me over, I dragged myself along the railing until I reached the Tree.\n It stood tall in the middle of the room. The trunk looked like a pillar of smoked-gray glass. The branches, whose thickness varied from an elephant’s leg to a strand of hair, intertwined with the ceiling, held it, swarmed it, and grew throughout the city, veins of dormant technology.\n Pain stole my breath. I was bleeding as if bamboo tips lacerated my skin ceaselessly. Thick liquid gathered in my pants, inside my rubber boots. I splashed at every step. The nanobots seemed to feel choked. Crushed. They surely conspired to develop a new line of code to go beyond the limits of biological forms. Seizing hold of dust motes, embedded in grains of sand, they would ride the wind. To the domed shelter. And they would herald death through the crocodile’s eyes.\n As my breath fogged on my clear plastic visor, I activated the auxiliary generators and redirected the energy on the control panel. The Tree began to wake up with a humming noise. Erratic lights signaled the increasingly accelerated processing. I took the chip from the sterile container and inserted it into the processing slot before my body buckled in a seizure.\n The crazed memory nanobots stimulated my mind with a barrage of disjointed images as I crumbled to the ground. I was inside the mouth of a mystical snake, next to a being who was neither man nor woman. I carried a child in my arms and hid it next to a ceiba tree. I brandished a double-axe, invoked lightning, and healed a father. I was a woman born from an ostrich egg. I broke a vessel against the ground and from it a river was born. It took me to the sea. Along with my thousands of faces that began to sink into the darkness, a proud tree proclaimed to reach heaven, and it was punished by the gods to have its roots above and its branches underground.\n When the darkness left my mind, the taste of iron filled my mouth. I feared I didn’t have much time left. The crocodile would devour me alive, bursting from my back in dozens of bleeding lacerations, just like my Chioke. Yet I was still alive. I looked up and stared at the Tree, an artificial baobab. It was plagued with paths of neon. They flickered as data were processed.\n The cramp caused by the bamboo tips had ceased. The correct dose of sedative ran through my body, my skin, between my fingers, across my cheeks.\n I ripped off my airtight suit. The crocodile’s eyes, which turned into metal implants, watched me from my breasts. I examined my iron nail fingers. I slid my fingers over my scarified thighs, covered with silver, armor made from the inside of my being. With each move, I felt the rigid inlays on my back. The code transmitted to the nanobots had reprogrammed them in a strange way. Humans had to endure, be saved. No harm. No destruction. No killing. Serve. Protect. Preserve.\n The blood had dried inside my rubber boots. I tore off the last piece of my airtight suit and left the Tree. I was no longer Mandisa, Chioke’s wife. I was no longer the human who needed the memory nanobots to remind her where she came from. I left the building as a crocodile woman.\n I’d returned to my roots.\n Malena Salazar Maciá was born in Havana, Cuba, where she still lives today. A winner of multiple literary awards, she has authored several books, including Nade (2016), Las peregrinaciones de los dioses (2018), and Aliento de Dragon (2020). English translations of her short stories have appeared in venues such as The Future Fire, Mithila Review, and Selene Quarterly Magazine. In addition, her work has been translated into Croatian, German, and Japanese."}