{"fingerprint": "uffKrQKbkGzU6LAfcuw+jtlyD+Q=", "sitename": "Clarkesworld Magazine", "title": "Nevermore by Ian R. MacLeod", "author": "Ian R MacLeod", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/macleod_08_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Nevermore by Ian R. MacLeod", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9630 words, novelette, REPRINT\nNevermore\nNow that he couldn’t afford to buy enough reality, Gustav had no option but to paint what he saw in his dreams. With no sketchpad to bring back, no palette or cursor, his head rolling up from the pillow and his mouth dry and his jaw aching from the booze he’d drunk the evening before—which was the cheapest means he’d yet found of getting to sleep—he was left with just that one chance, and few trailing wisps of something that might once have been beautiful before he had to face the void of the day.\nIt hadn’t started like this, but he could see by now that this was how it had probably ended. Representational art had had its heydays, and for a while he’d been feted like the bright new talent he’d once been sure he was. And big lumpy actuality that you could smell and taste and get under your fingernails would probably come back into style again—long after it had ceased to matter to him.\nSo that was it. Load upon load of self-pity falling down upon him this morning from the damp-stained ceiling. What had he been dreaming? Something—surely something. Otherwise being here and being Gustav wouldn’t come as this big a jolt. He should’ve got more used to it than this by now . . . Gustav scratched himself, and discovered that he also had an erection, which was another sign—hadn’t he read once, somewhere?—that you’d been dreaming dreams of the old-fashioned kind, unsimulated, unaided. A sign, anyway, of a kind of biological optimism. The hope that there might just be a hope.\nArthritic, Cro-Magnon, he wandered out from his bed. Knobbled legs, knobbled veins, knobbled toes. He still missed the habit of fiddling with the controls of his window in the pock-marked far wall, changing the perspectives and the light in the dim hope that he might stumble across something better. The sun and the moon were blazing down over Paris from their respective quadrants, pouring like mercury through the nanosmog. He pressed his hand to the glass, feeling the watery wheeze of the crack that now snaked across it. Five stories up in these scrawny empty tenements, and a long, long way down. He laid his forehead against its coolness as the sour thought that he might try to paint this scene speeded through him. He’d finished at least twenty paintings of foreal Paris; all reality engines and cabled ruins in grey, black, and white. Probably done, oh, at least several hundred studies in ink-wash, pencil, charcoal. No one would ever buy them, and for once they were right. The things were passionless, ugly—he pitied the potentially lovely canvases he’d ruined to make them. He pulled back from the window and looked down at himself. His erection had faded from sight beneath his belly.\nGustav shuffled through food wrappers and scrunched-up bits of cartridge paper. Leaning drifts of canvas frames turned their backs from him towards the walls, whispering on breaths of turpentine of things that might once have been. But that was okay because he didn’t have any paint right now. Maybe later, he’d get the daft feeling that, today, something might work out, and he’d sell himself for a few credits in some stupid trick or other—what had it been last time; painting roses red dressed as a playing card?—and the supply ducts would bear him a few precious tubes of oils. And a few hours after that he’d be—but what that noise?\nA thin white droning like a plastic insect. In fact, it had been there all along—had probably woken him at this ridiculous hour—but had seemed so much a part of everything else that he hadn’t noticed. Gustav looked around, tilting his head until his better ear located the source. He slid a sticky avalanche of canvas board and cotton paper off an old chair, and burrowed in the cushions until his hand closed on a telephone. He’d only kept the thing because it was so cheap that the phone company hadn’t bothered to disconnect the line when he’d stopped paying. That was, if the telephone company still existed. It was chipped from the time he’d thrown it across the room after his last conversation with his agent. But he touched the activate pad anyway, not expecting anything more than a blip in the system, white machine noise.\n“Gustav, you’re still there are you?”\nHe stared at the mouthpiece. It was his dead ex-wife Elanore’s voice.\n“What do you want?”\n“Don’t be like that, Gus. Well, I won’t be anyway. Time’s passed, you know, things have changed.”\n“Sure, and you’re going to tell me next that you—”\n“—Yes, would like to meet up. We’re arranging this party. I ran into Marcel in Venice—he’s currently Doge there, you know—and we got talking about old times and all the old gang. And so we decided we were due for a reunion. You’ve been one of the hardest ones to find, Gus. And then I remembered that old tenement . . . ”\n“Like you say, I’m still here.”\n“Still painting?”\n“Of course I’m still painting. It’s what I do.”\n“That’s great. Well—sorry to give you so little time, but the whole thing’s fixed for this evening. You won’t believe what everyone’s up to now. But then I suppose you’ve seen Francine across the sky.”\n“Look, I’m not sure that I—”\n“—And we’re going for Paris, 1890. Should be right up your street. I’ve splashed out on all-senses. And the food and the drink’ll be foreal. So you’ll come, won’t you? The past is the past and I’ve honestly forgotten about much of it since I passed on. Put it into context, anyway. I really don’t bear a grudge. So you will come? Remember how it was, Gus? Just smile for me the way you used to. And remember . . . ”\nOf course he remembered. But he still didn’t know what the hell to expect that evening as he waited—too early, despite the fact that he’d done his best to be pointedly late—in the virtual glow of a pavement café off the Rue St-Jacques beneath a sky fuzzy with Van Gogh stars.\nSearching the daubed figures strolling along the cobbles, Gustav spotted Elanore coming long before she saw him. He raised a hand and she came over, sitting down on a wobbly chair at the uneven swirl of the table. Doing his best to maintain a grumpy pause, Gustav called the waiter for wine and raised his glass to her with trembling fingers. He swallowed it all down. Just as she’d promised, the stuff was foreal.\nElanore smiled at him. And Elanore looked beautiful. Elanore was dressed for the era in a long dress of pure ultramarine. Her red hair was bunched up beneath a narrow-brimmed hat adorned with flowers.\n“It’s about now,” she said, “that you tell me I haven’t changed.”\n“And you tell me that I have.”\nShe nodded. “But it’s true. Although you haven’t changed that much, Gus. You’ve aged, but you’re still one of the most . . . solid people I know.”\nElanore offered him a Disc Bleu. He took it although he hadn’t smoked in years and she’d always complained that the things were bad for him when she was alive. Elanore’s skin felt cool and dry in the moment that their hands touched, and the taste of the smoke as it shimmered amid the brush strokes was just as it had always been. Music drifted out from the blaze of the bar where dark figures writhed as if in flames. Any moment now, he knew, she’d try to say something vaguely conciliatory, and he’d interrupt as he attempted to do the same.\nHe gestured around at the daubs and smears of the other empty tables. He said, “I thought I was going to be late . . . ” The underside of the canopy that stretched across the pavement blazed. How poor old Vincent had loved his cadmiums and chromes. And never sold one single fucking painting in his entire life.\n“What—what I told you was true,” Elanore said, stumbling slightly over these little words, sounding almost un-Elanore-like for a moment; nearly uneasy. “I mean, about Marcel in Venice and Francine across the sky. And, yes, we did talk about a reunion. But you know how these things are. Time’s precious and, at the end of the day it’s been so long that these things really do take a lot of nerve. So it didn’t come off. It was just a few promises that no one really imagined they’d keep. But I thought—well I thought that it would be nice to see you anyway. At least one more time.”\n“So all of this is just for me. Jesus, Elanore, I knew you were rich, but . . . ”\n“Don’t be like that, Gustav. I’m not trying to impress you or depress you or whatever. It was just the way it came out.”\nHe poured more of the wine, wondering as he did so exactly what trick it was that allowed them to share it.\n“So you’re still painting?”\n“Yep.”\n“I haven’t seen much of your work about.”\n“I do it for private clients,” Gustav said. “Mostly.”\nHe glared at Elanore, daring her to challenge his statement. Of course, if he really was painting and selling, he’d have some credit. And if he had credit, he wouldn’t be living in that dreadful tenement she’d tracked him down to. He’d have paid for all the necessary treatments to stop himself becoming the frail old man he so nearly was. I can help, you know, Gustav could hear Elanore saying because he’d heard her say it so many times before. I don’t need all this wealth. So let me give you just a little help. Give me that chance . . . But what she actually said was even worse.\n“Are you recording yourself, Gus?” Elanore asked. “Do you have a librarian?”\nNow, he thought, now is the time to walk out. Pull this whole thing down and go back into the street—the foreal street. And forget.\n“Did you know,” he said instead, “that the word reality once actually meant foreal—not the projections and the simulations, but proper actuality. But then along came virtual reality, and of course when the next generation of products was developed the illusion was so much better that you could walk right into it instead of having to put on goggles and a suit. So they had to think of an improved phrase, a super-word for the purposes of marketing. And someone must have said, Why don’t we just call it reality?”\n“You don’t have to be hurtful, Gus. There’s no rule written down that says we can’t get on.”\n“I thought that that was exactly the problem. It’s in my head, and it was probably there in yours before you died. Now it’s . . . ” He’d have said more. But he was suddenly, stupidly, near to tears.\n“What exactly are you doing these days, Gus?” she asked as he cleared his throat and pretended it was the wine that he’d choked on. “What are you painting at the moment?”\n“I’m working on a series,” he was surprised to hear himself saying. “It’s a sort of a journey-piece. A sequence of paintings which begin here in Paris and then . . . ” He swallowed. “ . . . bright, dark colors . . . ” A nerve began to leap beside his eye. Something seemed to touch him, but was too faint to be heard or felt or seen.\n“Sounds good, Gus,” Elanore said, leaning towards him across the table. And Elanore smelled of Elanore the way she always did. Her pale skin was freckled from the sunlight of whatever warm and virtual place she was living. Across her cheeks and her upper lip, threaded gold, lay the down that he’d brushed so many times with his the tips of his fingers. “I can tell from that look in your eyes that you’re into a really good phase . . . ”\nAfter that, things went better. They shared a second bottle of vin ordinaire. They made a little mountain of the butts of her Disc Bleu in the ashtray. This ghost—she really was like Elanore. Gustav didn’t even object to her taking his hand across the table. There was a kind of abandon in all of this—new ideas mixed with old memories. And he understood more clearly now what Van Gogh had meant about this café being a place where you could ruin oneself, or go mad or commit a crime.\nThe few other diners faded. The virtual waiters, their aprons a single assured grey-white stroke of the palette knife, started to tip the chairs against the tables. The aromas of the Left Bank’s ever-unreliable sewers began to override those of cigarettes and people and horse dung and wine. At least, Gustav thought, that was still foreal . . .\n“I suppose quite a lot of the others have died by now,” Gustav said. “All that facile gang you seem to so fondly remember.”\n“People still change, you know. Just because we’ve passed on doesn’t mean we can’t change.”\nBy now, he was in a mellow enough mood just to nod at that. And how have you changed, Elanore? he wondered. After so long, what flicker of the electrons made you decide to come to me now?\n“You’re obviously doing well.”\n“I am . . . ” She nodded, as if the idea surprised her. “I mean, I didn’t expect—”\n“—And you look—”\n“—And you, Gus, what I said about you being—”\n“—That project of mine—”\n“—I know, I—”\nThey stopped and gazed at each other. Then they both smiled and the moment seemed to hold, warm and frozen, as if from a scene within a painting. It was almost . . .\n“Well . . . ” Elanore broke the illusion first as she began to fumble in the small sequined purse she had on her lap. Eventually, she produced a handkerchief and blew delicately on her nose. Gustav tried not to grind his teeth—although this was exactly the kind of affectation he detested about ghosts. He guessed, anyway, from the changed look on her face, that she knew what he was thinking. “I suppose that’s it, then, isn’t it, Gus? We’ve met—we’ve spent the evening together without arguing. Almost like old times.”\n“Nothing will ever be like old times.”\n“No . . . ” Her eyes glinted, and he thought for a moment that she was going to become angry—goaded at last into something like the Elanore of old. But she just smiled. “Nothing ever will be like old times. That’s the problem, isn’t it? Nothing ever was, or ever will be . . . ”\nElanore clipped her purse shut again. Elanore stood up. Gustav saw her hesitate as she considered bending down to kiss him farewell, then decide that he would just regard that as another affront, another slap in the face.\nElanore turned and walked away from Gustav, fading into the chiaroscuro swirls of lamplight and grey.\nElanore, as if Gustav needed reminding, had been alive when he’d first met her. In fact, he’d never known anyone who was more so. Of course, the age difference between them was always huge—she’d already been past a hundred by then and he was barely forty—but they’d agreed on that first day that they met and on many days after that there was a corner in time around which the old eventually turned to rejoin the young.\nIn another age, and although she always laughingly denied it, Gustav always suspected that Elanore would have had her sagging breasts implanted with silicone, the wrinkles stretched back from her face, her heart replaced by a throbbing steel simulacrum. But she was lucky enough to exist at a time when effective anti-aging treatments were finally available. As a post-centenarian, wise and rich and moderately, pleasantly, famous, Elanore was probably more fresh and beautiful than she’d been at any other era in her life. Gustav had met her at a party beside a Russian lake—guests wandering amid dunes of snow. Foreal had been a fashionable option then; although for Gustav the grounds of this pillared ice-crystalled palace that Catherine the Great’s Scottish favorite Charles Cameron had built seemed far too gorgeous to be entirely true. But it was true—foreal, actual, concrete, genuine, unvirtual—and such knowledge was what had driven him then. That, and the huge impossibility of ever really managing to convey any of it as a painter. That, and the absolute certainty that he would try.\nElanore had wandered up to him from the forest dusk dressed in seal furs. The shock of her beauty had been like all the rubbish he’d heard other artists talk about and thus so detested. And he’d been a stammering wreck, but somehow that hadn’t mattered. There had been—and here again the words became stupid, meaningless—a dazed physicality between them from that first moment that was so intense it was spiritual.\nElanore told Gustav that she’d seen and admired the series of triptychs he’d just finished working on. They were painted directly onto slabs of wood, and depicted totemistic figures in dense blocks of color. The critics had generally dammed them with faint praise—had talked of Cubism and Mondrian—were somehow unable to recognize Gustav’s obvious and grateful debt to Gauguin’s Tahitian paintings. But Elanore had seen and understood those bright muddy colors. And, yes, she’d dabbled a little in painting herself—just enough to know that truly creative acts were probably beyond her . . .\nElanore wore her red hair short in those days. And there were freckles, then as always, scattered across the bridge of her nose. She showed the tips of her teeth when she smiled, and he was conscious of her lips and her tongue. He could smell, faint within the clouds of breath that entwined them, her womanly scent.\nA small black cat threaded its way between them as they talked, then, barely breaking the crust of the snow, leapt up onto a bough of the nearest pine and crouched there, watching them with emerald eyes.\n“That’s Metzengerstein,” Elanore said, her own even greener eyes flickering across Gustav face, but never ceasing to regard him. “He’s my librarian.”\nWhen they made love later on in the agate pavilion’s frozen glow and as the smoke of their breath and their sweat clouded the winter twilight, all the disparate elements of Gustav’s world finally seemed to join. He carved Elanore’s breasts with his fingers and tongue and painted her with her juices and plunged into her sweet depths and came, finally, finally, and quite deliciously, as her fingers slid around and he in turn was parted and entered by her.\nSwimming back up from that, soaked with Elanore, exhausted, but his cock amazingly still half-stiff and rising, Gustav became conscious of the black cat that all this time had been threading its way between them. Its tail now curled against his thigh, corrugating his scrotum. Its claws gently kneaded his belly.\nElanore had laughed and picked Metzengerstein up, purring herself as she laid the creature between her breasts.\nGustav understood. Then or later, there was never any need for her to say more. After all, even Elanore couldn’t live forever—and she needed a librarian with her to record her thoughts and actions if she was ever to pass on. For all its myriad complexities, the human brain had evolved to last a single lifetime; after that, the memories and impressions eventually began to overflow, the data became corrupted. Yes, Gustav understood. He even came to like the way Metzengerstein followed Elanore around like a witch’s familiar, and, yes, its soft sharp cajolings as they made love.\nDid they call them ghosts then? Gustav couldn’t remember. It was a word, anyway—like spic, or nigger—that you never used in front of them. When he and Elanore were married, when Gustav loved and painted and loved and painted her, when she gave him her life and her spirit and his own career somehow began to take off as he finally mastered the trick of getting some of the passion he felt down onto the lovely, awkward canvas, he always knew that part of the intensity between them came from the age gap, the difference, the inescapable fact that Elanore would soon have to die.\nIt finally happened, he remembered, when he was leaving Gauguin’s tropic dreams and nightmares behind and toying with a more straightforwardly Impressionist phase. Elanore was modelling for him nude as Manet’s Olympia. As a concession to practicalities and to the urgency that then always possessed him when he was painting, the black maid-servant bearing the flowers in his lavish new studio on the Boulevard des Capucines was a projection, but the divan and all the hangings, the flowers, and the cat, of course—although by its programmed natured Metzengerstein was incapable of looking quite as scared and scrawny as Manet’s original—were all foreal.\n“You know,” Elanore said, not breaking pose, one hand toying with the hem of the shawl on which she was lying, the other laid negligently, possessively, without modesty, across her pubic triangle, “we really should re-invite Marcel over after all he’s done for us lately.”\n“Marcel?” In honesty, Gustav was paying little attention to anything at that moment other than which shade to swirl into the boudoir darkness. He dabbed again onto his testing scrap. “Marcel’s in San Francisco. We haven’t seen him in months.”\n“Of course . . . Silly me.”\nHe finally glanced up again what could have been moments or minutes later, suddenly aware that a cold silence that had set in. Elanore, being Elanore, never forgot anything. Elanore was light and life. Now, all her Olympia-like poise was gone.\nThis wasn’t like the decay and loss of function that affected the elderly in the days before recombinant drugs. Just like her heart and her limbs, Elanore’s physical brain still functioned perfectly. But the effect was the same. Confusions and mistakes happened frequently after that, as if consciousness drained rapidly once the initial rent was made. For Elanore, with her exquisite dignity, her continued beauty, her companies and her investments and the contacts that she needed to maintain, the process of senility was particularly terrible. No one, least of all Gustav, argued against her decision to pass on.\nBack where reality ended, it was past midnight and the moon was blazing down over the Left Bank’s broken rooftops through the greyish brown nanosmog. And exactly where, Gustav wondered, glaring up at it through the still humming gantries of the reality engine that had enclosed him and Elanore, is Francine across the sky? How much do you have to pay to get the right decoders in your optic nerves and see the stars entwined in some vast projection of her? How much of your life do you have to give away?\nThe mazy streets behind St-Michael were rotten and weed-grown in the bilious fog, the dulled moonlight. No one but Gustav seems to live in the half-supported ruins of the Left Bank nowadays. It was just a place for posing in and being seen—although in that respect, Gustav reflected, things really hadn’t changed. To get back to his tenement, he had to cross the Boulevard St-Germain through a stream of buzzing robot cars that, no matter how he dodged them, still managed to avoid him. In the busier streets beyond, the big reality engines were still glowing. In fact, it was said that you could now go from one side of Paris to the other without having to step out into foreal. Gustav, as ever, did his best to do the opposite although he knew that, even without any credit, he would still be freely admitted to the many realities on offer in these generous, carefree days. He scowled at the shining planes of the powerfields that stretched between the gantries like bubbles. Faintly from inside, coming at him from beyond the humming of the transformers that tamed and organised the droplets of nanosmog into shapes you could feel, odors you could smell, chairs you could sit on, he could hear words and laughter, music, the clink of glasses. He could even just make out the shapes of the living as they postured and chatted. It was obvious from the way that they were grouped that the living were outnumbered by the dead these days. Outside, in the dim streets, he passed figures like tumbling decahedrons who bore their own fields with them as moved between realities. They were probably unaware of him as they drifted by, or perhaps saw him as some extra enhancement of whatever dream it was they were living. Flick, flick. Scheherazade’s Baghdad. John Carter’s Mars. It really didn’t matter that you were still in Paris, although Elanore, of course, had showed sensitivity in the place she had selected for their meeting.\nBeyond the last of the reality engines, Gustav’s own cheap unvirtual tenement loomed into view. He picked his way across the tarmac towards the faint neon of the foreal Spar store beside it. Inside, there were the usual grey slabs of packaging with tiny windows promising every possible delight. He wandered up the aisles and activated the homely presence of the woman who served the dozen or so anachronistic places that were still scattered around Paris. She smiled at him—a living ghost, really; but then people seemed to prefer the illusion of the personal touch. Behind her, he noticed, was an antiquated cigarette machine. He ordered a packet of Disc Bleu, and palmed what were probably the last of his credits—which amounted to half a stick of charcoal or two squeezes-worth of Red Lake. It was a surprise to him, in fact, that he even had enough for these cigarettes.\nOutside, ignoring the health warning that flashed briefly before his eyes, he lighted a Disc Bleu, put it to his lips and deeply inhaled. A few moments later, he was in a nauseous sweat, doubled up and gasping.\nAnother bleak morning, timeless and grey. This ceiling, these walls. And Elanore . . . Elanore was dead. Gone.\nGustav belched on the wine he was sure that he’d drunk, and smelled the sickness and the smoke of that foreal Disc Bleu still clinging to him. But there was no trace of Elanore. Not a copper strand of hair on his shoulder or curled around his cock, not her scent riming his hands.\nHe closed his eyes and tried to picture a woman in a white chemise bathing in a river’s shallows, two bearded men talking animatedly in a grassy space beneath the trees and Elanore sitting naked close by, although she watches rather that joins in their conversation . . .\nNo. That wasn’t it.\nSomehow getting up, pissing cloudily into the appropriate receptacle, Gustav finally grunted in unsurprise when he noticed a virtual light flickering through the heaped and broken frames of his easels. Unlike the telephone, he was sure that the company had disconnected his terminal long ago. His head fizzing, his groin vaguely tumescent, some lost bit of the night nagging like a stray scrap of meat between his teeth, he gazed down into the spinning options that the screen offered.\nIt was Elanore’s work, of course—or the ghost of entangled electrons that Elanore had become. Hey presto—Gustav was back on line; granted this shimmering link into the lands of the dead and the living. He saw that he even had positive credit, which explained why he’d been able to buy that packet of Disc Bleu. He’d have slammed his fist down into the thing if it would have done any good.\nInstead, he scowled at his room, the huddled backs of the canvases, the drifts of discarded food and clothing, the heap of his bed, wondering if Elanore was watching him now, thrusting a spare few gigabytes into the sensors of some nano-insect that was hovering close beside him. Indeed, he half-expected the thin partitions and dangling wires, all the mocking rubbish of his life, to shudder and change into snowy Russian parkland, a wooded glade, even Paris again, 1890. But none of that happened.\nThe positive credit light still glowed enticingly within the terminal. In the almost certain knowledge that he would regret it, but quite unable to stop himself, Gustav scrolled through the pathways that led him to the little-frequented section dealing with artist’s foreal requisites. Keeping it simple—down to fresh brushes, and Lefranc and Bourgeois’s extra fine Flake White, Cadmium Yellow, Vermilion, Deep Madder, Cobalt Blue and Emerald Green—and still waiting as the cost all of that clocked up for the familiar credit-expired sign to arrive, he closed the screen.\nThe materials arrived far quicker than he’d expected, disgorging themselves into a service alcove in the far corner with a whoosh like the wind. The supplier had even remembered to include the fresh bottles of turpentine he’d forgotten to order—he still had plenty of clean stretched canvases anyway. So here (the feel of the fat new tubes, the beautiful, haunting names of the colors, the faint stirring sounds that the brushes made when he tried to lift them) was everything he might possibly need.\nGustav was an artist.\nThe hours did funny things when Gustav was painting—or even thinking about painting. They ran fast or slow, passed by on a fairy breeze, or thickened and grew huge as megaliths, then joined up and began to dance lumberingly around him, stamping on every sensibility and hope.\nTaking fierce drags of his last Disc Bleu, clouding his tenement’s already filmy air, Gustav finally gave up scribbling on his pad and casting side-long glances at the canvas as the blazing moon began to flood Paris with its own sickly version of evening. As he’d always known he’d probably end up doing, he then began to wander the dim edges of his room, tilting back and examining his old, unsold, and generally unfinished canvases. Especially in this light, and seen from upside down, the scenes of foreal Paris looked suitably wan. There was so little to them, in fact, such a thinness and lack of color, that they could easily be re-used. But here in the tangled shadows of the furthest corner, filled with colors that seemed to pour into the air like a perfume, lay his early attempts at Symbolism and Impressionism . . . Amid those, he noticed something paler again. In fact, unfinished—but from an era when, as far as he could recall, he’d finished everything. He risked lifting the canvas out, and gazed at the outlines, the dabs of paint, the layers of wash. He recognized it now. It had been his attempt at Manet’s Olympia.\nAfter Elanore had said her goodbyes to all her friends, she retreated into the white virtual corridors of a building near the Cimetière du Père Lachaise that might once have been called a hospital. There, as a final fail-safe, her mind was scanned and stored, the lineaments of her body were recorded. Gustav was the only person Elanore allowed to visit her during those last weeks; she was perhaps already too confused to understand what seeing her like this was doing to him. He’d sit amid the webs of sliver monitoring wires as she absently stroked Metzengerstein and the cat’s eyes, now far greener and brighter than hers, regarded him. She didn’t seem to want to fight this loss of self. That was probably the thing that hurt him most. Elanore, the proper foreal Elanore, had always been searching for the next river to cross, the next challenge; it was probably the one characteristic that they had shared. But now she accepted death, this loss of Elanore, with nothing but resignation. This is the way it is for all us, Gustav remembered her saying in one the last cogent periods before she forgot his name. So many of our friends have passed on already. It’s just a matter of joining them . . .\nElanore never quite lost her beauty, but she became like a doll, a model of herself, and her eyes grew vacant as she sat silent or talked ramblingly. The freckles faded from her skin. Her mouth grew slack. She began to smell sour. There was no great fuss made when they finally turned her off, although Gustav still insisted that he be there. It was a relief, in fact, when Elanore’s eyes finally closed and her heart stopped beating, when the hand he’d placed in his turned even more flaccid and cold. Metzengerstein gave Gustav one final glace before it twisted its ways between the wires, leapt off the bed and padded from the room, its tail raised. For a moment, Gustav considered grabbing the thing, slamming it down into a pulp of memory circuits and flesh and metal. But it had already been de-programmed. Metzengerstein was just a shell; a comforter for Elanore in her last dim days. He never saw the creature again.\nJust as the living Elanore had promised, her ghost only returned to Gustav after a decent interval. And she made no assumptions about their future at that first meeting on the neutral ground of a shorefront restaurant in virtual Balbec. She clearly understood how difficult all this was for him. It had been a windy day, he remembered, and the tablecloths flapped, the napkins threatened to take off, the lapel of the cream brocade jacket she was wearing kept lying across her throat until she pinned it back with a brooch. She told him that she still loved him, and that she hoped they would be able to stay together. A few days later, in a room in the same hotel overlooking the same windy beach, Elanore and Gustav made love for the first time since she had died.\nThe illusion, Gustav had to admit, then and later, was always perfect. And, as the dying Elanore had pointed out, they both already knew many ghosts. There was Marcel for instance, and there was Jean, Gustav’s own dealer and agent. It wasn’t as if Elanore had even been left with any choice. In a virtual, ghostly daze himself, Gustav agreed that they should set up home together. They chose Brittany, because it was new to them—unloaded with memories—and the scenery was still often decent and visible enough to be worth painting.\nForeal was going out of style by then. For many years, the technologies of what was called reality had been flawless. But now, they became all-embracing. It was at about this time, Gustav supposed, although his memory once was again dim on this matter, that they set fire to the moon. The ever-bigger reality engines required huge amounts of power—and so it was that the robot ships set out, settled into orbit around the moon and began to spray the surface with antimatter, spreading their wings like hands held out to a fire to absorb and then transmit back to Earth the energies this iridescence gave. The power the moon now provided wasn’t quite limitless, but it was near enough. With so much alternative joy and light available, the foreal world, much like a garden left untended, soon began to assume a look of neglect.\nEver-considerate to his needs, Elanore chose and had refurbished a gabled clifftop mansion near Locronan, and ordered graceful and foreal furniture at huge extra expense. For a month or so, until the powerlines and transformers of the reality engines had been installed, Gustav and Elanore could communicate with each other only by screen. He did his best of tell himself that being unable to touch her was a kind of tease, and kept his thoughts away from such questions as where exactly Elanore was when she wasn’t with him, and if she truly imagined she was the seamless continuation of the living Elanore that she claimed herself to be.\nThe house smelled of salt and old stone, and then of wet plaster and new carpets, and soon began to look as charming and eccentric as anything Elanore had organised in her life. As for the cost of all this forgotten craftsmanship, which even in these generous times, was quite daunting, Elanore had discovered, like many of the ghosts who had gone before her, that her work—the dealing in stocks, ideas and raw megawatts in which she specialized—was suddenly much easier. She could flit across the world, make deals based on long-term calculations that no living person could ever hope to understand.\nOften, in the early days when Elanore finally reached the reality of their clifftop house in Brittany, Gustav would find himself gazing at her, trying to catch her unawares, or, in the nights when they made love with an obsessive frequency and passion, he would study her whilst she was sleeping. If she seemed distracted, he put it down to some deal she was cooking, a new anti-matter trail across the Sea of Storms, perhaps, or a business meeting in Capetown. If she sighed and smiled in her dreams, he imagined her in the arms of some long-dead lover.\nOf course, Elanore always denied such accusations. She even gave a good impression of being hurt. She was, she insisted, configured to ensure that she was always exactly where she appeared to be, except for brief times and in the gravest of emergencies. In the brain or on the net, human consciousness was a fragile thing—permanently in danger of dissolving. I really am talking to you now, Gustav. Otherwise, Elanore maintained, she would unravel, she would cease to be Elanore. As if, Gustav thought in generally silent rejoinder, she hadn’t ceased to be Elanore already.\nShe’d changed, for a start. She was cooler, calmer, yet somehow more mercurial. The simple and everyday motions she made like combing her hair or stirring coffee began to look stiff and affected. Even her sexual preferences had changed. And passing over was different. Yes, she admitted that, even though she could feel the weight and presence of her own body just as she could feel his when he touched her. Once, as the desperation of their arguments increased, she even insisted in stabbing herself with a fork just so that he might finally understand that she felt pain. But for Gustav, Elanore wasn’t like the many other ghosts he’d met and readily accepted. They weren’t Elanore. He’d never loved and painted them.\nGustav soon found couldn’t paint Elanore now, either. He tried from sketches and from memory; once or twice he got her to pose. But it didn’t work. He couldn’t quite loose himself enough to forget what she was. They even tried to complete that Olympia, although the memory was painful for both of them. She posed for him as Manet’s model, who in truth she did look a little like; the same model who’d posed for that odd scene by the river, Dejéuner sur l’Herbe. Now, of course, the cat as well as the black maid had to be a projection, although they did their best to make everything else the same. But there was something lost and wan about painting as he tried to develop it. The nakedness of the woman on the canvas no longer gave off strength and knowledge and sexual assurance. She seemed pliant and helpless. Even the colors grew darker; it was like fighting something in a dream.\nElanore accepted Gustav’s difficulties with what he sometimes found to be chillingly good grace. She was prepared to give him time. He could travel. She could develop new interests, burrow within the net as she’d always promised herself and live in some entirely different place.\nGustav began to take long walks away from the house, along remote clifftop paths and across empty beaches where he could be alone. The moon and the sun sometimes cast their silver ladders across the water. Soon, Gustav thought sourly, they’ll be nowhere left to escape to. Or perhaps we will all pass on, and the gantries and the ugly virtual buildings that all look like the old Pompidou Center will cease to be necessary; but for the glimmering of a few electrons, the world will revert to the way it was before people came. We can even extinguish the moon.\nHe also started to spend more time in the few parts of their rambling house that, largely because much of the stuff they wanted was hand-built and took some time to order, Elanore hadn’t yet had fitted out foreal. He interrogated the house’s mainframe to discover the codes that would turn the reality engines off and on at will. In a room filled with tapestries, a long oak table, a vase of hydrangeas, pale curtains lifting slightly in the breeze, all it took was the correct gesture, a mere click of his fingers, and it would shudder and vanish to be replaced by nothing but walls of mildewed plaster, the faint tingling sensation that came from the receding powerfield. There, then gone. Only the foreal view at the window remained the same. And now, click, and it all came back again. Even the fucking vase. The fucking flowers.\nElanore sought him out that day. Gustav heard her footsteps on the stairs, and knew that she’d pretend be puzzled as to why he wasn’t working in his studio.\n“There you are,” she said, appearing a little breathless after her climb up the stairs. “I was thinking—”\nFinally scratching the itch that he realized had been tickling him for some time, Gustav clicked his fingers. Elanore—and the whole room, the table, the flowers, the tapestries—flickered off.\nHe waited—several beats, he really didn’t know how long. The wind still blew in through the window. The powerfield hummed faintly, waiting for its next command. He clicked his fingers. Elanore and the room took shape again.\n“I thought you’d probably override that,” he said. “I imagined you’d given yourself a higher priority than the furniture.”\n“I could if I wished,” she said. “I didn’t think I’d need to do such a thing.”\n“No. I mean, you can just go somewhere else, can’t you? Some other room in this house. Some other place. Some other continent . . . ”\n“I keep telling you. It isn’t like that.”\n“I know. Consciousness is fragile.”\n“And we’re really not that different, Gus. I’m made of random droplets held in a force field—but what are you? Think about it. You’re made of atoms, which are just quantum flickers in the foam of space, particles that aren’t even particles at all . . . ”\nGustav stared at her. He was remembering—he couldn’t help it—that they’d made love the previous night. Just two different kinds of ghost; entwined, joining—he supposed that that was what she was saying. And what about my cock, Elanore, and the stuff that gets emptied into you when we’re fucking? What the hell do you do with that?\n“Look, Gus, this isn’t—”\n“—And what do you dream at night, Elanore? What is it that you do you do when you pretend you’re sleeping?”\nShe waved her arms in a furious gesture that Gustav almost recognized from the Elanore of old. “What the hell do you think I do, Gus? I try to be human. You think it’s easy, do you, hanging on like this? You think I enjoy watching you flicker in and out?—which is basically what it’s like for me every time you step outside these fields? Sometimes I just wish I . . . ”\nElanore trailed off there, glaring at him with emerald eyes. Go on, Gustav felt himself urging her. Say it, you phantom, shade, wraith, ghost. Say you wish you’d simply died. But instead, she made some internal command of her own, and blanked the room—vanished.\nIt was the start of the end of their relationship.\nMany guests came to visit their house in the weeks after that, and Elanore and Gustav kept themselves busy in the company of the dead and the living. All the old crowd, all the old jokes. Gustav generally drank too much, and made his presence unwelcome with the female ghosts as he decided that once he’d fucked the nano-droplets in one configuration, he might as well try fucking them in another. What the hell was it, Gus wondered, that made the living so reluctant to give up the dead, and the dead to give up the living?\nIn the few hours that they did spend together and alone at that time, Elanore and Gustav made detailed plans to travel. The idea was that they (meaning Elanore, with all the credit she was accumulating) would commission a ship, a sailing ship, traditional in every respect apart from the fact that the sails would be huge power receptors driven directly by the moon, and the spars would be the frame of a reality engine. Together, they would get away from all of this, and sail across the foreal oceans, perhaps even as far as Tahiti. Admittedly, Gustav was intrigued by the idea of returning to the painter who by now seemed to be the initial wellspring of his creativity. He was certainly in a suitably grumpy and isolationist mood to head off, as the poverty-stricken and desperate Gauguin had once done, in search of inspiration in the South Seas; and ultimately to his death from the prolonged effects of syphilis. But they never actually discussed what Tahiti would be like. Of course, there would be no tourists there now—only eccentrics bothered to travel foreal these days. Gustav liked to think, in fact, that there would be none of the tall ugly buildings and the huge Coca-Cola signs that he’d once seen in an old photograph of Tahiti’s main town of Papeete. There might—who knows?—not be any reality engines, even, squatting like spiders across the beaches and jungle. With the understandable way that the birth-rate was now declining, there would be just a few natives left, living as they had once lived before Cook and Bligh and all the rest—even Gauguin with his art and his myths and his syphilis—had ruined it for them. That was how Gustav wanted to leave Tahiti.\nWinter came to their clifftop house. The guests departed. The wind raised white crests across the ocean. Gustav developed a habit, which Elanore pretended not to notice, of turning the heating down; as if he needed chill and discomfort to make the place seem real. Tahiti, that ship of theirs, remained an impossibly long way off. There were no final showdowns—just this gradual drifting apart. Gustav gave up trying to make love to Elanore just as he had given up trying to paint her. But they were friendly and cordial with each other. It seemed that neither of them wished to pollute the memory of something that had once been wonderful. Elanore was, Gustav knew, starting to become concerned about his failure to have his increasing signs of age treated, and his refusal to have a librarian; even his insistence on pursuing a career that seemed only to leave him depleted and damaged. But she never said anything.\nThey agreed to separate for a while. Elanore would head off to explore pure virtuality. Gustav would go back to foreal Paris and try to rediscover his art. And so, making promises they both knew they would never keep, Gustav and Elanore finally parted.\nGustav slid his unfinished Olympia back down amid the other canvases. He looked out of the window and saw from the glow coming up through the gaps in the houses that the big reality engines were humming. The evening, or whatever other time and era it was, was in full swing.\nA vague idea forming in his head, Gustav pulled on his coat and headed out from his tenement. As we walked down through the misty, smoggy streets, it almost began to feel like inspiration. Such was his absorption that he didn’t even bother to avoid the shining bubbles of the reality engines. Paris, at the end of the day, still being Paris, the realities he passed through mostly consisted of one or another sort of café, but there were set amid dazzling souks, dank Medieval alleys, yellow and seemingly watery places where swam strange creatures that he couldn’t think to name. But his attention wasn’t on it anyway.\nThe Musée D’Orsay was still kept in reasonably immaculate condition beside the faintly luminous and milky Seine. Outside and in, it was well-lit, and a trembling barrier kept in the air that was necessary to preserve its contents until the time came when they were fashionable again. Inside, it even smelled like an art gallery, and Gustav’s footsteps echoed on the polished floors, and the robot janitors greeted him; in every way, and despite all the years since he’d last visited, the place was the same.\nGustav walked briskly past the statues and the bronze casts, past Ingres’ big, dead canvases of supposedly voluptuous nudes. Then Moreau, early Degas, Corot, Millet . . . Gustav did his best to ignore them all. For the fact was that Gustav hated art galleries—he was still, at least, at painter in that respect. Even in the years when he’d gone deliberately to such places because he knew that they were good for his own development, he still liked to think of himself as a kind of burglar—get in, grab your ideas, get out again. Everything else, all the ahhs and the oohs, was for mere spectators . . .\nHe took the stairs to the upper floor. A cramp had worked its way beneath his diaphragm and his throat felt raw, but behind all of that there was this feeling, a tingling of power and magic and anger—a sense that perhaps . . .\nNow that he was up amid the rooms and corridors of the great Impressionist works, he forced himself to slow down. The big gilt frames, the pompous marble, the names and dates of artists who had often died in anonymity, despair, disease, blindness, exile, near-starvation. Poor old Sisley’s Misty Morning. Vincent Van Gogh in a self portrait formed from deep, sensuous, three-dimensional oils. Genuinely great art was, Gustav thought, pretty depressing for would-be great artists. If it hadn’t been for the invisible fields that were protecting these paintings, he would have considered ripping the things off the walls, destroying them.\nHis feet led him back to the Manets, that woman gazing out at him from Dejéuner sur l’Herbe, and then again from Olympia. She wasn’t beautiful, didn’t even look much like Elanore . . . But that wasn’t the point. He drifted on past the clamoring canvases, wondering if the world had ever been this bright, this new, this wondrously chaotic. Eventually, he found himself face to face with the surprisingly few Gauguins that the Musée D’Orsay possessed. Those bright slabs of color, those mournful Tahitian natives, which were often painted on raw sacking because it was all Gauguin could get his hands on in the hot stench of his tropical hut. He became wildly fashionable after his death, of course; the idea of destitution on a far away isle suddenly stuck everyone as romantic. But it was too late for Gauguin by then. And too late—as his hitherto worthless paintings were snapped up by Russians, Danes, Englishmen, Americans—for these stupid, habitually arrogant Parisians. Gauguin was often poor at dealing with his shapes, but he generally got away with it. And his sense of color was like no one else’s. Gustav remembered vaguely now that there was a nude that Gauguin had painted as his own lopsided tribute to Manet’s Olympia—had even pinned a photograph of it to the wall of his hut as he worked. But, like most of Gauguin’s other really important paintings, it wasn’t here at the Musée D’Orsay, this supposed epicenter of Impressionist and Symbolist art. Gustav shrugged and turned away. He hobbled slowly back down through the gallery.\nOutside beneath the moonlight, amid the nanosmog and the buzzing of the powerfields, Gustav made his way once again through the realities. An English tea house circa 1930. A Guermantes salon. If they’d been foreal, he’d have sent the cups and the plates flying, bellowed in the self-satisfied faces of the dead and living. Then he stumbled into a scene he recognized from the Musée D’Orsay, one, in fact, that had once been as much a cultural icon as Madonna’s tits or a Beatles tune. Le Moulin de la Galette. He was surprised and almost encouraged to see Renoir’s Parisian figures in their Sunday-best clothing dancing under the trees in the dappled sunlight, or chatting at the surrounding benches and tables. He stood and watched, nearly smiling. Glancing down, saw that he was dressed appropriately in a rough woolen navy suit. He studied the figures, admiring they animation, the cleaver and, yes, convincing way that, through some trick of reality, they were composed . . . Then he realized that he recognized some of the faces, and that they had also recognized him. Before he could turn back, he was called to and beckoned over.\n“Gustav,” Marcel’s ghost said, sliding an arm around him, smelling of male sweat and Pernod. “Grab a chair. Sit down. Long time no see, eh?”\nGustav shrugged and accepted the brimming tumbler of wine that offered. If it was foreal—which he doubted—this and a few more of the same might help him sleep tonight. “I thought you were in Venice,” he said. “As the Doge.”\nMarcel shrugged. There were breadcrumbs on his mustache. “That was ages ago. Where have you been, Gustav?”\n“Just around the corner, actually.”\n“Not still painting are you?”\nGustav allowed that question be lost in the music and the conversation’s ebb and flow. He gulped his wine and looked around, expecting to see Elanore at any moment. So many of the others were here—it was almost like old times. There, even, was Francine dancing with a top-hatted man—so she clearly wasn’t across the sky. Gustav decided to ask the girl in the striped dress who was nearest to him if she’d seen Elanore. He realized as he spoke to her that her face was familiar to him, but he somehow couldn’t recollect her name—even whether she was living or a ghost. She shook her head, and asked the woman who stood leaning behind her. But she, also, hadn’t seen Elanore; not, at least, since the times when Marcel’s Venice when Francine was across the sky. From there, the question rippled out across the square. But no one, it seemed, knew what had happened to Elanore.\nGustav stood up and pushed between the twirling dancers beneath the lantern-strung trees. His skin tingled as he stepped out of the reality and the laughter and the music suddenly faded. Avoiding any other such encounters, he made his way back up the dim streets to his tenement.\nThere, back at home, the light from the setting moon was bright enough for him to make his way through the dim wreckage of his life without falling—and the terminal that Elanore ghost had reactivated still gave off a virtual glow. Swaying, breathless, Gustav paged down into his accounts, and saw the huge sum—the kind of figure that he associated with astronomy, with the distance of the moon from the Earth, the Earth from the sun—that now appeared there. Then, he passed back through the terminal’s levels, and began to search for Elanore.\nBut Elanore wasn’t there.\nGustav was painting. When he felt like this, he loved and hated the canvas in almost equal measures. The outside world, foreal or in reality, ceased to exist for him.\nA woman, naked, languid, and with a dusky skin quite unlike Elanore’s, is lying upon a couch, half-turned, her face cupped in her hand that lies upon the primrose pillow, her eyes gazing away from the onlooker at something far off. She seems beautiful but unerotic, vulnerable yet clearly available, and self-absorbed. Behind her—amid the twirls of bright yet gloomy decoration—lies a glimpse of stylised rocks under a strange sky, whilst two oddly disturbing figures are talking, and a dark bird perches on the lip of a balcony; perhaps a raven . . .\nAlthough he detests plagiarism, and is working solely from memory, Gustav finds it hard to break away from Gauguin’s nude on this canvas he is now painting. But he really isn’t fighting that hard to do so, anyway. In this above all of Gauguin’s great paintings, stripped of the crap and the despair and the self-justifying symbolism, Gauguin was simply right. So Gustav still keeps working, and the paint sometimes almost seems to want to obey him. He doesn’t know or care at the moment what the thing will turn out like. If it’s good, he might think of it as his tribute to Elanore; and if it isn’t . . . Well, he knows that, once he’s finished this painting he will start another one. Right now, that’s all that matters.\nElanore was right, Gustav decides, when she once said that he was entirely selfish, would sacrifice everything—himself included—just so that he could continue to paint. She was eternally right and, in her own way, she too was always searching for the next challenge, the next river to cross. Of course, they should have made more of the time that they had together, but as Elanore’s ghost admitted at that Van Gogh café when she finally came to say goodbye, nothing could ever quite be the same.\nGustav stepped back from his canvas and studied it, eyes half-closed at first just to get the shape, then with a more appraising gaze. Yes, he told himself, and reminded himself to tell himself again later when he began to feel sick and miserable about it, this is a true work. This is worthwhile.\nThen, and although there is much that he still has to do and the oils are wet and he knows that he should rest the canvas, he swirls his brush in a blackish puddle of palette-mud and daubs the word NEVERMORE across the top and steps back again, wondering what next to paint.\nOriginally published in Dying For It: More Erotic Tales of Unearthly Love, edited by Gardner Dozois, 1997.\nIan R MacLeod has been writing and selling stories and novels of speculative and fantastic fiction for almost thirty years. Amongst many accolades, his work has won the Arthur C Clarke Award, the World Fantasy Award (twice) and the Sidewise Award for alternate fiction (three times). He took a Law degree and drifted into the English Civil Service, but writing was always his first love and ambition. He has recently released a short story collection, Frost On Glass, and has a new novel, Red Snow, due out shortly.He lives in the riverside town of Bewdley, in the United Kingdom."}