{"fingerprint": "2GM+WskinPuTO9pBRKx2VHctlOc=", "sitename": "Clarkesworld Magazine", "title": "Lost in Darkness and Distance by Clara Madrigano", "author": "Clara Madrigano", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/madrigano_11_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Lost in Darkness and Distance by Clara Madrigano", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11760 words, novelette\nLost in Darkness and Distance\nCharlie wasn’t a ghost standing in the corners of the house, but at the same time he was everywhere. He had been haunting my thoughts since we received Uncle Jamey’s emails and the plane tickets. Now, everyone gathered at our mother’s house, my childhood home, to come to a decision.\nWe barely said anything as we ate. Of the five of us, DD was the only one who had already made up her mind.\n“I’ll go. Even if you guys decide you’re not,” she had confided in me the night before, as we struggled to get any sleep in her bed—our twin nieces were sleeping in my old bedroom. In the darkness, she carefully scanned my face, waiting for a reaction; wanting to know if I was on board, or if I’d been wounded by her decision.\n“Why do you think Mom keeps our bedrooms like this? Like time hasn’t passed,” she asked, as if sensing the need to change the subject.\n“Because of Joan Didion,” I said, almost automatically.\n“Joan Didion?”\n“Joan Didion said a girl should always have a room in her mother’s house. Even when she’s all grown up. Something like that.”\n“She didn’t say that.”\n“She did.”\n“Where?”\n“Somewhere. Some book. Some interview. I’m not sure.” I had no idea if that was true. I knew Joan Didion said something in those lines; I’d learned so from a book. But I had no idea if my mother had ever read Didion, her own words or her words told by others. Suddenly, though, the association seemed inescapable and true. Of course that was why my mother kept our rooms for us, her girls; every mother kept her daughter’s room, in a way or another. Every mother kept waiting for a child to return.\nDD stayed quiet for a while. I closed my eyes.\n“Do you think they kept his room the same? You think they’ll bring him back to, you know . . . their house?” DD asked. But my eyes remained shut. I pretended to be asleep so I wouldn’t have to answer her. The answer, had I told her, would be, plainly: “I have no idea.”\nDuring that quiet dinner, one of our last before the flight was scheduled to leave, Gray broke the silence, calmly stating his thoughts over the clicking of chopsticks as we consumed our delivered Chinese food:\n“We should go. I think we owe it to Uncle Jamey. I mean, he wants us to be a part of it.” He cleared his throat, as if to say more, but decided not to, stuffing his mouth with a dumpling and chewing as gently as possible.\n“I agree,” my mother said. She didn’t look at us. She seemed relaxed right now, strangely absent.\nWhen I first got here, when I held her in my arms for an embrace, she seemed about to dissolve, turning into white smoke and escaping through my fingers. We sat by the kitchen counter. “Coffee?” she suggested. I said yes, for no good reason. My stomach felt like an enemy for the last few days. Ever since I got the email and read it and reread it.\n“Did you know?” I asked. The very first question, as my mother filled my cup with instant coffee. I watched her attentively, afraid she still could disappear, leaving behind nothing but her clothes. Everything about my reality seemed at risk of disappearing that first day—and in the days that came next. The edges of the world were blurred. As I drove to my mother’s house, it felt like I wasn’t driving at all, but being guided by some energy that made me lose any sense of time. Usually driving to Mom’s house would take me twenty to thirty minutes. That day, I had the impression barely five minutes had passed between leaving my apartment in the city and parking the car in front of our old house’s garage.\n“No,” my mother said. “I didn’t.”\n“Is he serious about it?”\n“He’s done it. I think this answers your question, Mia.”\nI felt a lump in my throat. Instinctively, my mother let her own cup rest on the sink and hugged me. She was solid. She wasn’t going to disappear. I must have sobbed in relief, because she patted my back and said it was OK. “I should have offered you tea,” she said, and then laughed.\nDD joined us an hour later, bringing in a big, pink suitcase, and Gray and Maura and the twins came in the next morning, after a long flight from California; my nieces were finicky, annoyed at that sudden emergency trip. They wanted to go to Disney.\n“It’s not Disney. It’s more special than Disney,” Maura would say, and then she’d look at me as if asking for some guidance. How could I even begin to explain what was happening? My nieces had never met Charlie, they had no idea what any of that meant. “But there’s going to be a beach, and you and your aunts DD and Mia can play the whole day,” my sister-in-law added. “Hey, maybe you can even play with dolphins.” Were there dolphins at the island? I didn’t know. It had no name, the island; at least the papers never mentioned a name. I couldn’t Google it. I couldn’t find any information on its precise location among the other Caribbean islands.\n“I’m going,” I finally said, during that last dinner, after Gray and Mom had made their opinions known. My family seemed a bit surprised—either by the high pitch I’d used when announcing my decision, or by the decision itself. My brother’s sad brown eyes, Mom’s alert expression . . . they watched me, afraid I’d break into pieces. But I’d compromised. I said the words.\nThat night, back in our shared bed, DD said, “You’re cold.” She held my face in her hands and her blue eyes stared deep into my soul.\n“I’m fine,” I said.\n“You don’t have to do this.”\n“I do. If Uncle Jamey didn’t want me there, he wouldn’t have invited me.” This was the truth I had been avoiding. Uncle Jamey wanted me to go. Uncle Jamey wrote my name. He somehow had my email; he sent me the papers and the ticket. And the paperwork seemed to be never-ending. We signed the nondisclosure agreements, we pawned our souls to those rules. The five of us decided to go.\n“Then we’re doing it together,” DD said, while in bed, stroking my cold cheeks.\nCharlie was the first boy I ever kissed. I knew there was something inherently wrong about kissing your own cousin. But at twelve, I’d been devouring historical fiction and biographies of great women and queens; I’d been drowning in nineteenth century romances I still didn’t fully understand, and the idea of kissing your cousin, even marrying him, didn’t seem so strange.\nCharlie and I were more than just cousins, truth to be told: we’re almost twins. Born in the same year, just a few months apart, we’d run with nothing but diapers on in my parents’ house, and in Uncle Jamey’s apartment in New York. During childhood, we’d rather play with each other than with other kids our age. Charlie and I were made of the same material and the same blood. I could predict his reactions before he’d speak, I could read his mind like I could read the palm of his hand, every line and scar.\nOn the day I kissed Charlie, during our summer vacation, watching the glimmer of the lake right in front of the cabin my father usually rented, we had been swimming for a good part of the morning, and the sun added a sheen of gold to Charlie’s brown skin, his damp curls darker than ever. I kissed him when no one was looking; behind a tree, where I took a break to hide, believing my flowery bikini made me look stupid and childish near Charlie’s changing body, the height and the lean muscles he had been gaining during that summer, puberty making him more and more of a young man than a boy.\nHe came to check on me, ask me if I was OK, and I said yes. He told me to come and join them: he, Gray, and DD, by the lake. Charlie gave me his hand. As I took it and got up, it happened: I kissed him. Standing at the tip of my toes, our lips touching for a brief moment. I couldn’t taste him properly. I tasted the water instead, and a bit of shame.\nHis brown eyes widened with surprise as I stepped back, astonished at what I’d just done.\nBut Charlie laughed. A kind laugh: such a rare thing to hear from a boy.\n“Don’t worry,” he said. “I won’t say anything.”\nHe kept his promise. Summer was reality suspended. It was another world, after all.\nWe went back to the water. We dared ourselves to swim faster than the other. Charlie would always win, but still we played the game. He’d beat Gray and even me, the best swimmer among my siblings. We’d blink and there he’d be: Charlie, in the far distance, a dot in the immensity of the lake, waving at us.\nMiami: we boarded our chartered plane. DD held my hand until both our palms were sweaty. My mother was a bit more pragmatic: she popped some pills as soon as we left Philadelphia and slept for the most part of the first flight. Going into the chartered plane, she moved in a bit of a lethargy, as if entering a dream.\n“She’s so high on her meds right now,” DD joked.\nMy nieces were the only ones that had some sort of fun. They’d press their faces against the window and pretend to see heaven.\n“Mama, where are the angels?” they’d asked.\n“They live up above, darlings. You can’t see them from here,” Maura said. “Don’t stare at the sun. It will hurt your eyes.”\nAngels. Angels and miracles. My head was suddenly filled by a distant choir of plump cherubs. I laughed, instinctively. The last night, I packed my bags as if I were going on a vacation. Swimsuits. Denim. Dresses. I wasn’t sure of what I was doing. I should have thought of a nun habit, something appropriate to witnessing a miracle. This wasn’t a vacation.\nBut the island we landed on was everything you could expect from the perfect vacation spot. Caribbean blue sea and white and hot sand. People stretching on folding chairs by the beach and having colorful drinks served by men dressed in blue aprons. A big, luxurious resort, the color of cream—the color of sand—that wasn’t really a resort: it was the Clinic, my mother said. The biggest building on the whole island, with French windows and large verandas from where you could appreciate the view. Behind the great wooden doors, already opened to us, we were greeted by a life-sized reproduction of Michelangelo’s David, and I tried not to snort. Only later, when we already had a room for ourselves, DD would say: “Very ‘in your face,’ don’t you think?” She meant what they did in the Clinic, and how David encapsulated it perfectly.\n“We are Jamey Ocampo’s guests,” my mother said to the receptionist, who then produced even more paperwork waiting for our signatures. Women in dark blue, with harmless expressions, confiscated my nieces’ iPads and everyone’s phones. The suite I’d be sharing with DD was huge. The size of the bathroom, with a bathtub big enough for both of us. The tasteful, but meaningless art displayed on the white walls; everything white, as pure snow.\n“I feel like Kate Middleton. You know what Tamsyn would say, right? ‘Oh, Adelia. They tricked you and locked you in a rehabilitation center,’” My sister’s girlfriend was the only one who ever called her Adelia, the name that had belonged to our Brazilian great-grandmother. She’d always been DD or Dee to us.\nDD and I were always easily mistaken as everyday white American girls; with our blonde hair and blue eyes, our pale glowing skin and the gentle freckles covering her nose and cheeks. DD was shorter than I was, busty, whereas I’d always been slender and lacking any breasts. But we’re undeniably sisters, cut from the same tree, from our dad’s DNA. Gray was the one with the dark eyes and the dark hair of our dead grandfather and Uncle Jamey; Gray was one who even remotely looked like an Ocampo.\nHe knocked on our door. The door wasn’t locked, so he turned the knob and shyly pried in. “Uncle Jamey is waiting for us.”\n“We’ll be there soon,” DD singsonged. Once Gray was gone, she held my shoulders and said, like an old incantation, “It’s going to be fine.”\nUncle Jamey and Aunt Sarita were waiting at the beach. Aunt Sarita, hiding behind huge sunglasses, lifted one thin arm and waved at our little procession, while Uncle Jamey came ambling over the sand for a proper greet. He first hugged Mom, and then Gray; he messed with my nieces’ hair and then kissed Maura’s cheeks. He said to DD:\n“My God, you grew up.”\nAnd, as for me: he embraced me as if I were his long-lost daughter. I froze. The last time Uncle Jamey touched me, his fingers felt like they wanted to break me in pieces.\n“I’m so glad you’re all here,” he said to everyone, once our embrace was over.\nUncle Jamey had gained some weight. His wrinkled face was tanned enough, like rough leather, beard and hair still mostly black, a few patches of white making a discreet appearance. He was built like a bear, my uncle. Not that tall, but burly. And there was my Aunt Sarita: she rose up from a white folding chair and approached us, holding a drink in one hand, using her free hand to distribute half-hugs. Aunt Sarita looked better than ever. The last time I saw her, she might as well have been a ghost of herself, skinny and all bones. But now she smiled; now, she kissed us. And her black skin was dewy and beautiful, her lips glossy from all the protective balm I imagined she must have been wearing.\nWhen my grandparents first arrived in the United States, when they disembarked in Miami and inhaled the American air, they had two rules: that their children, Uncle Jamey and Mom, should get an education (Uncle Jamey told us that), and that they should marry good, white Americans (my mother told us that, her lips curling as if in a snarl). My grandparents had old money and a shame that stuck to them as if a shadow. Shame of being South Americans. White South Americans, but South Americans nonetheless. América Latrina, they would say of the place they’d left. A shithole. They held on to their whiteness as if holding on to gold; for in the far south of the Americas, whiteness was sometimes more valuable than money, and they wanted their children to marry white Anglo-Saxon people and have white babies, so maybe one day they would forget about where they had come from.\nMy father was white. White and blonde, as American as apple pie—the kind of American my grandparents envisioned and wanted for their daughter. Reliable as plain bread.\nBut Aunt Sarita was an African-American woman, and my grandparents never hid their displeasure. They threatened not to show up for the wedding. They tried every emotional blackmail they could come up with. In the end, they relented; because Uncle Jamey was as stubborn as every Ocampo and would have his way. My grandparents were at the wedding, sitting silently, holding hands and barely glancing at Aunt Sarita’s family.\n“When you grow up, you understand your parents are only human, and that being human is an ugly business,” my mother told me one day, the same day she decided to explain it all—my grandparents’ shame, their racism. I was sixteen. My grandmother had recently died, while my grandfather had been dead for years. “You and Dee and Gray must have come to this same conclusion, I’m sure.”\n“You and Dad aren’t assholes or bigots,” I jumped to their defense.\n“Don’t say that.” Her voice was low, almost fading.\n“What?”\n“Assholes,” she whispered, as if my dead grandmother was standing right in the next room, ears pressed against the wall.\nMy grandmother’s last days had been tough and, as we spoke, my mother had a bit of bourbon—something she wouldn’t do in front of my father, in the same fashion DD and I would hide our casual smoking from her. My grandmother had spent her last three years in a retirement institution, exhibiting increasingly erratic behavior. She was often hostile when my mother and I went to visit, bringing flowers she’d dismiss with the movement of a hand covered with aging spots. She’d say how ungrateful my mother had been. How Uncle Jamey never paid her a visit, and neither of her grandchildren—Gray and I—did (she barely complained about DD; since DD had come out as a lesbian, at age thirteen, coming down the stairs with a cardboard covered with glitter that said “I’M A LESBIAN,” surprising no one, my grandmother, once hearing the news, had pretended DD didn’t exist anymore).\nMy mother sighed softly. I wasn’t sure if she was drinking because she was sad or because she was relieved her mother was finally gone. Maybe both. As much as we tried not to, we’d always make excuses for our parents’ behavior, even when they hurt us. During the twilight of a dying parent’s life, we’d airbrush whatever we could.\nBut parents did the same with their children, I thought. Every big flaw swept under the carpet, every minor good magnified and turned into glory. When we are yet to be born, just tiny tadpoles swimming inside our mother’s belly, our parents already dream wonderful things about us, about the people we will become. Before our first breath their mind is already spinning stories for these fictional selves they imagine we’ll be one day.\n“Where is he?” my mother asked Aunt Sarita.\n“You’ll meet him soon. Dinner? Tonight?” she said, like it was a casual invitation and not what had brought us there in the first place. “Oh, look at them. These babies!” Aunt Sarita bent in front of my nieces and cupped their plump cheeks with her hands, passing on her glass to Uncle Jamey. My nieces were strangely silent. Maybe Maura had warned them.\nWhen Aunt Sarita straightened herself again, it hit me that she might have been drunk. All the good humor and the kissing, and the way her feet danced over the sand when she took a few steps back, Uncle Jamey holding her by the elbow . . .\n“This place is beautiful. It’s paradise. You’ll love it,” she said.\nDD whispered to my ear:\n“Is that one of them?”\nIn the distance, a man and a girl meandered by the shore. The man was dressed like your average middle-aged white tourist: flowery shirt and khaki shorts. He had gray hair and a pink face drenched with too much sun. The girl wore a white dress that the wind waved gently. Father and daughter, I concluded.\n“I think so,” I said to DD.\n“Holy shit,” DD’s whisper was ever lower that time.\nI put on a new dress. Black but ordinary: a dress that stated nothing beyond its pristine shape. New. Adequate.\nI combed my wet blonde hair and then sat at the edge of my big bed, waiting for DD. I remembered my breathing exercises, the ones I learned years ago while in therapy, and put them to good use.\nDD caught me in the midst of it. She thought I was having a panic attack.\n“It won’t be that bad, I swear,” DD said, holding my hands, forcing me to get up in a single movement, as if asking me for a dance. And I believed her, because I would have grabbed on to any promise at that point.\nUncle Jamey and Aunt Sarita had a whole apartment inside the clinic. A large place with white walls, three bedrooms, a long dining table, and chandeliers.\nIn one corner of the living room, there was a black grand piano. The ghost before the real ghost. Breathe, I told myself. Just breathe.\nWe’re served beautiful seafood cooked to a lovely point of tenderness, the only sound the cracking of their hard shells, buttery sauce dripping from spoons we used to help ourselves. I barely ate. The shrimp tasted good and tasted like paper at the same time. I wished for nothing but one of my father’s spaghetti, the creamy tomato sauce I had been raised on. With my fork, I pushed the food aside; and then to the other side; I considered the shape of those creatures that had once lived underwater, in the silence of the deep sea, unaware of the things that haunted us, human beings.\n“Here he comes,” Aunt Sarita said, and I froze.\nAnd here he came: the final ghost. A boy with dark skin, skin that under that low light shone like bronze. A boy dressed in white. That easy and benevolent smile. The shyness as he stopped and stared at us, looking for . . . permission, I imagined.\n“Sit, darling,” Aunt Sarita said. We were unable to utter a single word. Our eyes were locked on the impossible figure before us. Charlie reborn; Charlie made himself again, as David sculpted from marble, from his smooth curly hair to the dimples that only ever revealed themselves when he couldn’t contain a smile. And he looked at us as if we were somehow a miracle too. Aunt Sarita gestured at a chair and he sat down. “What do you want?” Aunt Sarita asked, and Charlie shook his head and laughed—Charlie’s laugh. Aunt Sarita got him a bit of everything, and Charlie took his knife and fork and ate slowly. A hint of surprise here and there; as if the taste was something new and magical.\n“Can you eat real food?” one of my nieces asked.\nThe unexpectedness of that particular question forced DD to hide a laugh. Gray shot a look at Maura, whose face was now red. So she had told the twins what this new Charlie was.\n“Yes, of course I can,” Charlie said, smiling again. “I know your names. Megan and Ines, right?”\n“I’m Ines,” Ines said. “She’s Megan.” And she touched her sister’s head.\n“And you’re my cousins. Gray, Mia, and Adelia. Did I get it right?” Charlie said. When he said my name and looked at me, I couldn’t help myself. A storm had been brewing inside my stomach. I tried to smile and too late noticed I was crying. DD made a move; rose from her chair, trying to hand me a napkin, but I was already standing and running from the apartment. I puked inside a vase.\nCharlie died when we were both eighteen. He already looked like the man I had merely glimpsed that day by the lake, when I kissed him.\nMother told us Charlie would be spending part of that summer with us.\n“What, he’s not going to Aspen this time?” Gray asked, somewhat resentfully.\n“Charlie’s having some problems back home. So let’s make him feel welcome, OK?” Mom said. Gray mumbled something, his shoulders moved, and we took that as agreement. He’d held a tiny grudge against Charlie ever since they were young. It hadn’t as much to do with Charlie himself than as with Uncle Jamey’s money. Uncle Jamey was undeniably rich; he had taken his part of the money our dead grandfather granted him and multiplied it, turning water into wine. He bought companies and then sold them. And then he bought more companies and sold them too. Whenever asked what his father did for a living, Charlie would look disarmed and, in an indifferent voice, simply say: “My father buys stuff.”\nMom had used her money to invest in Dad’s restaurant. It was a smart move by any account. Nothing ever lacked us. We lived in a good house in Philadelphia and we vacationed every year. Our tuitions were guaranteed. We’d been hit by recession here and there, and Mom’s money always saved us, and Dad managed to stay in business while we sailed through every storm.\n“He can have my room,” Gray said. “Maybe I should go back to San Francisco earlier.” Gray was a sophomore in Santa Clara University; he was back for the summer so he could help Dad with the restaurant—but he had longed dreamed of a summer job away from the kitchen and the sweet smell of pasta sauce—away from us.\nWhen Dad brought Charlie from the airport, Charlie had a duffel bag and a purplish eye.\n“Oh, my God. Charlie, dear,” Mom said, bringing him in. Charlie was quiet. Mother sat him on a kitchen chair and ran and gave him a glass of water. DD and I peered by the kitchen entry, but said nothing, and Charlie seemed too ashamed to look at us. “Let me get some ice,” Mother said.\n“No, that’s old,” Charlie said, and managed to laugh a little bit—a weak laugh, while he still looked at the floor.\n“Uncle Jamey did that?” I asked.\nCharlie shrugged. I couldn’t picture Uncle Jamey hitting him; not Charlie, whom he loved so much. And I certainly couldn’t picture Charlie, with his smooth hands, hands made for playing the piano, fighting back.\nA story came to my mind: something my mother had told me a few years ago. Once, when she was little, and the family was having dinner, Uncle Jamey tried to impress my grandfather by saying a few words of Portuguese he’d been learning by himself. My grandfather’s face went blank for a second. He got up, and Uncle Jamey felt proud, like he was going to be congratulated, but then my grandfather slapped Uncle Jamey’s face so hard his palm was imprinted on the boy’s skin in an ugly red color. “Only English,” Grandfather had said, before sitting down again. My mother remembered trembling, She remembered trying not to cry, afraid she could be slapped for that to.\nCharlie’s hand was also scraped. Only the right hand.\n“What did he do?” I asked, my voice angry. But Charlie looked at the scrapes and said: “No, that was me. I did this.”\nThe nature of Uncle Jamey’s and Charlie’s fight—disagreement, Uncle Jamey would have said—had to do with Charlie’s insistence on not going to Juilliard. Not so soon, at least. Charlie wanted to travel the world. He wasn’t sure he wanted to play the piano as a way of living. Uncle Jamey was furious. You’re an artist, he had said. I play because you always wanted me to, Charlie retorted. At some point, frustrated, Charlie punched a wall. A gesture, he’d say, that looked much simpler—and more dramatic—in the movies, and that he instantly regretted. And as soon as he backed up from the wall, holding his fist in pain, Uncle Jamey struck him. Not with a slap, but with a punch. That punch made Charlie’s world become a fast, nauseous merry-go-round. It made him see the black of an infinite universe, the explosions of little stars. Aunt Sarita was screaming in the background, and yet the world kept spinning, that living room, the stars, the darkness. When Charlie came to himself again, lying on the floor, Uncle Jamey was standing before him, panting, face as red as a tomato. Charlie thought his father was having a heart attack. Aunt Sarita was cradling Charlie’s head in her arms, yelling at Uncle Jamey, telling him to stay away.\nFor a second or two, everything had gone black and then there was his father, a look of unspeakable horror on his face, as if he hadn’t known up to that point the kind of violence he could commit against his own child.\n“Charlie really likes being with you. And he just needs time. Both of them do,” Aunt Sarita had told Mom on the phone.\nAnd so we had Charlie for the summer—another summer. Upon seeing Charlie’s face, the damage against his flesh, Gray simply said: “You can have my bedroom. I’ll sleep in the basement.”\n“You really don’t need to do that,” Charlie said.\n“No, really. It’s fine,” and Gray waved his hand; waving away Charlie’s concern and, I wondered, whatever previous opinion he’d held.\nIt was a good month. Nothing remarkable about those earlier days. It was my last summer at home after graduating from high school and soon enough I’d be a freshman at Penn. For a long time, I considered getting a major in history. But now I wanted to study Latin American cultures (which no doubt would have my grandparents rolling in their graves). I felt happy; I felt things were getting into their rightful place. Charlie’s presence seemed to confirm my feelings. He made the house whole, somehow. I had long gotten over my teenage crush, but he was always my confidant. For him, I had always felt a camaraderie I could never feel for Gray. I could pour my heart out to Charlie and get no judgment, and he’d do the same. I could share with him things I thought I couldn’t share even with DD. Our many emails and texts exchanges over the years proved it so. I knew the Charlie behind the serene façade, the Charlie that wanted things. Things he had locked inside of himself, things he was afraid of sharing with anybody, least of all his parents. Charlie’s silence was not passive; Charlie’s silence was hunger, and that was the biggest truth I ever knew about my cousin.\nThroughout those weeks, we helped Dad with the restaurant. Charlie proudly wore his black apron and learned how to attend on tables. The best pasta you could eat in Philadelphia; in Dad’s mind, that’s what the restaurant meant. He taught Charlie the basics of a good Bolognese and how to make gnocchi from scratch. Charlie loved, laughed at his mistakes, his fingers white with flour. On Sundays, we’d help Dad and Mom at a soup kitchen my parents volunteered at, where Charlie would flash his smile at every guest, holding their hands and leading them to vacant tables—old people, homeless people. We learned never to ask questions. The new ones, they would appear by the door almost shyly—as if they weren’t sure they should even be there—speaking in a low tone of voice and avoiding eye contact. But Charlie’s smile was so infectious he could make people he had just met laugh at a comment or two.\nWhen Charlie’s birthday came, we baked him a big cake with a lot of buttercream. We lit candles and sang Happy Birthday. There was talk of spending a few days at the lake house again, and I wondered how that would play: if we’d still be like kids, competing to see who could swim faster, who could master the waters. We’d never be like this again, together like that again, my siblings and I; Charlie and us.\nAfter the party, Gray smuggled us a few beers and we drank them in the backyard, DD, Charlie, and I with our feet inside the pool.\n“Do you really hate playing the piano?” Gray asked, walking shoeless on the short grass.\n“No,” Charlie said. “But I’m not sure I see myself as a pianist. If that makes any sense.”\n“What do you see yourself as?” I asked.\n“I have no idea. Really.” And Charlie laughed. “I think I was supposed to. I mean, you guys know what you want, right? Your calling.”\n“Nah. I want money. That’s not the same as having a calling,” said Gray.\n“I want to travel the world,” said DD. She was sixteen, she wasn’t supposed to be having alcohol—none of us was, except for Gray—but there she was, and there we were. “I want to save orcas.”\n“That’s more of a calling,” Gray pointed.\n“I wish I could travel the world, too,” said Charlie.\n“Come on. You have been up and down the country,” said Gray. “You have seen all of America, all of Europe . . . ”\nBut Charlie was shaking his head. “Not the same thing,” he said. “I went wherever my dad wanted me to go.”\nWe knew Uncle Jamey; we knew him enough, so Gray didn’t press on. Instead, he approached DD and snatched her bottle of beer. DD let out a loud complaint, but then, afraid Mom and Dad could listen and come and check whatever we were doing, she covered her mouth with both hands.\n“You’ve had enough,” Gray said, going back to the house. DD got up and went after him, silently cursing Gray.\n“I wish I could spend more time with you guys,” Charlie said, after a while, just the two of us left. “You’re so . . . normal.”\n“Charlie, we’re anything but normal,” I said. After so long, he should’ve known. Mom’s drinking, my parents’ constant fights, Dad’s cheating.\nI had told him all about it, sometimes tearfully typing emails, sometimes casually texting—when my family shenanigans couldn’t affect me anymore, when the wounds of a fight or an argument had already healed.\n“You baked me a cake,” said Charlie. “Nobody ever baked me a cake.”\n“I’ve been to your birthday parties, Charlie. There was plenty of cake, always.”\n“It’s different. Mom has our cakes delivered from the best bakeries in the city and then she dresses like it’s . . . ”\n“A party?”\n“She’ll serve champagne; but she’ll side-eye me if I even touch a can of soda—unhealthy, bad for your skin, bad for your brain. She’s even weird about coffee. She thinks I’ll turn into a zombie and trade the day for the night if I get too caffeinated, and then I won’t play good enough, or I won’t be good enough.”\n“Oh, poor Charlie. Poor Charlie and his rich parents.”\n“I understand my privileges, Mia. I’m not saying I’d give up on that and, I don’t know . . . go and die inside a bus lost in Alaska. But . . . ”\n“But?”\nHe tried to come up with an explanation; in the end, he said nothing.\n“You’re going to be fine, Charlie.” I clinked my bottle against his, in a salute. Charlie clinked back, and that was enough. The night had turned the sky purple. Then, it had made it into an inescapable dark blue. I wish I could have stopped time that night. I wish Charlie and I could have stayed in there forever.\n“Drink it,” DD said, pushing the glass of water into my hands. I felt a sweat cold and sticky against my neck. DD gave me a pill and made me lay down on my bed when I finally swallowed her enchantments, produced from little white bottles lifted from the madness inside her suitcase.\n“I can’t believe I did that,” I said. I felt feverish, too; and I wonder if there was something accusing in my eyes, because DD hesitated a bit.\n“I know I said it would be OK, but you know what? You can’t really plan for shit like this,” she said. “It happens. It’s fine.”\n“It’s not fine. Uncle Jamey and Aunt Sarita must hate me more than ever.”\nDD didn’t dignify me with a response. She covered my body, now half-naked, only my bra and panties on, and tucked me in as if I were her baby.\nI slept fast enough, deployed of any energy. At some point, I felt my mother entering the room and sitting by my side, smoothing my hair as she once did when I was a child, and then a teen. I imagined I heard her voice, speaking softly to DD, and DD answering in the same way, maybe afraid they would wake me up. And then: darkness. No dreams, not a soothing sleep. Just darkness.\nI woke up feeling my throat sore. DD wasn’t in the room, so I put on some jeans and an old tank top and left. I didn’t go to Uncle Jamey’s apartment. The mere thought of it, of facing him and Aunt Sarita again, made me sick. I went to the large veranda the Clinic had, with tall white pillars and cushioned wicker chairs. A man in a blue apron appeared as if out of nowhere and asked me if I wanted a drink. I ordered some orange juice.\nI could see the beach from where I sat. I could see DD playing with the twins on the sand.\nAnd then: my heart almost skipped a beat when I saw Charlie leaving the water, getting his curls away from his face. He had a companion. The girl DD and I had seen when we first arrived, walking with her father. Only the girl wasn’t exactly a girl. Next to Charlie, she seemed a bit older. More of my age, in her late twenties or very early thirties, than Charlie’s eighteen. They were talking at ease, laughing; Charlie seemed far more relaxed than he was at dinner, and I pulled my knees to myself and watched the scene as if I were watching a romance movie. There was something sweet about it.\n“Excuse me.”\nI turned my head and saw the girl’s father sitting down on another wicker chair. His day had certainly come to a fast start: he held a sweaty glass of margarita, his red face more wrinkled than I’d imagined. We were watching the same thing: Charlie and the girl getting out of the water, in their white bathing suits, young and so alive under the sun.\n“He’s always being a good swimmer,” I said, pointing at Charlie.\n“He’s yours?” the man asked. He had an aquiline nose, a little crooked by a deviated septum.\n“No. I mean, yes. He’s my cousin. Was.”\nThe man nodded. While holding his margarita, extending a finger only, he pointed at the girl.\n“That’s my wife.”\nWife. I couldn’t hide my shock.\nI replayed that first time I saw them on the beach. I had mistook their interactions, thought of father and daughter. I felt bile rising up through my throat, and the man must have noticed.\n“God. I don’t touch her. Never did,” he explained himself. “Although they say they have no rights of their own. That was the most awkward conversation I ever had, by the way. I asked them what was proper and what wasn’t—and they kept saying the same thing: they have no rights of their own. But in the tiny letters, if you read the contract closely and carefully, there is: the Clinic does not condone violence. Any violent behavior will immediately terminate the contract,” he moved his index finger in the air, as if reading a particular invisible line. His smile was hurt and bitter. “As if I ever could. I can barely talk to her—she’s a different person altogether. I’ll be babysitting a girl who lives inside my wife’s body for the next two years. Cheers to that.”\n“And then?” I asked.\n“Then what?” said the man.\n“After two years you’ll just leave her here?”\nHe looked startled.\n“They don’t live longer than two years,” he said.\n“What?”\n“They have only two years. I don’t know why. Something to do with the way they’re grown inside those artificial wombs. I don’t know. But they don’t live longer than that. Their organs start failing and . . . that’s it.”\n“No.”\n“I signed the contract. I know what I’m talking about. None of them will live longer than two years. That’s why we move here. We can’t take them home.” He paused at that word: home. He looked on to the girl who bore the likeness of his dead wife. “We can’t take them anywhere. We live here for two years and then the dream is over.” He laughed. “My son told me this was insane. That it was a monstrosity. I should have listened to him.”\nHe drank his margarita whole and left the glass for someone else to pick up. He was up and gone before I could say any word.\nThe man with the apron arrived with my juice. I didn’t touch the glass. I went to DD, stood in the berm for a second, and then ventured past the shoreline, where she and my nieces were.\n“Did you know they only live two years?” I asked, almost shouting.\nShe was close enough to listen. I had entered the water up to my ankles, not caring about my jeans getting wet, my flip-flops making me move in a clownish way.\n“What?” DD asked, pressing her fingers against her eyes.\n“Who?” Megan asked. The twins seemed excited. “The clones?”\n“Don’t repeat that,” I said. “Don’t tell this to anyone.” And, to my sister, I asked again: “Did you know?”\n“No. Of course not,” DD seemed genuinely confused. “Who told you that? Mia?”\nI sat right there: in the water, letting the gentle waves hit my belly, my black tank top. I must have looked the very picture of what miserable was. Ines came near me, patted my head. “You won’t puke again, auntie,” she said. DD eyed me with a similar concern, afraid I’d vomit in front of the children, in that beautiful sea. I held my nausea down. I cupped my hands, filled them with water, and splashed my face.\n“Wake up,” I said to Charlie, pushing his shoulders.\n“What?” he said, half asleep, wrapped in Gray’s duvet.\n“Let’s go on a mission.”\n“What time . . . ”\n“Seven in the morning. Get up,” I said.\n“What is wrong with you?” Charlie asked, but he complied, sitting up, rubbing his eyes.\n“We’re gonna buy a lot of crap today. Coke—the kind you drink, not the kind you snort.”\n“Oh, no,” said Charlie.\n“Red Bulls. Twix bars. Or Milky Ways. Some M&M’s, for sure.”\n“Are you planning on getting us diabetic? Because I think I’m missing the point,” Charlie said.\n“The point is, you’re spending summer with me, and that’s how we do during my summers. We get shit-faced on candy and things that are bad for skin and our brains,” I said. He sighed. I simply shoved a pillow on his face. Nobody was yet awake when I got Dad’s car keys. Charlie was still in his pajama pants, wearing an old T-shirt belonging to Gray, and I merely put on a sweatshirt over my own pajamas. Knickers on, the gas running, we hit the streets. I was looking for a nearby 7-Eleven. No music was playing, I wasn’t humming at any song; nor Charlie was. I suppose, if this was a movie, we’d have had one last meaningful conversation inside that car, a conversation that would haunt me, but that would bring some meaning to what happened. The truth is: we said nothing to each other. We didn’t speak of our family. Morning light shone on the streets shyly, and the parking space at the 7-Eleven was empty and quiet, almost eerily so. That was the scenario. That was how the tragedy was arranged.\n“You’re staying?” I asked Charlie as I left the car.\n“Yeah, I’d rather not be discreetly spied on by some eighteen-year-old dude who thinks I’m gonna rob him. The white girl can do it today,” Charlie said, and I put my tongue out and closed the door.\nI took my time picking the candies. The cashier wasn’t a teen, but a middle-aged woman.\n“Got the munchies?” she asked.\nA bit surprised, I nodded, and she gave me an unreadable look.\n“Here’s what I got,” I said when I entered the car again, holding my bag of trash food and candy. “Want some?”\nCharlie didn’t answer. His head was pressed gently against the widow, as if he had simply dozed off.\n“I can’t believe you,” I said. “Charlie?”\nI shook him\n“Charlie, c’mon.”\nHe didn’t wake up. I shook him harder.\n“Charlie, stop,” I said. And then I begged. I shook him again, more violently, but his body was soft; it made no attempt to resist me.\nI felt his pulse. Nothing. I let the bag of candy drop on the floor and quickly turned the car on, trying to find the nearest hospital. What a vision I must have been: to the nurses, to everyone in the waiting room. A banshee screaming, my blonde hair unraveled, half-dressed in my pajamas and trying to explain what was happening.\nHis heart. That’s what the doctors told us. Charlie’s heart had simply stopped beating. Sudden cardiac death. SCD. He’d had a congenital defect nobody knew of. And we could have spent the rest of our lives never knowing about. But that day, that morning in the car, while I was away, his heart decided to beat one last time. While I was picking some candy bar, Charlie gave out his last breath.\nWhy didn’t I feel it? Like a cord being ripped, the golden cord that connected Charlie to me, that connected our blood.\nWe buried him on a day when the sun was high. I couldn’t stop crying, my hand covering my mouth, trying to muffle the sound. Aunt Sarita wore her grief with elegance, one tear streaming down her face every minute. I was a mess. I didn’t want to be there, but I couldn’t not say goodbye. Uncle Jamey was fighting his own tears. His fists clenched, he kept looking at the hole opened on the fresh dirt.\nI didn’t see his approach. When I did, Uncle Jamey was right on me, heaving and red, and I thought, for a split of a second, that he wanted to hug me; I thought of how undeserving I was and prepared to apologize. But Uncle Jamey didn’t want to hug me. He clasped me by my black dress, he pushed me down, against the ground, as if wanting me to be devoured by that same earth that was now going to engulf his son’s body. I didn’t fight back, paralyzed as I was. Aunt Sarita screamed her husband’s name and, next thing I knew, my father had grabbed Uncle Jamey by the lapel of his black coat, dragging him away from me. DD and Gray helped me up in the midst of the mourners, the people who had known or loved Charlie, and guided me back to Dad’s car. When Dad appeared, his suit undone, gasping for air, he asked me: “Honey, are you hurt?”\nMy dress was dirty, my hands scraped. I opened my mouth. But I couldn’t speak. I could only wail.\nWe didn’t see Uncle Jamey or Aunt Sarita again for a long time. Every time I’d think about them, I’d remember Uncle Jamey’s fingers on my dress, his raw pain, the raw desire to hurt me.\nAnd then: that email.\nMy parents divorced almost a year after Charlie’s death. They didn’t divorce because of Charlie, but after everything that happened, I’d always wonder what part grief took in our decisions; the great and the seemingly inconsequential ones.\nI went to therapy. I went to Penn. I graduated in Latin American studies, and I even learned Portuguese—decently enough. I had boyfriends, but none of them stuck for a long time. I didn’t let them.\nWithout him, life went on. Without you, Charlie, the world went on. We never went back to that house by the lake. Our childhood was over, our family was scattered. Gray got married and stayed in California, where the twins were born. Real twins. Summer children, both of them. DD traveled the world. She lived as a digital nomad for a few years, sending me uplifting videos from Chiang Mai or Bali or Ireland for almost two years. She gave up on her nomadic lifestyle when she came home and met Tamsyn. Tamsyn had promised to make an honest woman out of my sister. They were talking about opening a food truck, growing roots in Philly. It runs in the blood, DD would say; the business of food. So many things did run in our blood. She told me I should jump aboard, but after almost a decade working as an online teacher, I felt the need to go back to school, to get a master’s. I was trying to figure myself out.\nAnd then, again: that email.\nI heard a knock on the door.\nI expected it belonged to Gray, or even Mom. Theirs was the realm of excessive politeness, of gentle knocks.\n“Can I come in?” I knew that voice. Charlie’s voice.\nSince that fateful dinner, since I’d learned about the clones’ life expectancy, I’d avoided Charlie; I’d avoided everyone, in fact, forgoing family gatherings, the invitations Aunt Sarita would send by the way of DD. I wanted out. During the previous night, I had a nightmare: I had been with Charlie at the beach, and then his flesh started dissolving, his body turning into a putrid mess right there on the sand, while I screamed for help. When the morning arrived, I knew I wanted to go back home. I’d started packing my things and was halfway having everything done when I decided to sit on my bed and . . . do nothing. Unable to move, all I wanted was to stay under the covers and somehow wake up inside my pitiful apartment back in Philadelphia. Skip the bureaucracy of traveling. Skip the planes. Close my eyes and open them again and find myself back home: that was my only wish. As if the real nightmare had been this island.\n“Mia?” Charlie again.\nI smashed the cigarette I’d been smoking in the beautiful stone ashtray the Clinic provided. I opened the door carefully, just a slit, unaware of what would be actually waiting for me on the other side: the monstrous version of Charlie, his body melting away, or Charlie, the clone.\n“Yes?” I said.\n“Can we talk?” Charlie asked.\nI hesitated before fully opening the door. I let him in, but I made sure there was some distance between us. I sat on the white armchair we had in our living area, and Charlie dutifully sat on the couch, hands over his knees.\n“He told me,” Charlie said. “Jamey—my father. He told me what happened. That you were there when I died.”\n“When Charlie died,” I said, and if I sounded aggressive, he didn’t seem bothered. “And I wasn’t there. I wasn’t with him. He died alone, in my dad’s car.”\n“I know. My father told me that.” The way he’d say “father”—as if the word felt strange yet on his tongue. As if he was learning from some guidebook. Who he was, who Uncle Jamey was. Who I was. “He said you feel guilty. But you shouldn’t. It wasn’t your fault.” Now he sounded like the therapist my parents forced me to attend after Charlie’s death. Saying the right things, in the right timbre.\n“I know there’s nothing I could do,” I said. “Trust me, I went over this many times.”\n“I wanted to apologize to you,” Charlie said.\n“Why? I was the one who made a scene.”\n“Understandably so,” he said. Understandably so: I repeated that in my own head, wondering if Charlie had ever said those particular words when he was alive.\n“You don’t talk like him,” I said.\nHe had no explanation to give me. He smiled; gently. But also in a different way Charlie would have. He wasn’t shy. He was careful.\n“Are you Charlie?” I asked.\n“I don’t have the answer for that question,” he told me. At least the clone was honest.\n“When you look at me—at any of us—do you remember anything?”\n“No. I wasn’t made with memories.”\n“Then how can you be Charlie?” I felt my eyes burn, wanting to cry.\n“I don’t know if I can. I don’t know if I am,” he said. “But I don’t want to hurt you. I don’t want you to feel bad because of me. My parents don’t want that. Please, have dinner with us tonight. With our family.”\nI managed not to say it wasn’t his family. I managed not to cry. I simply waved my head in the slight, agreeing; it wasn’t that I truly wanted to have dinner with them. I just wanted this new Charlie gone from my room.\nHe stood up. Dressed in pure white, he made me think of a cult member. They all did: the three or four clones I’d seen so far, walking around the island, accompanied by their loved ones. You could put flowers in their hair and they’d look like a hippie family, living happily in their golden paradise. “Thank you, Mia,” Charlie said, as if I had granted him an immeasurable pleasure. He let himself out.\nI didn’t move from that armchair for a long time.\nI put on black pants and a blouse and gathered my hair in a ponytail.\nUncle Jamey was the one who opened the door to me.\n“Mia,” he said softly, and then he brought me against his chest, gently. “I’m sorry.” For what, I wondered? What had happened during the last dinner or what had happened after Charlie died? It made no difference—not anymore. I accepted his apologies without answering. I was brought in. I was shown my place at the table and I looked at my mother, who was attentive to my every move. I nodded in her direction: an indication that I was fine.\nI ate the tender seafood. I didn’t freeze when Charlie showed up—and neither Uncle Jamey nor Aunt Sarita tried to make a big thing of it, a grand entrance. Still, there he was, all in white, to mark his difference, for whatever reason it was. Throughout the dinner, we engaged in small talk. Rather, my family did. I avoided speaking. They were sharing memories; memories of the old Charlie, things the old Charlie had said and done, and the new Charlie would smile and nod and laugh at what was told. Uncle Jamey in particular wouldn’t refer to the old, dead Charlie as someone gone. He’d refer to him in second person, as if he was with us, and as if that new Charlie was our Charlie.\n“Remember when you . . . ”\n“And that time when you . . . ”\n“Once, when you were little . . . ”\nWe accepted that. The face matched the name, after all. A little bit more of it, more days, months, two years, and we might all have started to think about that new Charlie as the old Charlie. He’d have been trained much like a Pavlov dog, ready to give the right answer when a particular memory was evoked, even if he had no real remembrance of it.\nAunt Sarita’s eyes would glaze with tears from time to time, during that conversation; but she would never bring herself to actually cry. She was drinking more than anyone, and I imagined I had guessed correctly when I thought her a bit drunk that first day we met at the beach. It shouldn’t come as a surprise. Everyone had a different coping mechanism to the wondrousness and weirdness of what was happening. And to be before her own son; whole again, coming back from the dead to be once more inside her arms. I could understand that. Mothers kept our bedrooms.\n“Play something for us, Charlie,” Uncle Jamey asked.\n“Yes, play a little bit, dear,” Aunt Sarita said.\nCharlie rose from his chair and sat by the grand piano. He touched the piano keys lightly, and then the music started, Charlie’s posture impeccable. I remember the old Charlie playing. He’d often start like that, a perfect pianist, but then descend into some kind of fury. The new Charlie, however, was merely composed. Not that he didn’t play beautifully; he did. With the corner of my eye, I saw my mother silently crying. As for me—that music took me back more than ten years ago, when Charlie played Julius Eastman from his smartphone so I could listen.\n“Now, that’s music,” he’d told me. “Suppose I’d be a musician; that’s the kind of music I’d like to make.”\nWhat was this new Charlie playing? I had no ear for classical music, so I bent sideways a little bit and asked Gray.\n“Chopin,” he said. “I think.”\nNew Charlie played effortlessly, his eyes never veering away from the music sheet. And once it was over, we applauded, and he turned to look at us and smile. Not exactly proud. It would seem he was following a cue given long before.\nAunt Sarita went to him, put a hand on his shoulder, and he smiled at her. And then the change came: so sudden, so unexpectedly. Aunt Sarita’s own smile wavered for a second, before dying in a beat. Her tears were finally let go, but her face turned into stone. Her eyes, watching Charlie, were filled with horror. That’s the only word I can conjure: horror. She released Charlie’s shoulder, almost as if that touch had burned her. “No,” she said, weakly.\nUncle Jamey reached for her, tried to hold her arms, but she turned away from him. She hissed words as her tears wouldn’t stop. “ . . . not my son,” I thought I heard. And: “I’ve had enough, Jamey.” Those last words were loud, they echoed in the room. Aunt Sarita left without looking at us. She shut herself in her suite, the closing of the door like the sound of a thunder. We were left mute. Charlie, still by the grand piano, continued to hold a smile, albeit a confused one. He didn’t know what wrong he had inflicted.\nAnother night I couldn’t sleep. I’d close my eyes and the first thing I’d see would be Aunt Sarita’s face: her fear, her disgust.\nI left DD sleeping, wrapped a cardigan around my body, and went to the beach, feeling the cold breeze of the night, smelling the salt and letting my naked feet imprint deep marks on the sand; proof that I’d been there, proof that everything was real, that I wasn’t stuck in a dream or a nightmare.\nI stopped cold when I saw Charlie just a few feet away from me. He was sitting on a beach towel, looking at the sea, the water glinting like silver. Behind him, a man in blue stood in waiting, like a bodyguard.\n“Hi,” I told Charlie, as I approached him.\n“Hi, Mia,” he said.\n“Can—can I even be here?” I asked and looked at the man in blue.\n“Oh,” said Charlie. “Yes, you can. He’s just here to guarantee my safety. But you can interact with me.” A curious choice of words, I thought, as I sat by his side.\n“Sleepless night,” I said.\n“I wouldn’t know. I don’t really sleep,” Charlie told me.\n“What?”\n“I mean, I sleep very little. Two hours, sometimes. I don’t need more than that.”\n“That’s how you got the time to learn to play the piano?”\n“In a way,” said Charlie. “That’s the first thing they taught me. After speech. And growing muscles.” They. I didn’t dare ask who they were. The only people I ever saw were the ever-helpful staff at the Clinic, the people in the blue uniforms, the ones who’d serve our drinks and our food and changed the sheets of our beds. Whatever happened deep in the Clinic, maybe in richly technological basements, those places forbidden for us: that was what I tried not to imagine. Bodies rapidly growing inside sacks filled with fluid; the awakening of those same bodies, their confusion, their fear.\nEarlier that night, after we left Uncle Jamey’s apartment, Megan had gleefully stated that she wanted to be a clone when she grew up. Maura squeezed her little arm with no gentleness, and sure enough Megan started to cry. “Don’t you dare say that,” Maura told her, in a furious whisper. “Do you understand?”\nAs we stopped by their room’s door, Gray said to me, “We shouldn’t have come. This was a mistake.” He looked exhausted. As much as Uncle Jamey did when we were leaving; those same brown, sad eyes.\n“They told me I was a he. They told me my name was Charles James Ocampo. After they had taught me everything, they brought them in,” Charlie kept going. “My parents. They told me who they were, who I’d been. My parents told me how much they loved me, and I said I loved them back.” Do you even know what love is? I wanted to ask him. How could they have taught you that? “But they don’t look at me anymore. My mother, she doesn’t want me near her. My father can’t bear speaking to me. So here I am.”\n“We can adopt you,” I told him. More of a joke than anything, but suddenly my mind was trying to unwrap how—and if—such a thing could happen. “Mom can adopt you. You’d like Philadelphia.”\n“I can’t leave the island,” he calmly stated. “And I’ll be dead in two years, anyway.”\nThat almost knocked me out: to hear him saying it.\n“Who told you that?”\n“They tell you in your first days. No use to make it a secret. Mia. Mia, why are you crying?”\n“I’m not. It’s nothing,” I said, drying my tears with the sleeve of my sweatshirt.\n“You still blame yourself. You think it’s your fault,” Charlie said. “It wasn’t.”\n“You don’t know that.”\n“I know enough.”\nI stared at the sea. How gently the waves would meet the shore, almost with no sound, leaving a trail of fast-dissolving foam; only for the sand to be swept again and again, cleaning the slate. I could write Charlie’s name in that sand, I thought, and then watch it disappear little by little.\nI’m sorry I woke you up that day, I wanted to say. I’m sorry I took you with me. I wanted to cheer you up. I don’t know if you’d have died if I didn’t do those things. Maybe you’d have slept the whole morning and by midday you’d be OK; awake, making jokes. Or maybe you’d have died anyway. But at least it wouldn’t have happened like it did. I wouldn’t have this last image of you inside my head.\nBut instead of saying the words, I pressed my eyes with my knuckles. What I actually managed to say, after a few minutes, was: “I wish you weren’t all alone when it happened.” I took a deep breath before I dared to look at him. “Do you forgive me?”\n“Yes,” he said. “I forgive you, Mia.” And then he brought his lips close to me. He kissed my forehead, and I closed my eyes, which were burning with tears. “I forgive you,” Charlie said again. “Don’t cry. Please. You should get some sleep. And I should be in my room.” He got up, brushing away the sand that stuck to his white pants. “Let’s meet tomorrow? Here? Adelia told me I was the best swimmer. Of all of you.”\n“You were. But don’t call her Adelia. She hates it. Call her DD.”\n“DD,” Charlie said and laughed. “I’ll remember. Tomorrow, then?”\n“Sure,” I said.\nCharlie joined the man in the blue uniform, who led him back to the Clinic. They talked as they walked. They even laughed in the distance, and the man in blue started to look like less of a bodyguard, less menacing, and more of a companion. I made my way to my room, entertaining the idea of somehow smuggling Charlie off of the island. Giving him a chance to live the few years he had somewhere else. But he already lived in a paradisiacal place, I thought to myself as I got into bed, trying not to wake DD.\nThey built castles in the sands. DD and my nieces did, while Charlie and I watched, the sun burning our scalps, our shoulders ladened with sunscreen. My nieces inspected the sand for treasures. They asked us if they could keep the pearls if they came across oysters, and DD tried to explain to them they wouldn’t find any oysters there.\nWhenever the twins were tired, Maura would bring them plastic bottles filled with icy water, and DD would sit by our side, stretching her legs and sighing audibly enough.\n“Beautiful day,” she’d say. And she’d eye me, and then eye Charlie, trying to measure our moods against her own.\nWe hadn’t seen Uncle Jamey nor Aunt Sarita that morning. Gray told me, as we had our breakfast, that they had been arguing; that Aunt Sarita’s crying could be heard from behind their apartment’s door. I’d met Mom at the veranda, having two pieces of melon, the only thing she could seem to stomach. “I’ll try and talk to them,” she said. The discreet bags under her eyes were darker, and I wondered if she’d been having any sleep at all. “Later,” my mother said; a voice that didn’t invite discussion. “Now you kids enjoy yourselves.” We kids. And it seemed like we could be kids again; kids during the summers by the lake, unbothered by the complications of adulthood.\n“What happens if they don’t want him anymore?” DD asked me that morning, while we were still in our room.\n“They can’t,” I said.\n“Says who?”\n“I’m sure it’s part of the contract. They can’t simply . . . abandon him.” And abandon him to whom? What would the Clinic do with an unwanted clone? DD’s silence, which followed my attempted justification, implied she wasn’t so sure. I shared with her my idea of smuggling Charlie away.\n“Yeah, that would work. They’d shoot us down before we reached the airport.” It was meant to be a joke, and she laughed. But then we looked at each other and it didn’t seem that funny anymore. We understood we had no idea what the Clinic was capable of. We came as blind guests and were at their mercy more so than at Uncle Jamey’s. A shiver ran through my body. I shook my head and tried not to think about it.\nAs we rested on the sand, I saw them again: the old man, his young wife. Walking by the shore, talking, the man keeping his hands inside the pockets of his shorts. They passed by us and I avoided eye contact.\n“You know that girl, right?” DD asked.\n“Her name’s Ingrid,” Charlie said. DD didn’t ask for more information.\nThe new Ingrid and her husband kept a polite distance between themselves. She didn’t contribute much to the conversation they were having. Sometimes she’d nod at something the man would say, and they’d continue on their path, covering the everlasting shore of the island.\n“I spoke to my parents,” Charlie said suddenly.\nI averted my attention from Ingrid and her husband. “Did you?” I asked.\n“They’re going back to New York for a while. My mother needs time.”\nDD and I exchanged looks.\n“I can stay with you, until they come back. I can give online classes—I mean, that’s pretty much what I do already,” I said. “Maybe I can teach you Portuguese.”\n“That would be nice,” Charlie said. Then: “Should we go?” He moved his head, pointing at the sea.\n“Yup,” said DD, getting up.\nThe three of us got in the water. We went under for a second, and my heart felt heavy. There was so much I wanted to tell Charlie. I wanted to say his parents would be back, that they loved him too much. I wanted to say I’d be there. We’d lost time, but we could make up for what was lost. Create new memories. We emerged, laughing for no reason, gasping for that good air. My muscles felt a bit stiff. I realized I hadn’t swam for a long time; not since I was a teen. I was crying, too. For a simple happiness such as that.\nCharlie kept pushing on.\n“Wait,” I said. “I’m not that fast anymore.” As if I were speaking to the old Charlie, the Charlie that had all the memories of those summer days.\nHe stopped. He looked at me and, just like that, I knew what he was going to do. What he’d probably planned on doing even before the sun rose.\n“Then don’t be,” he said. He came closer. “I know you’re good. I know you’ll try. But don’t come after me.” I opened my mouth to protest. “It will be fine, Mia. You’ll be fine.” He held my shoulders for the briefest time. He let me go.\nAnd then he was gone: swimming as fast as he could, one arm after the other breaching the water, going farther and farther. I shouted his name. I did what he asked me not to, I tried to reach him, to beat him in the game. But we could never beat Charlie.\n“Mia!” This was DD. She was screaming; a pitched, fearful scream. “Don’t!”\nI couldn’t. I couldn’t swim that fast, so I stopped, watching Charlie get more distant by the second. I begged him to come back. Inside my head, I begged him to swim back to the island. After a while, I felt a tug on my arm. This is it, I thought. The cord that had united us, the cord that never snapped the day Charlie died, is at last breaking, separating us. But it was no cord; that tug was DD’s arms grabbing my waist.\n“Don’t,” she said again. A voice that could have come from far away, that seemed to reach me from another universe entirely. But she was right there, padding by my side, trying to keep both of us afloat. She dragged me back to the shore as she’d do with any burden of weight that refused to cooperate. I couldn’t function properly. I could only absorb the blurred bits of the world around us. Men and women in blue running into the water, raising their voices, ordering Charlie to stop. I knew he wouldn’t. DD brought me to the sand, her arms closed over my chest, as if she was afraid I could slip away. She was sobbing against my neck. Somewhere, my nieces were crying, and Maura was crying too.\nI closed my eyes. I didn’t see Charlie disappear. I didn’t see him going under forever. I let myself go back to our summers by the lake. I pictured him in the distance, waving at us. I waved back."}