{"fingerprint": "OIOCv2FSB7PNpMJzn/y73TbgGk8=", "sitename": "Clarkesworld Magazine", "title": "The Candlelit World: The Dark Roots of Myth and Fantasy by Christopher Mahon", "author": "Christopher Mahon", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mahon_08_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Candlelit World: The Dark Roots of Myth and Fantasy by Christopher Mahon", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "The Candlelit World: The Dark Roots of Myth and Fantasy\n Folklore and legends are part of a legacy of primal fear that begins at the dawn of humanity, when the world seemed to be dominated by the supernatural: the woods, the hills, the mountains, and the rivers were the domains of old, unseen things, and living meant living in their shadow. Candles illustrated man’s deepest fear: that humans lived in tiny circles of light in a vast, dark world.\n This motif is a constant throughout almost all of myth, and nowhere is it shown more clearly than Beowulf. Hrothgar, king of the Danes, builds a great feasting hall in the untamed moors of Denmark and brings the light and laughter of humans to the dark landscape. Grendel, a creature of the old world, pays back the incursion into his territory by slipping into the hall at night and murdering the humans inside. The golden tapestries are torn down, the lights of the hall are extinguished, and the moors are once again dark and silent.\n One of the most celebrated scholars of this tale of candlelight was a British man named J.R.R. Tolkien. In his famous essay “The Monster and the Critics,” Tolkien argued that Beowulf had value beyond being an artifact of ancient Germanic culture, and claimed that the story of a man fighting against powerful primeval forces had literary merit.\n Mythology has always influenced fantasy authors, and looking closer at Tolkien, the founder of modern high fantasy, and the writers of Weird Tales magazine, the progenitors of sword and sorcery, a whole web of connections and influences appears, tracing back to the mythic vision of a candlelit world. It’s an influence that continues to this day: two of the most popular and highly respected authors of the genre, Ursula LeGuin and now George R.R. Martin, are still playing out the struggle between humanity and the dark in their novels.\n But to understand the struggle, readers must look to myth. Three concepts appear over and over: the wilderness, the thresholds between man and the world, and the dark. These are the elements that define the candlelit world, which now permeates fantasy so deeply that it has become inseparable from the genre.\n The most tangible aspect of the candlelit world is wilderness. According to James Frazer, one of the seminal scholars on magical and religious traditions, “ . . . at the dawn of history, Europe was covered with immense primeval forests, in which the scattered clearings must have appeared like islets in an ocean of green.” Forests and other wildernesses were uncharted territory, outside the control and knowledge of humans. Naturally, untamed places became surrounded by stories of dread: the Russian forest spirits, leshyis, moaned and cried in the wind blowing through the trees, the ghostly will-o’-the-wisps drowned people in bogs, and Scottish redcaps snatched people up from deserted fields.\n Even after Christianity came to Europe, forests were still an object of deep-seated fear. Predators and other wild animals were a constant threat to livestock and hunters, and according to Barry Lopez, wolves in particular became iconic of the danger of the wilderness:\n \n “In the Bible, wilderness is defined as the place without God - a sere and barren desert. As civilized man matured and came to measure his own progress by his subjugation of the wilderness - both clearing trees for farms and clearing pagan minds for Christian ideas- the act of killing wolves became a symbolic act, a way to lash out at that enormous, inchoate obstacle: wilderness.”\n \n With the idea of a vast, hostile wilderness surrounding humanity on all sides, walls and boundaries became necessary to hold back the real and supernatural dangers of the outside world. This is the second feature of the candlelit world: the need for boundaries and thresholds.\n This concept makes an appearance in Joseph Campbell’s model of the Hero’s Journey, which features “the crossing of the first threshold,” in which the hero passes outside of the boundaries of the human world, into “[t]he regions of the unknown” such as the “desert, jungle, deep sea, alien land”. Campbell’s delineation between the realm of humans and “the unknown” is a built upon the idea of a candlelit world, with safety within the borders of light and danger outside.\n Boundaries play a prominent role in Irish mythology, where “in-between” times like twilight and Samhain were thought to blur barriers between night and day, summer and winter. Where boundaries were weak, the chaos of the world could slip in. One of the most commonly known examples of supernatural boundaries has to do with vampires: many iterations of the vampire could not enter through a house’s front door without an invitation. This was because the house was the domain of humans, and was divided from the outside world by the boundaries of its walls.\n The most primal threshold is sunset, in which the third element, darkness, overtakes the world. Darkness is the defining concept of the candlelit world, and runs throughout myth as the source of all-pervasive dread: night is when Grendel attacks Hrothgar’s hall, night is when the Irish sidhe elves come for children, when vampires of all cultures wake up, when werewolves transform and ghosts can rise from the grave. When the sun rises and light comes again, it washes away the dark and its creatures, who retreat to dark places—caves, forests, mountain valleys, or underground. But a key aspect of the dark is its association with the unknown: in folklore, the greatest fears are often nameless, taking the forms of taboos and superstitions.\n Some of the oldest and most basic myths begin with a world besieged by perpetual night, then introduce a figure, like the Native American Raven, that ignites the sun. But often, the gift given to humanity is fire, as with Prometheus from Greek myth. Fire, the source of light, plays a tremendous role in folklore of all kinds, especially in rural Ireland, where the central hearth-fire was connected to the safety and well-being of the family, and was kept constantly burning for years. Fire, besides cooking and heating, holds its position in part because it was the first defense against the dark.\n Because these ideas about the wilderness, thresholds, and the dark permeated mythology so deeply, they had a profound influence on the authors that came to define modern fantasy, namely J.R.R. Tolkien, H.P. Lovecraft, Robert E. Howard, and Clarke Ashton Smith. All of them have a long history with folklore and legends, and from their work, we respectively derive the genres of high fantasy and sword and sorcery, which continue to be some of the most popular and enduring forms.\n J.R.R Tolkien’s experiences with mythology extend from Homer’s Iliad to the Norse sagas, and throughout his work, the reader is brought back to a primal feeling of dread, especially for the woods. One of the most vivid examples from The Fellowship of the Ring is the Old Forest: Fatty Bolger, one of Frodo’s friends, is immediately seized with terror at Merry’s plan to enter it, claiming that the place is the stuff of “nightmares” and that no one dares enter it. In fact, a barrier has been built between the Old Forest and the rest of the Shire—the Hedge. The trees have actually attacked this barrier in the past, forcing the Hobbits to repel them by chopping and burning them, reenacting civilization’s struggle against the wilderness.\n Inside the Forest, the Hobbits are distinctly trespassers: Merry has to calm the trees and explain that he and his friends are not here to do harm. But quietly, the Hobbits are misdirected and lured deeper into the woods, where they are attacked by the Willow, who tries to swallow Merry and Pippin alive. Both the Old Forest and the earlier Mirkwood are reflections of the hostility and danger that was attributed to wilderness: in The Hobbit, the forest of Mirkwood lies in perpetual darkness under its boughs, and simply stepping off the path brings the danger of being forever lost in the woods.\n In 1923, over a decade before The Hobbit, the magazine Weird Tales entered the market. It published “weird fiction,” which ranged from adventure tales to horror stories, but at the center of it all was the Lovecraft Circle. The Circle was a group of writers guided by the author H.P. Lovecraft, who described his view of weird fiction in this way:\n \n “A certain atmosphere of breathless and unexplainable dread of outer, unknown forces must be present; and there must be a hint . . . of that most terrible conception of the human brain--a malign and particular suspension or defeat of those fixed laws of Nature which are our only safeguard against the assaults of chaos and the daemons of unplumbed space.”\n \n His classic story At the Mountains of Madness begins with a group of scientists travelling to the unknown wilderness of Antarctica on an expedition, and as with other wildernesses, it is the domain of older, hostile beings: the scientists find several specimens of an ancient race who once ruled primeval earth, which reanimate and murder the crew before trying to return to their ruined city beyond the mountains. The protagonists, Danforth and Dyer, follow them into the city and discover that the Earth exists at the mercy of powerful, tenebrous beings, which now lurk in the depths of the ocean or the vast darkness of space.\n Inspired by Arthur Machen, who was himself fascinated with the medieval age’s sense of the “unknown,” Lovecraft had a tremendous influence on his contemporaries, especially inside his Circle, which included Howard E. Smith, the creator of Conan the Barbarian, and Clark Ashton Smith, creator of the world of Zothique. Both of these men, whose stories featured necromancers, thieves, warriors, and adventures into forgotten temples, conversed with Lovecraft throughout their writing careers, drawing inspiration and guidance from him and his works, especially the terror-filled Cthulhu mythos.\n Despite a decided preference for Howard E. Smith’s style, modern sword and sorcery still retains strong roots in its candlelit heritage: The Chronicles of Drizz’t, one of the Forgotten Realms series’ most popular titles, features the drow, a subterranean race of dark elves that conduct raids on human settlements during the night. The setting of Drizz’t represents an alternate perspective on the candlelit world: by showing the reader Menzoberranzan and drow society, the story gives them a glimpse into the creatures that threaten humanity from the dark.\n The legacy of candlelight continues to run deep, even in the most celebrated authors of fantasy. In 1971, Ursula LeGuin, the acclaimed creator of the Earthsea Cycle, wrote The Tombs of Atuan, a story that focuses on the life of Tenar, a young girl who has been appointed as the high priestess of the Tombs of the Nameless Ones, an underground labyrinth kept in perpetual dark.\n Throughout the book, “the dark” is invoked by name as the devourer of Tenar’s self and as a byword for the Nameless Ones. Their vast Undertomb is the seat of primal darkness: it has never been touched by light since the creation of the world. When Tenar and the wizard Ged try to escape through the Tombs, the dark begins to panic Tenar so much that she pleads again and again for Ged to make his magical werelight. But Ged reveals that all his power is being spent holding back the Dark, which is trying to “quench them, devour them.” What Tenar is desperate for is a candle to separate her from the darkness, and Ged’s revelation confirms the deepest and oldest fear of humanity: the dark is trying to swallow them alive.\n In the earlier Wizard of Earthsea, Ged’s pride caused him to allow darkness into the world: after being continually mocked and belittled by another mage, Ged attempts to prove his superiority by weaving a spell that allows the dead to come back to life. He summons up the shade of the woman Elfarran, but then—\n \n “ . . . the sallow oval between Ged’s arms . . . widened and spread, a rent in the darkness of the earth and night, a ripping open of the fabric of the world. And through that bright misshapen breach clambered something like a clot of black shadow . . . ”\n \n Ged, in his arrogance, has actually broken the threshold between the world and the dark, “ripping open the fabric of the world” and letting a piece of darkness inside. The rest of the book is spent in pursuit of this darkness, which takes the form of a shapeless, whispering shadow.\n George R.R. Martin’s works, the Game of Thrones series, also bear the distinct mark of the candlelit world: the first chapter of A Song of Ice and Fire brings the reader to Eddard Starks’s kingdom of Winterfell, a wilderness realm out on the edge of the civilized world. Stark’s duty is to maintain the Wall, the threshold between the wild, dangerous lands to the North and the rest of the Seven Kingdoms. But the prologue takes the reader beyond this threshold and brings them face to face with the darkness outside: in the opening pages, the reader is introduced to a doomed group of the Wall’s Watch, whose dialogue is centered on fear of the dark and what lies in it. Their fears eventually come to fruition when they meet the Others, the ancient residents of the woods who gleefully murder the trespassers and fade back into the trees.\n Then there is the direwolf: in Chapter 1, the Stark family is returning from an execution and finds a huge, dead wolf in the snow, with four living pups still suckling on it. Despite the visible fear on the part of the rest of the party, the children adopt these pups, in part because the family’s crest bears a direwolf. As Barry Lopez argued before, the wolf is a symbol of the untamed wilderness, and therefore the adoption of the pups strengthens the Starks’ connection to their symbolic duty: to tame the chaotic forces on the other side of the Wall.\n So the candlelit world carries on, from the ages of myth to the modern day. But no survey of fantasy would be complete without Terry Pratchett. As always, it’s his Discworld novels that get to the heart of the matter simply and eloquently: in Wee Free Men, when the young Tiffany Aching asks the witch Granny Weatherwax what she “does,” Granny replies with:\n \n “We look to . . . the edges. There’s a lot of edges, more than people know. Between life and death, this world and the next, night and day, right and wrong . . . an’ they need watchin’. We watch ‘em, we guard the sum of things.”\n \n This is the heart of fantasy: the warriors, rangers, and mages that populate our pages are archetypes that began with the watchers of the borders, the thresholds between humans and the dark. Whatever direction the genre goes, that legacy is held in its bones.\n Christopher Mahon is a fantasy writer and essayist living in New York. He received his Bachelors in Creative Writing from Pacific Lutheran University and currently works as an editor at Outer Places. In his free time he runs The Occult Triangle Lab, a blog on trigonometry, fantasy, and ungodly amounts of milk. Follow him on Twitter @DeadmanMu."}