{"fingerprint": "Em5CFpYVmXkSB0fndFtonKNmDgw=", "sitename": "Clarkesworld Magazine", "title": "Frodo Is Dead: Worldbuilding and The Science of Magic by Christopher Mahon", "author": "Christopher Mahon", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mahon_02_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Frodo Is Dead: Worldbuilding and The Science of Magic by Christopher Mahon", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Frodo Is Dead: Worldbuilding and The Science of Magic\n In 1966, Time magazine asked, “Is God Dead?” on its infamous April cover. Around the same time, a piece of graffiti began appearing in New York subways: Frodo Lives! It was an interesting crossroads for America—God seemed to be fading out of the lives of many Americans, while Tolkien’s masterpiece was just starting to find its audience. Peter S. Beagle’s 1973 introduction to The Fellowship of the Ring gives some insight into the zeitgeist:\n \n “I’ve never thought it an accident that Tolkien’s works waited more than ten years to explode into popularity . . . The Sixties were no fouler a decade than the Fifties . . . but they were the years when millions of people grew aware that the industrial society had become paradoxically unlivable, incalculably immoral, and ultimately deadly . . . [Tolkien] is a great enough magician to tap our most common nightmares, daydreams, and twilight fancies, but he never invented them either; he found them a place to live, a green alternative to each day’s madness here in a poisoned world.”\n \n Beagle’s introduction portrays Tolkien’s fantasy world as a refuge from the realities of modern day, but it’s common knowledge that most secondary worlds borrow liberally from ours—The Scouring of the Shire, for example, has often been cited as Tolkien bringing the effects of English industrialization to Middle-Earth. But Tolkien himself claimed that one thing definitively sets fantasy worlds apart from ours: magic. Tolkien’s seminal essay On Fairy-Stories was an early attempt at defining the border between fantasy and reality, and one of his chief claims was that Magic (or “Enchantment”) was both the boundary line and the essence of the fantasy genre, as well as the “fairy-stories” that gave birth to it:\n \n “ . . . a “fairy-story” is one which touches on or uses Faerie, whatever its own main purpose may be: satire, adventure, morality, fantasy. Faerie itself may perhaps most nearly be translated by Magic—but it is magic of a peculiar mood and power, at the furthest pole from the vulgar devices of the laborious, scientific, magician.”\n \n The danger that fantasy writers and worldbuilders risk today when dealing with magic is a breakdown between the secondary world and this one, mainly due to the ‘scientific’ way magic is treated in contemporary fantasy. Making magic into a kind of science, similar to modern views on thermodynamics or astronomy, risks creating a kind of causal closure that causes each fantasy world to turn into a mirror-image of our world, complete with historical and philosophical parallels to the Age of Enlightenment and its aftermath. Ultimately, the ideas embedded in modern views of science and ration undermine not only the genre, but fantasy’s claim at meaning and the worldbuilder’s authority over their own secondary world.\n In stories and legends like those of Oisin or Sir Gawain and the Green Knight, the way magic works is usually obscure. Rituals, amulets, illusions, and enchantments abound, but explanations do not. Reference books like James Frazer’s The Golden Bough give some insight into magic traditions, but today it’s expected that fantasy stories include the basic amount of information the reader needs to grasp their worlds’ magic. Consequently, magic is expected to operate on some set of rules that keep it consistent. These rules can be clear or vague, disclosed or not, but they are expected to exist. V.E. Schwab, author of A Darker Shade of Magic, addressed this issue directly in a Q&A with io9:\n \n . . . my belief, when it comes to rules, is that magic is a component of the natural world, and that just like nature, no matter how complicated it can become, at its core, it should be simple. I try to come up with an intuitive foundation for all of my magic—in ADSOM, that means tweaking the magical foundation to suit the world it’s in—so that no matter what I build on it, the ground is stable. And if I do give magic influence over characters and the story, I force it to become a character in its own right, to mitigate the dangers of deus ex machina.\n \n Here, Schwab deals with the issue of creating a magic system. Systems like thermodynamics, kinetic energy, and gravity are taken for granted in fantasy because they’re familiar to us, but magic draws attention to itself by being cut from whole cloth. Magic, as opposed to other kinds of worldbuilding, asks the author to take the unique step of creating a new kind of metaphysics that will explain where magic comes from, how it operates, and how it relates to beings in their world. This becomes not just a scientific process, but an ontological one.\n In this sense, every worldbuilder takes on the role of God when they build their magic: before a secondary world is created, there is an implicit, unwritten equivalent to Genesis where an author decides what should be and creates a universe according to their conscious design. As Schwab notes, magic goes beyond just the operations of nature and often plays a key role in the narrative, showing that magic-building, worldbuilding, and story-writing are intrinsically connected. Indeed, in the most effective fantasy stories, magic becomes an expression of the story’s themes and a direct avenue to meaning.\n Though Tolkien warned against treating magic like the “vulgar devices of the laborious, scientific, magician,” that’s often what magic becomes in modern fantasy. Brandon Sanderson’s magic systems provide one of the clearest examples. According to Martin Cahill’s article on Tor.com:\n \n Sanderson’s magic systems all follow a similar structure of net gain, net loss, and equilibrium, according to their own natural laws (which are generally similar to environmental, scientific, and physical laws of our world).\n \n Any magic system can be systematic and internally consistent, but ‘scientific’ magic represents a change in type (not degree) by incorporating the ideas that formed our modern conception of science. Concepts like conservation of energy, experimentation, and natural laws reflect not only the operations of the universe, but the historical ideas that influenced our perspective on them, including positivism, ration, and naturalism. These ideas are in turn embedded with a historical narrative and a perspective founded in the 17th-18th century and developed all the way to the present day. Fantasy worlds are built on ideas, and these ideas have the power to change those worlds in fundamental ways.\n A good example of a ‘scientific’ magic system is seemingly found in A Wizard of Earthsea, which has a system based on True Names: in the first book, Wizard of Earthsea, Ged spends an extended period of time in the tower of Kurremkarmerruk learning the names of thousands of things, including individual parts of plants, names of animals, and the different seas. Ged is essentially studying taxonomy, with all the esoteric Latin names exchanged for magical ones. Earthsea’s magic follows rules and can be taught, like surgery or computer programming, and though LeGuin’s world is pre-industrial, it’s easy to imagine a time in Earthsea’s future when magic is rationalized and used to make manufacturing, trade, travel, farming, and communication more efficient over the course of a magical industrial revolution, similar to Saruman’s strides toward mechanized industry in The Lord of the Rings.\n But this kind of rationalization isn’t just a possibility with ‘scientific’ magic, it’s an inevitability. Magic is unique because its creation and design reflect its secondary world as a whole, and building magic upon ration and science means implicitly accepting the schools of thought that shaped both of those concepts during and after the during the Age of Enlightenment: Descartes, Locke, Spinoza, and others. The philosophies embedded in the ‘scientific’ mindset inexorably change the secondary world to resemble ours, because embedded in ration are blueprints for humanity, societal progress, and the universe. As post-Enlightenment thinker Auguste Comte claimed:\n \n ‘As to its operation upon Order, it is plain that true science has no other aim than the establishment of intellectual order which is the basis of every other order’.\n \n If a magic system is built like a science, it can be rationalized like a science within its world, meaning that its rules will be found, quantified, and exploited so that it can be subjugated according to human advantage.\n The award-winning animated series Avatar: The Last Airbender and The Legend of Korra provide a strong example of this, demonstrating that subjecting magic to ration inevitably causes a progression from a ‘mystical,’ pre-industrial period to a ‘modern’ one. In the original series, The Last Airbender, ‘bending’ (the magic manipulation of the four elements) is tied up with mysticism, nature, and martial arts. It is innately connected to the spirit world and the balance of the human world, which is maintained by a cyclically reincarnated Avatar, the only one who can master all four elements. There are four nations based around their respective bending techniques (Fire Nation, Earth Kingdom, Water Tribe, and Air Nomads), but only a few, select masters of fire-bending may learn the secret of lightning-bending, which is treated with reverence similar to qi-gong within the Fire Nation.\n In The Legend of Korra, however, the Fire Nation develops fire-bending into the basis for a steam-powered industrial society, which demystifies lightning-bending and trains benders in the technique en masse to create human electricity plants. One of the key themes of the show is a movement against benders and the monopoly they hold on magical power. Most significantly, though, humans eventually discover how to manipulate the nature of magic and use it to destabilize the natural order of the universe, including the potential destruction of the Avatar cycle.\n The Avatar series shows that the process of magic’s subjugation inevitably ends with the re-emergence of similar philosophical and societal issues that affected the world in the wake of the Enlightenment: the application of ration to society and the breakdown of traditions, the rejection of old values and mysticism, the upset of power, and eventually revolts, critiques, and popular movements.\n The grand irony of this is that the Enlightenment and its fictional analog always sow the seeds of their own destruction. According to Kenan Malik in his 2015 lecture at the Bruno Kreisky Foundation on the Enlightenment and its legacy, the radical changes and social upheaval brought about by Enlightenment philosophers culminated in a general disillusionment with order:\n \n The late nineteenth century experienced, then, not simply a crisis of faith but also a ‘crisis of reason,’ the beginnings of a set of trends that were to become highly significant in the twentieth century – the erosion of Enlightenment optimism, a disenchantment with ideas of progress, a disbelief in concepts of truth.\n \n When magic is built according to ration, these historical ideas and societal changes will emerge in the secondary world for the same reasons they did in ours. Fantasy then becomes a type of speculative alternate history played out across different worlds: it’s only a matter of time before every Middle-Earth becomes just ‘Earth.’\n But apart from the historical dimension, there is a fundamentally philosophical one. Mary Shelley’s Frankenstein may be the inevitable narrative of all ‘scientific’ magic systems, taking on the same relevance it did during the Industrial Revolution: when humans finally master nature, they become like gods, with science/magic offering a path to apotheosis and the ability to reforge the world in our own image.\n Even if there are other gods in a given fantasy world, they too, must be subject to rules and limits on their power. Eventually, in the pursuit of knowledge or control over the universe, humanity or its analogs will create a Creature, unseat a god, or utter the words “I am become Death, destroyer of worlds.” Residents of the secondary world (whether elf, human, or other) will find themselves, as Nietzsche described, erasing the horizon, unchaining the Earth from the sun, or holding the bloody knives used to murder their ‘gods.’\n The inevitable conclusion of ration and the Enlightenment enterprise, in the primary world as well as the secondary, is the death of God—the same topic Time Magazine brought up in 1966 and the one Friedrich Nietzsche originally described in 1882. For Nietzsche, humanity had used the tools of reason to free itself from reliance or belief in a power higher than itself and now had the chance to transcend reason and shape the world according to its own ideas. According to Malik, “[Nietzsche’s] brilliance at giving voice to the growing disaffection of the age with both faith and reason would eventually turn him into a key figure of the postmodern assault on the so-called Enlightenment project.”\n If a world is governed by ration, it will inevitably unravel itself, just as we have unraveled ours. The grand circle will eventually complete itself, ending with Nietzsche and postmodernism finding their way into the secondary world as well as the primary.\n If basing magic on science and ration, embedded with the historical and philosophical issues of the past three hundred years, inevitably leads to a world very similar to our own (complete with a postmodern view on life, humanity, and meaning), then the inevitable narrative of all fantasy will be echoes of our own history. One possible alternative is to create a kind of magic that is both systematic and consistent, but embedded with a different perspective on humanity and the universe. Despite the seemingly scientific, taxonomic nature of magic in A Wizard of Earthsea, there is an underlying pattern of meaning to Earthsea’s universe, which is the need for balance and harmony in every aspect of life—though magic can upset the balance, there is an ideal order to the world and human actions. That ‘ideal order’ reflects a distinct perspective on humanity and the meaning of life, one that differs from that of the primary world.\n But building a world and assigning meaning to it, even in the context of fiction, becomes problematic in its own right. Whether or not the secondary world reflects a Nietzschean or postmodern perspective, there is pressure from the primary world to conform to it. In his video “Middle-Earth and the Perils of Worldbuilding,” Evan Puschak makes a number of claims about Tolkien’s world, the nature of fantasy novels, worldbuilding, and the relationship between authors and readers. Some of his main points include:\n \n Reading is not the author telling the reader a story—reading is a game in which the author makes implications and the reader uses their interpretive toolbox to create their own interpretation of the story.\n Worldbuilding in fantasy novels today is largely based on a passive mindset within the reader because the reader is dependent on the author for the truth about their world.\n Fantasy readers’ intense desire to learn about an author’s fantasy world is dangerous because that obsession acclimates readers to passively accepting other forms of ‘worldbuilding,’ including political ideologies.\n \n Puschak’s contentions are a literary expression of the same philosophical ideas that Nietzsche developed a century ago, expounded on by Roland Barthes. The name for the concept Puschak is describing (the rejection of the central authority of the author) is “the Death of the Author,” the literary equivalent of Nietzsche’s “Death of God.”\n Within the frameworks of postmodern philosophers and critics, including critical theory, constructing fictional universes and claiming authority over the meaning of the stories told in them dangerously parallels the monopoly on truth originally held by God in Western culture, where ‘God’ is really a byword for dogma, oppression of free thought, and false meta-narratives. Likewise, ‘truth’ or any claim on it is always an attempt to manipulate, oppress, and mislead people through the manipulation of culture by the existing power structure. According to Michel Foucault in his work Truth and Power:\n \n ‘Truth’ is linked in a circular relation with systems of power which produce and sustain it, and to effects of power which it induces and which extend it. A ‘regime’ of truth.\n \n By subjecting fantasy to postmodern critiques like these, Puschak and other critics erode the validity of truth or meaning within stories, making sure that not only our world conforms to postmodern ideas regarding the nature of society, culture, and the self, but make sure other worlds obey it, too. These critiques threaten the author’s authority over their own stories, and undermine the claim that literature can touch upon anything meaningful about the human condition. But strangely enough, the struggle over truth waged between our world and the secondary one has already been played out within fantasy itself.\n In Terry Pratchett’s famous Discworld series, Discworld is at constant risk of changing into a world much like ours. In 1997’s Hogfather, Pratchett strikes directly at the heart of the matter in a conversation between Death and Susan Sto-Helit, where Death admits that the ideals and fantasies Hogswatch (Discworld’s version of Christmas) represents have no rational justification, and only exist because people believe in them. By the same logic, he admits, human ideals are lies:\n \n TAKE THE UNIVERSE AND GRIND IT DOWN TO THE FINEST POWDER AND SIEVE IT THROUGH THE FINEST SIEVE AND THEN SHOW ME ONE ATOM OF JUSTICE, ONE MOLECULE OF MERCY. AND YET [ . . . ] YOU ACT AS IF THERE IS SOME IDEAL ORDER IN THE WORLD, AS IF THERE IS SOME . . . SOME RIGHTNESS IN THE UNIVERSE BY WHICH IT MAY BE JUDGED.\n “Yes, but people have got to believe that, or what’s the point—”\n “MY POINT EXACTLY.”\n \n Christopher Mahon is a fantasy writer and essayist living in New York. He received his Bachelors in Creative Writing from Pacific Lutheran University and currently works as an editor at Outer Places. In his free time he runs The Occult Triangle Lab, a blog on trigonometry, fantasy, and ungodly amounts of milk. Follow him on Twitter @DeadmanMu."}