{"fingerprint": "0YTurZjlN1T3d3Izrnj1QjG0CmE=", "sitename": "Clarkesworld Magazine", "title": "The Beacon by Darja Malcolm-Clarke", "author": "Darja Malcolm-Clarke", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/malcolmclarke_08_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Beacon by Darja Malcolm-Clarke", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4020 words, short story\n The Beacon\n My children are dying.\n I learn this as the airship SS Arthanthropia eases past the lighthouse towards the Khalreg Cumulesce and the docks hidden behind. I am watching from the lighthouse gallery when it happens: dancing like aurora over the cloud-churning paddlewheels, the beacon’s blue-green light falters.\n It means only one thing.\n I quit the gallery and charge up the spiral stair to the lantern room. A touch of a button stops the slow rotation of the great fresnel lens, the crèche where my children are nestled. I throw open the glass door behind which they lie, their slick white segments lined up like pale vegetables in a market bin. Their light has become so dim I don’t need the visor hanging nearby to shield my eyes. My babies sense my proximity and squirm in need. As I draw back the flap of my robe to free up the row of teats, I fear yesterday’s suspicion is about to be proven correct. I give a teat a squeeze. It excretes milk tinged with yellow. I try another, and it’s almost dry. Another: the turbid fluid.\n Well then, it is so. I have the sunpoison.\n I swallow against the only possible option. There is talk in the stilt city Overcloud about the threat of sunpoison, but no plans yet of what to do about it. They in the city have time—after all, they are protected. The lighthouse is not. And the city cannot afford the lighthouse to go out. My children must be nourished.\n First things first. I close the crèche-lens door to keep in the heat and hurry down the spiral staircase to the nursery. The wife is there, chewing the egg-casing from the hatching babies. Like all wives, mine does not do much other than gnawing. That, and of course, impregnating.\n The wife looks up from the casing; the nymph-child’s face is just visible. A piece of shell hangs off the wife’s chitin lip. Near-sightless, he sniffs the air. He could never see if the children had ceased to glow and light the way for airships, in case one were to come perilously near the Cumulesce. So this is where he stays, in the nursery, out of the sun and away from the beacon, chewing.\n He sniffs again. “The sunpoison really has come,” he says.\n “Yes. The heliomancers were right—the sun’s eyes are multiplying.” I survey the hatchlings.\n “What do they say in town? Do they still think there is time?” he says.\n “There is time for them,” I say. “The city canopy will hold long enough for it to be refortified.”\n “Maybe the sun’s gaze will be the end of us,” he says.\n “What do you know of it? Leave it to those who do.”\n He is quiet a moment, then says, “The littlest will need milk soon—within a day’s time at the latest.”\n “Yes,” I say, impatient. He is oblivious to my expertise. To feed one’s offspring from her own teats is the obligation, duty, and pride of every goodman; to share this responsibility with another would be the height of disgrace. Better a child die than bear the shame of having been fed from the teat of one who did not lay her.\n I turn to go, now that I know the youngest are well enough for a short time. I hope it is time enough.\n “Perhaps if you return to the city canopy,” he says, “so you’ll be where the sun’s gaze doesn’t reach?”\n “It’s too late,” I say. “The poison has already reached my milk.”\n The wife cradles the hatchling in his arms. “She doesn’t mean to harm us, the sun,” he says. “Her compound gaze—”\n “She loves us. I know.” This nattering is why I usually leave the wife to himself.\n “There are—.” He hesitates. “There are rumors of something that could help. A plant.”\n “Fatherteat,” I say. “Undercloud. I know.”\n His blind eyes widen. “The wives speak of it.”\n “I hope that’s not all it is—wives’ tales. The familiar fancy and foolishness. Yes, goodfolk have been discussing it.”\n There have been times when the talk in Overcloud was not so far off. This I know: without milk, my babies cannot glow, and the lighthouse cannot warn ships. Vessels will soar through the Khalreg Cumulesce as though nothing lay just behind it, collide with the docks—and careen on to Overcloud. Bring it all crashing down, stilts folding upon each other, dropping into open air—\n “I’ve got to go to find it,” I say. “So, it’s a risk, but you’ll have to tend the children alone. If there’s such thing as fatherteat, they can’t live without it now, and the beacon cannot shine.”\n “You could ask someone in town to nurse for you . . . ?”\n I meet this insult with the glare it deserves. Another day I might reprimand him further, but today there is no time.\n The wife drops his eyes and takes a breath. “I’ve been thinking,” he says. “These are my babies as well as yours. I will go to fetch fatherteat.”\n “Don’t be ridiculous,” I say, suppressing a sour chuckle. “Tend to your chewing.”\n “I wish to go,” he says. “I won’t stay cloistered in here while the sun’s eyes multiply and gaze upon us.”\n “I won’t have my wife venturing undercloud alone.” Now he is beyond irking me. “Besides, feeding infants is fathers’ prerogative. Our duty.”\n “But some of the other wives have been talking about going undercloud—”\n I settle the matter with uproarious laughter.\n In the kitchen, I pack a rucksack with half a loaf of the brown bread the wife makes. He stands watching—listening, rather—as I take it from the cupboard.\n “You won’t come back. You’ll be burnt to a crisp. Or gutted by bogles,” he says.\n “Don’t try to dissuade me,” I say. “Especially not with nursery tales.”\n “That’s why Overcloud is here, you know. That’s why we built it. Bogles,” he says. I snort. “They are still down there. Don’t you want something, just in case? Take this with you,” he says, and draws a kitchen knife from the block and wraps it in a checkered cloth. “And this,” he says, and makes his way to the closet, emerging to present me with a red umbrella. “For the sunpoison.” His antennae work; he puts his glossy-shelled head far into the cupboard. From its nether-regions he withdraws a loaf of the brown bread. He hands it to me and says, “They say fatherteat has purple—”\n “I know what they say it looks like,” I say and toss the bread into my rucksack. I shoulder the pack and leave him standing by the cupboard.\n I catch a lepidopter to the stilt city’s ferry-elevator undercloud, located on the docks behind the Cumulesce. Below, goodmen come and go in the streets. We pass through the patchwork shadow of towering claptrap buildings that sway on tall legs. Since the city cannot expand out, it is built ever upward.\n Around the far side of the Cumulesce, airships crowd around the harbor; it’s the windy season and thus busy. As we glide overhead, I recognize the docked SS Arthanthropia, its paddlewheels lazily turning. The lepidopter descends and I climb out beside Bezzy’s Cloudside Tavern. I expect to have to wait a while for a ferryman—it’s not as though goodfolk line up to go undercloud. At least not yet. But someone appears from within a sloping shanty even as the lepidopter’s wings still fan the air over me.\n “Goodman,” she says, waving me over to the ferry.\n “Ferryman,” I reply with a nod. She extends a knotty claw for the toll. I give her the two coins fee, as well as an extra to speed our passage, and step into the wooden ferry-elevator. She closes the door behind me and turns to work the contraption. The ferry kicks into gear.\n Descent begins, and the sky flies up against us, pressing against my shell like it’s trying to break through. A round hole in the floor lets me watch as we careen towards the wall of cloud. When we hit it, the diaphanous white coaxes a nagging cough from my throat. Light wanes, and the clouds take on a ghostly pall.\n The ferryman pulls on the winch. The ferry slows but land is too close too soon, and we smack into the ground. I hit the wall and spin on my back like the lighthouse lens. The ferryman collects herself, coughs once, and helps me to my feet. She opens the door. As is custom when leaving an enclosed vessel, she says, “Luck of the lighthouse worm go with you.” It does not have the intended comforting effect.\n Undercloud is warm, flat as far as eyes can see, and covered with high reeds and brush. What a wonder: solid earth. So much vegetation I have never seen. And where the land is not muted green it is black, and wet, and stinking of rot. A hot wind blows. Somewhere high above, airships come and go, guided by the light of my nymph-children; but I cannot see the ships for the roiling silver cloud cover, which casts a peculiar twilight over the plain.\n With a mechanical clamor, the ferry ascends behind me on ropes and pulleys. High overhead, its clanging still echoes into the false dusk. A tingling upon my shell indicates the clouds do not keep out the sun’s poison, but trap it in. How the wife could have known this would be so, I do not know. I take the umbrella he gave me protruding from my bag and open it, a strange bright flower blooming on the bland plateau. The tingling abates somewhat, though I know the sunpoison still pours down from the sky. She does not mean to harm us, the sun: she cannot help but watch over us, even though her gaze brings suffering.\n Beneath the cloak my teats are brewing sunpoison in concentrate; a shiver of shame runs through me. What if I cannot provide for my children? I hope against hope the solution is here somewhere.\n I have gone two steps when my legs stick in the black sludge. I try to pull out one row by sheer strength, but the mud sucks and slurps at me like a grub-child. I strain; I’m exhausting myself two steps into the journey. Gazing out over the plateau, I wonder how far fatherteat might be. If it really exists.\n Then I remember the bread.\n The long loaf is hard with age and likely weeks old, forgotten as a tomb at the back of the cupboard. But why else would the wife have given it had he not known I’d need it, and not for eating? With the loaf I push the mud away from my feet experimentally, and it spreads easily, like kidney cream. I clear one row of my legs that way, then the other, and a slow-going rhythm develops: step, sweep, step, sweep. I can walk. The petrified loaf is the perfect tool.\n As the wife seems to have anticipated.\n After a time of pushing through thick reeds, violet thistles on thick green stalks nod into view, an uncanny mute assembly. Their brilliant shade is perverse in this landscape, as though they had soaked up the vitality of the environs to produce their striking hue. I tug at a stalk thick as my antennae—and fluid emerald and burning sprays from the violet bulb in every direction. I try to shield myself, but the mud sucks at me and drags me down into the mire. The spray burns like the sun herself.\n By the time I’ve managed back onto my feet again, the fatherteat spray has eaten away portions of my integument shell. Only a layer of exposed cuticle shields viscera from the open air. I avoid looking at the burns and collect the red umbrella from where it fell into the mud. Without it, the wounds would have been worse.\n I distract myself with the task of procuring fatherteat. I have wrested a bag of stalks from the grove when I narrowly avoid an especially high fatherteat spray. Staggering aside, my gaze strays deeper into the grove where a brown gleam catches my eye. My thorax tightens. I drop the stalk I’m holding and move through the grove towards the thing—\n —Into a clear patch where thistles have been cut down and mud churned up. The satin sheen of exoskeleton; mud mounded. The air is snatched from me. I can make out three sets of legs in the mire. One end of the shell is hidden beneath the mound—the end where a head should be. The channels around the legs indicate that once the legs thrashed and thrashed. Now they are still.\n It is a wife. He has been buried alive.\n The shell is smeared with copious palmate markings, prints of whatever piled the mud on the wife and kept him submerged. Until he didn’t try to get out anymore.\n What could have made the palmate markings on the shell? I am inundated with dreadful imaginings. Bogles. As the wife said.\n I snatch up the stalk bag, nearly toppling into the mud again, and strike a frantic step-sweeping pace back towards the ferry rope, which stretches up into the clouds like a beanstalk from the old tales. All the while I listen and look for something baleful following behind. Why did wives think they could manage alone undercloud? What madness compelled that now-dead wife to come here? I fumble and yank on the ferry rope with a leg; my primaries hang tingling and still.\n Waiting alone on the plain, the wind murmurs a warning in a strange tongue. I drop the bread and take the knife from the bag. I hold my fighter’s stance, vigilant, ready to take whatever might come—whatever bogles with their strange hands.\n The lurch of the ferry overhead startles me. It slows to the ground and the wooden door swings open. The ferryman steps out, regarding me with solemn black bead eyes. She moves aside.\n Out strides a goodman bedecked in armor.\n But no. It’s worse than bogles. The thin face gives him away.\n It is a wife. And he is not alone.\n Two more wives step from the ferry, similarly clad in armor, looking ridiculous in goodmen’s garb. Each carries an umbrella and bears a bundle on his back. The first takes a revolver from his belt, gazing across the plain, the wind batting his hat about on his head. The largest wife notices me and steps away as if by instinct. From his belt hangs a muslin bag; the ivory handle of a dagger protrudes from a sheath.\n “Look,” says the large one, pointing to me with his red umbrella. The other two stare, stricken. The first says, “It doesn’t matter now. Let’s get going.”\n I go to speak, but already they are scuttling away, their feet fitted with broad webbed shoes that let them walk over the mud. They open their umbrellas.\n They have come prepared. They have a procedure.\n The ferryman holds out a claw for the toll; arms shaking, I fish coins from the bag.\n Inside, words finally come, bearing the ring of accusation. “Those were wives that came out,” I say. The ferryman nods like a fatherteat head in the wind. “They’ve been coming down here, haven’t they?—goodwives. Lots of them.” The ferryman presses her lips together, turns to the winch and says nothing. The ferry shoots skyward.\n Nursing my numb arms, I watch through the cracks in the slats and look for them crossing the plain alone—without husbands. As though they are husbands. Perhaps they go to the dead wife. But no. My wife as good as told me why they are there. We goodmen go about in the world more than them; we will suffer from the sunpoison more and sooner than them. They seek fatherteat to replace what their husbands will soon lack.\n How dare they impinge upon our right, our way of life ages old?\n The buried wife’s face beneath the dirt jeers up from memory: the tiny compound eyes, the mouth set in an “o” beneath the mound, the churned-up sludge from his struggle to scramble up, out of the mud and away. Some coward, it had seemed to me before, had sent her wife undercloud in her stead. But those goodwives had come prepared, with weapons and tools. They went on their own. They went of their own volition.\n My shell taps the ferry wall as I look out. I am shuddering with outrage.\n That, and something akin to fear.\n It is night when the ferry touches on the dock near the Cumulesce, invisible in the dark, a starless void in the sky. I’m out the door before I have to hear the ferryman bid me goodbye with the traditional, maddening expression. I hail a lepidopter to the lighthouse. As we come out from under the canopy and the fare change registers on the meter, I notice a light far beyond the lighthouse: an airship approaching.\n And no light to warn of what lies behind the Cumulesce. I’ve come home too late.\n I toss coins to the driver and hit the ground running, pushing through the hard-shelled crowd and up the claptrap bridge to the lighthouse.\n The wife meets me at the door. I push past him to the spiral staircase.\n “I talked to some wives in town on the pterophone,” he says. His feet make scrabbling sounds on the stairs as he follows behind.\n “The children—by sun’s eyes, there’s an airship coming!” I cry, stepping into the lantern room.\n “They’re telling stories about fatherteat,” he says as I open the crèche door where the grub-babies reside behind the massive lens that amplifies their glow. “Ones I hadn’t heard before.”\n “I bet they are. Let me guess—stories from undercloud, eh?” I say, but now, now at the crèche I can see the babies live. They have no glow, only the vaguest luminescence, a hint of nacreous gray light. They hear and smell my arrival. Weakly, their mouths open and close in need, emitting tiny shrieks as they writhe over each other like animals. The wife is speaking, but beyond the windows, the red and amber lights of the airship near. I wrestle the stalk bag with my secondary hands.\n “Your arms are hurt. I should have made you wear more cover,” I hear him say as if from afar. I tear a wet stalk from the bag and tip it to the smallest and dimmest of the babies. Its mouth works; it gibbers in infant bliss while the others fight for the stalk-teat. The wife prattles on as I quickly move through the lot of them, feeding them.\n As I squeeze the last drops from a stalk for the last infant, the wife is at my side, his four hands upon the nymph-child I am holding.\n “Are you listening to me?” he says in a way I have never heard him speak. I begin to reply, but my gaze is snatched to the window and the light spangled across the sky, growing nearer.\n “Are you listening? It’s the thistle milk,” he says, still trying to wrest the child from me. I slap his hands away, my own numb hands fumbling. “The cloud-cover traps the sunpoison beneath. The thistles are—”\n “I knew it,” I say, heaving the child out of his grasp; the nearly-dry stalk drops to the floor. “You wives found the fatherteat yourselves. You’re trying to find a way to live without us,” I say.\n “No, we’re trying to find a way to survive. The wives’ tales say the sunpoison has demolished our people before. If that’s so, it’ll take you husbands first.”\n “You’re trying to usurp our right to nourish the children ourselves. It’s disgusting,” I say. “It’s immoral.” I move closer to the great lens door, the child in my arms.\n “We’re doing whatever might save us. We have more pressing things to think about than whether wives or husbands will nourish the young. Bogles will destroy us if we try to live undercloud. They are why we ended up in Overcloud to begin with.”\n “I bet that’s from a wives’ tale as well,” I say, but his words have turned me cold, even my numbed arms—\n When my babies begin to glow. They incandesce blue-green, casting light on the walls. I place the child with the others in the fresnel crèche. They brighten so quickly I have to turn away. The amber lights of the ship are hidden behind the wife, enrobing him in a golden halo.\n Then the children’s light changes from turquoise to green-gold, and more brilliant than ever I have seen.\n The light is accompanied by a cloying sweet smell of flesh burning, followed by a pop and a hiss as the noxious light of one, then another, then more of my babies is extinguished.\n The wife cries out. The light is diminished enough that I can turn back to the small charred bodies—which I can see by the light of one last, gray infant.\n Until it, too, blinks out in a waft of smoke and sweet stench.\n I turn back to the wife, but he is not looking at me. I follow his line of sight outside to the cluster of lights in the dark. The airship, perhaps not noticing or understanding the brief beacon, is still moving blindly towards the Cumulesce.\n “The fatherteat milk—what were you saying of the fatherteat milk?” I cry.\n The wife is wailing too much to answer.\n There is no choice. The city is risked if I do not act. I reach for the bag of fatherteat and pull out one of the last remaining stalks. I peer at the wife, seeing in his place the dead wife undercloud. Once I might have thought, if I do this, he might as well be that dead wife, buried alive under the weight of his dependence.\n I cannot lose the feeling that that is not true now.\n No time: the ship is drifting towards the Cumulesce.\n So I suck from the stalk.\n “The children. The city,” cries the wife. “After all we’ve done.” I know he must mean not the goodmen, but the wives.\n The thistle milk tastes of flowers. I am no longer a nymph-child, but my body still knows what to do with milk. I feel it mingling with the sweetbreads in my thorax. I think of my father and the decade since I drank from her body.\n The milk lights me up, soft. The wife gasps. I go to the crèche. I climb in and squeeze behind the great fresnel lens that is the heart of the lighthouse.\n The lens magnifies and focuses my light into a beacon. A channel of green-gold light slices open the night.\n My glow fluoresces and fills my vision. I am blinded. Perhaps by now the airship has begun to slow, to approach the Cumulesce, to ease safely into the harbor. An infant comfort dances across memory at the edge of the void.\n An appalling image fills that void: my wife, setting out with dozens of others—undercloud. Another image: goodmen gone. A wife feeding a child from an apparatus of hose and metal. And from another intricate device—laying eggs.\n I’ve given them these things by warning the airship of the Cumulesce. Darkness could have brought it all down: the airship colliding with the city and sending it in flames to undercloud.\n I turn to see what I can of my wife through my light. He is standing by the lens, silent, blind as ever, smelling my choice.\n The city, Overcloud, cast to the ground. Maybe it would have been better to let the beacon fall dark, to forfeit it all to the bogles. Something in me says I should have done it.\n The wife will not be buried under my absence like a wife buried alive in the wilderness. He is digging himself out. All of them are digging themselves out.\n Now, at any moment, he—they—will scramble up and away, free.\n Darja attended Clarion West in 2004 and has fiction and poetry appearing in TEL: Stories, Mythic Delirium, and elsewhere. She is pursuing a Ph.D. in English at Indiana University, studying postmodern and speculative literature. When she is not teaching undergraduates or editing articles for Strange Horizons, she looks after a high-maintenance goblin masquerading as a black cat."}