{"fingerprint": "PYsbt1+5O91CIBTfAc0hWcVAUhM=", "sitename": "Clarkesworld Magazine", "title": "The Satirist's Progress: A Discussion with Nick Mamatas and Paul Tremblay by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mamatas_tremblay_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Satirist's Progress: A Discussion with Nick Mamatas and Paul Tremblay by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nThe Satirist's Progress: A Discussion with Nick Mamatas and Paul Tremblay\nAs a distorted, exaggerated, skewed, and otherwise mutated vision of the reality that surrounds us, satire shares a lot with speculative fiction. It's to isolate humor as the element that separates the two genres, but it's not that easy. As far back as Jonathan Swift's A Modest Proposal (whose macabre premise could be the stuff of today's weird fiction) and Voltaire's Candide (which lampoons Leibniz's proto-quantum concept of “the best of all possible worlds), satire has not only been grim; it's been fabulist. And in the past 100 years, everyone from Thomas Pynchon and William S. Burroughs to Philip K. Dick and Terry Pratchett have mined the common ground between science fiction and satire.\nThose shades of ambiguity between humor, critique, reality, and fantasy have been well served within the genre in recent years by Nick Mamatas and Paul Tremblay. Each in his own way, these unique authors have poked and stretched the skin of human existence through the deft use of wild speculation and biting commentary. Their stuff is also deeply funny—that is, if you don't mind belly laughs with an aftertaste of bile. Clarkesworld spoke with these two literary iconoclasts about the ins and outs of satire, SF, and the fuzzy boundary between the two.\nNick Mamatas is a former fiction co-editor of Clarkesworld, and his works of satire include 2004's cult classic Move Under Ground and 2011's Sensation. His new novel, the non-satirical yet darkly reflective Bullettime, is published by ChiZine Publications.\nPaul Tremblay is the author of the narcoleptic-detective novels The Little Sleep and No Sleep till Wonderland, among others. The dizzying, dystopian Swallowing a Donkey's Eye is his latest book (and first satire), and it also is published by ChiZine.\nIn light of your new novel, do you consider yourself a satirist?\nNick Mamatas: No, not in light of my new novel. My 2007 novel Under My Roof was a political satire, and so was 2011's Sensation, but Bullettime isn't a satire. Some reviews have mentioned \"hilarity\" amid the horror and such. But satire needs an object. What is Bullettime satirizing?\nAnyway, broadly I consider myself a satirist when engaging in satire. When I'm doing something else I consider myself something else. Isn't there a joke whose punchline is \"But fuck one goat...\"? I try to keep away from totalizing identities like \"satirist\" or \"goat-fucker.\"\nPaul Tremblay: Hey, I heard the goat joke in its pig iteration, not for nothing.\nMy previous narcoleptic detective novels weren't really satires; certainly not political ones. But with Swallowing a Donkey's Eye, I'm now officially a satirist (I'd like some sort of membership card, if possible), and hopefully a successful one. Humor and absurd situations have been elements of all my novels so far, but the donkey novel is the only one of the three that squarely and broadly takes aim at American politics and culture.\nI guess to more directly answer your question, I consider myself a writer in general, but with this particular work, yeah, I'm a satirist.\nWhat is at stake in your new novel?\nNick Mamatas: Nothing. It's a novel. Novels are important, they aren't crucial to the culture. It's a good thing too, since these days anyone can get a novel published if he or she has an email address.\nPaul Tremblay: It's true. I have an email address.\nWhat's at stake? The fate of the my narrator's mom and the state of localized Western Civilization! Or at least it is in my novel where there is a small scale revolution at the mega-conglom Farm, a bizarre election that could determine the fate of City, and the narrator (who is an indentured worker at Farm) finds out that his mother might be homeless back in City, which means she's in danger of being shipped/deported below City to the Pier. He escapes Farm and instead of finding his mother, he finds his deadbeat dad, who is now a Catholic priest. My plan for the book was to start the dystopian novel off with wild, borderline goofy scenarios and have the novel's tone gradually become more serious and emotional as the reader progressed. Genuine empathy/emotion (and not sentimentality, as John Gardner defined it, \"emotion or feeling that rings false, usually because achieved by some form of cheating or exaggeration\") is always what is at stake for me as a writer.\nHow has the role of satire changed in speculative fiction over the years?\nNick Mamatas: It's become much less important. Speculative fiction has become much less about transparent allegories or satires and such, and much more about itself. There are some \"serious speculations\" about the future and a lot of earnest adventuring, but not a lot of satire. Of course, there are plenty of SF novels full of kooky political and social ideas, but as it turns out the authors generally believe in their own nonsense about the importance of polygamy, asteroid palladium-mining-backed currencies, and mandatory spankings for willful females.\nPaul Tremblay: While I have to admit that I'm much more well read in horror fiction and general lit (whatever that means) than what is marketed as contemporary SF, I agree with Nick. What the heck do I mean by \"marketed as contemporary SF?\" Well, some recent examples of successful (both in terms of being a good book and having actually sold decently) satires include most of George Saunders' work (Civilwarland in Bad Decline, Pastoralia, The Brief and Frightening Reign of Phil), Gary Shteyngart's Super Sad True Love Story, and Mat Johnson's Pym, and they all relied heavily upon speculative-fiction elements.\nThese are works of SF, but they weren't marketed as contemporary SF. They were marketed as high literary satire. Perhaps I'm being too paranoid and way too anecdotal (I certainly haven't done a detailed market analysis because, well, I'm lazy), but it seems to me that in the eyes of the larger publishing world, contemporary satire is the domain of high literature (right? even the canonized satirists Kurt Vonnegut, Franz Kafka, and Margaret Atwood, according to many, wrote literature not SF), and it trumps us lowly speculative-fiction toilers. Or something like that.\nAre satire and speculative fiction inseparable?\nNick Mamatas: Yes. Even if it's only a minor current within speculative fiction, satire will always have a place in it, because exaggeration is crucial to satire. You cannot satirize the here and now simply through reproduction of it via bourgeois realism. Even Jonathan Franzen, in The Corrections, had to throw in a science-fictional element. Freedom didn't have one (though he did his tech homework on both mining and birding) and then everyone took the damn book seriously, as though we were supposed to like the characters or something.\nPaul Tremblay: To play devil's advocate... Maybe I'm too broad with what qualifies as satire but some of my favorite satires are devoid of speculative fiction elements: A Confederacy of Dunces by John Kennedy Toole, plus two more recent novels; Treasure Island!!! by Sara Levine and Home Land by Sam Lipsyte. All three picaresque novels satirize class/society (with the latter two certainly taking jabs at suburbia) with their over-the-top narrators tweaking their betters, thumbing their noses at societal expectations, etc.\nThat said, I agree with Nick's larger point, because I don't want him to yell at me.\nIn what ways did writing a novel-length satire, or a novel with satirical elements, change your understanding of satire and of the novel form?\nNick Mamatas: Satires are better when they're short. There's always a concern that the issues satirized may become obsolete, but it's minor issue. Many more people read Nathanael West's A Cool Million today than the Horatio Alger books it mocks.\nPaul Tremblay: I like shorter books in general, so I'm in agreement with that.\nThis could be said for all novels, but I do think the best novel-length satires spend as much time/focus on developing character(s) as they do their exaggerated plots/situations. To make a clumsy comparison to horror fiction: Generally, a horror story is only going to unsettle/scare/move me if the story is anchored by realistic, empathetic, interesting characters. I think the same can be said for satire. I can certainly enjoy clever scenarios and biting wit, but it'll only really hit home with me if the story is grounded by the characters. The genius of Joseph Heller's Catch-22 and so many of Vonnegut's books are due in large part to Captain Yossarian, Billy Pilgrim, and Kilgore Trout.\nIn your recent novel, what elements did you try to balance, and what elements were necessarily out of balance?\nNick Mamatas: I'm sorry, I don't even understand this question. It honestly sounds like it could be asked about anything but a novel—a cake recipe, an ice-dancing routine, the wheel alignment of a 1988 Volvo being outfitted for the Burning Man artcar parade. Anything but a novel!\nPaul Tremblay: As I mentioned a bit earlier, I wanted to achieve a noticeable (but not clunky) shift in tone, from comedy to pathos, in the arc of the story. So early in the novel, I really tried to make some of the humor/silliness over the top. By the end of the novel, hopefully, the contrast between the Farm the readers are introduced to is nicely contrasted to the Farm they're reintroduced to after everything in the novel had happened. I hope that makes sense.\nWhat are you working on now, and what's sharpening your wit's edge?\nNick Mamatas: I'm trying to finish a crime novel, Love is the Law, by the end of next month. Right now, I'm expending a lot of energy writing answers to interview questions about Bullettime, though not from anyone who has read the book and wishes to discuss it.\nPaul Tremblay: I'm slowly working on a satire of the publishing industry and society's apocalyptic zeitgeist. I don't want to give the title away because I might not be done for a while, and I don't want anyone to steal it! The title is gold, I tell you, gold!\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}