{"fingerprint": "oVjEmWNNiwdAlTtmbJCGa2Te0xk=", "sitename": "Clarkesworld Magazine", "title": "Bartitsu: The Martial Art for the Steampunk Set by Nick Mamatas", "author": "Nick Mamatas", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mamatas_12_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bartitsu: The Martial Art for the Steampunk Set by Nick Mamatas", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nBartitsu: The Martial Art for the Steampunk Set\nCertainly, you have your hat and coat. A wolfshead walking stick or a fan in the Japonisme style. The corset, and the goggles. Absolutely a crazy mustache or muttonchops for the males, and a silly feather-laden chapeau of some sort for the ladies. Totally inappropriate boots, yes. Perhaps even a steam-powered zapgun of some sort, all brass and Tesla coils, just for show. But you’re not truly ready for the thrilling future of the Victorian past without knowledge of antagonistics, the very techniques of fighting. So if you’re into steampunk, you may well need to learn the art of gentlemen (and also of suffragettes!), bartitsu! It ain’t pulp fiction, baby.\nBartitsu was the brainchild of Edward Barton-Wright, an English engineer who, while in Japan, was taken with a demonstration of jujutsu—itself almost a catch-all term for systems of Japanese grappling with a dash of striking. He quickly took up the art himself. After learning a smattering of judo (sport-oriented grappling) as well, he returned to England and soon set about making himself a public expert on matters of self-defense for the urban upper classes. Barton-Wright’s earliest public demonstrations and publications displayed simple jujutsu skills, but soon he expanded his system. Adding boxing, savate (French kickboxing), canne de combat, and a smattering of Western wrestling styles to the Eastern arts, Barton-Wright unveiled bartitsu to the world in 1898.\nOne could call bartitsu the first modern mixed-martial art and it was certainly one of the first self-conscious attempts to mix Western and Eastern self-defense techniques. Barton-Wright recognized that fights have various ranges. The cane—and no gentlemen ever went without a walking stick of some sort—extends one’s reach and lets a fellow defeat an opponent without dirtying his hands or coat. At a closer range the fist and foot come into play, and jujutsu and wrestling are necessary to deal with one’s opponent’s boxing skills. Barton-Wright also realized the importance of expert coaching. In the same way a modern mixed-martial artist might have a separate boxing coach, Muay Thai coach, and Brazilian jiujitsu1 coach, Barton-Wright’s training hall featured an all-star staff. From Japan came jujustoka Yukio Tani; savateur and cane fighter Pierre Vigny was brought in from Switzerland, as was wrestler Armand Cherpillod. Barton-Wright’s training hall also featured top-of-the-line gym equipment and various quack electro and thermotherapy devices, including a Nagelschmidt Apparatus—an electric chair used to excite the muscles and melt off fat through the magic of voltage.\nBarton-Wright wrote magazine articles that offered up much of the same hype seen in martial arts rags today, though couched in the peculiar idiom of Victorian popular journalism. This lead to baroque subheads such as “How to Avoid any Risk of being Hit on the Fingers, Arm, or Body by Retiring out of the Hitting Range of your Adversary, but at the same time Keeping Him within the Hitting Range of your Own Stick.” (If you’re following along at home, the trick is to swing your left arm back while swinging your right arm, cane in hand, forward, to bop the guy on the head.) And this being the Victorian era, there was a fair amount of thematic worry about those horrible little proletarians, malodorous street urchins, and dreadful lunatics with razors, all of whom were in need of a quick disarming.\nTony Wolf, combat choreographer and author of two-volume Bartitsu Compendium, explains, “The perception at the time was that members of the educated classes were at increasing risk from street gangsters . . . Barton-Wright also stressed that skill at Bartitsu would be useful when traveling overseas, to countries where one ’could not expect fair play.’” Indeed, what would be the point of being steampunk if you couldn’t pop your monocle right off your face in horror at the mere existence of lower social orders? Barton-Wright had a tip for a gentleman who used bartitsu techniques to get an opponent down. Once the attacker was on his knees or helpless, Barton-Wright advised, “Belabor him as you will!” It was a simpler time. Less litigious anyway.\nIf bartitsu sounds too good to be true, it was. The Bartitsu Club only lasted a few years before collapsing. Enrollment was very high, but so too was tuition cost. Ego was almost certainly a factor. Barton-Wright was, by many reports, a fit man and a good fighter, but likely didn’t have half the skill of his specialist coaches. He named the martial art after himself, wrote many an article for Pearson’s Magazine and performed plenty of public demonstrations of his martial prowess but, as Graham Noble noted in Journal of Asian Martial Arts, “whenever real grappling was called for—against a tough wrestler, maybe, who doubted the whole thing—it was the Japanese who went onto the mat.”\nThe club fell apart, and Barton-Wright even claimed to have beaten Tani in a fight after an argument with the jujutsu instructor. By 1902 the bartitsu club wasn’t even history. The coaches went into business for themselves, jujutsu proper became a major fad in England, and Barton-Wright all but vanished. He poured money into his electrotherapy ideas, but his finances never recovered from a 1910 bankruptcy case. Gunji Koizumi, writing for the magazine Judo, visited Barton-Wright in 1950 and reported that the old man was still tinkering with electrotherapy devices of his own invention. A year later Barton-Wright was dead and buried in an unmarked pauper’s grave. There is a brief mention of him in fantasist Robert Aickman’s memoir, The Attempted Rescue, though he is described only as a “famous physiotherapist and judoist” who put too many sugar lumps in his tea. Bartitsu was nearly entirely forgotten, except for one reference that wasn’t even spelled correctly.\nIn 1903, Arthur Conan Doyle succumbed to the pressure to bring his most famous creation, Sherlock Holmes, back to life. The only snag was that Holmes died in the 1893 story “The Adventure of the Final Problem,” having gone over Reichenbach Falls with Moriarty. In “The Adventure of the Empty House” Holmes explained that he freed himself from Moriarty’s bear hug thanks to “baritsu, or the Japanese system of wrestling, which has more than once been very useful to me.” Baritsu was obscure enough—the missing t is due to either a typographical error or some worry about intellectual property—that many publishers simply inserted the word “jujutsu” in the sentence to have it make sense. It was not until the 1990’s that the connection between the mythical baritsu and the real bartitsu was made, and today we are in the midst of a revival of the martial art.\nMost neo-Bartitsuits are martial artists with an interest in history, as opposed to historical recreationists with an interest in martial arts. Wolf, who designed various fighting styles for The Lord of the Rings films, was a teenage taekwondo champion in the 1970s, and also explored “capoeira, aikido, kickboxing, five-animal kung fu, amateur wrestling, hapkido, old-school shoot wrestling, pro-wrestling, Filipino stick and knife, etc.” before becoming fascinated with the idea of resuscitating dead martial arts. One of the leading lights of the bartitsu revival movement, Wolf estimates that “there are probably fewer than fifty regular practitioners worldwide. That number would jump into the mid-hundreds if we count people who have attended short term seminars or who train occasionally.” The few bartitsu schools that exist tend to be based around one or two of the core arts, with the rest of the bartitsu curriculum a matter of recreation and experimentation.\nDespite the low number of artists, and the gaping holes in our understanding of how Bartitsu was actually supposed to work, the martial art might be ready to explode thanks to a plucky little film called Sherlock Holmes, to be released in the US on Christmas Day. Wolf says, “The major benefit of the movie for [bartitsu] will be to firmly establish a link between 19th century London and martial arts in the popular imagination, and we’ll happily ride that wave.”\nThe trailers already hint that this version of Holmes will be up on his canefighting, and also a worthy pugilist and kickboxer. It’s no surprise—director Guy Ritchie is a judo black belt and a longtime karateka. Then there’s Robert Downey Jr., who studies the Chinese boxing system of wing chun. Once celebrated as the style of Bruce Lee, wing chun is perhaps today more famous for being the style of choice of any number of YouTube warriors who end up being kicked in the head by Muay Thai artists, taken down by Brazilian jiu-jitsu practitioners, and pounded by boxers. Heck, I do tai chi and I laugh at wing chun people. When the Sherlock Holmes trailer was first released, martial arts bulletin boards lit up with supposition—were Downey’s stiff-armed boxing stance and front kicks the real nineteenth century pugilistic deal or were they—gulp!—“the Chun”? Wolf allays the fears of a dozen or so Internet martial arts geeks, while crushing the hopes of many a chunner. “Richard Ryan [the fight choreographer for Sherlock Holmes] is an old colleague of mine and the Bartitsu Society contributed copies of the Bartitsu Compendium to the production.” Downey himself gave bartitsu a kinda-sorta shout-out in an interview with Premiere Magazine last year, saying, “If you look baritsu up, they can’t even really tell you what it is, so it gives us a lot of leeway.”\nOf course we can tell what bartitsu is, but there is a final question: does the system actually work? To find out, I attended a bartitsu class held by Botta Secreta Productions, a historical swordplay group. David Charles, a fencer and wrestler who got into historical recreations through rapier play and the Golden Gate Renaissance Park Faire, taught a small class of five—three men, a woman, and me—the basics of canefighting. He warned us right up front that if we were “looking for a secret weapon to make it in the Octagon [the cage in which the Ultimate Fighting Championship’s MMA matches are held], we’re not your guys.”\nWe went through the basic strikes and parries with our canes, and then paired off for a bit of play. I was teamed up with a man who wore suspenders and a shirt that wouldn’t look out of place on Barton-Wright (He had a nice hat too, but took it off for the cane drills.) During the “choice reaction” drill, when we could do as we liked with our canes, I managed to poke him in the belly once, using the cane like a bayonet. Beginner’s luck!\nMore complex moves were harder to pull off. In one the opponent’s cane is blocked, an arm grabbed, then a foot swept. In another, a swinging cane is blocked, but then looped around to the opponent’s ankle for a nice yank. Then we practiced the cane to hook the neck in order counter a right punch and feed the ruffian a knee to the face. But our punches kept “hitting”, knuckles lightly brushing against chins, before the cane hook could work. And that’s a major part of bartitsu—figuring out what moves work and how to make them work from fragmentary evidence. Still photos and sometimes tedious descriptions of physical moves are not enough. By the end of the class, we figured that perhaps there was an extra step off to the right involved—this would keep the punch off the chin and give the cane-wielder more space to yank with the cane. Plus, actually slamming a cane on the side of someone’s neck full-force probably would have made the move work a bit better!\nWe still know only a little about bartitsu. Despite Cherpillod’s presence at the school and reports of public demonstrations, for example, we have no idea what the wrestling curriculum of bartitsu consisted of. John Sullins, a Botta Secreta member, says: “Any study group working on the canonical system at a certain point is forced to ad lib and create its own Neo-Bartitsu style. There is nothing wrong with that, it is all part of the fun of studying this odd little martial art.” David Charles quoted the informal slogan of the neo-bartitsu movement—“The recreation of bartitsu is its re-creation,” several times during the class.\nThe martial arts historians are having their fun, and now the steampunks have some period exercise to try, but sadly the Sherlockians who play “the game” of pretending that Holmes was a real historical figure have an issue—Holmes supposedly learned bartitsu before 1893, but Barton-Wright didn’t found his art until 1898. And Holmes certainly didn’t study “baritsu,” which doesn’t exist. There’s only one solution: Sherlock Holmes went to Japan, learned jujutsu, and a decade later in a clever disguise, founded bartitsu! And when whatever case the great detective was working on was solved, the club and the entire system were mothballed.\nUntil now.\nFootnote:"}