{"fingerprint": "XRvx/sfkjhcuprUrCCbABKDRwZY=", "sitename": "Clarkesworld Magazine", "title": "Paint Your Own Language: A Conversation with Maurizio Manzieri by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/manzieri_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Paint Your Own Language: A Conversation with Maurizio Manzieri by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Paint Your Own Language: A Conversation with Maurizio Manzieri\n Maurizio Manzieri was born in Naples, Italy. Almost weekly, he visited ruins of ancient civilizations spread along the gulf, under the shadow of a volcano. He began his artistic career working as a graphic artist in advertising; his first editorial sale came in 1994 for the British magazine Interzone. Today, he is a professional illustrator based in Turin, who specializes in surreal worlds of the imagination. His artwork has appeared on countless covers of leading publishers in both Europe and the US, such as Mondadori, Rizzoli, the Espresso Group, Putnam, Berkley, Subterranean Press, and Macmillan; as well as magazines such as The Magazine of Fantasy & Science Fiction, Asimov’s, and Analog.\n During the course of his career, Maurizio has received the Europe and Chesley Awards and his paintings have been selected for annuals, such as Spectrum, the Best in Contemporary Fantastic Art, and Infected by Art. Invited as a Guest of Honor to Lucca Comics & Games Festival for three years in a row, since 2016 he has been hired as a visual creator for both Fantasy Basel (the Swiss Comic Con) and the Zurich Game Show.\n Is the SFF art community friendly and supportive, or is it competitive? Have you found conventions and the genre community in general to be welcoming and helpful?\n As an Italian teacher and a European Speaker of Digital Illustration, I’ve enjoyed the company of many artistic communities. I’ve always expanded my network of contacts, meeting exceptional colleagues and wonderful publishers. I admit that sometimes there is competition, particularly in countries where the space dedicated to illustration in the editorial market keeps shrinking, however, in my opinion every artist is a microcosm of experience. If you are able to create your own style and vision, publishers will be looking for you. If you’re persistent and go global, it’s just a matter of time before your activity starts to run at full speed. I was born in Naples, Italy, and moved to Turin following my dreams. After 25 years of continuous artistic production in the field, I’m currently working in Italy with Mondadori, the main Italian publisher, and abroad with several companies, magazines and publishing houses mainly in the United States and Switzerland. Every now and then, I land in England, France, China, Czech Republic, Netherlands, and Australia.\n According to ISFDB you’ve been selling art to SF markets since Interzone #99 back in 1995. How did breaking into the art market happen for you?\n Everything happened out of the blue. In 1994, I was switching from manual to digital techniques, something I found immediately congenial to my lifestyle because I was traveling quite a lot. You know, at the beginning digital art wasn’t as appreciated as it is today and sometimes, I regret not having so many originals. One day—I was 34 years old—I woke up and thought: “That’s enough! This year I want to become a professional artist!” I funded my studio, prepared everything to start my business, printed visit cards, bought a printer, an expensive Apple Quadra 800 workstation, a Wacom drawing tablet and I put myself at work.\n My first target was Interzone magazine—I was already a subscriber and I had been carefully studying the style of other artists appearing on previous issues. After a couple of months, I shipped a small portfolio of four pieces to Brighton, and they were accepted at once. All of them! David Pringle decided to publish one of my paintings on the issue on sale at the WorldCon in Glasgow in 1995 and on that occasion Interzone won its first Hugo Award. That one was a promising good start!\n . . . and in addition to professional publications, awards have been helping a lot, too! I’ve conquered the Italia Award and the Europe Award as Best Professional Artist. I’ve been often nominated for the Chesley Awards, winning one in 2003, and my covers have been often selected for annuals including Spectrum and Infected by Art. I’m proud that my visions have been able to excite so may fans and professionals!\n Were you creating art from an early age? How did you transition from hobby and for yourself to doing it professionally?\n I’m a self-made artist and I’ve been drawing since I was four years old. At ten, I purchased The Martian Chronicles by Ray Bradbury and my library started to expand exponentially. Oh, how I loved all those fantastic covers, and those stories! At that time Internet itself was in the realm of science fiction. Becoming shortly addicted to fantastic literature I was soon used to importing books from English bookshops, buying them through specialized newsagents or even visiting American aircraft carriers temporarily moored in the Gulf of Naples!\n What is your process for a piece? Do you start with sketches on paper, do you work digitally, how does everything come together?\n The instruments surrounding me are all highly technological, not very similar to Caravaggio’s. There are large drawers with prints realized for limited editions or exhibits, a great library with a collection of art volumes, many complimentary copies of all the books I keep illustrating, and books I love simply to read, photo albums with many references and pictures shot by myself to be used for future commissions, backup hard disks with carefully registered sessions of my digital paintings, loads of paper for sketching with pencils or felt pens, a scanner, a powerful iMac, several laptops, and a drawing tablet Intuos Pro M. The big stuff is outside my apartment in associate studios, for an example a set for photo shootings with models, big plotters for printing on canvases and archival papers, and so on.\n Here is the process: I receive the manuscript to be illustrated from the publisher via email, then I upload it to my iPad, spending a lot of time highlighting the most interesting passages, putting down ideas, sketching the first concepts on my workstation . . . or on paper! I like to be in touch with pencils and paper during the preparatory phase. A stroll in the woods surrounding my studio helps me! In a short time, I feel some gears moving in my brain and I enter the world of the writer while images and ideas keep flowing in front of my eyes from nowhere. I discard unessential elements, focusing on scenes conveying that feeling of sense-of-wonder which captured my soul when I was young. It’s rewarding to see an initial concept unfurling its wings, morphing in a captivating solution.\n How does your process change if you are working on a magazine cover as opposed to a book cover or something else?\n If no specific instructions are requested by the art director, I dive into the universe created by the author. Usually the magazine gig concerns the main and relevant story of the issue. It can be a short story or a novella, while in the case of a book you need to read the full novel without shortcuts in order to make yours the mood. I try to synthesize the salient point of the story, creating something narrative, never giving away direct spoilers.\n Are there themes or motifs that you enjoy, that appear in your work often, and what do you like most about them?\n I’ve always fantasized about a faraway galaxy where history followed a different path and in recent solarpunk novels, we are finally seeing that starship’s hulls need not be rusted or torn by battles. They can be made of glass and titanium, gold or pure white. People living in this utopian empire didn’t go through wars or global warming. They became an advanced civilization mastering top-notch cosmetic surgery applied to human beings as well as robots. My recurrent characters wear hybrid bodies and skins, taking advantage of their engineered beauty. The concepts of “sex” and “identity” have been studied and isolated in the future, becoming a choice of life. I like to portray them on these other planets, showing their personality in everyday life, in a deep gaze, raising the curtains on glimpses of space stations and alien architecture.\n Following all these ideas, in 2017, I opened a Patreon page, named Laniakea, the Hawaiian word for immense heaven, telling a story about the true origins of our universe and the Absolutes, the first advanced race spreading through the Milky Way, billions of years ago. It’s an epic mystery, unveiled image after image, trying to reply to the old question of the Fermi Paradox: “Where are all the aliens?” The illustrations are mine, the suggestive text based on the images inspired by the writer Dean Whitlock, author of several beautiful novels and stories that have appeared in Asimov’s SF and The Magazine of Fantasy and Science Fiction.\n The Laniakea page is still online, if you wish to browse. I could add some more chapters, sketches, and new tiers in the future.\n What were a couple of your most challenging pieces and how did you deal with the challenges?\n Every illustration is a challenge . . . and I love hard challenges, if I’m quite thoughtless or brave enough to accept them! You have to catch that indefinite spell, able to sell the product and leave a mark in the viewer’s imagination. My illustrations incorporate subliminal Easter eggs. A couple of years ago I realized a cover art inspired by the story “Starlight Express” by Michael Swanwick for The Magazine of Fantasy & Science Fiction. Naturally the author was the first one to discover it and dedicated a full page of his blog to the cover.\n Hard challenges come with short deadlines, too. Once I painted a cover for an Italian mass market paperback by Clive Cussler in two hours’ time: a steam engine plunging toward the bottom of a lake—they asked for a miracle because they needed it “yesterday.” Two years after Clive Cussler fell in love with my vision, he asked for an upgraded version of the painting for the American first edition of The Chase, published by Putnam/Berkley.\n Are there specific differences between the needs (or the aesthetics) of European markets compared to US markets?\n There are a lot of European happy islands, but the US artistic market in the fantastic field is unsurpassable in terms of quantity and quality of the artwork commissioned and produced for any kind of media. Sometimes in Europe a limited budget allows only a photo or a stock image, so it’s not possible to hire an artist for an original illustration and even in the case of an important bestseller the fees for the contributors can vary consistently from country to country.\n I think my own kind of style fits many areas, not just the fantastic editorial destinations in the book market. While my primary target is being coherent with the themes of my production, I wish to be flexible looking around for other interesting opportunities, going from illustrated volumes to music CD covers, RPG cards, video games, romance, and scientific or historical magazines.\n In the last decade I’ve been hired as a visual artist by many science fiction conventions and comics festival. I’ve been a Special Guest Artist of Lucca Comics and Games realizing their official poster—an alien invasion in a Lucca square, Independence Day-style, coupled with a walk-through documentary published by the Italian edition of ImagineFX magazine. Furthermore, it’s now six years I’ve been collaborating with Amazing Events AG, the organizers of some major conventions in Switzerland: Fantasy Basel and the Zurich Game Show. My latest 2019 Poster was for the international event CARTOONS ON THE BAY 2019, the Children’s Television Animation Festival promoted by RAI Com, the Italian public broadcasting company.\n Are there differences in SFF art trends now compared to back in 1995?\n Yes, the Internet allowed us to discover so many talented artists and raised the bar for every new artist joining the race for a prominent space in the market. Think about how many new artists add up to this huge army of creators every year, think about the database of artists at the website ArtStation! You can admire a jump in quality and a great variety of styles.\n As a consequence, you can’t paint in the same way as in the eighties! There is a lot of experimentalism and finding your voice among thousands of awesome artists may not be such a linear thing.\n When I became a digital artist back in 1995, I was a pioneer. In 1997, I was invited in Rome to attend Digipainting, the first International Exhibition of Digital Illustration and signed the Manifesto of Digitalism, together with artists from all over the world: Laurence Gartel, Gil Bruvel, Cher Threinen-Pendarvis, and many others.\n Are there ways in which your taste or skill has changed since back then?\n I’m fundamentally the same person. Training and experience have refined my brushes and every time I’m in front of a white canvas I feel the same primordial enthusiasm.\n Do you have any advice for artists who want to break into the genre art markets?\n Painting is like learning a language. Paint every day, dream your own world and let your artwork speak for itself. Try to be a good reviewer of your work and put your work side by side with the artists you love. Ask yourself: am I ready? Live your life and learn everything from other fields. All your knowledge will flow into your artwork.\n What are you working on now that people can look forward to seeing?\n I met the fantastic writer Aliette de Bodard for the first time in Milan at the festival Stranimondi (Strange Worlds), then we had a dinner at her home in Paris. I had just published the cover for her novella The Citadel of Weeping Pearls, an artwork winner of the Asimov’s Readers’ Award as their Best Cover of the Year. Subterranean Press noted this cover and asked me if I was available to work on another novella taking place in the same Xuya universe The Tea Master and the Detective. I said YES and both the Asimov and Subterranean Press covers were nominated for the Chesley Award. An alternative concept art for Aliette was also optioned and completed, and it will be out this September as a cover for her anthology Of Wars, and Memories, and Starlight. The partnership and exploration go on, because while I’m writing this interview, I’ve delivered a brand-new artwork next to be announced. Aliette is a terrific writer and I’m enjoying bringing to life the living starships of her Oriental Houses in a far future.\n In November, I’ll be a speaker at GameRome, while in May 2020 I’ve been confirmed as a Guest Artist of Honor at Fantasy Basel, the Swiss Comic Con. Between a workshop and a festival, I’m always at work on fantastic paintings for old and new clients and before the end of the year I should sign a contract for the production of several original sci-fi covers, probably with more than a publisher.\n In the contact page of my official website (www.manzieri.com) you can find all my addresses, my email, and links to social networks, like Facebook, where I’ve opened a personal page as well as a fan gallery. I’m pleased to post there my latest works or announce updates about the studio activities and publications.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}