{"fingerprint": "zyrygNDjeAWdp4hLIzbhFBVcbmw=", "sitename": "Clarkesworld Magazine", "title": "Who Were the Celts? by Dr Kari Maund", "author": "Dr Kari Maund", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/maund_06_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Who Were the Celts? by Dr Kari Maund", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Who Were the Celts?\n 'Celt' is a powerful word these days. It evokes images of woad-painted warriors battling the forces of colonisation and oppression, of strong-minded queens leading charges from chariots, of druids steeped in natural and spiritual law, of self-empowered women and bold venturesome men, of mists and bards, harpists and warbands and ancient pagan mysteries. In the popular imagination, the Celts stretched across Iron-Age and Roman Europe, from Spain to the Shetlands, a distinctive people characterised by religion, artifacts, law, social behaviour and language, enduring from the Iron Age to the sixteenth century and beyond. It is an alluring, fascinating picture, long-mined by writers of fantasy seeking a society which can reflect modern concerns with equality, ecology and freedom of religious expression. According to this view, the Celts first appeared between c.800 and c.600 B.C. on the fringes of the Greek world, living in Spain and in the lands just north of the Alps. From here, they spread slowly north and west during the fifth century B.C., becoming the direct ancestors of the people encountered by the Romans in Gaul, Spain and the British Isles.\n And yet this picture is one which archaeologists, historians and linguists increasingly question. The ways in which we approach the past, the ways in which we analyse and interpret our source materials, have changed radically over the last thirty years in the face of new scientific methods and new approaches to the creation and transmission of myths, ancient and modern. The image of a vast Celtic monoculture is giving way to one of a dynamic, changeable, network of cultures: not 'the Celts', but the Celtic-speaking peoples, each with their own distinctive ideas and practices, their own names for themselves, and viewing each other as neighbour or enemies but not as fellow members of one vast people.\n The traditional account of the Celts begins with an expansion of people out from their territory to the north of the Alps into central and eastern France, Germany, Austria and the Czech Republic. This expansion was characterised by a range of cultural artifacts, art and grave types (particularly 'warrior' graves) known as the 'La Tène' culture. The presence of La Tène artifacts was taken as indicating the presence of invading or colonising Celts at that location. Roman and Greek writers spoke of migrations of peoples from these Celtic areas into other parts of Europe — wider France, the Balkans, Turkey, Spain, Britain and Ireland and archaeological finds seemed to back this up. This combination of archaeology and the writings of Classical observers gave rise to the image of a culture typified by particular art styles, ruled by a war-like aristocracy, with priests and priestesses (sometimes called druids) who operated a religion with a strong emphasis on the natural world — woods and pools and springs. This society valued poetry and music, had a powerful tradition of oral scholarship and tended to live in fortified places (hill-forts, crannogs, strongly built settlements). These are the Celts whose image we find today reflected in film — King Arthur (2004), and in novels, from Rosemary Sutcliff to Marion Zimmer Bradley and beyond.\n During the period 300 B.C. — 1st century A.D., the continental Celts were gradually colonised and subjugated by the Roman empire which destroyed much of their way of life, and, after the fall of Rome, France and much of Spain was further overrun by Germanic peoples — the Franks and the Goths. Rome invaded the British Isles in the last century B.C., damaging and destroying the Celtic culture of southern, central and eastern Britain and influencing and threatening that of the rest of the island. Only Ireland remained untouched by Rome. During the sixth century and later, new waves of invasions by Germanic barbarians pushed the British Celts into the west — what would become Wales and Cornwall — and the north — the future Scotland. Further invasions eroded their territories — the vikings, in the eighth through tenth centuries, and, from the last years of the eleventh century, the Normans. Slowly, the Celtic territories were overrun and colonised, but the core of their culture remained.\n Our vision of the early Celts has been filled in from references to them in the records left by the conquerors and invaders: the use of war chariots, the collecting of the heads of enemies as trophies, a love of feasting and boasting and a society made up not only of warriors but of equally fierce and independent women. From around the fifth century A.D. the Celts began to produce written records and these too — in particular the prose tales, legends and law codes from Ireland — have been mined to flesh out the image of early Celtic society. Boudicca's rebellion and the references in Irish saga tales to Queen Medb were drawn upon to back up fragmentary Roman references to fierce Celtic women. Irish law-codes and lives of Saints were used to flesh out the few Classical references to druids, bards and jurists (legal advisors). Folklore and poetry from the eighth to the eighteenth centuries has been drawn upon to support claims about Celtic religious beliefs, social behaviour and philosophies.\n This process of defining and discovering the Celts as a people began not in Antiquity, but in the eighteenth century with two scholars: the Welshman Edward Lhuyd and the Breton Paul Yves-Pezron, who both embarked on a study of the languages of their respective ancestors. This was a period of great scholastic activity and curiosity about the past, freed from the shackles of Biblical and Classical narratives. Lhuyd and Pezron were both part of this movement. They were both also ardent nationalists in a period when the languages of their homelands were under great pressure from increasingly centralised and controlling national governments. Lhuyd and Pezron were thus very much concerned with upholding and strengthening their native traditions and culture. Lhuyd chose to label the languages he studied — Scots and Irish Gaelic, Breton, and Welsh, which he saw as the original tongues of the British Isles — 'Celtic'. His work laid the ground for much of our modern interpretation of the nature and interrelationships of the various Celtic languages. He did not, however, label the speakers of those languages 'Celts'. This term was coined as a result of his work and by his circle. The first occurrences of the word 'Celt' used to describe these peoples occurs in the 1720s and by the early years of the nineteenth century, it was well-established as a common descriptor of Welsh and Irish, Scots and Bretons.\n Following the coining of the label and the study of linguistic relationships, scholars began to look for further connections and similarities between the peoples now considered Celtic. Lhuyd himself laid out a pedigree of the Celts, tracing their common ancestry from Biblical forebears. Antiquaries and scholars embarked on studying and publishing manuscripts from Ireland and Wales, on collecting folk-tales and on re-establishing traditions. Much of this activity was careful and honourable, but not all of it. Towards the end of the eighteenth century, in Wales, the nationalist and free-thinker Edward Williams — better known by his pseudonym Iolo Morgannwg — 'discovered' a large body of material, including the system of ancient bardic and druidic teaching which helped inspire the development of a politicised and rediscovered Welsh culture. Iolo was a revolutionary at heart, seeking to liberate and redefine Wales, and where he could not find a source he created one himself. His forgeries were recognised as such by the late nineteenth century, but they had already proved influential leading, amongst other things, to the foundation of the modern Eisteddfod. Similar enthusiasm for things Celtic infected the Scots. James MacPherson found a new corpus of supposedly ancient Scots Gaelic poetry — the Ossian poems — in the 1760s. Like Iolo's manuscripts, these were meant to strengthen and glorify native traditions. Like Iolo's manuscripts, they were forgeries. The work of scholars and antiquaries, both genuine and fraudulent, during the nineteenth century, built on Lhuyd's foundations to create the pan-European view of culturally linked, timeless Celts. His language-based research has also underpinned the way archaeologists and historians used and interpreted their material for much of the twentieth century, and has passed into popular belief.\n Modern scholars have issues with Lhuyd's methods, and not just because of the forgeries of those who followed him. His need to find similarities — however small — between different Celtic peoples, leads to the ignoring of differences and a danger of distortion. It presupposes a conservative and stagnant model for ancient Celtic society. And it sometimes contradicts the testimony of the peoples it claims to describe.\n How did the peoples we label 'Celts' describe themselves? For the early period — c. 800 B.C. — c. 400 A.D. — this question is probably unanswerable. The names we have for them come from the testimony of their invaders and conquerors, and while these may represent Latinisations of words in use by the people themselves, we cannot be sure of this. (They may also represent the labels used by neighbours of a people rather than the people themselves.) What we can say, however, is that the Greek and Roman writers did not consider all these peoples as identical in behaviour, organisation and appearance. Rather, they talk of a series of different tribes living across Gaul and Britain — the Atrebates, the Belgae, the Iceni and many more. Though these had some similarities, they are presented also as having differences and, in particular, as having complex and changeable inter-relationships for trade, warfare, alliance and so on. Words like 'Britons' and 'Gauls' were used as collective nouns, meaning all the peoples of a geographic area without any assumption that these peoples were the same. This sense of distinctions between peoples is reinforced when we begin to have sources written by those peoples themselves. Both under Roman rule and in the century or so following its collapse Britain, Gaul and Ireland were home to many tribes, kinship groups and kingdoms, each with their own names and practices. These peoples possessed a sense of geographical similarity but this was a borrowed notion derived from Roman influence that cannot be shown to predate the Roman period. Sources for the immediate post-Roman period are few and those we have were written in a Romanised context, looking back to an ideal of a centralised authority controlled from outside (usually represented by the church), in a world now made up of fragmented tribal territories.\n Early Welsh and Irish histories, prose tales and law codes do not speak about the 'Welsh' or the 'Irish'. Rather, they present us with a society made up of overlapping kingdoms. In Wales, these are described in geographical terms — Dyfed, Gwynllwg, Meirionydd. In Ireland, the descriptors are kinship based, tribal — the Deisi, the Dal Cais, the Ui Maine, the Cenel Conaill. These were often unstable and politically dynamic, and although they recognised their similarities in language and behaviour to their immediate neighbours, they did not consider themselves to be the same. To this day, there are differences in language between different areas of Wales and Ireland. Welsh and Irish are not now, and were not in the Iron Age and early historic period, mutually comprehensible.\n The Welsh of the early middle ages considered themselves related to the Bretons in Brittany — but not because of some memory of ancient ties, but because the Bretons were considered descendants of Welsh migrants in the 4th through 6th centuries. The Irish were considered invaders and enemies, rather than kinsmen and allies: during the 3rd through 6th centuries, Irish tribes colonised parts of south west and north Wales, intruding themselves into local kingships. Perhaps as a result of this, Welsh chroniclers viewed the Irish with suspicion: a king from Wales seeking allies was more likely to turn to Anglo-Saxon England, to viking colonies or even to France than to the Irish, who apparently had a reputation for treachery. Neither Welsh nor Irish seem to have conceived of themselves on any large scale as part of a 'Celtic' brotherhood before the rise of Lhuyd's theories in the 18th century.\n Modern interpretations of the Celtic speaking peoples aim to work with the differences expressed by early sources, rather than against them. Problems with the old approach have long been recognised, but new archaeological discoveries and techniques and re-examination of earlier finds and sites, new ideas about social development derived from comparative anthropological studies, and new understandings of languages and of the use of written sources are now allowing us to address some of these.\n It is now recognised that so-called 'primitive' societies, such as those of the Bronze and Iron ages are far more adaptive and changeable than formerly thought. Far from remaining static, tales, pedigrees and origin stories change to reflect changes around their home society and what were once taken as timeless records are now recognised as highly volatile, altering to reflect current political status. Thus ancestors are re-named and even invented to account for changes in alliance patterns or overlordship. Far from enshrining ancient memory, most early Welsh and Irish records speak to the time of their composition. Tales about the wickedness of the Welsh ruler Vortigern in the ninth-century Historia Brittonum reflect the rise of his political enemies rather than a tradition about his character. References in Roman texts to strong-minded women have been reassessed to allow for bias — Roman authors often attributed socially unconventional or threatening behaviour to non-Roman cultures on the grounds of assumed barbarism rather than any direct evidence. The bulk of archaeological and written material we possess from the Celtic peoples themselves tend to show that women held very low, rather than equal status.\n In archaeology evidence such as the spread of La Tène artistic styles was once taken to indicate invasion and conquest by a people who used them. However, new work on the artifacts themselves reveals considerable regional variations between them. This is not a monoculture, but a fashion in design, taken up and interpreted by varied peoples who trade with, learn from and imitate each other, adapting new ideas to their own ends. Such changes no more imply conquest than we should say that modern America has been conquered by manga-reading, Hello Kitty-worshipping Japanese. Settlement patterns and types have been re-analysed and again considerable variation in patterns of usage and practice has been revealed. The peoples who lived in these settlements — be they hill-forts or lowland farms — and used these artifacts may have spoken related languages, but it is no longer assumed that this means they were one people, either in their own eyes or those of their neighbours.\n So: who were the Celts? The answer is not simple, and for much of Iron Age and early historical periods, we have to say that we may not be able to answer that question fully. When they emerge into the full light of written history what we see is many peoples, some speaking related languages, others not, possessing varied religious and social practices and viewing themselves as separate and distinct from their neighbours, allies and enemies. \n Select Bibliography\n Simon James, The Atlantic Celts: ancient people or modern invention (London 1999)\n Ronald Hutton, The Pagan Religions of the Ancient British Isles: their nature and legacy (Oxford 1991)\n Philip Freeman, War, Women and Druids: eyewitness reports and early accounts of the ancient Celts (Austin, Texas, 2002)\n Kim McCone, Pagan Past and Christian Present in Early Irish Literature (Maynooth 1990)\n Francis Pryor, Britain B.C. (New ed. London 2004)\n Francis Pryor, Britain A.D. (London 2005)\n Lisa M Bitel, Land of Women: tales of sex and gender from early Ireland (New York 1996)\n Dr Kari Maund was trained in the Dept of Anglo-Saxon, Norse and Celtic, University of Cambridge and held research and teaching posts in early mediaeval British and Scandinavian history at the universities of Bangor, Cambridge, Leicester and Cardiff and the Institute of Advanced Studies in Dublin. She is the author of six books and many articles on early Wales, England, Ireland and Denmark. As Kari Sperring, she is reviews editor of Vector, the critical journal of the British Science Fiction Association and her first novel, Living With Ghosts, appeared from DAW books in 2009 under the same name. She lives and works in Cambridge, England."}