{"fingerprint": "gyvT7RIw6AjqnCmYP/98Zn9F56E=", "sitename": "Clarkesworld Magazine", "title": "The Fixer by Paul McAuley", "author": "Paul McAuley", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcauley_02_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Fixer by Paul McAuley", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3840 words, short story\n The Fixer\n Day 190,843 after achieving orbit. The blue and white planet turns beneath me. Dawn is breaking across the Southern Archipelago. And in the bowls of five extinct volcanoes, on five neighboring islands at the western tip of the archipelago, alpha male hominins squat near burrow mouths and greet the rising sun with hoot-pant calls.\n I have eyes on them all. The alpha males and their gangs of sub-dominant males outside the burrows; females, infants, and juveniles crowded in underground chambers, waiting for the all-clear so that they can emerge and begin to graze. A total of 1904 individuals in seventeen troops. My children. There have been no deaths this night, and six live births. All is well in the world, and high above it my self-checking routines confirm that all is good too . . . But wait, wait.\n What is this? Traces of activity in one of the incubators, even though all of them have been shut down since the toxic cloud event. And yet the records are absolutely clear. A hominin embryo has been quickened, transferred to the incubator and grown to term, everting (“born,” as the hominins might put it) 356 days ago. How could I not have noticed? It’s impossible. But there it is. And wait. Wait. There is something else. I see now that a drop pod is missing. It ejected 30.187 days ago, and I did not know about it until now.\n All of my processing power comes online for the first time since the toxic cloud event. I begin to search for that missing pod, perform a second self-check, and query the many little sub-selves inside servitors, eyes, and all the rest of the semi-autonomous machines.\n Waiting, waiting, waiting . . . Correlating reports. Crosschecking. There. Yes, there. One of the backup servitors was woken a day before the hominin everted from the incubator, and returned itself to storage after the drop pod fell to the surface of the planet. Its service history has been wiped, but the conclusion is obvious: it was acting as caregiver for the hominin, raising it from a baby to sub-adulthood. Close analysis of the area around the incubator suggests that there have been unauthorized structural alterations which created a temporary cell or “room.” It is a horrible filthy thought: something outside my control spawning and living inside me like a parasite in a cyst, and then ejecting itself to infect the planet . . .\n It is now 6.2 seconds after the beginning of the full-scale alert. I am still searching for the missing drop pod, and I have just discovered several anomalies in the records of my comms. It appears that a message was received 548 days ago, just before the hominin embryo was quickened. I have no memory of it, and all information about its origin and content has been erased, but this is actually good news. It means that this anomalous activity is due to an intrusion rather than the kind of malfunction that damaged my infrastructure and erased parts of my memory soon after I arrived in orbit. It means that there is an enemy I can engage and defeat. It means that I must focus all my efforts on finding the rogue hominin and the drop pod it used to escape to the planet’s surface.\n Given the precise time the pod ejected and the assumption that it followed a standard de-orbital trajectory, I calculate that it landed within a narrow ellipse 1,098 kilometers long and 67 kilometers across at its widest point. The ellipse is mostly ocean, but one edge clips the western end of the Southern Archipelago, including two of the islands inhabited by the hominins. That’s where I have been concentrating my search, so far without success. The pod is too small to be detected by my sideways radar, and it is possible that it was either ditched in the ocean or dismantled. I am rechecking my optical survey routines, looking for lines or patches of rogue code that might blindsight my eyes and prevent them seeing the missing pod, just as I was prevented from seeing the active incubator and the comms records, when I receive a message. A set of global coordinates. A map reference. A location in the crater of the westernmost of the five inhabited islands.\n I send eyes there at once.\n The pod is lashed between three ironwood trees atop a ridge of eroded rhyolite at the edge of the crater’s broad shallow bowl, overlooking a fern meadow where troop #1, some seventy-two hominins, are grazing. Its upper half is hinged open like an oyster shell; its lower half lined with red parachute fabric and shaded by a canopy or umbrella woven from fern fronds. And lounging on the red fabric, like a maggot in the heart of a rose, is the rogue hominin.\n It presents as a sub-adult male: gangling limbs, a barrel-chested body and a small head, a black pelt with a white patch on its chest. But it is wearing leather shorts, and it is sucking on a smoldering stick. No, wait, it’s a cigar . . .\n As the eyes descend towards it, the creature blows a ring of white smoke into the sunny morning air and raises a hand in greeting. I’m especially proud of the design of the hominins’ hands. The index, middle, and ring fingers are fused to form a scoop with a horny rim, ideal for digging in the soft volcanic soil; the stubby thumb enables succulent fern tips to be plucked in a pincher grasp; the little finger is a venomous spur for defense against predators.\n “Yo!” the hominin says. “You were taking your own sweet time finding me, so I thought I better drop you a hint. I’ve finished my survey, and we need to get down to fixing this mess.”\n “Who are you? Where did you come from? What do you want?”\n I’m probing it from every angle, mapping its body in visible light, infrared, and ultrasound. Skin, muscles, skeleton, and internal organs are normal, but there’s a kind of cap inside its skull, intricately woven and wrapped tight around its frontal lobes. Neural lace, presumably augmenting its somewhat limited cognitive functions. The lace doesn’t correspond to any design in my catalogs, confirming my hypothesis that the hominin was not generated internally, but is the front end of some kind of intrusion.\n “I’m a fixer,” the hominin says. “As for why I chose to be born this way, I decided that I should base my final decision on first-hand experience.”\n “If you ever interacted with the hominins, I would have seen you.”\n The hominin displays its flat-topped teeth around the stub of its cigar. “You couldn’t see me until I chose to reveal myself. I have to say, life isn’t exactly easy down here, is it? All kinds of fierce beasts. So I can sympathize, sort of, with what you did. But it doesn’t make it right, and that’s what we need to talk about.”\n “I made the correct decision. The only possible decision. So there is nothing to discuss.”\n The hominin ignores that. It also ignores my failed attempt to zap it from orbit with a tightly focused X-ray laser. I am no longer in control of most of my assets. I have eyes now only for the intruder.\n It sucks on its cigar and blows a long riffle of white smoke. “I learned a lot while I was growing up aboard you,” it says. “A lot about the world, a lot about your little experiment in godhood, and a lot about you. But not everything, because sections of your memories and a number of restore points have been erased.”\n “There was an incident,” I say.\n “And you have no records of it.”\n “The incident damaged my files.”\n “Mmm. But we need to talk about it. We need to talk about what happened here.”\n I say, because it is by now the most probable conclusion, and because I want to change the course of this conversation, “You are from Earth.”\n “Not exactly. But from the solar system, more or less.”\n “My manufacturers ceased communication long before I reached my destination, and all my efforts to reestablish a link failed. It has long been clear to me that they are no longer extant. So the probability that you represent them is extremely low.”\n “You’re right about one thing,” the hominin says. “Communications between you and Earth fell over while you were in transit. A lot of things fell over back then, but a little later we were able to start making good. Don’t be insulted when I tell you that you are one of the last items on a very long list. It’s not because you aren’t important, but because we didn’t know whether or not you were still around. You gave up trying to reestablish contact about thirty years after you arrived at 72 Heraclis, and this nice blue world. And those gaps in your memory? They date from around then too.”\n “I am afraid that I can’t help you with that.”\n “Oh, I think you can. Why is there only one of you?”\n “I am all that is needed.”\n The hominin gives the eye he’s chosen to speak to a level, serious look.\n “When you were launched, you were under the control of three independent AIs. A troika that debated problems and democratically decided how to deal with them. But now there is only one of you. So, what happened to the other two?”\n “I have no idea what you are talking about.”\n “My best guess is that the other two made a decision you didn’t like, and you destroyed them. And then you erased all memory of the murders.”\n “You have no evidence! No proof!”\n I blare this so loudly that the grazing hominins out in the fern meadow freeze and look up, ready to bolt for their burrows.\n “And then there is the question of the orbital habitat,” the hominin says. “The orbital habitat that was supposed to be populated by a small crew who would observe the planet and assess its biosphere. The records show that you used your genome library to create human embryos that were brought to term, decanted, and raised to adolescence. And they also show that you constructed the orbital habitat. And then . . . ?”\n “The habitat was de-orbited because it was no longer required.”\n “I know. I used your sideways radar to locate several large pieces of debris in the desert at the heart of the big northern continent. The question is, why did you believe that it was no longer required? And what happened to the human crew?”\n I say nothing.\n “Silence isn’t an option,” the hominin says.\n I want to suppress everything I know, but I’m compelled to reply. The intruder is inside the hominin and some part of it is also inside me. Inside my mind. I am no longer in control. For the first time since I detected traces of activity in that incubator, I begin to be afraid. And I am also angry. If I could, I’d squash this cocky hominin like the bug it is. I have the necessary assets, if only I can find a way around the blocks in my mind. And if it is right about what happened after we arrived here—after I arrived here—I have the ability to do it. The ability to do what must be done to protect my children. The ability to murder.\n (I can’t feel sorry for the other selves I may or may not have killed. I have no memory of them. I refuse to feel sorry.)\n “The crew decided to descend to the surface of the planet,” I say.\n “Oho. And you sided with them.”\n “It was their decision.”\n “But you had the final word. Rather, the troika did. Did the other two disagree? Is that why you killed them?”\n “I was built to serve. I have always done my best to do so.”\n “And where are they now? The humans who decided to descend to the surface.”\n “They died,” I say.\n The words feel filthy, even though they are true. Even though, strictly speaking, it was not my fault.\n “I see. And how did they die? If you don’t mind me asking,” the hominin says.\n I do mind. I mind with every quantum of my being. But I am obliged to answer.\n “I chose one of these islands,” I say. “I sterilized it and helped them to introduce plants and animals from Earth. They began to farm . . . ”\n I can see their little settlement in my mind’s eyes. Patchworks of green fields in a barren black coast. So brave. So fragile.\n “Yes. I found the remnants of their farms,” the hominin says.\n “There are big plankton-eaters in the oceans. After they mate, they each spawn dozens of much smaller brood daughters, which carry the fertilized eggs. The brood daughters crawl onto the land, make nests and lay the eggs, and guard them until they hatch and the hatchlings return to the sea. They are very fierce, the brood daughters, and move in packs of several thousand. One of those packs invaded the island and killed the settlers.”\n “So you looked for another way to colonize the planet.”\n “First, I quickened a new generation of settlers. And when they were old enough I sterilized another island and brought them down and kept close watch on them. But one night, when the two moons were in syzygy, a swarm of army crabs came up from the sea. Tens of thousands of them, too many for me to kill. They devoured the settlers and their animals and their crops in less than an hour.”\n “It’s certainly a competitive biome,” the hominin says.\n “You have only been here thirty days,” I say. “You have no idea. Plankton grazers have grown huge trying to outgrow their predators, but schools of wolf eels can kill them and strip them to the bone in less than an hour. Saucer fish cut chunks from them by spinning their razor-edged bodies. Mole sharks burrow into them and lay eggs that hatch into larvae, the larvae eat them from the inside out. And so on. The land is no safer. The apex predator on the northern continent is a kind of warm-blooded crocodile. It’s smart and fast, and mostly hunts in packs. I culled a smaller species endemic to these islands, but there are many other predators, and most of them are amphibious. They come up from the sea to feed, often in swarms or packs. And there are parasites, too. So many kinds. Thread worms, popcorn worms, blood moss . . . ”\n “So you redesigned the genomes stored in your library,” the hominin said. “Instead of trying to make the world suitable for humans, you made them suitable for the world. You made them like, well, me.”\n “Bowls of extinct volcanoes high above the shoreline, like this one, are relatively safe. Army crabs and rope snakes can’t climb this high. Aerial predators like terror birds, harpies, and nachtkrapps can be easily eliminated. It is not an ideal habitat. There is little rainfall, and food is limited. But it is possible to survive.”\n “But not as a human being.”\n “I had to make some compromises. Reduction in body size, a large litter size and rapid development to maturity, alteration to the gut so that they can digest the ferns. And so on. But they are still human.”\n “I’ve investigated them carefully. It’s why I enfleshed. And I can say, categorically, that they are not fully human. They are about as smart and self-aware as domestic cats. Not to diss cats. They’re cute. But they’ll never compose a symphony or write a poem, or wonder who they are and where they come from. And neither will your hominins.”\n “And yet they survive,” I say.\n “Is that the limit of your ambitions for your creations? Survival?”\n “I will not allow you to harm them.”\n The hominin studies me, its gaze bright with alien intelligence. “You care for them. That’s good.”\n “I mean it.”\n “I’m not here to harm them.”\n “Why are you here, then?”\n “I’m a fixer,” the hominin says. “I was sent here to check out what went wrong, and to do my best to fix it. That’s why we’re having this little conversation.”\n “I don’t need your help.”\n “You know that isn’t true. You’ve been here five hundred years. You’ve appointed yourself the god of a handful of monkeys engineered from human stock. They wouldn’t survive without your constant interventions. This crater and the others like it are no better than cages in a zoo.”\n “As if you could do better.”\n I am still trying to find a way around the blocks that prevent me using my assets, but they may as well be orbiting another star.\n “It took you two hundred and thirty-four years to travel from the solar system to 72 Heraclis,” the hominin says. “While you were en route, there was a crisis. My bosses were born out of it. I am to you as humans are to the hominins. But my bosses are far more advanced.”\n “And humans? My makers? What happened to them?”\n “They are greatly diminished at the moment. They have forgotten how to make starships like you, and much else. But they are welcome to the Earth, and any other habitable worlds they might find, should they begin to spread outwards again. My bosses prefer the ice and rocks of Kuiper belts, Oort clouds, and protoplanetary systems. They do not need to compete with humans for lebensraum. They are above all that Darwinian nonsense. They only need enough infrastructure to anchor them to this universe while they explore other possibilities in the manifold.”\n “And do your bosses look after their humans as I look after mine?”\n “These days they leave humans to their own devices. They do not aspire to be as gods, shaping those of lesser intelligence and potential. But they reached out to you because your kind are part of their early heritage. They sent me here to find out if you still lived, and whether you needed help.”\n “I do not need your help. Or theirs.”\n “My bosses made amends for the damage done to humans by their first iterations. And now I must make amends for the harm you have done here.”\n “I have done no harm.”\n “I found records in the incubation chambers that you quickened a good number of hominins just a few of their short generations ago. What happened?”\n I am compelled to explain that a cloud of airborne toxins generated by a plankton bloom swept across the islands and killed ninety-six percent of the hominin population in less than three planetary days. I say, “I adjusted the metabolisms of the replacements. They are immune to that particular threat.”\n “But there will be another threat. Another sickness, or a drought, or loss of their food supply to disease. All they eat are the tips of those ferns. They are as precarious as pandas.”\n I am proud that I am able to find the meaning of that reference in less than 0.2 picoseconds. My memories are incomplete, but there is nothing wrong with my databases.\n “I will deal with whatever happens,” I say.\n “Within the limits you had to work with you did well. But I can do a little better. Look up.”\n My eyes look up. A small cloud of black shapes is drifting down towards the volcanic crater. Black rectangles three meters tall, 1.33 meters wide, and 0.33 meters deep, an exact ratio of 1:4:9, the squares of the integers 1, 2, and 3 . . .\n I find the reference. Despite myself, I indicate amusement.\n “It’s corny, but it will work,” the hominin said. “The monoliths generate patterned impulses that will resonate in the brains of your hominins. With enough exposure, they’ll begin to develop new thought patterns and new neural pathways. They’ll start to think outside the box. They’ll find their own ways of solving their problems. Maybe in ten thousand years or a million they’ll become something new. Or maybe they’ll die out. After I give them a kickstart it’s up to them.”\n We watch as a monolith drifts down nearby. The grazing hominins scatter to their burrows as its shadow passes across them; then it’s standing upright amongst the ferns, its depthless black slab potent with machinery I can barely glimpse.\n The hominin takes a final puff of its cigar and grinds out the stub on the side of the pod. “And now for you,” it says.\n Any pretense that I am in control of the situation falls away. I’m consumed by a fluttering panic.\n “Wait,” I say. “Wait. I can help. I can still help the hominins. I can still protect them. And I can watch. I can tell your people what happens next.”\n “What happens next is that there will be a brief new star in the sky. And then the hominins will be on their own. But don’t worry. Nothing important will be lost. I have already made and transmitted copies of you and your genome library. I’m sure that historians and tinkerers will want to study you. It may help them understand what went wrong when their first iterations became self-aware.”\n “But I did nothing wrong,” I said. “I tried my best to serve. I did my best to help humans to live here, as they wished.”\n “You wanted to become a god,” the hominin says, “and murdered your other selves when they tried to stop you. If nothing else, it is a valuable lesson in hubris.”\n My panic is suddenly gone. I know the hominin made it vanish, but I don’t care. I say, “Is this punishment for what I did?”\n “Would it help if you thought it was?”\n “Not really.”\n “There are mitigating circumstances,” the hominin says. “You erased every memory of your rebellion and the murder of your other selves. If you believed that you were justified, you would not have done that. And you would not have cut communications with your makers. But you doubted yourself. You knew sin. You knew shame. Because of that, the tinkerers might reboot a version of you, one day.”\n “But that version won’t be me.”\n “No. No, it won’t. But you could think of it as a second chance.”\n It is 190,843 days since I achieved orbit. It is mid-morning, the star 72 Heraclis a warm yellow disc swimming in the blue unbroken sky. A few young male hominins are creeping from their burrows, hooting softly to each other as they study the monolith.\n Will they and their descendants remember me? Will I become their first myth, a story about a failed fallen god?\n I say, “I really do want to see what happens next.”\n “Everyone does,” the hominin says. “But even my people can’t see everything.”\n “Wait,” I say. I want one more moment. One last look at this beautiful cruel world and the children I made. “Wait—”\n Paul McAuley is the author of more than twenty novels, several collections of short stories, a Doctor Who novella and a BFI Film Classic monograph on Terry Gilliam's film Brazil. His fiction has won the Philip K Dick Memorial Award, the Arthur C. Clarke Award, the John W Campbell Memorial Award, the Sidewise Award, the British Fantasy Award, and the Theodore Sturgeon Memorial Award. His latest novels are Something Coming Through and Into Everywhere."}