{"fingerprint": "1+q9uMa5w9WsRytxnC2iNNC9FFs=", "sitename": "Clarkesworld Magazine", "title": "Tetris Dooms Itself by Meghan McCarron", "author": "Meghan McCarron", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mccarron_08_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tetris Dooms Itself by Meghan McCarron", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3300 words, short story\nTetris Dooms Itself\nAndy kidnaps me at 11:12 PM. I see the time on my microwave. He clamps a hand over my mouth while I’m making a pot of coffee, and I scatter the grounds all over the floor. It’s late, and I have work to do, but that doesn’t matter now. “I have a gun,” he says in a movie-villain voice. He forces a blindfold over my eyes. I giggle.\nWhen I go to see Catherine, she cuts off my hands. She likes to take off the left one first because it’s more useful to me. She uses a hunting knife that she’s never sharpened, and when she saws into my wrist she hisses, “Sinister! Sinister!”\nWhen I first came home with a bloody stump, my roommates shrieked, What did she do to you? Now they roll their eyes and go back to playing Scrabble. They like Andy better. It takes a lot of effort to kidnap someone, they say.\nUsually Andy kidnaps me at some bright sunny hour when his wife is at work. But tonight she is sick, “from stress, mostly,” he says. Also from the flu. “She looked so sad tonight,” he says. “So sick and sad.” He tells me this as he tightens my blindfold, and then waves his hands in front of my face to make sure I can’t see. Air fans my cheeks.\nHe takes my hand, then changes his mind and takes my wrist instead. He pauses at the door, checking for roommates; the apartment is silent, though sometimes roommates are just hiding. He leads me out the door and down my creaking stairs to a car. It’s not his car; it smells new, or fake-new, a smell achieved only through the relentless application of cleaning products. The seat fabric feels cheap to the touch and the anemic motor sputters and kicks. A rental. Economy size, if I had to guess.\nHe buckles me in and says, “Now you’re mine,” but in Andy-voice, not movie-villain voice, leaving me unsure how to take the line.\nOnce my roommate Marcia came home with a hunting trap clamped on her leg. We heard her coming all the way up the stairs, step CLANK step CLANK step CLANK. She said she and her boyfriend were playing cops and robbers in the woods, and she stepped in the wrong place. No one asked why her boyfriend didn’t help her home. Other roommates whispered that he must have been the robber. I was not convinced. At the very least, he must have caught her cheating.\nAndy and I drive for a long time, probably in circles, since Andy barely leaves this neighborhood. Not that I blame him—things get weird further out. There’s downtown and mountains and a desert, somewhere. While we drive, he tells me about his latest career developments. He has an agent now, or is it a manager? I don’t understand the music business. I thought it was better than the writer and his prizes, or the lawyer and her golf tournaments, but now they all sound the same.\nI ask Andy about his music, instead. To him it’s a color or a smell or even a different kind of sound, like bees or sandpaper. I love when Andy talks like this. His voice is the color of mahogany. I forget I can’t see where we’re going.\nThe car rolls to a stop on what sounds like gravel. My calm breaks, and I clutch my hands on my knees. Why am I nervous? Andy gets out without a word and opens my door. The night air is sharp; it smells like forest fires.\nEvery time Catherine cuts off my hands, they come back smaller, so when Andy takes my hand in his I feel engulfed. I smell rust, and something chemical, in addition to the faint tang of burning wood. It’s the smell of the river. I wish I could take off my blindfold, because I love staring at the river’s concrete expanse, but I’m pretty sure the blindfold is a rule.\nAndy pulls me toward him and kisses me, hard; if someone could hit someone else with their mouth, it would feel like this. He shoves me away and takes off at a run. His footsteps fade, PAT PAT Pat Pat pat pat patpat . . . and I’m out in the open, alone.\n“Bet you can’t find me!” Andy calls.\n“Andy, is this blind man’s bluff?” I say. “That’s so lame.”\nHe shoots his gun off, which until now I didn’t believe he had, and I realize it’s something a little different.\nOnce, Catherine and I tried to have sex. She bit my nipple so hard I yelped; it took me days to find her clit. There were snippets that approached loveliness, and I could maybe see why people fumbled towards the good parts. But I could still taste her in my mouth when she turned to me and said, “Let’s never do that again.”\nAndy and I have fucked on any number of occasions, but we always set rules ahead of time.\nAndy is shouting and shooting at the same time, which is half annoying and half terrifying. I thought he said, “Take off your shoes,” but when I did he just started shooting again. I throw myself on the ground until he figures out what he wants from this game.\nThe shooting stops.\n“Goddamnit! Get up!” Andy shouts.\n“I can’t—understand—you!” I shout back.\n“Oh,” Andy says. Then he gets gruff again. “Take off your shirt!”\nI half-heartedly throw my shirt off and hold my arms against my cold, naked skin. Andy likes strip games. I don’t. I thought he had a better idea than this.\nI’m still on my knees, half-naked, when one of the bullets hits me in the shoulder. The pain explodes outward from the point of impact, I am cold with it, then nothing, then hot hot hot.\nI pop the bullet out of my wound—they were cheater bullets, thank god—and hurl it at Andy. It clatters on the gravel. “Fuck you!” I cry. There is a moment of silence as I double over, panting with pain. Just my breath, my heaving chest, pant pant pant. It is gorgeous, this silence. It is such a relief.\n“Fuck you,” Andy says, and starts shooting again.\nThe first time Catherine cut off my hands, it was to free me from handcuffs. I was chained to her refrigerator and we wanted beer. We could have picked the lock, or dislocated my thumbs, but those methods seemed too obvious. Which is funny, because cutting off my hands is really obvious.\nThe hunting knife was sharp then, left over from a knife-throwing game with one of Catherine’s exes. When it cut into my skin, pain welled like pleasure. The sensation built as Catherine sliced through muscle and tendon, cracked through bone. When my hand dropped to the ground, I saw white light. I screamed.\nNow the pain is ragged, the relief the barest break. I grunt. I’ve begged her to sharpen the knife, or to get a new one, but she insists that the knife is a rule. My forsaking pleasure is a rule, too. Someday, if she gets her way, it’s just going to hurt.\nWhen all my clothes are gone, I throw myself on the ground again, by the car. The gravel is gritty against my bare skin. The little pebbles against my nipples are strange and uncomfortable, but uncomfortable like lace panties, not like splinters, or the cuts on my feet. Despite this, I don’t feel remotely turned on.\nThe tall, dead grass rustles.\n“Aw, baby, look at you,” Andy says. “Stand up.”\nI pull myself up, and the cool air shocks my bare skin. I hear the wind again. I touch the wound on my shoulder and clean away the gravel, though I let the stones stick to the rest of me. I feel covered, that way.\nAndy takes a few steps towards me, and I can feel the edges of his heat, his halo. His breath washes over my forehead, and his clothing whispers as he takes his gun out of his pocket.\n“You’re all dirty,” he says, like I’m a little girl, brushing the gravel off my breasts. His fingers are light and loving. They flick the gravel off with ease.\nI imagine what we must look like, a naked, blindfolded woman and a clothed man standing in the dead grass. I try to imagine his wife standing here instead of me and almost laugh. I wish I understood why I’m the one who can be blindfolded, stripped, and shot, and then gently cleaned—gently kissed. The standard answer is that wives are boring, but I don’t buy that. Wives will kick your ass if you give them the chance.\nBut if you shoot your wife, you have to listen to her toss and turn because her shoulder aches. Or you have to wonder if she’ll pull a gun on you at breakfast. Andy can walk away from me. So maybe the real question is—what about me makes it so easy to walk away?\nHe puts the gun against my back and prods me. “Let’s go,” he whispers in my ear. His voice is warm and, again, I’m not sure how to take the line.\nEveryone plays the same game. I’m not just talking about the trends that go around—cartwheel contests, speed eating, naked relay races. Those games are sham games, fakes for people with nothing better to do. But when you find a naked roommate giggling to herself outside your building for the fourth time in a month, and she’s not even running with a baton, or running at all, it’s more like a jog, you get suspicious. If you can play a sham game wrong and it still gets called a game, what the hell kind of system is this?\nI march barefoot towards the sounds of whirring generators and rustling trees. I step on metal, on glass. My feet must be a bloody mess.\n“I didn’t do too good at this game,” I said. “Did I?” It’s a canned line. One he likes. I want to please him, suddenly.\n“No, you didn’t,” Andy says. The gun is getting warm from being pushed against my skin. The sound of rustling is actually water rushing. Where is the water coming from? It builds as we walk towards it, until I lose the sound of my footsteps, of Andy’s footsteps, of anything but this impossible sound.\nHe puts a hand on my shoulder and pulls me to a stop. The sound roars below me. It has to be the wind, whistling through the concrete. I can smell the forest fires again.\n“What now?” I say.\n“Take off your blindfold.”\nI’m standing on the edge of the concrete wall, where I expected to see ancient graffiti, cracked concrete, slow, dirty water. Instead, a river rushes below me, dark except for where the moon is reflected in a distorted circle. The river is deeper than the channel ever was, like the concrete was ripped up to expose a secret below. It smells like acid rain.\n“Jump in,” Andy says.\nI look over my shoulder so fast I almost fall. “What?” I say.\nAndy softens his tone and puts a hand on my ass, cupping it like it’s his favorite thing in the world. “Come on, baby. Jump in.”\n“That’s not even supposed to be here,” I said.\n“I found it last night. A friend sent me photos.” He gazed at it, the midnight-dark water, the splotches of electric light.\n“You’re not jumping in?” I say.\n“Baby,” he says, patting my ass. “You lost the game.”\nThe river can’t be real, and yet it looks more solid, more dangerous, than anything that is. The second-to-last thing I’m doing is wasting the river on Andy, and the last is getting shot in the gut for refusing to jump in.\nI turn around and snatch the gun from Andy’s hand.\nI have always known I could do this, but from the look on Andy’s face he hasn’t. He gapes at the gun like I pulled it out of thin air.\n“You jump in,” I say.\n“Me?” he says.\n“You’re the loser now.”\nAndy’s face collapses, then hardens into a glower. “You cheated.”\nI have cheated. If he walks away, I’ll let him.\n“I changed the game,” I say.\nHe looks down at his shoes, screwing up his face like this is a huge problem, one that takes mighty effort to solve. He shifts back and forth on his feet and screws up his face. I keep the gun pointed at him. I’m still cold.\nHe bends down and unties his shoes. He removes his pants, shirt, shocks. He climbs up on the wall next to me and looks out on the river with his hands on his hips, like it’s his newly conquered domain. Like I’m not even there. The gun is close enough for him to snatch back, but he doesn’t even look at it. He just stands there, staring at the water.\nI thought snatching the gun would make it like on of those childhood games, where I grant myself invisibility so he gives himself invisibility goggles, I call lightening so he turns himself to metal—perpetual one-upmanship until one of us runs out of ideas. Andy stares down the river, naked and silent. Every so often he shuffles his feet, or peers down farther, as if readying to jump that never comes. My hand aches from holding the gun, and the cuts on my feet burn. Andy ignores me, frozen between fear of the river and fear of not finishing the game. Is he out of ideas?\nI keep telling myself a little longer, just stay a little longer, but finally I give in. I hunt and gather my clothes from the scrubby field; Andy is still standing on the ledge when I finish. I dress behind him, shaking the dirt off my underwear, easing my shirt over my bloody shoulder. Andy twitches once or twice, but otherwise does not move. I force my bloody feet into their shoes.\nI pick up Andy’s pants from the pile of clothes and fish out the car keys. I jingle them, to see if that catches his attention. He peers down into the rushing water again. I think about climbing up on the ledge with him to see what he’s looking at, even bending my knees, diving in. But I called bullshit on the game, and it felt wrong to step back in.\nI looked back at him, once, on my way to the car. He raised a hand. At first, I thought he was waving me back, and I stopped in my tracks. He was waving goodbye.\nI take the rental car back to Andy’s house on the east side of town. He lives in an ancient craftsman bungalow with a long low porch and two giant palm trees in the front yard. I walk in the screen door and find his wife playing Tetris, crumpled tissues surrounding her in white clumps. I try to introduce myself, but when I open my mouth she rolls her eyes and thrusts the other controller in my direction. I sit down next to her on the couch and play at manipulating shapes, finding a place for everything. Andy’s wife kicks my ass at this, but that’s kind of the point.\nAround three AM, Andy comes in. He’s sopping wet and, weirdly, drunk.\n“I got cold,” he says, as if this was an explanation.\nHe shuffles into the kitchen before I can even open my mouth. His wife doesn’t look away from Tetris, as if her husband shows up soaked and wasted on a regular basis. He comes back with three beers and hands them out. I have ignored my side of the game, and bricks are choking the top of my screen.\nAndy looks as if he’s undergone a religious conversion. Perhaps it’s just the wetness, my mind adding in a false baptismal glow. Did he really go in? My whole conception of Andy changes, struggling to imagine him diving into the river, fighting the current, pulling himself ashore. But he had been naked, standing on that edge. I try to imagine him stepping down, putting clothes on, and getting back up. Maybe he was afraid of losing them?\nNo, Andy is still just Andy.\nHe plops down on the easy chair by the couch and, without a word, flips the TV off. My disaster Tetris, and his wife’s high score, disappear. We sit in silence. Not-new Andy, his sniffly wife, and me.\n“How was the water?” I say to him.\nAndy takes a sip of beer. “Excuse me?” he says, as if I was some rude stranger.\n“How was the river?” I repeat, trying to sound casual.\nAndy takes a swig of his beer and looks at the blank television. He takes on an expression he imagines is deep. “Real,” he says.\n“Oh really?” I said. “How’d you get back here, then?”\n“Wouldn’t you like to know,” Andy says.\n“A real river would chew you up and spit you out—”\nAndy looks away, as if ignoring me will make me disappear.\n“Do you know why he’s like this?” I say to his wife. She’s blowing her nose, and looks at me from behind her tissue. I take off my shoes, my socks, and show her my filthy, scabbing feet. I pull back my shirt, where the blood on my shoulder was starting to soak through. “He did this and then tried to get me to jump in this . . . river. Now he’s pretending like he went in, lying to us—”\n“I’m not lying!” Andy says.\n“Why in the hell are you clothes wet?”\n“I took them with me,” Andy says.\nHis wife stares at her husband. “What is she even doing here?” she says, guesturing at me with her controller.\n“Returning your car,” I say.\n“She stole it,” Andy says, as if this trumps anything I might say.\n“What did you do, rent one of the public showers?” I say. “Jump in the ocean? You kinda smell fishy—”\nHis wife groans and drops her controller. “I’m going up to bed,” she says, standing up. She leaves her pile of tissues on the couch.\nAndy’s head snaps up. “So am I,” he says, and gets up a little too fast. She looks at him like he’s crazy, but doesn’t say anything to deter him. He pretends to ignore the look. His wife walks a step ahead of him towards the stairs so she can’t see him following her. Their feet move in perfect unison up the stairs, step. step. step. Andy’s footsteps squelch. Neither of look down at me, once.\nThis was my cue to leave, but I stay on the couch. I turn the TV back on and watch Tetris bricks pile up on both our sides. I find it comforting to watch it play itself. When both sides clog up, I hit the controller with my least-cut toe to start another round.\nPlunk. Plunk. Plunk. Plunkplunk plunkplunkplunkplunk plunk. GAME OVER. Click.\nAndy and his wife start snoring upstairs; Tetris keeps dooming itself. I feel like an asshole. Why do I even care, if Andy lies? Why waste my time, barge in on his wife?\nI wonder if the river’s still there. I wonder if I could make myself jump. Would I float out somewhere, wet but still me, still here? Would I drown? Or would I dive for the dark, rushing water, and hit a dirty puddle on concrete?\nMeghan McCarron's work has recently appeared in Lady Churchill's Rosebud Wristlet, Strange Horizons, and Best American Fantasy. She has been a rare book wrangler, a Hollywood assistant, and a boarding school English teacher. She has just moved to Brooklyn, where she will be something else completely."}