{"fingerprint": "dPkE72kOsFqGkxy2YkRquttvWGU=", "sitename": "Clarkesworld Magazine", "title": "Black Holes, Artifacts, and Mysteries: A Conversation with Jack McDevitt by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcdevitt_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Black Holes, Artifacts, and Mysteries: A Conversation with Jack McDevitt by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nBlack Holes, Artifacts, and Mysteries: A Conversation with Jack McDevitt\nMixing archeology and mystery with science fiction makes for a heady and addictive reading experience. Jack McDevitt’s latest entry into his Alex Benedict series of novels, Octavia Gone, starts when an artifact goes missing from Gabe’s collection which leads the group to investigate the strange disappearance of a group of scientists from a space station orbiting a black hole.\nJack McDevitt is the author of over twenty novels and dozens of short stories. His two main series are the Alex Benedict Series and the The Academy Series. McDevitt has won numerous awards including the Nebula, Locus, Phoenix, and John W. Campbell awards. Octavia Gone, will be available from Saga Press May 7th.\nHow did you get into writing science fiction? I’ve heard that it happened in a movie theater in South Philadelphia. After a hiatus, what brought you back?\nI grew up in South Philadelphia. The movie theater was the Bell, about four blocks from home. When I was about five years old, my father took me to watch westerns and airplane films about World War I because we were still a year away from Pearl Harbor. They’ve all faded. All that remains in my memory are Flash Gordon and Buck Rogers. I loved them. Didn’t notice at the time that they traveled to other planets without an airlock or a washroom. I recall being unhappy though that Flash could find nothing better to do with Dr. Zarkov’s rocket ship than get into fights with Ming. I spent my time imagining what I would do with a rocket ship. So the reality was that the serials got me interested in astronomy as much as in SF.\nAI features prominently in Octavia Gone. What do you think of the current state of AI and where it might be headed?\nI hope that AIs won’t prove dangerous because, even if they do, I’ve no doubt we’ll continue to work on them. Anything we can make, we will, regardless of consequences. We don’t know yet whether we’ll be able to make true artificial intelligence, that is, machines that are self-aware. And I’m not sure how we’ll ever be able to run tests to determine the truth.\nIt’s apparent that throughout the series of Alex Benedict novels that you’re keenly interested in history. Are there any bits of history that have helped to inspire Octavia Gone?\nYes. But I can’t give that away without compromising the mystery.\nAfter a number of novels, what is it about Alex and Chase that keeps you coming back to the characters?\nThey’re fun. Alex’s mysteries were inspired by the adventures of Father Brown. Not the TV version, but as we see him in Chesterton’s stories. The mysteries he faces are odd: Why did a British general, famous for protecting the lives of his troops, go completely bonkers in one battle, charging every hill that the enemy controlled, resulting in a catastrophic loss of his troops? How did a guy in a room near the top of a skyscraper, with no other buildings nearby, come to die with an arrow through his heart? And so on. The issue in almost all of the stories, which unfortunately have not been picked up by the TV series, is always not so much a matter of identifying the murderer, but figuring out what on Earth had happened.\nDoes real life mimic your characters? Do you also collect antiquities? If so, what would be one dream artifact you’d like to have in your collection?\nI have an interest in history. Would love to have Thomas Jefferson’s pen or JFK’s PT boat.\nThe novels in this series occasionally switch character perspective. How do you choose either Alex or Chase to write from?\nActually, the only one in which Alex is the narrator is the first one, A Talent for War. I hadn’t intended to bring him back in other novels. A few years later, I had an idea for another Father Brown-style mystery, in which an interstellar with some wealthy tourists vanishes and is later found adrift and empty, in an area where there was no place they could have gone. It was an ideal setup for Alex, so I brought him back. But I needed a character who would ask the questions that were in the reader’s mind. The same purpose that Watson serves. So I brought Chase back as well. And of course to fulfill that purpose she automatically became the narrator, a role in which she has served in each of the other novels. I should mention there was also Infinity Beach, a novel that appeared between the first two. It was also a mystery that Father Brown would have enjoyed taking on if he’d had an interstellar. And I realized belatedly that it would have been a perfect fit for Alex Benedict.\nThe science within your novels is clearly well researched. Considering the location of the space station Octavia when it disappears, what are your thoughts about the recent image of a black hole taken by the Event Horizon Telescope?\nI got lucky. It looks pretty much like the object described in the book. Over the years I’ve gotten a lot of support on the science, especially from David DeGraff and Walter Cuirle.\nWhat project are you working on next?\nI’m finishing a short story in which Gregory MacAllister, the explosive newspaper columnist from the Academy novels, is the lead character. When that’s done, I’m going to take some time off, read, do a 2,000-piece jigsaw puzzle that just arrived for my birthday, and sleep. I suspect that in the meantime, another plotline will show up.\nWhat does your writing process look like?\nI set a target each day, usually about a thousand words. Or possibly a scene or two. I don’t think in terms of starting at nine and working until, say, three o’clock. If I do that, I spend a lot of time stalling, looking out my window at cardinals and squirrels. Instead, I set an objective, and when I reach it, I quit and watch TV or just relax.\nWhat is one piece of writing advice that you’ve been given that has stuck with you throughout your career?\nKeep writing. Don’t take a couple of years off. We need to keep our readers interested and happy. So produce some output.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}