{"fingerprint": "SKQzb3r5BJkG5qtt0ICi2uZe3dc=", "sitename": "Clarkesworld Magazine", "title": "An Eligible Boy by Ian McDonald", "author": "Ian McDonald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcdonald_11_16_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Eligible Boy by Ian McDonald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10950 words, novelette, REPRINT\nAn Eligible Boy\nA robot is giving Jasbir the whitest teeth in Delhi. It is a precise, terrifying procedure involving chromed steel and spinning, shrieking abrasion heads. Jasbir’s eyes go wide as the spidery machine-arms flourish their weapons in his face, a demon of radical dentistry. He read about the Glinting Life! Cosmetic Dentistry Clinic, (Hygienic, Quick and Modern) in the February edition of Shaadi! for Eligible Boys. In double-page spread it looked nothing like these insect-mandibles twitching inside his mouth. He’d like to ask the precise and demure dental nurse (married, of course) if it’s meant to be like this but his mouth is full of clamps and anyway an Eligible Boy never shows fear. But he closes his eyes as the robot reaches in and spinning steel hits enamel.\nNow the whitest teeth in Delhi dart through the milling traffic in a rattling phatphat. He feels as if he is beaming out over an entire city. The whitest teeth, the blackest hair, the most flawless skin, and perfectly plucked eyebrows. Jasbir’s nails are beautiful. There’s a visiting manicurist at the Ministry of Waters, so many are the civil servants on the shaadi circuit. Jasbir notices the driver glancing at his blinding smile. He knows; the people on Mathura Road know, all Delhi knows that every night is great game night.\nOn the platform of Cashmere Café metro station, chip-implanted police-monkeys canter, shrieking, between the legs of passengers, driving away the begging, tugging, thieving macaques that infest the subway system. They pour over the edge of the platform to their holes and hides in a wave of brown fur as the robot train slides in to the stop. Jasbir always stands next to the Women Only section. There is always a chance one of them might be scared of the monkeys—they bite—and he could then perform an act of Spontaneous Gallantry. The women studiously avoid any glance, any word, any sign of interest but a true Eligible Boy never passes up a chance for contact. But that woman in the business suit, the one with the fashionable wasp-waist jacket and the low-cut hip-riding pants, was she momentarily dazzled by the glint of his white white teeth?\n“A robot, madam,” Jasbir calls as the packer wedges him into the 18:08 to Barwala. “Dentistry of the future.” The doors close. But Jasbir Dayal knows he is a white-toothed Love God and this, this will be the shaadi night he finally finds the wife of his dreams.\nEconomists teach India’s demographic crisis as an elegant example of market failure. Its seed germinated in the last century, before India became Tiger of Tiger economies, before political jealousies and rivalries split her into twelve competing states. A lovely boy, was how it began. A fine, strong, handsome, educated, successful son, to marry and raise children and to look after us when we are old. Every mother’s dream, every father’s pride. Multiply by the three hundred million of India’s emergent middle class. Divide by the ability to determine sex in the womb. Add selective abortion. Run twenty-five years down the x-axis, factoring in refined, twenty-first century techniques such as cheap, powerful pharma patches that ensure lovely boys will be conceived and you arrive at great Awadh, its ancient capital Delhi of twenty million and a middle class with four times as many males as females. Market failure. Individual pursuit of self-interest damages larger society. Elegant to economists; to fine, strong, handsome, educated, successful young men like Jasbir caught in a wife-drought, catastrophic.\nThere’s a ritual to shaadi nights. The first part involves Jasbir in the bathroom for hours playing pop music too loud and using too much expensive water while Sujay knocks and leaves copious cups of tea at the door and runs an iron over Jasbir’s collars and cuffs and carefully removes the hairs of previous shaadis from Jasbir’s suit jacket. Sujay is Jasbir’s house mate in the government house at Acacia Bungalow Colony. He’s a character designer on the Awadh version of Town and Country, neighbor-and-rival Bharat’s all-conquering artificial intelligence generated soap opera. He works with the extras, designing new character skins and dropping them over raw code from Varanasi. Jahzay Productions is a new model company, meaning that Sujay seems to do most of his work from the verandah on his new-fangled lighthoek device, his hands drawing pretty, invisible patterns on air. To office-bound Jasbir, with a ninety-minute commute on three modes of transport each way each day, it looks pretty close to nothing. Sujay is uncommunicative and hairy and neither shaves nor washes his too-long hair enough but his is a sensitive soul and compensates for the luxury of being able to sit in the cool cool shade all day waving his hands by doing housework. He cleans, he tidies, he launders. He is a fabulous cook. He is so good that Jasbir does not need a maid, a saving much to be desired in pricey Acacia Bungalow Colony. This is a source of gossip to the other residents of Acacia Bungalow Colony. Most of the goings-on in Number 27 are the subject of gossip over the lawn sprinklers. Acacia Bungalow Colony is a professional, family gated community.\nThe second part of the ritual is the dressing. Like a syce preparing a Mughal lord for battle, Sujay dresses Jasbir. He fits the cufflinks and adjusts them to the proper angle. He adjusts the set of Jasbir’s collar just so. He examines Jasbir from every angle as if he is looking at one of his own freshly-fleshed characters. Brush off a little dandruff here, correct a desk-slumped posture there. Smell his breath and check the teeth for lunch-time spinach and other dental crimes.\n“So what do you think of them then?” Jasbir says.\n“They’re white,” grunts Sujay.\nThe third part of the ritual is the briefing. While they wait for the phatphat, Sujay fills Jasbir in on upcoming plot lines on Town and Country. It’s Jasbir’s major conversational ploy and advantage over his deadly rivals; soap-opera gossip. In his experience what the women really want is gupshup from the meta-soap, the no-less-fictitious lives and loves and marriages and rows of the aeai actors that believe they are playing the roles in Town and Country. “Auh,” Sujay will say. “Different department.”\nThere’s the tootle of phatphat horns. Curtains will twitch, there will be complaints about waking up children on a school night. But Jasbir is glimmed and glammed and shaadi-fit. And armed with soapi gupshup. How can he fail?\n“Oh, I almost forgot,” Sujay says as he opens the door for the God of Love. “Your father left a message. He wants to see you.”\n“You’ve hired a what?” Jasbir’s retort is smothered by the cheers of his brothers from the living room as a cricket ball rolls and skips over the boundary rope at Jawaharlal Nehru Stadium. His father bends closer; confidentially across the tiny tin-topped kitchen table. Anant whisks the kettle off the boil so she can overhear. She is the slowest, most awkward maid in Delhi but to fire her would be to condemn an old woman to the streets. She lumbers around the Dayal kitchen like a buffalo, feigning disinterest.\n“A matchmaker. Not my idea, not my idea at all; it was hers.” Jasbir’s father inclines his head toward the open living room door. Beyond it, enthroned on her sofa amidst her non-eligible boys, Jasbir’s mother watches the test match of the smart-silk wallscreen Jasbir had bought her with his first civil service paycheck. When Jasbir left the tiny, ghee-stinky apartment on Nabi Karim Road for the distant graces of Acacia Bungalow Colony, Mrs. Dayal delegated all negotiations with her wayward son to her husband. “She’s found this special matchmaker.”\n“Wait wait wait. Explain to me special.”\nJasbir’s father squirms. Anant is taking a long time to dry a tea-cup.\n“Well, you know in the old days people would maybe have gone to a hijra . . . Well, she’s updated it a bit, this being the twenty first century and everything, so she’s, ah, found a nute.”\nA clatter of a cup hitting a stainless steel draining board.\n“A nute?” Jasbir hisses.\n“He knows contracts. He knows deportment and proper etiquette. He knows what women want. I think he may have been one, once.”\nAnant lets out an aie!, soft and involuntary as a fart.\n“I think the word you’re looking for is ‘yt’,” Jasbir says. “And they’re not hijras the way you knew them. They’re not men become women or women become men. They’re neither.”\n“Nutes, neithers, hijras, yts, hes, shes; whatever; it’s not as if I even get to take tea with the parents let alone see an announcement in the shaadi section in the Times of Awadh.” Mrs. Dayal shouts over the burbling commentary to the second Awadh-China Test. Jasbir winces. Like paper cuts, the criticisms of parents are the finest and the most painful.\nInside the Haryana Polo and Country Club the weather was raining men snowing men hailing men. Well-dressed men, moneyed men, charming men, groomed and glinted men, men with prospects all laid out in their marriage resumés. Jasbir knew most of them by face. Some he knew by name, a few had passed beyond being rivals into becoming friends.\n“Teeth!” A cry, a nod, a two-six-gun showbiz point from the bar. There leaned Kishore, a casual lank of a man draped like a skein of silk against the Raj-era mahogany. “Where did you get those, badmash?” He was an old university colleague of Jasbir’s, much given to high profile activities like horse racing at the Delhi Jockey Club or skiing, where there was snow left on the Himalayas. Now he was in finance and claimed to have been to five hundred shaadis and made a hundred proposals. But when they were on the hook, wriggling, he let them go. Oh, the tears, the threats, the phone calls from fuming fathers and boiling brothers. It’s the game, isn’t it? Kishore rolls on, “Here, have you heard? Tonight is Deependra’s night. Oh yes. An astrology aeai has predicted it. It’s all in the stars, and on your palmer.”\nDeependra was a clenched wee man. Like Jasbir he was a civil servant, heading up a different glass-partitioned workcluster in the Ministry of Waters: Streams and Watercourses to Jasbir’s Ponds and Dams. For three shaadis now he had been nurturing a fantasy about a woman who exchanged palmer addresses with him. First it was call, then a date. Now it’s a proposal.\n“Rahu is in the fourth house, Saturn in the seventh,” Deependra said lugubriously. “Our eyes will meet, she will nod—just a nod. The next morning she will call me and that will be it, done, dusted. I’d ask you to be one of my groomsmen, but I’ve already promised them all to my brothers and cousins. It’s written. Trust me.”\nIt is a perpetual bafflement to Jasbir how a man wedded by day to robust fluid accounting by night stakes love and life on an off-the-shelf janampatri artificial intelligence.\nA Nepali chidmutgar banged a staff on the hardwood dance floor of the exclusive Haryana Polo and Country Club. The Eligible Boys straightened their collars, adjusted the hang of their jackets, aligned their cufflinks. This side of the mahogany double doors to the garden they were friends and colleagues. Beyond it they were rivals.\n“Gentlemen, valued clients of the Lovely Girl Shaadi Agency, please welcome, honor, and cherish the Begum Rezzak and her Lovely Girls!”\nTwo attendants slid open the folding windows on to the polo ground. There waited the lovely girls in their saris and jewels and gold and henna (for the Lovely Girl Agency is a most traditional and respectable agency). Jasbir checked his schedule—five minutes per client, maybe less, never more. He took a deep breath and unleashed his thousand-rupee smile. It was time to find a wife.\n“Don’t think I don’t know what you’re muttering about in there,” Mrs. Dayal called over the mantra commentary of Harsha Bhogle. “I’ve had the talk. The nute will arrange the thing for much less than you are wasting on all those shaadi agencies and databases and nonsense. No, nute will make the match that is it stick stop stay.” There is a spatter of applause from the Test Match.\n“I tell you your problem: a girl sees two men sharing a house together, she gets ideas about them,” Dadaji whispers. Anant finally sets down two cups of tea and rolls her eyes. “She’s had the talk. Yt’ll start making the match. There’s nothing to be done about it. There are worse things.”\nThe women may think what they want, but Sujay has it right, Jasbir thinks. Best never to buy into the game at all.\nAnother cheer, another boundary. Haresh and Sohan jeer at the Chinese devils. Think you can buy it in and beat the world, well, the Awadhi boys are here to tell you it takes years, decades, centuries upon centuries to master the way of cricket. And there’s too much milk in the tea.\nA dream wind like the hot gusts that fore-run the monsoon sends a spray of pixels through the cool white spacious rooms of 27 Acacia Avenue Bungalows. Jasbir ducks and laughs as they blow around him. He expects them to be cold and sharp as wind-whipped powder snow but they are only digits, patterns of electrical charge swept through his visual cortex by the clever little device hooked behind his right ear. They chime as they swirl past, like glissandos of silver sitar notes. Shaking his head in wonder, Jasbir slips the lighthoek from behind his ear. The vision evaporates.\n“Very clever, very pretty but I think I’ll wait until the price comes down.”\n“It’s, um, not the hoek,” Sujay mutters. “You know, well, the matchmaker your mother hired. Well, I thought, maybe you don’t need someone arranging you a marriage.” Some days Sujay’s inability to talk to the point exasperates Jasbir. Those days tend to come after another fruitless and expensive shaadi night and the threat of matchmaker but particularly after Deependra of the non-white teeth announces he has a date. With the girl. The one written in the fourth house of Rahu by his pocket astrology aeai. “Well, you see I thought, with the right help you could arrange it yourself.” Some days debate with Sujay is pointless. He follows his own calendar. “You, ah, need to put the hoek back on again.”\nSilver notes spray through Jasbir’s inner ears as the little curl of smart plastic seeks out the sweet spot in his skull. Pixel birds swoop and swarm like starlings on a winter evening. It is inordinately pretty. Then Jasbir gasps aloud as the motes of light and sound sparklingly coalesce into a dapper man in an old-fashioned high-collar sherwani and wrinkle-bottom pajamas. His shoes are polished to mirror-brightness. The dapper man bows.\n“Good morning sir. I am Ram Tarun Das, Master of Grooming, Grace, and Gentlemanliness.”\n“What is this doing in my house?” Jasbir unhooks the device beaming data into his brain.\n“Er, please don’t do that,” Sujay says. “It’s not aeai etiquette.”\nJasbir slips the device back on and there he is, that charming man.\n“I have been designed with the express purpose of helping you marry a suitable girl,” says Ram Tarun Das.\n“Designed?”\n“I, ah, made him for you,” says Sujay. “I thought that if anyone knows about relationships and marriages, it’s soap stars.”\n“A soap star. You’ve made me a, a marriage life-coach out of a soap star?”\n“Not a soap star exactly, more a conflation of a number of sub-systems from the central character register,” Sujay says. “Sorry Ram.”\n“Do you usually do that?”\n“Do what?”\n“Apologize to aeais.”\n“They have feelings too.”\nJasbir rolls his eyes. “I’m being taught husbandcraft by a mash-up.”\n“Ah, that is out of order. Now you apologize.”\n“Now then, sir, if I am to rescue you from a marriage forged in hell, we had better start with manners,” says Ram Tarun Das. “Manners maketh the man. It is the bedrock of all relationships because true manners come from what he is, not what he does. Do not argue with me, women see this at once. Respect for all things, sir, is the key to etiquette. Maybe I only imagine I feel as you feel, but that does not make my feelings any less real to me. So this once I accept your apology as read. Now, we’ll begin. We have so much to do before tonight’s shaadi.”\nWhy, Jasbir thinks, why can I never get my shoes like that?\nThe lazy crescent moon lolls low above the out-flarings of Tughluk’s thousand stacks; a cradle to rock an infant nation. Around its rippling reflection in the infinity pool bob mango-leaf diyas. No polo grounds and country clubs for Begum Jaitly. This is 2045, not 1945. Modern style for a modern nation, that is philosophy of the Jaitly Shaadi Agency. But gossip and want are eternal and in the mood lighting of the penthouse the men are blacker-than-black shadows against greater Delhi’s galaxy of lights and traffic.\n“Eyebrows!” Kishore greets Jasbir with TV-host pistol-fingers two-shot bam bam. “No seriously, what did you do to them?” Then his own eyes widen as he scans down from the eyebrows to the total product. His mouth opens, just a crack, but wide enough for Jasbir to savor an inner fist-clench of triumph.\nHe’d felt self-conscious taking Ram Tarun Das to the mall. He had no difficulty accepting that the figure in its stubbornly atavistic costume was invisible to everyone but him (though he did marvel at how the aeai avoided colliding with any other shopper in thronged Centerstage Mall). He did feel stupid talking to thin air.\n“What is this delicacy?” Ram Tarun Das said in Jasbir’s inner ear. “People talk to thin air on the cell phone all the time. Now this suit, sir.”\nIt was bright, it was brocade, it was a fashionable retro cut that Jasbir would have gone naked rather than worn.\n“It’s very . . . bold.”\n“It’s very you. Try it. Buy it. You will seem confident and stylish without being flashy. Women cannot bear flashy.”\nThe robot cutters and stitchers were at work even as Jasbir completed the card transaction. It was expensive. Not as expensive as all the shaadi memberships, he consoled himself. And something to top it off. But Ram Tarun Das manifested himself right in the jeweler’s window over the display.\n“Never jewelry on a man. One small brooch at the shirt collar to hold it together, that is permissible. Do you want the lovely girls to think you are a Mumbai pimp? No, sir, you do not. No to jewels. Yes to shoes. Come.”\nHe had paraded his finery before a slightly embarrassed Sujay.\n“You look, er, good. Very dashing. Yes.”\nRam Tarun Das, leaning on his cane and peering intensely, said, “You move like a buffalo. Ugh, sir. Here is what I prescribe for you. Tango lessons. Passion and discipline. Latin fire, yet the strictest of tempos. Do not argue, it is the tango for you. There is nothing like it for deportment.”\nThe tango, the manicures, the pedicures, the briefings in popular culture and Delhi gossip (“soap opera insults both the intelligence and imagination, I should know, sir”), the conversational ploys, the body language games of when to turn so, when to make or break eye contact, when to dare the lightest, engaging touch. Sujay mooched around the house, even more lumbering and lost than usual, as Jasbir chatted with air and practiced Latin turns and drops with invisible partner. Last of all, on the morning of the Jaitly shaadi.\n“Eyebrows sir. You will never get a bride with brows like a hairy saddhu. There is a girl not five kilometers from here, she has a moped service. I’ve ordered her, she will be here within ten minutes.”\nAs ever, Kishore won’t let Jasbir wedge an answer in, but rattles on, “So, Deependra then?”\nJasbir has noticed that Deependra is not occupying his customary place in Kishore’s shadows; in fact he does not seem to be anywhere in this penthouse.\n“Third date,” Kishore says, then mouths it again silently for emphasis. “That janampatri aeai must be doing something right. You know, wouldn’t it be funny if someone took her off him? Just as a joke, you know?”\nKishore chews his bottom lip. Jasbir knows the gesture of old. Then bells chime, lights dim and a wind from nowhere sends the butter-flames flickering and the little diyas flocking across the infinity pool. The walls have opened, the women enter the room.\nShe stands by the glass wall looking down into the cube of light that is the carpark. She clutches her cocktail between her hands as if in prayer or concern. It is a new cocktail designed for the international cricket test, served in an egg-shaped goblet made from a new spin-glass that will always self-right, no matter how it is set down or dropped. A Test of Dragons is the name of the cocktail. Good Awadhi whisky over a gilded syrup with a six-hit of Chinese Kao Liang liqueur. A tiny red gel dragon dissolves like a sunset.\n“Now, sir,” whispers Ram Tarun Das standing at Jasbir’s shoulder. “Faint heart, as they say.”\nJasbir’s mouth is dry. A secondary application Sujay pasted onto the Ram Tarun Das aeai tells him his precise heart rate, respiration, temperature, and the degree of sweat in his palm. He’s surprised he’s still alive.\nYou’ve got the entry lines, you’ve got the exit lines, and the stuff in the middle Ram Tarun Das will provide.\nHe follows her glance down into the carpark. A moment’s pause, a slight inclination of his body towards hers. That is the line.\nSo, are you a Tata, a Mercedes, a Li Fan, or a Lexus? Ram Tarun Das whispers in Jasbir’s skull. He casually repeats the line. He has been rehearsed and rehearsed and rehearsed in how to make it sound natural. He’s as good as any newsreader, better than those few human actors left on television.\nShe turned to him, lips parted a fraction in surprise.\n“I beg your pardon?”\nShe will say this, Ram Tarun Das hints. Again, offer the line.\n“Are you a Tata, a Mercedes, a Li Fan, or a Lexus?”\n“What do you mean?”\n“Just pick one. Whatever you feel, that’s the right answer.”\nA pause, a purse of the lips. Jasbir subtly links his hands behind his back, the better to hide the sweat.\n“Lexus,” she says. Shulka, her name is Shulka. She is a twenty-two year-old marketing graduate from Delhi U working in men’s fashion, a Mathur—only a couple of caste steps away from Jasbir’s folk. The Demographic Crisis has done more to shake up the tiers of varna and jati than a century of the slow drip of democracy. And she has answered his question.\n“Now, that’s very interesting,” says Jasbir.\nShe turns, plucked crescent-moon eyebrows arched. Behind Jasbir, Ram Tarun Das whispers, now, the fetch.\n“Delhi, Mumbai, Kolkata, Chennai?”\nA small frown now. Lord Vishnu, she is beautiful.\n“I was born in Delhi . . .”\n“That’s not what I mean.”\nThe frown becomes a nano-smile of recognition.\n“Mumbai then. Yes, Mumbai definitely. Kolkata’s hot and dirty and nasty. And Chennai—no, I’m definitely Mumbai.”\nJasbir does the sucked-in-lip-nod of concentration Ram Tarun Das made him practice in front of the mirror.\n“Red Green Yellow Blue?”\n“Red.” No hesitation.\n“Cat Dog Bird Monkey?”\nShe cocks her head to one side. Jasbir notices that she, too, is wearing a hoek. Tech girl. The cocktail bot is on its rounds, doing industrial magic with the self-righting glasses and its little spider-fingers.\n“Bird . . . no.” A sly smile. “No no no. Monkey.”\nHe is going to die he is going to die.\n“But what does it mean?”\nJasbir holds up a finger.\n“One more. Ved Prakash, Begum Vora, Dr. Chatterji, Ritu Parvaaz.”\nShe laughs. She laughs like bells from the hem of a wedding skirt. She laughs like the stars of a Himalaya night.\nWhat do you think you’re doing? Ram Tarun Das hisses. He flips through Jasbir’s perceptions to appear behind Shulka, hands thrown up in despair. With a gesture he encompasses the horizon wreathed in gas flares. Look, tonight the sky burns for you, sir, and you would talk about soap opera! The script, stick to the script! Improvisation is death. Almost Jasbir tells his matchmaker, Away djinn, away. He repeats the question.\n“I’m not really a Town and Country fan,” Shulka says. “My sister now, she knows every last detail about every last one of the characters and that’s before she gets started on the actors. It’s one of those things I suppose you can be ludicrously well informed about without ever watching. So if you had to press me, I would have to say Ritu. So what does it all mean, Mr. Dayal?”\nHis heart turns over in his chest. Ram Tarun Das eyes him coldly. The finesse: make it. Do it just as I instructed you. Otherwise your money and my bandwidth are thrown to the wild wind.\nThe cocktail bot dances in to perform its cybernetic circus. A flip of Shulka’s glass and it comes down spinning, glinting, on the precise needle-point of its forefinger. Like magic, if you know nothing about gyros and spin-glasses. But that moment of prestidigitation is cover enough for Jasbir to make the ordained move. By the time she looks up, cocktail refilled, he is half a room away.\nHe wants to apologize as he sees her eyes widen. He needs to apologize as her gaze searches the room for him. Then her eyes catch his. It is across a crowded room just like the song that Sujay mumbles around the house when he thinks Jasbir can’t hear. Sujay loves that song. It is the most romantic, heart-felt, innocent song he has ever heard. Big awkward Sujay has always been a sucker for veteran Hollywood musicals. South Pacific. Carousel, Moulin Rouge. He watches them on the big screen in the living room, singing shamelessly along and getting moist-eyed at the impossible loves. Across a crowded room, Shulka frowns. Of course. It’s in the script.\nBut what does it mean? she mouths. And, as Ram Tarun Das has directed, he shouts back, “Call me and I’ll tell you.” Then he turns on his heel and walks away. And that, he knows without any prompt from Ram Tarun Das, is the finesse.\nThe apartment is grossly over-heated and smells of singeing cooking ghee but the nute is swaddled in a crocheted shawl, hunched as if against a persistent hard wind. Plastic teacups stand on the low brass table, Jasbir’s mother’s conspicuously untouched. Jasbir sits on the sofa with his father on his right and his mother on his left, as if between arresting policemen. Nahin the nute mutters and shivers and rubs yts fingers.\nJasbir has never been in the physical presence of a third-gendered. He knows all about them—as he knows all about most things—from the Single-Professional-Male general interest magazines to which he subscribes. Those pages, between the ads for designer watches and robot tooth whitening—portray them as fantastical, Arabian Nights creatures equally blessed and cursed with glamour. Nahin the matchmaker seems old and tired as a god, knotting and unknotting yts fingers over the papers on the coffee table—“The bloody drugs, darlings”—occasionally breaking into great spasmodic shudders. It’s one way of avoiding the Wife Game, Jasbir thinks.\nNahin slides sheets of paper around on the tabletop. The documents are patterned as rich as damask with convoluted chartings of circles and spirals annotated in inscrutable alphabets. There is a photograph of a woman in each top right corner. The women are young and handsome but have the wide-eyed expressions of being photographed for the first time.\n“Now, I’ve performed all the calculations and these five are both compatible and auspicious,” Nahin says. Yt clears a large gobbet of phlegm from yts throat.\n“I notice they’re all from the country,” says Jasbir’s father.\n“Country ways are good ways,” says Jasbir’s mother.\nWedged between them on the short sofa, Jasbir looks over Nahin’s shawled shoulder to where Ram Tarun Das stands in the doorway. He raises his eyebrows, shakes his head.\n“Country girls are better breeders,” Nahin says. “You said dynasty was a concern. You’ll also find a closer match in jati and in general they settle for a much more reasonable dowry than a city girl. City girls want it all. Me me me. No good ever comes of selfishness.”\nThe nute’s long fingers stir the country girls around the coffee table, then slide three toward Jasbir and his family. Dadaji and Mamaji sit forward. Jasbir slumps back. Ram Tarun Das folds his arms, rolls his eyes.\n“These three are the best starred,” Nahin says. “I can arrange a meeting with their parents almost immediately. There would be some small expenditure in their coming up to Delhi to meet with you; this would be in addition to my fee.”\nIn a flicker, Ram Tarun Das is behind Jasbir, his whisper a startle in his ear.\n“There is a line in the Western wedding vows: speak now or forever hold your peace.”\n“How much is my mother paying you?” Jasbir says into the moment of silence.\n“I couldn’t possibly betray client confidentiality.” Nahin has eyes small and dark as currants.\n“I’ll disengage you for an additional fifty percent.”\nNahin’s hands hesitate over the pretty hand drawn spirals and wheels. You were a man before, Jasbir thinks. That’s a man’s gesture. See, I’ve learned how to read people.\n“I double,” shrills Mrs. Dayal.\n“Wait wait wait,” Jasbir’s father protests but Jasbir is already shouting over him. He has to kill this idiocy here, before his family in their wedding fever fall into strategies they cannot afford.\n“You’re wasting your time and my parents’ money,” Jasbir says. “You see, I’ve already met a suitable girl.”\nGoggle eyes, open mouths around the coffee table, but none so astounded and gaping as Ram Tarun Das’.\nThe Prasads at Number 25 Acacia Colony Bungalows have already sent over a preemptive complaint about the tango music but Jasbir flicks up the volume fit to rattle the brilliants on the chandelier. At first he scorned the dance, the stiffness, the formality, the strictness of the tempo. So very un-Indian. No one’s uncle would ever dance this at a wedding. But he has persisted—never say that Jasbir Dayal is not a trier—and the personality of the tango has subtly permeated him, like rain into a dry riverbed. He has found the discipline and begun to understand the passion. He walks tall in the Dams and Watercourses. He no longer slouches at the water-cooler.\n“When I advised you to speak or forever hold your peace, sir, I did not actually mean, lie through your teeth to your parents,” Ram Tarun Das says. In tango he takes the woman’s part. The lighthoek can generate an illusion of weight and heft so the aeai feels solid as Jasbir’s partner. If it can do all that, surely it could make him look like a woman? Jasbir thinks. In his dedication to detail Sujay often overlooks the obvious. “Especially in matters where they can rather easily find you out.”\n“I had to stop them wasting their money on that nute.”\n“They would have kept outbidding you.”\n“Then, even more, I had to stop them wasting my money as well.”\nJasbir knocks Ram Tarun Das’ foot across the floor in a sweetly executed barrida. He glides past the open verandah door where Sujay glances up from the soap-opera building. He has become accustomed to seeing his landlord tango cheek to cheek with an elderly Rajput gentleman. Yours is a weird world of ghosts and djinns and half-realities, Jasbir thinks.\n“So how many times has your father called asking about Shulka?” Ram Tarun Das’ free leg traces a curve on the floor in a well-executed volcada. Tango is all about seeing the music. It is making the unseen visible.\nYou know, Jasbir thinks. You’re woven through every part of this house like a pattern in silk.\n“Eight,” he says weakly. “Maybe if I called her . . .”\n“Absolutely not,” Ram Tarun Das insists, pulling in breath-to-breath close in the embreza. “Any minuscule advantage you might have enjoyed, any atom of hope you might have entertained, would be forfeit. I forbid it.”\n“Well, can you at least give me a probability? Surely knowing everything you know about the art of shaadi, you could at least let me know if I’ve any chance?”\n“Sir,” says Ram Tarun Das, “I am a Master of Grooming, Grace, and Gentlemanliness. I can direct you to any number of simple and unsophisticated bookie-aeais; they will give you a price on anything though you may not fancy their odds. One thing I will say: Miss Shulka’s responses were very—suitable.”\nRam Tarun Das hooks his leg around Jasbir’s waist in a final gancho. The music comes to its strictly appointed conclusion. From behind it come two sounds. One is Mrs. Prasad weeping. She must be leaning against the party wall to make her upset so clearly audible. The other is a call tone, a very specific call tone, a deplorable but insanely hummable filmi hit My Back, My Crack, My Sack that Jasbir set on the house system to identify one caller, and one caller only.\nSujay looks up, startled.\n“Hello?” Jasbir sends frantic, pleading hand signals to Ram Tarun Das, now seated across the room, his hands resting on the top of his cane.\n“Lexus Mumbai red monkey Ritu Parvaaz,” says Shulka Mathur. “So what do they mean?”\n“No, my mind is made up, I’m hiring a private detective,” Deependra says, rinsing his hands. On the twelfth floor of the Ministry of Waters all the dating gossip happens at the wash-hand basins in the Number 16 Gentlemen’s WC. Urinals: too obviously competitive. Cubicles: a violation of privacy. Truths are best washed with the hands at the basins and secrets and revelations can always be concealed by judicious use of the hot-air hand-drier.\n“Deependra, this is paranoia. What’s she done?” Jasbir whispers. A level 0.3 aeai chip in the tap admonishes him not to waste precious water.\n“It’s not what she’s done, it’s what she’s not done,” Deependra hisses. “There’s a big difference between someone not being available and someone deliberately not taking your calls. Oh yes. You’ll learn this, mark my words. You’re at the first stage, when it’s all new and fresh and exciting and you are blinded by the amazing fact that someone, someone at last, at long last! thinks you are a catch. It is all rose petals and sweets and cho chweet and you think nothing can possibly go wrong. But you pass through that stage, oh yes. All too soon the scales fall from your eyes. You see . . . and you hear.”\n“Deependra.” Jasbir moved to the battery of driers. “You’ve been on five dates.” But every word Deependra has spoken has chimed true. He is a cauldron of clashing emotions. He feels light and elastic, as if he bestrode the world like a god, yet at the same time the world is pale and insubstantial as muslin around him. He feels lightheaded with hunger though he cannot eat a thing. He pushes away Sujay’s lovingly prepared dais and roti. Garlic might taint his breath, saag might stick to his teeth, onions might give him wind, bread might inelegantly bloat him. He chews a few cleansing cardamoms, in the hope of spiced kisses to come. Jasbir Dayal is blissfully, gloriously love-sick.\nDate one. The Qutb Minar. Jasbir had immediately protested.\n“Tourists go there. And families on Saturdays.”\n“It’s history.”\n“Shulka isn’t interested in history.”\n“Oh, you know her so well after three phone conversations and two evenings chatting on shaadinet–which I scripted for you? It is roots, it is who you are and where you come from. It’s family and dynasty. Your Shulka is interested in that, I assure you, sir. Now, here’s what you will wear.”\nThere were tour buses great and small. There were hawkers and souvenir peddlers. There were parties of frowning Chinese. There were schoolchildren with backpacks so huge they looked like upright tortoises. But wandering beneath the domes and along the colonnades of the Quwwat Mosque in his Casual Urban Explorer clothes, they seemed as remote and ephemeral as clouds. There was only Shulka and him. And Ram Tarun Das strolling at his side, hands clasped behind his back.\nTo cue, Jasbir paused to trace out the time-muted contours of a disembodied tirthankar’s head, a ghost in the stone.\n“Qutb-ud-din Aibak, the first Sultan of Delhi, destroyed twenty Jain temples and reused the stone to build his mosque. You can still find the old carvings if you know where to look.”\n“I like that,” Shulka said. “The old gods are still here.” Every word that fell from her lips was pearl-perfect. Jasbir tried to read her eyes but her BlueBoo! cat-eye shades betrayed nothing. “Not enough people care about their history any more. It’s all modern this modern that, if it’s not up-to-the-minute it’s irrelevant. I think that to know where you’re going you need to know where you’ve come from.”\nVery good, Ram Tarun Das whispered. Now, the iron pillar.\nThey waited for a tour group of Germans to move away from the railed-off enclosure. Jasbir and Shulka stood in the moment of silence gazing at the black pillar.\n“Sixteen hundred years old, but never a speck of rust on it,” Jasbir said.\nNinety eight percent pure iron, Ram Tarun Das prompted. There are things Mittal Steel can learn from the Gupta kings.\n“‘He who, having the name of Chandra, carried a beauty of countenance like the full moon, having in faith fixed his mind upon Vishnu, had this lofty standard of the divine Vishnu set up on the hill Vishnupada’.” Shulka’s frown of concentration as she focused on the inscription around the pillar’s waist was as beautiful to Jasbir as that of any god or Gupta king.\n“You speak Sanskrit?”\n“It’s a sort of personal spiritual development path I’m following.”\nYou have about thirty seconds before the next tour group arrives, Ram Tarun Das cuts in. Now sir; that line I gave you.\n“They say that if you stand with your back to the pillar and close your arms around it, your wish will be granted.”\nThe Chinese were coming, the Chinese were coming.\n“And if you could do that, what would you wish for?”\nPerfect. She was perfect.\n“Dinner?”\nShe smiled that small and secret smile that set a garden of thorns in Jasbir’s heart and walked away. At the center of the gate house arch she turned and called back, “Dinner would be good.”\nThen the Chinese with their shopping bags and sun visors and plastic leisure shoes came bustling around the stainless iron pillar of Chandra Gupta.\nJasbir smiles at the sunny memory of Date One. Deependra waggles his fingers under the stream of hot air.\n“I’ve heard about this. It was on a documentary, oh yes. White widows, they call them. They dress up and go to the shaadis and have their resumés all twinkling and perfect but they have no intention of marrying, Oh no no no, not a chance. Why should they, when there is a never-ending stream of men to wine them and dine them and take out to lovely places and buy them lovely presents and shoes and jewels, and even cars, so it said on the documentary. They are just in it for what they can get; they are playing games with our hearts. And when they get tired or bored or if the man is making too many demands or his presents aren’t as expensive as they were or they can do better somewhere else, then whoosh! Dumped flat and on to the next one. It’s a game to them.”\n“Deependra,” says Jasbir. “Let it go. Documentaries on the Shaadi Channel are not the kind of model you want for married life. Really.” Ram Tarun Das would be proud of that one. “Now, I have to get back to work.” Faucets that warn about water crime can also report excessive toilet breaks to line managers. But the doubt-seeds are sown, and Jasbir now remembers the restaurant.\nDate Two. Jasbir had practiced with the chopsticks for every meal for a week. He swore at rice, he cursed dal. Sujay effortlessly scooped rice, dal, everything from bowl to lips in a flurry of stickwork.\n“It’s easy for you, you’ve got that code-wallah Asian culture thing.”\n“Um, we are Asian.”\n“You know what I mean. And I don’t even like Chinese food, it’s so bland.”\nThe restaurant was expensive, half a week’s wage. He’d make it up on overtime; there were fresh worries in Dams and Watercourses about a drought.\n“Oh,” Shulka said, the nightglow of Delhi a vast, diffuse halo behind her. She is a goddess, Jasbir thought, a devi of the night city with ten million lights descending from her hair. “Chopsticks.” She picked up the antique porcelain chopsticks, one in each hand like drum sticks. “I never know what to do with chopsticks. I’m always afraid of snapping them.”\n“Oh, they’re quite easy once you get the hang of them.” Jasbir rose from his seat and came round behind Shulka. Leaning over her shoulder he laid one stick along the fold of her thumb, the other between ball of thumb and tip of index finger. Still wearing her lighthoek. It’s the city girl look. Jasbir shivered in anticipation as he slipped the tip of her middle finger between the two chopsticks. “Your finger acts like a pivot, see? Keep relaxed, that’s the key. And hold your bowl close to your lips.” Her fingers were warm, soft, electric with possibility as he moved them. Did he imagine her skin scented with musk?\nNow, said Ram Tarun Das from over Shulka’s other shoulder. Now do you see? And by the way, you must tell her that they make the food taste better.\nThey did make the food taste better. Jasbir found subtleties and piquancies he had not known before. Words flowed easily across the table. Everything Jasbir said seemed to earn her starlight laughter. Though Ram Tarun Das was as ubiquitous and unobtrusive as the waiting staff, they were all his own words and witticisms. See, you can do this, Jasbir said to himself. What women want, it’s no mystery; stop talking about yourself, listen to them, make them laugh.\nOver green tea Shulka began talking about that new novel everyone but everyone was reading, the one about the Delhi girl on the husband-hunt and her many suitors, the scandalous one, An Eligible Boy. Everyone but everyone but Jasbir.\nHelp! he subvocalized into his inner ear.\nScanning it now, Ram Tarun Das said. Do you want a thematic digest, popular opinions, or character breakdowns?\nJust be there, Jasbir silently whispered, covering the tiny movement of his jaw by setting the tea-pot lid ajar, a sign for a refill.\n“Well, it’s not really a book a man should be seen reading . . .”\n“But . . .”\n“But isn’t everyone?” Ram Tarun Das dropped him the line. “I mean, I’m only two thirds of the way in, but . . . how far are you? Spoiler alert spoiler alert.” It’s one of Sujay’s Town and Country expressions. Finally he understands what it means. Shulka just smiles and turns her tea bowl in its little saucer.\n“Say what you were going to say.”\n“I mean, can’t she see that Nishok is the one? The man is clearly, obviously, one thousand percent doting on her. But then that would be too easy, wouldn’t it?”\n“But Pran, it would always be fire with him. He’s the baddest of badmashes but you’d never be complacent with Pran. She’ll never be able to completely trust him and that’s what makes it exciting. Don’t you think you feel that sometimes it needs that little edge, that little fear that maybe, just maybe you could lose it all to keep it alive?”\nCareful, sir, murmured Ram Tarun Das.\n“Yes, but we’ve known ever since the party at the Chatterjis where she pushed Jyoti into the pool in front of the Russian ambassador that she’s been jealous of her sister because she was the one that got to marry Mr. Panse. It’s the eternal glamour versus security. Passion versus stability. Town versus country.”\n“Ajit?”\n“Convenient plot device. Never a contender. Every woman he dates is just a mirror to his own sweet self.”\nNot one sentence, not one word had he read of the hit trash novel of the season. It had flown around his head like clatter-winged pigeons. He’s been too busy being that Eligible Boy.\nShulka held up a piece of sweet, salty, melting fatty duck breast between her porcelain forceps. Juice dripped onto the tablecloth.\n“So, who will Bani marry, then? Guess correctly and you shall have a prize.”\nJasbir heard Ram Tarun Das’ answer begin to form inside his head. No, he gritted on his molars.\n“I think I know.”\n“Go on.”\n“Pran.”\nShulka stabbed forward, like the darting bill of a winter crane. There was hot, fatty soya duck in his mouth.\n“Isn’t there always a twist in the tale?” Shulka said.\nIn the Number 16 Gentlemen’s WC Deependra checks his hair in the mirror and smoothes it down.\n“Dowry thievery; that’s what it is. They string you along, get their claws into your money, then they disappear and you never see a paisa again.”\nNow Jasbir really really wants to get back to his little work cluster.\n“Deep, this is fantasy. You’ve read this in the news feeds. Come on.”\n“Where there’s smoke there’s fire. My stars say that I should be careful in things of the heart and beware false friends. Jupiter is in the third house. Dark omens surround me. No, I have hired a private investigation aeai. It will conduct a discreet surveillance. One way or the other, I shall know.”\nJasbir grips the stanchion, knuckles white, as the phatphat swings through the great mil of traffic around Indira Chowk. Deependra’s aftershave oppresses him.\n“Exactly where are we going?”\nDeependra had set up the assignation on a coded palmer account. All he would say was that it required two hours of an evening, good clothes, a trustworthy friend and absolute discretion. For two days his mood had been gray and thundery as an approaching monsoon. His PI Aeai had returned a result but Deependra revealed nothing, not even a whisper in the clubbish privacy of the Number 16 Gentlemen’s WC.\nThe phatphat, driven by a teenager with gelled hair that falls in sharp spikes over his eyes—an obvious impediment to navigation—takes them out past the airport. At Gurgaon the geography falls into place around Jasbir. He starts to feel nauseous from more than spike-hair’s driving and Deependra’s shopping mall aftershave. Five minutes later the phatphat crunches up the curve of raked gravel outside the pillared portico of the Haryana Polo and Country Club.\n“What are we doing here? If Shulka finds out I’ve been to shaadi when I’m supposed to be dating her it’s all over.”\n“I need a witness.”\nHelp me Ram Tarun Das, Jasbir hisses into his molars but there is no reassuring spritz of silvery music through his skull to herald the advent of the Master of Grooming, Grace, and Gentlemanliness. The two immense Sikhs on the door nod them through.\nKishore is sloped against his customary angle at the bar, surveying the territory. Deependra strides through the throng of eligible boys like a god going to war. Every head turns. Every conversation, every gossip falls silent.\n“You . . . you . . . you.” Deependra stammers with rage. His face shakes. “Shaadi stealer!” The whole club bar winces as the slap cracks across Kishore’s face. Then two fists descend on Deependra, one on each shoulder. The man-mountain Sikhs turn him around and arm-lock him, frothing and raging, from the bar of the Haryana Polo and Country Club. “You, you chuutya!” Deependra flings back at his enemy. “I will take it out of you, every last paisa, so help me God. I will have satisfaction!”\nJasbir scurries behind the struggling, swearing Deependra, cowed with embarrassment.\n“I’m only here to witness,” he says to the Sikh’s you’re-next glares. They hold Deependra upright a moment to snap his face and bar him forever from Begum Rezzak’s Lovely Girl Shaadi Agency. Then they throw him cleanly over the hood of a new model Li Fan G8 into the carriage drive. He lies dreadfully still and snapped on the gravel for a few moments, then with fetching dignity draws himself up, bats away the dust and straightens his clothes.\n“I will see him at the river about this,” Deependra shouts at the impassive Sikhs. “At the river.”\nJasbir is already out on the avenue, trying to see if the phatphat driver’s gone.\nThe sun is a bowl of brass rolling along the indigo edge of the world. Lights twinkle in the dawn haze. There is never a time when there are not people at the river. Wire-thin men push handcarts over the trash-strewn sand, picking like birds. Two boys have set a small fire in a ring of stones. A distant procession of women, soft bundles on their heads, file over the grassy sand. By the shriveled thread of the Yamuna an old Brahmin consecrates himself, pouring water over his head. Despite the early heat, Jasbir shivers. He knows what goes into that water. He can smell the sewage on the air, mingled with wood smoke.\n“Birds,” says Sujay looking around him with simple wonder. “I can actually hear birds singing. So this is what mornings are like. Tell me again what I’m doing here?”\n“You’re here because I’m not being here on my own.”\n“And, ah, what exactly are you doing here?”\nDeependra squats on his heels by the gym bag, arms wrapped around him. He wears a sharp white shirt and pleated slacks. His shoes are very good. Apart from grunted greetings he has not said a word to Jasbir or Sujay. He stares a lot. Deependra picks up a fistful of sand and lets his trickle through his fingers. Jasbir wouldn’t advise that either.\n“I could be at home coding,” says Sujay. “Hey ho. Show time.”\nKishore marches across the scabby river-grass. Even as a well-dressed distant speck it is obvious to all that he is furiously angry. His shouts carry far on the still morning air.\n“I am going to kick your head into the river,” he bellows at Deependra, still squatting on the riverbank.\n“I’m only here as a witness,” Jasbir says hurriedly, needing to be believed. Kishore must forget and Deependra must never know that he was also the witness that night Kishore made the joke in the Tughluk tower.\nDeependra looks up. His face is bland, his eyes are mild.\n“You just had to, didn’t you? It would have killed you to let me have something you didn’t.”\n“Yeah, well. I let you get away with that in the Polo Club. I could have taken you then, it would have been the easiest thing. I could have driven your nose right into your skull, but I didn’t. You cost me my dignity, in front of all my friends, people I work with, business colleagues, but most of all, in front of the women.”\n“Well then let me help you find your honor again.”\nDeependra thrusts his hand into the gym bag and pulls out a gun.\n“Oh my god it’s a gun he’s got a gun,” Jasbir jabbers. He feels his knees turn liquid. He thought that only happened in soaps and popular trash novels. Deependra gets to his feet, the gun never wavering from its aim in the center of Kishore’s forehead, the precise spot a bindi would sit.\n“There’s another one in the bag.” Deependra waggles the barrel, nods with his head. “Take it. Let’s sort this right, the man’s way. Let’s sort it honorably. Take the gun.” His voice has gained an octave. A vein beats in his neck and at his temple. Deependra kicks the gym bag towards Kishore. Jasbir can see the anger, the mad, suicidal anger rising in the banker to match the civil servant’s. He can hear himself mumbling Oh my god oh my god oh my god. “Take the gun. You will have an honorable chance. Otherwise I will shoot you like a pi-dog right here.” Deependra levels the gun and takes a sudden, stabbing step towards Kishore. He is panting like a dying cat. Sweat has soaked his good white shirt through and through. The gun muzzle is a finger’s-breadth from Kishore’s forehead.\nThen there is a blur of movement, a body against the sun, a cry of pain, and the next Jasbir knows Sujay has the gun swinging by its trigger guard from his finger. Deependra is on the sand, clenching and unclenching his right hand. The old Brahmin stares, dripping.\n“It’s okay now, it’s all okay, it’s over,” Sujay says. “I’m going to put this in the bag with the other and I’m going to take them and get rid of them and no one will ever talk about this, okay? I’m taking the bag now. Now, shall we all get out of here before someone calls the police, hm?”\nSujay swings the gym bag over his sloping shoulder and strides out for the streetlights, leaving Deependra hunched and crying among the shredded plastic scraps.\n“How, what, that was, where did you learn to do that?” Jasbir asks, tagging behind, feet sinking into the soft sand.\n“I’ve coded the move enough times; I thought it might work in meat life.”\n“You don’t mean?”\n“From the soaps. Doesn’t everyone?”\nThere’s solace in soap opera. Its predictable tiny screaming rows, its scripted swooping melodramas, draw the poison from the chaotic, unscripted world where a civil servant in the water service can challenge a rival to a shooting duel over a woman he met at a shaadi. Little effigies of true dramas, sculpted in soap.\nWhen he blinks, Jasbir can see the gun. He sees Deependra’s hand draw it out of the gym bag in martial-arts-movie slow motion. He thinks he sees the other gun, nestled among balled sports socks. Or maybe he imagines it, a cut-away close-up. Already he is editing his memory.\nSoothing to watch Nilesh Vora and Dr. Chatterji’s wife, their love eternally foiled and frustrated, and Deepti; will she ever realize that to the Brahmpur social set she is eternally that Dalit girl from the village pump?\nYou work on the other side of a glass partition from someone for years. You go with him to shaadis, you share the hopes and fears of your life and love with him. And love turns him into a homicidal madman. Sujay took the gun off him. Big, clumsy Sujay, took the loaded gun out of his hand. He would have shot Kishore. Brave, mad Sujay. He’s coding, that’s his renormalizing process. Make soap, watch soap. Jasbir will make him tea. For once. Yes, that would be a nice gesture. Sujay is always always getting tea. Jasbir gets up. It’s a boring bit, Mahesh and Rajani. He doesn’t like them. Those rich-boy-pretending-they-are-car-valets-so-they-can-marry-for-love-not-money characters stretch his disbelief too far. Rajani is hot, though. She’s asked Mahesh to bring her car round to the front of the hotel.\n“When you work out here you have lots of time to make up theories. One of my theories is that people’s cars are their characters,” Mahesh is saying. Only in a soap would anyone ever imagine that a pick-up line like that would work, Jasbir thinks. “So, are you a Tata, a Mercedes, a Li Fan, or a Lexus?”\nJasbir freezes in the door.\n“Oh, a Lexus.”\nHe turns slowly. Everything is dropping, everything is falling leaving him suspended. Now Mahesh is saying, “You know, I have another theory. It’s that everyone’s a city. Are you Delhi, Mumbai, Kolkata, Chennai?”\nJasbir sits on the arm of the sofa. The fetch, he whispers. And she will say . . .\n“I was born in Delhi . . .”\n“That’s not what I mean.”\nMumbai, murmurs Jasbir.\n“Mumbai then. Yes, Mumbai definitely. Kolkata’s hot and dirty and nasty. And Chennai—no, I’m definitely Mumbai.”\n“Red Green Yellow Blue,” Jasbir says.\n“Red.” Without a moment’s hesitation.\n“Cat Dog Bird Monkey?”\nShe even cocks her head to one side. That was how he noticed Shulka was wearing the lighthoek.\n“Bird . . . no.”\n“No no no,” says Jasbir. She’ll smile slyly here. “Monkey.” And there is the smile. The finesse.\n“Sujay!” Jasbir yells. “Sujay! Get me Das!”\n“How can an aeai be in love?” Jasbir demands.\nRam Tarun Das sits in his customary wicker chair, his legs casually crossed. Soon, very soon, Jasbir thinks, voices will be raised and Mrs. Prasad next door will begin to thump and weep.\n“Now sir, do not most religions maintain that love is the fundament of the universe? In which case, perhaps it’s not so strange that a distributed entity, such as myself, should find—and be surprised by, oh, so surprised, sir—by love? As a distributed entity, it’s different in nature from the surge of neurochemicals and waveform of electrical activity you experience as love. With us it’s a more—rarefied experience—judging solely by what I know from my subroutines on Town and Country. Yet, at the same time, it’s intensely communal. How can I describe it? You don’t have the concepts, let alone the words. I am a specific incarnation of aspects of a number of aeais and sub-programs, as those aeais are also iterations of sub-programs, many of them marginally sentient. I am many, I am legion. And so is she—though of course gender is purely arbitrary for us, and, sir, largely irrelevant. It’s very likely that at many levels we share components. So ours is not so much a marriage of minds as a league of nations. Here we are different from humans in that, for you, it seems to us that groups are divisive and antipathetical. Politics, religion, sport, but especially your history, seem to teach that. For us folk, groups are what bring us together. They are mutually attractive. Perhaps the closest analogy might be the merger of large corporations. One thing I do know, that for humans and aeais, we both need to tell people about it.”\n“When did you find out she was using an aeai assistant?”\n“Oh, at once sir. These things are obvious to us. And if you’ll forgive the parlance, we don’t waste time. Fascination at the first nanosecond. Thereafter, well, as you saw on the unfortunate scene from Town and Country, we scripted you.”\n“So we thought you were guiding us . . .”\n“When it was you who were our go-betweens, yes.”\n“So what happens now?” Jasbir slaps his hands on his thighs.\n“We are meshing at a very high level. I can only catch hints and shadows of it, but I feel a new aeai is being born, on a level far beyond either of us, or any of our co-characters. Is this a birth? I don’t know, but how can I convey to you the tremendous, rushing excitement I feel?”\n“I meant me.”\n“I’m sorry sir. Of course you did. I am quite, quite dizzy with it all. If I might make one observation; there’s truth in what your parents say. First the marriage, then the love. Love grows in the thing you see every day.”\nThieving macaques dart around Jasbir’s legs and pluck at the creases of his pants. Midnight metro, the last train home. The few late-night passengers observe a quarantine of mutual solitude. The djinns of unexplained wind that haunt subway systems send litter spiraling across the platform. The tunnel focuses distant shunts and clanks, uncanny at this zero hour. There should be someone around at the phatphat stand. If not he’ll walk. It doesn’t matter.\nHe met her at a fashionable bar all leather and darkened glass in an international downtown hotel. She looked wonderful. The simple act of her stirring sugar into coffee tore his heart in two.\n“When did you find out?”\n“Devashri Didi told me.”\n“Devashri Didi.”\n“And yours?\n“Ram Tarun Das, Master of Grooming, Grace, and Gentlemanliness. A very proper, old fashioned Rajput gent. He always called me sir; right up to the end. My housemate made him. He works in character design on Town and Country.”\n“My older sister works in PR at the meta-soap department at Jazhay. She got one of the actor designers to put Devashri Didi together.” Jasbir has always found the idea of artificial actors believing they played equally artificial roles head-frying. Then he found aeai love.\n“Is she married? Your older sister, I mean.”\n“Blissfully. And children.”\n“Well, I hope our aeais are very happy together.” Jasbir raised a glass. Shulka lifted her coffee cup. She wasn’t a drinker. She didn’t like alcohol, Devashri Didi had told her it looked good for the Begum Jaitly’s modern shaadi.\n“My little quiz?” Jasbir asked.\n“Devashri Didi gave me the answers you were expecting. She’d told me it was a standard ploy, personality quizzes and psychic tests.”\n“And the Sanskrit?”\n“Can’t speak a word.”\nJasbir laughed honestly.\n“The personal spiritual journey?”\n“I’m a strictly material girl. Devashri Didi said . . .”\n“. . . I’d be impressed if I thought you had a deep spiritual dimension. I’m not a history buff either. And An Eligible Boy?”\n“That unreadable tripe?”\n“Me neither.”\n“Is there anything true about either of us?”\n“One thing,” Jasbir said. “I can tango.”\nHer surprise, breaking into a delighted smile, was also true. Then she folded it away.\n“Was there ever any chance?” Jasbir asked.\n“Why did you have at ask that? We could have just admitted that we were both playing games and shaken hands and laughed and left it at that. Jasbir, would it help if I told you that I wasn’t even looking? I was trying the system out. It’s different for suitable girls. I’ve got a plan.”\n“Oh,” said Jasbir.\n“You did ask and we agreed, right at the start tonight, no more pretence.” She turned her coffee cup so that the handle faced right and laid her spoon neatly in the saucer. “I have to go now.” She snapped her bag shut and stood up. Don’t walk away, Jasbir said in his silent Master of Grooming, Grace, and Gentlemanliness voice. She walked away.\n“And Jasbir.”\n“What?”\n“You’re a lovely man, but this was not a date.”\nA monkey takes a liberty too far, plucking at Jasbir’s shin. Jasbir’s kick connects and sends it shrieking and cursing across the platform. Sorry monkey. It wasn’t you. Booms rattle up the subway tube; gusting hot air and the smell of electricity herald the arrival of the last metro. As the lights swing around the curve in the tunnel, Jasbir imagines how it would be to step out and drop in front of it. The game would be over. Deependra has it easy. Indefinite sick leave, civil service counseling, and pharma. But for Jasbir there is no end to it and he is so so tired of playing. Then the train slams past him in a shout of blue and silver and yellow light, slams him back into himself. He sees his face reflected in the glass, his teeth still divinely white. Jasbir shakes his head and smiles and instead steps through the opening door.\nIt is as he suspected. The last phatphat has gone home for the night from the rank at Barwala metro station. It’s four kays along the pitted, flaking roads to Acacia Bungalow Colony behind its gates and walls. Under an hour’s walk. Why not? The night is warm, he’s nothing better to do and he might yet pull a passing cab. Jasbir steps out. After half an hour a last, patrolling phatphat passes on the other side of the road. It flashes its light and pulls around to come up beside him. Jasbir waves it on. He is enjoying the night and the melancholy. There are stars up there, beyond the golden airglow of great Delhi.\nLight spills through the French windows from the verandah into the dark living room. Sujay is at work still. In four kilometers Jasbir has generated a sweat. He ducks into the shower, closes his eyes in bliss as the jets of water hit him. Let it run let it run let it run he doesn’t care how much he wastes, how much it costs, how badly the villagers need it for their crops. Wash the old tired dirt from me.\nA scratch at the door. Does Jasbir hear the mumble of a voice? He shuts off the shower.\n“Sujay?”\n“I’ve, ah, left you tea.”\n“Oh, thank you.”\nThere’s silence but Jasbir knows Sujay hasn’t gone.\n“Ahm, just to say that I have always . . . I will . . . always. Always . . .” Jasbir holds his breath, water running down his body and dripping onto the shower tray. “I’ll always be here for you.”\nJasbir wraps a towel around his waist, opens the bathroom door, and lifts the tea.\nPresently Latin music thunders out from the brightly lit windows of Number 27 Acacia Bungalows. Lights go on up and down the close. Mrs. Prasad beats her shoe on the wall and begins to wail. The tango begins.\nOriginally published in Fast Forward 2, edited by Lou Anders, 2008."}