{"fingerprint": "rY24wIKMUJgENgTsjWI/Sgu7I7M=", "sitename": "Clarkesworld Magazine", "title": "Driftings by Ian McDonald", "author": "Ian McDonald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcdonald_01_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Driftings by Ian McDonald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4870 words, short story\n Driftings\n A hat, a deer and a plastic truck came in on the swell of the ocean. The hat was a yellow hard-hat; an engineer’s, a construction worker’s hat. Its foam inserts had buoyed it across wide waters. The deer was a Puchie Baby miniature with a skull-and-crossbones patterned hide. Adorable, small. The truck was really a tiger-design kid’s trunki, but the wheels still turned, after so long in the gyre.\n The truck was the last one, the difficult one. Picking his way along the shore, squinting at the bright steel horizon, he had glimpsed an ear of color between grey of sky and grey of sea. Squint. An edge of sea-scabbed orange, lolling in the lap. He splashed out into the waves. The cold cut through the steamer suit and he was chilled already from the fight to rescue the hard hat. The current could show you a thing and take it back into the gyre. It had teased him with the hard hat, luring him, then pulling it away, drawing him deeper than he wanted to go. The current that took a hat out to the gyre could take a man, even a fit, strong young man like Reith. A lunge, a splash, and it was his. He waded up out of the surf-line, the yellow, oil-scabbed hat on his head.\n In the clear water he saw geometry beneath the triangle of orange plastic and guessed what lay low in the swell. Here was a kid’s ride-on luggage trunk, a tiger-face still discernible. Thigh-deep, waist-deep. His. He towed it to shore.\n The girl sat on a mound at the edge of the foot-worn path to the road. Her knees were pulled close to her body, her arms wrapped around her shins. Reith peered to see if she was watching him drag the kiddie-trunk along the beach, salt water trickling from its seam.\n She was watching him. He was the only watchable thing.\n Her sleeves were pulled down over the backs of her hands. They were her sole concession to the weather. Low grey clouds streamed in from the ocean and caught on the tops of the trees, unfurling thin drizzle. The cloud could sit like that for weeks. A thin print dress and a cardigan were not clothes for this shore.\n He wanted to open the plastic trunk there and then, at his bivouac, but he could feel the girl’s eyes on him. He didn’t want her to see him greedy and excited, forcing the catch, spilling out the salt-spoiled treasures he hoped were inside. You work uneasily when the only eyes for miles are on you. He packed up the bivouac, pulled the hoodie on over the wet-suit, loaded the sea-things into a plastic box.\n “What makes you take them?” The girl’s voice was soft but carrying.\n “Feeling there’s a loss in it,” Reith said. “Feeling there’s a story and a hurt.”\n Japanese, not Chinese, Reith reckoned. Skin so smooth; hair falling to the small of her back, hair-product straight and shiny. Ocean cold was beginning to infiltrate the wetsuit but the slump of a wave, the side-slip of a gull on the air, the sudden hiss of eddying drizzle; all said stay, speak.\n “Aren’t you cold?”\n “I don’t really get cold. But it would be worth it. I love it here.”\n Reith looked to the pull-in among the trees. His pickup was the only vehicle.\n “How did you get here?”\n “I got dropped off.”\n “You will get cold. It’s not good. I can give you a ride back to town, if that’s where you’re at.”\n “They’ll pick me up again.”\n Reith knew she was not telling the truth but you can’t call someone on that in the ninth sentence you exchange with them. The girl knew that he knew because she combed her hair back behind her ear and smiled.\n “I’ll be fine. Really.” Mist lay in minute silver pearls on the fibers of her woolen cardigan but did not cling to her hair or skin at all.\n So she was in town. Reith liked that. They might meet again, by chance or by design.\n He looked back from the door of the pickup. She was still there, on the edge of drop from the tree-line down to the driftwood. Again he looked, as he turned back on to the highway. He half expected her to have vanished. She was still there, grey on grey. He turned the heater up full to blow some warmth back into his legs.\n A fleece-fiber scarf. A bucket of plastic zoo-animals. A drinks cup with spout. A sea-rotted cardboard picture book. A child’s things.\n Driving in the pickup he saw her walking on the side of the road. She moved lightly, barely connected to the earth at all. The same light print dress and cardigan. The clouds were lower today, catching on the flagpole outside the junior school and the eccentric carpentered spires and shingles of the old wooden hotel where Roosevelt was supposed to have stayed. You could reach up and grab a fistful of rain. He turned in the road and drove beside her.\n “Hi.”\n “Oh. Hi.”\n “I’m, uh, thinking about grabbing a coffee. Can I get you one?”\n She scraped her hair behind an ear. She smiled by not quite looking at him.\n “That would be good.”\n “Do you want a ride?”\n “Is it far?”\n “No, just across from the old Roosevelt hotel.”\n “I know that. I’ll walk.”\n She had arrived by the time he had turned the car across the traffic.\n “You’re not in the wetsuit today.”\n “I will be later.” It was in the back of the truck, with the bivouac and the rest of the beach-combing equipment. The same westerly driving the raft of cloud could also push the entire gyre, hundreds of miles across, closer to the coast. Westerlies were good foraging winds.\n “I like guys in wetsuits. They make them look vulnerable. Cute.”\n Reith blinked and hid his blush in a sip of coffee. Retched. Spat.\n “Jesus.”\n “Are you okay?”\n “Sorry. Salt. I must have put salt in instead of sugar.”\n “There is no salt on the table.”\n She tipped white crystals into the palm of her hand, dipped a lip-moistened finger, offered it to Reith to lick. Reith drew back.\n “Oh, I’m sorry.” She licked her finger. “Yes, sweet.”\n “You asked yesterday, at the beach, what made me take them,” Reith said. The lick of sugar from her finger had roused him. “Come and see.”\n Again she dipped her head and looked away to hide a smile.\n “I’d love to, thank you.”\n Why had he offered to show her the Driftings? The westerly was blowing, the gyre was turning. He should be ten miles down the coast, scanning the break line with binoculars. Not offering to show her the studio; not stopping in the street to invite her to coffee, salt coffee.\n Life and work were a foreclosed house a mile and a half up on the forest road. The agency had been only too happy to let it long term, cheap. They had no prospect of ever selling it on. Roosevelt had been the last big thing to happen in the town and it was now in the terminal stages of a century-long decline. The council had hoped to catch the dark wave of the Twilight business but had dithered too long and missed its crest. Bella’s coffee-shop had closed two months ago. Its coffee had been horrible. Reith reckoned he would need another house soon. The Driftings were forcing him back, like a whelk withdrawing into its shell, into smaller and smaller rooms. The realtors were only too eager.\n “It’s kind of cluttered in here.”\n As the girl went past him into the house, Reith caught a sudden smell of the shore; rotting weed and sun-crisp crab, salt and sand-scab, so strong he almost gagged. For a moment, a breath; then he smelled her: clean skin, fabric conditioner, hair conditioner, something lightly floral.\n The Ningyo Drifting occupied all of the main room apart from a narrow passage to the kitchen area.\n The Ningyo Drifting: dolls, toys, transforming robots toy cars plastic zoo animals, those perverse vinyl figurines that have no other purpose than to be collectible by adults, toy soldiers, anime action figures, monsters and dinosaurs. Over four hundred of them now. The Puchie Baby deer would likely join them. Welded and melded, dismembered and re-membered, heads growing from alien torsos, from other heads, from shoulder stumps, multiple faces grafted on to a single head, like a Hindu deity; thickets of arms; transplanted legs; robot heads on toy dog bodies; all joined together into a coral tree.\n The girl looked up at the branches of warped toys reaching over her head. Her mouth opened a little.\n “This was my first piece. It’s the one I’ve been working at longest as well. I think maybe it won’t ever be finished. I certainly won’t ever sell it.” Reith touched a Kokeshi at the junction of two spreading antlers. “This was the first one. I was out on the peninsula with friends and picked it up at Taylor Point. Someone said it was Japanese, that there was a huge slick of stuff all sucked out to sea after the tsunami and it was moving slowly towards the west coast. The day after that the bit of dock washed up in Oregon. That kind of started it. No, I don’t think I’ll ever sell this one.”\n Reith hadn’t eaten in the kitchen for months. He didn’t like having food around the ocean-things. Oils and hydrocarbons, tars and wastes. The whole house might be a little radioactive. He didn’t want to think about that. The kitchen had become the work room until it clogged up with beach-combings. The floor was filled to work-top height with ideas in progress. There was no room for feet, but it gave the best perspective on the Kanagawa Driftings in the dining area.\n Things that open, built into a pastiche The Great Wave off Kanagawa. Bento boxes opening out of snap-fit kitchen containers opening out handbags opening out of lunch boxes out of plastic storage boxes out of rolling luggage out of fishing crates. Color-coordinated to recreate the deep wave blue and the breaker white of the Hokusai print. Reith would fit the trunki here, with thought. He had removed the ceiling light to accommodate the uppermost fractals of the plastic wave.\n “Don’t you think it’s kind of . . . wrong?” the girl said. “I mean a wave made out of tsunami stuff?”\n “There’s no fishing boat,” Reith said. “That would be wrong. But it’s not about the wave, or the tsunami. Really. It’s about how we see when we look across the ocean to Japan, how we fetishize it, how we import kawaii, or cosplay, and turn them into our own thing without ever trying to understand them.”\n “I’m not sure I can always understand you,” the girl said. Her fingers felt out the nested links of plastic containers. “What was inside?”\n “Most of them, nothing. The gyre grinds a lot of it up.”\n “But something, sometimes.”\n “Sometimes.”\n A fleece-fiber scarf. A bucket of plastic zoo-animals. A drinks cup with spout. A sea-rotted cardboard picture book.\n “It’s the inside things that have the story and the hurt,” the girl said. “Put-away things are loved things.”\n The Kanagawa Drifting rattled as a rig, heavy with long lumber, passed down from the high forests.\n The clouds had dipped lower when he came back from town, ragged handkerchiefs sliding through the trees. Spills and spoils from the moiling cloud base. She had wanted to be left where he found her, outside the Axel’s Coffee Place. He was past the intersection on the forest road when Reith remembered that he had not remembered, or had never asked, her name. By the time he was on to the forest road he was driving through cloud.\n Death town. Dying slowly and inelegantly. Urban senility. Grey sky grey sea grey people. Every mile he had driven west from the ferry, drawn by the haunt of plastic detritus of apocalypse, he felt the grey settling heavier from him, smothering every energetic or creative thought. His first few weeks—thirty, twenty, however many dollars he could afford a night in the Roosevelt hotel; the obese Hunter day-trading in the back office; sure there’s a shared bathroom but no one’s had to share it in five years—he had to physically drag himself out of sleep and run up and down the corridor to the bathroom a dozen times to Wake! Up! Every creative thought was trawled from pelagic deeps. Baked-good breakfasts in Axel’s Coffee Place; brown-food dinners in the sports bar. Things hauled from the cold north-west sea, tsunami-things, piling up under the tarpaulin in the back of the pickup. Days of deep grey lull. Notion by notion, ideas emerged from the fog of apathy.\n Reith started out of a doze at the flash of lights, followed moments later by the blast of the logging truck, passing at speed. He had been drifting across the line. Many of the truckers scorned headlights in the fog and constantly blared their titanic air horns. The fog was so dense he could hardly see the road markings. A sudden, intense smell of sea, salt, weed invaded the pickup through the air vents. Reith snapped them shut. The fog left white streaks on his windshield, gritty smears flecked with tiny white crystals. The wiper blades squeaked.\n At the house he could taste salt on his tongue, ionic, iodine taste of salt, feel its sting on his lips, its astringency on his face. In the few steps it took to reach the porch his hair, skin, clothes were briny as if he had stepped out of the sea. The air was heavy with sea-smell. Reith blinked salt mist out of his stinging eyes.\n Shower. Reith could feel the grit of salt against his scalp. He stood a long time under the run of hot water, trying to scrub the sea from his skin. Salt fog.\n In the morning the cloud had lifted but windows, porch, yard, car were freckled with salt-specks, a million tiny crystal sparkles.\n A baked-goods breakfast in the Axel’s before heading down to Ruby Beach. A good day’s beach-combing. Like the early days. That would be the thing. Axel’s Coffee Place had changed hands, sold candles, had a book-swap scheme, free Wi-Fi, occasional tarot readings and singer-songwriter nights but all such regime changes were temporary in this town. Their Danish were good, their pain au chocolat too doughy.\n “What about that fog?” Lauren said as she brought Reith a refill. “It like completely rusted up the locks. Just one night. Insania.”\n “The girl.”\n “The one you were in with yesterday?”\n “What do you know about her?”\n “Oh, you mean . . . ” Lauren broke off, pouted, puzzled. “You know, I’m not sure she told me her name. What do you want to know?”\n “Where’s she staying?”\n “Over at the Roosevelt. Doesn’t everyone?”\n “She’s not. I checked. She’s not up at the Westwood Lodge either.”\n “That’s a little bit stalkery, Reith.”\n Lauren was not a friend and never a lover, but there was a tie between Reith and her; a thing of tattoos and piercings, dreads and hair coloring. Counter-culture was their mutual gravity.\n “I’m just interested, that’s all.”\n “Oh really.”\n “Lauren, that’s not necessary.”\n The doorbell clanged. Hunter from the Roosevelt came in for his caffeine hit before going back to losing money online. Reith had not noticed that the low cloud had become rain. His flannel shirt was soaked through in the few steps across the road. He shook his head, manically scraped water from his face and eyes.\n “Goddam,” he said. “Goddam thing.”\n He grabbed a paper towel from the table dispenser and furiously wiped his eyes.\n “Goddam,” he said again. “Can it do that?”\n Lauren poured him coffee at his usual booth.\n “Do what, hons?”\n “Rain sea water.”\n She stood in the salt rain, watching Reith and the courier driver load the truck.\n “Geez, what is this?” the driver had said, blinking sea-sour out of his eyes as Reith answered the door. He came up once a month from the city to pick up installations Reith had sold from his website. He was a peninsula man and took the opportunity to catch up with family. Installations did not spoil and were not time sensitive. He could dawdle with his relatives. Reith liked that even though he did not appreciate the Driftings, he was mindful of them. Even bubble-wrapped and taped, they were delicate; frail corals, tsunami-foam.\n “It’s been doing it for a day and half now,” Reith said. “I’ve had to garage the pickup. Things rust while you’re looking at them.”\n “Evil smell,” the driver said. “Like dead crabs. Have you got a theory?”\n “What?”\n Reith had broken the Marine Boy Drifting down into three sections to get it through the door. Instructions and a video were included for its precise re-assembly at the gallery in Denver. Each Drifting landed a little further from Reith’s door than the last.\n “Everyone needs a theory. Do you know what I think? It’s some kind of water-spout. Things get sucked up and deposited hundreds of miles away. There’s been rains of fish and frogs—all well-accounted for. Newspapers and all. God knows what’s going on out in that ocean.”\n “You think it’s going to start dropping plastic toys on my head?”\n “It’s all in Charles Fort, my friend. A wise man would read and heed.”\n Then he saw her, in the rain, at the place where the pavement met the grass. The rain dripped from the ends of her long, straight hair, but seemed to Reith to run off it without wetting it. Raindrops dewed the fibers of her cardigan.\n “Can you handle this?” he asked the driver.\n “Just sign the waybill and she’s on her way.”\n The girl stood in a circle of drips beneath the fractal fronds of the Ningyo Drifting. She dabbed at herself with the offered towel.\n “You should really have a shower, get that salt off you. It’s not good for you.”\n “I seem to have missed most of it. But it’s nice to be out of it.” The towel was dry. “Can I ask a question?”\n “You can ask anything you like.”\n “At the beach, the things I saw you bring out of the sea, what have you done with them?”\n Reith did not show works in progress to people. Sharing broke the unity. People put ideas onto things that were not theirs. Opinions demanded recognition. And some were too big, too long, too diffuse in their evolution, to make any sense before the moment when he decided that to add one thing more would start to subtract. When he videoed them for his YouTube channel, he never showed the build, the Drifting, the explanation; just long, swooping orbits of the details.\n So he said, “oh, yeah. Here.” He rested a finger on the Puchie deer. He had picked apart its rear end, flayed and splayed it and grafted it on to the chest of a Barbie doll. “Come up pretty good once I got the salt off. That vinyl finish can crack if you don’t treat it like skin. There’s stuff you get for shining up auto interiors, works good on it. Nice piece.”\n The hat was in the former best bedroom with all the headgear. He had not developed an idea for the Drifting that pleased him. But the conceit was faces, a few simple lines in black marker pen, loosely connected to his imagining of the hat’s purpose, drawn on the inside of the hat. This yellow hard hat, Reith had decided, belonged to a longshoreman, who had worked ocean-going barges. In a few strokes the inverted face showed hard-weather, resignation, peace and toughness.\n The child’s trunki had made it to the plastic-well in the kitchen, to the top of that heap, to the work-top for assimilation into the Kanagawa Drifting. It had faltered there.\n “I’m not sure about this one. I think this one is complete. I can’t see how it would fit. It may be the start of something else. I’m thinking about children.”\n The girl ran long fingers over the sand-scratched plastic.\n “What did you do with things inside?”\n “I didn’t throw them away. Nothing gets thrown away. That’s the idea. Nothing is ever lost.”\n A fleece-fiber scarf, a bucket of plastic zoo-animals, a drinks cup with spout, a sea-rotted cardboard picture book sat in a clear plastic box. The animals had been spilled from their bucket. Reith saw the girl inhale very slowly as she bent over the box to closer examine the little castaway menagerie. Her long fingers walked through the lost things.\n “Here’s a story. There once was a little girl but she’s dead now. She drowned. She was in the car with her parents and her big brother. They all brought one thing; that was all they had time for before the sea came. So she brought a thing with things in it. They drove fast but no matter how fast you drive you can only go where the road leads you and the water didn’t need roads. I think we forget how fast water can be. Water has weight and water has mass. The road wouldn’t take them away from the water and it just swept them off the road and tumbled them over and over and spilled everything out and they drowned. I know this story.” She trailed her fingers across the still-sodden pulp of the children’s book. “It’s called Mouse Heart Robot. It’s about a robot who was last to be built before the factory closed, and so they forgot to give him a heart. He just stood there, looking, thinking. Then a family of field mice moved in to the place where his heart should be, and he came to life and looked after them, but when they grew up and moved away, he went dead again. Mice have such short lives. I used to get read that story. The poor robot. I felt so sad for him. There, that’s a story inside a story. Something with a story and a hurt. Give it back.”\n Reith gave a small start. “What?”\n “I don’t know. Maybe you’ve had so much. Like you said, nothing is ever lost. Things have memories. Maybe give some of them back.”\n The doorbell rang. A second startle.\n “Just as well I looked,” the courier said. He presented the waybill. “You forgot to sign it.”\n “I’m sure . . . ” Reith took the pen. The space for the signature was blank. Over the courier’s shoulder, he could the see the girl, walking away, already a distance down the road, very straight and upright, in the salt rain.\n The plants were dying. The floral borders outside Driftwood Crafts, Gifts and Pots; the flower tubs and baskets at the McLaren Realty; the raised beds outside the Westwood Lodge were shriveled. The lawns of 3rd Street were scabbed with brown patches. The tougher shrubs were browning at leaf tip and blossom. The trees shed needles, drift upon drift.\n For five days the salt rain had fallen. Salt water rushed in the gutters, sheeted across roads, clogged drains with rafts of brown needles.\n “Half the dogs in town are sick,” Lauren said pouring coffee for Reith. “And things are coming out of the forest looking for water. Axel chased deer away from the back door. Dead birds all over the place. And he says the propane tank is rusting bad. Why haven’t we made the television news yet?”\n The mail boxes, the barbecues, the garden seats, the swings and chain fences, the kids’ bikes, the garden tools, were turning to rust. The gas station canopy, the elementary school climbing frame, the cell phone relay, the electrical step-down transformer, the oil and gas tanks, the cars, scabbed with creeping rust.\n “And the stink. I just can’t get it out of my hair, my clothes. Off my skin. I smell like a harbor. Like a dead seal.”\n Reith splashed out across the streaming salt-water to the pickup. The air was thick with salt, weed, ozones and ions and briny, iodinic sourness. He gagged. He drove up to the house as around him the town crumbled to ochre rust. Endless parade of low, curdled clouds marched in from the ocean; endless, endless salt rain.\n He thought he glimpsed the girl in the rear-view mirror, standing on the roadside at the edge of the dying forest, arms long at her side, her hair so straight and glossy. When he looked over his shoulder she was not there. Of course.\n He could feel the salt caking on his skin, itching, desiccating in the few steps from the car to the porch. A shower. Fresh water on his body. Cleaning, cleansing, sanctifying. He strewed salt-sodden clothes along the path between the Driftings. The stench was in the house; rotting weed, brine, deep water. He was naked by the time he reached the bathroom door. He closed his eyes and waited for the anointing gush of warm and pure.\n Sea-rot gusted in his face, so strong Reith retched. Salt water blasted in his face, hot salt water filled up his eyes, his ears, his nostrils, his open mouth. He gagged, spat, dived to the water-cooler. He drained a plastic cupful. Reith choked, sprayed water across the room, heaved and heaved; dry, retching, wracking heaves.\n Sea water.\n Reith plunged into the surf line; knee-deep, the water heavy around his thighs; waist-deep, pushing against the resistance of an entire ocean; wading out chest-deep, slow now, every step ponderous and buoyed at the same time. The rain fell steadily, pocking the glassy surface of the slow swell. He held the trunki over his head. Towed behind him on a surf-board line, it would have filled with water and become unmanageable. Held high, it was an offering to the things of salt-water.\n Give it back. Each time he had spoken with the girl, she seemed startled by her own words, as if she were not in control of them, as if other voices formed them.\n Give it back.\n It had to be the beach where he had found it. He drove through grey rain half blind, half-crazed, the wipers throwing handfuls of salty, gritty water from the windshield, the pickup squeaking and creaking as the brine wore into its struts and bones. He slipped-slid down the path between the stark, rain-grey trees to the shore. The driftwood like looked like the bones of the ocean, heaved on to the solid world to see the sun and die. He was sick, so sick of the reek of rot and weed and sea in his sinuses. Into the ocean.\n Reith stood a moment, the plastic child’s trunk held high. He had packed it with the painstaking care of a Drifting maker. The fleece scarf washed and freshened with fabric conditioner and folded. The zoo animals returned to their plastic bucket-Ark, battened down beneath the lid. The drinks cup cleaned and sterilized and filled with Minute-maid. A libation. One thing he had omitted; the book. It was unsalvageable, the story all but erased to patches of Kanji and bright color on grey board: a robot’s head, a mouse paw, a heart-shaped hole. Mouse Heart Robot. It touched him, it made him remember and feel things long washed out. She had loved that story, she used to have it read to her. She felt so sorry for the poor robot. A hole for a heart. The image excited him. Filling holes. Secret chambers, hidden hearts. He could feel the nature of the Driftings changing, from huge assemblages, whip-stitched frankensteins; to small juxtapositions.\n Give it back. It had given to him. The ocean closed around him; grey before and grey behind, above and below, the circle of the waters. Easy to become disoriented, to strike out into open ocean believing horizon line was shore line; drawn out by those tows and currents to join the gyre. Human flotsam.\n “It’s yours!” he shouted. The words were thin and pointless. But he still said, “Thank you!” Then he hurled the trunki as far as he could out into the ocean. It splashed, bobbed, each bob taking it lower in the water as the sea jetted in through the imperfect seal. Reith watched until all that could be seen was a single plastic tiger ear, stealing out to sea, drawn back into the great gyre of tsunami-things.\n Reith drove back slick as a seal in his wet-suit. As he stepped out of the car the air caught him, breath to sigh to near-sob. Clean. Fresh. He turned his face to the clouds and let pure, sweet water fill up its hollows and stream from its angles.\n Mouse Heart Robot: he had a pure, sweet idea for it.\n Reith opened the door.\n The living room was filled with hair. Long, sleek, black hair, hanging from ceiling to floor, sleek black hair, dripping with sea water. The door closed behind Reith. The wet hair rippled, as if someone were moving through it."}