{"fingerprint": "3QXqvKj1BJlukMPOR6EhE2S3c5c=", "sitename": "Clarkesworld Magazine", "title": "Botanica Veneris: Thirteen Papercuts by Ida Countess Rathangan by Ian McDonald", "author": "Ian McDonald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcdonald_12_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Botanica Veneris: Thirteen Papercuts by Ida Countess Rathangan by Ian McDonald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "13140 words, novelette, REPRINT\nBotanica Veneris: Thirteen Papercuts by Ida Countess Rathangan\nINTRODUCTION BY MAUREEN N. GELLARD\nMy mother had firm instructions that in case of a house fire, two things required saving: the family photograph album and the Granville-Hydes. I grew up beneath five original floral papercuts, utterly heedless of their history or their value. It was only in maturity that I came to appreciate, like so many on this and other worlds, my great-aunt’s unique art.\nCollectors avidly seek original Granville-Hydes on those rare occasions when they turn up at auction. Originals sell for tens of thousands of pounds (this would have amused Ida); two years ago, an exhibition at the Victoria and Albert Museum was sold out months in advance. Dozens of anthologies of prints are still in print: the Botanica Veneris, in particular, is in fifteen editions in twenty-three languages, some of them non-Terrene.\nThe last thing the world needs, it would seem, is another Botanica Veneris. Yet the mystery of her final (and only) visit to Venus still intrigues half a century since her disappearance. When the collected diaries, sketchbooks, and field notes came to me after fifty years in the possession of the Dukes of Yoo, I realized that I had a precious opportunity to tell the true story of my great-aunt’s expedition—and of a forgotten chapter in my family’s history. The books were in very poor condition, mildewed and blighted in Venus’ humid, hot climate. Large parts were illegible or simply missing. The narrative was frustratingly incomplete. I have resisted the urge to fill in those blank spaces. It would have been easy to dramatize, fictionalize, even sensationalize. Instead I have let Ida Granville-Hyde speak. Hers is a strong, characterful, attractive voice, of a different class, age, and sensibility from ours, but it is authentic, and it is a true voice.\nThe papercuts, of course, speak for themselves.\nPlate 1: V strutio ambulans: the Ducrot’s Peripatetic Wort, known locally as Daytime Walker (Thent) or Wanderflower (Thekh).\nCut paper, ink and card.\nSuch a show!\nAt lunch, Het Oi-Kranh mentioned that a space-crosser—the Quest for the Harvest of the Stars, a Marsman—was due to splash down in the lagoon. I said I should like to see that—apparently I slept through it when I arrived on this world. It meant forgoing the sorbet course, but one does not come to the Inner Worlds for sorbet! Het Oi-Kranh put his spider-car at our disposal. Within moments, the Princess Latufui and I were swaying in the richly upholstered bubble beneath the six strong mechanical legs. Upward it carried us, up the vertiginous lanes and winding staircases, over the walls and balcony gardens, along the buttresses and roof walks and up the ancient iron ladderways of Ledekh-Olkoi. The islands of the archipelago are small, their populations vast, and the only way for them to build is upward. Ledekh-Olkoi resembles Mont St. Michel vastly enlarged and coarsened. Streets have been bridged and built over into a web of tunnels quite impenetrable to non-Ledekhers. The Hets simply clamber over the homes and lives of the inferior classes in their nimble spider-cars.\nWe came to the belvedere atop the Starostry, the ancient pharos of Ledekh-Olkoi that once guided mariners past the reefs and atolls of the Tol Archipelago. There we clung—my companion, the Princess Latufui, was queasy—vertigo, she claimed, though it might have been the proximity of lunch—the whole of Ledekh-Olkoi beneath us in myriad levels and layers, like the folded petals of a rose.\n“Should we need glasses?” my companion asked.\nNo need! For at the instant, the perpetual layer of gray cloud parted and a bolt of light, like a glowing lance, stabbed down from the sky. I glimpsed a dark object fall though the air, then a titanic gout of water go up like a dozen Niagaras. The sky danced with brief rainbows, my companion wrung her hands in delight—she misses the sun terribly—then the clouds closed again. Rings of waves rippled away from the hull of the space-crosser, which floated like a great whale low in the water, though this world boasts marine fauna even more prodigious than Terrene whales.\nMy companion clapped her hands and cried aloud in wonder.\nIndeed, a very fine sight!\nAlready the tugs were heading out from the protecting arms of Ocean Dock to bring the ship in to berth.\nBut this was not the finest Ledekh-Olkoi had to offer. The custom in the archipelago is to sleep on divan-balconies, for respite from the foul exudations from the inner layers of the city. I had retired for my afternoon reviver—by my watch, though by Venusian Great Day it was still midmorning and would continue to be so for another two weeks. A movement by the leg of my divan. What’s this? My heart surged. V strutio ambulans: the Ambulatory Wort, blindly, blithely climbing my divan!\nThrough my glass, I observed its motion. The fat, succulent leaves hold reserves of water, which fuel the coiling and uncoiling of the three ambulae—surely modified roots—by hydraulic pressure. A simple mechanism, yet human minds see movement and attribute personality and motive. This was not pure hydraulics attracted to light and liquid, this was a plucky little wort on an epic journey of peril and adventure. Over two hours, I sketched the plant as it climbed my divan, crossed to the balustrade, and continued its journey up the side of Ledekh-Olkoi. I suppose at any time millions of such flowers are in constant migration across the archipelago, yet a single Ambulatory Wort was miracle enough for me.\nReviver be damned! I went to my space trunk and unrolled my scissors from their soft chamois wallet. Snip snap! When a cut demands to be made, my fingers literally itch for the blades!\nWhen he learned of my intent, Gen Lahl-Khet implored me not to go down to Ledekh Port, but if I insisted (I insisted: oh I insisted!), at least take a bodyguard or go armed. I surprised him greatly by asking the name of the best armorer his city could supply. Best Shot at the Clarecourt November shoot, ten years on the trot! Ledbekh-Teltai is the most famous gunsmith in the archipelago. It is illegal to import weaponry from off-planet—an impost, I suspect, resulting from the immense popularity of hunting Ishtari janthars. The pistol they have made me is built to my hand and strength: small, as requested; powerful, as required; and so worked with spiral-and-circle Archipelagan intaglio that it is a piece of jewelry.\nLedekh Port was indeed a loathsome bruise of alleys and tunnels, lit by shifts of gray, watery light through high skylights. Such reeks and stenches! Still, no one ever died of a bad smell. An Earthwoman alone in an inappropriate place was a novelty, but from the nonhumanoid Venusians, I drew little more than a look. In my latter years, I have been graced with a physical presence and a destroying stare. The Thekh, descended from Central Asian nomads abducted en masse in the eleventh century from their bracing steppe, now believe themselves the original humanity, and so consider Terrenes beneath them, and they expected no better of a subhuman Earthwoman.\nI did turn heads in the bar. I was the only female—humanoid, that is. From Carfax’s Bestiary of the Inner Worlds, I understand that among the semiaquatic Krid, the male is a small, ineffectual symbiotic parasite lodging in the mantle of the female. The barman, a four-armed Thent, guided me to the snug where I was to meet my contact. The bar overlooked the Ocean Harbor. I watched dockworkers scurry over the vast body of the space-crosser, in and out of hatches that had opened in the skin of the ship. I did not like to see those hatches; they ruined its perfection, the precise, intact curve of its skin.\n“Lady Granville-Hyde?”\nWhat an oily man, so well lubricated that I did not hear his approach.\n“Stafford Grimes, at your service.”\nHe offered to buy me a drink, but I drew the line at that unseemliness. That did not stop him ordering one for himself and sipping it—and several successors—noisily during the course of my questions. Years of Venusian light had turned his skin to wrinkled brown leather: drinker’s eyes looked out from heavily hooded lids—years of squinting into the ultraviolet. His neck and hands were mottled white with pockmarks where melanomas had been frozen out. Sunburn, melancholy, and alcoholism: the classic recipe for honorary consuls systemwide, not just on Venus.\n“Thank you for agreeing to meet me. So, you met him.”\n“I will never forget him. Pearls of Aphrodite. Size of your head, Lady Ida. There’s a fortune waiting for the man . . . ”\n“Or woman,” I chided, and surreptitiously activated the recording ring beneath my glove.\nPlate 2: V flor scopulum: the Ocean Mist Flower. The name is a misnomer: the Ocean Mist Flower is not a flower, but a coral animalcule of the aerial reefs of the Tellus Ocean. The seeming petals are absorption surfaces drawing moisture from the frequent ocean fogs of those latitudes. Pistils and stamen bear sticky palps, which function in the same fashion as Terrene spiderwebs, trapping prey. Venus boasts an entire ecosystem of marine insects unknown on Earth.\nThis cut is the most three-dimensional of Lady Ida’s Botanica Veneris. Reproductions only hint at the sculptural quality of the original. The “petals” have been curled at the edges over the blunt side of a pair of scissors. Each of the 208 palps has been sprung so that they stand proud from the black paper background.\nOnion paper, hard-painted card.\nTHE HONORARY CONSUL’S TALE\nPearls of Aphrodite. Truly, the pearls beyond price. The pearls of Starosts and Aztars. But the cloud reefs are perilous, Lady Ida. Snap a man’s body clean in half, those bivalves. Crush his head like a Vulpeculan melon. Snare a hand or an ankle and drown him. Aphrodite’s Pearls are blood pearls. A fortune awaits anyone, my dear, who can culture them. A charming man, Arthur Hyde—that brogue of his made anything sound like the blessing of heaven itself. Charm the avios from the trees—but natural, unaffected. It was no surprise to learn he was of aristocratic stock. Quality: you can’t hide it. In those days, I owned a company—fishing trips across the archipelago. The legend of the Ourogoonta, the Island that is a Fish, was a potent draw. Imagine hooking one of those! Of course, they never did. No, I’d take them out, show them the cloud reefs, the Krid hives, the wing-fish migration, the air-jellies; get them pissed on the boat, take their photographs next to some thawed-out javelin-fish they hadn’t caught. Simple, easy, honest money. Why wasn’t it enough for me? I had done the trick enough times myself, drink one for the punter’s two, yet I fell for it that evening in the Windward Tavern, drinking hot, spiced kashash and the night wind whistling up in the spires of the dead Krid nest-haven like the caged souls of drowned sailors. Drinking for days down the Great Twilight, his one for my two. Charming, so charming, until I had pledged my boat on his plan. He would buy a planktoneer—an old bucket of a sea skimmer with nary a straight plate or a true rivet in her. He would seed her with spores and send her north on the great circulatory current, like a maritime cloud reef. Five years that current takes to circulate the globe before it returns to the arctic waters that birthed it. Five years is also the time it takes the Clam of Aphrodite to mature—what we call pearls are no such thing. Sperm, Lady Ida. Compressed sperm. In waters, it dissolves and disperses. Each Great Dawn the Tellus Ocean is white with it. In the air, it remains compact—the most prized of all jewels. Enough of fluids. By the time the reef ship reached the deep north, the clams would be mature and the cold water would kill them. It would be a simple task to strip the hulk with high-pressure hoses, harvest the pearls, and bank the fortune.\nFive years makes a man fidgety for his investment. Arthur sent us weekly reports from the Sea Wardens and the Krid argosies. Month on month, year on year, I began to suspect that the truth had wandered far from those chart coordinates. I was not alone. I formed a consortium with my fellow investors and chartered a ’rigible.\nAnd there at Map 60 North, 175 East, we found the ship—or what was left of it, so overgrown was it with Clams of Aphrodite. Our investment had been lined and lashed by four Krid cantoons: as we arrived, they were in the process of stripping it with halberds and grappling hooks. Already the decks and superstructure were green with clam meat and purple with Krid blood. Arthur stood in the stern frantically waving a Cross of St. Patrick flag, gesturing for us to get out, get away.\nKrid pirates were plundering our investment! Worse, Arthur was their prisoner. We were an unarmed aerial gadabout, so we turned tail and headed for the nearest Sea Warden castle to call for aid.\nCharmer. Bloody buggering charmer. I know he’s your flesh and blood, but . . . I should have thought! If he’d been captured by Krid pirates, they wouldn’t have let him wave a bloody flag to warn us.\nWhen we arrived with a constabulary cruiser, all we found was the capsized hulk of the planktoneer and a flock of avios gorging on clam offal. Duped! Pirates my arse—excuse me. Those four cantoons were laden to the gunwales with contract workers. He never had any intention of splitting the profits with us.\nThe last we heard of him, he had converted the lot into Bank of Ishtar bearer bonds—better than gold—at Yez Tok and headed in-country. That was twelve years ago.\nYour brother cost me my business, Lady Granville-Hyde. It was a good business; I could have sold it, made a little pile. Bought a place on Ledekh Syant—maybe even made it back to Earth to see out my days to a decent calendar. Instead . . . Ach, what’s the use. Please believe me when I say that I bear your family no ill will—only your brother. If you do succeed in finding him—and if I haven’t, I very much doubt you will—remind him of that, and that he still owes me.\nPlate 3: V lilium aphrodite: the Archipelago sea lily. Walk-the-Water in Thekh: there is no comprehensible translation from Krid. A ubiquitous and fecund diurnal plant, it grows so aggressively in the Venerian Great Day that by Great Evening bays and harbors are clogged with blossoms and passage must be cleared by special bloom-breaker ships.\nPainted paper, watermarked Venerian tissue, inks, and scissor-scrolled card.\nSo dear, so admirable a companion, the Princess Latufui. She knew I had been stinting with the truth in my excuse of shopping for paper, when I went to see the honorary consul down in Ledekh Port. Especially when I returned without any paper. I busied myself in the days before our sailing to Ishtaria on two cuts—the Sea Lily and the Ocean Mist Flower—even if it is not a flower, according to my Carfax’s Bestiary of the Inner Worlds. She was not fooled by my industry and I felt soiled and venal. All Tongan women have dignity, but the princess possesses such innate nobility that the thought of lying to her offends nature itself. The moral order of the universe is upset. How can I tell her that my entire visit to this world is a tissue of fabrications?\nWeather again fair, with the invariable light winds and interminable gray sky. I am of Ireland, supposedly we thrive on permanent overcast, but even I find myself pining for a glimpse of sun. Poor Latufui: she grows wan for want of light. Her skin is waxy, her hair lusterless. We have a long time to wait for a glimpse of sun: Carfax states that the sky clears partially at the dawn and sunset of Venus’ Great Day. I hope to be off this world by then.\nOur ship, the Seventeen Notable Navigators, is a well-built, swift Krid jaicoona—among the Krid the females are the seafarers, but they equal the males of my world in the richness and fecundity of their taxonomy of ships. A jaicoona, it seems, is a fast catamaran steam packet, built for the archipelago trade. I have no sea legs, but the Seventeen Notable Navigators was the only option that would get us to Ishtaria in reasonable time. Princess Latufui tells me it is a fine and sturdy craft though built to alien dimensions: she has banged her head most painfully several times. Captain Highly-Able-at-Forecasting, recognizing a sister seafarer, engages the princess in lengthy conversations of an island-hopping, archipelagan nature, which remind Latufui greatly of her home islands. The other humans aboard are a lofty Thekh, and Hugo von Trachtenberg, a German in very high regard of himself, of that feckless type who think themselves gentleman adventurers but are little more than grandiose fraudsters. Nevertheless, he speaks Krid (as truly as any Terrene can) and acts as translator between princess and captain. It is a Venerian truth universally recognized that two unaccompanied women travelers must be in need of a male protector. The dreary hours Herr von Trachtenberg fills with his notion of gay chitchat! And in the evenings, the interminable games of Barrington. Von Trachtenberg claims to have gambled the game professionally in the cloud casinos: I let him win enough for the sensation to go to his head, then take him game after game. Ten times champion of the County Kildare mixed bridge championships is more than enough to beat his hide at Barrington. Still he does not get the message—yes, I am a wealthy widow, but I have no interest in jejune Prussians. Thus I retire to my cabin to begin my studies for the crescite dolium cut.\nHas this world a more splendid sight than the harbor of Yez Tok? It is a city most perpendicular, of pillars and towers, masts and spires. The tall funnels of the ships, bright with the heraldry of the Krid maritime families, blend with god-poles and lighthouses and customs towers and cranes of the harbor, which in turn yield to the tower houses and campaniles of the Bourse, the whole rising to merge with the trees of the Ishtarian Littoral Forest—pierced here and there by the conical roofs of the estancias of the Thent zavars and the gilded figures of the star gods on their minarets. That forest also rises, a cloth of green, to break into the rocky palisades of the Exx Palisades. And there—oh how thrilling!—glimpsed through mountain passes unimaginably high, a glittering glimpse of the snows of the altiplano. Snow. Cold. Bliss!\nIt is only now, after reams of purple prose, that I realize what I was trying to say of Yez Tok: simply, it is city as botany—stems and trunks, boles and bracts, root and branch!\nAnd out there, in the city-that-is-a-forest, is the man who will guide me farther in my brother’s footsteps: Mr. Daniel Okiring.\nPlate 4: V crescite dolium: the Gourd of Plenty. A ubiquitous climbing plant of the Ishtari littoral, the Gourd of Plenty is so well adapted to urban environments that it would be considered a weed, but for the gourds, which contains a nectar prized as a delicacy among the coastal Thents. It is toxic to both Krid and humans.\nThe papercut bears a note on the true scale, written in gold ink.\nTHE HUNTER’S TALE\nHave you seen a janthar? Really seen a janthan? Bloody magnificent, in the same way that a hurricane or an exploding volcano is magnificent. Magnificent and appalling. The films can never capture the sense of scale. Imagine a house, with fangs. And tusks. And spines. A house that can hit forty miles per hour. The films can never get the sheer sense of mass and speed—or the elegance and grace—that something so huge can be so nimble, so agile! And what the films can never, ever capture is the smell. They smell of curry. Vindaloo curry. Venerian body chemistry. But that’s why you never, ever eat curry on asjan. Out in the Stalva, the grass is tall enough to hide even a janthar. The smell is the only warning you get. You catch a whiff of vindaloo, you run.\nYou always run. When you hunt janthar, there will always be a moment when it turns, and the janthar hunts you. You run. If you’re lucky, you’ll draw it onto the gunline. If not . . . The ’thones of the Stalva have been hunting them this way for centuries. Coming-of-age thing. Like my own Maasai people. They give you a spear and point you in the general direction of a lion. Yes, I’ve killed a lion. I’ve also killed janthar—and run from even more.\nThe ’thones have a word for it: the pnem. The fool who runs.\nThat’s how I met your brother. He applied to be a pnem for Okiring Asjans. Claimed experience over at Hunderewe with Costa’s hunting company. I didn’t need to call Costa to know he was a bullshitter. But I liked the fellow—he had charm and didn’t take himself too seriously. I knew he’d never last five minutes as a pnem. Took him on as a camp steward. They like the personal service, the hunting types. If you can afford to fly yourself and your friends on a jolly to Venus, you expect to have someone to wipe your arse for you. Charm works on these bastards. He’d wheedle his way into their affections and get them drinking. They’d invite him and before you knew it he was getting their life stories—and a lot more beside—out of them. He was a careful cove too—he’d always stay one drink behind them and be up early and sharp-eyed as a hawk the next morning. Bring them their bed tea. Fluff up their pillows. Always came back with the fattest tip. I knew what he was doing, but he did it so well—I’d taken him on, hadn’t I? So, an aristocrat. Why am I not surprised? Within three trips, I’d made him Maître de la Chasse. Heard he’d made and lost one fortune already . . . is that true? A jewel thief? Why am I not surprised by that either?\nThe Thirtieth Earl of Mar fancied himself as a sporting type. Booked a three-month Grand Asjan; he and five friends, shooting their way up the Great Littoral to the Stalva. Wives, husbands, lovers, personal servants, twenty Thent asjanis and a caravan of forty graapa to carry their bags and baggage. They had one graap just for the champagne—they’d shipped every last drop of it from Earth. Made so much noise we cleared the forest for ten miles around. Bloody brutes—we’d set up hides at water holes so they could blast away from point-blank range. That’s not hunting. Every day they’d send a dozen bearers back with hides and trophies. I’m surprised there was anything left, the amount of metal they pumped into those poor beasts. The stench of rot . . . God! The sky was black with carrion avios.\nYour brother excelled himself: suave, in control, charming, witty, the soul of attention. Oh, most attentive. Especially to the Lady Mar . . . She was no kack-hand with the guns, but I think she tired of the boys-club antics of the gents. Or maybe it was just the sheer relentless slaughter. Either way, she increasingly remained in camp. Where your brother attended to her. Aristocrats—they sniff each other out.\nSo Arthur poled the Lady Mar while we blasted our bloody, brutal, bestial way up onto the High Stalva. Nothing would do the thirtieth earl but to go after janthar. Three out of five asjanis never even come across a janthar. Ten percent of hunters who go for janthar don’t come back. Only ten percent! He liked those odds.\nTwenty-five sleeps we were up there, while Great Day turned to Great Evening. I wasn’t staying for night on the Stalva. It’s not just a different season, it’s a different world. Things come out of sleep, out of dens, out of the ground. No, not for all the fortune of the earls of Mar would I spend night on the Stalva.\nBy then, we had abandoned the main camp. We carried bare rations, sleeping out beside our mounts with one ear tuned to the radio. Then the call came: Janthar sign! An asjani had seen a fresh path through a speargrass meadow five miles to the north of us. In a moment, we were mounted and tearing through the High Stalva. The earl rode like a madman, whipping his graap to reckless speed. Damn fool: of all the Stalva’s many grasslands, the tall pike-grass meadows were the most dangerous. A janthar could be right next to you and you wouldn’t see it. And the pike grass disorients, reflects sounds, turns you around. There was no advising the Earl of Mar and his chums, though. His wife hung back—she claimed her mount had picked up a little lameness. Why did I not say something when Arthur went back to accompany the Lady Mar! But my concern was how to get everyone out of the pike grass alive.\nThen the earl stabbed his shock goad into the flank of his graap, and before I could do anything he was off. My radio crackled—form a gunline! The mad fool was going to run the janthar himself. Aristocrats! Your pardon, ma’am. Moments later, his graap came crashing back through the pike grass to find its herd mates. My only hope was to form a gunline and hope—and pray—that he would lead the janthar right into our cross fire. It takes a lot of ordnance to stop a janthar. And in this kind of tall-grass terrain, where you can hardly see your hand in front of your face, I had to set the firing positions just right so the idiots wouldn’t blow each other to bits.\nI got them into some semblance of position. I held the center—the lakoo. Your brother and the Lady Mar I ordered to take jeft and garoon—the last two positions of the left wing of the gunline. Finally, I got them all to radio silence. The ’thones teach you how to be still, and how to listen, and how to know what is safe and what is death. Silence, then a sustained crashing. My spotter called me, but I did not need her to tell me: that was the sound of death. I could only hope that the earl remembered to run in a straight line, and not to trip over anything, and that the gunline would fire in time . . . a hundred hopes. A hundred ways to die.\nMost terrifying sound in the world, a janthar in full pursuit! It sounds like it’s coming from everywhere at once. I yelled to the gunline; steady there, steady. Hold your fire! Then I smelled it. Clear, sharp: unmistakable. Curry. I put up the cry: Vindaloo! Vindaloo! And there was the mad earl, breaking out of the cane. Madman! What was he thinking! He was in the wrong place, headed in the wrong direction. The only ones who could cover him were Arthur and Lady Mar. And there, behind him: the janthar. Bigger than any I had ever seen. The Mother of All Janthar. The Queen of the High Stalva. I froze. We all froze. We might as well try to kill a mountain. I yelled to Arthur and Lady Mar. Shoot! Shoot now! Nothing. Shoot for the love of all the stars! Nothing. Shoot! Why didn’t they shoot?\nThe ’thones found the Thirtieth Earl of Mar spread over a hundred yards.\nThey hadn’t shot because they weren’t there. They were at it like dogs—your brother and the Lady Mar, back where they had left the party. They hadn’t even heard the janthar.\nStrange woman, the Lady Mar. Her face barely moved when she learned of her husband’s terrible death. Like it was no surprise to her. Of course, she became immensely rich when the will went through. There was no question of your brother’s ever working for me again. Shame. I liked him. But I can’t help thinking that he was as much used as user in that sordid little affair. Did the Lady of Mar murder her husband? Too much left to chance. Yet it was a very convenient accident. And I can’t help but think that the thirtieth earl knew what his lady was up to; and a surfeit of cuckoldry drove him to prove he was a man.\nThe janthar haunted the highlands for years. Became a legend. Every aristo idiot on the Inner Worlds who fancied himself a Great Terrene Hunter went after it. None of them ever got it though it claimed five more lives. The Human-Slayer of the Selva. In the end it stumbled into a ’thone clutch trap and died on a pungi stake, eaten away by gangrene. So we all pass. No final run, no gunline, no trophies.\nYour brother—as I said, I liked him though I never trusted him. He left when the scandal broke—went up-country, over the Stalva into the Palisade country. I heard a rumor he’d joined a mercenary javrost unit, fighting up on the altiplano.\nBotany, is it? Safer business than Big Game.\nPlate 5: V trifex aculeatum: Stannage’s Bird-Eating Trifid. Native of the Great Littoral Forest of Ishtaria. Carnivorous in its habits; it lures smaller, nectar-feeding avios with its sweet exudate, then stings them to death with its whiplike style and sticky, poisoned stigma.\nCutpaper, inks, folded tissue.\nThe princess is brushing her hair. This she does every night, whether in Tonga, or Ireland, on Earth, or aboard a space-crosser, or on Venus. The ritual is invariable. She kneels, unpins, and uncoils her tight bun and lets her hair fall to its natural length, which is to the waist. Then she takes two silver-backed brushes, and, with great and vigorous strokes, brushes her hair from the crown of her head to the tips. One hundred strokes, which she counts in a Tongan rhyme that I very much love to hear.\nWhen she is done, she cleans the brushes, returns them to the baize-lined case, then takes a bottle of coconut oil and works it through her hair. The air is suffused with the sweet smell of coconut. It reminds me so much of the whin flowers of home, in the spring. She works patiently and painstakingly, and when she has finished, she rolls her hair back into its bun and pins it. A simple, dedicated, repetitive task, but it moves me almost to tears.\nHer beautiful hair! How dearly I love my friend Latufui!\nWe are sleeping at a hohvandha, a Thent roadside inn, on the Grand North Road in Canton Hoa in the Great Littoral Forest. Tree branches scratch at my window shutters. The heat, the humidity, the animal noise are all overpowering. We are far from the cooling breezes of the Vestal Sea. I wilt, though Latufui relishes the warmth. The arboreal creatures of this forest are deeper-voiced than in Ireland; bellings and honkings and deep booms. How I wish we could spend the night here—Great Night—for my Carfax tells me that the Ishtarian Littoral Forest contains this world’s greatest concentration of luminous creatures—fungi, plants, animals, and those peculiarly Venerian phyla in between. It is almost as bright as day. I have made some daytime studies of the Star Flower—no Venerian Botanica can be complete without it—but for it to succeed, I must hope that there is a supply of luminous paint at Loogaza, where we embark for the crossing of the Stalva.\nMy dear Latufui has finished now and closed away her brushes in their green baize-lined box. So faithful and true a friend! We met in Nuku’alofa on the Tongan leg of my Botanica of the South Pacific. The king, her father, had issued the invitation—he was a keen collector—and at the reception I was introduced to his very large family, including Latufui, and was immediately charmed by her sense, dignity, and vivacity. She invited me to tea the following day—a very grand affair—where she confessed that as a minor princess, her only hope of fulfilment was in marrying well—an institution in which she had no interest. I replied that I had visited the South Pacific as a time apart from Lord Rathangan—it had been clear for some years that he had no interest in me (nor I in him). We were two noble ladies of compatible needs and temperaments, and there and then we became firmest friends and inseparable companions. When Patrick shot himself and Rathangan passed into my possession, it was only natural that the princess move in with me.\nI cannot conceive of life without Latufui; yet I am deeply ashamed that I have not been totally honest in my motivations for this Venerian expedition. Why can I not trust? Oh secrets! Oh simulations!\nV stellafloris noctecandentis: the Venerian Starflower. Its name is the same in Thent, Thekh, and Krid. Now a popular Terrestrial garden plant, where it is known as glow berry, though the name is a misnomer. Its appearance is a bunch of night-luminous white berries, though the berries are in fact globular bracts, with the bioluminous flower at the center. Selective strains of this flower traditionally provide illumination in Venerian settlements during the Great Night.\nPaper, luminous paint (not reproduced). The original papercut is mildly radioactive.\nBy high train to Camahoo.\nWe have our own carriage. It is of aged gothar wood, still fragrant and spicy. The hammocks do not suit me at all. Indeed, the whole train has a rocking, swaying lollop that makes me seasick. In the caravanserai at Loogaza, the contraption looked both ridiculous and impractical. But here, in the high grass, its ingenuity reveals itself. The twenty-foot-high wheels carry us high above the grass, though I am in fear of grass fires—the steam tractor at the head of the train does throw off the most ferocious pother of soot and embers.\nI am quite content to remain in my carriage and work on my Stalva-grass study—I think this may be most sculptural. The swaying makes for many a slip with the scissor, but I think I have caught the feathery, almost downy nature of the flower heads. Of a maritime people, the princess is at home in this rolling ocean of grass and spends much of her time on the observation balcony, watching the patterns the wind draws across the grasslands.\nIt was there that she fell into conversation with the Honorable Cormac de Buitlear, a fellow Irishman. Inevitably, he ingratiated himself and within minutes was taking tea in our carriage. The Inner Worlds are infested with young men claiming to be the junior sons of minor Irish gentry, but a few minutes’ gentle questioning revealed not only that he was indeed the Honorable Cormac—of the Bagenalstown De Buitlears—but a relative, close enough to know of my husband’s demise, and the scandal of the Blue Empress.\nOur conversation went like this.\nHIMSELF: The Grangegorman Hydes. My father used to knock around with your elder brother—what was he called?\nMYSELF: Richard.\nHIMSELF: The younger brother—wasn’t he a bit of a black sheep? I remember there was this tremendous scandal. Some jewel—a sapphire as big as a thrush’s egg. Yes—that was the expression they used in the papers. A thrush’s egg. What was it called?\nMYSELF: The Blue Empress.\nHIMSELF: Yes! That was it. Your grandfather was presented it by some Martian princess. Services rendered.\nMYSELF: He helped her escape across the Tharsis steppe in the revolution of ’11, then organized the White Brigades to help her regain the Jasper Throne.\nHIMSELF: Your brother, not the old boy. You woke up one morning to find the stone gone and him vanished. Stolen.\nI could see that Princess Latufui found the Honorable Cormac’s bluntness distressing, but if one claims the privileges of a noble family, one must also claim the shames.\nMYSELF: It was never proved that Arthur stole the Blue Empress.\nHIMSELF: No, no. But you know how tongues wag in the country. And his disappearance was, you must admit, timely. How long ago was that now? God, I must have been a wee gossoon.\nMYSELF: Fifteen years.\nHIMSELF: Fifteen years! And not a word? Do you know if he’s even alive?\nMYSELF: We believe he fled to the Inner Worlds. Every few years we hear of a sighting, but most of them are so contrary, we dismiss them. He made his choice. As for the Blue Empress: broken up and sold long ago, I don’t doubt.\nHIMSELF: And here I find you on a jaunt across one of the Inner Worlds.\nMYSELF: I am creating a new album of papercuts. The Botanica Veneris.\nHIMSELF: Of course. If I might make so bold, Lady Rathangan: the Blue Empress: do you believe Arthur took it?\nAnd I made him no verbal answer but gave the smallest shake of my head.\nPrincess Latufui had been restless all this evening—the time before sleep, that is: Great Evening was still many Terrene days off. Can we ever truly adapt to the monstrous Venerian calendar? Arthur has been on this world for fifteen years—has he drifted not just to another world, but another clock, another calendar? I worked on my Stalva-grass cut—I find that curving the leaf-bearing nodes gives the necessary three-dimensionality—but my heart was not in it. Latufui sipped at tea and fumbled at stitching and pushed newspapers around until eventually she threw open the cabin door in frustration and demanded that I join her on the balcony.\nThe rolling travel of the high train made me grip the rail for dear life, but the high plain was as sharp and fresh as if starched, and there, a long line on the horizon beyond the belching smokestack and pumping pistons of the tractor, were the Palisades of Exx: a gray wall from one horizon to the other. Clouds hid the peaks, like a curtain lowered from the sky.\nDark against the gray mountains, I saw the spires of the observatories of Camahoo. This was the Thent homeland; and I was apprehensive, for among those towers and minarets is a hoondahvi, a Thent opium den, owned by the person who might be able to tell me the next part of my brother’s story—a story increasingly disturbing and dark. A person who is not human.\n“Ida, dear friend. There is a thing I must ask you.”\n“Anything, dear Latufui.”\n“I must tell you, it is not a thing that can be asked softly.”\nMy heart turned over in my chest. I knew what Latufui would ask.\n“Ida: have you come to this world to look for your brother?”\nShe did me the courtesy of a direct question. No preamble, no preliminary sifting through her doubts and evidences. I owed it a direct answer.\n“Yes,” I said. “I have come to find Arthur.”\n“I thought so.”\n“For how long?”\n“Since Ledekh-Olkoi. Ah, I cannot say the words right. When you went to get papers and gum and returned empty-handed.”\n“I went to see a Mr. Stafford Grimes. I had information that he had met my brother soon after his arrival on this world. He directed me to Mr. Okiring, a retired asjan-hunter in Yez Tok.”\n“And Cama-oo? Is this another link in the chain?”\n“It is. But the Botanica is no sham. I have an obligation to my backers—you know the state of my finances as well as I, Latufui. The late Count Rathangan was a profligate man. He ran the estate into the ground.”\n“I could wish you had trusted me. All those weeks of planning and organizing. The maps, the itineraries, the tickets, the transplanetary calls to agents and factors. I was so excited! A journey to another world! But for you, there was always something else. None of that was the whole truth. None of it was honest.”\n“Oh, my dear Latufui . . . ” But how could I say that I had not told her because I feared what Arthur might have become. Fears that seemed to be borne out by every ruined life that had touched his. What would I find? Did anything remain of the wild, carefree boy I remembered chasing old Bunty the dog across the summer lawns of Grangegorman? Would I recognize him? Worse, would he listen to me? “There is a wrong to right. An old debt to be canceled. It’s a family thing.”\n“I live in your house but not in your family,” Princess Latufui said. Her words were barbed with truth. They tore me. “We would not do that in Tonga. Your ways are different. And I thought I was more than a companion.”\n“Oh, my dear Latufui.” I took her hands in mine. “My dear dear Latufui. Your are far far more to me than a companion. You are my life. But you of all people should understand my family. We are on another world, but we are not so far from Rathangan, I think. I am seeking Arthur, and I do not know what I will find, but I promise you, what he says to me, I will tell to you. Everything.”\nNow she laid her hands over mine, and there we stood, cupping hands on the balcony rail, watching the needle spires of Camahoo rise from the grass spears of the Stalva.\nV vallumque foenum: Stalva Pike Grass. Another non-Terrene that is finding favor in Terrestrial ornamental gardens. Earth never receives sufficient sunlight for it to attain its full Stalva height. Yetten in the Stalva Thent dialect.\nCard, onionskin paper, corrugated paper, paint. This papercut is unique in that it unfolds into three parts. The original, in the Chester Beatty Library in Dublin, is always displayed unfolded.\nTHE MERCENARY’S TALE\nIn the name of the leader of the starry skies and the Ever-Circling Spiritual Family, welcome to my hoondahvi. May apsas speak; may gavanda sing, may the thoo impart their secrets!\nI understand completely that you have not come to drink. But the greeting is standard. We pride ourself on being the most traditional hoondahvi in Exxaa Canton.\nIs the music annoying? No? Most Terrenes find it aggravating. It’s an essential part of the hoondahvi experience, I am afraid.\nYour brother, yes. How could I forget him? I owe him my life.\nHe fought like a man who hated fighting. Up on the altiplano, when we smashed open the potteries and set the Porcelain Towns afire up and down the Valley of the Kilns, there were those who blazed with love and joy at the slaughter and those whose faces were so dark it was as if their souls were clogged with soot. Your brother was one of those. Human expressions are hard for us to read—your faces are wood, like masks. But I saw his face and knew that he loathed what he did. That was what made him the best of javrosts. I am an old career soldier; I have seen many many come to our band. The ones in love with violence: unless they can take discipline, we turn them away. But when a mercenary hates what he does for his silver, there must be a greater darkness driving him. There is a thing they hate more than the violence they do.\nAre you sure the music is tolerable? Our harmonies and chord patterns apparently create unpleasant electrical resonance in the human brain. Like small seizures. We find it most reassuring. Like the rhythm of the kittening womb.\nYour brother came to us in the dawn of Great Day 6817. He could ride a graap, bivouac, cook, and was handy with both bolt and blade. We never ask questions of our javrosts—in time they answer them all themselves—but rumors blow on the wind like thagoon down. He was a minor aristocrat, he was a gambler; he was a thief, he was a murderer; he was a seducer, he was a traitor. Nothing to disqualify him. Sufficient to recommend him.\nIn Old Days the Duke of Yoo disputed mightily with her neighbor the Duke of Hetteten over who rightly ruled the altiplano and its profitable potteries. From time immemorial, it had been a place beyond: independently minded and stubborn of spirit, with little respect for gods or dukes. Wars were fought down generations, laying waste to fames and fortunes, and when in the end, the House of Yoo prevailed, the peoples of the plateau had forgotten they ever had lords and mistresses and debts of fealty. It is a law of earth and stars alike that people should be well governed, obedient, and quiet in their ways, so the Duke of Yoo embarked on a campaign of civil discipline. Her house corps had been decimated in the Porcelain Wars, so House Yoo hired mercenaries. Among them, my former unit, Gellet’s Javrosts.\nThey speak of us still, up on the plateau. We are the monsters of their Great Nights, the haunters of their children’s dreams. We are legend. We are Gellet’s Javrosts. We are the new demons.\nFor one Great Day and Great Night, we ran free. We torched the topless star shrines of Javapanda and watched them burn like chimneys. We smashed the funerary jars and trampled the bones of the illustrious dead of Toohren. We overturned the houses of the holy, burned elders and kits in their homes. We lassoed rebels and dragged them behind our graapa, round and round the village, until all that remained was a bloody rope. We forced whole communities from their homes, driving them across the altiplano until the snow heaped their bodies. And Arthur was at my side. We were not friends—there is too much history on this world for human and Thent ever to be that. He was my badoon. You do not have a concept for it, let alone a word. A passionate colleague. A brother who is not related. A fellow devotee . . .\nWe killed and we killed and we killed. And in our wake came the Duke of Yoo’s soldiers—restoring order, rebuilding towns, offering defense against the murderous renegades. It was all strategy. The Duke of Yoo knew the plateauneers would never love her, but she could be their savior. Therefore, a campaign of final outrages was planned. Such vileness! We were ordered to Glehenta, a pottery town at the head of Valley of the Kilns. There we would enter the glotoonas—the birthing creches—and slaughter every infant down to the last kit. We rode, Arthur at my side, and though human emotions are strange and distant to me, I knew them well enough to read the storm in his heart. Night snow was falling as we entered Glehenta, lit by ten thousand starflowers. The people locked their doors and cowered from us. Through the heart of town we rode; past the great conical kilns, to the glotoonas. Matres flung themselves before our graapa—we rode them down. Arthur’s face was darker than the Great Midnight. He broke formation and rode up to Gellet himself. I went to him. I saw words between your brother and our commander. I did not hear them. Then Arthur drew his blasket and in a single shot blew the entire top of Gellet’s body to ash. In the fracas, I shot down three of our troop; then we were racing through the glowing streets, our hooves clattering on the porcelain cobbles, the erstwhile Gellet’s Javrosts behind us.\nAnd so we saved them. For the Duke of Yoo had arranged it so that her Ducal Guard would fall upon us even as we attacked, annihilate us, and achieve two notable victories: presenting themselves as the saviors of Glehenta and destroying any evidence of their scheme. Your brother and I sprung the trap. But we did not know until leagues and months later, far from the altiplano. At the foot of the Ten Thousand Stairs, we parted—we thought it safer. We never saw each other again though I heard he had gone back up the stairs, to the Pelerines. And if you do find him, please don’t tell him what became of me. This is a shameful place.\nAnd I am ashamed that I have told you such dark and bloody truths about your brother. But at the end, he was honorable. He was right. That he saved the guilty—an unintended consequence. Our lives are made up of such.\nCertainly, we can continue outside on the hoondahvi porch. I did warn you that the music was irritating to human sensibilities.\nV lucerna vesperum: Schaefferia: the Evening Candle. A solitary tree of the foothills of the Exx Palisades of Ishtaria, the Schaefferia is noted for its many upright, luminous blossoms, which flower in Venerian Great Evening and Great Dawn.\nOnly the blossoms are reproduced. Card, folded and cut tissue, luminous paint (not reproduced). The original is also slightly radioactive.\nA cog railway runs from Camahoo Terminus to the Convent of the Starry Pelerines. The Starsview Special takes pilgrims to see the stars and planets. Our carriage is small, luxurious, intricate, and ingenious in that typically Thent fashion, and terribly tedious. The track has been constructed in a helix inside Awk Mountain, so our journey consists of interminable, noisy spells inside the tunnel, punctuated by brief, blinding moments of clarity as we emerge onto the open face of the mountain. Not for the vertiginous!\nThus, hour upon hour, we spiral our way up Mount Awk.\nPrincess Latufui and I play endless games of Moon Whist, but our minds are not in it. My forebodings have darkened after my conversation with the Thent hoondahvi owner in Camahoo. The princess is troubled by my anxiety. Finally, she can bear it no more.\n“Tell me about the Blue Empress. Tell me everything.”\nI grew up with two injunctions in case of fire: save the dogs and the Blue Empress. For almost all my life, the jewel was a ghost stone—present but unseen, haunting Grangegorman and the lives it held. I have a memory from earliest childhood of seeing the stone—never touching it—but I do not trust the memory. Imaginings too easily become memories, memories imaginings.\nWe are not free in so many things, we of the landed class. Richard would inherit, Arthur would make a way in the worlds, and I would marry as well as I could—land to land. The Barony of Rathangan was considered one of the most desirable in Kildare, despite Patrick’s seeming determination to drag it to the bankruptcy court. A match was made, and he was charming and bold; a fine sportsman and a very handsome man. It was an equal match: snide comments from both halves of the county. The Blue Empress was part of my treasure—on the strict understanding that it remain in the custody of my lawyers. Patrick argued—and it was there that I first got an inkling of his true character—and the wedding was off the wedding was on the wedding was off the wedding was on again and the banns posted. A viewing was arranged, for his people to itemize and value the Hyde treasure. For the first time in long memory, the Blue Empress was taken from its safe and displayed to human view. Blue as the wide Atlantic it was, and as boundless and clear. You could lose yourself forever in the light inside that gem. And yes, it was the size of a thrush’s egg.\nAnd then the moment that all the stories agree on: the lights failed. Not so unusual at Grangegorman—the same grandfather who brought back the Blue Empress installed the hydro plant—and when they came back on again; the sapphire was gone: baize and case and everything.\nWe called upon the honor of all present, ladies and gentlemen alike. The lights would be put out for five minutes, and when they were switched back on, the Blue Empress would be back in the Hyde treasury. It was not. Our people demanded we call the police, Patrick’s people, mindful of their client’s attraction to scandal, were less insistent. We would make a further appeal to honor: if the Blue Empress was not back by morning, then we would call the guards.\nNot only was the Blue Empress still missing, so was Arthur.\nWe called the Garda Siochana. The last we heard was that Arthur had left for the Inner Worlds.\nThe wedding went ahead. It would have been a greater scandal to call it off. We were two families alike in notoriety. Patrick could not let it go: he went to his grave believing that Arthur and I had conspired to keep the Blue Empress out of his hands. I have no doubt that Patrick would have found a way of forcing me to sign over possession of the gem to him and would have sold it. Wastrel.\nAs for the Blue Empress: I feel I am very near to Arthur now. One cannot run forever. We will meet, and the truth will be told.\nThen light flooded our carriage as the train emerged from the tunnel onto the final ramp and there, before us, its spires and domes dusted with snow blown from the high peaks, was the Convent of the Starry Pelerines.\nV aquilonis vitis visionum: the Northern Littoral, or Ghost Vine. A common climber of the forests of the southern slopes of the Ishtari altiplano, domesticated and widely grown in Thent garden terraces. Its white, trumpet-shaped flowers are attractive, but the plant is revered for its berries. When crushed, the infused liquor known as pula creates powerful auditory hallucinations in Venerian physiology and forms the basis of the Thent mystical hoondahvi cult. In Terrenes, it produces a strong euphoria and a sense of omnipotence.\nAlkaloid-infused paper. Ida Granville-Hyde used Thent Ghost-Vine liquor to tint and infuse the paper in this cut. It is reported to be still mildly hallucinogenic.\nTHE PILGRIM’S TALE\nYou’ll come out onto the Belvedere? It’s supposed to be off-limits to Terrenes—technically blasphemy—sacred space and all that—but the pelerines turn a blind eye. Do excuse the cough . . . ghastly, isn’t it? Sounds like a bag of bloody loose change. I don’t suppose the cold air does much for my dear old alveoli, but at this stage it’s all a matter of damn.\nThat’s Gloaming Peak there. You won’t see it until the cloud clears. Every Great Evening, every Great Dawn, for a few Earth-days at a time, the cloud breaks. It goes up, oh so much farther than you could ever imagine. You look up, and up, and up—and beyond it, you see the stars. That’s why the pelerines came here. Such a sensible religion. The stars are gods. One star, one god. Simple. No faith, no heaven, no punishment, no sin. Just look up and wonder. The Blue Pearl: that’s what they call our Earth. I wonder if that’s why they care for us. Because we’re descended from divinity? If only they knew! They really are very kind.\nExcuse me. Bloody marvelous stuff, this Thent brew. I’m in no pain at all. I find it quite reassuring that I shall slip from this too too rancid flesh swaddled in a blanket of beatific thoughts and analgesic glow. They’re very kind, the pelerines. Very kind.\nNow, look to your right. There. Do you see? That staircase, cut into the rock, winding up up up. The Ten Thousand Stairs. That’s the old way to the altiplano. Everything went up and down those steps: people, animals, goods, palanquins and stick-stick men, traders and pilgrims and armies. Your brother. I watched him go, from this very belvedere. Three years ago, or was it five? You never really get used to the Great Day. Time blurs.\nWe were tremendous friends, the way that addicts are. You wouldn’t have come this far without realizing some truths about your brother. Our degradation unites us. Dear thing. How we’d set the world to rights, over flask after flask of this stuff! He realized the truth of this place early on. It’s the way to the stars. God’s waiting room. And we, this choir of shambling wrecks, wander through it, dazzled by our glimpses of the stars. But he was a dear friend, a dear dear friend. Dear Arthur.\nWe’re all darkened souls here, but he was haunted. Things done and things left undone, like the prayer book says. My father was a vicar—can’t you tell? Arthur never spoke completely about his time with the javrosts. He hinted—I think he wanted to tell me, very much, but was afraid of giving me his nightmares. That old saw about a problem shared being a problem halved? Damnable lie. A problem shared is a problem doubled. But I would find him up here all times of the Great Day and Night, watching the staircase and the caravans and stick convoys going up and down. Altiplano porcelain, he’d say. Finest in all the worlds. So fine you can read the Bible through it. Every cup, every plate, every vase and bowl, was portered down those stairs on the shoulders of a stickman. You know he served up on the altiplano, in the Duke of Yoo’s Pacification. I wasn’t here then, but Aggers was, and he said you could see the smoke going up—endless plumes of smoke, so thick the sky didn’t clear and the pelerines went for a whole Great Day without seeing the stars. All Arthur would say about it was, that’ll make some fine china. That’s what made porcelain from the Valley of the Kilns so fine: bones—the bones of the dead, ground up into powder. He would never drink from a Valley cup—he said it was drinking from a skull.\nHere’s another thing about addicts—you never get rid of it. All you do is replace one addiction with another. The best you can hope for is that it’s a better addiction. Some become god addicts, some throw themselves into worthy deeds, or self-improvement, or fine thoughts, or helping others, God help us all. Me, my lovely little vice is sloth—I really am an idle little bugger. It’s so easy, letting the seasons slip away; slothful days and indolent nights, coughing my life up one chunk at a time. For Arthur, it was the visions. Arthur saw wonders and horrors, angels and demons, hopes and fears. True visions—the things that drive men to glory or death. Visionary visions. It lay up on the altiplano, beyond the twists and turns of the Ten Thousand Steps. I could never comprehend what it was, but it drove him. Devoured him. Ate his sleep, ate his appetite, ate his body and his soul and his sanity.\nIt was worse in the Great Night . . . Everything’s worse in the Great Night. The snow would come swirling down the staircase and he saw things in it—faces—heard voices. The faces and voices of the people who had died, up there on the altiplano. He had to follow them, go up, into the Valley of the Kilns, where he would ask the people to forgive him—or kill him.\nAnd he went. I couldn’t stop him—I didn’t want to stop him. Can you understand that? I watched him from this very belvedere. The pelerines are not our warders, any of us is free to leave at any time though I’ve never seen anyone leave but Arthur. He left in the evening, with the lilac light catching Gloaming Peak. He never looked back. Not a glance to me. I watched him climb the steps to that bend there. That’s where I lost sight of him. I never saw or heard of him again. But stories come down the stairs with the stickmen and they make their way even to this little aerie, stories of a seer—a visionary. I look and I imagine I see smoke rising, up there on the altiplano.\nIt’s a pity you won’t be here to see the clouds break around the Gloaming, or look at the stars.\nV genetric nives: Mother-of-snows (direct translation from Thent). Ground-civer hi-alpine of the Exx Palisades. The plant forms extensive carpets of thousands of minute white blossoms.\nThe most intricate papercut in the Botanica Veneris. Each floret is three millimeters in diameter. Paper, ink, gouache.\nA high-stepping spider-car took me up the Ten Thousand Steps, past caravans of stickmen, spines bent, shoulders warped beneath brutal loads of finest porcelain.\nThe twelve cuts of the Botanica Veneris I have given to the princess, along with descriptions and botanical notes. She would not let me leave, clung to me, wracked with great sobs of loss and fear. It was dangerous; a sullen land with Great Night coming. I could not convince her of my reason for heading up the stairs alone, for they did not convince even me. The one, true reason I could not tell her. Oh, I have been despicable to her! My dearest friend, my love. But worse even than that, false.\nShe stood watching my spider-car climb the steps until a curve in the staircase took me out of her sight. Must the currency of truth always be falsehood?\nNow I think of her spreading her long hair out, and brushing it, firmly, directly, beautifully, and the pen falls from my fingers . . .\nEgayhazy is a closed city; hunched, hiding, tight. Its streets are narrow, its buildings lean toward one another; their gables so festooned with starflower that it looks like a perpetual festival. Nothing could be further from the truth: Egayhazy is an angry city, aggressive and cowed: sullen. I keep my Ledbekh-Teltai in my bag. But the anger is not directed at me, though from the story I heard at the Camahoo hoondahvi, my fellow humans on this world have not graced our species. It is the anger of a country under occupation. On walls and doors, the proclamations of the Duke of Yoo are plastered layer upon layer: her pennant, emblazoned with the four white hands of House Yoo, flies from public buildings, the radio-station mast, tower tops, and the gallows. Her Javrosts patrol streets so narrow that their graapa can barely squeeze through them. At their passage, the citizens of Egayhazy flash jagged glares, mutter altiplano oaths. And there is another sigil: an eight-petaled flower; a blue so deep it seems almost to shine. I see it stenciled hastily on walls and doors and the occupation-force posters. I see it in little badges sewn to the quilted jackets of the Egayhazians; and in tiny glass jars in low-set windows. In the market of Yent, I witnessed Javrosts overturn and smash a vegetable stall that dared to offer a few posies of this blue bloom.\nThe staff at my hotel were suspicious when they saw me working up some sketches from memory of this blue flower of dissent. I explained my work and showed some photographs and asked, what was this flower? A common plant of the high altiplano, they said. It grows up under the breath of the high snow; small and tough and stubborn. Its most remarkable feature is that it blooms when no other flower does—in the dead of the Great Night. The Midnight Glory was one name though it had another, newer, which entered common use since the occupation: the Blue Empress.\nI knew there and then that I had found Arthur.\nA pall of sulfurous smoke hangs permanently over the Valley of Kilns, lit with hellish tints from the glow of the kilns below. A major ceramics center on a high, treeless plateau? How are the kilns fueled? Volcanic vents do the firing, but they turn this long defile in the flank of Mount Tooloowera into a little hell of clay, bones, smashed porcelain, sand, slag, and throat-searing sulfur. Glehenta is the last of the Porcelain Towns, wedged into the head of the valley, where the river Iddis still carries a memory of freshness and cleanliness. The pottery houses, like upturned vases, lean toward one another like companionable women.\nAnd there is the house to which my questions guided me: as my informants described; not the greatest but perhaps the meanest; not the foremost but perhaps the most prominent, tucked away in an alley. From its roof flies a flag, and my breath caught: not the Four White Hands of Yoo—never that, but neither the Blue Empress. The smoggy wind tugged at the hand-and-dagger of the Hydes of Grangegorman.\nSwift action: to hesitate would be to falter and fail, to turn and walk away, back down the Valley of the Kilns and the Ten Thousand Steps. I rattle the ceramic chimes. From inside, a huff and sigh. Then a voice: worn ragged, stretched and tired, but unmistakable.\n“Come on in. I’ve been expecting you.”\nV crepitant movebitvolutans: Wescott’s Wandering Star. A wind-mobile vine, native of the Ishtaria altiplano, that grows into a tight spherical web of vines which, in the Venerian Great Day, becomes detached from an atrophied root stock and rolls cross-country, carried on the wind. A central calyx contains woody nuts that produce a pleasant rattling sound as the Wandering Star is in motion.\nCut paper, painted, layed, and gummed. Perhaps the most intricate of the Venerian papercuts.\nTHE SEER’S STORY\nTea?\nI have it sent up from Camahoo when the stickmen make the return trip. Proper tea. Irish breakfast. It’s very hard to get the water hot enough at this altitude, but it’s my little ritual. I should have asked you to bring some. I’ve known you were looking for me from the moment you set out from Loogaza. You think anyone can wander blithely into Glehenta?\nTea.\nYou look well. The years have been kind to you. I look like shit. Don’t deny it. I know it. I have an excuse. I’m dying, you know. The liquor of the vine—it takes as much as it gives. And this world is hard on humans. The Great Days—you never completely adjust—and the climate: if it’s not the thin air up here, it’s the molds and fungi and spores down there. And the ultraviolet. It dries you out, withers you up. The town healer must have frozen twenty melanomas off me. No, I’m dying. Rotten inside. A leather bag of mush and bones. But you look very well, Ida. So, Patrick shot himself? Fifteen years too late, says I. He could have spared all of us . . . enough of that. But I’m glad you’re happy. I’m glad you have someone who cares, to treat you the way you should be treated.\nI am the Merciful One, the Seer, the Prophet of the Blue Pearl, the Earth Man, and I am dying.\nI walked down that same street you walked down. I didn’t ride, I walked, right through the center of town. I didn’t know what to expect. Silence. A mob. Stones. Bullets. To walk right through and out the other side without a door opening to me. I almost did. At the very last house, the door opened and an old man came out and stood in front of me so that I could not pass. “I know you.” He pointed at me. “You came the night of the Javrosts.” I was certain then that I would die, and that seemed not so bad a thing to me. “You were the merciful one, the one who spared our young.” And he went into the house and brought me a porcelain cup of water and I drank it down, and here I remain. The Merciful One.\nThey have decided that I am to lead them to glory, or, more likely, to death. It’s justice, I suppose. I have visions you see—pula flashbacks. It works differently on Terrenes than Thents. Oh, they’re hardheaded enough not to believe in divine inspiration or any of that rubbish. They need a figurehead—the repentant mercenary is a good role, and the odd bit of mumbo jumbo from the inside of my addled head doesn’t go amiss.\nIs your tea all right? It’s very hard to get the water hot enough this high. Have I said that before? Ignore me—the flashbacks. Did I tell you I’m dying? But it’s good to see you; oh how long is it?\nAnd Richard? The children? And Grangegorman? And is Ireland . . . of course. What I would give for an eyeful of green, for a glimpse of summer sun, a blue sky.\nSo, I have been a con man and a lover, a soldier and an addict, and now I end my time as a revolutionary. It is surprisingly easy. The Group of Seven Altiplano Peoples’ Liberation Army does the work: I release gnomic pronouncements that run like grass fire from here to Egayhazy. I did come up with the Blue Empress motif: the Midnight Glory: blooming in the dark, under the breath of the high snows. Apt. They’re not the most poetic of people, these potters. We drove the Duke of Yoo from the Valley of the Kilns and the Ishtar Plain: she is resisted everywhere, but she will not relinquish her claim on the altiplano so lightly. You’ve been in Egayhazy—you’ve seen the forces she’s moving up here. Armies are mustering, and my agents report ’rigibles coming through the passes in the Palisades. An assault will come. The Duke has an alliance with House Shorth—some agreement to divide the altiplano up between them. We’re outnumbered. Outmaneuvered and outsupplied, and we have nowhere to run. They’ll be at each other’s throats within a Great Day, but that’s a matter of damn for us. The Duke may spare the kilns—they’re the source of wealth. Matter of damn to me. I’ll not see it, one way or other. You should leave, Ida. Pula and local wars—never get sucked into them.\nAh. Unh. Another flashback. They’re getting briefer, but more intense.\nIda, you are in danger. Leave before night—they’ll attack in the night. I have to stay. The Merciful One, the Seer, the Prophet of the Blue Pearl, can’t abandon his people. But it was good, so good of you to come. This is a terrible place. I should never have come here. The best traps are the slowest. In you walk, through all the places and all the lives and all the years, never thinking that you are already in the trap, then you go to turn around, and it has closed behind you. Ida, go as soon as you can . . . go right now. You should never have come. But . . . oh, how I hate the thought of dying up here on this terrible plain! To see Ireland again . . .\nV volanti musco: Altiplano Air-moss. The papercut shows part of a symbiotic lighter-than-air creature of the Ishtari altiplano. The plant part consists of curtains of extremely light hanging moss that gather water from the air and low clouds. The animal part is not reproduced.\nShredded paper, gum.\nHe came to the door of his porcelain house, leaning heavily on a stick, a handkerchief pressed to mouth and nose against the volcanic fumes. I had tried to plead with him to leave, but whatever else he has become, he is a Hyde of Grangegorman, and stubborn as an old donkey. There is a wish for death in him; something old and strangling and relentless with the gentlest eyes.\n“I have something for you,” I said, and I gave him the box without ceremony.\nHis eyebrows rose when he opened it.\n“Ah.”\n“I stole the Blue Empress.”\n“I know.”\n“I had to keep it out of Patrick’s hands. He would have broken and wasted it, like he broke and wasted everything.” Then my slow mind, so intent on saying this confession right, that I had practiced on the space-crosser, and in every room and every mode of conveyance on my journey across this world, flower to flower, story to story: my middle-aged mind tripped over Arthur’s two words. “You knew?”\n“All along.”\n“You never thought that maybe Richard, maybe Father, or Mammy, or one of the staff had taken it?”\n“I had no doubt that it was you, for those very reasons you said. I chose to keep your secret, and I have.”\n“Arthur, Patrick is dead, Rathangan is mine. You can come home now.”\n“Ah, if it were so easy!”\n“I have a great forgiveness to ask from you, Arthur.”\n“No need. I did it freely. And do you know what, I don’t regret what I did. I was notorious—the Honorable Arthur Hyde, jewel thief and scoundrel. That has currency out in the worlds. It speaks reams that none of the people I used it on asked to see the jewel, or the fortune I presumably had earned from selling it. Not one. Everything I have done, I have done on reputation alone. It’s an achievement. No, I won’t go home, Ida. Don’t ask me to. Don’t raise that phantom before me. Fields of green and soft Kildare mornings. I’m valued here. The people are very kind. I’m accepted. I have virtues. I’m not the minor son of Irish gentry with no land and the arse hanging out of his pants. I am the Merciful One, the Prophet of the Blue Pearl.”\n“Arthur, I want you to have the jewel.”\nHe recoiled as if I had offered him a scorpion.\n“I will not have it. I will not touch it. It’s an ill-favored thing. Unlucky. There are no sapphires on this world. You can never touch the Blue Pearl. Take it back to the place it came from.”\nFor a moment, I wondered if he was suffering from another one of his hallucinating seizures. His eyes, his voice were firm.\n“You should go, Ida. Leave me. This is my place now. People have tremendous ideas of family—loyalty and undying love and affection: tremendous expectations and ideals that drive them across worlds to confess and receive forgiveness. Families are whatever works. Thank you for coming. I’m sorry I wasn’t what you wanted me to be. I forgive you—though as I said there is nothing to forgive. There. Does that make us a family now? The Duke of Yoo is coming, Ida. Be away from here before that. Go. The townspeople will help you.”\nAnd with a wave of his handkerchief, he turned and closed his door to me.\nI wrote that last over a bowl of altiplano mate at the stickmen’s caravanserai in Yelta, the last town in the Valley of the Kilns. I recalled every word, clearly and precisely. Then I had an idea; as clear and precise as my recall of that sad, unresolved conversation with Arthur. I turned to my valise of papers, took out my scissors and a sheet of the deepest indigo and carefully, from memory, began to cut. The stickmen watched curiously, then with wonder. The clean precision of the scissors, so fine and intricate, the difficulty and accuracy of the cut, absorbed me entirely. Doubts fell from me: why had I come to this world? Why had I ventured alone into this noisome valley? Why had Arthur’s casual acceptance of what I had done, the act that shaped both his life and mine, so disappointed me? What had I expected from him? Snip went the scissors, fine curls of indigo paper fell from them onto the table. It had always been the scissors I turned to when the ways of men grew too much. It was a simple cut. I had the heart of it right away, no false starts, no new beginnings. Pure and simple. My onlookers hummed in appreciation. Then I folded the cut into my diary, gathered up my valises, and went out to the waiting spider-car. The eternal clouds seem lower today, like a storm front rolling in. Evening is coming.\nI write quickly, briefly.\nThose are no clouds. Those are the ’rigibles of the Duke of Yoo. The way is shut. Armies are camped across the altiplano. Thousands of soldiers and javrosts. I am trapped here. What am I to do? If I retreat to Glehenta, I will meet the same fate as Arthur and the Valley people—if they even allow me to do that. They might think that I was trying to carry a warning. I might be captured as a spy. I do not want to imagine how the Duke of Yoo treats spies. I do not imagine my Terrene identity will protect me. And the sister of the Seer, the Blue Empress! Do I hide in Yelta and hope that they will pass me by? But how could I live with myself knowing that I had abandoned Arthur?\nThere is no way forward, no way back, no way around.\nI am an aristocrat. A minor one, but of stock. I understand the rules of class, and breeding. The Duke is vastly more powerful than I, but we are of a class. I can speak with her, gentry to gentry. We can communicate as equals.\nI must persuade her to call off the attack.\nImpossible! A middle-aged Irish widow, armed only with a pair of scissors. What can she do? Kill an army with gum and tissue? The death of a thousand papercuts?\nPerhaps I could buy her off. A prize beyond prize: a jewel from the stars, from their goddess itself. Arthur said that sapphires are unknown on this world. A stone beyond compare.\nI am writing as fast as I am thinking now.\nI must go and face the Duke of Yoo, female to female. I am of Ireland, a citizen of no mean nation. We confront the powerful, we defeat empires. I will go to her and name myself and I shall offer her the Blue Empress. The true Blue Empress. Beyond that, I cannot say. But I must do it and do it now.\nI cannot make the driver of my spider-car take me into the camp of the enemy. I have asked her to leave me and make her own way back to Yelta. I am writing this with a stub of pencil. I am alone on the high altiplano. Above the shield wall, the cloud layer is breaking up. Enormous shafts of dazzling light spread across the high plain. Two mounted figures have broken from the line and ride toward me. I am afraid—and yet I am calm. I take the Blue Empress from its box and grasp it tight in my gloved hand. Hard to write now. No more diary. They are here.\nV. Gloria medianocte: the Midnight Glory, or Blue Empress.\nCard, paper, ink.\nOriginally published in Old Venus, edited by Gardner Dozois and George R. R. Martin."}