{"fingerprint": "voTmnL7AT3Cr2Z/+YehejKuKvs8=", "sitename": "Clarkesworld Magazine", "title": "Digging by Ian McDonald", "author": "Ian McDonald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcdonald_02_19_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Digging by Ian McDonald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7340 words, short story, REPRINT\n Digging\n Tash was wise to the ways of wind. She knew its many musics: sometimes like a flute across the pipes and tubes; sometimes a snare-drum rattle in the guy-lines and cable stays or again, a death drone-moan from the turbine gantries and a scream of sand past the irised-shut windows when the equinox dust storms blew for weeks on end. From the rails and drive bogies of the scoopline the wind drew a wail like a demon choir and from the buckets set a clattering clicking rattle so that she imagined tiny clockwork angels scampering up and down the hundreds of kilometers of conveyor belts. In the storm-season gales it came screaming in across Isidis’ billion-year-dead impact basin, clawing at the eaves and gables of West Diggory, tearing at the tiered roofs so hard Tash feared it would rip them right off and send them tumbling end over end down down into the depths of the Big Dig. That would be the worst thing. Everyone would die badly: eyeballs and fingertips and lips exploding, cheeks bursting with red veins. She had nightmares about suddenly looking up to see the roof ripping away and the naked sky and the air all blowing away in one huge shout of exhalation. Then your eyeballs exploded. She imagined how that would sound. Two soft popping squelches. Then In-Brother Yoche told her you couldn’t hear your eyeballs exploding because the air would be too thin and the whole story was a legend of mischievous Grandparents and Sub-Aunts who liked to scare under-fours. But it made her think about how fragile was West Diggory and the other three stations of the Big Dig. Spindly and top-heavy, domes piled upon half domes upon semidomes, swooping wing roofs and perilous balconies, all resting on the finger-thin cantilevers that connected the great Excavating City to the traction bogies. Like big spiders. Tash knew spiders. She had seen spiders in a book and once, in a piece of video excitedly shot by Lady-cousin Nairne in North Cutter, a real spider, in a real web, trembling in the perennial beat of the buckets working up the scoopline from the head of the Big Dig, five kilometers downslope. Lady-cousin Nairne had poked at the spider with her fingers—fat and brown as bread in high magnification. The spider had frozen, then scuttled for the corner of the window frame, curled into a tiny ball of legs and refused to do anything for the rest of the day. The next day when Nairne and her camera returned it was dead dead dead, dried into a little desiccated husk of shell. It must have come in a crate in the supply run down from the High Orbital, though everything they shipped from orbit was supposed to be clean. Beyond the window where the little translucent corpse hung vibrating in its web, red rock and wind and the endless march of the buckets along the rails of the Excavating Conveyor. Buckets and wind. Tied together. Wind; Fact one. When the buckets ceased, then and only then would the wind stop. Fact two: all Tash’s life it had blown in the same direction: downhill.\n Tash Gelem-Opunyo was wise to the ways of wind, and buckets, and random spiders and on Moving Day the wind was a long, many-part harmony for pipes drawn from the sand-polished steel rails, a flutter of the kites and blessing banners and wind socks and lucky fish that West Diggory flew from every rooftop and pylon and stanchion, a sudden caress of a veering eddy in the small of her back that made Tash shiver and stand upright on the high verandah in her psuit, a too-intimate touch. She was getting too big for the old psuit. It was tight and chafing in the wrong places. Tight it had to be, a stretch-skin of gas-impermeable fabric, but Things were Showing. My How You’ve Grown Things, that Haramwe Odonye, who was an Out-cousin in from A.R.E.A. and thus allowed to Notice such things, Noticed, and Commented On. Last Moving Day, half a long-year before, she had drawn in an attempt to camouflage the bumps and creases and curves by drawing all over the high-visibility skin with marker pen. There were more animals on her skin than on the whole of Mars.\n Up and out on Moving Day, that was the tradition. From the very very old to the very very young, blinking up out of their pressure cocoons; every soul in West Diggory came out onto the balconies and galleries and walkways. Safety was part of the routine—with every half-year wrench of West Diggory’s thousands of tons of architecture into movement the possibility increased that a joint might split or a pressure dome shatter. Eyeball-squelch-pop time. But safety was only a small part. Movement was what West Diggory was for; like the wind, downwards, ever downwards.\n The Terrace of the Grand Regard was the highest point on West Diggory: only the banners of the Isidis Planitia Excavating Company eternally billowing in the unvarying downslope wind, and the wind turbines, stood higher. Climbing the ladders Tash felt Out-cousin Haramwe’s eyes on her, watching from the Boys’ Pavilion. His boy-gaze drew the other young males on their high and rickety terrace. The psuit was indeed tight, but good tight. Tash enjoyed how it moved with her, holding her in where she wanted to be held, emphasizing what she wanted emphasized.\n “Hey, good snake!” Out-cousin Haramwe called on the Common Channel. On her seven-and-a-half birthday Tash had drawn a dream snake on her psuit skin, a diamond pattern loop with its tail at the base of her spine, curled around the left curve of her ass and buried its head in the inner thigh. It had been exciting to draw. It was more exciting to wear on Moving Day, the only time she ever wore the psuit.\n “Are you ogling my ophidian?” Tash taunted back to the hoots of the other boys as she climbed up onto the Gallery of Exalted Vistas to be with her sisters and cousin and In-cousins and Out-cousins, all the many ways in which Tash could be related in a gene pool of only two thousand people. The guys hooted. Tash shimmied her shoulders, where little birds were drawn. The boys liked her insulting them in words they didn’t understand. Listen well, look well. I’m the best show on Mars.\n A thousand banners rattled in the unending wind. Kites dipped and fluttered, painted with birds and butterflies and stranger aerial creatures that had only existed in the legends of distant Earth. Streamers pointed the way for West Diggory: downhill, always downhill. The lines of buckets full of Martian soil marched up the conveyor from the dig point, invisible over the close horizon, under the legs of West Diggory, towards the unseen summit of Mt. Incredible, where they tipped their load on its ever-growing summit before cycling back down the underside of the conveyor. The story was that the freshly dug regolith at the bottom of the hole was the color of gold: exposure to the atmosphere on its long journey upslope turned it Mars red. She turned to better feel the shape of the wind on every part of her body. This psuit so needed replacing. There was more to her shiver than just the caress of air in motion. Wind and words: they were the same stuff. If she threw big and fancy words, words that gave her joy and made her laugh from the shape they made from moving air, it was because they were living wind itself.\n A shiver ran up through the catwalk grilles and railings and into Tash Gelem-Opunyo. The engineers were running up the traction generators; West Diggory shuddered and thrummed as the tokamaks drew resonances and steel harmonies from its girders and cantilevers. Tash’s molars ached, then there was a jolt that threw old and young alike off-balance, grasping for handrails, stanchions, cables, each other. There was an immense shriek like a new moon being pulled live from the body of the world. Shuddering creaks, each so loud Tash could hear them through her ear-protectors. Steel wheels turned, grinding on sand. West Diggory began to move. People waved their hands and cheered, the noise reduction circuits on the Common Channel stopped the din down to a surge of delighted giggling. The wheels, each taller than Tash, ground round, slow as growing. West Diggory, perched on its cantilevers, inched down its eighteen tracks, tentative as an old woman stepping from a diggler. This was motion on the glacial, the geological scale. It would take ten hours for West Diggory to make its scheduled descent into the Big Dig. You had to be sure to have eaten and drunk enough because it wasn’t safe to go inside. Tash had breakfasted lightly at the commons in the Raven Sorority, where the In-daughters lived together after they turned five. The semizoic fabric absorbed everything without stink or stain but it was far from cool to piss your suit. Unless you were up and out on a job. Then it was mandatory.\n Music trilled on the Common Channel, a cheery little toe-tapper. Tash gritted her teeth. She knew what it heralded: the West Diggory Down. No one knew when where or who had started the tradition of the Moving Day dance: Tash suspected it was a joke that no one had recognized and so became literal. She slid behind a stanchion as her Raven sisters formed up and the boys up on the Lads’ Pavilion bowed and raised their hands. Slip away slip away before it starts. Up the steps and along the clattering catwalk to the Outermost Preview. From this distant perch, a birdcage of steel at the end of a slender pier, a lantern suspended over the sand, Tash surveyed all West Diggory, her domes and gantries and pods and tubes and flapping banners and her citizens—so few of them, Tash thought—formed up into lines and squares for the dance. She tuned out the Common Channel. Strange, them stepping gaily, hand in hand, up and down the lines, do-se-doh in psuits and face masks and total silence. The olds seemed to enjoy it. They had no dignity. Look how fat some of them were in their psuits. Tash turned away from the rituals of West Diggory to the great, subtle slope of the Big Dig, following the lines up the slope. She was on the edge of the age when you could leave West Diggory but she had heard that up there, beyond Mt. Incredible, the small world curved away so quickly in all directions that the horizon was only three kilometers distant. The Big Dig held different horizons. It was a huge cone sunk into the surface of a sphere. An alternative geometry worked here. The world didn’t curve away, it curved inwards, a circle over three hundred kilometers round where it met the surface of Mars. The world radiated outwards: Tash could follow the radiating spokes of the scooplines all the way to the edge of the world, and beyond, to the encircling ring-mountain of Mt. Incredible that reached the edge of space. Peering along the curve of the Big Dig through the dust haze constantly thrown up by the ceaseless excavating, she could just make out the sun-glitter from the gantries of North Cutter, like West Diggory, making its slow descent deeper into the pit. A flicker of thought would up the magnification on her visor and she would be able to look clear across eighty kilometers of airspace to A.R.E.A. and spy on whatever celebrations they held there, on the first and greatest of the Excavating Cities on Moving Day. Maybe she might see a girl like herself, balanced on some high and perilous perch, looking out across the bowl of the world.\n The figures on the platforms and terraces broke apart, bowed to each other, lost all pattern and rhythm and became random again. Moving Day Down was over for another half-year. Tash flicked on the Common Channel. Tash liked to be apart, different, a girl of words and wit, but she also loved to be immersed in West Diggory’s never-ending babble of chat and gossip and jokes and family news. Together, the Excavating Cities had a population of less than two thousand humans. Small, complex societies, isolated from the rest of the planet, gush words like springs, like torrents and floods. The river of words, the only river that Mars knew. Tash’s psuit circuitry was smart enough to adjust the voices so that they spoke at the volume and distance they would have in atmosphere. Undifferentiated, the flood of West Diggory voices would have overwhelmed her. So the wall of voices did not overwhelm her. She turned her head this way, that way. Eavesdropping. There was Leyta Soshinwe-Opunyo, Queen-beeing again. Tash had seen pictures of bees like she had seen birds. On Arrival Day, when the Excavating Cities finally reached the bottom of the Big Dig, there would be birds, and bees, and even spiders. There was Great-Out-Aunt Yoto, seeming enthusiastic but always seasoned with a pinch of criticism—oh, and another thing: people weren’t performing the dance moves right, the Engineers had mistuned the tokamaks and her titanium hip was aching, was it her or did more bits fall off West Diggory every time? They would never have allowed that in Southdelving, her family home. A sudden two-tone siren cut across the four hundred voices of West Diggory. Emergency teams slapped their psuits to warning yellow and rushed to their positions, everyone hurried to the muster points, then relaxed as the medics discovered the nature of the Emergency. The Common Channel flooded with laughter. Haramwe Odonye, during a particularly energetic caper in the West Diggory Down, had slipped and sprained his ankle.\n Big Dig Figs.:\n Population: one thousand eight hundred and thirty-three, divided between the four Excavating Cities of (clockwise) Southdelving, West Diggory, North Cutter and A.R.E.A. (Ares Re-engineering of Environment and Atmosphere). Total Martian population: five thousand two hundred and seventeen.\n Elevation: at the digging head as of Martian Year 112, Janulum 1: minus twenty-three kilometers below Martian Mean Gravity Surface (no sea level). Same date, highest point of Mt. Incredible: 15 kilometers above MGS.\n Diameter of the Big Dig at Martian MGS: Five hundred and sixteen kilometers.\n Circumference of the Big Dig at Martian MGS: One thousand six hundred and twenty-two kilometers.\n Angle of Big Dig Excavation Surface: 5.754 degrees. That’s pretty gentle. The scoopline can’t handle more than an eight-degree slope. To the casual human eye—one that hasn’t grown up inside the gentle dish of the Big Dig, that would look almost flat. But it’s not flat. That’s why it’s the key figure: those 5.75 degrees are going to make Mars habitable.\n Date of commencement of the Big Dig: AlterMarch 23rd, Martian Year 70. Two thirty in the afternoon, on schedule, the scooplines excavated and the bucket teeth took their first bites of Isidis Planitia.\n Volume of the Big Dig: as of above date: one million, eight hundred and thirteen thousand cubic kilometers. All piled up neatly into Mt. Incredible, the ring-shaped mountain that surrounds the Big Dig like the wall of an old impact crater. Not entirely surrounds. Mt. Incredible has been constructed with four huge valleys: Windrush, Zephyr, Cyroco, and Storm of the Black Plums: howling wind-haunted, storm-scoured canyons: that same wind singing over the tombs of the Diggers who have died in the course of the great excavation, unfailingly stirring the flags and streamers of the mobile cities far below.\n Total mass of Martian surface excavated in the Big Dig to date: 7.1 x 10^15 tons.\n Big Dig Figs and Facts. The numbers that shape Tash’s world.\n Tash was in the Orangery when the call came down through the rows of breadfruit trees. Like the Moving Day dance, the name was generally considered another joke that had run away and taken up residence in the ventilators and crawl spaces and power conduits of the Excavating City, as this baroque glass dome had never grown oranges. The rows of breadfruit and plantains and bananas and other high-carbo staples gave camouflage and opportunity for West Diggory’s young people to meet and talk and scheme and flirt.\n “Milaba wants to see Tash, pass it on.”\n “Sweto, tell Chunye that Milaba wants to see Tash.”\n “Qori, have you seen Tash?”\n “I think she was down in the plantains, but she might have moved on to the breadfruit.”\n “Well tell her Milaba wants to see her.”\n By leaps and misunderstandings, by staggers and misapprehensions, by devious spirals of who liked whom and who was talking to whom and who wasn’t and who was hooking with whom and who had finished with whom, the message spiraled in along the web of leaf-mold-smelling plants to Tash, spraying the breadfruit. A simple call, a message would have reached her directly but where there are only a hundred of you, true social networking is mouth to mouth.\n In-Aunt Milaba. She was a legend, a statue of woman, gracious and noble, adored far beyond West Diggory. Her dark skin was lustrous as night, her soul as star-filled. To be in her presence was to be blessed in ways you would not immediately understand but, more thrilling to Tash, was that In-Aunt Milaba was the chief service engineer for the North West sector scooplines. The summons to her office, a little glass and aluminum bubble like a bunion on one of West Diggory’s steel feet, could mean only one thing. Out. Out and up.\n “So Haramwe sprained his ankle.”\n Every part of In-Aunt Milaba’s tiny office, from the hand-carved olivine desk to the carafe of water that stood on it, shook to the rattle of the buckets hurtling up the scoopline. Milaba raised an eyebrow. Tash realized a response was due.\n “Are his injuries debilitating?”\n “Debilitating.” Milaba gave a flicker of a smile. “You could say that. He’ll be out for a week or so. He came down heavily, silly boy. Showing off. When is your birthday?” Tash’s heart leapt.\n She knew. Everyone knew everything, all the time. The game was pretending not to know.\n “Octobril fifth.”\n “Three months.” Milaba appeared to consider for a moment. “Peyko Ruebens-Opollo says for all your fancy talk you’ve a good head and better sense and do what you’re told. That’s good because I don’t need attitude problems or last-minute-good-ideas when I’m out on the line.”\n For once the words failed Tash. They hissed from her like air from a ruptured atmosphere cell. She waved her hands in speechless delight.\n “I’m taking a digger up Line 12 to Windrush Valley. The feed tokamaks have been fluctuating nastily. Probably a soft fail in a command chip set; they get a lot of radiation up there. Now I need someone with me to hold things and make tea and generally make intelligent conversation. Are you interested?”\n Still the words would not come. The rule was that you did not leave the Excavating Cities until you were eight, when you were technically adult. Rules broke and bent with the frequency of scoopline breakdowns but three months was a significant proportion of the long Martian year. Out. Out, and up. Up the line, into the windy valley. In a diggler, with In-Aunt Milaba.\n “Yes, oh yes, I’d love to,” Tash finally squeaked. Now Milaba unleashed the full radiance of her smile and it was like sunrise, it was solstice lights, it was the warmth of the glow lamps in the Orangery. I say you are an adult citizen of West Diggory, Tash Gelem-Opunyo, the smile said, and if I say it, all say it.\n “Be at the Outlock 12 at fourteen o’clock,” Milaba said. “You do know how to make tea, don’t you?”\n Still not got it? It’s easy, easy easy easy. Easy as a heezy, which is a Digger saying. A heezy is the lever on a scoopline bucket that, when struck by the dohbrin (which is a different type of lever found at the load-off end of the scoopline), tips the contents of the bucket down Mt. Incredible. Heezy peasy easy. It’s all because air has weight. Air’s not nothing. It’s gas—in Mars’ case, carbon dioxide nitrogen argon oxygen and the leaked breathings from the hundred-and-something years that humans have scratched and scrabbled clawholds on its red earth. It has mass. It has weight. And it flows, the same way that water flows, to the lowest point. Wind is air flowing. People say, no one knows why the wind blows. That’s stupid nonsense. Wind blows from high to low, high pressure to low pressure, high altitude to low altitude; down the slopes of mountains, through canyons and valleys. The air pressure at the bottom of the great and primeval rift of Valles Marineris is ten times that in the long-cold volcanic calderas atop Olympus Mons. Titanic gales and fog blow through that valley. The fog is because the atmospheric pressure at the bottom of the valley is enough—just enough—to allow water to exist as vapor. But that’s still not enough to support big life. That’s like higher than Earth’s highest mountain. That’s fingertip-lip-exploding, eyeball-squelching, cheek-bursting pressure. Bug life yes, big life no. That’s not enough to make Mars a green paradise, a home for humanity, a fertile pool of life beyond little blue Earth. What you need is deep. Thirty kilometers deep. Deeper than any place on Earth is deep. Deeper than even Olympus Mons, mightiest mountain on all the worlds, is high. And because air has weight, because atmosphere flows and the wind blows, gas will fill up the hole. That’s the wind that rattles the banners and turns the rotors of West Diggory. As the gas flows the pressure grows until the day comes when the atmospheric pressure at the bottom of the hole is enough for you to walk around without a psuit, in just your skin if you have the urge and your skin is pretty enough. Earth atmospheric pressure. Pressure, that’s always been the problem with making Mars habitable. Get all the gas into one place. When you’ve got enough of it, turning it into something you can breathe is the easy bit. That’s just bugs and plants and life.\n Thirty kilometers deep. The scooplines are at minus twenty-six kilometers. That’s another five M-years before they hit atmospheric baseline. Then they’ll level out the floor of the crater, take away some of the sides, expand the flat area, though it will all seem so flat, the atmospheric gradient so subtle, that you will seem to be walking out into breathlessness and light-headedness rather than ascending into it. Fifty years after her In-Grandfather Tayhum made the first incision, the Big Dig will be dug. Tash will be seventeen and a half when the wind rushing down the sides of the Big Dig finally fails and the rotors stop and the banners fall and the Excavating Cities finally come to a rest.\n Twenty-six kilometers upslope, In-Aunt Milaba gave the sign for Tash to throw the levers to disengage the diggler from the scoopline. Thus far the big world of outside had been a thumping disappointment to Tash. She had yet to be outside, properly outside, two-figures-in-a-Mars-scape outside, shiver-in-your-psuit outside. She had transited from plastic bubble by plastic tube to plastic bubble connected by its grip on the scoopline to home.\n This was what Tash Gelem-Opunyo saw from the transparent bubble of the diggler. Sand sand sand sand sand, a rock there, sand sand sand rock rock, oh, some pebbles! Sand grit sand more grit something between pebble and grit, something between grit and sand, a bit of old abandoned machinery, wow wow wow! Dust drifted up around it. Sand. Sand. Sand. West Diggory was still visible, down the dwindling thread of the scoopline, now truly the size of a spider. The enormous, horizonless perspectives robbed Tash of anything by which she could judge movement. The sand, the buckets, the unchanging gentle gradient that went up halfway to space. Only by squinting down through the floor glass at the blurred, grainy surface did she get any sense of movement.\n Twenty-six vertical kilometers equaled two hundred sixty surface kilometers equaled five and a half hours in a plastic bubble with a relative you’ve grown up in enforced proximity to but until now never really known or talked to. Everyone loves In-Aunt Milaba the Magnificent, that’s the legend, but five hours, Aunt and niece, Tash began to wonder if this was another wind-whisper legend blown around the corners and crannies of West Diggory. She was beautiful, a feast for the eye and soul, all those things an eight-year-old girl hopes for herself (and did Tash not share the DNA—given that the Excavating Cities gene pool was shallow as a spit, hence all the careful arrangements of In-relatives and Out-relatives and who would be sent to one of the other Excavating Cities and who would stay), all those things a girl of almost-eight wants for herself but try as she might, and did, Tash could not engage her. Fancy funny words of the type Tash treasured. Poems. Puns. Riddles. Guessing games. Break-the-code games. Allusions and circumspect questions. Direct questions. To them all In-Aunt Milaba shook her head and smiled and bent over the controls and the monitors and checked her kit and said not a word. So tea, lots of tea, and muttering little rhymes to the rhythm of the huge balloon wheels as the scoopline hauled Diggler Six up the side of the biggest excavation in the solar system.\n But now they were released from the scoopline and Milaba was standing at the steering column, driving the diggler under its own power. It was still sand sand sand and occasional rock, but Tash knew a gnaw of excitement. She was free, disconnected from the umbilicals of life for the first time. She was out in the wild world. The scoopline dwindled to a thread, to invisibility behind her, ahead she saw a notch on the edge of vision. Windrush Valley. All the windblown words stopped. A flaw in the horizon. A place beyond the Big Dig. Beyond that declivity was the whole curved world. In the silence In-Aunt Milaba turned from the control column.\n “I think you could have a go now.”\n So this was what she had been waiting for, Tash to run out of words, and finally listen.\n The diggler was ridiculously simple to drive. Plant your feet firmly at the drive column. Push forward to feed power to the traction motors in the wheel hubs. Pull back to brake. Yaw to steer. There was even a little holder on the side of the drive column for your tea. Tash giggled with nervous glee as she gingerly pushed forward the stick and the bubble of pressure glass slung between the giant orange tires stuttered forward. Within thirty seconds she had it. Thirty seconds later she was pushing it, sneaking the speed bar up, looking for places where she could make the diggler skip over rocks.\n “I’d go easy on that throttle,” Milaba said. “The battery life is eight hours. That’s why we ride the scoopline up and down again. You don’t want to get stuck up here with night coming down, no traction and no heat.”\n Tash eased the stick back but not before the diggler hit the small boulder at which she had discreetly aimed and bounced all four wheels in the air. Milaba smiled that morning-sun smile. Then shoulder by shoulder they stood at the controls and rode up into the orange valley. The land rose up on either side, higher as they drove deeper, kilometers high. They felt like oppression to Tash, shouldering close and ominous, their heights breathless and haunted with dark things that lived in the sky. At the same time she felt hideously small and exposed in the fragile glass ornament of the diggler. The wind was rising, she could feel the diggler shake on its suspension, hear the shriek and moan through the cables. The controls fought her but she pushed the little bubble deeper and deeper into Windrush Valley. When her forearms arched and the sinews on her neck stood out from fighting the atmosphere of Mars pouring through this two-kilometer wide notch in Mt. Incredible, Milaba leaned over and tapped a pre-programmed course into the computer.\n “Suit up,” she said. “We’ll be there in ten minutes.”\n The tokamak station was a wind-scoured blister of construction plastic hunkering between a boulder field and a stretch of polished olivine. It was only when the diggler slowed to a stop and fired sand anchors that Tash realized that it was nearer and smaller than she had thought. It was not a distant vast city, the power plant was only slightly higher than the diggler’s mammoth wheels. The wind rotor, spinning like it would suddenly leap from its pylon and spin madly away through the upper air, was no bigger than her outstretched hands.\n “Mask sealed?”\n Tash ran her fingers around the join with her psuit hood and gave In-Aunt Milaba two thumbs up. “I’m dee-peeing the diggler.” There was a high-pitched shriek of air being vented into the tanks, a whistle that ebbed into silence as the pressure dropped to match the outside environment. The scribbled-over psuit felt tight and stiff. This was true eyeball-squelch altitude. Then Milaba popped the door and Tash followed her out and down the ladder on to the wild surface of Mars.\n Gods and teeth, but the wind was brutal. Tash balled her fists and squared her shoulders and lowered her head to battle through it to the yellow-and-blue-chevronned tokamak station. She could feel the sand whipping across the skin of her psuit. She didn’t like to think of the semizoic skin abrading, cell by cell. She imagined it wailing in pain. A tap on the shoulder, Milaba gestured for her to hook her safety line onto the door winch. Then In-Aunt and In-niece they punched through the big wind to the shelter of the tokamak shell. Out. Out in the world. Up high. If Tash kept walking into the wind she would pass through Windrush Valley and come to a place where the world curved away from her, not towards her. The desire to do it was unbearable. Out of the hole. All it would take would be one foot in front of another. They would take her all the way around the world and back again, to this place. The gale of possibility died. It was all, only, ever circles. Milaba tapped her again on the shoulder to remind her that there was work to be done here. Tash took the unitool and unscrewed the inspection hatch. Milaba plugged in her diagnosticators. She was glorious to watch at work, easy and absorbed. But it was long work and Tash’s attention wandered to the little meandering dust-dervishes that spun up into a small tornado for a few seconds, staggered down the valley and collapsed into swirling sand.\n “Willie-willies,” Milaba said. “You want to be careful with those, they’re tricksy. As I thought.” She pointed at the readout. “A hard fail in the chip set.” She pulled a new blade out of her thigh pouch and slid it into the control unit. Lights flashed green. Inside its shielded dome the tokamak grumbled and woke up with a shiver that sent the dust rising from the ground. Tash watched the wind whirl into a dozen dust-devils, dancing around each other. “Just going to check the supply line. You stay here.” She headed up the valley along the line of the power cable. The dust-devils swirled in towards each other. They merged. They fused. They became one, a true dust-demon.\n “Looks all right!” In-Aunt Milaba called.\n “Milaba, I don’t like the look . . . ” The dust-demon spun towards Tash, then at the last moment veered away and tracked up the valley. “Milaba!”\n Milaba hesitated. The hesitation was death. The dusty-demon bore down on her, she tried to throw herself away but it spun over her, lifted her, threw her hard and far, smashed her down onto the smooth polished olivine. Tash saw her faceplate shatter in a spray of shards and water vapor. It was random, it was mad, it was a chance in a billion, it can’t happen, it was an affront to order and reason but it had and there Milaba lay on the hard olivine.\n “Oh my gods oh my gods oh my gods!” For a moment Tash was paralyzed, for a moment she did not know what to do, that she could do anything, that she must do something. Then she was running up the valley. The dust-demon veered towards Tash. Tash shrieked, then it staggered away, broke itself on the boulders, and spun down to dust again. The psuit would seal automatically but In-Aunt Milaba had moments before her eyeballs froze. “Oh help help help help help,” Tash cried, her hands pressed to Milaba’s face, trying to will heat into it. Then she saw the red button on the safety line harness. She hit it and was almost jolted off her feet as the winch on the diggler reeled Milaba in. Tash hit the Emergency Channel. “This is Diggler Six this is Diggler Six in Windrush Valley. This is an emergency.” Of course it is. It’s the Emergency Channel. She tried to calm her voice as the winch lifted the limp Milaba into the air. “We have a suit dee-pee situation. We have a suit dee-pee.”\n “Hello Diggler Six. This is Diggory West Emergency Services. Please identify yourself.”\n “This is Tash Gelem-Opunyo. It’s Milaba.”\n “Tash. Control here.” Tash recognized Out-Uncle Yoyote’s voice. “Get back. Get back here. You should have enough power, we’ll send another diggler up the line to meet you, but you, darling, you have to do it. We can’t get to you in time. It’s up to you. Get back to us. It’s all you can do.”\n Of course. It was. All she could do. No rescue swooping from the skies, in a world where nothing could fly. No speed-star scorching up the slope of the Big Dig in a world where the scoopline was the fastest means of transport. She was on her own.\n It took all her strength to swing Milaba through the hatch into the diggler cab and seal the lock. Almost Tash popped her faceplate. Almost. She repressurized the diggler. Air-shriek built to a painful screech then stopped. But Milaba was so still, so cold. Her face was white with frost where her breath had frozen into her skin. It would never be the same again. Tash knelt, turned her cheek to her In-Aunt’s lips. A whisper a sigh a suspicion a susurration. She was breathing. But it was cold so cold death cold Mars cold in the diggler. Tash slapped the heater up to the maximum and jigged around the tiny cab. Condensation turned the windows opaque, then cleared. Back. She had to get back. Was there an auto-return program? Where would she find it? Where would she even begin looking? Wasting precious instants, wasting precious instants. Tash took the control column, stamped on the pedal to release the anchors, and engaged the traction motors. Turning was difficult. Turning was scary. Turning forced a small moan of fear when the wind got under the diggler and she felt the right side lift. If it went over here, they were both dead. This was not fun driving. There was no glee, no whee! At every bounce Tash tensed and clenched, fearful that the diggler would roll over and shatter like an egg, smash an axle, any number of new terrors that only appear when your life depends on everything working perfectly. Come on come on come on. The battery gauge was dwindling with terrifying speed. This was outside. This was the horizoned world. Where was the scoopline? Surely it hadn’t been this far. Come on come on come on. A line on the sand. But so far. Power at twelve percent. Where had it gone what had she used it on? The heating blast? The emergency ree-pee? The burn on the winch? Call home. That would be sensible. That would be the act of a girl with a good head and better sense who did what she was told. But it would use power. Batteries at seven percent, but now she could see the scoopline, the laden buckets above, the empty buckets below, bucket after bucket after bucket. She drove the diggler on. Matching velocities with the scoopline was teeth-gritting, nerve-stretching work. Tash had to drop the diggler into the space between the buckets and hold exact speed. A push too fast would ride up on the preceding bucket. Too slow and she would be rear-ended by the bucket behind. And ever edging inwards, inwards, closer to the line as the batteries slid from green to red. Lights flashed. Tash threw the lever. The shackle engaged. Tash rolled away from the drive column to Milaba on the floor.\n “Tash.” A whisper a sigh a suspicion a susurration.\n “It’s all right, it’s all right, don’t talk, we’re on scoopline.”\n “Tash, are my eyes open?”\n “Yes they are.”\n A tiny sigh.\n “Then I can’t see. Tash, talk to me.”\n “What about?”\n “I don’t know. Anything. Everything. Just talk to me. We’re on the line, did you say?”\n “We’re on the line. We’re going home.”\n “Five hours then. Talk to me.”\n So she did. Tash pulled cushions and mats around her into a nest and sat holding her In-Aunt’s head and she talked. She talked about her friends and her In-sisters and her Out-sisters and who would go away from West Diggory and who would stay. She talked about boys and how she liked them looking at her but still wanted to be different and special, not to be taken for granted, funny-Tash, odd-Tash. She talked about whether she would marry, which she didn’t think she would, not as far as she could see, and what she would do then if she didn’t. She talked about the things she loved, like swimming, and cooking vegetables, and drawing, and words words words. She talked about how she loved the sound and shape of words, the sound of them as something quite different from what they meant and how you could put them together to say things that could not possibly be, and how the words came to her, like they were blown on the wind, shaped from wind, the wind brought to life. She talked of these in words that weren’t clever or mouth-filling, words said quietly and simply and honestly, saying what she thought and how she felt. Tash saw then a richer lode in words; beyond the beauty of their sounds and shapes and patterns was a deeper beauty of the truth they could shape. They could tell what it was to be Tash Gelem-Opunyo. Words could fly the banners and turn the rotors of a life. Milaba squeezed her hand and pushed her broken lips into a smile, and creased the corner of her white, frost-burned eyes.\n The Emergency Channel chimed. Yoyote had her on visual: they were about twenty kilometers downslope from her. They were coming to get her. They would be safe soon. Well done. And there was other news, news that made his voice sound strange to Tash in Diggler Six, like he was dead and walking and talking and about to cry all at the same time. A command had come in from Isidis Excavation Command, from the High Orbital, ultimately all the way from Earth and the Isidis Development Consortium. There had been a political shift. The faction that was up was down and the faction that was down was up. The Big Dig was cancelled.\n From here, every way was up. There had been no official announcement from the Council of Diggers for ceremonials or small mournings: in their ones and two, their families and kinship groups and sororities and fraternities, the people of West Diggory had decided to share the news that their world was ending, and to see the bottom of it; the base that had been their striving for three generations; the machine head. Dig Zero. Minimum elevation. So they took digglers or rode down the scoopline to the bottom of the Big Dig, and looked around them, and looked around at the digging heads of the scooplines, stilled and frozen for the first time in memory, buckets filled with their last bite of Mars turned to the sky. As they grew accustomed to the sights and wonders of the dig head, for not one in fifty of the Excavating Cities’ populations worked at the minimum elevation, they saw in the distance, between the black scoopline, groups and families and societies from North Cutter and Southdelving and A.R.E.A. They waved to each other, greeting relatives they had not seen in years; the Common Channel was a flock of voices. Tash stood with her Raven Sorority sisters. They positioned themselves around her, even Queen-bee Leyta. Tash was a slam and brief heroine—perhaps the last one the Big Dig would ever have. In-Aunt Milaba had been taken to the main medical facility A.R.E.A. where they were growing her new irises for her frost-blinded eyes. Her face would be scarred and patched with ugly white but her smile would always be beautiful. So the In-sisters and In-cousins stood around Tash, needing to be down at zero but not knowing why, or what to do now. The boys from the Black Obsidian Fraternity waved over and came across the sand to join the girls. So few of us, really, Tash thought.\n “Why?” Out-cousin Sebben asked.\n “Environment,” said Sweto and, in the same transmission, Qori said, “Cost.”\n “Are they going to take us all back to Earth?” Chunye asked.\n “No, they’re never going to do that,” Haramwe said. He walked with a stick, which made him look like an old man, but at the same interesting and attractive. “That would cost too much.”\n “We couldn’t anyway,” Sweto said. “The gravity down there would kill us. We can’t live anywhere but here. This is our home.”\n “We’re Martians,” Tash said. Then she put her hands up to her face mask.\n “What are you doing?” Chunye, always the nervous In-cousin, cried in alarm.\n “I just want to know,” Tash said. “I just want to feel it, like it should be.” Three taps, and the faceplate fell into her waiting hands. The air was cold, shakingly cold, and still too thin to breathe and anyway, to breathe was to die on lungfuls of carbon dioxide but she could feel the wind, the real wind, the true wind in her face. Tash exhaled gently into the atmosphere gathered at the bottom of the Big Dig. The world still sloped gently away from her, all the way up the sky. Tears would freeze in an instant so she kept them to herself. Then Tash clapped the plate back over her face and fastened it to the psuit hood with her clever fingers.\n “So, what do we do now?” whiny Chunye asked. Tash knelt. She pushed her fingers into the soft regolith. What else was there? What else had there ever been. A message had come down Mt. Incredible, from High Orbital, from a world on the other side of the sky, from people who had never seen this, whose horizons were always curved away from them. Who were they to so say? What wind blew their words and made them so strong? Here were people, whole cities, an entire civilization, in a hole. This was Mars.\n “We do what we know best,” Tash said, scooping up pale golden Mars in her gloved hand. “We put it all back again.”\n Originally published in Life on Mars: Tales from the New Frontier, edited by Jonathan Strahan."}