{"fingerprint": "NNVVs6s/1czCuO3ANot4y1AZ3VI=", "sitename": "Clarkesworld Magazine", "title": "The Dust Assassin by Ian McDonald", "author": "Ian McDonald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcdonald_07_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Dust Assassin by Ian McDonald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10940 words, novelette, REPRINT\n The Dust Assassin\n When I was a small, a steel monkey would come into my room. My ayah put me to bed early, because a growing girl needed sleep, big sleep. I hated sleep. The world I heard beyond the carved stone jali screens of my verandah was too full of things for sleep. My ayah would set the wards, but the steel monkey was one of my own security robots and invisible to them. As I lay on my side in the warmth and perfume of dusk, I would see first its little head, then one hand, then two appear over the lip of my balcony, then all of it. It would crouch there for a whole minute, then slip down into the night shadows filling up my room. As my eyes grew accustomed to the dark I would see it watching me, turning its head from one side to the other. It was a handsome thing; metal shell burnished as soft as skin (for in time it came close enough for me to slip a hand through my mosquito nets to stroke it) and adorned with the symbol of my family and make and serial number. It was not very intelligent, less smart than the real monkeys that squabbled and fought on the rooftops, but clever enough to climb and hunt the assassin robots of the Azads along the ledges and turrets and carvings of the Jodhra Palace. And in the morning I would see them lining the ledges and rooftops with their solar cowls raised and then they did not seem to me like monkeys at all, but cousins of the sculpted gods and demons among which they sheltered, giving salutation to the sun.\n You never think your life is special. Your life is just your life, your world is just your world, even lived in a Rajput Palace defended by machine monkeys against an implacable rival family. Even when you are a weapon.\n Those four words are my memory of my father: his face filling my sight like the Marwar moon, his lips, full as pomegranates, saying down to me, you are a weapon, Padmini, our revenge against the Azads. I never see my mother’s face there: I never knew her. She lived in seclusion in the zenana, the women’s quarters. The only woman I ever saw was my ayah, mad Harpal, who every morning drank a steaming glass of her own piss. Otherwise, only men. And Heer, the khidmutgar, our steward. Not man, not woman: other. A nute. As I said, you always think your life is normal.\n Every night, the monkey-robot watched me, turning its head this way, that way. Then one night it slipped away on its little plastic paws and I slid out of my nets in my silk pajamas after it. It jumped up on the balcony, then in two leaps it was up the vine that climbed around my window. Its eyes glittered in the full moon. I seized two handfuls of tough, twisted vine, thick as my thigh, and was up after it. Why did I follow that steel monkey? Maybe because of that moon on its titanium shell. Maybe because that was the moon of the great kite festival, which we always observed by flying a huge kite in the shape of man with a bird’s tail and outstretched wings for arms. My father kept all the festivals and rituals, the feasts of the gods. It was what made us different from, better than, the Azads. That man with wings for arms, flying up out of the courtyard in front of my apartment with the sun in his face, could see higher and further than I, the only daughter of the Jodhras, ever could. By the moonlight in the palace courtyard I climbed the vine, like something from one of ayah’s fairytales of gods and demons. The steel monkey led on, over balconies, along ledges, over carvings of heroes from legends and full-breasted apsara women. I never thought how high I was: I was as light and luminous as the bird-man. Now the steel monkey beckoned me, squatting on the parapet with only the stars above it. I dragged myself up on to the roof. Instantly an army of machine monkeys reared up before me like Hanuman’s host. Metal gleamed, they bared their antipersonnel weapons: needle throwers tipped with lethal neurotoxins. My family has always favoured poison. I raised my hand and they melted away at the taste of my body chemistry, all but my guide. It skipped and bounded before me. I walked barefoot through a moonlit world of domes and turrets, with every step drawn closer to the amber sky-glow of the city outside. Our palace presented a false front of bays and windows and jharokas to the rude people in the street: I climbed the steps behind the façade until I stood on the very top, the highest balcony. A gasp went out of me. Great Jaipur lay before me, a hive of streetlights and pulsing neons, the reds and white and blinking yellows of vehicles swarming along the Johan Bazaar, the trees hung with thousands of fairylights, like stars fallen from the night, the hard fluorescent shine of the open shop fronts, the glowing waver of the tivi screens, the floodlight pools all along the walls of the old city: all, all reflected in the black water of the moat my father had build around his palace. A moat, in the middle of a drought.\n The noise swirled up from the street: traffic, a hundred musics, a thousand voices. I swayed on my high perch but I was not afraid. Softness brushed against my leg, my steel monkey pressed close, clinging to the warm pink stone with plastic fingers. I searched the web of light for the sharp edges of the Jantar Mantar, the observatory my ancestors had built three hundred years before. I made out the great wedge of the Samrat Yantra, seven stories tall, the sundial accurate to two seconds; the floodlit bowls of the Jai Prakash Yantra, mapping out the heavens on strips of white marble. The hot night wind tugged at my pajamas; I smelled biodiesel, dust, hot fat, spices carried up from the thronged bazaar. The steel monkey fretted against my leg, making a strange keening sound and I saw out on the edge of the city: a slash of light down the night, curved like a sail filled with darkness. A tower, higher than any of the others of the new industrial city on the western edges of Jaipur. The glass tower of the Azads, our enemies, as different as could be from our old-fashioned, Rajput-style palace: glowing from within with blue light. And I thought, I am to bring that tower to the ground.\n Then, voices. Shouts. Hey, you. Up there. Where? There. See that? What is it? Is it a man? I don’t know. Hey, you, show yourself. I leaned forward, peered carefully down. Light blinded me. At the end of the flashlight beams were two Palace guards in combat armour, weapons trained on me. It’s all right, it’s all right, don’t shoot, for gods’ sake, it’s the girl.\n “Memsahb,” a solider called up. “Memsahb, stay exactly where you are, don’t move a muscle, we’re coming to get you.”\n I was still staring at the glowing scimitar of the Azad tower when the roof door opened and the squad of guards came to bring me down.\n Next morning I was taken to my father in his audience Diwan. Climate-mod fields held back the heat and the pollution; the open, stone-pillared hall was cool and still. My father sat on his throne of cushions between the two huge silver jars, taller than two of me, that were always filled with water from the holy river Ganga. My father drank a glass at every dawn every morning. He was a very traditional Rajput. I saw the plastic coil of his lighthoek behind his ear. To him his Diwan was full of attendants; his virtual aeai staff, beamed through his skull into his visual centres, busy busy busy on the affairs of Jodhra Water.\n My brothers had been summoned and sat uncomfortably on the floor, pulling at their unfamiliar, chafing old-fashioned costumes. This was to be a formal occasion. Heer knelt behind him, hands folded in yts sleeves. I could not read yts eyes behind yts polarized black lenses. I could never read anything about Heer. Not man, not woman—yt—, yts muscles lay in unfamiliar patterns under yts peach-smooth skin. I always felt that yt did not like me.\n The robot lay on its back, deactivated, limbs curled like the dry dead spiders I found in the corners of my room where ayah Harpal was too lazy to dust.\n “That was a stupid, dangerous thing to do,” my father said. “What would have happened if our jawans had not found you?”\n I set my jaw and flared my nostrils and rocked on my cushions.\n “I just wanted to see. That’s my right, isn’t it? It’s what you’re educating me for, that world out there, so it’s my right to see it.”\n “When you are older. When you are a . . . woman. The world is not safe, for you, for any of us.”\n “I saw no danger.”\n “You don’t need to. All danger has to do is see you. The Azad assassins . . . ”\n “But I’m a weapon. That’s what you always tell me, I’m a weapon, so how can the Azads harm me? How can I be a weapon if I’m not allowed to see what I’m to be used against?”\n But the truth was I didn’t know what that meant, what I was meant to do to bring that tower of blue glass collapsing down into the pink streets of Jaipur.\n “Enough. This unit is defective.”\n My father made a gesture with his fingers and the steel monkey sprang up, released. It turned its head in its this-way, that-way gesture I knew so well, confused. In the same instant, the walls glittered with light reflecting from moving metal as the machines streamed down the carved stonework and across the pink marble courtyard. The steel monkey gave a strange, robot cry and made to flee but the reaching plastic paws seized it and pulled it down and turned it on its back and circuit by circuit, chip by chip, wire by wire, took it to pieces. When they had finished there was no part of my steel monkey left big enough to see. I felt the tightness in my chest, my throat, my head of about-to-cry but I would not, I would never, not in front of these men. I glanced again at Heer. Yts black lenses gave nothing, as ever. But the way the sun glinted from those insect eyes told me yt was looking at me.\n My life changed that day. My father knew that something between us had been taken apart like the artificial life of the steel monkey. But I had seen beyond the walls of my life so I was allowed out from the palace a little way into the world. With Heer, and guards, in armoured German cars to bazaars and malls; by tilt-jet to family relatives in Jaisalmer and Delhi; to festivals and melas and pujas in the Govind temple. I was still schooled in the Palace by tutors and aeai artificial intelligences, but I was presented with my new friends, all the daughters of high-ranking, high-caste company executives, carefully vetted and groomed. They wore all the latest fashions and make-up and jewelery and shoes and tech. They dressed me and styled me and wove brass and ambers beads into my hair; they took me to shops and pool parties—in the heart of a drought—and cool summer houses up the mountains but they were never comfortable like friends, never free, never friends at all. They were afraid of me. But there were clothes and trips and Star Asia tunes and celebrity gupshup and so I forgot about the steel monkey that I once pretended was my friend and was taken to pieces by its brothers.\n Others had not forgotten\n They remembered the night after my fourteenth birthday. There had been a puja by the Govind priest in the Diwan. It was a special age, fourteen, the age I became a woman. I was blessed with fire and ash and light and water and given a sari, the dress of a woman. My friends wound it around me and decorated my hands with mehndi, intricate patterns in dark henna. They set the red bindi of the kshatriya caste over my third eye and led me out through the rows of applauding company executives and then to a great party. There were gifts and kisses, the food was laid out the length of the courtyard and there were press reporters and proper French champagne that I was allowed to drink because I was now a woman. My father had arranged a music set by MTV-star Anila—real, not artificial intelligence—and in my new woman’s finery, I jumped up and down and screamed like any other of my teenage girlfriends. At the very end of the night, when the staff took the empty silver plates away and Anila’s roadies folded up the sound system, my father’s jawans brought out the great kite of the Jodhras, the winged man-bird the colour of fire, and sent him up, shining, into the night above Jaipur, up towards the hazy stars. Then I went to my new room, in the zenana, the women’s quarter, and old disgusting ayah Harpal locked the carved wooden door to my nursery.\n It was that that saved me, when the Azads struck.\n I woke an instant before Heer burst through the door but in that split-second was all the confusion of waking in an unfamiliar bed, in a strange room, in an alien house, in a body you do not fully know as your own.\n Heer. Here. Not Heer. Dressed in street clothes. Men’s clothes. Heer, with a gun in yts hand. The big gun with the two barrels, the one that killed people and the one that killed machines.\n “Memsahb, get up and come with me. You must come with me.”\n “Heer . . . ”\n “Now, memsahb.”\n Mouth working for words, I reached for clothes, bag, shoes, things. Heer threw me across the room to crash painfully against the Rajput chest.\n “How dare . . . ” I started and, as if in slow motion, I saw the gun fly up. A flash, like lightning in the room. A metallic squeal, a stench of burning and the smoking steel shell of a defence robot went spinning across the marble floor like a burning spider. Its tail was raised, its stinger erect. Not knowing if this was some mad reality or I was still in a dream, I reached my hand toward the dead machine. Heer snatched me away.\n “Do you want to die? It may still be operational.”\n Yt pushed me roughly into the corridor, then turned to fire a final e-m charge into the room. I heard a long keening wail like a cork being turned in a bottle that faded into silence. In that silence I heard for the first time the sounds. Gun-fire, men shouting, men roaring, engines revving, aircraft overhead, women crying. Women wailing. And everywhere, above and below, the clicking scamper of small plastic feet.\n “What’s going on?” Suddenly I was chilled and trembling with dread. “What’s happened?”\n “The House of Jodhra is under attack,” Heer said.\n I pulled away from yts soft grip.\n “Then I have to go, I have to fight, I have to defend us. I am a weapon.”\n Heer shook yts head in exasperation and with yts gun hand struck me a ringing blow on the side of my side.\n “Stupid stupid! Understand! The Azads, they are killing everything! Your father, your brothers, they are killing everyone. They would have killed you, but they forgot you moved to a new room.”\n “Dadaji? Arvind, Kiran?”\n Heer tugged me along, still reeling, still dizzy from the blow but more dazed, more stunned by what the nute had told me. My father, my brothers . . .\n “Mamaji?” My voice was three years old.\n “Only the gene-line.”\n We rounded a corner. Two things happened at the same time. Heer shouted “Down!” and as I dived for the smooth marble I glimpsed a swarm of monkey-machines bounding towards me, clinging to walls and ceiling. I covered my head and cried out with every shot as Heer fired and fired and fired until the gas-cell canister clanged to the floor.\n “They hacked into them and reprogrammed them. Faithless, betraying things. Come on.” The smooth, manicured hand reached for and I remember only shards of noise and light and dark and bodies until I found myself in the back seat of a fast German car, Heer beside me, gun cradled like a baby. I could smell hot electricity from the warm weapon. Doors slammed. Locks sealed. Engine roared.\n “Where to?”\n “The Hijra Mahal.”\n As we accelerated through the gate more monkey-robots dropped from the naqqar khana. I heard their steel lives crack and burst beneath our wheels. One clung to the door, clawing at the window frame until the driver veered and scraped it off on a streetlight.\n “Heer . . . ”\n Inside it was all starting to burst, to disintegrate into the colours and visions and sounds and glances of the night. My father my head my brothers my head my mother my family my head my head my head.\n “It’s all right,” the nute said, taking my hand in yts. “You’re safe. You’re with us now.”\n The house of Jodhra, which had endured for a thousand years, fell, and I came to the house of the nutes. It was pink, as all the great buildings of Jaipur were pink, and very discreet. In my life before, as I now thought of it, I must have driven past its alleyway a hundred times without ever knowing the secret it concealed; cool marble rooms and corridors behind a façade of orioles and turrets and intricately carved windows, courts and tanks and water-gardens open only to the sky and the birds. But then the Hijra Mahal had always been a building apart. In another age it had been the palace of the hijras, the eunuchs. The un-men, shunned yet essential to the ritual life of Rajput Jaipur, living in the very heart of the old city, yet apart.\n There were six of them: Sul the janampatri seer, astrologer to celebs as far away as the movie boulevards of Mumbai; Dahin the plastic surgeon, who worked on faces on the far side of the planet through remote machines accurate to the width of an atom; Leel the ritual dancer, who performed the ancient Nautch traditions and festival dances; Janda the writer, whom half of India knew as Queen Bitch of gupshup columnists; Suleyra whose parties and events were the talk of society from Srinagar to Madurai; and Heer, once khidmutgar to the House of Jodhra. My six guardians bundled me from the car wrapped in a heavy chador like a Muslim woman and took me to a domed room of a hundred thousand mirror fragments. Their warm, dry hands gently held me on the divan—I was thrashing, raving as the shock hit me—and Dahin the face surgeon deftly pressed an efuser to my arm.\n “Hush. Sleep now.”\n I woke among the stars. For an instant I wondered if I was dead, stabbed in my sleep by the poison needle of an Azad assassin robot that had scaled the hundred windows of the Jodhra Mahal. Then I saw that they were the mirror shards of the roof, shattering the light of a single candle into a hundred thousand pieces. Heer sat cross-legged on a dhuri by my low bedside.\n “How long . . . ”\n “Two days, child.”\n “Are they . . . ”\n “Dead. Yes. I cannot lie. Every one.”\n But even as the House of Jodhra fell, it struck back like a cobra, its back broken by a stick. Homing missiles, concealed for years, clinging like bats under shop eaves and bus shelters, unfolded their wings and lit their engines and sought out the pheromone profiles of Azad vehicles. Armoured Lexuses went up in fireballs in the middle of Jaipur’s insane traffic as they hooted their ways towards the safety of the airport. No safety even there, a Jodhra missile locked on to the company tilt jet as it lifted off, hooked into the engine intake with its titanium claws until the aircraft reached an altitude at which no one could survive. The blast cast momentary shadows across the sundials of the Jantar Mantar, marking the moment of Jodhra revenge. Burning debris set fires all across the basti slums.\n “Are they . . . ”\n “Jahangir and the Begum Azad died in the tiltjet attack and our missiles took out much of their board, but their countermeasures held off our attack on their headquarters.”\n “Who survived?”\n “Their youngest son Salim. The line is intact.”\n I sat up in my low bed that smelled of sandalwood. The stars were jewels around my head.\n “It’s up to me then.”\n “Memsahb . . . ”\n “Don’t you remember what he said, Heer? My father? You are a weapon, never forget that. Now I know what I am a weapon for.”\n “Memsahb . . . Padmini.” The first time yt had ever spoken my name. “You are still shocked, you don’t know what you’re saying. Rest. You need rest. We’ll talk in the morning.” Yt touched yts forefinger to yts full lips, then left. When I could no longer hear soft footfalls on cool marble, I went to the door. Righteousness, rage and revenge were one song inside me. Locked. I heaved, I beat, I screamed. The Hijra Mahal did not listen. I went to the balcony that hung over the alley. Even if I could have shattered the intricate stone jali, it was a ten-metre drop to street level where the late night hum of phatphat autorickshaws and taxis was giving way to the delivery drays and cycle-vans of the spice merchants. Light slowly filled up the alley and crept across the floor of my bedroom: by its gathering strength I could read the headlines of the morning editions. WATER WARS: DOZENS DEAD IN CLASH OF THE RAJAS. JAIPUR REELS AS JODHRAS ANNIHILATED. POLICE POWERLESS AGAINST BLOODY VENDETTA.\n In Rajputana, now as always, water is life, water is power. The police, the judges, the courts: we owned them. Us, and the Azads. In that we were alike. When gods fight, what mortal would presume to judge?\n “A ride in triumph, a fall through a window into love, a marriage and a mourning?” I asked. “That’s it?”\n Sul the astrologer nodded slowly. I sat on the floor of yts observatory. Incense rose on all sides of me from perforated brass censors. At first glance room was so simple and bare that even a sadhu would have been uncomfortable, but as my eyes grew accustomed to the shadow in which it must be kept to work as a prediction machine, I saw that every centimetre of the bare pink marble was covered in curving lines and Hindi inscriptions, so small and precise they might be the work of tiny gods. The only light came from a star-shaped hole in the domed ceiling: Sul’s star chamber was in the topmost turret of the Hijra Mahal, closest to heaven. As yt worked with its palmer and made the gestures in the air of the janampatri calculations, I watched a star of dazzling sunlight crawl along an arc etched in the floor, measuring out the phases of the House of Meena. Sul caught me staring at it, but I had only been curious to see what another nute looked like, close up. I had only ever known Heer. I had not known there could be as many as six nutes in the whole of India, let alone Jaipur. Sul was fat and had unhealthy yellow skin and eyes and shivered a lot as it pulled yts shawl around it, though the turret room directly under the sun was stifling hot. I looked for clues to what yt had been before: woman, man. Woman I thought. I had always thought of Heer as a man—an ex-man, though yt never mentioned the subject. I had always known it was taboo. When you Stepped Away, you never looked back.\n “No revenge, no justice?”\n “If you don’t believe me, see for yourself.”\n Fingers slipped the lighthoek behind my ear and the curving lines on the floor leaped up into mythical creatures studded with stars. Makara the crocodile, Vrishaba the Bull, the twin fishes of Meena: the twelve rashi. Kanya the dutiful daughter. Between them the twenty-seven nakshatars looped and arced, each of them subdivided into four padas; wheels within wheels within wheels, spinning around my head like blades as I sat on Sul’s marble floor.\n “You know I can’t make any sense out of this” I said, defeated by the whirling numbers. Sul leaned forward and gently touched my hand.\n “A ride in triumph, a fall through a window into love, a marriage and a mourning. Window to widow. Trust me.”\n “Young girls are truly beautiful on the inside.” Dahin the dream doctor’s voice came from beyond the bank of glaring surgical lights as the bed on which I lay tilted back. “No pollution, no nasty dirty hormones. Everything clean and fresh and lovely. Most of the women who come here, I never see any deeper than their skin. It is a rare privilege to be allowed to look inside someone.”\n It was midnight in the chrome and plastic surgery in the basement of the Hijra Mahal, a snatched half-hour between the last of the consultations (society ladies swathed in veils and chadors to hide their identities) and Dahin hooking into the global web, settling the lighthoek over the visual centre in yts brain and pulling on the manipulator gloves connected to surgical robots in theatres half a world away. So gentle, so deft; too agile for any man’s. Dahin of the dancing hands.\n “Have you found it yet?” I asked. My eyes were watering from the lights. Something in them, something beyond them, was looking into my body and displaying it section by section, organ by organ, on Dahin’s inner vision. Traditionally, the hijras—were the only ones allowed to examine the bodies of the zenana women and reported their findings to the doctors outside.\n “Found what? Finger lasers? Retractable steel claws? A table-top nuke wired into your tummy?”\n “My father said over and over, I’m a weapon, I’m special . . . I will destroy the house of Azad.”\n “Cho chweet, if there’s anything there, this would have shown it to me.”\n My eyes were watering. I pretended it was the brightness of the light.\n “Maybe there’s something . . .smaller, something you can’t see, like . . . bugs. Like a disease.”\n I heard Dahin sigh and imagined the waggle of yts head.\n “It’ll take a day or two but I can run a diagnostic.” Tippy-tapping by the side of my head. I turned my head and froze as I saw a spider robot no bigger than my thumb towards my throat. It was a month since the night, but still I was distrustful of robots. I imagined I always would be. I felt a little flicking needle pain in the side of my neck, then the robot moved over my belly. I cringed at the soft spiking of its sharp, precise feet. I said, “Dahin, do you mind me asking; did you do this?”\n A short jab of pain in my belly.\n “Oh yes, baba. All this, and more. Much much more. I only work on the outside, the externals. To be like me—to become one of us—you have to go deep, right down into the cells.”\n Now the robot was creeping over my face. I battled the urge to sweep it away and crush it on the floor. I was a weapon, I was special. This machine would show me how.\n “Woman, man, that’s not a thing easily undone. They take you apart, baba. Everything, hanging there in a tank of fluid. Then they put you back together again. Different. Neither. Better.”\n Why, I wanted to ask, why do this thing to yourself? But then I felt a tiny scratch in the corner of my eye as the robot took a scrape from my optic nerve.\n “Three days for the test results, baba.”\n Three days, and Dahin brought the results to me as I sat in the Peacock Pavilion overlooking the bazaar. The wind was warm and smelled of ashes of roses as it blew through the jali and turned the delicately hand-written sheets. No implants. No special powers or abilities. No abnormal neural structures, no tailored combat viruses. I was a completely normal thirteen year-old Kshatriya girl.\n I leaped over the swinging stick. While still in the air, I brought my own staff up in a low, catching the Azad’s weapon between his hands. It flew from his grasp, clattered across the wooden floor of the hall. He threw a kick at me, rolled to pick up his pole, but my swinging tip caught him hard against the temple, send him down to the floor like dropped laundry. I vaulted over him, swung my staff high to punch its brass-shod tip into the nerve cluster under the ear. Instant death.\n “And finish.”\n I held the staff millimetres away from my enemy’s brain. Then I slipped the lighthoek from behind my ear and the Azad vanished like a djinn. Across the practice floor, Leel set down yts staff and unhooked yts hoek. In yts inner vision its representation me—enemy, sparring partner, pupil—likewise vanished. As ever at these practice sessions, I wondered what shape Leel’s avatar took. Yt never said. Perhaps yt saw me.\n “All fighting is dance, all dance is fighting.” That was Leel’s first lesson to me on the day yt agreed to train me in Silambam. For weeks I had watched yt from a high balcony practice the stampings and head movements and delicate hand gestures of the ritual dances. Then one night after yt had dismissed yts last class something told me, stay on, and I saw yt strip down to a simple dhoti and take out the bamboo staff from the cupboard and leap and whirl and stamp across the floor the attacks and defences of the ancient Keralan martial art.\n “Since it seems I was not born a weapon, then I must become a weapon.”\n Leel had the dark skin of a southerner and I always felt that yt was very much older than yt appeared. I also felt—again with no evidence—that yt was the oldest inhabitant of the Hijra Mahal, that yt had been there long before any of the others came. I felt that yt might once have been a hijra and that the dance moves it practised and taught were from the days when no festival or wedding was complete without the outrageous, outcast eunuchs.\n “Weapon, so? Cut anyone tries to get close you, then when you’ve cut everyone, you cut yourself. Better things for you to be than a weapon.”\n I asked Leel that same question every day until one evening thick with smog and incense from the great Govind festival yt came to me as I sat in my window reading the chati channels on my lighthoek.\n “So. The stick fighting.”\n That first day, as I stood barefoot on the practice floor in my Adidas baggies and stretchy sports top trying to feel the weight and heft of the fighting staff in my hands, I had been surprised when Leel fitted the lighthoek behind my ear. I had assumed I would spar against the guru ytself.\n “Vain child. With what I teach you, you can kill. With one blow. Much safer to fight your image, in here.” Yt tapped yts forehead. “As you fight mine. Or whatever you make me.”\n All that season I learned the dance and ritual of Silambam; the leaps and the timings and the sweeps and the stabs. The sharp blows and the cries. I blazed across the practice floor yelling Kerala battle hymns, my staff a blur of thrusts and parries and killing strokes.\n “Heavy child, heavy. Gravity has no hold on you, you must fly. Beauty is everything. See?” And Leel would vault on yts staff and time seemed to freeze around yt, leaving yt suspended there, like breath, in midair. And I began to understand about Leel, about all the nutes in this house of hijras. Beauty was everything, a beauty not male, not female; something else. A third beauty.\n The hard, dry winter ended and so did my training. I went down in my Adidas gear and Leel was in yts dance costume, bells ringing at yts ankles. The staffs were locked away.\n “This is so unfair.”\n “You can fight with the stick, you can kill with a single blow, how much more do you need to become this weapon you so want to be?”\n “But it takes years to become a master.”\n “You don’t need to become a master. And that is why I have finished your training today, because you should have learned enough to understand the perfect uselessness of what you want to do. If you can get close, if you ever learn to fly, perhaps you might kill Salim Azad, but his soldiers will cut you apart. Realise this, Padmini Jodhra. It’s over. They’ve won.”\n In the morning when the sun cast pools of light in the shapes of birds on to the floor of the little balcony, Janda would drink coffee laced with paan and, lazily lifting a finger to twirl away another page in yts inner vision, survey the papers the length and breadth of India, from the Rann of Kutch to the Sundarbans of Bengal.\n “Darling, how can you be a bitch if you don’t read?”\n In the afternoon over tiffin, Janda would compose yts scandalous gossip columns: who was doing what with whom where and why, how often and how much and what all good people should think. Yt never did interviews. Reality got in the way of creativity.\n “They love it, sweetie. Gives them an excuse to get excited and run to their lawyers. First real emotion some of them have felt in years.”\n At first I had been scared of tiny, monkey-like Janda, always looking, checking analysing from yts heavily kohled eyes, seeking weaknesses for yts acid tongue. Then I saw the power that lay in yts cuttings and clippings and entries, taking a rumour here, a whisper there, a suspicion yonder and putting them together into a picture of the world. I began to see how I could use it as a weapon. Knowledge was power. So dry winter gave way to thirsty spring and the headlines in the streets clamoured MONSOON SOON? and RAJPUTANA DEHYDRATES, Janda helped me build a picture of Salim Azad and his company. Looking beyond those sensationalist headlines to the business sections I grew to recognise his face beneath the headlines: AZAD PLUNDERS CORPSE OF RIVALS. SALIM AZAD: REBUILDER OF A DYNASTY. AZAD WATER IN FIVE RIVERS PROJECT. In the society section I saw him at weddings and parties and premiers. I saw him ski-ing in Nepal and shopping in New York and at the races in Paris. In the stock-market feeds I watched the value of Azad Water climb as deals were struck, new investments announced, take-overs and buy-outs made public. I learned Salim Azad’s taste in pop music, restaurants, tailors, designers, filmi stars, fast fast cars. I could tell you the names of the people who hand-sewed his shoes, who wrote the novel on his bedside table, who massaged his head and lit cones of incense along his spine, who flew his private tilt-jets and programmed his bodyguard robots.\n One smoggy, stifling evening as Janda cleared away the thalis of sweetmeats it gave me while I worked (“Eat, darling, eat and act”) I noticed the lowlight illuminate two ridges of shallow bumps along the inside of yts forearm. I remembered them on Heer all my life and had always known they were as much part of a nute as the absence of any sexual organs, as the delicate bones and the long hands and the bare skull. In the low, late light they startled me because I had never asked, what are they for?\n “For? Dear girl.” Janda clapped yts soft hands together. “For love. For making love. Why else would we bear these nasty, ugly little goose-bumps? Each one generates a different chemical response in our brains. We touch darling. We play each other like instruments. We feel . . .things you cannot. Emotions for which you have no name, for which the only name is to experience them. We step away to somewhere not woman, not man; to the nute place.”\n Yt turned yts arm wrist-upward to me so that yts wide sleeve fell away. The two rows of mosquito-bite mounds were clear and sharp in the yellow light. I thought of the harmonium the musicians would play in the old Jodhra Palace, fingers running up and down the buttons, the other hand squeezing the bellows. Play any tune on it. I shuddered. Janda saw the look on my face and snatched yts arm back into yts sleeve. And then, laid on in the newspaper in front of me, was an emotion for which I had no name, which I could only know my experiencing it. I thought no one knew more that I about Salim Azad, but here was a double spread of him pushing open the brass-studded gates of the Jodhra Mahal, my old home, where his family annihilated mine, under the screaming headline: AZAD BURIES PAST, BUYS PALACE OF RIVALS. Below that, Salim Azad standing by the pillars of the Diwan, shading his eyes against the sun, as his staff ran our burning sun-man-bird kite up above the turrets and battlements into the hot yellow sky.\n In the costume and make-up of Radha, divine wife of Krishna, I rode the painted elephant through the pink streets of Jaipur. Before me the band swung and swayed, its clarinets and horns rebounding from the buildings. Around and through the players danced Leel and the male dancer in red, swords flashing and clashing, skirts whirling, bells ringing. Behind me came another twenty elephants, foreheads patterned with the colours of Holi, howdahs streaming pennons and gold umbrellas. Above me robot aircraft trailed vast, gossamer-light banners bearing portraits of the Holy Pair and divine blessings. Youths and children in red wove crimson patterns with smoke-sticks and threw handfuls of coloured powder into the crowd. Holi Hai! Holi Hai! Reclining beside me on the golden howdah, Suleyra waved yts flute to the crowd. Jaipur was an endless tunnel of sound; people cheering, holiday shouts, the hooting of phatphat horns.\n “Didn’t I tell you you needed to get out of that place, cho chweet?”\n In the blur of days inside the Hijra Mahal, I had not known that a year had passed without me setting foot outside its walls. Then Suleyra, the fixer, the jester, the party-maker, had come skipping into my room, pointed yts flute at me and said, “Darling, you simply must be my wife,” and I had realised that it was Holi, the Elephant Festival. I had always loved Holi, the brightest, maddest of festivals.\n “But someone might see me . . . ”\n “Baba, you’ll be blue all over. And anyway, no-one can touch the bride of a god on her wedding day.”\n And so, blue from head to toe, I reclined on gilded cushions beside Suleyra, who had been planning this public festival for six months, equally blue and not remotely recognisable as anything human, man woman or nute. The city was clogged with people, the streets stifling hot, the air was so thick with hydrocarbon fumes the elephants wore smog goggles and I loved every bit of it. I was set free from the Hijra Mahal.\n A wave of Suleyra/Krishna’s blue hand activated the chips in the elephant’s skull and turned it left through the arched gateway to the Old City, behind the boogieing band and the leaping, sword-wielding dancers. The crowds spilled off the arcades on to the street, ten, twenty deep. Every balcony was lined; women and children threw handfuls of colour down on us. Ahead I could see a platform and a canopy. The band was already marching in place while Leel and yts partner traded mock blows.\n “Who is up there?” I asked, suddenly apprehensive.\n “A most important dignitary,” said Suleyra, taking the praise of the spectators. “A very rich and powerful man.”\n “Who is he, Suleyra?” I asked. Suddenly, I was cold in the stinking heat of Jaipur. “Who is he?”\n But the dancers and the band had moved on and now our elephant took their place in front of the podium. A tap from Suleyra’s Krishna- flute: the elephant wheeled to face the dais and bent its front knees in a curtsey. A tall, young man in a Rajput costume with a flame red turban stood up to applaud, face bright with delight.\n I knew that man’s shoe size and star sign. I knew the tailor who had cut his suit and the servant who wound his turban. I knew everything about him, except that he would be here, reviewing the Holi parade. I tensed myself to leap. One blow; Suleyra’s Krishna-flute would suffice as a weapon. But I did nothing, for I saw a thing more incredible. Behind Salim Azad, bending forward, whispering in his ear, eyes black as obsidian behind polarising lenses, was Heer.\n Salim Azad clapped his hands in delight.\n “Yes, yes, this is the one! Bring her to me. Bring her to my palace.”\n So I returned from the Palace of the Hijras to the Palace of the Jodhras, that was now the Palace of the Azads. I came through the brass gates under the high tower from which I had first looked out across Jaipur on the night of the steel monkey, across the great courtyard. The silver jars of holy Ganga water still stood on either side of the Diwan where my father had managed his water empire. Beneath the gaze of the gods and the monkeys on the walls, I was dragged out of the car by Azad jawans and carried me, screaming and kicking up the stairs to the zenana. “My brother lay there, so and so died there, my father died there,” I shouted at them as they dragged me along that same corridor down which I had fled a year before. The marble floors were pristine, polished. I could not remember where the blood had been. Women retainers waited for me at the entrance to the zenana, for men could not enter the women’s palace, but I flew and kicked and punched at them with all the skills Leel had taught me. They fled shrieking but all that happened was the soldiers held me at gunpoint until house robots arrived. I could kick and punch all I liked and never lay a scratch on their spun-diamond carapaces.\n In the evening I was brought to the Hall of Conversations, an old and lovely room where women could talk and gossip with men across the delicate stone jali that ran the length of the hall. Salim Azad walked the foot-polished marble. He was dressed as a Rajput, in the traditional costume. I thought he looked like a joke. Behind him was Heer. Salim Azad paced up and down for five minutes, studying me. I pressed myself to the jali and tried to stare him down. Finally he said,\n “Do you have everything you want? Is there anything you need?”\n “Your heart on a thali,” I shouted. Salim Azad took a step back.\n “I’m sorry about the necessity of this . . . But please understand, you’re not my prisoner. Both of us are the last. There has been enough death. The only way I can see to finish this feud is to unite our two houses. But I won’t force you, that would be . . . impolite. Meaningless. I have to ask and you have to answer me.” He came as close to the stonework as was safe to avoid my Silambam punch. “Padmini Jodhra, will you marry me?”\n It was so ridiculous, so stupid and vain and so impossible; that in my shock, I felt the word yes in the back of my throat. I swallowed it down, drew back my head and spat long and full at him. The spit struck a moulding and ran down the carved sandstone.\n “Understand I have nothing but death for you, murderer.”\n “’Even so, I shall ask every day, until you say yes,” Salim Azad said. With a whisk of robes, he turned and walked away. Heer, hands folded in yts sleeves, eyes pebbles of black, followed.\n “And you, hijra,” I yelled, reaching a clawing hand through the stone jali to seize, to rip. “You’re next, traitor.”\n That night I thought about starving myself to death, like the great Gandhiji when he battled the British to make India free and their Empire had stepped aside for one old, frail, thin, starving man. I forced my fingers down my throat and puked up the small amount of food I had forced myself to eat that evening. Then I realised that starved and dead I was no weapon. The House of Azad would sail undisturbed into the future. It was the one thing kept me alive, kept me sane in those first days in the zenana; my father’s words: you are a weapon. All I had to discover was what kind.\n In the night, a small sweeper came and cleaned away my puke.\n It was as he said. Every evening as the sun touched the battlements of the Nahargarh Fort on the hill above Jaipur, Salim Azad came to the Hall of the Conversations. He would talk to me about the history of his family; back twenty generations to central Asia, from where they had swept down into the great river plains of Hindustan to build an empire of unparalleled wealth and elegance and beauty. They had not been warriors or rulers. They had been craftsmen and poets, makers of exquisite fine miniatures and jewel-like verses in Urdu, the language of poets. As the great Mughals erected their forts and palaces and fought their bloody civil wars, they had advanced from court painters and poets to court advisors, then to viziers and khidmutgars, not just to the Mughals, but to the Rajputs, the Marathas and later to the East India Company and the British Raj. He told me tales of illustrious ancestors and stirring deeds; of Aslam who rode out between the armies of rival father and son Emperors and saved the Panjab; of Farhan who carried love notes between the English Resident of Hyderabad and the daughter of the Nizam and almost destroyed three kingdoms; of Shah Hussain who had struggled with Gandhi against the British for India, who had been approached by Jinnah to support partition and the creation of Pakistan but who had refused, though his family had all but been annihilated in the ethnic holocaust following Independence. He told me of Elder Salim, his Grandfather, founder of the dynasty, who had come to Jaipur when the monsoon failed the first terrible time in 2008 and set up village water reclamation schemes that over the decades became the great water empire of the Azads. Strong men, testing times, thrilling stories. And every night he said as the sun dipped behind Nahargarh fort, “will you marry me?” Every night I turned away from him without a word. But night by night, story by story, ancestor by ancestor, he chipped away at my silence. These were people as real, as vital as my own family. Now their stories had all ended. We were both the last.\n I tried to call Janda at the Hijra Mahal, to seek wisdom and comfort from my sister/brothers, to find out if they knew why Heer had turned and betrayed me but mostly to hear another voice than the sat channels or Salim Azad. My calls bounced. White noise: Salim had my apartments shielded with a jamming field. I flung the useless palmer against the painted wall and ground it under the heel of my jewelled slipper. I saw endless evenings reaching out before me. Salim would keep coming, night after night, until he had his answer. He had all the time in the world. Did he mean to drive me mad to marry him?\n Marry him. This time I did not push the thought away. I turned it this way, that studied it, felt out its implications. Marry him. It was the way out of this marble cage.\n In the heat of the mid-day, a figure in voluminous robes came hurrying down the cool corridor to the zenana. Heer. I had summoned yt. Because yt was not a man yt could enter the zenana, like the eunuchs of the Rajput days. Yt did not fear the skills Leel had taught me. Yt knew. Yt namasted.\n “Why have you done this to me?”\n “Memsahb, I have always been, and remain, a loyal servant of the House of Jodhra.”\n “You’ve given me into the hands of my enemies.”\n “I have saved you from the hands of your enemies, Padmini. It would not just be the end of this stupid, pointless bloody vendetta. He would make you a partner. Padmini, listen to what I am saying; you would me more than just a wife. Azad Jodhra. A name all India would learn.”\n “Jodhra Azad.”\n Heer pursed yts rosebud lips.\n “Padmini Padmini, always, this pride.”\n And yt left without my dismissal.\n That night in the blue of the magic hour Salim Azad came again to the zenana, a pattern of shadows beyond the jali. I saw him open his lips. I put a finger up to mine.\n “Ssh. Don’t speak. Now it’s time for to tell you a story, my story, the story of the House of Jodhra.”\n So I did, for one hundred and one nights, like an old Muslim fairytale, seated on cushions leaning up against the jali, whispering to Salim Azad in his Rajput finery wonderful tales of dashing Kshatriya cavalry charges and thousand cannon sieges of great fortress, of handsome princes with bold moustaches and daring escapes with princesses in disguise in baskets over battlements, of princedoms lost over the fall of a chessman and Sandhurst-trained sowar officers more British than the British themselves and air-cav raids against Kashmiri insurgents and bold anti-terrorist strikes; of great polo matches and spectacular durbars with a hundred elephants and the man-bird sun-kite of the Jodhras sailing up into the sky over Jaipur; for a thousand years our city. For one hundred nights I bound him with spells taught to me by the nutes of the Hijra Mahal, then on the one hundred and first night I said, “One thing you’ve forgotten.”\n “What?”\n “To ask me to marry you.”\n He gave a little start, then waggled his head in disbelief and smiled. He had very good teeth.\n “So, will you marry me?”\n “Yes,” I said. “Yes.”\n The day was set three weeks hence. Sul had judged it the most propitious for a wedding of dynasties. Suleyra had been commissioned to stage the ceremony: Muslim first, then Hindu. Janda had been ask to draw on yts celebrity inside knowledge to invite all India to the union of the houses of Azad and Jodhra. This is the wedding of the decade, yt cried in yts gupshup columns, come or I will bad-mouth you. Schedules of the great and glorious were rearranged, aeai soapi stars prepared avatars to attend, as did those human celebs who were unavoidably out of the subcontinent. From the shuttered jharokas of the zenana I watched Salim order his staff and machines around the great court, sending architects here, fabric designers there, pyrotechnicians yonder. Marquees and pavilions went up, seating was laid out, row upon row, carpet laid, patterns drawn in sand to be obliterated by the feet of the processional elephants. Security robots circled among the carrion-eating black kites over the palace, camera drones flitted like bats around the great court, seeking angles. Feeling my eyes on him, Salim would glance up at me, smile, lift his hand in the smallest greeting. I glanced away, suddenly shy, a girl-bride. This was to be a traditional, Rajputana wedding. I would emerge from purdah only to meet my husband. For those three weeks, the zenana was not a marble cage but an egg from which I would hatch. Into what? Power, unimaginable wealth, marriage to man who had been my enemy. I still did not know if I loved him or not. I still saw the ghost shadows on the marble where his family had destroyed mine. He still came every night to read me Urdu poetry I could not understand. I smiled and laughed but I still did not know if what I felt was love, or just my desperation to be free. I still doubted it on the morning of my wedding.\n Women came at dawn to bathe and dress me in wedding yellow and make up my hair and face and anoint me with turmeric paste. They decked me with jewels and necklaces, rings and bangles. They dabbed me with expensive perfume from France and gave me good luck charms and advice. Then they threw open the brass-studded doors of the zenana and with the Palace guard of robots, escorted me along the corridors and down the stairs to the great court. Leel danced and somersaulted before me; no wedding could be lucky without a hijra, a nute.\n All of India had been invited and all of India had come, in flesh and in avatar. People rose, applauding. Cameras swooped on ducted fans. My nutes, my family from the Hijra Mahal, had been given seats at row ends.\n “How could I improve on perfection?” said Dahin the face doctor as my bare feet trod rose petals towards the dais.\n “The window, the wedding!” said Sul. “And, pray the gods, many many decades from now, a very old and wise widow.”\n “The setting is nothing without the jewel,” exclaimed Suleyra Party Arranger, throwing pink petals into the air.\n I waited with my attendants under the awning as Salim’s retainers crossed the courtyard from the men’s quarters. Behind them came the groom on his pure white horse, kicking up the rose petals from its hooves. A low, broad ooh went up from the guests then more applause. The maulvi welcomed Salim onto the platform. Cameras flocked for angles. I noticed that every parapet and carving was crowded with monkeys—flesh and machine—watching. The maulvi asked me most solemnly if I wished to be Salim Azad’s bride.\n “Yes,” I said, as I had said the night when I first accepted his offer. “I do, yes.”\n He asked Salim the same question, then read from the Holy Quran. We exchanged contracts, our assistants witnessed. The maulvi brought the silver plate of sweetmeats. Salim took one, lifted my gauze veil and placed it on my tongue. Then the maulvi placed the rings upon our fingers and proclaimed us husband and wife. And so were our two warring houses united, as the guests rose from their seats cheering and festival crackers and fireworks burst over Jaipur and the city returned a roaring wall of vehicle horns. Peace in the streets at least. As we moved towards the long, cool pavilions for the wedding feast, I tried to catch Heer’s eye as yt paced behind Salim. Yts hands were folded in the sleeves of yts robes, yts head thrust forward, lips pursed. I thought of a perching vulture.\n We sat side by side on golden cushions at the head of the long, low table. Guests great and good took their places, slipping off their Italian shoes, folding their legs and tucking up their expensive Delhi frocks as waiters brought vast thalis of festival food. In their balcony overlooking the Diwan, musicians struck up, a Rajput piece older than Jaipur itself. I clapped my hands. I had grown up to this tune. Salim leaned back on his bolster.\n “And look.”\n Where he pointed, men were running up the great sun-bird-man kite of the Jodhras. As I watched it skipped and dipped on the erratic winds in the court, then a stronger draught took it soaring up into the blue sky. The guests went oooh again.\n “You have made me the happiest men in the world,” Salim said.\n I lifted my veil, bent to him and kissed his lips. Every eye down the long table turned to me. Everyone smiled. Some clapped.\n Salim’s eyes went wide. Tears suddenly streamed from them. He rubbed them away and when he put his hands down, his eyelids were two puffy, blistered boils of flesh, swollen shut. He tried to speak but his lips were bloated, cracked, seeping blood and pus. Salim tried to stand, push himself away from me. He could not see, could not speak, could not breath. His hands fluttered at the collar of his gold-embroidered sherwani.\n “Salim!” I cried. Leel was already on yts feet, ahead of all the guest doctors and surgeons as they rose around the table. Salim let out a thin, high-pitched wail, the only scream that would form in his swollen throat. Then he went down onto the feast table.\n The pavilion was full of screaming guests and doctors shouting into palmers and security staff locking the area down. I stood useless as a butterfly in my make-up and wedding jewels and finery as doctors crowded around Salim. His face was like a cracked melon, a tight bulb of red flesh. I swatted away an intrusive hovercam. It was the best I could do. Then I remember Leel and the other nutes taking me out into the courtyard where a tilt-jet was settling, engines sending the rose petals up in a perfumed blizzard. Paramedics carried Salim out from the pavilion on a gurney. He wore an oxygen rebreather. There were tubes in his arms. Security guards in light-scatter armour pushed the great and the celebrated aside. I struggled with Leel as the medics slid Salim into the tilt-jet but yt held me with strange, withered strength.\n “Let me go, let me go, that’s my husband . . . ”\n “Padmini, Padmini, there is nothing you can do.”\n “What do you mean?”\n “Padmini, he is dead. Salim your husband is dead.”\n Yt might have said that the moon was a great mouse in the sky.\n “Anaphylactic shock. Do you know what that is?”\n “Dead?” I said simply, quietly. Then I was flying across the court toward the tilt-jet as it powered up. I wanted to dive under its engines. I wanted to be scattered like the rose petals. Security guards ran to cut me off but Leel caught me first and brought me down. I felt the nip of an efuser on my arm and everything went soft as the tranquilizer took me.\n After three weeks I called Heer to me. For the first week the security robots had kept me locked back in the zenana while the lawyers argued. I spent much of that time out of my head, part grief-stricken, part insane at what had happened. Just one kiss. A widow no sooner than I was wed. Leel tended to me, the lawyers and judges reached their legal conclusions. I was the sole and lawful heir of Azad-Jodhra Water. The second week I came to terms with my inheritance: the biggest water company in Rajputana, the third largest in the whole of India. There were contracts to be signed, managers and executives to meet, deals to be set up. I waved them away, for the third week was my week, the week in which I understood what I had lost. And I understood what I had done, and how, and what I was. Then I was ready to talk to Heer.\n We met in the Diwan, between the great silver jars that Salim, dedicated to his new tradition, had kept topped up with holy Ganga water. Guard-monkeys kept watch from the rooftops. My monkeys. My Diwan. My palace. My company, now. Heer’s hands were folded in yts sleeves. Yts eyes were black marble. I wore widow’s white—a widow, at age fifteen.\n “How long had you planned it?”\n “From before you born. From before you were even conceived.”\n “I was always to marry Salim Azad.”\n “Yes.”\n “And kill him.”\n “You could not do anything but. You were designed that way.”\n Always remember, my father had said, here among these cool, shady pillars, you are a weapon. A weapon deeper, subtler than I had ever imagined, deeper even than Leel’s medical machines could look. A weapon down in the DNA: designed from conception to cause a fatal allergic reaction in any member of the Azad family. An assassin in my every cell, in every pore and hair, in every fleck of dust shed from my deadly skin.\n I killed my beloved with a kiss.\n I felt a huge, shuddering sigh inside me, a sigh I could never, must never utter.\n “I called you a traitor when you said you had always been a loyal servant of the House of Jodhra.”\n “I was, am and will remain so, please God.” Heer dipped yts hairless head in a shallow bow. Then yt said, “When you become one of us, when you step away, you step away from so much; from your own family, from the hope of ever having children . . . You are my family, my children. All of you, but most of all you, Padmini. I did what I had to for my family, and now you survive, now you have all that is yours by right. We don’t live long, Padmini. Ours lives are too intense, too bright, too brilliant. There’s been too much done to us. We burn out early. I had to see my family safe, my daughter triumph.”\n “Heer . . . ”\n Yt held up a hand, glanced away, I though I saw silver in the corners of those black eyes.\n “Take your palace, your company, it is all yours.”\n That evening I slipped away from my staff and guards. I went up the marble stairs to the long corridor where my room had been before I became a woman, and a wife, and a widow, and the owner of a great company. The door opened to my thumbprint, I swung it open into dust-hazy golden sunlight. The bed was still made, mosquito nets neatly knotted up. I crossed to the balcony. I expected the vines and creepers to have grown to a jungle; with a start I realized it was just over a year since I had slept here. I could still pick out the hand-holds and foot-holds where I had followed the steel monkey up onto the roof. I had an easier way to that now. A door at the end of the corridor, previously locked to me, now opened onto a staircase. Sentry robots immediately bounced up as I stepped out onto the roof, crests raised, dart-throwers armed. A mudra from my hand sent them back into watching mode.\n Once again I walked between the domes and turrets to the balcony at the very top of the palace façade. Again, Great Jaipur at my bare feet took my breath away. The pink city kindled and burned in the low evening light. The streets still roared with traffic, I could smell the hot oil and spices of the bazaar. I now knew how to find the domes of the Hijra Mahal among the confusion of streets and apartment buildings. The dials and half-domes and buttresses of the Jantar Mantar threw huge shadows over each other, a confusion of clocks. Then I turned towards the glass scimitar of the Azad Headquarters—my headquarters now, my palace as much as this dead old Rajput pile. I had brought that house crashing down, but not in any way I had imagined. I wanted to apologise to Salim as he had apologised to me, every night when he came to me in the zenana, for what his family had done. They made me into a weapon and I did not even know.\n How easy to step out over the traffic, step away from it all. Let it all end, Azad and Jodhra. Cheat Heer of yts victory. Then I saw my toes with their rings curl over the edge and I knew I could not, must not. I looked up and there, at the edge of vision, along the bottom of the red horizon, was a line of dark. The monsoon, coming at last. My family had made me one kind of weapon, but my other family, the kind, mad, sad, talented family of the nutes had taught me, in their various ways, to be another weapon. The streets were dry but the rains were coming. I had reservoirs and canals and pumps and pipes in my power. I was Maharani of the Monsoon. Soon the people would need me. I took a deep breath and imagined I could smell the rain. Then I turned and walked back through the waiting robots to my kingdom.\n Originally published in The Starry Rift, edited by Jonathan Strahan."}