{"fingerprint": "q+/NEXSmYmN/giHsBsEAGA5Rz2w=", "sitename": "Clarkesworld Magazine", "title": "Special Economics by Maureen F. McHugh", "author": "Maureen F McHugh", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mchugh_11_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Special Economics by Maureen F. McHugh", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10970 words, novelette, REPRINT\nSpecial Economics\nJieling set up her boombox in a plague-trash market in the part where people sold parts for cars. She had been in the city of Shenzhen for a little over two hours but she figured she would worry about a job tomorrow. Everybody knew you could get a job in no time in Shenzhen. Jobs everywhere.\n“What are you doing?” a guy asked her.\n“I am divorced,” she said. She had always thought of herself as a person who would one day be divorced so it didn’t seem like a big stretch to claim it. Staying married to one person was boring. She figured she was too complicated for that. Interesting people had complicated lives. “I’m looking for a job. But I do hip-hop, too” she explained.\n“Hip hop?” He was a middle-aged man with stubble on his chin who looked as if he wasn’t looking for a job but should be.\n“Not like Shanghai,” she said. “Not like Hi-Bomb. They do gangsta stuff which I don’t like. Old fashioned. Like M.I.A.,” she said. “Except not political, of course.” She gave a big smile. This was all way beyond the guy. Jieling started the boombox. M.I.A. was Maya Arulpragasam, a Sri Lankan hip-hop artist who had started all on her own years ago. She had sung, she had danced, she had done her own videos. Of course M.I.A. lived in London, which made it easier to do hip hop and become famous.\nJieling had no illusions about being a hip hop singer, but it had been a good way to make some cash up north in Baoding where she came from. Set up in a plague-trash market and dance for yuan.\nJieling did her opening, her own hip hop moves, a little like Maya and a little like some things she had seen on MTV, but not too sexy because Chinese people did not throw you money if you were too sexy. Only April and it was already hot and humid.\nGe down, ge down,\nlang-a-lang-a-lang-a.\nGe down, ge down\nlang-a-lang-a-lang-a\nShe had borrowed the English. It sounded very fresh. Very criminal.\nThe guy said, “How old are you?”\n“Twenty-two,” she said, adding three years to her age, still dancing and singing.\nMaybe she should have told him she was a widow? Or an orphan? But there were too many orphans and widows after so many people died in the bird flu plague. There was no margin in that. Better to be divorced. He didn’t throw any money at her, just flicked open his cellphone to check listings from the market for plague-trash. The plague-trash market was so big it was easier to check online, even if you were standing right in the middle of it. She needed a new cellphone. Hers had finally fallen apart right before she headed south.\nShenzhen people were apparently too jaded for hip hop. She made fifty-two yuan, which would pay for one night in a bad hotel where country people washed cabbage in the communal sink.\nThe market was full of second-hand stuff. When over a quarter of a billion people died in four years, there was a lot of second-hand stuff. But there was still a part of the market for new stuff and street food and that’s where Jieling found the cellphone seller. He had a cart with stacks of flat plastic cellphone kits printed with circuits and scored. She flipped through; tiger-striped, peonies (old lady phones), metallics (old man phones), anime characters, moon phones, expensive lantern phones. “Where is your printer?” she asked.\n“At home,” he said. “I print them up at home, bring them here. No electricity here.” Up north in Baoding she’d always bought them in a store where they let you pick your pattern online and then printed them there. More to pick from.\nOn the other hand, he had a whole box full of ones that hadn’t sold that he would let go for cheap. In the stack she found a purple one with kittens that wasn’t too bad. Very Japanese which was also very fresh this year. And only one hundred yuan for phone and three hundred minutes.\nHe took the flat plastic sheet from her and dropped it in a pot of boiling water big enough to make dumplings. The hinges embedded in the sheet were made of plastic with molecular memory and when they got hot they bent and the plastic folded into a rough cellphone shape. He fished the phone out of the water with tongs, let it sit for a moment and then pushed all the seams together so they snapped. “Wait about an hour for it to dry before you use it,” he said and handed her the warm phone.\n“An hour,” she said. “I need it now. I need a job.”\nHe shrugged. “Probably okay in half an hour,” he said.\nShe bought a newspaper and scallion pancake from a street food vendor, sat on a curb, and ate while her phone dried. The paper had some job listings, but it also had a lot of listings from recruiters. ONE MONTH BONUS PAY! BEST JOBS! and NUMBER ONE JOBS! START BONUS! People scowled at her for sitting on the curb. She looked like a farmer but what else was she supposed to do? She checked listings on her new cellphone. Online there were a lot more listings than in the paper. It was a good sign. She picked one at random and called.\nThe woman at the recruiting office was a flat-faced southerner with buckteeth. Watermelon picking teeth. But she had a manicure and a very nice red suit. The office was not so nice. It was small and the furniture was old. Jieling was groggy from a night spent at a hotel on the edge of the city. It had been cheap but very loud.\nThe woman was very sharp in the way she talked and had a strong accent that made it hard to understand her. Maybe Fujian, but Jieling wasn’t sure. The recruiter had Jieling fill out an application.\n“Why did you leave home?” the recruiter asked.\n“To get a good job,” Jieling said.\n“What about your family? Are they alive?”\n“My mother is alive. She is remarried,” Jieling said. “I wrote it down.”\nThe recruiter pursed her lips. “I can get you an interview on Friday,” she said.\n“Friday!” Jieling said. It was Tuesday. She had only three hundred yuan left out of the money she had brought. “But I need a job!”\nThe recruiter looked sideways at her. “You have made a big gamble to come to Shenzhen.”\n“I can go to another recruiter,” Jieling said.\nThe recruiter tapped her lacquered nails. “They will tell you the same thing,” she said.\nJieling reached down to pick up her bag.\n“Wait,” the recruiter said. “I do know of a job. But they only want girls of very good character.”\nJieling put her bag down and looked at the floor. Her character was fine. She was not a loose girl, whatever this women with her big front teeth thought.\n“Your Mandarin is very good. You say you graduated with high marks from high school,” the recruiter said.\n“I liked school,” Jieling said, which was only partly not true. Everybody here had terrible Mandarin. They all had thick southern accents. Lots of people spoke Cantonese in the street.\n“Okay. I will send you to ShinChi for an interview. I cannot get you an interview before tomorrow. But you come here at 8:00 am and I will take you over there.”\nShinChi. New Life. It sounded very promising. “Thank you,” Jieling said. “Thank you very much.”\nBut outside in the heat, she counted her money and felt a creeping fear. She called her mother.\nHer stepfather answered. “Wei.”\n“Is ma there?” she asked.\n“Jieling!” he said. “Where are you!”\n“I’m in Shenzhen,” she said, instantly impatient with him. “I have a job here.”\n“A job! When are you coming home?”\nHe was always nice to her. He meant well. But he drove her nuts. “Let me talk to ma,” she said.\n“She’s not here,” her stepfather said. “I have her phone at work. But she’s not home, either. She went to Beijing last weekend and she’s shopping for fabric now.”\nHer mother had a little tailoring business. She went to Beijing every few months and looked at clothes in all the good stores. She didn’t buy in Beijing, she just remembered. Then she came home, bought fabric and sewed copies. Her stepfather had been born in Beijing and Jieling thought that was part of the reason her mother had married him. He was more like her mother than her father had been. There was nothing in particular wrong with him. He just set her teeth on edge.\n“I’ll call back later,” Jieling said.\n“Wait, your number is blocked,” her stepfather said. “Give me your number.”\n“I don’t even know it yet,” Jieling said and hung up.\nThe New Life company was a huge, modern looking building with a lot of windows. Inside it was full of reflective surfaces and very clean. Sounds echoed in the lobby. A man in a very smart gray suit met Jieling and the recruiter and the recruiter’s red suit looked cheaper, her glossy fingernails too red, her buckteeth exceedingly large. The man in the smart gray suit was short and slim and very southern looking. Very city.\nJieling took some tests on her math and her written characters and got good scores.\nTo the recruiter, the human resources man said, “Thank you, we will send you your fee.” To Jieling he said, “We can start you on Monday.”\n“Monday?” Jieling said. “But I need a job now!” He looked grave. “I . . . I came from Baoding, in Hebei,” Jieling explained. “I’m staying in a hotel, but I don’t have much money.”\nThe human resources man nodded. “We can put you up in our guesthouse,” he said. “We can deduct the money from your wages when you start. It’s very nice. It has television and air conditioning, and you can eat in the restaurant.”\nIt was very nice. There were two beds. Jieling put her backpack on the one nearest the door. There was carpeting, and the windows were covered in gold drapes with a pattern of cranes flying across them. The television got stations from Hong Kong. Jieling didn’t understand the Cantonese, but there was a button on the remote for subtitles. The movies had lots of violence and more sex than mainland movies did—like the bootleg American movies for sale in the market. She wondered how much this room was. Two hundred yuan? Three hundred yuan?\nJieling watched movies the whole first day, one right after another.\nOn Monday she began orientation. She was given two pale green uniforms, smocks and pants like medical people wore, and little caps, and two pairs of white shoes. In the uniform she looked a little like a model worker—which is to say that the clothes were not sexy and made her look fat. There were two other girls in their green uniforms. They all watched a DVD about the company.\nNew Life did biotechnology. At other plants they made influenza vaccine (on the screen were banks and banks of chicken eggs) but at this plant they were developing breakthrough technologies in tissue culture. It showed many men in suits. Then it showed a big American store and explained how they were forging new exportation ties with the biggest American corporation for selling goods, Wal-Mart. It also showed a little bit of an American movie about Wal-Mart. Subtitles explained how Wal-Mart was working with companies around the world to improve living standards, decrease CO2 emissions, and give people low prices. The voice narrating the DVD never really explained the breakthrough technologies.\nOne of the girls was from way up north, she had a strong Northern way of talking.\n“How long are you going to work here?” the northern girl asked. She looked as if she might even have some Russian in her.\n“How long?” Jieling said.\n“I’m getting married,” the northern girl confided. “As soon as I make enough money, I’m going home. If I haven’t made enough money in a year,” the northern girl explained, “I’m going home anyway.”\nJieling hadn’t really thought she would work here long. She didn’t know exactly what she would do, but she figured that a big city like Shenzhen was a good place to find out. This girl’s plans seemed very . . . country. No wonder Southern Chinese thought Northerners had to wipe the pig shit off their feet before they got on the train.\n“Are you Russian?” Jieling asked.\n“No,” said the girl. “I’m Manchu.”\n“Ah,” Jieling said. Manchu like Manchurian. Ethnic Minority. Jieling had gone to school with a boy who was classified as Manchu, which meant that he was allowed to have two children when he got married. But he had looked Han Chinese like everyone else. This girl had the hook nose and the dark skin of a Manchu. Manchu used to rule China until the Communist Revolution (there was something in-between with Sun Yat-Sen but Jieling’s history teachers had bored her to tears.) Imperial and countrified.\nThen a man came in from Human Resources.\n“There are many kinds of stealing,” he began. “There is stealing of money or food. And there is stealing of ideas. Here at New Life, our ideas are like gold, and we guard against having them stolen. But you will learn many secrets, about what we are doing, about how we do things. This is necessary as you do your work. If you tell our secrets, that is theft. And we will find out.” He paused here and looked at them in what was clearly intended to be a very frightening way.\nJieling looked down at the ground because it was like watching someone overact. It was embarrassing. Her new shoes were very white and clean.\nThen he outlined the prison terms for industrial espionage. Ten, twenty years in prison. “China must take its place as an innovator on the world stage and so must respect the laws of intellectual property,” he intoned. It was part of the modernization of China, where technology was a new future—Jieling put on her ‘I am a good girl’ face. It was like politics class. Four modernizations. Six goals. Sometimes when she was a little girl, and she was riding behind her father on his bike to school, he would pass a billboard with a saying about traffic safety and begin to recite quotes from Mao. The force at the core of the revolution is the people! He would tuck his chin in when he did this and use a very serious voice, like a movie or like opera. Western experience for Chinese uses. Some of them she had learned from him. All reactionaries are paper tigers! she would chant with him, trying to make her voice deep. Be resolute, fear no sacrifice and surmount every difficulty to win victory! And then she would start giggling and he would glance over his shoulder and grin at her. He had been a Red Guard when he was young, but other than this, he never talked about it.\nAfter the lecture, they were taken to be paired with workers who would train them. At least she didn’t have to go with the Manchu girl who was led off to shipping.\nShe was paired with a very small girl in one of the culture rooms. “I am Baiyue,” the girl said. Baiyue was so tiny, only up to Jieling’s shoulder, that her green scrubs swamped her. She had pigtails. The room where they worked was filled with rows and rows of what looked like wide drawers. Down the center of the room was a long table with petri dishes and trays and lab equipment. Jieling didn’t know what some of it was and that was a little nerve-wracking. All up and down the room, pairs of girls in green worked at either the drawers or the table.\n“We’re going to start cultures,” Baiyue said. “Take a tray and fill it with those.” She pointed to a stack of petri dishes. The bottom of each dish was filled with gelatin. Jieling took a tray and did what Baiyue did. Baiyue was serious but not at all sharp or superior. She explained that what they were doing was seeding the petri dishes with cells.\n“Cells?” Jieling asked.\n“Nerve cells from the electric ray. It’s a fish.”\nThey took swabs and Baiyue showed her how to put the cells on in a zigzag motion so that most of the gel was covered. They did six trays full of petri dishes. They didn’t smell fishy. Then they used pipettes to put in feeding solution. It was all pleasantly scientific without being very difficult.\nAt one point everybody left for lunch but Baiyue said they couldn’t go until they got the cultures finished or the batch would be ruined. Women shuffled by them and Jieling’s stomach growled. But when the lab was empty Baiyue smiled and said, “Where are you from?”\nBaiyue was from Fujian. “If you ruin a batch,” she explained, “you have to pay out of your paycheck. I’m almost out of debt and when I get clear—” she glanced around and dropped her voice a little—“I can quit.”\n“Why are you in debt?” Jieling asked. Maybe this was harder than she thought, maybe Baiyue had screwed up in the past.\n“Everyone is in debt,” Baiyue said. “It’s just the way they run things. Let’s get the trays in the warmers.”\nThe drawers along the walls opened out and inside the temperature was kept blood warm. They loaded the trays into the drawers, one back and one front, going down the row until they had the morning’s trays all in.\n“Okay,” Baiyue said, “that’s good. We’ll check trays this afternoon. I’ve got a set for transfer to the tissue room but we’ll have time after we eat.”\nJieling had never eaten in the employee cafeteria, only in the Guest House restaurant, and only the first night because it was expensive. Since then she had been living on ramen noodles and she was starved for a good meal. She smelled garlic and pork. First thing on the food line was a pan of steamed pork buns, fluffy white. But Baiyue headed off to a place at the back where there was a huge pot of congee—rice porridge—kept hot. “It’s the cheapest thing in the cafeteria,” Baiyue explained, “and you can eat all you want.” She dished up a big bowl of it—a lot of congee for a girl her size—and added some salt vegetables and boiled peanuts. “It’s pretty good, although usually by lunch it’s been sitting a little while. It gets a little gluey.”\nJieling hesitated. Baiyue had said she was in debt. Maybe she had to eat this stuff. But Jieling wasn’t going to have old rice porridge for lunch. “I’m going to get some rice and vegetables,” she said.\nBaiyue nodded. “Sometimes I get that. It isn’t too bad. But stay away from anything with shrimp in it. Soooo expensive.”\nJieling got rice and vegetables and a big pork bun. There were two fish dishes and a pork dish with monkeybrain mushrooms but she decided she could maybe have the pork for dinner. There was no cost written on anything. She gave her danwei card to the woman at the end of the line who swiped it and handed it back.\n“How much?” Jieling asked.\nThe woman shrugged. “It comes out of your food allowance.”\nJieling started to argue but across the cafeteria, Baiyue was waving her arm in the sea of green scrubs to get Jieling’s attention. Baiyue called from a table. “Jieling! Over here!\nBaiyue’s eyes got very big when Jieling sat down. “A pork bun.”\n“Are they really expensive?” Jieling asked.\nBaiyue nodded. “Like gold. And so good.”\nJieling looked around at other tables. Other people were eating the pork and steamed buns and everything else.\n“Why are you in debt?” Jieling asked.\nBaiyue shrugged. “Everyone is in debt,” she said. “Just most people have given up. Everything costs here. Your food, your dormitory, your uniforms. They always make sure that you never earn anything.”\n“They can’t do that!” Jieling said.\nBaiyue said, “My granddad says it’s like the old days, when you weren’t allowed to quit your job. He says I should shut up and be happy. That they take good care of me. Iron rice bowl.”\n“But, but but,” Jieling dredged the word up from some long forgotten class, “that’s feudal!”\nBaiyue nodded. “Well, that’s my granddad. He used to make my brother and me kowtow to him and my grandmother at Spring Festival.” She frowned and wrinkled her nose. Country customs. Nobody in the city made their children kowtow at New Years. “But you’re lucky,” Baiyue said to Jieling. “You’ll have your uniform debt and dormitory fees, but you haven’t started on food debt or anything.”\nJieling felt sick. “I stayed in the guest house for four days,” she said. “They said they would charge it against my wages.”\n“Oh,” Baiyue covered her mouth with her hand. After a moment, she said, “Don’t worry, we’ll figure something out.” Jieling felt more frightened by that than anything else.\nInstead of going back to the lab they went upstairs and across a connecting bridge to the dormitories. Naps? Did they get naps?\n“Do you know what room you’re in?” Baiyue asked.\nJieling didn’t. Baiyue took her to ask the floor auntie who looked up Jieling’s name and gave her a key and some sheets and a blanket. Back down the hall and around the corner. The room was spare but really nice. Two bunk beds and two chests of drawers, a concrete floor. It had a window. All of the beds were taken except one of the top ones. By the window under the desk were three black boxes hooked to the wall. They were a little bigger than a shoebox. Baiyue flipped open the front of each one. They had names written on them. “Here’s a space where we can put your battery.” She pointed to an electrical extension.\n“What are they?” Jieling said.\n“They’re the battery boxes. It’s what we make. I’ll get you one that failed inspection. A lot of them work fine,” Baiyue said. “Inside there are electric ray cells to make electricity and symbiotic bacteria. The bacteria breaks down garbage to feed the ray cells. Garbage turned into electricity. Anti-global warming. No greenhouse gas. You have to feed scraps from the cafeteria a couple of times a week or it will die, but it does best if you feed it a little bit every day.”\n“It’s alive?!” Jieling said.\nBaiyue shrugged. “Yeah. Sort of. Supposedly if it does really well, you get credits for the electricity it generates. They charge us for our electricity use, so this helps hold down debt.”\nThe three boxes just sat there looking less alive than a boombox.\n“Can you see the cells?” Jieling asked.\nBaiyue shook her head. “No, the feed mechanism doesn’t let you. They’re just like the ones we grow, though, only they’ve been worked on in the tissue room. They added bacteria.”\n“Can it make you sick?”\n“No, the bacteria can’t live in people.” Baiyue said. “Can’t live anywhere except in the box.”\n“And it makes electricity.”\nBaiyue nodded.\n“And people can buy it?”\nShe nodded again. “We’ve just started selling them. They say they’re going to sell them in China but really, they’re too expensive. Americans like them, you know, because of the no global warming. Of course, Americans buy anything.”\nThe boxes were on the wall between the beds, under the window, pretty near where the pillows were on the bottom bunks. She hadn’t minded the cells in the lab, but this whole thing was too creepy.\nJieling’s first paycheck was startling. She owed 1,974 R.M.B. Almost four months salary if she never ate or bought anything and if she didn’t have a dorm room. She went back to her room and climbed into her bunk and looked at the figures. Money deducted for uniforms and shoes, food, her time in the guesthouse.\nHer roommates came chattering in a group. Jieling’s roommates all worked in packaging. They were nice enough, but they had been friends before Jieling moved in.\n“Hey,” called Taohua. Then seeing what Jieling had. “Oh, first paycheck.”\nJieling nodded. It was like getting a jail sentence.\n“Let’s see. Oh, not so bad. I owe three times that,” Taohua said. She passed the statement on to the other girls. All the girls owed huge amounts. More than a year.\n“Don’t you care?” Jieling said.\n“You mean like little Miss Lei Feng?” Taohua asked. Everyone laughed and Jieling laughed, too, although her face heated up. Miss Lei Feng was what they called Baiyue. Little Miss Goody-goody. Lei Feng, the famous do-gooder soldier who darned his friend’s socks on the Long March. He was nobody when he was alive, but when he died, his diary listed all the anonymous good deeds he had done and then he became a Hero. Lei Feng posters hung in elementary schools. He wanted to be “a revolutionary screw that never rusts.” It was the kind of thing everybody’s grandparents had believed in.\n“Does Baiyue have a boyfriend?” Taohua asked, suddenly serious.\n“No, no!” Jieling said. It was against the rules to have a boyfriend and Baiyue was always getting in trouble for breaking rules. Things like not having her trays stacked by 5:00 p.m., although nobody else got in trouble for that.\n“If she had a boyfriend,” Taohua said, “I could see why she would want to quit. You can’t get married if you’re in debt. It would be too hard.”\n“Aren’t you worried about your debt?” Jieling asked.\nTaohua laughed. “I don’t have a boyfriend. And besides, I just got a promotion, so soon I’ll pay off my debt.”\n“You’ll have to stop buying clothes,” one of the other girls said. The company store did have a nice catalogue you could order clothes from, but they were expensive. There was debt limit, based on your salary. If you were promoted, your debt limit would go up.\n“Or I’ll go to special projects,” Taohua said. Everyone knew what special projects was, even though it was supposed to be a big company secret. They were computers made of bacteria. They looked a lot like the boxes in the dormitory rooms. “I’ve been studying computers,” Taohua explained. “Bacterial computers are special. They do many things. They can detect chemicals. They are massively parallel.”\n“What does that mean?” Jieling asked.\n“It is hard to explain,” Taohua said evasively.\nTaohua opened her battery and poured in scraps. It was interesting that Taohua claimed not to care about her debt but kept feeding her battery. Jieling had a battery now, too. It was a reject—the back had broken so that the metal things that sent the electricity back out were exposed and if you touched it wrong, it could give you a shock. No problem, since Jieling had plugged it into the wall and didn’t plan to touch it again.\n“Besides,” Taohua said, “I like it here a lot better than at home.”\nBetter than home. In some ways yes, in some ways no. What would it be like to just give up and belong to the company? Nice things, nice food. Never rich. But never poor, either. Medical care. Maybe it wasn’t the worst thing. Maybe Baiyue was a little . . . obsessive.\n“I don’t care about my debt,” Taohua said serenely. “With one more promotion, I’ll move to cadres housing.”\nJieling reported the conversation to Baiyue. They were getting incubated cells ready to move to the tissue room. In the tissue room they’d be transferred to protein and collagen grid that would guide their growth—line up the cells to approximate an electricity generating system. The tissue room had a weird, yeasty smell.\n“She’s fooling herself,” Baiyue said. “Line girls never get to be cadres. She might get onto special projects, but that’s even worse than regular line work because you’re never allowed to leave the compound.” Baiyue picked up a dish, stuck a little volt reader into the gel, and rapped the dish smartly against the lab table.\nThe needle on the volt gauge swung to indicate the cells had discharge electricity. That was the way they tested to see the cells were generating electricity. A shock made them discharge and the easiest way was to knock them against the table.\nBaiyue could sound very bitter about New Life. Jieling didn’t like the debt, it scared her a little. But really, Baiyue saw only one side of everything. “I thought you got a pay raise to go to special projects,” Jieling said.\nBaiyue rolled her eyes. “And more reasons to go in debt, I’ll bet.”\n“How much is your debt?” Jieling asked.\n“Still seven hundred,” Baiyue said. “Because they told me I had to have new uniforms.” She sighed.\n“I am so sick of congee,” Jieling said. “They’re never going to let us get out of debt.” Baiyue’s way was doomed. She was trying to play by the company’s rules and still win. That wasn’t Jieling’s way. “We have to make money somewhere else,” Jieling said.\n“Right,” Baiyue said. “We work six days a week.” And Baiyue often stayed after shift to try to make sure she didn’t lose wages on failed cultures. “Out of spec,” she said and put it aside. She had taught Jieling to keep the out of specs for a day. Sometimes they improved and could be shipped on. It wasn’t the way the supervisor, Ms. Wang, explained the job to Jieling, but it cut down on the number of rejects, and that, in turn, cut down on paycheck deductions.\n“That leaves us Sundays,” Jieling said.\n“I can’t leave compound this Sunday.”\n“And if you do, what are they going to do, fire you?” Jieling said.\n“I don’t think we’re supposed to earn money outside of the compound,” Baiyue said.\n“You are too much of a good girl,” Jieling said. “Remember, it doesn’t matter if the cat is black or white, as long as it catches mice.”\n“Is that Mao?” Baiyue asked, frowning.\n“No,” Jieling said, “Deng Xiaoping, the one after Mao.”\n“Well, he’s dead, too,” Baiyue said. She rapped a dish against the counter and the needle on the voltmeter jumped.\nJieling had been working just over four weeks when they were all called to the cafeteria for a meeting. Mr. Cao from Human Resources was there. He was wearing a dark suit and standing at the white screen. Other cadres sat in chairs along the back of the stage, looking very stern.\n“We are here to discuss a very serious matter,” he said. “Many of you know this girl.”\nThere was a laptop hooked up and a very nervous looking boy running it. Jieling looked carefully at the laptop but it didn’t appear to be a special projects computer. In fact, it was made in Korea. He did something and an ID picture of a girl flashed on the screen.\nJieling didn’t know her. But around her she heard noises of shock, someone sucking air through their teeth, someone else breathed softly, ‘Ai-yah.’\n“This girl ran away, leaving her debt with New Life. She ate our food, wore our clothes, slept in our beds. And then, like a thief, she ran away.” The Human Resources man nodded his head. The boy at the computer changed the image on the big projector screen.\nNow it was a picture of the same girl with her head bowed, and two policemen holding her arms.\n“She was picked up in Guangdong,” the Human Resources man said. “She is in jail there.”\nThe cafeteria was very quiet.\nThe Human Resources man said, “Her life is ruined, which is what should happen to all thieves.”\nThen he dismissed them. That afternoon, the picture of the girl with the two policemen appeared on the bulletin boards of every floor of the dormitory.\nOn Sunday, Baiyue announced, “I’m not going.”\nShe was not supposed to leave the compound, but one of her roommates had female problems—bad cramps—and planned to spend the day in bed drinking tea and reading magazines. Baiyue was going to use her ID to leave.\n“You have to,” Jieling said. “You want to grow old here? Die a serf to New Life?”\n“It’s crazy. We can’t make money dancing in the plague-trash market.”\n“I’ve done it before,” Jieling said. “You’re scared.”\n“It’s just not a good idea,” Baiyue said.\n“Because of the girl they caught in Guangdong. We’re not skipping out on our debt. We’re paying it off.”\n“We’re not supposed to work for someone else when we work here,” Baiyue said.\n“Oh, come on,” Jieling said. “You are always making things sound worse than they are. I think you like staying here being little Miss Lei Feng.”\n“Don’t call me that,” Baiyue snapped.\n“Well, don’t act like it. New Life is not being fair. We don’t have to be fair. What are they going to do to you if they catch you?”\n“Fine me,” Baiyue said. “Add to my debt!”\n“So what? They’re going to find a way to add to your debt no matter what. You are a serf. They are the landlord.”\n“But if—”\n“No but if.” Jieling said. “You like being a martyr. I don’t.”\n“What do you care?” Baiyue asked. “You like it here. If you stay you can eat pork buns every night.”\n“And you can eat congee for the rest of your life. I’m going to try to do something.” Jieling slammed out of the dorm room. She had never said harsh things to Baiyue before. Yes, she had thought about staying here. But was that so bad? Better than being like Baiyue who would stay here and have a miserable life. Jieling was not going to have a miserable life, no matter where she stayed or what she did. That was why she had come to Shenzhen in the first place.\nShe heard the door open behind her and Baiyue ran down the hall. “Okay,” she said breathlessly. “I’ll try it. Just this once.”\nThe streets of Shanghai were incredibly loud after weeks in the compound. In a shop window, she and Baiyue stopped and watched a news segment on how the fashion in Shanghai was for sarongs. Jieling would have to tell her mother. Of course her mother had a TV and probably already knew. Jieling thought about calling, but not now. Not now. She didn’t want to explain about New Life. The next news segment was about the success of the People’s Army in Tajikistan. Jieling pulled Baiyue to come on.\nThey took one bus, and then had to transfer. On Sundays, unless you were lucky, it took forever to transfer because fewer busses ran. They waited almost an hour for the second bus. That bus was almost empty when they got on. They sat down a few seats back from the driver. Baiyue rolled her eyes. “Did you see the guy in the back?” she asked. “Party functionary.”\nJieling glanced over her shoulder and saw him. She couldn’t miss him, in his careful polo shirt. He had that stiff party-member look.\nBaiyue sighed. “My uncle is just like that. So boring.”\nJieling thought that to be honest, Baiyue would have made a good revolutionary, back in the day. Baiyue liked that kind of revolutionary purity. But she nodded.\nThe plague-trash market was full on a Sunday. There was a toy seller making tiny little clay figures on sticks. He waved a stick at the girls as they passed. “Cute things!” he called. “I’ll make whatever you want!” The stick had a little Donald Duck on it.\n“I can’t do this,” Baiyue said. “There’s too many people.”\n“It’s not so bad,” Jieling said. She found a place for the boombox. Jieling had brought them to where all the food vendors were. “Stay here and watch this,” she said. She hunted through the food stalls and bought a bottle of local beer, counting out from her little horde of money she had left from when she came. She took the beer back to Baiyue. “Drink this,” she said. “It will help you be brave.”\n“I hate beer,” Baiyue said.\n“Beer or debt,” Jieling said.\nWhile Baiyue drank the beer, Jieling started the boombox and did her routine. People smiled at her but no one put any money in her cash box. Shenzhen people were so cheap. Baiyue sat on the curb, nursing her beer, not looking at Jieling or at anyone until finally Jieling couldn’t stand it any longer.\n“C’mon, meimei,” she said.\nBaiyue seemed a bit surprised to be called little sister but she put the beer down and got up. They had practiced a routine to an M.I.A. song, singing and dancing. It would be a hit, Jieling was sure.\n“I can’t,” Baiyue whispered.\n“Yes, you can,” Jieling said. “You do good.”\nA couple of people stopped to watch them arguing, so Jieling started the music.\n“I feel sick,” Baiyue whimpered.\nBut the beat started and there was nothing to do but dance and sing. Baiyue was so nervous, she forgot at first, but then she got the hang of it. She kept her head down and her face was bright red.\nJieling started making up a rap. She’d never done it before and she hadn’t gotten very far before she was laughing and then Baiyue was laughing, too.\nWode meimei hen haixiude\nMei ta shi xuli\ntai hen xiuqi—\nMy little sister is so shy\nBut she’s pretty\nFar too delicate—\nThey almost stopped because they were giggling but they kept dancing and Jieling went back to the lyrics from the song they had practiced.\nWhen they had finished, people clapped and they’d made thirty-two yuan.\nThey didn’t make as much for any single song after that, but in a few hours they had collected 187 yuan. It was early evening and night entertainers were showing up—a couple of people who sang opera, acrobats, and a clown with a wig of hair so red it looked on fire, stepping stork-legged on stilts waving a rubber Kalashnikov in his hand. He was all dressed in white. Uncle Death, from cartoons during the plague. Some of the day vendors had shut down, and new people were showing up who put out a board and some chairs and served sorghum liquor; clear, white and 150 proof. The crowd was starting to change, too. It was rowdier. Packs of young men dressed in weird combinations of clothes from plague markets—vintage Mao suit jackets and suit pants and peasant shoes. And others, veterans from Tajikistan conflict, one with an empty trouser leg.\nJieling picked up the boombox and Baiyue took the cash box. Outside of the market it wasn’t yet dark.\n“You are amazing,” Baiyue kept saying. “You are such a special girl!”\n“You did great,” Jieling said. “When I was by myself, I didn’t make anything! Everyone likes you because you are little and cute!”\n“Look at this! I’ll be out of debt before autumn!”\nMaybe it was just the feeling that she was responsible for Baiyue, but Jieling said, “You keep it all.”\n“I can’t! I can’t! We split it!” Baiyue said.\n“Sure,” Jieling said. “Then after you get away, you can help me. Just think, if we do this for three more Sundays, you’ll pay off your debt.”\n“Oh, Jieling,” Baiyue said. “You really are like my big sister!”\nJieling was sorry she had ever called Baiyue ‘little sister.’ It was such a country thing to do. She had always suspected that Baiyue wasn’t a city girl. Jieling hated the countryside. Grain spread to dry in the road and mother’s-elder-sister and father’s-younger-brother bringing all the cousins over on the day off. Jieling didn’t even know all those country ways to say aunt and uncle. It wasn’t Baiyue’s fault. And Baiyue had been good to her. She was rotten to be thinking this way.\n“Excuse me,” said a man. He wasn’t like the packs of young men with their long hair and plague clothes. Jieling couldn’t place him but he seemed familiar. “I saw you in the market. You were very fun. Very lively.”\nBaiyue took hold of Jieling’s arm. For a moment Jieling wondered if maybe he was from New Life, but she told herself that was crazy. “Thank you,” she said. She thought she remembered him putting ten yuan in the box. No, she thought, he was on the bus. The party functionary. The party was checking up on them. Now that was funny. She wondered if he would lecture them on Western ways.\n“Are you in the music business?” Baiyue asked. She glanced at Jieling who couldn’t help laughing, snorting through her nose.\nThe man took them very seriously though. “No,” he said. “I can’t help you there. But I like your act. You seem like girls of good character.”\n“Thank you,” Baiyue said. She didn’t look at Jieling again, which was good because Jieling knew she wouldn’t be able to keep a straight face.\n“I am Wei Rongyi. Maybe I can buy you some dinner?” the man asked. He held up his hands. “Nothing romantic. You are so young, it is like you could be daughters.”\n“You have a daughter?” Jieling asked.\nHe shook his head. “Not anymore,” he said.\nJieling understood. His daughter had died of the bird flu. She felt embarrassed for having laughed at him. Her soft heart saw instantly that he was treating them like the daughter he had lost.\nHe took them to a dumpling place on the edge of the market and ordered half a kilo of crescent-shaped pork dumplings and a kilo of square beef dumplings. He was a cadre, a middle manager. His wife had lived in Changsha for a couple of years now, where her family was from. He was from the older generation, people who did not get divorced. All around them, the restaurant was filling up mostly with men stopping after work for dumplings and drinks. They were a little island surrounded by truck drivers and men who worked in the factories in the outer city—tough grimy places.\n“What do you do? Are you secretaries?” Wei Rongyi asked.\nBaiyue laughed. “As if!” she said.\n“We are factory girls,” Jieling said. She dunked a dumpling in vinegar. They were so good! Not congee!\n“Factory girls!” he said. “I am so surprised!”\nBaiyue nodded. “We work for New Life,” she explained. “This is our day off, so we wanted to earn a little extra money.”\nHe rubbed his head, looking off into the distance. “New Life,” he said, trying to place the name. “New Life . . . ”\n“Out past the zoo,” Baiyue said.\nJieling thought they shouldn’t say so much.\n“Ah, in the city. A good place? What do they make?” he asked. He had a way of blinking very quickly that was disconcerting.\n“Batteries,” Jieling said. She didn’t say bio-batteries.\n“I thought they made computers,” he said.\n“Oh yes,” Baiyue said. “Special projects.”\nJieling glared at Baiyue. If this guy gave them trouble at New Life, they’d have a huge problem getting out of the compound.\nBaiyue blushed.\nWei laughed. “You are special project girls, then. Well, see, I knew you were not just average factory girls.”\nHe didn’t press the issue. Jieling kept waiting for him to make some sort of move on them. Offer to buy them beer. But he didn’t, and when they had finished their dumplings, he gave them the leftovers to take back to their dormitories and then stood at the bus stop until they were safely on their bus.\n“Are you sure you will be all right?” he asked them when the bus came.\n“You can see my window from the bus stop,” Jieling promised. “We will be fine.”\n“Shenzhen can be a dangerous city. You be careful!”\nOut the window, they could see him in the glow of the streetlight, waving as the bus pulled away.\n“He was so nice,” Baiyue sighed. “Poor man.”\n“Didn’t you think he was a little strange?” Jieling asked.\n“Everybody is strange anymore,” Baiyue said. “After the plague. Not like when we were growing up.”\nIt was true. Her mother was strange. Lots of people were crazy from so many people dying. Jieling held up the leftover dumplings. “Well, anyway. I am not feeding this to my battery,” she said. They both tried to smile.\n“Our whole generation is crazy,” Baiyue said.\n“We know everybody dies,” Jieling said. Outside the bus window, the streets were full of young people, out trying to live while they could.\nThey made all their bus connections as smooth as silk. So quick, they were home in forty-five minutes. Sunday night was movie night, and all of Jieling’s roommates were at the movie so she and Baiyue could sort the money in Jieling’s room. She used her key card and the door clicked open.\nMr. Wei was kneeling by the battery boxes in their room. He started and hissed, “Close the door!”\nJieling was so surprised she did.\n“Mr. Wei!” Baiyue said.\nHe was dressed like an army man on a secret mission, all in black. He showed them a little black gun. Jieling blinked in surprise. “Mr. Wei!” she said. It was hard to take him seriously. Even all in black, he was still weird Mr. Wei, blinking rapidly behind his glasses.\n“Lock the door,” he said. “And be quiet.”\n“The door locks by itself,” Jieling explained. “And my roommates will be back soon.”\n“Put a chair in front of the door,” he said and shoved the desk chair towards them. Baiyue pushed it under the door handle. The window was open and Jieling could see where he had climbed on the desk and left a footprint on Taohua’s fashion magazine. Taohua was going to be pissed. And what was Jieling going to say? If anyone found out there was a man in her room, she was going to be in very big trouble.\n“How did you get in?” she asked. “What about the cameras?” There were security cameras.\nHe showed them a little spray can. “Special paint. It just makes things look foggy and dim. Security guards are so lazy anymore no one ever checks things out.” He paused a moment, clearly disgusted with the lax morality of the day. “Miss Jieling,” he said. “Take that screwdriver and finish unscrewing that computer from the wall.”\nComputer? She realized he meant the battery boxes.\nBaiyue’s eyes got very big. “Mr. Wei! You’re a thief!”\nJieling shook her head. “A corporate spy.”\n“I am a patriot,” he said. “But you young people wouldn’t understand that. Sit on the bed.” He waved the gun at Baiyue.\nThe gun was so little it looked like a toy and it was difficult to be afraid, but still Jieling thought it was good that Baiyue sat.\nJieling knelt. It was her box that Mr. Wei had been disconnecting. It was all the way to the right, so he had started with it. She had come to feel a little bit attached to it, thinking of it sitting there, occasionally zapping electricity back into the grid, reducing her electricity costs and her debt. She sighed and unscrewed it. Mr. Wei watched.\nShe jimmied it off the wall, careful not to touch the contacts. The cells built up a charge, and when they were ready, a switch tapped a membrane and they discharged. It was all automatic and there was no knowing when it was going to happen. Mr. Wei was going to be very upset when he realized that this wasn’t a computer.\n“Put it on the desk,” he said.\nShe did.\n“Now sit with your friend.”\nJieling sat down next to Baiyue. Keeping a wary eye on them, he sidled over to the bio-battery. He opened the hatch where they dumped garbage in them, and tried to look in as well as look at them. “Where are the controls?” he asked. He picked it up, his palm flat against the broken back end where the contacts were exposed.\n“Tap it against the desk,” Jieling said. “Sometimes the door sticks.” There wasn’t actually a door. But it had just come into her head. She hoped that the cells hadn’t discharged in awhile.\nMr. Wei frowned and tapped the box smartly against the desktop.\nTorpedinidae, the electric ray, can generate a current of two hundred volts for approximately a minute. The power output is close to 1 kilowatt over the course of the discharge and while this won’t kill the average person, it is a powerful shock. Mr. Wei stiffened and fell, clutching the box and spasming wildly. One . . . two . . . three . . . four . . . Mr. Wei was still spasming. Jieling and Baiyue looked at each other. Gingerly, Jieling stepped around Mr. Wei. He had dropped the little gun. Jieling picked it up. Mr. Wei was still spasming. Jieling wondered if he was going to die. Or if he was already dead and the electricity was just making him jump. She didn’t want him to die. She looked at the little gun and it made her feel even sicker so she threw it out the window.\nFinally Mr. Wei dropped the box.\nBaiyue said, “Is he dead?”\nJieling was afraid to touch him. She couldn’t tell if he was breathing. Then he groaned and both girls jumped.\n“He’s not dead,” Jieling said.\n“What should we do?” Baiyue asked.\n“Tie him up,” Jieling said. Although she wasn’t sure what they’d do with him then.\nJieling used the cord to her boombox to tie his wrists. When she grabbed his hands he gasped and struggled feebly. Then she took her pillowcase and cut along the blind end, a space just wide enough that his head would fit through.\n“Sit him up,” she said to Baiyue.\n“You sit him up,” Baiyue said. Baiyue didn’t want to touch him.\nJieling pulled Mr. Wei into a sitting position. “Put the pillowcase over his head,” she said. The pillowcase was like a shirt with no armholes, so when Baiyue pulled it over his head and shoulders, it pinned his arms against his sides and worked something like a straightjacket.\nJieling took his wallet and his identification papers out of his pocket. “Why would someone carry their wallet to a break in?” she asked. “He has six ID papers. One says he is Mr. Wei.”\n“Wow,” Baiyue said. “Let me see. Also Mr. Ma. Mr. Zhang. Two Mr. Liu’s and a Mr. Cui.”\nMr. Wei blinked, his eyes watering.\n“Do you think he has a weak heart?” Baiyue asked.\n“I don’t know,” Jieling said. “Wouldn’t he be dead if he did?”\nBaiyue considered this.\n“Baiyue! Look at all this yuan!” Jieling emptied the wallet, counting. Almost eight thousand yuan!\n“Let me go,” Mr. Wei said weakly.\nJieling was glad he was talking. She was glad he seemed like he might be all right. She didn’t know what they would do if he died. They would never be able to explain a dead person. They would end up in deep debt. And probably go to jail for something. “Should we call the floor auntie and tell him that he broke in?” Jieling asked.\n“We could,” Baiyue said.\n“Do not!” Mr. Wei said, sounding stronger. “You don’t understand! I’m from Beijing!”\n“So is my stepfather,” Jieling said. “Me, I’m from Baoding. It’s about an hour south of Beijing.”\nMr. Wei said, “I’m from the government! That money is government money!”\n“I don’t believe you,” Jieling said. “Why did you come in through the window?”\n“Secret agents always come in through the window?” Baiyue said and started to giggle.\n“Because this place is counter-revolutionary!” Mr. Wei said.\nBaiyue covered her mouth with her hand. Jieling felt embarrassed, too. No one said things like ‘counter-revolutionary’ anymore.\n“This place! It is making things that could make China strong!” he said.\n“Isn’t that good?” Baiyue asked.\n“But they don’t care about China! Only about money. Instead of using it for China, they sell it to America!” he said. Spittle was gathering at the corner of his mouth. He was starting to look deranged. “Look at this place! Officials are all concerned about guanxi!” Connections. Kickbacks. Guanxi ran China, everybody knew that.\n“So, maybe you have an anti-corruption investigation?” Jieling said. There were lots of anti-corruption investigations. Jieling’s stepfather said that they usually meant someone powerful was mad at their brother-in-law or something, so they accused them of corruption.\nMr. Wei groaned. “There is no one to investigate them.”\nBaiyue and Jieling looked at each other.\nMr. Wei explained, “In my office, the Guangdong office, there used to be twenty people. Special operatives. Now there is only me and Ms. Yang.”\nJieling said, “Did they all die of bird flu?”\nMr. Wei shook his head. “No, they all went to work on contract for Saudi Arabia. You can make a lot of money in the Middle East. A lot more than in China.”\n“Why don’t you and Ms. Yang go work on Saudi Arabia?” Baiyue asked.\nJieling thought Mr. Wei would give some revolutionary speech. But he just hung his head. “She is the secretary. I am the bookkeeper.” And then in a smaller voice, “She is going to Kuwait to work for Mr. Liu.”\nThey probably did not need bookkeepers in the Middle East. Poor Mr. Wei. No wonder he was such a terrible secret agent.\n“The spirit of the revolution is gone,” he said, and there were real, honest to goodness tears in his eyes. “Did you know that Tiananmen Square was built by volunteers? People would come after their regular job and lay the paving of the square. Today people look to Hong Kong.”\n“Nobody cares about a bunch of old men in Beijing,” Baiyue said.\n“Exactly! We used to have a strong military! But now the military is too worried about their own factories and farms! They want us to pull out of Tajikistan because it is ruining their profits!”\nThis sounded like a good idea to Jieling, but she had to admit, she hated the news so she wasn’t sure why they were fighting in Tajikistan anyway. Something about Muslim terrorists. All she knew about Muslims was that they made great street food.\n“Don’t you want to be patriots?” Mr. Wei said.\n“You broke into my room and tried to steal my—you know that’s not a computer, don’t you?” Jieling said. “It’s a bio battery. They’re selling them to the Americans. Wal-Mart.”\nMr. Wei groaned.\n“We don’t work in special projects,” Baiyue said.\n“You said you did,” he protested.\n“We did not,” Jieling said. “You just thought that. How did you know this was my room?”\n“The company lists all its workers in a directory,” he said wearily. “And it’s movie night, everyone is either out or goes to the movies. I’ve had the building under surveillance for weeks. I followed you to the market today. Last week it was a girl named Pingli, who blabbed about everything, but she wasn’t in special projects.\n“I put you on the bus, I’ve timed the route three times. I should have had an hour and fifteen minutes to drive over here and get the box and get out.”\n“We made all our connections,” Baiyue explained.\nMr. Wei was so dispirited he didn’t even respond.\nJieling said. “I thought the government was supposed to help workers. If we get caught, we’ll be fined and we’ll be deeper in debt.” She was just talking. Talking, talking, talking too much. This was too strange. Like when someone was dying. Something extraordinary was happening, like your father dying in the next room, and yet the ordinary things went on, too. You made tea, your mother opened the shop the next day, and sewed clothes while she cried. People came in and pretended not to notice. This was like that. Mr. Wei had a gun and they were explaining about New Life. “Debt?” Mr. Wei said.\n“To the company,” she said. “We are all in debt. The company hires us and says they are going to pay us, but then they charge us for our food and our clothes and our dorm and it always costs more than we earn. That’s why we were doing rap today. To make money to be able to quit.” Mr. Wei’s glasses had tape holding the arm on. Why hadn’t she noticed that in the restaurant? Maybe because when you are afraid you notice things. When your father is dying of the plague, you notice the way the covers on your mother’s chairs need to be washed. You wonder if you will have to do it or if you will die before you have to do chores.\n“The Pingli girl,” he said, “she said the same thing. That’s illegal.”\n“Sure,” Baiyue said. “Like anybody cares.”\n“Could you expose corruption?” Jieling asked.\nMr. Wei shrugged, at least as much as he could in the pillowcase. “Maybe. But they would just pay bribes to locals and it would all go away.”\nAll three of them sighed.\n“Except,” Mr. Wei said, sitting up a little straighter. “The Americans. They are always getting upset about that sort of thing. Last year there was a corporation, the Shanghai Six. The Americans did a documentary on them and then Western companies would not do business. If they got information from us about what New Life is doing . . . ”\n“Who else is going to buy bio batteries?” Baiyue said. “The company would be in big trouble!”\n“Beijing can threaten a big expose, tell The New York Times newspaper!” Mr. Wei said, getting excited. “My Beijing supervisor will love that! He loves media!”\n“Then you can have a big show trial,” Jieling said.\nMr. Wei was nodding.\n“But what is in it for us?” Baiyue said.\n“When there’s a trial, they’ll have to cancel your debt!” Mr. Wei said. “Even pay you a big fine!”\n“If I call the floor auntie and say I caught a corporate spy, they’ll give me a big bonus,” Baiyue said.\n“Don’t you care about the other workers?” Mr. Wei asked.\nJieling and Baiyue looked at each other and shrugged. Did they? “What are they going to do to you anyway?” Jieling said. “You can still do big expose. But that way we don’t have to wait.”\n“Look,” he said, “you let me go, and I’ll let you keep my money.”\nSomeone rattled the door handle.\n“Please,” Mr. Wei whispered. “You can be heroes for your fellow workers, even though they’ll never know it.”\nJieling stuck the money in her pocket. Then she took the papers, too.\n“You can’t take those,” he said.\n“Yes, I can,” she said. “If after six months, there is no big corruption scandal? We can let everyone know how a government secret agent was outsmarted by two factory girls.”\n“Six months!” he said. “That’s not long enough!”\n“It better be,” Jieling said.\nOutside the door, Taohua called, “Jieling? Are you in there? Something is wrong with the door!”\n“Just a minute,” Jieling called. “I had trouble with it when I came home.” To Mr. Wei she whispered sternly, “Don’t you try anything. If you do, we’ll scream our heads off and everybody will come running.” She and Baiyue shimmied the pillowcase off of Mr. Wei’s head. He started to stand up and jerked the boombox which clattered across the floor. “Wait!” she hissed and untied him.\nTaohua called through the door. “What’s that?”\n“Hold on!” Jieling called.\nBaiyue helped Mr. Wei stand up. Mr. Wei climbed onto the desk and then grabbed a line hanging outside. He stopped a moment as if trying to think of something to say.\n“ ‘A revolution is not a dinner party, or writing an essay, or painting a picture, or doing embroidery’,” Jieling said. It had been her father’s favorite quote from Chairman Mao. “ ‘ . . . it cannot be so refined, so leisurely and gentle, so temperate, kind, courteous, restrained and magnanimous. A revolution is an insurrection, an act of by which one class overthrows another’.”\nMr. Wei looked as if he might cry and not because he was moved by patriotism. He stepped back and disappeared. Jieling and Baiyue looked out the window. He did go down the wall just like a secret agent from a movie, but it was only two stories. There was still the big footprint in the middle of Taohua’s magazine and the room looked as if it had been hit by a storm.\n“They’re going to think you had a boyfriend,” Baiyue whispered to Jieling.\n“Yeah,” Jieling said, pulling the chair out from under the door handle. “And they’re going to think he’s rich.”\nIt was Sunday, and Jieling and Baiyue were sitting on the beach. Jieling’s cellphone rang, a little chime of M.I.A. hip-hop. Even though it was Sunday, it was one of the girls from New Life. Sunday should be a day off, but she took the call anyway.\n“Jieling? This is Xia Meili? From packaging. Taohua told me about your business? Maybe you could help me?”\nJieling said, “Sure. What is your debt, Meili?”\n“3,800 R.M.B.,” Meili said. “I know it’s a lot.”\nJieling said, “Not so bad. We have a lot of people who already have loans, though, and it will probably be a few weeks before I can make you a loan.”\nWith Mr. Wei’s capital, Jieling and Baiyue had opened a bank account. They had bought themselves out, and then started a little loan business where they bought people out of New Life. Then people had to pay them back with a little extra. They had each had jobs—Jieling worked for a company that made toys. She sat each day at a table where she put a piece of specially shaped plastic over the body of a little doll, an action figure. The plastic fit right over the figure and had cut-outs. Jieling sprayed the whole thing with red paint and when the piece of plastic was lifted, the action figure had a red shirt. It was boring, but at the end of the week, she got paid instead of owing the company money.\nShe and Baiyue used all their extra money on loans to get girls out of New Life. More and more loans, and more and more payments. Now New Life had sent them a threatening letter saying that what they were doing was illegal. But Mr. Wei said not to worry. Two officials had come and talked to them and had showed them legal documents and had them explain everything about what had happened. Soon, the officials promised, they would take New Life to court.\nJieling wasn’t so sure about the officials. After all, Mr. Wei was an official. But a foreign newspaperman had called them. He was from a newspaper called The Wall Street Journal and he said that he was writing a story about labor shortages in China after the bird flu. He said that in some places in the west there were reports of slavery. His Chinese was very good. His story was going to come out in the United States tomorrow. Then she figured officials would have to do something or lose face.\nJieling told Meili to call her back in two weeks—although hopefully in two weeks no one would need help to get away from New Life—and wrote a note to herself in her little notebook.\nBaiyue was sitting looking at the water. “This is the first time I’ve been to the beach,” she said.\n“The ocean is so big, isn’t it?”\nBaiyue nodded, scuffing at the white sand. “People always say that, but you don’t know until you see it.”\nJieling said, “Yeah.” Funny, she had lived here for months. Baiyue had lived here more than a year. And they had never come to the beach. The beach was beautiful.\n“I feel sorry for Mr. Wei,” Baiyue said.\n“You do?” Jieling said. “Do you think he really had a daughter who died?”\n“Maybe,” Baiyue said. “A lot of people died.”\n“My father died,” Jieling said.\nBaiyue looked at her, a quick little sideways look, then back out at the ocean. “My mother died,” she said.\nJieling was surprised. She had never known that Baiyue’s mother was dead. They had talked about so much but never about that. She put her arm around Baiyue’s waist and they sat for a while.\n“I feel bad in a way,” Baiyue said.\n“How come?” Jieling said.\n“Because we had to steal capital to fight New Life. That makes us capitalists.”\nJieling shrugged.\n“I wish it was like when they fought the revolution,” Baiyue said. “Things were a lot more simple.”\n“Yeah,” Jieling said, “and they were poor and a lot of them died.”\n“I know,” Baiyue sighed.\nJieling knew what she meant. It would be nice to . . . to be sure what was right and what was wrong. Although not if it made you like Mr. Wei.\nPoor Mr. Wei. Had his daughter really died?\n“Hey,” Jieling said, “I’ve got to make a call. Wait right here.” She walked a little down the beach. It was windy and she turned her back to protect the cellphone, like someone lighting a match. “Hello,” she said, “hello, mama, it’s me. Jieling.”\nOriginally published in The Del Rey Book of Science Fiction and Fantasy, edited by Ellen Datlow (2008).\nMaureen F. McHugh made her first sale in 1989, and has since made a powerful impression on the SF world with a relatively small body of work, becoming one of today's most respected writers. In 1992, she published one of the year's most widely-acclaimed and talked-about first novels, China Mountain Zhang, which won the Locus Award for Best First Novel, the Lambda Literary Award, and the James Tiptree Jr. Memorial Award, and which was named a New York Times Notable Book as well as being a finalist for the Hugo and Nebula Awards. Her story \"The Lincoln Train\" won her a Nebula Award. Her other books, including the novels Half the Day is Night, Mission Child, and Nekropolis, have been greeted with similar enthusiasm. Her powerful short fiction has been collected in Mothers and Other Monsters and After the Apocalypse."}