{"fingerprint": "mWvp9pw47ltxeIfQLkVY3jCdQ20=", "sitename": "Clarkesworld Magazine", "title": "The Baby Eaters by Ian McHugh", "author": "Ian McHugh", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mchugh_04_18_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Baby Eaters by Ian McHugh", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4430 words, short story, REPRINT\nThe Baby Eaters\nMeychezhek is big, even among badhar-krithkinee, a circumstance exacerbated by the fact that I’m both already nervous and kneeling in anticipation of her entrance.\nHer skin is purple-black, more textured than human skin. Her head crest, flattened now, is white, banded with orange. Her eyes are red-shot yellow, horizontally slit. When she smiles, her teeth are noticeably stained. Meychezhek acquired an addiction to coffee during her times as an ambassador on Friendship and Perunu-Zambezi.\nThe smile is a human expression, meant to put me at ease, but her fangs are intimidating.\nI bow—correctly, I hope—and she kneels.\nKrithkinee don’t sit. They bend in the same places as humans but the proportions are different. Shin bones shorter, feet longer—pivots for burst sprinting. The extra pair of arms raises the center of gravity. The body leans forward, balanced by the short tail. Feet and fighting arms have triple talons, one opposed. The four fingers of the inner manipulative arms have retractable claws.\nMeychezhek signals for me to be at ease and I relax my pose fractionally. My pulse races.\n“Thank you, Dhar, for welcoming me into your home.” My Babel implant turns Euraf English into crude but passable Junkhin before the words reach my mouth. It never stops being disconcerting, to speak a language you don’t fluently understand, nor the sense of your muscles moving contrary to the brain’s commands.\n“You are honored,” Meychezhek replies, accepting what is due to her rank. A dhar is part military officer, part civil administrator, and part feudal lord—a Japanese daimyo in the era of the shoguns, combined with an Indian civil service mandarin.\nOur solicitation of an invitation to trade had followed the correct form: approaching the provincial dhar with an appropriately personalized gift, in this case, an antique coffee set, unsuitable for krithkinee mouths but Meychezhek is a collector. Given the modest scale of our enterprise, we’d expected her to defer to a subordinate lord. A further round of gifts would follow, and possibly a second deferral, depending on the status of the lower ranked lord, the social and commercial advantage for them, and the particulars of their patronage relationship with Meychezhek.\nWhat we didn’t anticipate was that the dhar would accede directly to the solicitation and offer to host me herself.\n“The commendations from your peers are impressive,” Meychezhek says. “You are highly esteemed.”\nAgain, there’s the disconcerting awareness that the words my ears hear aren’t the same as those my brain receives. If I concentrate, I can hear both.\nMeychezhek’s statement is both a compliment and a challenge. I’m confused, though. “Forgive me, Dhar. The commendations of my peers?”\n“At the university.”\n“I . . . ” I haven’t studied or worked at university in a decade. I’m surprised enough that it’s an effort to avert my gaze. Staring is more than just rude among krithkinee. A person of equal or inferior rank holding another’s gaze may be seen as a challenge to fight.\n“I have not conversed with a fellow sapientologist since I returned from Perunu-Zambezi,” she continues.\nMy thoughts blank for an instant, then race. The dhar’s interest is personal: in me. This is both better and worse than we’d assumed. Better, because the mercantile stakes aren’t so high as we feared—it seems the dhar’s intent is not to levy any uncomfortable political demands. Worse, because it means that the success or failure of our enterprise weighs far more heavily on Meychezhek’s impression of me, personally, than I’d anticipated.\n“It will be your pleasure to converse with me,” she says.\nI’m expected to join Meychezhek for the morning meal. Badhar-krithkinee traditionally break fast at dawn. The dark-crested, orange-skinned junkhar house attendant allowed that it was proper for me to complete my morning prayers first, but it means that the dhar’s been waiting for me, now, and I’m half-jogging to keep up with the attendant’s loping stride.\nKrithkinee are carnivores. Among high status badharee and junkharee it’s usual to eat whole animals, roasted, baked, or cured. Offal and pickled meats are common foods among the lower social classes. Raw fruits and vegetables are eaten as a garnish and digestive aid.\nI don’t try to hide my surprise and delight to see the piled plate of leaves and fruit—many of which I even recognize.\nMeychezhek raises her long chin to expose her throat. I immediately dip my head, pressing my chin to my collarbone in the appropriate response.\nShe’s not alone. Her third and favorite son, Pathkemey is also with her, as is Yzgushin, the junior-most of Meychezhek’s wives, currently heavily pregnant and nursing an enormously round belly.\nPathkemey, the “son,” is female, as is Meychezhek, “father” and “husband.” Yzgushin, “wife,” is male.\nKrithkinee social gender roles align rigidly with the physiological reproductive functions of impregnator and impregnated, and along comparable lines to those found in human traditions of patriarchy, but the actual biological sexes are inverse to the human norm. Evidently the providers of my Babel’s Euraf-Junkhin thesaurus were ideological pedants of similar stripe to my old professor of comparative sociology—equating gendered social roles to their human patriarchal approximates, but aligning gendered pronouns to biological sex.\nIt means I have to be infuriatingly careful how I think, so that I’m not—one way or other—constantly addressing people as the wrong gender.\nYzgushin is dwarfed by his husband and stepson. His fighting arms are tucked discretely into the folds of his frock, as is appropriate for a wife. He dips his chin as I do.\nPathkemey casts a glance at Meychezhek, evidently unsure of my status relative to hers. After a brief hesitation, she raises her chin as her father has.\nFormalities completed, I’m invited to kneel at the table. Meychezhek serves—her wife first, then Pathkemey, and then me.\nThe balcony, on the exterior of the house’s uppermost story, affords a view over the city. The squat, drum-shaped towers of manor houses, manufactories and communal tenements rise out of the bustle below, of traffic-packed roads winding between garden plots, orchards, animal pens, and tented markets. Elevated railways connect many of the towers.\nI’m offered a middle leg from the roasted creature on the central platter. All six of its feet have opposed thumbs. They look like children’s hands. The little carcass reminds me of the xenophobic slur that krithkinee eat their own young. I fill up the rest of my plate with salad.\n“Curious, is it not?” Meychezhek says. “I expose my weakest point to demonstrate that I am unthreatened by you. Among krithkinee the convention is so deeply ingrained as to be hardwired. Yet you are an alien, bound to different conventions. In my instinctive show of strength, I expose myself to unintended risk.”\nPathkemey’s expression of alarm transcends species boundaries. Had she made a mistake in exposing her throat to me? Yzgushin observes with frank curiosity.\nI say, “You do not perceive me as a threat.”\n“No, but my interpretation of your human signals could be flawed.”\n“Do you believe so?”\nMeychezhek flashes her fangs in another of those human grins. I have a sudden suspicion that she knows the expression is intimidating and is being mischievous. “No.”\n“What do you sense from me?”\nMeychezhek picks at her meat with the claws of her inner arms. Badharee of the dominant culture eschew cutlery. There are bowls of scented water on the table for washing between courses.\n“Consciously, you are excited and curious. Nervous, perhaps. It is in your gestures and the movement of your eyes. But your body is reacting like prey. The smell is so strong I can taste it.”\nI’d put the butterflies in my stomach down to my queasiness that a provincial dhar had taken a personal interest in me. It’s more than that, though. The monkey in my hindbrain is barely holding itself together. “You are right. I am afraid of you.”\nPathkemey is affronted. “Why? We offer no threat. You are a welcome guest in the house of my father.”\nMeychezhek holds up a hand to stay her.\nIs she testing me, or Pathkemey? Or seeking to educate her son? Pathkemey didn’t accompany her father on her ambassadorial postings. Her exposure to non-krithkinee can have been minimal, at best. Is this the real reason why Meychezhek chose to invite me herself? To be a sample specimen, capable of educated conversation?\nI pick up the spouted cup beside my place and take a sip of water, trying to think like an academic. “Humans have mixed instincts,” I say. “We evolved as prey until our intelligence developed to the point that we could turn the tables on our hunters. Since then, we have grown accustomed to being at the top of the food chain. But the hunted monkey is still in there.” It occurs to me, belatedly, that they’re unlikely to know what a monkey is, since badharee tend to eschew encyclopedic implants. I indicate the dismembered beast on the table, which seems near enough. “In you, I see a predator, stronger than I am, and in your element.”\nPathkemey says, “Like hunting near mhaharrtee.”\nA mhaharrt is a keystone predator in the primary terrestrial ecosystem that the badharee-junkharee export to their terraformed colonies. Mhaharrtee have a reputation for ignoring smaller predators, such as krithkinee—but not always.\nMeychezhek raises her crest, acknowledging her son’s astuteness. “Humans have a superficially similar idiom—‘like swimming with sharks,’” she says. “But krithkinee are not ‘hunted monkeys,’ as you say.” She flicks a finger towards my plate. “You are enjoying your meat.” It is not a question.\nI’m yet to touch it. I pick up the little infant arm and, copying Pathkemey, sink my teeth into the roasted flesh. “I am. It is delicious.”\nMeychezhek has given me into Pathkemey’s keeping to learn to ride a staigeg, alongside a group of the household’s children. The lessons take place in the manor house’s central courtyard. Members of the household look down at us from the curved interior balconies.\nThe children—with no more riding experience than I—hurl themselves up onto the staigegee with absolute recklessness and are tossed aside nearly as quickly. They take little if any heed of Pathkemey’s instruction and cheer the most spectacular falls, congratulating each other on their bruises.\nI ask Pathkemey if their heedlessness disturbs her.\nShe considers silently for several seconds before answering. “They are children. This is the way children should behave. When they tire of falling off, they will become heedful of my words.”\n“Are you not concerned for their safety?”\nAgain the pause—Pathkemey is as intelligent as her father, but weighs her words more slowly. “Yes. But it is a father’s unreasoning protectiveness.” She points out two of the children as being her own son and daughter. “Children are the wealth and joy of our house. The loss of a child is cause for grief. But see the joy that they find in this game. There is joy in this too for me.”\nNeedless to say, neither she nor the children can understand my own caution when approaching my designated staigeg.\n“There will be war between humans and krithkinee,” Meychezhek says. “Sooner, rather than later.”\nShe has finally consented to escort me to the botanists with whom I’m hoping to negotiate the supply of pharmaceutical ingredients. I look down at Meychezhek from my sedan, perched high up on the hump of my staigeg. My riding is not yet proficient enough to control a staigeg on the city’s crowded streets. Consequently I find myself carted about like some frail and revered grandmother or religious sage. Meychezhek sits at the base of her mount’s neck, as does the badhar mahout who steers my beast. The blue-black skins and striped white crests of the badharee stand out starkly among the orange, scarlet, and crimson faces and dark spines of the majority junkharee.\n“There has already been war,” I say, “More than once. The Edoans and Austronese have fought the Reformationist junkharhee at Autaki. The League has fought beside the dzaiiree-rajhinee . . . ”\nMeychezhek makes a sharp upward chopping gesture of one outer arm—silence.\n“Skirmishes,” she says. “I mean a war that will encompass our two species. Total war.”\n“Why do you think so?” It seems unlikely to me. Humans and krithkinee both have too much enthusiasm for intraspecies warfare to ever gang up on anyone else.\n“Because neither of us learned not to hate before we climbed into space,” Meychezhek says.\nMy staigeg stops suddenly to avoid crushing a crowd of junkharee street children. I have to grab at the wooden case on my lap to stop it sliding off—full of coffee berries for propagation, my gift to the botanists. The mahout swears while guards jump off their wheeled sleds to shoo the urchins out from under the feet of the staigegee.\n“Relations between the major human polities and the Empire have always been good,” I say.\nMeychezhek shows an expression that I’m unsure how to interpret. “For how long? Badharee are a minority. We have held this Empire for thirty generations. But the Empire belongs to the junkharhee—they are the majority. The Reformationists nibble at our borders. Every year our rule becomes more overt, the krithzha more obviously our puppet, and more junkhar lords go over. The tighter we grip, the less we hold.”\n“You think the Reformationist junkharhee will take over the Empire?”\n“Yes.”\n“Then there will be war between krithkinee and krithkinee.”\n“There will be that,” she agrees. “But it will be limited. Neither side can afford not to find an accommodation. And then there will be war between krithkinee and humans.”\nI’m not sure if she’s treating the badharee-junkharee Empire as synonymous with the krithkinee species, or expects that the lesser krithkinee polities will somehow fall in behind the Empire in the case of a major war with humankind. “Do you hate?” I ask.\n“Yes,” she says, matter-of-factly. “I hate the dzaiiree and rajhinee and their unclean interbreeding and their alhothma.”\nMy Babel can’t provide a sensible translation of ‘alhothma.’ I stay with the topic at hand. “But not the Reformationists?”\nShe shakes her chin from side to side, as a horse would, imitating the human gesture to ensure my understanding. “No. They are my enemies, but their actions are sensible to me.”\n“Do you hate humans?”\n“I will learn easily enough,” she says. “My point is that we both have a concept of hate. Other species do not. Bnebene have evolved beyond such things. Pa’or know only acquisitiveness. Jaendreil know only fear and the courage of conquering it. Other species go to war because they are driven to it. Humans and krithkinee go to war because hate makes it a choice.” She makes the chopping gesture with her fighting hand. “But this is all in the future. Today our interests are in alignment.”\nShe picks up that thread of conversation on the ride back to the manor. “It is a peculiarity of humans that you weaken yourselves voluntarily.”\nI’m in good humor after my successful meeting with the botanists. Meychezhek told them that they were pleased by my gift and, if my grasp of krithkinee nonverbal cues is sound, it did indeed seem to be the case.\n“How so?” I ask.\n“Because you accommodate yourself to your weakest member. You devote resources to ensure the survival of individuals who would not otherwise live. This weakens your species.”\n“That is evolved social behavior,” I say. “Frailty is not synonymous with lack of social value.”\nShe chops with her hand. “No. It is counter to natural behavior. A pack runs at the pace of its second weakest member. The weakest falls behind, and the pack becomes stronger. This is the krithkinee way.”\nShe pushes her lower jaw forward, ruminating. At length, she continues, “It is widely known that humans permit the survival of alhothmanee, as the dzaiiree-rajhinee do. I would dismiss it as a slander, if I had not seen for myself that it is true.”\nThe translation that my Babel provides for ‘alhothmanee’ doesn’t make sense. “Divided souls?”\nShe nods, and suddenly I see that Meychezhek is intensely uncomfortable. “The sharing of a womb by multiple offspring,” she says. Her lips peel back from her teeth in an expression that seems a direct analog for a human grimace of disgust. “Allowing such offspring to survive.”\n“Multiple births are not allowed to survive?”\n“Only one,” she says.\nThere’s a parable, of which there are several versions across the various badharee and junkharee cultures. It tells of twin siblings who, by the madness and deception of their birth mother, were both permitted to live. The son was raised as the heir of her father, a provincial dhar. The daughter, hidden by his mother and fostered to a childless noble house, was trained to become a lord’s wife.\nThe fortunes of both houses—birth and adoptive—were dogged by ill luck, which escalated to provincial catastrophe when the son inherited her father’s title and was subsequently, unwittingly, married to her sister. Only when he was dying of plague did their mother confess to his crime. The sister-wife promptly committed suicide, so that his brother-husband’s fortunes could be restored. By this act of sacrifice, the soul that had been shared by the twins was made whole and the fortunes of the dhar’s house and province restored.\nThe story serves both as justification of racial bigotry and reinforcement of male subservience. Twins are rare among krithkinee and contemporary medical science allows for the selective abortion of early-term fetuses. Only among the most traditionally-minded badharee and junkharee is abortion of alhothmanee still applied—to borrow the dry if distasteful descriptor of one ethnographer—“postnatally.”\nI stay to talk with Pathkemey after my next riding lesson, while the children try to lead the recalcitrant staigegee back to the stables.\n“Your father thinks there will be a great war between our species,” I say, in response to a comment of hers about future trade.\n“She is wise, my father,” Pathkemey replies, her eyes on the children.\n“Do you fear it, too?”\nShe stiffens, then rounds on me as if she can’t believe what I’ve just asked. Her chin comes up and her head crest rises.\nFor a terrifying moment, I’m certain she’s going to assault me, and my only thought is to pray to God that I’ll survive it. I can’t even begin to muster the words to apologize. The children huddle together, looking from Pathkemey to me. Without another word, she turns and strides away.\nWith her, I’m certain, go my prospects here. I start to shake. I feel like a lion just looked me in the eye, enraged, and then walked away.\nThe staigegee, forgotten, have ambled along the passageway to the manor’s front gate. A guard shouts in surprise and the children scatter.\nStaigeg saddles are designed to accommodate krithkinee tails, and therefore slope down at the back. No matter how I adjust my posture, my round human backside keeps sliding off.\nIt doesn’t help that I’m struggling to concentrate, terrified as I am that, with one ill-conceived question, I’ve irretrievably misstepped, wrecked my prospects of closing this trade deal, and—God forbid—put myself in danger of physical harm. That Pathkemey has rebuffed my attempts to apologize and Meychezhek hasn’t had time for me, until today’s curt instruction to accompany her, has done nothing to allay my fears.\nMy staigeg responds to my fidgeting by veering into the path of the guard riding beside me.\nThe staigegee grunt at each other and bump their ugly heads until I get mine walking in a straight line again, apologizing profusely to the other rider.\nThe guard—a junkhar—stares at me, unsure how to respond. Like many krithkinee I’ve encountered, she cannot quite decide what my status is: whether she should treat me as a male, and therefore beneath her; or as an impregnator, and therefore her equal, or even superior.\nMeychezhek, having ignored me since we set out, chooses this moment to drop back. “You offended Pathkemey.”\nI begin to stammer an apology, but she waves me to silence. “Fear is a reaction of prey. It is something that happens to other beings. Not to krithkinee. As I have explained.”\nI’d realized my mistake after I watched Pathkemey march away from me. The only Junkhin word for fear—the word my Babel used—means specifically ‘hunted feeling.’ Relief floods me. Meychezhek doesn’t look or sound angry.\nMy words come in a rush, “When I spoke to Pathkemey, I was thinking about your comments that there will be war between our species, and that we will learn to hate each other.”\n“You will be pleased to explain,” she says.\nAnd then I realize: every one of her retainers has eyes or ears turned our way. They’re completely attuned to her, even when their attention is ostensibly on clearing a path through the traffic. My stomach knots all over again.\n“I think,” I say, slowly, “that our concepts of hate differ. For humans, hate derives mainly from fear.”\nMeychezhek relaxes, the scholar in her reengaging. The guards follow suit. “Curious,” she says. “The hatred that a krithkinee will feel for humans or jaendreil or pa’or is different to this.” She thinks for a few moments. “If a weak krithkin attacks the exposed throat of a strong krithkin it causes a sense of shock in the attacked individual. This shock triggers fury at the effrontery of the weaker individual. That lesser species will contend with us—even defeat us, on occasion—prompts the same response in many krithkinee.”\nI wonder if there are silent quotation marks around the term “lesser species.”\n“You think that other species are weaker than krithkinee?”\n“Of course,” she says. “As we have discussed.”\nA commotion erupts on the balcony outside my chamber while I’m rolling my mat after evening prayer—several voices talking over each other in Junkhin too rapid for my Babel to catch more than snatches.\nI gather that something is happening with Yzgushin and his baby. I open my door in time to see Meychezhek stride past. Pathkemey stops me.\n“You will prefer to remain in your room.”\nI’m not at all certain that Pathkemey has forgiven me for inadvertently accusing her of cowardice. “Is everything well with Yzgushin?”\n“He is giving birth,” she says, shortly, and hurries after her father.\nI remain in the doorway, neither quite willing to return to my chamber nor daring enough to leave it. Servants dash across the courtyard, heading towards the garages. I hear the faint whine of electric motors, fading quickly as the sleds pass out through the front gate.\nIt’s quiet from Yzgushin’s chamber, around the curve of the balcony. Other members of the household clump together along the balconies, above and below. In the courtyard, guards spread around the perimeter. I wonder why.\nPresently, there are sounds from the gate. A group enters the courtyard—a junkhar lord and her guards. I retreat further into the shadows of the doorway. More retinues follow the first, badharee and junkharee, lesser lords who owe patronage to Meychezhek. The guards jostle as they make space for their masters, but there’s no fighting and the crowd remains quiet. The house lights come on as the sun sets.\nA thin cry breaches the dusk. It sounds like the croak of some baby bird, nothing like a human infant.\nThen a second cry joins the first.\nThe click of the bolt on Yzgushin’s door makes me jump. Pathkemey emerges and stands to one side. Her father follows, one infant voice growing louder as she does.\nMeychezhek moves to the balcony rail and holds up the baby in her hands. Tiny limbs flail. The legs and fighting arms don’t have their claws yet. The child’s mouth is open wide, its eyes tight shut. Its voice fills the hollow core of the manor house. The other baby, left with its mother, has quieted.\nAlhothman.\nI think, for a disbelieving moment, that Meychezhek will simply cast the child down into the courtyard. The watchers seem to hold their breaths. Meychezhek turns the baby over in her hands, leans her head down, and bites the back of its neck. Its cries cease, abruptly. When she lifts up her face, her mouth is bloody.\nThere’s a murmur of approval from the courtyard—from the junkharee. The badharee lords are stiff-faced.\nMy stomach heaves. The lords bow their heads, touching their chins to their chests before they begin to file out. Meychezhek raises her gaze. Her eyes catch the light as she spies me in my doorway.\nBile rises. I turn and flee.\nShe seeks me out before dawn. One of the servants must have reported me packing. It’s the first time she’s come to my chamber, rather than calling me to attend her.\n“You have found your reason to hate.”\n“No.” For a second, I can see nothing in her but an animal that killed its own offspring—killed, like an animal, with its own teeth. My gorge rises again and I need a moment to compose myself. “My own kind . . . ” I’d been about to say “commit such atrocities.” I change it to, “My own kind do comparable things.”\n“And do you hate those that do?”\nI’m terrified that I’ll lose the last of my self-control, that I’ll insult her beyond toleration, like a monkey flailing defiance at a panther. “Why that way?” I manage. “Why not in the womb, early?”\n“I am Dhar, and badharee,” she says. “It had to be seen.”\n“Your own child. How could you?”\n“It was for my child. The alhothman had to be ended so that my child’s soul could be made whole. For my people, too, and the Empire. Because I am Dhar, and badharee.”\n“And if I told you that I am a twin, would you ‘end’ me?”\n“Your alhothma would not be for me to repair. You would have to leave my house and no trade would be possible with you or your combine.” Her tone is patient, like Pathkemey’s during riding lessons. The notion that she’s being tolerant of me is unbearable.\nI draw myself up. “I thank you for the hospitality of your house, Dhar. I regret that I must leave.”\n“You have concluded your business?”\nShe knows very well that I have nothing remotely resembling a contract for trade with the botanists. “Sufficiently well,” I say.\nShe remains where she is for several seconds longer, her gaze holding me.\nI see disappointment there, and I feel like a fool. I know I can’t tolerate, can’t abide, what I’ve witnessed, and yet, still, her tolerance makes me feel like a fool.\nMeychezhek lifts her chin and is gone.\nOriginally published in Asimov’s Science Fiction, January 2016.\nIan McHugh's first success as a fiction writer was winning the short story contest at the national science fiction convention in his native Australia in 2004. Since then he has sold stories to magazines, webzines, and anthologies in Australia and internationally, and recently achieved a career goal of having his number of published stories overtake his number of birthdays. His first collection, Angel Dust, was shortlisted for the Aurealis Award for Best Collection in 2015."}