{"fingerprint": "cTkdOQiBQa3S2lqzEhmggrb6g+8=", "sitename": "Clarkesworld Magazine", "title": "Mom Heart by Will McIntosh", "author": "Will McIntosh", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcintosh_11_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mom Heart by Will McIntosh", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6880 words, short story\nMom Heart\nThe front door banged open.\n“Daddy! Dadd-deee!” Bluet wailed.\nI rushed to Bluet.\nBluet’s eyes were wet. Karina hung back, blank-eyed, as Bluet bolted forward.\n“Regan called Mommy dead.”\nI wrapped Bluet in a hug. “I’m sorry.” My voice was muffled, my face pressed into Bluet’s hair. “That was not a nice thing to say.” Everything had to be a competition with Regan, and she always had to win. If she could win at Who Had the Most Mommies, she wanted to fucking play.\nI held out one arm until Karina joined us reluctantly, then I squeezed them both, willing them to feel better, willing my strength to flow into them. Especially into Karina. Even from the back, I could feel Karina’s ribs.\nAs soon as I stopped squeezing, Karina slipped out of my arms and made a beeline for her room.\n“I’m going to put out a snack in a minute,” I called to her.\nKarina didn’t reply. I heard her door close.\nShe spent every possible moment in there, doing absolutely nothing as far as I could tell. All the progress she’d made, all the confidence, the social skills, the joy, had been wiped away in the course of one single, terrible, horrible day. It hurt to think of her in that room, sinking deeper into herself.\nAt this point, I didn’t know how much of it was her autism and how much depression.\nI set out two chocolate éclairs, the most tempting, high-calorie snack I could think of. I’d given up caring whether the food was nutritious—I just wanted Karina to eat. And when you’d been given the semester off from teaching, you had all the time in the world to hunt down old-school bakeries.\n“Bluet, Karina? Snack time,” I called.\nBluet appeared. No Karina.\nI knocked on Karina’s door, then I opened it partway.\nKarina was sitting on her bed rocking, staring down at her hands, her hair forming a hiding place for her face. Zelia had always tied Karina’s long, wild hair into a ponytail before school, but now Karina insisted on wearing it loose, so she could use it as a room to hide in.\n“Come and have a snack. Please?”\nKarina went on rocking. She had stopped doing that when she was four or five. Now it was starting up again.\n“Please, Karina. At least come sit at the table?”\nNothing.\nI went to Karina, and ever-so-gently lifted her face until she was looking at me. “Come sit at the table.”\nKarina slid off the bed and slunk past me without a word. I followed her into the kitchen and pulled out her chair.\nKarina stared down at the éclair.\n“I got them at a bakery. They’re really fresh.”\nBluet swiped up a fingerful of whipped cream and held the finger out to Finster, who wagged his tail as he licked the whipped cream.\nYou were supposed to get a little better every day. Especially kids. Everyone said that. Don’t worry about the girls, kids are resilient. But if you already had a lot of challenges, losing your mother could be too much to snap back from.\nDr. Ferdinand said this was a critical period for Karina, that if she didn’t recover from Zelia’s loss now, it might change her trajectory right into adulthood. But every time I pictured my seven-year-old girl all alone at a psychiatric facility, it brought me to tears. Dr. Ferdinand didn’t know Karina the way I did. I felt this deep certainty that being alone in that hospital would just further traumatize her.\nIf she kept on this downward spiral, though, what other choice did I have?\nI knew what Karina needed. She needed Zelia. Zelia had been the one who got Karina, who could connect with her. She was Karina’s bridge to the rest of the world.\nThe last thing Zelia had said to Karina was, I’ll be right back. I kept thinking that if she’d been able to say goodbye, Karina would have been able to get over losing her.\nBluet offered Finster a bigger piece of her éclair. Finster nibbled at it tentatively, knocking it out of Bluet’s hand and onto the floor before trotting away.\nOur domestic bot, which had been scrubbing the linoleum floor, rose, its scrubbing brushes disappearing into its carbon fiber tube arms. It strode purposefully toward the glob of éclair on its wide, flat feet.\nI smiled, remembering how Zelia had bristled that the bot had been given a vaguely feminine form by its manufacturer, and insisted on calling it Hank, which was, she said, the most masculine name in existence. The first time I referred to it as Larissa—the most feminine name in existence, according to me—Zelia had thrown back her head and laughed her husky laugh.\nMy phone rang—it was Zelia’s mom. I left the kids with their éclairs and went to my bedroom to answer it out of earshot.\nBlessedly, she only wanted to check on their flight itinerary, and I was able to get off quickly, without the obligatory reminiscing. I was dreading Zelia’s parents week-long visit at the end of the month. Zelia’s mom insisted on talking about Zelia nonstop, telling anecdotes from her childhood that I knew were meant to be helpful, but only made things worse. Having my own parents around was more of a comfort, but they had their hands full dealing with Dad’s COPD.\nI stepped into the hallway and almost collided with Hank/Larissa.\n“Pardon me, Benji. I didn’t see you there.” Hank/Larissa passed with a stack of neatly folded, brightly colored girls’ clothes. I watched the bot pass. It was now a tiny balm that the domestic bot possessed those rounded contours that gave it a vaguely feminine appearance. It provided the slightest hint of a maternal presence, when that lack was like a black hole sucking all joy, all life from our family. Maybe I should ask Hank/Larissa to put on female clothes to play up that presence. We certainly had plenty of women’s clothes to spare. Karina refused to let me, or Hank/Larissa, get rid of anything of Zelia’s.\nI let out an involuntary hack of gallows laughter as I imagined the bot going through Zelia’s closet, choosing something to wear. Sick thoughts.\nI went to check on the girls, kicking Finster’s toy lamb out of my path. Finster wouldn’t play her lamb game with anyone but Zelia, so the lamb had become another memory that got booted from room to room.\nHank/Larissa appeared with the empty laundry basket, its blocky carbon-fiber face bland and vaguely cartoonish. “Pardon me, Benji. I hope you’re having a good day.”\nI turned to watch the bot pivot on legs that were nothing but narrow pipes, its feet like flippers by contrast, but what my exhausted mind saw was Zelia, her knees turned slightly inward, her ponytail bobbing.\nFor an instant the vision was so clear I almost ran to her. Then Hank/Larissa was back, and I was left with a truly unhinged idea.\nWhen I thought I had it right, I stepped back and raised the transmitter strapped to my wrist.\n“Testing.”\nThe bot repeated what I’d said in Zelia’s lovely, scratchy alto. It took me a moment to collect myself, hearing her voice. It was as if she was suddenly in the bedroom with me, and all of this had been a long bad dream.\nIt might blow up in my face, but it also might make things better, and things needed to get better. They just had to.\nWhat would Zelia think?\nShe’d approve. She’d be down with anything that could help Karina. And it was her sort of idea. Bold. Bizarre.\nI lifted the microphone to my lips.\n“Hello, Duckies.” The voice seared right through my heart. It would do the same to the girls.\nThat was the idea, though, wasn’t it? Convince them Zee was speaking to them for a few precious minutes. A few words from Zee would mean so much to Karina.\nAnd really, how different was this from Santa Claus, the Easter Bunny, the Tooth Fairy? Parents created mythical benevolent figures all the time to provide comfort, to inject a little magic into the world. And when the kids were old enough to know they’d been punked, they were okay with it. How many kids wished they’d never believed in Santa Claus?\nI tried the transmitter again. “Hello, Sunshine.” Zelia had called me “Sunshine,” insisting it wasn’t meant to be ironic, or at least not completely so.\nI went to the bedroom and opened Zelia’s closet door. Before the accident I hadn’t realized Zelia had a scent all her own, now it wafted off everything she’d ever touched. It was lemon and puppy’s feet. A hint of brown sugar.\nThe phone rang: my friend Vincent, probably just checking on me. I sent the call to voicemail. Vince had really stuck by me through this, but I’d had so little time to devote to our friendship. I missed our trips to the movies, playing racquetball, gossiping about other faculty. There was just no time now.\nHands shaking, I sorted through Zelia’s clothes. What was her most iconic outfit, the one Karina and Bluet would most easily recognize? I rifled faster, wanting to finish. It hurt to see these shirts and dresses, each sparking half a dozen memories.\nSitting up against a wall in my closet, I guided the bot in a slow pan of the living room. Through the camera embedded behind the bots’ left eye, I saw Bluet watching cartoons, her face much too young for the dark sunken racoon-rings under her eyes. Karina was sitting at the kitchen table, head down, one leg swinging, doing nothing.\nI felt excited, guilty, full of dread, hopeful, sad, uncertain. This was the last point where I could change my mind. I knew I wouldn’t. Crazy as this idea was, it felt right. I felt sure I could reach Karina this way.\nHeart hammering, transmitting sensors strapped to my ankles, I jerked my legs straight out just as I’d practiced.\nThe bot’s feet flew out from under it. It clattered to the linoleum floor.\nStartled, Bluet and Karina turned to watch the bot thrash on the floor like it was having a seizure.\n“Daaad?” Bluet called. “Something’s wrong with the cleaning thing. And why is it wearing clothes?”\nI didn’t answer—I had to stay out of sight and earshot for this to work. I stopped the bot’s thrashing and made it sit up slowly. It looked from Karina to Bluet.\n“I made it,” I said into the wrist mic, my heart pounding so hard I was afraid I was going to fracture a rib. The bot repeated what I’d said in Zelia’s husky Brooklyn accent.\nThe girls froze.\n“Karina? Bluet? It’s me.” I stood the bot up by drawing my knees up, placing my own feet flat on the closet floor, and tensing my quad muscles. “I don’t have much time. Just a few minutes, and then I have to go back.”\nThe girls gawked at the bot.\n“Why do you sound like my Mommy all of a sudden?” Bluet asked.\nThe voice was right, but they weren’t buying it. The bot sounded like Mommy, but I wasn’t talking the way Zelia talked. It felt wrong to playact the part of my late wife to that extent, almost like I was mocking her. That’s what it was going to take, though.\nI sat up straighter in the closet. I closed my eyes, took a deep breath, and pictured Zelia in the kitchen, leaned up against the counter drinking tea made from some obscure bitter root while simultaneously scarfing Oreos, her bare shoulders covered in freckles, her ponytail poking out the back of a Kansas City Royals cap, because she loved the Royals, even though she’d never been to Kansas City.\n“Let me get a look at my Duckies, see if your daddy’s been feeding you.” I reached out the bot’s arm to brush Karina’s chin. “You’re beautiful. Heavy duty cuties, both of you.”\nThe girls went on gawking, as if the bot had blown a gasket.\n“Hey.” I moved the bot over to the candy jars lining one counter of the kitchen. “You want to binge on some sugar, dextrose, and red dye number five?” The bot lifted the lid off the Sour Patch jar. “I can’t partake, unfortunately, because I have no digestive system. But I can distribute.” The bot set a handful of Sour Patch Kids in Bluet’s outstretched hand.\nKarina was gazing up at the bot, her eyebrows raised. “Mommy?”\nI knelt Zelia-bot down, reached out, and brushed the tip of Karina’s button nose. “Bingo.”\nKarina launched herself into the bot’s outstretched arms. She turned to Bluet. “It’s Mommy! It’s Mommy!”\nBluet’s eyes went huge and round. “Mommy?” She joined Karina in the bot’s arms. “What are you doing in there? Come out.”\nGuilt flooded through me, blotting out every other emotion. Suddenly this felt like a terrible mistake, cruel and childish. But I couldn’t stop now. Not yet, anyway.\n“I can’t, Sweetie. The bot let me borrow her body for a little while. I have some things I want to tell you that I didn’t get to say before I left. And then I have to go back.” What would Zelia want to say to them? I should have written some things down.\nDon’t think. Just talk.\n“This sucks. So bad,” I said as Zeliabot. “I hate being away from you guys. I miss you so much.”\n“It was because of the accident,” Bluet said. “That’s why you went away.”\n“It was. I never would have left you if I had any choice. But here’s the thing: I may not be here in my body, but I’m still all around you, all the time, wherever you go.” The words poured out. They felt right, felt Zelia. “Now, there’s something I need you to do for me.”\n“What is it?” Karina wasn’t even blinking, she was so mesmerized.\n“Even though you miss me, I want you to be happy. Laugh. Play with your friends. Karina, I’ve watched you moping in your room, and I don’t like it at all. You hear me? No more moping. Ride bikes. Get in trouble at school. Jump in some lakes. Watch some TV, for God’s sake! Can you do that for me?”\nKarina nodded. “Now that you’re back, I can. I missed you so much.”\n“I missed you so much, too!” Bluet piped in.\n“I miss you munchkins, too. But I can’t stay,” I said. “As much as I hate the rules, they’re the rules. You have no idea how many strings I had to pull just to get a few minutes with you.”\nTears trailed down Karina’s cheeks. She grasped the bot’s hand. “Please. Please. There’s so much I have to tell you.” The expression on her face. The hope. The here-ness. When was the last time I’d seen such lucidity in those eyes?\nI felt a plunging in my stomach. This was just going to reopen the wound, make it fresh and bloody all over again. It was going to tip Karina over the edge.\nKarina clung to the bot, her face buried in Zelia’s sundress. “Please, Mommy. Don’t go.”\n“I’ll come back,” I blurted.\n“When?” Karina demanded through her tears.\n“Tomorrow,” I promised. “After school.”\nKarina’s face relaxed and flushed with color. “We can play one of our games.”\n“We can do whatever you want,” I said. “Right now, though, I have to say adios. Be good, Duckies.”\n“We will,” Karina said as Zeliabot went still.\nI wasn’t sure whether to restore the bot’s autonomous settings and let it go back to doing chores, or to leave it deactivated. Maybe deactivated would be less confusing for the girls. I climbed to my feet and headed for the living room.\nThe girls surrounded me immediately.\n“Daddy! Where were you? Mommy was here!” Bluet cried.\n“It’s true!” Karina said. “You won’t believe it, but it’s true.”\nI did my best to act awestruck and elated. I asked lots of questions.\n“Aren’t you sad you missed her?” Karina asked. “Don’t worry, she’ll be back tomorrow. You can talk to her then.”\n“Great.” I’d have Zeliabot explain why she and I could never be there at the same time.\nAs I rooted through the freezer seeking something to microwave for dinner, the girls talked and laughed excitedly. I’d have to navigate this carefully, but it felt so good to see life in Bluet’s eyes.\nThey came busting through the door after school. “Mommy? Mommy?”\nThey’d talked about nothing else, just one long breathless conversation about the things they wanted to tell Mommy, the games they’d play with her.\nI rushed Zeliabot down the hall to greet them. “How are my babushkas?\nBluet grabbed Zeliabot’s hand and pulled. “Let’s go outside!”\n“Why don’t we stay inside? We could play Godzilla Goes to Disneyland.” It would not be ideal for the neighbors to see Zeliabot.\n“But it’s beautiful outside.” My unstoppable force of a daughter tugged Zeliabot’s hand. I just couldn’t say no. It would be good for the kids to get some fresh air and exercise. Let the neighbors think we were complete weirdos, if they didn’t already.\nAs soon as we were outside, Karina and Bluet headed for the bike path that led to the neighborhood playground. It was all of a hundred yards from the house, but suddenly it seemed like miles as I navigated our domestic bot, with its built-in brushes and floor-polishing capabilities, between our neighbor’s fenced yards.\nAcross the bike path from the playground, Regan’s dog Max greeted them with furious barking from behind his chain-link fence, kicking up divots in the grass as he tracked them. What a fantastic idea, to get a loud, angry dog that barked and snarled ceaselessly when your yard was right behind the playground.\n“What should we do?” Karina asked Zeliabot as they entered the playground, which was blessedly deserted.\nZelia had always been busting with ideas for things to do. She’d announce on a random Friday that tomorrow was National Dominoes Day, and send me off to bake brownies, using chocolate chips to turn them into dominoes. There would be a slate of events. Each contestant would have to steer Finster through a minefield of dominoes without knocking any over. The kids would make domino-themed artwork. It was like a holiday only we celebrated. The girls loved those days.\nI, on the other hand, was not busting with ideas. I was the boring parent who felt self-conscious about pretending to be Big Bird or a Powerpuff Girl.\n“How about we fly?” I spread Zeliabot’s cleaning accessory-laden arms and ran her in loops around the playground equipment. Evidently this was sufficiently creative, because Bluet and Karina spread their arms and flew behind me, Bluet making enthusiastic airplane sounds.\nGood ol’ Bob Stevens, who owned the house next to Regan’s family, was fertilizing his lawn. Zelia had dubbed him The Old Man and the Lawn, because Bob fancied himself a heroic figure in his battle against the twigs and acorns and weeds that marred the perfection that was Lawn. Bob paused to watch the proceedings.\n“I’m pretty sure that’s Paris down there,” Zeliabot said. “You see the Eiffel Tower?”\n“I see it!” Karina said.\n“And look up there! A UFO! I think I see drunk aliens hanging out of it!”\n“I see them!” Bluet pointed at the sky.\nRegan appeared on her porch. I was tempted to have Zeliabot tell the girls it was time to go, but they’d only been there a couple of minutes. Regan squeezed through the gate as Max barked and jumped, trying to get out.\nZeliabot waved. “Hi, Regan, how are you?”\nRegan stopped short. She looked at Karina. “Why does your bot sound like your mom?”\n“Our mom came back!” Bluet cried. “She’s inside the bot.”\n“No, she isn’t.” Regan eyed the bot. “You’re a liar.”\n“Don’t call her that, or you can’t play with us,” Zelia said.\nRegan considered. “What are you playing?”\n“We’ve been flying around the world, but we’re about to start flying through time.” Zeliabot spread her arms and resumed gliding. The girls followed. “Do you want to pick our first destination?”\nRegan spread her arms and joined the aerial procession, cutting in front of Karina and Bluet. I was tempted to tell her to go to the back of the line, but right now keeping her from interrogating Zeliabot about her authenticity seemed more important.\nWe were visiting prehistoric times, flying over a triceratops, when Bob Stevens, who’d been watching the whole time, barked “Jesus Christ.”\nI had Zeliabot fly closer to Bob, setting off furious barking from Max. “How are you, Bob? How’s the lawn?”\n“What is this?” Did Bob look annoyed? Confused? It was hard to tell with Bob—his default expression was pinched, squinty-eyed, just-bit-a-lemon.\n“I’m just back from the dead for a while to visit my daughters.” I pulled my wrist away from my face and burst out laughing. That line was pure Zelia.\n“Who’s saying that?” Bob demanded. “This isn’t funny, for your information.”\n“It’s me, Bob. Don’t you recognize my voice?”\nBob studied Zeliabot for another moment, then turned and limped inside, shooting glances over his shoulder, looking like he’d seen a ghost. Or bit into a lemon. One or the other.\n“This time with you, it’s so precious to me. I look at you both, and you’re luminous. I’m so grateful.” Zeliabot hovered over the kids as they ate the grilled cheese sandwiches and chicken noodle soup she’d made. Karina was wolfing it down. “This has been so hard on you, but you’re going to be fine. You have fabulous lives ahead of you.” I grabbed the hand towel I kept handy to wipe tears. “I love you two. Always and forever. Don’t forget that.”\nI had to start cutting back the frequency of Zeliabot’s “visits.” I knew that. But the girls were so happy when she was around, and that made me happy.\nFinster appeared from out of the living room, carrying the toy lamb in his mouth. He dropped it at Zeliabot’s feet and looked up expectantly. I burst out laughing, which meant Zeliabot burst out laughing.\n“You want to play the lamb game?” Zeliabot retrieved the lamb and hid it behind her back. Finster leaped into the air, ecstatic.\nMy phone rang.\n“I have to rest for a few minutes,” I had Zeliabot say. “I’ll be right back.” I threw the lamb so Finster could chase it, then put Zeliabot in standby mode.\nIt was Ms. Vazquez, the principal at Karina’s school. As far as I could remember, she’d never called before. It was always the vice principal, or a teacher. After the bare minimum of pleasantries, Ms. Vazquez dove into the reason for the call.\n“We’re all thrilled that Karina has finally turned a corner, but now that she’s talking again, she’s telling her classmates these stories. She’s insisting that her mother has come back.” She whispered the words come back, as if it were an obscenity, or a racial slur. “Has she been doing this at home at all?”\nI stammered, let out an utterly inappropriate nervous bray of laughter. I guess I should have anticipated this.\n“Actually,” I began. How could I put this that didn’t make me sound unhinged? “Here’s the thing. You know how dire things were getting. I know Dr. Ferdinand was keeping you updated, and you could see for yourself that Karina was getting worse instead of better.”\nMs. Vazquez’s tone softened. “I can’t imagine how hard this must be on both of them.”\n“Karina’s sister is doing all right. As well as can be expected, anyway. But until last week, not Karina. I think it was the suddenness. Karina really struggles with transitions, as you know. If my wife had been able to speak to Karina before she died, to say goodbye, I think Karina would be handling it better.” I took a deep breath. “In fact, I know she would. Because out of desperation, I decided to pretend her mom has come back for a little while.”\nThere was a long, long pause. “I’m sorry, what did you just say?”\n“The next step was putting Karina in a psychiatric facility. I had to try something.”\n“You’re saying this isn’t Karina’s imagination?” Ms. Vazquez sounded uncomfortable. Embarrassed, almost.\n“I know it sounds strange, but it’s working. It’s the only thing that’s worked.”\nAnother long pause. The paranoid part of me felt certain she’d decided to start recording our conversation, to gather evidence of my insanity.\n“I have to be honest,” she finally said. “I have no idea how to handle a situation like this. I mean, you can see why we can’t play along and humor Karina. I’ll have to consult with the school psychologist, and the superintendent.”\n“I’m not asking you to humor her. Just say nothing. Smile and give her a pat on the head.”\n“I’m not sure that’s possible. As I said, this is causing a stir among Karina’s classmates. They’re bringing the stories home.”\nI was tempted to ask her why that was a problem. Before the accident, when Karina used to talk about school, she’d bring home all sorts of ignorant ideas her classmates parroted from their parents.\n“Mr. Brody? Did you hear me?”\n“I’m sorry, I missed what you said.”\n“I said, I’d like to set up a meeting for next week.”\n“Okay. Sure.”\nI got off the phone as quickly as I could, and reactivated Zeliabot, already regretting agreeing to meet with them. I did not want to go to that meeting. They’d look at me like I was mentally unstable, demand I prove I wasn’t. Prove to us you’re not a danger to your daughters. I wasn’t up for that sort of grilling.\nI took a second shot of rum. Zuma, the brand was. Zelia had picked it out. She’d liked how it went with her name. I hadn’t touched the bottle, or any other alcohol, since the accident. I knew if I’d started drinking, I wouldn’t stop, and I needed to take care of my girls.\nNow, though, I needed liquid courage.\nZeliabot climbed out of Zelia’s Toyota Spark and headed for the entrance to Willowbrook Elementary as my heart pounded in time with her exceptionally loud carbon fiber footsteps. Parents leaving with their kids glanced at Zeliabot as they passed.\nAt the door, Zeliabot waited for a dad with a first- or second-grader to pass through, then caught the door before it closed, so she wouldn’t have to be buzzed in. I marched her into the main office and made a beeline for the conference room door in the back corner of the big space.\nThe secretary looked confused. “Why is the cleaning crew here already? Hey, the conference room is in use, you can’t clean in there yet!”\nZeliabot breezed into the room. “Sorry I’m late. Should I sit here?” Since domestic bots aren’t designed to sit—they don’t get tired, and typically don’t attend parent-teacher conferences—I had to sort of flop Zeliabot into the seat at an awkward angle.\nThere were three flabbergasted individuals in the room: Karina’s teacher, Ms. Hoffman; Principal Vazquez; and Ms. Prentiss, the school psychologist. They exchanged looks, deciding who should speak.\nFinally Principal Vazquez said, “Mr. Brody, this isn’t funny. Are you outside? Would you please come in here?”\nThe question was, did I break character? I didn’t want to. I wanted Zeliabot to handle this.\n“I’m sorry, but no, you’re talking to me.” Zeliabot poked her chest, which was covered by a tie-dyed yet tasteful blouse. “You seem to think I’m a problem, so I’m here to defend myself. Because the way I see it, Karina has been drifting in and out of this school for the past four months, and you haven’t managed to help her at all. No, wait, you taught her to add fractions! So, there’s that. Nice job.”\n“Mr. Brody, we’re not doing this.” Ms. Vazquez was good at the tight school administrator tone.\n“We’re going to do whatever it takes to help our girls, and if you’re offended or inconvenienced by our methods . . . ” I turned Zeliabot’s hands palm up. “Tough.”\nMs. Prentiss cleared her throat. “Mr. Brody, you may believe you’re helping Karina. She may even seem to be improving. But you’re only traumatizing her further. Her sister as well. You’re not allowing them to get past this.”\n“Karina isn’t getting past this.” I thumped the table with Zeliabot’s hand for emphasis. “She’s getting worse. Or she was, until I showed up.”\nMs. Vazquez stood abruptly. “Okay, that’s it. I’m terminating this meeting.”\nMs. Hoffman and Ms. Prentiss stood dutifully.\n“I’ll have to consult with the school district’s attorney to decide on next steps,” Ms. Vazquez said to Zeliabot, her tone heavy with threat.\n“Our attorney will be happy to hear your explanation for why you’re harassing my husband about our family’s sincerely held religious belief that souls can inhabit robots.”\nMs. Vasquez swallowed like she was trying to force an egg down. I’d uttered the magic words. Why hadn’t I thought of this sooner? Don’t infringe on my religious freedom.\nI had to drop Zeliabot to her hands and knees to get her out of the chair. As she stood, I extended her hand to Ms. Prentiss. “Thank you. I know how hard you work. I didn’t mean to imply you don’t care about Karina’s well-being.” Because that’s what Zelia would have said once she’d calmed down.\nMs. Prentiss shook Zeliabot’s three-fingered hand, looking wildly uncomfortable.\nI thanked Ms. Hoffman and shook her hand as well. Ms. Vazquez breezed out before I could offer to shake hers.\nThe kids were waiting by the door when Zeliabot returned home. She took them into the back yard to play, and to talk.\n“I can’t stay much longer,” Zeliabot said.\n“Yes, you can,” Bluet said.\n“No, I can’t, Ducky. Not much. But I’ll always be around, even though you can’t see me. And Daddy is here to take care of you.”\nKarina looked toward the house, lowered her voice to a stage whisper. “Dad doesn’t know how to play. We need your Mom heart.”\nIt felt as if someone had stomped on my chest. I couldn’t speak. Couldn’t breathe.\nHow many times had the girls tried to get me to play one of Zelia’s silly games, only to have me say I had work to do, or I’d watch them play? I despised animated films, picture books, hearing the same happy bouncy songs over and over. Somehow, I thought they hadn’t noticed.\n“I know, Sweetie. I know he doesn’t,” I finally said. “He’s loves you both so, so much, though. You know that, right?”\nKarina nodded.\n“But not as much as you do,” Bluet said.\n“Just as much. I promise you. He’s just not good at showing it. But he loves you so much. He’d do anything for you.”\n“Except play,” Karina whispered.\nIt was the only thing Zelia and I ever argued about. What I wouldn’t give to go back and jump into one of those games, and see Zelia’s surprised smile. I always figured I’d catch up when the girls were teenagers, when I could relate to them better.\n“How come Dad can’t talk to you?” Karina asked.\n“Like I told you, it’s just one of the rules,” I stammered. “I came back to talk to you. I can’t also talk to Daddy.”\n“What if he just sits and doesn’t talk?” Bluet asked.\n“It doesn’t work like that, Sweetie.”\n“But it’s not fair,” Bluet insisted. “Daddy needs your Mommy heart, too.”\n“Tell you what? While you and Karina are at school, I’ll come once just to visit Daddy. That won’t break the rules. Would that work?”\nBluet seemed disappointed that she wouldn’t be there. “Do you swear?”\n“I swear,” Zeliabot said.\nZelia had always sat on the end of the couch next to the end table, which she referred to as the controlling side, since the remote was there, and there was space to set drinks and snacks. I perched Zeliabot in Zelia’s spot and sat in the glider-rocker across from the couch.\nI gazed across at our domestic bot, with her big button eyes and cleaning attachments bulging under Zelia’s pink and blue sweater, feeling incredibly silly. I’d sworn, though, and I wasn’t going to break a swear I made to my daughter.\n“It’s working. You’re helping her,” I said aloud, and immediately felt completely ridiculous. I also felt guilty for conversing with a domestic bot while Jack Lockley covered my classes. I was so grateful for my leave. I couldn’t imagine standing in front of a class right now and talking about operant conditioning and Sigmund Freud.\nI lifted the transmitter to my lips. “We really got fucked over, didn’t we, Sunshine?”\nIt was a surreal echo-effect, hearing my own words, then hearing Zelia repeat them a beat later.\n“Nine years,” Zeliabot went on. “Most couples get, like, fifty. We got nine.”\n“They were good years, though.”\n“They were. Not always easy, but they were always good. Remember the Disney World Trip?”\nI nodded, sniffling. “I never laughed so hard.”\nZelia had gotten the idea of narrating aloud her moment-to-moment experience from some old movie.\nLines. Everywhere she looked, nothing but endless lines. The mother considered bolting, leaving the father with the children, and hiding in Winnie the Pooh’s Restaurant nursing an obscenely overpriced margarita.\nBluet had been two, too young to ride anything but the teacups, too young to know who the hell Mickey and Cinderella were. But Karina had been five, right in the Disney sweet spot. The rest of us had drafted off her exuberance.\nI allowed myself to remember, even though it hurt. Zeliabot waited patiently, wedged awkwardly against the sofa, her pipe legs poking out of a peasant skirt.\n“I’m kind of lost here without you, Zee.”\n“Not completely lost,” Zeliabot replied. “You saved Karina. It was a brilliant idea, Sunshine, it really was. Now, how do I make a graceful exit before we lose our kids to child services?”\n“I was hoping you’d know,” I replied.\n“Trust the universe,” Zeliabot said. “Every so often, it provides a tiny window of opportunity.”\nThat’s what she would have said, or something like it. She’d always had more faith in the universe than I did.\nStanding in the shadow of the big slide-bridge-castle structure on the playground, Bluet linked arms with Karina, ready for their next challenge.\n“All around you, land-squids with fire breath are waving their tentacles.” Zeliabot waved her arms, illustrating the peril the girls were in. “One of the tentacles reaches out, trying to grab you!”\nBluet screeched in terrified glee as the girls rushed forward a few steps to avoid the imaginary tentacle.\n“Careful you don’t fall off the walkway!” Zeliabot pointed at the ground. “There’s a squiggly part up ahead.” I was kind of proud of this game I’d invented—sort of live Dungeons and Dragons.\nThe back door of Regan’s house opened, and Regan appeared on her back porch. I silently willed her to go back inside. I wasn’t in the mood.\n“What are you doing?” Regan hurried down the porch steps, ran toward the gate as I cursed silently.\n“We’re playing Dungeons and Dragons,” Bluet called. “Want to play?”\nRegan opened the gate just enough to squeeze through.\nMax leaped and hit the fence with his front paws, knocking Regan to the ground. Free of the fence, he charged Bluet and Karina, teeth bared, spitting foam.\nI raced Zeliabot to intercept the dog. Max charged at the bot. Snarling, he leaped and clamped his jaws on her raised arm. Zeliabot toppled backward.\n“UP ON THE SLIDE!” I screamed. “RUN! HURRY!”\nMax went for the girls. I reached out as the dog’s hind legs passed over Zeliabot and managed to grab one of them. Hobbled, Max thrashed at the wood chip-covered ground. Zeliabot clung to his back haunch. I tried to squeeze it harder, to break his fucking leg, but the bot’s grip-strength was limited by design.\nMax dragged Zeliabot along the ground toward the steel steps that led up to Karina and Bluet.\nHe was halfway up when Zeliabot reached the bottom step. I grasped the bottom of the handrail; Max jerked to a stop.\nHe spun, bit the bot’s wrist, and shook his head violently side to side. Zeliabot held on. I reached out with her other hand, got hold of Max’s collar, then jammed Zeliabot’s hand between the collar and the dog’s neck and pulled, forcing Max’s head down.\nMax was snarling and biting, fighting to break free. Regan was shouting at him, but he ignored her. He was finally out from behind that fence, maybe for the first time in his life, and he was intent on biting someone, anyone.\nThere was nothing more I could do as Zeliabot. I burst from the closet, grabbed the aluminum bat I kept by the front door, and sprinted toward the park.\nAs I ran, I kept picturing Max breaking free, turning toward my girls . . .\nI drew within eyeshot, saw Regan’s mother burst through the back door. “Jesus Christ. Max! No! How did he get out?”\nAs soon as Regan’s mother, whatever her name was, got hold of Max’s collar, he shut up, or at least toned it down to an urgent whine. She pried Zeliabot’s grip off of him and dragged him roughly toward the gate as I raced to my girls.\nI studied Karina and Bluet as they sipped their juice boxes. “You’re sure you’re okay?” I rested a hand on each of their tiny shoulders.\n“Fine,” Karina said.\n“Me, too,” Bluet echoed.\n“I knew Mom wouldn’t let Max hurt us,” Karina said. “Is she okay? Why isn’t she talking?”\nI glanced over at Zeliabot, lying on the couch, her pinstriped chinos and Greta Van Fleet T-shirt soiled and torn, teeth marks covering her wrist and hand, her arm only connected to the torso by a handful of wires. She was going to need serious repair work.\nAnd then what? Even if I could hold off the school and somehow survive a visit from Zelia’s folks, soon Karina would be eight, then nine. She didn’t believe in Santa Claus anymore. How much longer would she believe in Zeliabot?\nThis was the moment. There would be no better time than right now.\n“I’m going to go rest a little.” I headed into my room, into my closet.\nI activated Zeliabot for the last time.\n“Hello, Duckies.” I struggled to keep the sadness out of my voice.\nThe girls leaped up, shouting, “Mommy! Mommy!” and ran to Zeliabot.\n“Are you all right?” Karina asked. “We were so worried about you.”\n“I’m fine, Sweetie. This is just a bot. It’s not me.” I sat Zeliabot upright as best I could. “But the bot is too damaged to fix.”\n“Oh, no!” Karina wailed.\n“No, it’s okay. You’re safe now. I’ve done everything I came here to do.”\nBluet grabbed Zeliabot’s hand. “Mommy, no.”\n“It’s okay, Duck. I’m always here. Always. Even when you can’t see me.”\n“It’s not the same, if we can’t see or hear you.” Karina was crying.\n“It’s not. I know. But it’s still good knowing I’m here. Isn’t it?”\nThe girls didn’t reply.\n“I need you to tell me you’re going to be okay,” Zeliabot urged. “That you’re going to be happy. Will you do that for me?”\n“No,” Karina said. “You can’t go. No.”\nZeliabot brushed Karina’s wet cheek. “You can do this, Ducky. We have to say goodbye, even though it’s hard. Please. For me. Do it for me.”\nSobbing, Karina wrapped her arms around Zeliabot. “Goodbye.”\n“Goodbye, Mommy,” Bluet cried. “Goodbye.”\n“I love you both. Always remember that.” As I dropped my wrist, Zeliabot added, “And you too, Sunshine.” Even though I hadn’t said those words.\nI set Zelia’s damaged body in the back seat of the car. Karina and Bluet stood by, crying quietly.\nI went and knelt by them. “It’s okay. Mom’s mom heart is still here. Remember how we promised Mom we’d be happy?”\nThe girls nodded reluctantly.\n“Let’s show Mom we’re keeping our promise. Why don’t we play one of her games? She’ll see we’re being happy, just like she asked.”\nBluet looked surprised. “You’re going to play, too?”\n“I told you, Mom left us her mom heart. From now on I play all the games.”\nI took the girls’ hands and urged them toward the back yard. These early moments seemed crucial, to keep the Zelia-energy flowing.\nAnd you too, Sunshine. I kept replaying those words in my mind, hearing them in Zelia’s voice.\nThere was an obvious explanation. Hank/Larissa had glitched, and said something from its bank of platitudes, and I’d misheard it.\nI decided I didn’t believe that explanation. I believed the numinous, mystical explanation.\nThe Zelia explanation.\nI burst onto the lawn, my Ducklings on my heels, and spread my arms.\nWill McIntosh is a Hugo award winner and finalist for the Nebula and other SF/F awards. His novels include Defenders, Love Minus Eighty, and Soft Apocalypse. Along with nine novels, Will has published around fifty short stories. He was a psychology professor before turning to writing full-time, and lives in Williamsburg, Virginia with his wife and their twins."}