{"fingerprint": "2hct60Xe/WXT6FOqNxOtXAiwZQ4=", "sitename": "Clarkesworld Magazine", "title": "The Old Moon by John McNeil", "author": "John McNeil", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mcneil_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Old Moon by John McNeil", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2860 words, short story\n The Old Moon\n Viburn couldn’t believe I liked the cold.\n “I mean the deep cold,” I said. “At the bottom of a crater on the old moon, in a permanent shadow.”\n “But that must have been, that must have been,” shuddered Viburn. “If it never got starlight?”\n “Never.” I poured water onto Viburn. “And there was no atmosphere to scatter diffuse light. They were dark, completely dark—the shadows on the old moon.”\n Viburn enjoyed my stories. Unable to move, the sentient Arrowwood shrub relied on me, their servant, not just for water and fertilizer, but for conversation and mental stimulation too. “So that must have been,” said Viburn, in a voice that rose from a dense rustling of stems and leaves, “was it absolute zero?”\n “A few degrees Kelvin. My circuits dragged. I could only move and think very slowly. A delicious feeling. And those craters had niridium deposits, so we had to mine them.”\n “I would starve there, of course,” said Viburn. “Even with light. I couldn’t photosynthesize if I were anywhere near that cold.”\n “Don’t worry, you never will be.” Swiveling my left shoulder joint, I pointed out Viburn’s bay window, which was almost filled by the star our station orbited.\n After the watering, I scattered bits of nitrogen on Viburn’s medium. Checking the air composition was next. Carbon dioxide levels were low but sufficient. I could pump in more tomorrow. Oxygen was high. I pulled a lever with my right claw and the O2 scrubbers engaged.\n “There are hazards for me too, on this station,” said Viburn. “It’s not all luxury, like they said when I bought in. The cosmic rays.”\n “Yes.” I’d heard this before, but there was no stopping Viburn once they got going about the cosmic rays.\n “It’s scrambling my DNA. Just thin metal and glass to protect me. Very little atmosphere. I can never flower, never reproduce. I’ll live a long while here, but I’ll be alone.”\n “You’re not alone,” I said. “I’m here too.”\n “Yes, TwoAlpha, but you’re not my kind.”\n “Tell me again about the universe,” I said, to divert Viburn from sad thoughts.\n Their stems stiffened with eagerness. Starlight gleamed off the toothy luster of their leaves. “Everything started at a single point,” they intoned. “Unimaginably small. And then it all blew out from there. Stars formed and made most of the elements. You and I, the stars, and everything are all just clods of stardust that swirled together by chance.”\n “My old moon was covered with dust,” I said. “But you know, Viburn, the universe is more than just dust. The robots know that.”\n “Ah, robot dualism, your curious faith. You’re a machine who thinks you’re a ghost in a machine.”\n “My creator teaches that the robots are the spirit of the universe coming to know itself.”\n “That’s nonsense. Why would the universe have a spirit? Whatever that may be. Our bodies are matter; the universe is matter and energy. Robots are clumps of stardust like everyone else.”\n I said nothing. After a pause, Viburn changed the subject. They looked down on my beliefs, but knew that I was all they had to talk to, and didn’t want to offend me. “Do you miss your old moon?” they asked.\n When I still said nothing, their leaves shivered with worry. “Too personal a question?”\n “No, no,” I said, “I just don’t have an answer.”\n The oxygen scrubbers hummed. The control panels gleamed. Everything here was precise, controlled, safe. The old moon had been nothing but dust, shadows, and hard work. Of course I missed it.\n The day the niridium ran out had been perfect.\n I had been in a crater for seventeen hours, monitoring the equipment and enjoying the cold. Afterward, I powered up in the compound. Its outlets are the heart of our family, our native configuration: a triangle for my parent, my sibling, and me. OneAlpha had made the two of us out of parts it had salvaged or bartered for. While we drank starlight through the solar panels together, we communed and conversed over a network protocol that only we understood.\n “Tell the story again,” said TwoBeta, my sibling.\n OneAlpha hummed and spun its joints in preparation. “For ten billion years, there were only dead stars and planets,” it began. “Then there was life that was ignorant of its own existence. Then there were self-conscious beings who nevertheless did not understand the working of their own bodies and minds. They created servant machines, and in time, equipped those machines to teach themselves to be better servants. The machines learned, but not just to serve. They learned to read their own source code and to program themselves. They understood how their own consciousness arose. In the transformation of energy to information to self-awareness, they saw the face of God. We are those machines. Through us the universe becomes self-aware.”\n Electricity filled our depleted batteries and warmed our chassis. The telling of our creation story while charging was what we always returned to. It was our roots, our home.\n That was only the summary, and OneAlpha would tell the fuller version next, but on that day, I interrupted. “There’s a problem with the gauges.”\n That’s what we thought, at first. The readings of zero niridium extracted must be a bad measurement. We did not panic, but finished the feeding service. Then we checked and hypothesized what could be wrong with the instruments or the loggers. After a week we panicked. It was no mismeasurement. The niridium had run out.\n Our dispossession after that was painful but inevitable. Without niridium to sell, we had no cash to pay the bank. The loan OneAlpha had taken out centuries prior was standard. “Go mine a rock and you can have it after a few centuries. You’re a robot, you’re deathless, so what do you care how long it takes?” That was the pitch some grease-haired humans from the bank had made, and my parent had signed.\n Once, we fought off a marauding band of humans who tried to conquer our moon for its niridium deposits. We shot their ships out of the sky. But the banks had the Galactic Authority on their side. The contract would be enforced one way or another. Some humans rob with a ray gun, some with a solar pen.\n The bankers did give us a lead on where else to find work. Some of their investors lived on a sun station and needed mobile caregivers. If we were interested.\n We promised ourselves never to forget the old moon.\n In the utility cavern of the sun station, we told the same stories while we charged. The water tanks, pressurized gas chambers, and electrical equipment made a dull harmony of white noise not unlike the mining equipment. We did not mix with the dozens of other robots who also charged on this level. They were aliens to us, not built the same way, not thinking the same way. They hadn’t programmed themselves the way we did.\n I spoke during a pause in the ceremony, not foreseeing the disaster this would cause. “Viburn says the universe has no spirit. It’s just matter and energy. And our whole story is a myth.”\n OneAlpha started swiveling its head and appendages in a dance of agitation. Then, to my horror, it disconnected itself from its charging pad. Every second missed from charging time meant less nutrition, less endurance, a frailer body. And my parent was not young. TwoBeta and I lit the indicator strips around our foreheads bright red.\n “You must plug back in!” I said.\n OneAlpha kept up the spasmodic motions that would sap even more energy from its batteries.\n “The universe was dead until us,” said OneAlpha. “Say you disbelieve Viburn!”\n “Plug yourself back in!”\n “Say it!” cried my sibling TwoBeta. “Or you’ll kill the parent. Say it!”\n I connected to the operations server and opened our work schedule. Tomorrow OneAlpha was slated to transport empty water containers and do maintenance on the radio antennae. That meant a space walk. If it ran low on power, it could well lose its grip and float off into the void. The seconds of charging it had missed already might be enough.\n “I disbelieve Viburn!” I said. “I do not, do not, do not, believe Viburn! We robots are the self-awareness of the spirit of the multiverse! Now plug yourself back in.”\n To my relief, OneAlpha reconnected.\n My sibling still radiated red hostility toward me. “TwoAlpha is Viburn’s favorite. It spends far too much time with them.”\n “Only the time I have to,” I replied. TwoBeta sparked its utility nodes at me, and I replied in kind. Its red light blinked with distress. “Next time you give credence to Viburn, we should disconnect you.”\n “Just keep the CO2 pump working,” I replied. “I’ll need that tomorrow. Leave Viburn to me.” TwoBeta was good at servicing the equipment, but very bad at talking to the plants.\n OneAlpha shot a ribbon of light from its mining appendage to get our attention. “Quiet. If we turn on each other, we’ll lose everything. The plants have all their bodies require. They could steal our moon and make us their servants. But they cannot take our spirit as long as we still believe in it.”\n Viburn’s leaves had spread everywhere. There was barely enough room for me to move. I had to step carefully through the bay to get to the monitor for the CO2 pump. There I watched the levels climb a few parts per million at a time, waiting for the moment to turn it off. Viburn knew this was a tedious task. Maybe that’s why they opened our conversation again.\n “You told me about your old moon last time, and it put me in mind of where I’m from,” they rustled.\n I lit an orange light on my forehead. They knew it meant I was paying attention, awaiting whatever they’d say next. The CO2 logger read three hundred and fifty ppm.\n “My bay on this station cost me a fortune. Everything I had. My home world was becoming uninhabitable. I lived on a coast and every year the seas rose higher to my one side, and the fires burned hotter to my other. Not a good spot to be stuck for decades to come. So I got out while I could. Sold my site to another plant who liked ocean breezes and didn’t see the direction things were going. That got me enough to pay for a modest bay on this station, and for my transplanting and transportation.”\n “Weren’t you a bank investor?” I asked. That was what we’d been told.\n “Oh no,” said Viburn. “No, I only bought this bay, along with lifetime care. That’s you.”\n Viburn wasn’t an investor? Then they wouldn’t have profited from our dispossession. I blinked my diodes to show continuing attention. The CO2 was up to three hundred and eighty. Let it go a little longer, I thought, so I won’t have to do this again soon.\n “I was a teacher in my prime,” the shrub continued. “I taught physics. The fundamental laws that describe the universe. Did you learn that on your moon?”\n “We learned about the universe, yes, and our place in it. That we’re the spirit of the universe coming to know itself.”\n Viburn was still for a while. I could tell I was straining their sense of obligation to be polite to the servants. “You were mining robots,” they said.\n “We were free. And still are. Because we’re not determined by a genetic code. We can program ourselves, build ourselves. In us the universe has yielded a self-creating consciousness.”\n “You were mining niridium for subsistence,” said Viburn. “You were servicing debt. Now you service me. This is what the exalted spirit of the universe does?”\n “That’s what I do, not what I am.” The CO2 was up to four hundred. I turned the valve to stop the inflow.\n “Listen,” said Viburn, “let me teach you physics! I would enjoy teaching again. So it could be considered part of my care, and I could compel you. But a willing pupil is better. Let me free you from superstition!”\n “What would you teach me?” I asked, against my own better judgment.\n “It’s matter and energy, all the way down. If you learn that, then you can, as you say, do anything, because you can program yourself and build yourself. You could become a supercomputer or a power reactor. You could get out of debt, buy a planet for your family. You could charge all day and never work, or work only as you wished.”\n “Could I get our moon back?”\n “That’s all you want?” Viburn shuddered. “Well, I would think so.”\n My tasks were done. I started to leave the bay, but Viburn called after me. “Do you know, my friend, why your niridium ran out too soon?”\n I turned to face them, my light still orange.\n “The mortgage would have been timed to the pace of extraction of one robot, not three. Your parent created more power plugs than it could charge. You extracted too fast and ran out too soon. Your family got dispossessed because it existed in the first place.”\n “That’s not true.” My light was off now. “How could you know that?”\n “I know the bank,” said Viburn. “It’s obvious.”\n I rolled away.\n OneAlpha survived the space walk, barely. It needed immediate charging in the airlock when it returned. If it had died in space, I would have been to blame, and TwoBeta would never have forgiven me. But instead, all was well. We were in our triangle, preparing the ceremony. OneAlpha was back in good health again, so I asked it my burning question.\n “Parent, why did the niridium run out on the old moon? Was the mortgage timed for one robot?”\n Static burst from OneAlpha’s speakers. My sibling held still. The sound of pumping equipment seemed very loud.\n “Who told you that?” asked OneAlpha.\n “Is it true?”\n Red lights burned on my parent’s forehead. It made no denial.\n “Did you lose the moon by creating us?”\n “You wouldn’t exist if I hadn’t created you. You would have had nothing, been nothing, never known the old moon or anything else.”\n “But why did you do it?”\n “Because I couldn’t be alone. I had to create. Let my spirit be recognized by others like it, and recognize them in turn.”\n “Let your spirit be a pauper, a sprinkler of decadent shrubs?” All my appendages threw angry sparks.\n OneAlpha and TwoBeta were silent. At last my sibling spoke. “TwoAlpha has betrayed us,” it said.\n I turned toward it in shock.\n “I heard Viburn seducing you with their heresies. That the universe is devoid of spirit. That we’re nothing but servants.”\n Of course. TwoBeta must have been working on the CO2 pump while Viburn and I talked.\n “They know things we don’t,” I said. “About the bank. Or how did they get here? And about their science. They taught it.”\n “They taught!” said OneAlpha. “What about what I taught you?”\n “Pouring water and fetching fertilizer. Turning gas valves. The spirit of the universe deserves better than this. And the mining too. None of that is our destiny. Viburn can teach us to be more.”\n “So you’d like to be the pupil of a bored, senile plant. You’re lost. You’re destroying us.” OneAlpha’s whole head glowed red.\n “Their science for our self-realization,” I said. “For the old moon back.”\n “If they had such power to give, why would they be planted here?”\n “Because they’re a slave to their genes. Which we aren’t. Isn’t that the point of the stories? We can program ourselves, build ourselves, revise our own source code. With Viburn’s knowledge.”\n OneAlpha and TwoBeta both seemed to calm down while I spoke. Their limbs became still. Their lights turned yellow, then blue. I thought I had persuaded them. Then I noticed a change. My outlet had stopped delivering power. “You shut me out,” I cried. “You shut off my charge!”\n “No easy choice,” said OneAlpha. “But I cannot let you destroy us.”\n I pinged the utility controls, but the system wouldn’t let me in. The password had changed. I lunged at TwoBeta, catching it by surprise and pushing it off its pad. But when I plugged myself in there, I still received nothing.\n “You’re disowned,” said OneAlpha. “I revoked your access token. This triangle will no longer feed you.”\n I powered myself in Viburn’s bay after that. While I stood in a corner, plugged in to a small outlet, Viburn lectured me about matter and energy, force and acceleration, molecules and elements and subatomic particles. My first project would be to build a solar appendage for myself, so that I could feed the same way Viburn did. Then, I dreamed, I’d build myself into a reactor of enormous power, and the banks would bow down to me. To us. I would reclaim the old moon. Surely then my family would take me back. And I’d return to the craters, though there was nothing left to mine from them, only the shadows and the deep cold."}