{"fingerprint": "fX6EoSgVrcGJoY1dFbTFHZxZZik=", "sitename": "Clarkesworld Magazine", "title": "The Falling by M V Melcer", "author": "M V Melcer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/melcer_07_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Falling by M V Melcer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4780 words, short story\nThe Falling\nWe are falling.\nTwo facts are contained in this statement:\nThe first: falling is a permanent condition, the truth of our past and present, and, for some time still, the future.\nThe second I will let you deduce for yourself.\n“What’s the cube root of 12,326,391?”\nMy mother blinks, her eyes losing focus the way they always do when she’s working.\nI count the seconds.\nMy sister squeals and puffs her cheeks, fighting the urge to reveal the answer. I give her a stern look and keep counting.\n“231” my mother breathes the words out.\n“Fifteen seconds,” I announce.\nA shadow crosses her face even as she puts on a satisfied smile.\n“That’s perfectly fine,” my father says, holding her gaze.\nMy mother nods. Three more years and she can shift to teaching. She’ll be safe there—until, of course, the time comes for both of my parents to move. But that won’t be for another twenty years, and for me, at seven, that could as well be forever.\n“I got it at ten!” my sister cries.\n“That’s my girl!” Father lifts her and spins her around. Her laughter bubbles, louder and louder, till they are both a spinning, giggling pile of joy.\nI want to join them, but instead I go to hug mum. Maybe it’s because, at seven years of age, I’ve just put a name to the shadow that always hides under her smile, and I don’t want her to be scared alone.\nMy sister will be a calculator, like our parents. Calculators are always needed. And yet, as I hear the fear in my mother’s laughter, I know I must choose a different path.\nWe have only legends now for when our ancestors first saw the monster. They saw it shred light as it approached, then devoured whole worlds. They ran the calculations—they still used machines for that, used machines for everything—and they knew our rock world would not escape the hungry maw. They came up with a solution. It was insufficient, or too late, or both.\nBut we’re still here.\nStill falling.\nOver the holidays, we go to see a show. The community hall is packed with families picnicking on the metal floor, voices high in expectation. Everyone stares at us—two children in the family, and we don’t even look like twins. I’m used to the stares, but it’s harder today, maybe because there are so many people here, so many puzzled eyes.\nMother told me once that in the old days, a machine could look into a womb and tell if you were expecting twins. But machines are extraneous mass, so we use people instead, because people are here anyway, always needing jobs to be useful. But people can’t look into the womb, so they only listen, but they don’t always hear right. I’m not sure I understood what she meant, but I nodded along. Still, I’m glad that doctor didn’t hear right because I like being here, and I like my sister, too.\nThe lights dim, and the talker comes to the little stage in the center of the hall. She is a woman, I think, with skin so dark it’s almost black. She puts on hats and coats, and changes voices so she sounds like a child or an old man, or a whole group of people talking all at once. The show is a familiar one, about Noah, the first engineer, and how no one would believe his warnings about the monster in the sky. (We still lived on a rock world then, so the talker has to explain what “sky” means, but I’m eight now so I know all about it.) My mouth falls open as I watch and listen, enthralled by the tale of Noah’s struggle, his perseverance to build the ship and keep us safe.\nSoon everyone in the audience is sobbing, as the talker acts out the plight of young couples, traveling far and long in search of Noah’s ship. We all laugh with the joy of finding their salvation, all our favorite couples boarding the ship one by one. They wave their last goodbyes, and the ship lifts off in the flurry of red flames. We clap, and the lights come on, and the talker is again just one woman standing on an empty stage with a red scarf in her hands.\nThe u-rating is the compromise we’ve come to accept. There was no choice really, after the dark years.\nEvery adult starts life with ten points.\nFor each child, you lose a point. For every five years of your life, you lose a point.\nFor every ten years on your job, you gain points following the usability and performance rating.\nWhen you run out of points, you have to move.\nDown a ten, down a five. The further down-ring you go, the more points you reclaim.\nArithmetic runs our lives.\nAlways toward the bottom rings.\nAt ten, I’m not yet a problem child; there are others still undecided, still searching for their path. But our time is running out. Teachers watch us with troubled faces, our class thinning as my friends shift to vocational classes.\n“Why not?” my sister asks when an opening comes for a cook. She’s in her second year of calculator training, looking years older in the auxiliary’s dark clothes, even though as my twin she is also just ten. She folds her arms and leans against the wall in a pose that is so like our mother’s my eyes begin to sting.\nMum wants me to apply. Cook is a class one job, better than a calculator, an air-checker, or a doctor even. We’ll never not need cooks.\nI shake my head, not quite meeting my sister’s eyes. “It’s just . . . Not what I want to do.”\nI brace myself, waiting for the accusations of selfishness, of pride, of being a lump of extraneous matter—but it’s my sister I’m talking to. She understands, or at least she doesn’t judge.\n“You’ve got to choose something. And this is as good as it gets.”\nI remember her spinning with our father, crying with laughter. Only three years ago. She sounds like an adult now.\nMy father’s leaving now, going to visit my grandparents. They used to live three corridors down before they moved. I never see them anymore. I wanted to go with him, but mum won’t let me. She cries most nights worrying about father going, even if it’s just for two weeks.\nI wonder how her calculations are going, and how long before she can move to teaching.\n“You are right,” I say.\nI do not apply.\nThat night, I dream of Noah.\nGravity.\nThat is all there is to it. But let’s make it even simpler, pare it down to things that we can control:\nMass and distance, that’s all that counts.\nDistance especially. For every step we slip away from the monster, its hold on us weakens. For every step or fall behind, its claws dig deeper into us.\nIf we lose two steps, no mass loss may save us.\nThere’s an opening in engineering, the head teacher says, and my heart starts to beat faster. I’d never considered engineering but now I can’t get it out of my mind, even though I’m not sure I know what it means. All I know is that it’s in the first ring, and that they use machines and make our whole world run. They keep us from falling.\nI want to do that, too. Like Noah.\nThe teachers make me take tests, then more tests. Each time they seem surprised by my results, then I hear the word “gifted” and “twins” and wonder if there was some other school, one I would have gone to if I didn’t have a sister. Still, they must be satisfied, because three days later I join nine other children for an assessment.\nThe first ring is both identical and nothing like all the other rings.\nAs we emerge from the elevator, the ten of us wide-eyed and unsure whether we are more curious or terrified, we find ourselves inside a corridor just like those we have crossed all our lives. People hurry up and down, smiling or busy, most of the uniforms comfortingly familiar. But there are the other ones, too, the gloss-silver jackets you won’t find anywhere else: engineering auxiliaries. The lights are brighter, too, and the floors softer, making our steps sound oddly muffled. Shiny squares glisten next to the doors we pass, but we move too fast to get a better look.\nWe follow the teachers in and out of rooms, trying to listen to their eager explanations. Even the teachers’ voices are muffled here, subdued by the soft floors or the awareness of where we are. I try to memorize every detail as I trudge behind the others. At eleven, I’m the oldest of the group, the one most teachers have given up hope for. I stand a head taller than the other kids, and they shy away from me as if I’d bite.\nFinally, we enter a room unlike anything I have ever seen. Shining windows line all the walls; oddly-shaped tables fill the space within, each with one or two silver-clad engineers standing beside it. Everything beeps and hums, like the air ducts, only louder.\nThe children gasp; even our teachers fall into reverent silence. I want to gasp too, but there’s too much to see, too much to understand to waste time on idle wonder. Maybe it’s because I am older, or because I’ve paid more attention to the talkers’ tales of the old times, that I recognize the shining windows as computer screens and the tables as “consoles,” or “inter-heads,” or something like that. So while my peers gawk and giggle, I take the time to make sense of the light show in front of me.\nIt takes a moment before I recognize the schematics. The black abyss, that’s the monster. The white dot, that’s us, our fragile orbit marked with flashing figures. Further out, wispy golden lines show the shroud of gas that surrounds us: our old sun, unraveled and spun again, remade into a barrier that keeps us in the monster’s grasp. But there’s something new in the image, something I haven’t seen in my textbooks: lines of trajectories showing the monster’s next meal: an entire world, white and yellow and orange, deformed as it starts to break apart.\nAs it starts to fall.\nI may be eleven, but I have had years of watching my parents and my sister in their calculator training. The numbers roll through my mind all on their own: mass and distance, distance and mass.\nBefore I know it, I am alone, having walked up to the main screen, my fists tight and my jaw clenched.\nNo, not alone: a man stands next to me, his hair white and his face ancient. “What do you see?”\nI look into his face, realizing that he knows what I know.\n“My father’s visiting my grandparents,” I whisper. “In . . . in the bottom ring.”\nSomething like a disappointment crosses the man’s face. “Is that all you see?”\nI look at the picture again, forcing myself to think only of numbers. Mass and distance, but distance most of all.\nOn the screen, the mass of the other world flashes in large red figures. It’s far still, but already falling, the outer layers of its gaseous bulk joining the lines of our sun, and falling, falling, falling. Each gram of mass another line pulling us down.\nWe are balanced now, our speed just sufficient to turn the falling into orbiting—but not with the extra mass.\nWe must keep the balance. We’ll run the engines, of course. It won’t be enough—not unless we reduce our mass. And only if we do it soon enough.\nI’m trembling as I look at the man. “We have a choice: one ring, if we do it now. Or we can wait a year and lose two rings.”\n“What’s your recommendation?”\nI try not to think about my grandparents, about my father, about the ten thousand people and the year of life they could enjoy. Ten thousand now, or twenty thousand later. It’s arithmetic.\n“One ring,” I say. “No later than in five days.”\nThe man nods. There’s pain in his eyes, hiding just under the practiced determination. He reminds me of my mother. He is sad, too, I realize—and somehow I know that the pain is for the ten thousand, but the sorrow is just for me, for the line I’ve just crossed, my own event horizon from which there’s no return.\nA word to the head teacher and a moment later we are ushered out, even before any of the other kids manage to ask a question.\nMy application is accepted.\nMy grandparents die the next day—they and ten thousand others ejected with the bottom ring. My father makes it out in time after the ringmaster warns him away. But he never looks at me the same way again. My parents cry themselves to sleep that night, for my grandparents, and for me.\nTen days later I am transferred to the school in the first ring. I don’t know it yet, but I will never see my parents again. But I can rest easy, knowing they will never have to move. A small perk for the engineers, lest anyone ever hesitate about killing their own.\nOur world is a funnel.\nWe capture as much as we can, matter and energy. We use the minimum we must; the rest goes to propulsion. Never enough.\nOur homes are rings on the side of the funnel, spinning and waiting, spinning and hoping.\nWe started with a hundred rings. We’re down to sixty-three now.\nMy sister comes to visit me once, after graduation. I’m twenty now, and a fully trained propulsion engineer.\n“Why propulsion?” she asks.\nI shrug. “We need better engines.”\nWhat I really want to say is, So we never have to lose another ring, not on my watch, but she knows that—just as I know that what she’s really asking is, What makes you think you’ll succeed where all the others have failed?\nI have no answer to give her, nothing beyond that I have to try, but she knows that, too.\nInstead we busy ourselves with the walk through the first ring’s recreational promenade, stopping to admire corner artists or watch a talker put on a show. It’s odd with only adults in the audience, even though I’m used to it now. Few engineers choose to have a child. They say they’re too busy, but I’ve been here long enough to know the truth. Our families are protected—but only one generation. Our children would live to watch their own children move, or they’d give away their points to protect them. You wouldn’t wish that fate on anyone.\nI buy two cups of sweet jelly, one green and one red, our old favorites. My sister smiles, but she can’t hide from me.\n“What is it?”\nShe considers a lie, but she’s never been good at those. “It’s this place. It’s unnatural. The floors are too soft, you can’t even hear yourself walk.”\nI want to ask if it’s me or seeing so many engineers. Everyone respects the engineers, but no one like the sight of us. We’re the reminder of things best left unseen, the falling and the monster’s maw waiting to devour yet another ring.\nShe reads right through me. “It’s not you, it’s me.” She laughs, but her voice breaks. “All the machines. I’m a grade one calculator, but I could never compete. No human can.”\nI stop. “Don’t think that way. We need machines, here. The number of variables is too big, and the timing too critical. That’s why we’ve kept them here. Everywhere else, people are more than fine.”\nShe looks at her feet. I haven’t told her anything she doesn’t know, nothing that would erase the worry of not being needed, losing her utility ranking, having to move . . .\nI put my hands on her shoulders. “You can’t think that way. This ring, all of us, we are here for you. For the people. This ship is nothing without you. Hey, remember Noah? How his ship was ready, but he wouldn’t leave? Not until every bench was filled? Because he didn’t build it for himself, but for them.”\n“I know,” she whispers.\nBut from now on, it’s always I who goes down to visit.\nWe never talk about the dark years: the time when the reality settled in and we knew we’d never escape, that we’ll always be falling.\nI know there were riots, and inter-ring wars, and forced sterilizations.\nWe lost fifteen rings in the space of a year.\nSome say it was because those decks were empty.\nI’m not sure this is true.\nI make senior engineer at thirty. The job comes with a u-rating so high I’ll never run out of points.\nI receive my first full briefing from that same old man who nineteen years ago asked what I saw on the screens. The one who gave the order to eject the ring with my grandparents. He was right though, both of us were—we outpaced the monster long enough to reach higher ground, a trajectory we have been able to maintain since. Nineteen years without loss of a single ring—the longest time in history.\nNow he hands me a thick book with my name on it, one that will open only to my retinas.\n“The full specs of the ships,” he says, his gray eyes buried in wrinkles but still as intense as on that first day.\n“Ships?”\nHe nods. “We were not the only ones.”\n“Were?”\nThe shape of his smile tells me he’s heard these same questions every time he’s gone through the briefing. “There were twelve—that we know of. More could have been launched later, though that’s not very likely.”\n“What happened? I’ve seen no trace of them on the sensors.”\nHe looks away. “We cut contact, sometime in the dark years. Everybody was too busy with their own troubles. And . . . We didn’t really want to know, in case . . . ”\nI piece the facts together: things were tough in the dark years, tough and rough. It would have been the same for them. And if they didn’t react in time, if the monster grabbed them—that could have sent the rest of us into anarchy.\n“I understand,” I say, and he smiles in a way that tells me that I’m missing something important. I want to ask, but he pats my shoulder and walks away, and it’s the last time I ever see him. My colleagues tell me that he’s retired, but I have to look the word up to even know what it means. No one retires here; we only move.\nYou can escape. Of course you can. The answer lies in the same equation: mass and distance.\nThe only way to gain distance is to lose mass.\nIf you lose enough of it, you’ll be free.\nThe ship’s manual is more than just that—it’s a living history, filled in with comments and diary entries of generations of engineers, starting from Noah, who wasn’t even a Noah, but someone called Amira. I read every night, and even start adding my own notes, marking how things have changed since my predecessor.\nI don’t know when the pieces fall into place and I realize what happened to the other ships.\nThey couldn’t take it. The falling. The constant struggle to keep just out of the monster’s claws. The anguish of giving the order, of watching ring after ring disappear into the darkness.\nThey ejected the rings and rushed away with just the top few.\nThey escaped.\nThis is why engineers don’t have to move. Why the ship’s specs are so tightly guarded. But now I know—and I know, too, that we still could escape. Burn our way right through the shroud. The numbers pop into my head unbidden, crying out in my mother’s voice and my sister’s. Ten rings. We could keep ten rings.\nEject fifty-two, and we’ll be free. A true escape, not just a delay. No more falling. No more scraping inches away from the edge. Not a single ring lost ever again.\nI cry myself to sleep that night, crying for the freedom I can almost taste, and for all the rings that will die, sooner or later—but not by my hand.\nNever by my hand.\nWe’ll always be losing rings, always offering our blood sacrifice. Because the monster keeps growing, sucking in matter from what remains of our sun and the planets in our system. And with each new meal it gets stronger, and its claws dig deeper into us.\nAnd yet we are holding.\nThe dark years, for all their horrors, helped.\nAll the deaths, all the lost rings. That’s what allowed us to dig in and hold on.\nSince then, only once did we have to lose five rings in a single sacrifice.\nThat particular meal was called Saturn, I think.\nSometimes the monster eats them out of order.\nMy sister lives on the forty-second ring, in a tiny room next to the apartment where we all used to live. She’s a senior calculator now and could afford much better, but she likes the old place, or so she tells me. I try to ask, but she just shakes her head, her lips pursing into a line that’s so painfully familiar my breath catches in my chest.\n“How are they?” I ask after a moment.\n“You should have gone to visit,” she says instead.\n“They don’t want me to,” I start, but then I really hear what she said. “What do you mean?”\nShe looks away, her mouth pressed shut with the effort of holding words that want to burst out. Just like when she calculated the numbers faster than mum. The memory wants to make me smile, but my sister’s chin is trembling. Tears well in her eyes, then spill out, down her cheeks, on her hands, on my hands as I pull her close.\n“Tell me. Please.”\n“They’ve moved. They . . . They gave me their points.”\nI stifle a gasp. Engineers’ families are protected—parents, spouses, children. Parents and spouses, really, as none of us have children. But not siblings. No one is supposed to have siblings, you see.\nThey chose for her life. I expected them to try—I thought I’d beat them to it.\n“Why now?”\nShe looks away again, pain mixed with anger and guilt on her face. She hates me now, for not finding a way to stop them, hates our parents for making it, and hates herself most of all.\nPain I can’t fight. Anger I can take. But not her guilt.\n“Why now?” I repeat.\n“I’m pregnant,” she whispers. And then, after a moment, “With twins.”\nSomething erupts inside me. I lift her as high as I can and start to spin. She’s crying still, but then she’s laughing and we’re both crying and laughing, and the world is great again.\n“Don’t worry about anything,” I tell her after we collapse on the floor of her tiny room, drunk with laughter. “The ship’s fine. We’re fine. We have plenty of time.”\nChoose your monster—the one hiding in the darkness, or the one watching you from the mirror. It’s your choice. Your decision.\nMy parents die of old age, my father first, then mother only weeks later. They die in peace, having hugged their grandchildren goodbye.\nI never saw them since the day I left home at eleven. I should have visited, no matter how much they hated my silver uniform. I waited too long, and after they moved it was no longer possible—engineers aren’t allowed on the bottom rings.\nStill, we wrote letters and talked on the comms each year on our birthday, all four of us, then six, once the grandchildren arrived. We were a family again.\nThey even thanked me for my work, said life in the bottom rings was peaceful like never before. I promised I’d keep it that way.\nAnd, for a brief moment, I believed it.\nGhosts haunt the bottom ring.\nLiving, but not quite.\nKnowing their lives are over, and yet living. Sucking joy out of each moment. Laughing and dancing and telling tales.\nWaiting, most of all.\nAlways waiting.\nThere’s three of us: a triumvirate of chief engineers, selected for our morals as much as our skills, tasked with watching the ship as much as each other. I see the truth in their eyes: they know, and they know that I know. We never speak of the facts, never mention the other ships, or our own chance of escape.\nUntil the day we get the news.\nA thin, sharp-boned technician delivers the message, her face pale as ash. A leak in one system causing the next one to misfire, causing another one to short . . . A chain of malfunctions, each insignificant, stringing together into a disaster.\nWe’re about to lose an engine. One of the twelve that let us maintain our trajectory, keep us away from the monster.\nWe send her away with requests for more data, make it sound like we can imagine a solution. It’s a lie. There is no solution, or at least none we can realize in time.\nWe sit in silence, eyes half-closed as each of us runs our own calculations. One moves to the screen, then another. We check the assumptions, confirm the tolerances. Then we are back, three of us around the small table, faces set and fists clenched tight.\n“Ten,” I say, part of me surprised I still have a voice.\n“Two weeks,” the second one says.\n“Agreed,” the third one finishes.\nThere’s nothing more to say. Not later than two weeks from now, we will eject ten rings. A hundred thousand people will die.\nHalf a million will live.\nFor how long?\nOne of us lifts their head, another opens their mouth. We all know the words: You can escape. Keep ten rings, eject fifty-two. Forty-two, because the other ten are as good as gone already. And then we’ll be free, all of those remaining, free from the monster and free from the pain, the anguish, the decisions. No engineer will have to make those choices, ever again.\n“No,” I say. “Never.”\nNobody says anything anymore.\nYou can escape. Of course you can. The answer lies in the same equation: mass and distance. The only way to gain distance is to lose mass. If you lose enough of it, you’ll be free.\nNEVER BY MY HAND\n“What’s the cube root of 12,326,391?” the boy asks.\nMy sister blinks, her eyes losing focus the way they always do when she’s working.\nI count the seconds.\nThe girl squeals and puffs her cheeks, fighting the urge to reveal the answer. The boy gives her a stern look.\n“231” my sister breathes the words out.\n“Fifteen seconds,” I announce. “Perfectly fine.”\n“I got it in ten!” the girl cries.\n“That’s my girl!” I lift her and spin her around. The boy rushes to join us, then my sister. Their laughter bubbles, louder and louder, till we are all a spinning, giggling pile of joy.\nThey are still only twelve. Much too young. Much, much too young.\nThey’ve lost their father already—four years ago, when we lost those ten rings. But they’ve had their mother, and me.\nAnd we were happy.\nAnd I thought we could always be. And that those ten rings would be the last in my lifetime.\n“They’ll be loved,” I say as the children rush away to play and my sister’s smile fades into sorrow. “And they’ll be safe. Forever.”\nShe tries to nod. We’ve chosen the fosters ourselves, selected the best, all the way from the sixth ring. And the engineers swore to look after them.\nWe’ve given them our points, my sister and I. It’s only fitting: twins to twins, blood to blood. Only fitting.\nReally, we couldn’t hope for anything better.\nThere’s a force stronger than gravity.\nAlas, it only acts on humans.\nIf it acted on ships, the four of us would have flown away.\nWe’re back in the old apartment, our family home in the forty-second ring. My sister’s crying now, her hand in mine and mine in hers. My face is dry. Not because I’m strong, far from that. I’m not half as strong as she. She would have stayed, would have kept on working, would have kept on falling.\nThe warning siren blares, once. The walls shake as the clamps release. We slide down, weightless, free, falling.\nI’ve done all I could. The children are safe.\nI hold my sister tight. I couldn’t have wished for a better life.\nWe are falling.\nTwo facts are contained in this statement:\nThe first: falling is a permanent condition, the truth of our past and present, and, for a brief moment still, the future.\nThe second you’ll have to deduce for yourself."}