{"fingerprint": "+on/ho7+TrDYYKwHVj5OUhLDnk8=", "sitename": "Clarkesworld Magazine", "title": "In a Carapace of Light: A Conversation with China Mieville by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mieville_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In a Carapace of Light: A Conversation with China Mieville by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n In a Carapace of Light: A Conversation with China Miéville\n Intense, immersive, and startling, China Miéville's novels have done more than won many major awards—they've helped change the face of speculative fiction. The English-born fantasist attended Cambridge University, earned a Ph.D. from the London School of Economics, and has taught at Harvard University. He's the author of the Bas-Lag series, which comprises Perdido Street Station, The Scar, and Iron Council. His standalone novels include King Rat, Un Lun Dun, The City & the City, Kraken, Embassytown, and the recent Railsea, his second Young Adult novel.\n Set on a train in a world of railways and wastelands, Railsea maintains a constant, pressure-cooker tension between the vast outside world and the claustrophobic interior. \"This is the story of a bloodstained boy,\" writes Miéville in the book's prologue; that boy, Sham ap Soorap, is an idealistic young doctor's assistant who sets out on his first hunt, traveling on the moletrain Medes in search of the giant moles called Moldywarpes. With parallels to (and subversions of) Herman Melville's Moby-Dick, Railsea is perhaps Miéville's tightest novel in terms of plot, but it's still suitably sprawling.\n Something of a traveler himself, Miéville spoke with Clarkesworld about his writing process, his fidelity to the notion of planning, and how books can be methods of transportation.\n Do you get much time to write while you travel?\n No, no. I write in very intensive chunks at various times. I am not someone who is very good at writing a certain amounts every day. I know that's what one is told one should do, but what I tend to do is kind of sequester myself away while I am in London for a few weeks at a time and become very antisocial and write very, very intensively over a relatively short time. I am much more of a burst writer than a steady-state writer.\n Is there ever any anxiety between bursts that the words won't come next time you sit down to write?\n Not exactly. I wouldn't say \"anxiety.\" I don't tend to doubt that I will be able to think of things to write, but there can be a kind of low-level dread, because especially the early stages are quite hard. So I don't have that existential dread so much of, \"Oh my God, I am never going to be able to write another book,\" but I do have that sense of this is going to be hard work, which is fine, that's appropriate, but especially early on in a project. Once you've built up a certain amount of momentum, it rolls much more swiftly and is much easier to continue, so my heart needs a certain amount of bolstering early on in a project. That's the definitely the case.\n Does the writing that you do early on in the burst every need to be scrapped?\n Absolutely. I'm ruthless with early drafts, as one has to be. As the general rule, although I am getting better about it, but as a general rule I write long first and then end up doing quite a lot of cutting. More and more as I get older and as I change as a writer, so what tends to happen is the first draft tends to be quite long and maybe quite flabby, then I'll trim that down. There can be occasions when it's very difficult because there are some sections that you really want to keep in, but, at the same time, you know that you probably ought to get rid of that bit. Sometimes, you have to be quite ruthless with yourself. But there is no question that I end up getting rid of quite a lot of stuff.\n There is no easy read between the way things are written and what works. Sometimes, things that are written in a very exhausted, overnight state that you would think would be among the most kind of scrappy and worse stuff is actually some of the stuff that works best. You can't narrowly says, \"Okay, these five days because I was in such and such state, I probably will not use any of that.\" You just never quite know.\n How do you know when it works?\n Well... sometimes you don't. This is where you need to try and minimize your own ego and have friends you trust and editors who are prepared to look over stuff. But I think you can train yourself into a certain kind of rigor about your own work. There are all sorts of little tricks. You'll often hear writers say that one of things you have to do is to read things out loud and that can be really helpful. You have to sort of read it as ruthlessly as possible and always with the possibility in your mind that you're wrong. That's why you really do need outside, especially on the second and third draft, you really do need outside people to come and give you thoughts about this. The short answer, I guess, that you don't always know. You don't. There are ways of getting closer to it, and I think the two key things are to try to have as much humility as you can in the sense of being aware that your own stuff might not work and of trusting certain people with earlier drafts that you wouldn't want anyone else to look at.\n Do you have a sense of where the story is going from the beginning, or is it a process of discovery?\n No, I tend to be very much a planner. I mean obviously details veer in the telling all the time, that's clearly the case, but in terms of the broad architecture of a book I plot carefully and if things start to veer halfway through, I tend to stop and either pull them back on course, or if I realize they are going in a better direction, I extrapolate and work out what effect this is going to have further down. I am not one of these writers who is able to enjoy flying by the sit of my pants. And there's no value judgment there, incidentally. I am very well aware that some absolutely fantastic, wonderful writers do that. For me, no, I cannot do it. I have to plan quite meticulously, so often the first several weeks of a book, writing will consist of me grumpily chewing over notebooks and scribbling notes and that kind of thing and not actually putting pen to paper at all other than vague and incomprehensible notes to myself.\n Were there any veering moments in the writing of Railsea?\n Yes, absolutely. The ending changed quite a lot a couple of times. Again, what happen is I get halfway down and then I suddenly think, \"Hang on a minute, this going in a different direction,\" and I stop, and I tinker, and I do some more plotting, and I say, \"Well, if I do that, then I am going to do this, and that's going to mean that, and so on.\" And I extrapolate it down. That did happen with Railsea not just the ending, certain details got added. Some things you can add without making a huge difference to the structure of a book, and other things break the structure much more. In a way, what you dread is suddenly realizing something that will make the book much better, but which will necessitate quite a big structural revisions because then you really ought to do it, but you know that it's going to be a lot of work. I had a couple of those. You get them with all books. There was nothing unusual about Railsea in the sense that there was no more or less than usual. I think that it would be very rare that it stuck completely, rigorously to the plan all the way through. It's not a question of fidelity to the plan as I have written it at the beginning, so much as a fidelity to the notion of planning.\n Did I read somewhere that you wanted to do a book in every genre?\n What happened there was that that was a throwaway comment I made in an interview some years ago, which as you know the Internet has a tremendous capacity to never forget anything. People have been asking me about that ever since, but what happened was, and this again is not that uncommon, as I said that's a kind of throwaway line and then people kept saying back to me. The more I thought about it the more I thought, \"Yeah, that's a really good idea. I should probably do that.\" It was an off-the-cuff thing, but it's an off-the-cuff thing that has a certain truth and resonance.\n The thing is I am really very, very interested in genres. I find genres fascinating. I'm very interested in the way they work and the way they put things together. That includes genres that I don't have any strong tradition with, genres that I have to come in from the outside and learn how they work. I don't have a checklist in my pocket and I'm not going to rush it through. Especially those genres that I don't know so much about... when I wrote Iron Council, I took quite a lot of time to read a lot of Westerns and work out how the Western works. Genres like Regency Romances that I have read, but I am not steeped in, I do like the idea of taking some time and taking them apart and working out how they work. And I thing that that idea of slowly over the course of career travelling through these different traditions and trying to be respectful to them but also do something, bring your own stuff to that table, I think is a really exciting idea.\n Your fondness for the notion of planning seems to be very similar to your fondness for genre. The plan is there, then you deviate from it, or you don't.\n It's an interesting formulation. At a conscious level I cannot say that I am fond of planning. I would say it's more a question of my psychological model requiring planning. I take neither pleasure nor displeasure from plans. I just need them to proceed. Whereas with the genres, I take a lot of pleasure with the genres and in the way they work and their protocols and so on.\n But I think you are probably onto something in the sense that I tend to be quite a structured thinker. I tend to find structures very useful in ways in terms of organizing my thoughts and the things I do and so on. That clearly has some ramifications in both those fields. It's not something that would have occurred to me, but I wouldn't say you're wrong, you're probably onto something.\n Do you ever experiment with not being structured at any point in the process? Does being structured become a limitation, or is it always a strength?\n I think it varies writer to writer. There are certainly writers for whom being overly structured would not be a strength at all. I don't doubt that one could probably make a strong claim that some of the things... The people that don't like my stuff might say that some of the problem with it stem from this kind of care, some would say neurosis, about this sort of planning. It's very difficult to say because it's so kind of integral to my mental model that thinking outside of it is to kind of think in terms of a different me. I have on a couple of occasions tried writing things which don't have a structure and don't have a plan in mind. What I can do, I think, reasonably well, I think I can write good sort of very short, mood pieces, maybe a page long. These are not plot things. These are almost sort of prose poems. Those, I think, work very well, for me anyway. I like both. That can kind of tap into certain intensity, but for anything that's longer that has a narrative, I just get a bit lost without a plan.\n It's also the case that having a plan and a structure does not negate the intensity. I think sometimes there is an anxiety that if you plan too much you will end up with something quite bloodless and that doesn't feel urgent. I am sure that may be true for some people. I don't feel it to myself at all. They're two separate axes. I can very, very rigorously plan something over a couple of weeks and then I actually sit down to write it, I am rushing with that kind of buzz, that sort of high, just as much as if it had just spilled out of the pen there and then.\n What is the secret to capturing mood so intensely?\n I don't know. This is the kind of thing that writers agonize over for centuries. I suspect that it's something to do with a relatively unmediated sense presence. All these things that you do when you are trying to write something that's very evocative of scene and you kind of sit back and close your eyes, you know it may look a bit ridiculous sometimes, but it's perfectly reasonable thing to do. Writing and invoking images and that sort of thing are... You know, there is no division between the mind and the body, they are bodily acts. Putting yourself into a state of mind where you are very reflective of those moments may very well involve putting your body in certain place. This is why some writers write very brilliantly on drugs, which I don't as it happens, it's not my interest.\n Certainly, a certain kind of very repetitive music, and a certain kind of close intensity can be very evocative. For me, I find often the most powerful writing that I think I do in terms of that moment, that kind of presence in a moment, is often very late at night when very few other people are awake and I am looking out of the window. I always work looking out the window. I am not someone who has my desk facing a wall. I am looking at the city and the lights are on in the windows. There is this great sense of being in a carapace of light. That sort of strangely dream-like moment, I think what you are trying to do when you get that kind of intensity is that you are trying to translate a sense that is basically like a dream in a waking moment. Anything you can do physically or mentally that gets you closer to that experience is probably good.\n Is it harder in a non-urban setting to get into this state of mind?\n I wouldn't want to generalize it. I tend to get into it in an urban setting. That's probably because I tend to be in an urban setting. I know perfectly well that some people find being in the wilderness, being in the woods, intensely hypnotic, hallucinatory, and intense. Certainly, I have written things that I love and that I think do touch that not in urban setting. I wouldn't want to generalize that. It is the case, as I say, that I tend to do it in an urban setting, but that says more about me and about the projects that I'm interested in than it says about the countryside versus the city in general.\n Railsea is your second young adult novel. What does this category require of you? Does it challenge you in different ways than, say, a more intricate book like Embassytown?\n I don't like the category of young adult very much. I think it's not terribly helpful. It's basically a marketing category. I am not having a go at marketers here. I work with marketers. They have to do their job. I understand that. These categories may be useful in marketing terms, but what it's not, I think, is a psychological category or an aesthetic category or philosophical category or anything like that. It's not my job to worry about marketing, so for that reason, I don't particularly set much store by the category of Young Adult.\n I am very aware that when I read books as a child—I would say as a child, not as a young adult--there was a different kind of intensity that I fell into. No matter how much I love a book now, I don't read it in the same way, with that same kind of absolutely compulsive inhabiting of the book in a way that I did when I was a kid. And then there's a shift. I think what Young Adult tends to mean is this blurry line, a very, very, very blurry line between that and \"adult\" book. I think essentially for me it's simply question of not worrying about it. I don't really care. What I always do, and I think probably a lot of writers would say this, you're writing for yourself and you're writing for yourself at a particular time in your life. Quite early on when I was planning Railsea, I realized that I was writing for my own, I would say roughly twelve-ish, maybe thirteen-year-old self. That doesn't preclude reading it also when I am older, and it doesn't preclude reading it when I am younger. But that was who I think I had in mind when I was doing the writing.\n What does it mean? For me, it's a question of the kind of voice that transports and transported me when I was that age, which doesn't mean dumbing down or anything like that. You don't have to do those at all. For me, because of the kind of books that I loved, it means a certain kind of relationship to language, a certain more kind of overtly playful relationships. I use things like punts, which I wouldn't tend to use in a book written for an older me. It means a certain kind of playfulness about the structure and shape of the novel, so that the whole book is predicated on a silly joke about Moby-Dick. It's a joke that's hopefully kind of fun, but it's the kind of thing that I wouldn't feel secure writing with my thirty-year-old in mind.\n That doesn't mean that my thirty-year-old self wouldn't read it and enjoy it, it just means that's not who I am writing for in that moment. Different writers can do this very differently. For me, things like those jokes, those puns, that kind of playfulness about language tend to be the kind of things that get freed up. I keep repeating the word playfulness because that's the fundamental difference that I am aware of. I know when my British publisher has published this book, and they haven't called it a YA novel, it's a \"story for readers of all ages.\" On one hand, that's obviously a piece of marketing because they don't want anyone to feel they shouldn't buy it. And I am grateful to them for that, but I do honestly much prefer that as a description because that's how it feels in my head. It feels like Un Lun Dun. I know some adults read and enjoyed Un Lun Dun. I am delighted by that. We can all read and enjoy books for younger readers. But that felt very much like a book for younger readers for me. Railsea feels more like a book is written for \"readers of all ages.\"\n Is there anything that you read now or any particular writer now who gives you a taste of that compulsive inhabiting of a book like you experienced when you were younger? I keep thinking of drug-users trying to recapture that first high. Can we get that back? Can we still find that buzz?\n Some people may be able to. I suspect not. I suspect that that particular kind of buzz is absolutely, fundamentally a function of reading as a young reader who doesn't have a lot of, relatively speaking, a lot of reading under their belt and who doesn't have a lot of life under their belt. But again, that doesn't mean that you don't feel a trace all the time. I think we do feel a trace of it. It's one of the many things that we're constantly hankering for. If there are readers who really do fall into books in the same way they did when they were eight, then I am envious of them. You also have certain new things when you read as an adult. It's not all a loss. You gain some things, too. One of the things you gain as an adult is that every book you read, you are reading it through a matrix, through the kind of warp and weft of all the other books you've read and that number grows and grows and grows, so every book becomes more and more entangledly intertextual. That's a lovely thing. You lose and you gain. There is definitely a melancholy to it, I freely admit that, but melancholy is not the worst thing. That hankering itself gives you a certain drive to read, which is good.\n Are there any books that you inhabited when you were younger that changed you in a significant way? Books that you keep visiting in your mind?\n Oh my god, so many! Absolutely heaps, and often when I am asked to list them, one forgets them because they are so close up. It's like that thing when you look for your glasses, and you are wearing them. The paradox is a lot of the books that are most embedded in me are books that I sometimes forget to mention, which is a terrible injustice. The short answer is yes, loads. I mean there is no hard division between children's books and adult books. I would say book that did that for me, hugely, was The Anubis Gates by Tim Powers, which is not a children's book. It's an adult book, but I read it when I was probably eleven. It absolutely took up residence in my head. It's one of the key texts in my head.\n What was it about The Anubis Gates that captured you?\n It's always very difficult to sort of explain one's affective reaction. I love the intricacy—and I get back to your structure point, although I wasn't aware of it at the time—I loved the intricacy of the time-travel narrative. I love the way that it appeared to be exploding into this chaos, but then everything came together with this extraordinary neatness, this extraordinary kind of clicking into place. I thought that was beautiful. I loved the monsters. I loved the time-shifting visions of London. It's magic, but it's systematized magic. I passionately love that book. It's difficult for me to host back there and explain why, but that's a kind of groping towards it.\n Lastly, what are you working on now?\n I am doing a novel, which I will not say too much about because I am always very superstitious about talking about work in progress. I am very much looking forward to doing some more short stories. I love writing short stories, although I am not a very quick writer. I write one every so often, but I love them when I do. I'd also like to do some more nonfiction, which I haven't done for a while. I really enjoy writing nonfiction. Other than that, I am doing a regular comic now for DC [Dial H For Hero]. That is something I would love to keep doing. That kind of depends on people continuing to buy and read it.\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}