{"fingerprint": "MDPcR7NeKfAgkZIsghyKgsF+tzw=", "sitename": "Clarkesworld Magazine", "title": "The Ways Out by Sam J. Miller", "author": "Sam J Miller", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/miller_06_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Ways Out by Sam J. Miller", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5870 words, short story\n The Ways Out\n Surveillance Clip S643/R57.D001 [File Uploaded]Human Agent Summary\n When the boys arrive, Subject 643 stops skating and sits down on her board. Five of them, in her age range (ten to twelve). Facial scans confirm they have not yet given any cause for suspicion of potential strategic interest to the state. Subject shows clear anxiety at their presence. Debates departing. Decides attempting to exit would result in the unwanted attention from them that she hopes to avoid; remains.\n [Within these reports, S643 will hereafter be referred to as S1.]\n She is tall for her age. Thin. Her hair a modest Afro. Unclear if torn jeans the product of poverty or a fashion decision. Scabs on knees indicate that S1 is a skateboarding novice. The park where she sits is mostly pavement. A nook between two buildings, where curved benches attract bladers and boarders and taggers. She scratches at the clear polylactic coating on every surface. Graffiti-proof thermoplastic, but low quality, like everything in the non-pivotal municipalities, giving the park a pockmarked rotting quality.\n Six and a half minutes after their arrival, the boys begin to taunt her. Dialogue indistinguishable at this distance. Almost certainly the same handful of predictable insults. Girls don’t skateboard, go the fuck home, etc. Software determines no need to move closer, or jump the mic on one of their phones or wearables.\n Subject 114 of Region 57 approaches. Nineteen; also tall for his age; flagged for surveillance at age seven following foster care incidents; probability of fire aptitude. Head shaved since last logged surveillance clip. Same T-shirt. Software demands an agent position shift, and mic jump. Agent moves car down the block. Submits retroactive warrant application. Rationale: non-authorized gathering of multiple variant individuals (adolescent).\n [Within these reports, S114 will hereafter be referred to as S2.]\n S2 towers over the other boys. The five fall silent.\n [Utterances captured through S2 cell phone mic]\n “Hey, Hector,” one boy says. Awe all over his face.\n “You little assholes don’t have anyone else to bother?”\n They stare. Slack-jawed; perplexed.\n “Why do you think it is, that you need to make fun of girls? What do you think that says about you?”\n “She can’t skate,” one says, the one who recognized S2.\n “Your ass can’t skate. And that’s why you need to make other people feel like nothing.” His voice drops; his eyes narrow. “Because nothing is exactly what you are.”\n S1 tries to hide her smile. Soon the boys depart, chastened.\n “I’m Hector,” S2 says.\n “Ryx,” S1 says.\n “Show me what you can do with that thing, Ryx.”\n S1 stands, nods, steps onto her board. Starts a slow circle. Heel kick.\n S2 claps. His hands are huge and it sounds like earthquakes.\n Surveillance Clips S643/R57.D002-D006 [File Uploaded]Human Agent Summary\n S1 and S2 meet up often. This is not cause for concern. There is no evidence of aptitude recognition, or intent to display or develop aptitudes, or premeditated gathering. In a city like this, where the cops have cracked down on most street and sidewalk skating, the spots where boarders can safely go are few. The old harbor, the fallen cathedral, the foundation pit where the hotel or mall was going to be.\n He teaches her tricks. Jesus Flip, Daydream Flip, Nightmare Flip. No Comply. Sex Change, 540, Ghetto Bird. Gazelle Spin.\n “You learn fast!” he says, laughing with delight. “Like, scary fast. How do you do that?”\n She shrugs. She smiles. The smile does not last long. She is forever looking into the distance, staring down one street and then another. Like she’s waiting for something to come, something awful. Something whose shape she won’t know until she sees it.\n He scares her bullies away. He takes her places she’d be afraid to go on her own.\n What does he get out of it? Cross reference of his case file shows no siblings, no lost little sister whose absence S1 softens.\n Day six: outside a coffee shop, across from the bronze horseman statue choked with thick vines from that time six years ago when a woman with a plant aptitude went into a summoning fugue that did not stop until she was gunned down. The parking lot is a slaughtered forest: a thousand incongruous species of tree and grass and flower and shrub, deadened by municipal defoliant. S2 says: “Look.”\n A man sits on the sidewalk. His mouth is open. His beard is wild and twisted and studded with rubble. Around his neck is a psionic surge shock collar. An old model, court-mandated, removable only upon a judge’s order. Heavy; filth-crusted. He looks up at them and tries to smile.\n Hector S2 looks away in fear and pity. Ryx S1 stares, her eyes hardening. Then they turn. Their eyes lock. Their shared expression—not quite a smile, not quite a suppressed shriek—confirms that each knows very well what the other is.\n Surveillance Clip S643/R57.D015 [File Uploaded]Human Agent Summary\n S1’s home life offers no evidence of aptitude display. No record of any aunt or grandmother with a knack for taking memories or shaping clouds. Mother missing; father overworked; cousins and neighborhood children uncomfortable around her. Principals perplexed. Authorities alerted. A banal, familiar pattern.\n S2’s family tree is full of unwholesome fruit. Habitual, cultivated aptitudes are everywhere. Unrepentant mind turners and metal summoners, deploying their aptitudes in a wide array of criminal endeavors. Men and women in jail, general population or special facilities with cells of wood or rubber or underground ice. Uncles on the run. His mother a confirmed shifter, presently believed to be living as a stout blond Alaskan crab boatman. Against this backdrop, S2’s modest and mostly-accidental displays seem harmless, pathetic. Unworthy of surveillance.\n On the outside wall of the Firestone Hotel, on an HD paint screen six stories tall, the season finale of Psion Prime America is playing. A cool summer night; the crowd on the steeply-sloping lawn is immense. My Agent’s screen pings a hundred different known aptitude possessors, and twice that number of people flagged for probability.\n S1’s eyes are wide. She has never looked so much like the ten-year-old that she is.\n In split screen, the finalists duel. A leather-draped thirteen-year-old Black girl moves her hands and water spirals around her. Cameras zoom in to catch the fractal detail, the eerie patterns that shift and swell. A chubby bearded child smiles and spreads his arms. Fire forms between them. The fire becomes faces, figures.\n “Why is this even allowed?” S1 asks, her face flushed, at the commercial break. “They talk so much about how we’re a menace. How we need to be . . . I don’t know. Registered. Rounded up. All those things they say.”\n “Why do you think?” S2 says. He hands her his bag of popcorn. She shrugs. “Think about it.”\n After a long time, and with a certain sadness, she says “So they know who we are.”\n “That’s part of it.”\n He waits. The break ends. Clips play, the finalists’ highlights from the whole season. Water and fire, at war, in love.\n “So we won’t know how much they hate us,” he says. “So everyone will see how well they treat us.”\n Her fists tighten.\n “You talk about your dad a lot,” S2 says, carefully, like something he’d been mulling over how to mention. “What about your mom? If you don’t mind my asking.”\n “Gone,” she says. “Couple years back.”\n “I’m sorry.”\n “Don’t be. My mom watches out for me.”\n He nods.\n “I know it sounds stupid. Like the thing everybody says, when they’ve been abandoned. But it’s true. I know it. I feel it. She . . . senses me. No matter where I am. Where she is.”\n “We should find her,” S2 says.\n The winner is the one who S1 was rooting for. On the screen she makes monsters, fearsome beasts made of water, who fight and then embrace and become one. S1 stands, howls. S2 buys her popcorn. A fellow fangirl on the grass not far from them calls out: “And she’s from a non-pivotal region, just like us!”\n “The feds might have forgotten about us,” someone else says. “But there’s a hell of a lot of us out here, and we can do some pretty amazing shit.”\n Drunks and teenagers debate the pros and cons of the Tourniquet; of targeted austerity and the so-called law-and-order states. S1 does not appear to grasp much of it, but she listens hard.\n When it’s over, and most of the crowd has gone, they practice the tricks he has taught her. Sigma Flip; Gingersnap; Nuclear Grab. A line of skater boys watches. All five of the ones who made fun of her earlier are there. Their mouths are open, but they have nothing to say.\n Surveillance Clip S643/R57.D018 [File Uploaded]Human Agent Summary\n \n The girl is good.\n \n S1 is a fast learner, seeming to suck up skill through osmosis. When S2 does jump tricks, he has this slight upward tilt to his hands. Utterly idiosyncratic; no one else does this. But S1 does. S2’s eyebrows unite in perplexed happiness.\n They are hard to track, now. They move fast from spot to spot. Like they are looking for someone, or several someones. Difficult to follow unobtrusively. They say little. Mic jumps yield nothing but background noise and skateboard wheels spinning. Cross reference of their geocache tracks to known routes of illegal activity among variant individuals shows minimal overlap.\n There are no files on her mother. This is unusual enough to be a cause of some concern. Cooperation requests submitted to partner agencies in several allied nations tasked with tracking variant individuals.\n “I’m hungry,” she says, her voice full of frustration. You can hear how her feet hurt, how her bruised body protests. Twilight deepens. They are way out, tonight. The freeway is a dull roar at the horizon. Past that there is nothing, nothing but nature. She frowns at where the sun set. Other cities lie in that direction. Other countries. She wonders, maybe, whether it’s different, there. For people like her.\n “Got any money?”\n “Two dollars.”\n “I’ve got seventy-five cents,” he says.\n “That’s not very much.”\n He watches her. He waits. Finally, he says “If we had fifty more cents, we could each get a slice of pizza and a soda.”\n “Uh huh,” she says. She sits down on her skateboard. Pouts. “And if we had a hundred more dollars we could each get a damn mani-pedi.”\n “You’re awful young to be so cynical,” says S2, dropping to kneel beside her. “How’d you get like that?”\n She shrugs.\n “Don’t focus on what we don’t have,” he says, and there is something in his voice, something she can hear, something that might even show up on the recording. An urgency, a rawness, a frankness. Maybe something more. Something variant. “Focus on what we have. And what we need. There’s a solution, here.”\n She frowns. Crosses her arms across her chest.\n “What if I told you there were nickels, all over this parking lot?”\n “I’m not going on a damn Easter egg hunt for some invisible coins that probably aren’t even there.”\n “They’re there,” he said. “I see two, right over there.”\n She looks where he points. “Couple of cans,” she mutters, and then smiles. Her face opens, comes alive. “Cans! We can pick up cans and bottles and redeem them at the supermarket!”\n His hands clap.\n S2 finds a tattered plastic bag. S1 picks up their first two cans. Back on their boards, they hurry on in search of more.\n They are children. Whatever else they are.\n They pass between rows of jagged jutting spikes of pavement. Some are five stories high. An event record check turns up nothing, which might mean unrecorded gang activity—a battle between people with earth aptitudes, perhaps—or might mean an assassination attempt by this Bureau, subsequently covered up. A skewered Dodge truck dangles twenty feet from the ground. They are careful not to pass beneath it.\n Later on, when it’s dark and no one can see, the municipal worker variants will come through. They’ll shrink the pavement thorns down to nothing. Their eyes will be haunted, pained. Like mine.\n “My mom,” she says, an hour later, when the bottles are redeemed and the pizza is bought and consumed.\n “What about her?” he asks.\n “She’s why. How I got so cynical.”\n “Ah,” S2 says, and smiles. She must realize, in this moment, how rare his smiles are. “Tell me about her.”\n “She was angry, all the time. Being around her was like living with wasps.”\n “Did she ever . . . ”\n “Hurt me,” S1 says, like of course that question came next. “No. She was never physical with her anger. And she never directed it at us. Just, everything made her mad. All the stuff about how we live. What they do to us.”\n “Was she . . . ”\n “Like you and me?” S1 blots her lips with a napkin and scans the parking lot, like she’d be able to spot someone if they were listening. Even looks up at the stabbed-to-death truck. “Refused to get tested. Wouldn’t have let them test me, if it wasn’t for some stuff that happened at school. Then she didn’t have a choice in the matter. Like what happened with you.”\n S2 looks wounded, shocked. He opens his mouth to ask How did you know that, but then he shuts it. In that instant, and for the next several minutes, he looks like the younger one. The fragile one.\n “So now you know,” he says, after taking a long sip from his empty soda can.\n “Know what? How to pick up dirty cans?”\n “Now you know you’re never out of options.”\n She smiles. Then she stops. “Mom said they’d always be watching me.”\n “So what if they are?”\n “So no matter what we do, they see it. So there’s no way out. So, it’s not true that we’re never out of options. We don’t have any at all, except stupid ones, like whether to starve or pick up fucking bottles.”\n S2 watches her face, possibly wondering whether it’s her mother’s anger he sees there.\n They head back. They’re halfway there, beneath the big office buildings of downtown, weaving between the rose bushes that spring from nothing in the space of a day—whose flowers bloom bright blue and green, and glow in the dark, and dance to soft music from speakers in the sidewalk, an astonishing horticultural display summoned up by well-paid closely-watched variant laborers—when Hector S2 turns to her and says:\n “There’s ways out. My friend Timothy, he got out.”\n She slows to smell a flower, and doesn’t say a thing.\n “Your mom, right? Her too?”\n “They smell gross,” she says, swatting the rose away. “Like meat.”\n Surveillance Clip S643/R57.D021-23 [File Uploaded]Human Agent Summary\n They spend several days at central station. On the sidewalk outside the main exit, scanning the faces of everyone who emerges. Looking for her mother? For this Timothy? Some fugitive member of his family; one of his several dangerous Known Associates? They say less and less, as time goes by.\n So many people seem to know S2. They come by, slap hands, smile, exchange words. Moving fast, never stopping more than three seconds, like they know precisely how long it takes the bureau software to clock their identity and bounce it off the variant registry. Lovestruck boys, mostly. Young as she is, S1 has got to see the crushes they all have on him. She can see it in the swift familiar rise-and-fall each face follows, from rapture upon arrival to devastation at departure. She can see it in S2, after, the way he stands up straighter, his charisma validated, his loneliness underscored.\n Messages are being passed. This is a certainty. Scraps of paper smeared with data gel; wireless device chatter across encrypted channels; meaningful glances that confirm whether meetings took place or escapees eluded capture. Requests for additional surveillance agents to pursue these strays have gone unanswered. It’s an erroneous prioritization of bureau resources, following the letter of the law by restricting scrutiny to people for whom probable cause can be established via legal confirmation of variant status. S2 stands at the center of something, some network of mutual aid and enhancement.\n The chatter bots have nothing concrete. A whole lot of ellipses that add up to nothing. Even the bureau’s in-house variants are stymied. Moments like these highlight the agony of our their position within law enforcement work—caught between two worlds, hated by the one they came from and mistrusted by the one they chose.\n Surveillance Clip S643/R57.D024 [File Uploaded]Human Agent Summary\n Rain.\n S1 will spend the whole day in the library, as she generally does when it rains. S2 never shows up in wet weather. Agent sets an ambient monitor on the library’s mesh network speakers, keys it to her sonic signature, and heads for bureau regional office #57.\n A third request for an analysis meeting has been denied. Supervisor maintains that overwork is the sole cause of these denials. Every agent has too many targets; every supervisor has too many agents. On a fourth request, agent flags probationary status, and lack of clarity around surveillance target’s strategic value, as cause for meeting priority. This, too, is denied.\n \n Bureau office smells and looks like the underside of a freeway cloverleaf. Agent walks in the door and immediately remembers why they never come here, and why the people who work out of this space always sound so angry when one calls the office. Agent wonders whether the offices are any nicer, in the pivotal municipalities. If we get decent coffee and fresh coats of paint, outside the Tourniquet.\n \n Agent spends an hour and a half, waiting outside supervisor’s office. Drinks bad coffee; chats up supervisor’s receptionist (who is resistant to chatting up); revisits highlights of S2’s surveillance file. Strings together short video clips of skateboarding highlights.\n \n Supervisor is visibly displeased, to emerge from his office and find agent waiting. Yells.\n \n Supervisor commits to address agent concerns at next quarterly of all eighteen field agents under his supervision. This meeting is eight weeks away.\n In elevator, on the way out, agent impulsively presses the button for the eighth floor. When the doors open, the hospital smell of it momentarily overwhelms. A woman stands there, eyes shut, arms out, leaning back; a statue, an angel on the nod. Scabs around her lips pucker when she smiles.\n The bureau’s in-house methadone clinic isn’t at the top of its list of dirty secrets, but it isn’t far from the top either. An ugliness necessitated by the staggering rates of addiction among variant employees, who were too often subject to compromise or memory theft at public clinics. Drugs use is disproportionately high among variant individuals. The disruptor epidemic hit us hard.\n The waiting room is crowded. It always is, on cold days. Bureau wages are rarely sufficient to cover the cost of both rent and of addiction. Agent prowls through the room, and doesn’t have to look for long before finding a familiar face. A code-monkey variant he was in the academy with. Computer workers always have that same haunted look in their faces. Who knows why.\n \n Small talk ensues; how have you been and what is exciting in the work these days.\n \n “I’m tailing this girl,” agent finally gets around to saying. “But I can’t for the life of me figure out why. She’s a kid, with no known friends or associates or family connections of strategic value. Variant, but totally banal as far as I can tell. Any chance you can check up on her?”\n Agent’s old associate complies.\n “It’s a tough one,” she says, after what seems like not long enough.\n “How so?”\n “Predictives have positioned her at the nexus of several probable events.”\n “Predictive . . . variants? People who can see the future?”\n “No,” she says. “We don’t have any precogs. They’re incredibly rare. Rumor has it, China has two—born at the exact same moment, a thousand miles apart. Predictives means predictive computer programming. Probability modeling software. Risk assessment.”\n Agent tries not to roll his eyes. “Those things are so ridiculous. I seem to recall a certain politician who squandered a twelve point lead by letting software set his strategy—”\n “This is different. If I do say so myself, our programming variants have come up with some pretty spooky algorithms. They can sift through a million different camera feeds, social media profiles, geolocation data, come up with some pretty crazy accurate predictions. Traffic jams—they aren’t chaos, they’re actually surprisingly easy to anticipate if you have enough data. Drivers who tend to shift lanes abruptly, plus drivers who are prone to extreme anger, plus drivers who have a habit of driving while intoxicated . . . who commute via the north shore expressway . . . who leave the office early on Fridays . . . it’s crazy. And they see big things in store for your little girl.”\n “Well shit. Why aren’t politicians using that? And, uh, the military, corporations . . . ”\n “They are—in Sweden, Ghana, Myanmar—any of the places where variants aren’t persecuted and culturally stigmatized into ghettoes and addiction and suicide. Buy me a drink sometime and I’ll tell you all my thoughts on the subject. I know, I know, I’m barking up the wrong tree here. Short version: the agency keeps its predictives to itself, and everyone is pretty happy with that arrangement. The last bureau chief tried to share it intergovernmentally, and found no takers. Tried to give it to private industry and got threatened with arrest by the prosecutor general. Government property, after all.”\n Agent is bored; does not try to hide it. “But what does it say about her? What big things are in store?”\n “It’s weird. It’s a configuration I haven’t seen before. But it’s big. Like, paradigm-shift big.”\n “Bottom line is, I’m stuck following a prepubescent girl around all day because a computer program created by drug addicts said I should?”\n She shrugs. She is not smiling.\n S1 is still there, when agent returns to library. He pulls her search history from the computer she logged in on. They sadden him, and then they frighten him.\n variant individuals origin theoriesvariant cure facilitiesvariant torture pornvariant pridevariant pride association\n \n Agent has to fight very hard to keep from hugging her, telling her everything will be okay. The only reason he succeeds in stopping himself is that he doesn’t actually believe that it will be. \n \n Surveillance Clip S643/R57.D026 [File Uploaded]Human Agent Summary\n S2 is smart. He takes his device battery out, when he is home. None of his networkables are networked. Agent is forced to resort to mic-jumping the phones and speakers of his upstairs and downstairs and next-door neighbors, then running all four feeds through a dozen different filters to get a very broad sense of what S2 is doing in there. Coffee is made; a toilet is flushed. Then he turns on his music and it all goes to shit. Sometimes it sounds like he is crying, prone on the floor, on his back, with a pillow pressed to his face, but that could just be some weird sound effect in the background of a song.\n His searches are secret. His cynicism is smarter than hers. He knows we are watching.\n Who is he crying for?\n Surveillance Clip S643/R57.D027 [File Uploaded]Human Agent Summary\n Rain again. Probably for the first time, it occurs to her to wonder what he does, those wet days. She goes to his apartment. Skates slowly. Enjoying the downpour. She is drenched through by the time she arrives. She keeps her device on. He hugs her, hard. She laughs, tells him he’ll get all wet. In his sadness, in his happiness at her arrival, he forgets to make her take the battery out of her device.\n The depth of detail is glorious. Like seeing for the first time. Agent sends spatial echoconfiguration pings, which map the room in immaculate detail, which for so long has evaded me this agent.\n “I’m sorry,” he says. “Rain always gets me down.”\n “It’s cool. Wanna watch a movie?”\n “Sure. Something fucking gruesome.”\n “Totally.”\n He is not sober. She sees and hears it right away. They sit on the floor in front of the couch. She points at something on the floor, five red cylinders on a handkerchief. “Is that?”\n “Disruptors, yeah.” She must notice the shame in his voice.\n “You shouldn’t mess around with that stuff.”\n Ryx S1 sounds like she’s had to have this conversation before, with other older people who really ought to know better.\n “I didn’t do them. I just . . . ”\n “Did you used to do them?”\n “For a little while.”\n “Who is this?”\n “That’s Timothy,” he says. His back is to her. He can’t see the photo she’s holding, but he knows which one it is.\n “The one who got out.”\n “Yeah,” he says.\n “ . . . how?”\n She is afraid to ask the question. You can hear it in her voice. She knows the answer hurts. She knows he is already hurting. She hears it in his.\n “Jumped off the blue bridge. Broke both legs when he hit the water. Drowned.”\n She hugs him from behind.\n “Water was his thing. His aptitude. We used to—”\n “So that’s why you hate the rain.”\n A whisper: “That’s why I hate getting wet.”\n “And that’s why you bought those disruptors.”\n A nod. “For when it rains.”\n “He’s beautiful. You were beautiful, together.”\n A nod. “He’s like your mom, now.”\n She frowns.\n “They don’t leave us,” S2 says. “They’re part of us, always. Separation is an illusion. Do you understand?”\n Something is happening. Something we can’t see.\n “I guess,” she says, after a while.\n A knock on the door. The boy on the other side of it is bashful, scruffy, multiply pierced. Flame tattoos lick his fingers. His forearms are whirlwinds of fire and muscle. He sees Hector S2 and for a second his face is all need, lust, loneliness, separation, and then he sees S1.\n “Oh, hey,” he says. “Sorry. Didn’t know you had company.”\n “Hey, Kevv,” S2 says. “Kevv, this is Ryx. She’s a friend of mine.”\n S1 is off-balance, still. Reeling. Blinking. “Hey.”\n “We were just doing some augmentation work.”\n “Oh, right on,” Kevv says, smiling, nodding, backing up. [Cross reference: Surveillance File on Subject #644 of Region #57] “Well I’ll, you know, come around a little later maybe.”\n “Great,” S2 says. They high five. Kevv makes a face like a puppy might make. S1 takes his hand, impulsively, as he exits, and holds on to it for a full five seconds.\n “See you around.”\n “Nice to meet you, Ryx,” he says, and is gone.\n Agent searches for augmentation; variant augmentation; variant aptitude augmentation. Finds nothing. Flags for follow-up.\n S1 says “You attract all kinds of strays.”\n “Shut up.”\n When the movie is over, she says “I’m taking these.” She wraps the red cylinders up in a paper towel and puts them in her back pocket.\n “Wait,” he says. “Those were expensive. At least let me try to sell them back to—”\n “Nope,” she says. “Sorry.”\n He smiles. She goes.\n I Agent could grab her, now. Variant in possession of disruptors; she’d be fifty before she got out of jail. I watch Agent watches her go; sees what Hector S2 sees, in the set of her jaw and the light in her eyes; sees, also, maybe, what those spooky algorithms saw, when they peered into her future. Agent knows that nothing he does could ever cage her, not really, no matter how small a box he put her in.\n Surveillance Clip S643/R57.D028 [FINAL DAY OF SURVEILLANCE DETAIL PRIOR TO AGENT REASSIGNMENT] [File Uploaded]Human Agent Summary\n The city is still soaking wet. It stinks of rust and mud. At three in the morning a hundred agents carried out simultaneous raids on eighteen known bases of one of the leading variant triads, and now the city is strewn with blood and broken glass. Green; blue; red; white. Glass stalactites dangle from streetlights. Massive glass sea urchins seem to have swallowed up cars, storefronts, trees. A fine deadly dust has settled over everything, and diamond-bright shards catch the sun. Some pieces are as big as trucks. Hipsters take photos. Moms swat the fingers of kids who try to pick up the prettiest specimens.\n S1 and S2 follow a dump truck and a fire truck west. Municipal workers in special suits gather up the big pieces, hose away the small ones. S2 explains new skateboard tricks as they move through the path they clear. The old lovely names, familiar as prayer:\n Acid Drop. Egg Plant. Sad Plant.\n Blunt, Boneless, Darkslide.\n It’s unclear, how it happens. What agent lapse let this transpire. Exhaustion is the probable answer. The horrific insomnia, after the previous day’s surveillance. Studying up on augmentation. The theories. Possible variant aptitudes never before seen, or mistaken for something else. The idea that some variants might have the aptitude of giving other variants additional aptitudes, or of magnifying existing ones. Agent stayed up all night, researching. Scouring S2’s files. Stringing together clips and close-ups of him. Telling himself, Separation is an illusion.\n Agent should have known better. Agent knew that S1 is not like other variants, that something was different, special, about her, and to proceed with greater caution.\n Agent got too close. Simple as that.\n S1 stops.\n “It’s like a Nuclear Grab,” S2 says. “Except instead of—”\n “Sh!” she says, and turns around. He turns around too.\n “That car,” she says. “It’s been following us.”\n Agent knows he should turn and go. Cut and run. But if he does, she’ll know we’ve been surveilling her.\n “Leave it alone,” S2 says. “Let’s go.”\n “No,” she says, and skates, fast. Agent goes to put the car in reverse and finds that he cannot move. She is coming, and he is following her, and agent is trapped, can’t move, can’t blink.\n “Hey!” she calls. “I see you!”\n Agent’s eyes grow dry. His door is unlocked. He can’t lock it. He is breathing, but barely. She steps off the skateboard, picks it up, swings it, shatters the glass of the driver-side window. Grabs his hooded sweatshirt.\n S2 arrives, stands beside her. “Ryx, come on, we can’t—”\n He sees the man in the car, the small helpless cowardly creature frozen solid by S1’s aptitude. One of her aptitudes. One of her many. Hector’s mouth opens. His voice is very small when he says:\n “Timothy?”\n \n Ryx has me. I can’t move. She fills me up. Sees me, utterly, completely. And I see her. She is so much more than the little girl I’ve been watching. She contains so much.\n \n \n She takes hold of Hector. Builds a bridge between us. We are one, the three of us, and it feels so good I am sobbing in seconds.\n \n \n She speaks without speaking: “This is him?”\n \n \n Hector nods. He is crying too.\n \n \n She isn’t.\n \n \n “He thought you were dead,” she says to me.\n \n \n “Agency faked it,” I say, without wanting to, because I cannot lie, cannot refuse to answer, I am hers, his, we are one, and how can I keep secrets from myself? I’ve spent years trying, and failing, and slowly dying because of it. “Standard practice for variant agents.”\n \n \n “You’re—an agent,” he says. His disappointment is utter, entire. It breaks me.\n \n \n “I did it for you,” I say. “To keep you safe. They were going to get you. I cut a deal.”\n \n \n He nods. I’d do anything to convince him, but I don’t need to. We are one, now, and he can see that I’m telling the truth. And I can see that it doesn’t matter.\n \n \n “You fuck over your own people. You help them hunt us, lock us up, put fucking psionic surge fucking shock collars on us—you—”\n \n \n He gasps, moans, droops, like he’s about to collapse. She holds his body tight.\n \n \n He sees the truth. All of it. My selflessness, but also my selfishness. My cowardice. My inability to imagine a good life for us. Being what we are. Being what I am. Seeing so few ways out—suicide, addiction, a life of crime, treason against my people. Choosing the paycheck, the safe pensioned life of a vicious dog helping its masters hurt my own kind.\n \n \n I could never see the way out Hector saw. Pride and power and revolution. The way out he showed to Ryx.\n \n \n I see his memories of us. Our bodies, hot and hungry, twisted together, on clean sheets on a dirty floor, hear his low gravel whisper reading from the Upanishads, “as a man in the arms of his beloved is not aware of what is without and what is within, so one in union with the Self is not aware of what is without and what is within, for in that state all desires are fulfilled.” I see us skateboarding in the rain. Kissing in the river. I see his memories sicken, darken, grow brittle. Die.\n \n \n “What else have you got in there,” she says, and looks deeper, sees the faces of all my colleagues, the ones who faked their deaths and the undercovers in the triads and the pride associations, and he sees them too, sees friends, sees comrades.\n \n \n Her eyes narrow. She sees deeper. The spooky algorithms, the computer programs that sifted through the little bit of life she’d lived and saw that she’d run into him, eventually, two skateboarding orphans, one with a wide network of friends and accomplices. She sees the paradigm shift she stands at the center of.\n \n \n “You’re not going to tell anyone what we know, now. Right? That wouldn’t go so well for you.”\n \n \n “No,” I say.\n \n \n “You’ll delete all this from the report.”\n \n \n “Yes.”\n \n \n She smiles. She shows me herself, and him.\n \n \n Fire is only one of Hector’s aptitudes. He didn’t know it until he met her, until she showed him himself. He can strengthen, magnify. He strengthened mine. He magnified me.\n \n \n And Ryx. She can take, and she can share. She has a dozen aptitudes already, maybe more. She knew it, but until she met Hector she didn’t know what that could mean. What they could do with such a thing. Now she gives them out to every variant she meets. Even that boy Kevv, the day before, Hector’s latest lovelorn fellow revolutionary, in their brief handshake.\n \n \n Ryx grins, at my jealousy, at my ineluctable loneliness, and water rises from a puddle beside my car. Forms a bubble, studded with broken glass. She has my water aptitude now, on top of everything else.\n \n \n Her hands drop.\n \n Hector’s face slowly settles. Becomes less red. Stops trembling. Agent doesn’t I don’t look away. My mouth opens. Nothing comes out.\n \n I should shoot her. I know what it is, now, what she can do, what she’ll accomplish.\n \n \n I should report her, at least. Someone other than me needs to know.\n \n \n I can’t do any of that.\n \n \n I can barely keep from throwing up.\n \n “Come on,” Ryx says, and takes his hand, and she is strong, strong enough for both of them, for all of them.\n They turn and go.\n The noise at the end of the clip is skateboard wheels on wet pavement. Two sets of them. They sound like thunder, a long endless peal of it, rolling pitilessly away.\n Sam J. Miller is a writer and a community organizer. His debut novel The Art of Starving (HarperTeen) was one of NPR's Best Books of 2017, and won the Andre Norton Award. His current novel, Blackfish City (Ecco Press; Orbit) is an Entertainment Weekly \"Must Read\" and was called \"an action-packed science fiction thriller\" and \"surprisingly heartwarming\" by the Washington Post. He's a graduate of the Clarion Science Fiction & Fantasy Writers Workshop, and a winner of the Shirley Jackson Award. He lives in New York City."}