{"fingerprint": "DwkN0ZNFGmPUGQyDv1z0xPY5rI0=", "sitename": "Clarkesworld Magazine", "title": "A System for Investigating Recapitulation and Evolutionary Novelty by Kyle E Miller", "author": "Kyle E Miller", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/miller_04_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A System for Investigating Recapitulation and Evolutionary Novelty by Kyle E Miller", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5150 words, short story\nA System for Investigating Recapitulation and Evolutionary Novelty\nWhen L awakened on her leaf, the photocell beside her head was incandescent with a captured message. The cell held the light that held the meaning. She placed two fingers flat on the golden cell, drew two small circles, and the message opened. Superimposed on a five-second living image of a young woman’s face were the words, “I’m sorry I can’t be your light anymore. Goodbye.”\nHolding the image of J with her right hand, L scrambled with her left to send a message, an invitation to speak, a plea, an apology, and already her breaths were ragged. The photocells remained dark: J had blocked her. L lifted her fingers and banished the final image of J.\nShe had kissed such an image many times before. She had pillowed her head on that image, transmitted from some distant leaf or, she thought, maybe the one right beneath her if such a leaf existed. J had sung her to sleep, the most perfect lullabies drawn from no datacell but her own mind. She had been L’s longest relationship of any kind with any other person. They had shared three years, they came to her now one after the other, and flotsam on the sudden flood of memories was an image of them dancing: L’s body all aflutter (and J’s too, on her own leaf) while seven billion photocells flickered around her, coalescing every few moments to reveal J’s silly graceless movements in realtime.\nL felt a whelming pressure in her chest. She sat up and studied the gentle curve of her horizon, the edge of her leaf curving out of view and into the dull whiteness all around.\nB’s face filled L’s entire leaf. They spoke like this often, a sort of ritual, L supposed, in realtime, usually for work, usually during L’s yogic strength training. When asked once why she had chosen that as her hobby, she said it was as innocuous and time consuming as any.\n“Talked to my mom yesterday,” B was saying.\nL broke her position and used her palm to shrink B’s image to life-size, or as close as L could approximate, an animated head enisled on the long dark leaf. “You can do that?”\nB laughed. “What do you mean you can do that? Of course you can.” She narrowed her eyes. “Not that I recommend it.”\n“How, though?”\n“What do you mean how?” B’s head ducked out of sight, and then returned. “She doesn’t give a shit anyway. Not that she minds having children. Out there. She just don’t want much to do with ’em. We’re past that, she says.”\nL went into another position, resting all her weight on her arms. It hurt, but she was getting stronger. “But how did she find you?” she asked. “I just. I didn’t know that was an option?”\nL wasn’t sure she understood where she came from, the birth, the delivery. She had once seen a BERD soaring to some other leaf, or so she imagined—a leaf not yet inhabited, one newly grown for a newly grown person—but where did the BERD come from? It must have visited both her parents, one after the other, and done the fertilization for them, all the messy parts taken care of behind the closed gleaming doors of the BERD’s metal belly.\nFor it was a truth universally accepted that no one left their leaf. No one could: it was impossible, and completely unnecessary, unsafe even. You had everything you needed at your fingertips: the entire Tree of information for your use and amusement. L had instant access to everything and everyone.\nExcept J, she thought.\n“She’s into that church,” B was saying. “You know, the one named after that mathematician obsessed with patterns, reoccurrences.” She moved out of view, looking up his name, but L was barely listening. She was thinking about J, would go on thinking about J, and for how long? She wished she had someone who might tell her what was normal. She would search the Tree later, to be advised anonymously by the gibbering hoard of content producers.\n“J broke up with me yesterday.”\n“She’s all about renewal,” B said.\n“J?”\n“Who? No, my mom. The church. Are you listening, bitch? She’s going on about iterations and reiterations, and I haven’t even caught up yet and she’s telling me everything, everything seeks assembly, that the rhythm of the world’s pattern puts us to use.”\nL felt small. She shrank B to the size of a single photocell, a mere mote of light, and then back again to life-size. J had been her only real friend; spending time with anyone else, those she met through work, had begun to feel forced. And Tree interest groups and message centers were all too often tempests of rage and hypocrisy, each person defending the sanctity of their own private world and looking up in wonder that no one else cared even as they failed to listen to the very people they beseeched to understand them. L couldn’t follow the hierarchy of experience: how could one person’s perspective be any more important, more essential or authoritative than any other? Censure was a moral act: to criticize or question was to lose social prestige, the only currency that mattered on the leaf, the Tree. And they all wanted the world reshaped in their image. She hated that storm of voices.\nShe preferred the sweet, melancholy voice of J. She had better things to do, climbing the Tree, for life and for love.\n“Well, that’s my quota,” B said. “I’m off.”\n“What? Wait,” L said, sitting up. She had been daydreaming. “Do you have to?”\nB looked to the side and hesitated. “I mean.”\nL lay facedown on her leaf. She blew up a section of B’s cheek and studied her perfect skin, so much darker than her own. She pressed her own against the giant image. “It’s okay, you can go,” L said, and then realized B already had. The image was no longer moving. She lifted her hand and let it go.\nL awakened to a dozen images of a man’s cock, a flurry of half-flaccids that left her nauseous and irritable. On the last he had written, “Y/N?” and attached his leaf signature, a venation of cells unique to his leaf. L flicked her fingers to slide them all away, but the leaf failed to respond, and she had to close them all individually. She felt white space as sudden pressure, a packing in, as if she were being loaded into a cotton-lined box too small for her body.\nDrawing the signs to light up for work, she hoped she wouldn’t be paired with another sex-starved man, or even a woman. Sometimes they were worse, more cutting somehow, perhaps because they should know better, L thought, they knew what it was like. It wasn’t that she begrudged them their desire, it was their attitude, the expectation, the insistence that bothered her. Knowing she might reach her quota at any moment and close the conversation, most men, if they found her attractive, propositioned her for sex after just a few minutes of small talk. Her blocked list would cap out soon, and then she would have to wait for some of them to die off. She chuckled at the thought, relishing it a bit until she remembered how pushy she had been once, maybe twice. Before J.\nA pale man’s face appeared on her leaf. “Hey sexy,” he said.\nShe immediately shrank his image and began drawing the symbol to block him (still thinking of J: they had met at one of her interest groups via the Tree, a tight cabal of young women determined to change the world; and what had happened to that? Love, she thought, that’s what happened), a complicated gesture that took about ten seconds, and then his entire body covered her leaf, larger than life-size. She was sitting on his stomach. His cock was erect, bobbing.\n“The fuck—”\n“Ready to play, sexy?”\nSex required consent; a leaf made life so much safer. L couldn’t imagine how at one time people had shared a leaf and pressed their bodies together; the thought made her squeamish. This man could inflict his image upon her, but he could not make her watch. She closed her eyes. Of course she would be matched with a leafhacker. She had read about them on the Tree. Somehow, they gained access and rudimentary control, however temporary. They would give her a day off of work for this, as compensation, but would he be punished? Perhaps he would lose control of his leaf for a day or, she hoped, a year.\nHe increased the volume. She couldn’t escape his voice. She felt his image upon her, and her body upon his image, the warmth of it, unwanted, desperate. That much he could force upon her. She couldn’t focus on anything else. He whispered to her as she tried to raise an alarm with her fingers on the leaf. She had to touch him to try, she held a curse in her throat: she would not give him the pleasure of the sound of her voice.\nHe was taking it slow, edging himself just as she moved closer to the edge of her leaf where she could only see the flank of his abdomen. His love handle, she thought, and she spit over the edge of her leaf. Her fingers worked fast, moving in circles, squares, letters, words.\nHe was about to come when she heard a voice that was not the man’s, not a man’s voice at all in fact. She sat up and stopped breathing, her fingers splayed on the photocells. At first she thought it had come from the man’s leaf, but no, this was different, sourced, primordial. Here was a focus to take her away, and she listened to a song drifting to her leaf from somewhere in white space, a high ribbon of wordless music.\nL caught her breath and swallowed hard. The man was gone, and she had hardly noticed. An alert appeared all across her leaf, an apology, an excuse, a compensation. She stared below.\nJ?\nL’s leaf was attached to the stem by a frail length of chrome green, and the stem—massive, perfect, untouched, so anonymous, so present it nearly blended into white space—the stem extended up and down as far as she could see. Which, she thought, probably wasn’t very far at all. White space became a fog at long distances. The detail on her leaf, from one end to the other, never blurred, but she could follow the stem with her eyes until it faded away. Sometimes she thought or imagined she could distinguish the shadow of a leaf above her own, a faint suggestion of color in the long blanket of white space.\nOnce, she had socialized with a bright young boy who spent all of his time exploring the Tree, “climbing” it, as he said, reading everything everyone had written since 1 ACE and scouring the reproductions from even earlier. She remembered spending more time with him than her quota required.\n“Leaf is really an acronym,” he said. “Life Extending Artificial Foliage. So is stem.”\n“Yeah?” She had been distracted; J was on her mind, or, as she liked to say, in her mind, nesting there, settled. Conjurable.\n“Structure for Time and Energy Management,” the boy went on. “Isn’t that clever of them?” He had so much to say, but she had forgotten almost all of it. An ad for someone else had popped up, she remembered, a banner over the boy’s eyes, masking him for a moment with another face, another signature, a five-second video clip of a girl kissing the air, beckoning for attention, and then L closed the ad. And the boy railed against the solipsists while she lay back and drank visions of J’s face, half listening to him, half to her heart.\nShe had never given solipsism a second thought, though many did, becoming almost cultish in their dedication, wrapping themselves in the comfort of a world without others. How could you be lonely when there was no alternative? Though how they formed a group and communicated their ideas was beyond her: did that not contradict itself? Perhaps each member was merely a small unit of the rest, forming a fractal cult echoing its own name into white space.\nL was sure they had thought it all out. She could read about it on the Tree, but she didn’t care to. She believed in the solidity of others.\nA photocell suddenly lit up with a memory of J, her mouth forever turned up at the corners, as if it was impossible for her to frown. The tiny hairs on her upper lip that in a certain light gathered and released every color in the order the world had ordained. And a lullaby.\nL looked over the edge of her leaf, and the white space looked back.\n“I think it’s her,” she told B. She heard the song daily now. It was like, yet also unlike, J’s lullabies. This song was pure, as if there was no leaf between them. Often, L awakened to it now, and when she closed her eyes and concentrated, she sank into a sleep deeper than she could ever remember, one haunted by vivid dreams that left her feeling stretched come morning, as if she was being opened from the inside. It wasn’t a bad feeling.\n“I don’t know,” B said. “I think you left a message open or something. You check your leaf lately? I lost a message in a corner once, shrank to a single photocell. Song played in my head for days.”\n“I don’t think that’s it. What if it’s a test?”\n“From who?”\n“J,” L said, a little forcefully. “What if she’s testing me?”\n“And what are you gonna do if she is? Listen, I gotta go. Mom’s been messaging me all day. Quota’s long past, anyway.”\n“Fine.”\nL crawled to the tip of her leaf and leaned over the edge until she felt the tugging force that kept her from falling. A sort of gravity, she imagined, centered on each leaf. She would not be permitted to leap toward the song. She was almost certain it came from somewhere below, if not everywhere, all-pervading.\nL fell back on her leaf and drew the symbol for do not disturb. Drowsing in the song’s sadness, in its sweetness, the melody thrumming in her head, she fell into a well of memories. J’s image danced. Words came to her like bubbles from below. “Heaven recalls it to your recollection . . . For they sit in a green field . . . Nor a ripple upon the water . . . “ She let lethargy overcome her, slept here and there with barely remembered dreams, and later, when she tried to light up B, her leaf would not respond.\n“Shit!”\nShe had forgotten to light up for work. She had forgotten to do much of anything for how many sleep cycles? Four, five? “Date and time,” she said, and shit, it had been six days. Her leaf had limited function now, and it no longer responded to her whims and would remain inert until she returned to work and put in the hours. And she did so, begrudgingly, while she bent over the tube connecting the leaf to the stem. The petiole, she remembered it being called.\nShe had been thinking.\nShe tried jumping on the leaf, but it didn’t even tremble. Dismantling the petiole was her only way down. When her quota was met that day, she closed the photocells and realized she couldn’t remember who she had socialized that day. He had been talking about her hair when she cut him off. He wasn’t important, none of that was important.\nThe same force that kept her from leaping off the leaf prevented her from straddling the petiole and reaching the stem. Not that she knew how that might help. She had nothing she could use to attack the petiole except her teeth.\nShe sent B a message, and quickly canceled it. B wasn’t a friend anyway, she thought. Just another face on the leaf. L struck the petiole with her palm, and then a fist, a knee, the heel of her foot. She could see where she might detach the leaf from the tube that linked her to the stem, if only she could just—Her knee throbbed, and she had skinned a few knuckles. Laughing and crying, L lay down and bit the cold metal, gnawed and yowled until she felt her teeth crack and then shatter, and she spit the fragments over the edge of the leaf where the song lapped at the firmament.\nL’s teeth were repaired while she slept, as she knew they would be. As were her knuckles, her knee.\nShe studied the petiole. Her teeth had left no marks. She paced.\nShe awakened without knowing she had fallen asleep. She released a captured message, and the light said in green letters: Would you like to contribute to the next cycle? Y/N, and instructions on how to draw her answer. On a whim, without knowing exactly what she agreed to, she drew the sign for yes, and only minutes later, raising her head to scratch an itch below her chin, she saw a BERD.\nThe BERD sailed down and landed on her leaf, gilded wings folding neatly into its sides. Its gleaming silver feet brought the body closer, and L felt sudden fear. Life had never seemed so precise, so full and present. She suddenly felt special, unique, as if not everyone was afforded this view, this image come to life. But everything she saw on the leaf was life; what made this so special? And then she saw that much of the BERD was made of photocells, just like her leaf. Slowly, she rose to her feet. “Hello?” She walked around its strangely two-dimensional form and saw that only a small portion of its body took up much space at all. The BERD was mostly made of light.\nIt opened its beak, and the photocells at her feet asked the question again.\nWould you like to contribute to the next cycle? Y/N\nIs that what they called it? “Can you explain?” she asked, and a datacell opened across her leaf, condescending in tone, its style simpering and overly clinical. “I know all that. But what’s a cycle?”\nShe had the sudden image of a chrome penis extending from the BERD’s abdomen, entering her, collecting her eggs. A sperm bank deep in its bowels, a selective algorithm matching and pairing. She giggled. If she didn’t raise her baby, who did? Certainly not the BERD. Perhaps the leaf. Perhaps a leaf had everything an infant required. No one went wanting.\nAlmost as soon as L drew the sign for no (she wasn’t against it, per se, she just wasn’t ready, she told herself—but no, that wasn’t it either; she wasn’t interested, her interest was elsewhere, and she had the sudden thought, J is my baby) and the BERD rose above her, she regretted it. She could have destroyed the BERD, used it for parts, found something in its skeleton of photocells for dismantling the petiole. She cursed herself, tugged at her hair. She stomped and paced.\nShe had no tools but her fingers and the Tree. Her body and what it contained. Her brain, her bones.\nAnd a thought emerged, one she had been avoiding all day, even before the BERD landed.\nShe had been getting stronger lately. She wondered if she would have the will. By the time she asked the Tree for knowledge, she was already shaking, whispering under her breath fuck this, fuck this, and she learned just where to apply the pressure of the weight of her body to break it.\nShe screamed and tore away at the flesh of her arm, separating bone from tissue as the lullaby wove its way around her and entered the canals of her ears. When she finally freed the bone, broken at one end, she threw herself onto the leaf and hoped that when she woke up, her ulna would still be where she had left it.\nBlood ran in rivulets across and down the wide curve of the leaf, dripping into white space.\nShe woke up drunk on the melody and reached for her ulna. While she slept, her arm had been repaired and now only carried the shadow of a wound, an echo of pain. She thought that perhaps the lullaby wasn’t wordless after all. Occasionally she caught what sounded like a word, even if it was spoken in a language she didn’t know. Languages could be learned. J had spoken a few, that was what she liked to do.\nL worked at the seam between the petiole and the leaf. She managed to pry a small seal away from a deep hole into which no light could reach. Her finger could, and her bone, but she felt nothing that could be of any use in detaching the leaf from the stem. She wasn’t even sure what she was searching for.\nDragging both her hands across the leaf, she searched the branches of the Tree for information, but those datacells had been locked long ago, and when she looked up how to unlock them, she stumbled instead onto antique diagrams of keys, picks, and tumblers. At first she didn’t understand what she was seeing, but by the time she began to make sense of it, she had an idea.\nBut she was going to need another bone.\nStiff and sore, L brought her two bones together and gagged. The blood, like her waste, had already been absorbed into the leaf. But tissue had begun to build up in places on the first ulna, and L retched and scratched it away. Someone was transmitting a message in realtime. She had a backlog of unread messages, photocells whose light would never escape. The meaning would be held forever. An alarm leaked green and gold, bales of light shining on her flesh. And the song carried her on.\nOnce work on the petiole was finished, she hoped nothing else would hold up her leaf. She thought of an invisible force like the one that prevented her from leaping off the edge and shook her head. She set to work, sharpening the bones against one another and trying them in the hole, working them like scissors.\nShe awakened with a jolt that shook the leaf. The bones had fallen from her hands. She sat up, puzzled, disoriented. The lullaby had grown faint for the moment, or else some other sound had ceased, a hum so familiar it could only be heard by its absence. Something had shifted while she slept: the leaf rocked as she stood. The leaf’s surface had coppered. L crossed the leaf, dropped to her knees, and put a palm to the photocells: yes, they were dead. She had severed some vital connection. Her messages were all gone. The leaf hung darkened and dull in white space.\nShe was alone now.\nL woke up falling. She didn’t recognize the sickening drop, the refusal of the stomach to follow the rest of the body, until the violence of the landing, the sound of photocells shattering and the reverberations of her giant leaf struck like a bell from below.\nThe clamor pushed her head into black space.\nWhen L opened her eyes again she saw green translucent flakes floating through white space. When she reached out, painfully, they seemed to pass through her hand. And then she rolled over and saw her leaf, brown and dull, floating atop semisolid white space. Or, as her eyes adjusted to the different light there, a gray space. A sort of fog, or froth, she thought, remembering an image she saw on the Tree, an image of waves. That same blue gray. Spume, she thought, foam and scum.\n“You caused a lot of damage on your way down. You’re not supposed to be here.” A woman’s voice fell from above, and then L noticed a golden photocell out of reach above and to the left. It hung as if suspended in white space.\n“Damage?” L hoped no one had died. She hadn’t thought of that. As she sat up, feeling foolish, vulnerable speaking to a stranger lying down, L knew the damage to her own body was extensive. Some of her bones were surely broken, and then there was the leaf. Her leaf was dead. There would be no regeneration. She felt suddenly out of control, lost, foolish, and ashamed, as if she had betrayed someone. J, maybe, or B, or herself. And then she heard the singing again.\n“That song.”\n“What? Speak up.” The woman’s voice was clear and commanding.\n“A lullaby. I heard my girlfriend singing. So I came.”\n“That singing isn’t your girlfriend,” the woman said with a little laugh.\nL’s cheeks reddened. The pain in her legs shot up through her pelvis and into her abdomen. She was not going to walk again, not on this leaf.\n“It’s the System. You know.” The woman paused, and L imagined her hands waving, drawing in everything: the people, their leafs, the stem, the Tree, white space, and—L was sure this was the shape of the world—all of the other stems, for there were many of them, and they formed a world, a forest. She knew that word from history, a word from the Tree.\n“And like your system—everything working together, self-organized, creative—this one thinks too,” the woman went on. “Like a subconscious, yeah?”\n“You mean like dreams. Fantasies.”\n“Sort of.” She coughed. “Only it doesn’t think like you and me.”\n“But why? Why have a subconscious at all?”\n“It just happens. Complexity generates mystery.”\nL noticed her teeth were clenched. She felt a sudden fury mounting. The woman spoke so glibly, arrogantly even, as if none of this should be surprising, as if L’s world wasn’t toppling, hadn’t literally toppled. “Well, what is it thinking now?”\n“I can barely say what I’m thinking right now, you expect me to know what the System thinks? It’s probably trying to figure out if it’s real or not.” The woman chuckled, almost a giggle.\nWas this some kind of joke? L tried to stand, yelped, and fell back to a sitting position. “And what about the song?”\n“I’ve just been waiting for it to end. I think the System could be mantic. It’s smart enough. Someone has to know what’s happening. It’s been going on a lot longer than you’ve been alive. I didn’t even think of it as a song until you called it one.”\n“What? Waiting for it to end? What happens then?” L said, but the woman didn’t answer. How could she be so flippant? L was angry, not just at the woman, but at herself, at the world. She had imagined everything. J had not called to her. L’s mind gathered their three years together, and all of the memories were not of J but of herself, watching J on the photocells, caressing the warm surface of her leaf, or, now that she thought about it, her own hand, as if it belonged to another woman. J had as little presence as white space. The BERD was more real to her than J was or ever had been. That was all she knew, all anyone knew, yet she felt as if something was missing, and that something took up a space larger than J’s flat image. What was wrong with her that she felt this way? L’s memories began to leak all light and color. She felt caged, locked into her self, a closed loop, and what was that self but a long string of moments captured only in light? How could she have been so stupid?\n“Will I ever see anyone else?” L asked, seething, tears dropping.\n“What do you mean?” the woman replied. “You see people every day. It’s your job.”\n“You know what I fucking mean!” L shouted, and she beat the heel of her hand against her head. “Is this really all there is? Where are you? Tell me that. Can I see your face in front of mine? Can I touch you? Can I feel your body, your real body?”\nThe golden photocells vanished in the white gloom.\nL had begun to see her life as if from above, one step removed, maybe two. She was watching her life on the broad side of a golden leaf, through a photocell, and she couldn’t even remember what had brought her to this moment, or she could, but only vaguely, as if it had happened to someone else entirely. Each moment felt prerecorded, and only the event of her watching them was played in realtime. L was coming closer to naming the panic in her heart: doubt.\nShe sobbed as her leaf floated on the gray ceaseless spume. She would meet no one here. For hours, she drifted. Some motion in the foam, some current, pushed or pulled her lone floating leaf. Later, she realized she could no longer see the stem. And with the leaf dead and dropped, she should be able to leave it, but she was afraid. She was afraid even to touch the gray froth, and when she mustered her courage and did so she found it cold and somehow ethereal. It was wet, but then it wasn’t. She thought about stepping off, wondering if she would sink or vanish only to reappear somewhere up above on another leaf to begin again. Perhaps that was birth, and parents were a myth, and sex was only part of the job.\nJ’s song was no brighter here, no louder. J’s song. L laughed at herself and punched her thigh. A lock of hair fell in front of her eye, and she tore it away, tearing a few strands from her scalp. Maybe that woman had been lying, or else she didn’t know as much as she claimed. Who was she anyway? Who was she to L when the song filled the cavity inside her head with light?\nThe lullaby made L so drowsy here, so dreamy, but with careful, repetitive motions of her hand, L found that she could slowly steer her leaf farther into gray space. She listened and followed, drifting in and out of sleep only to be awakened by the sharp ache of her broken body or the memory of a sweet, sad melody. She thought she could just make out the silhouette of another stem ahead.\nAnd then the song ended.\nThe silence was heavy.\nL looked into the gray froth, and then up into white space.\nThe leaves began to fall.\nKyle currently lives in, writes about, and wanders across Michigan's bountiful lakes and forests. His fiction has previously appeared in 3-Lobed Burning Eye, See the Elephant, and Thoreau on Mackinac. He currently works as a stablehand for a small barn in Ann Arbor where he tries to speak with horses."}