{"fingerprint": "XlrhYfhWb3ttU4u/027tN5/0f0A=", "sitename": "Clarkesworld Magazine", "title": "When Your Child Strays From God by Sam J. Miller", "author": "Sam J Miller", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/miller_07_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: When Your Child Strays From God by Sam J. Miller", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5840 words, short story\nWhen Your Child Strays From God\n2015 Nebula Award Nominee for Best Short Story\nEveryone says it but no one believes it: attitude makes all the difference. People parrot the words but the words don’t penetrate, not really, not down to the core. That’s why Carolina Bugtuttle has all those lines on her face, always scowling when I reach for that third or fourth cookie after Sunday worship, always emailing me LOW FAT RECIPES and MIRACLE DIETS peppered with those godforsaken soulless smiley face things. That’s why she’s always stressed out about six hundred things that don’t have a smidge to do with her. Because she has a bad attitude. She needs to worry less about my weight and more about that degenerate son of hers, if you ask me, but you didn’t, so.\nMy smile isn’t just on the surface. That’s why I knew, Wednesday morning, when I woke up and Timmy still hadn’t come home, when I checked my phone and he still hadn’t replied to my texts and voicemails, why I knew I had the strength to go find him—wherever he was. And bring him home. And get started on a new installment of The Deacon’s Wife for the church e-bulletin. Write it raw, rough, naked, curses and gossip intact, more a letter to my sweet wise husband Pastor Jerome than anything else, so he can go through it with scissors and a scalpel before sending it out to the four-thousand-strong flock of the Grace Abounding Evangelical Church.\nWhat To Do When Your Child Strays from God.\nTimmy’s rebellion had spent a long time percolating. By the time Timmy vanished I had seen the signs—seen him in Facebook photos with That Whore Susan; seen him sketching the Spiderman logo that webheads were so fond of—and had armed myself with knowledge, courtesy of the Internet. I knew more about spiderwebbing than any God-fearing mother has any business knowing. I had logged enough hours on websites and wikis and forums to bring me to the attention of a couple dozen law enforcement agencies, places Carolina Bugtuttle would never in hell have spent a single second. Not even if it meant the difference between saving her son’s soul and losing him forever.\nI climbed the steps slowly, aware of the sin I was about to commit. I paused at the door to his room.\nLet me tell you something about the bedrooms of teenage boys. They are sovereign nations, islands of liberty hedged in on all sides by brutal tyranny. To cross the threshold uninvited is an act of war. To intrude and search is a crime meriting full-scale thermonuclear response: neutron-bomb silence, mutually-assured temper tantrums.\nSo I did not enter Timmy’s room lightly, and panic seized me in the instant that I did. Fear stopped me in my tracks, threatened to turn me around. The smell of stale laundry made my head swim—the bodily odors that meant my little boy had become a man. I summoned him up as the smiling little boy he had been before puberty caused him to declare independence, defy us as righteously and violently as America spurned its colonial overlords.\nI searched swiftly, joylessly. Praying, somehow, that I’d get caught. Desperate for him to come home, no matter what the cost to me might be.\nAnd that’s when I realized I was in over my head. I missed him, my boy, my son, the obedient wide-eyed one who loved his father and loved me—as opposed to the cruel and sullen thing with a heart full of hate he’d become. I’d built walls around the Bad Timmy, moats and turrets to protect my heart. Against Good Timmy I had no defense.\nI found plenty. Sperm-stiffened socks; eerily-empty browser history. A CD that looked Satanic. None of it was what I wanted.\nPermit me a digression here, fellow congregant, beloved pastor.\nYou probably know none of this, because you’re a good churchgoing Christian who’d never dream of Googling illegal substances. Nor have you ever had need to learn about the complex moral codes of conduct common to drug dealers and other criminals.\nThanks to the 60 Minutes and the Dateline and the nightly national news, you already know that spiderwebbing is a hallucinogen—but you don’t know what a weird one it is. The basic legend of its manufacture goes like this: in top secret farms run by the Taliban or the Chinese government or some other Existential Threat, Amazon psychovenom spiders chimerically combined with God Knows What get dusted with top-secret US mindmeld pharmaceuticals, then fed a GMO protein ooze that makes their web-producing glands go into overdrive, producing webs that get sprayed with wonky unstable Soviet-era hallucinogens intended to induce extreme suggestibility, then the spray crystallizes, the crystallized web is broken down into a dust and put into solution, which, after various alchemical adulterations, is dripped into the user’s eye with a dropper. All of this is speculation, of course, since the origins of the drug are so shrouded in mystery. For all I know they just dissolve LSD in liquid Ativan and sprinkle it with fairy dust and boom.\nTwo or more users who drop from the same web will experience a shared hallucination. If one of them sees the ground open up and an angel with a centipede face fly out, they all do. No matter how far apart they go, as long as the drug lasts they’re in synch. Like, they’re in each other’s minds. Psychically linked. No one knows why this is. No one knows much about anything when it comes to spiderwebbing. We made that stuff so illegal in the early days of the crisis that no lab in the country can legally possess a shred of it. Wise Pastor Jerome says you can be damn sure the government’s doing research on how to use it against traditional-minded Americans, but it’s his job to scare people about What The Government Is Up To.\nSo. Invading someone’s webbing experience is a potentially fatal act of aggression. You can imagine how much damage an evil person could do, with unfettered access to your psyche. Drug dealers used to sell webs to someone, then sell webbing off the same branch to their enemies, who would send in some psychically-skilled mind assassin to Break Their Brain. Plunge them into a black midnight sea full of squid-shark monsters that slowly dismember them—leaving them permanently paralyzed—or change their cognitive processes so that for the rest of their life whenever they look at another person’s face they see only a pulsing ravenous mouth full of jagged slobbery teeth.\nWhat I’m saying is, I was taking a big risk.\nFinally, I found it. Three eye droppers, wrapped in Kleenex, hidden inside a Dr. Seuss book. Full of thick liquid dyed Spiderman’s-tights-blue. I took them to the Winnie-the-Pooh mirror on the wall, which badly wanted Windexing. Now I just had to hope they came from the same branch as the one Timmy was on, and hope that getting inside his hallucination would help me find the boy himself. And that I wouldn’t break us both.\nYou can do this, I though. You watched enough tutorials on YouTube.\nI tilted my head back, held my hair, dropped one tiny drop into my left eye, and then, in the eternity it took the drop to fall into my right eye, experienced a long slow moment of absurd utter panic in which I would have given anything to take it back, go downstairs, sit quietly by the phone, wait for my son to come or my husband to come fix everything, which is what my mother would have done, which is what she trained me to do Always, in Every Situation, which is what I’d been doing all my life.\n“Morning, Beth,” my next-door neighbor said, when I stepped outside.\n“Morning, Marge,” I called—\nWhen I turned to look at her, Marge had a pug face. Actually, she was all pug. A five-foot bipedal pug kneeling in her garden, with a frilly ridiculous Elizabethan collar around her neck.\nDon’t freak out, I told myself, feeling a laughing fit coming.\nLaughing was safe. Screaming was a problem. A bad trip could trigger a spiderburst, making thousands of spiders literally erupt from the ceilings and floorboards around you, holes opening up in walls and the bodies of your loved ones, vomiting up arachnids ranging in size from penny to medium-sized dog. On 60 Minutes they showed an eighteen-year-old girl who got caught in a spiderburst, strapped down to a psych ward bed for the rest of her life, twitching and jerking away from nothing—as far as we could see—although the voice-over breathlessly described what she saw, the swarm that never ceased to flow over her, how she tried hard not to scream, and then screamed, and then gagged as dozens of fat black furry spiders poured down her throat.\nAnd if I triggered a spiderburst, anyone else in the webworld would get caught up in it too.\nWhich is why I was the only one who could do this. Which is why Carolina Bugtuttle would break her own brain and her son’s to boot if she ever had the guts to try something like this, which she didn’t. But I—I have a good attitude. All the time, about everything. No matter what I went through. No matter what hurts I carried around in my heart.\n“Bye, Marge,” I said, and started up the car.\nA dinosaur sat buckled into the backseat, passenger side, where Timmy always sat. Preening glorious blue-and-red feathers in the unkempt backyard. Ceratosaurus, I remembered. The favorite dinosaur of Timmy’s childhood best friend Brent. Brent, son of Colby.\nA tether of warmth tugged at me from the west. From Route 29. Was it my son? Or someone else? I knew only one person who lived in that direction.\n“Colby’s house,” I said without meaning to. The ground trembled beneath my SUV with the sound of a train passing far underground, although of course there are no subways in rural Scaghticoke.\nI pushed the tether aside and resolved to visit That Whore Susan.\nI kept my hands on the wheel and watched a flock of crows shift shapes as they flew: now butterflies, now jellyfish, now a swarm of black letters spelling out words I spent my whole life trying not to say.\nDriving while spiderwebbing is not the kind of activity I’d encourage you to ever engage in. You might not have to contend with packs of roving velociraptors herding gallomimuses across County Route 6 the way I did, or pterodactyls picking off baby mammoths, but it won’t be an easy drive all the same.\nSpiderbursts were the least of my concerns. My Timmy was so full of anger that I was scared of him in the real world, where all he had the power to do was hurt my feelings . . . and here I was opening my mind up to him as much as his mind was open to me. If he was drug-addled and out of balance and I caught him off guard, he might be able to lock me up inside my worst memory for all eternity, or show me parts of myself I’d never recover from, or who knew what else.\nUnderstand: Timmy was not a bad boy. There was a sweet curious creative little nugget inside that lanky angular body he’d metamorphosed into. Love and kindness, buried under all the hate and anger. He acted like everyone in the world hated him, and preemptively acted to hate them harder. Every single day, it seemed, he made my husband so mad he spit nails.\nThis, of course, was my fault. Everything a child does is his mother’s fault.\nWe venture now into territory that could potentially be the subject of another e-bulletin: Confronting the Whore Your Son Is Dating. I have lots to say on the subject, not all of it germane to the subject at hand, although my husband Pastor Jerome would say that’s never stopped me before, since The Deacon’s Wife routinely goes On and On about Unnecessary Details No One Cares About, but I say what the heck. That’s what the internet is for.\nA brachiosaurus raced me most of the way to Susan’s house, every heavy footfall shaking my teeth, some of them an arm’s length from my soccer-mom SUV, and I wondered what would happen if one of them came down squarely on top of it.\nWebslingers have a lot of theories about the things they see in the webworld, none of it backed up by science but all of it rooted strongly in This Happened To a Friend of a Friend of Mine. Some visions were real things, transformed, like how Marge became Pug-Marge. The brachiosaurus could have been a tractor, or a bug. Some visions were total figments of the imagination—though whose imagination exactly, and what they meant, was the subject of endless webhead debate. Some slingers said the visions couldn’t hurt you—So and So got stabbed like a dozen times by Bettie Crocker and that teapot from Beauty and the Beast one time and she bled until she passed out and when she woke up she was stone cold sober and unharmed—and some said web-world wounds would follow you, Freddie-Kruger-style, into the real world. Drugs are maddeningly resistant to methodical study, or even rational scrutiny.\nTo be honest, though, all the dinosaurs were a good sign. Timmy used to love dinosaurs. When he was little. The fact that his webworld was packed full of them meant maybe he was in a peaceful happy childlike state of mind.\nI passed a skate park. Teenagers moved through the little hills and curves, on rollerblades and skateboards, enjoying the sudden snap of early-spring warmth. What did it mean, I wondered, that every one of them had a horse head? That they were dumb animals, or that they were strong and noble? Being on drugs was a lot of work. I’d only been under for a half hour and already I was exhausted.\nYou may imagine, fellow congregant, that risking death or imprisonment by venturing out into the world Under the Influence was the most frightening part of my ordeal. Not so! For I realized, as the horses watched me pass with hostile looks on their faces, that the law and bodily harm were the least of my worries. The real terror came from two warring forces that threatened to crack me open. The first was love: that tether that tied me down, a choking liquid swamp I floundered in, thick and warm as phlegm, floodwaters that had started rising the second I took a hit of webbing, the only thing I couldn’t vanquish with a Good Attitude. Love for Timmy, helpless maternal love that overpowered my anger at everything he’d put us through.\nThe second was fear.\nEvery webworld has a boogeyman. That’s because pretty much every person has a boogeyman. A monster, a nemesis, a person or thing they fear most. I felt mine, as I drove. I had no idea what it was. I had no phobias, no enemies, except maybe for Carolina Bugtuttle, but she doesn’t count, for anything, ever. But something was there, and it had always been there, just below the surface, and now it was threatening to burst through.\nA Barbie doll answered Susan’s door, oversized headphones yoking her neck, looking for all the world like a chicken disturbed while doing something it shouldn’t be.\n“Ummm . . . hi?”\n“Morning, Susan!” I said, suddenly inexplicably frightened by the emptiness of her porcelain-rubber stare.\n“Um . . . my mom’s not . . . here?”\n“Not here to see your mom, Susan. I’m here to see you.”\n“Oh. Come in?” A slight bow, church manners intact, so maybe her mother didn’t raise her quite as badly as I’d thought she had. “You, uhh . . . Want a soda?”\n“No, Susan, thanks so much.”\nShe sat. I sat. The couch sagged. They’d needed to buy a new one when Susan was six and her mother worked at Wal-Mart, and now she’s sixteen and her mom’s still there and the couch is still here.\n“Nice . . . weather we’ve been having?”\n“It is.”\nWe watched each other. I wasn’t sure how to start, though surely I wasn’t the first mother in history to plant her feet in the living room of her son’s Whore Girlfriend. Probably not even the first one who used to babysit said son’s Whore Girlfriend. But I figured awkward silence benefited me more than her, threw her off balance, so I’d let it ride for as long as I could.\n“You’re looking for Tim,” she said.\n“You know where he is?”\n“Nope.”\n“I wonder if I believe you.”\nBarbie-Susan shrugged, hardening, and I saw that I’d miscalculated—she’d found her footing, gotten over the awkwardness, she was seizing the reins, danger, abort. “He said you were a meek obedient housewife,” she said. “That doesn’t seem . . . accurate.”\n“My son thinks he knows me,” I said. “But he’s wrong.”\nNo one knows me, I thought, but was that true? I didn’t. My husband didn’t. Did Tim? There it was again—the tug, the pull from Route 29. I shut my eyes, tried to seize hold of it and snap it, but it stuck to my hands like flypaper and tied me tighter.\nSusan said “Because here you are, with a very faint but very definite gray tint to the white of your eyes. You’re webbed, Mrs. Wilde. Don’t worry. It’s nothing anyone would spot if they didn’t know what they were looking for.”\n“And you?” I asked. “Are you? Is he? Are you both here—”\n“Ugh, no,” she said. “I hate that stuff. Do you even know what you’re doing? Let me guess—you Googled it? Christ, an old woman Googling is more dangerous than a drunk blind bus driver asleep at the wheel.”\n“Did you just call me old?”\n“Ummm . . . no?”\n“I don’t believe you,” I said. “You know where he is. You two—”\n“Your son might not know you, but you clearly don’t know him either.” We watched clouds, out the thin dusty windows. I wondered what she saw when she looked at them. For me they were cheese, vast walls of cold supermarket cheese. “What did you want to be when you grew up?” she asked.\n“My favorite subject was biology,” I said, willing to tolerate any digression that might eventually lead me where I wanted to go. “Followed closely by chemistry. Isn’t that the most ridiculous thing you ever heard?”\n“Why is that ridiculous?” she asked. “You never dreamed of doing something with that?”\n“I wanted to get married,” I said, the words coming easy from lots of practice. “I met someone wonderful, and I wanted to be his wife and support his dreams and have his kids. Speaking of whom. Where is Timmy?”\nHer voice, now, was weirdly gentle. “Tim and I broke up six months ago, Mrs. Wilde. If we were ever really a thing.”\nSpiders rattled against the glass of her boxy old television. I listened while the sound got louder.\nWhore Susan scooched closer. “Tim told me that you never defend him, when his father is screaming at him. When your husband hits him.”\n“That is most certainly not true,” I said, quick enough to keep from wondering whether it was true and what it meant.\nI longed to curse her out. Hiss That boy has shattered our domestic harmony, my husband is trying his make his son a good man the best way he knows how, shut your filthy mouth you Skank Whore Bitch. But this is why people with bad attitudes make a mess of everything. Because this wasn’t about me. It was about Timmy. My own hurt feelings at her attempt to wound me would have to wait.\n“I’m trying to help here,” she said, unhelpfully. “Tim said he’ll be damned if he ends up like you.”\nA word, perhaps, would be useful, here, about my son Timmy.\nMy fellow congregants may remember him as the charming rapscallion seven-year-old who delighted in shredding hymnals. Or perhaps you recall the smiling scallywag twelve-year-old who got on the PA system and made farting noises after Sunday worship on more than one occasion. You probably remember very little after that, because he decided then that he Hated Church and God and Religion and Pastor Jerome and decided to settle for merely making our home lives miserable. Before you—my beloved husband, my wise Pastor Jerome—decided to stop ignoring Timmy’s harmless aggressions and engage him as an enemy combatant, matching each new hostility with one of your own, an arms race that never abated, and of course anyone who’s ever sat through one of Pastor Jerome’s sermons when he’s in a foul mood knows well enough how deep his dagger-tongue can stab. Pretty soon the Bible stayed on the dinner table, and every night brought a new lecture on the evil of rock and roll or idolatry or rap music or vegetarianism or socialism or feminism, and Timmy never, never failed to argue back, until the shouting became superlatively unkind on both sides. And the favorite subject of Timmy’s screaming was his parents’ marriage, the sham he believed it to be.\nSo I didn’t doubt that he told her vicious things, spectacularly ridiculous absurd lies, preposterous suggestions no sane churchgoing Christian could have spent a half-second taking seriously. But who knew what this unbeliever believed. “God bless you,” I said, smiling to beat the devil, and fled that kitty-litter stinking house.\nA twelve-year-old boy sat on the bumper of my car. My son, but not. Identical to how Tim had looked, at that age, but something in his face told me at once that he was someone else. And that he was terrified.\n“Hi, mom,” he said, and got up to give me a hug. His arms clasped me below my breasts.\n“Hi, Matt,” I said, because I knew who this was, this perfect little boy I’d met inside my son’s mind. At twelve, Timmy wanted a twin brother more than anything else in the world. He’d had one for an imaginary friend, named him and given him all sorts of attributes (favorite color: blue, to Timmy’s red; favorite food: spaghetti, while Timmy’s was hamburgers), and now here he was, in the flesh, in the wonderful terrible world of my son’s head.\n“Where’s your brother?” I whispered, squatting to stroke the cheek of this marvelous creature, this fly stuck in amber, this last vestige of a beautiful happy boy I’d lost a long time ago—but why was he so pale, why did his lip tremble so? He was an emissary, this poor wretch, sent to me by my son’s subconscious, a harkening-back to the last safe place he’d known. Even before Matt answered my question, I knew what he was going to say.\nColby’s house. The last place on the planet I wanted to go.\nThe place the tether of warmth had been tugging me all along.\n“Do you want to come with me?” I asked.\n“No,” Matt said. “I can’t.”\n“Why not?”\nHis face reddened, my little boy, my son who never was, precisely like my real son in the quick uncontrollable rush of his emotions. “Timmy doesn’t need me anymore.”\n“Okay,” I said, and sadness cut through something essential, one of the cords that kept the hot air balloon that is my soul anchored to the good and the positive. The world began to wobble. I kissed his forehead, grabbed both shoulders and shook, in that way that Timmy had liked, but did not like anymore.\nMatt grinned, a puppy after a belly rub, and then shivered, and looked away.\nFigment of my son’s imagination or not, I felt sorry for the little tyke.\nMatt was a cry for help. A demand to be rescued. Rescued from a monster. A vicious, cruel captor, determined to mold him into a man my son had no interest in becoming. Timmy’s boogeyman.\nAnd here, fellow congregant, I don’t mind saying, is where I started getting worried. Maybe it was the parked police cruiser I passed. Or the heavily-populated part of town where I was heading. But mostly it was this: the boogeyman was real. I knew who he was. Before my eyes the double-yellow line in the middle of the road stretched and bulged, a seam that barely held back a tidal surge of spiders.\nThe sky darkened. I drove faster. Shut my eyes. But with my eyes shut I could hear them, scritching away, three fat gray furred spiders stuck under the sun visor. The warmth got warmer, the tether pulled tighter, and it was him, my son, my Timmy, the boy I abandoned, the boy whose heart I broke by siding with his father, his boogeyman.\nWhen I arrived, her car wasn’t there. That was one blessing. Carolina Bugtuttle was out, of course, working hard, neglecting her son and husband, keeping the books and preparing the pamphlets down at Christ the Healer, so focused on God’s reward for her in heaven she failed to see the one he gave her on earth, because God is merciful, God is kind even to the unkindest, lavishing largesse on selfish gossipy wenches.\n“Beth,” he said, opening the door.\n“Hi, Colby,” I said, to Brent’s dad, Carolina Bugtuttle’s husband.\nColby, Pastor Jerome had said, the night they met, the night I’d been trying to prevent in the six months since we got married. What the hell kind of a man is named after a cheese? Then he gave me that chin-twitch that says Laugh At My Joke, which is what you sign up for when you say Til Death Do Us, so I laughed, but maybe not as much as I normally did, because then he gave the subtle head tilt that says You Have Disappointed Me—but to be honest I knew Colby before I ever heard such a cheese, and to this day when I taste it I think of him, and hold it in my mouth until it is gone.\nIn the webworld, Colby Goldfarb stood before me precisely as he was when we were eighteen, in the parking lot outside Crossgates Mall, lit up by arc-sodium lights that turned him amber in that pelting rainstorm, right after I said the sentence I’d spent all week working up to, the one that broke his heart, and mine to boot, but mine didn’t matter, and he stood outside the car, looking in, at me, for so long. Thin, young, wide-eyed, all hipbones and elbows and nose and thick black hair. He was even soaking wet, here, now, although his skin was dry and warm as summer when he stuck out his hand and I shook it.\n“You’re looking for your son,” he said.\n“Is he here?”\n“I am under strict orders not to answer that question.”\nHe grinned, and my mighty unbendable momma-bear knees buckled.\n“What the hell, Colby,” I said, pushing past him, hand hot on his shoulder. “I would have called you, if Brent was hiding out at my place.”\n“That’s because you’re a better person than me.”\nI wasn’t, and I wondered if I really would have called him. I had no idea what I’d do to keep my son’s trust, because I hadn’t had it in a long time. Because I didn’t deserve it. Because I’d left him to fight his boogeyman alone. I had failed him so utterly. The magnitude of it sent twitches down my arms, started spiders leaking from the door hinges.\nColby’s smile made my head hurt, ushering me in, the smile of a man who loved his son, who didn’t believe they were mortal enemies and his mission in life was to crush the child’s spirit.\n“Sit,” Colby said, gesturing to the kitchen table, turning to the Keurig machine to make me a coffee. Spiders swam in the thing’s water tank. At any moment now the burst would shatter my brain and my son’s.\n“Where is he?”\n“In the basement.”\n“With Brent?”\n“Do you have any secrets from your husband?” Colby asked, and his freckled face was so earnest and sad I knew he wasn’t talking about him and me. The fridge shook, rumbled, packed with spiders to the point it could not keep closed.\n“Of course not,” I said, because no other answer could be admitted, let alone uttered aloud.\n“Could you keep one? A big one?”\nStuck to the fridge was a gorgeous drawing, in colored pencils, of a blue-and-red feathered ceratosaur. Colby’s son was an incredible artist. “Brent’s favorite dinosaur,” I whispered. “I saw one of those this morning. It led me here.”\nColby raised an eyebrow, leaned in, scanned the white of my eyes. Laughed out loud, the magnificent heaven’s-trumpet sound I’d given up on ever hearing again. “Bethesda Wilde, are you webslinging?”\n“Shut up,” I said.\nHe laughed harder. “Is it fun? I confess there’s a part of me that’s always—”\n“I’m not doing this for fun,” I said, standing up, getting angry on purpose because anger was safe, anger was armor, against the spiders, against what Colby was doing to my gut; anger was the weapon my husband used whenever he didn’t know what to do, and there had to be something other than my son that I had to show for all the time I’d spent with Pastor Jerome. I headed for the basement.\n“No no no,” Colby said, genuinely afraid, actually running, but I had a head start and for all my size I can move fast when I need to, and I got to the basement and wrenched open the door and slammed it behind me and locked it, and stomped down into the laundry-and-mildew smell of Carolina Bugtuttle’s underground nest.\n“Beth, stop,” he said, pounding on the door. “Listen to me. You can’t. Okay? Respect their privacy. You’ll only—”\nA cocoon, I guess, is the best I can do when it comes to describing what I found in the basement. A globe of densely-wrapped spiderwebs the size of a small car, lit up slightly from within, and I felt him in there, smelled him, my son, and I put my hands against it, felt its heat, felt the warm safe world it contained, and slowly seized fists full of spiderweb and ripped, tore it open, watched thickened water slosh out in a rush that reminded me of giving birth. Upstairs, I heard Colby unscrewing the lock to take off the doorknob.\n“Timmy!” I screamed.\nTwo shapes churned out of the web cocoon—dolphins, I thought, but then not, because fast as blinking they were boys, young men, drenched, hands clasped.\n“Mom?” my son said, and let go of Brent’s hand like it had suddenly caught fire. “What the hell, mom!”\n“Where were you?” I asked. “What’s in there?”\n“In . . . there?” Timmy said, and turned to take in the ruined cocoon. “Wait—you can see this? You’re here? You’re in the web with us?”\n“Now, look,” I said, stammering for the explanation I’d practiced, back when this was all seemed like a good idea.\nTimmy laughed out loud. “Look, Brent! A ceratosaurus. We’ve been trying for months to make one.”\nThe dinosaur stood between me and Colby, who had just arrived, disemboweled doorknob in hand. Father and son exchanged a glance that said let’s keep quiet, let’s let them say what they need to say, and I ached for that, for the kind of trust that lets parents communicate wordlessly with their kids.\n“I want you to come home with me, Timmy. We’ll get you help. One of your father’s friends runs a Christian rehabilitation clinic—”\n“You think I’m a drug addict, mom?” He started laughing again. “I told you guys. I told you my parents work so hard to not see the truth that they don’t know how to stop.”\nBrent started to say something, then decided against it. They watched me put the pieces together. These boys, these men, my teenage son, my teenage lover, his teenage son who was my teenage son’s lover; they dripped with blue-green amniotic fluid and watched the truth widen my eyes, watched me fight it all the way.\nThey watched me grasp the magnitude of my son’s sin. The unthinkable, unimaginable crime he had committed. Where did it come from? How did he learn it? How did he fly in the face of my husband’s efforts and my own, our lifetime of accumulated craven cowardice? How did he find the courage to commit the sin of choosing love, the bravery of going for what your heart wants instead of the path a parent chose for you?\nPeople fear spiderwebbing for all the wrong reasons. Going mad, having a breakdown, seeing inside your own soul—none of those should scare you. The most frightening side effect is also the one people crave it for: empathy. To truly feel what someone else is feeling, to see the other as yourself, to watch your ego obliterated in the face of universality—that’s a trauma you may never recover from.\n“Tim,” I said, but could say no more. Not yet. He had never turned into something else. He was what he always was. His father couldn’t handle that—hell, I wasn’t sure I could handle it. But I had done him wrong, had sided with his father, because it was easier. And what irony: I took the drug to bring my son back to me, and instead the drug brought me back to my son.\nColby came closer, put one hand on my shoulder. “Beth,” he whispered, “I think you and Tim should talk.”\n“Okay,” I said, at last, furious, miserable, delirious, hurt at how little I knew my son, frightened by what he was, how much I had to atone for, how long it might take for him to forgive me, how long it might take me to forgive him, sad at all the paths I hadn’t chosen, but ready, for whatever would come, and I said Okay again, letting it encompass so much more than the sentence he’d said, letting it settle like an unfurled bedsheet onto the hard new decisions I finally felt strong enough to make. Like choosing my son over my husband.\nThis, then, all of this, is part of that okay. Print this blog post if you dare, Jerome, but since I know you won’t I’ll let it stand as a message from me to you. The Story of Where Things Stand. The hard-earned blood-soaked spiderweb-wrapped shreds of insight I earned by descending into the underworld for the sake of love. My gift to you. My one scrap of true wisdom. What to do when your child strays from God.\nSo. When your child strays from God you should praise Him, for putting a mirror in your hand so you can hold it up to yourself—if you have the stomach for it. When your child strays from God you should thank Him, for giving us the freedom to make our own mistakes, and the strength to maybe one day find our way back.\nSam J. Miller is a writer and a community organizer. His debut novel The Art of Starving (HarperTeen) was one of NPR's Best Books of 2017, and won the Andre Norton Award. His current novel, Blackfish City (Ecco Press; Orbit) is an Entertainment Weekly \"Must Read\" and was called \"an action-packed science fiction thriller\" and \"surprisingly heartwarming\" by the Washington Post. He's a graduate of the Clarion Science Fiction & Fantasy Writers Workshop, and a winner of the Shirley Jackson Award. He lives in New York City."}