{"fingerprint": "evqEUJMm+djei3O71fXbJfy9uL0=", "sitename": "Clarkesworld Magazine", "title": "Operation Spring Dawn by Mo Xiong, translated by Rebecca Kuang", "author": "Mo Xiong; Rebecca Kuang", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mo_11_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Operation Spring Dawn by Mo Xiong, translated by Rebecca Kuang", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "12250 words, novelette\n Operation Spring Dawn\n 1\n I was taught that when the Great Frost first descended, humans were in the middle of a great world war.\n I don’t know which world war this was, nor do I know who was fighting who. I wasn’t born—rather, I wasn’t produced—until twenty years after it ended. By then, it had become a distant story, as remote and meaningless as the beginning of the Common Era two thousand years ago, or the demise of the triceratops two hundred million years ago.\n “Listen well, Little Snow. Do not dwell on the past. Focus on the possibilities of the future.” The artificial intelligence that all we children called “Mother” was always repeating this lesson to me in warm, gentle tones. “You are a key that will open the lock to tomorrow. You are a torch that will melt away the cold of the past. When you are asked what to do, remember these words, and then trust your own judgment. Choose the best future.”\n The key and the torch. Together, these symbols formed the insignia that could be found everywhere in the temperature-controlled dome where I was born and raised. Under each insignia, which symbolized hope and enlightenment, workers and researchers were always rushing about. The dome wasn’t very large; one could see both ends from the elevator tower at its center. Outside its massive glass walls stood tall buildings and mountains, among which the tiny residences that surrounded the dome on all sides didn’t look like they belonged. That was where the refugees lived. They resembled walking corpses in their old, shabby temperature regulation suits, clinging to life purely for the sake of the next days’ relief rations.\n When I think back to those years, I remember that small white petals were always floating around the air outside the dome; sometimes in dense clouds, sometimes in sparse trickles. They reminded me a bit of the pretty little flowers I’d seen before in the biology lab. Mother told me that those petals were something called “snow.” The humans of my era hated and feared snow, because they believed it brought bitter cold and calamity.\n But when the snowfall stopped entirely, that meant the Great Frost had fully descended upon the world, putting all living things to endless sleep.\n The temperature inside the dome was always set to 22 degrees Celsius. Mother claimed that this was the temperature best suited for human habitation, but we always thought it was a bit too hot. The other children and I were always asking if we could go take a look at the world outside, but Mother always refused us. It said that when I was eight years old and fully mature, then I would be able to move around in environments of minus 20 degrees without a protective bodysuit. But at that time, the temperature outside the dome had already dropped to minus 25 degrees . . . and was continuing to fall at a slow but despair-inducing rate. I couldn’t imagine what it was like to live outside the glass walls. Whenever I looked out at the increasingly dense clusters of refugee huts outside the dome, I couldn’t help but feel afraid.\n “If those people know that they’ll never be let into the dome, then why do they keep clustering around us?” I asked.\n Mother replied, “Because even if they can only ever glimpse what’s on the other side of the wall, that is enough to give them the strength to keep on living.”\n Sometimes there were sunny days when the clouds and snow were swept away in a dazzling flash. Tens of hundreds of planes would fly in formation through the blue sky, leaving behind the shining rays of spring. The refugees would shake the earth with their cheers. I remember that the first several times this happened, the people inside the dome stopped to watch, hugging each other in celebration. But as the sunny days became less and less frequent, the planes also became a rarer and rarer sight, and the mood inside the dome gradually dimmed day by day.\n Only Mother, who was solely responsible for our care and education, was never affected. Mother was like an intricately designed mechanical clock; all of its parts moved according to a precise, predetermined rhythm and speed. No matter what the pressures imposed by the outside world, Mother proceeded methodically, never early by one minute nor late by a second.\n At last, the day came that the planes stopped appearing in the sky, and the sunlight disappeared. During a storm that nearly covered the entire dome in snow, the soldiers and their leader found Mother. They stood in the dome before all of us children, tears streaming down their cheeks.\n Those brave souls had lost their homes. During those ten days of devastation wreaked by the Great Frost, the temperature outside dropped to minus sixty degrees, exceeding the limits that most facilities on the planet’s surface could bear. This meant that during those ten days, at least fifty percent of humanity or more had turned to ice and dust. Of course, this included those refugees huddled outside the dome.\n For the first and last time, Mother decided to alter its schedule. It decided to deploy all of the children early.\n “Remember your mission, Little Snow.” Mother entreated me over and over again as I entered hibernation, like an old woman sending away her only son. “Turn the key. Light the torch.”\n “Turn the key.” I repeated the words under my breath like a prayer. “Light the torch.”\n That day—November 13, 2129—was just twenty-seven days short of my eighth birthday. Operation Spring Dawn had officially begun.\n All of this happened twenty thousand years ago.\n There were still ninety thousand years to go before the end of the Great Frost.\n 2\n The moment my hibernation chamber cracked open, an unnaturally bright light shone onto my face, and a strange odor wafted into my nose. I coughed—well, perhaps I screamed—as my consciousness awoke from senseless darkness and returned to my long-slumbering body.\n Several people appeared before me, all rather young and petite. They wore some sort of white bodysuit that I had never seen before, and they each carried backpacks that seemed rather too large for them. They looked me up and down like doctors examining a seriously ill patient.\n “Physical condition is quite good. Muscular atrophy is within the bounds of recovery. Predicted rehabilitation time should take about . . . fifteen hours.” A girl with hair trimmed just beneath her ears reached out and propped my eyelids open. Her gender wasn’t immediately obvious; it wasn’t until she opened her mouth to speak that I realized she was female. “Initiating the iris scan.” That was odd—I hadn’t seen her take out any equipment that looked like it could perform an iris scan. “Scan complete. Identity confirmed as Operation Spring Dawn Key Number Twelve, one of the final products of the Snow Child Gene Modification Project by the First Scientific Research Corps in the Zodiac Allied Nations Qinling Garrison.”\n “Just call me Little Snow.” I tried smiling at them, but most of them remained expressionless. Only two girls, both wearing their hair in ponytails, nodded back at me.\n “Are you from the engineering department?” I asked.\n They exchanged a glance, then looked toward a girl with short hair. She was dressed differently from the others, but she carried the same massive, coffin-shaped backpack.\n “Hello, Key.” Her voice was childishly nasal. “We are perpetual motion homunculi created at Ayr Laboratory. I am P05. My duties are record-keeping and providing informational assistance.” She turned around, pointing to the girls with ponytails that had nodded just then. “These two, C09 and C10, are responsible for guarding and investigation. The rest are part of the D-series, who are responsible for protection and operations.” She gestured at them. “They number from D39 to D41. And here, of course, is our captain, D42.”\n This was nothing like what I’d been told to expect. I’d never heard of any Ayr Laboratory, nor had I ever heard of perpetual motion homunculi. But given that they outnumbered me, and more importantly were armed with strange weapons that quite resembled guns, I had no choice but to believe them for the time being. After all, I was just a Key, and my only mission was to find my Lock. My mission wouldn’t change even if Hitler came back to life or if aliens invaded the Earth. Besides, according to the original plan, I was supposed to awaken eighty thousand years after the Great Frost began. Everything I’d known before—countries, nations, history, civilization—should have undergone massive transformations by now.\n “Then are you here to initiate Operation Spring Dawn?” I asked. “Is it already time?”\n “It is not, but we’re out of time. Or, more accurately, you’re out of time.” P05 went on to calmly explain, sounding not one bit like someone who was in a rush. “According to the plans formed at Ayr Laboratory, we came out of hibernation six months ago and set out to find a Key like you in order to initiate Operation Spring Dawn in advance.”\n “In advance?” I had a bad feeling about this. “How . . . how far in advance?”\n “By ten thousand years, brother.” A small girl with hair hanging past her shoulders impatiently gestured for the others to lift me out of the hibernation chamber. “While you’re recuperating, have P05 catch you up.”\n She spoke very quickly. I noticed the small letters on her jumpsuit—“D42.”\n I had encountered autonomous robots before in the dome. They were nowhere near as intelligent or adaptable as Mother, but they could understand simple commands, and could even cooperate with other robots to perform complicated tasks. But these homunculi were something else entirely. Their bodies weren’t comprised of clunky metal frameworks, but rather looked pliable and detailed. I learned that, like engineering machinery, they could lift rocks several times their own body weight and could twist into positions unimaginable for humans. Most incredible was the processors contained within their little bodies, which displayed intelligence and emotions mimicking those of humans more closely than Mother ever could. They could both think critically and communicate. While they were waiting around, they chattered to each other through electric noises that I couldn’t understand. The two C-type homunculi even appeared to joke around and laugh at each other.\n Without a doubt, the technology that produced these creatures far surpassed the state of technology that had existed when I had entered hibernation. For after humanity had suffered the devastation of those ten days of the Great Frost, they had not placed all of their hopes on improved humans like me. That was the driving purpose of Operation Spring Dawn.\n Without outside interference, the hibernation chamber would have spent a full week restoring my bodily functions before it woke me up. But the homunculi had taken over that process. I found it hard to believe, but they could with a single injection do a job that I had thought required a full set of complex medical facilities to accomplish.\n “Here’s the situation, Little Snow.” When my recovery was nearly complete, P05 began her explanation. “You are the first and only living Key that we’ve found, so it’s likely that we are the only surviving rescue team in the world.”\n “Rescue team?” I’d never imagined that this term might have anything to do with me. “Who are we rescuing?”\n “Anyone.” She shrugged. “Anyone who’s still alive.”\n 3\n I’d always thought that engineering was more of a magic than a science.\n Engineering had allowed humans to erect massive structures like Stonehenge during primitive eras of hunting and gathering and to build dozens of pyramids when basic needs like food and shelter were still hard to come by. Engineering lay behind the Great Wall, the Eiffel Tower, and the Hoover Dam. Humans had used engineering as a tool to defy the laws of nature and to achieve miracle after miracle, until nature fought back with the most intense super ice age in history.\n Solar fluctuations were not the only cause of the Great Frost. Its devastation was rooted in the impotence of humanity beset by war; in plans that from theory to initial execution appeared flawless, but in reality, proved to be nothing more than a drop in the bucket in the fight to preserve Earth’s ecosystem. Humanity’s opposing factions had joined together and decided to abandon all hopes of saving the entire planet, choosing instead to flee. They hoped that at least human civilization, if not all of humanity, might survive until the end of the Great Frost.\n Using data from solar probes, scientists had conducted precise calculations to predict that the super ice age would last for a period of 110,000 years. It would reach its peak after about 15,000 years before slowly receding; 100,000 years later, it would decline to levels similar to those seen during the last great ice age.\n No engineer in human history had ever imagined that constructing facilities that could last 110,000 years could be anything more than a pipe dream. But by the era in which I was born, every effort had been made to extend that time constraint to 30,000 years, after which I was scheduled to awaken.\n All projects to save the world revolved around this time constraint after it had been determined. In 30,000 years, the earth would still be frozen, but the environment would be gradually improving. The point of Operation Spring Dawn was to speed up this improvement through artificial means. The operation was not one plan or project in particular, but rather encompassed all possible plans and projects. Every attempted scheme created by future generations was tacitly approved to be a part of the operation and would launch synchronously when the right time came.\n Given the passage of time and changes in the environment, it was very difficult to construct an organizational structure for overall coordination. On the other hand, it appeared quite feasible to train a group of people specializing in seeking out and activating those plans. Those people were the Keys—and the reason why Snow Children like me were born.\n “But I know all of this already.” I shook my head as P05 finished her explanation. “What does that have to do with waking me up early?”\n “Because your calculations were wrong.” P05 gave me a helpless smile. “During your era in the 22nd century, humans believed that their own creations could still operate regularly in this lifeless, frozen world for thirty thousand years. But by the time I was born in the late 36th century, the last remaining handful of scientists ran more accurate calculations and discovered that none of the equipment created by the technology and materials of previous eras could survive for that long.”\n So the true enemy of engineering was not the universe-encompassing entity of nature, but rather an entity outside of the universe itself. Time.\n “When we were sent into hibernation, Ayr Laboratory was also already on the verge of collapse,” continued P05. “When the data collection systems and production centers of basic industry collapse, their restoration will become impossible. All losses will become irretrievable, and the facilities designed to protect the protective facilities themselves will also cease to function. When that happens, those meticulously calculated plans will become nothing more than useless pieces of paper. That is why we came out of hibernation to find a Key before the theoretically determined date.”\n “We swear to defend humanity to the death at all costs.” D42 handed me a white, lightweight protective suit. “Key, are you willing to fulfill your responsibility, and help us execute Operation Spring Dawn?\n I hesitated. “I . . . I’ll try.”\n “Then we also hereby swear to you.” D42 pressed her left hand against her right shoulder and rose slightly out of her chair. Perhaps this was a polite gesture of her era. “We will defend your life to the death at all costs.”\n I noticed that only the longhaired D-series homunculi followed suit. P05 stood indifferently to the side, while C09 and C10 exchanged a smile.\n 4\n I had initially thought that I was in the dome, at least in the ruins of the dome. But when we left the cave where my hibernation chamber had been opened, I discovered that the world outside was utterly unfamiliar.\n There was no dome, no refugee camps, and no cities. Even the mountains no longer lay where they had before, nor had they kept their original shapes. Only 20,000 years had passed, but all traces of human survival here had vanished without a trace. All that remained was a boundless plain of dazzling white.\n And to think they had originally planned for the dome to last another 10,000 years.\n There were no clouds or snow in sight. The sun hung bright and beautiful in the clear blue sky, but I knew that it was only a sick and listless man, too weak to revive this silent world.\n The temperature was minus 72 degrees. Even a Snow Child like me, with genes altered to adapt to the bitter cold, couldn’t survive five minutes in this environment. Even wearing the futuristic protective suit that D42 had handed me, I could still feel the bitter chill in my bones. It was everywhere.\n The team had two conveyors, one large and one small. Both appeared to be rather simple, wheeled snowmobiles, but in a world entirely covered by thick white snow and sheets of ice, that was sufficient. The snowmobiles’ engines were like alien technology. They looked inconceivably tiny and lightweight, but the homunculi told me that they were as powerful as the engines of long-distance bomber aircrafts. These snowmobiles could rush at speeds of hundreds of kilometers per hour without stopping.\n They also seemed to be entirely self-driving. After I gave them the coordinates of our first destination, they spun around and started moving, though none of the homunculi were at the wheels. In fact, the homunculi inside my snowmobile began chatting amongst themselves as we drove. In my memories, activities like chatting were associated with activities like eating and drinking, so this reminded me of another crucial question:\n “What’s your source of sustenance? Our search for all of the pieces of Operation Spring Dawn will take us all over the Earth. It’ll likely take quite a few years or more.”\n “Sustenance?” P05 was silent for a second. “Do you mean food? We have nutrition capsules for you. You only need to take one per day. We have a five-year supply.”\n “Then what about you? Do you also take the capsules?” I’d never heard of nutrition capsules before, but they didn’t sound very appetizing. “And what about the snowmobiles? What do they use for fuel?”\n “Us? We’re perpetual motion homunculi.” She pointed to her backpack. “This is a portable thermal reactor. Both of the snowmobiles have one, too.”\n “Portable . . . thermal reactor?” I wasn’t a trained scientist, but given my role in Operation Spring Dawn, I’d been taught enough to understand broadly what she was talking about, and what it implied. “If you have this kind of technology, then why are you worried about the Great Frost?”\n “They only work for a few years after they’re activated.” P05 gave me a small smile. “Against something like the Great Frost, they’re not even worth a mention.”\n 5\n I’d thought that P05 was exaggerating a bit. Before Operation Spring Dawn was launched, humans had constructed hundreds of refugee cities both underground and on the seafloor. Aside from geothermal and hydrothermal energy, nuclear power had been these cities’ only source of heat and energy. If huge thermonuclear power plants were now the size of backpacks, then humanity’s ability to survive the super ice age had significantly increased.\n But when we reached our first destination, I realized I had been gravely mistaken.\n This place was called the Zodiac Tower. It was a refuge city complex built into the mountainside, comprised of surface domes, underground habitations, and mountain forts. It had been the new capital of the Zodiac Allied Nations. Theoretically, it held a stockpile of all of the materials relating to Operation Spring Dawn in the Eastern Hemisphere.\n When we were about five kilometers away from the target coordinates, we glimpsed the first man-made structures we had encountered since we started our journey—a row of buildings that looked like military fortifications, connected to one another by a low wall. Although they had been entirely covered by ice and snow, and although none displayed a single sign of life, the sight of them boosted my confidence. These buildings weren’t within the boundaries of the Zodiac Tower, which meant that even after the Great Frost had covered the earth, my fellow humans here had still managed to expand outwards.\n But my confidence soon ebbed. Along the road to the Zodiac Tower, we saw an unceasing series of bizarre buildings that clearly did not belong to the same era. They were of varying heights, uneven and mismatched. None showed any signs of use, not to mention any signs of human beings.\n C09 and C10, who were riding in the snowmobile in front of me, requested to examine the surrounding buildings. Before D42 had given the order, they stopped their snowmobile and stepped out, weapons at the ready.\n “These kitties really don’t understand organization or discipline . . . ” D42, looking indignant, hurried to join them.\n The homunculi didn’t carry any additional equipment aside from their weapons and backpacks, but they wore helmets just like mine. This confused me, since they didn’t seem to need to breathe, and shouldn’t have been affected by the cold.\n “It’s to protect the sensor systems distributed across our skin. That’s why we also have to wear protective suits.” P05 tapped the glass front of her helmet. “The face is particularly important. Our main perception systems are concentrated in this area.”\n “Then why were you designed to look like people?” My confusion had only increased. “In my era, robots were designed to take all kinds of forms most suited for their tasks. Some had four legs, some moved on wheels . . . but there weren’t any that looked like humans. That form was too inefficient.”\n “You’d have to ask Dr. Ayr that.” P05 added mysteriously, “He said that this was the form of God.”\n Examination revealed that the buildings scattered around the Zodiac Tower were indeed built in different eras. The oldest were built around 2300 AD, and had all now been reduced to crumbling ruins. The latest could be dated to around 4300 AD. A piece of relatively clear writing revealed that the residents had stopped using the AD system, and instead adopted a calendar that seemed to involve peoples’ names. But the length of each name era wasn’t very long.\n Over about five hours of reconnaissance, we gradually approached the Zodiac Tower itself. The buildings by the roadside appeared to use materials similar to those from my era. It appeared that there hadn’t been many engineering developments. Perhaps this explained why not a single building had been built after 5000 AD. The stagnated state of technology had no way to cope with an increasingly hostile environment. The residents in the surrounding buildings must have retreated back to the Zodiac Tower in the end.\n At the top of the mountain was a large, tightly sealed door about a hundred meters wide. Its operating system had long been destroyed—not by the Great Frost, it seemed, but rather by human activity. We were unable to open it from the outside, and were also unable to communicate with anyone on the inside, so D42 asked me if we ought to open it by force.\n “Why are you asking me?” I asked.\n “Because you’re the Key,” D42 explained. “If our actions threaten Operation Spring Dawn, then you are obligated to stop us.”\n At first, I didn’t understand what she meant. I only realized why she’d asked after she started using the weapon in her arms. At first it seemed like just a water pistol, but then it shot forth several streams of high-pressure liquid, which melted through the door that must have been four or five meters thick as easily as concentrated sulfuric acid dripped on tofu. This created a hole just large enough for two people walking side by side to pass through.\n The interior of the Zodiac Tower was deathly still. Perhaps because of its insulation from the outside environment, the structures inside were fundamentally intact. On the other hand, the vast majority of utensils and equipment had become useless after long years of wear and tear. Finding any threads of Operation Spring Dawn here seemed impossible; we couldn’t find even a gram of food or a single working piece of equipment.\n Compared to the dome, the Zodiac Tower felt terribly large. We fumbled around in the darkness for about three days. At first, we were worried we might stumble into a rigged trap or be ambushed by survivors. But in the end, only C09’s ghost stories could rouse my spirits. At last, following the ruined road signs, we found one of the Locks prepared for Operation Spring Dawn: a spherical room barricaded behind a composite armored wall without any visible entrance. I spoke the words, “Turn the key, light the torch.” The room trembled, and then a hole blew out from the inside. I entered warily as the homunculi watched.\n The interior contained only a simple recording modem. Its design was simple, and it required very little energy consumption. Its text display told us of the Zodiac Tower’s fate.\n In the first few years following the descent of the Great Frost, the Zodiac Tower was the biggest refuge city on the planet. Its creators believed that to keep society functioning normally, it had to accommodate people from as many different classes as possible, ranging from farmers adept at agriculture to Special Forces soldiers. Its population of two million was composed of all sorts of people. Combined with a number of smaller satellite refuge cities, the Zodiac Tower formed what was theoretically a self-reliant disaster defense system. Its inhabitants’ lives were dedicated to preparing for Operation Spring Dawn. They had chosen to live in a place that had already become a frozen hell. Just like their ancestors, no matter what kind of hardships they experienced, they refused to leave their homeland or abandon the earth beneath their feet.\n But they had underestimated the might of the Great Frost. As temperatures continued to fall, their society—already operating under maximum capacity, with a complex social structure with almost no capacity for error—was subject to a slow and painful test. Small issues—minute decreases in fertility rates, temporary malfunctions in the drainage system, the deliberate sabotages caused by inhabitants suffering nervous breakdowns—began to pile up. It happened slowly, but in a closed system where it was difficult to add positive factors, the negative factors eventually reached a threshold and triggered irreversible consequences. And then there were the unpredictable and unstoppable factors—small mistakes by personnel caused the facilities responsible for scientific research to explode, abnormal movements in the earth’s crust forced entire sections of the underground city to be abandoned, and accidental leaks of nuclear fuel contaminated the hydroponic farms that hundreds of thousands of people relied on for survival . . . Though the probability for such accidents were only one in a million, over the indifferent passage of time, that probability eventually became one hundred percent.\n The world had changed, but people had remained the same. The increasingly challenging living conditions incited more and more discontent and despair. When faced with the classic trolley problem of which lives to prioritize, of course the inhabitants disagreed. Disagreements led to splits, and splits led to internal strife. The fact that the doors had been locked from the outside indicated some kind of rupture, and the empty facilities hinted that perhaps even corpses had become a resource worth fighting over. It didn’t matter what precisely had happened, or how the survivors had tried to prevent it. Before the Great Frost had reached its zenith, the Zodiac Tower had already fallen.\n “One might say they got lucky,” joked C09. “They didn’t have to experience the living hell of minus 120 degrees.”\n But if this place had already become a hell on earth . . . I wondered, what was the difference between twenty degrees and minus 120 degrees?\n 6\n The information we obtained from the Zodiac Tower contained several more coordinates for locations that were part of Operation Spring Dawn. They hadn’t been marked as part of the original plan but had clearly been added in later. We found them one by one, starting with those nearest and then moving outward. The large majority of coordinates led to ruins of refuge city complexes like Zodiac Tower. The golden age of refuge cities had been around 2300 AD, when the success of Zodiac Tower had spread across the world, creating something like a new empire. But when Rome fell, the fall of its empire was inevitable. There were two coordinate points where we found nothing at all. Perhaps they had been submerged by currents of geological change—but we had neither the time nor energy to conduct archeology digs.\n Three months after I awoke from hibernation, we arrived at the second crucial location included in the original plan—the Nanjing Stronghold, once the general headquarters of the Zodiac Allied Nations. It had remained standing after two nuclear strikes—or at least had been rapidly rebuilt, becoming a symbol of the fighting spirit of the Eastern Hemisphere.\n The stronghold’s general shape had remained intact. It looked like a giant shrine, and its imposing, curved exterior was visible from miles away.\n The Nanjing Stronghold’s guiding principle was the complete opposite of the Zodiac Tower’s. Its residents had completely abandoned the idea of creating a well-rounded society. From the start, its plans had been shaped according the standards of military operations. They had left no room for retreat, but had thrown all their eggs into one basket, like the desperate English troops at the Battle of Agincourt.\n This philosophy was evident in the way they had focused all resources on their Operation Spring Dawn modem. Every piece of the stronghold defense systems had been designed to protect it. The military engineers responsible for its construction had disappeared after finishing their tasks; the defense system now relied entirely on the simple, crude, and easily maintained drones. Only a handful of officers had been left behind to command and coordinate. In order to conserve resources, they had abandoned their bodies; all that remained were their brains, floating in hibernation chambers.\n These soldiers had never been intended to last until the end of the Great Frost. They hadn’t even intended to last until the start of Operation Spring Dawn. All of the hibernation chambers were only designed for a lifetime of three hundred years, because according to calculations by the staff, after 2500 AD, the remaining refuge cities would have no way to organize enough military strength to launch expeditions. Thus, the deterrence system needed only to last for so long.\n By the time we arrived, the Nanjing Stronghold’s defense system had completely broken down. Ravaged by twenty thousand years of bitter cold and fierce winds, the outlying forts and missile launchers had become warped and distorted. It wasn’t clear why, but the stronghold’s interior structure was also damaged beyond repair. Now it was nothing more than a cave.\n Thanks to the machinery-level strength of the homunculi, it took only five days before we found another Lock containing a data storage modem. The soldiers’ caution was also apparent in the security around this room, which required vocal, iris, and DNA verification. The equipment had deteriorated so badly over the years that it was unable to verify my identity. In the end, we resorted to using the homunculi’s dissolving guns to force our way in.\n The Operation Spring Dawn plan stored inside the Nanjing Stronghold was blunt and vicious. All of the firepower of the Zodiac Allied Nations had been amassed and installed in hundreds of critical points, most of which were within what used to be the ocean surface, positioned where meteorologists had calculated that the great ice sheets would be the weakest. Upon the launch of Operation Spring Dawn, they would detonate in sync with the other programs. The explosions, strong enough to rip through the surface of the earth, would tear open layers of ice that were tens, perhaps hundreds of meters thick, thus freeing the oceans trapped beneath and accelerating the environment’s recovery.\n I retrieved the central detonator for the explosives. I didn’t know if the detonator or the explosives still worked, and we didn’t have any way to check. Still, this was the first time we’d achieved something significant.\n That night, I celebrated by eating an extra nutrition capsule. The taste hadn’t improved.\n Thanks to this small success, I learned that the homunculi not only looked like humans, they also displayed human emotions. This was particularly true of C09 and C10, who were beaming with delight, and were even wondering out loud what the ocean would be like. Even D42, who rarely spoke or smiled, seemed even more lively than before while discussing our next steps. I noticed that when she playfully referred to C09 and C10 as “kitties,” they would refer to her as a “doggy” in return. At first, I thought that these were just jokes about their series letters, but I later learned from P05 that these jokes were related to the homunculi’s designs.\n “The C-series were designed to act independently and think freely and critically,” P05 explained. “For tasks like standing guard and investigation, they need the ability to trust their own judgment. They’re very much like cats in that way.”\n “Then are the D-series really like dogs?”\n “Yes, the D-series homunculi are particularly loyal and cautious. They’re the muscle behind all operations. Their weaknesses are rigidity and difficulty adapting to unexpected situations, so they need others to complement their skill set.”\n I glanced at P05’s short, brown hair. “What about you? What are your special characteristics?”\n “Well, which animal’s name starts with a P?” She laughed. “What animal is especially intelligent, but lazy?”\n 7\n Although the ocean had not yet frozen in 2129, I had never left the dome before I entered hibernation, so I’d never had the opportunity to encounter the ocean in person.\n To be honest, I was rather disappointed when we reached the coastline. The distant horizon was nothing like what I imagined. It was near impossible to distinguish between the sky and the ocean, which were both sheets of pure white. We’d long grown tired of this view on our journey.\n All of the facilities near the ocean had been buried by ice and snow. I knew there was an Operation Spring Dawn base here, though it was hard to pinpoint its location. It should have been a site containing millions of hibernation chambers, without any habitation or research facilities. Its energy expenditure would have been very low, relying entirely on ocean currents at the bottom of the sea for power.\n According to P05, long before her era, humans had abandoned all hopes of surviving in the harsh environment. Using very little resources, they used new and durable materials to create many such hibernation cities. It wasn’t clear to me whether this had worked. We didn’t know whether those hibernation chambers were still functioning; whether people inside had been fortunate enough to survive like me, or if they could be awakened in time after the Great Frost had ended.\n C09 volunteered to dive into the sea to investigate. We had to empty three dissolving guns of ammunition, but we succeeded in drilling a small hole through the thick layer of ice. It looked like a tunnel to hell. C09 and C10, however, were as excited as children who had just discovered a new toy. They jostled to be the first to jump inside.\n They couldn’t easily move under water carrying the heavy nuclear reactors, so they both had to rely on the energy stores within their bodies. That restricted their activity window to six hours. They were unable to find the hibernation site, not to mention further clues of Operation Spring Dawn. The one piece of good news was that the marine current generator at the bottom of the ocean still worked—and appeared to have been carefully maintained year after year.\n C09 looked disturbed as she emerged from the water.\n “I felt like something was watching us.”\n “Was it a sea creature?” P05 seemed skeptical. “The deep ocean ecosystems weren’t as affected as the ocean’s surface. It’s possible that there are still flora and fauna down there.”\n “It wasn’t like that,” C09 insisted. “The thing was very smart. It followed us for a while, but never revealed itself.\n “Then it’s just an animal smart enough to follow your tracks while staying hidden,” D42 said dismissively. “Let’s go. There’s a whole planet full of humans waiting on us. Let’s not waste our time on sea creatures.”\n 8\n Something happened a month later that confirmed C09’s intuition. The morning we left the Tanegashima Colossus, we hit a turning point in our journey.\n We were sitting around the frozen gulf, excited about our latest success. Tanegashima Colossus was another refuge city, much smaller than the Zodiac Tower, that had been built around the Tanegashima Space Center. Experts on space transportation from both the Zodiac Allied Nations and the rest of the world had concentrated here. Before the changing atmosphere and dwindling resources made space transportation impossible, they had spared no effort to conduct hundreds of launches. In the year 2270, they had even constructed an enormous space station named Luna, where they tested whether humans could hide out the Great Frost by living in outer space. I had no way to contact Luna, but judging from the ruins of the command room, I could easily imagine its fate.\n The space station had ultimately come to nothing, but the Tanegashima Colossus’ other project was quite the spectacle. Starting in 2150, they had mobilized all of the technological power in the Pacific Rim to build and launch a large-scale warming system into space. The last unit had been launched in 2435. After that, the Tanegashima Colossus had deteriorated at a startling rate, like a flower depleted of life after producing seeds.\n The warming system wasn’t worth much against the devastating yearlong blizzards. But once the Great Frost had receded to a certain level, the system’s collapsible focusing lenses would unfold, and focus the gradually restored sunlight onto the earth’s surface. If even a small region on Earth could be restored to temperatures that could sustain life, then an oasis would form in the middle of the boundless ice. And then, inch by inch, it would seize back the rest of the planet.\n After all of this, Earth’s space travel resources had been depleted. Valuable accumulated experience and technological progress were now missing within these ruins. The Lock contained only the warming system control facility and instructions on how to activate it. The control facility had deteriorated too much to boot up, but the homunculi used some kind of oily sludge to restore it. Its self-diagnostic indicated that surprisingly, about half of the dormant satellites in orbit could still be activated.\n This was without a doubt the most valuable finding we’d made so far. Compared to all the other ludicrous plans we’d uncovered, which now seemed like mere drops in a bucket, the warming system was the trump card of Operation Spring Dawn. And to think humans had achieved this in just the first two to three hundred years after the Great Frost began. Between then and when I had awoken, another 21,800 years had passed.\n “Don’t get your hopes up.” P05 was still as calm and levelheaded as ever. “The persistent harshening of the environment cut off the researchers’ access to resources. Technological development became increasingly difficult. Even if scientists reached a breakthrough, they would have had no way to turn it into reality.”\n “But aren’t you proof of technological progress?” I rebutted. “The materials you’re made of, your artificial intelligence, and your energy sources are far more advanced than any of the technology in the ruins we’ve come across so far.”\n “That’s because when we were created in year 3589 AD, Ayr Laboratory had become the very last scientific research center on Earth.” P05 shrugged. “That year, there was a very brief improvement in the climate that lasted about a couple of months. The people who still harbored a thread of hope in science, including those who had already lost the ability to do research and development and were simply risking everything to maintain scientific texts, accumulated all of their findings and sent them to Ayr Laboratory. Think of it like this—after nearly 1500 years of humanity’s efforts to combat the Great Frost, in the end, less than a hundred of perpetual motion homunculi like us were created.”\n “A hundred? Then what about the other homunculi?”\n “We’ve never seen them,” interrupted D42. “It’s very likely that we are the only ones who successfully awoke according to schedule . . . just like how, among all those Keys, we were only able to find you.”\n While we were discussing Ayr Laboratory, C09 discovered something suspicious under the frozen sea.\n “Do you all see that?” she asked.\n I wasn’t the only one who hadn’t noticed. None of the other homunculi had C09’s keen senses. But D42 still ordered the team to spread out and track the still-unidentified target following C09’s guidance. They moved very slowly, perhaps so as not to startle the creature, or perhaps out of consideration for my slowness. It had to be the latter—on this sweeping plane of white ice, there was nowhere to hide.\n Once we were about a kilometer away, the creature sensed our intentions. It began retreating underwater with strange movements. The homunculi immediately quickened their pace, shedding their nuclear reactors to run faster.\n I couldn’t get a clear look at the fight—the hunt was over in a flash. At first I didn’t understand why the homunculi had been so vicious—they’d attacked without trying to first establish contact. But D42’s explanation made sense. They were likely the last rescue squad on Earth, and I was likely the last Key on Earth. They had to protect the world’s last shred of hope, no matter what the cost.\n The fallen prey was a bizarre looking creature. At first glance, it looked like a black hunk of flesh, about as large as the two snowmobiles put together. The bulb that comprised its middle resembled some kind of flower bulb. A dozen tough, pliant tentacles sprouted from its back. Though I had never seen the ocean before, I could tell instinctively that this was no simple creature of the sea. Its body was imbued with an unnatural power and beauty that could only have come from engineering.\n As everyone watched, P05 hesitantly placed her left hand on the creature’s shell, which was scaly as snakeskin.\n “Its composition is forty-five percent organic matter and fifty percent . . . ” She paused for a moment. “Wait, is this black helo clay? That’s the same basic material we’re made of!”\n “Which part of it?” D42 asked anxiously.\n P05 took two steps backward. Looking amazed, she gestured down at the creature. “All of it . . . apart from its inner organs, this thing was made entirely from the same black helo clay as we were.”\n “That’s not possible,” D42 said. “I’ve never seen anything like this in Ayr Laboratory. And doesn’t mixing it with organic matter degrade its performance?”\n “We may have never seen it,” P05 said. “But it doesn’t rule out the possibility that after we were put in hibernation, the laboratory made some improvements. Maybe . . . maybe this thing is part of Operation Spring Dawn?”\n As soon as she said this, all of the homunculi shifted their attention to me. In theory, as a Key, I should have been able to activate anything that was part of Operation Spring Dawn.\n I braced myself, stepped forward, and recited the phrase as if speaking a final prayer: “Turn the key, ignite the torch.”\n I’d only been trying it out for the sake of it. But to my surprise, the creature, which looked to be near death, actually responded. Its bulbous head turned slightly toward me, revealing one massive eye.\n I’ll never forget its somber voice as it spoke its peculiar final words.\n “What then? God, what then?”\n 9\n The homunculi dissected the dead creature’s corpse and confirmed that while its basic structure was composed of organic matter, including its entire digestive and excretory systems, the outer shell and limbs that facilitated its movement were made of the same super-material that P05 had called helo black clay, which was fully integrated with its organic parts. It was obvious that this creature could not have come from nature.\n This mysterious interruption didn’t alter our route. C09 wanted to seize the chance to keep investigating the ocean, but our captain decided it could wait until after we had activated Operation Spring Dawn. After all, the homunculi had near-immortal operating systems and nuclear reactors that could run for decades. They had enough time for anything.\n After some basic preparations, we headed out toward Pearl City, which lay near the center of the Pacific Ocean. In my era, the journey would have taken a week by boat. Even now, it still took us about three days of driving nonstop over smooth, endless ice.\n Pearl City had belonged to yet another faction formed before the Great Frost. I didn’t fully understand the particulars of the technology they’d favored; I’d only heard that it was a compound refuge city built on an island that used volcanic heat for energy.\n To be honest, I wasn’t very confident that humans could have survived for twenty thousand years in the center of the ocean. But this location did have its advantages—the tides at the bottom of the ocean not only provided cheap and easily harvested energy, they also provided extremely precious food resources during the ice age. At the same time, the city’s isolation from the rest of the world would reduce risk of internal turmoil in its first few years of existence.\n After seeing Pearl City—or, rather, the remains thereof—I decided these advantages weren’t worth much against the innate unpredictability of human nature. A desperate civil war had clearly occurred here, on a scale with consequences far scarier than what we had seen at the Zodiac Tower. Most disappointing was the fact that if P05’s readings were accurate, then Pearl City had lasted up until around 9000 AD—longer than any of the other refuge cities we had discovered so far.\n Because the entire facility had been reduced to such a wreck, it took us five days to find the Lock. It had sustained serious damage; it was riddled with bullet holes and covered with carvings that looked like religious symbols. It was hard to tell what had happened in this little room, but without a doubt, some brave warriors from an enemy faction had fought with all their might. After over a hundred generations, when the word “faction” had already lost its meaning, they had remembered their own mission. Though cold and starving, they had protected this ancient relic from the past, a relic that they perhaps had never even understood.\n They had still lost in the end. Like the majority of other sites we had found, Pearl City had fought and struggled, and had done its utmost to forge ahead and survive at all costs. But in the end, all that remained were worthless ruins.\n It was impossible to extract any information from the Lock. But while we were in a tomb-like cave filled with desiccated corpses, we found some kind of data repository. Countless storage components, which must have stopped working long ago, were stacked like books on a large shelf far larger in scale than any supercomputer I could imagine.\n Each storage component had a name engraved on the outside. At first glance they looked just like rectangular urns, but P05 recognized the interface between the components and the shelf.\n “This is a consciousness projection. All of these are.” Looking surprised, she pointed around the vast tomb. “This is a technology that digitizes the mind and uploads it to electronic devices. Our parents—that is, all of the staff at Ayr Laboratory—all used technology to leave their material bodies. That let them minimize their resource expenditure, which made it possible to keep the laboratory functional.”\n “But the consciousness projections here are too primitive,” D42 said. “These are probably prototypes of what they were using at Ayr Laboratory.”\n “Why would Pearl City develop such a technology?” I lifted the storage component in my hand. When I thought about the weight of the soul that had once resided inside, I couldn’t help but feel a sense of reverence. “Was it also to conserve resources?”\n “They might have been simply escaping from the world.” D42 shook her head in disdain. “They could hide inside worlds constructed within their own minds, far removed from all suffering, living happily for countless centuries until the maintenance failed or power was cut off.”\n “But if everyone chose to escape into these little boxes, then who was maintaining this simulated paradise?” I asked.\n “You might as well ask them.” D42 gave the mummified corpse at her feet a careless and contemptuous kick, which shattered the corpse’s upper body. “The collapse of civilizations begins with the abandonment of duty.”\n Duty? Looking at the clothes these corpses wore, which resembled shamanic priests’ attire, I thought it likely that they had long forgotten what consciousness projections were. They were merely honoring, on the vestiges of a bygone world, their forefathers who had entered the temple of martyrs.\n This had nothing to do with duty. The collapse of every civilization began with forgetting the past.\n 10\n After we finished our excavation in Pearl City, we bickered briefly over our next course of action. C09 believed that there were no refuge cities left on Earth that were still hospitable to human life, so she wanted us to refocus our time and energy on locations that contained hibernation chambers. D42 was adamant about pursuing our original mission. “We can’t leave a single person behind!” she insisted. “Even if we can’t save everyone, we have a responsibility to record how they perished.”\n Even I could sense C09’s dissatisfaction, but she simply pushed her hair back and gave a thin smile. She didn’t argue any further.\n As we set out that evening, the night sky was suffused with a glowing, gorgeous sheet of dark green light. It resembled a bridge stretching across the endless sea of stars, falling out of the sky toward the distant horizon. The rays of light cast off by the bridge were reflected off the great expanse of ice that was the Pacific Ocean. I’d never seen such a spectacular sight, let alone sat right in the middle of it, speeding along in a snowmobile.\n The homunculi didn’t need to sleep, but they had no interest in admiring the sky. They stayed focused and alert as we sped forward, glaring in suspicious anticipation at the ice.\n They thought the attack would come over the ice. They hadn’t predicted an ambush from within the surface itself.\n A gaping hole swallowed up the little snowmobile. Although C09 and C10 jumped out with incredible speed, they couldn’t do anything to keep the vehicle from plummeting into the deep water. The smooth incisions that appeared on the ice were the same as the marks the homunculi had made earlier, though these were much larger. The snowmobile I was on braked and spun around like a startled hare in danger, curving a long crescent arc on the ice. Even so, it was unable to escape the widening hole. As we capsized, D42 threw me out of the vehicle. I skidded about twenty meters across the ice, but before I could get up, I fell into another rift that had just opened beneath my feet.\n Are they coming for me? The question flashed through my mind as I fell into the water. Seconds later, the dark shadows that flocked through the water gave a definitive answer.\n Upon detecting the change in the environment, my protective suit automatically filled with air. But since I couldn’t swim, I still couldn’t break out of the impasse. The homunculi struggled to reach me but were warded off by the overwhelming number of attackers. As I thrashed helplessly, I used the flashlights on my suit to try and get a clearer look at my attackers. They brandished pitch-black tentacles, just like the creature we had seen a few days ago at Tanegashima. They roared as they crowded around me, blinking their terrifyingly large eyes: “Oh, God! It is God!”\n In the distance, the D-series homunculi were fighting like mad dogs to try to get me back, but the flock of creatures showed no interest in retaliating. One of them snatched me with a tentacle, and they all immediately retreated east. Their octopus-like bodies were clearly better suited for underwater movement. In a few seconds we had shaken off the homunculi with unimaginable speed.\n “Do not fear, god . . . ” As if it had sensed my terror, the creature holding me kept repeating those words of assurance in its deep, pendulum-like voice. “There is nothing more to fear.”\n 11\n When the Great Frost first descended on the Earth, the world’s elite who were involved in preparations for Operation Spring Dawn engaged in a fierce debate. Among them, one faction believed that it would be more reliable to have machines execute the plans than humans, because future generations of humans would still have to depend on machines to survive. They thought rather than creating genetically improved humans who were better able to survive in the ice age, it was better to entrust our hopes in artificial intelligence, which wouldn’t be afraid of the harsh climate or suffer from psychological disturbances. The opposing faction insisted on a people-oriented strategy, arguing that the goal was to restore civilization and allow humans to once again inhabit the planet. Moreover, accounting for the changes caused by time and the environment, and given the existing level of technological development, it was hard to say whether it was possible to even create artificial intelligence that was sufficiently pragmatic and adaptable.\n The resulting compromise was the Key and Lock solution. Trained Keys like me would seek out, analyze, and thoroughly investigate every program in Operation Spring Dawn. Finally, when the time came, we would choose the most appropriate methods, as well as the most appropriate sequence for activation. The programs themselves would be stored inside Locks, protected by simple and independently operating machines, awaiting the arrival of a Key, or anything else burdened with the task of saving the world.\n I had never questioned this logic until I saw the indescribable behemoth before me.\n If I had to describe it, I would compare it to a blackish-gray mushroom inverted over the ice, covering a surface area much larger than the temperature-regulated dome where I had been born. Its thick, solid roots rose toward the sky, reaching higher than any mountain I had ever seen.\n After we emerged from the ice, the creature that had seized me began following meekly behind me, gently using its tentacles to point me forward. Its comrades crowded around me as if I were a prisoner being marched down the street. They shuffled slowly behind me, seeming both curious and terrified.\n I noticed then that their appearance and coloring were all slightly different, and they varied greatly in size. There were a few plump and fleshy creatures that looked like they could hardly stand upright on their tentacles. They carried smaller creatures on their backs—just like mothers carrying their young.\n But these creatures were clearly far more intelligent than monkeys. As I walked toward the inverted mushroom, they continued shouting in their strange voices:\n “Look! It’s God!”\n “It is the likeness of God!”\n And so on. I wasn’t certain whether I was the God they spoke of, but because I had watched the creature holding me use a dissolving gun concealed within its body to split open the ice, I didn’t dare defy its guidance.\n After about an hour of walking, I finally reached the edge of the mushroom. More creatures jumped out from its black outer wall, joining the ranks escorting me forward. It seemed like this strange facility, which had never appeared in any of the materials I had encountered, was these strange creatures’ nest—or, more accurately, their city.\n For a brief moment, I wondered if they were aliens invading Earth. That would have been too unfortunate for both parties.\n That ludicrous notion disappeared the moment I touched the outer wall. No door or passageway appeared. Instead, a black object, dripping with what looked like candle wax, solidified before my eyes, assuming a vaguely human shape . . . no, the shape of a middle-aged man.\n At the same time, the hordes of creatures behind me crouched to the ground, howling loudly enough to shake mountains. Afterward, the only sound that remained was the fierce shrieking of the wind.\n “Are you the Key?” The voice of the vaguely human entity standing before me was far more comprehensible than that of the tentacled creatures. “It’s good to meet you. I am the last Lock on Earth.”\n It uttered this ridiculous statement so casually. All of the Locks had been created according to the same, simple principles that had been passed down for tens of thousands of years, and which had up until now been consistently validated. No matter what the faction or era, all of the Locks were like silent graves, quietly awaiting decipherment by later generations.\n But this creature wasn’t the same—not just because its technology far exceeded the imagination, but also because it had reached out to contact me on its own, which violated the original intent behind the Locks.\n I expected it to invite me into the facility, or at the very least another place to converse, but I was wrong. The Lock told me that this place, which I had thought to be a city, could not be entered at all. It was a fully functional and independent installation—or, as he put it, a “shrine.”\n “A shrine?” I’d never come across any such project in any of the Operation Spring Dawn materials we had found. “A shrine to what?”\n “Why don’t I explain later?” The humanoid lifted a hand and pointed in the direction from which I had come. “Your girlfriends are almost here.”\n I noticed then that the crowd of creatures behind me was parting to make a path. Across the ice, I could make out the outlines of the homunculi rushing toward me. All seven were accounted for; not one was missing. They were armed just as before, but I couldn’t imagine how they’d gotten here carrying those backpacks, which couldn’t be easily transported through the water.\n D42 wasn’t gasping for breath, but I could tell she was both worried and furious from her uncharacteristically frantic movements. P05’s expression upon seeing the black humanoid was even more interesting.\n “Are you . . . Dr. Ayr?” she asked. “Dr. Ayr from our laboratory?”\n “No.” The humanoid gestured to himself. “I’m just an introductory software that has borrowed his appearance. I am responsible for explaining Operation Spring Dawn to the Key.”\n “So that’s how it was.” P05 glanced around. “So all of these . . . squids are indeed a part of Operation Spring Dawn?”\n “That’s impossible!” D42 still looked alarmed. “Ayr Laboratory expended all of its resources creating homunculi like us. How could they have also created this horde of monsters?”\n “After all of you had been sent into hibernation, all that was left in Ayr Laboratory were ghosts inhabiting the consciousness projections. Some brave souls among them were unwilling to waste the rest of their time in a virtual world, so they used the last bit of resources and pursued an experiment that had been abandoned long ago for its dangerousness. They were the first to create a hybrid made of black helo clay and organic material, just like the creatures you’re seeing now. They imbued that hybrid with a projection of Dr. Ayr’s own consciousness.”\n “Dr. Ayr?” D42 was suddenly excited. “He’s here?”\n “That all happened nineteen thousand years ago. Neither flesh nor alloy, not even black helo clay, can survive for that long.” A little creature dropped down from the wall, landing next to the humanoid. The humanoid broke off his explanation, dropped to its knees and gently patted the creature: “All of the survivors in the laboratory chose to follow in Dr. Ayr’s footsteps and use the consciousness projection technology to enter the hybrid bodies. They became the cornerstones of the new world. The hybrids represent the accumulation of thousands of years of human civilization . . . truly, the crystallization of all remaining remnants of technology. Their organic components can reproduce just like other animals, and then fuse and grow together with any shell made of helo black clay.”\n “Just like hermit crabs.” P05 nodded in understanding. “Like hermit crabs in the sea.”\n “The first group of hybrids destroyed two refuge cities that they’d determined were past saving, killing hundreds of thousands of survivors . . . ” The humanoid continued to explain. “These tragic sacrifices bought us enough resources to create a production line to slowly produce more helo black clay. That became a kind of “incubator” to increase the hybrids’ number. But the researchers were extremely limited in number. Moreover, exporting the consciousness projections into the hybrid shells caused the degradation of both memories and personality, so in order to make sure that they and their future generations didn’t forget their original mission, the researchers created a semireligious belief system. This made the hybrids remember and worship humans, the form that they had abandoned, so that they would be happily willing to become servants to their God, toiling endlessly generation after generation.\n So this was why those creatures had believed I was God. This also explained why they hadn’t killed the homunculi with their dissolving guns during the ambush, though they’d had ample opportunity to do so. Those homunculi were only as human as marionettes, but that was enough for the creatures.\n “So that’s why this is called a shrine?” I lifted my head toward the towering edifice. “Did you bring me here for some kind of religious ceremony?”\n “At first, the hybrids were only assigned to protect the underwater hibernation cities in the Pacific Rim, as well as to make sure that the hibernation chambers were operating properly. But very soon, Dr. Ayr realized he had created a self-sustaining ecosystem that could survive during the Great Frost. He’d unexpectedly obtained the scarcest resource of all—time.” The humanoid turned to glance at the facility behind him. He fell silent for a long time, then continued, “Therefore, he designed the shrine to serve as the last piece of Operation Spring Dawn. In fact, it can directly bring about the awakening of spring, more effectively than any of the plans you’ve discovered so far put together.”\n The homunculi and I stared blankly at each other, at a loss for words.\n “The shrine is made almost entirely of helo black clay,” the humanoid continued. “What you’re looking at is the section above ground, which isn’t even a thousandth of its full length. Like tree roots digging into the ground for nutrients, it reaches into the earth’s mantle to extract heat energy and distributes that energy through the cooling tubes in the roof. With the aid of this artificial enforced heating, even if the sunlight is insufficient, we can heat the earth to temperatures sufficient for human habitation.”\n “All this using this one tower?” C09 smiled in disdain. “I’ll admit it’s spectacular, but if we could have warded off the Great Frost with a single heat distributor, the first nuclear power plant ever constructed would have been enough to save the planet.”\n “Humans underestimated the impact of time, so a large majority of Operation Spring Dawn programs will now only lead to defeat.” The humanoid pointed forcefully at the ground. “You have also underestimated the power of time. Do you know what year it is?” He paused for a moment before answering his own question. “It is year 22,135 AD. The hybrids have had nearly an eternity to accumulate technology and resources, and to realize Dr. Ayr’s plan. There are thirty-two shrines just like this all over the planet, and we are currently creating ten times that number. Even so, it will take them many years to warm the atmosphere. During this process, the shrines will need constant protection. This is something that humans could never do, especially now that they have gone extinct.”\n “What? What are you saying?” D42 hoisted her dissolving gun at him. “Who has become extinct? When?”\n “When humans designed the hibernation chambers, they relied only on theoretical knowledge for their calculations, because they had no way to test it in practice. So in truth, by the time the hybrids began protecting the hibernation chambers, no signs of life could be detected inside them. After all, most of humanity isn’t like you.” The humanoid glanced at me. “Your genes have been improved, so you can withstand long periods of hibernation. But we haven’t found anyone else like you, have we?”\n “We only needed to find one living Key to activate Operation Spring,” D42 retorted. “That doesn’t mean all the other Keys are dead!”\n “Have you looked inside the hibernation chambers?” P05 asked. “Perhaps the external signals aren’t accurate.”\n “We’ve opened a thousand chambers that showed no signs of life. That success rate should be answer enough. We’ve been lucky that the hybrids are still doing their best to protect the hibernation cities out of their reverence for the gods, but objectively speaking, the odds that anyone in a hibernation chamber—whether they are adults or embryos—is still alive are so small that I’m afraid the number of survivors would not be sufficient to revive human civilization.”\n “You’re lying.” D42 gnashed her teeth in fury. “This is impossible! There are tens of millions of hibernation chambers, and you’ve only opened a thousand. How can you form conclusions from that?”\n “Why would I lie?” The humanoid gestured toward me. “I am a Lock. Why would I lie to a Key?”\n “So Operation Spring Dawn . . . ” P05 nodded. “It had failed before it started.”\n “The gods have long departed, but their miracles will never be forgotten . . . No, Operation Spring Dawn hasn’t failed. The only thing that has failed is humanity itself.” The humanoid shook his head. “Tell me now, Key: should we activate this shrine, and spend the next millennia letting spring once again fall upon this land? Tell me, tell us: what should we do?”\n It felt as if the entire worlds’ eyes were on me in this moment. The words Mother had uttered repeatedly so long ago echoed in my ears.\n “Do not dwell on the past. Focus on the possibilities of the future . . . ”\n And then, trust your own judgment.\n It had taken me until now to finally realize what Mother’s advice really meant. With its close to absolutely rational thinking process, it must have already calculated that by the time I woke, it was most likely that I would not have to consider questions of humans or the world. I also wouldn’t have to seek out Operation Spring Dawn. What I had to do was search for a better future.\n “Homo sapiens ruled the world because Neanderthals were eliminated by nature. If you trace that logic backward, there were perhaps even stronger living things that created civilizations, but none of them were a match for the hardships presented by the planet itself . . . ” After pondering for what felt like a century, I made my decision. “Now, a new species has passed the test. It doesn’t need spring. It can survive in such harsh conditions, which means it must be able to deal with any other challenges posed by nature. They are more worthy of this world.”\n “Then Operation Spring Dawn . . . ” started the humanoid.\n “From the start, the goal of Operation Spring Dawn was to perpetuate civilization. I believe that Dr. Ayr’s hybrids have achieved that.” I turned back to the humanoid. “I believe that there will at last be a day when they can set out from this earth and carry their recollections and worship for humanity to the stars . . . and if that is so, why waste time decorating a grave?”\n Smiling, I gave a deep sigh. I felt as if a great burden had been lifted from my shoulders.\n “Let the past be the past. It’s time to let a new king ascend the throne. Let the hybrids create their own civilization on the ruins of the old world. In the midst of this Great Frost—”\n “You’ve gone mad!” D42 yanked furiously at my shoulder. “You’re a Key! Your duty is to activate Operation Spring! To revive humanity!”\n I didn’t want to debate what my duty was with her. Even when she lifted her weapon and started making empty threats, I only gave her an indifferent smile. I knew she wouldn’t hurt me. She was utterly devoted to her duty, and utterly devoted to humanity. She would never be so rash as to put a Key at risk. It was thus so easy to predict her actions.\n “Let’s go, then.” She retreated among the other homunculi. “Let’s go find another Key. One who is willing to save all of humanity. Who isn’t a traitor.”\n But all those Snow Children who had been born in a laboratory, who had been made into Keys, and who had grown up under Mother’s instruction would absolutely make the same choice that I had. I didn’t intend to tell D42 this. She believed in her own form of justice, and she deserved to have her own hope.\n “That’s got nothing to do with us, old dog.” C09, expressionless, swung her hands back and forth. “The Key has already declared he will abandon Operation Spring Dawn. Our mission is completed.” She smiled at me. “Perhaps we’ll never see any of your type again, so . . . thanks for making us what we are. Our debt to humanity is settled.”\n In the end, only P05 chose to stay behind. She claimed this was to protect me, but I had to wonder if this was just to suit her inherent laziness.\n “Will the decision to initiate Operation Spring Dawn have anything to do with the hybrids’ future?” As her eyes followed her departing comrades, she finally couldn’t help but ask. “Even though statistically the hibernation chambers have probably all failed, humanity hasn’t necessarily gone extinct. Operation Spring Dawn might have other ways to keep civilization alive, we just haven’t found them yet.”\n “Alright. Suppose there really is such a method. Suppose we really can bring humanity back from the dead. What will happen to this place?” I pointed to the creatures, who were still watching us from a short distance away. “After humanity awakens, what will happen to these hybrids, who have been united in working tirelessly toward a common goal for countless years? Who have remained united in their original mission up until now?”\n In each of those long destroyed ruins, humans had done their utmost against natural disaster, but in the end, they couldn’t escape humanity’s own shackles: arrogant expansions, the insane civil wars, the cowardly bids for escape . . . meanwhile, the servants who had been created to serve such gods, were in fact humble, devout, and brave. But that was precisely why, when the gods truly returned, those hybrids would inevitably be sacrificed for the sake of the greater future which had not yet come.\n “Oh, I understand,” said P05. “So, this was never a question of extinction, but rather a question of who deserves to live, right?”\n “This so-called better future.” I nodded. “What would you choose?”\n “Me?” P05 looked solemn for a moment, then shrugged and smiled. “I don’t care, really.”\n Dogs look up to us. Cats look down on us. Pigs treat us as equals. I didn’t know which famous person had coined that saying, but right now, it seemed a perfect description for P05.\n “Then, what now?” The humanoid, who had been quiet for a long time, suddenly spoke up. “I am only a Lock. If you let me cease construction of the shrines, I will persuade the hybrids to do so. But what happens after? Without their only mission, what will they do?”\n “They can learn to live for themselves,” I said. “They can start to build their own civilization. They can create their own world.”\n “It’s not that simple. They have devoutly worshipped one god for over ten thousand years.” The humanoid gave a bitter smile. “How could they let go of their beliefs so easily?”\n “So all they need is a god?” I asked.\n Every civilization had a god of creation. Jehovah, Nüwa, Zeus, Odin . . .\n “Then they have a god now,” I said.\n This time, the name of God would be Snow—the snow that brought spring in the midst of the Great Frost.\n I lifted my head to the sky. At that very moment, countless white petals were drifting slowly to the ground.\n Translated and published in partnership with Storycom.\n Mo Xiong is an award-winning science fiction writer who launched his career in 2008, the publication of his novella \"Prayer of Doomsday\" in Science Fiction World. This story was the first of many in his City of Chaos series, which also includes a novel (Hell Hunt,), two novellas ( \"Pray of Doomsday\" and \"Turtledove\"), and several short stories. Beyond this series, he has published four novels and several short stories. His work has been recognized with nominations for the Xingyun Award, Galaxy Award, and several other Chinese SF awards.\n Rebecca F. Kuang is a Marshall Scholar, Chinese-English translator, and the Astounding Award-winning and the Hugo, Nebula, Locus, and World Fantasy Award nominated author of the Poppy War trilogy and the forthcoming Babel. Her work has won the Crawford Award and the Compton Crook Award for Best First Novel. She has an MPhil in Chinese Studies from Cambridge and an MSc in Contemporary Chinese Studies from Oxford; she is now pursuing a PhD in East Asian Languages and Literatures at Yale, where she studies diaspora, contemporary Chinese literature, and Asian American literature."}