{"fingerprint": "mlSVVs7Mrw6uEVrntLfmCvRv7c8=", "sitename": "Clarkesworld Magazine", "title": "A Light in Troy by Sarah Monette", "author": "Sarah Monette", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/monette_10_06/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Light in Troy by Sarah Monette", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1990 words, short story\nA Light in Troy\nShe went down to the beach in the early mornings, to walk among the cruel black rocks and stare out at the waves. Every morning she teased herself with wondering if this would be the day she left her grief behind her on the rocky beach and walked out into the sea to rejoin her husband, her sisters, her child. And every morning she turned away and climbed the steep and narrow stairs back to the fortress. She did not know if she was hero or coward, but she did not walk out into the cold gray waves to die.\nShe turned away, the tenth morning or the hundredth, and saw the child: a naked, filthy, spider-like creature, more animal than child. It recoiled from her, snarling like a dog. She took a step back in instinctive terror; it saw its chance and fled, a desperate headlong scrabble more on four legs than on two. As it lunged past her, she had a clear, fleeting glimpse of its genitals: a boy. He might have been the same age as her dead son would have been; it was hard to tell.\nShaken, she climbed the stairs slowly, pausing often to look back. But there was no sign of the child.\nSince she was literate, she had been put to work in the fortress’s library. It was undemanding work, and she did not hate it; it gave her something to do to fill the weary hours of daylight. When she had been brought to the fortress, she had expected to be ill-treated—a prisoner, a slave—but in truth she was mostly ignored. The fortress’s masters had younger, prettier girls to take to bed; the women, cool and distant and beautiful as she had once been herself, were not interested in a ragged woman with haunted half-crazed eyes. The librarian, a middle-aged man already gone blind over his codices and scrolls, valued her for her voice. But he was the only person she had to talk to, and she blurted as she came into the library, “I saw a child.”\n“Beg pardon?”\n“On the beach this morning. I saw a child.”\n“Oh,” said the librarian. “I thought we’d killed them all.”\n“Them?” she said, rather faintly.\n“You didn’t imagine your people were the first to be conquered, did you? Or that we could have built this fortress, which has been here for thousands of years?”\nShe hadn’t ever thought about it. “You really are like locusts,” she said and then winced. Merely because he did not treat her like a slave, did not mean she wasn’t one.\nBut the librarian just smiled, a slight, bitter quirk of the lips. “Your people named us well. We conquered this country, oh, six or seven years ago. I could still see. The defenders of this fortress resisted us long after the rest of the country had surrendered. They killed a great many soldiers, and angered the generals. You are lucky your people did not do the same.”\n“Yes,” she said with bitterness of her own. “Lucky.” Lucky to have her husband butchered like a hog. Lucky to have her only child killed before her eyes. Lucky to be mocked, degraded, raped.\n“Lucky to be alive,” the librarian said, as if he could hear her thoughts. “Except for this child you say you saw, not one inhabitant of this fortress survived. And they did not die quickly.” He turned away from her, as if he did not want her to be able to see his face.\nShe said with quick horror, “You won’t tell anyone? It’s only a child. A . . . more like a wild animal. Not a threat. Please.”\nHe said, still turned toward the window as if he could look out at the sea, “I am not the man I was then. And no one else will care. We are not a people who have much interest in the past, even our own.”\n“And yet you are a librarian.”\n“The world is different in darkness,” he said and then, harshly, briskly, asked her to get out the catalogue and start work.\nSome days later, whether three or thirty, she asked shyly, “Does the library have any information on wild children?”\n“We can look,” said the librarian. “There should at least be an entry or two in the encyclopedias.”\nThere were, and she read avidly—aloud, because the librarian asked her to—about children raised by wolves, children raised by bears. And when she was done, he said, “Did you find what you were looking for?”\n“No. Not really. I think he lives with the dog pack in the caves under the fortress, so it makes sense that he growls like a dog and runs like a dog. But it doesn’t tell me anything about . . . ”\n“How to save him?”\n“How to love him.”\nShe hadn’t meant to say it. The librarian listened too well.\n“Do you think he wishes for your love?”\n“No. But he keeps coming back. And . . . and I must love someone.”\n“Must you?”\n“What else do I have?”\n“I don’t know,” he said, and they did not speak again that day.\nShe did not attempt to touch the child. He never came within ten feet of her anyway, the distance between them as impassible as the cold gray sea.\nBut he was always there, when she came down the stairs in the morning, and when she started coming down in the evenings as well, he came pattering out from wherever he spent his time to crouch on a rock and watch her, head cocked to one side, pale eyes bright, interested. Sometimes, one or two of the dogs he lived with would come as well: long-legged, heavy-chested dogs that she imagined had been hunting dogs before the fortress fell to the locusts. Her husband had had dogs like that.\nThe encyclopedias had told her that he would not know how to speak, and in any event she did not know what language the people of this country had spoken before their world ended, as hers had, in fire and death. The child was an apt mimic, though, and much quicker-minded than she had expected. They worked out a crude sign-language before many weeks had passed, simple things like food, for she brought him what she could, and no, which he used when he thought she might venture too close, and I have to go now—and it was ridiculous of her to imagine that he seemed saddened when she made that sign, and even more ridiculous of her to be pleased.\nShe worried that her visits might draw the fortress’s attention to him—for whatever the librarian said, she was not convinced the locusts would not kill the child simply because they could—but she asked him regularly if other people came down to the beach, and he always answered, no. She wasn’t sure if he understood what she was asking, and the question was really more of an apotropaic ritual; it gave her comfort, even though she suspected it was meaningless.\nUntil the day when he answered, yes.\nThe shock made her head swim, and she sat down, hard and not gracefully, on a lump of protruding rock. She had no way of asking him who had come, or what they had done, and in a hard, clear flash of bitterness, she thought how stupid of her it was to pretend this child could in any way replace her dead son.\nBut he was all she had, and he was watching her closely. His face never showed any emotion, except when he snarled with fear or anger, so she did not know what he felt—if anything at all. She asked, All right?\nYes, the child signed, but he was still watching her as if he wanted her to show him what he ought to do.\nShe signed, All right, more emphatically than she felt it, but he seemed to be satisfied, for he turned away and began playing a game of catch-me with the two dogs who had accompanied him that morning.\nShe sat and watched, trying to convince herself that this was not an auspice of doom, that other people in the fortress could come down to the beach without any purpose more sinister than taking a walk.\nExcept that they didn’t. The locusts were not a sea-faring people except in the necessity of finding new countries to conquer. They were not interested in the water and the wind and the harsh smell of salt. In all the time she had been in the fortress, she had never found any evidence that anyone except herself used the stairs to the beach. She was trying hard not to remember the day her husband had said, casually, A messenger came from the lighthouse today. Says there’s strangers landing on the long beach. Little things. Little things led up to disaster. She was afraid, and she climbed the stairs back to the fortress like a woman moving through a nightmare.\nHer louring anxiety distracted her so much that she asked the librarian, forgetting that he was the last person in the fortress likely to know, “Who else goes down to the beach?”\nThe silence was just long enough for her to curse herself as an idiot before he said, “That was . . . I.”\n“You?”\n“Yes.”\n“Why? What on earth possessed you?”\nHis head was turned toward the window again. He said, “You spend so much time there.”\nAt first she did not even understand what he was saying, could make no sense of it. She said, hastily, to fill the gap, “You’re lucky you didn’t break your neck.”\n“I won’t do it again, if you don’t want.”\nShe couldn’t help laughing. “You forget which of us is the slave and which the master.”\n“What makes you think I can forget that? Any more than I can forget that I will never see your face?”\n“I . . . I don’t . . . ”\n“I am sorry,” he said, his voice weary although his posture was as poker-straight as ever. “I won’t bother you about it again. I didn’t mean to tell you.”\nShe said, astonished, “I don’t mind,” and then they both, in unspoken, embarrassed agreement, plunged hastily into the minutiae of their work.\nBut that evening, as she sat on her rock beside the sea, she heard slow, careful footsteps descending the stairs behind her.\nCome! said the child from his rock eight feet away.\nFriend, she said, a word they’d had some trouble with, but she thought he understood, even if she suspected that what he meant by it was pack-member. And called out, “There’s room on my rock for two.”\nFriend, the child repeated, his hands moving slowly.\nNo hurt, she said, and wondered if she meant that the librarian would not hurt the child, or that the child should not hurt the librarian.\nYes, he said, and then eagerly, Rock!\n“What are you doing, this evening?” the librarian’s voice said behind her.\n“Teaching him to skip stones.” She flung another one, strong snap of the wrist. Five skips and it sank. The child bounced in a way she thought meant happiness; he threw a stone, but he hadn’t gotten the wrist movement right, and it simply dropped into the water. Again! he said, imperious as the child of kings.\nShe threw another stone. Four skips. The librarian sat down beside her, carefully, slowly.\nShe said, “What is the sea like, in darkness?”\n“Much more vast than I remember it being, when I had my sight. It would do the generals good to be blind.”\n“Blindness won’t teach them anything—they have never wanted to see in the first place.”\n“You think that’s what makes the difference?”\n“We learn by wanting,” she said. “We learn by grieving.”\nShyly, the librarian’s hand found hers.\nThe child threw a stone.\nIt skipped seven times before it sank.\nSarah Monette was born and raised in Oak Ridge, Tennessee, one of the secret cities of the Manhattan Project. Having completed her Ph.D. in Renaissance English drama, she now lives and writes in a 99-year-old house in the Upper Midwest. Her \"Doctrine of Labyrinths\" series consists of the novels Melusine, The Virtu, and The Mirador. Her short fiction has been collected in The Bone Key. Upcoming is a new novel in the \"Doctrine of Labyrinths\" sequence, Corambis."}