{"fingerprint": "p0i34rwE/W7nQY5GY/uVcrfeuBY=", "sitename": "Clarkesworld Magazine", "title": "Strange Comfort by Tegan Moore", "author": "Tegan Moore", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/moore_07_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Strange Comfort by Tegan Moore", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8170 words, novelette\n Strange Comfort\n Before Mug Ruith Vent Station, Jens had never had much of an imagination. For example, and just for starters: he never would’ve imagined he’d end up at Mug Ruith Vent Station.\n Other things he’d failed to imagine: That a contractual subclause would send him to Europa, orbiting Jupiter, ten freezing miles beneath the surface of an alien ocean. How bored he’d get of working on music when he had almost unlimited time to spend on it. How living in two rooms with another human for six months would overlap the two of them, blur their boundaries, and that he might like it. How obsessed he’d become with the portholes.\n That had pleased Elena. “You wouldn’t be so terrified of them if you weren’t imagining something spooky out there.”\n “There is something spooky out there,” Jens said.\n “Oh, besides that.”\n “That thing is spooky enough.”\n She made fun of him for it. How could he be any kind of artist if he didn’t have an imagination? Where did he think his music came from?\n “Everywhere,” was Jens’ answer, though the real answer was “nowhere.”\n Lack of imagination hadn’t been a disability in the past. Imagining shit was other peoples’ jobs, makers and rich kids with degrees, people who sat around coming up with fucked-up worst-case scenarios. And not even fucked-up enough, because nobody seemed to have imagined that the descender might implode halfway to the surface and everyone on Elena’s tethercomm would listen to her getting squeezed to death—or squeezed mostly to death, then drowned—over the course of thirty endless, excruciating seconds.\n Jens’ cochlear nerves still burned with her scream. Minutes ago she’d been singing as he swung the descender door closed behind her. “So long, farewell—”\n “No!”\n “Auf Wiedersehen, goodbye!”\n “You’re a bad person. You’re cursing me with that song in my head for the rest of my life.”\n “Earworm? Why, there’s only one cure, Jens,” Elena had proclaimed, and then burst into an obnoxiously sunny smile. “Sing along with me!”\n He’d swung the door shut on her last long, vibrato goodbye! while shouting, “Fuck yourself!” Some last words to his best friend.\n Now Jens chewed on the corner of his lip and stared at nothing. Mohammed blipped in the corner of his inviz. Your biometrics are high. UOK?\n Jens adjusted the shirt he’d hung over the lab porthole. A glossy sliver of black showed at the bottom where the shirt didn’t reach, black so dark it vibrated. Jens was ready to dart forward and punch that void in the face to keep it on its own side of the acrylic. Another thing he hadn’t imagined: that someone would put portholes in a station at the bottom of the ocean. What did they expect him to look at?\n Jens? U there?\n Where else would he be? I’m fine, he said. He wasn’t, but would he feel more okay if he were sitting in the Silxen office up on Sozertsaniye Orbital listening to the people around him lose their shit, instead of watching them lose their shit in group chat? He pushed himself off from the porthole and into one of the lab seats, the half-gravity landing him with a satisfying thump, and minimized the chat tiles. HR had already deployed some sort of crisis-management algo that was plastering all Silxen internal communications with soothing colors and soft, pulsing shapes.\n U need help managing biometrics?\n Jens reached up to swat Mohammed’s question out of his inviz and realized his hand was shaking. Both his hands were, and his mouth was quivering, and he tasted blood from his lip. If he didn’t bring himself down Mo would override him and push a sedative and the idea of that sent a rush of anger through him and Elena was—Elena . . .\n He twitched his cochlear control up and put on the tranquility freq. Its drone filled his ears like a physical thing, cobwebs drawing between him and everything that was going on, softening edges. Jens stared at the breath bubble that had appeared in his inviz when his heart rate passed one hundred and forty. Silxen would ding his pay if he let his heart rate stay high for too long. They had his body under contract; no mucking up their equipment, even if Jens had a prior claim on it. He concentrated until the breath bubble went away, then dropped his head into his hands and tried not to imagine anything at all. With his eyes closed he was certain that the shirt had slipped off the porthole and that gaping black eye stared at him. Stared right through him, harpooning him to his seat.\n Elena would have been proud.\n Bad news first, Mohammed chatted, though what counted as bad news for Jens had recently made a dramatic shift with the implosion of his closest friend. He’d spent a long night in his bunk with his eyes refusing to close, the breath bubble visiting whenever he turned off the tranquility freq to listen to a song or watch a vid, or if he forgot what he wasn’t thinking about. He had to keep reminding himself: Don’t think about Elena. Don’t think about the porthole. Don’t think about the Worm. Morning—what passed for morning—dragged him through a routine. He was stuffing protein loaf between his molars when Mo’s chats arrived.\n You’re going to have to get comfortable for a bit. Rad window closes in 20 hrs, surface team has to pull back to Sozert.\n That was normal enough. Whenever the moon moved out of Jupiter’s magnetotail the surface radiation on Europa jumped enough to deep-fry DNA in just a few hours. Intraspace policy stated that the only allowable places to be in that case were either beneath the thick buffer of the surface ice, or not on Europa at all. Jens was offended anyway. Offended that the cosmos wouldn’t just pause for a moment out of respect for Elena. That Silxen wouldn’t, either.\n His six-month station rotation was over, but there was no descender to return Jens to the surface. And even if there were a backup, he wouldn’t go near it now. So he’d be stuck there, and without anyone at the surface base. Nobody even in this sector. Jens would be alone. Except for the Worm.\n Good news is that the drop is proceeding. It’s hitting the ice now.\n In his peripheral vision the drop’s location showed as an orange dot. Another failure of imagination: it hadn’t occurred to Jens that the drop might not happen. Like he should be grateful Silxen was sending the shit he needed to survive. That was, apparently, good news.\n “The fuck,” Jens muttered aloud. His voice hit the wall panels, flat against the freq playing through his cochlear.\n Jens flicked open the Eel’s controls and locked it on to the drop. A rumble added to the station’s ambient hum as it launched from its bay.\n Beyond the lab’s porthole, in the sliver of night that Jens’ makeshift curtain did not cover, there might have been a quick, brilliant flash of light. Jens froze, unfocused his eyes. Not looking, not looking. Some tricky reflection. Nothing to see out there.\n He had to get out of this place. There had to be some way out of his contract.\n In the meanwhile, what could he do? He followed his routine. He spent an hour in the hamster wheel on the station’s lower level, took a tepid shower. Usually he’d have a coffee while Elena ate a late dinner, and they’d laugh and shoot the shit and maybe Jens would play her part of a song he was working on, until it was time for her to crawl into her bunk and for Jens to keep an eye on things. There wasn’t a whole lot that the station techs had to do except be there. Drones probably could’ve done their jobs, but Intraspace would only lease Mug Ruith Vent Station for human occupancy, part of some stupid make-work policy that was supposed to create jobs, even though nobody wanted the jobs it created.\n Jens listened to the low hiss of the station, felt it vibrate in his bowels. The station wasn’t ever actually quiet, but it was still too quiet.\n Only fifteen yards away, the Worm was coiled around Mug Ruith’s slaggy spires like a poorly rolled, unbaked cinnamon bun. The long, fat spiral of it was as thick around as Jens’ thigh, and off that main body grew the skinny pale whips of its tentacles, bristling with tiny hairs, always moving, flapping over the belching vent. If Jens turned on the station floodlights—another stupid idea, who’d thought of those?—he could look out the porthole and see the Worm right now, a giant white spaghetti shit dropped on the smoking spires of Mug Ruith Hydrothermal Vent.\n Mug Ruith itself was a range of nasty, melting candelabras belching dark cauliflowers of gas into the water, the pimple-end of a system that extended nearly to the moon’s core. The water just beyond the vent zone was close to freezing, and the water over the vents was 300 Celsius. The fucking maniac monster-worm balanced right at the edge of the spume, waving its hairy tentacles through it and getting buffeted back into the cold. Waving its arms through the belching smoke was the Worm’s job. It had evolved on Europa’s hydrothermal vents doing just this, and now it did it for Silxen—an employee, just like Jens. Well, not just like.\n Nasty things lived on Earth’s hydrothermal vents, too, but the Worm was worse. For one, it wasn’t actually one thing, but a colony of thousands of tiny worm clones amalgamated into one giant Worm, sucking bacteria out of the ocean and siphoning the DNA out of that and fucking with and assimilating those genes for its own biologic diversity and, Jens didn’t know, maybe for fun. The clones and their offspring grew into each other, sharing organ systems, indivisible, except for when they suddenly decided they did want to divide and then shot a rogue tentacle out into the ocean to fend for itself. That’s how all the Europan worms did it, but this particular Worm was fucked-with in more ways, modified to mine silica and some specific bacteria from the vent for Silxen instead of for its own food. Jens fed the Worm. He didn’t haul it buckets of slop or anything, there was an interface and it was all done remotely, but still: he had to feed the awful thing, and monitor its biometrics, and make sure it didn’t self-destruct or wander off into the void.\n And all this smothered in the pitch-black swallowing silence of ten miles of ocean. Jens could feel that silence pressing up against the station’s hull. He switched to a focus freq.\n A red light appeared in his inviz. The Eel was low on battery.\n Unexpected. Not your-friend-just-imploded unexpected, but still unlikely. The Eel recharged fast, docking into a fusion charging port used by all the station’s remote tools. The only reason it might be low is if it hadn’t docked correctly—but that would’ve brought up another red dot.\n Jens scrolled back through his past alerts and yeah, there it was: it’d come up on both Jens and Elena’s screens, but Elena had been distracted by the sudden crunching, pinging, shrieking disintegration of the machine that was carrying her to the surface, and Jens had been distracted by his friend dying. So they hadn’t noticed.\n The Eel didn’t have enough battery to get to the drop and back. Jens recalled it so it could recharge. He did a couple more chores. Then sat, doing nothing.\n He was alone. Except for the Worm.\n Elena had tried to point Jens’ nascent imagination at the monster. “Think about it,” she’d said approximately a thousand times. “Think about it doing its thing out there, all those weird little connected selves. Can you imagine what it’s like? What it’s like to, like, have a little genetics laboratory in your brain and build yourself however you want? It’s insane. And Silxen has basically made it into a slave.”\n “It’s weird enough just knowing it’s out there,” Jens said.\n This is where Elena would erupt, her delight and amazement too big not to grab Jens by the shoulders or the arm, or shake her fists in the air. “But wouldn’t it be weirder for it to know we’re here?”\n According to Silxen, the Worm didn’t know they were there. According to Silxen, it wasn’t smart enough. And even if it was, it probably wouldn’t realize its situation was abnormal. It was Silxen-created, or bred, really, tweaked and trained to its novel situation. Wild Europan vent worm colonies lived in similar environments, but they mined the vent gasses for food, not profit. And they were, horrifically, dozens of times larger.\n He was still staring blankly into his inviz when the alert that the Eel was back appeared. Something to do, at least. He watched the dot move closer and closer to the station, and then a quiet thunk from below. An alert from the docking port: connection failure.\n Jens cycled the connection, but it still didn’t take. Hard to tell what was going on with just the sensor; easier to see it. He pulled up the drone’s interface, ignored its blinking battery warnings. He toggled on its headlight and found the camera.\n Officially, there was nothing but bacteria living around Mug Ruith. Intraspace didn’t allow tampering with existing ecosystems; the hydrothermal vent and its Worm were technically artificial, in that they’d been created by Silxen and not by Europa. Vent worms were the most complex life discovered on Europa. Everything else was similar to what had lived in Earth’s primordial soup some four billion years ago, evolving in fits and starts, popping up and dying off along with the short-lived hydrothermal vents. But large swaths of Europa’s deep hadn’t been explored—barely even surveyed. It was assumed that nothing could live in the pressure at 150 kilometers down, but evolution might have other ideas. And Jens had already found reason to doubt the people with the what-if jobs.\n He wished Elena had never infected him with this stupid imagination.\n He had to turn on the camera. There wouldn’t be much to look at. Definitely nothing unexpected, so he could just chill the fuck out right now.\n Jens turned on the feed.\n The world was black-and-chalk white, save for a streak of yellow on the Eel’s belly. The station’s hull was dull gray. Sediment whorled. Jens did not look into the fluctuating black that lay behind everything.\n Something was stuck in the charging dock, pale tendrils like tattered cloth. Jens zoomed in.\n White and long and finely bristled, tapering to a delicate whip-point at one end: there was a severed tentacle jammed into the dock.\n Mohammed was not nearly as concerned about the tentacle as he should have been, and his focus kept shifting away from their chat, name going from active/bold to busy/fade in Jens’ inviz. Jens watched it bold and fade and bold and fade and wanted to yell. Usually Jens’ boss was a meticulous tight-ass. The hell was going on?\n Mo come on, help me out here.\n A long pause, and then Mohammed said, sorry, lot going on, brb.\n Jens hissed between clenched teeth and waited.\n Okay so here’s what I think, Mo said. The Worm can’t leave the temperate zone around the vent, so perhaps when U recalled the Eel it passed close to Mug Ruith and picked up some debris that got stuck.\n Jens had thought of that possibility—imagined it, Elena would’ve been proud, and the thought of her socked him in the gut—but the Eel had already been low on battery. Why hadn’t it charged? The Worm arm must have been stuck in there before the Eel deployed. Mohammed didn’t catch that, which meant he wasn’t paying attention.\n Jens clenched his fists and tried to think of a professional way to say all the furious things that needed saying while Mohammed’s name went bold and fade, bold and fade. Jens did yell, then, a little monkey screech that sounded ridiculous in the close space of the station.\n Don’t worry about it right now, Mohammed said. We’re working on extraction plans for U so just hold tight. Catch U later.\n Mohammed attached a vid to the chat, a meeting at HQ brainstorming ways to get him off of Mug Ruith. Jens hated all their suggestions, like leaving him until they could get a descender from the opposite side of Europa—that’d take months—or having the Eel drag him to the surface in a pressure suit. The thought of hanging from the skinny body of the Eel through ten miles of blackness was so overwhelmingly terrible that it made him light-headed. They hadn’t come to any conclusions, really, and Jens felt worse after watching the vid even though Mohammed had probably thought it’d cheer him up knowing the important selves at Earth HQ were worried about him. Parts of the vid were rough-edited out, too. Jens imagined those were the places where they weighed the pros and cons of abandoning him.\n He wished he could talk to Elena.\n His anxiety and anger did not crowd out his boredom. He’d been alone only two days—how was that only yesterday? Elena’s scream as her tethercomm cut off . . . Jens flicked on the tranquility freq. Boredom had a different quality when someone else was nearby. Someone had his back while he messed around in chat or read conspiracy threads and avoided working on music.\n He wanted to talk to someone. Anybody.\n His message to Valery bounced back, as if the contact info was wrong. He tried Soshanna, but her autoresponder was set to “unavailable.” He tried Morgan.\n Nobody’s telling you anything? they said. That’s so wrong. Ok so don’t freak out.\n Jens’ heart skipped.\n You know everyone’s been talking about restructuring for however long, we all knew something bad was coming? Well I guess Elena was the final fuck-up in a long string of fuck-ups. I saw Val and Carl earlier and they said they’ve been laid off, all the vent teams are, so you too I guess? But there’s something worse going on because HR are like . . . gone. I mean if they were around the auditor algos would’ve already caught this conversation and redacted it, right?\n Jens stared into his inviz. Morgan continued.\n Everyone on Sozert thinks Silxen is, like, done. Over. But they can’t leave you down there much longer. Intraspace has got to have laws, right? No matter what Silxen’s contracts say.\n Morgan’s name faded abruptly, like they’d been pulled away from the conversation. They didn’t come back.\n Jens ran in the hamster wheel until he was exhausted, but it didn’t help him sleep. He switched on the deep-relaxation freq and lay in his bunk.\n Elena had thought his cochlear was stupid. She didn’t like any vamps, really, though she had an inviz like everyone else. They argued about vamps a lot, but Jens didn’t mind. When Elena disagreed with him she didn’t make him feel stupid and he didn’t get angry, just curious what she’d say. Sometimes they talked each other out of opinions. It never felt like a fight.\n Elena called his cochlear “a gratuitous toy-boy mod,” but that didn’t seem to alter her opinion of Jens. The cochlear was supposed to fine-tune hearing, though you could do other things with it too. People experimented with frequencies to modify and control their moods. It wasn’t supposed to work, studies said it didn’t do anything, but it worked for Jens. He set a freq and he felt different. Wasn’t that proof?\n Elena called it an “emotional sedative crutch.” If she found him staring, thinking, she’d shout “you’re freqing out, Jens!” and he would jolt out of the trance. She thought that was hilarious.\n He must have slept, because his alarm went off. He got up and ran in the hamster wheel some more. He had to do something. The empty space where Elena had been was loomingly, threateningly silent.\n He thought about working on music, but he’d have to turn off the tranquility freq. When he’d been assigned to the vent station he’d thought he’d have nothing to distract him from making music, but the station still had media feeds, and you could still dick around online, though the load time was bullshit. It turned out that even at the bottom of the ocean, Jens could find other shit to do.\n Elena was dead and everything was wrong, but none of the station’s normal problems had gone away. The air filtration system was bugging out, and he was almost out of the good rations. He needed the stuff from the drop to solve those problems.\n He needed the drop, and that meant he had to charge the Eel, which meant he had to fix the charging dock.\n He was going to have to go out there.\n Someone should know where he was going, just in case. Though if he drifted off into that vibrating darkness, who would drag him back?\n Hey, Mo. I’m going outside to fix the port.\n Really what he wanted was for Mohammed to tell him not to do it.\n OK, Mohammed said. Be careful.\n The smooth cold stone of anxiety slid lower in his gut. Be careful, as if he needed warning. He stared at the words, shifting his weight, ready to go but not ready.\n “Fuck,” he said, and made himself go.\n On the lower level, near the hamster wheel and weight machine, shower and storage lockers, there was a hatch. Jens called it the Hellhole. It throbbed with malignant energy.\n He was so tense the arches of his feet ached. He bent over to tug the wheel that opened the hatch and blood rushed into his head. It would’ve been more comforting if he had to put some effort into opening it, but it slid smoothly unlocked and hydraulics popped the port open an inch. He pulled it up. Cold air rose in a mass he imagined as visible.\n The Hellhole was brightly lit, brilliantly white, but it smelled like dank metal and salt. Jens swallowed the impulse to vomit.\n His feet on the ladder rungs were silent, but the grates at the bottom clanged as he stepped down. The room was a cylinder, with the descender’s empty docking hatch on the far side from the ladder. In the center of the room there was a black aperture in the floor. Light blinked off its liquid surface. Another ladder led down into that darkness, like a tiny, loathsome swimming pool.\n A touch panel opened the pressure suit storage. Jens took one down and zipped it over his clothes. This was all going too easily.\n One more thing, Mohammed messaged, apropos of nothing. At least he hadn’t forgotten Jens was there. I am sorry to bring the bad news that Silxen is moving away from the silica mining format and will be recalling vent teams while we restructure, including U of course. As per the terms of Silxen’s lease on the station we cannot leave behind biomaterials.\n At first Jens thought that Mohammed meant him, that Jens was the biomaterial that couldn’t be left behind.\n I am sending U a program that will terminate the Worm and concentrate its biomass in the silica hoppers for easier disposal. More details are in the program. We need U to do this ASAP please.\n Jens pulled on the helmet. The suit whispered closed around him. He was going to go out there into the dark, fix the Eel, and then come back here and murder the Worm. At least it was something to do.\n He turned around, put his hands on the ladder rails, and stepped into the sea.\n His legs felt weak against the resistance of the water, and he had to slog to move them down the ladder. He kept his eyes squeezed shut. The ball of his foot touched down, and he was standing on the Europan seafloor.\n Now it felt like a liability to have his eyes closed. The ladder glinted in hard light. He’d turned on all the outside lights; if he had to be out here, he wasn’t doing it in the dark.\n He spun around, putting the ladder to his back. Particulate swam in front of his helmet.\n There was a buzzing in his head that at first worried him, until he realized that he still had the tranquility freq playing and it was interfering with the helmet’s biometrics. Cochlears weren’t common vamps, it was just sound hounds and musicians really, so they weren’t tested with a lot of gear. Jens turned the freq off and silence rushed close around him.\n He stood in an island of light with his back to the ladder, following the breath bubble that had popped up in his inviz. His eyes were drawn to the illumination’s edge, fading from platinum to pewter to iron and then quivering blackness. Fifteen yards between him and the Worm. It was right there, straight out in that blackness; if he walked forward he would reach it in a minute. He watched the trembling dark, eyes hungry and horrified. The light didn’t reach that far; he couldn’t see it, but he felt like he could, pale tendrils rippling like seaweed in the hot current spewing from Mug Ruith. Each tentacle an individual, each inch of each tentacle an interdependent self. Undulating, feeding the silica-hungry bacteria in its bristles, the long slow coil of an arm curling back to scratch against the hard comblike ridge along its central spine that channeled the silica into a modified digestive tract that shat out into the hoppers. No face, no front or back, one thing made out of a thousand cloned children, modified and improved with assimilated DNA from whatever the Worm found in the void of Europa’s vast ocean.\n Jens’ ears were buzzing with the density of the silence crowding around him as he stared into the curtain of darkness hung around the pool of light. The curtain was moving in on him, coming closer, except then he realized that he was walking toward it and the billowing shape of the Worm’s many arms. His boots waded through pewter muck, edging toward charcoal, the black curtain closer, and the Worm looming huge in the darkness. Sound filled his head.\n A breath bubble popped up in his inviz and Jens glanced at it, glanced back into the darkness, saw all that nothing. “Fuck!” Like it’d sneaked up on him. He staggered back, arms waving to catch himself.\n Get done, get out. Sound still filled his ears. “Fuck,” he said again, backing into the light, and his own voice broke the stupefying spell. “Fuck,” he repeated, staggering toward the fusion charging dock. He glanced over his shoulder, didn’t see the anemone tendrils of the Worm he’d been certain he could see in all that blackness.\n The dock was set into the station’s hull on the far side from the Worm. Oatmeal-mush sediment powdered up around the soles of his boots. He looked at his feet, looked at his destination. He didn’t look over his shoulder again.\n Beneath the dock, he had to stand on his toes. The Worm’s tentacle was wedged in there, frayed, with stringy bits of meat from its torn end waving around in the currents. Jens reached a gloved finger behind the mass to unwedge it. There was an unexpected eggshell crunch, and then the appendage floated free. It drifted down onto the mushy ocean floor, where its bristle-mottled surface made a weird outline in the silt.\n Immediately Jens saw another, matching shape. He shuffled to it, crouched, brushed the porridge off it until another torn-off tentacle rocked beneath his glove.\n Then he saw another lump, then two more, scattered in a rough line into the darkness.\n “Fuck,” he said. The word reverberated in the fishbowl of his helmet.\n He had to get out of this place.\n Seriously Mo there’s something going on down here, the Worm is, like, trying to get the Eel, or maybe trying to get to the station? Mo?\n Mohammed was inactive, which rarely happened. He wasn’t doing something else, he was offline. Jens stared at the grayed-out name, foot jiggling. He had to move or his thoughts pinned him, but you couldn’t pace satisfactorily in low-G. He glided from lab bench to bunk cubbies to galley and back, touching surfaces as he went to guide his trajectory.\n Mo, are you there?\n He should’ve been alerted if the Worm’s biometrics changed, but there was nothing in the log. How could the Worm release an arm without the sensors going nuts? Could it do that on purpose, hide its behavior? The implication put hot hands around Jens’ throat. Silxen claimed the Worm was too dumb to know the station was even there. Research into the animals’ intelligence correlated that. But the worms they’d done the research on were dozens of times the size of Silxen’s manufactured worm, colonies of millions of clones, with genes stolen from billions of bacteria. Maybe isolation made this worm different. Maybe Silxen had done something to it. But it definitely wouldn’t send rogue tentacles off to molest something it didn’t know was there.\n The breath bubble was back in Jens’ inviz, and it was getting in the way of all the tiles Jens was trying to use at once: a half dozen different tools open to shout for help from anyone on Sozert; the Worm’s biolog; the station’s sensor log; fuck, recent current patterns; the Worm’s profile. Nobody was answering. Where was everyone?\n Maybe Sozertsaniye Orbital had catastrophically decompressed and Jens was really, actually alone. With the Worm.\n Fucking breath bubble. He couldn’t help it, he breathed along.\n The program to terminate the Worm still hung in a corner of his inviz. Jens scanned through it. He could get the Worm before the Worm got him. He imagined it tentacling its way off Mug Ruith’s slaggy spires, reaching toward the squat can of the station, bristly arms slithering to embrace its hull, a pale toothy mouth reaching for the porthole even though the Worm had no mouth or teeth.\n It was too cold for the Worm to survive away from the vent. According to Silxen, at least. But if that was true then how’d worms get to more than one vent in the first place?\n Jens could hear his skin and boot soles touching surfaces as he circled, circled, circled. Too fucking quiet.\n Of course the Worm had a sort of self-destruct built into it. He’d never thought about it—imagination, again—but it made sense. Intraspace wouldn’t want a fiddled-with animal loose in the ocean; there were impact rules, things that were supposed to protect Europa from getting used up the way Earth’s seafloor had been. It wouldn’t even be hard to kill. All Jens had to do was enter some commands and the Worm would curl up and die, but not before it galumphed toward the silica hoppers for easier disposal. Jens hoped he wouldn’t have to go out there and shovel Worm into the hopper.\n He opened the Worm’s control console. Windows with biometrics, silica output, energy levels, nutrient balance. One showing ionic currents sparking between all those connected neural pathways.\n “It’s just a fucking bug,” Jens said into the station’s dull ambient vibration. He swiped the program free of its delivery folder.\n Think of what it must be like, Elena said in his mind, and Jens again saw those pale dancing tendrils in the darkness, in the void. What it must be like to be a thousand separate tiny selves that were also one enormous self. What must it be like to be a part of something like that? Even if it was just a bug.\n Inexplicably—at least Jens couldn’t explain it—that thought hit him like the memory of Elena, grief and panic and anger and a thrill of something that wasn’t quite joy, was too deeply sad to be joy, but might have been in some other context. Or might turn into. Some thrill of possibility.\n He dropped the program back into its folder and stood staring into the middle distance, not thinking really, remembering that sound that had thrummed through him as he watched the arms of the oscillating thing he couldn’t see in the dark.\n What do you want, Jens thought.\n A message popped up, and Jens caught his breath. But of course it wasn’t the Worm—where had that thought come from? It was Morgan responding to one of his many desperate shouts into the void.\n Hey I might get locked out, gonna write fast. The chat pulsed thoughtfully as Morgan composed their message. Silxen is done, kaput, everyone on Sozert is laid off or about to be. They’re doing a shitty job of it, like my mom sent me a link to a press release from HQ before anyone from Silxen actually told me that I was laid off, real classy. Thought you should know. You doing okay?\n Jens skipped that question; he wasn’t sure if he was okay. Morgan didn’t know if Mohammed was laid off yet, but they hadn’t seen him. Hadn’t heard any plans about retrieving Jens from Mug Ruith station; hadn’t heard much at all, really.\n You were top of the newsfeed though, they said. Well Elena was, and it mentioned you. I’m sure they won’t leave you down there, it would make Silxen look terrible.\n Jens told Morgan everything. The Eel, the Worm, sabotage, invasion. The murder program, still open behind their chat tile. Jens couldn’t help it, the words just came out of him. He needed to tell someone, and the experience of being heard, another voice responding to his, was calming him down far more than the breath bubbles did.\n I’m not disagreeing with you J, it just doesn’t make sense. Behaviorally. What would it want the Eel for? Or the station?\n A bug in its system? Jens asked.\n It’s still an animal, animals do things to fulfill a need. What does it need you for?\n And then Morgan’s name grayed out. Then words disappeared from the chat, and the tile closed on its own. So someone in auditing was still getting paid, or at least hadn’t yet realized they were out of a job.\n With Morgan gone the station echoed with emptiness. Jens watched the sparks along the Worm’s brain and imagined entering the kill command. He’d really be alone, then.\n He put his tranquility freq on, turned it way up, and closed his eyes. You weren’t supposed to turn the volume too high on a cochlear, but it did help, tremored him calm. Sometimes he felt the freq leaking into his skin, numbing patches on his upper arms, his cheeks, the backs of his thumbs. Now it rumbled the pit of his stomach, snaking deeper. A longing, almost like hunger. It wrapped around his diaphragm, beckoning him toward calm. Satisfying, something Jens couldn’t place, like when he listened to a piece of music and could see himself in it, making a song like that; contentment, of being a part of something, but also desire, intense. He thought of the Worm moving in the darkness and his eyes snapped open because the thing he was hearing in his freq was what had messed up the helmet when he was out on the surface, when he’d imagined the Worm out there and scared the shit out of himself.\n A chat made him jump.\n Hello, Jens. I am Any and I am your Silxen Human Resources Liaison. How are you today?\n He felt guilty, like he’d been caught out. The humming was still there, below the tranquility freq, but he was losing it. He couldn’t ignore the chat, or shouldn’t. Maybe someone was going to come get him finally.\n I’m okay. I’m trapped here.\n Yes, we are very concerned about your situation, Jens. Retrieving you is a top priority to Silxen. I do ask that you not share information regarding Silxen assets with ex-employees, as per the security and noncompete clauses in your contract.\n Jens hadn’t even thought of that. Hadn’t thought of Morgan as an ex-employee. Did that mean Jens was still employed? Did that matter, at this point? He apologized as though it did.\n You’re not in trouble, Jens. I understand you’re under a great deal of strain.\n He snorted at that. People who weren’t in trouble didn’t get unsolicited messages from Human Resources Liaisons. The hum built up again in his cochlear, crested, went away.\n Have you run the shutdown protocol on the silica extraction unit?\n The Worm? Where’s Mohammed, is he there?\n He is busy at the moment. I am your Liaison instead. Have you run the shutdown protocol?\n Not yet . . .\n Jens that’s a top priority right now, please do it and inform me when it’s complete okay?\n The way the liaison repeated Jens’ name made it feel like talking to a bot. He leaned back, stretched a little. Thought of ghostly tentacles in the dark.\n I have a potential solution for you and something I’d like you to consider. Please understand that Silxen does not want to pressure you into this decision. Please take your time, Jens.\n Jens, taking his time, didn’t respond. The conversation wasn’t really going anywhere he wanted to follow.\n We have received provisional approval to perform an emergency personality transfer. The pros of this are that there is less risk of retrieving you as data than as a physical form, and you would not have to wait for your retrieval. We could even do it immediately by transferring your data into the Eel for retrieval. Your medical insurance coverage through Silxen will provide a host for your personality and monitoring and maintenance for three years. The necessary equipment for this procedure is available to you in the station already, supply storage LQ-306.\n “The fuck?” Jens whispered.\n Something clanked outside.\n His head snapped toward the sound. He’d never heard anything clank out there, not even when Elena’s ill-fated descender disconnected from the dock.\n His outrage and anxiety bubbled together into adrenaline. He switched on the under-station camera and snaked its neck around, searching. Nothing, nothing, but then the Eel came into view, hooked into the fusion port and rocking a little against its moorings. Twined around its propulsion system was a fragment of Worm. As Jens watched, its grip slid loose and the tentacle slow-motion plummeted into the mealy dirt. It wriggled a little on landing, but didn’t rise again. Dead.\n “Fuck,” Jens said, one more time.\n You’re going to leave me here aren’t you, you’re abandoning me with a tentacle monster at the bottom of the ocean on another planet after killing my friend in front of me you fucking shit fuck fuck fuck.\n Jens did not hit send, just let the message sit there for a while making him feel a little better. His throat constricted with his pulse. When the breath bubble popped up he swatted it off his inviz. If Silxen didn’t like his biometrics they could come and get him.\n But they wouldn’t. They weren’t going to come and get him. That’s what it meant, the upload: Silxen wouldn’t have gotten authorization unless he was well and truly fucked. It wouldn’t be on the table at all if there was a way to get Jens back whole. He was in the palm of an enormous fist. Ever since Elena died that’s how he’d felt, and it was squeezing harder and harder and if one more thing happened he might implode.\n He got in the hamster wheel. Didn’t know what else to do with himself. He was stuck, deserted, fingers tightening around him. He didn’t want to live the rest of his life in someone else’s corpse. He was going to die down here, starve or suffocate or something. A warning popped up in his inviz, and then he was breathing in wheezy gasps and he sank to the floor and put his head between his knees.\n He sat on the floor for a while. Imagined Elena shouting you’re freqing out, Jens!\n That was something. That feeling he’d gotten from his cochlear, right before the HR person chatted him. It had faded during his chat with HR Any, but he could almost feel it now, still.\n It wasn’t one of his freqs. Maybe interference from the station? No way to test that, but he didn’t believe it anyway. He’d been using his freq the whole time he’d been at Mug Ruith and he’d never heard—or felt—that before.\n What he hadn’t ever done before was go out on the surface with his freq turned on. That’s where he’d felt it the first time. When he was out there with the Worm.\n Earworm, his exhausted brain said, making him shudder.\n He sat up. His stomach hurt. His inviz said it was almost time for his sleep shift and he couldn’t remember eating anything since he got up so maybe he was just hungry. Jens pulled himself to the galley and got a meal bar.\n The Worm wanted the Eel. Why? Why else? It wanted to get out of here, too. Get away from Mug Ruith. From Silxen and stupid contracts and certain death. Another body that Silxen owned, like Jens’ and Elena’s.\n He crawled into his bunk, chewing. Rolled on his back. Turned up his cochlear. Turned it up more. Then lay there with the meal bar forgotten in his hand, crying, listening to the Worm’s freq, letting it tell him you are wanted, you are valuable, you are not alone.\n He woke up with a headache and a purpose. It felt good to work with intent; not a feeling he got often, just sometimes when he worked on music and it was going well. The world would still, settle around him for a while. But any time he got stuck writing songs the feeling would shoot away and he’d be alone again inside his skull, the flow of it gone, connection lost. Worse almost to have it and then watch it leave.\n Jens ignored the messages from HR, from Any. Any Body, he said to himself. He kept his cochlear turned up as he hovered down the cold ladder into the Hellhole and through its black eye to the ocean floor.\n It wasn’t hard, this time. With his tranquility freq on, and the Worm humming comfort to him beneath that, the darkness wasn’t so vast. He undocked the Eel, used the suit’s hoist to pull himself up to the charging dock and remove the little fusion battery from the station’s hull. He mounted it directly onto the Eel. Before he climbed back into the station he maglocked the Eel to one of the station struts.\n Back in the station, the lights had dimmed. The charging dock battery provided power for the station’s ancillary systems so that the main battery wasn’t tied up, and with it gone some systems had auto-powered down. Nothing important, and Jens didn’t mind. It was restful in the half-light, calming. The makeshift curtain had slid off the porthole again, but instead of rich velvet black it reflected back warm light, an unreliable, dying sun.\n What would it be like? He tried to imagine, but couldn’t.\n He pulled up the Worm’s biocontrols. He stared at the inviz for minutes before he realized he was drifting, cocooned in his freq; he’d have to switch it off to focus. Better not mess this part up.\n He wouldn’t have been able to do it without Any Body telling him about what was in storage LQ-306. He duplicated the program that LQ-306’s equipment needed, made the necessary changes to it and to the Eel. He triple-checked the program, ran the test twice. Nothing to do but hit go. He watched the Worm’s neural traffic chug along, then spike, twitch, struggle against the pull of the programming as its information—its brain—was dragged from the flabby pale body eating and shitting silica off Mug Ruith vent and instead into the cool cylinder of the Eel.\n Jens wished he could have warned it beforehand. It must have been frightening.\n The under-station camera feed was up in Jens’ inviz. He watched the Eel, stomach cold with fear and excitement, though nothing looked different. Then it came alive. Its motor woke. It rose from the ground, strained against its magnetic tether, paddling determinedly in a circle. Jens wondered how long it would take for the Worm to figure out how to release the maglock.\n LQ-306 held a shallow plastic box with sharp metal spindles inside that looked truly horrific. Better not to think about their purposes.\n The lab had a small multipurpose medical chair. Jens installed the contents of LQ-306 and examined the disquieting result while unscrewing the vial of sedatives. He put the vial to his mouth and swallowed them all, dry.\n Any Body had insisted that it wouldn’t hurt, but then they wouldn’t be the anybody in the chair.\n No reason to delay. Go. Just go.\n Jens went.\n The legs of the chair molded around his calves, and when he put his wrists against the arms they snaked up and held him in place. That shot him through with adrenaline, but he was woozy and finding it hard to stay upright and away from those scary fucking metal bits. Should he have his cochlear on or off? Would it matter?\n The sedative was sucking him down and back—no, that was the medical chair. The thing had a mind of its own, like everything else down here. He fought, but he couldn’t fight it, and gray static was closing in at the edge of his vision. He slid back. Cold pressure against his neck, a spike of furious heat, and then.\n Elena laughing, shaking her head. So long, farewell—\n His inviz dimmed and faded, then flared up, different, taking up more space, all of his vision, not just his eyesight but all his available brain. He was staring at nothing. Blind? Except that wasn’t right, because he could see. He just didn’t know what he was seeing, or he wasn’t seeing with—\n A creeping feeling and a jerk. The inviz faded and reappeared a few times, like he was half-closing his eyes against very bright light. Brain on overdrive, like he’d had too many stim tabs.\n There was a deep thrumming, a buried feeling that segued into that ultimate embrace promised by the freq he’d heard. Oh, satisfying, yes, like hunger fulfilled. Black-and-white grew texture, shades, depths. He could see temperature, but it was a shade of black and the light was a searing nuisance. So much big darkness beyond.\n That was all the first instant. And then something pressed up against his thoughts. Crowded against him. He had just enough time to wonder if he’d made a mistake, a skewer of panic, before the Worm crushed into the space where his singular mind was, filaments of its otherness shooting through and into his thoughts, colonizing them. The hum was there, the freq he’d heard, the feeling he’d come for; it was him and he was it, but it was changed now, colored with fear and confusion.\n You’re free, this is what you want—I gave you what you want. It was hard for Jens to think anything straight, tendrils of that other mind—those other minds, thousands of them, more—breaking down his coherence, but there was still enough of him, enough to try. He shouted as best he could, hoping that, now that he and this other thing were the same kind of thing, the same type of creature, that his intent would come through the way the Worm’s intent had come through on his freq.\n Somebody released the maglock tethering the Eel to the station, Jens or the Worm, it wasn’t clear.\n I gave you what you want, Jens tried again, though it broke apart as he was trying, like a clump of sand disintegrating into particulate. It was replaced instead by a yearning, a hunger that he recognized now, not an empty-stomach feeling but a craving for diversity, for materials, for components of the thing that could build a self into another new self. He had enough of his own mind left to wonder if he had misunderstood the Worm, and then to realize, with distance, that of course he had misunderstood it. It didn’t even recognize him as another mind, another self.\n The station lights went off overhead and the darkness was entire. It slid across them like the gentlest night. The thing inside the mind of the Eel couldn’t see, but sensed when it slid out from beneath the station, into the darkness. The boundless, silent darkness.\n What was left of Jens recoiled, backpedaled, tried to reach for control of the Eel, but slipped beneath the weight of everything else in there with him. And the Worm, humming its song, slithered, hesitating, into the void, to see what they might find."}