{"fingerprint": "veXCcNN5sVByPnkb7fLQrvl6UdY=", "sitename": "Clarkesworld Magazine", "title": "The Memory of Water by Tegan Moore", "author": "Tegan Moore", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/moore_03_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Memory of Water by Tegan Moore", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9200 words, novelette\nThe Memory of Water\nJames had always been able to tell when Camille was eavesdropping. Even though she kept her eyes carefully focused on the messages on her band while she poked at the remains of her salad, it would not have fooled him. He wouldn’t scold her in public, but as soon as she scraped out of her heels at the entrance to their quarters the air would have been humid with the upbraiding to come.\nGood thing James was dead, then.\n“These kids,” said the speaker. He was older, but ageless, with the fine skin and hair that were tells of first-generation age management technology. His reedy voice betrayed his age. “Kids with their own kids—they think it’s supposed to be like this.” His gesture swept the dark window beside him.\nHis companion nodded, eyes lowered, then lifted his beer to drink. Both men wore the marine science conference’s lanyards around their necks, with gold filigreed edges indicating they were honorees. Many of the conference lanyards were the same, worn by long-retired professors and scientists more interested in the Ocean’s soaking pools and cocktail lounges than the attractions. A good thing: it kept the lines down for everyone else.\n“You say fishing,” the man continued, “these kids, they think of a game, an app. You say fish and they think of those vat patties. Out here—” he gestured again to the window, glossed with reflected silver, gold, azure—“they don’t even look. What’s to look at? It’s empty. It’s a void. We could be on the moon.”\nHis companion sipped his beer.\nA burst of laughter from the other side of the dining room interrupted whatever he said next. Camille looked up, trying to catch the words, and saw that the man’s ears were red, his eyes glassy. She averted her eyes. Eavesdropping was one thing; watching an old man cry was another.\n“—a haunted house,” he was saying when the noise subsided. “Full of dead things. The last whale dead now, nothing left bigger than a mackerel—did you think that would ever happen? Ever, really? And these kids, they don’t even believe it was real. They think it’s supposed to be like this. Comb jellies and dreissenids, algal mats clogging everything. It makes me so—” He slapped his palm against the table, his lips working against his teeth as though trying to dislodge something. “Angry,” he finished. Tears broke his voice on the word.\nCamille’s band buzzed against her forearm. A message from Helen Ali: We’re down again. Guests reporting the bug just got off the ride. Come quick if you want to try and see it live.\nThe man was hiding his face in his hands, blue veins standing out between tendons. His hands were much older than his face, delicate things with prominent bones. Something pulled in Camille’s chest, a sweet, aching tug.\nOMW, she eyed back to Helen, and pushed away from the table.\nIn the grand tradition of all theme resorts throughout history, the Ocean had secret passageways. The romance of them lived and died with the phrase. The passages were institutional, painted brick with steel doors and carts humming past towing trailers stacked with food service crates from the central deep freezer, still wafting frozen steam, humming the other way loaded with dozing uniformed housekeepers headed for their quarters at the end of their shifts. It would have been faster to snag a cart, but Camille couldn’t put herself into the cold emptiness of the passages. That old man’s hands, like branches in winter. She felt dead James’ eyes on her.\nEven hurried and haunted, long habit made Camille pay attention as she walked. Watching guests, watching expressions. How long were the physical queues? Were the kids cranky? How many wore something they’d just bought? Filtered data was always streaming into her band, but it was different in the raw. Were the guests happy? Were they having fun?\nEasy access to virtual escapes made everyone expect a certain level of ease and satisfaction from their leisure time. The kind of people who could afford real-space experiences—the kind of people who came to the Ocean—expected the same perfection of a virtual world, the same awe and wonder, plus a level of service to justify the price point. They paid a premium to escape global standoffs and shortages and rolling brownouts, to feel hot sand on bare feet and taste sea salt on the rims of their cocktail glasses, like those lucky past generations had. Camille’s job was to make sure that happened. She liked seeing evidence that she was good at it.\nPlus, the people-watching was fantastic.\nShe followed the marble columns of the Atlantis Colonnade, the ocean sucking and smacking at the boardwalk’s pylons. It was windy despite the near-invisible barrier cloth, and the air smelled of salt. They piped that in—the actual smell of the ocean was more funk than brisk—as well as a subtle soundtrack, bells and chiming chords that made everything feel more intentional. Glamorous.\nThe Colonnade was busy with after-dinner crowds, families headed to their rooms with kids just shy of overtired and couples headed to clubs on the beach. Beyond the Colonnade the ocean spread out, the horizon braiding together with the night sky.\nAnything could be out there. Nothing was.\nCamille thought of that old man’s voice cracking. He wasn’t the first centenarian conference attendee she’d seen in tears. A strange trend. Camille hoped it had more to do with their conference than her resort.\nThe marine sciences conference had been planned for more than a year but made a dramatic shift when the death of the last wild whale was announced—though the animal was so closely drone-trailed and monitored that it could hardly be called wild. The minke’s corpse had taken over the conference’s materials and programming. Camille could see how that would sober a bunch of elderly scientists, though she didn’t like how the pall had spread over the rest of the resort.\nThough that man hadn’t been crying over the whale. Something else. Yet another mystery for the Ocean’s general manager to solve.\nThough one less pressing than the one Helen had just called her to.\nWhatever was disrupting the Memory of Water, the incident reports were bizarre. Guests reporting glitches tended to exaggerate, but these were confirmed by security feeds. If anything, the guests hadn’t realized how strange what they’d seen really was.\nCamille turned onto a wide, sloping boardwalk whose lights were dimmed for the night. A woman leaned against the rail, her band projecting a face in front of her, while two little girls raced each other as far into the dark as their courage would take them. Where the path sank below the surface of the water they turned and ran squealing back to their mother. Camille passed them, shoes pinching her toes as she headed downward. Darkness seeped past the safety lighting set into the floors as the ocean swallowed the reflectionless glass tunnel. The Memory of Water’s lobby loomed ahead.\nThe boardwalk here changed to tiled pebbles and the ceiling arched cathedral-high. The space was so tall and complicated with stalactites and crenelations that it still sometimes provoked Camille’s startle response: a second of panic, a jolt of awe. Even the air changed, the HVAC designed to keep it cool, humid. It was savagely beautiful, a space as vast and sublime as the ocean itself. The big, inelegant temporarily closed, our apologies banner disrupted the effect.\nCamille eyed a quick message to Helen, then flexed her hands out of the fists they’d become. She closed her eyes, swallowed against the lump in her throat. She didn’t have time to deal with this. There was nothing to deal with; it was just that old man’s grief tailing her, winding around her ankles like some hungry little animal. James didn’t matter. They’d been separated; he would’ve left, one way or another.\nWhen the muscles in her forearms and jaw felt looser, Camille let herself through a hidden door that bypassed queue staging and led into the embarkation docks.\nThis was the Living Water, the ride inside the Memory of Water. It girdled an enormous glass column, the Gallery, where exhibits were stacked from the ocean’s surface to its floor. The whole thing was surrounded by open water, immersed and immersive. The Memory of Water had opened two months ago and it had been shoulder-to-shoulder with guests every daytime moment, crawling with sanitation and maintenance drones at night.\nEmbarkation was always kept dark, for drama and to hide the attraction’s mechanical workings, but it was even darker now. The canals were empty, the cars backstage. The space felt too big.\nA crack of light appeared as Helen Ali pushed through another door. She was a tiny, olive-skinned woman, barely five feet tall. “You guys have what you need already,” she said into her earpiece, raising a hand to acknowledge Camille. “No, add it, even if it doesn’t replicate. John, send us up a car, hey?” She gestured the call closed. “I don’t know if it’s more annoying that we can’t make it happen or that we can’t make it stop,” she said to Camille and set her thumb against her lips to chew at a hangnail. “The damnedest thing.”\n“Language, Helen,” Camille said. “This is a family resort.”\nHelen examined the raw spot on her thumb. “In my family that hardly qualifies as a cuss word.” With a thunk, a sleek black boat glided down the canal toward them. It bobbed to a stop in front of Helen, who opened its hatch with her band. “You sure you want to ride? The algorithms on this thing get pretty riled at me.”\nThe Living Water was remarkable in a dozen ways. One was its responsiveness: there were biorhythmic sensors in its cars, adapting the attraction to that feedback. A family with young kids would get gentle drops and friendly startles; thrill seekers would get speed, scares, teeth. Scores of interchangeable tracks made each experience different, unpredictable except to the engineers who’d built its brain.\n“Oh,” Camille said breezily, “I’ll be okay.” She braced her hands on the sides of the car to help herself down into it. The car wobbled as she slid into the first of the four seats. Helen stepped in behind her.\n“No jokes about being ‘this tall to ride’?” Helen said, and then into her earpiece: “John, turn off the waterworks. I have a feeling the boss lady doesn’t want to get splashed.”\n“I do not,” Camille affirmed. “My thanks to John.”\nHelen said, “Let ’er rip,” and they jerked forward along the track, the car bobbing with its own momentum, and slipped into the black maw of the ride.\nCamille pursed her lips around a small, expectant smile. People expected a big-bodied, middle-aged, career-focused widow in sensible heels to be a prude about certain things. Camille the General Manager of the Ocean was kind, helpful, conservative. But she also never turned down a chance to ride one of the Ocean’s attractions, even the ones that left her nauseated. The drops and twists still had the same effect on her they’d had when she was a kid, and she enjoyed, even, the occasional honest terror. She never screamed or raised her arms—Camille the General Manager wouldn’t do that—but she didn’t need to in order to enjoy herself far, far too much.\nThe car turned a corner and the light from the embarkation docks disappeared as they slid into a tunnel of churning water.\n“Time.” The ride’s grandfatherly narrator boomed. “To us, it moves slowly, a lifetime spooling out over a hundred years . . . ”\nUnbidden, the weeping man from the bar came to Camille’s mind. He took a seat next to dead James in her hollowed-out chest. She hoped the ride would knock her out of her morbid mood.\nA sudden glow of electric greens and oranges made Camille blink. They lit Helen’s face as she scowled at her band’s projection. “We run the ride empty,” she muttered, squinting at the lines of data. Their car was nearing the end of the tunnel, the narrator’s voice finishing its liturgy. Camille had braced her knees against the sides of her seat without realizing it. Helen continued: “Nothing. No bugs. We run testers in the cars, and nothing. Nobody can find anything in the data supporting what’s on the damn—gosh darn security vid. We open up again. Ten minutes later, someone gets off the ride pissed.”\nThe car stopped. Camille had forgotten her melancholy; her fingers were tight against the grab rail.\n“I doesn’t make any sense,” Helen said.\n“Things,” thundered the narrator, “we can barely imagine!”\nThen there was a rush of air and the sound of a great rising wave and Camille’s toes clenched.\nThe car shot forward, rose, splashed down. Camille felt a ridiculous little thrill even though she’d been through this ride dozens of times. Helen didn’t even look up from her band’s projection.\nAround them seafloor craters belched gray plumes as the narrator boomed about the beginnings of life. It smelled sulfurous.\n“You seen today’s footage?” Helen asked.\n“It’s not great,” Camille said. Whatever the bug was, it showed up as smears of light on the video feeds. “Have you determined what the image actually is?”\nHelen snorted. “Nope. I don’t think guests have the vocabulary for it. Anyway I’m not convinced this isn’t just some gas leak causing mass hallucinations.”\n“Only an engineer would think that was a smaller problem than a programming bug.”\n“Not sure it’s programming,” Helen said, staring at her band. “Could be something wonky with the hardware and how the graphics interface with . . . ” She lost herself in the little green and orange lines.\nA fissure rent open next to them, belching dark clouds of particulate, and their car darted up and away. Tiny shapes in the water around them—not real water, just immersive holographics—streaked past as they charged forward through time into an undersea forest. The fronds of sea lilies swarmed with horned, lobed, frilled, and tusked arthropods churning their tiny paddle feet. Little fish flickered bronze reflections. Beyond the forest, enormous, unlikely nightmare silhouettes undulated in the middle-dark.\n“I wish we could skip this part,” Helen muttered.\nCamille didn’t want to skip any of it. “Are you impatient for the sharks?”\n“Impatient for whatever ghosts in the machine to show up. That ain’t ’til the Cenozoic, according to the reports.”\nA school of armor-headed fish skulked overhead. Their bodies had the distinctly massive presence of projection-slab holographics—they felt there. Slab holos made the big fish real in a way that VR and animatronics couldn’t quite touch. The Memory of Water was the first to use the tech, and its virtual lines had been sold out since opening. In the past three days more guests had filed incident reports on it than the rest of the resort’s attractions combined. It had spent more than half of each day offline, disappointing guests. Disappointed guests disappointed Camille. Melancholy twined around her ankles again.\nFurther through time, now, and the car shuddered as it evaded a prehistoric shark. Its slab made a breeze as the spade-nosed monster circled away, fading into oceanic dimness. Its silhouette moving through the near-dark was more unnerving than the creature itself, its outline against a green-gray curtain of ocean diminishing into distance. It was out there, somewhere. Camille’s eyes devoured shadows looking for its return. That sense of imminence, of something impending.\nThe car lurched forward, dove, and careened into that dark, dodging a gigantic fish with a face half turtle, half garbage truck. Below them the great colorful brain-shapes of stromatolites grew, then faded and died off, crumbling into sediment. The car slowed to watch the massive truck-fish go belly-up as the Permian epoch ended and the Triassic dawned. Why was that making her sad? She’d seen the thing die a dozen times at least.\nConflict grappled in her chest. Camille wondered if she was actually going to cry. What an odd night.\nThere was violent, frantic movement much too close to her face: silver static, a thousand mirrors crashing into her eyes, streaking past and gone. She screamed, though her reaction came later than the collision. Not a real collision: nothing had touched her. Helen had shouted something, too—probably an obscenity—and was wrenched violently around in the car to look behind them as they dipped and slalomed along the ride’s track. Camille turned too and saw the swirling shape, something she recognized, but didn’t.\n“That’s it!” Helen said. “We just drove right fucking through it! It’s—We hit the bug! It’s that fish ball, from like three scenes from now and we just—” She was cut off by the ride dropping them into a splashdown. Water rose perilously high up the sides of the car. Camille moved her trousered leg away from the water, heart still thudding. As Helen shouted into her headset Camille craned around in the car, trying to catch the next thing before it smashed into her face again.\nThe ride slowed, the scene changed. It was dark here, but the creatures were so large you saw them anyway. This area used a whole different set of slabs, huge ones the size of kayaks, of motorboats. Around them oceangoing reptiles stretched and morphed: long-necked, paddle-footed plesiosaurs, saber-beaked ichthyosaurs. Something streaked by that looked like a squid with tentacles branching like coral.\nHelen enlarged her projection to swipe through data. “Is that it? Here, where I’m pointing. No, down one. No, that’s—where is it?”\nA whalelike mosasaur undulated past in the greenish darkness, circling the car. Its massive, toothed face cut sideways to snatch a passing fish. With Helen distracted, Camille was alone with the monster. Adrenaline twitched her muscles. The creature swept toward her in the slow-motion of enormous things, front flippers stroking, then back flippers, spine, and tail rippling to the rhythm of Camille’s breath. It came at her like inevitability, the same slow steady descending march of her marriage wearing thin, then the separation, then James’ terminal diagnosis, everything coming apart at once. He’d barely been back in Charleston for two weeks before he’d found out how sick he was. Maybe reaching out to tell her had been some kind of appeal, but how could she forgive so much, so fast? He’d left her. And then he’d wanted her to comfort him as he left her again.\nBefore the mosasaur could reach the car, silver flashed overhead, a shiver of mercury: the bait ball, the out-of-place, rapidly orbiting school of small fish that wasn’t supposed to appear in the attraction—in the ocean—for millions of years. Heart in her throat, Camille pointed, but Helen had seen it. They watched the bug duplicate itself again, again. The mosasaur swam through its edge, holographics glitching as they bounced through each other.\n“It’s back,” Helen reported. “We’re getting a real show. Goddamn, that’s eerie.”\n“Language,” Camille muttered, watching fish spin. Her eyes could barely make sense of it: metallic flashes, fins, and the occasional black, accusing eye. How strange, that this had been a real thing, something that happened in the ocean with nobody watching at all.\nTwo more bait balls appeared in rapid succession, then a handful. Camille had to lean out of the car to count them as they appeared around and behind each other. One swarmed so tightly it looked like an eyeball, its dark center gazing at her.\n“Okay, okay,” Helen said. “John, shut us down. It’s a mess in here, something’s going to blow.” The car stopped—the ride had turned to follow the hunting mosasaur—and the graphics froze. Then everything switched off; safety lighting snapped on. The glamour fell away. Enormous flat-white lozenges of the slabs hung from gimbals all around them. Camille felt like she’d just been rudely woken from a dream. She blinked hard; in the sudden light, it seemed like the bait balls were still there, flickering, the flash of empty eyes.\n“John,” Helen shouted over her headset. “The exit! What are you even doing in there?”\nHe must have been doing something, because a blinking catwalk unfurled next to the car. “Do not attempt to exit the car until security arrives to assist you,” the catwalk told them. “Please remain calm. Do not attempt to exit the car—”\nHelen already had her leg over the side before the walkway had extended its handrails. She slid down onto it and offered Camille a hand. “Let me help you,” she said. “I don’t want to be that lady who accidentally killed her boss.”\nAnother catwalk led to a service walkway following the outside wall of reflectionless glass that divided the ride from the ocean. On one side they were surrounded by the mechanical jumble of the Living Water, creatures by day and lifeless white discs by night. On the other was the actual ocean, empty and lifeless.\n“It was never that bad for the guests,” Helen said. “I told you I make the algorithms go wild.” Helen waved her band and a locked door hissed open.\nIt let out into the Memory of Water’s central column, the Gallery. It was a dim, dramatic space, with twisting paths spiraling down one side of its enormous column and climbing back up the other, and spines crossing between for backtracking or shortcutting. Spotlights contrasted dark water. From here you could see into scenes from the Living Water, though its riders couldn’t see into the Gallery. Up and down the column were digital and animatronic exhibits, along with a few tanks of live clones.\nTwo young men were trotting down the ramp toward them. One called, “Are you okay?”\n“Fine,” Helen said. “Boss?”\nCamille shrugged. “I guess we found the problem.”\n“We found what the problem looks like, at least,” Helen said. “Fish balls, for Christ’s sake.” She pointed. “Harry. Aloysius. This is your boss’ boss’ boss. Her name is Camille, but you will call her ‘yes ma’am.’”\nBoth boys—they were probably in their twenties, but they seemed like kids—looked at Camille, wide-eyed. “Yes ma’am,” they repeated.\nWhat did Helen do to these poor kids? “Camille is fine.”\n“Yes ma’am,” one of the boys said. Then, panicked: “Camille.” The other looked at him like he’d just poured hot coffee down his front.\nHelen pulled up her projection again, and the three engineers crowded around it as they walked up the ramp. Camille tuned them out, watching the exhibits as she passed them: the virtual ones empty, animatronics slumped at the bottom of their tanks. She wasn’t sure which was more depressing. The little reservoir of live guppies was worse, though. The tiny things seemed less real than the holograms.\n“What about John’s idea?” one of the boys said. Helen either wasn’t listening or was ignoring him. He reached out to tap Helen’s shoulder. “What about John’s—”\n“John’s idea is fucking bonkers,” Helen barked.\nThe kid didn’t cringe away. Working with Helen, Camille guessed he’d heard worse. “It’s better than no idea.”\n“You are also fucking bonkers.”\nCamille wondered if she’d actually encounter this John at some point. “What’s John’s idea?”\nHelen shot a foul look at the kid she’d been bickering with—it made the boy grin at her—and said, “John thinks that the spirit of the ocean is avenging itself against the generation of millennials who crapped all over it. Pooped. All over it.” When Camille didn’t respond, Helen continued. “There have been old folks in most of the cars reporting bugs. I told you, it’s bonkers.”\n“Well, I’m old,” Camille said, eyeing the two young engineers, “but I’m not that old. Doesn’t that ruin the theory?”\n“I didn’t think—” said the kid, reddening. “You’re not—my mom’s, like, even older than you are.”\nCamille gave the boy a tight smile. He turned from pink to puce.\n“I think it’s Linux,” said the other boy.\n“No,” Helen said. “No, no, no.”\n“Linux like the language?” Camille asked.\nHelen said, “Can we not air all our batshit conspiracy theories in front of the general manager, please? Batpoop.”\n“His name is Linux,” said the boy. “I don’t think that’s his real name, but it’s what everyone called him. He’s that guy who went kind of off the deep end? During the build-out?”\n“Thank you, Aloysius,” said Helen. “I’m so glad you brought that up.” Camille waited, one eyebrow raised. Helen sighed. “He had some . . . incidents . . . at work. He was pretty close to getting canned, and would have been if he hadn’t been a fu—antastic dev. A few months before the soft open his mom contacted me and asked for help getting stuff so she and his doctor could take over his medical power of attorney. He wasn’t doing well, mentally. He was pretty pissed when he found out. Even more pissed when I had to let him go for disappearing for a week straight.”\nCamille didn’t know what to think. “So you think this could be some sort of disgruntled former employee? Sabotage?”\n“No, boy wonder here thinks that. I think it’s a bug in the graphics interface that we haven’t—”\n“But if it’s that,” Harry interrupted, “why isn’t it showing—”\n“I just think we should take your safety seriously,” Aloysius said over both of them.\n“I don’t need your supervision, white knight.”\n“Okay,” Camille said. “It’s past my bedtime. Nice to meet you both.”\nAs Camille mounted the ramp up through the Gallery, Helen and her sidekicks arguing below, she kept her eyes on her tired feet. She didn’t look into the dark and empty tanks to her right, or into the sleeping exhibits on her left; she most certainly did not look past them into the open ocean beyond the Living Water. She told herself it was because she was tired, because there was nothing to see. She told herself she wasn’t unnerved, imagining huge shapes sliding through the distance. She wasn’t being stalked by an undefinable sadness or watched by the eyes of her dead.\nShe was tired, that was all.\nThe door closed softly behind Camille, but it did nothing to muffle the howling behind it. No wonder the little girl’s dads had been so unpleasant.\nEven though the men were objectively awful, even though they were the kinds of guests that escalated an unexpected scare on a ride to the point where the GM got called in, and then treated the GM like an idiot—even after that, Camille still felt bad for them. You had to have empathy for guests to do her job. Camille had always been good at that—too good, sometimes. And their kid had one heck of a set of lungs.\nThe family was responsible for one of yesterday’s bug reports. It wasn’t clear if the girl was upset about the ride or if the tantrum was unrelated, though the dads wouldn’t be a reliable source of information on that right now. The kid’s grandmother had been with them on the ride as well, but she was at her conference sessions.\nHelen’s team had no news, and the Living Water had been offline for fifteen hours while they investigated. That was fifteen hours’ worth of disappointed guests. On top of that, a VR server crashed and took SharkQuest from a dozen immersion pods to eight, which meant long waits made longer by all the people who weren’t already tied up in the queue for the Memory of Water. It was the kind of day where even if Camille stood in the middle of the Atlantis Colonnade handing out free puppies half the people would scream at her about allergies.\nUsually on days this bad, Camille’s excellent PA would make sure she was well-supplied with cinnamon pralines from the confectionery on the Colonnade, but it was her PA’s day off. It was supposed to be Camille’s day off, too, but here she was. And on very little sleep—she’d been restless all night, dreaming visions of sharks slipping past her windows, hallucinating coral-limbed squid in the bedroom doorway. James, too: not his image, not his person, but he’d moved through her dreams like the mosasaur, a dim shape disrupting the dark.\nInside the staff passageways, she unlocked a cart and dropped into its front seat. She slid her shoes off, set the autopilot, and then checked her band in case Helen’s team had made some remarkable breakthrough. All she saw was that she was going to be late for her meeting with the marine science conference people.\nThat conference was Camille’s saving grace. They’d booked out a fifth of the resort’s capacity, and half those rooms were elderly attendees without family in tow. They were a demographic fairly unperturbed by offline attractions and long queues.\nWhen Camille parked the cart and pushed back into the guest-facing part of the resort, she was already five minutes late. She’d worn the wrong shoes to hurry in.\nDespite her hurry, a trio of women caught her eye. They walked together with the kind of attentive, casual comfort that insinuated long acquaintance, if not friendship. All three wore matching silver starfish earrings as well as gold-rimmed conference badges. One supported the woman in the middle, comforting her as she palmed tears from her eyes.\nAnother weeping marine biologist. If Camille wasn’t already late, she would have stopped the trio and begged them to tell her why. She suspected the answer was outside her realm of control. She could not deacidify oceans or un-melt polar ice caps. She could not resuscitate that lonely last whale. All Camille had at her disposal were VIP seats and comped meals.\nFortunately, the conference’s PR team didn’t want anything she couldn’t give them. She walked into the meeting late, apologized, and helped herself to a pastry. Stress eating, James would have called it, but so what? James wasn’t there to shame her.\nThe Ocean’s PR team and the conference’s PR team conferred; Camille was just there to reassure everyone that everything was fine. They went over security plans for the next day’s closing ceremony. The conference had just announced that Liam Alexander would be presenting a memorial to the passing of the last wild whale, not mentioning that he’d been booked months before. Originally Alexander had been hired to do his usual appearance—some celebrity chitchat, a prepared script with a few laughs—but the recent death and its sobering influence on the conference had changed plans. Regardless, tickets had been snapped up within half an hour of announcing the special guest.\nThe conference people had concerns about the Memory of Water, but Camille dispelled their fears. Though the Living Water ride was offline, the Gallery in the attractions’ central column was open and bug-free.\n“I’m so glad,” said the conference’s head PR wonk, a sweater-vested and smiling man named Chad. “The Memory of Water is the perfect backdrop for this ceremony. Mr. Alexander has expressed his excitement as well.” He paused. “Will the ride be back online any time soon? His people wanted to know if they could get an exclusive.”\nCamille hesitated, then smiled. “If Liam Alexander wants it, then we’ll make it happen.”\n“That’s great news. Maybe there will be a spot for me in his car. I’d love to ride it!”\nCamille tried not to think of a ball of fish hitting Chad in the face, and when that failed, she tried not to laugh. If she laughed, she might not stop until she started crying.\nShe was tired. That was all.\nFor ten whole minutes, the Mermaid Lagoon was swarming with bait balls.\nThe Mermaid Lagoon wasn’t in any way related to the Memory of Water, though some of its graphics shared code.\n“This is great,” Helen said. “I mean, it sucks that all those kids peed their pants and stuff, but at least now we know where to look for our problem.”\nThen it wasn’t bait balls anymore.\n“A cuttlefish,” the woman told Camille. “I’m not certain what kind, because instead of arms it had branch corals. Staghorns.” She grimaced. “Staghorn corals went extinct not that long ago. When I did my dissertation research they were everywhere in the Gulf and the Caribbean Sea. They really did look like antlers, huge beds of them. Gorgeous things, orange and purple and gold. By the time I got tenure they’d almost all completely bleached out.” She glanced at the ocean out the window, then looked at her hands. “It still had both tentacles, I don’t know if that’s relevant. The cuttlefish, I mean.”\nCamille nodded. She’d read the report, but she was hoping that by speaking to the guests herself she might notice something, some connection that would make this all start to make sense. The woman hadn’t been at the Mermaid Lagoon; she’d seen her cuttlefish in the background of the Undersea Odyssey special effects stage show.\nThe woman fingered her conference lanyard, smoothing it against her blouse. “Anyway, I didn’t get too close a look at it, because it was swallowed by a basking shark a few seconds later. Which, they were filter feeders, so that’s not accurate.”\nCamille didn’t know a basking shark from a barracuda, but she smiled and nodded again. She felt bad for the woman, like Camille should offer a hug, though she never would. The woman was as well-preserved as everyone in her generation, but her eyes looked older—tired. She’d outlived all the creatures she’d studied. No wonder she seemed sad.\n“Thank you, Ms. Hartford. I won’t keep you any longer.”\nThe cuttlefish wasn’t the only problem. Camille had shut down the animatronic dolphin encounter when the seahorses in its digital backgrounds grew pockmarks infested with centipede-like worms with horrible, bristly mouths. They looked like something out of a nightmare, though the Storytellers team lead said he’d looked it up and they were an actual thing once. That wasn’t a comfort, because even though the worm had once existed in reality, it didn’t exist on the Ocean’s servers, and if they weren’t on the servers then how were they getting into the crevices of virtual seahorses?\nThey’d put up a temporary background, an innocuous ocean-scape. It was so far mercifully free of monsters, though Camille thought the waves looked suspicious, as if beneath their refractive surfaces they roiled with tentacles, mandibles, antennae. Razor-sharp gills and rows upon rows of teeth.\nAs Camille showed Ms. Hartford out of her office, she found Helen waiting outside, chewing on the nail of her pinky finger. Her tiny shoulders were hunched halfway to her ears.\nCamille sighed. “I’m guessing this is bad news.” She stepped aside and shepherded Helen in.\n“I got ahold of Linux,” Helen said as Camille closed the door behind them. “Actually, his name is Linus, but hackers. You know.” She glanced up at Camille, then collapsed into the chair Ms. Hartford had just vacated. “Anyway, I messaged him, and he finally answered.”\nCamille was still standing by the door. “The disgruntled former employee? Are you about to tell me this is all one unhappy developer sabotaging my whole resort?”\nHelen put the tip of her thumb between her teeth and tore away a bit of skin. She didn’t look up.\n“You are?”\nHelen took a deep breath. “Okay, before we send in the SWAT team or whatever, can I just say first that this is a legitimately unwell man who’s making this claim?”\n“What claim? I’m not sure how that’s supposed to reassure me.”\n“It’s not,” Helen said, “I’m saying he’s probably full of shit.”\n“Language.” Camille forced herself into her workstation’s seat.\n“That is appropriate language for what he’s full of, boss. Look, okay. He responded to my message with some kooky stuff that, yeah, if you look at it a certain way, he could be saying he hacked the graphics server. But it could also just be someone who’s not okay saying weird, vaguely threatening things because he doesn’t have any impulse control.” Camille opened her mouth to protest but Helen stopped her. “I gave it to security. They have everything. We’re taking it seriously. I’m just saying, I’d rather call his mom first.”\nCamille put her face between her hands and squished. It took some of the tension out of her jaw. “Okay. We have a potentially malicious hacker, a resort gone amok, and a bunch of media showing up in the morning for a whale funeral. I respect your request—”\n“He’s not a bad kid.”\n“—but given that we have no other leads, we have to pursue this one. You said you talked to his mom before?”\n“Like eight months ago, for that power of attorney stuff. It’s not like we’re in a sewing circle together or some sh—thing.”\n“If you can get ahold of her again, and she can get him to cooperate, then I’m fine with not bringing police into it. For right now.” Helen started to rise from her chair, and Camille stood too. “But if he did something, the Ocean will file charges. That’s just how things work.”\n“I get it, boss,” Helen said, “I understand.”\nBut the way she said it, Camille was sure she didn’t.\nOnce Helen was gone, Camille requested a live-chat with her manager in Miami. The two of them talked for a few minutes, and then he called back half an hour later—Camille was in her quarters by then, debating whether to open a bottle of wine—with the President of Atlantic Operations on the line. When that conversation ended several hours later, Camille paused to take a few deep breaths. Then she woke up her head of PR, and together they composed a message to all current resort guests and reservation-holders due to arrive within the next two days.\nThen Camille shut down every attraction in the resort.\nIt was late when she sent her last message. Once she finally turned off her screen Camille rested her head on the top of her little sofa and rubbed the tight muscles of her jaw. Something felt wrong with her, a wad of sour tension at the base of her throat that wasn’t worry, wasn’t frustration, though both those things seemed reasonable. A lump in her throat. She wondered if this mess would end her career. She thought, unprovokedly, of James. He’d been dead six weeks now. More than six. They hadn’t talked for two weeks before he’d died.\nCamille hadn’t missed him. She still didn’t miss him. That was the worst, the strangest, part. Married for twelve years, and she hadn’t cried when he said he was leaving. Didn’t miss him when he’d moved out, and she didn’t miss him now that he was dead. Which told her, what?\nHer breath stuttered in her chest a few times. She felt hollow, sick, and wrung out.\nSleep.\nAs she stood up, movement caught her eye. Something silvery and quick, almost liquid, moved against the baseboard of her galley kitchen. It was gone before she really saw it. She stood there for a moment, staring at the kitchen floor, knowing she hadn’t seen anything there.\nStill, she could’ve sworn it was an eel.\n“What a crap morning,” Helen said by way of greeting. She leaned against the railing next to Camille and blew into the steam coming off her coffee cup. Camille couldn’t bring herself to agree out loud. Behind them, beyond reflectionless glass, the ocean swam with turquoise light. Pale sand rippled in strange topographies stretching off into the distance. Nothing moved out there except the sunlight.\nThey were at the bottom of the Gallery, waiting for the conference’s closing program. Guests talked over rows of chairs. Others milled in the aisles or looked into exhibits. Camille watched one woman lead her grandchild from window to window, pointing, telling stories. Three less well-supervised kids chased each other up and down the ramps.\n“I got confirmation from Linus’ primary care doctor,” Helen said quietly. “He’s been at that digital detox place for ten days. Only has access to messages in the common areas for, like, one hour a day. No other tech.”\n“Not our man,” Camille said, and sighed.\n“The place sounds like hell.” Helen picked at a fingernail. “Thanks for trusting me on that one, boss.”\n“Is the Living Water online?”\nHelen shrugged. “With the trouble we’ve had replicating the bug, I can’t give you a real answer. Liam Alexander might get fish-balled, he might not. That risk okay by you?”\nCamille grimaced. “That’s up in the air.”\n“I gotta admit,” Helen said, “I’m not feeling great about this whole thing.”\nCamille turned to look at the woman beside her. Helen was pale save for a flush along her cheekbones. Her hoodie was rumpled, and there was a dark splotch above the Ocean logo that Camille thought she recognized from the previous day. She wondered if Helen had been back to her quarters since yesterday.\n“I’m not happy either,” Camille said. “That doesn’t mean we aren’t doing the best we can.”\n“Yeah, well,” Helen said, “I just hope that ‘the best we can’ doesn’t get me fired.” She pushed herself off of the rail. “I’m gonna go run a few more diagnostics that I’ve already run a dozen times.”\nCamille watched Helen climb the ramp upward and slip through a discreet door. Her gaze continued up and around the huge space. Exhibits ended several turns of the ramp overhead, leaving a grand glass cavern at the bottom, where Camille stood. On one side of the circle, a stage ringed with flowers waited for the conference’s closing. Beyond the glass, morning light played across the seafloor. It was beautiful.\nThis should have been a proud moment. Instead, Camille felt the weight of all those refund demands, the irate messages on her band, her PR team’s anxiety, her staff’s exhaustion.\nAnd then the faces around her. Beneath the busyness of the filling seats, there was still that current of aching sadness in the people gathered here. For the whale funeral.\nThat wasn’t her sorrow, but she felt it anyway.\nThe lights dimmed and rose, cueing people to take their seats. A screen flickered to life: a blue expanse, and in the distance, the approaching shape of a whale moving in that leisurely way that huge things had. Camille stayed standing, watching over the audience from the back.\nThe first speaker stepped out onto the stage, and the applause he received undoubtedly anticipated Liam Alexander’s appearance. But it was an older man. He shuffled to the lectern, leaned into it comfortably. Camille didn’t recognize him until he started speaking, and then it was his voice that she remembered: cracking on the word angry, hiding behind those rawboned hands.\n“I’m not going to talk about whales,” he said. “But let me tell you about tuna.”\nHe wasn’t joking: the screen behind him showed a vid of tuna, their skins pearlescent and shot through with bright blue.\nIt switched to a slideshow, and many pictures looked like the speaker had taken them himself. The snapshots seemed intimately real. In holos and vids it was easy to believe that things had been tweaked, colors made brighter, light made to play nice. Reality was rarely so vivid. In these, the fish were themselves: bright bodies flickering lustrous and liquid against the enormous blue of the ocean. The man had studied skipjack tuna; he spoke of the era he’d grown up in, done his science in, seen the end of. Camille couldn’t tell if he was as compelling a speaker as he seemed, or if this crowd was particularly receptive. “Skipjack aren’t near as charismatic as whales,” he said, “but to me, they were the biggest creatures in the ocean.\n“I’m almost done here, and thanks for listening.” He stopped, cleared his throat. “We estimate the skipjack went extinct in 2043. The last tuna of any species just a few years later, in 2047.” Behind him were flashes of silver against aquamarine, an endless school swimming past.\nThe old man leaned forward, closer to a microphone that wasn’t there.\n“It was always already too late.” His next vid looked over the rail of a boat as thousands of fins sliced the choppy surface of the water. “Our evolution has always coincided with a loss of biodiversity, from the megafauna we hunted to extinction in the Pleistocene, to the Great Dying of these last two centuries. It is our species. It is who we are.” Another slide, the presenter as a very young man, holding a pair of fish by their tails. “We may be no more able to change that than prehistoric trees could control that the way of their flourishing caused oceanic anoxia and led to the Devonian extinction.” The spiraling silver shapes again, a frantic school parting and reforming, braiding into strange shapes as they evaded a shark that ripped through them like a swung sword. “We are animals. Animals do what they do, whether they intend to or not.” He craned his body around to watch the flashing school for a moment. When he turned back, his voice grew soft. “We must be gentle with ourselves when we consider what, and how much, we have lost.”\nHe left the stage to a disconcerting lack of applause. The lights stayed dim.\nNothing happened.\nIn the stillness it seemed as if something tangible passed among the crowd. A ghost of the weight Camille felt on her own chest, introspective, full of regret.\nIt was a funeral, after all.\nSomething needed to happen to divert the mood, and soon. When someone finally took up the stage it wasn’t a celebrity, but Chad, the smiling PR guy. He was still smiling, but it looked forced. He greeted the flat, forlorn crowd. “Thanks for being here,” he said. “In just a few minutes Liam Alexander will be out. Hang tight for just a bit and in the meanwhile please enjoy the Memory of Water and its fantastic exhibits!”\nA last-minute delay, undoubtedly for mysterious celebrity reasons. When Chad left the stage, the lights came up and quiet whale song began to echo around the room again.\nPeople muttered, but many more sat, vacant and quiet. Someone in the last row wiped tears from his eyes. Camille looked away, instead stared at the expanse beyond the walls of the Memory of Water. Nothing glinted out there, no gleam of bronzed scales. She wondered what it would be like to find herself surrounded by the wild, alien life that the Memory of Water worked so hard to recreate.\nShe wondered if it was the crowd’s mood that felt intolerable, or only hers.\nA dad herded his trio of kids past, all in matching Charlie the Otter shirts. The littlest tripped and started to wail. While the dad was tending to him the two older kids clambered up onto the rocks that ringed the glass, the ocean beyond.\n“You’ll fall in,” the boy taunted his sister. He mimed pushing her. “Don’t fall in or the sharks will eat you!”\n“There is no sharks,” the little girl shouted. “You’re a butt!”\n“Woah,” said the boy, staring past her into the water.\n“Dad-dy!”\nThe dad said, “What the hell is that?”\nThe little girl turned and then shrieked. The sound carried ferociously over the burble of voices and soft echoing whale song.\nCamille took a step toward the wall, then another. She blindly thumbed the security pattern on her band. Others, too, were moving toward the glass and the water beyond it, faces upraised, squinting, furrowing brows. Voices created a rhythm as “what?” echoed mouth to mouth—what’s happening what is that what’s everyone—\nA shape hung in the water, a fetal comma of gray the size of a man. Camille could only assume it was a drowning accident, somehow, even though they were fifty feet beneath the surface, even though algorithms had put the likelihood of a drowning at below .02% during liability assessments, even though there were no bare-skin exits anywhere near the Memory of Water, no way through the security fail-safes.\nBut what else would be in the water except a corpse? That’s all that was left.\nAnd then the shape turned, and its profile changed, and it flapped the corners of its diamond-shaped body and flew slowly toward them.\n“Oh my god,” Camille heard herself say.\nThe manta swam closer, coming into focus. The delicate ladder of its gills showed on its underside as it angled upward. It was so much larger than Camille had thought mantas were.\nThe man standing next to her—Camille hadn’t noticed the crowd gathering—held up a screen. “Did you get a good one?” asked the woman he was with.\n“Something’s messed up. It’s just a blur.”\nThe creature gave a mighty push of its wings and coasted forward. It was going to hit the glass. Camille hoped it wouldn’t, wouldn’t harm itself, it had to be one of a dozen of its kind in the wild, at most. She thought they were all gone, but how would she know? Someone in this crowd would know, probably many of them.\n“It’s beautiful,” said a voice next to her. The older woman was talking to Camille, tears drawing tracks down her cheeks. “I don’t know how they do that. It looks so real.”\n“I’m—” Camille meant to say she wasn’t responsible, this wasn’t something they’d created, but then the manta was too close, looked like it was going to hit the wall. It flew right up against the glass and, at the last instant, banked to the side. It drew exclamations, unbidden, from the throats of its audience.\nThen a finger of dark gray cut through the glass. Reached inside, into the cavern of the Gallery, into the Memory of Water.\nCamille’s heart stopped. The manta raised its fins and the protruding shape disappeared. Its wings beat again, and now one whole wing came through the glass. Then the manta banked and sailed overhead through the open air.\nGasps from around her. Camille craned her neck back. Amazing.\nThen the General Manager in her woke. She realized, belated, that nobody was panicking. No screaming or running for the exits. People hoisted up small children, took vids. They all thought it was some trick. The Ocean’s glamour.\nShe was the only one who knew.\nThat hit her like an open palm to the face. She was alone in this crowd. Alone with this unbelievable moment.\nThe only one who knew it was real, even though it couldn’t be.\nThe creature left a trail of clammy cold in its wake.\nHer band pinged: security had arrived. Camille saw the trio in bright-purple vests pushing through the crowd. They stopped next to Camille as the manta circled over their heads. “Is this a . . . uh,” the security woman pivoted to follow the apparition’s path. “Security breach?”\nCamille shook her head. “I don’t know what this is.” It came out as a whisper.\nThe crowd vocalized as another manta flew through the wall, followed by a third. They caught up with the first and circled the stage. Hitchhiking suckerfish stuck to one of them. The manta and its passengers passed halfway through one of the exhibits, going faint where it intersected the glass. Once Camille saw it go transparent, she realized that she could see through all of them, barely, like peering through thick smoke. A hologram? But it couldn’t be.\nAnother manta flew down from above. This one looked slightly off, its edges ragged. Deranged. It, too, trailed remoras—a lot of them. It flew lower until it was just overhead, and when it passed Camille, she saw it wasn’t just the parasites. There were eyes, mouths, little faces protruding from its flesh in no natural pattern; beaks and mouths embedded in its belly, eyes bulging out at her. It swished out through the glass and into the dead ocean, raising the hair on Camille’s arms.\nShe thought of worms curled inside seahorses. The squid with the coral-branched arms. She knew that creature was impossible. She had known.\nNow, of all times, her eyes began to burn. Not James leaving, not his death sentence or his actual death. Not this whole week of stress and frustration and anxiety. Now, as these magnificent, horrible hallucinations circled overhead: now she felt her chest clutch around a spearhead of grief.\nA murky outline appeared far off in the empty water. The disfigured manta was heading away, toward it. The distant shape was much larger. Its edges undulated, the form unstable, unsettled.\nSomething was coming. Something big.\n“Out,” Camille said. The word felt too big for her throat. Then, louder, because her security team was distracted by the show: “Now. Everyone out.” The nearest security woman snapped back into the moment, started entering codes into her screen and calling to her comrades.\nCamille’s pulse raced. “Everyone, please,” she shouted, trying to keep her voice from breaking. “Up the ramps. There’s nothing to panic about, but we need to get everyone out. Please, let’s go.”\nThe bewildered crowd reacted slowly, drowsily. A tide pulled them back, making the logjam of bodies turning toward the ramps—families, old folks, all reluctant to leave the mantas—a slow-motion horror. Camille stood at the back of all of it, pushing people forward, don’t look up, don’t look back, for god’s sake don’t look at what’s coming. Was she the only one who could see it? But the mood in the crowd was split equally between annoyance at yet another disruption and that lingering, pernicious, overwhelming grief.\nShe looked over her shoulder and saw that the shape loomed larger, though it was still just a shadow in the green. Camille couldn’t tell what it might be. The manta had vanished into the distance, and still that other thing grew, its outline less symmetrical, things moving and beating and thrusting, aberrant joints opening and closing, sucking it nearer.\nThe column of guests crawled up the ramp toward the safety of the surface, herded by the small security team. But Camille had stopped moving. It felt like she was standing in shallow water as a wave towed her backward, drawing her in even as a greater swell built behind her.\nShe stood at the bottom of the ocean as the shape loomed darker, larger. Her heart floundered in her tightened throat, but she couldn’t move. Didn’t want to move.\nShe didn’t want to struggle up that ramp toward the daylight, in the wake of all the people she was responsible for. Didn’t want to fight against the weight that held her there.\nShe could have, but she didn’t.\nCamille put a hand on the glass and watched, waiting for the thing to make itself clear. Waiting to see it plain, so that they might be, for a moment, together, and so that she might understand."}