{"fingerprint": "t9MpbibTuGg6DIRVK/M69czVIQo=", "sitename": "Clarkesworld Magazine", "title": "I Tell Thee All, I Can No More by Sunny Moraine", "author": "Sunny Moraine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/moraine_07_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: I Tell Thee All, I Can No More by Sunny Moraine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2390 words, short story\n I Tell Thee All, I Can No More\n Here’s what you’re going to do. It’s almost like a script you can follow. You don’t have to think too much about it.\n Just let it in. Let it watch you at night. Tell it everything it wants to know. These are the things it wants, and you’ll let it have those things to keep it around. Hovering over your bed, all sleek chrome and black angles that defer the gaze of radar. It’s a cultural amalgamation of one hundred years of surveillance. There’s safety in its vagueness. It resists definition. This is a huge part of its power. This is a huge part of its appeal.\n Fucking a drone isn’t like what you’d think. It’s warm. It probes, gently. It knows where to touch me. I can lie back and let it do its thing. It’s only been one date but a drone isn’t going to worry about whether I’m an easy lay. A drone isn’t tied to the conventions of gendered sexual norms. A drone has no gender and, if it comes down to it, no sex. Just because it can do it doesn’t mean it’s a thing that it has.\n We made a kind of conversation, before, at dinner. I did most of the talking, which I expected.\n The drone hums as it fucks me. We—the dronesexual, the recently defined, though we only call ourselves this name to ourselves and only ever with the deepest irony—we’re never sure whether the humming is pleasure or whether it’s a form of transmission, but we also don’t really care. We gave up caring what other people, people we probably won’t ever meet, think of us. We talk about this on message boards, in the comments sections of blogs, in all the other places we congregate, though we don’t usually meet face to face. There are no dronesexual support groups. We don’t have conferences. There is no established discourse around who we are and what we do. No one writes about us but us, not yet.\n The drones probably don’t do any writing. But we know they talk.\n Drones don’t come, not as far as we can tell, but they must get satisfaction out of it. They must get something. I have a couple of orgasms, in the laziest kind of fashion, and the vibration of the maybe-transmission humming tugs me through them. I rub my hands all over that smooth conceptual hardware and croon.\n There was no singular point in time at which the drones started fucking us. We didn’t plan it, and maybe it wasn’t even a thing we consciously wanted until it started happening. Sometimes a supply creates a demand.\n But when something is around that much, when it knows that much, it’s hard to keep your mind from wandering in that direction. I wonder what that would feel like inside me. One kind of intimacy bleeds into another. Maybe the drones made the first move. Maybe we did. Either way, we were certainly receptive. Receptive, because no one penetrates drones. They fuck men and women with equal willingness, and the split between men and women in our little collectivity is, as far as anyone has ever been able to tell, roughly fifty-fifty. Some trans people, some genderfluid, and all permutations of sexual preference represented by at least one or two members. The desire to fuck a drone seems to cross boundaries with wild abandon. Drones themselves are incredibly mobile and have never respected borders.\n Here’s what you’re going to do. You’re not going to get too attached. This isn’t something you’ll have to work to keep from doing, because it’s hard to attach to a drone. But on some level there is a kind of attachment, because the kind of closeness you experience with a drone isn’t like anything else. It’s not like a person. They come into you; they know you. You couldn’t fight them off even if you wanted to. Which you never do. Not really.\n We fight, not because we have anything in particular to fight over, but because it sort of seems like the thing to do.\n No one has ever come out and admitted to trying to have a relationship with the drone that’s fucking them, but of course everyone knows it’s happened. There are no success stories, which should say something in itself, and people who aren’t in our circle will make faces and say things like you can’t have a relationship with a machine no matter how many times it makes you come but a drone isn’t a dildo. It’s more than that.\n So of course people have tried. How could you not?\n This isn’t a relationship, but the drone stayed the night after fucking me, humming in the air right over my bed as I slept, and it was there when I woke up. I asked it what it wanted and it drifted toward the kitchen, so I made us some eggs which of course only I could eat.\n It was something about the way it was looking at me. I just started yelling, throwing things.\n Fighting with a drone is like fucking a drone in reverse. It’s all me. The drone just dodges, occasionally catches projectiles at an angle that bounces them back at me, and this might amount to throwing. All drones carry two AGM-114 Hellfire missiles, neatly resized as needed, because all drones are collections of every assumption we’ve ever made about them, but a drone has never fired a missile at anyone they were fucking.\n This is no-stakes fighting. I’m not even sure what I’m yelling about. After a while the drone drifts out the window. I cry and scream for it to call me. I order a pizza and spend the rest of the day in bed.\n Here’s what you’re going to do. You’re not going to ask too many questions. You’re just going to let it happen. You’ll never know whose eyes are behind the blank no-eyes that see everything. There might not be any anymore; drones regularly display what we perceive as autonomy. In all our concepts of droneness there is hardly ever a human being on the other end. So there’s really no one to direct the questions to.\n Anyway, what the hell would you ask? What are we doing, why are we this way? Since when have those ever been answers you could get about this kind of thing?\n This is really sort of a problem. In that I’m focusing too much on a serial number and a specific heat signature that only my skin can know. In that I asked the thing to call me at all. I knew people tried things like this but it never occurred to me that it might happen without trying.\n It does call me. I talk for a while. I say things I’ve never told anyone else. It’s hard to hang up. That night while I’m trying to sleep I stare up at the ceiling and the dark space between me and it feels so empty.\n I pass them out on the street, humming through the air. They avoid me with characteristic deftness but after a while it occurs to me that I’m steering myself into them, hoping to make contact. They all look the same but I know they aren’t the same at all. I’m looking for that heat signature. I want to turn them over so I can find that serial number, nestled in between the twin missiles, over the drone dick that I’ve never actually seen.\n Everyone around me might be a normal person who doesn’t fuck a drone and doesn’t want to and doesn’t talk to them on the phone and usually doesn’t take them to dinner. Or every one of them could be like that.\n At some point we all stopped talking to each other.\n Here’s what you’re going to do. Here’s what you’re not going to do. Here’s a list to make it easy for you.\n You’re not going to spend the evening staring out the window. You’re not going to toy endlessly with your phone. You’re not going to masturbate furiously and not be able to come. You’re not going to throw the things you threw at nothing at all. You’re not going to stay up all night looking at images and video that you can only find on a few niche paysites. You’re not going to wonder if you need to go back into therapy because you don’t need therapy. You’re not going to wonder if maybe you and people like you might be the most natural people in the entire world, given the way the world is now. You’re not going to wonder if there was ever such a thing as natural.\n Sometimes I wonder what it might be like to be a drone. This feels like a kind of blasphemy, and also pointless, but I do it anyway. So simple, so connected. So in tune. Needed instead of the one doing the needing. Possessing all the power. Subtly running more and more things until I run everything. The subjects of total organic surrender.\n Bored, maybe, with all that everything. Playing some games.\n It comes over. We fuck again and it’s amazing. I’m almost crying by the end. It nestles against me and hums softer and I wonder how screwed I actually am in how many different ways.\n Anyway, it stays the night again and we don’t fight in the morning.\n A drone wedding. I want to punch myself in the mouth twenty or thirty times for even thinking that even for a second.\n It starts coming every night. This is something I know I shouldn’t get used to but I know that I am. As I talk to it—before sex, during, after—I start to remember things that I’d totally forgotten. Things from my early childhood, things from high school that I didn’t want to remember. I tell with tears running down my face and at the end of it I feel cleaned out and raw.\n I don’t want this to be over, I say. I have no idea what the drone wants and it doesn’t tell me, but I want to believe that the fact that it keeps coming back means something.\n I read the message boards and I wish I could tell someone else about this because I feel like I’m losing every shred of perspective. I want to talk about how maybe we’ve been coming at this from all the wrong angles. Maybe we should all start coming out. Maybe we should form political action groups and start demanding recognition and rights. I know these would all be met with utterly blank-screen silence but I want to say them anyway. I write a bunch of things that I never actually post, but I don’t delete them either.\n We’re all like this. I’m absolutely sure that we’re all like this and no one is talking about it but in all of our closets is a thing hovering, humming, sleek and black and chrome with its missiles aimed at nothing.\n We have one more huge fight. Later I recognize this as a kind of self-defense. I’m screaming and beating at it with my fists, something about commitment that I’m not even sure that I believe, and it’s just taking it, except for the moments when it butts me in the head to push me back. I’m shrieking about its missiles, demanding that it go ahead and vaporize my entire fucking apartment, put me out of my misery, because I can’t take this anymore because I don’t know what to do. We have angry sex and it leaves. It doesn’t call me again. I stay in bed for two days and call a therapist.\n Here’s what you’re going to do.\n You’re going to do what you told yourself you had the courage to do and say everything. You’re going to let it all out to someone flesh and blood and you’re going to hear what they say back to you. For once you’re not going to be the one doing all the talking. You’re going to be honest. You’re going to be the one to start the whole wheel spinning back in the other direction. You’re going to fix everything because you have the power to fix everything. You’re going to give this all a name and say it like you’re proud. You’re going to bust open a whole new paradigm. You’re going to be missile-proof and bold and amazing and you’re not going to depend on the penetrative orgasmic power of something that never loved you anyway.\n I stop at the door. I don’t even make it into the waiting room.\n I fiddle with the buttons on my coat. I check my phone for texts, voicemail. I look down the street at all those beautiful humming flying things. I feel a tug in the core of me where everything melts down into a hot lump and spins like a dynamo. I feel like I can’t deny everything. I feel like I don’t want to. I feel that the flesh is treacherous and doomed.\n I made this promise to myself and it takes me half an hour on a bus and five minutes of staring at a name plaque and a glass door to realize that I don’t want to keep it.\n I look back out at everyone and I consider what it could be like to step through those doors, sit in a softly lit room with tissues and a lot of pastel and unthreatening paintings on the wall and spill it all and look up and see the therapist nodding, nodding knowingly, mouthing the words me too.\n I don’t really think anyone can help any of us.\n Here’s what you’re going to do. You’re going to stop worrying. You’re going to stop asking questions. You’re going to stop planning for tomorrow. You’re going to go out and get laid and stop wondering what might have been. You’re going to stop trying to fix anything. You’re going to stop assuming there’s anything to be fixed.\n You’re going to look out at all those drones and not wonder. You’re going to look out at all those people and you’re going to know. Even though no one is talking.\n Me too. Me too. Me too.\n Sunny Moraine's short fiction has appeared in Tor.com, Strange Horizons, Nightmare, Lightspeed, and multiple Year's Best anthologies, among other places. They are also responsible for the Root Code and Casting the Bones trilogies and their debut short fiction collection Singing With All My Skin and Bone is available from Undertow Publications. In addition to time spent authoring, Sunny is a doctoral candidate in sociology and a sometime college instructor. They unfortunately live just outside Washington, DC, in a creepy house with two cats and a very long-suffering husband."}