{"fingerprint": "I6c9KxXiRO44AQ3lUtI85rnZP/8=", "sitename": "Clarkesworld Magazine", "title": "In the Blind by Sunny Moraine", "author": "Sunny Moraine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/moraine_08_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In the Blind by Sunny Moraine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5390 words, short story\nIn the Blind\nSpace is an eye that never sees, an ear that never hears, a mouth that never speaks.\nHer third sleep period in orbit, Nic woke up to the phrase rattling around in her brain, whispering into the spaces between and within and around her skull. Flitting like a moth and always fluttering out of the reach of her vision and hands whenever she tried to catch it with either.\nWords. They blurred and weaved around each other. She floated there in her warm, soft cocoon and let them flow through her and didn’t try to make sense of them. No obvious reason to try, nothing to be gained; it was some dream-bullshit, creepy as hell but plenty of things were.\nTwo weeks later and the words won’t leave her alone, asleep or waking, and now, as the last of the lights flicker and die, they return, circle those dying lights, throw themselves against her. They demand her attention. They demand to be made sense of.\nTruth is, they’re the only thing that makes sense anymore.\n“Nothing?”\nNic doesn’t look toward the hatch. Doesn’t look away from the comm unit at all. Like it might do something if she stares at it long enough. Like that’s a thing she actually believes. Like it’s a thing she ever fucking could.\nThough, Christ, it might be nice to be able to do so.\n“Said I’d wake you if there was anything, Marlie.” She pinches the bridge of her nose. It’s so dry up here and she’s getting headaches more and more frequently these days. “Did I wake you?”\n“You don’t have to be an asshole about it.” Marlie’s tone is vaguely stung—prelude to sulky. She doesn’t do that much, but shit, when she does she really commits.\nNic stares past the pink blur of her own knuckles at the comm unit. It’s so new. It’s the size of an old laptop and set neatly into the side of the module, console so smooth and clean and shiny, like they got so freaked out by the aesthetics of the older generations of space travel—all dials and buttons and knobs and flashing indicator lights—that they went all the way to the other extreme and created something so pristine that, but for the screen set into its surface, it defies any visually obvious purpose.\nIt’s blank. It’s blank in every way that matters.\nWould be way too easy to call it the eye in this situation. Blind eye, screen not black but a milky blue-gray the color of a cataract. No, it’s not the eye.\nThe eye she’s staring at is staring right the fuck back at her. Beyond and just to the left of the unit: softly rounded transparent dome broken into separate frames, single large circle in the center and smaller curving-rectangle panes surrounding it. Pale as bone, framing black. Whatever tiny pinpoints of brightness ever pierce it might as well not even be there.\nNo one is talking to them anymore.\nMarlie floats in place for a moment or two, head down, mouth tight. Finally: “I’m gonna run through another diagnostic series.”\nNic shrugs. It feels mechanical, the connection between her brain and her muscles not quite right. “You do whatever the fuck you want.”\nWon’t hurt anything. Won’t help. It’s not the unit. It’s not anything inside or attached to the module. Marlie’s not stupid; she knows this. But Nic gets it.\nCan’t just do nothing. Or you technically can, but.\nMarlie is gone. Nic doesn’t look away from the window. Only when her eyes begin to burn and sting does she realize that she hasn’t been blinking.\nIf what they say about an abyss is true, it’s beyond stupid to get into a staring contest with one.\nAnd yet.\nBack when there were still four of them up here, three had calls from home every weekend and Nic never did.\nExceptional, Nic always has to be.\nMarlie has a long-time girlfriend. Common courtesy sent everyone else away when someone was watching theirs, but more than once Nic caught a glimpse of Marlie during one of Anna’s throaty messages, saw her face, felt a twinge of something between fascinated curiosity and equally fascinated envy, resented herself for feeling both of those things. Not Nic’s fault, the endless series of cold foster homes, the friends who she never got very attached to because they never seemed to last, one-night stands that she actively kept from becoming anything more. None of it her fault.\nOnly made it worse, feeling that way.\nTy and David—husband and a baby daughter, wife and two teenage boys respectively. Very domestic. Smiling spouses, smiling kids. Occasional wistfulness but never any real angst.\nSeemed so simple.\nFloating in her cocoon and trying to sleep and failing, imagining what it was like to know that at regular intervals, someone was calling across all that distance just for you, crying your name at the sky.\nShe knows that, when they looked at the window, they never saw what she sees.\nWhich is distance unutterably vast. Uncrossable. Impenetrable. Blind and deaf and mute.\nAnother few hours and, because there’s nothing else to do except listen to nothing, Nic pulls up the last communication. The final stream of images and sound. The thing that grabbed Ty and David and drew them back down, drew them home with promises to send word, to explain what they had seen and hadn’t seen, and to return.\nDid she believe them even then? She doesn’t know.\nThe conversation itself is brief. There’s very little information. There’s a talking head—not the woman they were used to dealing with, and that should have been the biggest warning sign. The next one should have been the calm in his voice, an utterly determined steadiness like a smooth paving stone laid over uneven ground. Those kinds of stones rock from side to side when you step on them. They aren’t steady at all in the end. But he didn’t get stepped on. He cruised ahead and only afterward did they start to take it in, get what it might mean.\nBe advised: they had a situation. It was concerning. They were working to determine its nature.\nEarth’s vagabond children falling endlessly in high orbit should stand by.\nAnd that was all she wrote. Spoke. Whatever.\nAbout an hour before that, all their access to the net had abruptly cut off. That was irritating but not necessarily unusual. They were going to ask about it when they got a free second, but then all the seconds were gone. Evaporated. Vapor shimmering in the vacuum.\nNic watches that calm talking head. Cool voice. Cool pale face, like that polished stone. And now that she watches this for the umpteenth time, Nic understands that he was probably chosen for that precise quality of polish, of impassivity. No sense in panicking people who can’t do anything. And they probably did believe it would be okay.\nPeople always do.\nNic cuts the screen off and lowers her face into her hands.\n“I keep thinking maybe we should’ve gone down there with them.”\nMarlie’s turn to stare at the comm panel. Not in front of it the way Nic has been but instead merely near it, a few feet away, arms crossed. Hugging herself. It’s a somewhat awkward position in zero-g but she seems determined to maintain it anyway.\nNic looks at her. Looks away. She would very much like to be somewhere else, doing something else, but she’s never taken well to busywork, and even if there’s more in the way of necessary tasks to go around with a crew of two . . .\nChrist, it all feels so fucking pointless.\n“Why?”\nStupid question. She deserves the look Marlie shoots at her. “Because then we’d know. It’s killing me, not knowing. Nothing to do except sit up here.” Glare. “How the hell are you so calm?”\nThis is not calm. Nic shrugs. “Like you said. There’s nothing to do up here. Nothing to do but wait.”\n“For how long?” Marlie’s voice is soft—and this is what neither of them has been willing to ask aloud. How long do we wait? How long before we start drawing some truly awful conclusions? How long is it appropriate to believe they’re working to determine its nature?\nWhat is it?\nNic doesn’t answer. There is no answer. She’s been turning the question over and over in her mind, approaching it from every angle she can think of, and she’s got nothing.\nShe stares down at her own hands. She’s a habitual nail-biter and those nails are stripped down to the quick, here and there red raw skin and spots of blood.\nMarlie gazes at her for a while longer, until Nic can’t take it anymore and moves to another module, sucks a packet of tomato juice.\nSweet and vaguely metallic. It tastes like her blood.\nNic used to dream about ships lost at sea.\nAlways the same. Night—of course her mind would always set these things at night. A vast inky sky, no trace of stars. Still water. She learned in high school what it meant to be becalmed—abandoned by the wind. By the air. She thought about fish who die when they stop moving. The purpose of a ship is to move. What’s a ship when it can’t do that anymore? Sailors existing on and in a null space devoid of any coherent definition, slowly losing their own purpose, which is to be alive.\nBut before that, the inky night is silent. If they speak, it’s only to each other. If they hear a voice, it’s only one from their fellows. Nothing from land. Nothing from other ships. No radio, no satellites. No net. In the still night, on the still water, the world itself might end for all they know. If they make it out alive, with their purpose intact, they might return home to find that home is no longer there. They can scream for help all they want; no one is going to hear them.\nAll around them, an abyss of water and sky.\nIn her dreams she drifted through that night, between the water and the sky. The ships were full of ghosts. She came awake lost in the stillness, and even if it was a nightmare, it was quiet as it settled into her bones. She never screamed. She never made a sound at all.\nWhen she arrived on the station, the dreams stopped. They’ve never come back.\nNow she suspects that it’s because her brain feels no need to bother with them. Not when she’s so close to the real thing.\n“It’s all dark down there.”\nNic looks up from the open access panel, screwdriver poised. What she’s doing with it . . . Who the fuck even knows. She did know, when she decided to do it, but over the course of the last twenty-four hours, it’s been getting progressively easier to let things slip from her mind. That old much-clichéd image of sand through someone’s fingers; it works better than just about anything else for analogizing this feeling. Helplessness. Pointlessness. Why would someone want to hold onto sand in the first place?\nMarlie by one of the nearer windows, holding herself in place by the grab-bar overhead. Staring out. It’s a small collection of modules but there’s enough space for two people to give each other some room if they cared to make the effort. It would be nice if she would, but throughout those porous twenty-four hours, Marlie has been finding reasons to be close.\nNic is battling resentment. Wondering more and more if there’s a point to that either.\n“The hell’re you talking about?”\nMarlie doesn’t look up, gestures with her chin at the window. “Night side. Can’t see any of the lights. The big population centers. It’s all off.” She does glance up then, and her eyes are flat. “You’ve noticed.”\nNot a question.\nNic shrugs. “I guess. Maybe.” She had to have done so. How could she miss it?\nWhen did it happen?\n“They turned out the lights,” Marlie says softly. “Just cut ‘em off. Straight up. Flipped a damn switch.”\nIt’s dimly troubling to hear Marlie talking like that. Nic lowers the screwdriver and tips her head against the cool smoothness above the open panel.\n“My girl was into conspiracy theories,” Marlie continues, just as soft. “You believe that? Never could talk her out of the ones she loved. And she was so rational otherwise. Had her head on so straight. But she believed the government was hiding alien bodies in the desert, and she believed the world was run by this cabal of secret government agencies, and she also believed that there was this big central switch for everything. Power grid, telecom, the net, everything. Some They could cut it off at a moment’s notice. On a whim.”\nNic blinks at her. This is the most she’s heard Marlie say at one stretch in a long time. Feels like years, though she’s only known Marlie for two.\n“I’m thinking maybe she was right,” Marlie whispers. “Seems like it happened so fast. How else do you explain it?”\n“It’s fuckin’ stupid.”\nImmediately she’s sorry. She intended bluntness to the extent that she didn’t give a shit whether or not she was blunt, but she knows this is likely to hurt, and she doesn’t want that.\nShe might get to that point. But not yet.\nHowever, Marlie doesn’t appear upset. Doesn’t appear fazed at all. Just keeps on staring down at that lightless spinning ball. Soon they’ll probably come up on sunrise.\n“Yeah. It’s stupid.” She smiles faintly, tucks loose strands of her dark hair behind her ears. “Thing is, I think she knew that. That was her faith. She needed to believe there was a plan. It’s comforting if someone out there is in control of everything, y’know? Even if they’re evil as shit.” Laugh. Nic’s flesh is trying to crawl off her bones. “She was aware. She was too smart not to be.”\n“People been believing in shitty gods for a long damn time.”\nMarlie nods. “Throwing virgins into volcanoes. Better that than thinking we’re all alone, right?”\n“We are alone.”\nSlim, lovely curve of the globe, suddenly gilded. There was no light; now the light is everywhere, surging over the world. Cloud shadows thrown across the face of the water, delicate pinks and blues and golds. It’s all so gentle. It’s all so fragile.\nIt looks so empty.\n“Yeah,” Marlie says, and pushes toward the corridor. She doesn’t look back. “Yeah. We are.”\nA week and a half before launch, Nic went to a fortune teller.\nKitschy racist carnival bullshit. She was at the carnival anyway, drank too much cheap piss-water beer and snuck a little unobtrusive weed she knew she could conceal in a test, and instead of stumbling out the gates to call a car, she stumbled into that damn tent and plopped herself down at the table and forked over a couple of rumpled bills.\nFake velvety drapes everywhere all red and purple, clicking with plastic beads. Carpets and dollar store cushions. Hunched woman mostly obscured by shadow thick with incense. She could have been any age; Nic caught a glimpse of an unsettling amount of makeup and not much more. Raspy voice, gritty with fry. Something oddly pleasant about it. She watched slender hands sporting jeweled acrylic nails waving over the crystal ball, listened to the lines about concentration and focusing on the future and opening herself to the spirits. What the hell, she was game. Not like it was going to do her any harm, and the woman already had her money.\nSo she concentrated. Focused. Opened.\nAnd the woman was silent.\nDead silent. Dead fucking silent, for a long time. Nic was floating on a haze of mingling chemicals, musing, and it took her a while to realize it, and by then she was also realizing how weird it was. The woman sitting there across from her, hands flat on the table, staring at her. Not blank. Not in some kind of trance. Just as focused as Nic was allegedly supposed to be. Silent and staring, her eyes gleaming on and off as she blinked.\nAt some point it got way too creepy, so Nic did what she should have done all along, got the hell out of there and got her ass into a car and made her way home to sleep it off. Cursed herself for an idiot the next miserable morning.\nAll night, the carnival lights strung overhead, winking on and off. In her head, winking off one by one, flickering out like the fortune teller’s eyes, silent after the final message. The last thing the woman said, before she said nothing at all.\nWhich she doesn’t remember. It was some shit about spirits. Told her nothing in the end.\nIt wasn’t important.\nMarlie spends a couple of hours crying, silently. Steadily. Nic does what she can to avoid her, but somehow it doesn’t work; in every capsule, there she is. In some corner or against some wall, hugging herself again, not looking at Nic, and crying. It’s infuriating; Nic wants to seize her by the shoulders and shake her. Scream in her face. It’s not doing anything. It’s not doing any good, so cut it the fuck out. She fights it back.\nThat wouldn’t do anything either.\nIf nothing else, she should scream at Marlie for wasting moisture. But even that much is pointless, regardless of whether or not it would work. Oddly, despite her flat cool confrontation of this, she hasn’t allowed herself to think through those particular ramifications.\nMarlie cries. Nic makes a determined effort to ignore her. Below them the world spins on, cradled by the darkness.\nFinally Marlie looks up. Wipes her eyes and sniffles. “I’m never gonna see her again. Am I.”\nNot a question. Nic shrugs, deeply noncommittal.\n“I was supposed to be with her in two weeks. Remember? I was due to head back with Ty. I was gonna be there in time for her birthday.” She wipes her nose and gives Nic a watery smile. “Our anniversary is three days after that. We were gonna make it one big party.”\nNic says nothing. Why the fuck are you telling me this? But that’s another stupid question. Marlie is telling her because there’s no one else to tell. No comms. No net.\nOnly the black.\n“And now I’m never gonna see her again. We’re never gonna have another anniversary.” Marlie swipes angrily at her nose. “Shit, she’s probably dead.”\nProbably. Nic looks away.\n“Why haven’t you said anything?” Still angry. Angrier, and the anger is both directed at Nic and not directed at Nic. Resentful but in a way someone is resentful when they’re merely looking for a target. “Don’t you have anyone down there?”\nHonesty. “No.” She pauses, and the cruelty rears up in her and she can’t stop it. The darkness out that window, the silent void, and she can’t help it. It’s the only fire she can reach. “I’m glad about that.”\nMarlie stares at her for a long, long moment, eyes wide in the periphery of Nic’s vision. At last she shakes her head.\n“I feel sorry for you, Nicole. I mean that. I really do.”\n“Not as sorry as I feel for you.” In her ears, her tone is dull. Lifeless. She’s clearly lying; she doesn’t feel much of anything. “Why don’t you go cry some more.”\nShe drifts out of the module and doesn’t look back.\nAll those stories about being the last two people alive, the last two in the whole world. Always seem massively improbable; what are the odds the human population would whittle itself down to a count of two before vanishing entirely? Not impossible by any means, but for Nic it never rang true. It was a plot device; nothing more.\nRepopulating the Earth. Also would never work, not with two. Nowhere near enough genetic diversity. Survival really would be impossible, long-term.\nWhen the species is snuffed out, there will be many, than a few, then none. Not a cycle back around to an apocalyptic Adam and Eve and then final ultimate extinction.\nThat’s what she told herself before and that’s what she tells herself now, watching that Pale Blue Dot spin through the darkness whenever she closes her eyes. No contact with the surface means that they have no confirmation in any direction. All they know is that no one is answering, which could mean any number of things. It definitely doesn’t have to mean that everyone down there is dead.\nThey have no reason to assume that.\nDon’t you have anyone down there?\nFive hours later, something in her breaks, and she practically hurls herself into the comm chamber and lays her hands on the console, her breath rushing in and out of her lungs like a tide pulled by a moon whose orbit has gone mad. Her vision is fuzzy at the edges, as if she’s not getting enough oxygen.\nPossibly she’s not.\nShe has no one. She left no one behind. Unattached, untethered, she’s been floating. Now she considers the death of literally everyone else—almost everyone—and it’s eating her insides, acid lurking in her belly for such a long time and abruptly activated. She doesn’t give a fuck.\nThat’s very wrong.\nShe watched them all watching those communications from home, those messages in their electronic bottles making the crossing in seconds. But she never watched the vids. There was no reason to, and it wasn’t her business, and the thought of doing so made her jaw and her gut clench. But now she’s calling them up, her fingers flying over the keypad. They all have their own data folders but none of the folders are password protected; there’s no real need, and everyone respected everyone else’s privacy. Everyone trusted each other.\nThey did.\nPlay.\nTy’s husband, smiling widely, holding a little girl of no more than two on his lap. Dark braids twisted up with little multicolored hair-ties, huge and eerily knowing dark eyes. She sucks thoughtfully on her thumb and reaches toward the screen, pops her thumb out of her mouth, and laughs.\nPlay.\nDavid’s wife, pretty young redhead leaning forward toward the camera. Low-cut blouse. Two blond boys standing just behind her, waving. Toothy grins. One of them is holding a cat. Small cat; probably not much more than a kitten. He makes the cat wave and the cat squints with profound resentment. The woman rolls her eyes.\nPlay.\nMiddle-aged woman with silver hair—dyed or natural, it’s impossible to say. She has her hand over her mouth and she’s crying. She doesn’t look precisely sad, or angry, or worried. She looks like she might be feeling all three at the same time and in equal amounts. She shakes her head—negation. Denial. No can accommodate a universe of meaning, and none of it matters anymore.\nFor all of them, this was their last message.\nAll silent. No speech in any of them. Nic doesn’t know whether it’s something about how the vids saved or something wrong with the speakers, and she doesn’t care. It’s bad enough to watch them all and feel something indefinable and wretched slamming into her over and over. No, she has none of this. She has no last message. Only the one from Mission Control telling them about the concerning situation, telling them to stand by and wait for further communication.\nSo certain that further communication would be forthcoming.\nNic cuts off the comm and remains where she is. After a few seconds she lowers her face into her hands.\nThat’s when Marlie hits her in the head with a wrench.\nNic has always assumed that when she died, she would die alone.\nThat’s because as far as Nic is concerned, everyone dies alone. As far as Nic is concerned, to die is to be alone. And then to not be at all.\nLike a country from which you’ve been banished, the verb is simply no longer available to you.\nNot even pain, not at first. Merely an explosion of pure white spider-crackling at the edges as it envelopes her, thinking of webs and lightning snaking toward the ground and the branches pathways of nerves. Veins, full of light. It’s beautiful, and she expects to stagger, and of course she doesn’t because she’s standing on nothing. Instead she reels as the force of the impact knocks her backward, and the crown of her head collides with a protruding section of bulkhead and the light explodes again. A secondary blast. Shockwave. Still no pain; only a sense of all-permeating heaviness, as if someone has stuck a hose in her ear and filled her skull with lead.\nShe’s confused.\nSomeone is screaming.\nNic doesn’t know who. Can’t determine it from the information she’s getting. Can’t see much and her hearing amounts to a muffled drone as though she’s sinking into water the full depth of which she hasn’t yet discovered. She keeps going down and down.\nNot her screaming. Too angry. The kind of angry that comes to blows. The blurred watercolor image of Marlie’s face, features twisted with rage, every inch of her skin a furious red, her teeth bared. Feral. A sense of the danger a wounded animal presents. Pain is a prerequisite for hatred; anyone who has ever felt hatred understands this.\nLoneliness is a prerequisite for both.\nA darker gray blur smeared across her field of vision, bizarrely slow; the wrench again, and Nic is bringing her arm up in a useless bid to defend herself at the same time as she makes fumbling use of the bulkhead to push herself down and away, executing a clumsy dodge under Marlie’s left arm. Her eyes are clearing and she’s also finally starting to feel the pain, and it’s fucking massive, starting as a tsunami and swelling to a full-on tidal wave plunging down on her and carving away great gouges of her shoreline. But she’s dimly aware that all she can afford to pay attention to is what she can see, what little she can hear, and out of the corner of her still-foggy eye she sees Marlie catching herself on a grab-bar, doing the best approximation of a spin as she can, brandishing the wrench and snarling.\nYelling, her throat raw and every word pulsing blood from her nose into the top of her head: What did I do, Marlie? What the fuck did I DO?\nGood Christ, that’s such a stupid question.\nNot that she was watching the vids. Not even that she’s been progressively bitchier and bitchier as all this silent time has slipped past them. It’s simply that she’s here at all.\nLast two people on Earth. Off it. It was never going to work very well.\nTogether, alone.\nMarlie smashes the wrench into another bulkhead as Nic ducks, pushes off with her feet and dives toward the comm. Marlie is chasing, swinging at her. As she approaches the console, Nic realizes that she never turned off the vid and that it never cut itself off either; that woman’s face is still on the screen, her tears, her unbearably sad eyes, her hands—once shaking, now locked into the perfect stillness of freeze-frame. Except those eyes are following the long-standing rules of countless portraits hanging on countless walls: the eyes are moving, following this hideously absurd scene, falling on the two of them no matter where they are.\nNot evaluating. Not picking a winner or a loser. This woman has already made up her mind.\n“Bitch,” Marlie grates, breaks open a cupboard and sends little plastic packets containing spare parts cascading outward. Nice bats them away. “You fucking bitch, you—”\nThe viciousness pumped into her own words has her momentarily distracted, and Nic doesn’t wait; she lunges—much as she can—and seizes the wrench with both hands, Marlie’s fist sandwiched between hers, giving it yank after sharp yank. With a shriek of surprised anger, Marlie holds on, and all Nic succeeds in doing is pulling them close, so close, the heat of Marlie’s body and breath enveloping her. Breathing her in. Fierce life. Defiance. She’s burning from the marrow outward and all at once Nic can do nothing but gaze into those blazing eyes, her own anger and her fear overwhelmed by bizarre awe.\nMarlie might be insane, or she might be the strongest person Nic has ever known, or it’s also possible that there’s no meaningful distinction to be made there, and Nic reaches into herself, scoops out all the exhausted poison and flings it into the maw of the blackness. Leans in across the last few inches and tips her head against Marlie’s shoulder. She’s still holding the wrench, but only holding on. Not fighting.\nAnd Marlie stops.\n“What were you gonna do?” Nic doesn’t lift her head. Her eyes are closed. This feels good. “When I was gone. What the fuck were you gonna do then?”\nMarlie hiccups. Doesn’t answer. Nic can’t see her face.\nBut her free arm is rising—circling around Nic’s back. It’s too clumsy and too rough to be an embrace, but it’s not completely unlike one. She sniffles, releases a sound that might be the shambling remains of a laugh.\n“Fuck you.”\n“Yeah.”\nSilence. Finally Nic does lift her head. They’re turning in place, a lazy spin, and the window framing a fragmented Earth is coming into her view. Night side. Completely dark. Maybe, Nic thinks dimly, if someone is down there, they still have fires. Oil to burn as lamps. Batteries to give them access to a faint glow. It’s not impossible.\nBut it’s also not the case.\n“How long you think we can keep going up here?”\nGood. She can face the question now, grapple. “A few weeks? Little over a month, if we ration?”\nMarlie nods. Pauses. Then: “Is there a point?”\n“To what?”\n“Rationing.”\n“I guess there isn’t.”\nAnother nod. They spin like two worlds orbiting in close tidal lock, and gradually Nic releases the wrench. As she does, Marlie pushes her back and hefts it, and Nic watches her with weary apprehension, part of her cycling up for another round.\nBut Marlie moves past her, toward the comm console. She stops in front of it for a second or two, gazing down at it with only the edge of her cheekbone visible, edged by the light like a crescent moon. Then, before Nic can say or do anything to stop her, she whips the wrench up and back and brings it down with what’s clearly all her strength on the smooth white face.\nOver and over. Nic looks away, wincing. It’s like watching a person getting their skull caved in.\nBecause there’s the face of that woman on the screen, and while she doesn’t take the first blow, she takes the second, third, fourth, run through with cracks and then shattered, glittering fragments scattered into the air like stardust. No more sad face. No more weeping eyes. Whatever she had been in the middle of saying, trying to say—gone now.\nMarlie continues for a while, before Nic at last reaches for her and catches her wrist in a gentle grip, and then she slows. Stops. She’s panting. Not crying, though near to it. Near enough.\nShe tosses the wrench away. It hits a panel across the room and wanders, aimless.\nBeyond the broken panes of the window, the sun is beginning to rise.\nNic has always assumed that when she died, she would die alone. And that might yet be true. When she dies, no matter who is or isn’t present with her, the tumble she takes into the darkness will be completely solitary, a final solo dive. A future into which someone might peer and find nothing to say.\nBut before that, there’s something else. This concerning situation and the nature she’s determined.\nWatching that sunrise, a hand clutched in hers and the hot tidal rush of breath in her ear, it comes to her that she’s the least alone she’s ever been. So maybe that’s purpose enough.\nSpace is an eye that never sees, an ear that never hears, a mouth that never speaks.\nThat was always true.\nSunny Moraine's short fiction has appeared in Tor.com, Strange Horizons, Nightmare, Lightspeed, and multiple Year's Best anthologies, among other places. They are also responsible for the Root Code and Casting the Bones trilogies and their debut short fiction collection Singing With All My Skin and Bone is available from Undertow Publications. In addition to time spent authoring, Sunny is a doctoral candidate in sociology and a sometime college instructor. They unfortunately live just outside Washington, DC, in a creepy house with two cats and a very long-suffering husband."}