{"fingerprint": "5kV6AFlcT0nu0sOrjGfFr1QaziQ=", "sitename": "Clarkesworld Magazine", "title": "Iron Ladies, Iron Tigers by Sunny Moraine", "author": "Sunny Moraine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/moraine_07_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Iron Ladies, Iron Tigers by Sunny Moraine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4830 words, short story\n Iron Ladies, Iron Tigers\n Ping.\n Vita. Wake up.\n Spinning through the dark, I hear and feel CERA’s alert both at once, a sound that is a vibration like a plucked string between my sealed eyes. I shift in the padded transit cocoon. I move hands that barely feel like mine, and I feel wires pulling the jacks in my skin at the same instant as my fingers hit the tape over my eyelids. I wedge my nails under the strips and they come away like old skin. My tongue feels like a dry slug trapped between my teeth and my soft palate. But all of this is distant. I’m in high orbit over myself, and I can choose where I want to place my attention.\n I chase the plucking string to its source.\n All at once I learn a number of things, data nestled at the point where I and CERA intersect, waiting for me to retrieve it. I flip through it like a printed report; it helps to imagine these things in physical terms. This is how I was trained and in moments of partial consciousness it’s best to fall back on what you know at the most basic level. And here are the new things I know: as far as CERA can determine, re-emergence into normal space has occurred. There are a number of equipment malfunctions. Most of the sensor array appears to be offline. The primary Q-drives are offline. The differential sail is online and can be deployed if needed. Life support is online.\n I am alive. I already knew this, but it’s nice to have it confirmed.\n Chronometrics are offline.\n Shit.\n Extensive systems failure was a distinct possibility; we knew this as well, and I was told it repeatedly in the weeks leading up to the launch, as if it might make a difference. It makes no difference now in the most complete possible sense, but I punch a weak fist into the padding of the cocoon.\n CERA’s plucked string voice in the center of my head—she’s waiting on my command. She’s a smart AI but even so she operates at about the intelligence of the average Labrador. She can think. But in situations featuring high degrees of uncertainty she needs instructions.\n Do we have visual?\n She shivers an affirmative into me. I feel something approaching relief; I’m flying blind in every meaningful way but one, then. My craft can’t tell me exactly where or when I am, the composition of the space around me, the relative location of any neighboring bodies, or whether I’ve gone anywhere else at all. But I can see.\n At my command CERA engages my optical feed. But my body jerks in protest, though the cocoon swallows the movement. This isn’t right. I can feel myself blinking, lifting my hands to my eyes again—the frantic movements of the abruptly blind. Because all of my vision is blackness.\n Here’s a dream that’s also a memory: Kendra and I are in our closet of a kitchen in the slightly larger closet of the apartment that we shared for those last three years, and I’m excited about work, about the breakthrough we’ve just had, about possibilities. I’m pacing in what room there is to pace. Kendra is sitting on the counter and her legs are swinging like a child’s. She’s eating an orange. I remember—and I dream, God, over and over—that at the height of my excitement, the part about the possible applications of the technology, I braced my hands on either side of her hips and kissed her and the taste of her and that orange filled my mouth and both were a kind of sweet alchemical perfection. I remember that the lights were off and the sun was westering through the window. I remember that her hair flashed a deep gold in the corner of my vision as I slid a hand into it.\n I remember these things with a clarity that doesn’t apply to anything I said aloud to her. At the time, I thought that the things I was saying were the most important part of that moment.\n I know better now. But my mind loves to remind me.\n CERA is telling me that the visual feed is fine. I shove her back into another round of diagnostics. I have no idea if an AI at her level can feel—though after a year in training with her and a third of a second in nearly constant uplink you’d think I’d know her well enough to tell—but I could swear that she’s getting tense.\n I understand that the system could have broken down in such a way that CERA can’t see the damage even when she runs the full set of diagnostics. I know that this is possible. But knowing it is useless. We have no plan for that scenario.\n CERA, if the visual is working then why can’t I see stars?\n I don’t know, Vita, CERA pings me, and of course it is. Without any of the rest of the sensory array, how could she even begin to collect herself into an answer?\n Speculate?\n It’s a half-literal stab in the dark. I don’t even know if CERA can speculate that way. I drift in the cocoon, in warm darkness, and I listen to the silence of her thinking. I know it’s wild anachronism, but I imagine immense gears turning in blackness, grinding through numbers like meat.\n It’s possible that the craft has emerged into normal space-time far beyond the edge of any local galactic groups or clusters.\n I’m not sure. I am just as much in the dark as you.\n I have to take a breath and hold it, listening to my pulse pounding between my ears—and I’m trying to ignore that last, that part of her voice that twists away from chilly digital delivery and into something a whole hell of a lot familiar. All that time we spent together, I didn’t mean for that to happen.\n Too late now. And I have bigger problems. Because what she’s saying . . . It would be beyond miscalculation. It would be disaster. Which I planned for before I climbed into my soft cocoon world, but it’s never quite the same as being faced with the fact of it—you think you can teach yourself to expect the worst, to train your mind to bend around and against it like a reed.\n But there are some things you can’t plan for.\n How remote is the possibility?\n CERA tells me. I swallow the number down and it burns. I know: it doesn’t matter how remote the possibility is if it’s actually what’s happened. I float and I try to think. I turned off the visuals but now I cut them back in again and stare at the darkness.\n Nothing. Not even the faintest specks of light. If the rest of the sensory array was online I would have ultraviolet, infrared. But I don’t. All I have is what’s in front of me. I just need to be sure of what that is.\n CERA, I say. Give me full interface.\n I can feel it, a widening of everything. The visuals are still engaged as I dive into her, spreading myself into her channels and pathways, hunting for a sign.\n Here is another dream that’s also a memory. I have this one less frequently, but it does come. I wonder sometimes if my brain makes greater sport of the ones that hurt or the ones that feel wonderful until I wake up and the rest of my memory asserts itself. Does it hurt more to live in the parts of the past that were genuinely good? I still don’t know.\n But in this dream Kendra and I are fighting. It was a very bad week. Now we have arrived at its apex, the black spike of it, and it’s about to drive itself into both of our spines and cripple us.\n You can’t ask me to choose, I’m saying. I’m close to yelling. We are standing in a half-lit living room, the TV on mute and nothing but a colored blur. We’re both so tired and that only makes it worse. That’s bullshit, Kendra. We made a deal when we got here. You can’t ask me to choose now.\n Things change, she says. Her arms are crossed and all of her feels small and cold like a body in space: distant, receding. In this moment I begin to understand that she is already leaving me. That she has already left. Why can’t we change with them? I’m not asking for anything unreasonable.\n This is the part where I let out a cough of laughter. It’s calculated to convey just the right amount of scornful incredulity. I recall that I was proud of it at the time. I’m sorry, have you completely missed everything I’ve been doing for the last four months? Did you check out when I was explaining it? Or did you just not get it?\n She’s smaller, colder. Goodbye, Kendra. Goodbye. I’m not stupid, she says. In this memory—and how close it is to the truth, I can never be sure—she is literally backing toward the door. And yes, I missed it. You weren’t here. I missed you.\n I missed you too, I’m saying, but what should be an olive branch feels like a blow. I want to hurt her. I want to make things better. I want to be anywhere but this moment, which is why I keep coming back to it. But things are—this is important. You know? It’s really fucking important.\n A lot of things are important. She’s fading. Red shift. The blackness that is the hallway and the night. There is an entire universe outside of us and I’m losing her to it. We’re important. We were. Now I’m going to go do something important by myself. I’m sorry. I’ll call you.\n She didn’t. I never blamed her for that.\n The higher functions of the sensory array are not salvageable. I’m not sure how long it takes for me to discover this, but in the end I’m sweating and aching, my muscles tense with the effort of untangling miles of digital pathways only to discover total burnout. A blackened hulk where a fantastic intricacy of pseudo-organic computing used to be, comprising all of the parts of CERA that are devoted to the analysis of where we are, when we are, what’s around us and how close and how big it is and what it’s made of and what we should do in response to all of that information. Chronometrics is adjacent in the solid-spin core. It’s all gone.\n I’m sweating against the cocoon’s padding. I want to beat against the sides of the thing until I’ve pounded my fists into fucking pulp. I want out. And what would I see?\n I can’t fix what’s burned out in transit. I don’t even know what happened to burn it out. That piece of time is blank in the logs, just as much a charred lump of uselessness as the broken array.\n We didn’t plan for this because we couldn’t. But I know it’s more than that. We didn’t plan for it because we moved too fast. Because I did. Because I was running.\n Here is a memory that isn’t a dream. It doesn’t need to be. I have this one saved. I have them all saved, all her vlogs, but I don’t watch most of them. There are two that I come back to, over and over. They’re the only two I need, because while the others can hurt me, it’s only background. After this long, I am refined in my taste for self-torture.\n The first one: it’s only fifteen minutes long. She’s showing the viewer around the village where she’s working—it’s mostly huts made from tin and wood and mud. Large families crowd outside several of them, the children naked, the older children and the women wrapped in brightly-colored fabric. Dogs roam the dirt. Mothers carry impossibly heavy loads on their heads. Men stand with farming implements in their hands or lean against ancient trucks, squinting into the sun.\n You know this. You’ve seen it before. It’s beyond a trope, beyond cliché—it’s what we build to look at when seeing is too hard.\n But here’s the thing. Two things. I saw them immediately.\n The first thing is that the people are smiling. They’re waving. This isn’t some kind of appeal for charity or pity. The women look happy: they laugh together and I see them pull Kendra into a hug. The men nod and say things I don’t understand. They gesture at one of the trucks, the bed of which is piled with sacks of what might be grain. The children are skinny but they don’t look unhealthy. The sun is high and hot—I can practically feel it through the screen, sucking the moisture out of my skin—but they don’t look beaten down by it. They show me things. Their village well. They show me their school, which is a room filled with neat rows of desks and a wall covered with crayon drawings. At the front of the room is a wide LCD screen.\n The message is clear: these people are doing well. Whatever has been done there is working. The video is meant to be seen by particular people with access to particular bank accounts, and as such I know what I see is filtered and framed for consumption, but I also believe it, because it feels true. It doesn’t feel like clever staging. What she and her group were doing—it was working.\n And here is the second thing I see: Kendra, Kendra smiling, tucking a glossy black strand of hair behind her ear. Kendra smiling with her already dark skin darkened further by the sun and wind—dark and glowing like the heart of a coal. Kendra, happier than I ever remember seeing her with me.\n The message beneath the message is clear, and the fact that I know that she never meant for me to see it makes no difference at all. Leaving me was the best choice she could have made.\n I don’t blame her, or them, or anyone. But it doesn’t help. There’s no one left alive to blame.\n Troubleshooting is different when the computer has been jacked directly into your brain for the better part of two years. You know it like you know your own internal workings, which is to say not well at all. But you can feel your way through it in a more instinctive fashion. You’re fumbling in a dark room—in a very systematic way, in a grid pattern, protocol by protocol—but you feel that it’s a room in which you already know the layout. You’ve been here before. You saw it once, in a memory. In a dream.\n I lose time when I’m fully interfaced with CERA’s systems. Some of it is simple micro-focus, and some of it is that inside CERA, time doesn’t work the same way—I always found that appropriate, considering what we do. So I’m not sure how long I work inside her, feeling the pieces of her back together, turning them to make them fit, discarding the ones that seem twisted or misshapen beyond repair. At some point I feel a buzz and I pull back enough to hear her.\n Partial array function has been restored. Gravimetrics are online. Proximity detection is online. All other sensory systems remain non-functional. Chronometrics are still non-functional. Same old, same old.\n When I bite down on my bottom lip, enough of me is still in my body to feel the pain. It’s better than nothing. What about visuals?\n The visual feed is functional, she says again, and she sounds impatient, all amusement gone. And then she’s silent. Because what else can she really say?\n I don’t know how long I join her in the quiet. I’m out of her and back in me, but time is still slippery, and with chronometrics offline it feels unreal. Which I guess it always was. But at last I stir and open my eyes into the darkness again.\n Okay. We’ll work with what we have. CERA, if the beacon is still—\n Proximity alert. We are approaching an object. I go still in the cocoon, already vaulting to assumptions. We’re okay. We’re going to be saved.\n Even if some part of me knows better.\n Here is a memory that will never be a dream. I never get that far. I can approach it in sleep, but as soon as the shape of it comes into view I’m plunging back up, too breathless and too exhausted to scream.\n I see it—I am seeing it—on the news, before I know what I’m looking at. It’s shaky cell phone footage, and it’s a wall of water advancing on a shitty little town somewhere and none of this is unusual enough to get my attention, even if I know somewhere in the rear corners of my attention that this one is different.\n Here’s what happens: the water is coming and it’s swallowing everything. It’s like someone is pulling a blanket of water up over the land. I’m sitting in a bar near the lab, drinking off a long day, and as I’m watching, idle and only half interested, I’m not sure if it’s live or if it happened already. Not like it matters.\n And I see her.\n It’s just a second. After, I spend days going over footage and photos and info on where she was then, friends, her mother—God, her mother, who I never liked talking to even when we were still together—and then I go over the body counts and the casualty reports, like I can bend the numbers a different way if I focus hard enough.\n Like I can run time backward. Just like that.\n But I see her, and she’s scrambling up an embankment with a crowd of people so wet and muddy they barely look human, and then the embankment crumbles under them and they all go down. I don’t see her face when she drowns. My imagination does the heavy lifting for me.\n Kendra. Jesus Christ.\n How many people died that day? All that time staring at the numbers and I’m honestly still not sure. No one’s sure, of course, but we love to count, don’t we? I know it was thousands. Tens of thousands. I cared about one in all of them. Does that make me a heartless bitch? Was that always part of the problem? Is that where entropy starts?\n I can’t change anything, Kendra. But you know I was trying. You know I still am.\n I’d twist time around my fingers for you.\n Is it a ship? I hadn’t realized how frantic I was getting. Now I can feel it in the strain of my own inner voice. CERA, is it a satellite? Can we—?\n Careful, Vita. Gravimetrics indicate that the object is extremely dense. A closer approach is likely to make escape from its gravitational field difficult.\n We don’t have the thrust sufficient to climb a gravity well. We launched in space. I tense up and clutch at what’s around me like I can control it with my muscles.\n CERA, full stop.\n I know I can’t feel us pull to an easy, reverse-thrusted halt in space, but I still feel as though I can. And I feel that thing out there, whatever it is. The thing I’m blind to. I’m in a dark room and now I know there’s something in here with me. Not a satellite. Obviously too much pull. A planet? A star?\n I’m so pissed at the malfunctioning visuals, I wish I could tear them out of my eyes. And then I’d really be blind, drifting and bleeding, but I’m suddenly so pissed it almost feels worth it.\n What is it,CERA?\n Tough to say. Density is estimated at 1 x 1013—but it’s only an estimate. Alpha, beta, gamma, and electromagnetic radiation are all minimal.\n No heat or light to speak of. Not a star. Unless.\n God.\n Everything here is wild speculation. That I’m even here is wild speculation—we were pretty sure this would work, but we weren’t positive. Time, space, how exactly the mechanics of both would work when my little craft shoved them in a blender and hit puree—we didn’t know. It’s too much to call this an experiment: we were flailing around in the dark. I wasn’t afraid of that. But a lot can change in a few million years. If something went wrong. If I went too far. If I’m not where and when I should be.\n That thing out there in the dark might be a hungry mouth, open and ready to swallow me.\n Visuals on, I stare at black nothing. I will some photons to sneak out of that blackness and give me a clue. But none come. Or I can’t see them. The end is the same.\n So here’s what I could do, I think, staring so hard my head starts to ache and the cocoon around me starts to feel like something designed to smother instead of something keeping me alive. I could just drift blind until someone finds me, if anyone does, if anyone’s there to do the finding. I have a week of air. I have enough water to keep me going almost that long, if the moisture reclamation sponges laced into the cocoon’s fabric hold out.\n Or I could start being a little more goddamn proactive.\n Launch the probe, CERA.\n I have one. It was a kind of concession to research outside of the tunnel-vision focus on what we were really trying to do. In case I found anything interesting. Now it might tell me nothing useful. It might be able to tell me, in exquisitely measured detail, just how fucked I am.\n But we have to know, don’t we? We always have to fucking know.\n I feel the craft eject the probe. I imagine it shooting toward the thing spinning invisibly out there, black and potentially lethal. I don’t trust any of what CERA is telling me. I don’t trust my eyes. I haven’t in a long time.\n They never showed me what was there until I didn’t want them to. And then it was all they would let me see.\n I ran, Kendra. Okay? I admit it. You got me. I ran. I was always running. Maybe I saw something in you that I didn’t know how to deal with. Maybe it’s just who and what I am. I ran away from you and then after you were gone I ran away from everything.\n But we were going to blast a hole through decades and pop out the other side. You weren’t just a little bit excited by that? You don’t think that was worth some sacrifices?\n Was it? Was it worth you?\n I hate questions without answers. I ran from them, too. Here’s the thing, Kendra—here’s my dirty little secret. I thought maybe, in the future, they’d have neatened everything up. Simplified things. The world would be a less messy place to be in. Everything would fit. Everything would make sense. And in that world, you would naturally come back to me, because we made sense.\n I believed in something better. I did. Better . . . and easy.\n And now look.\n Iron.\n I wait for more. I wait a while. Time spins out—I wonder if I’m hallucinating its passing. The truth is, I’m sort of wondering if there is such a thing as time anymore.\n CERA?\n The composition of the object is pure iron. It’s very dense. It’s highly probable that it is the last remnant of a stellar object.\n I wait again. There’s more silence. In that silence, I think I’m dreaming, and what I’m dreaming of is laying my cheek against something hard and cold in the darkness. Lying down on its surface and letting it pull me into itself. Because this—right here, in the ending-black, circling a ball of solid cold—this is always where I was headed.\n We try to make things mean things. We can’t. They don’t.\n CERA. Are there any records of any such objects on file?\n Everything I know about it is only speculation, Vita.\n Tell me.\n She does. I stare into the darkness and I listen.\n We have a lot of ideas about time, us temporally-bound creatures. I know them. I read all about them years ago in the kind of quantity that requires scientific notation. Some of it was research. Some of it was . . . well. Passing the time.\n Here’s one that I always liked, because it’s not about time, not really. It’s about spacetime, and it’s about probability and the shape of things. That every possible choice we could make has been made, somewhere, in some iteration of the universe. That bad decision you made that changed everything? Somewhere you didn’t make it. You took the other door and you got the lady and not the tiger.\n Of course, that leaves an almost infinite number of versions of you that got the tiger instead. And you personally? You only get the one choice. That’s the rule.\n The rule broke me. I wanted to break it. That’s why I climbed inside the cocoon. Somewhere there’s a me that came home when I said I would, said the right things, did the right things, and somewhere there’s a Kendra who didn’t drown in a country I still can’t even spell. Somewhere we’re together and we’re happy and we might even get to go on forever.\n But I don’t get to make that choice, even if the rules don’t totally apply to me anymore. Even if I broke the one. I get the choice I made. And now I get the darkness.\n How long?\n CERA is silent for a moment—for her a moment is a decade and I wonder what she can possibly be doing that holds her back from response. Then she vibrates at me out of the center of my cortex.\n I don’t understand your question, Vita.\n Fuck. How far did we go?\n Another moment of silence. This time I can feel what it is: she’s actually thinking through it, reading entire books on the subject, consulting a hundred thousand databases’ worth of info. Getting all she can for me. But of course, when she speaks again I already know the answer.\n The theoretical timeframe within which stellar objects could potentially decay into spheres of iron-56 is 101500 years from our temporal point of departure.\n One sentence. Very simple. I almost can’t believe it took her so long to come up with that.\n There’s nothing, I think. I feel the words behind my lips. Nothing. Not technically correct, but practically true, and the latter means more than the former most of the time. Like: She left me. She’s gone.\n I’m gone. I can’t get back. With no one, with nothing, no energy source for the jump, no hand to pull back the slingshot. I can’t move on pure iron. I’m here. Here is the only when I’ll ever be.\n My cocoon closes tighter around me in response to the drop in my body’s temperature. I feel a flash of fear of smothering even though that couldn’t happen. But it will. It is. Air, water, food . . . Here I am in the dark, in my warm little center of the nothing that’s left. There’s nothing to do. There’s nothing that I can or should do. In the most fundamental way possible, I am inconsequential, and so are all my stupid little choices. The ones I made and the ones I didn’t. The ladies and the tigers.\n And somewhere in that darkness I realize that what I’m feeling is relief.\n CERA, I say, and really, the words are so much easier than I thought they would be. Take us away.\n I can almost sense CERA’s confusion, though I know that technically she can’t have any. Please specify a destination, Vita.\n Random. My eyes are open, staring at a darkness without stars. Iron dark. All I want to do is sleep. It doesn’t matter.\n I’m dreaming with my eyes open. I don’t need to close them now if I want the dark; it’s all around me. It’s the night face of everything. CERA is quiet in the center of my head, the cocoon is warm around me, and I drift. I think about water and blood and countries the names of which I can’t spell. I think about light in the strands of Kendra’s hair. I think about choices, ladies, tigers.\n I had to come billions of years to understand that it doesn’t matter. That it is what it is. That we had what we had and now it’s over. I shift my hands in the folds of the cocoon; it’s like I can reach into the dark and touch iron, close my fingers around it. Feel the coming cold. Sleep inside it. Dream.\n Sunny Moraine's short fiction has appeared in Tor.com, Strange Horizons, Nightmare, Lightspeed, and multiple Year's Best anthologies, among other places. They are also responsible for the Root Code and Casting the Bones trilogies and their debut short fiction collection Singing With All My Skin and Bone is available from Undertow Publications. In addition to time spent authoring, Sunny is a doctoral candidate in sociology and a sometime college instructor. They unfortunately live just outside Washington, DC, in a creepy house with two cats and a very long-suffering husband."}