{"fingerprint": "7CDnOs60P0zcSEcgxv9in5zss74=", "sitename": "Clarkesworld Magazine", "title": "Things That Happen When You Date Your Ex's Accidentally Restored Backup from Before the Divorce by Lisa Nohealani Morton", "author": "Lisa Nohealani Morton", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/morton_12_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Things That Happen When You Date Your Ex's Accidentally Restored Backup from Before the Divorce by Lisa Nohealani Morton", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4410 words, short story\n Things That Happen When You Date Your Ex’s Accidentally Restored Backup from Before the Divorce\n It’s unethical to pry the secrets you’ve always wanted to know out of your ex under the guise of “getting closure.” The only reason you would need to know those things is so that you can turn around and use that knowledge on your partner, and that’s a power you both agreed to forgo, when you got (back) together.\n No matter how much you wish you knew when that business with Rudy really started, and whether it was before or after.\n There are so many versions of a story that could have really happened. History is only writ in stone because it did happen that way, not because it had to. The backup insurance sells the idea of a rescue from unfortunate events—a resumption of life after a brief and medicalized caesura.\n But sometimes mistakes are made. Sometimes a car crash and a transposed digit means the wrong body gets cloned, the wrong consciousness downloaded, and everyone’s past gets just a little more blasted than they expected.\n The lawsuits will go on for years, but as soon as your partner draws their first breath, they have constitutional rights, even under this court, and so they’re processed and set free like any other clone, and of course they go straight to you.\n Sometimes, you get a second chance.\n Your relationship with the backup is a new beginning. The only way this thing has a shot at being viable is if you both treat the divorce like it never happened. Your partner and your ex stopped being the same person a long time ago, and if you hold them responsible for something another version of them did, you’ll poison the whole thing from the start. We have to build a new us, totally separate from the old, you tell yourself.\n You keep telling yourself that until you start to believe it a little. Enough, at least, to keep turning down your ex’s invitations to lunch. Plenty of time to have that meal when your mind no longer boils with invasive questions, when you’ve regained some equilibrium and learned how to respect your partner’s privacy.\n Your partner’s memories of that trip you took to Asheville together are clearer than your ex’s are. Some of the things you’ve gotten up to in the bedroom recently remind you of that weekend more than anything between you and your ex had in years. Not the acts themselves, but the intoxicating excitement of discovering something new and wonderful with someone you’ve built so much of the old and familiar with. Seen through their eyes, heard in their gasps, everything becomes new to you again, too. You fall into exhausted, pleasure-drenched sleep, feeling their warm arms wrapped around you. “You’re mine,” they whisper in your ear, just before unconsciousness takes you. “Nothing could change that.”\n When the bombs hit downtown in the middle of the night, for the first time since you’ve been together, your partner still remembers the trick for helping you through a panic attack that your ex forgot or gave up on, over the years. They sit up in bed and pull your head into their lap, and rub your temples with their thumbs in tiny, gentle circles. You freeze and shake with every explosion, and you know their head must be haloed in the window by the overhead light in your bedroom, but your partner just keeps on soothing you, oblivious to the lateness of the hour or the danger.\n They sit up with you for hours. You both have to get up early the next day, but they never say a word about it. They chug a second coffee and just keep moving.\n When the nagging feeling that it’s all going to happen again burns in the pit of your stomach, and you start tracking their movements and noticing statements that don’t add up, you already know you’re not going to leave without proof, so you don’t spend too much time beating yourself up about it. You tell yourself it’s not snooping if you’re looking in their phone for the address you already know will be there.\n It’s closer to home than you expected, but it’s there.\n Most of the time, conversations with your partner are like things used to be, before it all fell apart. Their political beliefs haven’t taken that weird turn into centrism; whatever happened to them that was so bad that they decided the costs of the war were too high, it happened after the backup was taken. They still support the resistance.\n You’re sympatico on the important stuff—still, you remind yourself, not again, this is a different person—and different enough on the details to keep things interesting. You recognize the person you fell in love with in the way they’ll stay up half the night with you, dissecting a new concept or arguing over the best way to achieve your shared goals. You don’t have to hide your mutual aid work, or the money and supplies you funnel to the resistance.\n When you see them meeting up downtown with a leggy blond in a leather jacket and skinny jeans, you don’t spend four agonizing months searching for some level of proof that will finally, against all your instincts, convince you that the thing that appears to be happening really is.\n You do, without hesitation, the thing you should have done the first time. You call Tiana, and let her know your plans. You make sure you have a safe place to go, in case you need one.\n Then you sit your partner down to talk about it. You don’t hide what you know, or make them try to guess what it is you want to talk about.\n “I know about the bombs,” you say, with no other preamble. “And the boats.”\n You watch their face go from shock, to panic, to relief and blossoming joy as they realize you’re not going to try to stop them. As they realize they don’t have to hide it anymore.\n They pull out their phone to signal their cell leader—the leggy blond, whose name turns out to be Rudy—and set you up for an introduction.\n “Tonight?” they ask, muting the phone mid-conversation.\n You start to nod, then shake your head. “Don’t you have a date with Sydney?” Your relationship is no more closed than it was the first time, and they’ve been seeing someone new for a few months now. It’s starting to look like a thing, although you haven’t met their new paramour yet.\n “Shit,” they say, and turn back to the phone conversation for a minute. “Wednesday?” they say at last, and you nod, and they set it up.\n The cell treats you as untrustworthy for a while—“Not untrustworthy,” your partner murmurs to you in the dark. “Of unknown trustworthiness.”—but their trust comes with time. You start with simple courier gigs, and move on to more important assignments as your position with the cell becomes more secure. There are only a few steps between the cell and Shayna, the resistance’s general in the mid-Atlantic, so it’s a heady time.\n Sitting in the back of a faux-dive bar on H Street, getting the latest real news from a courier (they can’t censor in-person conversations, at least not yet), you feel as though a broken bone has finally set. Its splintered edges mesh back together, letting the muscles around it relax, and bringing with it a lessening, though not a cessation, of pain. Your partner glances over at you, and you see a similar relaxation in their face. Finally, all the way together. For the first time, this time or any other.\n They take your hand under the table, and turn back to the courier to ask a question.\n Your first gig together is new and familiar at the same time. You’re sneaker-netting a flash drive to a member of a cell in Hyattsville, using a visit to a jazz night at a local meadery as a cover. The mead is good, and the band turns out to be made up of members of Airmen of Note, so the jazz is, as advertised, hot. While you wait for the contact to show up, you and your partner play a board game on the patio.\n You don’t know what’s on the drive and haven’t tried to find out, and you’ve never done anything quite like this before, even though the feeling you get when you meet your partner’s eyes is the same one you remember from running duet gigs with Bunny, the first time around, after your ex bowed out of the resistance. It’s the same fear, the same excitement, the same bone-deep sense of righteousness. The same knowledge that the two of you are making a difference to the only thing in the world that really matters right now, no matter how many normal lives are being carried on around you.\n It’s an intoxicating feeling, even more than the mead, especially when it’s shot through with all the threads of what you and your partner mean to each other.\n While you’re standing outside the Food Lion in Upper Marlboro at ten o’clock at night, waiting for the dreadlocked kid in the wife-beater that you’re supposed to hand the surveillance drones off to and only have a vague description of, your partner catches your eye from where they’re standing lookout and grins, with an edge to it that’s just this side of maniacal. They purse their lips at you, making the silent sign that the two of you have used to indicate affection ever since you started dating the first time.\n They’re twenty feet away and washed-out under the parking lot lights, but you’d know that expression if it were sketched on a napkin, let alone on your partner’s dimly lit face, so the feeling comes through. Warmth and love and belonging wash over you, until you have to shut your eyes for a second to regain your composure. You want to go to them and fold them in your arms, kiss them like tomorrow is not just uncertain but entirely ruled out, but you just purse your lips back at them and blink back tears.\n Just then, your contact skates up on a board that lights up in a rainbow wave, flashing bright in the darkness, and you struggle, dazzled, to remember the pass-phrases that let you know that this courier is the real deal and not an imposter.\n When your partner’s lover is shot and killed by security forces during a resistance op, you get that burning feeling of history repeating itself.\n The two of you can’t go to the funeral—as far as you know, no nonresistance connection exists between either of you and their lover—but a relative livestreams it. You spend money the two of you don’t have, in secret, for a pristine device and a really good VPN. You even cough up the premium for custom geolocation services, although it’ll mean ramen packets for lunch for the next month. You select an IP that resolves to a neighborhood in Chennai that could plausibly contain other, acknowledgeable mourners, for added verisimilitude.\n There’s a little room at the back of your house that might have been used as a nursery, once upon a time. You set everything up there.\n Your partner walks into the nursery, surveys the setup, then turns to you, tears already forming at the corners of their eyes. You walk into the room far enough to reach them, and enfold them in your arms while they cling to you. You squeeze them tightly—once, then twice—and press your lips to their suddenly sweaty temple.\n Pulling back, you stare into their wide, tragedy-filled eyes. They take a shaky breath, and their eyes flick to the door. You take their meaning, and you’re moving before they have to ask. Kissing their temple once more, you turn and go, closing the door and leaving them to their private grief.\n As you walk down the hallway, a chip of ice freezes in your stomach and grows into a block as you contemplate what’s coming.\n In the days after that, you help them grieve. You hold them when they need to cry, you leave them alone when they start getting prickly, you sit up long into the night and let them monologue about their memories and all the myriad feelings of loss that come with losing a loved one until they pass out, exhausted, in your arms.\n Through all of this, you’re braced for the signs—the growing disaffection with the movement, the burnout—that presage the inevitable. The increasingly strident questions about how this could all possibly be worth it. The new friends from sober, moderate circles, who convince them that they can be a voice for peace and bring an end to the hostilities. The drawing away from you that will only accelerate as the gravity of your relative political positions continues to pull you apart.\n You fill yourself with a constant refrain of love, ringing its changes through your mind like a bell, telling yourself that the past is not prologue even while you’re sure that everything is on the verge of collapsing.\n You hold this posture of tension for several uncomfortable months, but the disaffection you’re expecting never comes. Your partner mourns, and bitterly so, but it never overshadows and drowns out their feelings for you, or causes them to repudiate their life’s work. They monologue late into the night about what their lover meant to them, and you stay up and listen, but in the end, when they’re wrung out, tearstained, and heaving breaths like they’ve run a marathon, they cling to you like you’re the last thing in the world, and say, I’m so glad you’re here. Thank god you’re here with me.\n They start to take riskier gigs, though. Things that don’t just hurt the regime, but embarrass it. Ops that risk retaliation and response with overwhelming force. You hear the warning bells in your head as loudly as anyone, but this is new, not like last time, and you don’t have hindsight to guide you away from the pitfalls. You try to convince them to play it safer, but all they have to do is gesture vaguely at the world and you find yourself out of arguments.\n In the fall, St. Louis is liberated. Then Knoxville. The autonomous zones in Baltimore grow and merge. They take control of several transit hubs and an old sewing machine factory, and range outward from there to attack and embarrass the regime.\n The Inner Harbor is home to a band of teenage resistance marauders who call themselves The Surfin’ Terps. Members of that merry band mark themselves by the turtle-shell bike helmets they wear whenever they’re on the water. On boats, jet skis, or hover skimmers that hang uncannily above the surface of the water, the Terps harry and mock regime boats that try to approach the port.\n The military is still staying out of the whole thing, so the resistance doesn’t have to worry too much about shooting tonnage above the size of a sport fishing boat or a catamaran, although the boats sometimes approach from Tidewater in large numbers.\n The Terps rule the waves, bobbing and weaving, the skimmers dipping from side to side in a way that appears to defy gravity. With sonic weapons developed by UMCP’s engineers, and tasers stolen from the unmarked federal police force occupying the city, they drive the regime’s useful idiots back again and again, jeering at them loudly each time the boaters retreat from their latest attempt.\n Flanking the conflict on both sides are streamers, darting in and out of the edges of the fight on their skimmers, protected by the unspoken but violently enforced ban on attacking journalists and other bystanders. Neither side feels like it has sufficient propaganda momentum to claim a moral victory without carefully controlled coverage, and the international press gets into the game as well, making it even more risky for the regime to crack down. Videos with titles like “dOn’T pOiNT tHaT tHinG aT mE bOi” and “Derpy Terpies get their comeuppance” proliferate online, night after night, in an endless dance for dominance over the public conversation.\n Your last mission together starts off bad and gets worse. It was supposed to be a simple extraction. Someone was meant to be snatched by the cops at a demonstration in Dupont, and you were supposed to play the part of a protester spontaneously leaping to her aid, one of many, peeling her away from her attackers and helping her melt into the crowd.\n You’ve been a character in this kind of flash mob before. Whoever is feeding you intelligence from MPD has to be way on the inside, so the resistance gets advance notice of a lot of moves like this.\n It’s important to protect everyone you can. That’s the secret to sustaining the movement. “We all stand and fall together,” as Shayna declares in her videos.\n You take up station next to your partner, hands and fingers linked, just two more semi-anonymous bodies between the arrestee and the Feds, making yourselves into human shields against the violence you know could come.\n Every time you’ve done this before, the cops have backed down. It’s inherent to your strategy. You show up with overwhelming numbers for this very reason—they can’t kill you all.\n Except they can, over time. They can give you the death of a thousand plausibly deniable cuts. They can wear you out on the shoals of “restoring order” and “protecting property.” Each bit of brutality not covered by the press provides cover for the next round of escalation.\n The size of the massacre that the cops are unwilling to perpetrate grows in proportion to their fear of losing. They turn the temperature up, slowly, while the pressure rises, and every resistance victory makes the next gig more dangerous. A greater and greater force of numbers is needed, as time goes on, to show them that you’re not to be trifled with or retaliated against without consequences.\n This time, somehow, the resistance misjudges that count, badly.\n This time, the cops aren’t willing to take their obvious L and walk away. This time, they fight.\n Cop streamers weave their way in and out of the fracas; the resistance hasn’t anticipated this show of force, so they only have one streamer of their own, chugging down the street on an old and coughing Vespa.\n A chorus of “Stop resisting!” floats up from the ranks of Feds in their unmarked uniforms. Batons rise up and whip down in an old familiar rhythm. The cops beat you back, but their cries grow louder and more theatrically frightened, despite their dominance over your forces. Hamming for the cameras to keep that sweet qualified immunity.\n “Keep your hands away from my gun!” one of them shouts, the well-known prelude to a kill. You exchange looks with your partner, not even glancing to see if anyone is going for the aforementioned gun. They nod. You break together for the exits before this goes wronger than it already feels.\n They get you while you’re running for the alley. “Keep moving,” your partner urges, but they’re kettling from both ends of the block, and they were uncharacteristically smart enough to block off the side exits, so that conveniently jumpable and well-scouted wall you’d marked on Monday is no use to anyone.\n They surround you on all sides before you realize what’s happening. They recite the required warnings so fast you know they never intended to give you a chance to comply. “Put your hands down!” “Stop resisting,” “Stop going for my gun!” they chant in unison, as your heart falls into your intestines.\n Then they open fire.\n You dive behind the concrete pillar of the façade of a Greek restaurant just in time to escape their bullets. Your partner is not so lucky.\n The first slug hits them in the rib cage as they’re sprinting for cover, the surveillance video will later show. They throw their arms out to both sides and start to flail in pain and panic as the bullet bites deep into their flesh, plunging at a downward angle through one lung and a kidney. The highly publicized autopsy will note that this wound alone might have been enough to kill them, although it’s not the only one they’ll take.\n Cataloging the rest of the shots is not worth it. You do it nonetheless, every time, in their ever-changing particulars, staring empty-eyed at the screen as the events of the day play out, over and over.\n Freed by that first shot, the cops open fire as one. The explosive roar of the rest of their bullets almost feels like an afterthought, compared to the soul-piercing, life-ending power of that first one. You can’t help counting them, though—the second, and the third, and the forty-fifth. The sight of your partner jerking under the fusillade is an image you’ll wake up from for the rest of your life.\n Your partner is killed just a few minutes before the cavalry arrives. Shayna herself shows up to extract you from your botched extraction, but you’re too blinded by grief and rage and a formless, unending terror to appreciate the acknowledgement of your partner’s importance to the resistance, or in fact to be aware of almost anything that’s going on around you.\n You help Shayna’s forces drive the Feds back, and the sense of unity you feel as you push them out of resistance territory pushes the shouldering darkness from your brain, for a while, anyway.\n You don’t allow anyone to accompany you, long after midnight, to retrieve your partner’s body. You bring it back in to the makeshift resistance camp, in the Walmart parking lot, stumbling in a fireman’s carry that lets their sludgy blood soak into your clothes and your skin.\n You resist the people who try to take the body from you at first, until Shayna jumps in front of you. Talking soothingly, like she might to a cornered animal, she keeps your attention until exhaustion or capitulation forces you to your knees and makes you roll your partner’s corpse out across the painted lines of the parking spaces.\n Seeing them lying there like that, something catches in your chest and your breath judders to a stop. Minutes pass before you can drag in a real breath in order to let out the wail that feels like the only thing you know anymore.\n You learn how to breathe again, in fits and starts.\n You feel like the pain will never recede, but gradually, it does. One day you wake up and go nearly two hours after breakfast before your throat closes up and you can only suck in air in great gasps punctuated by long silences, and it’s the marker of the beginning of a new world.\n The war goes on, behind the scenes, but everyone understands that you need some time to lick your wounds. They give you space. Shayna sometimes looks like she’d like to offer you more, but in the end she keeps herself to herself.\n After a month or so, you start running gigs again—just simple courier runs at first, but eventually bigger stuff. Charlotte converts to autonomy, then Somerville. It starts to be worth tracking resistance territory on a map.\n Six months later, you have lunch with your ex. It’s the first time you feel able to look at their face without crying.\n You meet them at the diner you grew up in together. It’s long since closed and burned down, but it’s neutral ground for you both in a way that’s hard to explain. Your ex takes your elbow, and together you walk down the road.\n “Well, of course, I don’t have your way with words,” your ex says, and you shudder at a phrasing that never sounded so smarmy before. Suddenly, you’re desperate to live in a world where everyone has at least a basic way with words, if not yours, and they speak their truths as best they can without an eye for concealment or power plays. Suddenly, you realize that for the past year that has stopped sounding like a luxury.\n You ex’s tone is a bit whiny, and why have you never noticed that before? How can they be nothing like your partner, when they are them? Disorientation sets in as you remember that once you considered your ex the original, and your partner the interloper.\n A fresh wave of loss washes over you. The things that were lost, and the things that have gone before, and all the illusions that have fallen. “I’ll have to see what the pod thinks of that,” your ex says, and you realize, for the second time in your life, that the two of you will never be one soul again.\n There are further exchanges, and further gigs, and ultimately the victory of the resistance against the regime, and this story continues on beautifully and gloriously long past this point, but this is the end of the story as far as you, your partner, and your ex are concerned.\n That night, you stand before the mirror, thinking about your partner, and your ex. Thinking about how every story has versions, and the strange accident that allowed one of them to come to life, for a time. Thinking about how the alternate timeline can end up being one you endorse more strongly than the original.\n You shiver in the October chill, not yet cold enough to turn the heat on. You hear your ex again, saying, “If you don’t want to be alone—” an offer you kindly but firmly declined. You feel even more profoundly alone in the world than you did the first time.\n Then you feel a strong pair of arms wrap around you, although no one is behind you in the mirror. A wave of warmth, love, and belonging washes over you, and you keep your knees from giving way by the sheer force of your terror that this visitation will disappear if you let yourself collapse. A warm, loving breath exhales into your ear, and you can somehow tell from the shape of the wind that it came from a pair of pursed lips. “You’re strong,” a soft voice sighs. “You’re mine. Keep moving.”\n You give yourself up to the truth of the matter with a good will and a loving joy.\n Lisa Nohealani Morton's work has appeared in Lightspeed Magazine, Fireside Magazine, and elsewhere. She is also one of the assistant editors of Nightmare Magazine. Writing as Ellen Cooper, she published Congresswolf, an interactive novel about werewolves, Congressional campaigns, and murder, through Choice of Games. Lisa lives in Washington, DC, with her partner and two cats. You can follow her on Twitter at @lnmorton."}