{"fingerprint": "Dp+2S5hstu7zfGf5si6ISgDBQ3U=", "sitename": "Clarkesworld Magazine", "title": "Appointment in Vienna by Gabriel Murray", "author": "Gabriel Murray", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/murray_12_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Appointment in Vienna by Gabriel Murray", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9990 words, novelette\n Appointment in Vienna\n I want the two images from Kraków to be first. May, love, poppet, if you outlive me and give a tinker’s damn—and I won’t hesitate to resurrect Ned Frye to harangue you if you don’t—you should remember.\n You do not have my permission to colorize. You do have my permission to rearrange. They were taken in order, but it interests me to imagine them either way; the brothers looking up, and then back down. The brothers engrossed, then unpleasantly aware. Nothing else in the scene signifies which came first: the shot is mostly rubble, without a great deal of living subject to speak of, no flag flapping nor dragonfly on its circuit. My beautiful composition of an ex-museum—I’m sure I already had the theme in mind—became two awkward shots of unfriendly children. It’s good to make the most of things.\n They dominate the frame—which is troublesome, because I hadn’t actually been intending to photograph them. But I was twenty-seven, wasn’t I? Seven-and-twenty and so chilly and weary; so ready to declare that I had arrived. That’s always been true of me. It is probably what allows me to stand it, any of it. Just ever supposing it must be over.\n Those should be at the beginning. Sandwich the title page. A little honor guard.\n I know there’s no input for me on the cover. I don’t care about the cover. If I were Ansel Adams you wouldn’t be slapping Glacier National Park on the cover and telling me to shut up. As I am not, you and that child you’ve got in place of Ned now are going to do that with something else anyway. I understand about Glacier National Park; no one with a coffee table purchases an Adams retrospective to stare contently at something he doesn’t recognize. Doubtless you will find something just as striking for your celebration of the journalistic life of Leslie Kincaid. Whatever it is that you manage to make of his work.\n I think what really unites us in the service is a desire to confess. To scream our secrets into the reeds. What’s irritating is that I cannot think of a better way to put that. You’d think the Bible would have something to offer. I’m not religious, however. Even if you, or more searching parties, could get the truth out of me, none of you would be terribly surprised to find that I am agnostic. I fit the profile. Even if you scratch me, I fit the profile. I’m far too homosexual for God and too fucking sentimental for atheism.\n I’m sure I’ve heard some homilies. The word has a compulsory ring to it. Unfortunately, what I’ve heard far more of is classical references. You wouldn’t understand, May—the chief purpose of public school in the United Kingdom is to perfume the rotting corpse of antiquity. I could describe damned near anything in misattributed Latin.\n So with that in mind: I hear thieves want to be caught. This sounds like something a copper would say. But I do think spies all want to confess things. It’s why it’s so easy to get us to do it. The less attention-starved ones take their L-pills right off. If you get one of us, you have to know he is looking to tell you everything. I don’t know a man who got into the trade who harbors not even the faintest hope of spinning it into his memoirs. We’re the weakest possible solution of T. E. Lawrence hereabout.\n Including me. Certainly me.\n But that isn’t going to happen. No Kincaid retrospective is going to happen, and you won’t work on it. You won’t even get to be snide. I’ve got too many things to do now.\n The collection would be called Appointment in Vienna: The Images of Leslie Kincaid, 1938-1965. To think, 1938—God in Heaven, I’d been a professional for all of a year? That was when our lot approached me, starting with our boys in French SOE. Is that what adulthood is: realizing that people lied to you? Admitting that you decided to believe them?\n Assets will do anything to feel special. So did I. Those were always my favorite bits of life: scholarships, positions, recruitment. Everyone likes to be chosen.\n The appointment is in Vienna instead of Samarra, of course. I like to imagine people wondering if I’d died in Vienna. I certainly would not mind dying in Vienna, or some other place nice, but I doubt I’ll have much selection. Still, I could drive my readers—I suppose perhaps I shouldn’t joke, but what does it matter?—I could drive my readers to wonder about my appointment with Death in Vienna. Especially when they page past the two boys in Kraków, staring at them, looking down, and discover that after my brief biography the first image is from Vienna in 1948. (My readers do basic math in their heads. Obviously I did not die in 1948.)\n It’s the ceiling of the Vienna Opera House, dazzling and cramped in concentric light. It is a heady thing to look at, or even just be under, and an excellent use for color film. Even standing underneath it feels a bit like champagne. Then they also furnish you with champagne. Mozart must’ve put them into a raving fever. You can think of what a fun place it would be to meet Death, if you liked.\n But Death is not about, just hundreds of ball-goers for the Viennese Opera Ball. You can’t see them, but you needn’t—you know as well as I that ballrooms are not lit just so, light and dark, for anything but a grand event. A ballroom in Vienna is for a ball; a photograph of an empty one is not “a photograph of a room” but “a photograph with a room empty of people.” It’s different.\n This one is full of life. I am wearing a dinner jacket but too distracted to care; I have turned my camera up to snap the ceiling, which dizzies me. I think I can feel the thickness of music. In fact I know little about music, and am starstruck. This is not an undercover task of any sort. I am just here to photograph wonderful excess. I’m having fun, in a lost way. I’ve lost the threads of fun, truly, by this point in my life, but I’m not immune to glamour. A gentleman is about to speak to me. I know he’s there—I can always feel the shape and presence of men, for reasons both human and pragmatic. I’m ignoring him to perfect my shot.\n You’ve never seen this photograph, May: I know, because no one has. I developed it and destroyed the negative, and then when I was packing up my room at the Grand Hotel Wien four days later I destroyed the print too. I destroy about nine-tenths of my work, do you know? It’s the dull stuff that I give you.\n I suppose it’s been a decade now since I’ve finished a painting. I’m always behind the camera. No one who came up where I came up aspired to be a photojournalist, though—I drew, like anyone else.\n Children do not draw environments. I was no exception. Houses are where they contextualize people and animals. Any boy who likes to draw houses more than people or animals is disturbed. I was uninterested in animals—well, I was interested, I was interested in everything. Just not in drawing everything.\n I wanted to draw beautiful people. Lovely like Degas. Striking like Friedrich. When I had my first proper instruction the master told us that Degas and Friedrich, in fact, drew places, into which wanderers and ballerinas fit like every cloud. I didn’t believe him. I believe I didn’t understand how anyone could be inspired by the pure fact of a scene.\n It’s difficult to be so romantic as a photographer. Painters are always lying. We make our subjects brighter than they are, and when we take up photography we are amazed at how, in reality, people fade so disappointingly. Human extraordinariness does not tend to emphasize itself: it fits into the composition.\n Oh, May—May, you haven’t any idea how often I think of you. It’s very challenging not to think often of one’s editors. It’s a very embarrassing relationship that all of us in the newspaper business won’t admit to. I hope your years are well, in between my intermittent calls. I did always think you married a good fellow; your son is growing up so handsome now, too, but I’m afraid no woman can hear that from a homosexual without squinting, not even you. It’s all right. I don’t mind, not really; May, darling, we’ve known or not-known each other for so long—tell me, do you ever suspect?\n I think of Vivian. You wouldn’t know her: we’re both in the trade. She runs the numbers, yes, but she has to lie about it. That’s the trade. Does she ever wonder?\n She doesn’t. I know she doesn’t. We’re all too busy scrutinizing all our boys for Bolshevism, understandably. If it’s all just volleys between ourselves and Moscow, there’s no need to look for other ways to turn. But everyone turns, May—statistics bear it out, we both know. Nothing is ever the way you left it. Not your room. Not your mother. Not Liberty Leading the People (despite the Louvre’s most valiant, expensive efforts). Not me, yes, but that’s not the point—you cannot just leave everything in this world and expect it, however uneasily, to remain.\n I suppose that sounds like a moral apologia. It is. It’s not something I dwell on anymore—the morality of all things is depressingly simple. It’s the logistics that occupy me. I have so much to do now. I don’t even sketch anymore, in my bedroom.\n Two pages on Vienna, explaining. Then we turn the page and we’re in the brown downtown of Hagerstown, Maryland—\n —home to the Dorsey-Palmer House and the Maryland Theatre; all English-language high culture is similar, even in how the word is spelled—\n —where once I met a boy and flirted with him, push-pull, as he shied laughing away: playacting seducing him/resisting me, as though anyone anywhere cared a whit for his purity or mine, or thought it even existed; as though brothers and nuns were possessive of the likes of us—\n I was in Hagerstown for other reasons: certainly not to flirt. Flirting plays a substantially smaller role than you’d imagine in any of my careers. I went to a soda fountain and had a malt and listened to the boys and girls talk; you can hear the American South, but it grows ever quieter. I can’t say I’m sad. They can find someone else for that elegy.\n I remember the soda and the conversation because after I had them, I went outside and snapped that photograph. Otherwise I wouldn’t.\n This was a boy, actually: seventeen or eighteen, high school, letterman jacket. And I suppose I did flirt. His friends had moved further away down the bar and he was smiling at me and sneaking a few glances—well, I’m worth glancing at. I smiled back at him and decided to be American. “You don’t have the time, do you?”\n He grinned: “You don’t trust the wall clock?”\n “I’m out here from California—I had to go through the Rockies. Trust me, once you deal with that time zone situation,” I leaned on my elbow, “you learn to get a second opinion.”\n We chatted. His name was . . . God . . . he told it to me. Sam or Stephen. Within ten minutes he was telling me about the town and what I should look at while I was here for my aviation business; he pointed out that pretty old Dorsey-Palmer House and even the Masonic Hall down the street, which he spoke of in a mocking hush (“They say it’s a compass, the math kind, but it’s probably a pyramid. You know how it is with weirdos and pyramids.”) and speculated on which of his friends’ dads were involved.\n “Everyone likes three,” I said, affable. “And Egypt and stuff that makes sense, and that probably accounts for the Freemasons altogether. Alchemists, medieval fake magicians, you know they used to believe in somebody or something called Hermes Trismegistus—thrice-great Hermes. Like the Greek god, but no actual relation. I think that’s where you get hermetic from. Don’t quote me.” (He could quote me all he liked. It is.) “But at the end of the day, no one could tell you what that meant or what in God’s name alchemy was supposed to be doing. So if it makes you feel any better, people’s friends’ dads have been pretending to do important things probably since we invented the wheel.”\n His eyes shone. “Yeah. You’re right.” Then dulled: “Well, my dad’s a fucking plumber,” he said to his malt.\n Ah, to be seventeen and queer and bubbling with hate you push down to talk bored Americana, impress a stylish man. I understood and understand; my dad was an electrician.\n The truth is Americans don’t need Masonic structures to summon the devil, and neither do we. I photographed the brown, squatting, friendly-and-dying downtown of Hagerstown, Maryland because it reminded me of an old Irish setter: but, really, because it was a growing hub for a certain sort of tourism. It is a nexus of Confederate losses. From there you can drive to Antietam, Gettysburg. Harpers Ferry, though they don’t speak John Brown’s name there. It’s not heroes that they honor there, nor the sad and desperate and called to God—just resentful memory, the dinner jacket they put on living hate.\n In Vienna I suppose they bother to lie. I photographed Hagerstown because I liked the colors and I fancied myself a spiritualist making daguerreotypes—I’d develop it and the dead would be vindicated. But they aren’t, they’re nowhere; streets are empty, empty, empty. I do not know where the dead go, but the killers are always here.\n We live in a laundered world, May: now more than ever. All you remember is the Blitz, studying basement ceilings and wondering if you were going to die; I, however, have met people in Vienna whose dossiers we’d pore over in rooms in Châteauroux, before we burned the papers and ran once more. People we almost killed. People we would have. I suppose they missed their appointments, didn’t they? I can’t remember my grandmother’s face, but I know who’s lying about what they did in the war. In Austria—most everyone. In Britain, maybe seventy percent of that. I know. I know.\n Soon I won’t have to know anymore. I understand in this world that no one really lays down their arms; all they can hope for is not to pick them up in the first place. That’s too late for me—but I will be the first. I will lay them down at the end of my fight. There is a kingdom I have been to; I have seen the other face of tomorrow, which has only ever revealed itself at day’s end.\n All the old expatriates say that dead old Berlin was something I would have liked, something that will never be seen again. In Britain we make a cottage industry out of the maudlin. But I think the old Germans are telling the truth. That is, I think they believe themselves. Christopher Isherwood is such a hit with that crowd—I feel like I know more German escapees who can quote Goodbye to Berlin in English than can describe their own long gone childhood homes. I don’t think that’s such a bad thing. It’s probably the best thing Isherwood ever did for anyone—giving them something to miss.\n Me, I never saw that Berlin. I’m—was—too young; I only spent six months there, posting negatives back to London, and they pulled me out after the Pogromnacht and sent me to Paris instead. If there was an old Paris to miss, I never saw it either. Salons and cabarets, yes, and all filled with people talking about war.\n You should pay attention to this period when you’re compiling, May. My published work then, when I was twenty to twenty-one, contains all stuff that was purely for its own sake, which one cannot say for anything since. Or, well, for journalism’s sake—for truth’s! For justice’s! (God. To think.)—I suppose that’s also true of my student work, but don’t anthologize my student work, for pity’s sake, it’s pathetic and I think I modeled a St Paul after a lecturer I fancied. But 1938-1939, a year and a half of shining simpleton adult professional photojournalism for you. A relic of Old Leslie. Goodbye to Me.\n Since then I’m afraid it’s all been a cover. That’s what we call a lie, love, in the service: like the stuff of our lives is a bedsheet, or sturdy paper.\n It was in France where the door opened. I sometimes wonder how long they’d been considering me—but what a flattering notion. Of course it couldn’t have been long. To SOE and the Secret Service I was an opportunity in the right place. I understand. I select for the same things now: opportunity.\n She talked to me at a party, and then by the Seine: “Mr. Kincaid,” she turned the handle of her umbrella, bundled tight, in her hands: “You said you want to help.”\n By then, I knew what she meant.\n “The things that are happening in our lifetime have never seen an equal before,” said Geraldine Rinn, as I suppose I must have called her. “If we do not stop them here, they will become inexorable. You’ve no idea what the fascists are doing. You’ve no idea what they’re going to do.”\n Our names have a tendency to flake and slough. Since this is all between you and me, dear, I shall say that her name is Elaine Paxton, or it’s certainly on her passport and half of it on her birth certificate. She’s married to that Paxton, yes, you can have that scandal if you like.\n She’s supposed to know everything about me too.\n “I have an idea,” said I, twenty-one: defensive, like it or I mattered.\n “You do not.” She sniffed—correct, of course, but how did she know the reprimand wouldn’t drive me off? Because this was her job, too. Because someone had talked to her as well, a long time ago. “Mr. Kincaid, I mean no disrespect to your profession. I know you feel called to it. You place a high value on the truth and you hope that its revelation can undo the worst of hypocrisies.”\n Glib, but not wrong. “More or less,” I hedged.\n “Your documentations will not convince anyone who is not already convinced,” said Elaine, Geraldine. “The British and American peoples are accustomed to hardening their hearts and covering their ears. There is no atrocity you can show them. But there is another difference you can make.”\n We should have an image of Birmingham in here. I don’t need to backtrack for that one, because the truth is I didn’t photograph Birmingham until I was an adult returning. The last thing I’d, personally, got into art for was to capture my brown, clamoring little hell-world. I should have. The Blitz tore a lot down—the house where I lived, the school I attended, the hospital where I was born. I’ve never felt much for them, though: just the strangeness in knowing that there was once an interior space, a closet under the staircase, where I’d sit in the dark and listen to Stephen’s voice bellowing as he pounded around looking for me so he could regale me with something, or Mum cursing my lateness to supper—just me, the crashing of people on the stairs, and that treacherous sliver of light, back when I thought the most luscious reward I could want was to be really and truly alone.\n Now sometimes business takes me back. Rarely, also, holidays: yes, I get holidays from Elaine. I spend them in London and Bristol and Birmingham; I meet contacts, sometimes boys and men. Which is to say that casual sex is a useful pretext to establish as a spy—but also, it’s casual sex. Sometimes it’s a fling for a week or so. I don’t mind. If I want to sleep with someone at all I probably want to sleep with him for a week.\n Thus with someone we’ll call Denys: I had a holiday, so this was my own mask I had on, the one called Leslie Kincaid, and I told him how I worked for the BBC and sometimes contracted with the Times. “What great fun,” he said, sly; he was one of those pretty blue-bloods, the ones to whom absolutely nothing’s sexier than some notion of class mobility. Talk contemptuous posh to me, they always seem to be hinting, and put your electrician’s hands all over me. Denys had an earl somewhere on his mother’s side—good God, can I ever resist these? I’ve never fixed a damned radiator. “Why not the Daily Mail? They’ve got a market for pictures. Think of what you’d get to photograph.”\n “Darling,” I flicked ash off my cigarette, all affectations, “I did not embed myself in France during the war to go on to work for the Daily Mail. I would like my biography to show an upward trend.”\n We sat on the steps of a university library, too grown-up and dissolute to be taken for students. Sometimes it’s refreshing to be stared at here and there. He smoked with louche confidence, with sort of an insolent Francophilic attitude. “Well, that’s only if you do something interesting here too, isn’t it?”\n “Goodness, am I still in the audition phase with you?”\n Denys smiled like an imp. His eyes took a merry crease—remembering my roughness with a thrill, I supposed, the urgency I summoned or manufactured for him. You have to understand, I do feel urgency. I feel desire. It’s not the same to me with all people, and it’s certainly not the same to me between men and women. It’s just that almost no one sees it uncovered anymore; with people like Denys I find myself obliging, with the roaring engine banging on the inside of me to get out.\n “Snap one of me,” he said.\n I leaned back, sort of a dignified topple onto the steps. “What, are you commissioning me?”\n “Don’t give me that. Take a picture. I want to see what your work can do for me as a subject.”\n “This is architecturally dull.” I indicated the library. “There’s nothing good in you that university design would bring out.”\n He prodded me with his shoe. “Then pick a place. I didn’t manage to be a barrister—I’d like to be your muse, at least.”\n I don’t know how much I cared for him or didn’t. I only knew him for one holiday. It was my hotel I took him to downtown, and first I set him up in the half-empty lounge in the lobby; “Why don’t you take me to Coombe Abbey or something?” he said, laughing.\n “I’m not photographing Coombe Abbey,” I said. “I’m photographing you.”\n That startled him—I don’t know what was in me, or how I looked. I can only look out. He looked startled, looking up from the lobby sofa, and that I captured.\n There’s my Birmingham shot for you, May. You always said that I should do a portrait series; I maintain it’s a conflict of interest, getting to know subjects and depicting them—so have the one. His name was—not—Denys, and his uncle had an earldom; you can see here the fineness of his carpals and his ulna as he reaches up in that awkward manner to deflect his surprise, next to his face—those beetle brows, so indelicate, his luminous dark eyes. The sofa cushions must have had a bright gold color you can’t see here, but it’s no matter; it was so washed out, and look how insubstantial behind him. His shirt really was that white.\n Of course I photographed him again later, lying on his stomach on the bed with his feet kicked up. You could see the laughter stirring—I nearly sent it to him, actually, two weeks later after I developed it; but those were two cool weeks, I’m no fool. I did destroy that one. Some traces are bloodier, brighter red.\n We conversed on that topic, actually. Here I’ll depart from my posture—\n I was examining my own shoulder, where he’d left a very red mark. He made fun of my squeamishness at first; then he glimpsed the mark, and how red it actually was, and became very shamefaced—“Don’t,” I waved him off (though I was considering how to get rid of it). “I always like to be marked up at the end of things. Think of it as rubedo.”\n “Leslie, let’s dispense with the fiction that I know remotely as many things as you do,” he said. “What in the name of God is ‘rubedo?’”\n I—don’t know why I do these things.\n “Part of the old fancy superstitions,” I said to him, or the ceiling; “I mean before Aleister Crowley and the Golden Dawn, even. The medieval-Renaissance things: transmuting lead to gold, but it was more than that to them. They called it the Great Work—nigredo to albedo. Albedo to citrinitas. Citrinitas—to rubedo. Black to white to yellow to red. What this really meant was darkness to light, light to dawn.”\n The way he looked at me was wider than in the photograph, maybe because of the dark. No light yet to ruin things. No dawn. I could tell that what he was going to say was, maybe, are you all right?\n He was a city person, that one, fonder of the smog and the choke and the side street where people like he and I thrive; I am too. So are you. So is Elaine. So are all those Kincaids I don’t ring at Christmas—my brother who’s remodeled the shop (good for him!), my mother. From the air you would all be little lights in Birmingham and London and Bristol, pinpointed together in that bustling yellow glow. There’s citrinitas if you’re looking for it; you only see it at nighttime, up in an airplane or higher.\n I’m sorry.\n That was stupid, and I was thirty-six. It’s been ten years, however; I seem to have weathered a fair bit of my own stupidity.\n I don’t take so many lovers in these years. I just don’t have the time. I’m busy—fewer of everything, outside of work, outside of you, outside of Elaine, outside of my magnum opus. Fewer things, so theoretically I should be getting less attached. I kid. You know me, I drain the blood out of every little thing.\n Well, no, you don’t. You don’t.\n The best friend I had in school was Sufian—you know him, or knew. We gallery-goers are a small world. He’s gone now: bled dry by madness and misery and the places we live, in and out of hospital. It was always in him; I would have taken it out if I had only known where it lived. No, May, we didn’t fuck, you vulture; it was a beautiful boy with a heart from greener country that he wanted, and I’m hardly that. I hear your imprint is doing another run of his work. The best of us never make it out, do we? Soldiers, spies, civilians. All luminous things are recorded by their hangers-on.\n I’m afraid no one is hanging on to me, though. Not even you—you’re just a woman weary of her job and circles and always getting up and falling back in—no, I’m really hanging on to you. I know I think of you about a hundred times as often as you think of me. That is really the quality for which the Secret Intelligence Service selects.\n Whiten, therefore, the red, and redden the white.\n I’m going to talk about a woman whose name you might, or mightn’t, remember. Please say that you do. I know that it’s a fragile illusion—the notion that while we forget strangers’ sorrow every minute, the things that happen to us make a mark—but humor me, if you will, and connect the name Sylvia Leigh Nancarrow to a headline in 1949.\n I am going to include an image here from the holiday I took to Campania with Sylvia Leigh Nancarrow. The image is not of her. I never took a picture of Sylvia Leigh. Not much of anyone did. The surviving photographs of Sylvia Leigh are juvenile, up to a point, and then they’re blurry: a face in group posters, with a hat, with sunglasses, smiling, moving at the wrong moment, frustratingly imprecise. She’s difficult to pin down, like me.\n 1948, Vienna. 1949, Campania—I’m just putting things in order, I’m just putting things together.\n You probably remember Sylvia Leigh Nancarrow for a headline that crossed your desk at one point, or a series of. I remember Sylvia Leigh because she had the most wonderful fake bad Italian of anyone I’ve known.\n She modeled it for me on the deck of our boat from Greece. “Mi dispiace, ma non parlo bene l’italiano,” rolled off her tongue with the sly false humility of a fluent speaker—then, with a wink and a reversal, “Mee disspiacchi—” like an American trying to order at a posh restaurant.\n I leaped like she’d trod on my tail. “Fuck! I mean, cor blimey, that’s awful,” I said in the insincerest acknowledgement of the family sitting nearish. (The mum glared.) “My absolute stars and garters. How do you do it?”\n “It’s an important trick,” said Sylvia Leigh with that cigarette holder of hers. “Certainly more so than sarcastic surprise.”\n “My word, you couldn’t be implying that I am anything less than charming at all times.”\n “You ought to make your Italian a little less than perfect,” she said, unflapped; “in that way people always think they’re getting one over on you. Surely you were always doing that in France.”\n Being partnered with Sylvia Leigh was like studying with a star classmate; she had the most obnoxious standards, and the worst part was that she absolutely met all of them. “Naturally,” I said. “Well, bully for me, then—as a matter of fact, my Italian is imperfect.”\n “No, that’s just not being very good with Italian.” Sylvia Leigh had the right of it, of course. “You need to drop it a notch by design. Let’s try this.”\n She could do this with any language she spoke, which amounted to English, Italian, French, and German. Neither of us spoke Russian; we had a joke between us that we had been demoted to the non-Russian-speaking division, which was not all joke, considering the business of our trade. Our real shining stars, whoever they were, were off infiltrating the USSR and passing themselves off as comrades to comrades.\n In communiqué, I was Bullfinch; she was Jocasta. (I always thought these would have been more secure if they’d given us misleading sexes—not that a bullfinch is a specific sex, I suppose. But to think. I could have been Jocasta! I could have been Medea.)\n We were playing casual lovers; we were playing ourselves, our journalistic selves, on sort of a busman’s holiday to Naples where she was going to write about a local fertility festival, one of those pagan holdouts, and I was theoretically going to photograph it, but really we were going to eat and drink and cavort in the Italian spring like God and Stravinsky intended. But really, we were supposed to intercept and hold a crooked American arms dealer long enough for some friends in the carabinieri to transport him. Simple and crude—no miracle tranquilizer darts, we were just going to get him drunk.\n By crooked I mean in bed with the Russians, here. Otherwise no one would have any quarrel with what he was doing.\n He wasn’t due for a day or two, though, and we did eat and cavort, sort of. We ate, anyway, and drank a little: we established our cover, dancing, kissing, me boorishly fumbling at her skirt in the hotel bar until she raced away to see the bazaar with a gay spirit.\n She was impressed with Naples. The chemistry with me was all that she had to feign. I don’t think she understood me very well there. Sylvia Leigh was one of those who thought restrictions in lovers were sort of a petit bourgeois affectation: she took men and women for recreation, if they were any fun, and was a little annoyed that she had to pretend to stick with me here.\n We put on an Ellington record, danced and laughed, rolled around in the sheets and took off our clothes in case housekeeping came in; it was like that, with her putting her bare legs up on the headboard like she was sitting, dimensionally, on the wall, that she said: “Is it a problem for you? Being with women? Because you have to do it, too, don’t you? I mean, really, not just this.”\n It was a brazen question. I didn’t really mind; “Not exactly. This would be an unwise use of my time if I couldn’t abide sex with people I don’t like.”\n “How is it different?”\n Sex is more or less the same with all people if it goes decently, I was about to formulate, but if you’re not interested in women, then it just doesn’t make you happy, there isn’t a connection. But I couldn’t go further—I would hang myself with my own standard, if put that way.\n I’d leaned on my remembered self, of course. I still do. But he never says anything back to me.\n “It’s more difficult to choke on a woman.”\n “Leslie!” She laughed, the first full-throated snort I got out of her. “I thought you were meant to be dashing.”\n The next day we went to see the festival, as Mr. Piers Wegmann of San Diego, California presumably motored into town on a boat a few miles away. It was all evil-eye charms and maypoles and shadows of Priapus, which was very thematic, really—I had to squire Sylvia Leigh about to fend off the ruder young men with my tan forearms, or possibly wallet. There was a point at which she unlinked arms with me, though, to go and converse with a group of maypole girls with ribbons in their hair and all over their arms; I’ve a suspicion she wanted a ribbon for herself. I would’ve. Anyway, I supposed she knew whether she could take care of herself, and when she was out of sight I fiddled with my camera and I took a shot: a different maypole, in the first stages of being taken down, ribbons torn away. Girls chatting amongst themselves, with their friends and boyfriends. No Sylvia Leigh in sight, no Sylvia Leigh anywhere. Gone, and no one looking at her in-frame either—like a pond when the ripples ceased.\n She came back. We got some ice cream and went down again. We split up and I, independently, confirmed Mr. Wegmann’s check-in at our hotel with a few duplicitous conversations—then we reconvened, in our room, as she shook down her hair and put on her evening dress: purple, almost Tyrian purple, with a plunging back. I told her half of what I’d learned and said I would confirm his identity; that she should come to the hotel bar in one hour and I would let her know what I knew.\n And then I went out and met Piers Wegmann, passing myself off as a Russian contact. No, I don’t speak the language. But neither did Mr. Wegmann, and I’d learned from Sylvia Leigh about bad accents.\n I had to kill him very quietly, in the Neapolitan dry-docks. Quiet killing is very brutal, more so if it’s bare-handed: Mr. Wegmann was not small, but I was much stronger and I crushed his windpipe before I snapped his neck, and put his body in with Asia-bound freight. Then I went home and met Sylvia Leigh in her Tyrian purple dress and told her I’d identified him—and the following morning, I left her at a restaurant and went, American, to meet his Russian contacts as Mr. Piers Wegmann, whom they’d never met.\n We formed a cordial relationship. I had an additional piece for barter—a British agent, Sylvia Leigh Nancarrow, working with the Americans. “I’m sure she would have a great deal to say,” I said, twisting the corner of a napkin between my fingers; “given the opportunity to defect.”\n I think she did “defect,” Sylvia Leigh—that is, I think they let her resettle in Moscow. I do not really know. My government does not look kindly upon her. But the headline I suggested, WRITER SYLVIA LEIGH NANCARROW MISSING AFTER NEAPOLITAN HOLIDAY, is more gentle.\n It wasn’t the Tyrian purple she was wearing the last time I saw her, it was something else. After it was done I went on down to the waterfront—not the docks where I murdered Wegmann, but a seawall where I could see the shore. Do you know that I’d expected an angel to swoop down with a ram, at any moment?\n It doesn’t matter. I laid my soul bare and open in Naples, May, in 1949. First I was called, and I answered; then I was tested, and I endured. That I don’t regret. I’m not sorry to Sylvia Leigh—the business I am in was always called sacrifice.\n Now I feel the warmth of a promise and I understand what I could not understand before. I have seen what I never thought I’d see; I have seen certainty.\n But I would like you to include the shot of the festival. The revels are coming to a close. To this day I don’t know what Sylvia Leigh was doing then, in those minutes to herself. I’ve no way of finding out. I like to imagine the girls have forgotten: they’d be women now, and perhaps one of them has finally thrown out her ribbons.\n I said earlier that what unites us in the service is the desire to confess. I still stand by that. I’ll add, though, that what we have even more vastly in common—man-to-man and woman-to-woman—is the compulsion to lie.\n It makes sense. You can’t really have the first without the second.\n I was making it sound like the SIS and the CIA and the KGB are all three-letter factories for memoirs, which I really do think they would have ended up being someday—embellished memoirs, first, and then eventually embarrassing exposés once no one cares for their honor anymore. I think that’s how national legends die. First in glory, then in tell-all bloody truth, then in far more banal and stupid truth. It’s certainly happening to our imperial project. Maybe someday if we’d let history run some version of its course, all the cabinets would open and all the idiotic, incompetent secrets of our leaders would come tumbling out into the light—Nelson with his pants down next to Churchill and Pitt the Younger, and all the rest of us bloody well free.\n You may see, though, that in fact I am the only person committed to time’s course.\n In any case—do you know what the Secret Intelligence Service is, however? It’s a goddamned double agent factory. You’ve probably surmised that I am one, so you would think I’m in no position to criticize; but May, darling, you know I am always in a position to criticize, so let me say that the agents of Her Majesty the Queen are always defecting for the stupidest and pettiest reasons. Sometimes it is because they have become Communists, which is stupid, but not petty; sometimes it is because they believe they have a better offer from the KGB, which is both stupid and petty and requires believing the KGB has anything to offer in the way of quality of life, or that there is even a better life on offer which doesn’t require asking the Almighty to amend history so that you never got involved with spying in the first place. There are no good lives here, May, no up-trading whatsoever, which is why I believe most of these nincompoops do it because they’re bored.\n Elaine said as much, actually—in fact, she said as much when I was twenty-three, in the third year of the war. I try to think back on Elaine Paxton at that time (I believe it had just occurred to me, bright lad, that her name was probably not Geraldine) because I want to remember how she looked, how she was different; the truth is, it’s difficult. It is just too continuous. I’ve seen her too many times.\n I wonder if her hair was silver. It can’t have been silver all this time, but I can’t remember it any other color.\n “The paradox of intelligence work, Leslie,” she said to me once in a car when we were reviewing a potential target—a Belgian office for munitions research—“is that everyone predisposed to be duplicitous, be creatively dramatic, have a rapid change of heart and come drastically over to your side, is that they are also predisposed to do all those things when you don’t want them to. There’s nothing worse than well-suited spies. I wish we could affix them in place with glue.”\n I must’ve been in no mood for wit: “Are you concerned I’ll go over to the other side, ma’am?”\n “You? No, you aren’t a Nazi. You’re no monster. That’s why we approached you.”\n It was hard for me to conceive of the point of this abstract discussion. I remember what was going by outside the window: a dirt road alongside our paved one, where rural women worked and endeavored not to look up. “Isn’t this a bit immaterial, then?”\n Elaine always sits with composure in cars, like she doesn’t notice that they are moving. I used to think that this was a skill, but lately I believe it’s just that she’s short. “I mean after all of this. These are fairly dire circumstances, and we’ve recruited rather than hired or been approached—that’s selected for people of some integrity. But it will be very different after.”\n I must have looked at her, though I don’t recall what I saw. I either said or thought, with bitter disbelief: you’re assuming there’s going to be an after?\n But honestly, I do believe she affixed me quite thoroughly for some time, or at least rid me of any double agent tendencies. Maybe it was that she’d approached me, rather than been approached: they tell that to children in case they become lost, you know—talk to the adults you choose, not who try to help you. In fact, I never became a Communist, received a better offer, fell in love with a beautiful Russian, became resentful, or grew bored. By that score, Elaine Paxton, Morrigan, did Queen and country right by recruiting Leslie Kincaid, Bullfinch. He served them gladly and well.\n I said before also that we all like to be chosen. I’ve had the fortune of being chosen twice, and it’s the second that I imagine you are finding more relevant and more concerning—but let’s assign credit where it’s due. The first person to select me, inexorably, to save the world was Elaine Paxton nee Goddard. The last dreadnought in commission. They should give her a knighthood. They should have called her Gawain or Lancelot—or Bedivere. Loyal, incorruptible, changeless. I do not know how many years of service she’s had to witness these betrayals in, but I know, unshakably, that none of them were hers. I think a part of me hoped that one would be—I know I hoped her mask would be one to lift, on the other side of things, on my way back to my appointment in Vienna. But she—in relief, in sorrow—is exactly what she appears to be: I want to imagine that she’d have been by the young Queen’s deathbed someday, advising some last heartless course of jingoism. I can’t really imagine an England without her.\n And really, I think that’s her undoing—imagination. Elaine’s no fool. But whatever she’s suspected of me, I don’t think she has ever been able to imagine the truth, or that her heart is big enough to contain everything I’ve been given to carry. I think she lacks a certain capacity for belief.\n One more Elaine anecdote—the year after that, I hadn’t seen her in a while, wondered if I ever would again. She seemed too important to concern herself with me. (I am her steadiest agent, her protegé. Her most constant star.) I was under-supported and had to leave someone behind; then I tried to liaison and found my Resistance cell had melted like candle wax, off to Dachau and Ravensbrück. I was sick with fear and waited for them to come for me too. I had nowhere to go, and knew running would incriminate me. Mostly I sketched my landlord’s dog—I tried watercolors but something was off with me, I was unsteady and my washes too dark.\n Every day I had alive was a day that the dead and dying had not betrayed me. I think about that sometimes, when I like to repeat fatuous truisms about spies and liars. I think of Luc and Noemie Boissel and five other people I’d barely known.\n “I want an L-pill,” I said to Elaine when she finally came for me.\n She’d come with a driver and a “husband”—lumpy men in overcoats. It was, at least, reassuring. “Those are less useful than you would think,” she said, in the middle of her last check of my lodgings.\n “The Boissels never turned on me. I don’t want to turn on anyone either.”\n “Very well,” she said, and in the car she gave me a tin: I didn’t think to be startled that she had one on her. “But no one is going to put it inside of your tooth. Pretend it’s a mint. Not too well.”\n I dedicate this book, Appointment in Vienna, to Elaine Goddard Paxton, upon whom the sun never sets.\n I dedicate my Great Work, the Magnum Opus, to Luc and Noemie Boissel. It will make no difference to them, decades too late. They’re beyond the reach of the dawn; I do not think I could even sketch them from memory. I didn’t commit their faces to it at the time. I’d thought I would have more opportunities.\n Maugham’s unfortunate fellow sees Death in Baghdad and hastens to Samarra to meet him. Death is no less nonplussed—I was astonished to see him in Baghdad, he says, for I had an appointment with him tonight in Samarra.\n Death clears his throat. Death touches him on the shoulder. Death checks his calendar, conscious of ever-hurrying onward himself; Death’s time is boundless, yet pressed somehow into an infinite number of urgent shapes. Where is Death going? Only to meet destiny in every place himself. Can he call it his own destiny, too? In Samarra he makes it just in time to see the startled face of the man running from him; in the marketplace he passes his hand through his shoulder. The man understands, suddenly. He turns back to the road. He must go back to traveling, or he too will be late.\n Grytviken is a whaling station in the Sandwich Islands near the Antarctic. It’s one of the southernmost places a person can visit, and in 1950 I pitched it to National Geographic magazine in Washington DC as the substance of a profile. So I traveled there as cargo on a queasy whaler to explore the research station and photograph the Aurora Australis, and make a rendezvous.\n I am including these pictures because I believe they are my most arresting work that I did not destroy. Like many beautiful photographs, they were somewhat a matter of being in the correct place, and largely of choosing the correct film and exposure.\n Look at the green tracks of the valkyries, May. Imagine the darkroom I made of the lavatory where I was staying, where I labored and the Norwegians looked at me with pitying eyes.\n In Vienna fourteen months before, I’d snapped a much more impulsive photograph. The lights at the opera were no less dizzy. I could’ve believed them the work of the gods too. That was the work of a different man: one without direction. Here’s the trouble with photography—it’s still. You don’t see what goes into setting it up, it’s true, but you’re also tricked into believing that it’s unobtrusive, that nothing happens after you capture the image and disturb the universe.\n A gentleman was about to speak to me at the opera. I knew he was there, but I was paying him no mind until he touched my elbow. So forward!—I thought, amused, silly and vain—and I addressed him.\n We spoke outside on the tiled veranda. “Do you have an interest in the future, Leslie?” he said.\n “Does it matter?” He’d brought me to candor—I was studying his face. “It’ll be realized whether or not I take an interest, does it not? One way or another.”\n “Not precisely. Time passes, whether or not you take an interest.” He took my hand like an earnest suitor, mulling over his own words; I didn’t think to prevent him. “But a future has to have witnesses in order to experience it. It doesn’t meaningfully exist without human eyes. This time will pass away, that’s true, with or without intervention. But there’s no guarantee that another will come.”\n I must not have been fully serious. Fully comprehending—“Are we talking about the Age of the Atom? If so, between you and me and whoever’s listening, I will say that I don’t think the bomb will put an end to future time. To America and the Soviets and you and me, possibly, and quality of life as we know it. But there are so damned many of us running around.” Was I holding a glass? Champagne or rosé? How did I gesture, in my throes? “Mankind, I mean. Humans. There will always be somebody around to have a miserable time of it. Well, maybe not always. But it’ll be a while.”\n I suppose here I was expecting some doomsday notions, or whatever the Russians—it had to be the Russians—had dreamed up and sent me—\n He leaned in, fearless as a partner in a waltz. He wasn’t wrong: no one was looking at us.\n “I’m not talking about bombs,” he said. “I mean better lives. I mean a better world for people to live. Aren’t you weary, Leslie, of spending your time trying to fight the horror? Has it ever worked?”\n Ah, I wish I could record a startled and reverent silence here. Unfortunately, I always had something then. “You are getting damned seductive over in the KGB,” is what I said.\n “The Communist experiment has always been reliant on educating virtue into human character,” said he, pushing his fingers through the spaces in mine: it felt idle, somehow, a courteous afterthought. Just partnering me for one dance. “The American one, too. Leslie, you can’t possibly imagine I would try to evangelize you on the premise that people, at large, will change? For the better, no less?”\n After I finished my nighttime photography in Grytviken, I packed up my tripod and went to develop the film. I like my time in the darkroom. I put on a record, this time, to drown out the Vera Lynn from the downstairs—I can’t abide Vera Lynn, can’t hear her promises without being wrung out like a rag. Two kinds of veterans, I suppose. I put on The Andrews Sisters. Then after that, I went out after midnight to sit on the hill—it’s mostly hill, in Grytviken. The southern lights are better with your own two eyes; some things are.\n He sat next to me. The cap he wore reminded me that he had to wear a costume, like the rest of us: I had fanciful thoughts, then, imagining him impersonating a whaler. Working one of those iron ships. (Nothing so daring. He was a scientist and had attained a research post, I learned: his name was public record. And I mean he was a scientist—that was his post. He’s not like us. If anything he has to come up to the surface to be seen.)\n “I went to Kraków,” I said. “I murdered Sylvia Leigh. Or as good as.”\n “I saw what you published. It’s a beautiful shot, the children. What did you find there?”\n “Rubble.” It must have been cold. “And swarming greed. And revision—already. It isn’t going to get better, just after knocking everything down.”\n “Not without intervention,” he agreed, quietly.\n We sat. The green tinged the water, and the hair on my arms between jumper and glove.\n “I hope you aren’t delusional,” I said.\n He smiled; I could hear the remnant in his voice after he waited to reply. “If you were me, Leslie, what would you want before I granted you the revelation? Or think of it this way: what have you left to ask from me?”\n The rocks were rough underneath us. After all this time I don’t think I’ve gotten any thicker-skinned.\n “An L-pill.” I think I pushed the question out of my voice—not an L-Pill?, hopeful, to the schoolmaster.\n He patted me between the shoulders. This time it was avuncular.\n “I don’t need you to die,” he said.\n “I don’t care if I do.”\n “I know.” He put his hand over my hand. “When we sacrifice, we make no offering to ourselves. And we make no offering to God, either. Everything we do, we do for the living. I know you.”\n Everyone likes to be chosen, or should. In truth I felt silly—all my pretenses gone. The end of a play-chase, and no idea why I’d been running. “You must remain alive to do everything you need to do,” he said. “What I need from you is your loyalty. More than an oath. You will never betray me in word or deed. It is not a command—it is a description.” His voice was close, his tone remote. “I will not force you to take it. But know that I can settle for nothing less in you.”\n I don’t know if it was a kindness, that he brought me to a beautiful and strange place to do this to me—the exact sort of place an artist would like to be transformed. Or perhaps I flatter myself. Or perhaps I do the hand of fate a disservice, bringing Death and the traveler together on their obverse errands. He took my arm and led me to the water, where the world of lights was reflected. I know it was no choice. I know he did not force me. I know, May, that we were each on our course, and he was gifted to know where I would walk.\n So there you have it, May. I lead a matryoshka life: an artist and journalist on the shell, within him a spy, and within him, something else entirely. But to be honest—to—be—honest—there are some times when I think the shell must have been the real one. Not something painted on, but something hollowed out. If nothing else, he takes the least thought. When I spent time with you and Ned (is he really gone? How is it always something like pneumonia, or flu?) and our smart set, our boys and girls and nellies and sympathizers and manic-depressives of the galleries and the papers, I never had to think of how. I felt so heavy with habit. I was comfortable.\n I think in another time, I would have reviewed film—set myself to thinking about what Ingmar Bergman was doing, always with the vague dissatisfaction that I had a work within me too that, next year, I would realize.\n Well, it turns out that I do, don’t I?\n I . . . I was always late to the “salons” you hosted. Fashionably. You know, those glorified parties—I hear Astrid’s were glorified orgies, but not of the sort I’d like. Your salons, there were always thirteen or fourteen of you arrayed on chairs or cushions, depending which venue you’d acquired, and you sat smoking with drinks in your hands, all facing one another. There was always a cloud of smoke and some light through it, which flattered everyone’s hair and jewelry. Together you toasted your health as you depleted it, and damned the bastards and the philistines: to next year, next year in Jerusalem where there’d be funding for more than just propaganda and BBC hagiography, next year where they produced the films of brilliant women, next year, next year, next year where we made it, every single one. I would linger to listen to your toasts and Sarah’s and Art’s and Erich’s when he mimicked you.\n You’d see me shortly—Leslie! Are you ever punctual?—but there’s some added-up time of me in doorways, waiting for you to notice. I wonder if there’s anything you’ve ever waited for me to notice. Did I?\n Next year, May. I can promise you next year. Maybe not for us. But I come bearing next year: where we make it, every single one.\n I’ve wondered often—is the oath I took real? Is it binding? I have seen stranger wonders since—and we have stranger ones yet in store, when we take what we must from this world and burn it in that offering to the living. On the first Armistice Day they had the ludicrous idea of a War to End All Wars. Call this the sacrifice to end all sacrifices. I’ve seen the spheres that move above us and below; I know we exist on a fragile plane of a shape of catastrophic complexity. Believe me, May, I have learned not to be arrogant and skeptical. Skepticism is an easy refuge. It is more often true than not, which almost seems like “true.” You will see things you cannot imagine—there is no avoiding that, really. That’s just the advance of time.\n But the oath is the thing I doubt. The reason I doubt it is that I’ve never had reason to test it. I have never tried to betray the Great Work. I have never opened my mouth with the aim of telling anyone the truth of what I do. Perhaps that’s evidence of the oath, or evidence that it never needed to exist. That is why I am interested in our book, May, in Appointment in Vienna—because whatever I say or don’t say here, I have no control over it. It would not exist, and if it did, I’d have no hand in its making.\n I believe that is the only course left to me, in the way of confession.\n In closing, I have no editorial advisement on the contents of the text, for the most part. One thing I would like for you to include at some point—I’m not choosy about where—is a reproduction of one of my sketches. This is a retrospective of my photography, yes, I do know, but I think you would be remiss not to acknowledge that I was a representational visual artist as well, don’t you think? I’ve chosen a self-portrait in charcoal from my time at university when I was terribly young, before any design had me in it apart from my own.\n You can see it is my work because I have rendered myself a little unattractive. I’ll have you know I was a handsome boy, but somehow false humility had already got under my skin and I’d thought I should be a little ironic. Well, there you have it—turned three-quarters, crosshatched, with the slightest devilish smile on my crudely formed lips. The joke is all on me: there’s no one left to see the irony, no applause for the deprecation. My voice, eighteen, is gone. You can attach it to the biographical material.\n Gabriel Murray is a writer, teacher, and interactive fiction hobbyist originally from Portland, Oregon who has lived in just six U.S. states but under about twenty-one different roofs, give or take a shingle. His stories and articles have appeared in Strange Horizons, GlitterShip, Daily Science Fiction, and elsewhere. His favorite forms are the novel and the Inform parser text game, due to his affection for maddening and drawn-out labor."}